[{"id": "cbc53c65fcc4b91ff9b9edc86e2e366ea8083794", "text": "THE MURDER AT ROYDON-HALL.\n\nAPPREHENSION OF THE SUSPECTED PARTIES.\n\nOn Monday afternoon, eight men, suspected of being the parties concerned in the murder of James Gray, keeper on the estate of W. Cook, Esq., of Roydon-hall, East Peckham, were taken before the magistrates at Town Malling. The men gave the names of Robert Waller (Waterlingbury), John Elliott (of Brighton, a pensioner), and John Honey, Thomas Fowler, William Hammond, Robert Sampson, George Honey, and Thomas Honey, of Mereworth and Nettlested respectively, and they were apprehended on the charge of night poaching on lands belonging to Mr. William Cook, of Roydon hall, and with the willful murder of James Gray, head-keeper of that gentleman.\n\nCaptain Ruxton, chief constable of the Kent county constabulary, offered no evidence against the first-named two prisoners, who had been apprehended simply because they had broken heads. Elliott had stated to the constables that he was at the affray, and that he did not care what they did to him. They were consequently discharged.\n\nCaptain Ruxton, on applying for the remand of the other prisoners, said he had a strong chain of circumstantial evidence which he did not think it right to go into upon that occasion. He should merely tender such evidence as might be deemed necessary for the granting of a remand.\n\nThe under-keeper, George Sexton, (who was close to the head keeper during the affray), swore that to the best of his belief John Honey was the person who shot the keeper; that Sampson knocked him (Sexton) down, and that George Honey, Thomas Honey, and Thomas Fowler were present and taking part in the affray. The evidence against Hammond was that some six months since he uttered threats against deceased, and that upon his house being searched a jacket with spots of blood upon it, an old gun, a barrel of a gun, some powder, and a shot bag, together with a portion of a newspaper, containing part of a report of the death and last moments of the late prince consort; a singular coincidence being that the wadding of a gun was found near the spot where Gray fell, which also was a piece of a newspaper containing part of a similar report.\n\nThey were all remanded for a week. Hammond was admitted to bail on his own recognisances. In the other cases bail was refused.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206213274.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 548, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2299, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]