[{"id": "8cc258ef6992b30b4c2ed2d0b43d65d96ba50ee7", "text": "SUSPECTED MURDER IN GLASGOW.\n\nThe North British Mail of Thursday says:—\n'Scarcely has the excitement caused by the \"Motherwell mystery\" had time to subside, when we are startled by another case, equally mysterious, and in some points closely resembling the \"mysterious occurrence at Motherwell.\" A man, named James McCaffery, a furnaceman, in the employment of Messrs. Merry and Cunningham, at Cairnbroe, disappeared on the morning of Sabbath last, and has not been heard of. The facts of the case, so far as we have been able to gather them, are as follows:—On Saturday night last, McCaffery was in Airdrie, along with his brother, John McCaffery, and other two men, named respectively John Mulholland and William McCrotty. They had been in one or two public-houses, and at a late hour they left the town to go home. The brother states that, instead of going direct home, they went round by Whifflet, and went to a public-house there, where they had \"half a mutchkin.\" He and his (now missing) brother then left to go home. When they were near the bridge which crossed the Caledonian railway at Whifflet, he heard two men coming running after them (not those with whom they had been in company previously), and who, on coming up to where they were, began to quarrel with his brother. James McCaffery then ran away, and the two men followed him towards Greenend and across the bridge over the Calder branch of the Monklands canal. In a short time, one of the men returned, and addressing John McCaffery, said with an oath, \"If you were not such an old man, I would give you as much,\" or words to that effect, and then passed on; and John McCaffery, who seems to have been pretty much under the influence of drink at the time, also went on homewards. A woman, who lives at the Old Store, Calder, just immediately beside the bridge which crosses the canal before referred to, says that about one or two o'clock on the Sabbath morning she heard a noise of men quarrelling and fighting, and that she heard some one say, \"I'll have your life before you to Cairnbroe;\" and she also heard cries of \"Murder!\" Since the occurrence diligent inquiries have been made by the police of the missing man's relatives both here and in Glasgow and elsewhere, but no trace of him has been found. The canal has also been dragged by the police, under the superintendence of Captain Clark and John McDonald, Esq., procurator-fiscal; but although it is stated that the missing man's bonnet has been found on the canal bank, near to Suicide-bridge, nearly a mile distant from the place where the quarrel commenced, up to the time we write the body has not been discovered. Those who lived beside McCaffery state that he and his wife sometimes quarrelled, and that he was in the habit of leaving her for a short time, but this statement is stoutly denied by the woman herself. John McCaffery states that the two men who ran after his brother were not personally known to him, and they are still at large. The whole affair is shrouded in a mystery which, judging from present appearances, will not be easily solved.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206212402.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 747, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3090, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]