[{"id": "9d3ad337b129e2ab6306cbdb1648ec38f3a779da", "text": "THE PROTECTION OF HOMING PIGEONS.\n\nAt the Croydon Borough Police-court, Charles Smith, of Mitcham-road, Croydon, was summoned at the instance of the secretary of the South Croydon Homing Society for unlawfully and maliciously maiming and wounding a homing pigeon, valued at 10s. Mr. Hood appeared in support of the proceedings, which, he said, were taken in the public interest. On the day in question a flight of pigeons was passing over the Mitcham-road on a journey, when the defendant deliberately fired a gun and brought one of the birds down. It was found to have been shot in both wings, and on the following day it had to be killed. The owner of the bird spoke to Smith, who at once expressed his sorrow, and compensated him by giving the man five shillings. In consequence of the great slaughter of homing pigeons which was constantly going on, however, the society for the protection of its members' birds felt compelled to bring the defendant before the Court. A number of witnesses were examined, including Mr. Charles Spurway, president of the London Columbarian Society, one of the largest societies in England, who stated that a very great deal of labour and expense were incurred in the training of homing pigeons; indeed, it was almost a science, and his society spent hundreds of pounds a year for training purposes. Thomas Holly, the owner of the bird, gave evidence with great reluctance, and created much amusement by assessing its value at 9d., and saying that his \"missus\" had, it for breakfast the morning after it was killed. For the defence, Mr. Dennis said that his client was in a wheat-field, scaring birds, and, aiming at a number of sparrows, accidentally hit the pigeon. The Bench came to the conclusion that there was no malicious intent on the part of the defendant, and dismissed the summons; the society paying 4s. 6d. costs.\n\nFEARFUL DEATH ON A WELSH MOUNTAIN.—An inquest was held at Llidiart, Yspitty, North Wales, on the body of William Jones, a Tremadoc tradesman. Monday night was wet and stormy, and Mr. Jones left with Mr. Williams, a farmer, and his two nephews, in order to accompany them up to their mountain home. They ascended together till they were about five hundred yards above the waterfall, where Jones wished the party \"Good night\" in order to return. As he did not reach his home a search was made for him next day, and his body was found at the bottom of the waterfall, his head being jammed between two stones. It was evident that in the dark he had either fallen or been blown over the precipice on to the rocks below. His head was fearfully injured, and death must have been instantaneous. Verdict, accidental death.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810766.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 642, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2676, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]