[{"id": "c28f798ec865937552212d9253edbd9f206dc83c", "text": "EARL SRAFTESBURY ON EDUCATION.\n\nThe question now was, to be or not to be a Christian people; to be a people governed by the Word of God, or a people governed by their own devices; to be a people with corrected hearts, or a people with hearts given up to the pursuits of the world and the influences of Satan; to be or not to be a truly Protestant people. True Protestantism did not consist in merely declaiming against Popery and protesting against the advances of Ritualism and Jesuitry; it consisted in taking the Bible as the sole rule of faith and as the sole guide of life; as the beginning and end and the middle of all things, and as being directly opposed to the Secularist and the Infidel. If Christianity is to be maintained in these realms, it must be by the hearty co-operation of all believers, of whatsoever denomination they might be. He saw in this fact a providential manifestation that they should have a Christianity more energetic, more lively, more pure, when feeling the dangers to which it was exposed, they turned to the right and to the left for help, and said \"God speed,\" and gave hearty co-operation to any one who loved the Lord Jesus Christ in sincerity. Therefore, he viewed the matter of education with grief, and with somewhat of alarm, whom he saw so many of the Nonconformists—men in whom he had hitherto reposed confidence, and for whom he entertained sentiments of respect and admiration—join with the Secularists for the desperate and unholy purpose of excluding from our schools the Word of the living God. If religion, that deep internal control which brought the conviction of the oversight of an ever-seeing God, and the deep and solemn assurance that there was something beyond this world which would compensate for the miseries and sufferings of life, were necessary for those whom God had blessed with station and affluence, how much more was it necessary for these little children of suffering and toil, many of whom, from their birthday to their death, scarcely ever heard a word of comfort, of respect, and he might almost say of affection? These were the children who had to be dealt with; and although he stood as stiffly as any upon the necessity of giving secular education to all classes of society, such education as would qualify children to obtain an honest livelihood in all departments of life, he said emphatically that religion, the Word of the living God, must be the basis upon which to stand; and from which must flow those fountains of life and joy which must permeate society until every child could say \"prayers and hymns in babbling brooks, sermons in stones, and God in everything.\"\n\nContributions or stamps are much needed to pay the expenses of inserting in a large number of London, provincial, Scotch, Welsh, and Irish newspapers (which are supposed to have three million readers weekly), and will be thankfully received by the Rev. J. W. Carter (vicar of Christchurch, Stratford, 7. Avenue-road, Bow, London).", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206320267.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1522, "total-output-tokens": 663, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2982, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]