[{"id": "15fd64615b9883ca0e39508052a194f8d8daf193", "text": "A PLUMSTEAD ROMANCE.\n\nAt the Woolwich Police-court, on Saturday, Mrs. Slade, wife of the landlord of the Rose Inn, Plumstead, attended before the presiding magistrate to ask his assistance in endeavouring to recover her daughter, Mary Ann (known as Polly), who disappeared from home nine days ago, and who had not since been traced. She stated that her daughter, who would be sixteen next September, had formed an attachment for the barman, Christian Terryson Hopper, twenty-five years of age. Applicant said her husband disapproved of it, and the barman was discharged, shortly after which the girl disappeared at seven o'clock one morning. A day or two afterwards they received the following letter from her:—“Dear mother; don’t worry about me. I am happy and in a good house. I am much happier than when I was at home, for I don’t get a cross word said to me. I could not put up with—any longer, for he nearly drove me mad. I would not leave this situation for £4 a week, for I am very happy and I know the place is all right. I may come home to see you in a little time, but pray don’t worry. You will be surprised when you see me home again after a little time. Give my love to the boys (her brothers). If am as happy as a queen. I would rather be here than anywhere else. When I come home I don’t want to see—only you, dear mother. I am very happy. Don’t think I am raking the streets, for I am far from that. This is all I have to say at present. Your ever loving daughter, P. SLADE.” The letter bore the London post mark, and no address was given. The name, left blank, does not refer to the barman. The missing girl is entitled, under her grandfather’s will, to property worth £2,630, besides £200 ready money in the Woolwich Equitable Building Society. Inquiries show that no attempt has been made to draw any of the latter sum out, and so far as is known she left without money. Another letter has been received by Hopper promising to send him her address when she gets settled, and sending her love and kisses. Bills were issued offering £5 reward for information of her whereabouts, and this sum is now increased to £20. Hopper’s father is a foreman in the Royal Arsenal. His son, Christian, first went to the Rose Inn as potman, but was subsequently made barman. The family state that Polly’s parents knew they were attached to each other, and that they all went together to the London theatres. He bought her an engagement ring, which she wore about the house. They are also said to have known that the young people went about and were photographed together, and that for some months they offered no objection to the courtship. A month ago the parents heard some false reports about Hopper, who became ill and went home. Polly took him wine jelly, and other delicacies from her home, and with her parents’ permission. One day he found a letter in the basket stating that his employer did not require his services any longer. The letter caused Hopper and the girl great distress. A suggestion was made to her parents that the engagement should be broken off for a year, and that if at the end of that time he could become manager of a good house and in a better position, the acquaintance should be renewed, but this was not listened to, and she ran away.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811428.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 773, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3269, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]