[{"id": "9d302c8ee9c90adae2259032c91d0217a5b21df9", "text": "A SAD CASE OF LUNACY.—George Dalmatian, a man of seventy-five, having the manners and appearance of a gentleman, despite his very heavy dress, was arrested at the Mansion-house, in the East End, Middlesex, while charged with assaulting Charles Brock, of No. 87, Fenchurch-street, and threatening to stab him with a carving-knife. The complaintant said that he had been in a drunken bar and called for a glass of ale, which he drank and paid for. He helped himself to some bread and cheese as the witness's house was known to be a place for another meal, for which he was paid. Taking off clothes, he went to the further end of the counter, and, raising up a carving-knife which lay there, threatened to stab the witness. He then smote a blow at him with the knife, but a gentleman who came in at the moment prevented the prisoner from doing so. He was taken into custody by the police and placed in the prisonery. On being asked to account for the wound, he said that a man at the police-station, thinking he (the prisoner) was fit to strike him, had struck him with a knife. On being asked to account for the wound, he said that a man at the police-station, thinking he (the prisoner) was fit to strike him, had struck him with a knife. The hole, he added, into which he was put at the station was foul almost beyond endurance.\n\nHe had lived with Turkey and friends for three years, that is, in the place where he had spent the last two nights; it was really a disgrace to the country. He was very subject to fits and hoped the case would be investigated. He had been known to many officers and gentlemen. He was reminded by the court that he had given an address in Deptford, and was asked to write down his place of residence, which he did. Remonstrances were made to him for not being able to remember the name of his landlord, as one of his fits was coming on him then. The address he had given would find him out, for he was always telling them that he had been there. He said, when he thought of the matter. He came up to town on Saturday, as he had not a penny to pay for a broken window, who gave some money to him to go to the police-station. He had not remembered until his half-penny was due. He could not remember anything wrong he had done. The complaintant, as he had heard, asked him to apologize for trifling with his honour. He had nothing to say about anything to his wife, and he was not in the habit of apologising when he had committed no offence. On being asked what he thought of if any suit should be brought against him, he said, with a laugh, that he was not trifling with his honour. \"I am my own doctor; I have had my brains knocked out once.\"—The prisoner, who was evidently deranged, was about to take some violent measures, and the court gave directions for his being placed under the care of the prison surgeon until inquiries could be made respecting him.\n\nOUTRAGEOUS USE OF A POLICE-CHARGE.—Francis William Ackhurst, a young man of about nineteen, was charged with having on the 4th instant committed a very murderous assault upon Samuel Lee, aged about thirty-three, who had been ill since the attack at College-hotel. The case had been removed from time to time owing to the inability of the complainant to leave the hospital, the injuries inflicted being severe. The prisoner stated that he had been living at lodgings at 50, Charles-street, Drury-lane, and was by profession the proprietor of a street railway. The prisoner lodged in a three-roomed house, one room adjoining the other. On the night in question the witness had left a half-crown on the mantelpiece, which the prisoner had been seen to take away. He said, \"Give me that half-crown you took from the chimney-piece.\" He declined to give it up, swore that he had not had it, and used very violent and insulting language. He then struck the witness, whom they, during which the prisoner seized a poker and aimed a blow at witness's head, which instantly fell back to the floor and let him insane. The policeman, Mr. Fisk, found him lying on the spot a few minutes after the occurrence, and found the complainant insensible and bleeding profusely from the wound which he had received. He thought both the prisoner and the complainant had been drinking. He took complaint to the hospital, and had brought him from there that morning, the surgeon insisting that he should be taken back, directly after the attack, to the hospital, to be treated. The hospital. The assault was committed at about twelve o'clock at night, and a man named Jacques, who had given evidence regarding the first attack, came on, and identified the prisoner. The prisoner admitted the charge. The prisoner said he did not inflict the wounds on the complainant's head. He had been spending the evening with complainant, and they had been drinking. He then entered into his (prisoner's) room, and accused him of the theft, and when he refused to leave the room, prisoner put him down on the bed—and he fell.—The case will be remanded, the complainant being taken back to King's college hospital.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206211444.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 510, "total-output-tokens": 1168, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5065, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]