[{"id": "7070e80c1406ebe7f7fa1cffdcf8c050676ea823", "text": "ANOTHER JACKSON CASE.\n\nWilliam Jackson, 24, describing himself as a labourer, of Wells-street, Hackney, was charged, at the North London police-court, on Saturday, with stealing on the 14th inst. 2l., the money of his wife, Alice Jackson, a coffee-house keeper, of Wells-street, Hackney.\n\nMrs. Jackson said the prisoner had frequently assaulted and left her. She did not wish to live with the prisoner, but he would continue to come and annoy her. As he would not work, she had to keep him. She had purchased the coffee-house out of her own money, and the defendant had no right whatever to any share in the profits of the business. Last Monday he left her house and took with him her pocket-book, which contained two sovereigns. He returned that morning (Saturday), annoyed her by walking up and down, and endeavoured to force his way into the house. On the advice of her solicitor she gave him into custody for stealing her money.\n\nMr. Fenwick thought that the charge of felony could not be sustained, and he discharged the accused.\n\nMr. Young said he should like the magistrate to express the opinion that the police should protect his client in the pursuit of her business.\n\nMr. Fenwick: Has she a separation?\n\nMr. Young: No. But some magistrates have not required, since the celebrated Jackson case, that there should be a legal separation. They have held that a man cannot compel his wife to allow him to live with her. I think this case in some respects very like the celebrated case I have mentioned.\n\nMr. Fenwick: The Jackson case did not decide that a man should not live with his wife. In my opinion all that the Jackson case decided was that a man must not seize a wife with whom he was at variance and lock her up. It is also my opinion that unless there has been a legal separation a wife has no legal right to shut her house against her husband.\n\nMrs. Jackson left the court evidently very much dissatisfied with the magistrate's decision.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206277737.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 460, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1954, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]