[{"id": "c1ea2e79f521f144f46ab5e130a6960017f1ae18", "text": "XXXII. Comparison between Sir George Shuckburgh and Colonel Roy's Rules for the Measurement of Heights with the Barometer; in a Letter to Col. Roy, F. R. S. from Sir George Shuckburgh, Bart. F. R. S.\n\nTO COLONEL ROY.\n\nSIR,\n\nRead May 7, 1778.\n\nWelbeck Street,\nApril 20, 1778.\n\nSINCE the printing of your ingenious memoir on the subject of measuring heights with the barometer, I have been naturally led to a comparison of your rules and observations with my own\\(^{(a)}\\); and herein am not more pleased than surprized at the general correspondency of our results, which carries with it the appearance of one and the same series of experiments, rather than of distinct observations made with different instruments, in different countries, and by different persons. That the standard temperature or zero on the scale of the thermometer should be found by each of us to fall in the same point to within one-third of a degree is, I think, truly surprizing; and I doubt not will evince to Mr. de Luc the strong probability there is of\n\n\\(^{(a)}\\) Vide Phil. Trans. vol. LXVII.\nSir G. Shuckburgh's Letter to Col. Roy on\nthe necessity of correcting his rules. But although in\nthis essential and fundamental part of the inquiry we\nagree, there are, nevertheless, some little circumstances\nwherein we differ; it is the subject of this letter, sir, to\npoint out to you the degree of our differences, a compa-\nrison that I had the pleasure slightly to exhibit to you a\nfew days ago, and which I trust will not be found unim-\nportant to those who may be engaged in these pursuits:\nif, therefore, you judge these remarks of sufficient mo-\nment, I will beg the favour of you to lay them before the\nRoyal Society, as the best means of communicating them\nto the public.\n\nThe two chief causes of our difference are, the expan-\nsion of quicksilver and the expansion of air. I shall be-\ngin with the equation for quicksilver.\n\nThe mean temperature of ordinary barometrical ob-\nservations, I apprehend, will generally be found to lie\nbetween $40^\\circ$ and $70^\\circ$ on Fahrenheit's thermometer;\nnow the mean expansion in this range, according to your\nobservation, is $0.323$ inch on a column of $30$ inches for\n$10^\\circ$ of heat; by my table it is only $0.304$ inch, the dif-\nference $0.019$ inch is equal to about $20$ inches in the\nresult of the height, when the temperature of the two\nbarometers differs $10^\\circ$, and this may reasonably be ex-\npected only in a height of $3000$ or $4000$ feet. In an\nobservation on Mount Ætna, one of the greatest accessible heights in Europe, the difference of temperature at the top and bottom might amount to $30^\\circ$, and this would occasion a difference of about five feet, which, I apprehend, may be reckoned inconsiderable in a height of 11,000 feet. In fact, in an observation on this mountain by Mr. Dessaussure it amounted to only $3\\frac{1}{2}$ feet. I may add, that your equation makes the computed height less than mine.\n\nI proceed to the expansion of air. Your equation is various according to the circumstances, the difference therefore of our results will, according to the circumstances, be various. The following table will give the quantity of this difference, viz. it shews how much your result is + or − mine upon one thousand feet, according to different pressures of the atmosphere and different temperatures. The first column to the left hand contains the mean heat of the column of air between the two barometers; the figures in the horizontal line at top are the mean height of the two barometers, or mean pressure of the atmosphere; the common point of meeting in the different columns gives the difference of our result in feet, according to the respective circumstances.\nThus, if the mean height of the barometer were 27 inches, and the temperature $52^\\circ$, the difference of the results would be four feet in a thousand; how far, therefore, this is of moment is left to the judgement of the observer. I conclude lastly, sir, with a comparison of your actual observations made in Great Britain computed after my tables, deduced from a series of observations made in Savoy. I have indeed only collected sixteen of your observations; but as I have chosen such as presented themselves as most proper, either on account of their heights or temperatures, I imagine these will be very satisfactory.\n| Place of observation | True height in feet geometrically | By my tables | By Col. Roy's tables |\n|----------------------|----------------------------------|--------------|---------------------|\n|                      | Computed height                  | Error in feet | Error on 1000 feet |\n|                      |                                  |              |                     |\n| Station at Weem and top of Bolfrack's Cairn, Ditto station and top of Dull-craig, | 1076.5       | 1074.2         | -2.3               |\n|                      |                                  |              |                     |\n| Ditto station and South obf. on Schehallien, Ditto station and West summit of Schehallien, | 1244.5       | 1240.6         | -3.9               |\n|                      |                                  |              |                     |\n| Carmichael-well and top of Tinto, | 1642.5       | 1653.6         | +11.1              |\n|                      |                                  |              |                     |\n| Level of Hawkhill and small rock on Arthur's Seat, Base of Hawkhill Observatory and bottom of the small rock, Hawkhill garden-door and bottom of the rock on Arthur's Seat, Linhouse and East Cairn hill, | 702.4        | 704.2          | +1.8               |\n|                      |                                  |              |                     |\n| Carnarvon Quay and Moel Eilio, | 684.0        | 684.1          | +0.1               |\n|                      |                                  |              |                     |\n| Carnarvon Quay and Peak of Snowdon, | 3555.        | 3563.1         | +8.1               |\n\nMean error + 2.0\n\nThus\nThus it seems, that the error of my tables, from a mean of all these observations, amounts to $+\\frac{2}{10000}$; of yours, to $+\\frac{14}{10000}$: but it must be remarked, that the standard temperature, from whence I compute, is $31^\\circ, 24$ of Fahrenheit, whereas in your computations it is assumed at $32^\\circ, 0$; this difference of $0^\\circ, 76$ is equal to $\\frac{18}{10000}$ in the correction for the expansion of the air: if then we were to set out from the same zero, viz. $32^\\circ$ (which I have proposed, see p. 569. of my memoir, Phil. Trans. vol. LXVII.) the error of my tables, according to your observations, would become only $\\frac{2}{10000}$, that of yours remaining $\\frac{14}{10000}$. I would by no means from hence conclude, that any preference is to be given to the former, but would say, that in most practical observations, in these countries at least, it is indifferent which method is used. These same comparisons also afford us another piece of information, viz. that under similar conditions the density of the atmosphere is the same, whether under the parallel of $46$ or $56$ degrees of latitude. Till, therefore, more accurate observations than those of Mr. Bouguer (a) can be obtained in the neighbourhood of the\n\n(a) Mr. Bouguer's observations I hold inadequate in such an inquiry, not only on account of their incorrectness (for they are related only to the $\\frac{1}{4}$ of a French line), but particularly inconclusive, allow them all the precision you please, as they were not synchronous; insomuch, that we are uncertain whether those observations, which should be corresponding in point of time, were made within six months of each other: and with regard to the temperature of some of them\nthe Measurement of Heights with the Barometer.\n\nthe equator, I should be extremely cautious how I admitted a latitudinal equation; nor do I think the single observation, related in The Voyage towards the North Pole, of sufficient authority itself to establish such a theory upon\\(^{(b)}\\).\n\nthem we are still more at a loss, having a range of no less than \\(38^\\circ\\) to assume it in (vide Voyage au Pérou, p. 29.). The mean, however, of his five observations, according to my computation, would bring the zero of the scale to about \\(40^\\circ\\) of Fahrenheit: but till it can be proved, that in this uncertainty of \\(38^\\circ\\) we have, in fixing upon the mean, got the true temperature to within \\(8^\\circ\\); and also, that during many months the barometer in the same place had never altered a single line: till then, I say, no fair conclusion, in point of theory, can be drawn from these experiments, for with such supposed errors or variations the Peruvian observations will agree exactly with those in this climate.\n\n(b) It seems extraordinary, that the heights of the quicksilver, observed on the sea-shore with one of Mr. Ramsden's barometers, should differ a quarter of an inch from the height of the same observed the same day, and almost at the same hour, with Mr. Nairne's marine barometer on board a ship (vide p. 135 and 148. of The Voyage towards the North Pole). This difference, therefore, I think remains to be explained, if the experiment is to be made use of in this inquiry; for this same marine barometer, compared a few days ago at Mr. Rbbetson's, secretary to the board of longitude, with one of my own, that I used in Savoy, agreed with it to within 0.04 inch. It may also be remarked, that Lord Mulgrave's observation in lat. \\(79^\\circ 44'\\) brings the zero to about \\(64^\\circ\\); so that between the lat. \\(56^\\circ\\) and \\(79^\\circ\\) (equal \\(23^\\circ\\)) the zero of the scale moves through a space of no less than \\(32^\\circ\\); whereas, between the lat. \\(46^\\circ\\) and \\(56^\\circ\\) it is perfectly stationary, at least as to sense, having altered only one-third of a degree: which great want of proportion, I think, is of itself some argument against the existence of such a latitudinal equation. Moreover, Mr. Bouguer's observations brings the zero of the scale on the same side of \\(32^\\circ\\) with Lord Mulgrave's, viz. to about \\(40^\\circ\\), so that, if any deduction is to be drawn from these observations, it is, that the air, both at the equator and at the pole is heavier than in middle latitudes, which is no very probable conjecture, and, I apprehend, more than is intended to be proved. I should have asked pardon for the freedom with which I have discussed this inquiry, were I not assured that the acquaintance and friendship of my Lord Mulgrave, which I have experienced for some years, will lead him to attribute it to its proper motive.\n\nI shall\nI shall now beg leave to conclude with what I flatter myself will not here appear improper, a new rule for reducing the observations, and which I hope will be found particularly commodious, as it requires no logarithms, nor any other than the following short table, which may be engraven upon the scale of a thermometer, and therefore, always accompanying the instrument, will serve for computing the observations upon the spot, (if the height should not exceed 4000 or 5000 feet) which, I apprehend, will frequently be found very satisfactory.\n\nThe adjoined table gives the value of $\\frac{1}{10}$th of an inch on the barometer in feet in the atmosphere, when the quicksilver stands at 30 inches, for every five degrees of temperature from 32° to 80°; and for any other height of the barometer it will be in the inverse ratio of that height to 30 inches. Thus, let $a$ be the mean height of the two barometers in inches; $\\alpha$ the difference of the two barometers in 10ths of an inch; $\\beta$ the number taken out of the adjoined table; $x$ the height in feet; we have then the following expression, $\\frac{30 \\times \\alpha \\times \\beta}{A} = x$, the height required.\n\nI have the honour to be, &c.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/106343.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 13974, "total-output-tokens": 3159, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1072, 2], [1072, 2489, 3], [2489, 3724, 4], [3724, 4349, 5], [4349, 6066, 6], [6066, 7799, 7], [7799, 10694, 8], [10694, 11895, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, true, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]