[{"id": "31a00d9278f09a89cda874c786a6d4d867ed54f2", "text": "SEQUEL TO A MIDNIGHT AFFRAY.\n\nIn the Lord Mayor's Court, on Friday, the Assistant Judge (Mr. Roxburgh) and a jury had before them the cases of Spicer v. Agate and Agate v. Spicer (consolidated). The plaintiff in the first case, a housekeeper employed at 39, New Broad-street, sued the defendant, a bank messenger, to recover £6 compensation for an assault committed upon him by the defendant. Mr. Watson was counsel for Spicer, and Mr. C. A. Russell for the defendant. It appeared that Spicer met a man named Haycock at an Oddfellows' meeting, and in a conversation which ensued Spicer told Haycock that the defendant was leaving his situation. In consequence of that Haycock applied to the bank for his post. Agate was very much incensed at this, and called upon Haycock and asked him \"what he meant.\" Haycock related the circumstances, and after the two had had a \"friendly glass\" together, Agate, at half-past eleven at night, called at Spicer's house. Spicer was in bed, and according to his evidence Agate rang the bell violently, kicked at the door, and made such a hubbub that he (Spicer) thought there must be a fire, and he accordingly awakened his wife and daughters, who all prepared to leave the house in their night gear. Spicer ran down hurriedly to the door, where he was confronted by Agate, who demanded to know \"what he meant,\" and threatened to \"knock his eye out.\" A struggle ensued, and a detective and policemen made their appearance on the scene. Agate said he was \"knocked silly\" in about two minutes; the buttons of his night shirt were torn off, and he was a \"fair wreck.\" Agate's case was that he was first attacked by Spicer, who pulled his beard and stuck his knuckles into his throat. He called his wife to corroborate his statement, which she did in an amusing manner. In the result the jury found for Spicer, damages one farthing. In the second case they found for the defendant.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200808401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 474, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1911, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]