[{"id": "3a3ab3d99e6d6e87ebb90063387bef08f7312e58", "text": "On Tuesday, at the Lambeth police-court, Thomas Shea, a simple-looking youth, was placed at the bar on a charge of stealing a leather bag containing some trifling articles, and George Evans and Louisa his wife, the keepers of a brothel at 18, Wellington-terrace, Waterloo-road, were also charged with receiving the property with a guilty knowledge. Police-constable Robinson, 48 P, said that on the previous night between ten and eleven o'clock he received information that a black bag containing some boots had been stolen from a cab in the front of the Weymouth Arms public-house, Newington, by a young fellow who had been left in charge of the vehicle. He made inquiries, and found out that the thief resided in No. 1, Nelson-court, Camberwell.\n\nWitness proceeded there, and found the prisoner Shea in bed. He aroused him, and asked for the bag he had taken from a cab in Weymouth-street. The prisoner replied that he had sold it at a cigar shop in the Waterloo-road for 6s. Witness, in company with constable 345 F, proceeded with the lad to the Waterloo-road, and he there pointed out the house, 13, Wellington-terrace, as the place he had disposed of the bag. On knocking at the door, it was opened by the female prisoner. In order to procure an entrance, and finding from the constable on the beat that it was a brothel, he (Robinson) asked if she had not in her house a young woman who had absconded from her parents. The prisoner replied that she had not, and that if he thought so he was at liberty to look over her house. She then admitted him, his brother constable, and the prisoner Shea, and on doing so, he asked her what she had done with the black bags he had purchased from Shea. She replied that she had never seen the youth before, but said that two young men who had just gone over Waterloo-bridge had left a bag in her charge, and desired her to take care of it till they returned, and pointed to the bag, which was placed on a chair in the parlour. Witness at once took possession of it and the prisoner. Shea said it was the same bag he had sold to the male prisoner for 6s., and which was paid for by his wife, and the articles which still remained in it exactly corresponded with those it contained when stolen. He then told the prisoners he should take them into custody for receiving stolen goods.\n\nOn searching the house he found in different parts of it, concealed, with portions of it under the beds, and between the beds and mattresses, nearly a vanload of valuable property. He also found 54l. 10s. in gold, 5l. in silver, and a 5l. bank-note. The property discovered consisted of rolls of cloth, rolls of carpeting, a number of valuable shawls, ladies' silk dresses, a quantity of silk ties of different patterns, cases of straw hats, and also cases of bonnets of the same material, a number of watches, a quantity of rings and valuable jewellery, teapots and teapot stands, a quantity of spoons and plate, and a large chest closely packed with splendidly-bound Bibles and Testaments, supposed to have been intended for exportation from a portion of the direction still adhering to the case containing the Bibles. It appears to have been forwarded by rail to Margate.—All the prisoners were remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206225730.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 774, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3234, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]