[{"id": "881c5f905765e9ed600b4c98a0f840f5ca68c2da", "text": "AFFILIATION CASES.\n\nOn Thursday Lieutenant-colonel John V. Mackenzie, unattached, of 17, Cromwell-terrace, Regent's-park, appeared at Clerkenwell police-court to show cause why he should not contribute towards the support of an illegitimate child of Miss Louisa Bell, of 3, Baker-street, Clerkenwell, born on the 8th of June of last year.—It was proved that the defendant had visited the complainant from time to time, and had paid her £10. She admitted that she had had two children previously by a person named Leigh, but she denied that he was the father of the third.—The magistrate made an order on the defendant to pay 3s. 6d. per week until the child had attained the age of 16.\n\nThomas Sorrell, the son of a builder, residing at 1, Manor-cottages, East-end, Finchley, was summoned to the same court to show cause why he should not contribute towards the support of an illegitimate female child of which Lucy Bording, domestic servant, of Barnsbury-villas, Islington, alleged him to be the father.—Mr. Ricketts stated that both parties had formerly resided at Finchley, and at the time the complainant made the acquaintance of the defendant he was then an apprentice to Mr. Joslin, a stonemason there. They were regarded as lovers, and he seduced her under a promise of marriage. When the child was born the defendant visited the complainant, again promised her marriage, and subsequently paid her some small sums of money towards the support of the child. After that he made an arrangement with Mrs. Hillier, of Highgate, to pay towards the support of complainant's child, but instead of doing so he went to Colchester, and nothing more was heard or seen of him until he was accidentally found by the complainant's father, and these proceedings were taken. Mr. Ricketts concluded by asking for an order.—Mr. Hosack made an order on the defendant to pay 3s. 6d. per week and the costs till the child attained the age of 16.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206247303.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 491, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1930, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]