[{"id": "ce9b0be6e4b5ef006a2bf1c18262e3905428c908", "text": "THE BIRCH FOR BAD BOYS.\n\nThe London, Chatham, and Dover Railway Company summoned two small boys before Mr. Biron, at the Lambeth Police-court, one for throwing stones at telegraph poles, and the other for placing a portion of a brick on the metals. Mr. Groves, from the solicitors' department of the company, said there had been a perfect epidemic of stone-throwing lately, and in London alone the company had had eight cases of personal injury during the last month. The company had in consequence determined to prosecute in every case. Mr. Biron said the public were under an obligation to the company for taking the matter up. He was glad to know that there was a section of the Act which gave him power to inflict corporal punishment in these cases. The defendant in the first case would receive eight strokes. In the second the defendant was ordered to receive twelve strokes. Both boys left the court howling piteously, and were taken over to the police-station, where the punishment was administered.\n\nSHOCKING FATALITY.—A lad named John Davies, employed at the South Wales Tin Works, Llanelly, met with a terrible death on Friday. He had occasion to ascend a pulley, when he was caught by the band, and whirled round until he fell upon the flywheel, and was mangled almost beyond recognition.\n\nDARING ROBBERY AT PORTSMOUTH.—A daring robbery was committed on Friday night at a branch post-office situated in Commercial-road, the busiest thoroughfare in Portsmouth. The shop is occupied by Mr. Williams, who also deals in fancy goods. At nine o'clock a man entered and asked the price of some brackets which were in the window. Mrs. Williams, who was alone in the shop, went outside to see the articles, and was absent about a minute. On her return she discovered that the till had been robbed, about sixty pounds in gold and silver having been abstracted. No clue has been discovered as to the identity of the thieves.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810703.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1522, "total-output-tokens": 451, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1925, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]