[{"id": "35dfcc145da3ede35d566d58ffdb9cb94490da1a", "text": "ALLEGED BLACKMAILING AT OXFORD.\n\nMaitland Francis Morland, described as a tutor, aged sixty-two, of St. John-street, Oxford, was charged at the Bury St. Edmunds Police-court, Monday, with attempting to obtain from Lord Chesham Hothfield, the sum of £70, and other moneys by false pretences. Mr. Lewis said that he appeared before the prisoner in the police-court, and Lord Chesham had told him that he wished to obtain the sum of £70, and other moneys from him by false pretences. In the year 1888 Lord Hothfield received a letter signed \"M.\", which he should say was written by Mr. Morland. The letter proceeded as follows:—\"My Lord, I am a very young widow, and was married six weeks ago. My husband died in India a fortnight after our marriage. I was in India a short time. My anxiety, though strong, was not sufficient for me to go there; but I will not be under the strain of another's debts. Hence my writing to your lordship. I became secure for an old gentleman, and am now, I cannot say, in a full and peaceful, with perfect dignity, in all features am like the Princess of Wales. My house is large, well appointed, in the best part of Oxford, and your lordship could come to me. I am highly connected, and have a position to keep up. I am anxious to see you in person, and am sure of your current Italian hand. I am very young.—I have the honour to be, my lord, your lordship's obedient servant, M.\" Lord Chesham admitted his receipt from St. Giles-street. Lord Totfield took no notice of that letter, and some time afterwards he received another letter, which it was impossible to read, and which was also written by the prisoner. It proceeded as follows:—\"Tuesday. My Lord.—You called in the afternoon during last week, and the maid thought you asked for Mrs. Maylan. She said that no one of that name lived here. She had not long been here; but the other maid, who ought to have answered the door, would have known whom you meant. I am both obliged and glad if they could make you see me. I have little money to say, but I was in. When I crossed you at the station talking to Lord Chesham, I do not know his lordship; but one of the made games from Lord Totfield. I am very young. That is why I thought she had found no opportunity of giving you the note. Why did not your lordship inform me that you were coming?\"—Ere do not see a young man to me again; you would be prudent and would keep my secret. I know that it was your lordship that called, because I had a note from you. I am very young. I am obliged at the time as a friend, I am very young. I have since repaid it. I only wrote to you because I knew you were the only person I should like to come to see. Do not show yourself to anyone, but me.\"\n\nMARYLAND.\n\nDetective Henry Maxwell deposed to seeing the prisoner in the police-court, and said he was Mrs. Maryland—did she show him who she was? He said, no, she had never resided with him; but visited his house as a friend. She was a Russian of some consequence, and had been living in London for some years, acquainted with Lord Totfield. She was a great Nihilist. He farther said, \"This is a conspiracy, and I am acting against Mr. Leachman; also against a firm of solicitors at Oxford named Mr. Gurney. Lord Hothfield is acting for Labouchere, also for Lord Totfield, and it is a conspiracy between them to sate the nation. Mr. Cravagh was responsible for examining the prisoner, and he was not fair to her; but John Bridge refused, on the ground that if the charge were sustained it was a most serious offence. He remained the prisoner for eight days.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810145.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 510, "total-output-tokens": 901, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3579, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]