[{"id": "04453f480038728d5a34e04fbdf7ea3e426d30af", "text": "CHARGE OF ARSON AGAINST A SERVANT.\n\nAt the Westminster Police-court, on Thursday, Mary Tobin, lately cook in the establishment of Mr. W. Wheatly, 23, South-terrace, Thurloe-square, Brompton, was charged with setting fire to her master's house. The prisoner entered the prosecutor's service ten days ago, but, owing to her being very violent, and making use of bad language, Mr. Wheatly insisted upon her leaving on Wednesday evening, but refused to pay her for a month's warning. It was found necessary, in consequence of her behaviour, to call in a policeman, in whose presence the prosecutor paid her her wages for the time she had been in his service, and she then left, intimating her intention of summoning for the month's money which she claimed. In about half an hour after quitting the house she returned for a box, which she had been permitted to leave in the passage, and on Caroline Stephens, the housemaid, opening the door, asked permission to go to the lower part of the building, for which she assigned a sufficient excuse. The housemaid remained in the passage, but finding the prisoner was gone a long time, she called her, but received no answer. She then went down stairs, and, to her surprise, saw the prisoner leaving the kitchen to which she had no right to have gone, that not being the part of the building she had asked permission to visit. Prisoner and the housemaid came up to the street-door together, and immediately the housemaid smelt something burning, and asked the prisoner whether she saw anything on fire when she was below. The latter replied in the negative, and kept her eyes fixed on the kitchen window, a view of which could be commanded from where they were standing at the street-door. Immediately afterwards, a great deal of smoke issued from the kitchen window, and the housemaid then asked her to come down with her to see what was the matter. Prisoner refused, declaring that she had no business in the house now she had got her box, and although the housemaid assured her that Mr. Wheatly would make no objection under such circumstances, she still refused, and the housemaid went down alone. On opening a cupboard door in the kitchen, she found a number of greasy rags, wood, and paper on fire, which was just beginning to blaze, the heat having been so great that a leaden pipe, which runs through the cupboard and supplies the boiler, was melted, and the water was streaming out. The housemaid again entreated the prisoner to come down and help her to extinguish the fire, but she refused, and recommended the girl to open all the doors and windows. On the girl replying that if she did so the house would be burnt down before her master came home, prisoner observed, \"she couldn't help that; she'd have nothing to do with it.\" The housemaid, who was very much alarmed, the whole of the family being from home, excepting a little boy threw some pails of water upon the fire, and extinguished it. Prisoner did ultimately come down, and threw a jug of water upon the fire when the other had nearly succeeded in putting it all out. The prisoner then went away, and the housemaid, who was much alarmed, entreated her to tell Mr. Wheatly, if she happened to see him as she went along, what had occurred; but, although prisoner met that gentleman and spoke to him, she never uttered a word about the fire. The housemaid went to the cupboard about half an hour before the prisoner came for her box, and there was no fire then, and the rags were, at that time, in a different part of the cupboard to where they were afterwards found burning, nor was there any wood or paper mixed with them. The cupboard was much burnt, but the water, which was spurting out like an engine from the leaden pipe, flowed upon the planks which formed the cupboard, and in all probability saved the house from being burnt to the ground.—Prisoner, in reply to the charge, said she knew nothing about the fire.—Mr. Burrell remanded her for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206192268.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 901, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3967, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]