[{"id": "0c8f81516fa30925ae2fce65999fd8d170e3d309", "text": "ALLEGED MURDER BY A SHIP'S MATE.\n\n(From our Special Sunday edition of last week.)\n\nOn Saturday Edmund Moore, chief officer, and Stephen Osborne, second mate, of the British ship Mary Ellen Chapman, of St. John's, were charged on remand, at Bow-street police-court, with causing the death of an able-bodied seaman of that vessel while she was lying in the river Delaware, in September.\n\nMr. Douglas Straight said the Mary Ellen Chapman was a British ship, and she sailed from Hamburg to Philadelphia. On the 3rd of September last she was lying in the river Delaware, a few miles off the latter port. It appeared that on that day the deceased man, Ellis, who was one of the able-bodied seamen of the ship, was employed in some work in connection with the rigging. During the performance of this work he had to carry some tar or paint across the deck, and he happened to spill some of this. The chief mate said that if any of the sons of — spilled any of the stuff he should make them lick it up. The deceased said he should not lick the stuff up for any man, and the chief mate then, with the greatest brutality, seized hold of a marline-spike and struck the man two heavy blows on the head, fracturing his skull. The man was so frightened by the brutal violence of the mate that he ran up the rigging to get out of the way. He climbed on some of the yards, and as he would not come down the chief mate ordered the yard to be hoisted, an operation that placed the man in considerable danger. The chief mate soon after this went ashore, and the man Osborne then persuaded Ellis to come down. Ellis had something to eat in the cook's galley, and he then tried to induce a man named Boyd to lower a boat to row him ashore. Boyd refused to do this, and the unfortunate man, evidently frightened of the violence that would be used towards him if he remained on board the ship, let himself down by the chains into the water and struck out for the shore. It was a curious fact, which showed that the brutal conduct of the mates had caused a state of fear and alarm among all the men on board, that when Ellis left the ship two other men, named King and Langford, also got into the water and began to swim ashore. Fortunately for these two men they succeeded in reaching the shore, which was about a half or three-quarters of a mile away. Ellis did not, for while he was swimming, the mate, Osborne, rushed up on the poop with a revolver and fired two shots at him. Soon after these shots were fired Ellis threw up his arms, gave a shriek, and sank. An inquest was afterwards held, but it did not appear that the actual cause of death was cleared up. But, whether the man was actually struck by the shots or whether he died by drowning, he (Mr. Straight) submitted did not alter the case, for, in point of law, if the deceased was driven by the acts of the prisoners into doing something which resulted in his death, they were both responsible on the charge of murder.\n\nMr. Straight then proceeded to call witnesses in support of his opening statement, and the case was ultimately again adjourned.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206329327.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 715, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3087, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]