[{"id": "2aee57648aaf65aea47f833656a6fa8ba04f3e72", "text": "VERDICT OF MANSLAUGHTER AGAINST A MEDICAL OFFICER.\n\nOn Tuesday, an inquiry, adjourned from Saturday week last, was resumed at the Millbank prison, before Mr. Bedford, the coroner, concerning the death of Patrick McGinty, aged twenty-six, a convict. A short time ago, the attention of the Home Secretary, while on a visit of inspection to the prison, was directed to the state of the deceased, then a patient in the infirmary, where he had been taken immediately on his reception from the Glasgow gaol. The deceased was then in such a dreadfully emaciated state that Sir G. Grey gave orders for the fullest inquiry to be made into the circumstances of his removal from Glasgow. The following was the substance of the evidence given at the first meeting of the jury:—Captain John Richard Groves, governor of the Millbank prison, said, the deceased was received on the 21st of January last from Glasgow gaol, having been convicted at Glasgow, on the 28th of the previous September, of assault and robbery, and sentenced to seven years' transportation. The medical certificate, which accompanied the deceased and the prisoners who came with him, stated that they were free from mental and bodily disease, and that their healths would not be endangered by removal. Two hours after admission, Dr. Bailey, the physician, gave a certificate that he was in the last degree of debility, suffering from internal scrofulous disease, and the deceased was immediately taken to the infirmary. Deceased complained to him (the governor) of the treatment he had received in Glasgow gaol, regarding diet and medical treatment.—Anthony McGinty, a prisoner, but no relative of the deceased, said that they were chained together all the way from Glasgow gaol. When leaving, the deceased seemed very ill and weak, and said he thought he should die. They travelled by steam-boat and railway. In the boat the deceased was so ill, that he was obliged to keep his bed the whole way, witness being chained to him.—At this stage of the inquiry the proceedings were adjourned in order to obtain evidence from Glasgow.—On Tuesday, on the re-assembling of the jury; Malcolm Clark, warder in the Glasgow prison, was examined. He said that he had charge of the deceased until the day he left for London. There was no regular infirmary in the prison, but only a ward in which the sick prisoners were put. The deceased was not in that ward. He was under the treatment of Mr. David Gibson, the surgeon, and was taking medicine up to the time of leaving. He told witness he thought he should be better when he got away from Glasgow. Witness saw him the day before his removal, and thought him in a fit state to undergo the journey. The surgeon examined him the day before he left. The morning he left he came down stairs, assisted by a prisoner or a warder, who held him by the hand because he was so weak, and was chained by the ankle to another prisoner. No direction was given by the surgeon as to the manner in which he should be removed. No medicine was given him for the journey.—The coroner produced the certificate signed by Mr. Gibson, the surgeon, and asked the witness whether that was the document sent with the deceased and the other prisoners?—The witness replied that it was.—Mr. Edward Hall, resident surgeon of the Millbank prison, said he saw the deceased on his reception on the 21st of January, and found him pale, thin, and extremely emaciated. It was soon ascertained that there was scrofulous disease of a very decided character in the bowels, and in a less marked degree in the lungs. Dr. Bailey, the physician, immediately pronounced him unfit to be removed to the prison, and he was at once taken to the infirmary. He gradually grew worse, and died on the 10th of the present month. A post mortem examination was made, and the cause of death found to be scrofulous disease of the lungs and bowels.—The coroner then summed up the evidence, and the jury, after a short deliberation, returned the following verdict:—\"That the deceased died from natural causes, and the jury are of opinion that he should not have been removed from Glasgow, that the surgeon should not have permitted him to take the journey, that death was accelerated by the journey, and the jury find David Gibson, the surgeon, guilty of manslaughter.\"—The coroner said he would acquaint the Lord-Advocate of Scotland with the verdict the jury had returned.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206191677.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 997, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4410, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]