[{"id": "685f69333858833f5cc78553167ad5090f384eb6", "text": "TRANSPORTS AND PRISONERS OF WAR.\n\nAn estimate, separated from the navy estimates (of which an abstract is given above), but prepared by the naval department, states the total amount required for the transport service of the year 1855-56 to be £5,071,032, and for the expense of prisoners of war, £100,000, making together, with a sum of £10,433 for superintendence, a grand total amount of £5,181,465. The sum voted in the navy estimates for the financial year 1854-55 was £3,582,474. The prisoners of war appear to be kept in Milbay and Lewes prisons, and in the Devonshire prison-ship. The greater portion of the total amount—namely, the sum of £90,064—is required for the allowances to officers on parole and their wives, provisions and clothing for prisoners, and for bedding and contingencies. An abstract of the transport service, appended to the estimates before us, shows, that from the 7th of February, 1854, to the 22nd of January, 1855, 102 steam transports were employed of 121,060 tons and 26,317 horse-power, and 115 sailing vessels of 93,172 tons; the number of officers and men employed in the above vessels amounted to (about) 9,256. The total number of British troops conveyed from England during the same period was as follows: 2,194 officers (including those under orders for conveyance), 56,041 men, and 5,408 horses. There were also conveyed to the east from Marseilles and Toulon, 556 French officers, 14,055 French troops, 193 horses, and 8,037 tons of French stores; and, to the Baltic, from Calais, &c., 437 French officers, 12,888 men, and 21 horses. The gross total quantity of provisions and stores conveyed from England during the period in question was as follows, viz.:—to the east, 33,261 tons of provisions for the navy, and 21,551 tons for the army service, 24,617 tons of ordnance stores, 151,596 tons of coals (conveyed by colliers), and 8,320 tons of naval stores (exclusive of 7,180 tons from Malta); and to the Baltic, 9,436 tons of navy provisions, 266 tons of ordnance stores, 247 tons of naval stores, and 47,207 tons of coals (conveyed by colliers, and not by the transports). The grand total includes 3,187 officers, 82,984 men, 5,622 horses, 307,825 tons of provisions and stores, and 199,503 tons of coals. Of the sailing transports eight have been paid off, fourteen wrecked, and one burnt; and, of the steamers, one was wrecked.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206309556.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 769, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2377, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]