[{"id": "2459daffd0d29bed7fa03ca5917dbb2110e1f54b", "text": "A SAD CASE.\n\nMrs. Mary Bolthee, a ladylike-looking woman, residing at 1, Pratt-street, Somers-town, was charged at the Clerkenwell police-court, on Thursday, with being drunk and disorderly, and further with attempting to commit suicide in the police cells at the Pratt-street station-house, St. Pancras-road.\n\nOn the evening of Tuesday week the defendant was in Pratt-street the worse for liquor, and in a very excited state. She was making a disturbance, and she then stated that her husband had neglected her. She was taken to the station-house, where she gave the name of Green, and when she had been in the cell some time she attempted to destroy herself. She was remanded to the House of Detention, and while she had been there her husband had written to her telling her that he would have nothing more to do with her, and that she would find her clothes and box at the cloak-room of the St. Pancras station of the Midland railway, in the name of Green. The chaplain of the House of Detention had taken some interest in her case, and had written to her friends to be present at the court to receive her, but they had said they would not, and having made inquiries he had reported the result to the magistrate.\n\nThe defendant now said she was exceedingly sorry for what she had done, and with tears in her eyes asked to be relieved from custody, promising never to be guilty of so wicked an act again.\n\nMr. Cooke said that giving way to drink was the sole cause of her standing in her present degraded position. He had a letter from her husband in his hands, in which he concluded by bidding her farewell, and hoping God would take care of her. Nothing but adultery would relieve him from the burden of supporting her, and he asked her if she had ever been guilty of that offence?\n\nThe defendant, who seemed to feel her position acutely, said upon her honour she had not. No one could breathe a doubt as to her truthfulness to her husband.\n\nMr. Gissing said he appeared there to state that the husband and his friends would have nothing more to do with the defendant. Her conduct, and the fact of her being placed in the position she then was, had caused her husband a serious illness, and his life had been in danger.\n\nMr. Cooke said there could be no doubt that the conduct of the defendant had been bad, but that it had caused the husband to be so ill that his life had been despaired of could hardly be the fact, seeing that he had written to his wife during her confinement in the House of Detention, and expressed his determination not to live with her any more, nor to do anything towards her support. The husband had no right to desert his wife, and if she had not been guilty of adultery he was bound to support her. It was true that the defendant had endeavoured to destroy her life, but was that a sound or valid reason for her husband throwing her on the world? It was idle for him to think that he could get rid of his responsibility in that off-hand way. The defendant had better go and get support from the parish; and then, if the husband was charged before him with neglecting to maintain his wife, and the case was made out, he should most assuredly send him to the House of Correction with hard labour. The defendant would now be discharged.\n\nThe defendant, who seemed much affected, then left the court.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206235320.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 748, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3328, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]