[{"id": "75a7b2a80ffae1e5ee85b9191971137f823afe23", "text": "CHARGES AT MARLBOROUGH STREET.\n\nLouisa Gillespie, an actress, was charged with being drunk and riotous in Bear-street, on Thursday evening. She promenaded, shouting and making some unearthly noises as she went along. Then she tripped and fell, and her nose coming in contact with the pavement, blood flowed freely. When at the station a surgeon was sent for to attend to the injuries; and in the morning, saying that \"such a thing had never happened to her before,\" she was leniently dealt with, and let off with the payment of 5s., including the doctor's fee.\n\nAnnie Price, shortly before twelve on Thursday night, showed signs of combativeness, and when a woman whom she regarded as a rival confronted her, a set-two followed, and they scratched each other furiously until a constable appeared and separated them. The rival retired, but the prisoner, not having had satisfaction, made for her again, and another combat ensued, and again they were pulled apart. The other woman then took to her heels, but as the prisoner remained and challenged the authority of the constable to remove her, she was very soon ushered within the walls of the police-station. She was fined 10s. or seven days in default.\n\n\"Something flew into my head all at once, and then I went giddy,\" was the defence offered by Robert Knight, an old cabman, who was charged with being drunk whilst in charge of his horse and hansom in the Haymarket on Thursday night. He was so far gone as to drive on the wrong side of the road, and for that, and his insobriety, he was fined 20s.\n\nWilliam Padgham, another hansom driver, who was also charged with being drunk at midnight on Thursday, pleaded the awkwardness of his horse and his surprise that a constable should have been so uncharitable as to take him to the station, although he assured the magistrate that he had only a drop or two and went away as quietly as a lamb. The same fine was imposed.\n\nThomas Braid was also fined 5s. for being unsteady in his gait when off the box of his hansom, in Piccadilly at half-past twelve on Friday morning. As an excuse he said that he had not had anything to drink for a long time, when, unfortunately for him, a fare gave him a couple of glasses of whisky, and then his legs seemed to overlap each other.\n\n\"I was drunk, I know, but it was the first time during twenty years,\" said William Winhurst, who was inebriated when with his cab in Piccadilly-circus at twenty minutes to eleven the other night, and a 5s. fine had to be paid.\n\nJames Wight pleaded guilty to being drunk while in charge of a hansom in Piccadilly at eleven o'clock at night, and in this case Mr. Newton said that if he was brought before him again under similar circumstances his licence would very likely be cancelled. He was ordered to pay 20s. or go to prison for fourteen days.\n\nThomas Jacques, a labourer, was charged with being disorderly in Whitfield-street the other night, with refusing to quit the Lamb Tavern when ordered to do so, and with assaulting Mr. Max Meyers, the landlord, and Alfred Foakes, his potman, by biting their hands. Prisoner was very noisy and quarrelsome, and the landlord telling him that he was like an old woman he became exceedingly abusive, and was ordered to leave the bar. He refused, and when physical force had to be used he threw himself down and fixed his teeth into the hands of the complaints. He was fined twenty shillings for each assault, or be imprisoned for a month.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810322.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 821, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3451, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]