[{"id": "16e2644cb13fd54cb9edd48098e53588338b0d46", "text": "MYSTERIOUS DEATH IN THE RIVER.\n\nOn Wednesday night Mr. Richards held an inquiry at the White Lion tavern, High-street, Shadwell, on the body of Mr. Henry Canny, aged 60 years, who was alleged to have come to his death under suspicious circumstances.—Mr. Henry Canny, an artist, residing at 97, Devonshire-road, Holloway, stated that the deceased was his father. He had been assistant clerk to the Board of Guardians at Birmingham and Manchester, and was offered the situation of chief clerk to the Board, at Manchester, but refused it on account of ill health. The deceased afterwards entered the service of a Mr. Russell, at Gravesend, who, having given up his house of business, had to discharge him. Witness had not seen him for six months until he identified him in the deadhouse on Sunday last. He had no idea that he had been in St. Luke’s workhouse.—Sarah Canny, widow of the deceased, deposed that she had been housekeeper to Mr. Russell, of Gravesend, where her husband was employed. Four months ago he left her, for the purpose of coming to London to look after a situation, and she never saw him alive again. He used often to complain of his head, and said he wished “the Lord would take him away, as he was tired of his life.”—Henry Thatcher, porter at St. Luke’s workhouse, said that the deceased was admitted on the 8th of April, describing himself as a clerk, and left on the 15th. On admission he appeared in a destitute condition. He believed the reason he left was on account of the guardians making an order for his removal to Ireland, where he belonged. About two days after his admission to the house the master, seeing his capabilities, employed him as clerk in the office, and upon his discharging himself gave him 5s. One of the clerks also gave him 5s., and the master, having made an application to the board, the guardians granted him a new suit of black-clothes, which he had on when he left the workhouse. He appeared quite happy when he left.—Mr. Canny, the son, here stated that when he saw his father in the deadhouse he had a severe wound on the top of the head over the eye, and upon making inquiries since he had ascertained that his father had been seen down Golden-lane on Tuesday week with bruises on his face and only a pair of soldier’s trowsers on. Witness believed that he had met with foul play, as there was no evidence to show what had become of the clothes he had received from the St. Luke’s guardians.—John Myers, a waterman, of 12, Hardings-street, deposed finding the body of deceased floating in the Thames off Rickett’s wharf on Saturday. He searched the body, but found no money. He was dressed in an old pair of soldier’s trowsers. He saw wounds on the head and face, but what they were caused by he could not tell.—The Coroner admitted that there was a mystery in the case, but thought the best course for the jury to pursue was to return an open verdict, so that the police might follow the case up.—The jury then returned an open verdict, that “The deceased was found dead in the waters of the River Thames, but how he came there there was no evidence to show.”", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206240001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 752, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3118, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]