[{"id": "ce93360285781e317dd35f6e802bd215c7a0e5a4", "text": "MARYLEBONE.\n\nTHE POLICE AND THE PUBLIC.—A GENTLEMAN IN TROUBLE.—Henry William Wells, aged 28, a gentleman, living at Westbourne-grove, Paddington, was charged with resisting Police-constable Charles Rowe, 264 X, in the execution of his duty, at Westbourne-grove. He was further charged with rescuing a prisoner from the lawful custody of the police at the same time and place.—On Friday morning, about one o'clock, the constable had occasion to speak to five disorderly prostitutes in Westbourne-grove, and was obliged to take one of them into custody. Her companions tried to get her away from the constable, and when he had got from 10 to 15 yards on the way to the police-station the defendant walked up, caught hold of the constable by the collar, and said he should take him to the station and charge him with being drunk. He pulled the constable into the road and commenced pulling him along so much that he was compelled to let the woman go. The defendant caught hold of the constable by the arm, and he sprang his rattle for assistance. Another police-constable and the sergeant ran to the spot and found the defendant holding the constable. On being asked to account for his conduct he said the constable was drunk, and he was going to take him to the station. He was taken to the station, and it was found that the constable and defendant were both sober. The defendant was then charged, and placed in the cells until he could procure bail.—The defendant, in answer to the charge, said he was proceeding home when he saw the constable handling a young woman rather roughly, and on going to see what was the matter, he found the constable was the worse for drink. He said he should take the constable to the police-station, and they both walked towards the station, when they met the sergeant, and he (defendant) was taken into custody.—Mr. Mansfield said the defendant must have been mistaken, and ordered him to pay a fine of 40s., or in default to be imprisoned for one month.—The fine was immediately paid.\n\nWESTMINSTER.\n\nSTRIPPING A PENSIONER OF HIS MEDALS.—Jane Brown, described as an \"unfortunate,\" was charged with stealing four fighting medals from the person of William Plumridge, a pensioner, residing at Missenden, in Buckinghamshire.—The prosecutor said that he came from Buckinghamshire on Tuesday, with another pensioner, for the purpose of attending the local companies' drill. He met the prisoner and two other women, and with his friend accompanied them to a publichouse, where they had some beer. He had four medals on his breast, the Punjab, Delhi, China; and the long service and good conduct medals, which a woman cut off and gave him as he was going to put them on his uniform coat; he wrapped them in a handkerchief and put them in his pocket, and finding the prisoner very close to him in the street he warned her off; she, however, came closer, and directly they parted he missed the medals and handkerchief, and went after her, but lost her in a court. On Friday night he saw the prisoner in a publichouse close to the spot where he was robbed, identified her, and gave her into custody.—James Charles, another pensioner, confirmed this witness's evidence.—Henry Royce, 242 B, proved that when he went to apprehend the prisoner she ran away and concealed herself in the back of a publichouse. He apprehended her, and on the female searcher searching her the handkerchief was found in which the medals were wrapped.—Prisoner said she had had the handkerchief a month and could prove it.—Mr. Arnold remanded her.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206237020.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 831, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3546, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]