[{"id": "99d0aa6e7d317a2e825a29af3b57a80bcd8dd407", "text": "THE LONDON SCHOOL BOARD.\n\nAt the usual weekly meeting on Thursday, when the chairman, Mr. J. Diggle, presided, the Rev. Andrew Drew moved:—\"That in the opinion of the Board a dual inspection of the schools is unnecessary, and is a cause of undue expenditure; that this Board does therefore hereby decide that the service of the Board Inspectors shall be discontinued.\" An amendment proposed by the Rev. Charles Brooke and seconded by the Rev. Rhodes Bristowe:—\"That the proposed resolution be referred to the School Management Committee\"—was carried.\n\nOn the motion of Mr. Helby, it was resolved that returns be made of the present existing contracts—with the exception of the building contracts—giving the names of the contractors, their trade, and description of the article contracted for.\n\nOn the motion of Captain Probyn, it was resolved by 26 to 14:—\"That it be referred to the Finance committee to consider, and report to the Board the steps necessary to be taken in order to extend the period for the repayment of the sinking fund from 50 to 100 years.\"\n\nMr. Helby moved:—\"That a return be compiled showing the names of all persons in the employ of the Board on the 1st of December, 1885 (except teachers and school keepers), showing their age, how employed, hours of employment, date of appointment, rate of pay on appointment, present rate of pay, and how occupied previous to coming into Board employ.\"—The resolution was carried by 25 to four against.\n\nThe Rev. Arthur Jephson said that there was a great desire among the ratepayers that there should be some means by which they could see the accounts and expenditure of the Board. This desire was very great among a large body of working men. He therefore moved:—\"That an abstract be published periodically in the daily press, and as Lloyd's Weekly Newspaper had a very large circulation and was very generally read, that the advertisement should also be inserted in that newspaper.\"—Mr. Foster seconded the proposition.—Mr. Ross thought they ought not to go to such an expense.—Lieut.-colonel Hughes, M.P., said it was no part of their duty to communicate with the ratepayers through the newspapers.—Mr. E. N. Buxton, M.P., said he was not at all opposed to giving the ratepayers the desired information, and he proposed:—\"That the subject be referred to the Finance committee,\" which was finally adopted.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206261127.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 554, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2369, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]