[{"id": "9133a404d923b7efd423daf6e98c4a3bb2a14759", "text": "A Serious Mistake.—Alexander Syme was indicted, at York, for a burglary committed in the house of Henry Thomas, at Leeds, on the 28th of September last.—The prisoner asserted that he was drunk at the time, and got into the house by mistake, through the kitchen window, which he found open, and not by the hole through which coals were let into the cellar, as asserted by the prosecutor. The judge told the jury that, unless they were satisfied that the entry had been made by the cellar hole and not by the kitchen, they could scarcely be justified in finding the prisoner guilty even of the breaking; but he further told them that, even granting that they were of opinion that the prisoner had come into the house through the cellar, there would yet remain for their consideration the question as to the intent with which the prisoner had entered it. Acquitted.\n\nChild Murder.—Bridget Kelly stood indicted at Liverpool for the murder of William Moran, an infant child, at Manchester, on the 21st of October last. She had been delivered of the child in a workhouse at Manchester on the 7th of October, and on the 25th of the same month the body of the infant was taken out of the Ashton canal. When taken into custody she said, \"I have nothing to say but that I did it. I went through a brick croft and threw it into the canal. It was covered with thrush.\" She did not know where the father was, and necessity impelled her to the deed.—The jury returned a verdict of \"Guilty,\" with a recommendation to mercy. Judgment of death was then recorded, and the judge said the recommendation of the jury should be carried out.\n\nAn Unlucky Legacy.—John Weavers was indicted at York, for stabbing his wife, Hannah Weavers, on the 7th of August last. A quarrel had arisen about a small legacy which the wife had just received, and which she told the prisoner she \"had made all safe before she left York.\" This irritated the prisoner, who aiming a blow at the prosecutrix's neck, cut her slightly just over the carotid artery, and immediately under the left ear, with the knife in his hand. The jury found the prisoner \"Guilty\" of unlawfully wounding and he was sentenced to be imprisoned for two years, with hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206314917.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 523, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2209, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]