[{"id": "7c282f152debf0f92136187357a8b8f855fc2a9a", "text": "RESPIRE OF HASLER.\n\nMr. F.C. Frye, M.P., for North Kensington, has received the following letter:—“Whitehall, January 25th, 1893. Sir,—Adverting to your application on behalf of Walter Hasler, convicted of murder and sentenced to death, I am directed by the Secretary of State to inform you that he has had under his consideration all the circumstances of this case, and that he has felt himself justified in advising her Majesty to reprieve the capital sentence, with a view to its commutation to penal servitude for life.—I am, sir, your obedient servant, GODFREY LUSHINGTON.”\n\nA BRUTAL GLOVE CONTEST.—At the National Sporting Club in Covent Garden a twenty-round contest was decided between Stanton Abbott and Sam Baxter, two of the best-known light-weights in the country. The fight was of a very protracted character, the end not being reached until the eighteenth round. In the tenth round there was some terrific exchanges. Baxter lasted until well into the eighteenth round, when, after sinking out to the ground, he only got up again to box feebly for a few seconds before holding out his hand in token of defeat.\n\nTHE BROMSGROVE MURDER.—The French hawker arrested in Brussels for the Bromsgrove murder is also, it is stated, wanted in this country on several charges of theft. It is alleged that he was a colonel’s servant, and made away with several articles of his master’s wearing apparel. When last seen in England he was hawking envelopes from house to house, and there is no doubt that the object of his visit to Bromsgrove was to get money. The necessary papers for Maurier’s extradition are being prepared.\n\n—The inquiry on Charlotte Pearcey, the old woman who was murdered at Lickey End, near Bromsgrove, on the 13th ult., was resumed. The axe with which the murder was committed was identified by a Birmingham joiner, from whom it was stolen on the previous day. He attributed the theft to a man who had been loitering about, and who answered the description of the supposed murderer. A youth said he saw a man answering to the police description near Pearcey’s house shortly before the murder. The coroner remarked that the motive of the crime appeared to be murder and robbery, although only a few coppers were taken, and the only possible verdict was wilful murder. The jury returned a verdict of wilful murder against some person or persons unknown.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811267.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 563, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2373, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]