[{"id": "96653f21efe1f1a89b488cc99ec2f4d9a8ad0321", "text": "EXECUTION AT NEWGATE.\n\nOn Monday morning Thomas Pratt, 27 years of age, a bargeman, was executed within Newgate gaol for the murder of Elizabeth Frances Brockington, in Wilderness-row, St. Luke's, in September last. The prisoner professed strong love for the deceased, and this feeling was embittered by jealousy because of her refusal to live with him. So he resolved, he stated in his own way, that she should not become connected with any other. He did not in any way attempt to extenuate his act, and at the trial it was attempted to show that he was not in a responsible state of mind at the time. The convict was a very ignorant man, what little education he had having been obtained at the Field-lane Ragged school, to which he had belonged, and in regard to religious duties he had entirely lapsed. He was attended by the Rev. Mr. Jones, the ordinary of Newgate, to whose ministrations he became attentive and resigned. The condemned man rose on Monday morning at six o'clock, when breakfast was provided, and the chaplain was soon afterwards in attendance, remaining with him till close upon eight o'clock, when Alderman and Sheriff Nottage, Mr. Undersheriff Crawford, the Governor of the gaol (Mr. Smith), and Marwood, the executioner, went to the cell. The unhappy man was silent while being pinioned; but, as the procession was going to the scaffold, the rev. gentleman by the side of the condemned reading part of the Litany for the Dead, the prisoner said, \"I do believe that.\" He was a stoutly-built man, wearing a blue guernsey, and he walked with an air of indifference to the place of execution, on emerging into the prison yard turning to survey the surroundings. While Marwood was performing the last grim offices prior to drawing the bolt, the convict gazed steadily upwards at the beam and dangling apparatus, as if it possessed a sort of ghastly fascination for him. The drop was six and a half feet, and the prisoner appeared to die instantly. The body, after being suspended for the usual regulation period, was cut down, and, the formal inquest having been held, was interred within the precincts of the gaol.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206329286.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 507, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2135, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]