[{"id": "4fff8656e70a6f9ece7e7105c568f5fd02bee3b3", "text": "STRANGE DISCOVERY OF A BURGLARY.\n\nYesterday, at Bow-street police-court, Thomas Britton and Louisa Carroll, well-dressed young persons, were charged with committing a burglary in Tavistock-street.—The prosecutor, Mr. Bell, refreshment contractor, residing at 42, Tavistock-street, Strand, deposed that during his absence at the restaurant of the Gaiety theatre, where his wife assisted, on the night of the 19th ult., his house was broken into, and a large quantity of wearing apparel, silks, jewellery, &c., worth upwards of £100, were stolen from the house, the front door having been opened by a skeleton key, and one of the upper doors forced apparently by a \"jemmy.\" It was done between nine and 11. The apprehension of the male prisoner was effected in a very remarkable way by Sergeant Boyell, of the Detective police, who happened to be on the look out between 10 and 11 on the night of the robbery, and saw the male prisoner come out of a fried-fish shop in the neighbourhood of Drury-lane. When, later at night, he heard of the burglary, his suspicions were directed towards the prisoner, whom he knew to be a notorious thief, and who had been before convicted of burglary. On going to the prosecutor's he found that, on the return of Mrs. Bell to her house after the robbery, with her sister, the latter had picked up a piece of newspaper (the Church Review), which she found on the stairs, and which was stained with grease, and had some fish-bones still adhering to it. As this bit of paper had been evidently dropped by the thief who entered the house, he made inquiries at the fried-fish shop, where he remembered seeing the prisoner Britton, and he then found that the fish-vendor had a large quantity of old Church Reviews, being the same year's date (1875) as the fragment, and found at the prosecutor's house.—Mr. Abrams said there was nothing in this evidence, as hundreds of fish-shops had no doubt the same paper for the same purpose.—Mr. Flowers: And this is what the Church is coming to (laughter).—Sergeant Boyell said he had inquired at 20 other fish-shops, and no other copy of the Church Review was to be found, except at this man's.—Mr. Flowers: I suppose he must be a Nonconformist fishmonger (laughter).—In answer to Mr. Abrams, Mrs. Bell stated that no one had been to a fish supper at her house that night; in fact, no one was in the house at all.—Mr. Flowers: Besides, I presume, when your friends come to sup with you they don't bring their own food (laughter).—Mrs. Bell identified the earrings, which had been pawned at Clarke's, Long-acre, by the female prisoner, who cohabited with Britton, and an umbrella and meerschaum pipe found on the male prisoner were identified by the prosecutor. The officer who apprehended Carroll said that she denied having ever pledged anything at Clarke's at first. None of the other property had yet been traced. Both prisoners were committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206327774.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 721, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2924, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]