[{"id": "24f19505a2d8b6d2839fd4fac139850e79740d92", "text": "THE CHARGE AGAINST MOLLOY.\n\nPatrick Molloy, aged 26, of 43, York-street, Dublin, described as a clerk, was further charged at Bow-street police-court, on Thursday, with having committed wilful and corrupt perjury, in evidence given in the Parnell commission, on Dec. 7, 1888.\n\nMr. John Walker, recalled for cross-examination, said: It was on the second occasion I met prisoner I told him I knew all about him. I did not tell him that if he answered certain questions I would repay him or that he would lose nothing by it. I did not tell him I would recoup him for any loss for giving evidence for the Times. I did not offer him anything for loss of time. I never offered him money to give evidence. He never said he would require money before he went into the witness-box. On the occasion of the interview at Mr. Beauchamp’s house, Mr. Beauchamp came in and said, “This is Mr. Walker, who is acting on behalf of the Times.” I told him Molloy wanted a guarantee. He told Molloy it was all right. Molloy paused for a moment. He said he would make the statement to me. Mr. Beauchamp is not agent for the Times, and if Mr. Soames had sworn that he was it is not within my knowledge. I communicated with Mr. Houston, secretary of the Irish Loyal and Patriotic league, with reference to the guarantee. I have been in Mr. Beauchamp’s employ three years. Before that I was engaged in the election at South Tyrone by Mr. Russell in the first instance, and afterwards by the Loyal and Patriotic league.\n\nWhat is your pay from the Times?—I never heard anything about pay at all. I have been paid nothing. I have seen several witnesses on behalf of the Times, and have taken the statements of some. I have taken the statements of two witnesses who have given evidence before the commission. The prisoner’s statement was one, and Thomas O’Connor’s was another.\n\nAre you aware that he has made a sworn retraction of the evidence given by him before the Commission, and that the statement was false?—I can only say that the Freeman’s Journal has published a statement to that effect, which I don’t believe. I have an action against the Freeman’s Journal for libel. I do not believe that Thomas O’Connor made the statement.\n\nAfter being formally cautioned the prisoner said: I plead “Not guilty.” I reserve my defence; I have nothing to say.\n\nHe was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206268689.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 580, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2354, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]