[{"id": "159802bd69e049577d25c15c35c2c40677430ab2", "text": "THE COURT.\n\nOn Monday, the Queen Dowager left her residence, Bushy-house, Bushy-park, accompanied by the Duchess Ida of Saxe Weimar, for the purpose of witnessing the naval review off Spithead. On Tuesday the Queen and Prince Albert, accompanied by their Majesties the King and Queen of the Belgians, left Buckingham Palace in a carriage-and-four, at a quarter past nine o'clock in the morning, escorted by a party of the 4th Light Dragoons, for the terminus of the South-Western Railway at Nine Elms, whence they proceeded by a special train for the purpose of being present at the naval review at Portsmouth, and afterwards of proceeding to Osborne-house, Isle of Wight. On Wednesday the Queen and Prince Albert, and their Majesties the King and Queen of the Belgians, walked in the pleasure grounds adjacent to the mansion. Her Majesty and her Royal Consort, and their Belgian Majesties, afterwards drove out in two pony carriages, with outriders, to King's key, returning through the Barton estate to Osborne house. On Thursday, the Queen and Prince Albert, accompanied by their Majesties the King and Queen of the Belgians, attended by the Royal suite, left Osborne-house, embarked on board the Royal yacht for Gosport, and travelled to town by a special train on the South-Western Railway. From the Nine Elms terminus, the august party proceeded to Buckingham Palace, in three carriages and four, escorted by a party of the 4th Light Dragoons. At four o'clock, their Majesties the King and Queen of the Belgians left Buckingham Palace in a carriage and four, on their return to the continent. Their Majesties and suite proceeded to the Bricklayers' Arms station, and left by a special train on the South Eastern Railway for Dover, en route to Ostend. In the evening, her Majesty and his Royal Highness Prince Albert, went to the Italian Opera. Her Majesty the Queen Dowager, and their Serene Highnesses the Duchess Ida, the Princesses and Prince Edward of Saxe Weimar, left Ryde and were conveyed in a steam-packet to Gosport, and thence, by a special train on the South Western Railway, to the Nine Elms terminus, proceeding in five carriages to Marlborough-house. On Friday, the Queen held a Court at Buckingham Palace. Afterwards, the Queen Dowager paid a visit to her Majesty, accompanied by their Serene Highnesses the Duchess Ida of Saxe Weimar, and the Princesses Anna and Amelia of Saxe Weimar. The illustrious party partook of a déjeuner with the Queen and Prince Albert, and afterwards returned to Marlborough-house. In the afternoon, his Royal Highness Prince Albert presided at a meeting of the Commission for promoting and encouraging the Fine Arts in the rebuilding the Palace of Westminster. Today (Saturday) her Majesty and his Royal Highness Prince Albert, accompanied by the Infant Royal Family, and attended by a limited suite, left Buckingham Palace for Osborne house, where the Court will remain until the prorogation of Parliament. Within a day or two afterwards, her Majesty and his Royal Highness will take their departure, in the royal yacht, from the Isle of Wight, and proceed direct to the continent, en route to Germany. The Infant Royal Family will remain at Osborne-house during the absence of the Court.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206187528.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 741, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3241, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]