[{"id": "a2403137565142d003b8c25b54dd355425ab020d", "text": "SMART CAPTURE OF ALLEGED HOUSE-BREAKERS.\n\nAt the Lambeth Police-court, Charles Court, forty-eight, who refused his address, but described himself as a boot rivetter, and Henry Payne, forty-seven, described as a general dealer, of no fixed abode, were charged before Mr. Biron with being concerned together in breaking and entering the dwelling-house, No. 10, Cavendish-villas, West Norwood, and stealing therefrom various articles of jewellery, value £6, the property of Henry Nutt. They were further charged with stealing from the same house several articles of jewellery, value £30, the property of Sydney Brigden. Police-constable Whitehead, 411 P, stated that at about twenty minutes past five on Wednesday evening he was on duty at the Knight's hill Police-station, when a girl made a statement to him. In consequence of what she said he went to prosecutor's house, and, upon looking through the side entrance, saw the prisoner Court climbing the fence at the rear of the house. Witness chased Court over several fences, and eventually caught him in Thornlaw-road. Court then dropped two watches, a gold Albert, and four skeleton keys. When searched at the station, a silver bracelet, a silver locket, and four skeleton keys were found upon Court. Police-constable Howard, 538, said he was on duty in St. Julian's Farm-road about twenty minutes past five, when a communication was made to him by a boy. He went to the prosecutor's house, and saw the prisoner Payne climbing the fence at the rear. He went after him over several fences, and came up with him in Thornlaw-road. Payne then exclaimed, \"All right, I'm done.\" When searched at the station a gold watch and a metal watch were found upon him. Upon the application of Inspector Silver, who stated that the prisoners were well known, Mr. Biron granted a remand.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812918.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1522, "total-output-tokens": 440, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1822, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]