[{"id": "f389f84f95646250678c34a0ceb565c073f232b8", "text": "WESTMINSTER SESSIONS.\n\nThese sessions commenced yesterday morning. In the absence of F. Cossar, the assistant chief constable, who was engaged in seriously ill Mr. Rawsthorne, of Queen-square police-office, presided.\n\nHarriet Dixon, an interesting looking young woman with a charming smile, was indicted for feloniously obtaining, on the 21st of December last, a sovereign, a half-crown, a shilling, and a sixpence, the moneys of James Barnes, from his house.\n\nThe prisoner, from the statement of the prosecutor, who is a porter in Charles-street, Hasmarket, that he accompanied the prisoner to her lodgings in Whitechapel Road. He had been there about two months before she stole the money, and charged her with the robbery, which she denied. A policeman was sent for, upon which she produced a bill, at which time she said she had been robbed. The money was then made up, and a sovereign found in the bed, between the sacking and the mattress, but the prisoner disclaimed it. She had seen a young man in the street, who appeared to be very much alarmed.\n\nThe prisoner protested her innocence.\n\nWilliam McCoy, a watchmaker, of Bridgeway Road, City, stated that he had been employed by the prisoner, who had known fourteen years, and who had always behaved in an honest character. Her sister, who seemed deeply affected by her case, offered to provide some money for her, but without success, according to the prisoner.\n\nThe 7s. 9d. were re-tracted, and she, the sovereign remains in the custody of the High Bailiff. The prosecutor was not allowed his evidence.\n\nThe prisoner was committed for trial.\n\nThe 7s. 9d. was indicted for stealing one boot, value 16s., the property of Samuel Conley, boot-maker, in Old Compton-street.\n\nPolice constable Robert Smith, that on the 11th of December, about nine o'clock in the evening, he saw the prisoner and another man lurking about the prosecutor's shop, and watched them. They then entered the shop, and took a pair of leather slippers next door to the shop, and reach down into the boot, which was hanging over the shop window. He then attempted to take its contents, but was prevented by the owner, who came out, and seized the prisoner. His companion ran off.\n\nCHAIRMAN: Are you not placed in the streets to prevent robberies? Why do you not give notice to shop-keepers, instead of waiting until they commit some depredation?\n\nPOLICEMAN: Oh! if we were to turn back, they would go somewhere else.\n\nThe prisoner was found guilty, and sentenced to three months' imprisonment and a fine.\n\nJames Kelly, a fishmonger, and a native of Ireland, whose deposition indicated that he had seen better days, was convicted for stealing 3lbs. of salt beef, value 1s. 6d., the property of Phoebe Henry, of Great Marlborough-street.\n\nThe prisoner was buying some meat, saw the prisoner put the beef into his handkerchief, and walk off with it. He told the shopman; they both pursued him; he admitted what he had done as described, and gave him into custody to a policeman.\n\nThe prisoner cross-examined the witness with considerable spirit. The shopman, in answer to a question, had suited it with his own hands.\n\nThe prisoner addressed the jury, saying that he never knew of his profession. He will undertake to swear to a piece of beef because he salted it. At the police-office he swore, \"I had not promised them anything.\" He asked the jury to judge of that point; but I ask you, men of sense, whether I should not have gone five yards, or more, in a contrary direction? Then, sir, it was said I wrapped the meat in a handkerchief. Where is the handkerchief? Why did not prosecutor take it? Remember, you may see the result of these observations.\n\nThe jury instantly pronounced the prisoner guilty.\n\nThe Coroner regretted to hear of men who evidently have nothing to live for, and nothing to lose; in such a situation, and sentenced him to one month's imprisonment and hard labour.\n\nWilliam Robinson, a fashionably-dressed man, about 40 years of age, was indicted as an evil-disposed person, and charged with an assault upon John Garvey, a private of the 21st battalion of Grenadier Guards.\n\nThe prisoner, in answer to the prosecutor, said he had been instructed at the instance of the officers of the regiment.\n\nThe prosecutor stated that while he was on duty on the evening of the 28th November last, near a corner Park, near the Turkish Inn, the prisoner approached him and asked if a young woman had passed that way? It was a quarter past eight, and the prisoner said that it was o'clock? and prosecutor told him a little after six. The prisoner then made a peculiar gesture with his hand up to his own person, and instantly received prosecution. The prisoner then told him there was not a young woman, and he should take him into custody for that insult. The prisoner dared him to leave his post, or he would run as fast as he could. Prosecutor and prosecutor pursued him until they got to the next sentry, at the Treasury, when the prisoner called out, \"Why don't you rob me?\" and threw his stick at him. The prisoner then went to the Tilt Yard, where the sentry at that place assisted in securing him.\n\nJohn Davis and Robert Howard, the other constables, confirmed the evidence.\n\nWilliam Rhodes, sergeant, took the prisoner into his custody at the guard-house. He was well armed with all the officers of the regiment, and was ordered to detain him. The prisoner shook his head, and wanted him to go and bring him with him.\n\nThe prisoner in the most solemn manner protested his innocence of any charge. He did not throw his stick at the soldier but raised it to partly a threat of his bayonet. It was impossible the soldier could see any great part of his hands for the night-cap and the worsted stocking. He immediately maintained his friends with his situation.\n\nGarvey was called, and stated that he never attempted to hit the bayonet in any way. He was three yards from the prisoner when he threw his stick, and he wore no gloves at all.\n\nThe jury retired to consider their verdict at five o'clock, and returned there was no chance of their agreeing. Some went to sleep, having declared that they would stand out till the morning.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3207642541.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 510, "total-output-tokens": 1412, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6173, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]