[{"id": "27e9ca326246af004535b541c3f16333eac2e861", "text": "THE STRANGE DEATH AT A RETFORD HOTEL.\n\nAn inquest at the Queen's Hotel, Retford, Notts, touching the death of Mr. Thomas Wright, of Horncastle, who called at the hotel on Monday night, took a bed, and was found at noon on Tuesday dying from the effects of poison. The deceased had previously stayed at the hotel with his wife; to whom he had only been married about a couple of years, and he also had friends at Retford. Although he had been engaged in farming, it is said he formerly learnt the drapery business with a well-known Retford firm. Thomas Wright, farmer, of Keasith, near Gainsborough, said he had viewed the body, and recognised it as that of his cousin, Thomas Wright. For the past twelve months he had been acting as a village merchant's agent, and was forty-four years of age. The deceased was formerly a farmer at Stowe, in Lincolnshire, but since the 6th of April he had been residing at Horncastle. He last saw the deceased in July at Horncastle. The deceased was a married man, and his wife, who was recently confined, was unable to attend the inquest. He was not aware that the deceased had any business that would call for his presence at Retford last Monday, but he had heard that he was in pecuniary difficulties. He was a man of sober habits. George Gomer, proprietor of the Queen's Hotel, said the deceased came to his house between six and seven o'clock on Monday evening. The deceased was a very reserved man, and on this occasion was particularly quiet. He had nothing to drink, but smoked a cigar before tea. After tea he came again into the bar, and asked to be shown to his bedroom, saying he had been travelling a good bit and wanted a wash. When he came down he went across the road to see Mr. Sprentall, a friend, and returned about nine o'clock, when he had one glass of bitter and a cigar, and sat until ten o'clock, when he asked witness if he would put him a little brandy in a bottle, and he did so. The bottle produced was the one he used, and there did not appear to have been any of the brandy taken. The next day, as he did not come down, witness knocked at his door about ten minutes to one, but there was no answer. Not being able to wake the deceased by knocking and kicking at the door, he told his man, William Chappell, to get a ladder and enter the bedroom through the front window. When his man entered the room he called out, \"He is a dead man, sir,\" and Chappell then unlocked the door and let witness in. The deceased was in bed undressed, lying on his back, making a peculiar noise when breathing. He immediately loosened the night-shirt of the deceased, as it was pressing on his neck, and then told Chappell to go for a doctor as quickly as possible. He saw the bottle containing brandy and another bottle empty, and a tumbler on a chair by the side of the bed. He smelt the bottle, which was empty, and it appeared to him that it had contained laudanum. He sent for the police, and Dr. Thomson's assistant, Mr. Powell, and Police-constable Bailey came to his assistance. William Sprentall, of Queen's Cottage, West Field, said deceased the previous night appeared to be in excellent spirits. William Chappell, ostler at the Queen's Hotel, described getting through the window, and finding the deceased in a dying state. Thomas Powell, assistant to Dr. Thomson, Retford, said he found the deceased lying on the bed, his face congested, his lips blue, the pupil of the eye contracted, and a very feeble pulse; the body was warm, and slightly perspiring. From finding the bottle and glass which had contained laudanum on the chair at the bedside he formed the opinion that the deceased was suffering from opium poisoning. Witness remained until he died, about a quarter to three the same afternoon. George Thomas said he came to the deceased shortly after two o'clock, and found his assistant and Police-constable Bailey already in attendance. The symptoms were as described, and emetics were given, and the stomach pump used without effect. The circumstance bottle and tumbler glass produced was in the bedroom. The bottle had undoubtedly contained laudanum, and he believed also the glass, but there had been something else also in the glass. He remained until the death of the deceased, and was satisfied that the cause of death was laudanum poisoning. Police-constable Bailey also gave evidence. The jury returned a verdict of suicide whilst in an unsound state of mind.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812527.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1037, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4431, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]