[{"id": "50552494da69b9940caacae9472e36131c5f2ca7", "text": "THE SINGULAR CHARGE OF CONSPIRACY.\n\nAt Marlborough-street police-court, on Thursday afternoon, Mr. Robert Gordon Hope Johnstone, 66, Thistle-grove, and Mr. John Henry Smallpage, tailor, Maddox-street, surrendered for further hearing on a charge of conspiracy. — Mr. Serjeant Ballantine having intimated that as most of the bills had been returned to Mr. Milbanke, it was more than probable that an understanding would be arrived at between the plaintiff and defendants, Mr. Knox said the case was entirely in Mr. Serjeant Ballantine's hands, and if he thought proper to withdraw from the prosecution he (Mr. Knox) would offer no obstacle. He confessed he thought the case very weak, and he did not think it was one upon which a jury would give a conviction.—The solicitors on either side having consulted together for some time, Mr. Serjeant Ballantine said that, while there was no doubt as to the importance of the question as regarded Major Johnstone's misapplying the bills, still he quite coincided with the learned magistrate's judgment that he was trustee and not bailee in the matter, and he confessed that he thought that his worship would, in the conclusion, decide that there was no case to send before a jury. The bills had been given up, and he was told that Mr. Smallpage never had the bills, and he hoped that no imputation from any remarks of his would be left upon Mr. Smallpage's character, and he begged, with the permission of Mr. Knox, to withdraw from the prosecution.—Mr. Besley said that Major Johnstone had never broken any engagement he had entered into with Mr. Milbanke; and if he were put on his oath he could give a satisfactory explanation of the present transaction. He was quite willing to meet the question in any court, and to answer the imputation brought against him.—Major Johnstone: Most certainly.—Mr. Digby Seymour said there had been nothing from first to last that in the slightest degree implicated Mr. Smallpage in a fraudulent transaction.—Mr. Knox said that Major Johnstone's conduct had been most unsatisfactory, to say the least of it; for looking at his age and the age of the young gentleman (Mr. Milbanke), he ought to have protected him, instead of which he (Mr. Milbanke) had been swindled out of £10,500l. As regarded Mr. Smallpage, he was bound to say that he believed he was perfectly innocent of the charge preferred against him. He accordingly dismissed the case.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206236642.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 578, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2422, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]