[{"id": "c9b1983e1b8a3d8984e15169f53a5669c6f1d7f6", "text": "MANSLAUGHTER.—Emma Augusta Papworth, aged eighteen, was charged upon the coroner's inquest with the manslaughter of her female illegitimate child.—Mr. M'Donnell declined to offer any evidence in support of this charge, and the prisoner was tried upon an indictment which alleged that she had endeavoured to conceal the birth of the same child.—The prisoner was an unmarried young woman, living with her parents at Mile end; and from some appearances observed by her mother, she taxed her with being in the family way, but she denied it. One day, however, the mother of the prisoner happened accidentally to put her hand into a box in the prisoner's bedroom, and she there found the dead body of a child, of which the prisoner had, no doubt, been delivered about a fortnight before.—The jury found the prisoner \"Guilty,\" and she was sentenced to be imprisoned, without hard labour, for two months.\n\nFELONIOUS ASSAULT.—Robert Pearl, seventeen, was charged with committing a felonious assault upon Sarah Patty, a girl under ten years of age.—The jury found the prisoner \"Guilty\" of the attempt only, and he was sentenced to be imprisoned and kept to hard labour for one year.\n\nROBBERY WITH VIOLENCE.—George Chambers, twenty-two, labourer, was charged with committing a robbery, accompanied with violence, upon George Steer.—The prosecutor is one of the city police, and on the evening of the 9th of January, he was on his way home in plain clothes, when on passing through Flower and Dean-street, Spitalfields, he was assaulted by four men, one of whom seized him round the throat, and forced him down, and while upon the ground he was robbed of all the money in his pockets, a sovereign and 6s. in silver. All the men got away, and the prisoner was not apprehended until the 25th of March. The prosecutor swore positively to his being one of the party by whom the robbery was effected, but he admitted that he had a very slight opportunity of observing the persons of the men who attacked him.—Mr. Cooper urged that the evidence as to his identity was inconclusive, and the jury returned a verdict of \"Not guilty.\"\n\nEMBEZZLEMENT.—John Robert Gibson, forty-six, solicitor, was indicted for embezzling 60l. 11s., 3½s., and 10½s., the property of the Eastern Counties railway, his masters. The jury retired, and after an absence of about an hour, returned a verdict of \"Guilty,\" and at the same time recommended him to mercy on account of his previous position and good character, and the lax manner in which the accounts were kept.—Sentence, eighteen months' hard labour.\n\nTHE EXTENSIVE SILK ROBBERY.—George Blackmore, twenty-eight, paper-stainer, and George Haddon, thirty-eight, packer, were indicted, Haddon for stealing 20lbs. weight of silk, value 53½s., and other goods, the property of Henry Fandel and another, his masters, and Blackmore with feloniously receiving the same, knowing it to be stolen. The prisoner Haddon had been for many years servant to the prosecutor, Messrs. Fandel and Phillips, the well-known silk and Berlin wool merchants, Newgate-street, and had, it appeared, for a long period been plundering his employers of silk braid and heads of great value. A man named Freak was originally charged with the other prisoners, and whilst under remand in the cell he committed suicide.—The prosecutor had lost above 100lbs. weight of silk, varying in value from 51s. 6d. to 70s. per lb., which it appears was sold at prices varying from 12s. to 22s. 6d. per lb.—The jury found the prisoners \"Guilty,\" and Blackmore was sentenced to eighteen months' imprisonment with hard labour, and Haddon to seven years' penal servitude.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206210942.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 886, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3639, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]