[{"id": "c13d87411450ee10fc8950e0f3a812127b9da7ef", "text": "ALLEGED MURDER OF AN INFANT IN A BROTHEL.\n\nYesterday (Saturday), at the Bow-street Police-court, a man of middle-age, having appearance of a foreigner, and who refused to give his name, was brought before Mr. Jardine, charged with being concerned in the death of a male child, two days old.\n\nThe deposition of the witnesses were to the following effect:—And Charles, aged 21, was a house, No. 9, Upper Wellington-street, Strand (a brothel), was confined with a male child on Wednesday last; Dr. Booking, of Bow-street, attending her accouchement, for which he stated, she appeared much unprovided. The child continued in health up to twelve o'clock on Friday, at which hour Dr. Booking saw it at the house of a woman named Barber, who had been consigned to nurse. On Friday evening, at six o'clock, the same medical gentleman was seen visiting Barber's house, and on his arrival, he found the child had expired about fifteen minutes. On examining the body, the legs were found drawn upwards, the hands clenched, and nails discoloured. A post mortem examination was made in presence of Mr. Charles Guthrie, when great congestion, and distended with extravasated blood, was apparent on the lungs and brain, the stomach empty, the viscera having a healthy appearance, while the face was livid and the skin discoloured. From these circumstances, both medical men decided on the child having died from suffocation.—Sarah Barber deposed to having taken the infant under her charge to dry nurses, on the night of Wednesday last, at which time instructions were given her to bring it the following morning; on doing so, she was desired by Mrs. Cleveland to leave the bed with her in bed and quit the room; a person wished to see it who wished to see it in bed (Barber's statement). Returning to the house in an hour and a half, the child was exceedingly ill, breathing hard, with a discharge from the nostrils; witness took the infant home and administered some castor oil. The next morning two imperative messages were sent for the child to be again taken to the mother. At this time it had recovered, and was asleep. In compliance with the order, Barber took the infant and delivered it to the mother in bed, when she was desired not to fetch it for two hours; on returning at that time she was informed by the servant that orders had been given by Mrs. Cleveland not to permit anyone to enter the room. At six o'clock, the bed-room bell was rung, and witness, on taking the child from the bed, found life extinct.—Ann Swann, servant at the above Nell, stated that the accused had been employed by her mistress, who spoke of him as \"the gentleman.\" Great care was taken to prevent his being seen in the house on the morning of Wednesday last likewise at 10 o'clock on Friday morning in her mistress's bedroom. This witness corroborated Barber's statement in every particular, and added that her mistress had, previous to her confinement, declared the child would not be born alive.—Mary Davis, a lodger in the house, swore that Ann Cleveland had on different occasions stated that the child would have £100 a-year settled on it, which, in the event of its death, must revert to herself.—Charles Smith, in the employ of Mr. Arons, Strand, was at the house No. 9, on the afternoon of Friday, at a quarter to five o'clock, and saw the accused pass cautiously along the passage, and quit the house. There being other evidence of a circumstantial character forthcoming, the prisoner was remanded until Tuesday.\n\nTHE MURDERS AT MIREFIELD.\n\nAPPREHENSION OF ANOTHER OF THE SUPPOSED MURDERERS.\n\nThe murders of Mr. Wraith, his wife, and servant girl, at the village of Mirefield, which are almost unexampled in England's calendar of crimes, have excited the curiosity, and have produced the most thrilling sensation throughout the county. The unfortunate creatures sacrificed were (excepting the servant girl) between seventy and eighty years of age. They were much respected, being quiet, inoffensive people. The house which they inhabited, and where the horrible crime was perpetrated, stands in a somewhat secluded spot, about 150 yards from the public road, and no other building near for some 200 yards. Mr. Wraith is known to have possessed a considerable sum of money in the house, which cannot now be found, leaving no doubt that plunder was the object of the murderers, for it is pretty evident that more than one was engaged in the bloody affair. The horrible appearance of the sufferers can never be effaced from the memory of those who saw them. The skull of the man was forced to receive his jaw-bones, thrust out, the arms of the two females, broken, the fingers broken to pieces, as if the arms and hands had in vain been raised to protect the head from the fearful blows of the inhuman wretches. The sight was most horrifying. In places where the bodies lay were pools of blood, in which the teeth and brains of the deceased were lying. Amongst the first to enter the house after the discovery of the murder was Mr. Keenol, the landlord of the King's Head, at Mirefield, who states that the drawers and boxes in the house were open, and had been ransacked, and the blinds had been drawn down and pinned together to prevent persons looking in.—On Friday, Mr. Superintendent Green attended an interview with Mr. Robert Reid, who was seen, in company with the doctor (not already in custody), near the house at the time the murder must have been going on. Marks of blood were found on his clothes, and the police are in possession of circumstances which will in a great measure be the means of unravelling the mystery that at present exists. It is not true, as reported, that the mother of Ellis died suddenly in consequence of the news that her daughter was murdered having been communicated to her. She, however, is very ill, her illness arising from the shock to her nervous system by the awful death which has befallen her child.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206190488.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 1340, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5930, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]