[{"id": "9dce12503a39d7e754a7226ac98acf553f869658", "text": "WORSHIP-STREET.—(Yesterday.)\n\nSINGULAR CHARGE OF ROBBERY.—Clara Brown, aged twenty, servant in the family of Mr. William Robins, Adelphi-terrace, Mile-end, was charged at the Worship-street Police-court with stealing eleven sovereigns, under the following peculiar circumstances:—Mrs. Robins, a very lady-like person, stated that about six weeks since she engaged the prisoner as a general servant, but inadvertently neglected to make strict inquiries as to her character, feeling satisfied with the assurance of a woman with whom the prisoner was lodging, that her friend was all a servant should be. About a fortnight afterwards witness was confined, and at that time had a considerable amount of money locked in a deposit, placed in her own bed-room, the keys of which were in her own possession night and day. Recently, having occasion to open the box, she found thirteen sovereigns had been abstracted. A search was made, which resulted in the discovery of a key that opened the box in question, and as this must have been seen by the prisoner, being in her own room, she was given into custody. Witnesses were now produced who proved having made purchases for the prisoner, on all which occasions she gave them sovereigns to change, and these articles, quite out of the \"servant\" style, were produced in court. The most singular part of the affair was this, that the daughter of the prosecutrix, about twelve years of age, admitted to an officer having herself given the prisoner two sovereigns out of the thirteen, consequently a charge of stealing eleven only was entered, and whether the prisoner had incited the young lady to open the box with a false key, or succeeded in enjoining her to secrecy, did not appear. The magistrate told the prisoner—who naively replied to the charge, that there was not the slightest proof of her guilt because she had passed two or three sovereigns—that he should remand her.\n\nCLERKENWELL.—(Yesterday).\n\nGLANDERED HORSES.—Mr. John Birch, the well-known cab and omnibus proprietor, of Horseferry-road, Westminster, and John Smith, a horse-keeper, in his employ, were each charged at the Clerkenwell Police-court, at the instance of Mr. W. Love, the chief constable of the Royal Society for the Prevention of Cruelty to Animals, with the following serious offence:—James Rutherford, one of the Society's officers, deposed that yesterday afternoon, in the New Cattle Market, his attention was directed to two horses, amongst others, which appeared to be then in much suffering, were exposed for sale, and which upon examining he found to be glandered. He (witness) said he had had ten years' experience in veterinary matters, and he had no hesitation in saying the two horses were badly glandered, and consequently extremely dangerous to other horses that might come in contact with them. The two defendants admitted that the animals belonged to them, and therefore thought it his duty to bring them before the magistrate. Mr. Nice, the veterinary surgeon of the market, stated that his attention had been called by the previous witness to the horses in question, and he found them both glandered, one of them badly so. Mr. D'Eyncourt told the defendants that this was a very serious offence, and they had subjected themselves to a heavy penalty. What defence had they got to make? The defendant Birch said he was really not aware the horses were glandered when he sent them to the market, and as to Smith, he was merely acting under his (Birch's) orders. Mr. D'Eyncourt said the horses were not fit to live, and he wished to know what the defendant intended to do with them. The defendant Birch said he wished them to go to his horse slaughterer's on the other side of the water. Mr. Mould (the chief clerk) said there was a horse slaughterer close by, and such horses ought not to be allowed to travel through the streets. The defendant having consented to allow the horses to be taken to the horse slaughterer's named; Mr. D'Eyncourt directed the society's officer to see them slaughtered and examine them; and with regard to the defendants, the offence being a very serious one, he should bind Birch over in the sum of £50 and Smith in £25, to appear before him on Friday next, meanwhile the strictest inquiries should be made by the officers.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3202426393.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 961, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4287, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]