[{"id": "802335a7ac06a0cf110d620fae8011e3f2238e42", "text": "THE \"JUBILEE\" STAKES.\n\nAt Kempton Park on Friday there was a large company to witness the race for the great \"Jubilee\" Stakes, a handicap of 3,000 guineas. The following was the result:—Amphion, 3yrs., 7st 1lb (1); Screech Owl, 3yrs., 6st 12lb (2); The Rejected, 5yrs., 8st 3lb (3); Sixteen ran; Amphion, at 100 to 8, winning very easily by three lengths. An equal distance separated Screech Owl (100 to 8) and The Rejected (10 to 1). Linkboy was a good fourth, and Bullion fifth. Orbit (11 to 2) and Goldseeker (5 to 1) ran nowhere.\n\nTHE LASH WANTED.—William Coles, 37, stonemason, was indicted, under the Criminal Law Amendment Act, at the London County sessions (South), on Wednesday, for a gross outrage upon Beatrice Payne, aged nine. The jury found him \"Guilty.\" Sir William Hardman said he was glad to find from a bill lately introduced that the punishment of the lash for these offences was within measurable distance of becoming the law of the land. He had said over and over again that he was sure a sound flogging was the only thing which was calculated to lessen this class of offence, and it was the only sensible punishment for such unmanly conduct. At present he could only send him to prison, and he passed the highest sentence the law allowed him—12 months' hard labour.\n\nMr. Wm. Thomas Mason, Superintendent of Police, Great Western railway, who died at the age of 69, was buried at Hanwell on Monday, in the presence of a large gathering of railway officials. Mr. Mason was a very old officer of the company, having joined the service in 1847. He gradually worked his way to the front, and some years ago organised the company's police and detective departments, the control of which he held till his death.\n\nTO DARKEN GREY HAIR.—Lockyer's Sulphur Hair Restorer is the quickest, best, safest, and cheapest. Large bottles 1s 6d. Everywhere.—[Advt.]", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206269255.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 537, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1866, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]