[{"id": "a3511cf4c1671cf3f5fb835a5c48c17c26a9ce7f", "text": "SEQUEL TO THE NEILL CASE.\n\nABRAHAM GLADSTONE, twenty-seven, a well-dressed man, described as a tailor and giving an address in the East-end, was charged at Southwark Police-court, on Saturday, with stealing a watch and chain valued at £2, the property of Abraham Limberat, of 145, Stamford-street.\n\nThe prosecutor, who said he was a tailor, residing at 145, Stamford-street, deposed that on the 3rd inst., about eight o'clock in the evening, he heard his wife answer a knock at the door, and a few minutes later heard her scream. He rushed out of the room into the passage, and on the doorstep he saw the prisoner and three other men. The prisoner pushed forward, and instantly witness felt a \"tug\" at his watch chain, and saw the prisoner running away. He would not swear the prisoner took the watch and chain. Witness formerly lived at 118, Stamford-street. The prisoner and his friends in court had frequently visited the house, both before and after the two girls, Shrivell and Marsh, were poisoned.\n\nMr. Sydney (for the prosecution): I must object. Mr. Philcox (for the defence): I want to show what this man is, and also the animus that has caused the prisoner to be where he is. This man figured very prominently in the Neill case, when the coroner told him—\n\nThe Magistrate: The issue before me is whether or not he was robbed.\n\nRachel Limberat, the wife of the prosecutor, swore most positively that it was the prisoner who robbed her husband. Cross-examined: When witness lived at 118, Stamford-street, she let lodgings to ladies.\n\nPrisoner (in broken English): He try to do this to me before in the East-end, because I said when the case (Neill's case) was on, that he knew that I said—\n\nThe Magistrate: You had better leave your case in the hands of your solicitor.\n\nRowley Levy, a well-dressed young man, of the Hebrew persuasion, deposed that he was a farrier, and that for many years he had been the prisoner's \"pal.\" Witness and the prisoner were in the habit of visiting the prosecutor when he kept a house in the East-end as well as at 118 Stamford-street. Witness: We were there at the time the two girls were poisoned, and because we knew—\n\nThe Magistrate: Be quiet. You seem fond of referring to that case.\n\nBarnett Chen, who was passing at the time of the alleged robbery, said he was quite certain neither the prisoner nor the witness Levy was amongst the crowd.\n\nThe prisoner was committed for trial, bail being allowed.\n\nACCIDENT IN THE HUNTING FIELD.—Captain Paul whilst hunting with the Heythorn hounds near Woodstock on Thursday, was thrown at a wire fence, and sustained a severe concussion of the brain. He lies in a dangerous condition.\n\nDAMAGES AGAINST A CORPORATION.—In the Court of Queen's Bench, on Tuesday, a seaman named Taylor brought an action against the mayor and corporation of Sandwich for compensation for injuries received in the consequence of the breaking of a mooring-post to which his vessel was moored in Sandwich-Harbour. The jury found a verdict for the plaintiff for £175.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811328.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 737, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3025, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]