[{"id": "e39c90ac95600b2b79918694dc8aa542bfc2df4a", "text": "BRUTAL MURDER OF A POLICEMAN.\n\nA policeman of the Gateshead force named Graham was on Friday evening brutally murdered at Wrekenton, near Gateshead. The crime was the sequel to some police court proceedings earlier in the day. A man named Edward Wilkinson, known as the \"Flying Butcher,\" was summoned by Constable Graham for street brawling. He was a powerful man of 45, and was wont to boast of his prize-fighting powers. Latterly he was employed by a butcher carrying on business at Newcastle. His wife is a tripe hawker, and the family consisted of six children. On the night of the 16th inst. Police-constable Graham found Wilkinson turning his wife out of doors. Graham remonstrated, whereupon Wilkinson rushed into the house for a poker, and said he would do for him. The constable, however, pacified him, and he went indoors, but returned and used obscene language. He was summoned by Graham for brawling, and was fined 8s. 6d., including costs. He told Head-constable Elliott he would \"settle\" the policeman. Graham, after his duty, returned to the village in the afternoon. As he was passing Wilkinson's house the man rushed out with a knife in his hand, followed by his wife, who tried to hold him, but he struck her in the face, and made after Graham. Seizing the constable with one hand, he stabbed him in the chest, inflicting a frightful wound near the heart. The officer reeled across the road and fell, dying shortly afterwards. Wilkinson, before leaving Graham, took the truncheon from him and struck him on the head several times. He then returned through the village brandishing the knife and the truncheon, saying he had killed one policeman and would murder another—Police-constable Dodds, who, however, was away at the time. The murderer then made off into the country, pursued by several young men. The same night Wilkinson was captured at South Hylton, near Sunderland.\n\nEdward Wilkinson, butcher, was charged at Gateshead, on Monday, with the murder of Police-constable John Graham, at Wrekenton, on Friday afternoon, by stabbing him in the breast with a knife. The prisoner behaved composedly during the examination of witnesses, and declined to ask questions; but on being told that he would be committed to the assizes he broke down, and, weeping, asked permission to write to his wife. He was allowed to see her in the cells.\n\nThe coroner's jury on Wednesday returned a verdict of \"Wilful murder\" against Wilkinson.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206268511.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 587, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2444, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]