[{"id": "c1bd358fbf5c3a6067939c0b0a366845c1c94c7c", "text": "OUTRAGE AT BROCKLEY.\n\nA TERRIBLE outrage was committed in the Ladywell-lane, Brockley, on Thursday, upon a girl ten years of age named Nellie Price, who now lies at her aunt's home, Darfield-road, Crofton-park, in a sadly injured condition. About half-past six in the evening she was sent on an errand to the Brockley Jack public-house, distant about a couple of hundred yards from her home, and on her way there was accosted at a lonely part of the Brockley-road by a well-dressed young man, who said he had lost his purse and would give her twopence if she would help him to find it. She agreeing to do so, he sent her to a little oil shop a short distance away to buy a candle to facilitate the search. When she met him again he took her down the Ladywell-lane, a little-used thoroughfare which branches off from the main road past Brockley Hall and Ladywell Cemetery, and leads on to Lewisham. Then, pretending to look for his purse, he seized the girl, and attempted to outrage her. She struggled, and managed to regain her feet. He knocked her down with a blow which partially stunned her, and then stuffed a handkerchief in her mouth. Finally, after accomplishing his purpose the man ran down the road and disappeared. The little girl lay on the ground for some time in a half-conscious condition, but, on recovering somewhat, got up and walked towards her home. Two boys, named Pierce and Freeman, met her, and she told them that a man had nearly murdered her. Seeing that she could scarcely walk they assisted her, but as they were walking down the road towards her home they were met by a police-sergeant, to whom the child related her story. Mrs. Sims, becoming alarmed at the absence of her niece, had in the meantime gone in search of her, and was coming back when she saw the child, accompanied by the officer and the two boys, coming down the road. The girl was taken inside the house, and afterwards to the police-station, where she was first examined by the physician of the force, and afterwards by Dr. Boothroyd. So far no arrest has been made. The only description which the girl can give of her assailant is that he seemed to be about twenty-four years of age, and was very well dressed in a dark coat and lightish trousers. It is alleged that several other girls and young women have recently been molested in the neighbourhood.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811389.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 562, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2350, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]