[{"id": "ae83a819c0f7e0aa9a9b57a134c46d89658639f2", "text": "THE SUPPOSED CHILD MURDER AT BOW.\n\nFrederick M'Donald, forty-two, a sergeant of the Corps of Commissioners, and Annie Thomas, thirty-eight, a widow, both living at 3, St. Leonard's avenue, Bromley-by-Bow, were brought up on remand, at the Thames Police-court, charged with the wilful murder of the male child, aged eight days, of the female accused, on the 26th ult. Mr. Frayling prosecuted on behalf of the Treasury, Mr. Bedford appeared for M'Donald, and Mr. Searle was for the female prisoner. The female prisoner was still in a very weak condition, and had to be accommodated with a seat.\n\nThe evidence of two little girls, each a daughter of the prisoner's, was that the child was born on the 19th of March, and that it was apparently all right until the following Sunday. On that day M'Donald went up to the room in which the baby was lying, and on his return about ten minutes later he said to the female prisoner, \"Annie, I have some news for you. The baby is dead.\" Thomas replied, \"Is it,\" and M'Donald then said, \"I had better clear out of this, hadn't I?\" The female prisoner, who told her daughter that when she got up she would \"sit on the baby,\" told him to stop. The following Wednesday the children walked to Forest-gate, and were followed there by the female prisoner—their mother. The body of a child corresponding with the one missing was afterwards found at Ilford. An inquest was held, and a verdict of \"Found suffocated\" returned. One of the girls stated that Mrs. Thomas told her that the baby was going away to a \"big place,\" and this witness identified the chemise in which the body was found wrapped.\n\nDetective-inspector Mellish deposed that the female prisoner said to him, \"I was confined of a female child, but it died, and I did not know it. I do not know where it is now. I hope they will hang me. I am tired of life.\" Witness then said, \"I feel under the circumstances that I ought not to ask you any more questions, and I now caution you that whatever you say I will take down, and it may be used against you.\" He then charged her with being concerned with M'Donald with the wilful murder of the child. She replied, \"Mr. M'Donald knows nothing about my affairs. When I fell with the baby I must have been drugged. It was a trap set for me. The child died before I had a doctor, and as I did not have one then I was afraid to have one after.\" At the station she said, \"This man knows nothing about it. He is not the father of the child and knows nothing about it.\" The doctor said that suffocation might have been accidentally caused. Mr. Mead again remanded the prisoners.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811565.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 656, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2607, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]