[{"id": "e22c16e0a23c55d751ed9e052f8fff9db61f3541", "text": "LATEST OLD BAILEY TRIALS.\n\nTHE ALLEGED OUTRAGE AT HIGHGATE.—Four young men, named George, Shannon, Kingwell, and M'Cathy, were charged with feloniously wounding James Fairweather, with the intent to murder him.—In this case it will be recollected that the prosecutor had given evidence against the father of the prisoner George upon some charge that was made against him, and it was alleged that the offence now imputed to the prisoners was committed out of vengeance. The prosecutor and George met accidentally on the day following the proceeding at Marlborough-street, and they went to a publichouse and drank together; and M'Cathy came in and there was some talk about fighting. The prosecutor was then induced to accompany George and M'Cathy in a cab to Highgate, and it appeared that they were followed by the other prisoners in another cab, and when he got out he was set upon and assaulted in a most brutal manner, the injuries he received being of such a character that his life was for some time considered to be in danger.—The defence was that the prosecutor had challenged a man named Brown to fight, and that he went to Highgate willingly for that purpose, and that he stabbed his knuckles with gin at a publichouse in Tottenham-court-road for the purpose of hardening them.—Witnesses were called for the purpose of making out this defence.—The jury found all the prisoners \"Guilty\" of wounding with intent to do grievous bodily harm. It was proved that M'Cathy had been twice summarily convicted of felony, and he had been several times convicted of assaults upon different persons. The other prisoners appeared to have previously borne very good characters.—The prisoners George and M'Cathy were sentenced to five years' penal servitude. The other two prisoners, Kingwell and Shannon, were sentenced to 18 months' hard labour.\n\nTHE DESPATCH OF RIFLES TO FRANCE.—Thomas Arthur, a well-dressed young man, described as a commission agent, appeared to his recognisances to answer a charge of conspiring with one Ernest de Lusada, commonly called the Count de Lusada, not in custody, to cheat and defraud one David Forrest of the sum of 100l.—After the case for the prosecution, which had reference to a transaction in rifles for the French Government, had been opened, and some preliminary evidence adduced, the Recorder, interposing, said emphatically that he could see nothing in either the opening or the proof to support the charge, and unless other evidence was forthcoming to substantiate it he should direct the jury to acquit the defendant.—Mr. Ribton said that after that intimation from the Bench he would withdraw from the prosecution.—Upon that the jury at once \"Acquitted\" the defendant, and he was discharged.—Mr. Metcalfe applied to have the costs of the defence allowed, and the Recorder granted the application.\n\nTHROWING A CORROSIVE FLUID.—Louis Gustave Droz, 38, watchmaker, a native of Switzerland, was charged with throwing a quantity of aquafortis upon Harriet Droz, with intent to do her grievous bodily harm. This was a painful case. The prosecutrix was the wife of prisoner, and they had been married for 18 years at the time the occurrence took place. Owing, however, to the cruel treatment of the prisoner the prosecutrix had applied to the Divorce court and obtained a decree of judicial separation on the 10th of June this year. The prisoner appeared to have constantly waylaid the prosecutrix, and annoyed her after she had obtained the decree, and she never went out without having some one to accompany her. On the 2nd of October, she had been to Dr. Cummings' church, in Covent-garden, and when she came out she saw the prisoner, and he went up to her, and she saw him drop his hand, and, at the same moment, she smelt a strong smell, and found that her (prosecutrix's) dress had been burned, and there was no doubt that the prisoner had thrown a quantity of aquafortis, an ingredient which he was in the habit of using in his trade as a watchmaker, upon the clothes of the prosecutrix, but fortunately no part of her person was burned.—The prisoner was \"Acquitted\" on this charge, but was found \"Guilty\" of a common assault.—The Judge sentenced the prisoner to eight months' hard labour, and to enter into his own recognisances in 100l. to keep the peace towards the prosecutrix for 12 months.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206235678.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1002, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4337, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]