[{"id": "67f8177a563e905648ffaa3c4f293c2ad5984766", "text": "MIDDLESEX SESSIONS, YESTERDAY.\n\nThe court sat at the Guildhall, Broad Sanctuary, Westminster, for the purpose of hearing Appeals.\n\nLICENSED VICTALLERS AND THE POLICE.—Walter Bostan, a licensed victaller, keeping the Royal Oak public-house, Green-Innes, Stoke Newington, appealed against a conviction of Thomas Irwin Barstow, Esq., the magistrate sitting at Clerkenwell police-court, for refusing to admit a police-constable who applied for admission to his licensed premises, for which alleged offence he was fined £1. and costs, and his licence was ordered to be endorsed.—John Taverner, police-constable 404 N, stated that at half-past one on the morning of Nov. 6 he passed the appellant's house, and finding it lighted up and hearing voices inside, he reported the same to Sergeant Greenfield, and afterwards went with him to visit the house. He knocked with his hands, but receiving no answer he knocked three times with his rattle, when the gas was lowered. He knocked again, when he heard a female voice say, \"Who's there?\" and he replied, \"Police,\" and wished to visit the house, as he believed some one was there who had no right to be there. The female answered, \"She would have as many people as she liked in her house, keep them as long as she liked, and let them out when she liked.\" The premises were watched until five o'clock in the morning, but no one was seen to leave the house.—The appellant admitted that he had some friends in the house after closing hours, as it was his birthday; but they left before the police arrived. He did not see the police himself, as he was working in the cellar at the time of their visit.—After a consultation with the magistrates, the Assistant-judge said the conviction would be confirmed, with the exception of the endorsement on the licence, which part of the judgment would be quashed.\n\nJames Bloxham, of the White Horse, High-street, Poplar, appealed against a conviction by Mr. Lushington, the magistrate at the Thames police-court, adjudging him to pay a fine of £1. and costs, and to have his licence endorsed, for unlawfully selling intoxicating liquor to a drunken man.—The police evidence was to the effect that they saw two drunken men enter the appellant's house, and he served one of them with some ale.—The appellant was called, and stated that on the day in question two men, named Smith and Crawley, wanted to be served, but as Smith was intoxicated he refused to let them have any liquor. Crawley was sober, and having expressed a wish to see Smith home, the appellant at length consented to serve him with a pint of fourpenny ale, upon condition that he would not allow Smith to drink any of it. While Crawley was consuming the liquor the police entered the house and said the landlord would be summoned.—Witnesses having been called to support the appellant's statement, the court unanimously quashed the conviction.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206248903.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 673, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2888, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]