[{"id": "c40bec18c3349e0ba42d32dad93487d9ffe3be92", "text": "DREADFUL RAILWAY COLLISION.\n\nAbout thirty-eight minutes past ten o'clock on Monday morning, being close upon the time when the ten o'clock Brighton passenger up-train is due at Reigate, a goods train had arrived at the Redhill goods station, which is about forty-eight chains south of the Reigate passenger station. The larger portion of the goods train was put into a siding, and the engine then took from the remaining waggons on the down line about six, and after depositing them in another siding, returned to the head of the waggons on the down line. All this was a part of the ordinary routine business. It is the duty of the Reigate station-clerk to see at appointed times that the up-line is clear and the signals all right for the up-train to pass, and this duty, it is asserted, was punctually performed on the present occasion by the officer in question, so that no blame on account of the accident is attributed to him. Almost immediately after the line had been so inspected, the up-train, which left Brighton at ten o'clock, came in sight, and at the instant of its approach the driver of the goods train on the down line started, while the porter in charge of the points and signals, for some particular reason yet to be explained, turned, it is said, the goods engine and waggons on to the up-line without putting up a signal. The consequence of this extraordinary conduct was a collision, the engine of the passenger train striking the engine attached to the goods train. Fortunately, the shock was not attended with all the fearful consequences that might have been apprehended, and this comparatively favourable result is no doubt owing to the circumstance that the driver of the passenger up-train had already let off his steam and slackened his pace, with the view of making the regular stoppage at Reigate station. None of the passenger carriages were smashed, though the panels of some were stove in, and nothing was thrown off the rails, with the exception of the first truck of the goods train.\n\nWith regard to the passengers, they all providentially escaped with their lives. Many of them, however, were severely contused, though the injuries received were not of so serious a nature, with the exception of two cases, as to necessitate detention for the purpose of receiving medical attendance on the spot; and all the passengers, save one, resumed their journey to London, and went to their respective homes. The driver and fireman of the passenger up-train, at the moment of the collision, did not abandon their engine in fright, but stuck manfully to their posts, and gradually stopped the train. The driver of the goods train, the head guard of the goods train, and the porter who had charge of the signals, have been sentenced to two months' imprisonment with hard labour for neglect of duty.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201457.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 618, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2823, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]