[{"id": "801610631f6a9bd08805cc2aad3720cd4077c368", "text": "TRIALS AT THE MIDDLESEX SESSIONS.\n\nThe December sessions for criminal business were commenced on Monday at Clerkenwell.\n\nThe sittings of this court for the year 1872 were fixed, and on one occasion only—the May sessions—will the Court sit in the same week as the Central Criminal court.\n\nTHE POLICE AND THEIR DUTIES AT THE COURT.—When the case of a young man named Ross was called on, charged with stealing a suit of clothes, value 3l. 2s., the property of his master, neither the constables nor the other witnesses were in attendance. They were repeatedly called, but did not answer for about 10 minutes.—Police-constable 475 Y got into the witness-box, and in answer to the Assistant-judge as to the reason of his absence, said he was outside the door. That was all he had to say.—The Assistant-judge: You were called half-an-hour ago. I shall not allow your expenses.—Police-constable 479 Y, who had been out of court during the evidence of the other officer, said that having had no breakfast he went to get some refreshment, and the witnesses followed him.—The Assistant-judge: I shall allow you your expenses, because I think you have told the truth, but I shall disallow the other officer's. Constables having cases should not leave the precincts of the court.\n\nTHE RING-DROPPING TRICK.—Dama Prowse, 21, described as a labourer, was charged with attempting to obtain 1l. by false pretences from Mr. W. E. Frere, of 3, King's Bench-walk, Temple, barrister-at-law.—This case was an instance of an attempt to practise the old trick of ring-dropping. The ring, which the prisoner offered to sell for a sovereign, was shown to be made of brass, and nearly valueless.—For the prisoner, who received a good character, it was contended that he had not been guilty of any false pretence with respect to the ring, as he had made no assertion either as to its value or the material of which it was made.—The jury deliberated a few minutes, and then returned a verdict of \"Not guilty.\"—Sir W. Bodkin cautioned the prisoner as to his future conduct.\n\nROBBERY BY AN ITALIAN COOK.—Francisco Cuprino, 28, was indicted for stealing six watches, the property of Louis Ayme.—There was no counsel engaged on either side, although the prosecutor is a Frenchman and the prisoner an Italian, which involved a double interpreting of the evidence. It appeared that the prosecutor was a dealer in watches, living at Fleet-row, Eyre-street-hill, Clerkenwell, and on the afternoon of the 13th November the prosecutor went out for about a quarter of an hour, and on his return he found that the lock had been broken and the room door open. He then looked to see if all his watches were safe, and missed six which had been left with him for repair. From what his landlord told him suspicions fell upon the prisoner, who was captured the same afternoon, with two of the stolen watches in his possession.—The prisoner denied all knowledge of the robbery, but gave no account of how the two stolen watches had come into his possession.—He was found \"Guilty,\" and sentenced to 12 months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206238351.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 753, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3073, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]