[{"id": "8f8063778152db351ad0ac61ceebe9ecb9c9aa7e", "text": "TURNING THE TABLES ON HIM.\n\nWilliam Henry Hudson, a well-dressed young cabman, living in Redburn-street, Chelsea, was charged at Westminster police-court, on Thursday, with thrashing Horace Harker, an architect, of Wellington-square, Chelsea, with a walking-stick.—The prosecutor, an elderly man, said that a little after eight o'clock the previous night he was walking through Tedworth-square, which is not very far from his residence, when the prisoner drove up to him in his cab and said he wanted to speak to him. He stopped, and the prisoner got off the cab, wrenched his walking-stick from his hand, and beat him unmercifully over the head and shoulders with it. The witness fell down in the road and shouted \"Police!\" and \"Murder!\" When a constable came prisoner punched the complainant in the face and made it bleed.—Mr. Rymer (who defended): Did not the defendant say he wished to be taken into custody to get your name and address because you have been following his wife about and sending her disgraceful letters and postcards?—The Witness: No.—Mr. Rymer said he had before him a pile of letters and postcards, all in the same handwriting, although there were attempts at disguise and different vague addresses.—The defendant being challenged admitted some were in his handwriting.—Mr. Rymer: This disgraceful system of sending defendant's wife letters, &c., and following her about the streets has been going on for the last three months. The young woman is respectable and has handed the communications to her husband. She has actually had to take refuge in a cab and escape the importunities of this fellow.—Questioned by the magistrate, the complainant admitted that on one occasion he was stopped by a constable in the King's-road in consequence of the defendant's complaint about annoying and following his wife. On that occasion he gave the false name of Parker and a false address at Earl's-court. He did that for the sake of getting rid of the man.—Mr. Sheil said he thought it was unnecessary to go further. He should simply order the defendant to enter into his own recognisances in £1. to keep the peace. Of course, he must not take the law into his own hands.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206270727.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 504, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2183, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]