[{"id": "636914d6fb3f5a6a037068ea01f25f0e012b7f22", "text": "THE COURT.\n\nThe Queen distributed New Year's gifts to the children upon the Osborne estate on Monday afternoon. Her Majesty, accompanied by Princess Beatrice, Prince Leopold, and Prince Albert Victor and Prince George of Wales, entered the servants' hall, where the presents of clothing and cake were laid out, at three o'clock, and the Queen then handed the gifts to each child.\n\nHer Majesty received addresses on Tuesday from the inhabitants of the Isle of Wight, expressive of their loyalty and sympathy with the Queen in the prospect of the recovery of the Prince of Wales from his late severe illness. To each of the deputations presenting the addresses the Queen returned a gracious reply.\n\nThe Right Hon. W. E. Gladstone and Mrs. Gladstone had the honour of dining with the Queen on Thursday.\n\nPrince Arthur left Dover on Monday evening at 8.30, accompanied by Mr. Kelly and Sir Howard Elphinstone, in her Majesty's steam yacht Black Eagle, for Ostend en route to Berlin, where his royal highness arrived early on Wednesday morning.\n\nThe Duke of Edinburgh reached Dedlington-hall, Norfolk, on Wednesday evening, on a visit to Mr. Tyssen Amhurst.\n\nA Brussels correspondent, writing on Tuesday night, says:—\"The King accompanied the Princess Alice yesterday on a visit to the sights of Brussels. To-night the Court and the Princess will be present at a representation of La Favorita at the Grand Opera.\"\n\nThe Queen was on Wednesday elected a member of the Highland and Agricultural Society of Scotland.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206238634.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1568, "total-output-tokens": 344, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1507, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]