[{"id": "ae2c9ef2d69d44c11a7bb5046e5ea7fd853a212b", "text": "TRIALS AT THE MIDDLESEX SESSIONS.\n\nThe November adjourned general sessions commenced on Monday. There were 53 prisoners committed for trial, of whom 50 were charged with felony and three with misdemeanour.\n\nASSAULT IN A PRISON.—Ellen Cawfield, aged 24, pleaded \"Guilty\" to assaulting Sub-warder Elizabeth Porter, and occasioning her actual bodily harm. —The prisoner was an inmate of the House of Correction, having about three months longer to serve of a period of two years' imprisonment with hard labour, to which she was sentenced by this Court for felony on the 21st February, 1871. On the 23rd of October last, for misconduct, she was ordered three days' bread and water, and in consequence of threats of violence she was put in a dark cell for a short time. When she was directed to go to another cell she flatly refused, and two male warders had to carry her. She resisted so much on the way that Porter was asked to hold her hand, and the prisoner complained that she was too roughly handled. She seems to have cherished resentment against Porter on this account, and on the 25th of October she made an excuse to get her celldoor opened, and, darting down a corridor before she could be prevented, she dealt Porter a violent blow, which cut her lip, and felled her. The prisoner then returned quietly to her cell, and threatened that, if her time were prolonged, she would do for the officer.—Mrs. Howe proved that the prisoner had been three times convicted of assaults, and sentenced to terms of imprisonment—two months in September, 1865, six weeks in October, 1866, and one month in December, 1866. She said that the prisoner could behave herself very well, but had occasional outbursts of temper.—Sir W. Bodkin exhorted her to conduct herself properly and not attack those whose duty it was to enforce the rules of the prison, sentencing her to three months' further imprisonment for this offence.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206240619.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 472, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1911, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]