[{"id": "d36736b20114a20cb7f16ac438d6d1d7efc8b618", "text": "HORRIBLE CASE OF CHILD MURDER.\n\nSome excitement has been occasioned in the town of Mansfield and neighbourhood, by the sudden discovery of a child-murder, perpetrated under the circumstances mentioned below, above a year since, if credence is to be given to the principal witness, who made a certain statement to a policeman a few days ago, which led to the apprehension of both the prisoners on the serious charge of wilful murder. On Saturday morning, both the prisoners were brought before J. Daddey, Esq., and were fully committed to take their trial at the next northern March assizes. Their names are William Dellen, aged sixty-four, formerly in the militia, and Fanny Daykin, a dressmaker, about twenty-one years of age. Her parents live at Hucknall-under-Huthwaite. The evidence of the principal witness, Mary Berry, was to the following effect:—She was housekeeper to the prisoner Dellen, about ten years. He lived at Mansfield-Woodhouse. She left him about a year ago last September. About a week after Mansfield-Woodhouse feast, which took place in July, 1859, the female prisoner came to Dellen's house, but she did not observe she was in the family way. She came on Monday, and left on the following Friday. On the Tuesday or Wednesday in the same week, witness went up stairs, and found the girl in labour—upon seeing which, she called up the male prisoner, who delivered the girl of a child. She saw the child, and heard it cry. As soon as it was born, Dellen doubled it up, and put it into a utensil, which he put out of sight. While the child was in the utensil, she distinctly heard it gape twice. She never saw it afterwards. The girl made no remark after the birth of the child, and no conversation took place between her and the witness. The night before the female prisoner left Dellen's house, witness, at the request of the girl, asked him how much she was indebted to him. He said ten shillings, and witness accordingly told the girl so, and the latter paid it to Dellen. Other witnesses were examined, by whose evidence it appeared that the male prisoner was apprehended by Superintendent Picker on Friday morning, the 12th inst. He said he never had a young woman in the house on that occasion, and that somebody had done this out of malice to him. He made a somewhat different statement to police constable Brown, at the Mansfield lock-up. He then declared that Berry was a bad woman, had buried in the garden something he saw on the bed upon being called up to assist the girl in her labour, and afterwards burnt it in the fire. The female prisoner was brought to the station on the same day as Dellen, and when told with what she was charged, she only said, \"No, sir, it was not me.\"\n\nWilliam Dellen was then examined in the usual manner, and asked if he had anything to say to the charge. He made a statement utterly denying having touched the woman in any manner whatever, and declared that she only came to the house at the solicitation of his housekeeper, who said she was a friend of hers.\n\nFanny Daykin, by the advice of her solicitor, declined saying anything.—Both the prisoners were then fully committed to take their trial at the next assizes. Bail was earnestly applied for, but of course refused.\n\nOn Sunday afternoon both the prisoners were brought by train, and safely lodged in the county gaol at Nottingham.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206199390.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 783, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3353, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]