[{"id": "c7e1579a5f4077e4ae19cc3842ef11097997ed85", "text": "SERIOUS CHARGE AGAINST A SURGEON.\n\nDr. Wades, a surgeon at Hanley, was brought up on remand, on Saturday, charged with attempting to murder his wife.—Mrs. Wades was in attendance, and she stated that she had been married to prisoner four months, and had lived unhappily with him during the greater part of that time. For about a month she had been sleeping with the servant maid, being afraid to remain with her husband, in consequence of his violence. On Thursday he ordered her to make up a bed for herself in a room opposite his own, but she told him that she would not do so. They dined in silence, and she went up to her dressing-room. Her husband followed her, and asked her if the bed was made up, and she again told him she would not sleep there, upon which he said he would see who was the master. He left the room, but presently returned with the stick produced, with which he struck her three or four times. She went into another room, and prisoner followed her and struck her with his fist twice, making her eye black. As she turned to leave the room he kicked her in the small of the back. She then left the house, and did not return until towards 10, when her husband attempted to strangle her.—In cross-examination Mrs. Wades said she was 34 years of age, but on being pressed she admitted she was older. She became acquainted with Dr. Wades through a Matrimonial Alliance association. She had lived in Paris, and knew a gentleman named Edouard Leclercq. She was not his wife, and had never passed as Madame Leclercq or Baxter. Upon being shown a card bearing that name, she said it had been done by M. Leclercq as a joke. She said that her marriage with the prisoner had never been consummated, but that was not the reason she quarrelled with the defendant. She had told several persons that Dr. Wades was incompetent, but it was only in self-defence. She would never have mentioned it if he had only been kind to her. She refused to spend her private income on the household, and that was the cause of their disagreement. She denied that she was in the habit of irritating him, or that she ever jeered him.—The evidence of Mrs. Wades was corroborated by the servant girl.—Medical evidence was called to show the serious nature of the injuries.—Mr. Smith, for the defence, denied that defendant had attempted to strangle his wife, and he called a witness (defendant's coachman) to prove that on the Thursday the complainant's conduct was most provoking, and quite as bad as her husband's.—The Mayor said that a case of aggravated assault had been proved. Defendant must pay a fine of 20l., and find two sureties of 50l. to keep the peace for six months.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206240005.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 647, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2669, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]