[{"id": "325eb4d52219f8f30aa6b4f2531f399dfad9dfbb", "text": "EXCITING CHASE AFTER A CONVICT.\n\n[SUBJECT OF ILLUSTRATION.]\n\nCONSIDERABLE excitement was caused in Peterhead, on Monday morning, by a rumour that Laurie, the Arran murderer, had made an attempt to escape from the convict prison. It appears that Laurie, by his good behaviour, had advanced himself to be a prisoner of the first class, and as such had an amount of freedom which is denied to those in the lower grades. He was employed in the carpenters' shop, and was working with a gang who were erecting scaffolding in front of an addition to a block of warders' houses, forming one of the lines of such blocks parallel to the Aberdeen turnpike road. The buildings are partly enclosed by a high stone wall and partly by a wooden fencing. About a quarter before eight in the morning there was a very thick sea fog hanging over the land—so dense, indeed, that, it is said, objects at one hundred yards' distance were barely discernible, and taking advantage of this Laurie scaled the fencing and got on to the public road. As soon as he emerged upon the road he was discovered by Graham, the civil guard, who at once loaded his carbine and tried to fire, but the cartridge did not go off. Before he got it extracted and a fresh one substituted the fugitive was hidden by the fog. The alarm was at once given, and the warders and the reserve civil guard on duty were ordered out for the pursuit. Unfortunately for the success of Laurie's exploit the sun shone out and dispelled the fog, and his line of flight was made visible. One warder got his bicycle, and seeing that Laurie must needs cross the Blackhills-road, sped along it to intercept him. Those who witnessed the pursuit describe it as very exciting while it lasted. The people who live at Bellevue Cottage, hearing the whistling of the warders, looked out, but seeing a man in convict dress approaching, they shut and bolted the door. Laurie, however, did not seek the shelter of a house, but made for the clump of trees behind, and there he was overtaken and held. He was securely handcuffed with his hands behind, and marched back to the prison. It is understood that the punishment for an attempt to escape is that the prisoner has a belt of iron rivetted around his waist, similar bands being put around his ankles, and these are bound together by heavy chains. He has to wear these ornaments night and day. His escapade will likely also reduce his standing from the first class, and in other ways restrict his liberties, besides probably adding to his term of servitude.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811894.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 585, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2533, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]