[{"id": "ba4b960f71da5d7ed77a6c3cd61ceb35da3d74bd", "text": "AN ALLEGED SHAM EXCISEMAN.\n\nAt the Edmonton Petty Sessions, on Saturday, Thomas E. Masters, thirty-two, of Stapleton Hall-road, Hornsey, described as an undertaker's assistant, was brought up in custody on a charge of unlawfully obtaining 2s. 6d. from Charles Edwin Russell by falsely representing himself to be an officer of the Inland Revenue. The prosecutor, who keeps the Ship public-house in the High-road at Tottenham, deposed that on Friday the prisoner came in the bar and was served with a glass of beer. He made a communication to Mrs. Russell, who was behind the bar, and left. Later in the day he returned, and in conversation with witness, stated that he was an excise officer, adding, \"You will have to look out, for two excise officers are coming down to-morrow to test your spirits. I am one of the officers. You will be asked for a pint of whisky or gin, so mind and give it right.\" Witness asked for his authority, and the prisoner produced a paper which bore the name of Mr. Tomkins, the inspector under the Food and Drugs Act, for the county. Witness asked, \"Why don't you take the sample at once,\" and the prisoner replied, \"It doesn't matter now.\" They went together into the billiard room, and the accused produced a book in which was written, \"Contributions towards the maintenance of a widow and four children, one being blind, and all dependent on the mother for support.\" Underneath that there were various entries of subscriptions, amounting to about £1. Prisoner said he was collecting these subscriptions for the widow of a brother officer, and witness gave him half a crown, and signed his name in the book. The prisoner then said, \"I want to go down your cellar and test some of your spirits.\" He was allowed to enter the cellar, but did nothing in the way of testing the spirits. After a time he left the house, and information was given to the police. When arrested he was intoxicated. Remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810779.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 462, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1929, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]