[{"id": "ab294bee156c425296e44ce58b5db0599dc0281e", "text": "STRUGGLE WITH A BURGLAR.\n\nAt Richmond on Monday Joseph Kennedy, age 42, no home, described as marble polisher, was charged with burglariously entering 4, Carrington-villas, Marsh-gate-road, Richmond, premises used as a \"sleeping-house\" in connection with St. John's Collegiate school, and stealing a gold watch and various articles of clothing, to the value of 25l., the property of Carlos Urrutia and Emil Ghil, two of the students. He was further charged with assaulting Inspector Charles Pinhorn in the execution of his duty.—Mr. Urrutia stated that he went to bed on Saturday night, slept soundly, and did not awake until near four o'clock in the morning, when the police aroused the household, and he then found that the clothes he had been wearing were missing, together with the watch and the money in the pocket. A shawl belonging to Mr. Ghil was also missing. Mr. Hatton, the master, had been downstairs at 12 o'clock, and left the back door unfastened, but nothing was heard until the police arrived.—Charles Pinhorn, an inspector of the V division of the metropolitan police, said that at three o'clock on Sunday morning he was in Marsh-gate-road, Richmond, and saw the prisoner about 200 yards in advance of him. He noticed that the prisoner looked back towards him, and then turned the corner and went up Church-road. Witness thereupon went after him and stopped him. He found that he was carrying a pair of trousers, vest, coat, and pair of boots under his own coat. The inspector took them from him, and said, \"You will have to go with me to the police-station,\" and prisoner then, with an oath, struck witness on the right shoulder with his fist, and attempted to pass. Witness took hold of him with his left hand, but he struggled violently to get away, and he (Inspector Pinhorn) was obliged to throw the clothes down. After they had struggled some time, the prisoner said he would go quietly, and they walked along together about 300 yards, when the prisoner said he would not go any further, and said he would kill witness if he did not let him go. He took hold of the corner of the cape which witness was wearing and twisted it until the inspector's arms were almost pinioned to his side and attempted to throw him to the ground. They both fell, and witness knelt upon the prisoner's legs. Prisoner, however, got his legs free and kicked witness in the stomach and legs. He got upon his feet and rushed at witness with his open hand, as if to clutch at his throat. They again fell to the ground, when witness got the man upon his stomach and knelt upon his back, holding his face down to the ground. Witness sounded his whistle, and kept the prisoner in that position until Police-constable Willmott and Police-serjeant Cann arrived and took him to the station. On being searched the gold watch and chain produced were found in his pocket. An old envelope found upon the clothes in prisoner's possession induced witness to go to 4, Carrington-villas, where he found that the front garden gate had been opened, and also the side gate and back door. They were still standing open, as also was Mr. Urrutia's bedroom door. He aroused the household, and the property was identified, and the prisoner charged.—Mr. Dermer remanded the prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206257161.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 768, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3258, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]