[{"id": "95e4cf00520bdd9b5f3c84779447013e13b7d9c6", "text": "INCREASE OF INFANTICIDE.\n\nOn Wednesday morning, Mr. Bedford held inquests in the board-rooms of St. George's, Hanover-square, and Mount-street, Grosvenor-square, into the cases attending the deaths of two children, whose bodies were found as described in the evidence.\n\nIn the first case, Colonel William Frederick Johnstone, residing at 28, South-street, Park-lane, stated that he was walking in Hyde-park at eight o'clock on Sunday morning last, and when about a hundred yards from the Grosvenor-gate towards the Marble-arch, he saw a small black leather bag, or reticule, lying under one of the seats. Without ascertaining its contents he took it to the lodge-keeper, who did not open it for some time, when to his horror and surprise it was found to contain the dead body of a fine male child.\n\nDr. William Bloxam said he had examined the body, which was that of a fine male child. There was very considerable compression of the head and effusion of blood between the scalp and the brain. He had no doubt the child had respired, and the compression of the head was sufficient to destroy life.\n\nThe coroner then remarked on the extraordinary nature of the case, and that it was the first instance he knew of such a bag being used to secrete the body.—The jury returned a verdict \"That the deceased was found dead in Hyde-park.\"\n\nIn the next case, the principal witness was Mr. Inspector Harris, of the London, Chatham, and Dover railway, from whose evidence it appeared that on Saturday midday it was found that one of the water-closets in the ladies' waiting-room, at the Victoria station of the above railway, was out of order, and a plumber was sent for, who took the place to pieces, and discovered that the stoppage was caused by a large bundle, which, on being opened, was found to contain the dead body of a female child, which had evidently been placed there by one of the passengers. Every inquiry had been made, but no clue to the parties who had deposited the body had been obtained.\n\nIt having been stated by Dr. Bloxam that the child did not appear to have been of the full period, the coroner said that, while the offender might be punished for concealing the birth, yet this court could not deal with the case.—The jury coincided in this view, and a verdict was returned according to the evidence.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206218935.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 550, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2315, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]