[{"id": "cf957378cdaf29eaa18a804a8d694648e43fce18", "text": "PARISH PROSECUTIONS AT THE WEST END.—Jules de Bodt, a Frenchman, was indicted for keeping a disorderly house in the parish of St. Marylebone. From the statement of Mr. Ford it appeared that for some years past the prisoner was the occupier of a house, No. 12 Market-place, Oxford-street, on the site of the old Oxford-street Market, and complaints were made to the vestry as to the manner in which this house was conducted. On the outside of the house was written up “Jules de Bodt, cabinet-maker,” and also “Madame de Bodt, French laundry,” and in consequence of the complaints which were made as to the conduct of the house an officer of the vestry in October, 1881, called upon the prisoner and warned him to discontinue the practice of what he was then doing, for if it was continued the vestry would be forced to take proceedings and put the law in force against him. Subsequently, however, renewed complaints were made by the inhabitants as to the nuisance they experienced as to what was going on at this house, which was frequented by low characters of French nationality, who brought men home with them at all hours, and in the warm season the inmates of the house were very indelicately attired, and as the windows in the upper part of the house were thrown wide open, the inhabitants occupying houses on the opposite side were greatly scandalised thereby, and one of them, a professor of music, who received pupils, was compelled to keep his blinds down throughout the day in consequence of the scenes that were going on. Witnesses having been called in support of this statement, the jury found the prisoner guilty. The learned judge ordered him to pay a fine of £50, and to enter into his own recognisance of £50, and to find two sureties of £25 each, or one surety of £50, for his good behaviour for six months.\n\nFRANK UPON BUILDERS.—Edwin Samuel Boosey, thirty-seven, surveyor, was indicted for having obtained by false pretences various sums of money from divers persons with intent, in each case, to defraud. From the statement of the learned counsel on behalf of the Treasury, it appeared that a most extraordinary system of fraud had been practised, there being no less than six prosecutors. One of these was Mr. George Burrows, a builder, residing at Chingford, who saw an advertisement asking for tenders for the finishing of four small houses on the Chingford Station Estate. Mr. Burrows called at the address named, Langham-place, Regent-street, where he saw the prisoner, who spoke to him regarding a letter which he had addressed to him. The prisoner then said that he would supply plans and specifications, but would first require a deposit of two guineas, which, if the event of his tender not being accepted, would be returned. Mr. Burrows then asked that sum over to the prisoner, who gave him the plans and specifications. Mr. Burrows, being sure that he would have the completion of the job, went down to look at the carcass of the houses, when he found that the plans were extremely faulty and erroneous, there being now bow windows in them, and it was evident that they had not been prepared from a view of the houses. The prosecutor complained of this, but could not get one penny of his money back. The other cases were of a similar character. The jury, without retiring, returned a verdict of guilty. Detective-sergeant Gethen said he knew of twenty-five cases similar to those upon which the prisoner had been tried; and, Sessions Warder Humphreys having proved a previous conviction on August 12th, 1873, the learned judge sentenced the prisoner to five years penal servitude.\n\nALLEGED ROBBERY WITH VIOLENCE.\n\nAt the Hammersmith Police-court James M’Carthy, a costermonger, and Jacob Hyams, a tailor, were finally examined on the charge of being concerned in assaulting Thomas Neeson, a glazier, at Little James-street, Bedford-row, and stealing £2 10s. from him while on board the Citizen steamboat “T.” on the occasion of the Gaiety Rowing Club races on the 18th ult., at Chelsea. It was alleged by the prosecutor that the prisoner Hyams demanded £2 10s., which he refused to pay, as he had not made any bet with him. The prisoner then caught hold of his leg while he was on the bridge, and said he would have his money. M’Carthy and other men rushed up and caught hold of him. He got away down into the stokehole, but he was followed by the prisoner and a number of other men. M’Carthy held him while Hyams rifled his pockets. Mr. Paget heard a witness on behalf of M’Carthy, and then ordered him to be discharged. He committed the other prisoner for trial, allowing bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200801629.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1091, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4613, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]