[{"id": "daf2fa00c701d571ab8c7071f6806a74fc1db3a0", "text": "THE BUTCHER AND HIS SISTER-IN-LAW.\n\nAt the West London Police-court, on Saturday, William Payne, a master butcher, carrying on business in King's Langley, Watford, appeared to answer a summons at the instance of his sister-in-law, Sarah Ann Payne, who alleged that he was the father of her child. Mr. C. Robinson appeared for the defendant, who disputed the paternity. It appeared from the evidence that the complainant kept a pork butcher's shop in High-street, Watford, and on the death of her husband the defendant managed her affairs. She was now living in Portobello-road, Notting Hill, having left Watford in consequence of her condition. In answer to questions the complainant said a man came to the shop to do the chopping. Several men called on business matters, but she had heard no complaint about the house. The defendant paid the doctor's expenses. Mr. Robinson said the intimacy was admitted, but not at the time stated by the complainant. The defendant was sworn and said he did not pay the doctor. He gave complainant money, but only in the way of business. He was a married man. Several letters were handed in by the complainant, and the defendant was questioned about three which he admitted were in his handwriting. One was dated December 1st, 1802, commencing \"Dear Sis,\" and ended \"with love from H. H. Market.\" The defendant said the signature meant Hemel Hempstead Market. The letter contained the words \"Cheer up, old girl. Good-bye. It will soon be Christmas.\" The second letter was signed \"W. B.,\" the defendant stating that the letters meant \"West Brighton.\" The third had \"W.\" attached to it. Mr. Curtis Bennett: I suppose that means William. (Laughter.) George Taylor said he lived in High-street, Watford, opposite the shop. He had seen men come out of the shop late at night. Joseph Bunce, who worked for the complainant, was also called and said he had left a man in the house late at night. Mr. Curtis Bennett, at the conclusion of the case, described the defendant's conduct as mean—turning his back upon the complainant. He made an order for 5s. a week, with 10 gs. costs. Mr. Robinson submitted that the magistrate could not give more costs than those actually incurred. Mr. Curtis Bennett: Look at the statute. We have power to grant what costs we like.\n\nDUEL TO THE DEATH.\n\nOn Saturday night James Manahan, aged twenty-one, an iron dresser, and John Coyle, of the same age, were drinking in a public-house in Maitland-street, Cowcaddens, Glasgow, when they began to quarrel on the subject of football. It is alleged both drew their knives, and said they would fight a duel with them. The publican, hearing the noise, put them out of the room, when, passing the bar, they attacked each other with their knives, and continued to do so outside. In the street Manahan fell, and immediately became unconscious. He was carried to the police-office close by, and died in two minutes. Dr. Bruce found six wounds on Manahan's body. Coyle was immediately caught. Dr. Bruce found on him a slight wound on the right arm. Coyle has been watched in his cell since his arrest.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811330.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 748, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3099, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]