[{"id": "8ec6789dc4304a69f0767d91eea02896ed3b37e1", "text": "YESTERDAY'S INQUESTS.\n\nA CHILD FATALLY SCALDED.\n\nYesterday Mr. Carter held an inquest at the Royal Standard, Battersea, on the body of Alice Tyrrell, 5 years of age, whose parents reside at 1, Grove-cottages, Grove-lane, Battersea.—From the evidence of Louisa Tyrrell, the mother, it appeared that deceased was left alone in the kitchen on Sunday afternoon. The child was standing on a chair near the fireplace and caught hold of a saucepan containing boiling water, in the endeavour to save itself from falling. The water went over one of its arms, scalding it severely.—Mr. Thompson, surgeon, was examined, and stated that the child died from shock to the system.—A verdict of \"Accidental death\" was returned.\n\nMELANCHOLY CASE OF DROWNING.\n\nYesterday afternoon Mr. Carter held an inquiry at the Surrey View tavern, Commercial-road, Camberwell, into the circumstances attending the death of Frederick Croney Cole, aged 11 years, residing with his widowed mother at 51, Stanton-street, Peckham. Deceased and several other boys went down to the Surrey canal. On arriving at the Globe-bridge the boys began larking, and threw the deceased's cap into the canal. After regaining his cap the lad endeavoured to climb on to the parapet of the bridge, when he slipped and fell into the water. George Kent, a little boy aged 12 years, said he undressed and jumped into the canal. He managed to catch hold of the deceased, but he was not strong enough to rescue him. He managed to push him towards the bank, but as there were no other persons who were able to assist him, the deceased sank and was drowned. The jury returned a verdict of \"Accidental death by drowning.\"\n\nDEATH IN THE PADDED ROOM.\n\nYesterday Mr. Carter held an inquest at the Wandsworth and Clapham union, touching the death of William Ready, aged 22. The deceased was brought up at the Wandsworth police-court on the 14th inst., when the magistrate ordered him to be sent to the workhouse on the ground of his being insane. He died a short time after being admitted, and the medical officer gave it as his opinion that deceased died from effusion of the brain, consequent upon delirium tremens. The coroner did not at first deem it necessary to hold an inquiry, but the mother of deceased made an application to the magistrate, and by his desire an inquest was ordered. E. Tullock, infirmary nurse, said that on the morning of the 17th she found deceased lying dead on the floor in the padded room. Mr. Cresswell, medical officer of the infirmary, said that deceased when admitted was suffering from delirium-tremens, but had an abrasion on the left ear and bruise on the temple. He insisted upon lying on the floor in a perfectly nude state. The death was not due to violence. The jury returned a verdict of \"Death from natural causes, arising from drink.\" The mother insisted that deceased had been kicked by a man named Robinson, and some further evidence was taken, but the coroner said the verdict would not be altered.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206328498.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 720, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2982, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]