[{"id": "09891e4f51e5d5edbe59513dd3b0c26edc4ae8b7", "text": "A DANGEROUS CRIMINAL.\n\nWhen sentencing W. Johnson to ten years' penal servitude at the South London Sessions, on Wednesday, Sir Peter Edlin remarked: \"I do not think during the whole twenty years I have been upon the bench that I have ever had such a dangerous criminal as you before me. I have not the slightest doubt that your intention was to carry out your threat to murder both the officers who arrested you.\"\n\nWilliam Johnson, who is fifty, and a powerfully-built man, was indicted for stealing two horses belonging to Mr. Gibbs, valued at £60. During the afternoon of the 5th of January certain information reached Detective-sergeant Moss, L Division, and Sergeant Warne, that induced them to go to Salisbury-road, Walworth, where they saw Johnson standing near two horses. Moss told him that he had reason to believe the horses were stolen, and that he should arrest him. The accused, with an oath, said he knew nothing about the horses, and that he was not going to let two \"d's\" take him. He threw himself to the ground, tripping both the officers, and causing them to fall violently on the stone footway. A desperate struggle ensued, and continued for about a quarter of an hour. Assistance arriving, however, prisoner was taken to the station. On the way he said to Moss, \"Take that jemmy and bash my brains out; I don't want to go back.\" Johnson is a most notorious criminal, and has spent nearly all his life in penal servitude.\n\nSir Peter Edlin paid a high compliment to both Moss and Warne for their courageous conduct, endorsing the commendation of the grand jury with a reference to the Chief Commissioner as being a case for an exceptional reward. The judge passed high encomium upon the part played by Mr. Morris, and awarded him £3 3s., remarking that had it not been for his timely assistance there was little doubt that the prisoner might have stood in another dock on a far more serious charge. Turning to Johnson, Sir Peter Edlin said: \"I see you have seven years unexpired of your sentence of twenty years to serve yet, and that causes me to think you will not trouble the court again during the remainder of your lifetime.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811322.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 501, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2150, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]