[{"id": "30090d14437fbe2195f66dc9024369e47dac6bb3", "text": "THE WIMBLEDON MYSTERY.\n\nOn Thursday the 29th ult., at the Local Board Offices, Wimbledon, Mr. A. Braxton Hicks held an inquiry with reference to the death of a man unknown, whose body was found on Monday night in a field off Kingswood Road with a deep wound in the throat, and a knife by the side of it.\n\nErnest Lansley, a farrier, of 3, Bendon Terrace, Bendon Road, Wandsworth, stated that on Monday night he was walking along a path-way by the side of a field at the top of Kingswood Road, when a middle-aged gentleman called his attention to the deceased, who was lying groaning in the centre of the field, about thirty yards from the road. There was a great deal of blood about the man's head, and a butcher's knife was lying on the ground close by. When the witness arrived the man was apparently endeavouring to again get hold of the knife, and was stretching out his hand towards it. He was bleeding profusely; and the witness, thinking he would attempt to further injure himself, picked up the knife and threw it some distance off. A butcher's boy came up shortly afterwards, and the witness sent him for the police and a doctor, but the man died before the latter arrived.\n\nPolice-constable Henry Searle, 210 V, said the deceased lived for about six minutes after he was discovered. There were traces on the ground showing that the deceased had struggled very much after he received the wound in the throat, but there was no suspicion of foul play. The deceased appeared to be a labourer, and no evidence of identification was forthcoming. His description had been circulated as follows:—Age 43 to 45, height about 5ft6in, complexion and hair dark, eyes grey, moustache sandy, no teeth in front of upper jaw, large ulcerated wound on inside of left leg, scar from carbuncle on right knee; deceased was wearing a black overcoat with the name \"J. W. Gaze, 113, Fleet Street, London,\" on the collar, fancy blue vest with black spots, grey mixture trousers, a brown Cardigan jacket, much worn, and Blucher boots. Twopence in cash, an empty medicine bottle, and a handkerchief was all the property found on the body.\n\nDr. Hargreaves said that death was due to a cut in the throat, extending from ear to ear, the jugular vein being entirely severed, while the left carotid artery and the windpipe were almost cut through. Undoubtedly the wound was self-inflicted.\n\nThe jury returned a verdict of \"Suicide while temporarily insane.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200813773.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 601, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2434, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]