[{"id": "a0c77c44ce3fc07ca864d27cb9000da729049f7d", "text": "ABUSE OF THE TRUNCHEON.\n\nWilliam Croly, twenty-one, sawyer, of 28 Trinity-road, Rotherhithe, was charged, on remand, at the Greenwich Police-court, with rescuing a prisoner from the lawful custody of Police-constable Cocket, 32 M, and with assaulting the constable and stealing his truncheon. Louisa Croly, thirty-nine, mother of the other prisoner, was charged with assaulting Police-constable French, 36 M. Arnold Croly, thirty-nine, of Acorn-place, Rotherhithe, father of the first prisoner, was charged, on remand, with assaulting Police-constable Cocket. It appeared from the evidence that Cocket arrested Arnold Croly, when the son rescued him and took the constable's whistle. A large crowd assembled. Cocket followed Arnold home, and in Trinity-road brickbats and broken glass were thrown from the windows at Cocket and French, who had to use their truncheons as bats to keep off the missiles. The female prisoner got French's hand in her mouth and gnawed his thumb to the bone. With assistance William and Louisa were taken to the station, and Arnold was arrested a few days later. William Croly said the constables beat him on the head with their truncheons, and he appeared in court with surgical bandages on the head. Croly produced two handkerchiefs saturated with blood, and said that the police broke in the door and windows of the house. He had been married that day, and they were having \"a bit of a jollification.\" Police-constable French said that the younger prisoner's wife was the most sensible of all present on the occasion. The constables admitted using their truncheons, and said they aimed blows at the arms and legs of young Croly, but they took effect on the head. The neighbourhood was a very rough one. Mr. Marsham, after a long hearing, said that French and Cocket both appeared to have drawn their truncheons and to have struck all the prisoners with them. No doubt there was some violence, but not enough to justify so free a use of the truncheon. French appeared to have used the truncheon too freely. He discharged the two male prisoners, and fined the woman £5, or fourteen days, saying she would have been sent to prison without the option of a fine had it not been that she was struck.\n\nSHOOTING FATALITY.—An inquest was held on Friday at Pratsham Grange, near Dorking, on the body of Mr. Ernest Hensley, aged seventeen years, who died from a gunshot wound caused by his cousin, Mr. Guy Burnett. The latter was on a visit at Pratsham Grange, and he and the deceased had been out rabbit shooting with another friend. They were wishing this friend good-bye when Mr. Burnett accidentally touched the trigger of his gun, and the contents lodged in Hensley's head. Death was instantaneous. The jury returned a verdict of accidental death.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810283.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 679, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2772, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]