[{"id": "75e472688304aec827663ee7da866b5c3e0181c3", "text": "HORRIBLE CASE OF STARVATION.\n\nMr. George Collier held an inquiry on Wednesday at the Ship tavern, Bethnal-green, on the body of Hannah Cox, aged 15 years, whose death was alleged to have been brought about by starvation.\n\nHannah Cox, 58, Ravenscroft-street, Bethnal-green, said deceased was her daughter. She was a cripple and had been ailing for years; but she had not been seen by any medicalman, except one, for the last three months. On the Monday before her death witness carried the deceased to Dr. Godfrey's surgery, and she died on the Wednesday following. Witness afterwards went and told the doctor deceased was dead, and without him coming to see her he gave a certificate, and the body would have been buried, but the relieving officer called and brought a doctor with him. In consequence of that the present injury had taken place. Witness had done her duty to the deceased, who had nothing the matter with her but a sore head. Her husband gave her money and she purchased food for the deceased and the rest of the family. Witness refused to let deceased go to the workhouse, because she did not like to part with her.\n\nWilliam Alexander Bowick, a relieving officer, said on the previous Tuesday he received a letter from Mr. Barnard, one of the guardians, which stated that at 58, Ravenscroft-street, there was a child being starved to death. He visited the house the following morning and found the deceased lying on the bed totally naked. She was in a filthy and emaciated condition. The parents refused to allow the deceased to be removed; but a cab and a nurse were sent for to take her away.\n\nMr. Arthur George Southcombe, surgeon, of 150, Bethnal-green-road, said he had examined the body, and found it in a state of extreme emaciation. The skin and muscles were very much wasted, but there were no marks of violence visible. Deceased was in a filthy condition. The left hip-joint was contracted from long-standing hip disease. The brain was quite healthy, and the right lung was congested. The heart was very small, and the stomach contained about two ounces of milky fluid. The intestines were thin and transparent, which was a strong proof of starvation. There was no appearance of disease sufficient to account for death. The cause of death was exhaustion from starvation. The deceased was weighed in his house by Mr. Burrows, the coroner's officer, and weighed 23lb., which was not more than a child half her age ought to weigh. Deceased ought to have weighed from 60lb to 70lb.\n\nThe jury returned a verdict of \"Manslaughter\" against Hannah Cox, the mother, and she was at once arrested, and committed on the coroner's warrant.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206257745.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2652, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]