[{"id": "e76f4aa5a6715b71144749e7760f95b5bc10ef2f", "text": "PRINCE ARTHUR AT THE GUILDHALL.\n\nThe ceremony of admitting Prince Arthur to the freedom of the City, to which he is entitled by patrimony, took place at the Guildhall on Thursday afternoon. Just before two o'clock his royal highness, dressed in a morning suit, with light grey trousers and gloves to match, entered the Council chamber at the Guildhall, his coming being heralded with the usual ceremonies. On taking up his place at the right hand of the Lord Mayor, the Chamberlain's Clerk read over the resolution of the court, conferring the privilege of freedom upon his royal highness. The Prince then, in a manly voice, recited the oath, in which he promised to be good and true to \"Our Sovereign Lady Victoria,\" obedient to the Lord Mayor, and to maintain the franchise and customs of the City, keeping them harmless as far as in him lay.\n\nThe Chamberlain then read an address, the sentiments of which were applauded throughout. Having handed the casket to his royal highness, Prince Arthur, who was repeatedly cheered, replied as follows:—My Lord Mayor, Mr. Chamberlain, and Gentlemen,—It is a duty which I owe to your lordship and to this court, to express my most sincere thanks for the very kind and complimentary remarks which have been made upon this occasion of my taking up the freedom of this city. And likewise must I thank you for the handsome casket which contains that document. I am well aware that the privilege of this freedom descends to me by patrimony, though I must say that that does not make the honour which you have conferred upon me any less. I feel deeply the position which I have this day assumed. It is a source of unquestionable pride to find my name placed side by side with the names of those who have won their freedom by worth—by men who have added lustre to the greatness of this vast empire. Proud, indeed, am I to be a freeman of the City of London, which, as you have just remarked, holds out a bright example—amidst the late terrible events which have been enacted on the continent—of the blessings of a Constitution which secures to us happiness, peace, and prosperity, where we have true freedom wisely ruled by law, order, and loyalty (loud cheers).\n\nOn the motion of Mr. Pedler, chairman of the City Lands committee, the address of the Chamberlain and the reply of his royal highness were ordered to be entered in the journals of the court.—His royal highness then retired to the Guildhall, where he took luncheon with the Lord Mayor, about 700 guests also being invited.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206237358.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 584, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2520, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]