[{"id": "76c53210e1c745e0214ca1edcd66d84e89eb0e87", "text": "GENERAL GRANT IN ENGLAND.\n\nGeneral Grant and party arrived at Queenstown on Sunday evening at seven o'clock. The General was in good spirits, and acknowledged the hearty Irish cheers which greeted him from the tender. He declined to land at Cork, saying that he would return to Ireland. Leaving for Liverpool, the Indiana tender reached the Mersey at two o'clock on Monday afternoon, and was dressed with flags, as was also most of the shipping. General Grant stood on the bridge, with the captain, and acknowledged the hearty cheers which greeted him from tugs, ferryboats, and the shore. A special tender, under the charge of General Badeau, American consul-general, boarded the Indiana at three o'clock, and took off General Grant, his wife, and son. On their reaching the dock, the large crowd, which was with difficulty controlled by the police, broke into tremendous cheers. The Mayor advanced, and shaking the General by the hand, read an address of welcome. At six o'clock the General and family, with General Badeau, drove to the house of the Mayor, where they dined. On Tuesday he was invited to Inncheen at the Town hall. On Wednesday morning General Grant and family went to Manchester and visited Sir Joseph Whitworth's gun factory and several other works, and an address was presented to him by the Manchester City council. The company adjourned to the banqueting-hall, where luncheon was served to a large number of guests.\n\nOn Thursday afternoon President and Mrs. Grant arrived in London, from Manchester, by the Midland railway. Two stoppages were made between Manchester and London, viz., at Leicester and Bedford. At both places, the Mayor and Corporation, attired in their robes and chains of office, were in attendance, and presented the General with addresses of welcome, which he cordially acknowledged. At St. Pancras station a large number of persons had congregated for the purpose of witnessing the arrival, amongst them being many Americans. The General, who, on alighting from the train, was received by the Honourable Mr. Pierrepoint, and Mr. U. Grant, his second son, who had preceded him to London, was greeted with cheers. Having entered the carriages, the party at once drove to the American embassy, where the General and family remain the guests of the United States Minister.\n\nThe Court of Common Council on Thursday resolved to present the freedom of the City in a gold box to General Grant, and to entertain him at a déjeuner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206328131.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 549, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2466, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]