[{"id": "2dc3c60eae11ac51a0833f3753f062d85a9e7135", "text": "HORRIBLE MUTILATION AT REIGATE.\n\nReigate, Thursday, August 19.—Yesterday morning the quiet village of Chepstow, Surrey, situated about six miles from Reigate, was thrown into a state of painful excitement, in consequence of a most alarming riot between a large number of English and Irish reapers, who reside in the lower part of that picturesque spot; and, from the awful character of the injuries received by one of the men, named John McCarthy, aged forty-five, his death is hourly expected. It appears that about mid-day on Wednesday, a party of reapers and their wives assembled at a public house called the White Hart, Chepstow, Surrey, where, after a short time, they commenced singing and drinking, until the man McCarthy was called upon to sing a song, but he refused, and walked out, followed by a number of men and women, and when they reached a spot a short distance from the public-house, one of the ring-leaders, named George Fisher, told McCarthy, that if he did not go back and sing a song, or pay for a pot of ale, he (Fisher) would \"cut his arm off with the faggot-hook.\" McCarthy refused, and the next moment Fisher, who had the sharpened hook in his hand, raised the deadly weapon, and inflicted a most awful gash on McCarthy's head, who raised his left arm to defend himself, when Fisher again rushed forward, and gave him two more frightful gashes across the left arm, which completely separated both bones of the limb, which was shockingly mutilated. By this time some assistance arrived, when the wounded man was carried into the White Hart public-house in a state of total insensibility, and bleeding most copiously from the several wounds. In the meantime the potman was despatched for the nearest surgeon, and in a short period one arrived, who promptly rendered every necessary aid in dressing the wounds. The left arm seemed to be completely amputated by the violence used, and the head of the unfortunate man had sustained several extensive lacerations, and various portions of the skull had been shaved off by the weapon used by the man Fisher. At a later period of the day the unfortunate man was in such a state of exhaustion, arising from the severe hemorrhage consequent upon the wounds, that it was deemed necessary to make some arrangement for the poor fellow's removal to Guy's Hospital. It was, therefore, thought best to place him in a carriage at the Reigate station, and convey him with all care to that institution, which place he reached at eight o'clock last evening. He was immediately forwarded to the accident ward, where he was at once seen by Mr. Hinton, the house-surgeon, who remained with him for several hours during the night. The man (Fisher) was, soon after the murderous affair, taken into custody, with the other ring-leaders, and removed in charge of several active officers to the county gaol, Reigate. This morning the prisoner George Fisher, Ann Fisher, his wife, and others, were brought before John Currie, Esq., of Gatton, Surrey, one of the magistrates for the county. Mrs. White, the landlady of the White Hart public-house, and several important witnesses, swore positively to seeing the prisoner Fisher strike McCarthy on the head and left arm several times with the instrument called the \"faggot hook,\" and to using other violence.—The magistrate, upon receiving information that the unfortunate man McCarthy was in a very precarious condition, proceeded by railway to the London-bridge terminus, and from thence to the accident ward of Guy's Hospital, to take the depositions of the injured man.\n\nGuy's Hospital.—On Thursday evening, at half-past six o'clock, John Currie, Esq., magistrate of Reigate, and his chief clerk, proceeded to the accident ward, where they were introduced to the wounded man. The prisoners Fisher and his wife were present in the custody of two officers. The wounded man, McCarthy, on being sworn, gave a very clear account of the transaction, but he could not swear positively that it was the prisoner. He was sure it was a man who cut him first on the head, and then on the left arm. The man was dressed like the prisoner. He (McCarthy) had nothing in his hand when the riot commenced. The man who inflicted the injuries threw the hook at him, which he picked up, but at that time he was so weak that he fell from loss of blood. McCarthy, in answer to the magistrate, said, \"I never used any violence, nor did I strike any one in defence. I left my faggot hook in the field where I had been at work.\" The prisoner having put a few questions to the man McCarthy, which did not shake his evidence in the slightest degree, Mr. G. Hinton, the house-surgeon, was next called, and said that McCarthy had received very extensive incised wounds on the back and top of the head, and two wounds on the left arm, separating both bones near the elbow. He was in a very precarious state, but at present was going on as well as could be expected. The evidence of the several witnesses was then read over by the clerk, after which the prisoners were formally remanded to Kingston Gaol until Monday next.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206190914.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 1140, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5088, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]