[{"id": "eb577b8dafd9a207d92fa9e931da0ca908ba1aa4", "text": "CENTRAL CRIMINAL COURT.\n\nALLEGED CHILD MURDER.—Charles Brand, forty-one, army pensioner, was indicted for the wilful murder of his infant, aged ten months, by cutting its throat with a razor at Fulham. Medical evidence was adduced to prove that the prisoner was not in a condition of mind to plead to the indictment. His lordship ordered the prisoner to be detained during Her Majesty's pleasure.\n\nTHE SOHO SHOOTING CASE.—Felix Henri Leon Lecluse, thirty-nine, watchmaker, who was indicted for shooting at his brother, Alphonse, with intent to murder him, pleaded guilty to a minor count charging him with unlawful wounding. Mr. Bodkin prosecuted on behalf of the Treasury, Mr. C. Mathews defended. The prisoner was the eldest of three brothers who resided with their mother in Frith-street, Soho. They came into the business of their father, and subsequently serious family differences arose respecting the will. Litigation followed, which seemed to have preyed very much on the prisoner's mind. On the morning of January 25th the brother Alphonse was sitting in his room writing some letters, when the prisoner, without the slightest warning, suddenly used a pistol. The brother was wounded about the face, but he had now completely recovered. Having regard to the circumstances under which prisoner acted, there was reason to believe that he had no intention of doing his brother harm. The friends were desirous of recommending him to mercy. Mr. Charles Mathews urged that the prisoner had acted under the impulse of the moment. He had an excellent character, and there were friends who were willing to become sureties for his future good behaviour. Mr. Justice Grantham sentenced the prisoner to three months' hard labour, and bound him over to be of good behaviour for twelve months.\n\nALLEGED ATTEMPT TO MURDER.—In the case of George Edward Beasley, forty-two, carpenter, indicted for maliciously wounding his wife with intent to murder, Dr. Walker, the medical officer of Holloway Gaol, expressed an opinion that the prisoner was insane. It was stated that the prisoner had taken up the study of theology, and suffered from delusions. He told his wife that persons were in his room, and on her turning round he stabbed her in the back. The prisoner was ordered to be detained during her Majesty's pleasure.\n\nFORGING A DEAD MAN'S SIGNATURE.—Charles Langham, described as a butler, pleaded guilty to forging and uttering a cheque for £50. Mr. Armstrong prosecuted, and Mr. Keith Frith represented the accused. Langham had been a butler to Mr. Newman, of Great Cumberland-street, Hyde Park, but that gentleman died recently. Soon afterwards the prisoner went to an Oxford-street tradesman with whom Mrs. Newman dealt, and asked him to oblige her by cashing a cheque for £50. He did so, but upon paying the cheque into the bank it was returned marked, \"Drawer deceased.\" An investigation showed that the cheque was stolen in 1889. The prisoner was sentenced to six months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812741.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 688, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2987, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]