[{"id": "a85f1e2c6826580c707c04c92d2f9050ef3c1a69", "text": "SUICIDE OF A BOY LOVER.\n\nA boy named Vernon George Crowe, aged fourteen, the son of a commercial traveller, living at Egremont, has committed suicide under extraordinary circumstances. It appears that the boy had formed an attachment to a girl about his own age, and his father had several times reprimanded him about the matter. The other day, hearing that the lad was again at his inamorata's house, he proceeded thither and brought him away in a cab. Upon reaching home the boy went to his bedroom, and almost immediately the father heard the report of a firearm. Rushing to his son's room he found him dead from a terrible bullet wound in the temple and grasping in his hand a revolver, one chamber of which had been discharged.\n\nAt the inquest it was stated that the boy was greatly infatuated with the daughter of Mrs. Yare; he visited her house constantly, and from time to time stayed very late. On one occasion he did not reach home till four in the morning, and instead of entering stayed out all night, in spite of his father's prohibition. On Wednesday the father, a commercial traveller, discovered that the lad had not been at the office at which he was employed, and on going to the house of the Yares he found him there and took him home. The lad immediately ran upstairs to his own room and shot himself with a revolver. The jury found a verdict of suicide while temporarily insane, and censured Mrs. Yare for not having informed Mr. Crowe of his son's habit of carrying a revolver and also of his having threatened to take his own life. Several of the jurors also expressed their opinion that Mrs. Yare was to blame for permitting a boy like the deceased to stay so late at her house.\n\nDURING the voyage of the troopship Malabar, which has arrived at Portsmouth from Kurrahee, eight deaths occurred on board, including that of an engineman, who fell headlong into the moving machinery.\n\nFew people who knew the late Mr. Frank Cooper, the affable and active man of the world, who was so popular in the West-end, were aware of the eccentricity that has come out in his will. He is said to have left a hundred and fifty thousand pounds in cash. Of this sum five thousand was bequeathed to his valet, and ten thousand to his nephew, on the condition that he being cremated, his ashes should be solemnly scattered to the four quarters of heaven.\n\nFATAL POLICE BLUNDER.—An inquest has been held at Wolverhampton on the body of an old woman who was found in the suburbs suffering from an apoplectic fit. She was sent by omnibus, with instructions for the first policeman met with to take her to the hospital. She was placed in charge of two policemen, who locked her up for being drunk. A few hours later she was removed to the hospital, where she died. Medical evidence showed that she had not been drinking, and the officers were censured for their conduct.\n\nTHREATENING A BARONET.—At Gainsborough, Charles Kershaw has been committed for trial at Lincoln Assizes for demanding with menaces £500 from Sir Hickman Bacon, Bart., and threatening to murder him. The prisoner was convicted at the last assizes for a similar offence. He wrote, accusing the baronet of assaulting a woman, and threatened to blow him up with dynamite and stab his sister unless the sum of £500 was sent him. The prisoner, while in the dock, repeated the threats.\n\nSHOOTING AFFRAY AT A DANCE.—Belfast papers contain details of a singular shooting affair. On Tuesday night a dance was given in Scarva, co. Down, by a man named Greenaway. A crowd collected outside, and to disperse them it was alleged that two shots were fired by Greenaway and another man named Minnis. Four men, named Bell, Ryan, Murray, and Cousins, were wounded by the firing. The police shortly afterwards arrested Greenaway and Minnis.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811362.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 875, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3792, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]