[{"id": "7235cabde8eff78e964e999e70b09802cce8a18a", "text": "THE TRIAL OF MARSHAL BAZAINE.\n\nOn Monday the brother of Marshal Bazaine was examined, and gave evidence tending to show that M. Gambetta was kept accurately informed of the position of the army in Metz. General Shmitz, Colonel Magan, and other officers gave evidence, but no new fact was brought to light. M. Fournier, a lawyer of Metz, deposed to having heard the statement that Marshal Bazaine had had a conference with Prince Frederick Charles at the Chateau Corni.\n\nOn Tuesday General Boyer gave an account of his mission to Versailles and Hastings. He said Prince Bismarck gave him the most sombre picture of the state of France, alleging that several towns had asked for Prussian garrisons. The Prince was willing to grant an armistice if the Metz army publicly pronounced in favour of the Imperial dynasty. General Boyer added that the Empress would never have consented to a cession of territory.\n\nThe President, the Duc d'Aumale, alluding to the various negotiations which were entered upon, said Prince Bismarck had an interest in multiplying them in order to oppose the one against the other. Replying to a question from the Government commissioner, who asked General Boyer why he had not given notice of his movements to the Government of the National Defence, the witness said:—“I had nothing to communicate to those people.” M. Panean, the mayor of Versailles, deposed that Prince Bismarck told him that the Emperor Napoleon could have disposed of the Metz army. M. Tachand, the French minister in Brussels, deposed that the wife of Marshal Bazaine told him one day that General Boyer “was her husband’s evil genius.”\n\nOn Wednesday General Canrobert was recalled, and stated that in the month of October it was no longer possible to carry on a campaign, but that blows might have been struck at the enemy. Negotiations ought, therefore, to have been conducted, not with a view to a capitulation, but to the conclusion of a convention. He added:—“If its terms were not honourable, we might still have appealed to arms, and should not have succumbed without a vigorous effort.” Generals Lebeuf and Ladmirault gave evidence to the same effect. Generals Frissard, Coffinieres, and Changarnier were also examined, but nothing striking was elicited. M. Rouher was then called. He gave an account of the negotiations carried on in London, and said the Empress made every effort to save the Army of the Rhine, but the Germans refused any concession. Prince Bismarck asked the Empress to give her signature in blank to a paper which was to contain the bases of the preliminaries of peace, but the Empress absolutely refused to give her signature, because she would not agree to any cession of territory. M. Rouher declared that in all these negotiations the Empress was guided by a sentiment of patriotism, and that her sole aim was to save France.\n\nThe court reassembled on Friday. General Jarras, who displayed much emotion, gave an account of his mission to negotiate for the capitulation of Metz. The Germans refused all the concessions he asked except one of small importance, which Marshal Bazaine ultimately declined. Marshal Bazaine ordered all the flags to be sent to the arsenal to be destroyed, but in the meantime a notice arrived from the headquarters of the German army, from which it was evident that it would be impossible to destroy the flags without a rupture of the armistice. General Jarras’s evidence created a considerable sensation. Marshal Canrobert gave evidence with regard to the last incidents of the capitulation; his narrative produced such an impression that Marshal Bazaine burst into tears. Marshal Canrobert said:—“Why did not a great inspiration strike the Commander-in-Chief? why, instead of occupying his time with the details of the convention, did he not simply write to the Prussians:—‘Conquered by famine, we break our arms; do what you will with us!’” At these words the whole court was deeply affected. General Devaux stated that the Imperial guard destroyed their flags; Generals Lapasset and Leavenhoupe also caused their flags to be burnt.\n\nAt the sitting of the court on Saturday further evidence was given of the destruction of the flags, and the trial was adjourned till Monday, when the examination of witnesses will be concluded, and the Public prosecutor will then commence his address to the court.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206319877.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 975, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4356, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]