[{"id": "30504e6287a6712940b6ca883b7dda4172992225", "text": "ALLEGED OUTRAGE IN THE WEST END.\n\nOn Saturday, at the Bow-street Police-court, Thomas Jones, Duke-street, Bloomsbury, a clerk, was summoned for an alleged assault on a woman named Annie Ellis. The complainant made a sensational statement to Mr. Bridge on the previous Saturday, in which she alleged that at an early hour that morning she had been induced to accompany a man into a side street in Oxford street, where, she averred, he knocked her down and threatened her if she called out. At the same time she alleged that he had an open clasp-knife in his hand, and covered her face with a white handkerchief. She further alleged that the assault was seen by two witnesses, who caught the man, but he escaped, and ran into a house. She proceeded to the Tottenham-court-road Police-station with the two witnesses and gave information. Mr. Bridge directed inquiries to be made, with the result that the present summons was issued. Mr. P. T Blackwell appeared for the defence. Referring to the detailed statement made by the woman on the last occasion, he said that he understood the woman had not been seen since. She obtained some money from the magistrate. Mr. Vaughan asked if the police had made inquiries. Inspector Mulford said that he had telegraphed to the address the woman gave, at Woolwich, and a reply was received that she was not known, and had not been seen there. Mr. Bridge had given her £1. 6s. to pay her fare to Woolwich, and advised her to go to the workhouse. Witness afterwards saw her coming out of a public-house in Drury-lane. Nothing was known of her in the neighbourhood. Mr Blackwell said the fullest possible publicity was given to her statement, and he was prepared to give the clearest possible account of the defendant's movements on the evening in question. Inspector Mulford said the two men who had given their names did not appear now as witnesses. One had given a false address, and the other was described by his landlady as a person whose word could not be relied upon. Mr. Blackwell was instructed that one of the witnesses called at Mr. Jones's house that morning, but he refused to see him. Mr. Jones was a respectable young man, living with his mother at the address given. He attributed the annoyance and trouble caused him to the fact of having a fortnight ago charged a woman with stealing a sovereign purse, which he wore in his waistcoat pocket. He afterwards found it in his overcoat pocket, minus the chain, and at once informed the police of the fact, and the woman was discharged. He thought this charge of alleged assault had been \"got up\" in consequence. The complainant and her witnesses were called, but did not answer. Mr. Vaughan said the charge might have originated from an egregious mistake, or might have been a trumped-up one, but the statement made by the woman bore it the impress of truth and necessitated inquiries. Inasmuch as neither the complainant nor her witnesses were present it seemed that the only conclusion that could be arrived at was that it was a trumped-up case. It was a charge that must have caused the defendant a considerable amount of pain, but he (Mr. Vaughan) could not do more under the circumstances than to say that the summons would be dismissed, and he expressed his opinion that the charge was entirely unfounded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200808403.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 743, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3308, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]