[{"id": "7c13d20b42c0247788c1e9ebeefa66b76eb4a5d0", "text": "STRANGE CONFESSION OF MURDER.\n\nA man named Walter Hassell, who described himself as a clerk, has been charged, at the Bow-street Police-court, before Mr. Vaughan, on his own confession, with the murder of a private in the King's Royal Rifle Corps, named Downey. Detective-inspector Conquest said that, in company with Sergeant Nash, he saw the prisoner that morning on his release from Millbank Prison, and said to him, \"We are police-officers, and are going to arrest you in consequence of a statement you have made.\" After receiving the usual caution he adhered to what he had stated. In his confession he described himself as a late private of the 4th Battalion King's Royal Rifle Corps, and now of the first-class Army Reserve. He stated that early in March, 1888, when stationed at Camp Umballa, India, he murdered Private Downey by cutting his throat with a razor. It was about a quarter to ten p.m., after tattoo. Having obtained permission to go to the Latrine the prisoner went and secreted himself behind some trees on the main road leading to the military gymnasium, knowing that Lance-corporal Bacon, against whom he had a spite, would pass that way. The prisoner took with him a large stick and a razor. Whilst hiding a soldier came along, and the prisoner rushed out on him and knocked him down with the stick. He then drew the razor across his throat. After committing the deed the prisoner went back to camp, first hiding the razor in a hollow tree. Shortly after his return the prisoner learned that Private Downey had been found on the main road with his throat cut. It was believed that some natives had committed the murder. As he had no ill-feeling against the murdered man no one suspected the prisoner of the deed, and of course he kept quiet. In March, 1889, he left the army with a very indifferent character, in consequence of which he had been unable to obtain employment. The terrible deed he had committed continually preyed upon his mind, and he had several times thought of giving himself up to justice, but he had not the courage to do so. A short time ago he was committed to Millbank for twenty-one days for wilful damage. Whilst there he made the above confession, which was witnessed and read over to him by Chief-inspector Conquest. The confession was signed Walter Hassall, alias George Harris. The accused was remanded for inquiries to be made.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200809738.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 550, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2383, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]