[{"id": "183f0cc0b50948c4e52bfc5966d31f84fbf3d762", "text": "EXTRAORDINARY SUICIDES.\n\nAt the Wandsworth Town Hall, on Thursday, Mr. A. Braxton Hicks held an inquest upon the body of William M'Call, aged twenty-two years, a draper's assistant, lately residing with his father, a draper, at 21, Trevor-square, Knightsbridge, whose body was found floating in the river Thames, off Wandsworth Pier, on the 10th inst. The father said lately his son had suffered from melancholia due to over-study. On the 1st inst, when he left home he was better than usual. He never returned. Upon making inquiries he was informed that his son had been seen to jump from Putney Bridge into the river Thames. Frederick Greenstreet, residing at 2, Oakhill-road, Wandsworth, said at eleven p.m. on the 1st inst. he was crossing Putney Bridge when he saw the deceased walk from one side of the bridge to the other, and then gaze for several seconds into the river. He then walked higher up the bridge, and got over the parapet. He sat upon the bridge with his legs hanging over the water, and in a minute lowered himself and hung to the ledge with his hands. After hanging a few seconds he let go and dropped into the river. When he fell into the water he rose and appeared to be swimming with the tide. Suddenly he disappeared. He never cried out. Witness was about ten yards from deceased when he got over the parapet, but he had no idea he was going to commit suicide. He did not appear agitated. Dr. A. D. Roe, divisional surgeon of police, who had made a post-mortem examination, said the head was flattened and every bone fractured. One of the eyes was missing; and death was due to asphyxia from drowning. The injuries to the head were done just after death, and were probably due to deceased getting beneath a barge. A verdict of suicide whilst of unsound mind was returned.\n\nOn Thursday night, as the 9.36 train from Hammersmith was entering Portland-road Station, a well-dressed man, apparently about thirty years of age, was seen to step on the permanent way. For a moment or two he faced the approaching train, and then calmly knelt down and placed his neck on the off rail. There were a number of passengers on the platform at the time, and several of these shrieked out loudly, calling on the driver to stop the train. The driver immediately applied the brake, but it was found impossible to pull up in time, and the wheels of the engine and several carriages passed over the man's neck. On the train being moved away it was seen that the unfortunate man's head had been completely severed from his body. The man's identity is at present unknown.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812171.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1246, "total-output-tokens": 621, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2575, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]