[{"id": "985a94c36475d89299a7c449e511dba2a65f3ecc", "text": "TRIALS AT THE ASSIZES.\n\nKILLING A HUSBAND.—At Durham Assizes Catherine Chilton, aged thirty-six, was sentenced to twelve months' hard labour for the manslaughter of her husband at Sunderland by throwing a lighted paraffin lamp at him. He was burned very severely, and died shortly afterwards. The judge described it as a wanton and wicked act, and it was a mercy that the jury had reduced the charge to one of manslaughter.\n\nMANSLAUGHTER.—Henry Wood, a miner, was convicted of the manslaughter of Francis Barras, at Hetton, last September. The prisoner, who was a tenant of the deceased, had a dispute about rent, and the deceased sued him in the County Court. This aggravated the prisoner, who, after using threats, is alleged to have assaulted Barras, an old man, so severely that he died three days afterwards. The jury convicted Wood, who was sentenced to four years' penal servitude.\n\nTHROUGH A MATRIMONIAL AGENCY.—At Hereford Assizes, on Wednesday, Sarah Hambling, a widow, of Ashford, Kent, and her brother, Charles Cockshedge, cooper, of Grove-street, London, were charged with stealing £208, the money of Richard Oliver, hearse proprietor, Hereford. Prosecutor, having lost his fourth wife in December of last year, made the acquaintance of Hambling through a matrimonial agency this year. He confided to her that he had secreted money in the seat of an old hearse, and she induced her brother to steal it. Her letter of directions to this effect was found. In a paint-pot £39 of the missing money was discovered. The defence was that Oliver never had the money. Each prisoner was sentenced to twelve months' hard labour.\n\nLABOUR LEADER SENT TO GAOL.—John O'Brien, coach-builder and Labour leader in Liverpool, was charged at Liverpool Assizes on Tuesday with delivering to the town clerk at the recent municipal elections forged nomination papers for the Abercromby ward, and also for having forged and delivered a nomination paper for the Rodney ward, for which wards he was a Labour candidate. In one case the name of Richard Williams appeared on the paper, which was not written by him or with his knowledge or consent. There were also four forged signatures of assenting burgesses. O'Brien denied that there was any truth in the charges. The jury found him \"Guilty\" of forging Williams's name and of uttering the other document knowing it to be forged. He was sentenced to six months' imprisonment, with hard labour. O'Brien made a long speech in defence, denying his guilt, and saying he had no intention of breaking the law. He had to be stopped by the judge.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200813784.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 603, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2575, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]