[{"id": "e1766448b1cf1414b0b0e629f35b3617a5317a07", "text": "CURIOUS CHARGE OF ABDUCTION.\n\nOn Thursday Frederick Martin, soldier, was indicted at the Old Bailey for misdemeanour, in having unlawfully taken a girl named Charlotte Foster, under the age of 16 years, from the custody and control of Charlotte Foster, her mother. The defendant was a private in the Coldstream guards, and was stationed at Wellington barracks. The prosecutrix was the daughter of a poor widow, who occupied a house, the back windows of which looked into the barrack-yard, and the evidence went to show that the young woman was constantly in the habit of looking out of the window, and holding communication with the soldiers. The prisoner appeared to have formed an intimacy with her, and he repeatedly asked her to go away from her home. At length he wrote her the following letter:\n\nMy dearest little darling,—I will meet you at the place appointed at nine o'clock. Bring all that you can with you, but do not let any one see you, or they will follow you. You cannot believe how much I love you. From your own loving lover, F. Martin.\n\nThen followed a number of crosses for kisses. In consequence of this letter, the prosecutrix, who it appeared was only 14 years of age, packed up all the clothes she possessed, and met the prisoner and accompanied him to a brothel in Old Pye-street, where she remained with him all night. Under these circumstances the present charge was preferred.—Charlotte Foster, the mother of the prosecutrix, was called to prove that the young girl had been taken away without her knowledge or consent. She admitted, in cross-examination, that her daughter was not a good girl. She had, in the first instance, charged her daughter with robbing her of a shawl, which she took away with her at the time she joined the prisoner.—Charlotte Foster, the young girl who is the subject of the present charge, was then called, and she stated that the prisoner was constantly professing the greatest love for her, and asking her to go away with him, and she said that she at length consented to do so, of her own free will and accord. In cross-examination she admitted that she had been once to the canteen at the barracks, and that she had occasionally looked out of the window into the barrack-yard, and kissed her hand to the soldiers. She also admitted that she had walked out with other soldiers besides the prisoner. She also stated that she never told the prisoner what her age really was, and she certainly had the appearance of being older than 14.—Mr. De Michele, for the defence, contended that the act done by the prisoner was not the one contemplated by the statute. —The jury found the prisoner \"Guilty,\" but recommended him to mercy on account of the previous conduct of the girl.—The learned Judge, after observing that it was well that the prisoner and others in a similar position should know that acts of this description amounted to a serious criminal offence, sentenced him to a month's imprisonment.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206319498.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 660, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2955, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]