[{"id": "3c07eb5ce5f2a69d4a829ed86d904c6e3506cf3a", "text": "Is it possible that the defeated party in Midlothian are to be ungenerous enough to worry Mr. Gladstone with another contest? A correspondent informs us that Colonel Wauchope has consented to contest Mr. Gladstone's seat if he has to stand for re-election. The colonel refused to do this till it was pointed out to him that Mr. Gladstone's remarks at Aberdeen explaining the decrease of his majority was virtually a challenge to another fight. Mr. Gladstone said that he had been deserted by many of his old supporters, who oppose disestablishment unless there is a preliminary appeal to the Scottish people. He, however, indiscreetly claimed that the majority in his favour showed that those who hold this opinion must be in a minority in Midlothian. Many of them now say they supported Mr. Gladstone, as of old, on account of his Home Rule and on general grounds, not considering that the Church question was directly before the electors. As adherents of the Established Church, they complain that Mr. Gladstone is counting votes given to him on other grounds, as votes given for disestablishment.\n\nIn this connection it may be of interest to recall the fact that about two years ago Midlothian was polled by circular on the disestablishment question, just as Edinburgh was when it was proposed to give Mr. Parnell the freedom of the city. In Scotland they are rather given to this method of testing local opinion on difficult points. Sixty per cent. of the registered electors of Midlothian, in answer to the circular, said they were against disestablishment. The Irish vote in Midlothian however, is about seven hundred—some say a thousand—strong.\n\nAt its two remaining meetings before the holidays, the London County Council will be chiefly engaged in discussing the various schemes for which it is proposed to seek parliamentary powers in the next Session of the House of Commons. By one of the standing orders of the Council these schemes must be submitted before the end of July, in order to give the Parliamentary Committee due time for their preparation. The batch of proposals includes four large public works of great importance to Londoners. There is, first, the scheme for the new thoroughfare from Holborn to the Strand, and the clearance of the Holywell-street block. The estimated cost of this will be just over £2,000,000. Secondly, there is the proposal for making a southern approach to the new Tower-bridge. This is a plan for taking a new thoroughfare, sixty feet wide, from the Tower-bridge to the Old Kent-road, sweeping through densely-populated Bermondsey. The cost of this will be just under £50,000.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810599.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 592, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2627, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]