[{"id": "55270d768d582b8723d600b28aaff5f47edfd73a", "text": "THE MURDER IN THE LEEDS BARRACKS.\n\nTRIAL AND CONVICTION OF THE SOLDIER.\n\nOn Monday, at the York Assizes, Michael Stokes, twenty, was charged with the wilful murder of Marianne Garvard, at Leeds, on the 20th of January last, by shooting her with a musket. The facts of the case are as follow:—William Garvard, a private in the 57th Foot, was stationed at Leeds barracks on the 20th January; the prisoner was a private in the same regiment. My wife, the deceased, was living with me in barracks. We occupied a room in which prisoner lived, and two or three other soldiers. On the evening of the 20th, I was in the room with the prisoner, my wife, and two other privates. Dooley was asked by the prisoner for a bees'-waxed rag, and Dooley said there were some in his haversack. In about a minute I saw the prisoner doing something to his musket at the table. My wife asked what it was o'clock, and I showed her my watch; it was about seven o'clock. Immediately I heard the report of a musket, and turning round saw a musket drop from the prisoner's hands on to the floor. My wife had fallen down against the closet door, with her hands and arms spread out. She exclaimed, \"The Lord have mercy on me, what have ye done?\" I went up to the prisoner and asked if he had shot my wife, and said I'd load my musket and shoot him; he replied, \"load.\" Keenan and Dooley were present, who seized the prisoner. I laid my wife on the bed, and found, on examining, that she had a wound on the right side of the navel. Sergeant Jackson was sent for, but my wife died at half-past eight. There are nine others sleep in the same room. There is generally a married man to each room. Had never had any quarrel with the prisoner, but my wife had. The prisoner seldom spoke to any soldiers; he was a very close-minded man, hasty-tempered, and disagreeable. There was a bayonet wrenched from him once.\n\nW. Keenan, a private in the same regiment, corroborated this witness with respect to the facts connected with the murder. He added: Prisoner, immediately he fired, threw the firelock at my feet. He said, \"There now; that will do; I'm satisfied,\" I made him prisoner. I found the lead in two flat bits. The prisoner did not mix much with the other men. He was very moody and sullen. I knew him try to commit suicide when he was drunk. On that occasion he was handcuffed, and he went to the fire, laid hold of the poker, and hit himself with it on the head; but he did not injure himself, being handcuffed. On the same occasion he tried to put his hands in the fire.\n\nJeremiah Dooley, another private, gave evidence to the same effect.\n\nMr. J. Jackson, assistant-surgeon of the 57th Regiment of Foot, was called to attend the deceased, when he found a small wound in the abdomen, such as would be caused by a musket-ball. The ball went through her body. She died about half-past eight. Never noticed the prisoner in particular. Had directed his attention to insanity amongst other subjects. Was acquainted with the works of Esquirol, Mare, Pritchard, and others. Insanity was divided into four classes. [The witness went into details on this subject, which need not be reported.] Men frequently may have insane impulses. An insane impulse may exist which may entirely take away a man's self-control.\n\nThe judge: I wonder who has found that out.—Mr. Dearsley: It is laid down by Pritchard that a person may be labouring under an insane impulse which may deprive him at that moment of self-control.—The judge: Even supposing the hangman was standing by to execute him for it?—Mr. Jackson: Yes, there may be a thousand more madmen now in France since the revolution than there were before, chiefly arising from exciting causes. Such was the case at the last revolution, and he supposed it would be so now. The treatment of insanity is now very different from what it used to be. There were now no dungeons, no straw, and no chains. Insanity is a very difficult subject of study. A man labouring under homicidal monomania may exhibit its symptoms very forcibly when intoxicated.\n\nMr. W. Price, surgeon, of Leeds, underwent a long examination relative to insanity, but his answers being so similar to those of Mr. Jackson, we think it needless to give his evidence at length.\n\nMr. Dearsley having addressed the jury for the prisoner, Mr. Baron Rolfe summed up, in the course of which he said that it too frequently happened that offences were committed with little or no motive, and he conceived it was a very dangerous doctrine for the peace of society to contend that, because a man perpetrated a dreadful crime without apparent motive, he should therefore be deemed insane.\n\nThe jury, after a very brief consultation, returned a verdict of \"Guilty.\" The prisoner, being asked if he had anything to say why sentence of death should not be passed upon him, said, \"I hope, my lord, you'll have mercy on me.\"—Mr. Baron Rolfe then pronounced sentence of death.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206191884.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 1184, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4930, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]