[{"id": "b23857cc57ba1e552cfde2482ac23cc754386d4c", "text": "A STABBING CASE.\n\nA boot and shoe maker named Edward Moss, aged 45, was charged at Bow-street police-court, on Thursday, with feloniously cutting and wounding Charles Winter, with intent to do him grievous bodily harm.—Elizabeth Ann Winter, wife of the injured man, living at 10, Vittoria-place, Duke's-road, St. Pancras, deposed that the prisoner was a lodger and occupied the parlour. About half-past 12 on Wednesday witness's husband knocked at the door of the prisoner's room and asked him why he had insulted witness. There had been unpleasantness, and the prisoner had said that he intended doing for her and her husband. Witness heard the prisoner make use of some nasty language to her husband, and then heard them struggling together. She went down and found her husband holding the prisoner against the wall. The prisoner had a knife in his hand. She saw him push it towards her husband, who was bleeding from the face. She tried to get the knife away from the prisoner, but in doing so received a cut on the hand. Her husband got away and went into the street, where he fell down. Assistance was rendered, and he was taken to the hospital, where it was found that he was suffering from a wound in the breast, one a little lower down, and two cuts on the face.—Police-constable Sargeant, 494 E, deposed that the prisoner went up to him in Vittoria-place, and said, \"I'll give myself up, policeman; I have done it in self-defence.\" He produced a shoemaker's knife, and handed it to the constable. It had a very sharp edge.—Up to a late hour last night fears were entertained that the injured man would not survive, but Inspector Clifford stated that he was much better, and would be enabled to give evidence after he had undergone a course of treatment.—The prisoner was remanded.\n\nLOSS OF A VESSEL AND ALL HANDS.—Early on Thursday morning the ketch James and Sarah, belonging to the port of Bridgwater, suddenly foundered off the Gore sands, near Burnham, on the Somersetshire coast, and the crew, consisting of William Sharman (the captain), Henry Sharman (his brother), and an unmarried man, name unknown, were all drowned.\n\nTHREE MEN DROWNED.—The bodies of Patsy Radican and two other men unknown were taken out of the river at Winsford, Cheshire, on Wednesday night by Captain William Brook. They are supposed to have been going down the river on Sunday night, and fallen in while under the influence of drink. Three hats were found in the river on Monday.\n\nVIOLENT ASSAULTS.—At Wolverhampton, on Wednesday, Philip Bulger, a powerful young fellow, was charged with outrageous assaults on two policemen and a civilian. The previous night prisoner was violently assaulting a shopkeeper named Richards, when Police-constable Lee came on the scene, and, on seizing hold of the prisoner, the latter caught hold of his right thumb, put it in his mouth, and bit it badly. He also bit him on one of his arms, and brutally kicked a second officer. Prisoner was sentenced to six months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206247955.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 715, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3003, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]