[{"id": "f3c2006b96b4627e20f1e067b3b68731ab10f461", "text": "A MANCHESTER MYSTERY.\n\nThe Manchester police are investigating what appears to be a most mysterious occurrence. About nine o'clock on Thursday morning some painters went to a house in Indigo-street, Bridge-street, Ardwick, for the purpose of cleaning it. Not being able to gain admission they made inquiries from the neighbours, and eventually informed the police. A constable went to the house and broke the door open. As he could find no one in the kitchen he proceeded upstairs. He then found one woman lying in an unconscious state on the floor and another in a similar condition on the bed. It appears that the women are sisters, named Elizabeth McQuinnis, aged about forty years, and Mary Joyce, thirty-two years of age. A doctor was sent for, but he advised their removal, and Sergeant Gibbons had them removed to the Ancoats Hospital. The house in which they lived is a very small one, having only one room up and one down. When the room was first entered the stench was shocking. Owing to its smallness it was more like entering a stove than anything else. There was a child found in the bed, but this was found to be all right. Both the women were seen on Wednesday, and appeared to be all right then. On being taken to the hospital both women were found to be still in an unconscious condition. The stomach pump was used, but no traces of poisoning could be found, and the doctors are at present unable to give any decision as to what they are suffering from. A rumour gained ground in the neighbourhood that it is a case of poisoning, but the police, who are in possession of the house, have been unable to find anything that would give credence to this story. Later in the afternoon the women, under the skilful treatment of Drs. Williamson and Montgomery, recovered. They were able to tell the medical gentlemen that they had taken nothing which would account for the condition in which they had been found. Dr. Williamson expressed the opinion that his patients had been overpowered by sewer gas, and with the view of confirming that supposition he and Dr. Montgomery intend to pay the house in Indigo-street a visit of inspection. It is confidently expected that both the women will ultimately completely recover, but they will be detained as in-patients some little time.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810884.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 511, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2288, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]