[{"id": "a369295299d41bcde1279dbfe7577de92900840a", "text": "THE CLERKENWELL MURDER.\n\nHenry W. Pace, 42, metal worker, was indicted at the Old Bailey on Wednesday for the wilful murder of Thomas William Cole, by striking him on the head with an iron instrument called a spanner.\n\nThis case was one of a very painful character. The learned counsel for the prosecution, in his opening address, said that the prisoner and the deceased were both employed at glass works at Clerkenwell, and it appeared that when the deceased, who had come from the country, first went into the employment, he had no friends in London, and the prisoner was very kind to him, and invited him to come and occupy part of a house in which he resided at Enfield with his family, which consisted of six children, the eldest being a girl named Lizzie. It was not disputed that during the time the deceased resided in the prisoner's house he had grossly abused the confidence reposed in him by the prisoner, and had seduced his daughter, who was in the family-way by him. The deceased ultimately left Enfield, and went to reside in Essex-street, Clerkenwell; and it would appear that the prisoner's daughter went to live with him there. The prisoner was very much distressed at this state of things, and repeatedly pressed the deceased to marry his daughter, but he always declined to do so, and this preyed very deeply on the mind of the prisoner, and, no doubt, led to the sad occurrence that was the subject of this inquiry. No one was present when the deed of violence was actually committed, but from what afterwards occurred there appeared no doubt that on the morning in question prisoner had pressed deceased to marry his daughter, and upon his refusing, the prisoner had struck him a terrible blow on the head with the spanner, which had fractured his skull and caused death. — The evidence for the prosecution was very brief, and mainly established the above facts. It was also proved that the prisoner was an extremely well-conducted man, and that he had been 26 years employed in the same establishment, and had been promoted to be foreman on account of his good conduct. It also appeared that from the time when he discovered that his daughter had had a child his conduct had completely changed, and he frequently complained of his head and said that he could not sleep, and thought he should go mad.—Some members of the prisoner's family were examined as witnesses on his behalf, and they stated that for several days before the day on which the alleged murder was committed the prisoner had appeared to be in a most dejected and desponding state, and that his razor had been taken away on account of a fear being entertained that he would commit suicide.—Mr. Clarke made an earnest appeal to the jury on behalf of the prisoner.—The learned judge having summed up, the jury found the prisoner \"Not guilty\" of murder, but \"Guilty\" of manslaughter. The jury added that they were unanimous in recommending the prisoner to mercy.—The learned judge said he would consider what sentence should be pronounced.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206244330.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 660, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3025, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]