[{"id": "9fb90d8009ebd5d9080ecc96e63444c4fb1120ca", "text": "SERIOUS CHARGE OF FRAUD.\n\nOn Wednesday, Thomas Payne, a man of highly respectable appearance, surrendered at the Surrey sessions in discharge of his bail, to answer an indictment charging him with, being bailee of a certain quantity of wheat, having sold and converted the proceeds to his own use in fraud of the London, Brighton, and South Coast railway company. In other counts, the property was laid variously as being that of the consigner and consignee.—The prisoner pleaded not guilty.\n\nThe facts of the case appeared to be these. The prisoner had been the proprietor of the Goat House hotel, at South Norwood, and he let some portion of his premises to two persons, named Franks and Gander, who painted up the firm of \"Franks and Co., corn and flour factors.\" On the 5th December last it appears that forty-six quarters of wheat had been purchased from a Mr. Flexman, of Watford, by a Mr. Harradance, a corn merchant, carrying on business at the Corn exchange, Mark-lane, and residing at Lower Norwood. The instructions given by the buyer were that the whole should be forwarded to the Wakefield corn market, but by mistake they were sent on to the Norwood Junction station in two trucks, and there the property arrived on the 12th December, with a consignment note to Mr. Harradance, who having only a private residence there was not known as a corn merchant. On the 14th December, in consequence of the alleged consignee not being found, Mr. Harold Bridger, the superintendent of the goods department at the Norwood Junction station, set out to make inquiries, and calling on the prisoner at his hotel, asked him if he knew Mr. Harradance, as there were some goods waiting for him at the station. In a few days afterwards the prisoner presented himself at the goods station, and claimed the goods for the firm of \"Franks and Co.\" and paid the amount of carriage of the goods, £7. 10s. 11d., and not only directed the wheat to be conveyed to the stores of the supposed firm of Franks and Co., but actually superintended the loading of the carts, and the deposit of the wheat into the stores. In consequence of the loss of the wheat further investigation ensued, and this continued until February last, when Mr. Bridger again called on the prisoner and inquired what was become of the wheat in question, when the prisoner declared that Franks and Co. had gone away largely in his debt, that he should never obtain from them the sum he had paid for the carriage, and that he knew nothing of what had become of the property. Inquiries were then instituted by Inspector Carpenter, a highly intelligent officer in the company's service, when it was ascertained that in April last the prisoner had directed a Mr. Strickland, a corn-factor, to sell the wheat for him. That he effected a sale to Messrs. Kidd, of Brighton, and that he had received from Mr. Strickland a cheque for £87., the amount of the purchase at the then market price. Such were the circumstances under which the railway company on public grounds instituted this prosecution.\n\nThe witnesses having been examined, Mr. Lilley addressed the jury for the prisoner, contending that his client was the victim of the pretended firm of \"Franks and Co.,\" who had gone away largely in his debt, and that he was a mere dupe.\n\nThe jury, after a brief consultation in their box, returned a verdict of \"Guilty.\"—The deputy-chairman therefore sentenced the prisoner to be imprisoned and kept to hard labour in the house of correction for six calendar months.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206223532.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 804, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3514, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]