[{"id": "78d5dca49f3eb53b5c3f6cff32250b120beafbf1", "text": "BRUTAL MURDER OF A CHILD.\n\nBATH, SATURDAY.\n\nThe coroner (Mr. A. H. English) has been engaged during two days, at the Horse and Jockey Inn, Beanstreet, investigating the circumstances attending the death of a female child, the illegitimate offspring of a young woman named Elizabeth Hillier, residing at No. 3, St. James's-court. The evidence taken proved that prior to the female's confinement, she admitted to a woman, named Harvey, who lodged in the same house, that she was enciente, which induced her to give her some linen to make clothing for the child. She, however, never finished the things, alleging, as an excuse for not doing so, that \"the child would not live long.\" A day or two since, the female gave birth to the deceased, which was found tied up in a bundle in her box, quite dead, and with the lower jaw broken and pressed back about an inch, clearly indicating that great violence had been used by the unnatural parent to deprive the child of life. Information having been given to the police, medical aid was procured, when Hillier said, \"What the devil did you make such an oration about—do you want to hang me?\" The medical evidence proved that the jaw had been broken through, some one having passed the hand from above downward, and had been occasioned from compression. The injuries were the cause of death. The witness Harvey said that Hillier had said to her on one occasion, \"Why you could do away with the child,\" which of course she refused to do. The jury, after consulting, returned a verdict of \"Wilful murder against Elizabeth Hillier,\" who was forthwith committed on the coroner's warrant to take her trial at the next assizes.\n\nTHE RAINBOW TAVERN, FLEET-STREET.—This celebrated place, formerly a portion of the palace of Cardinal Wolsey, and which, since it has been a tavern nearly two centuries, has been the resort of all the most eminent lawyers, poets, and players, has lately undergone a most material change in the interior. A portion of the building set apart for public use has been formed into one extensive hall, and fitted up in the same style as the other parts of the edifice were when erected by Cardinal Wolsey. Carved oak and bronze work, in the Elizabethan style, form the principal features, relieved with panels and illuminated shields. The room is lighted with ormolu gas jets, ingeniously arranged to throw an equal light over the room. The place is divided into compartments by curiously-formed oaken panels, and the seats are stuffed and arranged with cushions covered with crimson Utrecht velvet; and a luxurious carpet, to match, covers the floor. To Mr. Hurwitz has been entrusted the task of remodelling and fitting the place, which is most uniquely finished in every minute particular. As it ever has been, so it still remains, the resort of all the leading lawyers, literati, and actors of the day, who hourly meet beneath the roof.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206194299.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 669, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2898, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]