[{"id": "e96ea7b5adc4f2c9ca680e7bc45ce331f4f44a05", "text": "MURDER AND SUICIDE AT CHATHAM.\n\nOn Monday, at the Prince of Guinea tavern, Pierroad, Gillingham, inquests were held by Mr. W. G. Harris, coroner, upon the bodies of John T. Osborne, retired wheelwright and cab proprietor, aged 62 years, and Mary Elizabeth Brenchley, aged 38, who had been living with the former as his wife. No one saw the fatal injuries inflicted, but it appeared that the parties had been quarrelling on Friday, the 13th inst. What followed after an alarm was raised may be gathered from the following evidence:\n\n—John Robert Osborne, smith and house agent, stated: Deceased, John Thomas Osborne, was my uncle, and aged 62. On Friday evening at about seven o'clock, in consequence of what I heard I went to his house in company with Constable McFarren. In the kitchen we saw Miss Brenchley coming towards us. She had something wrapped round her neck. She pulled it aside, and said, \"Look here.\" She was covered in blood, and we got her to a sofa, and called in two women. I asked where was Mr. Osborne, and she replied, \"I don't know.\" I went upstairs, and there saw Mr. Osborne with his throat cut and blood oozing from the wound. He was dead upon the floor. There were no signs of a struggle, and I have no doubt whatever it was his own act. I next went into the back bedroom and there saw the signs of a most desperate struggle. We then returned downstairs and did what we could for the woman. I said, \"Who did this?\" She replied, \"I can't be bothered,\" and motioned me to keep back. Miss Brenchley told others, \"Osborne did it.\"\n\n—Constable McFarren gave similar evidence, and Eliza Elliott and Maria Whitingham also stated that the deceased woman had mentioned Osborne as the man who had wounded her.\n\nDoctors Buzzard and Hugo described the injuries to both the deceased, leaving no doubt that Osborne had been the assailant, and that he had subsequently committed suicide. It was also stated that Osborne was very much depressed previous to the tragedy.\n\nThe coroner, in summing up, read two letters written by Osborne, apparently just before the deed was committed. They contained statements of a very rambling nature, setting forth that the woman had been poisoning him and his child; that she had been unfaithful to him, and had been, his ruin, for which he intended paying her out.\n\nThe jury ultimately returned a verdict to the effect that \"Osborne had murdered the woman, and had also committed suicide, whilst of unsound mind.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206251456.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 599, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2459, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]