[{"id": "b051728f54c82555b5dacabba0a57e049684bdb4", "text": "ALLEGED MURDER OF AN ITALIAN.\n\nGeorge William Swindle, twenty, costermonger, of Halford-road, Fulham, was charged, at Westminster Police-court, on Monday, on suspicion, with causing the death of a young Neapolitan named Giovanni Ligiere, by striking him on the head with a brick at King's-road, West Chelsea, on the early morning of the 20th ult. Inspector Beckley, of the B Division, who represented the Commissioners of Police, stated that the deceased was a baked potato seller, and in the early morning was proceeding home to Fulham with his oven. Two men stopped him, and they were served with baked potatoes. A dispute occurred, and one of the men threw a brick, which struck the Italian behind the left ear, and caused his death in the hospital on Thursday morning. Sergeant Bartholomew, 33 B, said that at half-past one on the morning of the 20th ult. he was in King's-road, near the Cremorne estate, when his attention was called to deceased, who said he had been assaulted. He made a statement, and pointed to an injury—a swelling and cut—behind his left ear. Mr. Sheil said the statement made by the deceased at that time could not be admissible as evidence. It was not a statement in the nature of a dying declaration. The sergeant said everything possible was done for the Italian, and the police eventually took him home. Edward Hooper, a young man employed as a night watchman, deposed that on the morning in question he was standing in the King's-road, by Guntergrove. The Italian came along wheeling his barrow towards Fulham. Deceased was attacked by two men, who obtained potatoes from him and then threw the peelings in his face, apparently refusing payment. Mr. Sheil: Both threw the peelings? Witness: Yes. They upset the Italian, who ran towards them with a poker and made a strike at them. He did not hit either and returned to his barrow to wheel it off. One of the men then picked up half a brick (produced), and threw it at the foreigner. The man was struck behind the ear, and he fell. The two men then ran away. Mr. Sheil: How far were you off when this brick was thrown? Witness: I was about twenty yards off, but there is a lamp at the corner, and there was also one on the poles I was watching. Mr. Sheil: Now, look well at the prisoner. Was he the man who threw the brick? Witness: No, sir. I could swear to the man who did it. Was the prisoner there? No, sir. Prisoner: When this man was called on Saturday night he only said he thought he knew me. Inspector Beckley: The witness picked the prisoner out from nine others at the police-station. Mr. Sheil: You hear what he says now. He says the prisoner is not the man. The Prisoner: I can prove I was in bed and asleep at the time of this occurrence. Detective-sergeant Tallin said prisoner made that statement when he was arrested. The witness Hooper had been making various contradictory statements. Inspector Beckley remarked that the police had some other information. A remand was wanted, and legal aid would be applied for. Mr. Sheil remanded the prisoner for a week, and said he would take bail—two sureties in £25.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810957.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 762, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3106, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]