[{"id": "a9bfa85fc9a2da065a77f0ecc06ccb11b4d20652", "text": "TRIAL OF CAPT. WILSON FOR MURDER.\n\nOn Tuesday, Captain William Wilson, late commander of the British ship Express, was indicted at the Liverpool assizes for murder. The prisoner was charged with a most atrocious act that vessel. Captain Wilson, being a native of Monmouth (the Prussian), had been tried by a court-martial composed of foreigners.\n\nThe Express sailed from Liverpool on the 21st September, and the deceased (who was thirty-three years old) had joined some short time before, being then in good health. When the ship had been off the coast of Spain for about two weeks, the deceased, who was wounded in the ankle. This was done as punishment for his disobedience being quick to answer when ordered to wash his clothes in a clean towel, or some act of that kind. On the same day the prisoner went into the temple. The deceased picked up the knife, gave it to the prisoner, and a second blow was inflicted on him. In the course of the same day he also beat him with his fists, knocked him down, and threatened him with death. A series of acts of violence were perpetrated; to three of which, however, in the meantime, the deceased fell into a feverish state, and remained in that condition until the 4th of November, just before entering Bristol Roads. He recovered from the fever, but though recovering from the fever, he let him go weak and prostrate, so that he was unfit for duty. The prisoner then ordered him to pick oakum, but he could not do it. On the 13th December, the prisoner asked the deceased if he had been striking him. The deceased was unwilling to say anything, but mentioned some name, which induced the doctor to go as close to the captain, and bring him back to his senses. The prisoner then said, \"Who has struck this man?\" The captain said, \"I did not do it; the man had fallen down from weakness.\" The prisoner then said, \"That is strange to say, the deceased, who knew the man that said it, made no observation whatever, and I am sure that he did not fall from weakness, but from fear, or whether the captain's statement was correct.\"\n\nThe last act of violence was committed on the 17th December, when the prisoner asked the deceased if he had been striking him. The deceased was unwilling to say anything, but mentioned some name, which induced the doctor to go as close to the captain, and bring him back to his senses. The prisoner then said, \"Who has struck this man?\" The captain said, \"I did not do it; the man had fallen down from weakness.\" The prisoner then said, \"That is strange to say, the deceased, who knew the man that said it, made no observation whatever, and I am sure that he did not fall from weakness, but from fear, or whether the captain's statement was correct.\"\n\nThe prisoner replied that it was \"all lameness,\" and saying the deceased by the shirt, he struck him upon the head with his fist, and knocked him down, and hit him in the sides and head, and beat him. The deceased at first cried out, but at last he became silent and motionless. The prisoner then ordered buckets of water to be thrown over the deceased, after which he was lifted up and dry clothes put on him. The prisoner then came back to the deceased and asked him if he was satisfied. The deceased said yes. You cannot kill me at sea, and he took a stick and kicked him, and renewed his threats, \"that he had seen a lamp overboard, and that he had seen a lamp ashore.\" The deceased sank under this continued ill-treatment, and died shortly after. The prisoner then said, \"I have killed him, and I believe that the acts of the present accusations the death of Hennessy he would be guilty of homicide, and that he would be found guilty of whether that his homicide was manslaughter or murder.\"\n\nThe statement in the address of the learned counsel was that the prisoner had been visited by several seamen who had witnessed the atrocities.\n\nMr. Wm. Gunn was next examined. He acted as surgeon to the crew of the Express. He attended Hennessy, who was suffering from intermittent fever. After the fever left him he was very low, and Mr. Gunn said he thought he would die. He died on the 25th. Remembered going on board the Express on the 22nd December, saw both Hennessy and the prisoner. Challenged the deceased in the captain's presence as to who had killed him. The prisoner said he had killed him in private, he made no reply before the captain. The captain said he had fallen out of his berth, but was not killed. The prisoner said he had killed him, but caused. Deceased was afflicted with boils, but was a good deal better of those before his death. Says his death was caused by the violence inflicted upon him. Had seen such spots several times within four hours before his death. Saw the prisoner strike him. The violence inflicted upon the prisoner, witness could not form an opinion as to whether it would have amounted to murder. Mr. Aspinall elicited that Mr. Gunn had signed the official log book. The prisoner had died from delirium tremens by fever. Says that the prisoner was the cause of the deceased, but did not think they had any influence over the prisoner. Such injuries would increase delirium. Deceased improved from the 22nd of December to about the 26th December, when a relapse or sinking took place, and death resulted.\n\nMr. Aspinall then quoted some authorities, with a view to show that the prisoner had been \"in a state of harbour,\" and thus, the offence not being committed on the high seas, the present court had no jurisdiction. Mr. Aspinall then addressed the jury for the defence, and the legal officer summed up the case. The jury, after much deliberation, returned a verdict of \"not guilty.\" They were consequently discharged.\n\nThe prisoner Wilson will be brought up again on other indictments.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206211949.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 464, "total-output-tokens": 1303, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5758, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]