[{"id": "2dd734482437ec1e048b2534d443a3a1f04081d8", "text": "STRANGE CONDUCT IN A CHURCH.\n\nAt the Mansion House Ernest Eldridge, a powerful-looking man, was charged with being a wandering lunatic. Sergeant Ballard stated that at about nine o'clock on Thursday night he was called to St. Benet's Church, Queen Victoria-street, where he found the prisoner lying in one of the pews. He appeared to be asleep. Witness asked him what he was doing there, and he replied, \"This church is my own. The Church is much higher than the law, and as you merely represent the law you have no right to interfere with me.\" He refused to get up or to go away, and witness then took hold of him to raise him up. Prisoner upon this became extremely violent, and kicked witness in the stomach and struck him in the face. He was more like a madman than anything else. Three other constables came to witness's assistance before the prisoner could be overpowered and secured. Arrived at the station, the inspector thought it advisable to order his removal to the Bow Infirmary. There he repeated his violence. The doctor, however, said he was not insane, but that he was suffering from the effects of excessive drinking. Prisoner had with him in the pew a bundle, in which were a number of pieces of glass, and he had in his possession a good discharge, dated the 13th inst., from a ship on board which he had served as a sailor. Prisoner said he was very cold on Thursday, and entered the church to have a sleep. The alderman cautioned the prisoner and discharged him.\n\nINHUMAN TREATMENT OF A CHILD.—Dr. Macdonald, coroner for North-east Middlesex, on Saturday had reported to him the death of William Watson, aged two months, the son of a carpenter, living at Morley Avenue, Wood Green. It appears that the mother of the deceased died soon after the child's birth, and the baby was then put out to nurse. The father, however, neglected to pay the sum he had agreed to for the child's support, and the nurse threatened that unless he did so she would leave the child at his house. This threat was carried into execution, and the poor little thing, it is said, was left by the father lying in the passage for three hours in the middle of the night. The Society for the Prevention of Cruelty to Children hearing of the case, called in Dr. Macdonald, of Alexandra-road, but death took place shortly afterwards. A post mortem examination has been ordered, and an inquest will be held in due course.\n\nYOUNG THIEVES.—John Fitzgibbon, eighteen, and Albert Knight, seventeen, pleaded guilty, at the Middlesex County Sessions, to stealing 68lb. weight of lead, value 10s., the property of George German, Willesdon. The prisoners were seen on the night of January 14th in Kilburn, carrying a sack containing a sack containing lead, which was afterwards found to have been pulled down from some new buildings in the neighbourhood. Mr. Halkett prosecuted, and a previous conviction was proved against Knight. Detective Langford gave both the prisoners a bad character. They were continually hanging about the neighbourhood committing petty thefts, and when Knight was caught on the last occasion Fitzgibbon was with him, but escaped. Knight was sentenced to nine months' hard labour, but Fitzgibbon, as a first offender, was remanded in order that Mr. Wheatley, of St. Giles's Christian Mission, might be written to with a view to his reclamation.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810140.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 781, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3351, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]