[{"id": "35a272a63919fa35350dcc9acf42957b6e4ac020", "text": "A FUNNY YOUNG MAN.\n\nRobert Swinburne, described as of Alma-terrace, South Kensington, gentleman, was brought up, on a warrant, for public examination, it appearing that he had disregarded the process of the court, and had failed to attend upon the official receiver for examination.\n\nMr. C. A. Pope attended as assistant receiver, and Mr. Marshall Hall on behalf of creditors.\n\nThe bankrupt, in the course of his examination, said that he came of age last year, and between January and July, 1892, he managed to get rid of £5,000 all but a pound and a penny. He applied part of the money in payment of old debts, including £1,060 in payment of a bill of £1,000 for which he had received £500. His items of expenditure included £20 per week for a tandem.\n\nMr. Marshall Hall: Have you been attempting to borrow money on the representation that you were Sir John Swinburne's eldest son?\n\nThe bankrupt said that he had not—only that he was the son of Sir John Swinburne.\n\nMr. Marshall Hall produced a letter from the bankrupt containing the expressions \"Love to Gipsy,\" and \"Won't it be funny if I get in the Divorce Court?\" (A laugh.) He asked what he meant by such expressions.\n\nThe Bankrupt: Well, it would be funny, wouldn't it? (Laughter.)\n\nMr. M. Hall: How many women were you paying at one time?\n\nThe Bankrupt: Various.\n\nMr. M. Hall: Who was your mentor in showing you your way through the world?\n\nThe Bankrupt: No one in particular. He further stated that he had got into trouble with the magistrates at Harrogate through getting \"boozeed,\" but it was a trifling matter.\n\nThe examination was adjourned, and the bankrupt was removed in custody.\n\nA WIFE SHOT.—A deaf and dumb hawker, named Harris, was apprehended at Leicester, on Friday, for shooting his wife in the head while in bed. The parties were married last Whitsuntide, and, after being separated, agreed to live together on Thursday night. The woman was badly injured.\n\nFEARFUL DISCOVERY.—An old woman, named Nuttall, was on Thursday left at home at Bacup, East Lancashire, with her daughter's eight months' old child, while the rest of the family went to work. When the daughter returned she was horrified to discover her mother lying dead on the hearthstone with her head under the fire grate and the baby still clasped in her arms. The baby miraculously escaped with only slight burns. The woman was burned about the shoulders.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811336.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 606, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2393, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]