[{"id": "cd781b5c775825ddc7107909ca32fc525d77545f", "text": "BREACH OF PROMISE CASE.\n\nAt the Sheriff's court, on Thursday, before Mr. Under-sheriff Burchell and a jury, the case of Miss Sarah Ann Charnell, a governess, residing at Bindley-heath, Godstone, against Mr. James Mitchell, assessor of taxes and agent, of Chapel-street, Ilkston, came on for assessment of damages, judgment having gone by default in the High Court of Justice.—The case for the plaintiff, as given in evidence, was that she was engaged to the defendant for about a year up to eight years ago, when the engagement was broken off, to be renewed, at the solicitation of the defendant, at Christmas, 1887. There were a large number of letters of the ordinary amatory description, but counsel did not put them in, as he thought it only necessary to bring forward evidence as to the defendant's means. A letter was put in written by Mr. Mitchell to the plaintiff stating that he had been elevated from the position of collector of taxes to that of assessor, and as he was also an agent for the Prudential Assurance company, the plaintiff concluded that he was in a good position. In one of the letters the defendant said he had been to his sister's wedding, and added, \"I should not like a wedding to come every week, for this present one has cost me between 15l. and 20l. Of course the money is not thrown away.\"—The Under-sheriff: That letter might be variously interpreted (a laugh).—Mr. Hopkins said the plaintiff had escaped marrying a man whose gross income was only 114l. a year, and, after necessary expenses and travelling were deducted, a nett income of 20l., or 30s. a week.—The defendant gave evidence in support of this statement as to the extent of his means, and said he had written a letter to Miss Charnell prior to the one given above, in which he told her he had come to the conclusion that it was better for him \"to paddle through life alone,\" and that it seemed Fate had designed he should refrain from entering \"the blessed state.\"—The learned Under-sheriff advised the jury to assess the damages at a moderate figure, as in that case the plaintiff was likely to recover, while if large damages were assessed it was probable she would get nothing.—After a few minutes' consideration the jury assessed the damages at 40l.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206269975.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 551, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2251, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]