[{"id": "f6eab571f0c15c2fda88e6c201acb276e6f05d32", "text": "ANOTHER ROBBERY OF ARMS NEAR CORK.\n\nSeven stand of arms belonging to men of the 14th Hussars, stationed at Ballacolig, have been stolen from the barracks under mysterious circumstances. The arms were not missed on Wednesday evening, but it is supposed they were abstracted on the previous night during a theatrical performance which most of the men attended. It is not known by what means they were removed. The seven men, whose arms are missing, have been placed under arrest, as well as two non-commissioned officers. No clue to the thieves has been found.\n\nA Cork paper states that overtures were made by Government to the prisoners recently acquitted of complicity in the robbery of arms from Mallow barracks, to the effect that a handsome reward would be given, and the two convicted prisoners, Sullivan and Murphy, would be liberated, if the arms were restored, or information given to lead to their discovery.\n\nPROPOSED NEW RIVER EMBANKMENT.—At the meeting of the Metropolitan Board of Works on Friday, Colonel Hogg in the chair, Mr. White said he wished to call the attention of the Board to a very important subject—the continuation of the Victoria embankment past the Houses of Parliament, so as to form a junction with the Chelsea embankment, now in course of construction. He moved that the engineer be instructed to prepare plans and estimates for embarking that portion of the River Thames; also, for widening the roadway fronting the Pententary to 70 feet by extending that embankment further into the river; and that the Chairman be requested to confer with the Chief Commissioner of her Majesty's Works, &c., to ascertain how far the Government would be prepared to co-operate with this Board for the execution of this work. After a short discussion the whole subject was referred to the Works committee for report and consideration.\n\nTHE STRANGE SUICIDE OF A POLICE-SERGEANT.—On Thursday afternoon Mr. W. J. Payne held an inquiry at St. Bartholomew's hospital respecting the death of Police-sergeant Robert Bridle, aged 50.—Mrs. Martha Bridle, widow of deceased, said that she lived at 5, Norman's-buildings. Three years ago deceased retired from the police force on a pension. He then got employment on the Midland railway, and nine weeks ago a daughter, his eldest one, aged 18, died. Her death preyed on his mind, and he stopped away from the Midland railway works for two days, and he was compelled to give up his employment. He then drank more than he ought, and got into a desponding state. The depression, resulting from the loss of his daughter and his situation, affected his head. The jury returned a verdict—\"That the deceased had destroyed his life while in a state of temporary insanity.\"\n\nTHE ALLEGED FORGERY BY A CITY POLICEMAN.—At the Mansion-house, on Thursday, Henry Redpath, a City policeman, underwent a final examination on the charge of forging an endorsement on a banker's cheque, with intent to defraud. It was now stated that the prisoner's beat included Gresham-street, where Messrs. Tapling's premises are; that the premises were closed on the afternoon of Saturday, over the Bank holiday on Monday, and until Tuesday morning; that meanwhile the letters in their letter-box had greatly multiplied, and it was supposed that the letter containing the cheque had flowed over into the street. The prisoner had 10 years' good character for services in the navy before joining the City police. He was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206237533.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 781, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3460, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]