[{"id": "aaca353fe3045fb4e5ba683196f0d2837a06b9ce", "text": "SEQUEL TO A BREACH OF PROMISE.\n\nAt the Croydon Borough Police-court, John Joseph Leonard Criddleland, a brewer's traveller, of Holmwood-road, South Norwood, was summoned by Miss Frances Hiscock, of Buxton-road, Croydon, who alleged that he was the father of her child, and asked that he might be ordered to contribute towards its support. Mr. E. M. Armstrong appeared for the complainant and Mr. Letchford for the defendant. Miss Frances Hiscock said the child in question, a boy, was born on August 22nd, 1893, and the defendant was the father. The letter produced, dated January 3rd, 1893, was in Criddleland's handwriting. It read as follows:— \"My Dear Franky,—After what you said on Saturday I suppose I must not come now, and therefore write to say I shall pay the expenses of this affair, but they must not exceed £10 or £12, as that is all I can afford; further, I will allow you £1 a month for life. If I am lucky I hope to allow you a little more, unless you should get married.—Yours very sincerely, LEN.\" Let me have a line at Croydon to-morrow. Best wishes. I am sure all will be right in the end.\"\n\nCross-examined: When she first made the defendant's acquaintance she was adopting the name of Stanley for business purposes. By \"business\" she meant dressmaking. She still did dressmaking, but used no brass plate, her customers being recommended. Before coming to Croydon she lived at 92, Byne-road, Sydenham; that was when she first saw the defendant. She was standing at the window talking to her sister and smoking a cigarette. She always smoked a cigarette in the morning for indigestion. While there she was visited by Lieutenant Glossop, of the 17th Lancers, who was now in India with his regiment. She was not aware that there was no lieutenant of that name in the 17th Lancers, and that that regiment was not in India. She registered the child in the name of Hiscock. —I think you brought an action for breach of promise against the defendant, and that there is a judgment against him for £500 damages and costs? Yes—Have you had the money? Not a farthing.—Have you applied for it? My solicitor has. Mrs. Criddleland, the defendant's wife, called upon her and insulted her by accusing her of impropriety with other men; but it was not true. Mr. Letchford: Were you judgment? Mr. Seale (chief clerk): I should think she was. (Laughter.) Witness said she was indignant. Re-examined: The defendant told her that he was a single man, and promised her marriage, and it was after making that promise that he seduced her. Mrs. Ann Criddleland, who was sworn on the Old Testament, said she was the defendant's wife. When she called on the plaintiff she accused her of impropriety on the strength of what her husband had said, and she hung her head and shrugged her shoulders. She invited witness to stay to tea, but she did not accept the invitation. (Laughter.) After the trial witness received an anonymous letter card, which ran: \"Find out why she left Hounslow, and appeal against the decision of the Court.\" John Joseph L. Criddleland, the defendant, was then called, and related how he saw the plaintiff, who was standing at her window smoking, beckon him. Thinking she wanted to order some beer—(laughter)—he went to the house. In about a minute she dressed and came out, her sister egging her on. It was in Beckenham-lane that he committed himself. He had given her presents. The Bench ordered the defendant to pay 5s. a week until the child is fourteen, and 22 19s. costs.\n\nHEAVY SENTENCE FOR WIFE BEATING.\n\nAt the Marylebone Police-court, on Wednesday, William Shortling, labourer, of Short-street, Lisson-grove, was charged before Mr. Plowden with assaulting his wife. The prisoner returned home in the early hours of the morning, and without any apparent reason commenced striking his wife, who was asleep in bed, about the head and face, giving her two black eyes and severely bruising her face. She jumped out of bed, ran into the street, and called in Police-constable 238 D, in front of whom he again struck her a violent blow in the face, almost killing her. He threatened to murder his wife, and said he would do six months for her. The woman informed the magistrate that she had been married fifteen years, and her husband had frequently assaulted her. Mr. Plowden sentenced him to six months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812698.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 1079, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4337, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]