[{"id": "adc47caeea2d963af10c659e090a2cb5299e1067", "text": "FRANCE.\n\nParis, Saturday.\n\nThe authorities have prohibited the sale in the public streets of XLIX Siècle, for an article insulting M. Buffet and the Assembly.\n\nParis, Thursday Evening.\n\nPelata and Bonnard, who have been found guilty of the assassination of the sergent de ville Vincenzi, on the Place de la Bastille in 1870, have been condemned to death.\n\nThe Municipal Council of Paris has voted a bill in favour of opening a carriage road through the garden of the Tuileries.\n\nVersailles, Thursday Evening.\n\nSeveral members of the Left Centre have been invited to dinner for the first time by Marshal MacMahon, and have accepted his invitation. Among the guests are MM. Casimir Perier, Leon Say, Teisserenc de Bort, and Berenger, ministers under the Administration of M. Thiers. Several other deputies have decided to attend the soirée to be given subsequently at the Presidency.\n\nA very warm debate occurred in the French Assembly today on the proposal of M. Pouyer-Quertier in favour of levying an excise duty at the sugar refineries from the 1st of April. The Minister of Public Works, on behalf of the Government, asked the Assembly to adopt the amendment of M. Paris, postponing the establishment of this system until the expiration of the Convention of 1864. After a good deal of discussion M. Pouyer-Quertier announced that, considering the Government's adhesion to the principle of excise he would consent to substitute the 1st of July, 1875, the date which coincides with the expiry of the Convention. M. Magne said the Government accepted this. M. Buffet stated, however, that the rules required the Assembly to vote upon the original amendment of M. Pouyer-Quertier, modified by him so as to provide that the refineries should be subjected to the excise system from the 1st of May, 1874. The Assembly rejected this amendment by 368 votes against 297—majority in favour of the Government, 71.\n\nVersailles, Friday Evening.\n\nAt today's sitting of the National Assembly, the debate on the new taxes was resumed. All the amendments were referred to the Budget Committee, the Assembly consequently reserving its final decision. The proposals to the pianos and photographs were rejected, and the House proceeded to discuss the tax upon glass.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206320497.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 540, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2248, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]