[{"id": "700f99114be4108d9aa5feaee4e9c3aea8652c97", "text": "AN OUTRAGEOUS CASE.\n\nRigg v. Lovering, and Others.—This was an action for breaking and entering the plaintiff's shop and carrying away his goods, tried in the Court of Exchequer on Thursday.—The plaintiff carried on the business of a draper in Chapel-street, Somers-town, and the defendants were Messrs. Lovering and Minton, accountants, Gresham-street, and two other persons, named Quinn and Lambert. In October last, while the plaintiff was absent, his premises were entered and the whole of his goods carried away in two or three vans. He ascertained that the illegal act had been committed at the instance of Messrs. Lovering and Minton, who had been employed by Messrs. Ponsford and Southall, woollen merchants, in Cannon-street, to try and get 30l. which the plaintiff owed them. The circumstances appeared to be these. Rowe, a servant of Ponsford and Southall, consulted Lovering as to the means of procuring the money, and the result was that Rowe, and Quinn and Lambert, two employés of the accountants, went to the plaintiff's shop, and not finding him there, and not being able to get payment, swept away the property in the manner described. They were first traced to the accountants' offices, and next to an auctioneer's warehouse in Little Britain, where they still remained. The plaintiff had been proceeded against in bankruptcy by some of his creditors, but the adjudication had been set aside with costs.—Mr. Digby Seymours offered on the parts of the defendants to return the goods and give some compensation to plaintiff for what he admitted was an illegal proceeding.—Mr. Serjeant O'Brien agreed to accept the goods, but required substantial damages. The parties, however, were unable to agree on the amount, and the trial proceeded.—The defence was that Lovering merely told Quinn and Lambert to try and get the money or the goods, and did not request them to take away the property by force in the event of not obtaining the money, and that in doing so they acted contrary to his instructions. To show that this was the fact evidence was given that on the goods being brought to his office he refused to take them in, although he had plenty of room for the purpose, and directed that they should be taken elsewhere. On the one side it was said the goods were worth from 500l. to 700l.; on the other only worth 150l. or 180l.—Mr. Baron Bramwell, in summing up, said that he never heard such an outrageous case in the whole course of his life, and he could scarcely conceive that such a thing could occur in this commercial community. There was no evidence against Minton, and a verdict would be given in his favour; but there must be a verdict against Quinn and Lambert. As to Lovering, they would have to say whether he was responsible for the act in question. It certainly seemed inconceivable that a sensible man of business should order Quinn and Lambert to remove the goods by force if they could not get the money. With respect to the damages, he said they should give damages for the outrage that had been committed as well as for the value of the goods.—The jury retired to consider their verdict. After a brief absence they gave a verdict against Lovering, Quinn, and Lambert—Damages, 506l.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206234065.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 752, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3221, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]