[{"id": "5c4a16db9314d3e02d39816aebe11fa42d89c37f", "text": "A PUTNEY MYSTERY.\n\nMr. Hicks, coroner, held an inquiry at Putney into the circumstances attending the death of Frederick Robbins, aged forty-eight years, an artist, lately residing at Richmond-road, Putney, whose mutilated remains were found on the South-Western Railway at Putney Station on Sunday. Edwin Nixey, a brewer, of Brunswick House, Hartlepool, identified the deceased as his brother-in-law, whom he last saw alive three weeks ago, when he was in excellent health. He was a married man, and to witness's knowledge he was not in monetary troubles.—William Warren, a chemist, of Richmond-road, stated that the deceased resided with him. He suffered greatly from deafness, was rather short-sighted, and wore spectacles. In consequence of the wet weather the deceased remained at home on Sunday, but at seven o'clock went out, saying he was going for a stroll. As he did not return at eleven o'clock inquiries were made, and it was found that the deceased had been discovered on the line. He was in no monetary difficulties, and a most unlikely man to commit suicide. James William Burrowes, porter at Putney Station, stated that after the five minutes past ten p.m. milk train had left the station, he observed the deceased lying in the four-foot-way. His hat and umbrella were lying close by. A doctor pronounced life extinct. William Lawrence, guard of the up Kingstone train, said he examined the carriages, and found all the doors were properly closed on both sides. By the Jury: He noticed a slight jerk of the train, but thought it was only caused by an umbrella or stick on the line. Dr. William J. Sheppard said the deceased, on examination of the body, revealed that both shoulders were crushed, the arms nearly amputated, and the chest crushed in. Death was instantaneous. The jury returned an open verdict.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810876.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 430, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1824, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]