[{"id": "51761fa4909ee1fddbbcd3d810d31738dab09fdb", "text": "STREET RUFFIANISM.\n\nAt Bow-street Police-court, on Monday, before Mr. Lushington, George Murray and Charles Greenwood, rough-looking young fellows, were charged with disorderly conduct. Police-constable 235 E was in White Horse-yard on Sunday afternoon, when the prisoners came along with a disorderly mob. Murray caught hold of him, and said to the others, \"Let's up-end him.\" His companions closed round and turned him on his head. Whilst on the ground Murray struck him. Police-sergeant 35 came to his assistance, and was kicked by Greenwood. Mr. Lushington sentenced Murray to one month, and Greenwood to two months' imprisonment.\n\nAt the same court Alfred Newson and Patrick Toole were charged with assault. Charles W. Holton stated that he was passing over Hungerford Bridge at half-past eleven on Saturday night. The accused were walking in front of him, and on his trying to get past them would not let him do so, but jostled him and \"prodded\" him with a stick. He expostulated, and they then \"set about\" him. Newson struck him with a stick on the nose and got hold of his legs, and Toole punched him on the mouth and nose. Police-constable 85 E, who came to his assistance, managed to secure the prisoners with the aid of another constable. Toole only being got to the station with considerable difficulty. The officer mentioned that there had been previous complaints respecting the prisoners. Mr. Lushington sent them to prison for six weeks.\n\nAt the Southwark Police-court, on Monday morning, a blacksmith, named James Henry Hall, who lives in a court off the Borough, was charged with being drunk and disorderly, and further with assaulting Police-constable 166 M. The first witness was Police-constable 564 M, whose somewhat peculiar manner of giving evidence created some amusement. He said: Saturday night, quarter to seven, went down Kent-street. Heard cries of \"Murder and Police.\" Saw prisoner. He was drunk. Using bad language. His wife said assault had been committed. Had black eyes. His Worship? Who? Constable: The wife. His Worship: Oh! (Laughter) Constable (continuing): Asked to go indoors. Refused. Took into custody. Mr. Fenwick: Who? the wife? Constable: No; the prisoner, sir. Violence. Broke away from Police-constable Longman, who was assisting me. The police-constable's finger was twisted, and it broke. Great difficulty in getting prisoner to station. Prisoner: Now, this is all through an intoxicated wife. When I goes home on Saturday, I finds my door locked, and my old woman wouldn't open it. So I goes for this policeman. My wife opens the door then, and this policeman goes inside with her while I'm outside. Presently the policeman comes out, and then takes me down to the station. Police-constable Longman deposed to prisoner acting so violently on the way to the station as to break his finger. Mr. Fenwick fined the prisoner £3, or twenty-one days' imprisonment in default.\n\nAt the Lambeth Police-court, on Monday, William Joseph Cox, nineteen, painter; Henry Arthur Berry, twenty, carman; and James Jenkins, twenty-four, labourer, were charged with disorderly conduct, fighting, and using bad language. Berry was further charged with assaulting John Bennett. Police-constable Kennedy, 40 L, said he was in Walworth-road on Sunday night and saw the three prisoners fighting together. He caught hold of Cox just as he was about to strike a man with a life-preserver. In answer to the charge the prisoner Jenkins said he was walking down the Walworth-road, when the two other prisoners attacked him and knocked him down. A man named John Bennett corroborated this story, and said he was assaulted by Berry. Mr. Hopkins remarked that Walworth-road was not fit to walk along on a Sunday night. He sentenced Cox and Berry to twenty-one days' hard labour each, but discharged Jenkins.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812186.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 903, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3824, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]