[{"id": "22120b01b0bd92924dcbf520ed3c66605faa07dd", "text": "At the West Ham Police-court, on Saturday, George White, nineteen, coal trimmer, of 13, Hooper's-road, Canning Town, and Annie Hurley, twenty-six, described as a prostitute, of 47, Martindale-road, Custom-house, were charged on remand, with violently assaulting John Kent, a seaman, at 73, Martindale-road, on March 16th. Mr. Sharman prosecuted; Mr. Willis defended. When the case was previously before the court a man named Partridge, a coal-trimmer, was charged with being concerned in the assault, but he was discharged. Partridge was now called as a witness, and in the course of a long deposition, he spoke of what took place inside the house before the police arrived. At half-past eleven o'clock witness was in the front parlour of the house when he heard two persons come in and go upstairs. Soon afterwards there was a struggle upstairs, and Partridge heard Hurley call out, \"Come up, Tommy, this man is murdering me.\" Witness went upstairs, and saw Kent and Hurley, the prisoner, White, and some others. Hurley and Kent were fighting, and a policeman came but he soon afterwards left. Witness soon afterwards heard another struggle, and on going upstairs he saw Hurley and Kent fighting. Hurley was thrown through the bannisters, and witness caught her, but she struck her head. He tried to get her into the front room, but the people there would not let her in. She struggled, and, getting away, she rushed upstairs. Kent, meanwhile, had pulled away all the bannisters, and thrown them down. Hearing cries, Partridge went up, and saw White throw two bricks at Kent, who was then in the yard, he having gone through the window. A constable came, and when Kent was discovered he was lying nearly senseless in the yard, four or five bricks being close to him. The prisoner Hurley was on the floor of the back-room, and she said, when Police-constable Willett entered, that Kent had jumped on her stomach and then \"Gone through the window.\" All the parties were taken to the station, but no charges were preferred by anyone. Francis Croucher, the house-surgeon at the Seamen's Hospital in the Victoria Docks, said that Kent went to that institution on the morning of March 17th. He complained of a scalp wound, and on being examined he was found to have sustained a fracture of the skull, which was compound and depressed. He was so bad that he had to be trephined. He was still an inmate of the hospital, and was unable to attend the court. His speech was impaired, and he had paralysis of the right arm and the right leg. In witness's opinion it was very doubtful if Kent would recover. If he did, it would only be after a very long time. His injury had been caused by some heavy sharp-pointed instrument, very likely a brick. Remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810270.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 665, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2745, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]