[{"id": "64bd57c4e646c268e0fc0297881e74a45609f12e", "text": "THE POLICE AND THE PUBLIC.\n\nAt the West London Police-court on Monday, a middle-aged woman, who had a bandage over the right eye, was among the applicants, and she complained of the violence of a constable of the X Division. She stated that on Saturday night she fetched half a pint of beer for her supper, and while talking to a female the constable pushed her off the kerb into the road, injuring her eye. The applicant attempted to remove the bandage, but was stopped by the magistrate, who said he did not wish to see her eye, and requested her to cover it over. He wanted to know how her eye was injured. Applicant: I was insensible when picked up. Mr. Plowden: Were you sober? Applicant: Yes. The constable, who was in court, volunteered a statement. He said he was on duty in St. Ann's-road, when he was called to eject a man from the Kenilworth Castle. In the struggle outside the woman was accidentally knocked down. In answer to the magistrate, the constable said the applicant was the worse for drink. She was standing on the kerb, and missed her footing. The applicant was recalled and asked by the magistrate if she suggested that the constable pushed her off the kerb. The Applicant: I don't know what else he did. She also told the magistrate that she had witnesses. Mr. Plowden: Take a summons.\n\nEXEMPLARY SENTENCE FOR CRUELTY.—At Farnham Petty Sessions, William Newman, carter, of Hungry-hill, was summoned by the Royal Society for the Prevention of Cruelty to Animals for working a horse while the animal was in an unfit state, owing to severe and painful lameness; and William Newman, contractor, also of Hungry-hill, and father of the other defendant, was summoned for causing the horse to be worked. The Bench considered the case a bad one, and fined the young defendant £2 6s., including costs, and sent the other defendant to prison for two months with hard labour; without the option of paying a fine, but with costs.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810898.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 472, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1941, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]