[{"id": "734ed3b241d9a3a8591a1751a446a552ea4dd099", "text": "ATTEMPTED MURDER IN OXFORD-STREET.\n\nRuth Elsden, an unfortunate woman, was charged at Marlborough-street police-court, with attempting to murder Thomas Foskett, potman, at the Duke of York, in Union-street, Oxford-street. There is little doubt the prisoner was actuated to commit the act from a feeling of revenge, she having, in October last, been charged at this court with two soldiers for an assault on Foskett, when she was committed for seven days in default of paying a fine, and, from the threat she made use of, there is reason to believe that she intended to take Foskett's life.\n\nJoseph Reed, 60 D, said he was called to the Duke of York, and saw the prisoner there, and the man Foskett was sitting on a form bleeding from the head copiously. The prisoner said, \"Look here, fatty (the constable is a stout man); so help me God, I did it, and intended to do so.\" I then asked where the knife was, and the landlord said he had put it away, but afterwards gave it to him. The knife (a large clasp one) produced is the same. It had blood on it at the time. The prisoner had been drinking, but she well knew what she was about. He then took Foskett to the Middlesex hospital. He went to the hospital that morning and received the certificate produced. A certificate as follows was here handed to Mr. Tyrwhitt:\n\n\"Middlesex hospital, Jan. 27.—I hereby certify that Thomas Foskett is a patient in this institution, suffering from a punctured wound of the ear, and is not in a fit state to be removed.—W. N. MARSHALL, house-surgeon.\"\n\nMr. Atherfold, landlord of the Duke of York, Union-street, Oxford-street, said he had known the prisoner for some time past as a desperate character, and he had frequently forbidden her to come to his house. On Saturday night last she came in, and, as she annoyed some of the customers, he told her that if she did not keep quiet he would turn her out. She then said, \"If you do, it will be a——bad job for you, for I have got something in this pocket.\" The prisoner then said she wanted to speak to him privately, but he told her that he would not. The prisoner then went into the tap-room, where Foskett, his potman, was about his work, and in about two minutes Foskett came out bleeding, stabbed through the ear. The prisoner then put the knife on the counter, and he took it up, and when the constable asked for it he gave it to him. The prisoner then said she meant to do it, and hoped she had \"killed the——.\" She also said, \"I meant this for you, and will do it when I come out.\" The prisoner had threatened his daughters on a previous occasion.\n\nMr. Tyrwhitt remanded the prisoner to see the result of the wound, which, he trusted, would not prove fatal.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206213295.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 697, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2697, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]