[{"id": "ab9de197fddc3fffccee97932ce31683c7c3d4ca", "text": "XI. Observations on the total (with Duration) and annular Eclipse of the Sun, taken on the 24th of June, 1778, on Board the Espagne, being the Admiral's Ship of the Fleet of New Spain, in the Passage from the Azores towards Cape St. Vincent's. By Don Antonio Ulloa, F. R. S. Commander of the said Squadron; communicated by Samuel Horsley, LL.D. F. R. S.\n\nRead December 24, 1778.\n\nThe public prints will have given notice of my arrival at this port, with the fleet under my command, on the 29th of June last. A very favourable, though\n\nObservations de l'Eclipse du Soleil totale avec Retension et Annulaire faites le 24e Juin 1778; sur le Vaissel l'Espagne Commandant l'Escadre de la Flotte de la Nouvelle Espagne, en faisant le trajet des Iles Terceres vers le Cap St. Vincent. Par Don Antonio de Ulloa chef d'Escadre et Commandant General de la ditte Floite, Membre de la Société Royale de Londres.\n\nOn aura appris par les nouvelles publiques, que je suis rentré dans ce port le 29e du mois passé avec la flotte de la Nouvelle Espagne sous mon commandement. Le trajet dans mon retour, qui a été long mais très heureux, m'a été favorable\nthough long, passage gave me the opportunity of observing at sea the eclipse of the Sun, which was accompanied by a phenomenon observed by few astronomers, and which I myself saw for the first time; to wit, the luminous Annulus which surrounds the disk of the Moon: the following is a description of this appearance, one of the most beautiful that can be conceived.\n\nThe motion of the ship prevented our observing the beginning of the eclipse, by reason of the difficulty there was in keeping the Solar image and a part of that of the Moon within the field of the telescope; the object vanished every instant, and it was not till after several fruitless trials that I could get it again. Besides this, the arms grew tired of holding up the telescope and smoked glass, which could not be rested upon anything from the necessity there was of moving the telescope in a contrary\n\nrable pour observer en mer l'Eclipse du soleil accompagnée d'un phénomène très particulier que j'ai vu, pour la première fois et que peu d'astronomes, ont observé, jusqu'à présent : c'est l'anneau lumineux autour du disque de la lune, phénomène des plus frappants et des plus beau à la vue ; en voici la description :\n\nLe mouvement du vaisseau ne permit pas d'observer le commencement de l'eclipse, par la difficulté de conserver le corps solaire et une partie de celui de la Lune dans le champ de la Lunette ; l'objet m'échappait à tout moment, et je ne le rattrapais qu'après bien des recherches. Outre cela, les bras se fatiguaient à soutenir en l'air la lunette et le verre obscur, qu'on ne pouvait apuyer, parce qu'il fallait\ntrary direction to that of the ship. I had no other calculations but those to be met with in the Connoissance des Tems, which I did not find very exact, owing either to some error in the calculations themselves, or to the longitude of the ship's place not having been accurately determined in that book: I found a pretty sensible difference in the hour set down for the beginning of the eclipse. I observed the total obscurity of the Sun's disk at 44 minutes past three, the beginning of the emersion at 48 minutes after three, the end of the eclipse at 48 minutes after four; consequently, the middle of it must have been at 46 minutes after three, or thereabouts: the total obscurity lasted four minutes, a sufficient time for observing the ring which was formed round the Moon.\n\nFive\n\nfalloit faire avec la Lunette un mouvement contraire à celui du vaisseau. Je n'avois d'autres calculs que celui de la Connoissance des Tems que je ne trouvois pas de la dernière précision, soit qu'il se trouve quelque erreur dans le calcul, soit que la longitude estimée du lieu ou le vaisseau fetrouvoit ne fusse pas la véritable. Je trouvois une difference assez sensible sur l'heure indiquée pour son commencement; J'observai la totale obscurité du disque du Soleil à 3 heures 44 min., le commencement de l'emersion à 3 h. 48 m. la fin de l'eclipse à 4 h. 48 m. par conséquent le milieu devoit être à 3 h. 46 m. ou environ. La durée de l'eclipse totale du Soleil fut de 4 minutes, intervale suffisant pour observer l'anneau qui se forma autour de la Lune.\nFive or six seconds after the immersion we began to observe round the Moon a very brilliant circle of light, which seemed to have a rapid circular motion something similar to that of a rocket turning about its center. This light became livelier and more dazzling in proportion as the center of the Moon approached to that of the Sun; and about the middle of the eclipse it was of the breadth of about a sixth of the Moon’s diameter. Out of this luminous circle there issued forth rays of light, which reached to the distance of a diameter of the Moon, sometimes more, sometimes less, which made me think that they were parts of a weaker light which were reflected in an atmosphere more subtle than that in which the ring was formed. When the centers of the two planets began to separate, the diminution began, and took\n\n5 ou 6 secondes après que l’immersion eut été faite on commença à découvrir autour de la Lune un cercle de lumière très brillant qui semblait avoir un mouvement rapide circulaire, semblable à celui d’un artifice embrasé mis en jeu sur son centre. Cette lumière devint plus vive et plus éblouissante à mesure que le centre de la Lune aprochait de celui du Soleil ; et dans le temps que l’eclipse fut à son milieu elle était large de deux doigts du diamètre de la Lune, ou comme la sixième partie du dit diamètre. De ce cercle lumineux partaient des rayons de lumière de toute sa circonférence, perceptibles jusqu’à la distance d’un diamètre de la Lune ; tantôt plus, tantôt moins, ce qui me fit penser que c’étoit des parties de lumière plus foibles qui s’imprimoient dans un atmosphère plus subtil que celui ou étoit formé l’anneau. Lorsque les centres des deux planètes commencèrent à s’écartier, la diminution commença et se fit graduellement dans le même\ntook place gradually in the same order which had been observed at its beginning and during the progress of it. It disappeared entirely four or five seconds before the emersion. The colour of the light was not the same everywhere; the part immediately joining the disk of the Moon was of a reddish cast, from thence it changed towards a pale yellow, which about the middle began to clear till, at the external extremity, it ended in an almost entire white. It was equally brilliant throughout, and the whirling motion, common to all the parts of it, seemed to change the form and position of the rays which appeared to the eye sometimes larger, sometimes shorter, at the same time that there was no change either in the colours of the ring themselves, or in the arrangement of them, both which continued as I have described them.\n\nFor\nFor four or five seconds before the appearance of the shining ring, and during as many after it had disappeared, one could see the stars of the first and second magnitude as at the entrance of the night; but when it was in its greatest degree of brilliancy, only those of the first magnitude could be discovered. The darkness was such, that persons who were asleep, and happened to wake, thought that they had slept the whole evening, and only waked when the night was pretty far advanced. The fowls, birds, and other animals on board took their usual position for sleeping as if it had been night.\n\nBefore the edge of the Sun’s disk emerged from that of the Moon, there was discovered near that of the latter a very small point of that of the Sun; it was imperceptible to the naked eye, but having looked at it with\n\nQuatre ou cinq secondes avant de voir paroitre l’anneau brillant, et autant après sa suppression l’on vit, comme à l’entrée de la nuit, les étoiles de la 1ère et de la 2de grandeur; mais lors qu’il étoit dans son brillant on ne voyoit que celles de la 1ère. L’obscurité fut au point que des personnes qui dormoient et qui f’eveillèrent crurent à leur grand étonnement d’avoir dormi toute la foirée et de ne f’être éveillées qu’assez avant dans la nuit. Les poules, les oiseaux et les autres animaux prirent leur position ordinaire pour dormir comme si c’eut été la nuit.\n\nAvant que le bord du disque du Soleil parut par celui de la Lune, on découvrit près de celleci un tres petit point de celui du Soleil imperceptible à la vue; mais l’ayant distingué par le secours de la lunette, je l’estimai d’abord de la grandeur\nwith the glass I estimated it at first to be about the magnitude of a star of the fourth order; after which it seemed to increase to that of one of the third. Its first appearance, to wit, that before the edge of the Sun emerged from that of the Moon, lasted about a minute and a quarter, the luminous circle was still visible though already much weaker than it had been.\n\nThe reddish colour of the ring towards the Lunar disk, its deep yellow towards the middle, its clear and very pale yellow at the external extremity, its uniform circumference, and the rays issuing from it to the distance taken notice of above, convince me that the whole is the effect of the Lunar atmosphere, which is of a substance different from that of the earth, that is, more transparent, more homogeneous, more uniform, and fit-\n\ngrandeur d'une étoile de la 4ᵉ classe; et ensuite il me parut augmenter jusqu'à la grandeur de celles de la 3ᵉ. Sa première apparition, c'est à dire avant que le bord du Soleil parut par celui de la Lune, fut de la durée d'environ une minute et un quart : le cercle lumineux subsistait encore quoique déjà affaibli.\n\nLa couleur rougeâtre de l'anneau proche du disque de la Lune, jaunâtre comme couleur d'or vers le milieu, jaune clair et très affaibli vers sa partie extérieure; sa circonférence égale, et les rayons qui partent de cet anneau à la distance ditte ci dessus persuadent que le tout est l'effet de l'atmosphère de la Lune, laquelle est de matière différente de celle de la terre; plus transparente, plus nette, plus égale et plus propre à réfléchir les rayons de lumière que celle ci; autrement, l'anneau n'aurait pas été également clair, brillant et coloré dans la circonférence entière du disque de la lune. On ne peut pas dire que cet anneau lumineux soit l'effet\nter for reflecting the rays of light, since otherwise the ring would not have been equally clear, shining, and coloured throughout the whole circumference of the Lunar disk. It cannot be said, that this luminous ring is the effect of the rays of the Sun reflected by the atmosphere of the earth, because the apparent diameter of the Sun is smaller than that of the Moon, whose disk entirely hid that of the Sun. Besides, if the luminous circle had been made by the atmosphere of the earth, its colours would have been like those of the rainbow, and it would have appeared fixed without motion, instead of which, that which was seen is the same as that which is seen by the naked eye upon the Sun when it is just above the horizon a little after Sun-rise or before Sun-set, so that one may conclude, that this luminous circle is a part of the disk of the Sun seen after refraction through the atmosphere of the Moon.\n\nThe\n\nl'effet des rayons du Soleil réfléchis sur l'atmosphère de la Terre, puisque le diamètre apparent du Soleil est plus petit que celui de la Lune, dont le disque cachait entièrement à nos regards ou à ceux du globe terrestre celui du Soleil. D'ailleurs, si c'était sur l'atmosphère de la Terre que le cercle lumineux fut formé, ce cercle aurait été semblable dans ses couleurs à l'arc-en-ciel, et il aurait paru fixe sans mouvement ; au lieu que celui qui a été aperçu est le même qu'on distingue dans le Soleil en le regardant directement avec la simple vue sur l'horizon peu après son lever ou un peu avant son coucher : en sorte qu'on peut conclure que ce cercle lumineux est une partie du disque du Soleil vu par refraction sur l'atmosphère de la Lune.\nThe point of the Sun's disk, which was seen before its limb began to emerge from that of the Moon, is a very extraordinary phenomenon which I was not acquainted with before. In order to obviate all doubts which might arise about it, I must mention that we were three observers, Don Joachin D'Aranda, Lieutenant Wintuysen, and I. Mr. D'Aranda, who was looking at the eclipse through a two-foot telescope about the end of the total obscurity, was the first who perceived it. He, not knowing what it was, told me, that the total obscurity drew near an end, because he discovered a small point of the Sun, like a star, on the edge of the Moon. I looked immediately with the naked eye, and saw nothing. I then took out a spy glass, with which I saw as much. At length I took out my telescope of two feet and a half, and did discover with that a red luminous point so near\n\nLe point du disque du Soleil, vu avant que son limbe eusse commencé à paraître par celui de la Lune, est un phénomène très particulier et dont je n'avais pas connaissance. Pour prévenir les doutes qui peuvent se lever je dois dire que nous étions trois personnes à observer l'éclipse : M. M. Don Joachin de Aranda Cap. de frégate de l'armée, et pilote major de la flotte ; Don P. Wintuisen lieutenant de vaisseau et major de la ditte flotte, et moi. Mr. D'Aranda, en regardant l'éclipse vers la fin de la totale obscurité avec sa lunette de deux pieds, fut celui qui l'aperçut le premier : Il me dit, ne sachant ce que c'était, que la totale obscurité était près de finir, parce qu'il voyait un petit point du Soleil sur le bord de la Lune semblable à une étoile. Je regardai d'abord avec la vue,\nthe edge of the Moon, that it left me no doubts of its belonging to the body of the Sun. I, at that time, estimated it to be about the size of a star of the third magnitude; and imagine, that when Mr. D'ARANDA discovered it, it must have been like one of the fourth. This point gradually increased, and when it became of the bigness of a star of the second magnitude, the edge of the Sun emerged from that of the Moon. The interval between the first discovery of this point and the beginning of the emersion was about a minute and a quarter. This apparition of the Sun, before the beginning of the emersion, can only have taken place through some crevice or inequality on the limb of the Moon, not perceivable at the full Moon, by reason of the reflected rays which cross each other, and confuse it; whereas at the time of the eclipse,\n\net je n'aperçu rien : Je tirai une lorgnette de la poche et je n'en vis pas d'avantage; enfin je pris ma Lunette de 2½ pieds avec laquelle je découvris effectivement un point rouge et lumineux très proche du bord de la Lune qui ne me laissa aucun doute que ce ne fut le corps du Soleil. Je l'estimai pour lors comme une étoile de la 3ᵉ grandeur, et je présume que lors que M. D'ARANDA la découvrit, elle pouvoit paraître comme une étoile de la 4ᵉ grandeur. Ce point grandit successivement; et lorsqu'il pouvoit être jugé comme une étoile de la 2ᵉ grandeur le bord du Soleil parut par celui de la Lune. L'intervale qu'il y eut entre la 1ère vision de ce point et le commencement de l'emersion fut d'une minute et un quart. Cette apparition du Soleil avant le commencement de l'emersion ne peut avoir eu lieu qu'à travers de quelque fente ou inégalité qui se trouve sur le limbe de la Lune, et qui est imperceptible lors du plein lune à cause des rayons réfléchis qui se croisent et confondent la ditte ouverture; au lieu que dans le temps\neclipse, the Moon's body being entirely obscured, the light of the Sun is behind, and comes through the smallest openings in the disk without any confusion.\n\nThe time elapsed between the first appearance of the Sun's body through the aperture of the limb of the Moon and the appearance of the limb of the Sun out of that of the Moon will serve to determine the depth of the said chink, aperture, or inequality, which is equal to the height of the eminencies which form it.\n\nThe luminous point was towards the North-west part of the Moon's disk, a little more to the North than the part of its limb through which that of the Sun appeared at the beginning of the emersion; and it is remarkable, that no other luminous speck was perceived in the disk besides this. This aperture is therefore the only one in that part of the disk through which the emersion was\n\ntemps de l'eclipse le corps de la Lune se trouvant entièrement obscurci, la lumière du Soleil se trouve par derrière et percé sans confusion par les plus petites ouvertures du disque de cet astre.\n\nLe temps qui s'est écoulé depuis la première apparition du corps du Soleil par l'ouverture du limbe de la Lune jusqu'à l'apparition du limbe du Soleil par celui de la Lune servira à déterminer la profondeur de la ditte fente, ouverture, ou inégalité qui est égale à la hauteur des éminences qui la forment.\n\nLe dit point lumineux étoit à la partie du Nord-Ouest du disque de la Lune, un peu plus au nord de l'endroit de son limbe par où se fit voir celui du Soleil au commencement de l'emersion; et il est à remarquer qu'on n'aperçut pas d'autre, point lumineux dans le disque de la Lune que celui là : ainsi cette ouverture est unique\nto begin; from whence one may be certain, that throughout the fourth part of the Moon's circumference, reaching from North to West, there is not any perceptible breaks in its limb besides that which was then observed. There can be no doubt but that the luminous speck which appeared through the aperture was part of the Sun's body; this is demonstrated, by the red fiery colour (the same as that which is seen when this luminary is looked at through a smoked glass) by its gradual increase, in proportion as the limb of the Sun came near that of the Moon, and in short by the colour, which at its emerging was just the same as that which had been seen through the opening.\n\nIt remains to be mentioned, that on the 24th day of July, the day on which I made the above observation,\n\nunique dans la partie du disque par où devait commencer l'émergence, et on peut assurer que dans la quatrième partie de la circonférence de la Lune, il n'y a pas dans son Limbe, depuis le Nord jusqu'à l'ouest d'autres fentes perceptibles que celle qui fut observée. Il n'y a point de doute que le point lumineux qui parut à travers l'ouverture ne fut le corps du Soleil; Cela est démontré par la couleur de feu très rouge, la même qui se voit quand on regarde cet Astre à travers d'un verre obscurci, par la gradation qui eut lieu dans son accroissement à mesure que le Limbe du Soleil aprochoit de celui de la Lune, et enfin, par la couleur du Soleil, qui lors qu'il deborda fut la même que celle qui s'étoit vue à travers de l'ouverture.\n\nIl me reste à dire que le 24e Juin, jour que je fis cette observation à bord du Vaisseau\nvation on board the Espagne, the aforesaid ship's latitude was $37^\\circ 14''$ North, measured the same day; that since noon it had sailed direct East; that from the end of the eclipse to its being in the meridian of Cape St. Vincent it had sailed 301 sea miles East, making 100 sea leagues, reckoning 20 leagues to a degree, remains to be known the difference of meridians of the said Cape and the meridian of the different observatories of the capital cities of Europe, in order to determine the part of the sea in which the observation was made relatively to the observatories.\n\nThe solar spots were seen very distinctly both before and after the eclipse; there were six of them in all: two very near each other on the Eastern part of the disk; two towards the middle of the disk, likewise very near one another;\n\nVaisséau l'Espagne commandant l'escadre de la flotte de Vera Cruz, ce V$^{1\\text{er}}$ était par 37 degrés 14 minutes de Latitude Septentrionale, observée le même jour; que depuis le Midy il avait fait route à l'est directement; que depuis la fin de l'Eclipse jusqu'à être nord sud avec le Cap St. Vincent il a navigué à l'est 301 milles maritimes qui font 100 $\\frac{1}{2}$ lieues maritimes de 20 au degré; reste à savoir la différence de Méridien entre le dit Cap et les différent Observatoires des villes capitales de l'Europe, pour determiner l'endroit à la mer ou l'observation fut faite relativement aux dits Observatoires.\n\nLes taches du Soleil furent vues tres distinctement avant et après l'Eclipse; elles étoient au nombre de six: deux à la partie de l'est du disque peu distantes l'une de l'autre: deux vers le milieu du disque aussi assez près l'une de l'autre:\nanother; and two towards the North, verging towards the North-west.\n\nThe corrected altitude of the center of the Sun above the horizon, taken at the moment the eclipse ended, was $36^\\circ 31''$. The atmosphere was very clear; the wind WNW, and not very strong. No clouds were visible, as is often the case at the sea, nor were there any till near six, when there arose some just above the horizon.\n\nThe luminous ring made so strong an impression on me, as well from the beauty and brightness of its colour as from its rapid and uniform circular motion that I could neither reckon the stars visible in each interval from the total obscurity to the end of the eclipse, nor make several other observations on the colour and vivacity of their light.\n\net deux enfin vers la partie du Nord un peu vers Nordouest.\n\nLa hauteur corrigée du centre du Soleil sur l'horizon, prise au moment que l'Eclipse finit étoit 36 degrés 31 m. L'atmosphère étoit très net et l'air de l'Ouest Nord-Ouest de moyenne force; on ne voyoit aucun nuage comme cela arrive souvent en mer; ce ne fut que vers les six heures qu'il s'en forma quelques uns sur l'horizon.\n\nL'anneau lumineux me fit une impression si agréable tant par la beauté et l'éclat de sa couleur que par son mouvement circulaire uniforme et rapide que je ne pus ni compter les étoiles visibles dans chaque intervale depuis la totale obscurité jusqu'à la fin, ni faire d'autres observations sur la couleur et la vivacité de leur lumière: Je m'attachai uniquement à l'anneau et ensuite au point lumineux\nlight. All I attended to was, first, the ring, and then the luminous speck which appeared through the disk of the Sun. These made the same impression on all who observed with me.\n\nIt is not easy to make celestial observations at sea with the same precision and delicacy as they are made at land, on account of the motion of the ship, and want of convenience to use the instruments. It would have been difficult (even if we had had a Micrometer) to have measured either the breadth of the ring, in order to see if it was equal everywhere, or the distance between the luminous speck seen on the disk of the Moon and its limb. I regret, however, exceedingly not having been able to make observations which would have been of such use in astronomy.\n\nneux du Soleil au travers du disque de la Lune. Ce ravissement produisit le même effet sur ceux qui observaient avec moi.\n\nIl n’est pas facile de faire en mer des Observations Célestes avec autant de précision et de délicatesse qu’on les fait à terre, à cause du mouvement du vaisseau et de la gêne à se servir des instruments. Il aurait été difficile, quand même on aurait été pourvu d’un Micromètre, de mesurer la largeur de l’anneau pour examiner s’il était égal partout, comme aussi la distance du point lumineux vu sur le disque de la Lune jusqu’à son limbe. J’ai bien du regret de n’avoir pu faire ces observations qui auraient été d’un grand avantage pour la Physique des astres.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/106411.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 25272, "total-output-tokens": 6409, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1138, 2], [1138, 2745, 3], [2745, 4292, 4], [4292, 6070, 5], [6070, 6904, 6], [6904, 8541, 7], [8541, 10331, 8], [10331, 12008, 9], [12008, 13673, 10], [13673, 15548, 11], [15548, 17241, 12], [17241, 18851, 13], [18851, 20542, 14], [20542, 22082, 15], [22082, 23514, 16]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]