[{"id": "e63be06172152810048fe62813fe64cbbb9436ef", "text": "OLD BAILEY TRIALS, YESTERDAY.\n\nATTEMPTING TO DEPRAUD NOBLEMEN.—Charles Howard, 50, a well-dressed man, who was stated not to have any occupation, was charged with attempting to obtain 100l. from the Duke of Sutherland, and other sums from the Duke of Montrose, Lord Leigh, and Earl Spencer, by fraud.—The prisoner was an American, and appeared to have formerly been employed at the War office, but was discharged in 1858, and in the month of October, 1876, he was tried at this court for a fraud of the same character as the present, and was sentenced to penal servitude, and only released in October last. In the month of December he sent a letter to the Duke of Montrose, in which he described himself as an Italian count, and said that his titles were the Marquis of Conti, Duc de Hovado, and he requested the Duke to lend him 100l., as he was in great distress, owing to his agent in Italy having embezzled the money he had received for his rents. As an additional inducement to him to do what he required, he stated that the Duke's father was his godfather. He sent letters of precisely the same description to Earl Spencer, Lord Leigh, and other noblemen, and in all these letters he represented that the fathers of the different noblemen to whom he applied for the loan of the money had been godfathers to him.—The prisoner made a long statement in his defence, and endeavoured to show that the alleged false statements had been negatived by the witnesses for the prosecution.—The jury returned a verdict of \"Guilty,\" and the prisoner was sentenced to 12 months' imprisonment without hard labour.\n\nFRAUDULENT BANKRUPTCY.—Morris Schott, 22, was charged with several specific offences under the Bankruptcy Act, the principal charge against him being that within a period of four months preceding his being adjudicated a bankrupt, he had obtained gold and silver watches of the value of 2,000l. from different tradesmen by fraud and false pretences, and without intending to pay for the same.—It appeared that the prisoner carried on business as a dealer in watches in Clerkenwell. The watches were obtained from the London agents of several manufacturers in Switzerland.—The jury found the prisoner \"Guilty.\"—He was sentenced to 12 months' hard labour.\n\nEMBEZZLEMENT BY AN OFFICE BOY.—The Manchester magistrates yesterday remanded James Hulme, office boy, on a charge of embezzling over 200l., the money of his employers, Messrs. Peace and Scott, of the City. The prisoner had received the money and failed to account for it.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206251983.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 630, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2530, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]