[{"id": "3bc75480cb2b88bbcfbf956059d07dd2cc445293", "text": "AN INNOCENT AFROAD.\n\nDennis Davis, giving his address in Kenders-street, Bermondsey, was charged, at the Lambeth Police-court, before Mr. Biron, Q.C., with stealing, by means of the three card trick, the sum of £1 6s., from Lawrence Gibbons. The prosecutor, a bandsman in the 1st Oxfordshire Light Infantry, stationed at Gosport, deposed that on Wednesday he got into a train to come to London by the South-Western Railway. At Clapham Junction the prisoner and three other men got into the same carriage. Shortly afterwards the prisoner took out a newspaper and, spreading it on his knees said, \"This is a billiard board.\" He then produced three playing cards, and said, \"I'll bet anyone 6s. to 2s. 6d. that he won't find the king of hearts.\" Witness handed 2s. 6d. to the prisoner, but failed to find the card. Mr. Biron: I suppose there were some of the company who occasionally found the king. Prosecutor: Yes. Generally one of the other men who got in the carriage with the prisoner. (Laughter.) Mr. Biron: I suppose they did not put money on the game? Yes. (Laughter.) The prosecutor proceeded to say that he tried to find the king four times, and at last lost 28s. 6½ altogether. Mr. Biron: Was the corner of a card now and then turned up? Prosecutor: Yes it was, and I noticed somebody won by that. Mr. Biron: Did you try the card with the turned-up corner? Prosecutor: Yes, I did. Mr. Biron: Then you won? Prosecutor: No, for it was not the king. (Laughter.) Prisoner (to prosecutor): Did you say that you had seen the game played at Nottingham races, and understood it very well? Prosecutor: No, I did not. Mr. Biron: If you had done so you overrated your ability. (Renewed laughter.) In answer to the prisoner, the prosecutor stated that a stout man was supposed to win a sovereign. Mr. Biron: The fat man was a friend of the prisoner? Prosecutor: I should think so now. The prosecutor said that upon arriving at Waterloo station a fellow passenger advised him to give the prisoner into custody, and he did so. Inspector Carwood, of the railway company's police, informed his worship that the prisoner was a well-known card-sharper, and connected with a gang of thieves infesting railway stations, and against whom numerous complaints had been made. Mr. Biron said he had no doubt whatever that the prisoner was well known as an experienced sharper, and played the three-card trick with skill. The offence was as bad as robbing a man by putting the hand in his pocket. He sentenced the prisoner to three months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810768.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 644, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2534, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]