[{"id": "7030ff7877efba1a177aa42abc7a2fcaff1be6b6", "text": "OLD BAILEY, YESTERDAY.\n\nCHARGE AGAINST A WOOLBROKER.—William Jarvis, 56, woolbroker, of Coleman-street, City, was indicted for obtaining by false pretences from Messrs. Carr, Glynn, Milis, and Co., bankers, of Lombard-street, the sum of £3,000l. with intent to defraud.—Mr. Besley said the allegations against the defendant were that upon two occasions—in August and September—this year he obtained from the prosecutors two advances of £1,500l. each upon dock warrants for the delivery of bales of wool, which he represented to be of the value of £3,500l., whereas, upon examination by a competent expert, the goods were found to be deficient in weight and quality, and of the value of £450l. only. The false pretence alleged against the defendant was analogous to that of a person disposing of a 12-carat gold ring as an 18-carat gold ring. The defendant was a woolbroker in the City, and although in late years he was not in good credit with the prosecutors, who traded with him under the name of Cousins and Co., yet he had had an account with the bank for over 20 years, and there was no suggestion that upon any occasions, prior to August this year, when advances had been made to the accused, he acted otherwise than as an honest and respectable trader.—The jury, after a short deliberation, found the defendant \"Guilty.\" They strongly recommended him to mercy on account of his age and previous good character.—Mr. Lockwood, in mitigation of sentence, said the defendant's present unfortunate position was brought about purely through a failure in his business. The defendant was in a very delicate state of health, and he had already been in prison some weeks.—The Recorder postponed sentence until next sessions.\n\nThis concluded the business, and the court adjourned until the 12th January.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206274525.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 452, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1799, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]