[{"id": "fab67a840e40e37f28f713108cc33422ea74dfbf", "text": "FATAL OMNIBUS ACCIDENT.—THE BANKSIDE ROWING MATCH.—Mr. Joseph Payne held an inquest on Wednesday evening in St. Thomas's Hospital, on the body of Henry Joseph Read, aged ten, who was killed by being run over by an omnibus on the evening of Monday last, under the following circumstances:—From the evidence of several witnesses, it appeared that about a quarter to eight on the above evening, the deceased was seen to pass between a waggon and cart crossing London-bridge, and run across the road. In doing so, he fell down in front of the horses of an omnibus passing on the other side of the cart and waggon, and before the driver of the omnibus could pull up, both wheels passed over his loins. He got up without any assistance and walked to the footpath, where he asked a witness, named Kirby, to take him by the hand. The omnibus had stopped but a minute before to take up passengers, and was going in the direction of Bow en route to Brixton. The driver pulled up immediately, and it was the opinion of the witnesses that the deceased was not seen by him before the wheels passed over the body. In a few minutes the deceased was removed to the hospital, where he died the same evening from the effects of the injuries.\n\nMr. J. S. Read, of No. 14, St. Mary-at-hill, said the deceased was his son, and the last time he saw him alive was on Monday evening last, about a quarter past six o'clock. He wished to go over the water with witness's man, but he was refused permission. He had no business on the bridge, but witness supposed he had slipped out on the sly and gone there to see the rowing match. The injuries the deceased received were rupture of the liver and diaphragm, with effusion into the cavity of the belly. All the witnesses stated that no blame was attributable to William Eamden, the driver of the omnibus.—Verdict, \"Accidental death.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3205317819.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1660, "total-output-tokens": 457, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1855, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]