[{"id": "37b8ff921926269416fa68548edd0f08fb835145", "text": "AN EXTRAORDINARY STORY.\n\nAt the Worship-street Police-court, Betsy Liftschitz, twenty-three years of age, a tall, showily-dressed young woman, was charged, on remand, with having stolen a jacket, the property of her sister. Mr. Morris (Abbott and Co.) defended. The sister and mother of the prisoner, apparently poor foreign Jews, living in Spitalfields, appeared in support of the charge, and the jacket in question, which the prisoner was wearing when arrested, was produced. The sister described herself as a button-hole hand, and said that the accused had formerly gained her living in the same way. Cross-examined by Mr. Morris, the sister said that the prisoner had been away from home for some time. Asked where she had been, the sister answered, \"In a house with a man who keeps girls.\" After that her sister had been at home till about a fortnight ago, when she went off. Her mother fetched the prisoner home. Then her mother and the prisoner quarrelled; She did not lend her sister the jacket, though they had borrowed one another's clothes. The evidence of the witness, as well as that of the mother, was taken through the medium of Mr. Karamelli, interpreter, and Mr. Morris remarking that the difficulty was to put the case clearly before the Court, explained that he alleged the mother was the cause of prisoner's degradation, and said that it was evident the \"wages of sin,\" in the case of the fine young woman in custody were large, and that as she had taken herself, and consequently her income, away from her mother this charge was a piece of spite. He elicited from the mother in cross-examination that the prisoner had been living at home during a portion of the time, paying large sums for her keep, and had left after quarrelling about what had been supplied for the money. The mother said it was not true that she took the money and starved the prisoner. She did not inquire where the money came from. Her daughter had been away a fortnight, and she did not go after her until someone told her where she was to be seen. Before that fortnight her daughter had been in a home for fallen Jewish women at Shepherd's-bush. She (the mother) did go there to see her. She also wrote and told her that she wanted her home again, and after that the prisoner came and returned again to her old life. Mr. Morris said that he had talked with the prisoner, who was anxious to get away from the streets if she could return to the home. He was really desirous of helping her in her wish. The magistrate remarked that the charge could never be sustained before a jury. After some conversation it was arranged that the missionary attached to the court should see the lady superintendent of the home referred to, and Mr. Massey now reported that, though it was contrary to rule to receive a girl a second time when she had once thrown up her chance, an exception would be made in the prisoner's favour. The prisoner being willing to go back to the home, the charge was now dismissed by Mr. Dickinson, and the prisoner given up to the missionary.\n\nSINGULAR CHARGE OF SHOPLIFTING.\n\nAt the Westminster Police-court a well-dressed woman, named Elizabeth Tawle, thirty-seven, described as a lodging-house keeper, and having private means, of 12 Markham-square, Chelsea, surrendered to her bail, before Mr. De Rutzen, on remand, charged with stealing from Harrod's Stores (Limited), in the Brompton-road. Mr. Rymer prosecuted. It appeared that on Saturday night the prisoner was stopped walking off with a jar of marmalade under her shawl, and a pot of cream and a jar of apricot jam were found in her bag. She admitted that she had not paid for the preserves, offered compensation, and when Mr. Burbage, the assistant-manager, directed her to be charged she said that she supposed it was done as an example to others. Mr. Daerden Dutton, solicitor, for the defence, elicited from the witnesses that the stores were very busy at the time of the alleged robbery, and that the prisoner did say that as there was no counterman to attend to her she helped herself, intending to pay for the articles. The hearing of the case occupied a considerable time, and in the end Mr. De Rutzen committed the prisoner for trial to the sessions. She pleaded not guilty, and reserved her defence. Bail was accepted.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810284.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 977, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4295, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]