[{"id": "3ede77b8481dcf448b576f73021ab779ad6cf20d", "text": "EXTRAORDINARY CHARGE OF INDECENT ASSAULT.—William Norris, aged 29, a master cabinet-maker, carrying on business in the Southwark-bridge-road, was indicted at the Surrey sessions, on Monday, for indecently assaulting Miss Emily Simmonds, aged 16, under the following extraordinary circumstances.—The prosecutrix, who looked many years older than 16, is the daughter of a billiard-table manufacturer carrying on business in the Kennington-road. In May last the prisoner went to her father's shop to buy some wood, and whilst dealing with the father he saw her. He said he was a single man, and desired the father to allow him to pay his addresses to her. The father at first objected, owing to her age, but after some time consent was given to his suit. They went out together and were considered to be engaged. On Sunday, the 2nd inst., he took advantage of being alone with her in the house to seduce her. She resisted as much as she could, but did not tell her mother of it till they discovered that the prisoner was a married man.—Mr. Lilley, for the defence, contended that the girl was a consenting party.—The jury found a verdict of \"Guilty,\" and the prisoner was sentenced to 18 months' hard labour.\n\nTHE \"NAVYY\" RIOTS IN CUMBERLAND.—At the Petty sessions, Penrith, on Tuesday, Charles Parker, alias Punch, John White, and William Kaisley, were charged on remand with the wilful murder of Cornelius Cox on the 15th inst., on the Midland Extension railway. They were all committed for trial at the assizes, on the charge of wilful murder. Three men, charged with conspiring to cause a breach of the peace, were remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206235685.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1568, "total-output-tokens": 418, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1625, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]