[{"id": "ffdb50f09fc7011ce5fab6fd5735e792b87eb932", "text": "CUTTINGS FROM THE COMIC JOURNALS.\n\n(From Punch.)\n\nTHE ANGLO-SAXON COMPLEXION.—Frau von Schmeiligrath: Ach! Himmel! Mister Chones! Vat peautiful hides they haf, the young English misses?\n\nONE OF THE LIGHT-FINGERED CLASS.—A lady with small taper fingers. This would account for cases of Kleptomania.\n\nGRATIFYING!—Amateur Artist (to the Carrier): Did you see my picture safely delivered at the Royal Academy?—Carrier: Yessir, and mighty pleased they seemed to be with it—leastways, if one may judge, sir. They didn’t say nothin’—but—lor’ how they did laugh!\n\n(From Moonshine.)\n\nMAMA: What is a reptile, Tommy?—Tommy: I don’t know.—Mama: What is that nasty thing that crawls along the ground, dear? Don’t you remember?—Tommy: The baby!\n\nPOLICEMAN X: What do you think of this ‘ere augmentation of the force—1500 more of us at one swoop?—Policeman Y: Don’t like to express an opinion not yet. Wait till I see if one of these ‘ere philanthropists will bringin’ a Act of Parliament for the compulsory introduction of 3,000 more cooks.\n\n(From Judy.)\n\nSCHOLASTIC.—Why is a retriever, being taught to beg, like the leathern strap and buckle it wears around its neck?—Because it is a dog scholar (collar).\n\nTHE RIVALS.—Crossing Sweeper (to official): I say, mate, leave us a bit of mud, can’t yer? How’s a chap to earn a honest living?\n\nTHE BITTER BIT.—Customer: Give me a bitter beer.—Sharp Barmaid: A bit o’ beer, sir? We don’t sell it in a solid, sir.—Customer (looking at his friend’s glass): Indeed! it’s so thick that I really couldn’t tell the difference.\n\n(From Fun.)\n\n“HERE STANDS A POST.”—Boy: No, yew be go’an quoite wrong, zur.—Traveller: But the finger-post said this way.—Boy: Ah, but that ther finger-poast was blowed down one nought, and chap as stock she up agen, ‘e couldn’t tread, ye see!\n\nA PUFF AND A BLOW.—Spindles: How does the new piece go now, Puffer?—Puffer: Splendidly, my boy, splendidly! Tremendous go—thousands turned away nightly.—Spindles: Thousands turned away nightly! Oh, then, that accounts for the very few people I saw there when I looked in the other evening.\n\n(From Funny Folks.)\n\nA DOG “STAR.”—Toby.\n\nA “‘HARD’ AND ‘FAST’ ‘LINE.’”—Trying to “go the ace” on a limited income.\n\nMATRIMONIAL EQUALITY.—Mrs. Smith: And you are really going to marry the widow after all; and, I hear, give up smoking.—Languid Swell: Ya-as, Mutual ‘rangement. She gives up her weeds—I give up mine.”", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206254571.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 722, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2405, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]