[{"id": "cab8aa6f1d25b63a9f222eb81d3afa74409d0a2d", "text": "A DEPRAVED MOTHER.\n\nMrs. Elizabeth Rawlings, the wife of a captain of a merchant ship, was brought before Mr. Elliott at the Lambeth police-court, on the following charge:\n\nA gentleman from a solicitor's office, accompanied by a clergyman, attended, and said that the object of these proceedings against the defendant was to protect the lives of her three children, and remove them from her, as her conduct had rendered her wholly unfit to have the care of them. Her husband had been allowing her a sum adequate to support herself and her children; but it having recently come to his knowledge and that of her friends that she indulged in drink, and that she had been brought to this court on a charge of robbing her furnished lodgings, they, in order to get the children away from her, sent up from the neighbourhood of Bath a trustworthy servant of her family, and that person called on her; when the defendant made use of language in reference to her children which proved it to be unsafe to leave them longer in her charge, and also uttered violent threats against the person who had called on her. The three children were all under the age of ten years.\n\nMrs. Elizabeth Elson, the servant alluded to, said she found Mrs. Rawlings at a house in the Waterloo-road, and on telling her for what purpose she had come to town, she replied that unless she got her money, as she was in the habit of doing, from her husband, she should poison the children and herself. This threat she repeated, and was in a violent passion.\n\nJoseph Coster, one of the summoning officers, said that a warrant had been placed in his hands to apprehend Mrs. Rawlings, and he found her walking in the Waterloo-road. He told her he had a warrant for her apprehension, on a charge of threatening to murder her children. She replied that she did not consider what she said in the nature of a threat. What she said was, that if she did not get her money she should take her children to the top of the house and fling them out of the window; and then jump out herself. She then asked him to go to the house where her children were. He did so, and that house was a common brothel.\n\nMrs. Rawlings, whose tone, manner, and language, stamped her as a person of superior education, but whose countenance, as evidently once handsome, now showed the bloated and sodden appearance produced by excessive drink, said that she was not aware of the character of the house when she took lodgings there, as it was not in every place that a mother with three children could get a lodging. She admitted that she had got into a passion on hearing a threat from the old servant of the family to take away her children, leaving her destitute and unprovided for, and with that feeling she had used expressions which she did not mean. She declared she had no intention of leaving her children.\n\nMr. Elliott observed that it was quite clear the prisoner was not a proper person to have care of her children, but respecting their removal from her he should give no opinion. He should merely call on her to find bail, herself in 40l. and two sureties in 20l. each, to be of good behaviour for one month. The defendant not being able to procure bail was sent to Horsemonger-lane gaol, and her children were removed by their friends.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206314316.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 744, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3278, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]