[{"id": "ab2adaaaef18b889e5ef9450aea76e0a5f29d0f6", "text": "MIDDLESEX SESSIONS.\n\nTUESDAY.\n\nCHARGE OF ROBBERY.—The August adjourned session was held at Hicks's Hall, Clerkenwell-green, on Tuesday. The calendar was light, and contained only the names of 70 prisoners for trial, 59 of whom were committed for larceny.\n\nCharlotte Dutton, Sophia Griffiths, and Mary Dalzell, were indicted for stealing a watch, value £6, the property of Adolphe Coulier.—Mr. Prendergast was retained on behalf of the prisoners, Griffiths and Dalzell.—The prosecutor, who was a Frenchman, and was examined through the medium of an interpreter, said that he met the prisoner Dutton in the New-road last Sunday week, and after some conversation, being in a very gallant mood, he invited her to a house where they had some refreshment. He laid his watch on the table, and shortly after it disappeared. Dutton said that she knew nothing about it. The two other prisoners were in waiting, and occasionally came in and out of the room. The prosecutor sent Griffiths for a policeman, who, when he came, received an account from the prosecutor how his watch had disappeared from the table. The women said they knew nothing about it. The woman Griffiths, who fetched the policeman, it appeared, was the keeper of the house, and on going to the officer, she said, \"There's a Frenchman in my house, who says he has been robbed of his watch.\"—Mr. Prendergast said there was no case against his clients.—The learned judge, in summing up, said it was a singular case.—The jury inquired for the watch.—The learned judge said that it could not be found. There was no proof that the prosecutor ever took it into the house.—The jury returned a verdict of not guilty.—The court disallowed the prosecutor's expenses.\n\nROBBING READY FURNISHED LODGINGS.—Ann Mitchell was indicted for stealing two blankets and other articles, value £1 10s., the property severally of Edward Bull and William Court.—The prisoner, there was every reason to believe from the evidence, was one of those persons who make a living in London, by taking ready furnished lodgings; and after stripping them of every article they can lay their hands upon, decamp, to repeat the process in another locality.—The court intimated a determination to mark these cases, when brought home to the guilty parties, with severity.—The prisoner was sentenced to imprisonment in the House of Correction for six calendar months.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206190899.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1522, "total-output-tokens": 565, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2381, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]