[{"id": "7fd16c74e169e190417da8ded0416a0ef9469bae", "text": "XXXI. Observations on the Scurvy. By Charles De Mertans, M. D. Dated Vienna, Jan. 14, 1778.\n\nRead May 7, 1778.\n\nTHE diseases of a great multitude of people, who live in the same manner, and are obliged to live upon unwholesome food, are to be corrected by a correction of the food itself, and not by any medicines properly so called.\n\nConsistently with this principle, I have always thought that the salt provisions used by sea-faring people being the principal cause of the scurvy which makes such fatal havoc\n\nObservations sur la Scorbut. Par M. Charles de Mertans, Docteur en Medecine.\n\nLORSQU'IL s'agit de la conservation de la santé d'une multitude de gens vivant tous de la même manière, et obligés de se nourrir principalement d'aliments qui l'altèrent; c'est dans la correction de cette nourriture, et non dans les remèdes donnés comme médecines, qu'il faut chercher les moyens de les préserver des maux, auxquels l'expérience démontre qu'ils sont les plus fuyants.\n\nD'après ce principe j'ai toujours cru que les provisions salées, dont usent les gens de mer, étant la principale cause du scorbut qui attaque les équipages dans les voyages de longue durée, et prive souvent les vaisseaux des bras nécessaires pour\nhavoc amongst crews engaged on long navigations, it was necessary to find out some food of an opposite nature to this, capable likewise of being preserved at sea.\n\nSalt provisions are hard of digestion; and we all know that all food, which our powers of digestion cannot reduce to a good chyle, undergoes in the prima via such alterations as are proper to the respective species of it in regard to heat and humidity; consequently, the chyle produced by salt provisions partakes altogether of an animal nature tending to putrefaction. When it mixes with the blood, it increases this disposition which our fluids have of themselves; and thus, by degrees, introduces that flow putrid degeneration which we call scurvy, of which, I am persuaded, there is but one sort, different in its degrees. I am likewise persuaded, that the sea and land scurvy are the same disorder, arising from similar\n\npour les conduire, il falloit chercher à y opposer des alimens d'une nature contraire et qui se conservassent sur mer.\n\nLes viandes salées sont de difficile digestion, et nous savons que les alimens que nos forces digestives ne peuvent pas réduire en bon chyle, subissent dans les premières voyes les altérations propres à leur espèce dans la chaleur et l'humidité; par conséquent le chyle produit de viandes salées seules, tient entièrement de la nature animale tendante à la putrefaction. Lorsqu'il se mêle au sang, il augmente cette disposition, que nos fluides ont déjà par eux mêmes, et par là peu à peu introduit cette dégénération putride lente, que nous appelons scorbut, dont je suis persuadé qu'il n'y a qu'une seule espèce, qui a différents degrés. Je suis aussi convaincu que le scorbut de mer et celui de terre font la même maladie, produite\nsimilar causes, that is, living upon salt meat or fish, few or no vegetables, damp houses, &c.\n\nTo prevent then or correct this alteration in the humours, we must find out some antiseptic aliments, which may keep a great while, and not be subject to be damaged from the alteration of climate. Now, I used to think, that sour-kraut, or fermented cabbage, so frequently used in Germany, had these qualities; that though it did not always please those who eat it for the first time, everybody soon grew used to it, and found it good and wholesome food; that sailors in particular were very fond of it, especially when they had no other greens. I had accordingly several conversations upon the subject, twelve years ago, with Messieurs Preston and Langley,\n\nproduite par des causes semblables : nourriture de viande ou poissons salés, peu ou point de végétaux, habitations humides, &c.\n\nIl s'agit donc, pour prévenir ou corriger cette altération des humeurs, de procurer des aliments d'une qualité antiseptique, qui puissent se conserver long temps, et que les changements de climats ne gâtent point. J'ai cru que le sauer-kraut, ou choux fermentés, dont on fait si grand usage en Allemagne, avait ces qualités; que si elle ne plaisait pas toujours à ceux qui en mangent pour la première fois, tout le monde s'y accoutumait bientôt, et la trouvait un mets bon et nourrissant; que les marins en féroient leurs délices, surtout lorsqu'ils manquaient d'autres légumes. Jeus il y a une douzaine d'années plusieurs conversations à ce sujet avec Mess. Langlois et Preston, attachés ici à l'ambassade de mylord Stor- mont, qui m'honorèrent de leur amitié. Je désirais qu'on fit des essais de transpor...\nin which I expressed my wishes that four-kraut might be carried out and made part of the ships provision.\n\nFor some years past I have seen, with great pleasure, in the public papers, and the relations of travellers, that the trials I wished for have been crowned with success; and that the preservation of the healths of many crews, which have gone round the world, has been owing to four-kraut. The preservation of sea-faring people is an object so important to many nations, and whoever contributes towards it does so essential service to mankind, that I will now communicate other methods, which, joined to the first, will serve to keep off the scurvy, as well as to cure it more readily and more surely. These methods are likewise in the food, and they consist of vegetables eaten in a state of crudity, and such as the earth affords\n\ntransporter la sauer-kraut sur mer, pour en faire une partie de la nourriture des équipages.\n\nDepuis quelques années je lis avec une vraye satisfaction dans les papiers publics et les relations des voyageurs que ces essais ont parfaitement réussi, et que c'est en grande partie à la sauer-kraut que l'on doit la santé de plusieurs équipages de vaisseaux qui ont fait le tour du monde. La conservation des gens de mer est un article des plus importans pour plusieurs nations, et en y travaillant on rend service à une grande partie du genre humain. Dans cette vue je vais communiquer de nouveaux moyens, qui, joints aux premiers, serviront à préserver du scorbut, à en arrêter les progrès, et même à le guérir plus promptement et plus sûrement. Je les trouve de même dans la nourriture, ce sont des végétaux de différentes espèces mangés dans l'état de crudité, et tels que la terre les donne.\naffords them. I am convinced, that all the greens used in our kitchens are much more antiscorbutic when they are raw than after they have been boiled in water\\(^{(a)}\\), or have gone through any other preparation by fire. I ground my opinion upon experience, the safest of all guides, and shall therefore begin with the facts which led me to it.\n\nI was surprized to find, during an abode of many years at Moscow, that many gentlemen merchants and strangers were attacked by a slow scurvy, having their gums soft, swollen, and blueish, the breath strong, and many scorbutic spots at the legs, whilst it was rare to find among the lower people, either of town or country, a single person with these marks. The nourishment of\n\n\\(^{(a)}\\) Perhaps it is because they lose a great deal of fixed air by ebullition.\n\nJe suis assuré que tous les légumes dont on se sert dans nos cuisines, sont infiniment plus antiscorbutiques lorsqu'ils sont crus, que quand ils ont été bouillis\\(^{(a)}\\) dans de l'eau, ou qu'ils ont passé par toute autre préparation au feu. Je me fonde sur le guide le plus sûr, l'expérience; c'est pourquoi je commencerai par rapporter des faits.\n\nPendant un séjour de plusieurs années que je fis à Moscou, je fus surpris de trouver beaucoup de gentils hommes, de marchands et d'étrangers, atteints d'un scorbut lent, ayant les gencives molles, gonflées, et bleuâtres, l'haleine puante, et plusieurs des taches scorbutiques aux jambes; tandis que parmi le peuple tant de la ville que de la campagne il est très rare de trouver un seul homme qui ait la moindre de ces marques. La nourriture des premiers consiste\n\n\\(^{(a)}\\) Peut être parce qu'ils perdent par l'ebullition beaucoup de leur air fixe.\nthe former consists of a great deal of meat, both salt and fresh, and likewise of fish; they seldom eat any greens, except now and then a soup made of sour cabbage, exactly resembling the German sour-kraut in everything, save that this cabbage is chopped small, whereas the sour-kraut is cut according to the length of the cabbage. Their common drink is very sour small beer, called quas, besides which they drink wine, the beer of the country, English beer, and a small glass of brandy at least before every meal. They eat very little bread. The common people live all the year upon this sour cabbage soup, in which they boil salt meat on common days, and salt or dried fish on meager days and during their four lents (which are more than a third of the year) when they add to it very stinking lin-seed oil instead of grease.\n\nsurtout en beaucoup de viande, tant fraîche que salée, et de poissons de même : ils mangent peu ou point de légumes, excepté de temps en temps d'une soupe aux choux aigres, qui ressemblent entièrement à la sauer-kraut d'Allemagne, sinon qu'ils sont hachés menus, au lieu que celle-ci est coupée suivant la largeur des choux. Leur boisson ordinaire est une petite bière fort aigre qu'ils nomment quas ; ils boivent en outre du vin, de la bière du pays, de la bière d'Angleterre, et un petit verre d'eau de vie au moins avant chaque repas ; ils mangent fort peu de pain. Le peuple vit toute l'année de cette soupe aux choux aigres, dans laquelle on cuit de la viande salée les jours gras, et du poisson salé ou séché les jours maigres et pendant leurs quatre carêmes, qui font plus d'un tiers de l'année, alors ils y ajoutent de l'huile de lin fort puante au lieu de graisse ou de beurre.\n\nDans\ngrease or butter. In this soup, which is called *schifti*, both in the meager and other seasons, they boil meal, principally that of Saracen wheat. They eat cucumbers like the others in summer, and salt them for the winter. They likewise feed very much upon oat bread. The common people live in small wooden houses, generally very low, in which they get together both night and day during three parts of the year, on account of the great cold. There is little air in the room, the windows of which are very small. Here they stew together in humidity and nastiness; for, except the bath, which, as well as those I have mentioned first, they use once a week, they are extremely nasty.\n\nHere then are many reasons, all of which (except the constant use of sour cabbage and bread) should make them\n\nDans cette soupe, qu'ils appellent *schifti*, en maigre et en gras, ils font cuire des gruaux, surtout celui de bled Sarrasin. Ils mangent, de même que les premiers, en été des concombres, et les font saler pour l'hiver. Ils se nourissent aussi beaucoup de pain de seigle. Les gens du peuple habitent de petites maisons de bois, ordinairement basses, où il se rassemblent nuit et jour en grand nombre les trois quarts de l'année, à cause du grand froid; il y a peu d'air dans les chambres, les fenêtres en sont fort petites: ils y croupissent généralement dans la malpropreté et l'humidité. À l'exception du bain dont ils se servent, de même que la plus part de ceux que j'ai nommés en premier lieu, une fois la semaine au moins, ils sont fort malpropres.\n\nVoilà bien des raisons, excepté le plus grand usage de choux aigres et de pain,\nthem more subject to the scurvy than the people of fashion, or those who live at their ease; a constant use of meat or fish that is salt (for they esteem neither so much when they are fresh) much more brandy, filth and damp in their houses, less change of cloaths or linen.\n\nI was many years making these observations, and inquiring what it was that could preserve them from the scurvy, which, on so many accounts, they ought to have been more subject to than the others. It appeared to me that, exclusive of the daily use of the four cabbage, which I consider as the most powerful of all preservatives, they were indebted for their safety to the great quantity of raw greens, such as onions, leeks, radishes, turnips, peas in the pod, and others, which they eat. The berries of Vaccinium, with others much resembling them, called kloukna,\n\nqui devroient rendre ceux cy plus sujets au scorbut que les nobles et les gens aisés: presque toujours de la viande ou du poisson salé (ils ne font même pas tant de cas de l'une et de l'autre quand ils sont frais) beaucoup plus d'eau de vie, la mal propreté et l'humidité de leurs maisons, le changement plus rare de linge et d'habits.\n\nJe fus quelques années à faire ces observations et à chercher ce qui pouvoit principalement les préserver du scorbut, dont par tant de raisons ils auroient du être attaqués préférablement aux autres: il me parut qu'outre l'usage journalier des choux aigres que je regarde comme le plus puissant préservatif du scorbut, ils en étoient redevables à ce qu'ils mangent quantité de légumes crus; oignons, porreaux, radis, raves, navets, pois avec leurs gousses. Les bayes du Vaccinium,\nkloukna, which are of the size of a small cherry and very acid, are, together with apples, strawberries, and raspberries, almost the only fruits of these countries.\n\nIn the Foundling Hospital, of which I was a physician, there were every winter several scorbutic patients. This hospital was built near the conflux of two rivers, in a place the soil of which has been raised at a great expense. As near back as the year 1770 there were still stagnated waters to be seen in the place; but only a part of the children lived there, the remainder lived in a stone house, situated upon an eminence in the neighbourhood.\n\nThe usual symptoms of the scurvy on these children were, the swelling of the gums, the nauseous breath, a great languor and dejection; they used to become cachetic,\n\nnium, et d'autres presque semblables qu'ils appellent kloukna, de la grosseur d'une petite cerise et fort acides, sont avec les pommes, les fraises et les framboises, presque les seuls fruits de ces contrées.\n\nJ'avais chaque année en hiver et au printemps, dans la maison des enfans trouvés, dont j'étois medecin, beaucoup de scorbutiques. On a bâti cette maison près du confluent de deux rivières, dans un lieu dont on a relevé le terrain à grands frais. Jusqu'en 1770 on voyoit encore parci par là de l'eau croupissante dans cet endroit; mais il n'y avoit qu'une partie des enfans qui y demeuroit, les autres occupant une vieille maison de pierre située sur une éminence dans le voisinage.\n\nLes symptomes ordinaires de scorbut chez ces enfans étoient le gonflement des gencives, la pesanteur de la bouche, une grande lasitude et abattement; ils de-\ntic, and of a leaden colour. In process of time the swelling of the gums increased; they were used to assume a livid colour: pustules were formed in the mouth, the infection of the breath grew most horrible, the gums and all the inside of the mouth became gangrenous, the jaw bones were carious, the fall of the teeth followed, and the bones of the alveoli fell to pieces. The sick could scarce stir, though they had as yet no fever, and had a very good appetite. The legs of some amongst them were from the first covered with scorbutic spots, and dried crusts, like scales; others only had these symptoms after the mischief had made a great progress. Most of them had their legs swelled. In some, the flexor tendons of the legs grew shorter, and stiffened in such a manner that they were forced to keep always in a lying posture, with\n\nvenoient chacheïtiques, et d'une couleur plombée. Peu à peu le gonflement des gencives augmentait, elles prenaient une couleur livide; il se formait des pustules à la bouche l'haleine repandait une infection horrible; les gencives et tout le dedans de la bouche se gangrenoit; les os des mâchoires se carioient, la chute des dents suivait, et les os des alvéolés tombaient par morceaux. Les malades pouvaient à peine se remuer, quoique toujours sans fièvre; l'appétit ne leur manquait pas. Il y en avait dont les jambes dès le commencement étaient couvertes de taches scorbutiques, et de croutes sèches comme des écailles; à d'autres elles ne venaient que lorsque le mal était fort avancé, la plus part avaient les jambées ensées. Chez quelques uns les tendons fléchisseurs des jambes se raccourcissaient, et se roidissaient de façon qu'ils étoient obligés de rester continuellement couchés, ayant les pieds près des cuisses; j'ai vu une couple\nwith the legs near the thighs. In two cases the same thing has happened to the arms.\n\nThe gangrene of the gums and mouth, as well as the caries of the bones, used insensibly to increase to such a degree, that the bones of the alveoli and the spongy part of those of the upper jaw used to fall out. The mischief was used, however, to make a slow progress; there often elapsed a fortnight, and sometimes more, after the beginning of the gangrene of the mouth and caries of the bones; and many months between the first symptoms and the stage of the disorder I have been describing. Even in this stage, dreadful as it was, they still took nourishment sufficient, and even much more than it would be thought possible they should have taken in such a situation. It was impossible, however, they should live long in such a state, and death soon put an end to their\n\ncouple de fois arriver la même chose aux bras.\n\nLa gangrène des gencives, de la bouche et la carie des os augmentaient insensiblement, au point que les os des alvéoles et la partie spongineuse de ceux de la mâchoire supérieure tomboient. Ce mal alloit lentement; il se passoit quelques fois quinze jours, et même plus, depuis le commencement de la gangrène de la bouche et de la carie des os, et plusieurs mois depuis l'apparition des premiers symptomes de la maladie jusqu'au point que je viens de décrire. Malgré cela ils prenoient encore dans ce dernier période de la nourriture en quantité suffisante, et infiniment plus qu'on n'aurait pu se l'imaginer d'après leur état. Ils ne pouvoient cependant vivre longtemps dans cette situation, et la mort venoit enfin\ntheir torments. I have often been surprized at not hearing any cries of anguish come from them in so lamentable a situation; but they were used almost continually to complain of their voice being feeble.\n\nThe mode of treatment which I commonly made use of in curing the greater part, provided the mischief had not made a considerable progress in the spongy bones of the upper jaw, was this: the first thing I did was to put them on a vegetable diet, and order them soups, with a great many greens dressed in light broth, such as four cabbage, carrots, turnips, and onions, &c. to which I added stewed onions and sorrel. The drink of the bigger sort was quas or four small beer; the lesser ones (none of which were ever seized with the scurvy under two years old) drank water.\n\nDuring\n\nenfin les délivrer de tant de maux. J'ai été souvent étonné de ne leur entendre pousser aucun cri de douleur dans un état aussi déplorable; mais ils se plaignaient presque continuellement d'une voix languissante.\n\nLe traitement que j'employois ordinairement guérissoit la plus part, pourvu que le mal n'eût pas fait des progrès dans les os spongieux de la mâchoire supérieure. D'abord je les mettois entièrement à la nourriture végétale, leur faisant donner des soupes avec beaucoup de légumes cuits dans un bouillon léger; comme choux aigres, carottes, panais, navets, oignons, &c. des épinards, de jeunes orties, de l'ofelles, étuvés: la boisson des plus grands étoit le quas ou petite bierre aigrelette, les petits (b) buvoient de l'eau.\n\n(b) Il n'en ai jamais vu au dessous de deux ans attaqués du scorbut.\nDuring the spring, those who had the scurvy took, in proportions suitable to their ages, a drink made of whey, in which were infused antiscorbutic plants, such as *cochlearia*, *nasturtium aquaticum*, *becca bunga*, *acetosa*. This infusion was sweetened with plain syrup, or syrup of sugar. Besides this, in the course of the day, they used a gargle, made of an infusion of herbs, rue, sage, agrimonia in water, to which was added spirit of *cochlearia*, and honey of roses. When the gangrene began to show itself at the mouth, besides the remedies I have mentioned, they used to take a strong decoction of bark, part of which decoction I likewise added to the gargle. I likewise had the gangrened parts touched with honey of roses, mixed with a small quantity of spirit of sea salt.\n\n---\n\nAu printemps tous les scorbutiques prenoient chaque matin une certaine quantité, suivant leur âge, de petit lait où l'on avoit infusé des plantes antiscorbutiques, comme *cochlearia*, *nasturtium aquaticum*, *becca bunga*, *acetosa*; cette infusion étoit édulcorée avec un sirop simple ou du sucre. En outre ils se servoient souvent pendant la journée d'un gargarisme fait d'une infusion d'herbes de rhue, de sauge, d'agrimonia dans de l'eau, à laquelle on ajoutoit de l'esprit de *cochlearia*, et du miel rosat. Lorsque la gangrène se manifestoit à la bouche, outre les remèdes que je viens de rapporter, ils prenoient une forte décoction de kinkina, j'ajoutois aussi de cette décoction au gargarisme. Je faisois toucher les parties gangrénées avec du miel rosat, au quel on avoit mêlé un peu d'esprit de sel marin.\nThis method of treatment had succeeded perfectly well the three first years; insomuch, that the greater part of the sick, as well adults as infants, were commonly cured in the space of three weeks or a month, when the distemper was not far advanced. It was in spring and winter that the scurvy used to be most fatal.\n\nIn autumn 1770, the foundling children, who remained in town to the number of a thousand (c), were lodged, contrary to my advice, in the wing of the house finished but about a year since. In a climate where the summer is so short, new walls made of bricks take a great time in drying, and this house was situated on a soil which had been a bog a few years before. Notwithstanding all the possible precautions that could be taken,\n\n(c) The greater part of the sucking children were at nurse in the country.\n\n---\n\nCe traitement m’avoit réussi les trois premières années, de sorte que presque tous ces malades, tant adultes qu’ensans, guérissaient ordinairement dans l’espace de trois semaines ou un mois lorsque le mal n’étoit pas fort avancé. C’étoit en hiver et au printemps que le scorbut faisoit le plus de ravages.\n\nEn automne 1770 on logea, contre mon avis, tous les ensans trouvés, qui étoient en ville au delà de mille (c), dans l’aile de la maison achevée depuis un an. Dans un climat où l’été est si court, les murailles neuves, faites de briques, séchent difficilement, et cette maison étoit située dans un terrain qui avoit été un marais quelques années auparavant. On tentit pendant tout l’hiver, malgré\n\n(c) La plus parts des petits à la mamelle étoient en nourrice à la campagne.\ndamp was felt in the room the whole winter. The scurvy shewed itself early in the spring, and I had many more children ill than I had had the preceding seasons. The violent symptoms were likewise much more frequent. Many had gangrenous pustules at the mouth, the jaw bones were carious in some; the limbs, particularly the legs of many, were drawn up and stiff.\n\nI put all these sick persons in the wooden house, which had already served many years as an hospital for the scurvy, and gave them the food and medicines above-mentioned; but the disorder was more stubborn than ever it had been, and all I could do could hardly keep it down. In the middle of May, seeing that the remedies I had formerly tried were unsuccessful, I began to think of other methods. The reflections communicated above,\n\ntout ce qu'on put faire pour l'éviter, de l'humidité dans les chambres. Le scorbut commença à se manifester de bonne heure, et j'eus beaucoup plus d'enfants scorbutiques que les années précédentes; les symptômes violents étoient aussi plus frequents. Plusieurs eurent des pustules gangrénées dans la bouche; quelquesuns les os des mâchoires cariés; d'autres les membres, surtout les jambes, retirés et roides.\n\nJe mis tous ces malades dans la maison de bois, qui avoit déjà servi plusieurs années d'hôpital aux scorbutiques; je leur fis donner la nourriture et les remèdes dont j'ai fait mention. Le mal étoit plus opiniatre, et tout ce que je pus faire servoit a peine a en rallentir les progrès. Vers le mois de May, voyant que les moyens employés les années précédentes, ne suffissoient pas pour guérir cette ma-\n\nladie,\nwhich I had made upon the diet of the lower people, determined me to give my patients those vegetables raw which they had before been used to eat boiled. In consequence thereof, I ordered them, every morning, radishes, sweet turnips, carrots, and young onions, which they eat like apples. At dinner, besides the soup and greens as usual, they eat salad with a little vinegar and a very little oil; in the afternoon the same roots as in the morning, and at night, greens and salad. The remedies were continued as before. In a few days all the bad symptoms decreased: those who were at the worst, and had been ill for some time, began to grow better; those who had been but slightly seized were soon well, so that at about a month's end there only remained a few of those who had been the worst, and they too were getting well.\n\nladie, qui étoit plus enracinée, je pensai à differens autres remèdes. Les réflexions que j'ai communiquées cy dessus au sujet de la diéte du bas peuple, me determinerent à donner cruds a mes petits malades les vegetaux, qu'ils mangeoient cuits. Je leur fis donc donner chaque jours le matin des raves, des navets doux, des carottes, de jeunes oignons; ils les mangeoient comme des pommes: à diner outre la soupe et les légumes comme à l'o dinaire, ils avoient de la salade avec un peu de vinaigre et fort peu d'huile: l'apres midi les mêmes racines que le matin, et le soir un légume et de la salade. On continuoit les mêmes remèdes qu'avant. Aubout de quelques jours tous les symptomes diminuerent; ceux qui étoient le plus fortement attaqués, et languissoient depuis plusieurs mois, se trouverent mieux et commencerent a guérir; les moins malades se remirent en fort peu de tems, de forte qu'au bout d'un mois il ne me restoit plus dans\nwell at a great pace. This change for the better was apparent in all a very few days after they had begun to eat the raw greens. I had not at that time read the observations of the English physicians and surgeons on malt, or I should certainly have made use of it. Quas, which I have mentioned above as the principal drink of the common people, comes near it, with this difference only, that it is not drunk in a state of fermentation. It is a species of sour small beer, to which, instead of hops, they add the wild mint.\n\nThe same method of treatment was attended with success in 1772 and 1773; in both which springs I had scorbutic patients with the same symptoms, but not in such numbers as in 1771 (when there were near sixty) because the house, having now dried, was become very wholesome,\n\ndans cette partie de l'hôpital que quelquesuns de ceux qui avoient été le plus mal, et qui se trouvoient alors en parfaite convalescence. Ce changement en mieux fut visible chés tous dès qu'ils eurent mangé les légumes cruds pendant quelques jours. Je n'avois pas encor alors lu les obiervations faites par les médecins et chirurgiens Anglois sur la dreche, sans quoi je n'aurois pas manqué d'en faire usage. Le quas, dont j'ai parlé plus haut, qui fait la principale boisson du peuple Russe, en approche, excepté qu'on ne leboit pas dans l'état de fermentation: c'est une petite biere aigre, a laquelle, au lieu de houblon, on ajoute de l'herbe de menthe sauvage.\n\nLe même traitement me réussit au printemps de 1772 et 1773, ou j'éus comme toutes les autres années des scorbutiques avec les mêmes symptomes, quoique pas en si grand nombre qu'en 1771 où il y en avoit pres de soixante, parce que la maison\nwholesome, and because the foil had been again considerably raised.\n\nI shall not propose carrying out vegetables on a voyage for the whole crew, because that, in order to preserve them, they must be kept in dry sand, which (if not altogether impracticable) would be extremely difficult in such large quantities, not to add that even then a great part would be spoilt: but might it not be possible to provide a certain quantity of carrots, turnips, &c. and stow them in sand, in a part of the ship where they might not be exposed to get damp or wet, whence they might be given in such cases as the sour-kraut alone would be found insufficient to cure? for I am apt to think that these greens, joined to an infusion of malt, would soon get the better of the disorders.\n\nBut\n\nmaison ayant séché entièrement devint fort saine, et que l'emplacement fut encore rehaussé de beaucoup.\n\nJe ne proposerai pas d'embarquer sur les vaisseaux des vegetaux frais pour tout l'équipage, parce que pour les conserver il faut les tenir dans du sable sec, ce qui feroit, si non impossible, du moins tres difficile pour une si grande quantité; et que même malgré ces precautions plusieurs se gateroient. Mais ne pourroit on pas en se servant de la sauer-kraut pour la conservation de la santé des marins, mettre aussi une certaine quantité, autant que la grandeur des bâtiments et les autres circonstances le permettroient, de radis, de carottes, de navets, et d'oignons frais dans du sable bien sec à l'endroit du navire ou l'eau et l'humidité ne pourroient pas pénétrer, afin de donner quelquesuns de ces légumes a ceux, qui malgré l'usage de la sauer-kraut prendoient le scorbut? Je crois que ces légumes et l'infusion de la dreche les rétabliroient bientôt.\nBut if this cannot be so well done at sea, it is obvious, that the cure of the scorbutic persons will be much accelerated, if raw greens are given them as soon as they come on shore; a mode which will have the additional advantage of shortening the stations ships are obliged to make, for the recruiting their sick. Nature will of herself dispose the sick to make use of this remedy, especially as I have observed that the stomach is never affected by it.\n\nIn Austria, as well as several other parts of Germany, the people eat four turnips, which are prepared in the same manner as the four-kraut; that is, after having been chopped thin, salt is put to them, and they are left to ferment. They are put in tubs, and keep from one year to another. I propose this vegetable as a valuable addition\n\nSi cela n’est pas pratiquable quant aux vaisseaux en mer, il est aisé d’en conclure, que, lorsqu’on met les scorbutiques à terre, on accélérera leur guérison en leur donnant à manger cruds les légumes qu’on trouvera, ce qui, outre l’avantage de guérir cette maladie plus sûrement, abrègera les stations que les navires sont souvent obligés de tenir pour remettre leurs scorbutiques. Il ne fera pas difficile de persuader à ces malades de manger les légumes crus; la nature, notre meilleur guide en tout ce qui concerne notre conservation, les y porte, et j’ai observé que leur estomac ne s’en trouve pas affecté.\n\nEn Autriche, et dans plusieurs autres parties de l’Allemagne, le peuple mange des navets aigres; on les prépare de la même façon que la sauer-kraut; les ayant hachés menus on y met du sel, et on les laisse fermenter. Ils se conservent tout l’hiver, et même d’une année à l’autre, dans des tonneaux. Ce légume est\ntion to the antiscorbutic regimen of sea-faring people. It has nearly the same taste as four-krount, and will, I believe, be found to have the same virtues: and if so, though it should have no other advantage, it will at least vary the diet, which is itself no inconsiderable advantage on a long voyage.\n\nest une addition que je propose à la diéte antiscorbutique des gens de mer; il a presque le même gout que la sauer-kraut, et je crois qu'il aura les mêmes vertus. Si cela est, comme je le pense, ce sera au moins pour chaque de temps en temps de mets, ce qui n'est pas un petit avantage dans un voyage de longue durée.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/106342.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 21, "total-input-tokens": 32192, "total-output-tokens": 8889, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1222, 2], [1222, 2967, 3], [2967, 4660, 4], [4660, 6392, 5], [6392, 8103, 6], [8103, 9824, 7], [9824, 11456, 8], [11456, 13115, 9], [13115, 14747, 10], [14747, 16529, 11], [16529, 18153, 12], [18153, 19749, 13], [19749, 21357, 14], [21357, 22968, 15], [22968, 24589, 16], [24589, 26356, 17], [26356, 28059, 18], [28059, 29800, 19], [29800, 31523, 20], [31523, 32145, 21]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]