[{"id": "cf61f1774e4c2620ceab259f7010782abfcf172c", "text": "THE CHISLEHURST OUTRAGE.\n\nAt Bromley Police-court, Leonard Manktlow, a fisherman, was brought up on a remanded charge of maliciously and feloniously shooting Miss Hilda Wood and Miss Edith Philbrick in a cornfield at Blackbrook Farm, near Chislehurst, on the 3rd ult. The prisoner was brought from Holloway Gaol in custody of two constables. His arrival was witnessed by a large number of people who had assembled outside the court. The Treasury, by whom the prosecution has been taken up, was represented by Detective-inspector Gummer. Mr. St. Bernard Wilson again appeared to defend the accused. The court was filled with spectators. Detective-inspector Gummer said he proposed to call the doctor who was attending the young ladies. Mr. Wilson thought that under the circumstances it would be better for the doctor to be examined at a later stage of the case. The Chairman: If you don't want him examined now. Mr. Wilson: No, sir. There are certain reasons for it. Detective-inspector Gummer said he only proposed to ask the doctor to make a statement as to the present condition of Miss Wood and Miss Philbrick. Mr. Wilson had no objection to that. Dr. Matthews, of Bickley, was called, and stated he had been attending Miss Wood. She would not be able to attend at the court till that day fortnight. Miss Philbrick would not be able to appear for an indefinite period. Remanded.\n\nMiss Philbrick's condition, although gradually improving, is not yet such that the doctors can pronounce her out of danger. The wounds at the back of her head are so severe that the healing process must necessarily be slow, and the fact that a considerable portion of the brain substance has had to be removed renders extra caution essential in the prevention of all cerebral excitement. Meanwhile one of the surgeons in attendance (a relative of Mr. Philbrick) has within the past few days successfully performed the operation of transferring new skin to the nose and face of the patient where the abrasions had left scars which would be likely to prove a permanent disfigurement. The skin for these engraftings now adhering and growing capitably, was taken from the arm of Miss Philbrick's brother.\n\nWhen again brought up at the Bromley Police-court on Monday morning, before the local justices, on a charge of attempting to murder Miss Hilda Wood and Miss Philbrick, the young man Leonard Manktlow stared round the court in a dazed manner. Detective-inspector Gummer said that Dr. Matthews had told him Miss Wood could not positively come until the latter end of next week. A brother of Miss Wood corroborated this statement, and the Bench intimated their intention of setting apart a special day to hear the case. The accused was then remanded until Monday. The Chairman of the Bench stated that he had heard incidentally that complications had arisen in the condition of Miss Philbrick.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810748.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 641, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2875, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]