[{"id": "1f900fc938b569fe2f4485f7d37cb4cecae54ac5", "text": "WILFUL MURDER AT GRAVESEND.\n\nOn Monday afternoon, Mr. Carttar, the coroner for Kent, resumed and concluded an inquiry, which had twice been adjourned, at the Town Hall, High-street, Gravesend, on the body of Elizabeth Hartnell, aged 35, who died from the effects of violence used towards her by a man named Thos. Jury, with whom she cohabited. The painful occurrence has occasioned a very great sensation throughout the town, and the board-room of the hall during the proceedings was much crowded, there being the mayor and several of the magistrates present also. Mr. Horne, barrister, of the Home Circuit, attended to watch the case on the part of the accused. The evidence adduced was of a most voluminous character. The following, however, will be found to contain the whole of the facts. For a considerable time past the deceased and Jury, who possesses much property in the above town, have led a most dissolute life, and resided in Hfield-street. Owing to their debauched habits, and frequent quarrels resulting therefrom, the inhabitants have frequently complained of their conduct, and on several occasions Jury has been brought before the magistrates and severely punished. On the afternoon of last Friday week, they left their residence together; in a four-wheel chaise, for a ride down the London-road; and late in the evening they returned; Jury much intoxicated, and the deceased lying at the bottom of the carriage insensible, apparently from intoxication also. She was removed to her bed, her wearing apparel being disfigured as if from a fall, by a Mrs. Luxford, who bathed her face with vinegar, and left her. Later in the night, between ten and eleven, Jury was heard using most violent epithets to the deceased, such as \"D——n you, I'll murder you,\" and she was heard to reply, \"Don't, don't ill-use me.\" He continued in the same violent strain, and a scuffle then took place, several of the witnesses speaking of a noise that resembled pewter pots being thrown about. On the following morning Saturday, Jury called in a Mrs. Martin to see his wife, whom he said was very ill. She accordingly went into deceased's bedroom, and found her in bed dying, with a severe cut down her forehead. She inquired of him how the deceased received such an injury, and he replied that she had had a fall from a chaise on the previous evening by its overturning at Stone Bridge, two miles and a half from Gravesend. She then recommended a surgeon to be called in, and Mr. Ridge, of Parrock-street, was forthwith sent for, and immediately attended, but the unfortunate woman shortly afterwards died in a strong convulsive fit. The medical gentleman considered that the cause of death arose from the diseased state of the brain, resulting from drink, and the blow on the forehead must have accelerated it. Several witnesses swore most positively that the deceased had not the cut on her forehead when she returned from the ride on Friday evening; and several persons who saw the accident spoken of by Jury, and noticed him and the deceased reseat themselves in the vehicle, perceived no blood on her head or attire. Her wearing apparel, however, was produced, and spots of blood were noticed on the front of the dress, as if they had fallen from the upper part of her person. The coroner at length summed up the whole of the fact, and pointed out the most important features in the evidence for the consideration of the jury, and left them to say whether he (Jury) had caused the deceased's death or not; and, after a lapse of nearly two hours, at half-past ten o'clock at night, they returned a verdict of \"Wilful murder against Thomas Jury.\" The coroner then made out his warrant for the committal of the accused, and in the course of Tuesday morning he was removed to Maidstone gaol, to await his trial at the next assizes. He is a married man, and sixty years of age; his wife and family have, however, long since left him, owing to his abandoned character, and live in much respectability at the west end of the metropolis.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3205317653.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 918, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4029, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]