[{"id": "2edd7ac24caa79c597c1801adde2a7d17b03634a", "text": "THE SHOCKING MURDER IN SUFFOLK.\n\nRE-EXAMINATION OF THE PRISONER.\n\nOn Tuesday the young man Frederick Ernest Page was again brought up at the Shire hall, Ipswich, charged with the murder of Fanny Pleasant Clarke, aged 24, a domestic servant at Brantham, near Ipswich. Prisoner, before his arrest, was a clerk in the employ of Messrs. Lay and Wheeler, wine merchants, Colchester. He maintained a lodgings demeanour.\n\nThe evidence was in the main a repetition of that given at the coroner's inquest. Testimony as to the purchase of the revolver produced at the inquest by prisoner's brother Robert was forthcoming from George Dove, a lad employed at Mr. Boreham the gun-maker's shop at Colchester. He said he knew prisoner very well by sight, but could not swear whether he was the person to whom witness sold on Tuesday, the 10th of August—the day after prisoner had written to deceased asking her to meet him on Sunday evening, August 15—a revolver, case, and box of cartridges. The revolver produced was exactly like that he sold. The cartridges produced were of the same kind as he sold with the revolver. The person who bought them was, he should think, 18 or 19 years old.—George Isom, porter in the employ of Messrs. Lay and Wheeler, wine and spirit merchants, Colchester, prisoner's late employers, said prisoner showed him a six-chambered revolver and case on Saturday morning, August 14, the last day he was at work. In reply to a question from witness as to what he wanted therefor, prisoner said he was in the habit of leaving Manningtree station for his home every Saturday night, and had a goodish bit to walk on a lonely country road, and if any one stopped him the sight of the revolver would frighten him. Witness could not swear to either revolver or case, but they looked just the same as those prisoner showed him.—The inquiry was adjourned.\n\nOn Wednesday prisoner was again brought up, when letters were produced by Superintendent Francis Fisher and Police Inspector William Clarke of the Suffolk constabulary, which were proved by Mr. George Wheeler, of Colchester, to be in the prisoner's handwriting, requesting a meeting with the deceased. George Dove, a lad in the employ of Mr. Boreham, of Colchester, proved the sale of a revolver on the 10th inst., and George Isom, a porter in the same employ as the prisoner, stated that the prisoner showed him a pistol on the day before the murder. Mr. William Hammond, farmer, of Brantham, spoke to hearing a quarrel between two persons near his house on the 8th inst., and to seeing the deceased go by shortly afterwards in the direction of her master's house. This was about nine o'clock in the evening. The prisoner's father said that on the night of the 16th inst. the prisoner came home about nine o'clock rather excited, and, shortly afterwards, followed his brother Robert up to bed. From a communication made by Robert, witness went outside, followed by Mrs. Page, and prisoner was then in the front of the house. After much pressure, prisoner made a statement. Mr. Philbrick objected to the admission of the statement, but, after a lengthened argument, the magistrates decided to admit it. Mr. Page, however, when asked what his son said, was so overcome that he was unable to reply, and Mr. Philbrick, stating that the matter must be investigated before a superior tribunal, asked that the question should not be pressed. Mr. Mills said that, under the circumstances, he had been instructed not to press for the statement. Witness then said that, in consequence of what his son said, he went out on the night of the murder and found blood on the cross road. When he returned, he and his son had some conversation. Mr. Philbrick also objected to this being repeated, and Mr. Mills, after consulting with Major Heigham, declined to press the question. The revolver was produced by the prisoner's brother Robert, who was the next witness, who deposed that when the prisoner gave him the weapon he also made a statement. The witness was not pressed to repeat it. Medical evidence was then called, showing that two bullets had entered the brain of the deceased and caused death. The prisoner was then committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206323884.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 959, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4190, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]