[{"id": "17e33f2ed4bde028ab071dce158cc8a0ae1afe32", "text": "UNUSUAL PERJURY CASE.\n\nMary Ann Powney, of 34, Wilmer-street, South Kensington, appeared at Bow-street police-court, on Friday, to a summons charging her with committing wilful and corrupt perjury at the Hammersmith police-court. It was alleged that the defendant had committed perjury for the purpose of injuring and convicting an innocent person. It appeared that in July, 1880, the daughter of Mr. and Mrs. Dellar, a young girl aged 17, unfortunately became pregnant, and with a view to save her reputation it was arranged that the young lady's confinement should take place at the defendant's house. It however, became necessary to send the young girl to St. George's hospital, where she was confined, but subsequently died. The child lived, and was placed under the defendant's care, and a weekly payment of 5s. per week was charged and paid for some time; and afterwards 4s. per week. A dispute eventually arose as to the possession of the child; the defendant claiming that she was entitled to it in consequence of the mother's alleged express wish that she should bring it up; while Mr. and Mrs. Dellar claimed the right of guardianship as the child's grandparents. Proceedings were afterwards instituted in the Clerkenwell police-court, but the magistrate dismissed the summons. Mrs. Dellar and her niece decided to obtain possession of the child, and in September took it away. The defendant obtained a warrant, and Mrs. Dellar and her niece were arrested and charged at the Hammersmith police-court, when they were remanded without bail and committed for trial. When that charge was preferred, the defendant swore that she was entitled to take care of the child, and that the grandparents had in no way contributed to its support. This was the perjury complained of, and on behalf of the prosecution it was proposed to show that weekly payments had been made. On the occasion of the trial Mrs. Dellar had been acquitted, and in subsequent civil proceedings it had been decided that she was entitled to the custody of the child.—The case was adjourned.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206258472.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 476, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2062, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]