[{"id": "1378326d922a6a8344ee8da9553c8b481e8db5e2", "text": "POLICEMAN'S BREACH OF PROMISE:\n\nAt the Under-sheriff's Court, on Friday, the case of Jones v. Crawford came on for the assessment of damages. The action was brought by Elizabeth Jane Jones, spinster, of 107, Lower Kennington-lane, Lambeth, against William John Crawford, a police-constable, for breach of promise of marriage and seduction.\n\nMr. Bordman said the plaintiff was the daughter of a police-constable, and the defendant was a police-constable of Deptford, and subsequently of the E Division, Lower Kennington-lane. They became acquainted in January, 1892; and in the following May he seduced her, a child being born in January last. She had had a child before. He promised her marriage in May, 1892, but failed to carry out his promise.\n\nPlaintiff bore out the statement of counsel, and added that the wedding was fixed to take place on July 13th, 1892. In cross-examination witness said the first child was affiliated at Lambeth Police-court. She had not been keeping company with Robert Allen, the father of the first child. Defendant had promised her marriage on several occasions, and in the presence of her father and mother.\n\nIn further cross-examination it was elicited that arrangements for the wedding were made, and she herself applied for and got a license in the Brixton-road.\n\nMrs. Annie Jones, wife of a police-constable and mother of the plaintiff, said she first spoke to defendant in January, 1892, at her house. He came down to the kitchen where she was at work. She next saw him two nights later. He did not say anything that evening. Her youngest daughter first made a communication to her in regard to the plaintiff's condition on May 12th.\n\nCounsel then addressed the jury on behalf of his client. He characterised the case as an attorney's action, one that had been \"set up\" for the occasion. He said the case was a conspiracy by the mother, the daughter, and her family to get money out of the young man, who, although a policeman, was a perfect fool. He was a \"green\" man from Oxford. He was gulled into the house for one specific purpose.\n\nDefendant deposed that at first he went to the house of plaintiff's father and courted his daughter with honourable intentions. He found out about her conduct with Allen about three weeks afterwards. He had been to the house about a dozen or more times. He had never been improperly intimate with the plaintiff. He had been chaffed by his brother constables about being seen out with \"Tottie Fay.\" When she found she was enciente she complained to him, and asked him for advice. He told her she was not in trouble through him. Her mother spoke to him about marrying the plaintiff, and offered to defray the expenses, adding that the plaintiff could remain at her house until he could provide a home. He told the mother he could not afford to marry, and that, as he had not got her daughter into trouble, he would not marry her.\n\nIn cross-examination witness stated that he heard of the birth of the child. When he went to the house Mrs. Jones said she had something to show him, and followed up this remark by saying, \"Lizzie has got a son.\" He went upstairs to the bedroom, and the child was shown to him, the sister observing, \"Look, he has got the 'chin-strap mark.'\" (Laughter.)\n\nIn re-examination witness explained that he expressed his disapproval of the remark that the child bore the chin-strap mark. There was no truth in the statement that he made arrangements for the wedding.\n\nThe Under-sheriff summed up, and the jury gave £10 damages.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811765.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 839, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3524, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]