[{"id": "5017edcbd16555ec42ea034767c070b729f526da", "text": "THE OBSTRUCTION IN CHEAPSIDE.\n\nOn Thursday, Jas. Thompson, a mason, of Palace-road, Lambeth, was brought before Mr. Alderman Lusk, at the Mansion-house, on a charge of having obstructed the thoroughfare, opposite Bennett's clock, in Cheapside.\n\nOfficer 448 said that about twelve o'clock on Thursday the defendant was standing in front of Bennett's clock, and that although repeatedly requested to move on he refused to do so, stating that he should wait until a quarter past twelve to see the figures Gog and Magog strike the quarter hour upon the bell. The consequence was that, although the street was not very much crowded at the moment, there was some obstruction caused by the obstinate refusal of the defendant to leave the spot, and this obstruction was rendered somewhat annoying to the public because the front of the Manchester Fire assurance-office, opposite Bennett's clock, was newly painted, and pedestrians ran the risk of having their clothes smeared.\n\nThe prisoner said his reply to the charge was very simple. He was a mason by trade, and had made that day a holiday. He was passing along Cheapside with his wife about ten minutes after twelve o'clock, and having heard and read a good deal about Bennett's clock, and the way Gog and Magog struck the hours and quarter-hours upon the great bell, he thought he would wait until a quarter after twelve to see the figures raise their hammers and strike. The officer came up before he had been standing on the footway more than half a minute, and told him to move on, and he then walked up and down the place rather smartly. This displeased the officer, who took him off to the station-house, and booked him as a public obstructionist.\n\nAlderman Lusk said the streets of London were in general very narrow for the accommodation of the tens of thousands of the population who had to pass through them daily on business. The defendant and everybody else should know that they were not to stand gazing and blocking up the footways. However, as this was the first case of the kind which had been brought before the court, the prisoner would be discharged; but he must bear in mind that his misconduct was not to be repeated.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206223340.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 495, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2185, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]