[{"id": "999f64bb3647b56eac957e9831887fd34ca70f93", "text": "SEDUCTION AND DESERTION.\n\nOn Friday Major Edward Hamilton Finney was summoned to Marylebone police-court, for that he, being the father of two illegitimate children, refused to contribute to their support.—The defendant did not appear.—Mr. Montague Williams, counsel for the complainant, said: Although Major Finney does not appear, it will be necessary to call the complainant; and to prove my case, I think I ought to inform you under what circumstances my unfortunate client became acquainted with the defendant. He is a major in the South Middlesex militia, and I believe at one time held a captain's commission in the line. In September, 1859, Miss Louisa Aldridge, the complainant, who was then only 15 years old, had the misfortune to meet Major Finney, who was with his regiment at Hounslow. After a few weeks' association the major induced the complainant to meet him in London, took her to a house of ill fame, and there seduced her. She had since borne him three children, the eldest of whom was dead. These summonses were taken out with reference to the other two, one born on the 8th May, 1863, and the other in August, 1864. They lived together for some time as man and wife, at different places, under the name of Mr. and Mrs. Hamilton; but in 1863 the defendant told complainant that he had not money enough to live single, and that he was going to be married to a lady of fortune. They continued to live together up to within a day or two of defendant's marriage, which took place in October, 1863; and the defendant continued his connection with the complainant afterwards. Mrs. Finney subsequently instituted proceedings in the Divorce court, charging adultery with Miss Aldridge, and the marriage was dissolved. Major Finney had for some time withdrawn all support from complainant and her two children, and completely deserted her. At one time he gave her 50l. to place her in a shop, but subsequently induced her to sell the same for 35l., and took 30l. for himself. This was a sample of the liberal manner in which this gentleman had acted to a poor girl whom he had seduced at the age of 15, and by whom he had three children. Without further observation, he (the learned counsel) would ask the magistrate to make the usual order of 2s. 6d. a-week for each child.—After hearing the evidence of complainant and some other witnesses in both cases, Mr. Mansfield said he should allow all the costs in his power.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206232847.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 598, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2432, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]