[{"id": "df50dafa3a408d96c6610054dcf19de16f5ced27", "text": "THE CARRIAGE FATALITY IN HYDE PARK.\n\nAt the Board-room, Ebury Bridge, Pimlico, Mr. J. Troutbeck, the Westminster coroner, held an inquiry respecting the death of Miss Patton-Bethune, aged twenty-nine, late of Clayton Priory, Burgess-hill, whose death took place on Saturday afternoon from injuries she received by being thrown from a dog-cart whilst driving in Hyde Park on Friday last. Lieutenant William Constance Paleologus, an officer in the 80th Kent Yeomanry, stated that shortly after three o'clock he and the deceased, together with a groom, were driving tandem in a dog-cart. After passing through St. James's Park they proceeded towards Hyde Park. On going under the archway near Hyde Park-corner the wheeler bounded, and this, he thought, startled the leader. They both commenced to gallop furiously, but all went well until they reached Albert Gate. At this place there was a considerable amount of traffic on the right side and a brougham on the left. Witness endeavoured to steer between them, but the coachman of the brougham pulled in the same direction, and they collided, and both witness and the deceased were thrown to the ground. He was partially stunned by the fall, and on recovering consciousness he saw some bystanders carrying Miss Patton-Bethune away. When the wheeler first became startled the groom got down to see what was the matter, but before he could do anything the horses became unmanageable, and the man was unable to remount. Witness had frequently driven tandem, but he had never driven the wheeler before. William Henry Cole, a porter, who witnessed the accident, stated that the dog-cart collided with a post on the near side before it reached the brougham, and the deceased was thrown up in the air and fell on the ground on her head. Witness picked her up, and immediately conveyed her to St. George's Hospital. The medical evidence showed that death was due to concussion of the brain, and a verdict of accidental death was returned.\n\nLADS' FACTION FIGHTS AT HACKNEY.—At North London Police-court, Henry Elliott, sixteen, stable boy, of Montague-road, Hackney-wick, and William Baker, seventeen, glass-blower, of Plover-street, Hackney-wick, were charged, before Mr. Lane, with disorderly conduct. Inspector Belton, J Division, said that the prisoners were charged with taking part in a street fight which had been pre-arranged between the lads of Hackney-wick and the lads of Clapton Priory, both very rough neighbourhoods. Similar disturbances took place about this time last year in the same neighbourhood, when several persons were seriously injured, one lad being found on the pavement with his skull fractured. On Monday the police found a body of lads armed with old Crimean bayonets and sticks going to meet the Priory lads. They were dispersed, and the two prisoners, each of whom had a bayonet, were arrested. The prisoners promised not to take part in the fights again, and Mr. Lane ordered each to find a surety in £5 to keep the peace for six months, or to undergo seven days' imprisonment in default.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812911.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 710, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3058, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]