[{"id": "a9069dd788f932c5cb8e6ddd46ab0e77ec2ed63d", "text": "COMMISSION OF LUNACY ON MR. B. CROWTHER, COMICIAN.\n\nOn Monday an inquisition under a writ de lunatico inquirendo was taken at the Bridge House Hotel, London Bridge, before Mr. Commissioner Winslow, and fifteen special jurors, relative to the state of mind of Benjamin Crowther, aged twenty-nine, the well-known comedian and equestrian, formerly of Astley's, who, a few months since, was married to Miss Vincent, of the Victoria Theatre, and a few days after became in what now appears to be a hopeless state of insanity.\n\nThe commission had issued under the petition of Mr. Charles Crowther, brother of the unfortunate gentleman. In its support appeared Mr. Roberts as counsel, instructed by Mr. C. V. Lewis, of Bedford-row, and Mr. Petersdorff to watch the proceedings on behalf of Mrs. Crowther (Miss Vincent).\n\nPrior to the commencement of the proceedings the unhappy subject of the inquiry was present; but from his violent manners and language, calling for pistols and the aid of the War-office \"to batter down the house, and destroy his murderous enemies,\" &c., it was found necessary to induce him to retire.\n\nMr. Roberts, in stating the case to the jury, gave a history of Mr. Crowther's theatrical career at Astley's, up to the latter end of 1851, when he went to the Victoria Theatre, which belonged to Miss Vincent, and on the 14th of February following he was married to Miss Vincent, at Lambeth Church. He was then in full health. After the ceremony they proceeded to Brighton, where they remained but a few days, when Mr. Crowther was attacked with fever, and became deranged; and although it was at first thought he would recover, it had been found necessary to send him to Mr. Baker's Asylum, Camberwell, and subsequently to the White House Asylum, Bethnal-green, where he remained for nearly five months, but was now at home with his father, at 28, Stangate; his mind, however, continued in the same deranged state.\n\nMr. Charles Crowther, brother of the alleged lunatic, said that the latter and himself had always lived together at their father's house. His brother was at Astley's fifteen or sixteen years. He took an engagement at the Victoria Theatre in November, 1851. He held a good position at Astley's. When he went to the Victoria in 1851 he had a \"starring engagement,\" with his own horses. He was married on the 14th February, 1852, to Eliza Ann Vincent, sole lessee of the Victoria Theatre. He was perfectly sane at that time, and had always been so previously. Miss Vincent's daughter, Beatrice, was present at the marriage. On the 16th February he received a letter from his brother (produced), indicating that he was in his previous sound state of mind. On the following Friday witness saw him at his house in Barkham-terrace, opposite Bethlem. He was looking melancholy and wild, shook his head, would not answer, and after looking about as though he was afraid of something, said somebody was listening in the next room, and told witness to go. His wife said she had been obliged to buy a new bedstead, at the expense of £10, because he said he was afraid to sleep on the same bedstead as Osbaldiston, for fear he should be murdered. She said he was taken ill in the middle of the night of Tuesday, when he jumped out of bed, rushed to the washstand, and threw cold water over his head. Up to that time he had betrayed no symptom of insanity, and had been perfectly happy. At present he fancied some one is murdering his father, mother, and the rest of the family.\n\nCross-examined by Mr. Petersdorff: Benjamin Crowther had two or three falls, but never to affect his head.\n\nMedical and other evidence as to the unfortunate man's insanity having been adduced, the jury returned an unanimous verdict—\"That Benjamin Crowther is now of unsound mind, incapable of managing himself and his affairs, and has been so since the 18th February, 1852.\"\n\nThe inquiry excited the utmost interest, and many theatrical and private friends of the lunatic and family were present.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3202413238.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 957, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3996, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]