[{"id": "7547a80ffb3449ac48b8ab1f93f236aebcc82c41", "text": "THEATRES v. MUSIC-HALLS.\n\nMr. Morris Robert Syers, proprietor of the Oxford Music-hall, was summoned to Marlborough-street police-court on Saturday for performing stage plays. There were eight summonses against the defendant.—Mr. Montague Williams said the summonses he proceeded upon were for performing portions of two operas—namely, Matamietto and The Bohemian Girl. The characters were played in costume and on a stage. Mr. R. F. Young, an actor, late of the Charing-cross theatre, said he witnessed the performances, and he considered the pieces stage plays. In reply to a question, he admitted that had the performances been in plain clothes, he should not have considered them stage plays.—Mr. Allen addressed the Court for the defence.—Mr. Knox said as the pieces had been withdrawn it was not his wish to inflict a series of penalties. Let there be a full penalty of 20l. for each of the two summonses then before him, and in the other summonses merely the costs.—The defendant intimated his intention of appealing against the decision.\n\nGREAT FIRE IN THE CURTAIN-ROAD. — Shortly before daybreak on Saturday morning a fire involving a serious destruction of property was discovered by a police-constable of the G division, in extensive premises belonging to Messrs. Greenway and Sons, sawmills proprietors, and mahogany and veneer merchants, situate in the Curtain-road, Shoreditch. It appears that the flames commenced in the principal mill. At the extreme end of this building was a smaller one, used as the boiler and engine-house. Between the two buildings were stacked in the open yard piles of timber. Such inflammable articles proved powerful auxiliaries in feeding the flames, and in less than seven minutes after the discovery immense sheets of fire rolled high into the air. This caused a scene of a terrible character, the surrounding houses being severally occupied by poor families, who rushed out in their nightclothes, with their children in arms. The firemen worked with great vigour for some hours before the conflagration could be subdued, and not before the extensive mills, the machinery, the stock of goods in the place, the boiler-houses and engine-house were burned out, and the valuable stock in the open yard, as well as the private dwelling of the firm, were seriously damaged by fire, water, and removal.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206237557.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 533, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2340, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]