[{"id": "429da7dd660e3fbfcd7dcca143767c549d559c41", "text": "SINGULAR CASE OF CHILD DETENTION.\n\nMr. Ross was engaged the greater part of a day at Clarkenwell Police-court, in hearing an extraordinary case of alleged child detention. John Barry O'Callaghan, forty-five, an engineer and surveyor, of 39, Paroles-road, Highgate, and Sarah Ann Bolten, forty-four, described as a \"chaperone,\" of 55, Bernard-street, Russell-square, were charged with being concerned together in unlawfully taking away a child, aged eight months, named Phyllis Massey Baker, from the custody of its parent, Mr. Godfrey Baker. Mr. Louis Nutting, of Lincoln Inn-fields, called by Mr. Godfrey Baker, stated he had dined with Bolten called at his place since July 17th, and had an interview with him. She admitted to him that she had no right to detain the child, but said Mr. Baker, who had agreed to pay her £4 a week for its keep and for defraying the expenses of a French nurse, owed her a lot of money. Cross-examined, the witness said he believed the two defendants had conspired together to keep the child after a demand had been made for it to be given up, in order to extort money. He was not aware that Mr. Baker was very much in debt. He understood that he was in debt, but had means to meet his liabilities. Mr. Baker had property in Ireland, and negotiations were proceeding for its sale. Mr. Godfrey Hugh Massey Baker, an independent gentleman, of 29, South Norwood-hill, said he first became acquainted with the female defendant through the recommendation of Miss Baker. Miss Baker was his cousin, and was the mother of the child. The engagement took place at Acacia-road, St. John's-wood. He rented this house, Mrs. Bolten taking it in her own name. Mrs. Bolten then carried on a business as hair-dresser, &c., in a shop in New Bond-street. Witness, who was twenty-four years of age, went, after the birth of the child, to Honfleur with Miss Baker, and Mrs. Bolten accompanied them. At the end of April last they left Honfleur for the Isle of Man, and there he made an arrangement to pay Mrs. Bolten £4 a week. This included the engagement of Françoise Tacc, a French nurse. He had paid the money up to July 8th. About that time he intended to go with Miss Baker to California to start life afresh, and he told Mrs. Bolten that if she accompanied them she would be paid £200 a year. Prior to this he had found her in food, lodgings and clothes. Mrs. Bolten soon afterwards returned to London from the Isle of Man without his knowledge, and placed herself in communication with his solicitor. Since then he and Miss Baker had not been able to regain custody of the child. Cross-examined: He paid £100 for Mrs. Bolten's clothes because she agreed to go to California. Mrs. Bolten lived at Acacia-road for some time and kept his house. Witness supplied her with money for housekeeping. He was not aware that she spent the money that she reaped from her business in keeping up the house. He had known O'Callaghan for some time, and first introduced him to Mrs. Bolten. He had certain communications with O'Callaghan with reference to his (witness's) divorce proceedings. He was not aware that the child had never left 55, Bernard-street. Every time he called he was told that Mrs. Bolten had left. Sergeant Hamilton, E Division, said he was present at a restaurant in Chancery-lane. When Mr. Baker and O'Callaghan had an interview, he heard O'Callaghan, who did not know he was present, say that \"if he began he would upset the whole arrangement.\" Witness had made inquiries as to the whereabouts of the child. He called at Bernard-street, but could get no information. Inspector Wakeford deposed that on July 22nd the police were first communicated with with reference to the case, O'Callaghan when arrested said, \"I know I have done wrong, but there was this justification. Mrs. Bolten called at my house and said she was going to give up the child, and should not see the Bakers any more. There was no way of making the Bakers pay but by detaining the child. I shall not tell you where the child and Madame are without order from the magistrate. Mr. Baker, residing at 55, Bernard-street, said he had an arrangement with Mr. O'Callaghan with reference to his (Mr. Baker's) divorce proceedings. The threat of Mr. O'Callaghan, at the interview in the restaurant in Chancery-lane, to \"upset matters\" referred to that arrangement. Mr. Rose committed the accused for trial at the Central Criminal Court, allowing bail. Mr. Geoghegan asked that his client should have the custody of the child. Mr. Rose said he had no power to order that the child should be given up. He believed the police had the custody of it. Mr. Terrell: If the child is given up we shall not see the prosecutor again. Mr. Geoghegan: We are bound over to prosecute in the sum of £40.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810690.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1178, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4776, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]