[{"id": "7a3baeb1baf2446aadca0ed5ae00480be08324a9", "text": "REMARKABLE CHARGE OF INTIMIDATION.\n\nOn Thursday, August John, 29, described as a professor of music, and Emmeline John, 25, his wife, Germans, were charged at the Old Bailey with feloniously extorting a valuable security from Sigismund Diespecker, by threats and menaces.\n\nThe prosecutor, who was the President of a German Relief association, had arranged for giving assistance to the female prisoner, and learning from her that she had some dogs for sale, he called by arrangement at a house in Bloomsbury on the 19th of July. He was shown into a room, where he found the female prisoner, and several dogs were in the room, and she pointed out to the prosecutor a black dog which she said was the one she had referred to, and which she wished him to accept. The prosecutor did not at the moment observe that the dress of the woman was in rather a disordered state, but his attention was drawn to the fact by what subsequently occurred. While he was looking at the dog, the woman went to the door, and this appeared to have been a preconcerted signal, for the instant she did so, the male prisoner and another man, not in custody, rushed in a most excited manner into the room, and the male prisoner exclaimed to the prosecutor, \"What are you doing to my wife?\" The prosecutor at once saw that he had been entrapped, and the two men then took away from him his overcoat, which he was carrying on his arm, and his hat and umbrella, and the male prisoner then told the prosecutor that he must do what they required, or murder would be committed. The prosecutor was then asked what money he had about him, and he said he had only £2., and they replied that that was not sufficient. The prosecutor was, of course, very much alarmed at what was taking place, and under the threats that were uttered he was induced to sign a paper to the effect that he would pay the prisoners 100£. on the 27th July. The prisoners then demanded the £2., and the prosecutor gave them the money. After this, the prosecutor was allowed to leave, and he gave information to the police and the prisoners were taken into custody.\n\nThe male prisoner in his defence told a long story about suspecting his wife, and believing that she was doing something wrong, from her being in possession of more money than she ought to have been. He said that he pretended to go on a long journey, and went home suddenly and found his room locked, and when it was opened by his wife he saw the prosecutor with his clothes in a disordered state, and the bed also appeared to have been disturbed. He said that at first he thought of doing some violence to the prosecutor, but he was afraid of the consequences, and he declared that the prosecutor gave him the document in question of his own free will, but he never intended to make use of it.\n\nMr. Williams addressed the jury on behalf of the female prisoner, and he asked for her acquittal, on the ground that what she did was done under the coercion and while she was under the control of the male prisoner, who was her husband.\n\nThe jury found both prisoners \"Guilty,\" and the man was sentenced to 18 months', and the woman to six months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206323865.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 724, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3159, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]