[{"id": "c6759907b8fe6eddc35a1c759c1e3fc2b3a4a6ff", "text": "A PAINFUL CASE.\n\nAn inquest was held on Monday, by Mr. Swan, at Beeston, Notts, touching the death of a girl, named Eliza Bollends, servant to the Misses Cheetham, at Chilwell, which took place under very painful circumstances. According to the evidence of Ellen Rillman, fellow-servant of the deceased, she missed the latter, who slept with her, early on Sunday morning, and, as she did not come back to bed, witness went down stairs and found her sitting in the kitchen corner. After some conversation she admitted that she had given birth to a child. A Mrs. Beeton was sent for and took the child from her, and told her to go to bed, but she refused. The Misses Cheetham were informed of the circumstance, and they appeared very much annoyed. When they heard that the deceased wished to leave, they said it would be best she should do so. Witness never knew that she was in the family way; she never mentioned the matter, but on Saturday morning said that a young man residing at Deeping was the father of her child. No doctor was sent for before she left the house. The Misses Cheetham remained in bed until she had been removed; they wished the best attention to be paid to her. Mrs. Beeton is a midwife, and it was thought she knew best what should be done. It was between seven and eight o'clock when deceased was removed from Chilwell. Ellen Beeton, widow, of Chilwell, corroborated a great portion of the previous witness's evidence, and added that she considered deceased to be in a fit and secure state to be removed. It was deceased's particular wish to be taken to Beeston. Deceased had given birth to a male child, which appeared to be full-grown, and was still alive. Ultimately she was removed to a Mrs. Cox's, at Beeston, where she had expressed a wish to go, and a surgeon was sent for. Mr. J. Butler, who saw the deceased at Mrs. Cox's, deposed to the exhausted state in which he found her. He administered stimulating medicines, but she ultimately died from prostration, loss of blood, and exposure during her removal from Chilwell to Beeston. If she had had proper attention she might have recovered. The coroner, in summing up, said it was quite clear that deceased had been sacrificed for want of proper attention. The persons to whom she was taken were poor, and Mr. Butler was therefore not called in until the last moment, when he could do nothing for her. After considerable discussion the jury agreed to the following verdict:—“That deceased has died from exhaustion after being delivered of a child, and from exposure to cold on being removed from Chilwell to Beeston, and for want of proper medical assistance.”", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222306.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 632, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2641, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]