[{"id": "d45191f7def4ba3128343475af11a5f43d2f6bf3", "text": "AN UNDESIRABLE CUSTOMER.\n\nFrederick Percy Sadler, a fish salesman, employed at Billingsgate, and living at 20, Chandos-road, Upton-lane, Forest-gate, was summoned, at the West Ham Police-court, before Mr. Gillespie, to answer a charge of being disorderly and refusing to quit the Forest Glen, Danes-road, Forest-gate, when requested to do so by the landlord, Mr. Paul Maurice Upright, on the 1st inst. He was also summoned for using abusive language towards the landlord at the same time and place. Mr. Maitland conducted the prosecution. From the evidence it appeared that between ten and eleven o'clock on Monday evening (Bank Holiday) the defendant interfered and complained because Mr. Upright ejected two disorderly customers. When the landlord told him that he was fully able to carry on his business, and did not wish him to interfere, the defendant called him \"A dirty dog,\" and went on to threaten him, saying, \"I'll mark you, and make it so hot for you in the place that you will have to get out.\" He was repeatedly requested to leave the house but refused. The police were called on two occasions, but when they left the defendant returned to the house and continued his conduct until nearly closing time. In cross-examination the landlord denied having an argument with the defendant, nor did he make use of any insulting remarks towards or in respect of the customers then in the house. Three witnesses—in addition to Mr. Upright—bore out the evidence for the prosecution. The defendant called another fish salesman, named Charles Pooley, of Skelton-road, Forest-gate, on his behalf, but the witness did not deny that the defendant might have been requested to leave the house. He admitted hearing defendant say something about the prosecutor and his name. The defendant also admitted that he said to the landlord, \"If your name's Upright your actions are not,\" and when he turned his back to him he said, \"Very well, I'll speak to your back. It's perhaps as good as your face to talk to.\" He denied having refused to leave the house or having made use of any abusive language. After a somewhat long hearing the magistrate said he had no doubt the defendant was requested to leave the house, and that he refused to do so. For that he ordered him to pay a fine of 20s. and 13s. costs, with the alternative of fourteen days' imprisonment. He was removed, but before the court rose the money was paid by his friend whom he had called as a witness.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810695.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 580, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2457, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]