[{"id": "524ed4cf9f399bcbf0c83ef0755bbffbff739287", "text": "THE STRAND ROBBERY.\n\nOn Friday, Jacob Castleberg and Reuben Hart were brought up for re-examination, at Bow-street, on suspicion of being concerned in the extensive robbery of watches from the premises of Mr. Jones, 838, Strand, on the 9th of October last.—Harris Rubenstone, a German, who could not speak English, but gave his evidence through an interpreter, said, I know the prisoner Castleberg, and have worked for him in his shop, at 6, Newcastle-street, Whitechapel. He is a watchmaker. I also know the prisoner Hart. I remember Hart’s coming to the shop on Monday or Tuesday, last week, and bringing four silver watches to me, the same as are now produced, in appearance. I did not open or examine the watches. The prisoners had some conversation together, but they spoke in English, and I did not understand what they said.—The evidence against Castleberg was then resumed.—James Harley, a watch-plate engraver, living in Backchurch-lane, Whitechapel, said he had known Castleberg about three months, during which time he had engraved names upon about twenty watch plates for him. He usually brought witness the plates, blank, and waited while the names were engraved. On looking at the watches produced, he identified his own work upon three of them. He knew nothing of the fourth watch, upon which the alleged alterations had taken place. One of the watches produced is a lever, and it appears to have two names engraved upon it, which is very unusual.—Mr. Jardine thought, as there must be another remand, that it would be better to defer the remaining evidence until the next examination. Hart might enter into his own recognisances in £20l., and find two sureties in £10l. each; but he could not consent to admit Castleberg to bail. The case was then remanded for another week.\n\nFATAL ACCIDENT ON THE RIVER.\n\nOn Friday afternoon, Mr. W. Baker held an inquest at the Marlborough Head tavern, Fox’s-lane, High-street, Shadwell, on view of the body of Apsley Hopkins, aged forty-five years, who lost his life under the following circumstances.—The deceased was a lighterman, and was usually employed in navigating barges and other craft through the pool to the upper part of the river. On Saturday evening, the 16th ult., the deceased and other men were in charge of a vessel off Picke Herring-stairs, Horsleydown, and while in the act of turning the windlass the handle suddenly came off, and struck the deceased on the head, which knocked him overboard. Search was made for the body, which was not recovered until Wednesday last, when a coulwhipper, named Burney, found the deceased floating in the river, opposite Bell-wharf, Shadwell. There was a large wound on the forehead, and the body was much decomposed. Two shillings in silver, and a few coppers, were found in his pockets, together with a letter, whereby the identity of the deceased was distinctly proved.—Mr. Alexander Henry, the surgeon of Wapping-wall, said that the deceased had an incised wound over the right eye, but the body was in such a sad state that he could not speak with any certainty as the precise cause of death.—Mr. Deyearall, the beadle, stated that the vessel had sailed for Harwich with the man who saw the accident, and would not return for several weeks.—The jury, in the absence of legal testimony, returned an open verdict of “Found dead in the river.”", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201441.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 803, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3351, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]