[{"id": "63ad151981ba2748c314576b7da684573408f0bd", "text": "ASSAULT BY VOLUNTEERS.\n\nOn Wednesday, George Acton, 20, bricklayer, was indicted at the Middlesex sessions for assaulting and maliciously wounding Arthur Bartley, and inflicting bodily harm.\n\nBartley and Henry Tovey, gunners of the 9th battery of the 1st City of London Artillery volunteers, were indicted for assaulting Acton. The indictment against Acton was first proceeded with. He pleaded \"Not guilty.\"—The evidence given by Bartley was to the effect that on the night of the 7th of November, he, in company with Tovey, attended a \"sing-song\" at the Havelock public-house, Hammersmith. In consequence of one of the singers having been unfavourably received, he remonstrated, and the result was that Charles Toy, the chairman, threatened to turn him out. In order to avoid any trouble, he and Mr. Tovey, his friend, walked out of the place. On their getting out the chairman followed him and wanted to fight him. He and Tovey then went home, as they lived in the same house, and were both members of the 1st City of London Volunteers. On arriving at home he and Tovey dressed themselves in their uniforms and put on their swords, subsequently passing the Havelock public-house. They had only proceeded along the street a short distance when a crowd of roughs surrounded them, and Toy (the chairman of the concert) made a blow at him. In retaliation he knocked Toy down, and then he and Tovey made their way in the direction of home. The crowd followed and knocked him down, and whilst he was on the ground Acton kicked him on the left side of the face and on the left leg. Tovey was also knocked down by some other members of the gang. Seeing themselves surrounded by a gang of desperate roughs he and Tovey took the advice of some soldiers and ran off. Just before reaching their door the prisoner and about six or seven roughs overtook them, and Tovey being thrown down, Acton made an attempt to steal his sword bayonet. Witness was also assaulted by the prisoner, and in self-defence he drew his sword bayonet, with which he struck the prisoner on the head, cutting it. The others then got out of reach, and he and Tovey succeeded in escaping from their violence.—The jury \"Acquitted\" the prisoner.\n\nHenry Tovey, 28, and Arthur Bartley were then placed on their trial, charged with having maliciously wounded George Acton, the quondam prisoner.—It was shown by Acton that on the night stated he was at the Havelock public-house attending the concert, where he saw Bartley and Tovey. Bartley was uproarious, and was turned out of the hall. Subsequently he saw him and Tovey dressed in uniform. Hearing cries of \"Murder,\" he proceeded in the direction of Redan-street, when he was attacked by both of the defendants with their swords, serious wounds being inflicted on his head.—Confirmatory evidence of this view of the case was given; and in the result the jury \"Acquitted\" Tovey, and \"Convicted\" Bartley.—In passing sentence, Mr. Fletcher said that the court saw with regret a hard-working man like him in the dock. The court considered the offence a very serious matter from a public point of view. There were many volunteers entrusted with arms, and they must be taught that in private and civil matters they must not use the arms entrusted to them, as, if they did, they must take the consequences.—Sentence was passed of six months' hard labour.—Mr. Fletcher instructed Inspector Martin, M division, on duty in court, to report the subject to the colonel of the regiment.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206261140.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 556, "total-output-tokens": 835, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3483, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]