[{"id": "8792cfa516510462548cf2adb35e295f59cae2e8", "text": "A FRAUDULENT INSURANCE AGENT.\n\nAt the Thames police-court on Tuesday, George William Thompson, aged twenty-seven years, described as an insurance agent, of No. 82, Weston Street, Pimlico, was brought up on remand, for the fourth time, charged with obtaining various sums of money from upwards of 100 persons, by falsely representing himself as the agent of the Sun, the Phoenix, the Norwich Union, the North British and Mercantile, the Royal, the British Equitable, and other fire and life insurance offices; with also obtaining other sums of money by false pretences; and with being the agent of the \"National Provincial Plate Glass,\" and the London General Plate Glass Insurance Companies. He was also charged with withdrawing by false pretences, two bibles, valued at 2s. each, and an edition of Bunyan's \"Pilgrim's Progress,\" worth 20s., more, from Mr. Cameron, a bookseller, in Paternoster-row.\n\nThe history of the prisoner, as unravelled by Mr. Walter Kerrissay, an inspector of the K division, is a very extraordinary one. He was formerly clerk to a solicitor, next to him a vocalistic, and subsequently the partner of Mr. Henman, a merchant in the city. He was convicted at the Central Criminal court in 1863 for \"feloniously embezzling 32s., the moneys of his employer, and he was sentenced to four months' imprisonment.\" This light sentence was owing to his appearing to be very ill and fainting in the dock; and he was looked upon as an \"unfortunate young man.\" He subsequently obtained employment as an agent to the British Equitable insurance office, and was in the receipt of good wages until November last, when it was discovered that he was a defaulter again, and was dismissed. Before and after that time he carried on a most impudent and astounding fraud, by representing that he was the agent of several insurance offices, and that he was authorised to insure life, property, and plate-glass in the Sun, the Phoenix, the Royal, the Norwich Union, and sundry other offices, and money flowed into his pockets very plentifully. He always had receipts, and promised the policies of insurance in advance. They varied from 5s. a month; but they were never forthcoming. The lowest sum he ever received was 6s., and the highest £2.1s. The larger amount he received from Mr. Axford, of Neckington-town, Bermondsey, on the representation that he would effect an insurance on his life. He received two sums of 5s. and 1s., of Mr. Wibrow, of Salisbury-place, Stepney, to insure his goods for £100, with the British and Mercantile General, and his plate-glass in the National Provincial. He became quite eloquent whenever he recommended his dupes to insure their lives or their property. He said they owed a duty to their wives, their children, and to society to do so. After a long and successful career of fraud he was arrested on the 5th February by Inspector Kerrissay in the Bow-road. Kerrissay, on meeting him, said, \"Hallo, Thompson, is that you? The very man I have been looking all over for a long time.\" The prisoner answered that he was well, and knew nothing about anything. Inspector Kerrissay said, \"No, he has nothing to do with it. You must go along with me.\" The prisoner said, \"For Heaven's sake, let me go, for the sake of my wife and two children. All the money I received I intended to pay back again.\" On the third investigation, as it was about to commence, the prisoner appeared to be very ill; he groaned heavily, and fell in the dock. Mr. Richard Talbot, a surgeon, examined him, and pronounced the prisoner to be not worth a year's purchase. Although the magistrate was assured that the prisoner's illness was assumed, and that he had acted a somewhat similar part on his trial in 1863, Mr. Humphreys would not proceed in the face of such alarming symptoms, and the prisoner has been twice remanded since. Mr. Humphreys selected ten cases in which the prisoner had represented himself as the agent of the Sun, Phoenix, Royal, and North British and Mercantile insurance offices, and of the National Provincial. From persons under the impression of insuring their goods and stock in trade from loss by fire. \"Gentlemen\" from the different offices said the prisoner was not an agent for any of them, and that he had no authority to effect insurances, or receive money on their behalf. Mr. Humphreys explained that although the insurance offices had not suffered any pecuniary loss by the prisoner's misrepresentations, they used the same prosecution for the protection of the public. The life of the prisoner was not ceased, although the most formidable, the prisoner having in several instances retained the services of medical gentlemen to examine persons before they paid their premiums, and give them certificates of health. The prisoner received subscriptions for the purpose of presenting a testimonial to a dissenting minister, and he put the donations into his own pocket. Other cases of fraud were mentioned by Mr. Kerrissay, who said the prisoner's victims were in every rank of life. He was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206227018.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 1169, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5052, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]