[{"id": "5cc7e59981a845bf69064982f7a049d32a48f7b2", "text": "EXTENSIVE ROBBERY BY BOYS.\n\nOn Thursday, Alfred Harris and Joseph Stanfield, a couple of lads in the employ of Messrs. Smith and Co., whip makers, of Beech-street, Barbican, were charged, at the Guildhall police-court, with robbing their employers of goods to the value of nearly 100l., and Joseph Taylor was charged with feloniously receiving the property knowing it to have been stolen.\n\nThe detective officers Bull and Baker stated that they were in Beech-street, Barbican, about one o'clock in the day, on the 30th July, when they saw the prisoners leaving the prosecutor's premises, and they followed them to Golden lane, and then stopped them. On Stanfield, Baker found forty-two German silver whip mounts, and on Harris, Bull found twenty-four similar whip mounts. Baker then went to 54, Coppice-row, Clerkenwell, where he found Taylor, who had formerly been in the prosecutor's service. Taylor admitted having bought a quantity of goods of Stanfield, and said he had sold a portion of them to a Mr. Schomberg, of the Southwark-bridge-road. At Taylor's house, Baker found fifteen buck whistles, six stag horn hooks, five pig hooks, twenty-six small buck hooks, and nine sets of walking stick mounts. He also said he had bought two or three lots of buck hooks for 2s. or 3s. Some of the prosecutor's property was found at Schomberg's.\n\nWhen Bull accused Harris of robbing his masters he said he had been led into it by Stanfield and Taylor.\n\nWilliam Shrosbree, a workman in Messrs. Smith's employ, said he saw Stanfield come out of the stock-room about three months ago with some whip mounts, which, he said, he was going to take to Taylor. Witness tried to persuade him to put them back, and on the following morning he said he had taken them to Taylor. Witness did not tell his masters then, because he thought Stanfield would not do it again.\n\nMr. Schomberg said he paid Taylor at the rate of 7s. per dozen for the buckhorn whistles and hooks, and 8s. per dozen for the mounts. Taylor told him he brought them from Birmingham.\n\nMr. Smith identified the articles produced as his property, and further said that on the morning of the 30th July he was secreted on his premises, and from his place of concealment saw Stanfield force open a door leading to the warehouse. The same prisoner then filled his pockets with goods selected from different drawers, and other goods he hid in a convenient place for his next visit. That was about eight o'clock in the morning, and about twelve Harris and Stanfield entered the warehouse together, and after helping themselves to the property afterwards found on them, left the warehouse. The value of the buckhorn whistles and mounts was 14s. per dozen.—The prisoners were all committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206211822.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 660, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2742, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]