[{"id": "8e1cb3b9ce016fecd8ce9dfcce4466d927e02b68", "text": "ROMANTIC STORY OF A STOLEN CHILD.\n\nA young woman, aged twenty, who gave the name of Florence Davis, and stated she came from Torquay, was placed in the dock, before Mr. Sheil, at the Westminster Police-court, on Monday, charged with kidnapping a girl named Kate Rorke, aged four years, and with robbing her of a pair of earrings. The prisoner was further charged with attempting to commit suicide in the police cell. The child, who was in court, was flaxen-haired, and bore some resemblance to the prisoner. The mother, the wife of a coal porter, living at 9, Carpenter-street, Westminster, on Thursday afternoon allowed the little girl out to play with other children. They went to St. John's Recreation Ground, where it was alleged the prisoner decoyed the little one away. Her companions were found on a seat, having been told to wait there till Katie came back. The parents, greatly distressed, communicated with the police; but nothing was heard of the stolen child till Saturday night. Then a constable of the S Division, proceeding along Provost-road, Hampstead, noticed that the kitchen window of an empty house was slightly open. Gaining admission, he discovered the prisoner, apparently asleep, on the floor with a little girl. The accused said she was destitute, and at the police-station she told Inspector Bill such a precise and circumstantial story that she was believed and sent with the child as poor wayfarers to Hampstead Workhouse. She said she ran away from home at Torquay nearly five years ago with a young gentleman named Graham, who promised her marriage. On her arrival in London she lived with Graham, who deserted her, shortly after her baby was born. Katie's birthday, she declared was on the 4th February. After she had gone to the workhouse the Inspector made some inquiries, and learning that a girl had been stolen from Westminster, he communicated with the police of the district. The result was the father of the child went to the workhouse and identified her. The girl, in the presence of the prisoner, repeatedly said, \"This lady took my earrings,\" and she made no answer to the accusation. On Sunday afternoon, in the police cell, she tried to take her life by tying a portion of an apron tightly round her neck, and then completely covering herself with a rug. Mr. Sheil remanded her, and there was some hissing from the public as she was removed from the dock.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812234.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 552, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2400, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]