[{"id": "cd98acf466f40c67a15d50b94c0cb73843a113bb", "text": "DETERMINED SUICIDE OF A VOLUNTEER.\n\nOn Tuesday Dr. F. S. Langham held an inquest at the St. James's workhouse, touching the death of Mr. Frederick Henry Lawton, a member of the 14th Middlesex volunteer corps, who shot himself in the mouth on Monday night with his rifle.\n\nMrs. Emma Lawton said she was the wife of the deceased, and lived at 38, Great Windmill-street. She was not at home when the circumstance occurred. She left home about eight o'clock in the evening. Her husband was out then. He had been very irregular in his habits in consequence of drink, and they had not spoken for nearly a fortnight. She had previously prevented him destroying himself. He was a volunteer, and attempted to shoot himself with his rifle. He belonged to the 14th Middlesex. She returned home about twenty minutes past one, and went up to her room, where she found him lying on the floor with the rifle across his legs. He was dressed. She called the landlady.\n\nMrs. Jane Crow said she resided in the same house as the deceased and his wife, they being her lodgers. She had been at home all the evening, but had not heard the discharge of firearms. Mrs. Lawton called her up, and witness said, \"Perhaps he is only asleep,\" but Mrs. Lawton said, \"No; he is dead, for his face is cold.\" Witness went up with the other lodgers, and one of them opened the room door and then slammed it to, and they called the police. Dr. Harris came in about five minutes. Had heard from the wife that he had threatened to destroy himself. They lived very happily together except when he was a little in liquor. Believed that he was a little jealous when he had taken a drop to drink. Mrs. Lawton had been engaged at the Alhambra, and was in the habit of being out late. During the last week she had left that situation, and had been home early every evening.\n\nAlexander Thompson, 175 C, said that in consequence of hearing screaming he went to the door of 38, Windmill-street, and knocked. He was admitted, and went to the front room second floor, when he saw the deceased lying with his feet towards the fireplace and his head towards the door. His rifle was lying away from him. A ribbon was attached to the trigger of the rifle. He did not know if the deceased had his boots on. Did not examine the rifle to see if it had recently been discharged. He went off at once and reported it at the station.\n\nThe coroner then summed up, and remarked on the extraordinary occurrence of Mrs. Crow not hearing the report of the gun, when\n\nOne of the jury said, that if the deceased had only dropped the powder in loosely and not rammed the ball home tight, the noise would not be much more than a large pop-gun. Had the ball been rammed home tight it must have gone through his skull.\n\nThe jury returned a verdict that the deceased destroyed himself while in an unsound state of mind.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206223338.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 688, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2847, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]