[{"id": "7d22646c756e8943d6cef988abaa839dd67c831b", "text": "MONETARY REVIEW.\n\nCITY, SATURDAY AFTERNOON.—The feature of the week was Thursday's advance in the Bank rate—from 3 to 4 per cent. Under the influence of realisations caused by this increase, the Stock markets were generally dull. Home railways were specially flat, being affected by the continuance of the dock strike, and Brighton Deferred, Great Northern A, and Sheffield Deferred fell from 1 to 1½ per cent. The rest of the markets were dull, but there was no decline. Yesterday a very moderate business was done, and prices, on the whole, were dull. Home railways, apart from Brighton Deferred, were all lower at the last, the decline ranging from ¼ to ½ per cent. In Foreign Bonds there was no feature beyond a little improvement in Peruvian issues. American railways, after being weak, left off stronger on better prices from New York, and Grand Trunk stocks were a shade higher. To-day business was extremely quiet, the attendance of members being small. The markets, however, were firm for the speculative descriptions, but Consols gave way ½ per cent. to 97½ to 97¾ for both money and the account. In Home railways, Brighton Deferred, North British deferred, and North-Eastern rose ½. South-Eastern deferred ½. Among Foreign bonds, Egyptian Domain advanced ¼, ditto Daira ½, Italian Five per cents. ¼. In American and Canadian railways Louisville improved ½.\n\nDuring the week ending Wednesday night there was an efflux of 315,000l. in gold from the Bank of England. The sum of 50,000l. in sovereigns was withdrawn from the Bank for Egypt to-day.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206269989.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 2074, "total-output-tokens": 396, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1554, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]