[{"id": "9a94b00de752849244d8f75bb42ee778853d89c5", "text": "THE WIDOW AND THE AMERICAN.\n\nAt the Westminster Police-court, Elizabeth Thwaites, rather stylishly-dressed, described as a widow, was placed in the dock, on remand, before Mr. De Rutzen, charged with stealing a chamois-leather purse, containing £7 10s., from Mr. George Harold Marsh, a mining agent and engineer, of New York, and 22, Basinghall-street, London. Mr. Kymer defended. The scene of the outrage was that of the night of the 29th ult., when the prisoner was in the neighbourhood of Victoria Station. She told him that she was a widow lady with her own house on the Embankment, and ultimately he escorted her home to Grosvenor-road, Pimlico. Prior to this they had refreshments together at a restaurant. At the house in Grosvenor-road Mr. Marsh said the prisoner accompanied him to a room upstairs, and there left him, saying that she would shortly return. Finding that she did not do so he examined his clothing, and discovered that his purse, which he had seen but a short time before—when he gave the woman a sovereign—was missing. He proceeded to a parlour downstairs, and was there hustled by two young men, who said that if he did not go out quickly he would get the worst of it. They put their hands on him, and then he struck out and pushed his way through the window. The struggling and noise attracted the attention of a policeman, who entered the house, and took prisoner in charge of his direction. It was suggested in cross-examination that prisoner sent for the policeman herself in consequence of the damage done, and the defence set up that the prosecutor called at the house to see a lodger, and was merely shown upstairs and left by prisoner, was supported by her two male friends before referred to. They described themselves as clerks—one admitted passing by different names, and the other said he had no employment—and swore that they played cards in the kitchen all the evening with Mrs. Thwaites, that she was practically never out of their sight all night of the night, and that it was therefore impossible to have met the prosecutor at Victoria Station a mile and a half away. Mrs. Graham, the female searcher at Rochester-road (Westminster) Police-station, deposed that when the prisoner was brought there to be charged, she volunteered, as an explanation of being but partially dressed, the statement that she had only just got out of bed. She also said that she had been out that evening to Sloane-square. An additional witness was called to prove that the accused was at home at ten o'clock on the night in question, but the magistrate questioned her, and she could not say what day of the week it was. She was not sure whether it was Wednesday, Thursday, or Friday. Mr. De Rutzen committed the prisoner for trial, offering to take good bail.\n\nCHARGE AGAINST A SECRETARY.\n\nJohn Morris Cowen, secretary of the English Crown Spelter Company's London Branch, was charged, on remand, at the Marylebone House, with embezzling large sums of money. The alleged facts of the case have been reported in the company's works at Swansea. The prisoner had been for some years in the employ of the company, and was transferred to London in consequence of the great confidence reposed in him. Mr. Pontifex, the chairman, said the prisoner was practically the manager. It was the custom of the company to make all sales through Messrs Rogers and Co., metal brokers, who advanced money as it was required for the London agency as against the sales effected, and at the end of the month the accounts were balanced in the usual way. It was alleged that the prisoner obtained considerable sums from Messrs. Rogers and Co. upon the representation that the cheques were for the payment of accounts due. Mr. Wontner said he should now bring forward the prisoner with conspiring with Mr. Fox, who had absconded, and against whom an warrant had been issued. Fox carried on business with Fox and Sons, metal brokers, and in 1896 entered into a contract to supply the company with fifteen tons of zinc shavings. Only five tons were delivered, and at the end of the year Mr. Fox was indebted to the company to the extent of over £100. The prisoner, however, had during the year obtained from Messrs. Rogers and Co. seven or eight cheques, not one of which was less than £100, in payment of invoices which he produced from Messrs. Fox. These cheques were all paid into the banking account of Messrs. Fox, but they never appeared in the books of the company, and were in no way accounted for. It would also appear that small cheques were given to the prisoner by Messrs. Fox and Co., drawn upon their own banking account. In this way, also, it was alleged that the company had been defrauded to a large extent. He should also prefer other charges of fraud and embezzlement against the prisoner. The case was again adjourned after evidence had been adduced.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810276.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 1108, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4864, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]