[{"id": "fe9e6a25b4af111f8530e8b3d26380b6bea8f4b9", "text": "THE ITALIAN IMPOSTOR AND BIGAMIST.\n\nAlexander Borromeo, alias Dr. Tucker, alias Marco de St. Hilaire, &c., the Irish Italian impostor, who lately figured in the \"Conference\" hoax, was brought before Mr. Hall, at Bow-street, by habeas corpus, to answer a charge of bigamy preferred by the Society for the Protection of Women.\n\nMr. Sleigh stated that the present charge related to one only of several acts of bigamy which had been undoubtedly committed by the prisoner. The second marriage took place at the famous Gretna-green, to which a young lady, overcome by his blandishments, had been induced to accompany the prisoner, by whom, after she became the mother of a child, she was cruelly deserted. The first marriage in the name of St. Hilaire, with Mary Ann Sadler, was plainly proved; but the prisoner begged the magistrate to write to France. He would then ascertain that Hilaire was in a government situation there. He (prisoner) had never been to England until after 1842. The parties were mistaken. Hilaire was a well-known political character.\n\nThe effrontery with which this statement was made appeared to take the witnesses by surprise. Mr. Sadler, the brother of the first wife, asserted that he knew the prisoner perfectly well, and the prisoner knew him.\n\nAnna Maria Froggatt deposed that she first made prisoner's acquaintance at Preston, in 1847, when he induced her to leave her home, and accompany him to Gretna-hall, in Scotland, where they were married, according to the ceremony observed there, and pronounced by the Rev. Mr. Linton, the priest, to be legally man and wife. The prisoner left her, with one child (a little girl), in 1851, and she had never seen him since till that day, in the court. She had to seek her own bread by working in the millinery trade.\n\nThe prisoner: I assure you it is all a mistake. I know nothing of these people. To save trouble, if you will not write to the French government, I may as well plead guilty, and reserve to myself the right of prosecuting these witnesses for perjury.\n\nThe Scotch certificate, showing Miss Froggatt's marriage with Marco Emile de St. Hilaire, was here produced, and Mr. R. Stuart, barrister, of 8, Old-square, Lincoln's-inn, having proved it to be a legal marriage, the prisoner was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206203053.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 568, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2287, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]