[{"id": "b7360dc488097e9c7a191919ca2d00913090bd27", "text": "EXECUTION FOR MURDER.—George Hunter, a pitman, 23 years of age, residing at Burradon with his parents, was executed on Tuesday within the County gaol at Morpeth. The crime for which he suffered was the shooting of another pitman, named Wood, at Dennington, on the 19th of December last. The jury recommended him to mercy, but the authorities did not interfere. It is a remarkable fact that on the day he committed the murder he had signed a memorial praying for a pardon for Richard Charlton, who was then under sentence of death in the same prison for having shot his wife. Having breakfasted on Tuesday morning in his cell, he was taken to the gaol chapel, where the Hon. and Rev. T. R. Grey, rector of Morpeth, acting for the prison ordinary, who was unwell, read prayers to him. He declined to receive the Communion. At 10 minutes before eight o'clock he was taken into the pinioning-room and handed over to Marwood, the executioner. In eight minutes the procession moved towards the scaffold, led by Marwood, followed by the convict, on either side of whom walked a prison officer. Twenty steps brought the unhappy man to the scaffold, and just as the prison clock began to strike eight the bolt was drawn, and almost immediately Hunter ceased to live.\n\nSTAFFORDSHIRE.—DREADFUL SUICIDE.—Up to Monday, Thomas Stevenson, labourer, about 40 years of age, in the employment of the Wednesbury Local Board of Health, occupied with his daughter, a girl of 16, a three-roomed cottage, known as 3, The Vicarage. On Friday the girl announced that her father had committed a forcible outrage upon her the previous night, and that she intended applying on Monday for a warrant against him. At eight on Monday morning the cottage was observed to be in flames, and the fire was not extinguished until most of the furniture and a considerable portion of the dwelling had been reduced to ashes. On a bed Stevenson was found dead, with his throat cut, having first, it is believed, set fire to his house.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206325245.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 490, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1992, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]