[{"id": "ab58171ea1f4637368eb5526087266f884a2ae83", "text": "DARING BURGLARY AT A BOARD SCHOOL.\n\nAt the Thames Police-court, on Thursday, before Mr. Rose, James Kingley, an elderly man, was charged with stealing a quantity of linen goods, scissors, &c., to the value of £3 3s., from the Cubitt Town Board School, Manchester-street, E. Richard Godfrey, the school-keeper, said that he fastened up the school on the previous night, in a secure manner, at about half-past eight o'clock. About ten o'clock he went round again round again on a tour of inspection, and he found everything was safe. The doors and windows were locked and barred in the same way that they usually were. About six o'clock the next morning, when he rose to commence his duties, he saw the prisoner running along under the wall near the school. He had a chair ready to get over the wall into the street. When he saw witness he ran into the school again by the girls' entrance, and ran round that way to the boys' exit. Witness ran round to the front entrance, and sent a passer-by for a policeman. When the constable arrived he was informed of the burglary, and they made a vigorous search for the prisoner, and found him in the boys' w.c.'s. When witness went into the school he found most of the cupboards ransacked, and a lot of things were missed belonging to the girls' mistress, such as calico and other stuffs, which they were making up into garments. Police-constable 489 K said that about six o'clock on Thursday morning he was on duty in Wharf-road, Cubitt-town, when he saw the previous witness standing at the gate of the school. They found the prisoner. When asked what he was doing there he made no reply. He had with him a small bundle, which was handed to another officer while witness took prisoner to the station, where he was found in possession of a large roll of calico which was found wound round his body. Some new scissors were also found in his breast pocket, and he was also in possession of a mortice chisel, which corresponded with the marks on the windows and doors. Sergeant Kobby, 68 K, said that evidently the prisoner had effected an entrance by scaling the wall and prising open one of the windows on the ground floor of the infants' school. The prisoner must have gone into every room in the house. In the girls' room on the first floor two of the locks were broken off two cupboards, and a similar thing took place in the girls' hall. In the science room on the second floor more marks were found, and also in all the other rooms, making eight in all. The woodwork is all broken half-way up the walls. If all the things were collected up in a heap which the prisoner had laid on the floor there would be a good cartload. Annie Turnbull, the head mistress of the girls' school, identified the property, and she valued it at three guineas. It was not her property, but that of the board. Prisoner was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810742.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 683, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2866, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]