[{"id": "1dc2e7e9314d05d1d16aef595c40e0278ef70b10", "text": "THE LATE CATASTROPHE AT CLIFTON.\n\nThe following is the verdict in this case.—We find that the deceased Thomas Croston, Richard Simmons, and George Barbour were killed on the 4th day of March instant, by the engine No. 13 running off the line and upsetting near the Dixon-fold station, on the Manchester and Bolton railway, caused by the excessive speed at which it was driven by the deceased Thomas Croston, against whom we return a verdict of \"Manslaughter.\" And we state that, although the rules of the company furnished to the guards and drivers limit the speed of express trains to thirty miles an hour, this train has usually far exceeded that speed; and we think this could not so constantly have occurred without the knowledge and approbation of the directors of the company. We find also that the engine No. 13, from having only four wheels, and the length of time it has been in use, was not a proper engine to attach to a train running thirty miles an hour, even on a railway in good and efficient order; that the permanent way of this railway, as regards sleepers, chairs, and rails, in material and construction is generally very defective, and by no means safe; that the speed at which the points to branch lines are passed is highly dangerous; that the quick succession of trains on the lines from Manchester to Clifton junction with the East Lancashire company is also very dangerous; and that the general arrangements of the company as to the maintenance of way and management of trains do not conduce to the safety of the public; and we cannot too strongly condemn the management of the Lancashire and Yorkshire railway company on that portion of their line known as the Bolton and Preston district. We are also of opinion that the speed at which express trains travel on all railways is so great that a stringent investigation should be instituted by the Board of Trade, as to the construction and present condition of the permanent way, engines, and carriages, as well as the working arrangements; and we fear it will be found that the Lancashire and Yorkshire railway is not the only one on which such a system of economy prevails as seriously to endanger the safety of the public.\n\nWe regret to have to state that another death (making five in the whole) has now resulted from this terrible accident—Mrs. Horrox having died in the infirmary about eleven o'clock on Friday night, from the effects of the shock upon her system. A sixth death seems imminent; for we (Manchester Guardian) learned at the infirmary last evening, that Betsey Macartney, one of Mr. Barbour's servants, was dangerously ill, and not expected to recover. Mr. C. Caratti was doing very well indeed last evening; all idea of amputation is, we understand, at present given up. The other four patients in the infirmary—Ellen Hogg, and Messrs. Richard Martyn (china stone and clay merchant, Carthew, near St. Austell, Cornwall), Henry Kay, and Henry Pugh are doing very well; the first two being recovering rapidly.—The health of both Mr. and Mrs. Barbour has since our last steadily improved, and no immediate apprehensions of danger are now entertained by their medical advisers.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206304580.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 704, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3170, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]