[{"id": "5cf1a1db1d34b3e125c6dd2dcd73ef7f00bbeea5", "text": "SUSPECTED CHILD MURDER AT ROCHESTER.\n\nThe inquiry into this case was resumed on Tuesday evening at six o'clock. Henry Weekes surgeon, examined, stated that he resided at Brompton, Chatham. On the morning of the 8th instant, about half-past ten o'clock, he called in at Captain Jenkins's house, and was informed of the illness of Elizabeth Mitchell, the servant. He went up to her room and found her lying on the bed. She complained of a pain in her stomach. Susannah Arman, the cook, was in the room; he wished to examine her. She refused, but ultimately consented, and the result confirmed him in the opinion that she was pregnant and about six months gone, but she denied it strongly, and gave a different reason for her appearance. He returned home and sent her an anodyne draught and a powder, which it appears she never took. He visited Captain Jenkins's house again about five minutes after twelve, and from information he received before he went upstairs, he inspected a sop pal, and was certain from what he there saw that the delivery of a child had taken place. He then visited Mitchell in her bedroom; she was lying on the bed, dressed as before. Upon inquiry she said she was better. She said she had taken some pills, which her mistress had sent her, early in the morning, and they had relieved her. This, however, was not true. Witness then told her he was sure she had been delivered of a child. She strongly and repeatedly denied it, but, after much importunity, she said if he would shut the door, and promise not to tell her mistress, she would tell him where the child was. She left the bed, contrary to his advice, took a key from her pocket, and unlocked a box, from whence she took a bundle, in which he found a male child in a piece of wrapper, apparently dead. The bundle was about halfway down the box, and covered over with several articles of clothing. The child was merely laid in the wrapper, but not tied up. Witness examined the child, and inquired of Mitchell if it were born dead? She replied \"Yes,\" it had never cried. Witness then examined the child minutely to ascertain if it had been injured, but discovered no marks of violence about it, nor any signs of life. All this time she was kneeling by the box, and entreating witness not to mention it, and she would dispose of it, believing it to be dead. It was, however, returned to the box, and witness took the key. It was a full grown child. He believed from its appearance it had been born alive, but died afterwards. She confessed that she was delivered immediately after his first visit at eleven o'clock. Witness then left the house, and at half-past two returned again with Captain Jenkins, who determined to put the case into the hands of the constable, and himself and constable went upstairs, unlocked the box, took out the child, and to the surprise of all present found it to be alive. He adopted the usual means for restoring animation, and the child ultimately recovered, and was placed in bed with its mother, who expressed herself much pleased at its restoration. In the evening Captain Jenkins hired a close carriage, and she was removed to her friends at Rochester, and witness continued to attend her until the death of the child, which took place on Saturday morning, about thirty-six hours after its birth, and in his opinion it died from want of attention in the first instance, and secondly from being deprived of proper air, by being confined in the box. By a juror: She was removed by her own earnest request, and I assented to it.—P. W. Jacobs, of Rochester, surgeon, stated that on Monday morning he made a post mortem examination of the body, in the presence of the last witness, and after describing the various appearances of the body gave it as his opinion that death was caused by congestion of the lungs, which prevented respiration from taking place, and which was produced partly from malformation and partly by confinement in the box. He had no doubt the child was born apparently dead. This witness's examination terminated the inquiry, and after a short adjournment the jury resumed their duty at half-past eleven o'clock, and were immediately locked up to consider their verdict. At seven o'clock in the morning the coroner, finding there was no chance of their agreeing, discharged them, and has given directions to summon another jury.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206190290.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 967, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4362, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]