[{"id": "d11b830012013b8e584dc028ce86f8ed10254b2c", "text": "THE DE COBAIN CASE.\n\nAt the Belfast Assizes, before Mr. Justice Johnson, Edward Samuel Wesley de Cobain was indicted for the commission of an offence in March, 1888. There were ten counts in the indictments, involving five persons in addition to the prisoner. A great deal of interest was manifested in the case, and the court was crowded. The Solicitor-general said the duty of all concerned in the case was one of an intensely painful character. To the jury it must be especially so, having regard to the fact that the prisoner at one time had the honour to be the representative of one of the divisions of that great city. Having dealt with the enormity of the offences charged against the prisoner, counsel said they should remember that, though the offences were committed in 1887 and the trial was only proceeding in 1893, the warrant for his arrest was made out in 1891. For nearly two years the prisoner had baffled the law and shrunk from facing a jury of his countrymen. A number of witnesses, almost all young lads, were examined, and Head-constable Hussey deposed to the arrest of the prisoner. This closed the case for the prosecution. Mr. O'Shaughnessy, Q.C., addressed the jury in defence. He said the abominable charge against his client was the outcome of a conspiracy initiated by a man named Haggie, who had failed frequently in the attempt to blackmail Mr. de Cobain, and who afterwards pleaded guilty to a charge of forgery and embezzlement. Mr. de Cobain had made himself objectionable to the local caucus when he fought and defeated its nominee in a Parliamentary contest in one of the divisions of the city, and he had incurred the enmity of the police force by charges he had boldly made against that body for their action in connection with the Belfast riots. Counsel commented warmly upon what he termed the poisoned atmosphere which had been deliberately created around his client by the babbling of the police and his enemies in the city. His client had left the country to recruit his health, which had at this time broken down, but as soon as he had recovered he returned to meet his accusers. He confidently relied on an acquittal. Witnesses for the defence were called, and the accused was also examined. He denied absolutely that there was any truth in the allegations made against him, and three of the witnesses he could not even identify. To none of them had he even spoken improperly. The Judge, in summing up, said these charges were easily made and often difficult to repel. The jury, after forty minutes' deliberation, returned a verdict of guilty, and the prisoner was sentenced to twelve months' imprisonment, with hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811447.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 603, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2670, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]