[{"id": "f59cd17a2616d7a72af82936e664f1a19d4bee20", "text": "THE CASE OF MR. BONWELL.\n\nOn Wednesday morning, the jury met to resume their inquiry at the New Globe tavern, Bow-road, into the death of an infant, about three weeks old, named Philip Yorath, illegitimate child of Miss Elizabeth Yorath, sister of a highly respectable surgeon of that name, practising at Newport, in Monmouthshire. The investigation arose in consequence of several anonymous letters forwarded to the Bishop of London, signed \"A Parishioner,\" reflecting on the moral conduct of the Rev. J. Bonwell, rector of St. Philip's district church, Stepney, residing with his wife in Thornhill square, Islington, where Mrs. Bonwell carries on a ladies' school. The anonymous letters contained grave charges against the rev. gentleman, which charges have already been given in our previous report.\n\nThe inquest was opened on Saturday, the 17th of September, when evidence was taken of the burial of Elizabeth Acock by Ayres, on Sunday, the 4th of September, the exhumation of the body, and the finding of the infant, and the inquiry was accordingly adjourned for the production of the necessary witnesses, and to give time for the analysis of the intestines of the infant, whose death and burial were of so mysterious a character.\n\nThe jury re-assembled on Wednesday morning, and proceeded to hear evidence relative to this extraordinary, painful, and delicate case. Dr. Challice presided for Mr. Humphreys, the coroner, who is confined to his house from an attack of small pox. The Rev. Mr. Lee, rector of Stepney, and several other clergymen were present.\n\nThe names of the jurymen having been called over, Dr. Challice said: In this case Mr. Humphreys, the coroner, having commenced the proceedings, I am sorry to say he is in that state of health that it is impossible for him to attend today, and under the circumstances I must adjourn the court.\n\nMr. Best, barrister, instructed by Mr. J. B. Sorrell, of No. 60, Mark-lane, who attended to watch the proceedings on behalf of the Rev. J. Bonwell, vehemently protested against the postponement. This was a case involving charges of a serious nature that ought not to hang over a man longer than was necessary.\n\nSeveral of the jury protested against being brought from their occupations unnecessarily, and inquired if any witnesses were present.—Dr. Challice said there were not, and he was not in a position to go on with the case.\n\nAfter some further angry remarks from the jury, Mr. Best inquired if the Rev. J. Bonwell's name was mentioned on the last occasion?—The coroner said it was not.—The case was then adjourned for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206206535.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2591, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]