[{"id": "1ac18fd35787b4ba89616357fcf151a0dcad0b07", "text": "BURGLARIES IN LONDON.\n\nAt the Clerkenwell Police-court, on Saturday, Charles Darlow, 30, Warren-street, Liverpool, was charged on remand with being concerned, with other men now undergoing penal servitude, with breaking into the dwelling-house, 34, Sidney-street, Chelsea, in October last, and stealing therefrom a quantity of silver plate and jewellery, value £400, the property of Arthur Wilson. Frederick West, who appeared in the witness-box in convict garb, said he was convicted of burglary last January at the Old Bailey, and sentenced to ten years' penal servitude. He was now undergoing his sentence at the Wormwood Scrubs. At the time of the burglary at Mr. Wilson's house witness was living with the prisoner Darlow at Clapton. Prisoner then went by the name of Coleman. On the afternoon of October 27th witness and the prisoner were at the Queen's Head, Wharf-road, when a man came in and told them he had called at 34, Sidney-street, Chelsea, and had found that the people were out, not being likely to return for some days. Witness asked Darlow, \"Shall we do it?\" and the prisoner replied, \"Yes.\" They left the house and procured a van at Dalston, witness observing that they would want the help of another man. They drove back to the Queen's Head, where they were joined by a man named Mike Jones (now undergoing penal servitude). They also procured a jemmy, and drove off to the house in Sidney-street, arriving there at half-past six in the evening. The van was left outside a public house a short distance off. They forced open the front-door of Mr. Wilson's house, entered the passage, bolting the door behind them, and opened a window at the back of the building. Jones kept watch, and witness and Darlow burst open several inner doors, which had been locked, and opened some boxes, in which they found plate and jewellery. The boxes had to be broken open. They had at first packed up a number of other articles for removal, but they decided to leave them. They placed the silver and jewellery in a sheet, and carried it round to the van, which had been left in a side turning at the back of the house. They then drove off with the property to the Queen's Head, where they told the potman they had some \"stuff.\" The landlord, Henry Clarke, weighed the gold, paying Darlow and the witness £5 10s. for it, the money being divided equally between them. A day or two later the silver was weighed, Clarke paying them £26 for it. Cross-examined by Mr. Ricketts, West said this was not the only housebreaking transaction he had been engaged in. He had \"done\" a few. The prisoner was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810146.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 641, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2616, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]