[{"id": "ad86281fb1b1575dc41e23af93a9a083bba86258", "text": "THE DOMESTIC TRAGEDY AT HARROW.\n\nAt Edgeware Petty Sessions Ann Hensman, thirty, wife of Charles E. Hensman, commercial traveller, living at The Lodge, Alperton, Harlesham was charged, before Messrs. A. R. Johnston, Harlesham, and Dr. Bridgewater, with the wilful murder of her son, Harry Le Brun, aged nine years, by cutting his throat with a table knife on the 27th of February last, and further with attempting to commit suicide by cutting her own throat. The accused is a woman of fine physique, and preserved an attitude of stolid indifference throughout the proceedings. She spoke once only, and that was while the doctor's evidence was given. Grace Russell, housemaid in the employ of Mr. Hensman, was first called. She deposed that on the 26th of February her mistress was strange in her behaviour, and retired at seven o'clock in the evening. The next morning she rose at seven o'clock, and instructed the witness to dress master Harry in his best suit. Before the boy was completely dressed the accused took him down into the breakfast-room. Mr. Hensman was in bed at this time. Later the witness knocked at the breakfast-room door, and after a short delay the accused opened it, and the witness then saw the boy lying on the floor, face downwards, in a pool of blood. The accused called her into the room, and looking towards her son said, \"This comes of not telling the truth. Mind you always speak the truth.\" The accused then ordered witness to fetch Mr. Hensman, and she complied, and when she returned to the room she noticed that her mistress was bleeding from a wound on the throat. Dr. Goddard was called by the witness, and her master arrived at the doctor's surgery immediately afterwards. They returned to The Lodge, and met the accused walking away from the house attired in her petticoat, slippers, and a sealskin jacket. In cross-examination by Mr. Humphreys the witness said that Mr. Hensman and his wife were always kind to the boy. They purchased a lot of new clothes for him at Christmas. The little boy asked why he was to put his best clothes on, and the accused replied, \"We are going out.\" The witness had not of late noticed a wild look about the accused. Dr. Charles Ernest Goddard said he was called to The Lodge, Alperton, by the last witness, and also by Mr. Hensman, on the morning of the 27th ult., and reached the house at about twenty-five minutes to nine a.m. He found the accused outside the gate, partially dressed, and left her with her husband. He then entered the breakfast-room and found the boy Harry lying near the window. Life was extinct. The blood was warm. There were blood stains on the floor and an old bread-knife stained with blood was lying on the white table-cloth. An examination of the boy's neck showed that the wound was a deep one, extending from two inches below the left ear, passing in a horizontal direction, and separating all the important structures of the neck down to the spinal column. There were two other superficial wounds on the boy's face. Death was due to hemorrhage. The wounds on the accused were superficial. He had attended the accused since December, 1890, on and off. Nothing in her conduct gave him any reason to suspect that she was of unsound mind until the day before the occurrence, when she called at his surgery and asked whether he had heard that she was mad. She added that if her father committed suicide, and her mother was in an asylum, that was no reason why she should be mad too. It struck him that her mind was breaking down, and he told her to inform her husband that he wished to see him. Mr. Hensman reached home late in the evening, and the next the witness heard was the summons to attend The Lodge. By Mr. Humphreys: He was of opinion that she was suffering from homicidal mania at the time of the murder, and that she had lucid intervals. Police-constable Blackmore, 139 X, proved the arrest of the accused. Inspector Cooper, X Division, produced the table-knife, stained with blood, which he took from the breakfast-room after the occurrence. He also read over the statement made by accused to the effect that she was afraid the boy would be placed in a lunatic asylum and ill-treated. She added that she did it in a moment of frenzy, and was of a highly-strung and particularly sensitive temperament. Mr. Humphreys said he would not trouble the Bench with any remarks. The poor woman was not responsible for what she had done, and he knew the Bench had an imperative duty to discharge. The Bench then committed the accused for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810212.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1057, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4546, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]