[{"id": "c547d3dc6a097610c11da63057e1aaad035fa461", "text": "TRIALS AT THE MIDDLESEX SESSIONS.\n\nALLEGED ROBBERY BY A BARMAN.—Frank Hem-\nburg, 17, barman, was indicted for having stolen the\nsum of 7s., the money of Richard Henry Jackson, his\nmaster.—The prisoner had been for some time in the\nprosecutor's employ as barman at the Dudley Arms,\nHarrow-road, Paddington, and it was his duty to be\nin the bar from five to nine o'clock each morning. In\nconsequence of the receipts having recently fallen off\nconsiderably, Sergeant Crane was communicated\nwith, and on the 18th December he re-\nsorted to the usual method of marking a quan-\ntity of half-crowns and florins. When Mr. Jack-\nson came down on the morning of the 19th, he,\nin Sergeant Crane's presence, called him into the\nprivate parlour and asked him to turn out the con-\ntents of his pockets. He produced altogether two\nhalf-crowns and two florins of the marked money,\nbut one of the latter being insufficiently marked, it\nwas not included in the indictment.—For the de-\nfence the same plea was advanced by Mr. Geoghe-\ngan as that given by the prisoner when arrested—\nthat, his employer having paid him his wages in\nsmall money on the previous day, he had simply ex-\nchanged the shillings for the larger pieces, as they\nwere more convenient.—The jury, believing this to\nbe the case, returned a verdict of \"Acquittal.\"\n\nTHE ROBBERY AT APSLEY HOUSE.—Alfred Sutton,\npainter, again surrendered to his bail, to answer an\nindictment charging him with having stolen a purse\ncontaining 10s., the property of Fanny Hartridge,\none of the housemaids at Apsley house, the town\nresidence of the Duke of Wellington.—The prisoner,\nit will be remembered, was placed on his trial last\nsessions, and, after a prolonged hearing, the jury\nfailed to agree. They were accordingly discharged, and\nprisoner's bail was enlarged to the present sessions.—\nPrisoner was in the employ of Messrs. Maple and Co.,\nof Tottenham-court-road, and had, with other work-\nmen, been sent to Apsley house for the purpose of\nredecorating a portion of it. The prosecutrix had\nleft the purse in the kitchen while she went into\nthe pantry, and on returning found it had gone.\nPrisoner was suspected, and on being given into cus-\ntody the money was found on him, and the purse\nwas concealed near where he had been at work.\n—The jury returned a verdict of \"Guilty,\" and the\nprisoner was sentenced to six months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206251464.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 631, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2372, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]