[{"id": "0c1a78f0cac61a39bf4308bc0d992a2e58a6d226", "text": "SERIOUS DOUBLE CHARGE.\n\nOn Wednesday, William Scones, aged forty-eight, the keeper of the Alpha Arms beer shop, Alpha-place, Islington; John Beeston, aged twenty-one, described as a hawker, having no home; and Henry Smith, a hawker of catmeat, were charged at Clerkenwell police-court — Scones with committing a rape on Elizabeth Watson, a servant, of Loudham, Nottingham, and Beeston and Smith, with aiding and abetting him in the commission of the same, at the parish of Islington, also stealing a half-sovereign her money.\n\nThe complainant it appeared came to town on Tuesday morning, and according to her statement was accosted by Smith, at King's-cross, and taken by him to Scones' beer-shop. When she had been there a short time with Beeston and Smith, Scones came into the parlour, having been in and out two or three times before, and she was then seized by Smith and Beeston, forced on the table, and, although she screamed and struggled violently, the prisoner Scones committed the crime with which he was charged. She could not kick Scones because Beeston held her legs. When she went into the parlour she had a bag, in which was half a sovereign, and when she got outside the house she found that her money was gone. Before she left one of the prisoners offered her half a sovereign not to say anything about what had occurred, but she refused to accept it. As soon as she saw a policeman she informed him of what had occurred, and went with him to the station, and having given a description of the prisoners, she went with the police to the Alpha Arms, and the prisoners were taken in charge. Complaints are frequently being made that skittle-sharpers and thieves are allowed to congregate at King's-cross, to trap the unwary that arrive by the Great Northern railway.\n\nThe complainant, who gave her evidence in anything but a becoming manner, on cross examination by Mr. Wakeling, said that she had been in town for two years before she went to the country — a short time back. She also denied being the worse for liquor.\n\nThe prisoner Smith said the complainant was the worse for liquor when he took her into the house. The defence set up was the denial of the charge in toto.\n\nMr. Barker said it was a case for further inquiry, and remanded the prisoners until Tuesday next. Mr. Wakeling applied for bail to be taken for the prisoner Scones. There was no evidence against him, except the unsupported statement of the prosecutrix.\n\nMr. Barker declined to accede to the application at present. If Mr. Wakeling pleased he could apply to a judge at chambers on the question of bail.\n\nThe police applied that something might be given to the girl out of the poor-box, but it not being a fit case she was sent to the workhouse.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206212815.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 652, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2737, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]