[{"id": "77debf77f54d43ec6029c2116fb792b51d102a3b", "text": "THE ALTHORP MYSTERY.\n\nOn Thursday, at the Northampton Assizes, Andrew George M'Rae, grocer's assistant, was indicted for the wilful murder of a single woman, named Annie Pritchard, in July last.\n\nMr. Buszard opened his speech for the prosecution, and evidence was given of the finding of the remains at East Haddon.\n\nJohn Isaac, whip to the Pytchley Hunt, deposed to taking a terrier to the ditch where the first find of the remains was made. By its aid he unearthed some bones, one of which was produced in court and identified by the witness. It looked like part of an arm bone, and had a bleached appearance. It passed from witness to counsel, and was then for a time left on counsel's table.\n\nThe Court adjourned for luncheon at half-past one, and owing to a juror getting at large the judge adjourned the trial.\n\nMr. Justice Kennedy, on taking his seat on Friday, said he had considered most anxiously what it was his duty to do with regard to what took place the previous day, when a juror left the precincts of the court, and did not obey his plain and manifest duty. Presiding at that trial it was his imperative duty as judge to see that the proceedings were not in any way affected by even the semblance of impropriety. The trial of a man charged with the capital offence had for the time broken down, and James Asplin having as a juror been guilty of a gross contempt of court, he had decided to discharge the jury and to fine the offender £50.\n\nBy the desire of the judge, Mr. Buszard, for the Crown, and Mr. Attenborough, counsel for prisoner, expressed their views. Mr. Attenborough said prisoner implored that the case might be completed at this assizes. Mr. Buszard left the matter entirely at the discretion of his lordship. Mr. Justice Kennedy then announced that for many reasons, and in the interests of justice, he had decided to remand the case until the next assizes, and the officers of the court must secure the custody of the prisoner. M'Rae was then taken back to the cells, and his lordship proceeded with the next case on the calendar.\n\nA Northampton correspondent had an interview during Friday with James Asplin, the juror, who was fined £50; He said that when he first had the summons to be on the jury he dreaded it very much, and would have given almost anything to be excused. He had been on many juries at Quarter Sessions, and always went where he liked after adjournment. On Wednesday he states the jurymen went where they liked for luncheon, and he thought he was at liberty to do the same on Thursday. He expressed his sorrow that M'Rae should have to suffer through any error of his, and he says he left the box when being sworn, and went to the Fleece Hotel, got a letter from his coat, posted it in the Guildhall-road, had his dinner in the same street, never spoke to any one about the case, and went back as innocently as possible, and was surprised when they told him he should not have gone away. Asplin is a man well known in Northampton.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811032.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 727, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2986, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]