[{"id": "10eda38606bc268fdd0db91b54120a106de3fe84", "text": "A MYSTERY OF THE SERPENTINE.\n\nOn Friday night, Mr. St. Clare Bedford opened an inquiry into the circumstances attending the deaths of Elizabeth Coates, aged 41, and her infant child Antoinette Blanche, aged four months, who were found drowned in the Serpentine on Sunday last.\n\nLaura Martin, of 9, Charlton-street, Fitzroy-square, the wife of a commercial traveller, deposed:\n\nThe deceased Elizabeth Coates was my sister, the wife of Anthony Coates, a commercial traveller, in the employ of a City house, and living at 33, Great Portland-street, W. Deceased had suffered from very severe illnesses for years past, but had been pretty well since her confinement in July last. I last saw her alive on Thursday, the 11th inst., about eight p.m., and she was then in good health and her usual spirits. She was on very good terms with her husband, and was not at all likely to commit suicide. She had spoken of some accounts which were outstanding, but not as if she were unhappy on the matter.\n\nElizabeth Parker, of 33, Great Portland-street, a domestic servant in the employ of the deceased, deposed: Deceased had been in good health and spirits during the past few months. I last saw her at 9.40 on Saturday night when she left home, having the baby in her arms. She said she was going to her sister's and would not be long, but she never returned to the house. Heard no conversation between deceased and her husband on the Saturday.\n\nPolice-constable Joseph Blackburn said: On Sunday morning last I was on duty in Hyde-park near the east end of the Serpentine, when I discovered the body of the deceased lying in the water. It was taken at once to the Royal Humane society's receiving house, where life was found to be extinct. In the pockets were found a child's feeding bottle full of milk, a purse containing 13s., and some cuttings from some newspapers. The body was found four yards from the shore, and some rhododendron beds were close to the spot where deceased lay.\n\nJohn Williams, another constable, proved finding the body of the child near the place where Mrs. Coates was discovered.\n\nDr. Blackett, divisional surgeon of police, proved that death had resulted from drowning in each case, and that there were no marks of violence upon them.\n\nMr. Anthony Coates, the husband and father respectively of the deceased persons, said: On Saturday last I left home at seven p.m. to go to the City, leaving my wife and children at home. My wife has had a great deal of worry and illness, and since the birth of the child now dead, had been worse. The last conversation I had with her was with reference to the next day's dinner. She had eight children, and no man had a better wife nor children a better mother. We were on the very best of terms, and I cannot believe she would take her own and her child's life. She had a sister living across the park, and would have passed the Serpentine on her way to her sister's house, and it is possible that she might have accidentally fallen into the water.\n\nThe Coroner summed up, and the jury returned a verdict of \"Found drowned\" in each case.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206324440.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 734, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3089, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]