[{"id": "e4fd1571d50c8361eb7ef616a0af17cc9539e2b1", "text": "THE RIGHT TO HOLD A FAIR.\n\nAt the Lambeth police-court, Mr. William Wale, the proprietor of the Manor-house tavern and extensive grounds opposite Manor-place, Walworth, and close to the Royal Surrey-gardens, appeared to a summons, taken out by direction of the commissioners of police, charging him with having allowed a fair to be held on a piece of ground of which he was the occupier, without lawful authority.\n\nMr. Lund, superintendent of police, stated that on the morning of the 17th he visited the gardens behind the defendant's house, and saw them fitted up in all particulars resembling a fair, with the exception of the absence of wild beasts. There was a rifle and shooting gallery, two swings, four gingerbread stalls, one wheel of fortune, three wheels for games of chance, a platform for dancing dogs, a show for the performance of canary birds, a tight rope for dancing, a booth called the gallery of illustration, and a weighing and lifting machine. He sent for Mr. Wale, and told him he was acting in violation of the law and amenable to act of parliament, as the place was a fair to all intents and purposes. Mr. Wale replied that it was only a \"fancy fair,\" but he (Mr. Lund) advised him to clear the ground, for that a number of his neighbours would be very much annoyed at it. The defendant replied that he could not do so, and witness then gave directions to the inspector and Sergeant Coppin to keep an eye on it, and he (Mr. Lund) himself had visited it on the different days. On one occasion, seeing 200 children there under sixteen years of age, he sent for Mr. Wale to speak to him, but he refused to come to him, and the message he sent to him was that if he wished to see him he must come to him. Besides the charge for admission, additional charges were made for some of the exhibitions on the ground. For the canary birds an addition was made. The charge for admission for the first day was one shilling, and the other days sixpence, but orders were given for admission.\n\nMr. Child, who appeared for the defendant, contended that the entertainments on the grounds did not constitute a fair, and that summonses might with equal propriety be taken against the proprietors of the Crystal Palace.\n\nMr. Elliott (the magistrate) said that there was no ground for considering the place a fair. Under the provisions of the Police Act the 2nd and 3rd Vic., cap. 47, a fair was a place for the purchase and sale of merchandise, and where a toll was charged, and therefore there was no pretence to call the exhibition described as a fair. If it was held to be so there would be an end to all sorts of amusements, and the summons against the defendant in this case was dismissed.\n\nConsiderable applause followed the decision of his worship, and on its subsiding a gentleman, who represented himself as an inhabitant of the neighbourhood, rose, and representing the place as a most intolerable nuisance, entreated his worship's assistance on his own behalf and on that of his neighbours, to put a stop to or, at least, abate it.\n\nMr. Elliott replied that all places of amusement must be more or less an annoyance to people in their immediate vicinity; but if the defendant, as a publican, had been guilty of any violation of his licence, he was amenable for it. His (Mr. Elliott's) judgment only went to this, that in his opinion the defendant had not violated the act of parliament under which the proceedings had been taken.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206316971.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 793, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3444, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]