[{"id": "83b56ba6394de28d66ae90078e99db1eed3219a5", "text": "EXTRAORDINARY BLACKMAILING CHARGE.\n\nAt Bow-street, a man whose name was given as Charles Howard, with several aliases, aged seventy, was charged, on remand, under the Prevention of Crimes Act, 1871, with being a suspected person getting his living by dishonest means, and also with obtaining £22 from Col. Aldworth by false pretences and fraudulently obtaining £21 from George Harvey, of Malin Hall, County Donegal. Mr. Sims, who prosecuted for the Treasury, said the charges of fraud against the prisoner were founded on a voluminous correspondence, which would have to be gone into. The accused went to Cowley House, Great College-street, Westminster, and traded as Williams, Murray, MacDonald and Co., Australian merchants. Mr. Sims read letters in which it was represented that the writer had received a colonial newspaper, which advertised for a relative of the persons with whom he happened to be in communication. At prisoner's lodgings in Oakley-crescent, Chelsea (continued Mr. Sims), Detective-inspector Baker found a complete chart for swindling members of the nobility on the plan of making inquiries on various delicate matters. Two sheets of paper contained drafts of letters, in the prisoner's handwriting, to noblemen and others; in which he offered for £50 to obtain certain incriminating letters, and to provide evidence against their wives. Other letters offered for £100 to secure the return of the person addressed to Parliament, and to bring about marriage with a young Australian lady possessing thousands a year. There were also eleven drafts of letters bearing the names of 157 peers and baronets. These were marked, \"Good for marriage\"—(Laughter)—and a large bundle of letters from peers and baronets, addressed, \"Colonel Barron, Oakley-crescent, Chelsea,\" upon the subject of the Australian heiresses. The chart was marked \"Notes for Replies\" and contained ninety-two numbered paragraphs in the handwriting of the prisoner, so that he could copy a reply suitable to the person addressed. He was thus in a position to work a combination matrimonial and detective agency by himself alone. Colonel Richard Aldworth gave evidence in support of counsel's statement that he had paid Howard £2 as an inquiry fee. The prisoner's landlady said the prisoner used to have copying done by boys. The accused was remanded.\n\nTHIEVING FOR THE PUBLIC GOOD.\n\nAt the Clerkenwell Sessions, before Sir P. H. Edlin, Q.C., Henry Conway, nineteen, clerk, who last session pleaded guilty to having broken into the shop of Edward Wallis Perry, a jeweller, of Oxford-street, and stealing therein twenty-six diamond rings, valued at £420, was brought up for sentence. The prisoner took up a stone of twelve pounds in weight, and threw it through the prosecutor's window, from which he took out three trays of rings. He was caught with them under his arm, and only three, valued at about £49, were missing. He said he was a member of the Commonweal Anarchists, and had done it for the common good. The prisoner was stated to have been a frequent speaker at the unemployed meetings at Tower-hill, and Anarchist meetings at Hyde Park and Regent's Park. Dr. Gilbert, from Holloway Prison, said the prisoner was perfectly sane. In passing sentence Sir Peter Edlin said, \"Acts of bravado and callous indifference are as silly as they are unbecoming. Disposing steady work, and not ashamed to steal, you talk of sympathy and concern for the unemployed. Demagogues who go about inciting to violence and robbery are the worst enemies of labour, and it is desirable that they should be exposed to the public gaze in their true colours. You must be stripped of the fine feathers in which you would deck yourself and plainly described as what you are—a dangerous thief. The sooner you rid your mind of the vicious doctrines you profess to have adopted the better for your peace. You will have time for reflection. The sentence upon you is that you will undergo a term of eighteen months' imprisonment, with hard labour.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812244.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 899, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4007, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]