[{"id": "57c3a113e944c50785cc263ed0826db1c238b24e", "text": "FALSE WEIGHTS AND MEASURES.\n\nOn Saturday, a special petty sessions was held at the sessions-house, Clerkenwell-green, when the following nineteen tradespeople were summoned for being in possession of false weights, balances, machines, and measures:\n\nRobert Robinson, cook shopkeeper, 146, Upper Whitecross-street, St. Luke's, unjust beam and scales; one ounce against the purchaser, 1l—Elizabeth Biggs, baker, 186, Upper Whitecross-street, unjust weighing machine. In weighing 8 pounds of bread only 7½ pounds were given, 1l—Thomas Hack, butcher, 205, Upper Whitecross-street, an unjust weighing machine half an ounce against the purchaser; second offence, 2l—Thomas Seal, coal dealer, 125, Goswell-street, Clerkenwell, coal weighing machine ¼ of a pound against the purchaser; third offence, 2l 10s, or one month—Henry Williamson, coal dealer, 2, Upper Bermein-street, Islington, coal weighing machine ½ pound short, 1l, or fourteen days—John Redford, tobacconist, 56, Exmouth-street, Clerkenwell, illegal weight, paper and tinfoil being weighed up with the tobacco, 1l—Wm. Kyle, tobacconist, Roseman-street, Clerkenwell, six light weights, 1l—John Elberry, stall keeper, 4, Taylor's-court, St. John-street-road, three light weights, 1l—Fanny Sincock, tobacconist, Roseman-street, Clerkenwell, three light weights, fined 1l—Susannah Bowyer, beer seller, John's-row, St. Luke's, four unjust measures, 1l—William Sullivan, chandler, 39, Brick-lane, unjust beam and scales, 2l—Charles Morgan, fruterer and greengrocer, Cross-street, Hatton garden, and Ely-rents, seventeen false weights, 5l—Thomas Layborn, victualler, Little Warner-street, two false measures. There was a second summons, charging him with having in his possession six illegal measures. The manager appeared for the defendant, who said the measures only hang about the bar as an ornament. The summonses were for separate houses, 2l 10s—Joseph Pritchard, beer seller, 4, Little Warner-street, two false measures, 5s—Mary Redden, coal dealer, Hatton-wall, unjust weighing machine, 10s—Pietro-Bordessa, an Italian victualler, Charles-street, Saffron-hill, four false measures, 1l—George Blick, baker, 11, Bowling-green-lane, obstructing Mr. David Faulkner, the inspector, and his assistant. He prevented them from looking to the weights and scales, and in attempting to strike the assistant the blow fell upon the inspector. There were, however, two ounces less weight upon his scales than ought to have been. Defendant pleaded not guilty, and attempted to explain his conduct, and said he did not know the inspector; fined 2l—Wm. F. Marshall, victualler, Hatton-garden, eight false measures, 2l.\n\nThe following persons were presented to the Paddington vestry on Tuesday, for having in use at the time of the jurors' visits to their respective places of business, false scales, weights, and measures, and were fined as under:\n\nEdward Mansfield Marks, licensed victualler, Black Lion, Uxbridge-road, one quart measure deficient of the legal quantity, fined 2s 6d—Goodman, butcher, 4, Leinster-street, scale ½oz. against the purchaser (second offence), 5s—Mary Ann Gurney, general dealer, Gloucester-mews East, scale 1oz. against the purchaser, one lb. weight ½dr. short, 1lb. weight 2dr. deficient; and the other weights in bad order, 5s.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206228477.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 919, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3299, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]