[{"id": "d18c878ac879759e128d3b7be3d3bd4c4f8996bf", "text": "MURDER OF A POLICE CONSTABLE.\n\nOn Friday William Pullin, 19 years of age, a sawyer, was indicted, at Bristol assizes, for the wilful murder of Richard Hill, a police-constable, on the 24th April, at Bristol. Mr. Saunders opened the case. On the 24th of April last, at about nine o'clock in the evening, Mr. Curtis, a baker, in Waterloo-street, had his attention drawn to a disturbance in the street. The prisoner was in a donkey cart, and he was ill-treating the animal. Mr. Curtis left his shop and went to the prisoner, and remonstrated with him for his cruelty. He (Mr. Curtis) returned to his shop, whither he was followed by the prisoner, who made use of violent and excited language. Mr. Curtis said if he could see a constable he would give him into custody, and he went out to look for one. He went up West-street and down Gloucester-lane, as far as the Three Horse Shoes inn, but could not see a policeman, and was about to return home when the prisoner, who had followed him, struck him in the face and chest. The deceased constable, who was in plain clothes, had witnessed the assault, and he came up and collared the prisoner. He resisted, a scuffle took place, and in the struggle they got into the bar of the Three Horse Shoes. Shortly after the man and the officer got upon the ground, but before they did so the prisoner was observed to have a knife in his right hand. They remained on the ground some little time. Other officers came up, and prisoner was taken to the police-station. The deceased got up, and walked as far as the door of the house. He was observed to be deadly pale, and Mrs. Osborne gave him some brandy. It was then noticed that there was a pool of blood upon the floor of the bar, and a gash in the trousers of the constable. Mr. Davis, a medical man, was fetched, and he found deceased in a state of collapse, and in about a quarter of an hour he died. At a post-mortem examination there were found to be two or three cuts, one of which had severed a large vein and beneath that the artery which was a continuation of the femoral artery, and the medical man stated that death resulted from the injury.—Numerous witnesses deposed to these facts.—The jury, after an hour and a-half's deliberation, found the prisoner \"Guilty,\" but strongly recommended him to mercy, on the ground that he was excited by drink, and on account of his previous good character.—Sentence of death was passed in the usual form.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206232849.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 606, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2440, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]