[{"id": "8fe6a7c3bc4ed3428e110698ec98b5d1f3e4efe4", "text": "ALLEGED COWARDLY ASSAULT BY A MAGISTRATE.\n\nAt the Westminster Police-court, on Thursday, before Mr. Sheil, Mr. William Hayward, fifty-eight, ex-mayor and J.P. of Aldeburgh, Suffolk, residing at 81, Tachbrook-street, Pinlucio, surrendered to his bail to answer a charge of violently assaulting Mr. Hamilton Lindsey Bucknall, civil engineer, of Okehampton, Devon, staying in London at 29, Colchester-street, S.W. Mr. E.D. Rymer appeared for the defendant.\n\nMr. Duerdin Dutton, solicitor for the prosecutor, said he should ask for the committal of the defendant on a charge of unlawfully wounding. Mr. Hayward lived with a Mrs. Vernon, the divorced wife of an officer, and this lady some years ago was on very intimate terms with the prosecutor. Mr. Bucknall had occasion lately to write a very proper letter complaining of the annoyance which he had received from Mrs. Vernon, and defendant taking umbrage at it constituted himself her champion and committed this cowardly assault. Not only was Mr. Bucknall violently struck over the head with a walking-stick, but he was kicked by the defendant. Mr. Rymer: Not a word was said about a kick when the charge was first made. Prosecutor deposed that late on the night of the 17th ult. he was fetched out of his rooms in Colchester-street by a message that a gentleman desired to see him. He proceeded to the front door and saw Mrs. Vernon and the defendant. The latter excitedly demanded an explanation about a letter, and before witness could give it, hit him a blow on his forehead with a heavy stick. Witness fell badly cut and bleeding, and while down defendant kicked him in the stomach. Mr. Davton put in the complainant's letter to the defendant, which had been referred to. The communication was a polite request to the defendant to use his influence with Mrs. Vernon to stop her using offensive language to him (Mr. Bucknall) in public places, or at his residence, where he desired that her noisy visits should be discontinued.\n\nMr. Sheil remarked that it was a very proper letter to write, and not one to take offence at. Prosecutor was then cross-examined by Mr. Rymer. He said that at one time he lived with Mrs. Vernon. He should think it was about five years ago. He knew her before she was married, and after she was divorced from her husband, Mr. Granville Harcourt Vernon. That gentleman's family objected to the marriage, and wished to get rid of her. He (Mr. Bucknall) knew that she had £2,000 paid her. Mr. Rymer: And did you help her to spend best part of it? I believe defendant told you so. Prosecutor: He never attempted to tell me such a despicable lie. She had plenty of money from me, but I never had a halfpenny from her. Mr. Sheil said he would not allow a lot of matters outside the charge to be gone into. Mr. Rymer: I was only trying to show what led up to it. Dr. Neville, of 83, Sloane-street, deposed that on the night of the 17th ult. he was called to Gerald-road Police-station to see the prosecutor. Mr. Bucknall was quite sober, and was suffering from a star-shaped lacerated wound on the left side of the front of the head. The bone was exposed. Mr. Sheil: It is a dangerous place on the temple? Dr. Neville: Fortunately the stick fell on the thickest part of the bone, otherwise the skull would have been fractured. It was a serious wound, and Mr. Bucknall has complained of irritability and loss of memory since. Mr. Brownie Collier, landlord of 29, Colchester-street, corroborated the evidence of the prosecutor. Cross-examined: Bucknall at one time lived in his house with Mrs. Vernon. Prosecutor did not suggest that Mr. Bucknall followed her. By sheer accident prosecutor, long after his intimacy with Mrs. Vernon had ceased, came to reside as a lodger in the same house with her and Hayward. This arrangement did not last long. Mr. Sheil committed the defendant for trial, and accepted bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810955.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 962, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3883, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]