[{"id": "db7704009d70f32f6e68753bde8dcc8fff9ab037", "text": "A powerfully-built man, named Thomas Hurd, a commission agent, who refused his address, was charged, at Marylebone Police-court, on Saturday, with being concerned, with others, in obtaining 10s. by means of a trick from Frank Bliss, a medical student, of 29, Paddington-green. He was farther charged with attempting to obtain £5 by a trick. Mr. Bliss was a passenger by train to West Drayton, on the Great Western Railway. Several persons were in the carriage with the prosecutor, including the prisoner and his confederates. One man pulled out three cards from his pocket soon after the train started, and tried to get prisoner to bet as to which of the cards was the picture card. The confederates betted, and what appeared to be a £5 note changed hands. The prosecutor then betted with 10s. and lost. They wanted him to bet again, but he said he had no more money. The prisoner leaned forward and confidentially offered to lend the prosecutor £2, accepting his word of honour to repay it. The offer was accepted, but the player of the cards would only accept a bet of £5, and the prisoner offered to lend the prosecutor that amount. The prisoner passed him what appeared to be a £5 note folded up, and the prosecutor handed it to the player of the cards. The cards were shuffled and the prosecutor lost the bet. He asked the prisoner for his name and address, but the latter preferred to meet him personally. Before alighting at West Drayton an arrangement was made that the prisoner was to call on the prosecutor at Paddington-green for the £5. The prosecutor returned to London, and as the result of his communicating with the police, Detectives Dyson and Neighbour, F, went to the prosecutor's house. The prisoner called, as arranged, but before he rang the door bell the officer saw that the prisoner was in the company of a man known as \"Snowy,\" a celebrated and well-known cardsharpener and racecourse welsher. The prisoner was admitted to the house, had a glass of wine, and got into conversation. When the prosecutor remarked that he would go to another room and get the money, the prisoner said he would wait outside, as a friend of his was waiting for him. Sergeant Dyson then entered the room, and said, \"Perhaps I am the friend you are looking for,\" and took him into custody, and he made no reply. Neighbour arrested the other man, who was said to have just previously swindled a man of £3 in the Load of Hay, Praed-street, but that charge was dismissed. The prisoner, who had been convicted, pleaded guilty. Mr. Hopkins described the prisoner as a despicable being in the shape of a man, and sentenced him to six months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810696.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 623, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2650, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]