[{"id": "a27b58c4df10766f18991c11608a420a0ae0fb72", "text": "THE NEWINGTON PAUPER DEAD.\n\nOn Wednesday, Alfred Feist, late master of St. Mary Newington workhouse, again surrendered on his bail, at the Lambeth police-court, for further examination, on the charge of disposing of the bodies of inmates who died in the workhouse, for anatomical purposes.\n\nOne or two other cases similar to that of Mary Whitehead, which was investigated at the former hearing, were now gone into. The undertaker, Hogg, deposed that in cases when bodies were intended for anatomical purposes he generally received the necessary certificate from the defendant to send to the inspector under the Anatomy bill. The practice in the workhouse was, when paupers died there, to have them carried down to the dead-house and place them in a shell, and the undertaker had no means of learning the names of such persons, except from the master of the workhouse.\n\nEvidence was also given by Mr. William Bull, a clerk in the master's office, as to the practice followed in case no friends of the deceased applied to be allowed to follow the body to the grave, and also as to the disposal of unclaimed bodies.\n\nMr. Mathews, on behalf of the prisoner, admitted that his client was not free from blame, in the lax—he might say the scandalous—manner in which the bodies of paupers had been treated, but contended that no sale of the bodies for profit had been made out, and that Hogg, the undertaker, who had access to the dead-house, ought to be placed at the bar rather than his client.\n\nMr. Elliott said there could not be the slightest doubt that in the first case before him the prisoner knew that the deceased had friends, and he had been guilty of a fraud of a most revolting description, that of substituting the body of one for another, and making the friends believe they were following to the grave the body of their own relative. This was an offence against decency of the worst description. The case must go before a higher tribunal. It also appeared to him most culpable on the part of the board of guardians to allow bodies to be brought back from the hospital to the workhouse for interment.\n\nMr. Robinson assured the magistrate that that which had been so justly condemned by his worship was entirely unknown to the respectable gentlemen who formed the board; and a number of the guardians present confirmed this assertion.\n\nThe evidence in the case of Phoebe Clark, a pauper, who had been in the workhouse, and who died on the 10th of February last, was then gone through. In this case the body was sent to Guy's and another substituted, and two of the sisters of Clark followed the strange body, in the belief it was their relative, to Victoria park, and saw the coffin interred there.\n\nMr. Elliott was of opinion that this and the case taken on the former day would be abundant for the purposes of prosecution, and Mr. Robinson having undertaken that if indictments in other of the ten or twelve cases should be preferred, the solicitor for the defence should be furnished with the evidence in them, the prisoner was fully committed to take his trial on both charges. On an application by his counsel the prisoner was however admitted to bail in two sureties in 40L., and himself in 80L., to appear on the day of trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201955.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 726, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3239, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]