[{"id": "fb3d19147cf521f05cd91e3fbb327df546680259", "text": "SINGULAR CHARGE OF ROBBERY.\n\nOn Wednesday, at the Middlesex sessions, Sarah Higgins, nineteen, servant, was charged with stealing three rings and other articles the property of Benjamin Lewis Franklin.\n\nThis was an important case. The prosecutor lived at No. 44, Albemarle-street, but had been living at 13, Bruton-street, where the prisoner was in the capacity of a general servant. About the end of last month he had occasion to look into his jewel-case, and found it nearly empty. Three or four rings, a chain, shawls, and dresses, had been stolen. On the 28th of June he saw the prisoner, and asked her whether she was not ashamed of herself to look him in the face after having stolen his property. She said, \"Oh, you gave them to me;\" and when he asked her, \"Why?\" she said, \"Because you locked the door on me, and took liberties with me.\" This the prosecutor most stoutly denied, and declared upon his oath that he never took the slightest liberty with her, and would not have parted with the things she was charged with stealing, because they belonged to his late wife. The prisoner sold the things to Mrs. Mengedoht who keeps the house, and who, when examined, deposed to having met the prisoner upon one occasion on the stairs, apparently coming out of the prosecutor's room, and looking very flushed and flurried, with her hair dishevelled.\n\nMr. Benjamin Lewis Franklin was examined; and denied having ever taken any familiarities with the prisoner. He said she had a master key, with which she could enter his rooms. He described the articles (family relics) which he had lost, and said the prisoner was never in his room with a turned key, nor did he ever take any improper liberties with her. He had asked her about her sweetheart one Sunday when she wished to clean his room in order to go out early.\n\nAfter further evidence and examination of witnesses, Mr. Ribton made a very lengthy address to the jury on behalf of the prisoner.\n\nThe jury returned a verdict of \"Not guilty.\"\n\nMr. L. Lewis, in the absence of Mr. Sleigh, said it was right to mention that the prisoner had made a similar charge against a previous employer, and he could prove it by witnesses. She had also charged a gentleman at the Hammersmith police-court with an indecent assault. It was also stated that prisoner had been discharged from a situation at Notting-hill for pilfering, and that she had frequently shown the locket alluded to.\n\nThe assistant-judge remarked that he was not surprised to hear it, but that it had nothing to do with the case at present decided by the jury, though it must be a great satisfaction to Mr. Franklin to have heard these statements. The prisoner was then discharged.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206225571.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2690, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]