[{"id": "c0a5a33d3d50681c744b8f0c15e6d6f078054a39", "text": "A DOUBTFUL CASE.\n\nWilliam Singleton, 29, house decorator, and an ex-police constable, living in Pedro-street, Clapton-park, was charged, with his wife, Mary Ann Singleton, 26, at North London police-court, on Saturday, with being drunk and disorderly and assaulting the police at Dunlace-road, Clapton-park.—Constable Mallett, 372 J, stated that early that morning he saw the prisoners creating a disturbance in Dunlace-road. They refused to go away, and he and Constable 327 took them both into custody. On the way to the station the male prisoner became very violent and threw witness to the ground five or six times, and tore his trousers to pieces.—Constable 258 J said at two o'clock that morning he found the male prisoner and Constable Mallett struggling on the ground. Witness assisted the constable up, and the prisoners threw him (witness) down. The woman behaved like a mad woman. At the station she took the long pin out of her hat and attempted to stab the inspector.—Directly Singleton began to cross-examine, the constable excitedly told the magistrate that the prisoner had been dismissed from the force, but the magistrate sharply stopped him with the rebuke, \"You are as bad as he is. We will hear one case at a time.\"—In cross-examination, the witness denied that he kicked the prisoner in the head.—Singleton then went on to explain that his wife was of a most excitable disposition, and subject to fits. She had a fit that night, and it was while he was getting her home that he was taken into custody. The constable turned his lantern upon his wife's face, and he thought that was not the proper thing for a constable to do. He told the officer what his duty was, and the constable, losing his temper, took him into custody.—The magistrate, after hearing further evidence of a contradictory nature, discharged the prisoners.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206276586.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 454, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1846, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]