[{"id": "08efa93a1525cc6bd066104cf38d81edb1cbadc9", "text": "ATTEMPT TO KILL A WIFE.\n\nOn Friday, at Lambeth police-court, Littlewood Littlewood, 22, described as a potman, was charged with cutting and wounding Alice Littlewood, his wife, with a razor, at 131, Farmer’s-road, Kennington-park.—The wife was brought to the court in a cab; but her condition was such that it was decided she should not give evidence that day. The prisoner appeared to feel his position very much.\n\nThe first witness called was William Palmer, who said he lived at 131, Farmer’s-road, and was a labourer. The prisoner lodged in the back parlour with his wife and one child. About eight o’clock on Thursday evening he heard loud screams of “Murder!” and rushed down to the prisoner’s room. On entering, he saw the prisoner with a razor in his right hand. The wife was lying on the floor, and the prisoner was in a stooping position. The witness noticed that the woman’s right arm was bleeding very much. There was a severe struggle going on when the witness rushed forward and seized the prisoner’s arms and pulled him away. The prisoner then dropped the razor. Assistance was sent for, during which the prisoner remained very quiet, and made no attempt to escape. A doctor shortly after arrived, and dressed the woman’s wounds. Witness had only known the parties about a month, and both always appeared to be sober.\n\nBy Mr. Ellison: Did not hear the wife say anything, but prisoner afterwards asked to be allowed to kiss her.—Mr. J. W. Coles, surgeon, of 197, Camberwell New-road, said he was called to the house, 131, Farmer’s-road, about half-past eight o’clock; and saw the injured woman sitting on the bed in the back parlour. The woman was in a state of syncope from loss of blood. There was a slight superficial wound across the throat. There was a deep incised wound, however, on the right arm, dividing all the tissues to the bone, and two wounds on the thumb of the right hand. Such wounds must have been caused by a sharp instrument, such as a knife or razor. At the time he feared there was danger, but that morning she appeared to be better. —Police-constable 241 P, said he was called to the house, and found the prisoner in the passage. He was being held by the first witness, who said he had attempted to cut his wife’s throat. The prisoner said, “I should like to kiss her before I go,” and on the way to the station he asked, “Is she hurt much?” and witness said he believed she was. The prisoner then said, “I am very sorry for it. I did it in the heat of passion. When I came home I saw her in the parlour, and as she did not let me in it made me angry. I’m very sorry for what I have done.” The prisoner was greatly excited, and cried very much.—By Mr. Fullager: He really appeared to be deeply sorry.—Mr. Ellison said he would remand the prisoner to see how the wife progressed.—Mr. Fullager said he wished to mention that the father and uncle of the prisoner, he was informed, had both committed suicide, and it was believed that the prisoner was not quite right in his mind.—Mr. Ellison said the attention of the surgeon would be called to that at the gaol.—The prisoner was then remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206247550.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 770, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3129, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]