[{"id": "5c00769820581403d31713713aae7845fc2b487f", "text": "TRAGEDY AT LAMBETH.\n\nAt the Lambeth Police-court, on Monday, John Gavan, eighteen, described as a compositor, of No. 30, Hercules-road, Lambeth, was charged before Mr. Biron, Q.C., with the wilful murder of his father, Patrick Gavan.\n\nInspector Martin stated that at about half-past twelve that morning the prisoner was brought to the station, and was afterwards charged with murdering his father. He then made the following statement, which witness took down in writing, and which was signed by the prisoner:\n\n\"I was compelled to do it to save my life. My father and brother were conspiring together to poison me and kill me, and if I hadn't killed him he would have killed me. He put lice in my food, and white things all over the room. I bought the knife in Union-street about a week ago, and gave eightpence for it, intending to do it, but my brother was jolly cute, and prevented me. We went to bed about 11.0 p.m., and he constantly kept waking me; so jumped across on the floor and stabbed him in the back. He got up and began to fight me. I had got up three times to kill him but hadn't the heart. My brother then jumped out and began fighting me, and then my father fell on his side and seemed to fall asleep. I told my brother to take me to the station and fetch a doctor, but I don't know why they keep me here. I intended serving my brother just the same, but he was jolly cute.\"\n\nWitness went to the house and there saw the body of the deceased. A small dagger was plunged between the left shoulder-blade and the spine. The man was quite dead.\n\nIn answer to his worship Inspector Martin said the knife had been plunged in right up to the hilt. He produced the dagger. The blade was about five inches in length.\n\nMr. Biron (to prisoner): Do you want to put any questions to the inspector?\n\nPrisoner: No, sir.\n\nMr. Biron remanded the prisoner for a week, and directed Inspector Martin to communicate with the Treasury.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811643.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1476, "total-output-tokens": 483, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1929, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]