[{"id": "f1dd698f51bfcc6b969c7c72ff5ddae800bd157d", "text": "JEWEL ROBBERY AT EAST-\nBOURNE.\n\nThe Eastbourne police are engaged in investigating a curious robbery. The bedrooms of two ladies—Mrs. Sinclair and Mrs. Headland—who are lodging at 11, Moseyn-terrace, Eastbourne, were entered one evening last week; while the ladies were at dinner, and jewellery to the value of some hundreds of pounds was stolen. Bills offering a reward of 100l. for information which will lead to the recovery of the property and the discovery of the thief or thieves have been issued. Mrs. Sinclair's bag contained the following articles:—A transparent onyx fly-pattern brooch with pearl head and wings; a pearl pin brooch with diamond horse shoe, a gold brooch set with diamonds and pearls; a diamond cluster brooch; old Indian silver coin brooch, Burmese silver coin brooch, chain, necklace with five pearls and diamonds, a rose cluster, lady's broad gold band ring set with one large turquoise; lady's half-hoop ring set with five large diamonds, with inscription \"God bless you; Nov. 24, 1886,\" thereon; lady's triple cluster ring set with two large diamonds and one coral surrounded with small diamonds; lady's gold cluster ring set with one pearl, surrounded with diamonds; diamond star with screw fastening forming head ornament, paste buckle, lady's black oxidised watch with black dial and gold figures, makers Aird and Thompson, Glasgow, in black leather wristlet; 25l. in gold coins. Mrs. Headland has lost an amethyst brooch, a mosaic brooch by Castellani, of Rome, in form of a cross with very narrow rim of gold, and \"Dux, Rex, Lux, Lex\" thereon; a gold brooch containing dark and fair hair at the back, with \"E.H., July 8th, 1876,\" and \"G.E.M.G., February 27th, 1878,\" thereon; gold band bracelet set with purple amethyst with small diamonds between, and a fluted white enamel setting safety chain attached, a gold bracelet, snake pattern, a set of car-buncles with pendant locket containing hair; a lady's gold Geneva watch with good diced dial, No. 3,573, a gentleman's gold link-pattern Albert chain.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206277701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 531, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2037, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]