[{"id": "6ca912e5edf779838e6709601a8b18423285db48", "text": "THE LONDON BRIDGE EXPLOSION.\n\nMr. Wm. Carter held an inquiry at the Neptune tavern, Neptune-street, Rotherhithe, on Monday, concerning the death of a man whose body was found in the River Thames on the previous Tuesday, who, it was rumoured, was one of the three persons who hired a boat at Queenhithe, and who are suspected of having attempted to blow up London-bridge.—Emma Alice Williams recognised the body distinctly as that of her husband, named Henry Williams, aged 30, a traveller for a firm of mineral water manufacturers. She had not lived with him for 15 months. He was a very heavy drinker, and at times he had appeared strange.\n\n—Mr. G. S. Bray, of the firm of Dow, Clark, and Bray, mineral water manufacturers, said that he identified the deceased as having been in the firm's employ as traveller, and who was known as Harry Williams. Witness last saw him alive on the evening of Nov. 29, and he was then the worse for drink, and he left the premises in that state.—The coroner, addressing the representatives of Scotland-yard, inquired whether there was any foundation for the report that had been circulated that deceased was implicated in the recent attempt to blow up London-bridge.—Inspector Moore replied that he thought not; but at the same time, the deceased's description and clothing tallied with that of one of the three persons who hired the boat at Queenhithe on the night in question, and hence the suspicion.—The coroner remarked that they could not carry the case any further, and after some little discussion the jury returned an open verdict of \"Found drowned.\"\n\nA man named Joseph Fennelly, described as of Birmingham-street, Dudley, was apprehended there on Thursday evening on a charge of being a person wandering about for the purpose of feloniously destroying property. His description agreed with that of a man \"wanted\" in connection with the London-bridge outrage. He was brought before the magistrates on Friday, and the Chief Superintendent of police asked for a remand. The accused, in answer to the charge, said he was educated in Ireland, and went to Bombay. He had to return to England, and, finding some difficulty about his certificate, had to take to hawking. He denied any felonious intent. Fennelly was then remanded, Mr. Burton promising that he should be well treated in the meantime, and set at liberty at once if found to have been wrongly apprehended. The accused was liberated yesterday morning, it being discovered that he was not the person \"wanted,\" although somewhat resembling him.\n\nThe man whom we last week reported to be in custody at Deptford on suspicion of being concerned in the London-bridge explosion was detained till he became sober, when it was found that the story told by him in the public-house, for which he was arrested, was a pure invention. He was therefore released, although he could have been prosecuted for falsely representing himself as a police officer.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206258468.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 657, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2940, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]