[{"id": "caf4dea23276d6cf149cfbd26b5705322b9139c5", "text": "THE ADVERTISEMENT DUTY.\n\nThe following objections to the advertisement tax on newspapers were submitted to the Chancellor of the Exchequer by the deputation on Saturday:\n\n1. Because it is a tax on knowledge, and falls with partiality on an important portion of the press—the newspaper, magazine, and periodical. All other means of advertising escape the duty.\n\n2. It is an unjust tax. It cannot be equitably assessed or collected. The poor man pays 1s. 6d. to advertise for employment.\n\n3. It falls heavily on particular classes of property, impounding to an important extent advertisements in journals. In America, any man who wishes to lend or to hire, to buy or to sell, announces his wish, without being subject to any duty, for 1s.\n\n4. It acts most injuriously on literary works striving at cheapness. The cost of advertising sometimes amounts to more than the whole profit of author and publisher on works which are successful.\n\n5. It is a tax which goes far to fetter the free extension of the press, and prevents the circulation of a sound and wholesome literature among working men. In America there are 850 daily papers, in England there are only ten.\n\n6. It creates a monopoly. It is only the comparatively prosperous tradesman who can afford to advertise—the intelligent mechanic is excluded from newspaper publicity.\n\n7. It is one among many of the fiscal errors committed when the true principles of taxation were comparatively unknown. It involves the same principle by which the lowest-priced Bohea is taxed at the same rate as the highest-priced Pekoe or Souchong—on which the miserable shirt-maker is made to pay a duty of about 300 per cent. on the original value of the article which she consumes, while the rich pay about eighty per cent. only.\n\n8. It is a tax that should be repealed, because the public would derive the full benefit of the repeal. In many cases a larger reduction than the duty would be made by newspaper proprietors.\n\n9. It is a tax which is easily and largely evaded. The blank wall, the advertising van (dangerously blocking up the public thoroughfares), the omnibus, the railway carriage, the railway station, the street pavement, and many other modes of advertising, reduce the amount paid to Government to a comparatively small amount, and leave its pressure exactly where it is most severely felt, and where many grounds of public policy condemn it.\n\n10. In a word—it is a great impediment to trade, literature, and labour, seeking a market through publicity, and to the newspaper press for that reason; while the small amount of revenue which it yields—about 160,000£ per annum—renders it altogether unworthy of retention, at a cost of a tithe of the hardship and injustice which it inflicts.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206304562.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 619, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2741, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]