[{"id": "09b933ca9719490ba6be700d3ef389fb078cd1ad", "text": "A CONSTABLE COMMITTED FOR TRIAL.\n\nThe hearing of the case against Police-constable Pearce, 499 M, who is charged upon a summons with assaulting a young fellow named Briggs, and which has occupied the attention of Mr. Fenwick during a considerable portion of the week, was resumed, at the Southwark Police-court, Mr. Sydney again appearing for the defendant. Police-constable Mittens, 233 M, who, it will be remembered, corroborated the man Briggs, as to the alleged assault, was recalled, and in answer to Mr. Sydney admitted that he, while stationed at Greenwich, was fined two or three days' pay, and, when farther pressed, that the fine was inflicted for telling deliberate falsehoods in connection with a report which he made to his superior officers. At this stage Mr. Fenwick expressed a wish to hear the evidence of a young man named Devine, who followed the parties to the station. When in the box Devine said he walked behind the defendant and saw no assault committed. He did hear 233 M say that the accused had struck Briggs, but as he (witness) was ordered to attend the court next morning he did not think it worth while contradicting him at the time. Police-constable Greenwood, 272 M, the officer whom Briggs alleges gave him 10s. \"to square the case,\" was next called, and denied the statement in toto. He further deposed that, as Briggs left the court on the day he was charged with assaulting the defendant, he said to witness, \"What that old copper (233) says is lies, but I'll say it's true unless he brasses up. I mean to get a bit of my own back, and it is worth three quid to put me out of the way for a time.\" John Briggs, the brother of the complainant, then gave evidence as to being \"treated\" by Police-constable 272, whom he heard make overtures to his brother to \"square it.\" Mr. Sydney, addressing his worship, observed that during the course of the inquiry a very serious allegation against Mr. Stevens, the inspector who took the charge against Briggs, was made, which was that when he (the complainant) was put forward that the defendant committed an assault, and directly his worship had ordered a summons to be issued had actually in the court told the defendant to square the matter. He desired to say on the inspector's behalf that he had two officers of the court—one the usher—who would tell his worship that Inspector Stevens did not leave the witness-box until close upon half an hour after the case had been disposed of and all the parties had gone. Mr. Fenwick said he was sorry he could not allow the statement to go upon the depositions, as it was not germane to the inquiry, but he would certainly direct that the officers mentioned should attend the sessions for the purpose of giving evidence if the Court desired it. Police-constable 233 here stepped forward, and said he wished to add to his evidence the fact that Inspector Stevens had on more than one occasion reported him, and given him a \"jacketing.\" Mr. Fenwick said that, having regard to the serious issues involved, and to the fact that other proceedings must inevitably arise out of these, he was of opinion that the case was eminently one which should go before a jury, and accordingly committed the defendant for trial on his own recognisances.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810564.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 759, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3256, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]