[{"id": "34fcd6354a60bbe770b9a0c139104deaa3e57e03", "text": "ANOTHER MURDER AT DUNDEY.\n\nThe excitement consequent on the terrible murder of old Mrs. Waterman, for which her murderers, Matthew Wedmore and Charles Wedmore, were executed at Taunton as recently as Friday week, has not had time to subside as the committal of another very bad murder has been discovered in the same neighbourhood. The circumstances connected with the discovery are as follows:\n\nAt a distance of about a hundred yards or so from the cottage in which the former terrible tragedy was enacted, there is an inclosure called the Tinkers' Field, belonging to a person named Stallard. Attached to this house is a field, which strangely enough formed part of a farm the occupier of which, an elderly man named Hazell, was murdered under circumstances which have up to the present been thought to be identical; some nine or ten years ago. In this field is a pond, to which, on Saturday afternoon, a daughter of Mr. Stallard went, for the purpose of dipping out some water. On approaching it, she observed something moving, which proved to be a child, which was a sheep-baby, and supposing that there had been some sheep-stealing going on, she called her brother. He procured a stick, and got it out, and then they discovered to their horror that it was the mutilated body of a child. Shortly afterwards they discovered some clothes, lying on the side of the pond, and they discovered some clothes, which had apparently belonged to the same child. Mr. Stallard, the surgeon, was at once applied to, and discovered, on examining the body, that the skull of the deceased had been fractured, apparently by being struck against a stone, and that the body was cold, and also that a wound six inches long had been inflicted on the back of the neck. Information was at once given to the police, and Superintendent Jones, Police-constable Drew, and Acting sergeant Moses, of the county constabulary, were immediately engaged in investigating the matter. Suspicion fell on a woman of bad character, who is well known to the police as cohabiting with, and having had children by a man who lives at Blackwater Down. A stout dark-haired woman, Mrs. Dudley, and her child, a child of about four months old, similar to that found. She called at the Compasses tavern, and Mrs. Stallard noticed that the little creature appeared as if neglected, and mentioned her opinion to the mother. Some days after the woman was there again without the child, and the baby buried at Edsel. The clothes found were submitted to Mrs. Stallard's inspection, and she expresses the strongest belief that they are the same which the child had on the evening when the woman brought it with her to the house.\n\nThe police have been successful in tracing out the woman alluded to; but as she was enabled to produce evidence corroborative of her statement, she was, of course, left at liberty. The suspicion has now been transferred to Mrs. Dudley.\n\nAn inquest on the body of the murdered child has been opened, at which Mr. Gould, the chief of police, obtained an adjournment of the inquest for a week, in order to afford time for inquiry. The police, he stated, were unable to come to any facts to connect the perpetrator of the wicked crime, and it might assist them if the inquest were left in such a state as that fresh witnesses might be brought before them.\n\nTHE CHILD MURDER AT HORSEY.\n\nOn Thursday, Anne Reed, eighteen, a good looking young woman, was indicted at the Old Bailey for the willful murder of the female illegitimate child by cutting its throat. She appeared in court suffering great mental anguish, and was nearly in a fainting state during the trial. It appeared that the prisoner was a domestic servant, and that on the 13th of January she was delivered of the child in question, and that on the following day she placed the child in the care of Mrs. Martin at Horsey, in a very exhausted and feeble state, and Mrs. Martin put her to bed. The prisoner was then asked for the key of her box, and she said that she had lost it in the box; but shortly afterwards Mrs. Martin found the key in the woman's pocket, and upon opening the box she discovered the dead body of a child in a pie-dish, with its throat cut from ear to ear. Two medical gentlemen, named James and Horner, were called to examine the body, and gave opinions which convinced them that the child was a full-grown child, and that it had been born alive. They also stated that the death was no doubt occasioned by loss of blood, but they could not say whether the loss had been the result of the wound in the throat from the prisoner not having professional assistance at the time of the birth. These gentlemen now expressed themselves unable to give any positive opinion whether the child had been conceived immediately before or after the death of the child.\n\nMr. T. Atkinson made a most feeling appeal to the jury on behalf of the prisoner, and he urged that upon the testimony that had been given by the medical gentlemen, they should consider return a verdict against the prisoner, which would immediately have the effect of consigning her to the scaffold.\n\nThe jury, after a short consultation, found the prisoner not guilty of wilful murder, but guilty of concealing the birth. Mr. J. Dunning, on the part of the Attorney-General, stated that the prisoner had already been between three and four months in prison. The prisoner was sentenced to be imprisoned and kept to hard labour for one year.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206210894.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 1198, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5455, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]