[{"id": "13849e3d02d085bb535e2e5c8c7c32d036c854fd", "text": "ACCIDENT WITH MACHINERY.\n\nMANCHESTER, FRIDAY.—On Wednesday evening a man named Wm. Jackson, one of the stokers at the works of Messrs. Thomas Bury and Sons, dyers, Adelphi, Salford, and who had also the care of the machinery in work, met with a shocking accident. He had been sent out, soon after dinner, by the foreman of the works to take some machinery for repair, but had unfortunately taken advantage of the opportunity to obtain some drink. When he returned, the foreman perceiving that it was dangerous for a man in that state to be near machinery, he ordered him to go home. The man left the works, but between the hours of six and seven o'clock he returned, and encountered the foreman, who, however, contented himself with a look of disapprobation, and passed him without thinking it necessary again to order him to leave the premises. He was seen afterwards to take a lamp and go into a corner of a passage between two walls, where it is presumed he stooped down to examine the machinery revolving a little below the floor. The machinery in this place is ponderous, and of a very complicated character, consisting of two large vertical cog-wheels giving motion to horizontal wheels and slides working a pump, which is used to fill the boilers. Amongst this complicated mass of machinery Jackson must have fallen almost immediately, for a person working in an adjoining room suddenly heard a crash, as if something had disturbed the motion of it, and running into the passage, he saw the unfortunate man in the act of being torn to pieces amongst the wheels. He lost no time in going to the engine-house and getting the machinery stopped. Every exertion was then made to drag the body from its position, but this was a work of great difficulty, and when accomplished, it was too shockingly mangled for description. Both legs and both arms were torn from the body, only the head of the unfortunate man being uninjured. Altogether, the body was in above twenty pieces. Life had of course passed away long before the body was released. An inquest was held to-day on the remains of Jackson, by Mr. Rutter, the county coroner, when it appeared that there was no blame attributable to any one but the deceased himself. He had been at work at Messrs. Bury's six years, and was, generally speaking, steady; but it was the practice, on all occasions where men appeared to have had drink, to order them from the premises until they were sober, and this course had been taken with deceased. He had returned probably before he had entirely recovered from the effects of liquor; and there was little doubt, from the position in which he was discovered, that he had stumbled head foremost into the machinery whilst stooping with a lamp to examine the slides, which in the morning had been rather out of gear, and under which he had temporarily put some pieces of wood in the place of brass fittings that had been sent to be altered. The jury returned a verdict of \"Accidental death.\" Decesed was fifty years of age.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201314.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 678, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3011, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]