[{"id": "476286bd7d81ea3f8be53216c5bae6258d5c6690", "text": "THE PEACE SOCIETY.\n\nThe annual meeting of this society was held on Tuesday night in Finsbury chapel, Moorfields. Mr. J. W. Pease, M.P., presided, and among the other M.P.'s present were Sir Wilfrid Lawson, Bart., Messrs. George Palmer, Lewis Fry, A. M. Sullivan, and Henry Richard. The latter gentleman read the report, which denounced in strong terms the \"spirited foreign policy\" of the Government, as did all the following speakers. Sir Wilfrid Lawson, in a speech which elicited much laughter, said there was a Society for the Prevention of Cruelty to Animals, but when a man was the cause of the loss of thousands of human lives, the Queen made him an earl, and people sent their pennies to present him with a golden laurel wreath. The official representatives of the people in Parliament had approved of the foreign policy of the Government, but whatever the people thought now the day would come when the nation at large would speak out, and it would be no distant day when Lord Granville and Mr. Gladstone would be called back to power. The meeting by resolution rejoiced that the peace concluded at Berlin brought to an end one of the most destructive wars on record, but deplored the policy of menace and military preparation adopted by our own Government before going into the Congress. The meeting desired also to record its solemn protest against the wars in Afghanistan and in South Africa, as utterly incapable of justification on any principle of justice or humanity. The last resolution passed by the meeting was as follows:\n\n\"That this meeting approves the course taken by the committee of the Peace society in sending a deputation to Berlin, to bring the question of arbitration before the Congress of the Great Powers, assembled in that city to negotiate the terms of peace; and while rejoicing that the principle embodied in the Protocol of Paris of 1856 has been reaffirmed, regrets that some further steps were not taken by that august body to recognise in a more distinct and authoritative form the duty of civilised nations to have recourse to peaceable means of settling their disputes, instead of appealing to the sword.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206244471.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 478, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2148, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]