[{"id": "28457df47e844b4b30bc800a8a3545400ceb7a64", "text": "MARY-LA-BONNE.\n\nATTEMPTED SUICIDE IN A STATION-HOUSE.—Yesterday, Mary Ann Turner and Elizabeth Hayley, who described themselves as \"unfortunate girls,\" were brought before Mr. Hoskins, charged with the following disorderly conduct:\n\nIt appeared from the evidence, that on the previous night, as police-constable 123 S was on duty, he heard a great disturbance in the Hampstead-road, and on going to the spot found the prisoners, who were both intoxicated, in the act of deciding a quarrel by a pugilistic contest, surrounded by a mob of low characters, and divested of their bonnets, caps, and shawls; the prisoner Turner was the more violent of the two, and before the disgraceful scene was put an end to, she had actually torn out a considerable portion of her antagonist's hair by the roots; they were ultimately conveyed away to the station-house in Albany-street, but had not been confined there above an hour, before one of the constables present detected Turner in the very act of tying round her throat a silk-handkerchief, one end of which was securely fastened to the iron window-bar of the cell; she at length became more calm, and promised not to repeat the attempt; the constable then closed the door, and shortly afterwards fancied that he heard a kind of gurgling noise, which again led him to the place of her confinement, on entering which, he discovered her suspended from the same place by her garters, quite black in the face, and apparently in the agonies of death; he immediately drew from his pocket a clasp-knife, with which he cut down the unhappy and dissolute girl, who after the lapse of some time recovered, and expressed the greatest sorrow and contrition for the attempt she had made upon her life.\n\nMr. Hoskins having ascertained that the prisoners had not been charged with misconduct at any former period, discharged them both with a suitable admonition, at the same time telling them, that for a second offence they would be sent to the House of Correction.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3207643410.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1936, "total-output-tokens": 470, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1992, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]