[{"id": "375571280f602cb192632a1f15a256223529edba", "text": "ALLEGED GREAT ROBBERY.\n\nAt the Mansion-house, on Thursday, Charles Martin, or Martuo, described as of 38, Southampton-row, Holborn, but who declined to say of what profession, was charged on suspicion of being concerned, with other persons not in custody, in stealing, while in transit between London and Paris, on or about the 1st of June last, bonds of the value of about 70,000L, the property of Henry Louis Raphael, of 25, Throgmorton-street, stockbroker, and others; also with feloniously receiving two of the said bonds—viz., one Russian bond, No. 13,057, of the value of 100L, well knowing the same to have been stolen, the property of the said Henry Louis Raphael.—Mr. Joseph John Quye, living at Upper Lewisham-road, was called, and said: I am clerk to Messrs. Clapham and Brothers, stock and share brokers, 54, Threadneedle-street. I produce two Russian bonds. They were brought to our office on Wednesday by a clerk to Mr. Pearson, a money changer, in Cranbourne-street, Leicester-square. Our client communicated with Raphael and Sons, and did not change them.—The next witness was Stanley Trehern, clerk to Messrs. Raphael and Sons, bankers, who said:—On the 1st of June last I packed a parcel containing 10,500 Russian bonds of the year 1862 for transit from London to Paris to their correspondents there. (Shown two bonds.) These formed a portion of the bonds so specified. The bonds did not arrive at their destination.—Mr. Henry Samuel, of Bayswater, being called as a witness, said:—I am a tobacconist. I took the two bonds produced to Mr. Pearson, money changer in Cranbourne-street, which I had received from the prisoner. He came to me on Tuesday, the 28th August about the hour of four p.m. at my own shop, and, showing me the two bonds, said I could change them for him and pay him the amount to-morrow. I said I could do so, and he said they must be paid in cash. He arranged to call on Wednesday afternoon between two and five o'clock, and on his arrival I handed him over to the police. I have known him by the name of Martin, and I understood he was a commission agent. I have known him about three months. I did not know where he lived. He spoke in French to me.—On this evidence the prisoner was remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206328810.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 594, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2233, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]