[{"id": "78b163ac0dc18482d75f447d624c8de8d6a595c7", "text": "THE SENSATIONAL CHILD MURDER CASE\n\nThe sensational case in which a Burnley manufacturer, named Ashworth Read, and a woman named Elizabeth Ann Remington, domestic servant, who had been in his employ, are charged with the murder of their illegitimate child, reached another stage at Manchester on Thursday. The prisoners, according to Remington's confession, suffocated her child, and left the body in a secluded spot near the city. The prosecuting solicitor said that evidence of such an important nature had been obtained within the last two days that it would not be right to close the case without laying it before the Bench; but he should have to take a remand before producing it. He would show that after Remington left Read's house at Burnley, and took lodgings in Manchester, where she was confined, she was in constant communication with Read. The charge of murder would be maintained, and Read would also be charged with being an accessory before and after the murder. Inspector Caminada was then called and put in a statement made by the prisoner Remington, who accused Read of helping her to suffocate the child in Dark Hole Clough. Witnesses were called who had seen Remington often in company with Read, and Mrs. Remington, stepmother of the female prisoner, stated that she became anxious about the girl's disappearance in May, and made inquiries of the male prisoner, who professed ignorance of the girl's whereabouts.\n\nOn August 7th, in consequence of a letter which had been received from Mr. Barnsley, to whom the female prisoner was engaged, witness went to Todmorden from Burnley. Read travelled by the same train, and also left it at Todmorden. Witness did not find her stepdaughter, but left a letter for her. At night Elizabeth came to the house at Burnley. One witness deposed that on July 31st, when Remington was dressing the baby, she said, \"Hold you tongue, Mick; you are going to see them that don't like babies.\" The last three days that she was at the witness's house Remington was in a fearful state of distress, and \"like as if she was dazed.\" Witness was called away, and when she came back Remington and the baby were gone. A week later witness heard through the newspapers of the finding of the child's body in a clough at Blackley. The case was remanded for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812176.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 532, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2302, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]