[{"id": "484f74dd2ca77f14265a7f02e520c743b83c11be", "text": "A WELSH FARMER'S DIVORCE CAUSE.\n\nThe judge of the Divorce court and a special jury have had before them the cause of \"Powell v. Powell and Jones,\" which was a husband's petition for a dissolution of his marriage on the ground of his wife's intimacy with the co-respondent. Both the respondent and the co-respondent answered, denying the charges. The trial commenced on Saturday and was resumed on Wednesday.—Serjeant Ballantine said the parties lived at Trecastle, and at the time of the marriage petitioner was a small farmer, but was now a man in a good position. In 1855 he married the respondent, who was a lady of superior position to him, but there was no reason to suppose that the marriage was one of anything but affection. They lived happily together until there was an occurrence about a person named Reece, and after that there was a deed of separation drawn up between the petitioner and the respondent, and they lived apart, Mr. Powell allowing his wife 40l. to 50l. per annum. There was no doubt that a considerable intimacy sprung up between the respondent and the co-respondent, and he visited her, and from what occurred the petitioner had no alternative but to institute these proceedings. The co-respondent was seen to visit the respondent late at night.—The petitioner spoke to the facts attending his marriage and the separation. His wife was well-connected, and was a relation of a former sheriff of the county.—Cross-examined: Witness had no children by his wife, and at his demise his money would descend to his brother's children.\n\nThe evidence given on behalf of the petitioner, consisted of the testimony of persons who saw the respondent and co-respondent often together, and noticed Jones visiting the respondent at her house, sometimes in the evening. One witness stated that he on one occasion slept with the co-respondent, and in the night they got up, and Jones went to Mrs. Powell's and then returned.—William Morgan, a photographer, spoke of visiting Trecastle, and becoming acquainted with the co-respondent, whom he twittered with being too intimate with Mrs. Powell, and he did not deny it. This witness was introduced to the respondent and took her likeness, and the co-respondent arranged her dress.\n\nThe Attorney-general addressed the jury for the respondent, and stated that the case was a difficult one to deal with, as there was no direct evidence of the misconduct, and the jury were asked to draw inferences. The petitioner was now a man worth thousands a-year, and he had no children after seven years' cohabitation with his wife, and at his demise the property would depart from his family. If he married again, after obtaining a divorce, there might be issue. This, the learned counsel suggested, was probably the explanation of the present suit being instituted. Whilst the learned counsel was addressing the jury the learned Judge stated that he had received a communication from the jury to the effect that, in their unanimous opinion, there was no evidence of adultery having been committed. This opinion Sir James Hannen said he coincided with.—The petition was then dismissed with costs.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206320051.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 691, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3143, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]