[{"id": "0afe1a72a9e117d684e15b4b85a7145d95d35b49", "text": "A SMART CAPTURE.\n\nJames Morris, a tailor, giving an address in Cowper-street, City-road, was charged before Mr. Curtis-Bennett, at the West London Police-court, with being a suspected person. Detective-sergeant Brown, F Division, deposed that on Wednesday evening he was in a train which arrived at High-street, Kensington Station, on its way to King's Cross. He looked out of the window and saw the prisoner on the platform in the company of two other men. Suspecting them he immediately alighted, and saw the two men hurry in front of a lady who was making her way to a third-class carriage, the prisoner following behind. The two men pretended to get in and kept the lady back. The prisoner went up with a paper in his left hand, and passed the right under it into the lady's pocket. Thinking he had taken something, witness caught hold of both his arms and held him. The prisoner struggled and said, \"What are you doing—you have made a mistake; where are your witnesses?\" He told him to be quiet and said he would tell him. He called for assistance but no one came, and the two men went off by the train, in another compartment. He took him to the police-station, and while the charge was being preferred the prisoner said, \"You say the right hand was put into the lady's pocket, I always thought that it was the left.\" In answer to the charge the prisoner said the officer had made a mistake. No one was with him. Mr. Curtis-Bennett asked the prisoner to give an account of himself and to call witnesses on his behalf. He said if the prisoner was a respectable man he could call them. The prisoner said his friends were in Paris and Monte Carlo. Mr. Curtis-Bennett committed the prisoner to goal for three months with hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810281.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1568, "total-output-tokens": 414, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1735, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]