[{"id": "3aeeeb3904b0d3d1585016cfd0ef648f1b7df1bd", "text": "THE FRIMLEY MURDERERS IN HORSE-MONGER-LANE GAOL.\n\nYesterday (Saturday) afternoon, John Sparkes, Esq., the high sheriff of Surrey, accompanied by Mr. Smallpiece, one of the under sheriffs, arrived at Horsemonger-lane gaol, from the Home-office, with warrants for the execution of Levi Harwood and Jones, the two men sentenced to death by Baron Parke, at Kingston assizes, on Tuesday last, for the murder of the Rev. Mr. Hollest, at Frimley. The sheriffs were conducted to the respective cells of the condemned convicts by Mr. Keane, the governor of the gaol, when the warrants were made over to them by the sheriffs, who exhorted them to prepare for death, as no hopes could be entertained of their lives being saved. Jones received the awful announcement in a very deplorable state, but Harwood seemed rather indifferent as to his fate. Each of the unhappy men are confined in separate cells, with two turnkeys to sit up with them night and day. Since his condemnation and removal to Horsemonger-lane gaol, Jones's conduct has wonderfully altered. Instead of that callous look and sullen demeanour, he has been very attentive to the exhortations of the Rev. Mr. Rowe, the chaplain, and to the religious books offered for his consolation, and it is likely that he will make a confession in the course of a few days. The execution of the criminals is ordered to take place on Tuesday morning, the 15th inst., at nine o'clock, on the top of the entrance of Horsemonger-lane gaol. Smith, the approver, and Samuel Harwood, are also confined in separate parts of the prison; but the latter will shortly be removed into Sussex for examination respecting other burglars he is supposed to be concerned in, in that county. Yesterday the high sheriff had a long interview with Smith, the particulars of which have not transpired. Both Jones and Harwood declare that he was the party who shot the Rev. Mr. Hollest.\n\nTHE OTHER CONVICTS UNDER SENTENCE OF DEATH.\n\nLyons and his wife, who were convicted at Liverpool, on Tuesday last, for the Warrington murder, are to be executed in front of Kirkdale gaol, near Liverpool, on Saturday the 19th inst.\n\nThe convict, George Baldry, who was convicted at the last Norwich assizes for the murder of Caroline Warnes, a little girl, only thirteen years of age, by beating out her brains with a hammer, on the 8th of August last, has been respited during her Majesty's pleasure, in order that an investigation take place to ascertain whether the prisoner's intellect is impaired.\n\nThe execution of Willis and Smith, for the Newport murder, will take place at Taunton, on Wednesday, the 23rd inst.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206197594.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 638, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2622, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]