[{"id": "1f87d07d6ae5b8ec068824de78242095f6948109", "text": "CHARGE OF CRUELTY AGAINST A FARMER.\n\nMr. Rowland Goldhawk, a gentleman farmer, of Hazel-hall, Shere, near Guildford, was summoned to the council chamber of the latter place, for cruelly torturing and burning a bullock on or about the 17th ultimo.\n\nFrom the evidence of several witnesses in the employ of the defendant, it appeared that on the 9th of last month the defendant was in a field with some of his servants, who were endeavouring to get a bullock to work; when, finding it would not move, he directed that some straw should be put under it and set fire to. This was done, and the animal got up and ran away. It had also been done to other bullocks, but the witnesses would not swear that the bullock of which the society had taken notice, and which was now lying in a field unable to move, was the one. The one in the field was hurt by falling over a high hedge.\n\nThe chief evidence against the defendant was that of a gentleman named Onslow, who said that on the 29th of last month he saw a bullock in a field of the defendant's very sick and unable to move. On its legs were large wounds, which were bleeding. It was burnt on both its hind fetlocks, and there were strips of skin hanging from one of its legs. The belly was raw and bloody, and the animal was in a state of great suffering, the hair being singed off. He wrote to the defendant, saying that it was a case of great cruelty, and the defendant wrote in reply that it was no worse than fixing a horse.\n\nA witness of the name of Lewis stated that he saw the animal on Friday, and the near hind foot appeared to be falling off, and the flesh was off for some distance up the leg. The cattle doctor who attends to the defendant's cattle said, when he first saw the animal that was now in the field, it had upon it wounds which were raw, and appeared to be caused by fire. The animal is now unable to move, and ought not to be left in the place it now is.\n\nMr. Robinson said he could have taken a technical objection, viz., that the summons had not been taken out within one calendar month, as specified by the act of parliament, but the prosecution had failed to show which animal it was the prisoner had tortured. The prisoner was a kind man, and the putting a small quantity of straw under the animal's nose, and lighting it, was much kinder than using a spear.\n\nThe chairman (Mr. Best, who was supported by Lord Lovaine, M.P., Mr. Drummond, M.P., and a full bench of magistrates) said there was no evidence to connect the burning of the animal with the one that was now in the field; and therefore, without expressing any opinion on the case, the summons would be dismissed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206206772.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 637, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2646, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]