[{"id": "41917626cb35da6d7b3693ff53c5368066ac84fe", "text": "IX. Ett kort utdrag af en journal, hållen på en resa til och uti Kejsaredömet Japan, gjord af Doctor Thunberg åren 1775 och 1776, skrifvit til Herr Joseph Banks, Præsens uti Royal Society, i London (a).\n\nRead Feb. 10, 1780.\n\nNär min Herre, i början af innevarande år, under mit vistande i London, behagade introducera mig uti åtskillige fälskaper, der flere af Wetenskaps Societetens respective Ledamöter voro tillsammans, gjordes mig åtskillige frågor, angående det sünnerliga landet Japan och dess inbyggare, som jag då uti största korthet hade den äran at besvara; men för at vidare contentera få väl Societetens, som min Herres enskilta nyfikenhet, adresserar jag til min herre detta mycket korta utdrag af den Journal, jag under mit 16 månaders vistande i det aflägsna Japan hållit.\n\nDet är min Herre förut bekant, at jag af Commissarierne öfver Hortus Medicus och någre andre fornäme Herrar i Amsterdam blef utskickad först til Cap de Bonne Esperance och sedan til Japan, at göra uti Historia natu-\n\n(a) For a translation of this paper see the Appendix.\nrali nya uptäkter, och at deraf öfversända lökar och frön, samt lefvande träd och buskar. Jag uppehöll mig try års tid på Cap de Bonne Esperance, et ställe, som fournerade mig ganska många nya, både Djur och Växter, och gick derifrån år 1775 til Batavia, hvarifrån jag kort derefter, nemligen den 21 Junii, afseglade til Japan på Holländska Compagniets skjep Stavenisse, i följe med et annat skjep, kalladt Blyenburg. Refan fortsattes, som vanligt sker, förbi Pulo Sapato, Chinesiska landet och Formosa, igenom sundet der och Japanska Golfen, til Nagasaki hamn, som är den endaste i hela riket der något skjep har frihet at infegla.\n\nVi utfödo flera svåra stormar, hvaraf det medföljande skjeppet Blyenburg blef så illa medfarit, at sedan masterne blifvit förlorade, det ej kunde fortsätta refan til Japan, utan nödgades löpa in til Canton, at der repareras, och sedan gå tilbaka til Batavia.\n\nDen 13 Augusti fingo vi Japan i ögnasigte, och kommo in uti Nagasaki hamn dagen der efter. Vi infeglade uti hamnen med ganska många uphissade flaggor, och låsfåde våre Canoner vid det få kallade Papenberget, vid Kejsarens och Kejsarinnans vagter och före Nagasaki stad. Under infeglandet kommo om bord tvänne Öfver-Banjofer, åtskillige Tolkar och under officerare, samt någre Commiterade ifrån Holländska Factoriet.\n\nÖfver\nÖfver Banjoferne, som kunna jämnliknas med Manda-\nrinerne i China, gingo straxt at fitta på et ställe, som var\ntil den ändan tilredt, mitt på Skjepsdäcket, hvilket fåte\nde sedan altid nyttjade, få ofta de vistades om bord. Dese\nOfficerare, som växlas om, äro altid om bord de dagar, då\nskjeppet loffas eller lastas, och ingen ting får föras hvar-\nken til eller ifrån skjeppet, under all den tid det ligger i\nhamnen, utan at de äro tilsädes. De äga upsigt öfver\nalt det, som går ut eller in i skjeppet: för deras ögon vi-\nsiteras både fölck och gods: framför dem mönstras\nhvarje gång alt skjepsfolcket; de förlåna och undertekna\nalla passporter, och göra dageligen rapport af alt, hvad\nsom förefaller, til Gouverneuren i Nagasaki.\n\nDet första, som förekom os underligt och ovanligt,\nvar den starka visitation, som hvar och en person, och alt\ndet gods, som fördestil eller ifrån skjeppet, måste undergå.\nDenna visitation förrättades icke allenaft ganika noggrant,\nutan den skjedde dubbelt, nämligen både på skjeppet och\ni land. Sängkläderne upsprättades, och sjelfva fjädrarne i\ndem ransakades: kistor utpackades ända til botn, och\nsjelfva plankorne i dem klappades på alla sidor, til at up-\ntäcka, om in uti dem voro några hemliga gjömmor: smör-\npottor och confitur-krukor rördes inuti med en jernspits:\nuti oftar skars först et stort hål, och sedan stacks en knif\nin åt alla sidor: ja de misstroddes sjelfva äggen och flogo\näfven deraf åtskillige i stycken. Hvarje person, som går ifrån eller til skjeppet, visiteras äfven lika skarpt. Visitatorn stryker med sina händer långs ryggen, sidorne och magen, ända ned till knän, så att ingen ting på lifvet kan gömmas, utan att han upptäcker det. Denne visitation måste nu allå, utan åtskilnad, undergå, ända ifrån Chefen intil den färmsta matros, enligt de ordres, som är 1775 ankommo ifrån Kejsärliga Hofvet.\n\nTilförene var denna visitation icke allenaft mindre sträng, utan Chefen och skjepps Capitenerne voro aldeles frie ifrån den samma, och Capitenerne hade då tillfälle, att lurendräga in få mycket gods, de ville, till hvilken ända de voro klädde i en ganika stor och vid öfverråck, med tvänne stora säckar eller fickor på inre sidorne, som fyldes med contraband-varor, när de gingo til eller ifrån land, hvilcket skjedde gemenligen trenne gånger om dagen.\n\nOrsaken til denna stränga visitationen äro Europæerne sjelfve, som ifrån den ena tiden til den andra, med sine lurendrägerier retat Japaniska Regeringen, til at mer och mer inskränka deras frihet; och då den samma länge nog märkt, att ju nogare de visiterades, ju finare de öfvade sine bedrägerier, så har den omsider tagit deremot sådana mått och steg, att nu mera för den aldra-finteligaste icke en enda utväg mer är öfrig til oloflig handels drifvande. För några år sedan hade en skjepps under-\nunder-officerare in uti sjelfva byxorne fördöljt en fogel, i tanka at sälja den samma, då han kommit i land; men under sjelfva visitationen, til olycka, begynte foglen att sjunga och bedrägeriet uptäcktes: sedan den tiden visiteras utanpå hos Matroferne och sämre folck byxorne, och sjelfva håret på Slafvarne.\n\nJaponesen är til färgen gulagtig, ehuru man ibland finner någre, i synnerhet Fruntimren, som äro mycket hvita. De skiljas ifrån alle andre nationer, undantagne Chinesen och Tartaren, med sine djupe och aflange ögon samt höga ögonbryner. Näsan är ej platt, ehuru hon är något tjockare och kortare, än på en Europé. Håret är svart, och uppsättes på enahanda vis, så at en främling här icke utan största förundran, anskådar et alämänt mode, som uti hår-frisure och klädning, hos en hel nation, är oförändradt, ända ifrån Kejsarens Thron intil den lägsta koja.\n\nMännerne upskicka sit hår på helt annatt sätt, än andra könet: hela förhuvudet och midden ända til nacken afrakas aldeles, och hålles äfven så frit för hår, som hakan ifrån skjägg; det öfriga, som är vid tinningarne och i nacken, upstrykes och bindes öfver hjeßan tilhopa med en hvit tråd; utom denna bindningen lämnas håret få långt som en finger, och klippes der tvärtaf, ombindes\nmed resten af förra tråden, och böjes emot huvudet, lika som en krokug finger.\n\nAndra könnet behåller alt fit hår, utan at deraf afraka något. Håret upstrykes emot kullen och viras der tillhöpa i en knut, samt utdrages åt sidorne i tvänne breda vingar: bakom knuten sättas en kam, och igenom knuten åtskillige långa zirater utaf olika fäkapnad och ämne.\n\nMedici och Präster, som gemenligen låta raka hela huvudet, och barn, som ej ännu hunnit til manlig ålder, äro de endaste, som göra i detta modet något undantag, til at skilja sig ifrån de öfriga af nationen.\n\nHela nationen har enahanda och sin egen färskilda klädedrägt, som ifrån urminnes tider varit oförändrad. Den består uti en eller flere Natträckar, som bindas til om lifvet med et bälte. Fruntimren hafva gemenligen denne längre, och ofta fläpande efter fig. Denne natträckar äro om sommaren ganska tunna, och om vintren upstoppade med tjock filke-eller bomuls-wadd. De förnäme nyttja härtill filke, och de fattige bomuls tyger. Fruntimren nyttja deraf gemenligen et större antal, och äga dem prägtigare, ofta med inväfne guld-och silfver blomor.\n\nNatträcken är vid bröstet något öpen, och har mycket vida armar, hvars öppning framtil är til hälften ihopfydd, och formerar en säck, innom hvilken de kunna indraga händerne,\nhänderne, och i hvilken de kunna bevara papper och andre saker, lika som i en ficka. Männerne hafva utom dess en mantel eller half natträck, som räcker til höften, af ganska tunt, svart tyg, och utan på natträcken långa byxor, som mycket likna en fruntimmers kjortel, öpen ganska långt ned på bågge sidor. Med denne tvånne fednare skiljes bättre folck ifrån den fämsta pöbelen. Mange nyttja underbyxor utaf linne, men benen äro altid nakne. De brukta aldrig skor, utan endast toflor af halm flätade, försedde med en bögel och et band, som stickes emellan stortån och den nästa tån, til at hålla dem fast. Endast i vintren brukta de fäckor af linne på fötterne. När det är mycket orent och regnväder, nyttja de höga träskor. Hufvudet betäckes aldrig, om icke de äro på refor, då de nyttja en conisk hatt af halm; utan de brukta solskärmar (parasols) at skydda hufvudet för stark solhetta och regn.\n\nUti bältet, som om lifvet fasthåller natträcken, infästes sabelen, solfjädren och tobakspipan. Sabelen instickes på vänstra sidan, så at skarpa äggen altid vetter upåt. De, som äro uti någon public tjänst, draga altid tvånne sabelar, hvaraf den ena altid är längre.\n\nHusen byggas af trästolpar, som på någon distance inhuggas i hvarandra, nästan som på korsverkshus; emellan denne flätas fönderklyfde bambokäppar, och på ymse\nfidor af dem bestrykes lera och hvitlimmas, få at de likna et stenhus. Våningarné äro ofta tvänne, hvaraf den öfversta är lågare, och nyttjas ei få almänt til boning. Taken äro merendels täkte med stora och tunga, fastän vackra och väl gjorda pannor af blå lera. Golfvet, som altid är upphöjdt en aln ifrån jorden, belägges med bräder och ofvan på dem aflånga mattor, flätade och fylde med halm, utaf try eller fyra fingers tjocklek. Hela huset utgör et enda stort rum, som sedan kan afdelas i få många smärre kamrar, som de behaga, med rammar, som insättas i dertil inrättade träbjälkar, som så väl uptil under taket, som nedtil på golfvet, blifvit inlagde. Sådana rammar äro gemenligen öfverdragne med tjockt måladt papper, och likna våre tapeter. Fönstren bestå äfven af rammar, afdelte i små rutor, och påklistradt hvitt, ganiska tunt papper.\n\nMan finner aldrig några meubler uti Japonesens hus, hvarken speglar eller väggur, skåp eller bureauer, stolar eller bord, kakelugnar eller spisar, soffor eller sängar. Deras sed är, at sitta ned på de mjuka och fnygga golfmattorne, läggande sina fötter under kroppen, få at deras egna hälar blifva deras stol. Under måltiderne framfättas hvarje rätt färskild, äfven på denne mattor, dock på et litet, knapt try eller fyra tums högt bord. Speglar, som de likväli ej uppfatta i huset til någon prydnad, göra de af\naf en componerad metall, samt nyttja dem endaft vid hårets uplägning.\n\nSpisar och kakelugnar äro hos dem aldeles obekante, fastän den stränga blåsten och kölden tvingar dem, til at värma sina hus ifrån Novembris til Martii månad; men i dess ställe nyttja de stora koppargrytor med breda flata bräddar och fötter, hvilke infättas i rummen, på sjelfva golfvets halmmattor. Deffé grytor beklädas in uti med lerbruk, och fyllas til en del med ren aska, hvarpå väl utbrända furukol upståpplas, som i brand stukne upvärmra rumet, utan at osa.\n\nTobakens bruk har utan tvifvel hos Japoneferne blifvit först bekant igenom Portugiferne; men fastän bågge könens här röka och äfven ungt folck, så skjer dock fådant mycket sparsamt. När de vela fägna en ankommen främmande, så är gemenligen tobakspipan och en kopp thévatn det första, som bjudes honom. Pipan består af et kortare eller längre väl gjordt träskäft med munstycke och hufvud, utaf mässing eller hvit koppar. Sjelfva hufvudet är ej större, än at det kan ryma en stor ärt, och sjelfva tobaken, som är fulkomligen torr, karvas så fin, som hufvudhår, utaf en fingers längd: den måste altfå vridas ihop liksom til en pill, för at kunna stoppas i piphufvudet. När den blifvit stucken i brand, är pipan lättelegen\nlätteligen och med några få drag utrökt. På detta sätt röka de flere pipor å rad, samt utblåsa röken långsamt igenom näsbororne.\n\nSolfjädren nyttjas utaf bågge könen, at dermed i hettan svalka sig, och är derföre altid både innom och utom hus deras trogna följeflagare.\n\nHela nationen är fallen för fnygghet och renhet; man finner derföre uti hvarje hus, och uti alla herberg för resande en badstuga, der de hvarje dag, utan försommelse, tvätta fig.\n\nSällan eller aldrig får man se någon mansperson, som icke har sina kläder teknade med sit figils märke, hvilket med samma färg, hvarmed tyget blifvit trykt eller färgadt, på små dertil på armar och rygg hvite lämnade runde fläckar blifvit teknat, och gör, at ägaren altid igenkänner sin klädning, skjönt den funnos lagd ibland hundrade andra.\n\nHörsamhet och lydnad emot föräldrar samt ödmjukhet emot förmän i agt tages här på det alranogaste. Det är nöjsamt at se, med hvad respect, som en förnäm och en Ämbetsman bemötes. De stadna icke allenaft, om de möta en sådan, eller om han råkas i något hus, hålla sig på längre affstånd ifrån honom, utan böja äfven sine huvuden ända ned til jorden. Vänliga äro de altid emot hvarandra,\nhvarandra, i hälsningar, tal och åthörder. Barnen vänjas härvid ifrån första barndomen, och föräldrarna föregå dem med sitt exempel. Aga och straff äro fällfynte i landet, men lagar och straff ganska stränga. Människor äro väl af naturen på alle orter benägna til ondt, men knapt gifves något land, der mindre förbrytelser skje emot landets lagar.\n\nUti deras namn är någon ting, som förtjänar uppmärksamhet. Stam-namnet nyttjas aldrig i dageligt tal, utan endaft, då de undertekna någon skrift. Med förnamnet åter nämnes och ropas de i dagligt tal, och det samma förändras efter deras olika åldrar och efter olika syflor, som de med tiden bekläda, få at de i sin lifstid ibland ägt fem eller sex färskilde förnamn, fastän familie namnet altid varit oförändrat.\n\nSin ålder räkna de altid jämnt med det året, på hvilket de varit födde, antingen det skjett i början eller slutet; således räknas et barn altid årgammalt, få snart nyårsdagen infaller, än skjönt det kommit til verlden endaft någre dagar förut.\n\nHandel och flögder äro hos Japaniska nationen i flor, fast icke i den grad, som i Europa; ty deras behof äro ej få många: men Åkerbruket är hos dem uti största värde, få at man här ser jordytan öfver alt, och de mäste bergen\nända up til topparne upbrukade. Utrikes handel drifva de endaft med Holländska och Chinesiska Compagnierne. Emot Koppar och rå Campher, som Holländaren utförer, återtaga de Pudersocker, Modernäglickor, Sappanträ, Elfenben, tenn, bly, skilpadiskal, Chitser, Taffecelastyger och någre andre småfaker.\n\nSom Holländska Compagniet i Japan aldeles icke betalar någon tull för ut-eller in-gående varor, få fändas i det stället årligen skänker til Hofvet, som bestå i kläden, Chitser, Succotas, bomulstyger och stundom några rariteter. På denna resa, som förrättas endaft af trenne Europæer och vid pafs tvåhundrade Japoneser, hade jag det nöjet, at följa Ambassadören til den längst bort i landet belägna Hufvudstaden Jedo.\n\nDen 4 Martii 1776 afreste vi ifrån vår lilla ö Dezima och Nagasaki stad igenom Kokora til Simonofeki, der vi den 12 gingo om bord på et för os tilredt stort fartyg, hvarmed vi innom skärs affeglade til Fiogo. Resan fortsattes vidare öfver land til Ofacca, en af de förnämsta handelsstäder i Riket, der vi tilbragte den 8 och 9 Aprilis. Innom en dags resa ankommo vi den 10 derpå följande til Miaco, Andeliga Kejsarens Hufvudstad. Här förtöfvade vi tvänne dagar, och påskyndade vår resa til Hufvudstaden Jedo, dit vi lyckeligen anlände den 1 Maji.\n\nRefan\nResan til lands skjer altid uti Norimons, en fort af Palanquins, som äro tilslutne och försedde med fönster, samt bäras utaf flere män. Skänkerne få väl som dage-liga Provianten bäras äfven af folck uti kistor, och någre få saker föras på packhästar. Officerare och Tolkar ledsaga os, och beförja om all ting, få att vi kunna göra en nöjsam och obekymrad resa.\n\nDen 18 Maji var den dag, då vi hade hos Cubo, eller verldfliga Kejsaren, hos Kronprinsen och de tolf Riksfens Råd vår audience; dagen derpå hos Tempelherrarne, som föra styret öfver kyrkorne, och Stadens Gouver-neurer med flere. Den 23 påföljande hade vi vår afskjeds audience, afreste från Jedo den 26 Maji, och ankommo til Miaco den 7 Junii. Nu på återresan hade vi här den 8 Junii audience hos Kejsarens Ståthällare, som äfven får någre skänker, efter vi aldeles icke få aflägga något besök hos Dairi. Den 11 ånggo vi tillstånd, at vandra uti och ikring Staden, at bese deras kyrkor och större hus; men afreste emot aftonen derifrån til Osacca. Denna vackra och för sin handel väl belägna stad fingo vi frihet at genomvandra den 13, och at bese dess kyr-kor, comödier, andre märkvärdigheter, och i synnerhet huru kopparen smältes, som endast skjer i denna staden, och ei på något annat ställe mer i Riket. Hos Stadens Gouverneurer\nGouverneurer hade vi den 14 audience, och fortsatte sedan vidare vår resa till Fiogo. Efter vanligheten gingo vi här på et sfort fartyg den 18 om bord, at sjövägen afgå til Simonoseki och Kokota, dit vi ankommo den 23. Sedan blevvo vi uti Norimons burne til Nagasaki och vårt lilla factorie på Öen Dezima, hvareft vi flutade den sista Junii vår Ambaffade, efter 118 dagars resa.\nAPPENDIX.\n\nI. Translation of a short Extract from a Journal kept by C. P. Thunberg, M. D. during his Voyage to, and Residence in, the Empire of Japan, in a Letter addressed to the President. See page 143.\n\nSIR,\n\nDURING my short residence in London, where you did me the honour of introducing me to many men of learning, conversations frequently arose, in which questions were asked of me concerning the empire of Japan: to these I could at that time give answers only from memory; but, having now got possession of my papers, I have drawn out, for the farther satisfaction of the Royal Society, and your particular friends, the following short extract of a journal which I kept regularly during a residence of sixteen months in that distant country.\n\nTo you, sir, it is already known, that I was sent out by the directors of the Botanic Gardens at Amsterdam, and some other eminent men of that place; first to the Cape of Good Hope, and from thence to Japan: in order to investigate the natural history of those countries, and to send from thence seeds and living plants of unknown kinds, for the use of their collections in Holland. At the first of these places I resided three years; and during that time had the good fortune to observe and describe many new species both of animals and vegetables.\n\nIn the year 1775 I sailed from thence for Batavia, and after a short stay there, embarked on board a Dutch ship, called Sta-venisse, bound for Japan, in company with the Blyenburg. On Vol. LXX. A\nthe 21st of June, we sailed and passed Pulo Sapatoo, the Coast of China, and the Island Formosa. On the 13th of August we made the land of Japan, and the day after were off the harbour of Nagasacci, the only one in that empire where foreign ships are allowed to anchor.\n\nDuring this passage we met with severe gales of wind, in one of which the Blyenburg, having received much damage in her masts, parted company, and (as we afterwards learned) was obliged to go back to Canton, to refit.\n\nWe sailed into the harbour of Nagasacci with our colours flying, and saluted the Papenburg, the Emperor's and Empress's guard, and the Town itself. During this time there came on board of us two Over Banjoses, several interpreters, and inferior officers, and some people belonging to the Dutch Factory.\n\nThese Over Banjoses may be compared to the Mandarins of China: a place is prepared for them upon the ship's deck, and some of them (for they are frequently changed) must be present when any thing is taken out of, or received into, her. They inspect every thing, muster the people, give passports to such as go on shore, and every day report to the governor of Nagasacci the proceedings on board.\n\nThe attention and care with which these gentlemen execute the orders issued by the Imperial Court in 1775 is well worthy of relation. The most minute articles which are carried out of a ship undergo a jealous inspection, both when they are put into the boats, and when they are landed from them; and the same caution is used in embarking goods from the shore.\n\nBedding is ripped open, and the very feathers examined, Chests are not only emptied of their contents, but the boards of which they are made are searched, lest contraband goods should be concealed in their substance. Pots of sweetmeats and of butter are stirred round with an iron skewer. Our cheeses had a more narrow inspection; a large hole was cut into the middle of each, and a knife thrust into the sides of it in every direction: even the eggs were not exempted from suspicion; many of them were broken, lest they should conceal contraband goods within them.\n\nOurselves,\nOurselves, from the highest to the lowest, underwent the same suspicious scrutiny whenever we went from or returned on board the ship. Our backs were first stroked down by the hand of the inspector; our sides, bellies, and thighs, were then in like manner examined; so that it was next to impossible that anything could be concealed.\n\nFormerly, they were less exact in this visitation; the chief of the factory and captain of the vessel were even exempted from it. This privilege they used in its utmost extent: each dressed himself in a great coat, in which were two large pockets, or rather sacks, for the reception of contraband goods, and they generally passed backwards and forwards three times a day.\n\nAbuses of this nature irritated the Japan government so much, that they resolved to make new regulations. For some time they found, that the more dexterity they used in detecting the tricks of the Europeans, the more dextrously they contrived to evade them: at last, however, by repeated trials, they have so completely abridged their liberties, that it is now almost, if not absolutely impossible, to smuggle anything.\n\nThe complexions of the Japanese are in general yellowish, although some few, generally women, are almost white. Their narrow eyes and high eye-brows are like those of the Chinese and Tartars. Their noses, though not flat, are shorter and thicker than ours. Their hair is universally black; and such a sameness of fashion reigns through this whole empire, that the head-dress is the same from the emperor to the peasant.\n\nThe mode of the men's head-dress is singular; the middle part of their heads, from the forehead very far back, is closely shaven; the hair remaining round the temples and nape of the neck is turned up and tied upon the top of the head into a kind of brush about as long as a finger; this brush is again lapped round with white thread, and bent a little backwards.\n\nThe women preserve all their hair, and, drawing it together on the top of the head, roll it round a loop, and fastening it down with pins, to which ornaments are affixed, draw out the sides till they appear like little wings; behind this a comb is stuck in.\nPhysicians and priests are the only exception to the general fashion; they shave their heads entirely, and are by that means distinguished from the rest of the people.\n\nThe fashion of their cloaths has also remained the same from the highest antiquity. They consist of one or more loose gowns, tied about the middle with a sash; the women wear them much longer than the men, and dragging on the ground. In summer they are very thin; but in winter quilted with silk or cotton wadding.\n\nPeople of rank have them made of silk; the lower class of cotton stuffs. Women generally wear a greater number of them than men, and have them more ornamented, often with gold or silver flowers woven into the stuff.\n\nThese gowns are generally left open at the breast; their sleeves are very wide, but partly sewed up in front, so as to make a kind of pocket, into which they can easily put their hands, and in this they generally carry papers, or such like light things.\n\nMen of consequence are distinguished from those of inferior rank by a short jacket of thin black stuff, which is worn over their gowns, and trousers open on the sides, but sewed together near the bottom, which take in their skirts. Some use drawers, but all have their legs naked. They wear sandals of straw, fastened to their feet by a bow passing over the instep, and a string which passes between the great toe and that next to it, fixing to the bow. In winter they have socks of linen, and in rainy or dirty weather wooden shoes.\n\nThey never cover their heads but on a journey, when they use a conical cap made of straw; at other times they defend themselves from the sun or the rain by fans or umbrellas.\n\nIn their sash they fasten the sabre, fan, and tobacco-pipe; the sabre always on the left side, and (contrary to our European custom) with the sharp edge uppermost. Those who are in public employments wear two, the one considerably longer than the other.\n\nTheir houses are built with upright posts, crossed and wattled with bamboo, plastered both without and within, and white-washed.\nVoyage to Japan.\n\nwashed. They generally have two stories; but the uppermost is low, and seldom inhabited. The roofs are covered with pantiles, large and heavy, but neatly made. The floors are elevated two feet from the ground, and covered with planks. On these are laid mats which are double, and filled with straw three or four inches thick. The whole house consists of one large room; but may be divided at pleasure into several smaller, by partitions made with frames of wood, filled up with painted paper, that fix into grooves made for that purpose in the floor and cieling. The windows are also frames of wood, divided into squares, filled up with very thin white paper, transparent enough to answer tolerably well the purpose of glass.\n\nThey have no furniture in their rooms; neither tables, chairs, stools, benches, cup-boards, or even beds. Their custom is to sit down on their heels upon the mats, which are always soft and clean. Their victuals are served up to them on a low board, raised but a few inches from the floor, and one dish only at a time. Mirrors they have, but never fix them up in their houses as ornamental furniture; they are made of a compound metal, and used only at their toilets.\n\nNotwithstanding the severity of their winters, which oblige them to warm their houses from November to March, they have neither fire-places nor stoves: instead of these they use large copper pots standing upon legs; these are lined on the inside with loam, on which ashes are laid to some depth, and charcoal lighted upon them, which seems to be prepared in some manner which renders the fumes of it not at all dangerous.\n\nThe Portuguese, in all probability, first introduced the use of tobacco into Japan: however, be that as it may, they use it now with great frugality, though both sexes, old and young, continually smoke it, blowing out the smoke through their nostrils. The first compliment offered to a stranger in their houses is a dish of tea and a pipe of tobacco. Their pipes have mouth-pieces and bowls of brass or white copper. The hollow of the bowl is so small as scarce to contain an ordinary pea. The tobacco is cut as fine as a hair about a finger's length, and is rolled up in small balls like pills, to fit the small hollow in the bowl.\nbowl of the pipe; which pills, as they can last but for a few whiffs, must be very frequently renewed.\n\nFans are used by both sexes equally, and are, within or without doors, their inseparable companions.\n\nThe whole nation are naturally cleanly; every house, whether public or private, has a bath, of which constant and daily use is made by the whole family.\n\nYou seldom meet a man who has not his mark imprinted on the sleeves and back of his cloaths, in the same colour in which the pattern is printed: white spots are left in manufacturing them, for the purpose of inserting these marks.\n\nObedience to parents and respect to superiors is the characteristic of this nation. It is pleasing to see the respect with which inferiors treat those of high rank: if they meet them abroad, they stop till they have passed by; if in a house, they keep at a distance, bowing their heads to the ground. Their salutations and conversations between equals abound also with civility and politeness; to this children are early accustomed by the example of their parents.\n\nTheir penal laws are very severe; but punishments are seldom inflicted. Perhaps there is no country where fewer crimes against society are committed.\n\nTheir usage of names differs from that of all other nations. The family name is never made use of but in signing solemn contracts, and the particular name by which individuals are distinguished in conversation varies according to the age or situation of the person who makes use of it; so that sometimes the same person is, in his life-time, known by five or six different names.\n\nThey reckon their age by even years, not regarding whether they were born at the beginning or the end of a year, so that a child is said to be a year old on the new year's day next after his birth, even though he has not been born many days.\n\nCommerce and manufactures flourish here, though, as these people have few wants, they are not carried to the extent which we see in Europe. Agriculture is so well understood, that the whole country, even to the tops of the hills, is cultivated. They trade with no foreigners but the Dutch and Chinese, and in both cases\nwith companies of privileged merchants. The Dutch export copper and raw camphire, for which they give in return sugar, ripe cloves, sappan wood, ivory, tin, lead, tortoise-shell, chintzes, and a few trifles more.\n\nAs the Dutch company do not pay duty in Japan, either on their exports or imports, they send an annual present to the court, consisting of cloth, chintzes, succotash, cottons, stuffs, and trinkets.\n\nI had the satisfaction to attend the ambassador, who was intrusted with these presents, on his journey to Jeddo, the capital of this vast empire, situated at an immense distance from Nagasaki, a journey on which three Europeans only are permitted to go, attended by two hundred Japanese at least.\n\nWe left our little island of Dezima, and the town of Nagasaki, on the 4th of March, 1776, and travelled through Cocora to Simonofeki, where we arrived on the 12th, and found a vessel prepared for us; we embarked on board her, and coasted along to Fiogo. From thence we travelled by land to Osacca, one of the principal commercial towns in the empire. At this place we remained the 8th and 9th of April, and on the 10th arrived at Miac, the residence of the Dairi, or ecclesiastical emperor. Here we also stayed two days; but after that made the best of our way to Jeddo, where we arrived on the 1st of May.\n\nWe were carried by men in a kind of palankins, called Norimons, covered, and provided with windows. The presents also and our provisions were carried on men's shoulders, except a few articles, which were loaded on pack-horses. The Japanese officers who attended us provided us with every thing, so that our journey was by no means troublesome.\n\nOn the 18th we had an audience of the Cubo, or temporal emperor, of the heir-apparent, and of the twelve senators; the day following, of the ecclesiastical governors, the governors of the town, and other high officers. On the 23d we had our audience of leave. We left Jeddo on the 26th of May, and arrived at Miac on the 7th of June. Here we had an audience of the emperor's viceroy, to whom we also made presents, as we were not allowed to see the Dairi, or ecclesiastical emperor.\nOn the 11th we procured leave to walk about the town, and visit the temples and principal buildings. In the evening we set out for Osacca, which town we were also permitted to view, which we did on the 13th.\n\nWe saw temples, theatres, and many curious buildings; but, above all, the manufactory of copper, which is melted here, and nowhere else in the empire.\n\nOn the 14th we had an audience of the governors of this town; after which we resumed our journey to Fiogo, where we again embarked on the 18th, and proceeded by sea to Simonoseki, from whence we arrived on the 23d at Cocota, and from thence were carried in Norimons to Nagasacci, and arrived at our little island Dezima on the last day of June, after an absence of one hundred and eighteen days.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/106373.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 23, "total-input-tokens": 36248, "total-output-tokens": 10154, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1060, 2], [1060, 2377, 3], [2377, 3801, 4], [3801, 5186, 5], [5186, 6439, 6], [6439, 7724, 7], [7724, 9048, 8], [9048, 10408, 9], [10408, 11665, 10], [11665, 12846, 11], [12846, 14078, 12], [14078, 15350, 13], [15350, 16646, 14], [16646, 17025, 15], [17025, 18523, 16], [18523, 20653, 17], [20653, 22826, 18], [22826, 24878, 19], [24878, 27148, 20], [27148, 29301, 21], [29301, 31448, 22], [31448, 32204, 23]], "primary_language": ["en", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]