[{"id": "b7b055478b9ab2dbbb2cfa091e8e39ebe1b1805f", "text": "MANSLAUGHTER OF A WIFE.\n\nThomas Lewis, described as a silk-weaver in Barnsley-street, Bethnal Green, was charged at Worship-street police-court, on Wednesday, with causing the death of his wife.\n\nPolice constable Merritt, of the K division, stated that while on duty in Cambridge-street, Hackney, between twelve and one o'clock that morning, he was told that a woman had been killed by her husband, and on going to a house in an adjoining street called John-street, he found the report to be true, for on a bed in one of the lower rooms was stretched the dead body of a woman, more than 60 years of age apparently, and whom he then discovered to be the wife of the prisoner.\n\nA labourer, named Jones, accounted for the deceased being found at his house by saying that she hurried in at nine on the preceding evening, declaring that her husband had given her her death blow, and she hoped that witness would allow her to lie down for a bit. Witness told her she might, and the woman flung herself down upon the bed, witness being obliged to go out and leave her there, but on his return home about two hours afterwards, he was surprised to find that she was still there, and dead.\n\nThe prisoner was apprehended by an officer of the N division, who traced him with some difficulty, and to whom, on the constable telling him the charge on which he took him, he said that he and his wife had been out all day drinking together, and that on returning home some words arose between them, resulting in a quarrel, and he acknowledged that, from a feeling of aggravation, he had struck her either two or three times.\n\nMr. Shaw, a surgeon at Mile-end, deposed to being called to see the deceased, whom he found to be dead, and that his opinion, from an examination of her, was that she died from apoplexy, but whether it arose from excessive drinking or violence, he could not positively say, although there were certain marks of ill usage upon the body.\n\nIt was necessary to have the evidence of some person who had either seen or heard the blows inflicted upon the deceased, and the prisoner, who displayed great concern about the occurrence, and offered no defence, was remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206208412.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 510, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2172, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]