[{"id": "ef8ed48b82b64e03c97b75de261ea0b5b3c00c0d", "text": "CHARGE OF MANSLAUGHTER AGAINST A LITTLE BOY.\n\nOn Monday, Tom Anstey was indicted at the assizes at Bristol, for the manslaughter of Abraham Long, on the 25th of March, at the Hot Wells.\n\nThe prisoner was a little boy only twelve years of age, and the charge against him was that of having killed his stepfather. The facts were very painful. The deceased was a butcher, carrying on business at the Hot Wells. He was a violent, irritable man. The prisoner was the son of Long's wife by a former husband. On Saturday evening, the 25th of March, the prisoner, who had been out on his stepfather's business, came home very wet. He got his supper and was preparing for bed. The mother was engaged in making up the books. The deceased came into the room and desired his wife to take in the meat which was outside the shop. The wife said she was too unwell to do it, but she did not think the deceased heard her answer. He left the room. They had a little girl in their service named Emma Bevan, who, hearing the answer of her mistress, proceeded herself to remove the meat, but she did it in a very blundering manner. The deceased returned, and, supposing the prisoner had done this, spoke very unkindly to him, and the boy went to his mother, of whom he was very fond, and complained to her. The wife then told the deceased it was not the boy's fault. This irritated the deceased, who threatened to strike her. The prisoner said he should not strike his mother, and took hold of the poker. The deceased, seeing this, caught up the tongs, and was going to inflict a blow on the prisoner, who, however, ran away, and passing through the shop he took up one of the knives used in the trade and ran on, followed by the deceased. The wife, seeing this, ran and laid hold of her husband round the waist and held him, and succeeded in getting the tongs from him. He got away from the wife and pursued the prisoner, who said, \"If you come near me I will stab you:\" The deceased, however, went on, and the result was that he received a stab in the abdomen. There was a difference in the evidence as to whether the boy inflicted the stab, or whether he held the knife in his hand and the prisoner ran upon it. The deceased, however, died in the course of the night. When the deceased was not irritated the boy and he were on very friendly terms, and were so particularly in that day. The deceased frequently beat his wife and the prisoner.\n\nMr. Edlin, in his address to the jury on behalf of the prisoner, contended that the evidence did not bear out the charge in the indictment, but that it was excusable homicide. The deceased had run upon the knife, and caused his own death by his own act.\n\nThe learned baron summed up with great feeling. The jury had a responsibility to do justice to the public as well as to the prisoner; and their duty he was sure, without regard to consequences, they would faithfully and fearlessly discharge.\n\nA more painful case can hardly be supposed—a wife, deprived of her husband by the act of her own little boy, having to give evidence against the boy for having raised his hand against her husband in the endeavour to protect his mother from the brutality of that husband. The poor woman remained in court during the whole trial on her knees, evidently suffering the greatest agony.\n\nThe jury returned a verdict of \"Not guilty.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222235.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 777, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3349, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]