[{"id": "4aafb89372070b87db3bdf76c6873804851e72df", "text": "DEATH BY STARVATION AT BROMLEY.\n\nMr. Richards, deputy-coroner, resumed, at the Earl of Ellesmere tavern, Upper North-street, Bromley, on Wednesday night, the inquiry relative to the death, from alleged neglect and ill-treatment, of William Conde, aged twelve years.\n\nA schoolmistress, living in the house opposite to Conde's, deposed that she used to see the unfortunate deceased kept standing for hours, \"like a little ghost,\" against a wall, while his father and stepmother were at their meals and the other children were playing about. The father, like most working men in the district, had been for some time out of work; but he received, for his family of five persons, 3s. weekly in money, ten loaves of bread, 4lbs. of meat, 2lbs. of sugar, and 1lb. of tea from the parish, and he got other relief from local charities.\n\nWitnesses were called, who deposed to having noticed the emaciated condition of the deceased, and to the fact of his having asked them for bread, which they gave. One declared she had often heard the child scream, as if being beaten. Another said she used to hear a child being beaten on an average twice a week, but she could not say whether it was the deceased child. Deceased did not appear to her to be an idiot. It was said he was an idiot.\n\nMr. G. C. Kernott, M.R.C.S., said that he was called to the deceased on Saturday week last, at half-past eleven o'clock. The body was nearly rigid, and was wasted to a skeleton. The mouth was open, the tongue and mouth dry and parched, the pulse weak. Witness ordered stimulants, but without avail. Death supervened in two hours. The post-mortem examination showed that the body was excessively emaciated; it weighed 20lb. 12oz. All the organs except the lungs were quite healthy. The cause of death was the disease of the lungs, accelerated by want of the necessaries of life.\n\nThe coroner said that although there was no moral doubt of the cruel ill-treatment of the deceased, there was not any legal proof of the fact.\n\nSeveral of the jurors said that they had seen the boy's body, and from the frightful condition to which it had been reduced, as well as from other facts, they had no doubt that it was a case of slow murder, and they asked for an adjournment, to see whether any additional evidence could be procured.\n\nThe coroner concurred, and the court was accordingly adjourned.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206227029.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 588, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2362, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]