[{"id": "77cef7c4fda73469fc866a394f931ff07da95da6", "text": "THE CHOLERA.\n\nThe epidemic shows a slight decrease in the metropolis, when compared with last week, the number of deaths being 98 against 102.\n\nThe return from the inspector of the R division gives the following account of two fatal cases of cholera at Deptford. A woman named Cooper, aged fifty-two years, residing at No. 8, Creek-street, in the parish of St. Paul, died Tuesday at 5 a.m. Her husband died on Friday night week of the same complaint, and both were interred at noon on Tuesday in the burial ground of St. Paul's church. The man was somewhat older than the woman, and both were of very dirty habits. The street is in the most filthy condition possible to conceive. The mud and filth lie in the road about six or eight inches deep, with surface drainage on the right hand side, close to the houses. There are only houses on one side, the chemical factory of Messrs. Hill being on the other. Of these sixteen houses, it must be stated, not one is supplied with water. The inhabitants are compelled to go across the coal barges lying at Messrs. Smith's wharf, and dip into the creek for all they require for domestic purposes; and at this spot the refuse water from gas works, chemical works, oil mills, &c., is discharged. The closets at the rear of many of the houses are in the most filthy state. With reference to a death which occurred in a house, No. 32, Vine-street, St. John's, Horselydown, the police state that the house is badly ventilated, there being no back door or window, and the arrangements being very offensive. Several other houses adjoining are in the same condition, and a fatal case of cholera occurred at No. 29 on the 27th ult.\n\nWith reference to a death that occurred in Redcross-street, Borough, the police state this is the tenth death that has taken place in the same street: and that in Suffolk-place, Bermondsey, altogether there have been four deaths. No. 17, where the last death occurred, is in a very filthy state.\n\nDr. Milroy had an interview with the guardians of St. Saviour's union, upon the subject of the public health of the parish. For some weeks past the number of deaths from cholera in this and the adjoining districts of the metropolis on the Southwark side of the river, has been steadily on the increase; and so virulent has the disease been in many cases, that the patient died within twelve hours of the severe attack. In several instances two and even three inmates of one house or even room have been attacked. There is also a large amount of diarrhoea and other premonitory sickness in various localities.\n\nDr. Milroy urged the appointment of two additional medical officers, for the purpose of affording prompt assistance in sickness; and also advised the board to provide a suitable house or place of refuge, for the reception of the inmates of such houses as might require to be thinned or emptied altogether.\n\nIn consequence of the increasing amount of diarrhoea and cholera in one or two of the districts of Marylebone, the sanitary committee of the parish have nominated five medical men, the district vaccinators, in addition to the parochial officers, in order to afford prompt medical relief in all cases, premonitory and developed, of the epidemic.\n\nThe condition of the provinces remains unchanged.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206306326.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 758, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3275, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]