[{"id": "9f296044ea1813b7bb33aff4f41c2f4e0be978de", "text": "A WEST-END RIOT.\n\nAt the Marlborough-street police-court on Thursday, Edith Rayne was charged with being drunk and disorderly; John Denton was charged with assaulting Detective-serjeant Thomas Pickles and William Robertson, of the C division; Helena Caffie and Lily Matthews were charged with assaulting Serjeant Pickles and Police-constable Cadman, 141 C; and Minnie Hastings was charged with assaulting Robertson.—Geoffrey Cadman, 141 C, said he found Rayne about half-past 12 at night drunk and making a great disturbance in Regent-street. A gentleman complained to him that Rayne had put her arms round his neck, and that he could not get rid of her. As Rayne would not go away he took her into custody, when she behaved in a very excited manner, and threw herself down, and whilst he was trying to get her up several persons, amongst others some of the female prisoners, struck him with their umbrellas. Caffie kicked, and Matthews struck him with her umbrella.—Detective William Robertson, who appeared to have received very severe injuries, one eye being totally closed, stated that on going to Cadman’s assistance Hastings kicked him, and Denton struck him several times about the eyes, saying when he told him he was an officer, that he did not care.—Detective-serjeant Pickles said he heard someone say “Here’s Pickles,” and Denton turned round and struck him in the eye. (The witness had a bad black eye.) He saw Caffie take hold of Robertson by the hair and hold him while Hastings kicked him twice.—Replying to the prisoner, Pickles said he did not say, “Can’t you ‘sneak’ any watches to-night? Don’t they hang low enough?”—Mr. Mansfield said he considered it a very disgraceful riot. It was the duty of everybody to assist the police, and they might be indicted if they did not do so. Rayne would be fined 40s., Matthews discharged, and the other prisoners would be committed for two months each with hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206247301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 476, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1927, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]