[{"id": "f05ced11c2ffd6240b7250c676d57c173066d8cd", "text": "FEARFUL SCENE AT AN EXECUTION IN IRELAND.\n\nTULLAMORE, Wednesday.—The convict, Laurence King, who was found guilty at the last assizes of the wilful murder of Lieutenant Clutterbuck, of the 5th fusiliers, under circumstances of peculiar atrocity, suffered the extreme penalty of the law this morning in front of the county gaol. The Rev. Mr. M'Ilroy counselled his flock from the altar on Sunday to remain at home, and they obeyed his wishes. Mr. Anderson, the under sheriff of the county, arrived at eleven o'clock; and the usual preliminaries having been arranged in the chapel, the procession was formed. It consisted of the Rev. M. M'Ilroy, who led the way, followed by the prisoner, the Rev. Mr. Flood, and the Rev. Mr. Higgins. The hangman slunk after the prisoner. The deputy governor, Mr. Burke, the under sheriff, and a number of turnkeys followed. The prisoner was very firm, and walked with an elastic step, praying as he went in conjunction with the clergymen, and kissing now and then a crucifix which was held before him. He was not at all pale or nervous. In fact, he was the firmest man of the party. He was only about twenty years of age, and though under the middle height he was of muscular build. Those who are in a position to judge state that he got very fat during his imprisonment. The procession wended its way slowly up a narrow flight of stone steps which led to the gallows. At the foot of this grim-looking machine the prisoner and the clergy knelt and prayed for a short time, and they went on the drop. King gazed about him for a moment, and addressing the people said—\"I hope you will all pray for me. I am guilty and ready to die for it.\" The hangman put the rope round his neck, and drew the noose tight with unnecessary roughness. He next tied a white bag over the head, and concluded his preparation of the culprit by firmly tying his legs. This occupied nearly five minutes. He then descended and untied a string. The heavy bang of a board was heard, the rope went through the block with a whizzing sound, and the doomed man dangled at its end. He fell about four feet, and if the rope had been eighteen inches longer he would have touched the roof of the gaol. For half a minute no movement was discernible in him. Then he was seized with convulsions. He drew up his feet, and clenched his hands, and shrugged his shoulders many many times, and these dying agonies lasted for fully five minutes. The knot of the rope had been placed, or had slipped to the back of his neck, and he died a fearful death from suffocation. A low wall outside was the only symptom of feeling. In half an hour the body was lowered and placed in a coffin for burial within the gaol. Thus ended a shocking tragedy.—Freeman's Journal.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206223309.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 671, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2746, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]