[{"id": "3f0c65b83fc8bf7d134c5ad25b3c7e0147e30b60", "text": "ROBBING THE POOR.\n\nGeorge Henry Ogden, late relieving officer of the Bangor union, who pleaded \"Guilty\" at Carnarvon assizes to four indictments of fraud and embezzlement, came up for sentence.—Mr. Marshall, the prosecuting counsel, said the prisoner had retained the names of dead paupers on the books and pocketed the fees. In other instances he had withheld portions of the paupers' allowances. In one case, that of an imbecile pauper, he received 7s. 10s. for rent, and paid over only half the sum.—The defence was to the effect that the prisoner had speculated in buying vessels.—His lordship, in passing sentence, said the guardians had shamefully and disgracefully neglected their duties. The prisoner had been systematically robbing miserable paupers, for whom one would have thought he would feel some slight spark of sympathy or pity; but he had been content to enrich himself at the expense of these miserable paupers, defrauding them weekly of their shillings, two shillings, and three shillings, and all this so as to accumulate gains for himself. His nature was stirred when a plea of eminent respectability was set up on his behalf. The sentence would be one of five years' penal servitude.\n\nA CONFIRMED SWINDLER SENT TO PENAL SERVITUDE.—Philip Cattermole, 60 years of age, an engineer, was indicted, at the Middlesex sessions, on Wednesday, for stealing four boots, value 21s., the goods of Mr. Charles Lockwood; he was further charged with stealing an umbrella, value 12s. 6d., the goods of Mr. Robert Goodacre. There was a third charge against him of obtaining by false pretences, from Mr. Horace Giddings, a mantle and dress, value 2l. 19s. 6d., and from Mr. Joseph Rushton, four pairs of boots, value 1l. 16s. The jury found the prisoner \"Guilty\" on all the charges. The police proved that for many years past the prisoner had been a swindler. He had suffered 18 months' for fraud, five years' penal servitude for fraud, five years' for stealing a watch, and three months' for stealing a horse and cart. Inspector Morgan said prisoner had 30 other cases against him similar to the present. He had swindled people all round the neighbourhoods of Kensington, Hammersmith, Balham, Wandsworth, Chiswick, and other places. He had escaped twice from the police—once from the cells at Hammersmith police-court, and he nearly succeeded in making his escape from that court again on Friday last. Mr. Commissioner Kerr: Philip Bell Cattermole, if that is your right name—because you have such a variety—we will suspend your operations for some time to come, because it is evident you are incorrigible. You will have to undergo 10 years' penal servitude.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206266075.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 678, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2663, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]