[{"id": "059919f7e1aa4ad92abfbaf12c14d83961da63b0", "text": "SCOTCH BANK ROBBERY.\n\nIMPORTANT CAPTURE IN PARIS.\n\nOn February 16th, 1891, a young apprentice messenger was on his daily collecting rounds. In the course of business he went to the Scotch Bank to collect some money due on a bill. He passed his order over to the cashier, and placed his leather wallet containing £11,580 in Bank of England notes on the counter. While he was waiting for the cashier to \"clear\" the bill, a man touched him on the shoulder and pointing to a piece of paper on the ground said, \"Excuse me, sir, but I think you have dropped something.\" The youth stooped down to pick up the piece of paper, and while his eye was off the wallet someone who was evidently on the watch snatched up the parcel and hurried it away from the bank. The event created great excitement at the time, and although Inspector Outram, of the City Police, succeeded in tracing one of the notes to Genoa, nothing more was heard of the missing property until Tuesday. Inspector Outram always said that if a sufficient time was allowed to lapse an attempt would be made to pass the notes. In consequence of this belief Mr. Outram has periodically sent to every money-changer throughout the world a circular bearing the number of the stolen notes.\n\nOn Tuesday last a man, who gave the name of Eckle, presented at a money-changer's office in Paris an English banknote for £1,000, which the clerk ascertained from its number to be one of those stolen from the Scotch Bank in London on February 16th, 1891. The man, who was at once arrested, stated that he was sixty-three years of age, was of Alsatian origin, and had lived in London for the last ten years. He is believed by the police to be in relation with the well-known \"International\" gang, the members of which make it their business to dispose of stolen notes and securities.\n\nIt appears he came to England about fourteen years ago. His residence and business address is 6, Canton-street, Poplar, E. His trade was supposed to be that of a yeast and chemical merchant. The capture is considered by the police to be a most important one.\n\nTHE MISSING WORD COMPETITIONS.—Mr. Pearson announces that all embargo upon outstanding missing word cheques has been withdrawn by the authorities, and that any cheque which is presented through a banker will be promptly honoured.\n\nFOUR AT A BIRTH.—On Monday the wife of a workman at Sittingbourne gave birth to four children—three girls and a boy—who lived twenty-four hours, and died on Tuesday. The parents, who have not long been married, before the infants died had five children, all of them being born in a year. The medical attendant (Dr. F. Grayling, of Sittingbourne) has communicated with her Majesty with a view of obtaining the Royal bounty.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811342.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 644, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2737, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]