[{"id": "140d145e26eb0429b4e81bf1f554b8f9c91a7926", "text": "THE CASE OF ATTEMPTED BURKING.\n\nYARMOUTH, WEDNESDAY.—The investigation before the magistrates into the revolting case of attempted murder of a woman on the North Denes, a secluded portion of the sands on the beach to the north of this town, by placing a pitch-plaster over her face, and inflicting dreadful injuries upon her person, was resumed yesterday at the town-hall.\n\nSamuel Howth, the man who is charged with committing the diabolical outrage, on being placed at the bar, seemed little changed since the last inquiry. Dressed as a labourer, he watched the witnesses giving their evidence very intently, without, however, evincing the least uneasiness or concern. It has not been remarked that his capture was effected within two hours after the atrocious attempt. The poor woman, it will be remembered, continued in apparently a lifeless state for some time after she was discovered lying on the sands. Partly recovering her senses at the hospital, whither she had been conveyed, she named her assailant (the prisoner), thus enabling the police to act promptly in the matter. Repairing to a house where the family resided, in Yarmouth, they found him sitting by the side of the fire coolly smoking his pipe. He had divested himself of his slop, stock, and boots. He seemed perfectly calm and collected, although from his heated appearance it was evident that he had recently been labouring under some unusual excitement. The life of the unfortunate woman being despaired of by the medical man, and in order that there should be no mistake as to the identity of the accused, the police had him brought to the side of the bed in the hospital, where the victim of his revolting barbarity lay. When asked by the magistrate present whether she could recognize the person who had committed the outrage upon her, she, after much difficulty and pain, her sight being injured, exclaimed in a terrified tone, \"Oh, yes, yes; there he stands (pointing to the prisoner). Pray don't let him come near me. He thought he had murdered me; he left me for dead.\"\n\nThe prisoner heard the accusation unmoved, and in a callous tone replied, \"I know nothing about her; and I call God to witness that I am innocent. You (addressing the magistrate and police) knew as much about the woman as I do.\"\n\nAt the proceedings yesterday, the examination was somewhat irregularly conducted, in consequence of frequent altercations among the members of the bench—a circumstance, we understand, of no uncommon occurrence, and which attracted the attention of the judges at the assizes. It would almost appear that the justices are jealous of each other in the performance of their duties, and this is attributed, as we were informed, to the high party feeling which prevails in the port. It was only after some time and care that the evidence could be properly taken and arranged.\n\nThe witnesses already examined, and of whose testimony reports have already appeared in Lloyd's Newspaper, were again subjected to examination, and the other evidence taken extended to some length.\n\nThe bench were unanimous in committing him to Norwich castle for trial at the next assizes, on the charge of attempting to suffocate and murder Mary Ann Proudfoot.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201409.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 710, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3215, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]