[{"id": "0c143a458f540671715d94d6431ac03b9b41be18", "text": "SINGULAR CHARGE OF PERJURY.\n\nOn Monday, at the Guildhall police-court, Charles Mayhew, an elderly man, an agent, residing at 2, Vernon-place, Bloomsbury-square, was charged with perjury.\n\nMr. Nelson, the city solicitor, said he appeared in his official capacity to prosecute the prisoner on a charge of perjury. When gentlemen were summoned on the jury or grand jury at the Lord Mayor's court and did not attend they were fined; and the prisoner seemed to make it a practice to ascertain who the gentlemen were who were fined for non-attendance, and then come forward and make a false affidavit in order to get them excused from the fine. This had been reduced to such a system that it was found that some gentlemen never appeared in the jury-box at all, while others who did attend to their duties were continually complaining that they were taken away from their business much more frequently than they ought to be in consequence of the non-attendance of other gentlemen who ought to serve upon the jury.\n\nIn the present case he was prosecuting the prisoner for having committed perjury in making an affidavit which was false, in order to get the fine which had been inflicted on the juror for not attending remitted. He had several cases against him—indeed, so many that they showed a regular system had been carried on in this way. The case he should first proceed with would be that which concerned Mr. Robert Alexander Bentham, the manager of the Imperial Bank in Lothbury. He was duly summoned to attend as a juror in the Lord Mayor's court, and was fined 10l. for non-attendance. Subsequently the defendant made the following affidavit:\n\n\"In the Mayor's court, London.—I, Charles Mayhew, clerk to Mr. Robert Alexander Bentham, of No. 6, Lothbury, in the city of London, banker, make oath and say as follows—1. That the said Robert Alexander Bentham left London for the Christmas holidays on the 12th day of December last, and did not return until the 1st day of January instant. 2. That it was not brought to the knowledge of the said Robert Alexander Bentham that he had been summoned to attend this honourable court as a juror on the 23rd of December last owing to his absence as aforesaid.—Sworn at the Mayor's-court office, London, this 22nd day of January, 1866, before me, Richard J. Pawley.—CHARLES MAYHEW.\"\n\nCircumstances came to the knowledge of the city authorities that these practices were systematically carried on, and they at once commenced proceedings to put a stop to them. The prisoner heard of it, and sent a letter of excuse to the Lord Mayor's-court office.\n\nThis letter was read, and Mr. Nelson then said, as the prisoner had only just been apprehended, he would ask for a remand, in order that he might see upon which case he should go. He had a mass of evidence in other cases, but he wished to select that upon which he could rely. It would be necessary for Mr. Bentham to explain how it was that he lent himself to a practice of that description in order to get himself excused from the jury list.\n\nMr. Alderman Abbiss said he had noticed the great difficulty there was in getting jurymen and special jurymen to attend at the Old Bailey, and those who did attend to their duties complained greatly of having to attend much more frequently than they ought in consequence of others not attending at all, and if that were a system, as the city solicitor stated, it must be put a stop to. It was a very serious case.\n\nThe prisoner was then remanded, but bail accepted for his appearance, himself in 300l. and one surety in 300l.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206225928.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 841, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3558, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]