[{"id": "b8f1908a85b9740ffce5d258ac61d867abd00b4d", "text": "EMBEZZLEMENT BY A SECRETARY.\n\nWilliam J. G. Fitzgibbon, 34, of King William-street, Greenwich, secretary of the Greenwich Coffee Tavern Company (Limited), was charged on a warrant, at Greenwich police-court, on Thursday, with embezzling £18. 15s. 7d., received by him on account of the company.—William Everitt, manager of the Good Duke Humphrey coffee tavern, said the prisoner was secretary of the company. It was witness's duty to pay to him the moneys received, and on Sept. 6 he paid the prisoner £18. 15s. 7d. He should have paid the money into the London and County bank forthwith. He had always found the prisoner a first-rate man of business.—Wm. Charles Hutchinson, (cashier of the London and County bank, Greenwich branch), said the Greenwich Coffee Tavern Co. (Limited) had an account at their branch. The amount of £18. 15s. 7d. had not been paid in. The last sums paid in were £65. and £5., on August 31.—Serjeant Howell said that on Tuesday last he went to Liverpool, and found the prisoner detained at the police-station. He said, \"I am going to arrest you on a warrant for embezzling £18. 15s.\" He said, \"Yes, I plead guilty to that amount. Do you know whether there will be any other charges preferred against me?\" Witness replied that he did not know, and he said, \"I have carefully calculated everything in my memory, and I think there would be about £20. or £25. at the outside deficient, which I intended to return to the directors of the company.\" The witness found on him the sum of £27. 10s. in gold, 5s. in silver, and a £5. note. He bore an excellent character.—Mr. Everitt, re-called, said the prisoner left behind him a cheque for £34., which he might have cashed if he had liked.—Mr. Wood, for the defence, said the prisoner had yielded to a sudden temptation. He went to Liverpool to get a situation. The money in his possession would be returned to the company.—Serjeant Howell said there were painful circumstances in the case which had not come out in evidence.—Mr. Saw said the prisoner had run away with a woman not his wife.—Mr. Marsham committed the prisoner for four months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206270194.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 574, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2126, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]