[{"id": "9982f87d011eee42bfef0aa4ccddd0b915641d12", "text": "A SAD STORY FROM BERLIN.\n\nA Berlin correspondent reports the trial of a girl named Clara Wernicke, thirteen years of age, who has been sentenced to three years and three days' imprisonment for theft and murder. The evidence revealed some extraordinary circumstances. The prisoner is the daughter of a house-painter, who, after the death of her mother, married a woman who had been his housekeeper since the decease of his first wife. This woman brought into the house her little boy named Herrmann. The step-mother very soon began to behave cruelly to her step-children; the Clara above-mentioned and two other girls. Clara was accused of having stolen ninety pfennige, and on May 15th of having pushed her step-brother into the water and drowned him. On being questioned by the president of the court, she said: On the 15th of May my sister Lischen, Herrmann, Malwine Erdmann, and I wanted to go to Sunday school. On the way Lischen said, \"I won't go home again. Mother has beaten me again with the tongs.\" My little brother said he also would not go home, and I said so too; and then my sister said we would all drown ourselves, but before that we would ride on the roundabout in the Hasenheide. We went there and looked at the booths, and went away at nine o'clock in the evening. When we came to the Kottbusser-bridge we went along the bank of the river, and Herrmann said, \"Now we will jump in. You can push me in first; but you must be sure to jump in too.\" So I lifted him up, while Malwine Erdmann helped me, and then I let him loose, and he fell into the water. He called out \"Clara!\" and I tried to catch him, but I could not, and then I got a fright. Then I went home with my sister and Malwine Erdmann. The next morning mother asked where Herrmann was, and I said I didn't know. Then I was taken to the police office because of the ninety pfennige, and then Malwine told all about Herrmann. Malwine Erdmann, nine years old, in her evidence, said: \"While we were at Hasenheide Clara said, 'We will all four drown ourselves. Then we shall go into Paradise and get such a beautiful bed and such good food, and be again with my good mother.'\" But I said I would not die, and little Herrmann said nothing. When we came to the Kottbusser-bridge it was dark, and Clara led us a few steps to the right, and then I helped her to lift little Herrmann over the low railing, and she threw him into the water. He called out, \"Clara, help me, I want to get out.\" But Clara only said, \"I won't help you, for you always tell tales about us.\" Then we ought to have taken our turn and be thrown into the water, but we ran away and went home together. Elle Wernicke, likewise nine years old, was questioned and said: We wanted to drown ourselves all four. Mother always treated us so badly; she beat us and starved us. We had to go begging every day, and if we brought home less than a mark we were beaten. Malwine wanted to die with us, and Herrmann also said he would rather go to Paradise.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810760.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 753, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2985, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]