[{"id": "4bac3be7ef7e3b5bc2f02bc6f314927a2d5954cf", "text": "WHITECHAPEL COUNTY COURT.\n\nLOAN SOCIETIES AND THEIR LAWYERS.—VESSEY v. ESTALL.—Mr. Sergeant Jones stated that his client sought to recover the sum of £20 for work, labour, and expenses incurred as attorney to the defendant, under the following circumstances:—The defendant, having a loan society held at his house, engaged the plaintiff to sue Mr. Estall, a defaulter to the society for £6. His client advised the defendant to sue in the county court, but his advice was rejected. Mr. Masters observing that he would have the case brought in a superior court, as Mr. Estall could well afford to pay the expenses incurred. The action was brought in the Court of Common Pleas, and proceedings went on until judgment had been obtained against Mr. Estall, who was finally incarcerated in Whitecross-street Prison for the debt and costs. Whilst incarcerated, Mr. Estall wrote to his client, tendering £5, and stating that if they refused he would lay it out, and they would not be paid a farthing. His client upon receipt of this letter waited upon the defendant, who remarked that he had heard that there was an action of crim. con. against Mr. Estall, and that the offer had better be accepted. A rather curious feature in the case was, that the defendant and his colleagues, not wishing to have their names appear as plaintiffs, alleging that it would be injurious to their business to have it so, empowered the plaintiff to procure a substitute, upon which he got a Mr. Devonport to appear as plaintiff. Upon the action being settled, his client sent in his bill of costs, £23 2s. 6d., and although Mr. Masters had admitted he ought to be paid, and should be paid, he had not received the money.—Mr. Vessey, examined by Mr. Sergeant Jones, corroborated the learned sergeant's statement, but added that he was invited into the house of the defendant (a public house in Rosemary-lane) under the pretence that if he brought all his papers connected with his proceedings with the loan society, he should be paid. Having done so, and signed a receipt for the amount, a quarrel was got up, and he not only lost all his papers in the pretended melee, but also the receipt he had written, without having received the amount.—Mr. Parnell, who appeared for the defendant, in cross-examination, elicited from witness that he did not know who stole his papers. That Mr. Davenport, the spurious plaintiff against Mr. Estall, was his nephew. That he was a clerk, mercer, and draper. Did not know where he lived. Had been concerned in other actions, in which his nephew had figured as plaintiff. Had called fifty or sixty times at the defendant's for a glass of ale, but did not charge him 6s. 8d. each time. Had never told Mr. Roach, or any one else, that he should only charge the society costs out of pocket, trusting to Mr. Estall for his harvest.—A clerk to the plaintiff, and a solicitor, gave evidence that the charges made were reasonable.—Mr. Parnell, for the defence, said that this was one of the most iniquitous demands that was ever made. He was sorry to ask the jury to disbelieve every word the plaintiff had uttered. It was apparent that Mr. Vessey, whose business appeared to be carried on in public-houses, and whose poverty did not permit him to keep a constant clerk, was not a likely person to recommend a client a mode of suing which would militate against his pecuniary interests. It was inexplicable. He had to give a most broad and distinct denial to the claim, and would show that the case was put into the hands of the plaintiff with the distinct understanding that Mr. Vessey should only pay costs out of pocket. He did not wish to weary the jury, but could call his witnesses, who would prove that the plaintiff was not entitled to one penny. He could not conclude without observing, that it shewed the quality of the Court of Common Pleas, wherein costs of £23 2s. 6d. were allowed to recover £6.—J. Masters, the defendant, and several witnesses (members of the City of London Loan and Mint Society) severally swore that they knew nothing of Mr. Davenport being the plaintiff against Estall, nor had they instructed Mr. Vessey to sue in a superior court.—In their cross-examination they most materially differed.—Mr. Roach, the gaoler of the Thames Police-court, stated that he was a member of the loan societies, and engaged the plaintiff to sue Mr. Estall.—After an address from Mr. Sergeant Jones, the learned judge lucidly summed up, and the jury immediately gave a verdict for the full amount claimed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206195717.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 1058, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4520, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]