[{"id": "4f8092c28cd4fb21a101efd0ff41fad0dca914c7", "text": "LIBELLING A MUSIC HALL.\n\nAt Guildhall police-court, on Wednesday, Mr. John Heather Lewis, an occasional contributor to the Figaro, was summoned by Messrs. Speedy and Poole, the proprietors of the South London Palace of Amusement, London-road, for publishing a libel on and concerning them.—Mr. Besley said the libel complained of appeared in the Figaro of the 22nd inst.: Pressure being put on the proprietors of that paper, they gave up the name of the defendant as the author. The complainants were not mentioned by name, but the object of the attack was sufficiently obvious. The article was headed \"The London Music-hall,\" and commenced—\"A London music-hall is commonly looked upon as a public-house upon a very extended scale, but it is more than this. Here we perceive every phase of indolence, the parent of vice, flaunting its dirt and wretchedness, its shamelessness, and its filth, whether it be among the occupants of the gallery, or the better dressed but scarcely more refined habitués of the stalls.\" Mr. Besley went on to read the article through, which in effect said that the habitués of the place \"twisted\" the manager. They were accustomed to talk \"horsey,\" being largely composed of billiard sharps, horse copers, and welchers. The performance was not of a decent character. The proprietor drank with everybody, but from a tap of his own. He never got drunk, while his customers got intoxicated and threw their money over the bar regardless of consequences. At 12 o'clock the hangers-on were turned out of the house, more or less in a state of intoxication, and how the shop-boy and city clerk managed to find the money for their nightly debauches was a puzzle that admitted of but one solution—the unpleasant and painful one, theft. There was the end of the libel, and a more scurrilous, gross, or injurious libel could not have been written. Something had been said about an apology, but the complainants despised the suggestion, and called upon the magistrate to look upon this libel in a business point of view. Mr. Besley would prove the facts he had stated and then ask the Alderman to send the case to the Old Bailey for trial. Mr. Layton, jun., son of the complainants' solicitor, proved the purchase of the London Figaro with the alleged libel in it. Mr. John Richards, clerk to the solicitor, said that on the 11th inst. he went to the defendant, who said that he was the author of the article on \"The London Music-hall,\" but that it had been greatly altered by the editor. Two letters were put in. The first protested that the defendant did not intend to refer to the South London Palace of Amusement, but to music-halls generally; the other was to the effect that as the article had been altered he was not responsible for it. Mr. Mortimer, the editor, was called upon to produce the copy, but he declined to do so. Mr. John Joshua Poole, one of the proprietors of the music-hall, said he attended to the stage entertainments and Mr. Speedy to the bar and front of the house. All the allegations and insinuations in the article had no truth in them. He also stated that the description of the London-road, of the long passage at the side of his house, and of \"Tommy,\" and the chairman and the waiter, left no doubt as to what house the writer intended to indicate. The description would not apply to any other music-hall in London. Witness had been spoken to by several persons about the article, and they all understood that the writer meant their hall. In cross-examination by Mr. Lewis, witness said he had been very particular in preventing any indecent allusions being made in any of the performances on the stage. In a song called \"The Scamp,\" Mr. Maidemott said he attended at Exeter hall, carried the box for hospital and other collections, and always appropriated the silver to himself.—Mr. Lewis for a long time examined the witness as to the character of the songs sung there, and had not finished his cross-examination when the further hearing of the case was adjourned.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206320990.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 938, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4014, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]