[{"id": "b93cf04379b5b997b28f85ac966bf79741e0a51c", "text": "IV. An Account of a Portrait of Copernicus, presented to the Royal Society by Dr. Wolf of Dantzick: extracted from a Letter of his to Mr. Magellan, F. R. S.\n\nDEAR SIR,\n\nDantzig,\nApril 7, 1776.\n\nRead Dec. 7, 1776.\n\nTHE captain who will deliver this to you, will also put into your hands a copy of an original portrait of the famous copernicus, which I beg you will present to the Royal Society, as a testimony of my devotion and attachment to that respectable body. The original, from which it is copied with the greatest accuracy, is in the possession of the Chamberlain Huszarzewski.\n\nAvis touchant un Portrait de Copernic, présenté à la Société Royale, par M. le Dr. Wolf de Danzic : extrait d'une Lettre du dit Dr. à M. de Magellan, Membre de la Soc. R.\n\nMonseur et très cher ami,\n\nDanzig, le 7 Avril, 1776.\n\nLe capitaine qui vous délivrera celle-ci, vous apportera en même temps la copie d'un portrait du fameux copernic, que je vous prie de présenter à votre illustre Société Royale, comme un témoignage de mon dévouement et respect pour cet illustre Corps. Le possesseur de l'original, dont le portrait fut copié avec la plus grand attention, est M. le Chambellan Hussarzewski. Il a\nDr. Wolf's Account of\n\nSarzewski, who has already refused one hundred ducats for it, and will not part with it at any rate during his life, but intends to bequeath it me after his death; for which reason there is no probability of my ever possessing it, as he is likely to survive me many years. We have a portrait of Copernicus in the great church at Thorn in a kind of mausoleum, erected about thirty years after the death of that great man, by a physician of that town, who is said to have been one of his relations.\n\nHartknoch has inserted a print taken from this portrait in his Chronicles of Prussia. Our original has been compared with that of the mausoleum, and the features of the face are found to be perfectly similar, but there is a great difference in the dress. That at Thorn represents him kneeling before an altar, in the attitude of a priest officiating; in ours he is cloathed in fur, with his hair more\n\ndéjà refusé 100 ducats, et ne le cédera pas sa vie durant pour aucun prix : mais il me le veut léguer après sa morte. C'est à dire très probablement après la mienne : de sorte qu'il n'y a rien à espérer de ce coté-ci. Nous avons un portrait de Copernic dans la grande Eglise de Thorn, dans une espèce de mausolée, érigé une trentaine d'années après la mort de cet homme célèbre, par un médecin de la ville, qu'on dit avoir été un de ses parents.\n\nHartknoch a fait graver ce portrait, et l'a inféré dans sa Chronique de la Prusse. Notre original a été comparé sur le lieu avec celui du mausolée, et on a trouvé les traits du visage absolument les mêmes : mais l'habillement est très différent. Celui de Thorn le représente devant l'autel en fonction de prêtre.\nmore carefully dressed, and as it were in a habit of ceremony. The painter of it was certainly one of the old Italians, as will appear by comparing it with other works of those masters; for instance, it is known that the painters of those times, and even Raphael, never gave to the eyes that brightness which the most indifferent artists within this century never fail to express in their portraits; not but what the serene and seemingly inanimated countenances of the former artists came nearer to nature than the sparkling eyes which are now all the fashion. This however is a proof that the portrait is at least one hundred and fifty years old; the inscription shews that the painter was an Italian; and it must further be observed, that it is now two centuries since they left off painting on wood.\n\nDans le notre il est habillé en pélisse, avec les cheveux de la tête plus soigneusement arrangés et coupés, comme en habit de parade. Le pinceau est sûrement Italien du vieux temps en question, comme on trouvera en regardant d'autres de ce temps et les comparant avec celui-ci. Par exemple, on fait que les peintres dans ce vieux temps, même Raphael, ne savaient pas encore donner aux yeux cette vivacité, que le plus médiocre peintre depuis plus d'un siècle, ne manque pas de donner à ses peintures. Je ne dis pas que les vieux peintres n'approchent pas plus de la nature avec leurs yeux tranquilles sans feu; mais ils déplaisent à notre siècle, qui veut que des yeux petillants. Au moins c'est la marque d'une ancienneté plus grande qu'un siècle et demi. L'inscription fait voir que le peintre était Italien. Il y a deux siècles qu'on a cessé de peindre sur du bois.\nThe history of this portrait is as follows. It was formerly in the collection of Saxe Gotha, where it was always considered as an original, which is even said to appear from the archives of that court, and is the more probable, as the prince-bishop of Warmia, who obtained it from the late duke of Saxe Gotha, was too good a connoisseur and too cautious to be deceived in this respect. That bishop being at Gotha in the year 1735, observed this portrait in the gallery of that palace; the proofs that were produced of its authenticity made him very desirous to acquire it. He at length obtained it by a kind of theft which it was necessary to commit on the cathedral of Warmia, in which there was a very old portrait of one of the ancestors of the dukes of Saxe Gotha, who had been bishop of that see, and whose picture was wanting in\n\nL'histoire de notre original est la suivante. Il a été conservé dans la collection des ducs de Saxe Gotha, dans le château du même nom, toujours avoué comme un véritable original: on prétend même prouvé comme tel par les archives; ce qui est fort croyable, vu que le prince évêque de Warmie, qui l'a obtenu du duc défunt, etoit trop circonspect et trop bon connoisseur pour s'en laisser imposer. Enfin c'est après les paroles du prince évêque, que je fais cette assertion. Ce fut environ l'année 1735 qu'étant à Gotha, il remarqua ce portrait dans la galerie du duc. Les preuves qu'on lui fit de son authenticité, augmentèrent son envie de le posséder. Il l'obtint enfin par un vol qu'il fallut faire à la Cathédrale de Warmie, où se trouvait un très ancien portrait d'un des ancêtres du duc de Saxe Gotha, qui etoit jadis évêque de Warmie, et dont le portrait manquoit dans la collection des portraits de sa famille. On fit donc un échange\nin the duke's collection of the portraits of his family. An exchange was accordingly made of the two originals, and the bishop has since bequeathed that of Copernicus to his favourite Mr. Hussarzewski.\n\nThe copy I herewith send you is very exact in every respect, except that I have glued three wooden lifts on the back of the board to prevent its warping. After my copy was taken, the proprietor of the original thought proper to have it repaired and varnished, and they are now so much alike that it is scarce possible to discern any difference. The name of my painter is Lorman of Berlin, an artist of some reputation.\n\néchange des deux originaux. Le prince évêque Grabowski enfin a laissé celui de Copernic à son favori M. Hussarzewski.\n\nLa copie est absolument la même que l'original : excepté que j'ai fait coller trois règles sur le derrière de la table pour empêcher son courbissement. Depuis que ma copie a été tirée, M. Hussarzewski, croiant bien faire, a fait renouveler son original, c'est à dire, y mettre du vernis : et actuellement il est si bien le même que la copie, qu'on peut à peine s'apercevoir de la moindre différence. Mon peintre est M. Lorman de Berlin, assez célèbre dans son art.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/106227.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9822, "total-output-tokens": 2114, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1189, 2], [1189, 2872, 3], [2872, 4545, 4], [4545, 6322, 5], [6322, 7528, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]