[{"id": "84d218d270d9ed968f2501806ad8e6ee2c9dc9b1", "text": "TRIALS AT THE ASSIZES.\n\nA FRAUDULENT BANKRUPT.—At Bristol assizes Mr. Justice Lopes sentenced Benjamin Bond Nicholls, 39, shoemaker, to five years' penal servitude for numerous acts of forgery and offences under the Bankruptcy Act. He had for years been a chapel deacon.\n\nA BLUNDERING JURYMAN.—At Liverpool assizes on Thursday, Francis Duffy, a labourer, was indicted for the wilful murder of his wife.—During a quarrel prisoner brutally struck the woman, and the injuries she thereby sustained resulted in her death.—The jury were absent 15 minutes, and on returning into court the foreman gave a verdict of \"Wilful murder,\" and then, hastily correcting himself, said, \"Oh no; 'Not guilty.'\" After a momentary pause, he added, \"Guilty of Manslaughter,\" that being the correct finding of the jury.—Sentence was deferred.\n\nMANSLAUGHTER.—Two indictments for murder were disposed of at the assizes at Swansea on Thursday. In one case, Jeremiah Muhoney, found \"Guilty\" of the lesser crime of manslaughter, he having killed a married woman named Morgan in a house of ill fame at Cardiff, was sentenced to 20 years' penal servitude; and a man named King was sentenced to 15 years' penal servitude on being found \"Guilty\" of the manslaughter of his paramour, Elizabeth Bridley, at Merthyr Tydfil.\n\nSENTENCE OF DEATH.—William Turner, a collier, charged at Liverpool assizes with murdering his wife by kicking her to death at Skelmersdale, was found \"Guilty,\" and sentenced to death.\n\nSERIOUS OFFENCE.—At the Liverpool assizes on Friday the Rev. Patrick Pacificus Wade, a Roman Catholic priest of Darlington, was tried for having committed a rape on Charlotte Henderson, five years of age, at Prince's park, Liverpool, on the 20th of last month. He was acquitted of the more serious offence, but pleaded guilty to an indecent assault, and was sentenced to two years' hard labour.\n\nTHE TREDEGAR RIOTS.—At the Monmouth assizes, on Thursday, six men who pleaded \"Guilty\" to participation in the recent riot at Tredegar were sentenced each to three months' hard labour.\n\nTHE ALLEGED ARSON BY A TRADESMAN.—At the Suffolk assizes, at Bury St. Edmund's, on Friday, Simon Herbert T. Last, tobacconist, and Alfred Tollidy, silversmith, were charged with causing a great fire on the 15th June, at Bury St. Edmund's, when several business premises and the County Club house were destroyed, the inmates of some of the houses barely escaping with their lives, and damage was done to property to the estimated amount of £15,000 or upwards. Last, it was stated, was in embarrassed circumstances, and had insured for £300, while the value of his stock was £30. Tollidy had been mixed up with Last in money matters. Baron Pollock did not call for Tollidy's defence, but discharged him. The jury were locked up for four hours, and were then discharged without agreeing to a verdict. Last was allowed out on bail until another assize.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206252931.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 730, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2906, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]