[{"id": "6817c1b91d65ba90312fec82c22b5d7fdae02e4d", "text": "A CASE BOX ROBBERY.\n\nEdward Wilson, fifty-six, described as a cloth-worker, was charged, at the West London Police-court, with being concerned in stealing a cash-box. Harry Frapprud, clerk to Mr. Walter Charles Ems, an estate agent, of Lower Phillimore-place, Kensington, deposed that on the 27th of July a man came into the office for £1 worth of silver, which he gave him, and he left. Witness locked the cash-box and placed it in the desk. Three minutes afterwards a cab drove up, and he was called out to the prisoner, who was sitting in it. He stated that he had a house of furniture to sell, and inquired if he could sell it. Witness said \"Yes,\" and asked for the address. The prisoner gave an address in Russell-road. While witness was talking to him another man came out of the office. He came up and touched him (the witness) on the arm, saying, \"I see you are engaged. I'll come back in a quarter of an hour.\" The man went away, and the prisoner asked him (the witness) to sell the cabman to drive on. Witness told the cabman, who drove off. Witness was out all day, and inquired at the address in Russell-road, and found that there was no furniture to be sold. The next day he found the desk wrenched open and the cash-box, containing about £11 12s. in gold and silver, gone. On Thursday he identified the prisoner at the Kensington Police-station. Detective-sergeant Brogden said on Thursday he saw the prisoner and another man on Westminster Bridge. He addressed him as \"Jemmy,\" and said he should take him into custody for being concerned in a number of till robberies committed in different parts of London. He denied all knowledge of them. In answer to the prisoner the sergeant said he had seen the prisoner several times since July, but it did not suit him to take him. Mr. Hopkins remanded the prisoner, who had been in trouble before, and refused bail.\n\nAll the charges for drunkenness at the West London Police-court, on Saturday, were against women. One gave the name of Mary O'Dell. It was stated that she fell down in St. Ann's-place, Notting-hill, while drunk, and cut her head. Mr. Plowden directed her, and she said sixty-five. The assistant-keeper said that she was over six on the sheet as seventy-nine. Mr. Plowden: Women generally take ten years off their age. (Laughter.) The assistant-keeper said that the prisoner had been charged several times, and in different names. The prisoner promised the magistrate not to come before him again. Mr. Plowden ordered her to pay a fine of 5s. The Prisoner: God bless you! thank you. (Laughter.)\n\nA REPENTANT THIEF.—On Saturday the police of the N Division were informed that a jewellery traveller's bag, which was stolen early in the week, had been returned with contents untouched. The facts of the case are these:—Last Monday a gentleman called at a house in Carling-road, Ealingbury, where resided a traveller for a G. & Co. jewellery firm. He said he had been shown the traveller's sample bag, and told such a plausible story that he got possession of the bag and about £200 worth of jewellery. When the traveller returned to his home he discovered that his bag and samples had been unlawfully obtained, and he at once went to the Upper-street (Islington) Station and gave a description of the man and the jewellery. While the police were still searching for the thief he seems to have repented. Any way, he sent back the bag per Carter-Paterson carriers. Notice appeared on this, but the police fancy they have a clue to the man.\n\nOn Monday, at the Mansion-House Police-court, William Wilson, fifty-five, described as a secretary, was charged, before Lord Mayor, with embezzling and stealing sums of £111 and 38s. Mr. Vennell was counsel for the prosecution, Mr. D. Norman, solicitor, for the defence. The defendant had been for the last five years secretary and manager of the Warehousemen and Clerks' Permanent Building Society of Cheapside, at a salary of £120 a year. His duty was to receive deposits due from depositors, borrowers, and shareholders, and to enter the amounts in various books, paying the total into the society's bankers every day. Recently the directors found a suspicion owing to the increasing number of arrears, as appeared from the defendant's statements, and the depositors' books were called in. The defendant then admitted that he had committed a breach of trust, having lent the money to people to save them from ruin. He also said he had never used any of the money for his own purposes. The defalcations were said to amount to about £100, but it was stated that there were means to cover the amount. The Lord Mayor remanded the defendant.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810905.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1104, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4648, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]