[{"id": "ab8e0b93e5d02433a0b91c841901aeb89b58ff75", "text": "CORONER'S INQUEST.\n\nMELANCHOLY SUICIDE OF A YOUNG FEMALE.—Yesterday afternoon an investigation, which lasted upwards of five hours, took place in the board-room of Christchurch workhouse, Blackfriars-road, before Mr. Carter, on view of the body of Ann Eliza Gardner, aged 24, who was found in the River Thames on Tuesday last.\n\nJames Faulkner, carpenter, deposed that he was employed at the works at Blackfriars-bridge. On Tuesday afternoon, while at work under the second arch, his attention was called to something floating on the surface of the water, which, upon being taken out, proved to be the body of the deceased.\n\nBy the Coroner: Did not make any examination or search; there were no marks of violence about the head; the deceased had on a large brown cloak, a shawl, and straw bonnet; there were also clogs on her feet.\n\nBridge, the headle, here stated that he searched the deceased, and found in her pockets half a sovereign, two five-shilling pieces, three half-crowns, one shilling, and tenpence in copper. In consequence of a paragraph in the papers the body had since been owned.\n\nMrs. Mary Hawkins, residing in Alfred-place, Cross-street, Blackfriars, stated that she was acquainted with the deceased, who was a servant. On Friday afternoon deceased called upon her, and remained some hours. She appeared very much depressed in spirits, and frequently cried.\n\nCatherine Mead stated that she lived at No. 10, Wells-street, Oxford-street; knew the deceased, who was a few days back in the service of Mrs. Cherton, hosier, of Oxford-street, who on Thursday last discharged her, because she refused to clear the snow, which fell during the late storm, from the roof of the house; since then she had procured another situation, but Mrs. Cherton refused to give her a character, and the parties she had engaged with consequently refused to take her. That circumstance appeared very much to prey on the deceased's mind, and she frequently exclaimed that \"Mrs. Cherton might as well have taken her life as her character.\" Since then she had been in a very desponding state.\n\nBy the Jury: Believed, on her oath, that the deceased destroyed herself in consequence of not being able to procure a situation.\n\nBy the Coroner: The deceased had formed an acquaintance with a young man, who was then present, but she believed that nothing improper had occurred between them.\n\nIsaac Gardner, brother of the deceased, saw his sister on Thursday night last, when she appeared very dejected; from the conversation which then took place, he had no doubt but that his unfortunate sister destroyed herself in consequence of the disappointment occasioned by Mrs. Cherton refusing to give her a character.\n\nThe jury returned a verdict of \"Temporary Insanity.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3207167129.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 644, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2751, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]