[{"id": "f865a56d11938e4496c9bfec1b730a24ffe5ece5", "text": "J. L. SULLIVAN AND HIS OPPONENTS\n\nThe special train carrying John L. Sullivan and party passed through Meridian (Mississippi), at full speed on Sunday night, but was brought up in the shortest possible space of time just outside the town by the discovery that a sleeper had been placed across the rails. The engine and tender narrowly escaped destruction. The obstruction was removed, and the train went cautiously forward till it reached Fuscaloosa. As it passed out of that city a stone was thrown at the train, which shattered the first window of the second carriage.\n\nTHE ALLEGED MURDER IN WESTMINSTER.—DISCHARGE OF THE ACCUSED.—Henry George Whittenbury, landlord of the Duke of Clarence public-house, Horseferry-road, was charged, on remand, at Westminster, with cutting the throat of George Matthews, a potman. The prisoner, while suffering from delirium tremens, entered the room occupied by Matthews and cut his throat with a razor. The injured man was removed to the West London Hospital. He died a few days later, not, as it was proved at the coroner's inquiry, from his injury, but from delirium tremens. Mr. Angus Lewis appeared for the Treasury, and stated that the advisability of proceeding with the charge against the prisoner had been carefully considered. The authorities did not intend to go on with it, as the medical evidence clearly showed that the superficial injury which the prisoner inflicted was neither directly or indirectly responsible for death. The peculiarity about the case was that both the men suffered from delirium tremens. Mr. De Rutzen said as the Treasury offered no evidence all he had to do was to discharge the prisoner.\n\nWILLIAM CONNOR, fifty-eight, was charged, at the Guildhall Police-court, with stealing and concealing spirits, and John Connor, thirty-three, his son, and Robert Rundle, thirty-two, with aiding and abetting William Connor in the said offence. Thomas Phillips, an officer of the Inland Revenue, said that he went to the Rising Sun public-house, Royal Mint-street, and asked the elder Connor what spirits he had. He said he had some in the bar. He showed him some spirits there, and said that he had no more. Witness went upstairs and found a gallon jar of whisky for which he had no permit. In a bedroom were three six-gallon jars full of spirits. In consequence of information witness next went on to the roof, and saw there spirits running through the gutter. Rundle was there. On going downstairs and asking the elder Connor where the spirit was coming from, he said he could not tell. Witness then found a nine-gallon jar lying on its side with the cork out. The gutter was full of spirits. He also found a gallon jar of rum in the bar, and a gallon jar full of spirits in the kitchen. The prisoners were charged and taken to the station. Witness seized twenty-six gallons of spirits altogether. Remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810776.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 651, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2874, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]