[{"id": "72448794f147ab3f5a1ae323bace1a2394d58316", "text": "ALLEGED CRUELTY TO A WORKHOUSE GIRL\n\nMrs. Augusta Laigh, a lodging-house keeper, residing at 10, Park-place, Liverpool-road, appeared at Clerkenwell police-court, in answer to her recognizances, charged with committing a series of violent assaults upon Ann Dean, whom she had taken as servant from the Islington workhouse.\n\nEllen Morgan, who said: I am seventeen years of age, and am now an inmate of the workhouse of St. Mary, Islington. I used to be in the service of Mrs. Laigh. I left her service about seven weeks ago, on the Tuesday before Christmas. On the day before I left I do not recollect anything taking place. On the Sunday before Christmas there was some tea in the teapot. Susan Dean poured it out into a cup. The defendant came down to the kitchen and said, \"Who has poured the tea out of the teapot?\" Dean said, \"I did.\" The defendant then said, \"What business have you to take it out, when I wanted it myself?\" and then hit Dean across the eyes with the back of her hand. On the Saturday before I saw my mistress hit Dean on the shoulder with a chopper. She struck her because she upset a bath of water. It was between seven and eight in the evening. On the Friday before that the defendant hit her once on the head with the poker. Dean bled very much from the effects of the blow from the poker. On the Thursday the defendant hit the complainant with the poker on the head, which also bled, because she could not wring linen with her right hand. She was left-handed. Witness put a wet cloth on complainant's head. Susan Dean left on the Monday.\n\nMr. F. G. Graves said: I was the resident medical officer of the workhouse. On the Monday before Christmas I saw Susan Dean at the workhouse. I examined her head, and found five wounds at the back of her head, each of which was about an inch in length. They were scalp wounds and through the skin. There were also marks of two wounds in the front of the head. In my judgment the wound on the back of the head had been inflicted about a week, and the latest about four days. On the right arm, just below the elbow, there was an abscess. There was an extensive wound on the right side and back. The left eye was swollen and discoloured. There was inflammation of the skin of the covering of the left blade-bone, and below the left elbow. There was also inflammation of the left knee, which might have been produced by a blow.\n\nMr. Lewis, for the defence, called witnesses with a view to show that the injuries were sustained by the girl during a scuffle with Ellen Morgan, who was then also in the service of Mrs. Laigh.\n\nMr. Tyrwhitt sent the case to be tried by a jury.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206202140.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 641, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2635, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]