[{"id": "78c08b037b7157b89786dfff3c3e885306152209", "text": "A SAD FAMILY STORY.\n\nFridget Pott, aged 33, married, of 9, Portpool-lane, Gray's-inn-road, was charged at Clerkenwell police-court on Thursday with cutting and wounding her husband, Thomas Pott, bookbinder, by striking him on the head with a small poker and a piece of granite. She was further charged with being drunk when taken.\n\nA story is connected with this case. Some time since the complainant attempted to commit suicide, owing, as he stated, to the harsh conduct of one of the School board officers in not allowing one of his children, about 13 years of age, to continue to work to help support the family, he (the father) being ill, and his wife and children in a starving condition. The public took the matter up, and a sum of money was subscribed, and Potts, with his wife and family, were placed in a coffee-house at Highgate-hill. That money was soon squandered by, it is stated, the present defendant, who has since been in custody at this court on charges of drunkenness and wilful damage. The whole of the family have since then been in dire distress, the woman, it being stated, leading a most drunken and dissolute life.\n\nThe complainant, who appeared weak and ill, whose head was enveloped in surgical bandages, and whose clothes were saturated in blood, stated that yesterday his wife struck him on the head with a small poker, because he would not fetch her some gin. She went out and returned with a large piece of granite, and whilst he was sitting she went behind him and inflicted such severe injuries on his head that he was rendered nearly insensible, and had to be taken to the Royal Free hospital, Gray's-inn-road, to have his wounds dressed. He was now, it was stated, in a dangerous state.\n\nPolice-constable Thomas, 186 G, said the defendant was drunk when he took her into custody.\n\nMr. Sheil, the defendant having no defence to make, remanded her for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206247302.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 468, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1892, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]