[{"id": "1daa93c7eb3f687661ec9d2c443d66d03bc49125", "text": "CHARGE OF EMBEZZLEMENT.\n\nAlbert Batchelor, a traveller, residing in Oxford-gardens, Notting-hill, surrendered to his bail, at the West London police-court, on Saturday, to further answer the charge of embezzling money belonging to Mr. Otway Richard Sykes, who traded in the names of Messrs. Martin Sykes and Co., and who carried on the business of a waterproof garment maker, of East-row, Kensal-road. The facts elicited on the last occasion were that there was a stamped agreement between the accused and Mr. Sykes, and it contained a clause that the document should not be constituted into a partnership. Mr. Sykes' would have accepted him as a partner had it not been for the fact that he (the accused) had been unsuccessful in obtaining his discharge as a bankrupt. Mr. Syke's father had placed 1,700l. into the business, and the prosecutor admitted, under cross-examination, that Mr. Sykes, sen., lent him and the accused 1,500l. of the money, under a covenant to repay it on call. This sum had been recalled. The accused had power to receive money on behalf of the firm, but had no right to appropriate it to his own purpose.\n\nFlora Groves, a mantle maker, of Brixton-road, gave evidence as to the payment of two sums of money, 18l. and 13l., to the prisoner for the supply of goods by the firm—sums of money which the prosecutor stated that he had not received. Witness added that the accused asked her not to mention to the firm about his having received the money. She was asked why she neglected to state these facts on the last occasion, and she gave as a reason that the attack which was made on her private character by counsel for the accused made her forget them.\n\nMr. John W. Capewell, who traded as Capewell and Hughes, at Lime-street, Liverpool, said in June last the prisoner obtained from him an advance of 5l., and said he would deduct it from the next account, goods having been ordered from his firm.\n\nThe prisoner, who pleaded \"Not guilty,\" was committed for trial, bail being accepted for his appearance.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206277734.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 507, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2029, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]