[{"id": "e07692c2422839249e9739f68f8d13b805b5743c", "text": "THE CHILD MURDER AT ISLINGTON.\n\nThe inquest was resumed on Monday before Dr. Lankester, at the Old Parr's Head tavern, Upper-street, Islington, with respect to the death of James Nevill, an infant 12 days old, whose body was found on the pavement in Canonbury-place, on Monday evening, the allegation being that the child had been stolen from its bed in the house of a woman with whom it had been placed to nurse. The boy was the illegitimate offspring of Susannah Nevill, a domestic servant, in the employ of Mrs. Wallace, 34, Almaterrace, New North-road, Hoxton. Its paternity was admitted by Mr. Wallace, her master. The following fresh evidence was given:—Sabrina Tompkins said she was a widow, with four children, and got her living by washing and ironing. On the morning the child was brought to Mrs. Davis she saw it, and noticed the head was deformed. She had once or twice attended to the child during her absence. On Monday night, after nine o'clock, she was standing at the street door, when Mrs. Davis asked her to look after the child, as she was going out. About 10 minutes after she had left she heard the child whine, and went in again about five or seven minutes afterwards. The child was there, and all right. People came in sometimes and placed bundles of mangling on the table, as the parlour door was always open. Witness then went out, and on her return at about five minutes to 10 o'clock, she saw Mrs. Davis at the street door. She asked witness, \"Where is the baby?\" Witness said it was all right, but on looking in the bed it was gone. It was then thought that Mrs. Spencer had the baby, and they both went up to Mrs. Spencer. They then made a further search.—By the jury: Mrs. Davis was supposed to have the child for a twelvemonth. The impression was that the child had been taken away by the Wallaces, Mrs. Wallace being a very strange woman.—Mr. James Wallace, warrant officer of the Whitechapel County court, said he was the father of the child in question. It was born in his house, and he had paid all expenses, and had put it out to nurse. His wife was perfectly agreeable to such a course. He had no idea as to who had taken the child. He knew of no one who had any vindictive feeling towards him.—Mrs. Wallace deposed to the circumstances stated by her husband, and said that what had been done for the mother and child was with her concurrence. It was an unpleasant revelation, and she determined to make the best of it. She was rather partial to the child, and regretted its loss.—Mr. Wallace said if the jury would adjourn he would offer a reward of 50l. with the greatest of pleasure.—Adjourned accordingly.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206232665.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 659, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2647, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]