[{"id": "d751d5be513a1d72feed7abf04c5faee888da522", "text": "THE HOMESTEAD POISONINGS.\n\nTwo Thousand Men Ill.\n\nPatrick Gallagher, the cook who revealed the alleged plot to poison the non-unionist hands at the Carnegie Mills, has been arrested and taken to prison; Davidson, the cook's assistant, surrendered to the warrant issued for his arrest, and was released on bail. It is reported that three more non-unionist workpeople have died at Homestead under suspicious circumstances, and it is believed that they also have been poisoned. The district coroner has decided that the bodies of all workers at the mills who have recently died under circumstances where there might be any doubt as to the cause of death shall be exhumed and subjected to a post-mortem examination. The matter is being considered by the grand jury. Mr. Christie, an official of the Carnegie Company, says, \"I know that thirty-two men have died of poison, but this is not all.\" Many others, some of whom will appear at the trial, are dying on their feet. Since we began this inquiry we have been startled by the number of letters we have received from every part of the country from non-unionists, who sickened of the prevailing complaint at Homestead and went to their homes. Some of these are still ill, and all are confident that they were poisoned. Altogether, we had four thousand men employed during the strike, of whom two thousand sickened, many being for weeks on the verge of the grave.\"\n\nThe Frant Murder.—At Lewes Assizes, the other day, Mr. Justice Hawkins passed sentence of penal servitude for life on Frederick French, who was charged with the murder of Lucy French, at Frant, and found guilty of manslaughter.\n\nThe Blenheim Orchids.—Messrs. Protheroe and Morris yesterday concluded the sale of the late Duke of Marlborough's orchids at Blenheim Palace. The competition was greater than ever, although there was a marked falling-off in the attendance, which is no doubt accounted for by the fact that the best things were disposed of on the previous days. The total amount of the sale is over £5,000.\n\nThe Alice Barnes Murder.—Mrs. Duckworth, wife of Cross Duckworth, now under sentence of death at Walton Gaol for the murder of Alice Barnes at Witton, on November 8th last, had an interview with her husband yesterday. She was accompanied by their two children. The interview was granted at prisoner's request, as he was anxious to settle some matters connected with the pension he received as an army reserve man.\n\nCheapest Bread in England.—The Spalding Board of Guardians have accepted a contract for the supply of bread to the workhouse, from the New Year, at 2½d. per 4lb. loaf, of 2d. per 4lb. loaf if of whole-meal, and flour 8d., a stone whole-meal, or 1s. a stone good seconds flour. This is stated to be the lowest price at which bread is supplied in England. The contract is entered into by a local tradesman in the ordinary course of business, and the low rate is a puzzle to some of the guardians.\n\nDismissed the Service.—Richard Coobe, engine-room artificer, serving on her Majesty's ship Pembroke, was tried by court-martial on the flagship Northampton, at Nore, the other day, for striking his superior officer. From the evidence it appeared that Chief engine-room artificer Gibbs was speaking to another engine-room artificer, when the accused spat in his face three times, and also struck him in the face with his clenched fist. The prisoner did not deny the charge, but said he struck Gibbs under provocation. The Court ordered Coobe to undergo eighteen months' imprisonment and be dismissed the service.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811144.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 815, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3552, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]