[{"id": "b7aca1b61a5ee652344595cadd594b4dfbb86e69", "text": "FATAL CARRIAGE ACCIDENT.\n\nA carriage accident, which was attended with fatal results, happened in Broad-street, the busiest thoroughfare of Reading. Mrs. Pope, an aged lady, who was on a visit to the town, was driving in an old-fashioned phaeton, accompanied by her brother, named Mr. Burroughs, and when opposite the General Post Office, in attempting to turn in the opposite direction, the vehicle swerved, and the aged occupants were precipitated into the roadway. Unfortunately the horse was not stopped until one of the wheels had passed over Mrs. Pope's head. Medical aid was at once obtained, but life was found to be extinct. Mr. Burroughs escaped without serious injury.\n\nA HAWKER named John Burton, sixty-four, belonging to Sheffield, was arrested on Friday morning in Glasgow in connection with the death, at 31, Lyon-street, of Catherine Campbell, or Stewart, with whom he had lived. The deceased, whom the police allege to be a convict, was found dead in bed. Her face, wrists, and various parts of her body bore marks of recent violence, as of kicking. Burton was drunk when arrested.\n\nWe have been favoured with specimen numbers of \"Our Bubble\"—a charming periodical for children. It is edited by Dr. Barnardo, which vouches for the interesting nature of its contents. It is most profusely illustrated. The number under mention contains no less than sixteen illustrations, beautifully printed in chromolithography, and we can assure our little friends that there is no magazine in the market more likely to take their fancy than \"Our Bubble,\" which we wish every success.\n\n150 FITS IN TWO DAYS.—Dr. King-Houchin, the Deputy-coroner for East London, held an inquest at the Bow Vestry Hall on the body of Harriett Webb, aged thirty-three years, lately living at the Institute for Working Girls, Fairfield-road, Bow. The deceased for some time past has sold newspapers outside the Bow-road Station. On Friday she was found unconscious in the street, and was taken home. Between that time and Sunday she had no fewer than 150 fits. The medical evidence showed that death was due to exhaustion, following an excess of epileptic fits. The jury returned a verdict in accordance with the medical evidence.\n\nANOTHER BOY HERO OF THE THAMES.—While bathing in the Thames near Cannon-street railway-bridge, Mr. W. Newman and a boy named Chapman were carried off their feet, and Newman was drowned. At the inquest on Wednesday, William Gladstone Strong, a boy of fourteen, said he saw them struggling in the water, and, without a moment's hesitation, plunged in. He succeeded in rescuing Chapman, but by the time he had got him ashore Newman had sunk. The coroner paid Strong a very high compliment, and said that it transpired that the boy had been the means of saving life from drowning on previous occasions. He is also the holder of seventeen first prizes for swimming, and had been styled in the sporting papers as \"the wonderful swimming midget of the city of London.\" The jury returned a verdict of accidental death.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200813277.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 689, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3024, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]