[{"id": "b0e2086ece37f3bd5f34ffc813be3c308b606cf9", "text": "THE CLARE MARKET TRAGEDY.\n\nJACOB HILL, thirty-three, labourer, was indicted for the wilful murder of his wife, Emma Hill. Mr. Drummond, at the request of the Court, defended. Mr. Bodkin, who, with Mr. Bancroft, prosecuted on behalf of the Treasury, said the occurrence took place on the evening of the 24th ult. Deceased and the prisoner had been married about twelve years, and on the evening in question they were in Portugal-street, Clare Market. An altercation took place between them, and prisoner was seen to strike his wife in the breast with a knife. He disappeared on the arrival of the police, but was arrested the following morning at Silvertown. The woman was taken to the hospital and died the following morning. Prisoner made a statement to the effect that the occurrence was accidental, and he also said that he threw the knife over the railings of King's College Hospital. A witness named Capper, the brother of the deceased, said prisoner and his wife lived together at 4, Gilbert-passage, Covent Garden. On the day of the occurrence they had been drinking together. Cross-examined: Deceased was a very violent woman and was addicted to drink. She had struck the prisoner, and they did not get on very well together. He had never seen prisoner strike her. He was a quiet, peaceable man. The deceased used very foul language at times. A witness named Spence deposed to seeing deceased attempt to strike prisoner repeatedly. He had a knife in his hand and repeatedly warded off the blows. Mr. Justice Wright remarked that after this evidence it would be difficult to sustain the charge of murder. Mr. Drummond: I shall not contest a verdict of manslaughter. Some other evidence was called, and the prisoner's statements were put in. Mr. Bodkin said he was quite willing to admit that the prisoner was a quiet, inoffensive man, and that he had lost several situations through the deceased. She was a most violent woman and was a perfect terror to the neighbourhood. The jury found the prisoner guilty of manslaughter only, and recommended him to mercy on account of the provocation he had received. He was sentenced to six months' hard labour.\n\nNOVEL EXECUTION IN MEXICO.—Colonel Jose Andrade, who had been found guilty of atrocious crimes, among them that of shooting a number of innocent persons in cold blood, was shot at daybreak on Thursday, in the Plaza Mayor, Mexico, in presence of an enormous crowd. The prisoner was accompanied to the scene of his execution by a priest.\n\nSTRANGE CONDUCT OF POLICEMEN.—A case of considerable importance to cyclists was heard at the West Bromwich County-court, on Wednesday, a Birmingham cyclist named Adcock suing Police-constables Sherwood and Lane for damages for assault. Plaintiff was riding through Oldbury when he heard a voice, \"Knock him off,\" and immediately Lane placed his foot in the front wheel of the machine, plaintiff being thrown to the ground and injured. The defence was that the constables were acting in the execution of their duty in stopping plaintiff, as he was riding without a lamp. This, however, was denied. The jury awarded the plaintiff £8 damages.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811905.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 708, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3135, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]