[{"id": "64ef94a1ffc38ca492231778324d0b0a2714dfee", "text": "ATTEMPTED MURDER AT CAMBERWELL.\n\nAt Lambeth police-court, on Tuesday, John Conner, 23, living in Aboukir-street, Old Kent-road, labourer, was charged before Mr. Biron with unlawfully wounding Ruth Laws, by stabbing her with a knife in St. George's-road, Camberwell.\n\nThe complainant, a married woman, living in Cator-street, Peckham, stated that the prisoner was her sister's husband. They were all out together on Monday. In the evening they left a public-house, and whilst in the St. George's-road the prisoner said, \"I have got a knife.\" Seeing him aiming a blow with a knife at her, she put up her right arm to protect herself. The knife struck her on the arm, causing a wound. She became insensible for a time, and afterwards found herself attended by a doctor.\n\nWilliam Roberts, a porter, said all the parties were the worse for drink. He saw the prisoner aim the blow, which evidently looked as if he meant to stab her. She put up her arm, and caught the blow on it. The prisoner also ran at the youngest sister of the prosecutrix, apparently to stab her, but she got out of the way. The prisoner followed the prosecutrix to the doctor's house, still having the knife.\n\nPolice-constable 526 W said he was informed of the affair, and found the prisoner outside the doctor's house. He was trying to force his way in. Witness took hold of him, and said he would be charged with stabbing his sister-in-law. Prisoner said, \"Yes, and I'll settle her now,\" and he then tried again to get into the surgery. Witness struggled with the prisoner and managed to get the knife produced from his pocket. At the station the prisoner said \"If I am not locked up I'll do for her yet. I opened the big blade.\" He afterwards said he did not know he had a knife in his pocket, and that he only tried to get into the doctor's place to see if he had hurt her much.\n\nIn answer to Mr. Biron, the police officer said all the parties had evidently been drinking. The husband of the prosecutrix said it was not the first time the prisoner had threatened her with violence.\n\nMr. Biron remanded the prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206260965.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 526, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2086, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]