[{"id": "afaeb10af85def4a9be9e7c4e805984e8dd21313", "text": "THE PHOENIX PARK MURDERS.\n\nFrom Dublin comes a statement to the effect that the efforts of the police to throw some light upon the Phoenix-park murders have been not wholly unsuccessful. The daggers used in the assassination were, it is alleged, found in Dublin, or, as one report states, in the suburbs, about two months ago. The weapons are described as knives, whose blades are about three-quarters of an inch in breadth, and fully nine inches long, with a small handle. They were very sharp and of good steel. It is considered certain that they are of English make and had not been purchased in Ireland, the shape being peculiar, resembling a narrow carving-knife. Naturally the police are very reticent about the discovery, but it has transpired that several arrests were made in consequence of it; though some of the officials are inclined to the opinion that these arrests, which were made under the Life and Property Protection Act, rather hindered investigation into the crime. The occupant of the house in which the weapons were found was imprisoned, and only liberated recently, after six weeks' detention. There are now believed to have been 10 persons concerned in the murders, mostly Irish, but with a minority of Irish-American's. Westgate's statement that he was paid for taking part in the assassination is not corroborated by any information which the authorities have received. The police have reason to believe that the murderers are still in Ireland, and suspicion points to the individuals, but unless the aid of an informer can be secured there is no evidence on which the crime can be brought home to the guilty parties. There is said to be little doubt that the car was a private and not a public vehicle. At the time of the discovery of the knives it is reported they had upon them signs of blood, and they were subsequently sent to public analysts for examination.\n\nThe barquentine Gladstone, in which Westgate, the self-accused murderer of Lord F. Cavendish and Mr. Burke, sailed from Swansea in May last, has returned to that port. The vessel sailed for Tucacas on the Thursday after the murder, and Westgate was shipped at the last moment. The master reports that Westgate's behaviour was noticed to be generally peculiar, and he made a partial confession, which was reported to the mate, and confirmed the suspicion which had been early entertained. Westgate was put in irons and conveyed to Puerto Cabello, where the master delivered up his prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206253370.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 544, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2482, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]