[{"id": "2305799c70b8d3d7ac017e784d0beec673301531", "text": "EXTRAORDINARY ENCOUNTER WITH A BURGLAR.\n\nThe capture of a burglar was effected in Birmingham, on Sunday night, in a rather remarkable way. A draper named Page, who carries on business in the Coventry-road, about six o'clock noticed that a box containing £32 in money, a bank-book, and some insurance policies, had been moved from one place to another in the bedroom at the back of the house. Mr. Page did not pay much attention to the circumstance, but he thought it would be just as well to take the box downstairs. He did not observe anything wrong with the room, and directly afterwards he asked his daughter Helen, who is about eleven years of age, to go to the bedroom for a coat. As soon as she entered the clothes-closet she was confronted by a tall man, who pounced on her and placed his hand tightly across her mouth to prevent her from screaming. He found he could not in this way stop an alarm being given, and he then knocked her down, kicked her on the head, and knelt on her. Luckily her father heard her cries for help, and rushed to her rescue. The man heard Mr. Page coming, and prepared to escape. He dashed for the window, threw up the sash, and in his hurry toppled a looking-glass from the dressing-table into the yard beneath. The crash of this was the first thing Mr. Page heard on opening the door. Looking towards the window he saw the fellow getting out; in fact, he was in the act of leaping, but Mr. Page was just a little too sharp for him. A rush brought him up alongside the man, and as he was slipping from the window Mr. Page caught hold of him round the neck. Mr. Page was thus inside the room, while the intruder was suspended by his neck outside. \"Let me go; you are choking me,\" he cried. \"Yes, I'm aware of that,\" said Mr. Page; \"for two pins I'd strangle you.\" A policeman was sent for, and the man began to realise that what with the chances of arrest and the risk of being strangled his prospects were decidedly gloomy. He made up his mind to make some show of resistance. The burglar began by striking his captor about the head. Mr. Page was equal to the occasion, however. He let go the fellow's neck and caught hold of his wrist instead. Prosecutor had thus one hand disengaged, but it was by no means unemployed. He punched the man's head most heartily. The thief was at a decided disadvantage owing to his position, and he was soon aware of it. He waived any further idea of resistance, and was content to remain quietly hanging from the window. At this juncture Police-constable Jeffrey arrived. Directly Mr. Page saw the constable he threw his prisoner down to him. Fortunately for the man, who was thus precipitated into custody, the roof of a washhouse intervened, or he would have had a clear drop of twenty feet. As it happened, however, he rolled from the roof into the yard, where Jeffrey received him. \"Are you going quietly?\" asked the constable. \"I'm not going at all,\" replied the accused. He altered his mind, with good reason, in a very short time. The officer laid hold of him, and led him to understand that any misconduct would meet with summary correction. The upshot was that he went calmly to the Coventry-road Police-station.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811448.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 761, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3192, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]