[{"id": "facfe635a3ba2ad8ad89e8deae991485b46278f9", "text": "THE JOCKEY AND THE WIDOW.\n\nIn the Appeal Court on Thursday, before the Master of the Rolls and Lord Justices Lindley and Bowen, the case of Franklin v. Wilson came on for hearing. This was an appeal of the defendant, Mr. E. P. Wilson, a gentleman jockey, against the judgment of Mr. Justice Bruce and the jury awarding the plaintiff, who is a widow, £500 damages for breach of promise of marriage. Mr. Scarlett appeared for the appellant, and the respondent was represented by Mr. Wildey Wright. Mr. Scarlett, who opened the case for the appellant, contended that the theory put forward by the plaintiff, that the letters written were part of a plot to blind Polly Clark, was absurd. The Master of the Rolls: This gentleman seems to have been a sort of Don Juan. Mr. Scarlett: There was no doubt but he was a little changeable. The Master of the Rolls: A free and easy gentleman. Mr. Scarlett: He fell under this lady's fascination when he was with her, and she could do what she liked with him. The Master of the Rolls: When he was in sight he could not help it, and when out of sight he could. Mr. Scarlett said that Polly Clarke and Mrs. Franklin had joined forces against Wilson. The Master of the Rolls: Only naturally. He had deceived both Polly and the widow. He seems to have gone about promising marriage. Mr. Scarlett said he was prepared to take the risk of a new trial. He contended that the damages against this tenant-farmer were excessive. Justice Lindley: Did you not run the damages up yourself by bringing all this out about the hair, the cab, and the drink. The Master of the Rolls: One of your witnesses called her a \"dead boozed.\" It was an insulting breach of promise.\n\nAfter further argument the Master of the Rolls asked what did the defendant go to the Golden Cross Hotel at Oxford, forty miles from his own place for, except to make love to the landlady? This man would have his pleasures. Mr. Scarlett: The question is, has he not paid too much for his pleasures. The Master of the Rolls: We cannot say that. If the jury found that the letters were part of a plot, they were not right. The letters did not amount to a rescission of the engagement whether they were genuine or not. Whenever the time came to marry her he was always shuffling off. He missed the train on two occasions. Men who want to marry women don't miss trains. (Laughter.) His letter was an unmanly one, and her's was an ordinary feminine one. (Laughter.) There never was a clearer case. He had taken a fancy to this landlady of the hotel and promised her marriage. He had hampered himself with some one else. When he was at home he preferred Polly, and when in the widow's company he preferred her. (Laughter.) He (the Master of the Rolls) had no doubt that Polly was instrumental in his missing the trains. He would have found the same verdict as the jury had done in five minutes. As regards the damages, the defendant had insulted her. He had called her a drunkard. He had broken off the engagement in an insulting and unfeeling manner. Lord Justices Lindley and Bowen concurred. The appeal was therefore dismissed with costs.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811364.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 739, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3127, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]