[{"id": "4ad98088ec7306139179a54abf07f22f381e78f0", "text": "TRAGEDY IN CLARE MARKET.\n\nA woman, named Emma Hill, aged thirty-two years, the wife of a Covent-garden porter, was stabbed with fatal effect during a quarrel, which occurred outside King College Hospital, Portugal-street, Lincoln's-inn-fields. It appears that an altercation arose between the woman and a man, supposed to be her husband, in Portugal-street. A struggle ensued, and several blows are stated to have been struck. The woman suddenly cried out that she was stabbed, and immediately fell to the ground. The hall porter at King's College Hospital, hearing the woman scream, rushed out, and was just in time to see her in the act of falling. At the same moment he saw a man running in the direction of Chancery-lane. He found the woman lying on the pavement in a pool of blood, and nearly unconscious. She was at once conveyed into the hospital, where she was found to be in a very critical condition, and suffering from a severe stab in the breast. The wound had evidently been inflicted with a large knife. She lingered on until Sunday morning, when, as it was seen that she was failing, her depositions were taken, with the result that her husband was later in the afternoon arrested at Woolwich and conveyed to Bow-street Police-court. The woman died at 10.45 a.m. She is stated to be the mother of three children.\n\nAt Bow-street Police-court, Jacob Hill, thirty, described as a market porter, of Gilbert's-passage, Clare-market, was charged before Mr. Lushington with the wilful murder of his wife, Emma Hill, by stabbing her in the left breast with a knife. Formal evidence only was given to justify a remand. The prisoner's statement when arrested was read in court. He said that he had been drinking with his wife in a public-house. She had two half-pints of beer while he had one. He saw the beer was taking effect on her, and told her she had better get something to eat. She then turned round and used an objectionable expression. \"I walked away from her,\" he continued, \"and she followed me. I had a knife in my hand trimming my nails. She struck me, and I put up my hands to ward off the blow. As she pulled my arms down the knife entered her breast. My life has been a misery since I married her twelve months ago. If you go to Mr. Quick, of 13, Drury-lane, he will give you my character and hers too. You may also ask Mrs. Snelgrove, at the public-house next door. I had to leave my employment in consequence of her coming to me and using bad language. I threw the knife away, as I said no more mischief should be done with it.\" Prisoner was remanded for a week, and was again formerly remanded on Monday.\n\nMr. Troutbeck held an inquiry on the body on Wednesday. Thomas Williamson, plaster's labourer, stated on Saturday evening he was walking near King's College Hospital, when he saw the deceased and her husband talking. He saw the man take two paces forward and then lift his hand and stab the woman with a clasp-knife in the breast. After hearing further evidence the jury returned a verdict of \"Manslaughter\" against Jacob Hill.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811798.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 727, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3058, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]