[{"id": "abe9bea308b85c83a9fa8ce9ab4a49befba7fcce", "text": "FATAL ACCIDENT TO A GROOM.\n\nAt the Lambeth Coroner's Court, on Thursday, Mr. G. P. Wyatt held an inquest on the body of Edgar Waghorn, aged fourteen years, a groom in the employ of Sir Henry Davies, and lately living at No. 49, Queen's-gate-mews, Belgravia. James Waghorn, a plumber, of Hunton, near Maidstone, identified the body as being that of his son. Percy Waghorn, whose head was swathed in surgical bandages, said that the deceased was his brother. They were both employed at the same stable. On Monday afternoon they were exercising two of his master's horses, and had proceeded as far as the Surrey side of Chelsea-bridge when both the animals became frightened at the shrieks of the whistles on the river and the shouts of the people attending the race for the \"Doggett's Coat and Badge,\" which was being rowed at the time. The horses dashed through Battersea Park into the square, where they both collided with a miller's van which happened to be passing at the time. Deceased, whose horse was killed on the spot, was thrown underneath the vane one of the hind wheels of which passed over his chest. Witness's horse mounted the back of the van, and threw him into the road on his head; he remembered no more as he was rendered unconscious. By a Juryman: Deceased was a good horseman and was used to animals. Witness had hold of the head of the horse ridden by deceased at the time they bolted, but was compelled to let go, or he would have been pulled out of his saddle. He could have steadied his own horse, but instead of so doing went in pursuit of his brother, who had evidently lost all control over his animal. Police-constable Thomas Edwards, 517 V Division, who was on duty near the spot, after attempting to arrest the progress of last witness's horse, which was ultimately captured uninjured, went to the assistance of deceased, and subsequently conveyed him to St. Thomas's Hospital in a cab, where he was seen by the house surgeon and at once admitted. Dr. J. R. Box stated that when he saw deceased he was suffering from shock to the system and internal hemorrhage. He also had a large scalp wound and fractured skull; He died about an hour after his admission. A post-mortem examination had been made on the body, which showed that deceased had five ribs fractured, as well as a lacerated lung. The immediate cause of death was collapse consequent upon the injuries. The coroner having commented upon the sad nature of the case, the jury returned a verdict of accidental death.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810646.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 597, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2503, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]