[{"id": "d21a5baef14c8bd3fddc31b34642b2de5ad8026c", "text": "CENTRAL CRIMINAL COURT.\n\nOLD COURT.\n(Before the Recorder.)\n\nTHE CASE OF MR. WADE.\n\nMr. Beasley, who is instructed to prosecute in this case on behalf of the Treasury, applied to the court to postpone the trial, on the ground that one of the witnesses was ill and unable to attend.\n\nMr. F. H. Lewis, who appeared for the prisoner, said he had no objection to the postponement.\n\nThe trial will consequently stand over to the July session.\n\nBenjamin Everett, 42, a respectable-looking man, described as a printer, was charged with receiving a quantity of leather and other articles, the property of George William Shelton.\n\nMr. Orridge prosecuted; Mr. M. Chambers, Q.C., was specially retained, with Mr. F. H. Lewis, for the defence.\n\nThe prosecutor in this case is a boot and shoe maker, carrying on business at 14, Churys-court, Poplar; and on the night of the 22nd of August last year his house was broken into and a quantity of boots and some kid skins, to the value of about £50l., were stolen. Since that time a man named Simpson was tried for the robbery. A man named Yates, who has been sentenced to ten years' penal servitude, was also concerned in the robbery, and from information which the man Yates has given since his conviction, the prosecutor went to the house of the prisoner Everett, in company with two officers, and having told him that his warehouse had been broken open, and described the goods which had been stolen, asked the prisoner if he had bought some boots and shoes of a man named Yates. The prisoner said he did not know anyone of that name, and never bought any boots of him in his life, and denied altogether having bought any goods of the description last.\n\nThe convict Yates was examined as a witness, his being the principal evidence. He said that on the night of the 22nd August last the prosecutor's house was broken into, and some boots and shoes stolen, which were brought to his house by the man Simpson, who was accompanied by two other men known as \"Velveteen\" and \"Scotch Dick.\" They were brought in a cart at about 1 o'clock in the morning. He took them to the prisoner's house and told him he had got something that would suit him, and showed him the goods, and the prisoner asked what he wanted for them, and Simpson, who was with him, said 30l. The prisoner said that was too much, and offered 20l. for them. Simpson, however, agreed to take 23l., and the bargain was completed, and the witness (Yates) received a sovereign for his trouble. The prisoner asked whose they were and Yates told him they had come from Shelton's. The main point, however, relied upon by the prosecution was the fact of the prisoner having denied all knowledge of the man Yates when questioned by the prosecutor, it being alleged on the part of the prosecution that they were well acquainted with each other.\n\nMr. Chambers made an earnest appeal to the jury on behalf of the prisoner, and he contended that the charge rested entirely upon the word of the man Yates, who, he said, was utterly his own character, a witness entirely unworthy of belief. He also called witnesses to prove that on a night spoken to by the witness Yates he was engaged in sticking up with a sick person named Kendrick.\n\nThe Recorder having summed up, the jury retired to deliberate upon their verdict, and after being absent about twenty minutes they returned into court and gave a verdict of Guilty.\n\nEvidence was then given that the prisoner was convicted of felony in this court. The conviction, it appeared, took place as far back as the year 1847, and the offence was stealing a purse.\n\nThere were several other charges of a similar nature against the prisoner, but as Mr. Chambers objected to their being tried by the same jury, and no other jury was in attendance in consequence of there being three courts sitting, it was arranged that the other charges should stand over.\n\nHenry Kill, 18, pleaded guilty to two charges of forging the signatures to Post-office money orders, and he was sentenced to eighteen months' hard labour.\n\nJohn Lewis, 18, pleaded guilty to a charge of forging an order for the delivery of a banker's cheque book, and he was sentenced to eighteen months' hard labour.\n\nJulius Louis, a Frenchman, pleaded guilty to an indictment charging him with stealing a gold watch and chain and a considerable sum of money.\n\nMr. Pater, who appeared for the prosecution, informed the court that the prisoner took up his abode at an hotel in Golden-square, and the prosecutor was also a guest at the same hotel. During the night the prisoner got into his room and stole everything he could lay his hand on, actually removing the railway rug of the prosecutor, which he had placed under his pillow to raise it higher.\n\nThe prisoner was sentenced to eighteen months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3202982093.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 1074, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4793, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]