[{"id": "b23499e882be1d51cb6d68040f368e9b4d6ed5c3", "text": "BABY STARVING.—On Tuesday evening Mr. William Carter held an inquiry at the Camberwell workhouse respecting the death of Ellen Hayley, aged 10 weeks. —Mary Marks stated that she was a nurse in the female receiving ward of Camberwell workhouse, and that on Thursday week a female with an infant child in her arms entered the ward. She stated that her name was Sarah Hayley, and that the infant was her daughter, and was named Ellen. Witness had the mother and child placed in a bed. The mother stated that she was a single woman, and that she had been employed as a domestic servant. The child looked very emaciated, and witness called Dr. King, the resident medical officer, to see it. That gentleman said, \"The baby is in a dying condition, and all it wants is proper diet.\" He then ordered food, which was administered to the infant. It gradually sank, and expired on Thursday. Shortly after the death of the child the mother left the workhouse, but she was immediately arrested by the police.—Detective-serjeant Stevens deposed that he was sent for by the Rev. Mr. Thorpe, of Camberwell, and asked to go to 12, Asylum-road, Old Kent-road. He there saw the rev. gentleman and the female Hayley and the deceased. At the request of Mr. Thorpe witness examined the child, and he found it \"fearfully emaciated.\" At the instigation of Mr. Thorpe witness arrested the woman and had her removed to Peckham police-station, where she was charged with neglecting to maintain the decensed by not giving it sufficient food, whereby its life was endangered. The charge was read over to the prisoner, and she replied, \"I have done all I could for the child. It was sickly, and I took it to Dr. Johnson, and that gentleman prescribed for the child in writing.\" In the prisoner's room witness found a bottle of medicine.—The court then adjourned.\n\nINTIMIDATING DOCK LABOURERS.—At Liverpool police-court, on Tuesday, James Malone and John Scott, porters, were charged with assaulting John Hanford and Alexander Corbett, porters in the employ of the Mersey Docks and Harbour board. The defendants were stated to have run their trucks, on which they were carrying heavy bags of rice, violently against the legs of the complainants.—The Bench considered the charges proved, and sent the defendants to gaol for a month.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206239803.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 554, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2300, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]