[{"id": "07b78d0532a348330b3e93c54fbebabdf46d1757", "text": "DEATH IN A WASH-HOUSE.—On Tuesday, Mr. W. Carter held an inquest, at the Trinity Arms tavern, Newington, on the body of Susan Hobbs, aged eighty-eight years, who was found dead in a cellar or wash-house, at 11, Swan-street, Dover-road. Mrs. Cutler, the deceased's daughter, stated that her mother was in the receipt of 1s. 6d. weekly from the parish of Gravesend, but for the last five months she had been residing with witness, being infirm and incapable of assisting herself, owing to her advanced age. Witness rented the house, which contained seven rooms, and they were chiefly let out to lodgers. The deceased lived in an underground back-room; and on Sunday morning last witness found the deceased complaining of difficulty in breathing. She gave her a little warm brandy and water, which seemed to relieve her. Shortly afterwards witness went to her, and discovered that the deceased was dead and cold. No medical man was called to see her before or after death. The officer said that when he entered the place where the dead body was lying he was nearly suffocated by the dreadful effluvium which filled the room. There was a sink in the corner that communicated with the common sewer, and the place seemed to him to be more like a cellar or wash-house. It was quite unfit for a human person to sleep in, more especially an aged woman like the deceased.\n\nCoroner: Could not a better place be found for your aged mother to sleep in?—Mrs. Cutler: No, sir; and she seemed very happy there.—Coroner: You have rendered yourself liable, by the Metropolitan Building Act, which came into operation on the 1st of July, 1846, to a fine of 20s. every day that such a place is occupied otherwise than as a warehouse or store-room.—The jury concurred in the observations of the coroner, and returned a verdict of \"Natural death.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206199353.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1614, "total-output-tokens": 451, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1825, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]