[{"id": "7fe2a72d0e85a0a025c8dd5aa682e61276ef9502", "text": "SUICIDE OF AN ANARCHIST.\n\nDr. George Danford Thomas held an inquiry at Holborn Town-hall concerning the death of Karl Hauser, twenty-eight, a wood-carver and art-metal worker, who was found shot through the head with a revolver in his bedroom at his lodgings in a French restaurant, 24, Cross-street. Mr. Wishart, of Jewin-street, City, deposed that the father of the deceased was an eminent clock manufacturer in Lenz Kirst, Black Forest, Germany. The deceased was a single man, and came to England about three years ago. He frequently borrowed money from the witness, until he owed him £35. The deceased's father wrote to witness not to lend the deceased any more, as he was a lazy man, and would not work while he could borrow money. Last Friday the witness told the deceased what his father had said, and he replied \"Very well; I shall go to the German consul and ask him to send me back.\" The deceased was a very lazy man, and would not work. Mdme. F. Poirier, keeper of the French restaurant, 24, Cross-street, Hatton-garden, deposed that the deceased occupied the first floor front bedroom. On Monday night, about midnight, he came home as usual. About an hour later she heard a loud noise. That morning a Mrs. Watney, who lived next door, knocked at the door, and receiving no answer opened it, and found the deceased lying in a pool of blood, with a wound in his face and a revolver by his side. He was dead. Mr. A. Eidrichs, a wood-carver, said that deceased had worked for him, and could make from £2 to £3 per week. The witness had some work to do for the Chicago Exhibition, but the deceased refused to work. He was a lazy fellow, and strange in his ways. He had ideas about regenerating society. He was \"a kind of an Anarchist.\" Dr. J. A. Miller having deposed that the deceased had shot himself behind the right ear, and that death was instantaneous, the jury returned a verdict of suicide whilst temporarily insane.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810698.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 490, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1931, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]