[{"id": "33c7a95e7d8a91156e3714357348edbd889d5155", "text": "FRIGHTFUL TRAGEDY AT GRAVESEND.\n\nOn Monday, John Horace Holmes, assistant to Mr. Edwards, Italian warehouseman, Milton-road, Gravesend, was charged, at the Borough police-court, with the murder of William Elgar, a fellow assistant, aged eighteen years. It appeared that the deceased had been engaged on Sunday afternoon writing a letter for the housekeeper, and about a quarter to five he went upstairs to call his fellow-assistant down to tea. He went up for that purpose, and called the prisoner, and shortly after a pistol was heard to go off, and on the inmates proceeding to the room they found the young man William Elgar lying on his left side with his head in a pool of blood. The prisoner ran downstairs and again returned into the room and threw himself over the body and prayed earnestly. Dr. Whitcombe was called, and deposed as follows:\n\nBetween four and five o'clock on Sunday afternoon I was fetched to the house of Mr. Edwards, Milton-road, Gravesend. On going there I found a young man lying in an upper room. He was not dead, but I at once saw that the case was hopeless. With assistance I got him on the bed and remained with him till his death, which occurred about an hour afterwards. I enquired of the prisoner how the affair happened, and he said that they were playing with sticks, and he suddenly said, \"I will shoot you. He snatched a pistol from a cupboard, and shot him. He (deceased) never spoke after. The side of the face and head was mottled, as if the pistol had been discharged close to deceased's head. It was a bullet wound. I did not discover the bullet. Prisoner told me he loaded the pistol. I asked him for the weapon with which he did it, and he handed me this pistol. (Produced the weapon.) I examined it, and found it had been recently discharged, and that it had a broken cap on the nipple. I then asked him who loaded the pistol, and he said, \"he did, last Monday night, with powder and ball.\" I asked him what he had it in the room for? He said he kept the pistol loaded, but when he went to London last week he withdrew the charge, and on his return, on Monday or Tuesday, I don't know which, he reloaded it. He said he did not know it was cocked at the time he pulled the trigger. He seemed sorry for what had occurred, and remained in the room the whole time, and did all he could to save the life of the deceased.\n\nPrisoner said that in an unconscious moment he took the pistol. He didn't know it was cocked, and it exploded in his hand; deceased was shot.—The accused was remanded until Friday, when he was again brought up, and committed for trial on a charge of manslaughter.\n\nThe coroner's inquest on the unfortunate deceased was concluded on Thursday. The jury returned, after a brief deliberation, the following verdict. \"That the deceased came to his death in consequence of a certain pistol-shot wound inflicted by John Horace Holmes, and the jury find the said Holmes guilty of manslaughter.\"—The accused was then committed for trial, but the coroner offered to accept bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206227121.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 711, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3033, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]