[{"id": "cef75719f98906109af77ad6b29324667ff24da9", "text": "MYSTERIOUS DEATH OF A CHILD.\n\nThe inquest on the body of the child Anne Concanon, whose body, which had been stripped of boots and earrings, was found in a closet on the 2nd inst., was concluded on Wednesday. The evidence given did not throw any light on the child's death, but one witness, who had seen the child during the day, prevaricated and contradicted herself so much as to call forth remonstrances from the jury and a warning from the coroner. Medical evidence was to the effect that death was due to suffocation, and that the child bore evidence of having been assaulted. The jury, after being absent nearly an hour, found \"That the deceased had died from slow suffocation, but that there was not sufficient evidence to show how the child had got into the position in which it was found.\"\n\nA SOUTHAMPTON correspondent states that during the Queen's residence at Osborne an unpleasant incident occurred. Her Majesty, as everybody knows, drives through Cows with the greatest freedom, and the presence of Mr. Sweeney, the police officer in attendance at Osborne, has been scarcely more than a formality. But a few days ago, as the Queen was driving back to Osborne, a gentlemanly-looking person inquired of a bystander whether that was the Queen who was approaching. On being told that it was, he rapidly advanced to the carriage, and in a very violent manner said he was a foreign count, and that he and many others had sworn that if the Queen did not resign they would kill her. The attendants at once removed the man, who was found to be demented. Her Majesty showed great presence of mind. A day or two later a telegram was received at Osborne stating that \"69\" would do himself the pleasure of calling upon the Queen. In due course a man arrived, who said he had occupied No. 69 bed in a hospital visited some years ago by her Majesty, and that he had called upon the Queen to say that he had no money, and would be glad if she would assist him. In this case also it proved that the man was demented. Only 9d. was found upon him, and he appeared to have been in good circumstances at some time.\n\nA VIOLENT SEAMAN.—Robert William Kermur, twenty-seven, a seaman, of 2, Prince of Wales-road, Custom-house, was charged, at the West Ham Police-court, before Mr. Baggallay, with being disorderly, and with assaulting Constable Bland, 393 K, in Francis-street, Canning-town, on the 17th inst. At about half-past eight on Wednesday night the constable was called to Francis-street, where he found the prisoner acting like a madman, and he had, was stated, knocked a woman down, and also kicked a child. When arrested he became very violent, and kicked the officer in the stomach. Ten days.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810720.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 652, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2694, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]