[{"id": "2886d678d7fddc21462d37ea1d5294051c0497dd", "text": "EXTENSIVE SHOP-LIFTING.\n\nAt Marlborough-street police-court, on Thursday, Mary Melbourne, 59, fashionably attired, and wearing spectacles, lodging in Grafton-street, was charged, on remand, with stealing 11 yards of black silk, worth 2l., from the shop of Messrs. Dickins and Jones, Regent-street, and two-and-a-half yards of cashmere from Peter Robinson's, Oxford-street. She was also charged with being unlawfully in the possession of a hand-bag and pocket-book, supposed to have been stolen.\n\nThe prisoner entered the establishment of Messrs. Dickins and Co., on Jan. 21, and was seen in the act of concealing a piece of silk beneath the sleeve of her cloak. She was given into custody, and when searched at the station, the hand-bag and pocket-book were found in her possession.\n\nWilliam Rose, a shopwalker at Messrs. Shoolbred's, said that the prisoner was in their shop on Jan. 20. She was ushered into a side room and asked for the things she had taken. She said nothing, but took a woollen jersey from under her left arm. Beneath her other arm was a pair of boots, rolled in paper, and in her hand was a bag; and these also she gave over to him. She gave her name and address as \"Mrs. Murray, 40, Fitzroy-square,\" and as she pleaded a pitiable story witness was ordered to take her home, but he found that both name and address were fictitious. She was, however, let go. Witness had since identified three umbrellas, a mantle, a cloak, and some gloves which had been found at her lodgings, as the property of his firm. They were altogether of the value of 7l. or 8l. A quantity of other goods was found at her lodgings.\n\nThe prisoner pleaded \"Not guilty,\" and said that her husband had upset her, and she became under the influence of drink, and remembered nothing of what occurred afterwards.\n\nMr. Newton committed her for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206275071.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 478, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1838, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]