[{"id": "cf89f2321f8a21cef4dc966dc7ba7ad1def9ac28", "text": "A DEAR DISAGREEMENT.—At Wigan County-court, on Tuesday, before Judge Jones, Sarah Whittle, of the Swan-lane Inn, Hindley-green, obtained a verdict with £250 damages in an action against John Morris, a pit under-viewer, who during “a disagreement” at the inn, struck and kicked her and pulled her along the floor by the hair.\n\nCROYDON FIREMEN PUNISHED.—An inquiry was held at Croydon to investigate certain allegations made at the recent inquest on the body of Police-constable Wright, who was suffocated at the fire at North-end. Sir Edward Bradford and Superintendent Lucas attended the Inquiry. It was alleged that two of the firemen were intoxicated at the time of the outbreak, and in the result one was reduced and the other severely reprimanded.\n\nCHURCH PARADE OF 1,000 CYCLISTS.—A well-attended church parade of cyclists took place at Bedford on Sunday. One thousand cyclists rode in the procession, and the route was lined by thousands of spectators. Choral music was celebrated at St. Paul’s Church, which was filled by a very large congregation. The Mayor and Corporation of Bedford attended in state, and a large sum was collected on behalf of the local dispensaries. The parade was organised by Our Boys’ Cycling Club.\n\nMYSTERIOUS AFFAIR.—A mysterious affair is reported from Berkeley, Gloucestershire. The body of a well-dressed seafaring man has been found in a canal near Shepherds’ Patch. A letter addressed to a young lady at Newport was found in the man’s possession. From inquiries made it appears that the man, whose name is Charles William Williams, was engaged to a young lady, and that he left his vessel, her Majesty’s ship Hamadryas, at Cardiff a week ago to withdraw £500 from a Gloucester bank.\n\nBELFAST RIOTS SENTENCED.—At the Belfast Police-court, five men, named Cunningham, Murray, Mahony, Rocks, and Breen, were charged with being ringleaders of a stone-throwing mob in Belfast. On Sunday they attacked two policemen in such a savage manner that one of them, who was rendered unconscious, would undoubtedly have been killed but for the timely arrival of a large constabulary force, which dispersed the mob. Breen was sentenced to two months’ imprisonment and the other prisoners to six months’ hard labour each.\n\nTHE “CAT.”—At the Leeds Assizes John Conlan, thirty-five, hawker, and Bridget Conlan, thirty-seven, were found guilty of assault and robbery at Bradford, the prosecutor being a man named Crawley, who was knocked down, kicked, and otherwise brutally assaulted. Both prisoners were sentenced to five years’ penal servitude. Conlan in addition to receive thirty-six strokes with the “cat.” John Smith, labourer, who was found guilty of highway robbery, in addition to a month’s imprisonment, was also ordered to receive twenty-four strokes.\n\nKILLING A NEW-BORN CHILD.—At the Leeds Assizes Emily Harriet Wilson, eighteen, domestic servant, was charged with the murder of her newly-born child at Wentworth, near Barnsley, by suffocating it. When arrested the prisoner admitted the charge, saying that the child was born alive, and that she killed it by putting a handkerchief in its mouth. She said it was in her box, and there the dead body was found. The defence set up was a plea of insanity. The jury returned a verdict of guilty, adding their belief that she was insane at the time. She was ordered to be detained during her Majesty’s pleasure.\n\nCARDIFF PIES.—A remarkable case of supposed poisoning of a family, in which one case proved fatal, is reported from the village of Kilmington, near Axminster, Devonshire. Towards the close of last week the family of the Rev. J. E. Owen, curate in charge, received from Cardiff, where there have been so many cases of poisoning lately, some pork pies as a present. The three children and maid-servant ate heartily of the pies, and on Friday they were all very ill with symptoms of poisoning. One of the children subsequently died, but the others are now progressing favourably. The affair caused great consternation in the village.\n\nROBERT WITH VIOLENCE.—At Doncaster, on Saturday, two rough-looking customers, named Taylor and Hopworth, were charged with robbery with violence at Coulsdrough. A poor old man named Cotton went for a walk in the fields, and while sitting to rest himself he was accosted by the prisoners. One informed him that he was trespassing, and must pay damages; and as he refused both set upon him in brutal fashion and knocked him down. In the scuffle half-a-crown, which was in his waistcoat-pocket, was abstracted, and the prisoners then made off, but were subsequently apprehended. They were committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811642.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 1067, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4629, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]