[{"id": "e88fa5c4c545b15f798720f0392c18d5a8d9c97a", "text": "Deliberate Perjury.\n\nOn Wednesday, at the Middlesex sessions, Charles Williams, twenty-six, and Charles Slack, seventeen, were indicted for stealing a purse and other articles, on the 24th, the property and moneys of Alfred Jay, from the person of Myra Allen Jay.—Slack pleaded guilty.\n\nOn the afternoon of Thursday, the 16th of March, Sergeant Coathorpe, of the detective force, at Scot-land-yard, who had known Williams for three years, saw him riding by the side of the lad Slack on the top of an omnibus, in the Strand, and, seeing a suspicion of them, he got into a cab and watched them to Charlotte-cross, where he saw both prisoners get off. These afterwards got into other omnibuses, in one of which the robbery was committed for which they were now charged.\n\nMr. Montague Williams, on behalf of Williams, pointed out some discrepancies in the evidence, and said with all his care and intelligence Sergeant Coathorpe had this time made a mistake, and he should set up an alibi and show that Williams was not at the place at the time stated.\n\nThe prisoner was then taken out of the dock and put before the writing-box, and he swore that the other prisoner was an entire stranger to him, that he never walked out with him, that he was not with him at the time in question, but a man named Taylor, of Francis street, Tottenham-court-road, was the party who assisted him in the robbery; that Taylor was a different sort of man to the prisoner, and that he had a black moustache and not a light moustache.\n\nCharlotte Burkitt, of No. 3, Globe-street, Green-lane, said on this Thursday the prisoner Williams had said words with her, that he came to her house and remained there three or four days. He was not out from the Tuesday till the time when the officers came, as he had very bad legs at the time. He remained in her room with her husband and two children.\n\nCatherine Moseley, of No. 17, Catherine-street, City-road, said she went to Mrs. Burkitt's room on Thursday, the 16th March, and saw a stranger there, and that young man was the prisoner Williams. He was there from half-past two o'clock till half-past five, and he did not go out during that time.\n\nThe witness was called by Mr. Besley, who stated that they had repeatedly seen the two prisoners together, and although Williams bore a strong resemblance to his brother, who was a notorious thief, they knew them perfectly well to distinguish one from another.\n\nThe assistant-judge very carefully summed up the evidence, and the jury returned a verdict of \"Guilty.\"\n\nA previous conviction was then put in against the prisoner Williams, in 1855, when he was sentenced to four years' penal servitude, after a previous conviction.\n\nThe Assistant-judge (to the jury.) I am about to ask you, gentlemen, do you believe that in this woman Burkitt came here to commit perjury?—The foreman of the jury, No. one of the jury, my lord, believe a single word she says.—The assistant-judge directed her to be taken into custody, and ordered that she should be prosecuted for perjury.\n\nMrs. Moseley was then called forward and cautioned, and it was stated by Police-constable Miller, 148 G, that he had frequently seen Williams 50 in and out of her house, and he believed he lived with her. Mrs. Moseley had also a son called Tom, who was the associate of thieves.—The assistant-judge then ordered her to be taken into custody also.\n\nGeorge Lockyer, prison officer, said the boy Slack had three previous convictions on the 30th of June, 1860, as a rogue and vagabond.\n\nMiller, the constable, said that Slack was a most clever little thief, and he had frequently jeeringly told witness that he was too clever for him. He always had plenty of money, and once bought a horse to ride about with.\n\nJames Block, 124 G, said he had known Williams for fourteen or fifteen years as a thief, and he had been several times convicted. He never knew him to do any work, and he was trained as a thief.\n\nThe assistant-judge said this was a most audacious robbery, and any little sympathy they entertained for Slack, on account of his youth, was done away with by his getting into the box and swearing deliberately to that which he knew to be false. He saw no reason to make any distinction between the prisoners, and the sentence upon each of them was, that they be kept in penal servitude for seven years.\n\nSergeant Coathorpe was then ordered to stand forward, and the assistant-judge said the court were of opinion that they ought to mark their sense of his great activity and intelligence in following these prisoners, by ordering him to receive a reward of £21, not for the sake of the money, but as an expression of the feelings of the court, for the able manner in which he had acted in this case.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222248.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 1121, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4738, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]