[{"id": "cfb5ba911b77575a845c77a94c66a194ab0c720e", "text": "THE WIFE MURDER AT HARROW.\n\nAt the Central Criminal court, on Wednesday, Louis Midson, 52, victualler, was charged with the wilful murder of his wife, Bertha Midson, by shooting her in the parish of Harrow. This was a case of a melancholy character, and the facts will be fresh in the recollection of our readers. The prisoner kept a publichouse called the Chequers, in the neighbourhood of Uxbridge, and he had been married to the deceased for several years at the time the horrible occurrence took place, which was on the 6th of June last. It appeared that upon that day the prisoner and the deceased had had some altercation, that the latter was the worse for liquor at the time, and according to the evidence, the latter was \"nagging\" at the prisoner, and annoying him in every possible manner. About 12 o'clock the prisoner said that he would go upstairs and shave himself, and the deceased said that he might cut his throat if he pleased. The deceased went upstairs after him, and in the course of a very few minutes two reports of firearms were heard. Upon the potman and the nephew of the prisoner going upstairs to the bedroom, they found the deceased lying upon the floor dead, and the prisoner was lying wounded in an adjoining room, and upon the nephew asking him what he had done, he replied, \"I could not help it. She drove me to do it.\" A revolver was found lying close to the prisoner, and it appeared that he had discharged one of the chambers at his wife, and caused her death by that shot, and had then discharged another at himself, but the injury to him was of a trifling character. It was elicited in cross-examination that the parties had been married 28 years, and that the prisoner was uniformly kind to the deceased, but, on her part, she was continually annoying and abusing him, and that she was in the habit of getting intoxicated, and when in that condition made use of most foul and disgusting language to the prisoner. Mr. Slcigh, upon these facts, made an earnest appeal to the jury on behalf of the prisoner, and he urged upon them that under all the circumstances they would be quite justified in finding him guilty of the lesser crime of manslaughter.—A great many highly respectable witnesses were called to speak to the character of the prisoner, and they all described him as a humane and kind-hearted man.—The jury, after a short deliberation, found the prisoner \"Guilty\" of manslaughter, committed under excessive provocation, and they at the same time strongly recommended him to mercy on account of that provocation and his previously uniformly good conduct to his wife.—Prisoner was sentenced to five years' penal servitude. He appeared quite overwhelmed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206232666.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 610, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2699, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]