[{"id": "54ed5a98de22c5c6c249fde28e0f2a42f744b27c", "text": "SHOCKING MURDER BY A PHYSICIAN.\n\nGLoucester, Wednesday.—A fearful tragedy was enacted yesterday morning at the town of Lydney, on the South Wales railway, between this city and Chepstow. It appears that an elderly gentleman, of the name of Pownall, a retired physician and a native of Wroughton, Wilts, has been residing with Mr. Leete, surgeon, of Lydney, for the last three weeks. He had formerly been an inmate of Northwood's asylum, near Bristol, but had recently been discharged as cured, with a certificate to that effect from Dr. Davey, the medical superintendent. During his residence at Lydney he has been quiet and gentlemanly in his habits and conduct, and has never shown any symptoms of unsoundness of mind. About six o'clock yesterday morning he knocked at the servants' bedroom door, and called them up. One of them (a girl named Louisa Cook, aged fifteen years) dressed herself quickly, and went out. In a minute or two the other girl, who had not risen, heard a scuffle on the stairs, and cries of \"Murder!\" She got up and looked out, but could see nothing; and having called out, \"What is the matter?\" received no answer. She returned into the room to dress herself, leaving the door partly open, and in a minute or two Dr. Pownall, in his shirt sleeves, looked into the room, and said, \"Make haste; get assistance; some one has murdered her,\" and then retired to his own room, locking the door. Sergeant Pope, of the police, was immediately called in, and on going to Mr. Leete's bedroom, he found the poor girl, Cooke, lying dead upon the floor, with a fearful wound in her throat, from which a large quantity of blood had flowed. The poor girl had rushed into the room, exclaiming, \"Master, he has murdered me; I must die,\" having repeated which two or three times, she fell down dead. Dr. Pownall was immediately apprehended, and submitted quietly. An inquest was held last night at the Feathers hotel, Lydney, the Rev. H. Philpot, the vicar, acting as foreman of the jury.\n\nMary Ann Fryer, fellow-servant of the deceased, and the policeman Pope, having deposed to the above facts,\n\nDr. Pownall, who had not hitherto spoken, but sat at the table shading his eyes with his hands, said slowly and in a deep voice, \"I can tell you I unfortunately did it. I can hardly assign any motive. I felt I was bound to do something, and I could not resist it.\"\n\nMr. Charles Lydiat Leete deposed: I am a surgeon, residing at Lydney, and deceased was in my service. This morning she rushed into my bedroom with her throat cut, and died in a few minutes. When she came in she exclaimed, \"Master, he has murdered me; I must die.\" I have known Dr. Pownall for the last three weeks. He has been residing with me that time. He has all along appeared sane and reasonable, and I saw no change in him when I parted from him last night. He showed me a certificate from Dr. Davey, which certified that he left his lunatic asylum cured.\n\nMr. Teague, the coroner, having summed up the case, the jury immediately returned a verdict of wilful murder, and Dr. Pownall was committed for trial at the next assizes.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206206317.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 775, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3104, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]