[{"id": "213d07a5c02774c89084545f3db6402295e75f42", "text": "THE BURGLARY BY FOREIGNERS.\n\nAt the Clerkenwell police-court on Wednesday, Antonio Galioni, Matteo Dacola, and an Italian named Cioci, were charged, on remand, with entering the dwelling-house of Mr. John Volieri and stealing several onyx stones, value 60l., also with feloniously assaulting James Morgan at the same time and place.—Mr. Wontner said that since the last examination every endeavour had been made to induce the principal witness to leave the country. Mr. Cooke corrected a statement which had been made, that he had stated, that a young woman who had given her evidence was unworthy of credence. He had not heard the case. Mr. Williams said it was a mistake of his; it was Mr. Barker who had made the remark.—A witness named Cassamino Rossi, a barber, was then examined, whose evidence went to prove that he had seen the prisoners go to Galioni's house.—The witness D'Angolis said: I know a person named Saffi. I have seen the bill produced before. It was signed by a person who had left the country, and given to me. I did not present it for payment: I might have had one more, or five or six, in my possession, or perhaps, seven or eight. I had four or five in my hands. The young man who gave them to me, and who has left the country, used to give them to me to take care of for him. I did not obtain 4l. 10s. on this bill. The loan was granted to me before I placed the bill in his hands. The person's name was Jakanoli. I did not deposit the bill with him for 2l. I did receive the amount before I gave the bill as a security. The Count de Saffi's name is to the bill. I don't know who he is. I do not know that Count de Saffi has offered 100l. reward to discover the forger of his bills. The bills were given to me. Mr. Jakanoli lent me the money previous to receiving the bills, but he had seen them. I left them with him when I was in drink, and he was to take care of them for me. I cannot recollect how many I gave him to take care of. It was a long time ago.—I cannot recollect whether it was one or twenty. I received seven or eight to take care of. The name of the person who gave them to me was Rottiene, who, I believe, left London about the 1st of June. I discovered that they (the bills) were forgeries about fifteen days afterwards. It was in June that I gave Jakanoli the bills. I did not receive the 4l. 10s. all at once; he gave me the money in order that I might return it to him. I did not give him any security. When Rottiene left he said he was going on his private business. I came to London either on the first of June or the last of May, but I have been here many times. I was here in July, and received from the Italian Benevolent society sums of 2s. 6d., 12s., and 4f. I have been in such circumstances as to compel me to apply for assistance to the extent of 2s. or 3s. at a time. I believe I did apply in June for relief. When I applied I had these bills in my possession.—Mr. Cooke: The evidence to-day is new, and I shall feel it my duty to have this evidence read over to the prisoners, in order to give them an opportunity to make a further statement if they should think proper. Mr. Williams then shortly addressed the court, and produced three or four respectable witnesses, who gave evidence that Cioci was at such a distance from the prosecutor's residence at the time of the occurrence as would render it impossible to pass the house at the time he was sworn to do so by the apprentice. Mr. Cooke said it was a case for a jury, and committed the prisoners for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206226941.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 903, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3522, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]