[{"id": "fa3827285fcb958e5b1de906ce0c48b4c9b41f60", "text": "ALLEGED ATTEMPTED PARRICIDE.\n\nMr. Saunders was called from the Thames police-court on Tuesday to take the dying depositions of Michael Kelly, a labourer, of 29, Franklin-street, Bromley-by-Bow.—Dennis Kelly, the son of the above, who is charged with causing the injuries, was present during the examination.—The injured man said:—I live at No. 27, Franklin-street, Bromley-by-Bow. On Saturday night I was at home when my son Dennis (the prisoner now present) came in and ordered me out. I told him that I had more claim to the place than he had, and we began pushing one another. I don't know whether it was a hit or a kick I received, but it was either one or the other. The prisoner was the only person in the room at the time, and it was he who either hit or kicked me. It hurt me very much. I believe my son was sober. I had had nothing at all to drink. I was quite well up to the time, and it was the kick or hit I received that made me ill. I had had no quarrel with my son for three or four weeks. My son is 19 years of age and lives at home, but has not been doing any work for a good while. I have been keeping him.—In cross-examination by the prisoner the prosecutor said: I did not fall off the chair and injure myself. I was not blind drunk, or anything like it. I did go to sweep the crockeryware off the side.\n\nThe deposition having been read over to the injured man and his mark affixed, the prisoner was brought back to the court and remanded for a week.\n\nDISCOVERY OF EXPLOSIVES IN LONDON.\n\nA discovery of a number of shells and hand grenades has been made in Stoke Newington. While two labourers were digging on the site of an old cowshed they found about two dozen of these missiles, which afterwards fell into the hands of a number of boys, by whom they were distributed. A boy who became possessed of one of them placed it inside a washhouse copper, where it quickly exploded, doing great damage. Another shell also exploded in the street after being thrown down by a boy. It has since been ascertained that many years ago the house near the cowshed in which the projectiles were found was occupied retired commander of the Royal Navy, who constructed a grotto which was mainly composed of warlike missiles, from some of which the charges had probably not been drawn.\n\nTHE ACTION AGAINST LORD PERTH.\n\nThe hearing of the case of \"Lodwick v. the Earl of Perth and others\" was concluded in the Queen's Bench division on Thursday. The action was to recover 100£., which the plaintiff paid for shares in the Carriage Cooperative Supply association, by reason, as he alleged, of misrepresentations in the company's prospectus, issued in 1880. The jury found a verdict for the plaintiff against all the defendants, and judgment was given accordingly against all of them except Lord Perth, as to whom the plaintiff has to move for judgment. Execution against the other defendants was stayed for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206258241.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 704, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2915, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]