[{"id": "68158c732f58698a6b05e5033e92ec36aa3ec58d", "text": "ALLEGED PARRICIDE NEAR BIRMINGHAM\n\nThe Birmingham police have arrested a young man named William Weckman, nineteen years of age, in charge of having caused the death of his father, a shoemaker, in Ventnor-road, Hockley. A quarrel took place on Saturday evening, and when the police were called in, the body of the deceased was found in the hall, bleeding from a wound in the neck. The prisoner had met his father and abused him, struck him with a knife, and in endeavouring to wrest it from his hand the blade penetrated his neck. In the pockets of the deceased were found a number of spurious florins and half-sovereigns, and coinage plant was found in the house.\n\nMURDER BY A BOY.—A boy named Wittman, fifteen years old, has been arrested at Vienna for the murder of the little sister of a man named Schwalb, to whom he was apprenticed. Wittman indecently assaulted the girl, who was only fourteen years of age, and threatening to stab her friend had attacked and killed her.\n\nNEW CRIME ACCIDENT.—On Saturday, as Hugh McCallum, the proprietor of the hotel and farm at Kinlochallort, near Fort William, was proceeding along a road, accompanied by a shepherd, the latter's gun accidentally went off, and the contents struck McCallum's leg just below the knee. McCallum died shortly afterwards.\n\nATTEMPTED MURDER OF A YOUNG WOMAN.—Before the Nottingham magistrates, on Monday, Samuel Gale, of Derby, was charged with attempting to murder Annie Hunt, of Leicester, at a coffee tavern in Nottingham on Sunday night. The pair stayed together that night at a café, and in the morning the woman was found in bed with her throat cut. On the man being questioned he said he did not know what possessed him to do it. He was remanded.\n\nA WOMAN'S HEAD BUTTERED IN.—At Manchester, on Monday, a man named Meadow Croft was charged with the murder of his wife at Gorton. The prisoner attended at the town-hall on Sunday, and admitted he had knocked his wife down. On the police proceeding to the house they found the woman dead, with her head battered in and her body bearing many marks of violence. The prisoner, who declared that he only hit her with his fist, was remanded.\n\nDEATH FROM CHLOROFORM.—An inquest was held at Stockport Infirmary, on Saturday, relating to the death of Thomas McCandlish, sixty-three years of age, a traveller, of Redruth. A doctor and a doctor at the infirmary were attending on chloroform to McCandlish when he died. The house-surgeon, Mr. Bellamy, was examined. He stated that McCandlish inhaled but one drachm and a half, whereas witness had given patients two ounces. A verdict of death from chloroform was returned, and the medical men were exonerated.\n\nROMEO FROM THE ROSSILLY.—George Harris, seventeen, goods was indicted, at the London Sessions, for the theft of plate, portmanteaus and other articles, value £200, the goods of the Earl of Rossilly. On the 5th of October a quantity of luggage, the property of the Earl of Rossilly, was placed in a cart at the King's Head, Cheltenham, and the driver proceeded to the Turf Club, where the prisoner came out of the cab got out. Shortly afterwards the prisoner came out of the club and ordered the cabman to drive to Charing-cross. He then told him to drive on to an hotel in Villiers-street, where the goods were taken inside. The waiter at the hotel paid the cabman £6, and the prisoner paid him £1. Sergeant Parmenter, C Division, arrested the prisoner next day, and then found a quantity of the goods in Villiers-street, and the remainder in a house in Percy-square, Cheltenham Court-road. Prisoner's defence was that he had been led into it by another man. Sentence hard labour.\n\nALARMING ACCIDENT NEAR LEICESTER-SQUARE.—An accident occurred here last night which had serious consequences, in St. Martin's-street, Leicester-square, about half-past one on Monday. A mineral-water van was standing at the Leicester-square end of St. Martin's-street, while the driver was having his dinner, when one of the horses, named Jack, and rushing down the street, came up against a Great Northern Railway van, breaking the pole and the axle of the off side wheel, with the result that it turned over. Continuing their career, the horses successfully got round the corner, and the saddles of the curve crashed against boxes of minerals to be hurled to the ground with a crash. The horses then rushed on towards Whitechapel-street, but were brought to a standstill by the stable gates of Waterloo House and Swan and Edgar's (Limited). Trying to turn suddenly one of the horses fell, breaking the poll and scattering the gas bottles far and wide. The scene caused the House and Ope Court was one of great excitement for about half an hour.\n\nCHARGE AGAINST A CLERGYMAN.—At Portsmouth, the Rev. William Radclyffe, who is said to have been ordained in the colonies, and who was curate of Meeres Ashby in 1880, was brought up on three charges of obtaining goods by false pretences. According to the evidence the prisoner obtained jewellery, giving references to professional men well known in the town, and then pawned it. He was committed for trial, but at his own request the case was sent to the assizes, as he would have had to wait three months for trial at the sessions.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810958.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 1252, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5235, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]