[{"id": "7ea447127b1cbd6746d8fb97c237d47475d23317", "text": "COMMITAL OF A SURGEON.\n\nOn Tuesday evening, Mr. Humphreys and a jury assembled at the Lord Wellington public-house, Three Colt-lane, Cambridge-road, Bethnal-green, respecting the death of Eliza Garrett, aged thirty-four years, who, it was alleged, had died from injuries caused by a medical gentleman named Benjamin Vale, of No. 6, Henry-street, Limehouse-hold.—The case excited unusual interest, and the inquest-room was crowded during the inquiry.\n\nThe first witness called was William Garrett, of 9, Coventry-street, Three Colt-lane, who said: The deceased is my wife, and I know she was enceinte. I did not know that she was in the habit of visiting Mr. Vale, but she had told me that she was going to a gentleman for advice to do away with the child. I did not know how long she had gone in her pregnancy. She had not had any miscarriage to my knowledge. There was not any agreement between me and the deceased respecting her having more children. It was not my wish for her to go to Mr. Vale, and I forbade her going to him three weeks since. She told me one night that she had been to him, and said that he had used instruments upon her person. She had had some medicine from him.\n\nCoroner: But wait, if you please. Did she tell you what the instruments were used for?—Witness: I believe they were used to do away with the child.\n\nCoroner: Did she tell you what Mr. Vale was to charge her?—Witness: No, she did not. She was in a great deal of pain, which came on after the instruments had been used.—Coroner: What did you do after that?—Witness: Nothing. I allowed her to go on with the medical man she had engaged.\n\nCoroner: Do you mean to say that you allowed your wife to lie in that state without calling in a proper qualified medical man she had engaged?\n\nWitness: I did not interfere!—Coroner: What is your opinion as to the cause of your wife's death?\n\nWitness: I believe that she has died from injuries caused by the use of the instruments.\n\nLucy Reynolds, who lived next door to the deceased, stated that the latter had been delivered of two dead children; that she was in great agony before she died, and that she made the following statement to witness. She said that she had taken something to cause a miscarriage, that she had been to Mr. Vale, and she said that Mr. Vale had used an instrument with teeth in it, which opened with a spring at the end; that the instrument had been used upon her person; that Mr. Vale was to have half-a-guinea for his services; that she had been twice to Mr. Vale's house, and that her husband had been the instigator of her going.\n\nDr. Corner deposed that he called on Sunday morning last to see the deceased, whom he found suffering great pain over the bowels, &c. She died on the following morning. He had since made a post mortem examination of the body. The membranes of the brain were rather congested. The lungs, chest, and other organs healthy, excepting that the heart was thin. There were three distinct marks on the mouth of the womb, which might have been the result of puncture by the instrument referred to, but the exciting cause of inflammation was most likely from such punctures in the absence of any other known cause.\n\nIn reply to a juror, Dr. Corner said that inflammation and death might have resulted from cold, anxiety, or over-exertion.\n\nThe coroner then called Mr. Vale, the surgeon, into the room, when he cautioned him in the usual form.—Mr. Vale made a long, rambling statement, and denied the allegations made against him. He said that he had never used any instruments upon the deceased.\n\nThe coroner, in a very clear and succinct manner, summed up the whole of the facts after recapitulating the voluminous testimony, when the jury unanimously agreed to a verdict of \"Wilful murder\" against Benjamin Vale and William Garrett, for killing and slaying Eliza Garrett.—The coroner then made out his warrant for the committal of the accused, who were placed in a cab and conveyed to the gaol of Newgate by Mr. John Smith, the summoning-officer of Bethnal-green, to await their trial at the ensuing sessions of the Central Criminal court, Old Bailey.—The prisoners, when they left the inquest-room for the cab, were greeted with loud hooting and yelling from the assembled multitude.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206212365.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 997, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4262, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]