[{"id": "aefea1f8749c641fe884fbcda9f8b24c87e32fb9", "text": "A SAD STORY.\n\nFlorence Sturt, twenty-two, a married woman, was charged before Mr. Lane, at the North London Police-court, with stealing two silver watches and a silver chain, valued at £8 and £3 in gold, the property of her father, John Frederick Wands, a road foreman residing at the Local Board Depot in Lotbair-road, Hornsey. The prosecutor said that on the 12th inst., his daughter was living at his house, but on that day she absconded, and the property mentioned in the charge was missed. At six o'clock that morning the girl returned, and said \"she wanted to clear herself from suspicion.\" She was given into custody. Mr. Lane elicited that the girl, without the witness's knowledge, was married four years ago by special licence at St. John's, East Dulwich, to a worthless fellow, who lived with her for a fortnight only. He then deserted her, made love to a servant girl at Exeter, and was on the point of marrying her when the prisoner stopped the proceedings. Since then, under promise of marriage, the husband had duped and robbed several servant girls, and for this he was sentenced to eighteen months' imprisonment. During that term he became insane, and he was now confined in a lunatic asylum. The father added that he was at a loss to know how the girl got her living when she was not at home. He did not know where she went to after she stole the things. Sergeant Alexander said that the prisoner had confessed to taking the property. He knew her husband. He was a bad character. He promised marriage to eight girls in as many weeks, and succeeded in robbing them all. Mr. Lane remanded the girl for eight days to consider what should be done with her.\n\nA TRAGEDY.—John Langford, forty, was, at Liverpool, committed to the Assizes on a charge of the wilful murder of Elizabeth Stephens, twenty-eight, and also with attempting to commit suicide on the 3rd inst.\n\nDEATH OF A POLICE INSPECTOR—The Metropolitan Police Force has lost one of its most able and highly-esteemed officers by the sudden death of Sub-Divisional Inspector Sanctuary, S Division, the other morning. At midnight, while in discharge of his duties at Albany-street Police-station, Regent's Park, he was suddenly seized with paralysis, which proved fatal. The deceased officer, who was in the prime of life, leaves a widow and three children.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812913.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 554, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2326, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]