[{"id": "a226f2f5ab7da89c4d077f4b5a291f0d3dbddc12", "text": "CUTTINGS FROM THE COMIC JOURNALS\n(From Punch.)\n\nGROUND GAME.—Lawn Tennis.\n\nMIDSUMMER APPEALS.—Appeals for ice, claret-cup, picnics, garden-parties, and light summer dresses.\n\nGROUND GAME, &c.!!—Squire (rather perplexed): Hullo, Pat! Where did you get the hare?—Pat: Shure Surr, the cr'atur' was wand'rin' about, an' I thought I'd take't to the \"Wanes\"!!—Squire: But did the keeper see you?—Pat: Bliss yer honour, I've been lookin' for him iver since I caught him!!\n\n(From Funny Folks.)\n\nWHAT France says to the Jesuit.—\"Go father, and fare worse.\"\n\nTHE PORTES TO THE POWERS.\nOf territory you are all so greedy,\nYou make me cede a lot because I'm seed-y!\n\nA NEW DEPARTURE.—Actors have always been good at \"gags,\" but they have hitherto been confined to the stage. Gagging now extends to audiences.\n\n(From Punch.)\n\nA GOOD PLACE FOR BREEDING RABBITS—Co(l)ney Hatch!\n\nLUMBERLY DELUSIONS.—That the new steel corvettes in our navy are provided with steel-yards, and that they use these steel-yards to weigh their anchors with.\n\nMIDSUMMER MADNESS.—Wagmore: Now, girls, what queen of antiquity surpassed even Titania in her fondness for donkeys?—You give it up?—Why, Dido, of course, for she fell in love with any ass.—Eras, don't you see.\n\n(From Judy.)\n\nNOTICE OF MOTION.—The railway whistle.\n\nFOOD FOR THE MIXED.—Candles.\n\nA MEAN (MIEN) ADVANTAGE.—Superiority in appearance.\n\nQUITE RIGHT, DEAR.—Girl looking at herself in pretty bathing-dress): It does seem a dreadful pity to wet it.\n\nARK-ISHNESS.—First Young Lady: I hate this horrid walking; we look just like the animals coming out of the ark.—Second ditto: Ark-adian bliss compared to this, Maude; they had a gentleman to see them out. Noah would be decidedly preferable to Miss M'Stinger.\n\n(From Moonshine.)\n\n\"DISTRESSED UNIONS.\"—Bad marriages.\n\nWHAT the Theatrical Manager said when he found the dress-circle, second-circle, and upper-circle all empty.—\"Oh, ye tiers!\"\n\nHISTORY LESSON.—School Teacher: Now, then! Next boy, George III., died in 1820, who came after him?—Scholar: Dunno, sir.—School Teacher: Next boy, then.—Scholar: The undertakers, sir.\n\nTHE troops, on their return from Windsor last week, got thoroughly drenched. This is not to be wondered at, considering that the review was held in the reign of Victoria.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206247536.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 661, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2276, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]