[{"id": "533dc74c154c2b5551ad9e202c2031971222cc01", "text": "LONDON COUNTY SESSIONS.\n\nEdward Smith, eighteen, a professional shoplifter, pleaded guilty to stealing a piece of bacon from a cheesemonger's shop in Marylebone. A detective having proved several convictions for similar offences, the learned chairman sent him to prison for one year, with hard labour, remarking that he was evidently on the road to penal servitude. The prisoner, who laughed at this, tripped lightly out of the dock.\n\nRichard Grey, thirty-eight, labourer, pleaded guilty to stealing a parcel of the value of about £5, the property of a person whose name is unknown. Henry Evans, police-constable 130 L, proved that in January of this year he was sentenced to six months' hard labour for stealing a clock. The learned Chairman: Prisoner, you seem to spend your time in miserable pilfering of articles of trifling value, for which you have suffered long imprisonments. Although the articles are of small value the court must take the nature of the life you lead into consideration. You must go to prison for nine months.\n\nJohn Lawrence, thirty-eight, labourer, was indicted for stealing a cushion, value £2 10s., the property of the London and North-Western Railway Company, from a third-class carriage at Willesden Station. He pleaded not guilty. Chief Inspector Pearson attended on behalf of the railway company. The cushion, which was stuffed with horsehair, was stolen on the 16th of October. The next day Detective Buckingham, engaged at Willesden Station, met the prisoner with another man in the Uxbridge-road, and told him he should take him into custody on suspicion of stealing the cushion. He said he did not steal it, but knew where its contents had been disposed of. He was carrying a sack at the time, and in it was some loose horsehair which corresponded with the hair stolen from the cushion. The prisoner said that all he had out of the job was the price of two half-pints of beer. The next day the detective went to the shop of a marine store dealer named Gregory, Baker's-lane, Ealing, where a quantity of the stolen hair was found. On Monday John Shaw, manager to Gregory, was called as a witness, and admitted receiving the hair from a man he did not know. He paid fourpence per pound for it. He made no entry of the transaction. They had other establishments at Hounslow, Chertsey, and Brentford. The learned Chairman directed the witness Shaw not to leave the court, as he should have a word or two to say to him. The jury found the prisoner guilty. It was proved that he had before been convicted of stealing communication cords from carriages. The learned Chairman said there could be no doubt that he was a dangerous, mischievous person, and would have to undergo nine months' hard labour. He ordered the witness Shaw to stand forward, and, addressing him, said: In my opinion your conduct is very little short of receiving stolen goods. Morally, you are as bad as the prisoner, and I shall disallow your expenses. Stand down, sir.\n\nGeorge Johnson, twenty, pleaded guilty to stealing thirty-two yards of sergo, value £3 10s., the property of the Great Eastern Railway Company. The parcel was stolen from one of the company's vans while in transit to Ipswich. A former conviction for housebreaking was proved, and a sentence of five years' penal servitude was passed upon him.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200808407.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 757, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3316, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]