[{"id": "d739553da7340d482b5b6f587bed6ea1ac21a3ac", "text": "ATTEMPTED MURDER AND HIGHWAY ROBBERY.\n\nOn Monday, the avenues of Clerkenwell police-court, shortly after the commencement of business, were crowded to excess to hear a charge of attempted murder and highway robbery. The prisoners, who are well known to the police, and one of whom was only discharged from that court on Wednesday week, on a charge of loitering with intent to commit burglary, are slim-built fellows. They gave their names Henry Cotton, No. 9, North-street, Caledonian-road, Islington, a wood carver, and William Wadsworth, a tailor, of 17, Pancras-square, Old St. Pancras, and were charged with violently assaulting George Berham, a warehouseman, of 2, Bucclough-cottages, Upper Clapton, at Gipsy-lane, Islington, with intent to rob him.—Mr. Inspector Judge, N division, attended to watch the case on behalf of the police, and Mr. Wakeling defended.\n\nWhen the complainant got into the witness-box his head was enveloped in surgical bandages, and his face much swollen. He had received a wound along the left eyebrow, and reaching some distance along the nose. The wound is about three inches long, and extended down to the bone. The evidence went to show that the complainant, between the hours of nine and ten, was proceeding through Gipsy-lane, a very dark and lonesome place, situated midway between the Hornsey-wood Sluice-house and Highbury New-park tavern, when he found that he was being followed, and, turning round, saw the prisoners. He spoke to them, and when he was answered the prisoner Wadsworth attacked him, and struck him a violent blow on the face and over the eyes with a blunt instrument. Blood flowed very copiously, and he called \"Murder!\" and \"Help!\" Finding some one was coming up, they ran off, and were pursued by the prosecutor, but he became so weak from loss of blood that he had to give it up. Fortunately some one hearing his cries went to his assistance, and he was conveyed to the Highbury New-park tavern, where he was at once attended by Mr. Bond, surgeon, of Stoke Newington, who dressed the wounds, but not before the prosecutor had lost a great quantity of blood. While the wounds were being dressed, the prisoners were brought in and the prosecutor at once identified them. The prisoners before they were captured had a smart run. When they were at length stopped, by a Mr. Baker and a Mr. Haycock, they said they were not the men, and that they had not done it, but they were detained and given into the custody of Police-constable Holmes, 261 N, who told them the charge. They said nothing in reply. That morning Police-serjeant Kimber, 32 N, found near the spot a life-preserver heavily laden with lead.\n\nMr. Barker asked what was known of the prisoners.—Inspector Judge said they were both the constant associates of the worst of thieves, and Wadsworth was only discharged last week. He asked for a remand.\n\nThe defence was that the prosecutor was mistaken in his identity, and when they were taken they were in the pursuit of the persons who had intended to rob the prosecutor.—Mr. Barker said that the prisoners would have to convince a jury of that, for he should certainly commit them to Newgate for trial. For the present they would be remanded for a week.—The prosecutor appeared very weak from the effects of his ill-usage.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206211839.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 787, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3290, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]