[{"id": "4bfcf1b2f6d9b0e02d9d3f33425ad51feda4d01c", "text": "Remarkable Charge of Robbery.—At Worship-street police-court, Henry Norman Frost, aged forty-five, describing himself as a master plasterer residing at 12, West-street, Triangle, Hackney, was charged with violently assaulting Mr. William Robert Snowden, a tea merchant, of the City-road and Greenwood-road, Dalston, and attempting to steal a valuable gold watch and chain. The prosecutor deposed that on the previous afternoon, about three o'clock, he was proceeding along the Forest-road, Dalston, when the prisoner suddenly darted across the road, and rushing up to him placed one hand on his breast and the other between his coat and waistcoat. The prosecutor with some difficulty extricated himself, and a second and third attack by the prisoner were successfully repulsed with his fists and umbrella. He shouted for help, and ran off, pursued by the prisoner. The outcry caused a crowd to assemble, and the prisoner was eventually captured by a police-constable, when he denied having intended to steal the prosecutor's watch and chain, and said that his only object in attacking him was to obtain one of the flowers he wore in the buttonhole of his coat. Mr. Charles Webb gave corroborative evidence, having from a distance seen the prosecutor attacked in the manner described. Johnson, 224 N, stated that when the prisoner was taken into custody he gave a correct address, and was found to bear an excellent character. He had a silver watch of his own in his pocket. In answer to a question from Mr. Barker, the constable said that the prisoner appeared to be in liquor at the time. The magistrate said that the prisoner's conduct was very extraordinary, and he had at least committed a violent assault on Mr. Snowden. The prosecutor said that after the prisoner had been taken into custody he had threatened to \"do for\" him. The prisoner, however, now disavowed such intention, and the prosecutor expressed himself perfectly satisfied.—Mr. Barker, dealing with the prisoner for the assault only, imposed a fine of 40s., or in default committed him to prison for 21 days.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206228045.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1246, "total-output-tokens": 468, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2078, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]