[{"id": "13273063fe4b9d2e24ea228bd64aabada16bd870", "text": "CHARGE AGAINST A TICKET OF LEAVE MAN.\n\nALFRED FOUNTAIN SUTCHFIELD, fifty-seven, farmer, the holder of a ticket of leave, of Heath-villas, Vale of Health, Hampstead-heath, and Reet's Farm, The Hyde, Hendon, was brought up on a warrant on Thursday, and charged before Mr. Glovers at the Highgate Police-court, with obtaining by false pretences the sum of £3 from Mrs. Ellen Benton, the wife of Mr. William Benton, landlord of the Rose and Crown, Highgate. Mrs. Benton deposed that on August 16th, when her husband was away from home, prisoner, whom she had known for some time as a customer, came in and asked her to cash a cheque for £3. He said that he had been to the bank, but could not get the money, as his account had been transferred to another branch. She knew that her husband had cashed one of the prisoner's cheques for a neighbour on a previous occasion. Mr. William Benton stated that he paid the cheque into the Highgate branch of the London and South-Western Bank on August 18th. Two days later it was returned marked \"Refer to drawer.\" Heat once wrote to the prisoner, who came the next day and marked the cheque, \"Pay out of reserve.\" Witness paid the cheque in again, but it was returned, and he then communicated with the police. He also wrote to prisoner, who sent a telegram, \"Letter will follow. Cannot come today.\" The letter, which came next day, stated that he \"had been engaged all day, and had paid £140 into the bank. He had assigned the deeds of the farm.\" Prisoner had opened negotiations with witness for the purchase of the Rose and Crown, but they came to nothing. Detective-sergeant Couchman, Y Division, stated that he was in company with Hill, 379 Y, the previous morning, keeping watch on the \"private and registered address\" of the prisoner in The Vale, Hampstead, when the prisoner came out and was arrested. When the warrant was read over to him, he said, \"I was going to pay that to-day; that will be all right.\" At Hampstead Police-station he was searched, and amongst others things twenty-six used cheques, a bank pass-book, and a pay-in book were found. The prisoner's house in The Vale was searched, but nothing was found there. Witness then went to Reet's Farm, Hendon, and there found a number of memoranda, which would prove of great use in connection with other charges to be brought against the prisoner. One of the charges would be in reference to Reet's Farm, of which he had obtained possession. Witness had spoken to the manager of the Highgate Bank, and was informed that prisoner did pay a cheque for £100 into the Kilburn branch of the bank on August 20th, but it was no good. The manager also said that prisoner had a lot of \"paper,\" all of which was useless. Since Mr. Benton first made complaint prisoner had passed thirty-five useless cheques through the bank. Prisoner was remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810767.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 700, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2843, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]