[{"id": "9f2596c915acaa5730363f3931a72a49607d2da2", "text": "THE BURGLARY AT WINDSOR.\n\nAt Windsor, on Thursday, William Jones and George Wood were charged with committing a robbery at Mr. Beach's house. Jones was also charged with shooting Police-constable Hogan, with intent to kill him. Some delay arose in the proceedings, it being found that the shooting took place out of the borough. A county-magistrate was sent for, and sat with the Mayor and borough magistrates. Police-constable Hogan (who appeared in court with his head bandaged) gave evidence, and the prisoners were then committed for the robbery; Jones was reprimanded on the charge of shooting until yesterday, when he was again brought up and committed for trial.\n\nA VILLAIN ESCAPING PUNISHMENT.\n\nAt Bow-street police-court, on Thursday, Henry Crofts, confectioner, living in Hyde-road, Hoxton, was charged with assaulting Thomas Leybourne.—The complainant, who is a wine merchant, of Old-street, deposed that he heard on Wednesday that his sister, who is barely 16 years of age, had left her home with the defendant. Witness accordingly made inquiries, and ascertained that they were living at a house of ill-fame in Dalston. He met the defendant on the stairs, and a struggle ensued, during which the girl managed to escape. Witness applied to the police for assistance to search the place, but was informed that it could not be done. The witness lost all trace of his sister and the defendant and returned home. Some time afterwards he was visited by a policeman, and ascertained that his sister and the defendant had been driven to 12, Upper Woburn-place. He went there on Wednesday morning at eight o'clock with his brother. They went to a room and knocked at the door, and the defendant came out. Witness and his brother begged their sister to accompany them home, but the defendant exclaimed, \"Alice, don't go.\" The girl refused to go, and witness and his brother were compelled to carry her out bodily. While they were trying to get the girl into a cab which was waiting for them defendant seized witness by the whiskers and struck him a blow in the face. Defendant was then given into custody.—Wm. Leybourne was called, and gave corroborative evidence. In reply to Mr. Vaughan, the brothers said they were not quite certain of the age of their sister, but they believed her to be under 16. They knew the defendant well, because their father had lent him money, and set him up in business. The prisoner said the witness assaulted him first.—Mr. Vaughan said that he had never heard of such a case of base ingratitude. The defendant, a married man, had received assistance from a father, and in return had debauched his daughter. The girl's age being uncertain he could only deal with the assault. He fined the defendant 5l., with the alternative of one month's imprisonment.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206320800.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 646, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2788, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]