[{"id": "5162418236faf16d4217ee38d8890d64d20e5c25", "text": "FATAL DISASTER IN A MINE.\n\nOn Wednesday night, when the men were about leaving their work at Tynwyddcolliery, situated in the Greater Rhondda valley, a roar of rushing water was heard. Many succeeded in making their escape to the surface. It was soon discovered, however, that 14 men and boys were missing. Several volunteers descended the shaft, which is 92 yards deep, and entered the workings. While the explorers were consulting what action should be taken, faint knockings were heard on the other side of the coal, at a distance, it was conjectured, of a dozen yards. No sooner was this heard than a score of men with mandrils commenced cutting through the solid mass, and by the sound it was soon ascertained that the imprisoned persons, consisting of five firemen and a boy, among whom was Charles Morgan, were doing likewise. Relays of colliers worked with great energy throughout the night, and about six o'clock on Thursday morning Charles Morgan's mandril struck through and made an opening. The next moment a terrific explosion, as that of a cannon, took place, but not of gas, and coal and rubbish were shot against those working to meet Morgan, and one man was terribly cut about the face. A few moments later, on approaching the hole, it was discovered that Morgan had been jammed in it, and that he was dead. The inundation had been so sudden as to imprison the air in the inner workings, and the force of this had kept back the water from the five men. The moment a small hole was made by Morgan's mandril, this volume of imprisoned air collided with fatal result. Between eight and nine o'clock the poor fellow's dead body was brought to the surface, with only his trousers, shirt, and boots on, as he had laboured through the night, struggling for the life of himself, his aged father, and two friends. Shortly afterwards the remainder of the party were taken to the surface. Nine men then remained in the workings, and it was feared that all had perished.\n\nMr. Galloway and the officers of the Troedyrhin and other collieries, at four o'clock on Thursday afternoon, after penetrating as far as possible into the colliery, heard knockings ahead of them. It was therefore certain that some of the men left in the colliery were still alive at that hour, but there was half a mile of water from the nearest point reached and where they were imprisoned, and owing to a deep basin intervening, filled with water to the roof, it was feared that they could not be reached for some days. Intense excitement prevailed.\n\nUp to Friday night the imprisoned hands had not been rescued.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206327803.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 595, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2591, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]