[{"id": "e5524f2bba71541f2c2b8da4e38ae45c04271a1a", "text": "THE HOXTON BURGLAR.\n\nSince Wright, the Hoxton burglar, received his flogging for the murderous attack on Warder Attwood, he has been kept in solitary confinement. His demeanour is sullen and his mania for destruction is as keen as when he was first incarcerated. Of course, at present there is not the slightest possibility of his doing further injury to his guardians, but he vows when the opportunity presents itself he will have revenge for what he considers the ill-treatment he was subjected to some few weeks since. He maintains he will sacrifice the life of one of his keepers, so as to cheat the punishment meted out to him, preferring to meet his doom on the gallows than suffer penal servitude. No one is allowed to come in close contact with him, so that until he once more makes his appearance on the public works there is not the slightest need for alarm. His daily subsistence is handed him through iron bars, when periodical visits are made to his cell, and it is stated his language is most violent. It is also stated that he will be kept in solitary confinement for nine months, in the hope of taming him, and at the expiration of that period will be permitted to labour on the public works with a gang of men. If by good conduct he should gain favour with the officials, he might be permitted to work without his chains.\n\nAt the County Magistrates Court, Liverpool, on Saturday, James Fecit, contractor for the supply of milk to the Walton Workhouse, was charged with selling milk not of the quality demanded by the purchaser. He had to supply 170 gallons daily, and on some samples being taken and tested it was found that the milk had been deprived of half its cream, and that water had been added to the poorest milk to the extent of 10 per cent. The defendant was fined £20 and costs.\n\nAdam Stone, aged twenty, a labourer, of Heath and Reach, near Leighton Buzzard, was brought up at the Leighton Buzzard Police-court charged with stabbing his father and mother. The prisoner, who lives with his parents, on Friday night came home under the influence of drink. An altercation ensued, and it is alleged that Stone took out a large clasp-knife and stabbed the father in the back, inflicting a terrible wound. The mother, who interfered, was also stabbed in the arm. The prisoner was remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200809739.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 536, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2312, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]