[{"id": "ec37dc4227a0bcc1c2d6c40191f8ce579d6b6cb3", "text": "MURDER OF A NEW-BORN INFANT.\n\nOn Friday, an inquiry was instituted before Mr. Baker at the Northumberland Arms, in Fashion-street, Spitalfields, respecting the death of a new-born male infant, whose body was found, on Wednesday morning last, in the water-closet attached to the houses in Netby's-court, Fashion-street, under circumstances of suspicion that it was placed there by a female named Elizabeth Mackstay, who is alleged to be the mother, and who is a single woman, about twenty-seven years of age.\n\nSusanna Ward, a married woman, No.7, Netby's-court, said that about seven o'clock on Monday morning, the 20th ult., she saw Elizabeth Mackstay, who then lived with her sister in the next house, pass under her window, and go to the water-closet. She was carrying something under her apron. About a quarter to eight o'clock, witness, who had not seen her leave the place, went there, when she observed a pool of blood on the floor. There were hand marks on the wainscot, which was smeared with blood, as if a person had been struggling in agony. Witness called two neighbours, females, when it was agreed that a child had been born. Suspicion subsequently fell upon Elizabeth Mackstay, upon it being ascertained from her sister that she was very ill. Witness soon after saw Mr. Hart, the medical officer, who stated, upon making an examination of the accused, that she had been recently delivered. She was the same day removed to the workhouse of the Whitechapel union. In answer to the coroner, the witness stated that the closet was searched on the 20th ult., but the body was not found. A napkin, which was covered with blood, was taken out.\n\nSergeant Orams, H 18, said that the parochial authorities were applied to for the purpose of having the water closet emptied. He saw Mr. Tayleure, the vestry clerk, who declined. Mr. Pell, the churchwarden, was willing to have it done. The accused was taken before Mr. D'Eyncourt, at Worship-street, when he requested witness to urge upon the police commissioners the necessity of emptying the closet, and which was done by their order on Wednesday. The accused was brought up again the previous day before Mr. Hammill, and was discharged.\n\nThe coroner said he was informed by his summoning officer, that the accused was charged at the police court with the concealment of the birth, and that as it was stated by her sister that she told her the child was in the water-closet, there was no concealment in law.\n\nMr. Hart stated that, when he saw the accused on the 20th she was recently delivered. He examined deceased on Wednesday, but the body was so decomposed that he was unable to say whether it was born alive. The body appeared to be full grown. The accused observed to witness that the deceased was born in the water-closet.\n\nA juror remarked, that the object they had in view by being summoned had been completely nullified by the conduct of the parish officers.\n\nThe coroner observed, that supposing the post mortem examination had taken place soon after birth, there was always a difficulty in ascertaining if a child was born alive.\n\nJuror: Still no obstacle ought to be placed to an important inquiry like the present.—Coroner: The reason why the parish did not interfere was, that they possibly had no funds. The poor-law auditor would most likely disallow the item, on the ground that the poor-rates were not applicable to that purpose.\n\nOrams stated that the commissioners would pay the money out of the public funds. The charge was 30s.—Verdict, \"Found dead.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201312.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 834, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3528, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]