[{"id": "c2650f463d45b4b8ffce0f554f2729f2cb60ad6e", "text": "THE MURDER IN BERMONDSEY.\n\nLATEST PARTICULARS.\n\nFRIDAY MORNING.\n\nVIOLENT BEHAVIOUR OF MRS. MANNING.\n\nIt being suspected by the authorities of Horsemonger-lane gaol that Maria Manning might do some violence to herself after hearing her fate on Wednesday evening, it was thought advisable to have an extra woman in attendance upon her. Accordingly Mrs. Randall, the woman searcher of the Southwark police station, was sent for that night to assist the two other women in watching her. Mrs. Randall attended upon her during the several lengthy examinations at the police court, and Mrs. Manning seemed very much attached to her. As soon as she was introduced to her in the cell, she seemed much pleased, and conversed freely with her on several subjects. The unfortunate woman still asserts that she is innocent, and will not be executed, and that some influential ladies will intercede for her in high quarters. Yesterday she wrote two letters, and believes that the contents will have the effect of saving her life. On being told that her legal advisers had done all they could for her, she stamped her foot on the floor, and exclaimed in a violent manner—\"Done all they could! Why, they have done nothing; they and everybody else in the court decided upon hanging me before I was tried.\" In alluding to her husband a few minutes afterwards she said, \"Ah, he is a vagabond. I never said anything about him. He knows who murdered poor O'Connor, and can tell all.\" She refuses all religious consolation, and pays little attention to the Rev. Mr. Rowe, the chaplain. She has been visited by a charitable lady, who attempted to instil into her mind the awful position in which she stood, and implored upon her to offer up her prayers to her Maker, but she listened with a deaf ear, and as soon as the lady had left the cell she entered into conversation with her attendants as unconcernedly as if she was free from crime. She eats heartily, and sleeps well, but if any of her attendants would converse with her all night, she would sit up and join them. During some allusion to her attorney (Mr. Solomon) and the counsel who defended her she became much excited, and clinching her fists, exclaimed, \"Oh, if I only had them here I'd serve them out. They might have acquitted me if they had done their duty.\" She, however, seems very confident that she will be set at liberty, and has no idea that the sentence of the law will be carried into effect. Her unfortunate husband is quite dejected. He is completely emaciated, and unable to eat anything. Yesterday morning he desired to have an interview with his attorney, Mr. Binns, as he had some important communications to make to him. He particularly requested that a special order should be obtained for him, and at his desire one was got, and forwarded to Mr. Binns, who will attend at the gaol this morning.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206194202.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 658, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2854, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]