[{"id": "f3e74330e811ee80f6023696898ab7a7d6a0cabe", "text": "ATTEMPTED DOUBLE MURDER AND SUICIDE\n\nIntense excitement was caused in Stood, a town adjoining the city of Rochester, early Friday morning by the report that a shoemaker named Frederick Marrs had nearly succeeded in murdering his wife and son, aged fifteen. It seems that Marrs attacked his wife with a hammer at three a.m. After receiving nine terrible wounds on her head she managed to escape into a neighbour's house. The infuriated shoemaker then turned upon his son, who, by leaping from the top of the stairs to the bottom, managed to escape into the street and inform the police of what had occurred. A constable soon arrived on the scene, and conveyed Marrs to the cells of the Rochester Police-station, where he attempted suicide by tying a scarf tightly round his neck. Blood was issuing from his ears and he was nearly dead when the constable in charge happened to look into his cell, saw the man's condition, rushed in, and took the scarf off. The woman is in a dying condition, and her depositions were taken in the course of the day.\n\nFrederick Marrs, was brought before the magistrates at Strood, on Saturday, charged with feloniously wounding his wife at Strood with intent to murder her. The woman, who is lying in a very critical condition, was visited on Friday night by the magistrates, who took her depositions in the presence of the prisoner. The room in which the assault was committed was in a terrible condition. The furniture was smashed to pieces and the floor was saturated with blood.\n\nMrs. Marrs stated that she was aroused from her sleep at three o'clock on Friday morning by her husband striking her on the head with a shoemaker's hammer. She jumped out of bed and struggled to take the hammer away from him, but he seized her by the throat, and in his frenzy tore the flesh away, laying bare the wind-pipe. She could not get away from Marrs, who struck blow after blow with the hammer, hitting her on the head and face. Finally he dragged her to the staircase, and attempted to throw her down; but she managed to tear herself away, and escaped into a neighbouring house. It was then found that her features were battered out of recognition. Her nose was laid open from the forehead to the tip, the right cheek-bone was broken, the right ear was torn apparently with the hook of the hammer, both eyes were blackened and closed, and one rib was fractured.\n\nThe prisoner appeared to be in a dazed condition, and seemed to have little recollection of the terrible occurrence; and the magistrates, without going into the case, remanded him. It appears that Marrs married the woman about sixteen years ago, and that since then he has been idle and dissolute, his wife having to go out to work to keep him. Latterly he had been drinking more heavily than usual, and was in a condition bordering upon delirium tremens.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810452.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 648, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2842, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]