[{"id": "f7e5e751e0b6d55b88639721e6affd367039833f", "text": "CHARGE OF ATTEMPT TO MURDER.\n\nOn Wednesday, a young man of respectable exterior, named Vivian O'Keefe, was charged at the Liverpool police-court with having attempted to murder a girl named Jane Riley, on the 13th of March last, by discharging the contents of a loaded gun at her, in a shooting gallery in Williamson-square, near the Theatre Royal. The hearing of the case had been deferred, in consequence of the inability of the prosecutrix to give evidence, owing to the precarious state in which she has been since the occurrence.\n\nThe prosecutrix, having been assisted into court, gave the following evidence. She said: \"About twelve o'clock on the morning of the 13th of March I went into a shooting gallery in Murray-street, Williamson-square. I wanted to see the master. As I went in I saw the prisoner standing on the steps. I heard him say to a friend, 'I will have another shot, and then I will go home.' He then followed me into the gallery. I went into a small room, called the snug, to see if the landlord was in. Whilst I was there the prisoner came in and asked me to come to him. I did not speak to him. He then smiled and took up a gun, and said he would shoot me. I thought he was joking, and said, 'Oh, don't.' I then turned my back, and had hardly done so when the gun went off, and I felt a ball penetrate my shoulder. I believe I was afterwards taken to the infirmary. The prisoner appeared rather tipsy.\"\n\nMary Ann McLaren, wife of the man who keeps the shooting-gallery, corroborated the prosecutrix's evidence, and added that she saw the prisoner present the gun at the prosecutrix, and heard him say to her, \"I'll shoot you.\" After saying so, the prisoner pulled up the hammer of the gun, and fired at her. Prosecutrix screamed out, saying she was shot, and blood began to flow from her shoulder. Witness then said to prisoner, \"You have shot the woman, and I'm ruined.\" He said nothing, but smiled, and left the place.\n\nA police-officer deposed to taking the prisoner into custody at his lodgings in Islington-terrace the next morning. He denied all knowledge of the transaction, and said he did not remember having been in a shooting-gallery the evening before.\n\nThe surgeon to the royal infirmary deposed to receiving the prosecutrix into the infirmary, as a patient, on the morning of the 13th of March. On examining her, he found she had been shot in the shoulder. The charge had entered the upper part of the shoulder, and passed into the spine. Had attended upon her since, and had not been able to extract the ball, but had traced it about four inches, and believed that it was at present lodged in the muscles of the back near the spine. He believed the prosecutrix to be at present out of danger.\n\nMr. Snowball, solicitor, appeared for the prisoner, and urged that there could not be a committal under the act of Parliament, as murder was not intended.—The magistrate's clerk said that under the section of the act it would undoubtedly have been murder had the prosecutrix died; and after a few minutes' conversation the presiding magistrate said it was a very serious charge, and he felt bound to send it before a jury. The prisoner was then committed for trial at the assizes.—Bail having been applied for, the prisoner's father came forward and said that he was a housekeeper residing in Dublin, and connected with the press there.—The magistrates declined to accept his bail, and ordered the prisoner to find bail himself in £100., and two sureties resident in Liverpool in £50. each.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206304816.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 834, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3525, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]