[{"id": "3ba2d8010d52ce489b1a24161ef4b75b906c336d", "text": "MYSTERIOUS DEATH OF A CHILD.\n\nMr. Langham held an inquest at the Borough coroner's court, on Tuesday, on the body of Charles Edward Dorrington, aged 10 weeks, the child of a servant girl, named Emma Dorrington.—Jane Bounick, an elderly woman, residing at 6, Upper Green-street, Blackfriars-road, was the first witness called. She deposed to having agreed with one of the sisters attached to St. Alphege mission, Blackfriars-road, to take charge of the child for 4s. per week. The infant was brought to her on Sept. 6, and was then eight weeks old. It was wasted and suffered from consumption of the bowels. She told the mother, who came with the child, that she would have to take it to a doctor. The baby was very ravenous, and though she fed it on condensed milk and other food she never seemed as if she could satisfy it. After being seen by a dispensary doctor she took deceased to Dr. Matcham on a relief order on Wednesday last, and he said the child was in a horribly emaciated condition, and dying. He ordered her to give it cows' milk, and when he came on Friday he told her if it died he should insist on an inquest.—Dr. Matcham, in evidence, denied this story altogether. He said a post-mortem examination showed that the stomach was small and contracted, with no signs of digestion. There was a teaspoonful of milk, with some granular substance, in the stomach, but the bowels were absolutely empty, and, in fact, so flattened that they had the appearance of having fallen in (sensation).—The Coroner: What, in your judgment, is the cause of death?—Dr. Matcham: Starvation. I cannot conceive there is any foundation for the story about the nourishment having been given. I firmly believe that no food was given to the deceased for 48 hours before death.—The coroner said that after such evidence he felt it his duty to adjourn the case for independent medical evidence, and for the production of the doctor at Havil-street workhouse and of the St. Alphege sister.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206270176.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 502, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1975, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]