[{"id": "e3cf269a8f0a955fdbcd337c950577ec19a654e2", "text": "RAID ON THIEVES AND RECEIVERS IN SOUTH LONDON.\n\nOn Monday morning, shortly after ten o'clock, Inspector Harvey, accompanied by Detective-sergeants Leonard, Cox, Smalle, and other officers of the Criminal Investigation Department, and a number of constables, surrounded a house in Hampton-street, Waterloo-road. Upon knocking at the door a window was opened and a head was put out; but, upon catching sight of the officers, the window was immediately closed and a scuffle of feet heard. Inspector Harvey at once gave orders that the door was to be burst open, which was promptly done, and the officers entered the premises. Here they found a number of men, who, upon seeing the constables, at once endeavoured to escape by climbing over the back wall. Mr. Harvey told them he had reason to believe that the premises were used for the purpose of a depot for stolen property. He intended to search the place and then take all present to the police-station. Upon turning over some sacking the officers found a large quantity of floor-cloth and flour, and some tablets, which were identified as the property of a firm of advertisement contractors in the East End. The men taken to the station were charged, and gave the names of Robert Hunt, thirty-three, William Weston, twenty-four, William Burden, twenty-three, William Rasser, thirty-three, and William Terry, the landlord of the premises. All the men were charged with being concerned with others, not in custody, in stealing and receiving. The raid caused considerable commotion, the traffic being blocked for some time by the large crowd. Some importance is attached to the capture by the police.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810211.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1476, "total-output-tokens": 375, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1648, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]