[{"id": "83310e5d63c308b9c5f293c8b10cb8187047409a", "text": "SUICIDE OF A PORTR PAINTER.\n\nMr. Brent has just held an inquiry at the George, Brook-street, Holborn, touching the death of Mr. Geo. Smart, a well-known portrait painter, aged forty-six, who committed self-destruction, under very painful circumstances, in a miserable lodging, in Bell-court, Gray's-inn-lane. The deceased was in very reduced circumstances, and had lived in his late lodging nearly three years, during which period he never permitted any person to enter his apartment, no doubt induced from a mistaken feeling of shame at its mean appearance. His own aspect at all times was exceedingly wretched, and his tattered clothes frequently attracted the commiseration of the neighbours, for it was well known who he was, and his talents were appreciated by those about him, to whom he was in the habit of exhibiting some of the portraits which he painted. A short time before his unhappy death he spoke to his landlord about being unable to pay his rent, some two or three shillings a week, when the landlord, much to his credit, instead of upbraiding the poor fellow and giving him notice to leave, told him that he might run on as long as he pleased without paying, in the hope that the times would get better with him. Mr. Smart was last seen alive on Saturday, and his non-appearance from that period up to Wednesday afternoon excited the apprehension of his landlord; the more so, as everything appeared so quiet in the room. Obtaining no answer to repeated knockings at his door, the landlord at length, with the assistance of the police, forcibly entered the apartment, when a terrible spectacle met their view, as the poor creature's remains, in a fearfully putrefied state, lay stretched on some dirty old rags, which had served for his bed, and there was a deep gash across his throat, which, to use the words of Mr. Strange, the surgeon, who was called to see the body, \"nearly divided his head from the trunk, the wound extending down to the very vertebrae.\" The razor with which the deed had been committed was lying near him. In the room were found a stale loaf, fourpence-halfpenny in money, and some ragged garments, which had served the deceased for clothing by day and for a bed at night. The only article of furniture was a chair without a bottom. There were likewise found in the room two beautifully executed portraits by the deceased, of a lady and gentleman; the former not quite finished. The deceased had been very eccentric in his habits, and had taken to intemperance. At the suggestion of the coroner, the jury returned a verdict of suicide, leaving the state of the deceased's mind an open verdict.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206313966.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 602, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2636, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]