[{"id": "080f809ca51992dcf4243ddde8cf2accaabc48db", "text": "IRELAND.\n\nANOTHER ATTEMPTED MURDER AT BELFAST.—Two bailiffs, named Wethered and Nolan, recently went to Ballymacarrett, to the house of a man named Thomas Brown, to execute a civil bill decree for a small amount obtained against Brown at the quarter sessions. Brown, who is a gardener at Ballyhackamore, was not at home, and the bailiffs proceeded to where he was at work, and arrested him. He had no sooner been arrested, than he lifted a gardener's large knife he had been using, and plunged it into Wethered's side. So suddenly was the deed perpetrated, that every person present stood appalled at the scene. The would-be murderer did not attempt to escape, and he was shortly afterwards taken into custody. The injured man was taken to the hospital, where the wound was found to be very severe, the knife having been plunged in to the hilt, and evidently \"screwed round.\" Wethered still lives, and it is possible that the wound may not prove fatal.\n\nEXECUTION OF THE TRIPLE MURDERER.—Matthew Phibbs was executed at Sligo on Monday. The Sligo Independent thus describes the last scene:—\"It was 7.45 o'clock when he stepped out before the public gaze of assembled thousands, who occupied every available point of view far and near, and gazed anxiously with upturned eyes expecting his appearance. The hum of the excited crowd rose from below, not unlike the noise of a distant waterfall; most instantly the treacherous bars on which the condemned stood swiftly and noiselessly gave way, and he descended like an arrow shot from a bow for a distance of seven or eight feet, the weight of his body making a sickening, deadened sort of sound as he suddenly reached the length of the rope. The fall itself must have killed him. After a few convulsive struggles, of which he was quite unconscious, all was over, Matthew Phibbs was dead. Having hung the usual length of time, his dead body was withdrawn from the public gaze, and buried within the precincts of the prison, in accordance with the sentence of the court. Dr. Lynn inspected the body, and officially reported it dead. It has been estimated that about 10,000 people witnessed the execution. Their conduct was orderly and becoming in a remarkable degree. There were 150 constabulary on the ground before the scaffold under the charge of Captain Steker, Sub-inspectors Neynoe and Vallancy, Head-constable O'Donnell, &c. Many of the crowd remained until the body was cut down and placed in its coffin outside the gaol door, after which all dispersed quietly and orderly their several ways.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206211933.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 606, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2545, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]