[{"id": "bcd379974fab2191f7caec95a516ac397d3005af", "text": "DOUBLE MURDER AND MUTILATION IN OXFORDSHIRE.\n\n[SUBJECT OF ILLUSTRATION.]\n\nAt Burford, on Wednesday, a labourer, named James Lapworth, aged about twenty-seven, a native of Lechlade, was charged with the wilful murder of Emily Beatrice Judd, aged seven years and six months, and Edith Turner, aged five years, of Little Faringdon, Oxfordshire.\n\nThe circumstances of the case have caused a great sensation. The children were daughters of labourers, and after partaking of dinner, about one o'clock on Saturday, they left home for the purpose of taking a walk. The houses in the neighbourhood are few and scattered, and it was believed the children were playing in the fields. As they did not return home to tea the parents became alarmed, and went and sent in all directions in search of them. When night came, and no tidings could be gleaned of the missing children, the grief of the parents was extreme. The police were communicated with, and search parties were organised, who worked with a will throughout the night. Their efforts, however, were not rewarded with success until Sunday morning, when the body of one of the children was found in a brook. It was at first supposed that she had been playing on the bank and fallen into the water. After further search the second was discovered in a spinney, about half a mile off, with a terrible wound at the side of the neck. A careful examination left no doubt that a horrible crime had been committed. Besides the wound in the neck of the eldest girl she had been mutilated about the lower part of the body, and it was evident that an attempt at violation had taken place. The neck of the second child had also a cut in it.\n\nLapworth, who had been seen in the neighbourhood, but not with the children, was apprehended at five o'clock on Tuesday morning at South Cerney, near Cirencester, a considerable distance from the scene of the murder.\n\nThe evidence offered was principally that of medical gentlemen, who had examined the bodies, and who detailed the injuries upon them. The prisoner was remanded.\n\nIt now appears that the man named James Lapworth, who is lying in Oxford Castle, is likely to turn out to be an idiot. He is a native of the district, and is about thirty years of age, a farmhouse labourer, but not in regular employment. Some two years or so ago he lost his mother and father, and since then it is said that he has acted strangely at times. He would often go out to the churchyard at midnight and play his melodium on his parents' graves, without anyone being able to persuade him to leave. He used also often to speak in a very strange, wild manner, but people only laughed at him. He appears to have been much affected by the Whitechapel murders, and those who have worked with him say they have often heard him say that some day \"he hoped to be a Jack the Ripper.\"\n\nThe spot where the children were found is a very peculiar one. It is a sort of copse or withy bed in a field, and there is no entrance to this field without going through water, as it happens to be entirely surrounded by a brook. This makes it, of course, a very little frequented spot, though it is not more than half a mile from Lechlade Railway Station.\n\nFATAL FIGHT IN THE HARVEST FIELD.\n\n[SUBJECT OF ILLUSTRATION.]\n\nAn inquest has been held at Preston Gubbalds, near Shrewsbury, on Richard Taylor, whose death was caused in a fight in the harvest field with a man named Charles Phillips. Several severe blows were given on both side. Phillips ultimately left the deceased lying in the field and returned to his work. The master's son found Taylor dead, and the medical evidence showed that his neck had been fractured, which could have been done only by a terrific blow or kick. The jury returned a verdict of manslaughter against Phillips, who is in custody on the charge of wilful murder.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811895.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 877, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3837, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]