[{"id": "c9c09eee1a2a03a4debfbe9133f999acbb9992eb", "text": "OUTRAGE ON A SURGEON.\n\nOn Thursday, Mr. Wakley held an inquest at the Duke of Clarence, Great North street, Edgware road, on Marian Jones, aged forty-five, the wife of a carpenter.\n\nElijah Jones deposed that deceased was his wife, and that although very sober, she was low-spirited and depressed. She died on Monday from the effects of poison which she had taken thirteen days previously. Latterly she complained of headaches. Her brother, sister, uncle, and aunt died insane.\n\nMr. Jellard, druggist, said that on Tuesday fortnight deceased, accompanied by a witness, purchased of him a pennyworth of oxalic acid, under the pretext that she required it for cleaning bonnets.\n\nMary Coleman, deceased's niece, stated that on the day in question deceased visited her sister, Mrs. Smith, in Devonshire-street, when, having mixed something in a glass, she drank it off in Mrs. Smith's presence, who snatched from her the glass which contained the remains of the poison, and sent for a surgeon.\n\nMr. Henry Obré, surgeon, Grove-place, who made the post mortem examination of the body, said that while he was performing his duty with his assistant in the presence of deceased's sister, the door, which was locked, was forced open by deceased's husband, who rushed frantically and swearing into the room. Before they could be aware of his object, the husband pushed witness and his assistant from the body, when he snatched up a part of the breast he was dissecting, the collar bones, and a portion of deceased's entrails, with which he darted down stairs, and holding them in his hand commenced haranguing a mob of one hundred persons collected outside the house, declared that his wife was being butchered, and called upon them to enter the house with him and avenge the outrage. After which he flung into the street and about the house portions of the body, which he believed still remained uncollected. He then rushed into the room in which witness and his assistant were, when he attacked them in a most outrageous manner, tearing the clothes from their backs. Then seizing one of the dissecting knives, he drove witness against the wall, and drawing the knife across his throat, exclaimed, \"Now, I'll murder you and your assistant, and then I'll cut my own throat.\" He was in the act of putting his threat into execution, when the people rushed from the street and dragged witness and his assistant out of the house, but not before all their clothes were torn into shreds. Witness then got the assistance of the police, who secured the husband, who kept blaspheming, and exclaiming, \"I'll murder him yet!\" Witness then attempted to proceed with the autopsy, but found that his instruments had been destroyed, and thrown into the water closet. While the husband was ill-treating his assistant, the daughter, aged sixteen, was on her knees, imprecating the most awful curses upon them.\n\nThe Coroner (to the husband): What have you to say to this cowardly and ruffianly attack?—Jones: I was told that my wife's body was being dissected, and I was desired to go home and prevent her being cut to pieces.\n\nThe Coroner (to Sergeant Nelfter): Take him into custody; he is too dangerous a character to be left at large.—Mr. Obré said he did not want to press the charge if he apologised and paid for the instruments destroyed.—Jones expressed great penitence, and promised to pay all costs.\n\nThe coroner summed up, and the jury returned the following verdict:—\"Deceased destroyed herself, but what was the state of her mind at the time there is no evidence to prove.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201393.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 820, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3556, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]