[{"id": "8834b537e2138cf81656484a137c2c6021f63293", "text": "A BOY KILLED AT BATTERSEA.\n\nMr. A. Braxton Hicks, the Mid-Surrey coroner, held an inquiry at the Star and Garter, Battersea, with reference to the death of Charter Kuch, aged nine, son of a baker residing at 239, Battersea Park-road, Battersea, who was killed by being knocked down and run over by a goods truck on the London, Brighton, and South Coast Railway near Victoria-road, Battersea, on June 25th. Evidence of identification having been given, James Harper, a boy twelve years of age, residing at 68, Alfred-street, stated that he had occasion to go to a goods shed at Victoria-road, and the deceased went with him. While the witness was attending to some horses the deceased went to look at some shunting operations which were being carried on near Covington's dust-heap. Afterwards the witness heard that the deceased had met with an accident. Alfred Rhodes, of 129, Battersea Park-road, head shunter in the employ of the London and Brighton Railway, deposed that shortly before one o'clock he shunted an empty coal train from the road called the \"Rival Pugs.\" He found the deceased sitting in the six-foot way. The witness walked towards him, and heard him call out, \"Jim, Jim!\" and on going nearer he said to the witness, \"Do take me away—I am crushed.\" The witness said, \"What crushed you?\" and he replied, \"That engine,\" and did not speak again. The witness could not understand what engine he meant. He sent for a doctor, but the boy died almost immediately. Henry William Gough, an engine-driver in the employ of the London and South-Western Railway, deposed that he was in charge of a train which left Brent, near Hendon, and reached Battersea-yard at seventeen minutes past twelve. He was not aware that he had knocked anyone down, and knew nothing of the accident till five o'clock the same afternoon. Dr. George Burroughs certified that death was due to an injury to the lungs, caused by a severe blow on the chest. The jury returned a verdict of accidental death, and requested the coroner to write to Mr. Covington and ask him to prevent boys going on to his premises.\n\nCHARGE OF BURGLARY.—Joseph Smith, fifty, address refused, was charged, at the Lambeth Police-court, before Mr. Hopkins, in being concerned with another man not in custody in burglariously breaking and entering the dwelling-house of Dr. Kane, 191, Fentiman-road, with intent to steal therein. It was shown that the prisoner was detected in the house, and made an attempt to escape through the back. He was stopped by an inhabitant and detained until the police arrived, when he was taken into custody. Inspector Wilson stated that he examined the premises, and found that an entry had been effected by the dining-room window, feet-marks being clearly seen on the window-sill and on the carpet in the room. Police-constable 293 W stated that in October, 1834, the prisoner, at the Surrey Sessions, was sentenced to five years' penal servitude for house-breaking, after a previous conviction of eighteen months for a similar offence. There were also other convictions alleged against the prisoner. Mr. Hopkins committed the prisoner to take his trial at the Central Criminal Court.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810569.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 749, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3170, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]