[{"id": "cd7819e6fb5a0e1a5525a71ee0d7dfd4ba2fecfc", "text": "ANOTHER CHARGE OF INDECENT ASSAULT.\n\nOn Thursday, at the Worship-street police-court, George Riger, thirty years of age, residing at No. 3, Marsham-street, Westminster, was charged with indecently assaulting Helena Luke, while in a railway carriage, and during transit from Woolwich to London, on the Great Eastern line.\n\nThe complainant, who is twenty-five years of age, appears to be of German extraction. She was showily attired, and is known to belong to that class of gay women who frequent public gardens in the skirts of the town. Nevertheless, she gave here evidence with apparent truthfulness. She stated: I am single, and live in Back-road, St. George's. I left Woolwich gardens at twelve o'clock on Wednesday night, and got into a railway carriage to come to Shoreditch. There were several persons in the carriage. One gentleman got out at Barking-road, and directly afterwards this person (defendant) began to molest me.\n\nMr. Cooke: But there were other parties in the same carriage, you say?—Complainant: Yes, three more, but they were his friends, and did not interfere. He tried to expose me to them. When he found he could not do so, he kicked me in the chest.\n\nCross-examined by the defendant: I did see you last Sunday, and you wanted my company, but it was not convenient. Oh, yes, I will speak all the truth. You had not any money.—Defendant: Yes, I said so, certainly.\n\nWilliam Twist (inspector on the line): At half-past twelve o'clock I was on the platform of the Mile-end station, when the last train from Woolwich came in. In a second-class carriage I saw the complainant; she was sitting in a corner, her hat was off, and she was crying very much. I inquired what was the matter, and she replied that defendant had tried to expose her to others in the carriage. I appealed to three other persons who were there as to the truth of this statement, but none of them would say anything about it. They are friends of the defendant's, who, with them, belongs to the band of musicians at Woolwich-gardens.\n\nDefendant: I have witnesses who will confute this woman's statement.\n\nBenjamin Roddy, sworn: I am a musician, and reside in the Hackney-road. I was present in the carriage on the occasion. Complainant was sitting with her clothes over the knees of a gentleman in a very improper manner. He got out at the Barking-road station. She and defendant then got into conversation and quarrelled. He did not raise her dress or kick or strike her; he did push her.\n\nIt was at this point mentioned that testimony of a thoroughly impartial character could be most probably obtained if a remand was allowed, and Mr. Cooke therupon adopted that course, but admitted defendant to bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206225570.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 648, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2696, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]