[{"id": "f0bf7459bc05506145c3103a275f997cfcff2594", "text": "EXECUTION OF THE OLDHAM MURDERER.\n\nJoseph Mellor was hanged within the precincts of Strangeways Gaol, Manchester, on Tuesday morning, for the murder of his wife, Mary Jane Mellor. The murder for which Mellor, who was thirty-three years of age, and had worked as a factory operative, suffered death, was one of peculiar brutality. Some five years ago Mellor and his victim began to live together in a small house in Hollin's-road, Oldham. They were not then married, and in fact their marriage did not take place until the 30th of August, 1889. They lived on fairly happy terms, though it was stated that the woman occasionally gave way to drink. In March of 1891 Mellor began to pay his addresses to a Miss Elizabeth Sunderland, a reeler, in the mill at which he was store-keeper. He gave her an engagement ring, and promised to marry her, stating that the woman with whom he lived was not his wife. Mellor was thereafter a frequent visitor at Miss Sunderland's house, and it was understood by her parents that they were engaged, the marriage being generally understood to have been fixed for Christmas next. On the 30th of September the deceased woman was last seen alive in the house in Hollin's-road, and, in answer to subsequent inquiries from the neighbours, Mellor said she had gone on a visit to some friends. On the 19th of October the wife of the landlord of the house, Mrs. Walker, tried to get in, but, failing to do so, she made her way to the kitchen window, and on looking through found that a large hole had been dug in the floor of the room. Mrs. Walker at once communicated with the police, and on searching the premises the body of the woman was found lying under the staircase, covered over by a shawl and a small piece of carpet. The medical examination showed that she had received many terrible wounds. There was a wound at the back of the skull, at the base—a wound which fractured the skull from ear to ear—and her throat was cut, being severed by a gash which cut not only the windpipe, but all the principal arteries of the neck. There were also seven stabs on the body, two of which penetrated to the heart. Every preparation had been made for burying the body in the hole which had been dug in the kitchen floor. Mellor was immediately arrested at the mill, and when told of what he would be charged, he replied, \"Yes, it is all right.\" The police traced his movements between September 3rd and the date of his arrest, and found that he had frequently slept at the residence of Miss Sunderland. He had asked a neighbour to take charge of any letters that might come for him to his own house, and in order to avert suspicion he addressed two to himself, and professed they were from his wife. He was also seen to enter the house on one occasion with a woman, and he frequently slept there for several nights together. Mellor was tried at the Manchester Assizes on Monday, November 28th, before Mr. Justice Bruce. The trial lasted two days, and the judge, in passing sentence of death, warned Mellor to make the best use of the interval before his execution. From the time of his conviction he maintained a perfectly unconcerned demeanour, and was never heard to express a single regret for his atrocious crime. No effort was made to obtain a reprieve.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811146.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 764, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3278, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]