[{"id": "ffb2b761e9b231c47462bbc5f40240d21b9938f9", "text": "TRAGEDY AT A RELIGIOUS DINNER.\n\nNUMEROUS PERSONS POISONED.\n\nNORTHAMPTON, SATURDAY.—A sensation, which it is impossible to describe, prevails at the present time throughout this district, in reference to the following melancholy occurrence, which has already been attended with fatal result to one person, and the lives of a great number of other parties still remain in a state of great jeopardy. From careful inquiries made, it appears that Wednesday last was appointed for the public recognition of the Rev. G. Nicholson, B.A., as the minister of King-street chapel, in this town. The devotional services having been performed, a dinner, which had been prepared for the accommodation of the ministers and friends, took place in the New Hall, Newland, when between thirty and forty persons were present. About an hour after dinner, very alarming symptoms set in, which at once proved that not a few persons were labouring under the effects of some virulent poison. Amongst the number thus affected was Mr. W. Cornfield, a gentleman much respected by all who knew him. After suffering for some considerable time, he was placed in a fly and conveyed home to bed, where he died the next morning. An inquest was opened on his body, and evidence went to prove that emerald-green had been used in colouring some of the ornaments on the cakes. Mr. Faircloth, who had made a post mortem examination of the body, found the coats of the stomach extensively inflamed, and traces of copper in it. He thought there were slight appearances of arsenic, but was at present unable positively to state. The inquiry was therefore adjourned again till Wednesday next, to afford time for an analysis to be made, and to see whether any of the other sufferers expire.\n\nTHE CHARTIST MEETINGS.—On Friday new cutlasses and belts were forwarded to each of the police stations in the metropolis for all the constables, in case of an emergency. They will assemble at the various stations at seven o'clock on Monday morning, to await any orders that may arrive from the Police Commissioners.\n\nTHE CASE OF \"TIGER\" SMITH.—At the Middlesex sessions on Friday, Thomas Smith, alias \"Tiger\" Smith, a captain in the 15th Bengal Native Infantry, was brought up for judgment, he having been convicted of defrauding Mr. Bishop, the gunsmith, and Mr. Almond, army accoutrement maker, of Bond-street, of a £18 note and five sovereigns in cash, for cheques on the Oriental Bank, in which prisoner had no account. The particulars were given in \"LLOYD'S NEWSPAPER\" some two or three weeks since. The learned sergeant sentenced him to hard labour for four calendar months.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206192213.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 613, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2627, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]