[{"id": "4e8257fc9ea6e33b45230c1fd82497d2a8a9c0ee", "text": "THE ALLEGED BREACH OF THE NEUTRALITY LAWS.\n\nOn Thursday morning John Patrick M'Donald was charged, on remand, at the Bow-street police-court, with having, in conjunction with others not in custody, enlisted under false pretences and sent out a number of Irishmen from this country for the purpose of fighting on the side of the French against the Prussians.—Mr Costello, who was examined at great length at the last hearing, was recalled and cross-examined by Mr Merriman. He said: I never described myself as a leader of any military organisation, nor did I ever hold any rank. I was not in the habit of receiving telegrams from Tours. I was requested to read one telegram which Captain Thierry had received from the Minister of War to the men. It contained three questions:—Firstly, would the men consent, if so how many, to join a battalion of the Foreign Legion to be incorporated in a line regiment? Secondly, would the men, if so how many, consent to join a body of Francs-Tireurs? Thirdly, would the men, and if so how many, prefer being sent home? To the first question the men gave a unanimous negative. To the second question about one-third adhered conditionally. To the third question about two-thirds of the men agreed. I conveyed these answers to Captain Thierry. That was the only telegram I read.—John Flanedy recalled: The man whom I saw in France, and was called Colonel Dyer, is the same man whom I saw in Bolt-court, and was then called Mr O'Hagan. By Mr Merriman: The last witness, Mr Costello, is the gentleman I referred to in my last evidence.—James Wood, the captain of the steamer John Bull, in which the men were taken out to Havre, said he went, in pursuance of orders he received from Mr Bishop, to Bolt-court. He there saw Mr M'Donald. Witness asked him how many men were going to sail to Havre. He replied there were 62 already paid for, and there might be some more. Witness asked him, \"Where is the ambulance?\" He replied, \"It has not gone by you (the General Steam Navigation company). I suppose it has gone from Dublin.\" There were about 80 or 90 persons on board the vessel altogether. Mr M'Donald and two brothers, named Cotter, were in charge of the men. M'Donald went as far as Gravesend; the Cotters went on to Havre.—After some further evidence, Sir T Henry committed the prisoner for trial for an infringement of the Foreign Enlistment act, and for conspiring to commit that offence. His worship agreed to admit the prisoner to bail, himself in 200l., and one surety of 200l., or two in 100l. each.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206235732.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 638, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2540, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]