[{"id": "ae3715aa77dd22ab6e094b2c8520764c1135c366", "text": "RAIDS ON CLUBS.\n\nThe police on Wednesday made two raids on supposed betting clubs in London. The first was on the Falmouth club, 164, Strand. The premises are situated on the first floor of a cigar shop, and extend through to the back. At a given signal the three inspectors, who had 200 constables in reserve, entered the cigar shop and proceeded along the passage until their progress was blocked by a door. They knocked for admission, and upon the door being opened rushed inside, completely overpowering the man in charge, who was at once given into custody. The inspectors then went to the first floor, and immediately their presence was discovered a scene of great confusion ensued. The room was filled by some 20 or 30 men, who were crowding round a \"tape machine\" and a \"ready-money bookmaker,\" waiting the result of the second race of the day to come through. A rush was made for the door by some of the men, but they found that all escape had been cut off by that source, the staircase being filled with policemen. The whole of the men found on the premises were arrested, including the proprietor. The greatest excitement prevailed in the neighbourhood, each man, as he was taken out of the premises in charge of two police officers being loudly cheered by the crowd which had assembled.—Almost simultaneously with the raid on the Falmouth club, and a short time before the City and Suburban handicap was being run at Epsom the police effected an entrance to the Agar club, near Buckingham-street, Strand. No opposition was made to the police, who, under Inspector Robinson and Detective-serjeant Partridge, at once arrested those found on the premises, to the number of about 40, and they were conveyed in cabs to Bow-street police-station. By eight o'clock on Wednesday evening all the prisoners had obtained bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206275818.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 425, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1827, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]