[{"id": "2f93ce759aff39965f770849641b87e8e561af6f", "text": "MURDER OF AN INFANT.\n\nAt the Old Bailey on Friday James Dilley, 41, a picture-frame maker, and Mary Rainbow, 29, unmarried, were indicted for the wilful murder of the illegitimate child of the latter. According to the statement of Mr. Poland, who appeared for the prosecution, Dilley was a married man residing at Baldock, and the female prisoner was his domestic servant at Baldock, about six miles from Sheffield. There appeared to have been an improper intimacy between them, and in March last they came to London, and under the names of Mr. and Mrs. Hull took lodgings in Stebbington-street, St. Pancras, where Rainbow was delivered of a female child on the 22nd April, Dilley having gone back to Sheffield. On the 16th May he reappeared, and on the following day both prisoners left in a cab, taking with them the child. Their luggage was left at King's-cross station.\n\nAbout 11 o'clock at night they next appear to have been at a house in Gray's-inn-road without the child, and then began to obtain lodgings there, and they stayed for the night in Liverpool-street. The following day they left, Dilley returning to Sheffield, and the woman going to a cousin's at Chelsea, whom she had promised to visit, but subsequently returning to Baldock. A paper parcel containing the body of the child, which had evidently died from the effects of a wound upon the head, was picked up on that day at Hornsey. The suspicions of the police were afterwards directed to the prisoners by the discovery at Hitchin station, where the female prisoner would have to wait for a train when returning to Baldock, of a quantity of child's clothing, which was identified as having been worn by the child, and further inquiries having been made, both prisoners were arrested. The evidence established these facts, but Dr. Berry, the surgeon who examined the body of the child, after expressing an opinion that death was caused by the injury to the head, said he would not undertake to say positively that the wound might not have been caused by a blow or a fall immediately after death. The witnesses all stated that during the lifetime of the child both prisoners appeared to be very fond of it, and treated it very kindly.\n\nYESTERDAY'S PROCEEDINGS.\n\nYesterday morning Mrs. Justice Hawkins sat up the case for the prosecution, and in doing so submitted that it was impossible to come to any other conclusion than that both prisoners had deliberately formed the intention of destroying the life of this unhappy child, with the object of concealing the shame of the female prisoner, and relieving themselves from the burden of maintaining it.\n\nMr. Wildey Wright, on behalf of the male prisoner, endeavoured to show that there was no conclusive evidence whatever that a murder had in fact been committed. He said it must have died from natural causes, and all that was subsequently done was merely for the purpose of concealing the dead body and endeavouring to prevent an exposure.\n\nMr. Wilks Statham, for the female prisoner, said that he thought it was his course to fail bound to pursue, and he had no alternative but to say that the male prisoner must have been the principal mover in the transaction, and he characterised his conduct as distinctly in having, when the child was into custody, attempted to throw all the blame upon the unfortunate woman whom he had seduced and ruined.\n\nMrs. Justice Hawkins summed up, and the jury retired at four o'clock to deliberate. They returned into court at half-past five, and found both prisoners \"Guilty of wilful murder,\" but recommended the female prisoner sooner to mercy on the ground that she had been seduced and ruined by the influence of the male prisoner.\n\nMrs. Justice Hawkins having charged on the black cap admonition, and said that after a long and patient inquiry the jury had found them guilty of a foul and cruel murder—the murder of a poor little offending child, of which the female prisoner had only very recently before been confirmed. It was impossible to say whether the sentence of death would be inflicted; but he could not hold out any hope to her that the recommendation would be attended with any effect as regarded the sentence. He was bound to say that he had been unable to discover any one extenuating fact in his favour, and he, therefore, exhorted him to prepare for that event. The learned judge then passed sentence of death in the usual form. The female prisoner fainted, and was carried immediately into the dock. The man did not exhibit the slightest emotion.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206245031.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 977, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4523, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]