[{"id": "29fbbc29d72bd9bd3767253dd370c6799fa199ef", "text": "ALLEGED CHILD STEALING AT CROYDON.\n\nAt Croydon, on Friday, Elizabeth Grosvenor, forty-three years of age, described as a canvasser, of 10, Park-terrace, Earl's-court-road, Kensington, was charged with stealing Arthur Bartrum, aged three and a half years, the child of a coachman in the employment of the Croydon Gas Company, who had been missing from his home at 129, Handcroft-road, Croydon, nearly a fortnight. The court was crowded. The child's mother stated that last Friday week she sent the boy out to play with his brother. He was then dressed as a boy. He did not return, and the matter was put in the hands of the police.\n\nSelina Childs, thirteen, said on Thursday she saw the missing boy in Parson's-mead, within a few minutes' walk of his home. He was accompanied by the prisoner, who was leading him by the hand. The boy was then dressed as a girl. The witness spoke to the child, and the prisoner asked her if she knew him. The witness replied, \"Yes.\" The prisoner then said, \"A woman gave him to me at the top of the street. Will you take him home to his mother?\" The witness took charge of the child, but at once fetched a man named Hayes from an adjacent public-house and told him what had occurred.\n\nHayes, who is a painter, said he followed the prisoner, accompanied by the witness Childs. The accused commenced to run. On seeing she was followed she took refuge in a public-house, but on emerging was given into custody. On being charged the prisoner said, \"I did not steal the child; it was given to me by a woman in the North-end about a week since. I took the child home, as I am alone in the world, but I have well cared for it.\"\n\nThe prisoner's landlady, Mrs. Brown, said the accused had rented from her since the 19th of May an unfurnished room. On the 13th of July she was away all day, and on the following morning the witness heard in her room the voice of a child. The prisoner said the child belonged to a friend of hers, and was staying with her because she felt lonely, and wanted company. The accused always treated the child kindly.\n\nThe prisoner told the Bench she was almost insane through loneliness.\n\nMrs. Brown added that the accused had told her she was connected with the Leveson-Gower family, and with several other noble families who did not acknowledge her. The prisoner was eccentric, but the witness had no doubt as to the truth of these statements.\n\nThe accused now asserted that she was the niece of the Duke of Argyll. When the child was given to her she was alone in the world, having been without a friend since the death of the Duchess of Sutherland, who had always befriended her. She had latterly been persecuted by a class of people who said she was insane, which was untrue. She was passionately fond of children, and when the child was given to her she thought it would be a comfort to her. The person who gave it was a complete stranger. The accused added that she formerly lived at Croydon, and knew both the present and late vicars of the parish. She came to Croydon for the express purpose of restoring the child to its parents if she could find them.\n\nShe was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200813282.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 757, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3142, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]