[{"id": "6a0daa5cdeda39ef8529ca9af43759dda5c49531", "text": "CHARGE AGAINST A MANAGING DIRECTOR.\n\nOn Monday, at the Central Criminal Court, Mr. Henry William Pound, late managing director of a limited liability company, called Pound, Son, and Hutchings, now in liquidation, surrendered to take his trial for unlawfully obtaining timber of the value of £4,000, by false pretences. The prosecutors in this case were Messrs. Brinsmead and Co., pianoforte manufacturers and timber merchants. The company of which the defendant was the managing director was formed for the purpose of carrying on the business of timber merchants and packing-case makers. At the close of last year they had entered into extensive contracts with the Government for the supply of packing cases and ammunition boxes to the War Office. Messrs. Brinsmead had supplied considerable quantities of timber to the company, and they were desirous to have some additional security for payment. An arrangement, it appeared, was then made, the terms of which were that whenever the company had sent in to the War Office packing-cases and boxes they should be supplied with timber to a corresponding amount by Brinsmead and Co., bills being given by the company for the amount. The allegation on the part of the prosecution was that from time to time the defendant represented that large quantities of cases had been delivered to the War Office, and thus fresh supplies of timber were obtained by the company, the fact being that no such goods had been supplied to the War Office, and in the month of March last the company went into liquidation, which led to the discovery of the alleged fraud. It appeared, however, that the contracts entered into by the company with the Government were really valuable contracts, under which the defendant's company would have derived considerable profit, and that but for the winding-up of the company by an adverse creditor, the supply of cases at the War Office would have continued to go on, and the prosecutors would, in all probability, have received full payment. It also appeared that everything that was done by the defendant in the matter was done in his capacity of managing director on behalf of the company. It was also elicited in favour of the defendant that at the time of the winding-up goods of the value of £500 were ready for delivery by the company to the War Office. Witnesses were called for the defence, whose evidence went to show that the company was using every exertion to carry out the contracts, and that no fraud was contemplated. The jury found the defendant guilty, but not with intent to defraud, and strongly recommended him to mercy. Mr. Gill reminded the court that the defendant had lost everything he possessed, or he would, by his connection with this company, and he never intended to commit any fraud. The recorder allowed the defendant to be discharged upon his entering into a recognisance to appear and receive judgment if called upon.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200807892.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 616, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2918, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]