[{"id": "29116e49d11cf8472445478eee96c7d742e693a3", "text": "FATAL ACCIDENT IN PICCADILLY.\n\nOn Friday evening, Mr. Bedford held an investigation, at St. George's hospital, relative to the death of Charles Smith, a boy of sixteen years of age, who, having been led to view the demolition of the park railings on Tuesday evening last, lost his life under the following circumstances:\n\nHenry William Smith, 36, Raphael-street, Knightsbridge-green, a coach painter, identified the body as that of his son, who was a page boy in Orchard-street, Oxford-street. Witness knew nothing of the accident.\n\nJohn Ward, a labourer, of 28, Francis-street, Chelsea, said that about half-past nine on Tuesday night last, he was in Piccadilly, near the park-gates, there being but a small crowd there at the time. He saw the deceased behind a brougham, which was going about five miles an hour. He was riding on the back of the carriage. Witness turned his head for a second, and on looking round he saw the boy between the wheel and the springs. The carriage stopped on being called to. Witness, with others, extricated the boy. His legs were towards the horse, one arm being between the spokes, and his face between the springs.\n\nMr. Wm. Leigh, house-surgeon, deposed to seeing the deceased when brought into the hospital. There was a large scalp wound exposing the bone, a fracture of the skull, a comminuted fracture of the thigh, several bruises about the body, and no doubt internal injuries. The wound and fractures were quite sufficient to cause death.\n\nThe jury returned a verdict of \"Accidental death.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206225614.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1660, "total-output-tokens": 379, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1532, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]