[{"id": "831273b4635dd5c3982b6b9b581180ebf4453726", "text": "ATTEMPT TO BURKE A FEMALE.\n\nYARMOUTH, SATURDAY.—A horrible attempt to murder took place in the vicinity of this town late on Thursday evening. The wretched victim of this diabolical act is a servant girl, named Mary Ann Proudfoot, whose recovery is at present doubtful, and the party arrested on suspicion of having made the atrocious attempt is a corn porter, of the name of Samuel Howth, who was in the same service as the unfortunate girl, and by whom she is pregnant. The circumstances attending the horrible affair are truly revolting. Between eight and nine o'clock on Thursday evening, some boys who were playing near the town battery, had their attention drawn to some moans close by, and on giving an alarm at a neighbouring public-house, search was made in the direction of the noise, when a woman was found lying under the wall of an adjacent mill. She was perfectly insensible, her face and head were horribly disfigured, and a plaster of pitch and tar, fastened under her chin, was covered over the front part of her head. Her gloves were besmeared with tar, as if she had endeavoured to drag the plaster off; and her dress showed that she had taken part in a severe struggle. The poor creature was removed to the Northumberland Arms public-house, and thence to the hospital. Captain Love and Mr. Smith, magistrates, hearing of the outrage and the dangerous condition of the girl, deemed it prudent to take her testimony, and she, sufficiently recovering, made the following statement:\n\n\"My name is Mary Ann Proudfoot, and I am a single woman, living in the Lion and Lamb-row. I am servant to Mrs. Bunn, of Southtown. I am pregnant by Samuel Howth, a corn porter, in the employ of Mr. Bunn. I was to meet him at eight o'clock this evening (Thursday) respecting some money he was to give me against my confinement. I met him at the time stated at the Pudding-gate, and walked to Tooley's mill with him. He then had connection with me; and when I attempted to get up he immediately put a tar plaster over my face, and attempted to strangle me with his fingers. I then screamed, and he beat me violently about my face and head, and left me insensible.\"\n\nThe police instantly adopted proceedings to arrest the suspected murderer, and they found him at a house near the quay. He was sitting by the fire, smoking his pipe, and divested of coat, cravat, and shoes. On being informed of the reason of this visit, he declared that he had not left the house that evening. His left hand, it was observed, was black, apparently with tar; and other circumstances transpiring, he was removed to the station, and being examined before the magistrates, was remanded in order to ascertain the fate of the girl. She at present continues in the hospital. There is little doubt that she was imagined to be dead when she was left on the ground with the plaster over her face.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201313.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 669, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2867, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]