[{"id": "d2c357bab5f1b2a02d7972a5066919d635ac6898", "text": "THE PUBLIC HEALTH.\n\nFrom the Registrar-general's return we learn that during the week ending April 4 the deaths registered in 28 great towns in England and Wales corresponded to an annual rate of 22·7 per 1,000 of their population, which is estimated at 10,010,425 in the middle of 1891. The deaths registered, alphabetically arranged, corresponded to the following annual rates per 1,000:— Birkenhead 27·1, Birmingham 18·1, Blackburn 25·0, Bolton 19·2, Bradford 18·2, Brighton 14·5, Bristol 22·2, Cardiff 22·7, Derby 14·1, Halifax 30·2, Huddersfield 21·2, Hull 36·5, Leeds 27·2, Leicester 25·4, Liverpool 22·9, London 20·9, Manchester 26·3, Newcastle-on-Tyne 29·4, Norwich 19·5, Nottingham 17·6, Oldham 22·1, Plymouth 31·6, Portsmouth 30·6, Preston 29·0, Salford 25·5, Sheffield 21·7, Sunderland 22·2, Wolverhampton 19·2.\n\nIn London 2,781 births and 1,739 deaths were registered. Allowing for increase of population, the births were 96, and the deaths 19, below the average numbers in the corresponding weeks of the last ten years. The annual death-rate per 1,000 from all causes, which had declined in the preceding five weeks from 23·7 to 19·4, rose last week to 20·9.\n\nThe 1,799 deaths included 2 from smallpox, 45 from measles, 9 from scarlet fever, 24 from diphtheria, 61 from whooping-cough, 8 from enteric fever, 11 from diarrhoea and dysentery, and not one typhus, ill-defined forms of continued fever, or cholera; thus, 160 deaths were referred to these diseases, being 60 below the corrected average weekly number.\n\nIn Greater London 3,551 births and 2,230 deaths were registered, corresponding to annual rates of 32·4 and 19·8 per 1,000 of the estimated population.\n\nSHOCKING CRIME.—Lewis Padley, formerly a labourer at a colliery, was liberated in September last on a ticket-of-leave for the remainder of a term of 10 years for a criminal assault on one of his own daughters. He has since been living with another married daughter at Wood-street, Barnsley. On Friday he went out for a walk with his youngest child, a little girl of 10, and was soon after taken in the act of assaulting her by a miner named Ogley.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206275823.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 713, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2126, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]