[{"id": "c03b839e6bcc8c5961963f1426da9f48d1a2a6c7", "text": "MURDER OF A YORKSHIREMAN IN NATAL\n\nA man named Wilkinson, described in the police reports as a Yorkshireman; has met with a sad and tragic fate in Natal. He had been an itinerant schoolmaster, and when living at Riet Vlei, in November last, mysteriously disappeared. The mounted police made strenuous efforts to obtain some trace of him, but without success. When the last mail was despatched, however, the district where he had lived was in a state of great excitement, owing to the discovery of his body in a well, under circumstances leading to the conclusion that he had been murdered.\n\nThe story of the murder and its discovery is a remarkable one. It is alleged that Wilkinson had become too intimate with the wife of a resident at Riet Vlei, and was detected by the husband. The latter and another man seem to have lured Wilkinson to a sequestered place, and while one of them engaged him in conversation the other struck him from behind with a sledge-hammer. The men then took the body, whether alive or dead the police had not ascertained, and dropped it into a deep well, together with the hammer. Two months ago the hammer was fished up from the well, and Mr. Norton, a justice of the peace, commenced inquiries, but with little success as pertained to the disappearance of Wilkinson. It has transpired, however, that a detective succeeded in unravelling the mystery, and as related by the colonial papers his method of procedure was of an extraordinary character. Suspecting two of several men, who have since been arrested, he made their acquaintance, and by the judicious use of free drinks he wormed himself into their confidence, and was enabled to effect the following ruse:—One of the suspected men possessed a valuable dog, to which he was very much attached. The detective, watching his opportunity, poisoned the animal. Going to the owner of the animal, he imparted to him as a secret that the other suspected man had poisoned the dog. The owner, swearing vengeance, in the hearing of the detective, said, \"The ——! I'll put a rope round his neck for this piece of work,\" and forthwith imparted to the eager listener the whole of the facts as related. The men, who are named Johnson and Felstead, were immediately arrested and lodged in the Greytown Gaol. A third man named Cullen was also arrested at Maritzburg in connection with the affair, and the police state that one of the three will turn Queen's evidence. Wilkinson, who was a middle-aged man, had no relatives in Natal, and up to the time the last mail was despatched they had not discovered from what part of Yorkshire he had, some ten years ago, emigrated to South Africa.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811970.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 610, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2654, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]