[{"id": "3e80b2758fe8af447d6bca5901c85d6ec5840f53", "text": "Attempted Murder at Hoxton.\n\nAlbert Briggs, twenty-eight, of Honzor-street, Hoxton, and Henry Monro, eighteen, of Squarry-street, Bethnal-green, were charged at Clerkenwell Police-court, on Friday, with being concerned with another man not in custody in attempting to murder Harry Ruskin by throwing him into the Regent's Canal. The prosecutor, a coachman, said he had known Briggs for about a fortnight. During Thursday afternoon he was in the company of the two prisoners and another man; they visited several public-houses. At eleven o'clock they left the Angel, at Islington, and walked towards Nile-street, Hoxton. They stopped on the way on Danbury-bridge, and stood looking into the canal, talking. Briggs suddenly seized hold of witness, who was leaning on the parapet, and said, \"Go over and drown, you—.\" Prosecutor clung to the parapet, and Briggs knocked his hands away, and, lifting him up by the waist, threw him over into the canal. He was becoming unconscious in the water when he was rescued by a bargeman. Mrs. Anne Woods said she was walking over the bridge and saw the man leaning over the parapet. She heard one of them say, \"Drown, you—,\" and then a splash. Police-inspector Dayball and other officers proved arresting the prisoners the same night. Briggs denied having been in Ruskin's company, and Monro said he knew nothing of the matter. Witness, Mrs. Woods, said she could not identify the men who were standing at the bridge, because they walked rapidly away after Ruskin fell in the water. The prosecutor, questioned by the magistrate, said that while he was in Briggs' company on Thursday evening the latter urged him to snatch a watch and chain from an old gentleman who was standing outside the Agricultural Hall. Briggs said, \"I'll knock him down if you run away with the watch.\" Witness declined. Mr. Bros: I have not the slightest doubt that this man would have been drowned had it not been for the promptness with which the lady raised the alarm and the readiness with which the bargeman rescued him. I hope the Court which tries this case will take some notice of the conduct of these witnesses. The prisoners were committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810460.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 514, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2172, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]