[{"id": "d6807e674d6a0804e93c0f2b89b55ae39b0ec89c", "text": "EXECUTION OF JOHN WILLIAMS, AT GREENLAW.—On Monday last, the sentence was carried into execution against John Williams, for the murder of William Mather, tollkeeper at Cleckinnim, near Lauder, Berwickshire, on the night of the 4th December, 1852. The execution was fixed to take place between the hours of twelve and two o’clock. Shortly before twelve the prisoner was conducted from the small room in which he was confined, after his removal from the gaol, to a large adjacent room, in which Sheriff Wood and other officials, besides the Rev. Messrs. Walker and Proudfoot, were assembled, and conveyed to the scaffold by a body of the county police, followed by the executioner, Calcraft, who arrived from London on Saturday last. The prisoner ascended the scaffold with a firm step, and, having taken his place on the drop, the executioner proceeded to perform the preliminary duties of his office. On the conclusion of prayer, the bolt was drawn, and the unhappy man launched into eternity. He seemed to die without a struggle, a slight shiver only evincing the departure of life. Having hung for nearly an hour, during which time upwards of half of the crowd had left, the body was lowered into a coffin beneath the drop, and immediately conveyed in a cart to the gaol, to be buried within the precincts.\n\nALLEGED MURDER IN EDINBURGH.—Considerable excitement was occasioned in the neighbourhood of Hume’s-close, Canongate, by the report of a murder, of which a labouring man residing there was the victim, and of which his wife, it is alleged, was the perpetrator. The husband’s jealousy had been excited with reference to a person who lodged in the house, and the two having quarrelled on the subject, the wife, it is stated, suddenly seized a shoemaker’s knife, which was lying on the table, and inflicted a deep wound on the left side. The knife penetrated the heart, and the unfortunate man expired in a short time after. The woman was immediately taken into custody, but she asserts that the wound was inflicted by the man himself; and as there were only the two of them in the room at the time, this statement may or may not be correct. It appears, however, that the man has before threatened to commit suicide if the cause of his jealous apprehensions was not removed—a circumstance which certainly favours the wife’s explanation of the occurrence; but, meanwhile, the alleged murderer remains in custody.—Caledonian Mercury.\n\nSCARCITY OF COALS IN THE NORTH.—The late snowstorm having closed the roads in many districts in the north, occasioned a great scarcity of coals. In Ellon, so much was the scarcity felt, that in some cases neighbours, to make their fuel last as long as possible, agreed to have but one fire between them, and go to each other’s houses day about for cooking and warmth; and there was also a case where two women, the one with three children under her roof, and the other a pauper of some eighty years of age, who, with that quiet, unmurmuring endurance of privation which is often so touchingly displayed by the Scottish poor, sat uncomplainingly for two whole days without fire in their dwellings.—Edinburgh Witness.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206304573.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 728, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3153, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]