[{"id": "ea9cdb9c8a05231f43e773c411d303958c6d9807", "text": "THE HORWICH MURDER.\n\nAt the Liverpool Assizes, on Friday, Robert Gay, forgeman, was indicted for the murder of his infant daughter, at Horwich. It was stated that when in drink the accused used to tax his wife with being intimate with a neighbour, who he alleged was the father of their last two children. In the course of a quarrel in April last he drove his wife out of the house, and then cut the child's throat, nearly severing the head from the body. He then cut his own throat, but the wound was not serious, and he recovered. The allegation against the wife was denied, and it was stated that the prisoner, though sane on all other subjects, was crazy on this; but he only alluded to it when in drink. He was found guilty of wilful murder and sentenced to death. He received the sentence calmly, and when leaving the dock called out that his wife and the neighbour had caused his death and that of his daughter, and he hoped they would look after the children for his sake.\n\nTERRIBLE MINING ACCIDENT.—A terrible accident has occurred at a mine near Calumet, Michigan, where a cage containing ten men was dashed to pieces, owing to a breakage of a coupling pin. The shaft down which the cage fell was 3,000 feet deep, and all the occupants of the cage were instantaneously killed.\n\nEXTRAORDINARY CATCHES OF MACKEREL.—One of the largest hauls of mackerel ever known on the western coast was made on Friday morning in the West Bay, at Abbotsbury, Dorset, when over 30,000 fine fish were landed. They were despatched by earliest trains to London and other great centres. Another extraordinary catch was made on Monday, consisting of over 100,000 fish.\n\nLAWLESSNESS IN LIMERICK.—The principal window of the City Court-house, at Limerick, was broken with stones on Saturday night, the woodwork and four panes of glass being forced in with such violence that at first it was thought explosives had been used. No arrests have been made, nor can any motive be assigned for the outrage.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811629.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1476, "total-output-tokens": 492, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1983, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]