[{"id": "8cd15ed7f3aa5449d9e9c2b8ddee88f670ac8e35", "text": "THE TAUNTON RAILWAY DISASTER.\n\nOn Saturday the Taunton Assizes opened, Mr. Justice Grantham presiding. His lordship, in addressing the grand jury, referred to the charge against George Rice, signalman, of causing the death of ten persons at Norton Fitzwarren, and said that it was undoubted that the defendant had a duty to perform and did not do it, and that in consequence of his not doing so the lives of ten persons at least were sacrificed. The law on the point was that everyone who contracted to perform certain duties upon which the preservation of life depended, and who neglected to perform those duties, and thereby caused the death of any person, committed the same offence as if he had caused the same effect by an act done. It would be for the jury to consider what was the state of the man's mind when he was guilty of the offence—in other words, whether the neglect was culpable. He considered that they should find a true bill.—The grand jury retired, and returned into court with a true bill against the prisoner. They made a presentment to the effect that the attention of the Government should be called to the great danger involved in allowing trains to be shunted upon the main lines.—George Rice, sixty-three, signalman, was then indicted for the manslaughter of Robert Walker and nine other persons at Norton Fitzwarren on November 16th.—Mr. Douglas Metcalfe and Mr. Warry prosecuted; and Mr. Charles Mathews defended, whilst a number of counsel watched the proceedings on behalf of the Great Western Company.—The prisoner pleaded not guilty.—Noble, the driver of the goods train, was examined, and said he was on the up line nine or ten minutes before the special came up. The red light on his engine had just been removed as the special came in sight. He did not think the driver of the special could have seen witness's light at a greater distance than one hundred and fifty yards, and if the red light had been showing the speed of the special could not have been materially reduced, as it is a light train, and the rails were greasy.—Evidence was given that the prisoner a few months ago sustained a fracture of the ribs and slight lacerations about the head. His hours were from a quarter-past nine a.m. to a quarter past seven p.m. in alternate weeks.—Tovey, the telegraph clerk at Exeter, proved apprising Rice of the dispatch of the special train.—Albert Allen, signalman at the Victor crossing, next to Norton, on the Exeter side, proved receiving the same notification, and receiving at eighteen minutes past one, \"Line clear.\"—Mr. Kemp, the Norton station-master, gave particulars as to when Rice went on duty. Mr. Wallington, a survivor of the first carriage, also gave evidence.—Dr. Willcocks stated that three weeks before the collision Rice was at his surgery, and he prescribed for pains in his head.—Mr. Campfield, district superintendent, said it was optional with the signalman to shunt the goods train on one of the branch lines. This concluded the case for the prosecution.—Mr. Charles Mathews called no evidence on behalf of the prisoner, but asked the jury to acquit him. He said they could not convict him for an error of judgment or exercise of faulty discretion. They must have it proved that he had been guilty of an act of gross culpability and criminal negligence. He also argued that the removal of the red light from the tail of the goods train was wrong.—The judge, in his summing-up, said he failed to see that the prisoner was not guilty of gross negligence, but it seemed to him that two other persons had also omitted to do their duty. He also complained of the goods traffic being shunted on the main line, and was glad the grand jury had called attention to the matter. He hoped it would now be altered.—The jury then returned a verdict of not guilty, and Rice was acquitted.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200809849.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 856, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3838, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]