[{"id": "a9e5edcb9e1585be10875ecb21800f002046b771", "text": "EXECUTION AT BRISTOL.\n\nOn Monday morning at eight o'clock, William Hole, aged 56, was hanged in Bristol gaol for having, in August last, murdered his wife. The convict began life as a bargeman, but, being a teetotaller and a steady man (he and his wife were for many years members of a Baptist congregation), he eventually became the owner of several barges, and employed a large number of men. A few years ago his only child was run over by a cart in the street, and killed. This greatly affected both Hole and his wife, and they took to drinking and frequently quarrelled. On the night of the 27th of August last Hole, on returning home drunk after the closing of the public-houses, found his wife, who was also drunk, sitting on the doorstep. He told her to go into the house, when she refused, and, after some words had passed between them, Hole ran into the house, took a carving-knife off the table, and returning to where his wife was sitting, stabbed her in the throat. The woman died while being conveyed to the hospital. Hole, being very well known in the city, and especially in the Temple district, where he gave away a large amount of money among his poor neighbours, petitions asking for a commutation of his sentence were signed by nearly 30,000 persons, and backed by the appeals of the city members; but the Home Secretary, after a consultation with Mr. Justice Lush, who tried the case, replied that he could not interfere, and accordingly the execution took place on Monday morning. When asked to confess his crime, he said, \"Yes, I did it;\" but he repeated a statement that he had all along adhered to, that he knew nothing at all about it. On Monday morning the chaplain went into his cell at an early hour, and was engaged with him until a quarter to eight o'clock, when Marwood, the executioner, was introduced to him. He submitted passively to be pinioned, and the only remark he made while this operation was being performed was that he was suffering from rheumatism. The prisoner placed himself under the drop, the noose was adjusted, and the bolt was at once withdrawn. The culprit fell a distance of five feet, and died instantly.\n\nBy a singular coincidence, Mr. Marchant, who was one of the principal witnesses against Hole at the trial, died at five minutes to eight o'clock—only five minutes before the unfortunate man was executed. Mr. Marchant was landlord of the Castle of Comfort public-house, where Hole spent a great deal of his time.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206323163.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 584, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2471, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]