[{"id": "c2d9afb058420506bc5d721f9c8f7fa085837f10", "text": "ASSAULT ON A WOMAN.—Richard Taylor was indicted for unlawfully assaulting and beating Sarah Malkin.—From the evidence it appeared that some time ago the prosecutrix was called as a witness in prosecution against the prisoner, when he was sentenced to a month's imprisonment for being found on premises for an improper purpose, and an angry feeling seems to have been engendered in consequence. On Saturday night, the 20th of October, the defendant went to the prosecutrix's door and knocked, and on it being opened to him, he immediately gave her a violent blow in the face and ran away. From this blow she suffered considerable pain. The prisoner was subsequently arrested, and charged with the offence.—The jury found the prisoner \"Guilty.\"—The prosecutrix stated that since this case had been pending she had been threatened by the witnesses who had been called for the prisoner with violence if she dared to give evidence against him.—Mr. Serjeant Cox sentenced the prisoner to be kept to hard labour for nine months, and after that to find two sureties in 10l. each, and to enter into his own recognisances in the sum of 20l., to keep the peace for twelve months.—The witnesses alluded to were then called forward, and one in particular was cautioned as to his conduct, and the learned serjeant further advised the prosecutrix to take out a summons against him.\n\nA FORTUNATE PRISONER.—Mary Gray, whose real name is said to be Mary Ann Cole, surrendered in discharge of her bail, to answer an indictment charging her with having stolen a case of needles, value 1s., the property of William Whiteley.—The evidence tended to show that the accused went into one of the shops of Mr. Whiteley, at Westbourne grove, on the afternoon of November 2, and made a purchase; that an assistant saw her take a packet of needles; and that she ultimately confessed that she had done so, said it was the first time she had done anything of the kind, and offered to pay for the article.—Mr. Williams addressed the jury for the prisoner, and called three witnesses, who gave her a good character.—The jury, to the surprise of most of the persons in court, returned a verdict of \"Not guilty.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206329270.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 509, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2176, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]