[{"id": "9dd8bf293bf18ab88c183ec77a15375708a385b9", "text": "THE OLDHAM MURDER.\n\n[SUBJECT OF ILLUSTRATION.]\n\nAt Oldham, Joseph Mellor, factory operator, was brought up charged, on remand, with the wilful murder of Mary Jane Mellor, his wife. Mr. Fripp, solicitor, prosecuted, and said the murder was committed between the 26th of August and the 19th of October, on which last-named date the body was found in a cellar at the prisoner's residence. It was conjectured that the murder was committed on the 3rd of September, and that the grave was dug with a file and the flags raised with a crowbar. From the large quantity of firewood found in the house it was thought that the prisoner intended to burn the blood-stained clothing and destroy all traces of his crime. Mr. C. Escourt, public analyst, deposed to finding traces of blood on many of the articles produced. Dr. Fort, who made the post-mortem examination, gave it as his opinion that all the wounds were caused before death, and that death took place from a fortnight to a month ago. Lizzie Sunderland, the prisoner's sweetheart, repeated her previous evidence. She said the accused told her he was unmarried, and fixed next Christmas as the time for their marriage. Sarah Sunderland, mother of the last witness, said the prisoner visited her house on the night of the 18th ult., and she saw him there the next morning. In the forenoon of that day the body of the deceased was found. Other witnesses having been called, the prisoner, replying to the Bench, said he reserved his defence. He was then committed for trial at the assizes. On leaving the dock he said, \"I am not afraid. I don't care if it's to-morrow. I ought to have somebody with me.\"\n\nOn the inquest being resumed on Monday, Emma Chadwick, who lived near the scene of the crime, stated that she last saw the deceased on Sept. 3rd. Prisoner afterwards told her his wife was at Hyde nursing her mother. Prisoner afterwards asked what the neighbours had been saying about his wife. She replied that they had said he had either murdered her or she had gone away with another fellow... Lizzie Sunderland said she had been keeping company with the accused for about eighteen months. On August 30th she went to Ovenden, near Halifax, and the prisoner visited her on September 3rd, remaining a whole night. They returned on September 3rd. Since that time the prisoner went to her house nearly every day, and she had sometimes left him sitting in a chair when she went to bed. The accused said he had stayed at her house every night since September 4th, with the exception of five nights. Sarah Sunderland, mother of the previous witness, said the accused stayed at her house on the night preceding the discovery. Evidence having been given as to the finding of blood-stained garments and a large knife, the prisoner was asked if he had any statement to make. He replied, \"Not yet. I don't wish to call anybody at present.\" The jury returned a verdict of wilful murder against Mellor. Again asked if he had anything to say, the prisoner carelessly replied, \"No, not now; I have plenty of chances yet.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810951.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 719, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3055, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]