[{"id": "96d98f4aa83a83334acd6747a9fab6dc23eca332", "text": "GHASTLY MURDER OF A GOVERNNESS IN A WOOD.\n\nBetween five and eight o'clock on Friday evening a brutal murder was committed at a lone farmhouse in Lambridge Wood, about a mile and a half from Henley, the victim being Kate Dancy, governess and housekeeper for several years past in the family of Mr. Mash, a fruiterer, of Fulham-road, London, who resides at the farm part of the year. George Dawson, the farm-hand in charge, left Lambridge at five o'clock, when he says all was well. About eight o'clock two boys, who always sleep at the farmhouse, went there as usual, but failed to gain admittance, the house being locked up, although lights were burning in the rooms. The two boys waited until ten o'clock, and then returned to the home of their parents, about half a mile distant. Their parents informed Dawson, and he went to Lambridge with the boys. He found the house still locked up, and on making a search in the vicinity he found the body of Miss Dancy in the wood near by with her head smashed in, the ears cut, and gashes on the neck. She was quite dead, and had evidently been murdered some hours previously. Word was at once sent to the police. Superintendent Keel was soon on the spot, and with a constable entered the house by a window. It soon became evident that the unfortunate woman was first attacked in the house, for there were signs of a struggle in the passage, blood splashes on the walls, and a brooch and hairpins on the floor. Just outside the door of the passage the police found a portion of a heavy cudgel, about an inch in diameter, and another part of it, as well as an iron poker, were found near the body, where it was evident by the state of the ground a second and prolonged struggle had taken place between the victim and her murderer. The police have not yet obtained any clue likely to lead to the arrest of the murderer. Miss Dancy was about twenty-six years of age, and is described as an accomplished young lady. She was the daughter of a farmer at Tunbridge Wells. Robbery appears to have been the motive, although nothing was touched in the house. Deceased's pocket was turned inside out; both doors were locked inside, but the sitting-room window was open.\n\nAn inquest was opened at Henley on Monday, on the body of the murdered lady, and a man of the name of Rathall was arrested during the day on suspicion of being concerned in the crime.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812376.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 565, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2385, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]