[{"id": "e80a0b98a457b7dfcded809117623a57dcc870e3", "text": "MURDEROUS ATTACK ON A FATHER.\n\nAt the Cambridge Assizes, on Thursday, before Lord Coleridge, Robert Carter, a labourer, aged twenty-five years, was indicted for having maliciously wounded his father with intent to do him grievous bodily harm. Mr. Rawlinson, in his opening statement, said the prisoner used to live with his father, an old man of seventy-three years of age, at Thorn-street, Soham. On Sunday, September 10th, he came home shortly before three o'clock. The father commented upon the prisoner being late for dinner, but the prisoner took no notice of the remark, and passed upstairs to change his clothes. On coming downstairs again he said to his father that he was not going to have any dinner, and the father then observed that it would be wiser for his son to come home to dinner at a proper time instead of spending his time in a public house. This remark seemed to have annoyed the son, who immediately took down from a beam in the ceiling a knobbed stick, with which he struck his father a violent blow on the back of the head. The old man ran out of the house shouting \"Murder,\" but was followed by the son, who dealt the old man more blows across the head. In order to try and save himself from further violence the feeble old man seized hold of the stick. The son promised not to strike again if his father would leave hold of the stick. On the strength of that promise the father relinquished his hold, whereupon the prisoner continued to strike him numerously, knocking him into a ditch, where he was left for dead. The injuries sustained by the old man were serious indeed. There were a number of scalp wounds, and his right arm and one of his fingers were broken. There was evidence to show that the prisoner was under the impression he had killed his father, for after leaving him in the ditch he told a man named Jackson that he had murdered the old man, and afterwards gave himself up to the police. James Carter, father of the prisoner, gave evidence bearing out in every particular the opening statement of counsel. Witness, in answer to prisoner, said they never had any words before. The prisoner (with emotion): I shall never do you any more harm as long as I live. The witness said he did not wish to press the charge, and asked the jury to be lenient with the prisoner, and Mrs. Carter, the mother of the prisoner, entered the box and testified to her son's good behaviour prior to the assault. The jury found the prisoner guilty, and his lordship, on delivering sentence, characterised the case as a very painful one. The prisoner, without any provocation whatever, committed a murderous assault upon his aged father. But for the appeal of the father and mother he should have sent the prisoner to penal servitude. He would, however, try the effect of imprisonment upon the prisoner, and he would not be doing his duty unless the term of imprisonment was a long one. Prisoner would go to prison with hard labour for twenty months.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812242.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 666, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2969, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]