[{"id": "0b69b3a4346df07bf4ed09e904c9a761d76d72e1", "text": "MURDER OF A YOUNG WOMAN BY HER SWEETHEART.\n\nYesterday, Mr. W. Carter instituted an inquiry at Camberwell workhouse relative to the death of Victorine Pugh, aged twenty, an unfortunate girl, who was found drowned in the Camberwell branch of the Grand Surrey canal, and whom it was feared had met with her death from unfair means.\n\nIt appeared the deceased was acquainted with a young man named Tom Knighton, who was known as her sweetheart. On Saturday fortnight, they were seen together near Camberwell-green, about ten minutes to twelve o'clock at night, and she was then apparently in a very excited condition, and appeared to be addressing Knighton very angrily.\n\nOn the same night the deceased and Knighton were seen quarrelling, and the deceased was heard to say she would follow the young man, as she was determined to have her revenge, and if he attempted to go home she would break all indoors, but what she would have him out. They were both then very much excited, and from that time nothing was heard of the deceased until she was found dead in the canal.\n\nThe testimony of Mr. Edwin Chabot, surgeon, of Camberwell, proved distinctly that the death arose from drowning, but upon removing the scalp two spots or patches of blood were found on the skull, one the size of a half a crown, and the other of sixpence, each, as stated by the medical gentleman, having been caused by a blow or fall, in his opinion, received shortly or not just prior to her death.\n\nIt was also proved by a female who lived on the banks of the canal, near the spot where the body was found, that most dreadful screams were heard on Sunday morning fortnight, about two o'clock, and then a cry, in a woman's voice, of \"Oh don't!\" three times, and on the third time something was said in a man's voice—after which, a plash in the water.\n\nA boy who was without a home and who went to sleep on a lime kiln on the bank of the canal, also heard the screams of a female, and afterwards a plash in the water, and then the footsteps of some man running away—these statements being also corroborated by other witnesses.\n\nThe learned coroner here read over the whole of the evidence to the young man Knighton, who had, in a statement made to the coroner's officer, declared he parted with the deceased on the night in question on St. George's bridge (near where the body was found), and that he had not seen her since.\n\nThe man Knighton, who appeared to be quite indifferent to the grave charge against him, declined asking any questions of the various witnesses.\n\nThe jury, after an hour's consultation, returned a verdict of \"Wilful murder against Thomas Frederick Knighton,\" and he was at once conveyed to Horse-monger-lane gaol.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206210831.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 638, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2706, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]