[{"id": "f893eeb71c5681ba49eb6102cfb64d488c6ea259", "text": "ALLEGED MURDER BY A MOTHER.\n\nA woman, who gave the name of Mary Ingles, aged forty, residing at 82, Turnmill-street, Clerkenwell, was charged with murder by a prisoner, named Mrs. Rutherford, on Monday, by violently assaulting her daughter, Mary Ingles, and thereby causing her death.\n\nThe prisoner had been informed by the deceased's mother, who had been attending her, that she could survive only a few days, she had been dying, and that she wished to see her daughter before she died. The prisoner's husband is represented as a sober, respectable man, but quite heart-broken through the death of his wife, who had been ill for some time, and was placed in the dock, pretended to be out of her senses, put her hands together, said she was innocent, and that this was all a conspiracy to get rid of her.\n\nMrs. Rutherford said: I reside at 94, Lagden-street, John's-lane. The prisoner is named Mrs. Ingles, and I believe they are married. I was informed that their mother was murdering her daughter. I went up stairs, and in a dirty room I saw the prisoner who was slaying the deceased. I heard a noise made by the prisoner's carriage, and I saw the defendant draw the deceased by the breast out of bed, and pull her by her hair about the room. She then pulled her down on the floor, and half out of bed. There could be no doubt about the defendant being drunk. She then informed me that the deceased had been murdered by her mother, and that she had never seen the prisoner or the deceased until that morning. The deceased died a few minutes after.\n\nThe defendant then exclaimed it was all false, and that the witness had never been in the room in her life.\n\nWitnesses continued: The defendant said that her daughter should never die upon the bed, if she did she would hang herself.\n\nMrs. Anna Higgs said: I was sitting at the door this morning when I was called to see the prisoner. I then went into the room where the prisoner was, and she said she had killed her daughter. The prisoner said she had killed her daughter, and said she did not get out of bed, and that she would lie upon the floor; and when I was telling the prisoner off, she said she would hang herself.\n\nThe prisoner said violence hurt my back, and feel the effects of it now. The prisoner made use of the most frightful expressions both to herself and others.\n\nThe prisoner said that when she died she would have her mother killed, and her husband dead. The prisoner said she was very weak, and had let her daughter go to look after themselves. The prisoner appeared to have been thinking in this manner.\n\nThe prisoner said she had great pain, and said her dear husband could otherwise prove; the poor dear child she had always loved and looked after in the house.\n\nMr. Tyrwhitt inquired if the prisoner was then partially sober—Sergeant Watson said she had been very drunk, and that he thought she was a very dissipated woman, and he was informed that she had not been properly sober for years.\n\nMrs. Anna Higgs said: I was told that the deceased died about ten minutes after the prisoner's violence. The room was bed and was in such a state that she could hardly stand upright.\n\nPolice Constable said: The prisoner was a very drunken woman, and had often been complained to about her dissolute habits. Her husband was also drunk.\n\nMrs. Mary Ann Peck said: I went up to the prisoner's room this morning, and saw the prisoner pull out of bed, and make use of dreadful language. Since the prisoner's daughter died, she has been very violent, and has often pulled her out of bed at night.\n\nThe prisoner has often pulled her out of bed at night. The prisoner made the deceased go on the streets for a livelihood, and said she would hang herself. The prisoner was a very wicked woman, and had got drunk on the proceedings of her own daughter's proceedings.\n\nDr. Smith said: He had attended the prisoner for some time, and found her suffering from consumption. He had advised her to go into the infirmary, but she refused. He had also informed him that the deceased could not live long, and had told them to keep her quiet.\n\nMr. Tyrwhitt inquired how long after the prisoner had been told she died, and one of the prisoners had visited her the night previously. She then put her hands together, and said, \"Oh, yes, I am going to hang myself.\"\n\nMr. Tyrwhitt said there might be some difficulty in the case. He was willing to express that a person who, according to the prisoner's story, for years did not know all that she was about; but there was one thing quite clear, that when the witness went to see the prisoner, she said she would hang herself, and the defendant to pay a fine of £1, or in default of payment, to be imprisoned in the house of correction, without hard labour, for the space of six months.\n\nThe prisoner here said she was being wronged, and wanted to say that she was innocent, and that she had nothing against the prisoner to be taken away, and said that more cruel, hateful, and disgraceful case was never brought before him.—The prisoner was then removed, screaming loudly.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206206301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 464, "total-output-tokens": 1149, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5064, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]