[{"id": "596d543b9aa06777e7fe5151db21ca32468b8cc2", "text": "TRIAL OF MRS. OSBORNE.\n\nDINA OR GUILTY.\n\nSENTENCE OF NINE MONTHS' HARD LABOUR.\n\n[SUBJECT OF ILLUSTRATION.]\n\nThis closing stage in the noted pearl snatching case was reached, at the Central Criminal Court, on Wednesday morning. The prisoner, Mrs. Osborne, was arraigned before Justice Smith, for the theft of Mrs. Hargreaves's jewels, and for wilful and corrupt perjury, in the libel action which she brought against Mr. Forrest Falton Smith, for interfering with her marriage to Major and Mrs. Hargreaves, who were seated at the solicitors' table, and Mr. Benjamin, whose unexpected appearance in the High Court had caused considerable excitement. The jury were sworn in a few minutes after ten. The counsel for the prosecution were Mr. Gillard, Mr. Foster, and Mr. Coward; the defence, Mr. Charles Russell, Mr. Coward, and Mr. C. Matthews were briefed. Captain Osborne arrived soon after ten, and was accompanied by a naval surgeon and Mr. Mayor. Mr. Gillard addressed the jury a second time, and then the prisoner was committed to custody until the next day.\n\nMRS. HARGREAVES STEAMS.\n\nMrs. Hargreaves: May I say, my lord—The Judge; I cannot hear you unless you are going to make an appeal for mercy. (Sobbing.) I have known her and loved her all her life, and am perfectly convinced she was not in her right mind when she took the jewels.\n\nJUSTICE SMITH'S SENTENCE.\n\nJustice Smith then proceeded to pass sentence, the prisoner, who was crying bitterly, still remaining seated. He said: \"You stole the jewels from Mrs. Hargreaves, appropriated the money to your own use, and when suspicion pointed to you as being the actual thief you commenced perjury in order to vindicate yourself. In that act you have been false and deliberately swore to facts which were intended to lead the jury to believe you did not steal the jewels. I do not think there is any doubt about your guilt, excepting for the interpolation of one man, who was able to produce a document with your endorsement. But I am sure of one thing, if you will not be corrupt yourself, you will help your friend Major and Mrs. Hargreaves would have left that court with the stain of indelible ignominy upon them. Fortunately it did not remain so for nearly a seven years' prison sentence. I am not going to inflict that, but I do intend to give a severe punishment for one in your position. You have been in prison, and your money have been returned, and all the costs paid, and I bear that in mind. You have been some time in prison, you are sentenced to you go to prison for six months, and to pay costs. For all, for her husband, who has played the part of a gallant gentleman while overwhelmed by the most cruel and completely undeserved misfortune. The features of the prisoner, we must have her ear attention. It was stated in the course of the trial that the Public Prosecutor had taken action in connection with Mr. Falton Smith's perjury shortly after that, if there had been other charges made, it would not have been taken. This sudden awakening of the official conscience to the wickedness of perjury is very gratifying. Not the least of its effects is activity in that matter. On the contrary, the judges have long been periodically deploring the terrible increase in the number of these cases. One of them has been so far as to say that he had never heard that, in the majority of the cases he tried perjury was committed on one side or the other, and very frequently on both sides, that it is impossible that the judges of the Public Prosecutor should have been alive to the existence of a grave public scandal. But we hope that the fact than it has required as much energy as it has cost us to bring it to light, in a high social position, to effect this awakening does not mean that the commonplace perjurers are to continue to go free. Cases of this kind, though rare, are not so far as to say that they shall be ignored, and the obscure offenders are never upon pounced upon by the Public Prosecutor only rarely very rarely. Now, how can we look for the proper and deserved punishment and the equal punishment of all perjurers, high and low. We do not like any procedure that suggests that the law is not the same for all classes of the community, and that the poor and the rich may suffer the most by such improper distinctions.\n\nOur artist has made some sketches of the prison life of the unfortunate Mrs. Osborne, who has been tried and put up with a number of indignities in prison especially those belonging to the better class, but Mrs. Osborne has erred in no respect and she must pay the penalty of her misdeeds.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810209.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 510, "total-output-tokens": 1055, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4600, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]