[{"id": "433bd8d37587bf1a31638146924e74a88b2251de", "text": "THE MURDER BY A MOTHER.\n\nOn Tuesday Mr. Manning held an inquiry at St. George's Hospital as to the death of George Durrant, aged three years, who expired in the hospital on the 31st ult. from the effects of injuries he received at the hands of his mother on December 24. Frederick Durrant, a coachman, of 5, Cornwall-mews, South Kensington, said the deceased was his son, and he saw him in good health on the 24th ult., at half-past two in the afternoon. He next saw him at nine o'clock on the following morning, when he was in the hospital. Witness knew nothing of the occurrence.\n\n—Frederick Durrant, a lad of 14 years, said that at about half-past two on the afternoon of the 24th, he and his father went out together, leaving the deceased at home with his three sisters. On returning home at half-past five he heard the deceased crying. He ran upstairs to the first floor front room, and on entering found him running about with his throat cut. He carried him to the surgery of Dr. Tyrrell, who, on hearing of the circumstances of the case, sent for a constable, by whom the child was conveyed to the hospital. Witness returned home, and found his sisters there, but his mother was gone.\n\nIn answer to the coroner, the witness said the deceased's head fell back while he was carrying him to the doctor's. Witness did not know at what time his father came home that night. He had not seen his mother since the 24th ult., neither did he think his father had. The deceased spoke very plainly when he told witness of his mother having cut his throat.\n\n—Inspector White, T division, stationed at Kensington, said that at 5.40 on the 24th ult. a woman came to the police-station and said, \"I have murdered my child.\" Witness asked her her name, and she replied, \"Louisa Durrant. I live at 5, Cornwall-mews.\"\n\nWitness asked her if her statement was true, and she said, \"Yes; I did it by cutting its throat.\" Witness then sent a constable to the address given to make inquiries, and while he was gone the woman jumped up from her seat and said, \"I am jealous of my husband. Will God forgive me for this awful sin? I can hear him crying now. My husband has had a child by another woman. What will they do? Will it be the gallows?\"—By the Coroner: The woman made the statement quite voluntarily, and witness did not have time to caution her. She was perfectly sober, but very much excited, and appeared to be in great distress.—Sergeant W. Brand, of the Criminal Investigation Department, stated that, from instructions received from the previous witness, he proceeded to 5, Cornwall-mews, and there found two children sitting in the first floor front room, crying. The shirt (produced) was lying on the table saturated with blood, and by its side was a razor, half open and also stained with blood. There was also a large quantity of blood about the floor.—Police-constable Elias Taylor, 234 T, said he was on duty in the Gloucester-road when a page-boy called him to Dr. Tyrrell's surgery, and on proceeding there he found the deceased with his throat cut, and in answer to his questions, the child told him his mother had cut his throat. He conveyed the child to the hospital, and having left him there, proceeded to the house 5, Cornwall-mews, where he found another constable, who told him that the woman had given herself up.—The Coroners summed up the evidence, and after 15 minutes' deliberation in private, the jury returned a verdict of \"Wilful murder against Louisa Durrant, the mother.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206246112.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 856, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3492, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]