[{"id": "836e0c87008a0a13eb88f9d5a1b38645d7e89cab", "text": "THE ALLEGED MANSLAUGHTER IN THE WEST-END.\n\nTHOMAS MURRAY, twenty, labourer, Poland-street, Oxford-street, and Michael Murray, twenty-seven, labourer, Rupert-street, Haymarket, were charged, on remand, before Mr. Newton, at Marlborough-street Police-court, with having been concerned with others not in custody in causing the death of Joseph Webb. Mr. Boak, barrister, prosecuted on behalf of the Treasury; and Mr. W. Holloway, solicitor, defended Thomas Murray. It appeared from the evidence which had been reported that on the evening of the 1st of August several boys and girls were dancing to an organ in Broad-street, Golden-square. The pavement was blocked by them. The deceased and his wife wished to pass by, and finding difficulty in doing so, the former exclaimed, \"You might make room to pass.\" Thereupon some persons attacked the deceased, knocked him down, and kicked him. He was taken to the Middlesex Hospital, where it was discovered that his skull was fractured, the man eventually dying from meningitis, brought on by the injury to his head. It was alleged that Thomas Murray was one of the persons who kicked Webb. After Thomas Murray was arrested Michael Murray went on the 18th of August to the Marlborough-mews Police-station and made a statement to Inspector Blenkinsopp, of the C Division, which was taken down in writing. It was to the effect that on the evening in question, while he was in the Star and Garter, Poland-street, his sister Lizzie came and told him that a man was hiding his sister Pops. He thereupon left the bar and went and spoke to his sister Pops in Broad-street. While speaking to her he received a blow from a man he did not know, which knocked him down. He got up and struck the man, and knocked him down on the pavement. The man got up again, they had another round, and he (Michael Murray) knocked him down the second time, and fell with him. The man did not get up again, but remained unconscious. Murray returned to the Star and Garter. Mr. Holloway, in defence, urged that there was no case against his client, but Mr. Newton took a different view of the matter, and committed both the prisoners for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810789.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 525, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2158, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]