[{"id": "dc3552b4a25a592e58863d774ddf3b3c882d0ab6", "text": "CHILD MURDER IN CLERKENWELL.\n\nOn Thursday, an inquiry was instituted before Mr. Wakley, in Clerkenwell workhouse, touching the death of a female child, whose lifeless remains were discovered beneath the flooring of a water-closet, at 18, Chapel-street, Pentonville, the poor little creature having been murdered by being, as it was presumed, buried alive.\n\nJohn Simmon, a youth residing with his parents, at 18, Chapel-street, deposed that he found the deceased's body about half past eight o'clock on Monday. He found it beneath the flooring of a water-closet in the garden at the back of the house. He was in company with another boy, the landlady's son, at the time, and their attention was first attracted to the spot by a peculiarly bad smell arising from the floor. This induced them to take up one of the boards, and they at once discovered the body beneath, with an old rough towel or piece of cloth covering it. The body was left in the position in which they found it; and Mr. Butler, a medical gentleman, was at once sent for.\n\nMr Butler, surgeon, of 19, Chapel-street, deposed that he was called on Monday morning to see the deceased's body, which he found lying, as described by the previous witness, in a hole beneath the flooring of the water-closet. He should say it had been eight or nine days dead. From the examination he had no doubt but that the child was born alive.\n\nMrs. Jones, landlady of the house, 18, Chapel-street, stated that a woman whom she suspected to be the mother of the child had been lodging with her. The woman was a stranger to her, and she took a furnished apartment in the house about three weeks ago. She was then enceinte, and witness spoke to her on the subject, but she informed her that her confinement would not take place until October, and she only wanted the room for a week. She described herself as a married woman, and gave her name as Houseliff. She said that her husband had gone to Glasgow in search of business, and on Monday week she left at an early hour in the morning, saying she was going to see her cousin at Greenwich. She locked her door and took the key away with her, saying she would return on Wednesday, but she never saw her again. The room door was forced open by the police after the discovery of the child's body, and the carpet was then found stained through with blood, and a sheet had been torn up, and portions burnt. The woman appeared to be between thirty-two and thirty-five years of age.\n\nThe police stated that up to the present time the woman had eluded their vigilance, although a strict search was being made for her.\n\nThe jury recorded a verdict of wilful murder against some person unknown.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206206321.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 639, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2678, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]