[{"id": "3ae02cdb29d99bcccf50def69ad62ff226c975e5", "text": "EXTRAORDINARY CONDUCT OF BURGLARS.\n\nAt the Westminster Police-court the police preferred fresh charges against Henry Fisher, thirty-two, alias Leonard, well-known at Charlton, Kent, who possessed cards, on which he designated himself \"author and comedian,\" and Walter Kavanagh, alias John Smith, a well-dressed youth of eighteen, who have both hitherto been remanded by Mr. Sheil on charges of burglary and the possession of burglarious implements at Belgravia. Besides the housebreaking offences in different parts of the metropolis, Inspector Bannister, S Division, preferred a charge against the prisoners for maliciously damaging three pictures by an old master, value £400, at the residence of Mr. Walter Gilbey, Cambridge House, Regent's Park, which was burglariously entered on the night of the 30th of August last. Mr. George Wallis appeared for the prisoners, who have already been committed on charges of committing burglaries in Belgravia, where property of considerable value was stolen. It will be recollected that at the time of their arrest they were concealed in a game larder at the residence of Mrs. Bromley-Davenport in Belgravia-place, and that they had in their possession a complete assortment of burglars' tools and requisites. Some hours later the discovery was made that the place had been ransacked by burglars, who had refreshed themselves with cold meat and bottled beer. They took away some money, silver spoons, and other property, and then made their way to the back premises, which abut on Cambridge House, the residence of Mr. Walter Gilbey. By scaling a wall some 10ft. high access was obtained to the back garden of the mansion and an entry effected through a window, the catch and bars of which had been forced. The burglars broke open boxes and rooms and carried off a considerable booty, which included a nickel cigarette case from a chimney-piece in a footman's room. Before leaving by the front door the thieves cut out the horses' heads from three pictures (worth at the very least £200) which were hanging in the hall. There had been no attempt to cut the canvases from their frames, but the damage done was wanton and complete. Reference was made to it on a paper—the back of a picture removed from the lavatory—on which was written, with language unfit for publication, \"We have cut the horses' heads off the same as we should have cut your — head off if we had met you. Think yourself lucky we did not see you. We will visit you again when you have something more to lose. Unfortunately we were a bit late at starting, or we should have opened your — iron door. Goodbye for the present. From your beloved friend, Charles Peace.\" Detective-inspector Bannister, S Division, said that the paper was undoubtedly in the same handwriting as the one found at a house in Eaton-square. There the burglar's missive ran, \"Thanks, boss, for what we have got, &c.\" The witness gave evidence of jemmy marks corresponding with one of the jemmies found with the prisoners, and produced a pocket-handkerchief which was stolen from 47, Albany-street, and accidentally dropped in Cambridge House. Constable Snow, 27 E., deposed that the nickel cigarette case, identified by Mr. Gilbey's servant, was in the prisoner Leonard's pocket at the time witness arrested him for the burglary at Mrs. Bromley-Davenport's. Detective-sergeant Jones produced some identified stolen property, cutlery, and an ivory-backed hairbrush, which he found at Leonard's lodgings at 43, Huntingdon-street, Kingsland-road. Detective-inspector Stroud proved that Leonard was convicted in May, 1882; for a burglary in the Albany, and that he had also been convicted at Portsmouth. Mr. Wallis remarked that with regard to some of the charges there was no evidence against the prisoner who called himself Smith. Mr. Sheil: Both of them will be committed for trial to the Old Bailey on all the charges which have been investigated.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810915.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 904, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3927, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]