[{"id": "d667d917cbd4d019e7722d7d66548db9135feaae", "text": "LAW INTELLIGENCE.\n\nCOURT OF QUEEN'S BENCH.\n\nMusical Copyright.—Boosey v. Davison.—This was an action (before the court on Tuesday) involving a question of copyright of some airs in Bellini's beautiful opera, \"La Sonnambula.\" The action was tried before Mr. Justice Erle, at Guildhall. The declaration set forth, that the plaintiff was the purchaser of the copyright in question, and that the defendant committed an act of piracy in publishing it. The defendant pleaded, 1st, not guilty; 2ndly, that the plaintiff was not the owner of the copyright; and lastly, that the musical composition was not first published in England. It appeared on the trial that the opera was first published at Milan, on the 19th of February, 1821, where Bellini, the composer, entered into an agreement with Sig. Ricordi, a musical publisher, selling to him the copyright in some of the airs. The contract set forth that Ricordi was to have the full right of property for sale, &c., in the said opera. Signor Ricordi, thus possessed of the copyright, brought the opera to England in June of the same year, and sold the English copyright to the plaintiff. The music was duly entered at Stationers' Hall. The defendant subsequently published some of the airs, and plaintiff brought the action in question against him for the alleged piracy, and obtained a verdict. A rule was since obtained to set aside the verdict, and for a new trial, on the ground of rejection of evidence tendered by the defendant in support of the plea denying that the music was first published in England, and also on the ground that a foreigner could not have any power to transfer copyright in England in respect to a work which had been previously published abroad. The case came on, on Tuesday, for argument.—Mr. Sergeant Byles, Mr. Boville, and Mr. Heniker showed cause against the rule; Mr. Sergeant Shee and Mr. Crompton appeared in support of it.—The court took time to consider.\n\nBAIL-COURT.\n\nThe alleged Robbery of Bank Notes.—On Tuesday, Mr. Ballantine applied to admit a person of the name of Abraham Simmonds, now a prisoner in Newgate, to bail. The party on whose behalf he made the application was a publican carrying on business in the Blackfriars-road, and he had been brought up before the Lord Mayor, charged with having stolen two bank notes. It appeared that some few years ago a Mr. Blakemore, M.P., having received a large amount of money, from the banking-house of Masterman and Co., had afterwards either dropped or had taken from him three bank-notes, amounting to £3,000; one of the notes had been traced, but nothing was heard of the other two until lately, when they were presented at the London and Westminster Bank, who sent them on to the Bank of England, and they were then traced to Mr. Simmonds. The prisoner was able to offer four most substantial persons as bail to any amount.—Mr. Bodkin, who appeared for the prosecution, said that when the case was before the Lord Mayor, his lordship refused to admit the prisoner to bail. On that occasion he neither supported nor opposed the application which his learned friend (Mr. Ballantine) made. As to the bail being substantial, his clients had inquired as to two of them, and one was found to be anything but substantial.—His lordship said he would look over the affidavits before he decided.—On Wednesday, Justice Wyghtman said that, after reading the affidavits, he was disposed to admit the prisoner to bail. He must be bound himself in £2,000 and four sureties in £150 each.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206192201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 836, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3514, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]