[{"id": "af4a53e1be8cefe8e381a2b1b48497041cab21df", "text": "THE EXTRAORDINARY TRAGEDY AT BRIXTON.\n\nAt the Lambeth Police-court, Frederick James Chapman, twenty-eight, ironmonger's assistant, appeared on remand to answer a charge of wilfully murdering his child, Alfred Fred Chapman. Mr. Frayling prosecuted on behalf of the Treasury and Mr. Searle defended. The accused appeared to be in a dejected state of mind, and had considerable difficulty in subduing his emotion. Inspector Sewell deposed to the prisoner surrendering at Brixton Police-station. When witness heard the nature of the charge he duly cautioned the prisoner, who stated that he had drowned his child. His wife had confessed to him that she had been intimate with his brother against her will. The prisoner then added that when he heard her confession he took the infant, which was only five days old, and drowned it in a pail of water. His brother was a sergeant in a regiment stationed at Hartlepool. Mrs. Crapper said she was the mother of the prisoner's wife. The couple had resided for about nine months at 47, Vassall-road, where they rented two rooms. On January 26th witness, who lived near the Waterloo-road, received a telegram from the prisoner asking her to come over at once. When she arrived at Brixton he told her that he had murdered the child. The wife was then in bed, and crying very much. The husband said he was afraid the baby would be blind, and so had drowned it in the pail. He also stated that his wife had visited Hartlepool, and that his brother had taken liberties with her while there. Miss Shalders (student at the Clapham Maternity Institute) deposed to having attended Mrs. Chapman. On January 24th witness's attention was called to the child's left eye, which was inflamed and swollen. This was reported to Dr. Pearce, who prescribed a lotion. On the 26th witness again called, and found Mrs. Chapman and her mother crying bitterly. In the prisoner's presence the former said accused had murdered the child, and the man made no reply. The wife complained of the brother's conduct, and said the prisoner had contracted an illness in consequence. Dr. Sutton said he had examined the child a few hours after the death, which was undoubtedly due to asphyxia, probably brought about by drowning. Replying to Mr. Searle, witness said there were no specific symptoms of drowning, but he could not say that the death was attributable to shock caused by momentarily dipping the child in the water. The prisoner was then committed for trial. In reply to the usual caution, he stated that he would reserve his defence.\n\nOn Thursday Mr. G. P. Wyatt, coroner, resumed his inquiry, at St. John's Parochial Hall, Brixton, respecting the death of Alfred Fred Chapman, aged five days, the son of Frederick James Chapman, an ironmonger's assistant, lately residing at 47, Vassall-road, Brixton, who stands remanded from the Lambeth Police-court on the charge of murdering deceased by drowning him in a pail of water on the 26th ult. Lavinia Ann Chapman, the wife of the accused, having been cautioned by the coroner, gave evidence in accordance with the facts already published. After a lengthy deliberation the jury returned a verdict of wilful murder against the father, Frederick James Chapman, who in their opinion was strongly provoked to commit the rash act.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811327.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 765, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3288, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]