[{"id": "1b032ac289763f7486e002e3856f354ff509ae23", "text": "ROBBERIES BY AN APPRENTICE.\n\nOn Friday, Joseph Harris, about eighteen years of age, was brought up at Worship-street police-court, on five separate charges of robbery.\n\nMr. Romaine, a jeweller, in business at No. 19, Sandy's-row, Bishopsgate, said: The prisoner came into my shop on the 27th of last month with a saddle on his shoulder, and asked to look at a gold pin. I sold him one for 6s., and while purchasing it a tray of gold watches was lying open on the counter in front of me. I missed one on Saturday last while taking stock. He had asked for an Albert chain. The watch produced is mine—value 6l.\n\nMr. Samuel Harris, also a jeweller in Sand's-row: On the 7th inst. the prisoner came and asked to look at a gold pin. He did not purchase, and immediately he left I missed a gold watch and two gold chains, value in all 13l. They are produced.\n\nMr. Lewis Phillips, jeweller, 75, Church-lane, Whitechapel: On the 30th of October last the prisoner asked me across the counter to be shown some gold Albert chains, and afterwards other articles. He left without buying, and directly he had gone, I missed a gold chain, with locket attached, value 2l.\n\nJohn Kelly, assistant to a watchmaker, at 24, Bell-alley, London-wall: I think it was on the 30th of August last, that the prisoner asked me at my master's shop to let him see some Albert chains, as he wished to make a present of one to his brother. There was not, he said, anything that suited him, and ten minutes after he had left I missed a silver watch worth 5l.\n\nIsrael Rosen: I am a watchmaker in Whitechapel. On the 3rd inst. prisoner asked me for a gold Albert chain to purchase. He did not buy, and three minutes after he had gone I missed a gold watch worth 8l. 10s. I gave that for it. Two weeks ago he came and took away a silver watch, I suppose, for I could not find it after he went.\n\nSerjeant Kenwood, 16 H, proved finding in the prisoner's box, in his bed-room at the house of his master, who is a saddler in Union-street, Spitalfields, a quantity of the stolen property, and a number of duplicates.\n\nSome of the property pledged at Mr. Collins's, of 90, Shoreditch, was produced, but a pawnbroker named Grant did not attend, although the officer had given him notice to do so, and the prisoner, who merely said in answer to the charge, \"All they say is true,\" was remanded for the valuables to be brought forward.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206223813.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 646, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2388, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]