[{"id": "b8ee09564b477b22598231c25601f756a5ab02fc", "text": "EXTRAORDINARY TRIAL FOR MURDER.\n\nAt the Monmouth assizes, on Thursday, James Henry Gibbs, a native of Richmond, was charged with the wilful murder of his wife, Mary Ann Gibbs, at St. Melons, Cardiff, in May last. From the opening statement of Mr. Brown it appeared that the prisoner and the deceased (whose maiden name was Ingram) were in service together in 1871, and when prisoner removed to Llanrumney hall the acquaintance was renewed. On 30th January last they were married at St. Heliers, Jersey. While at Llanrumney, however, prisoner had formed an intimacy with Miss Mary Jones, and while on his way to be married he wrote to her in most endearing terms. Deceased returned with the prisoner, who took apartments for her at Cardiff. He endeavoured to hide the fact of his marriage from Miss Jones, while to his wife he denied any intimacy with the latter. On the 12th May prisoner met his wife by appointment, and this was the last time she was seen alive. On the 3rd June her body was found in a ditch in an advanced stage of decomposition. Circumstances came to light which implicated prisoner as the murderer, and he was apprehended. He said nothing in answer to the charge, but his conduct strongly indicated mental torture, and the fact of his washing stained clothes in benzoline, and his conduct after his wife's death, corroborated the suspicions already entertained. The case for the prosecution was not closed when the Court rose.\n\nOn Friday an umbrella, which had been found in the prisoner's pantry, was identified by a niece of the deceased as one that she had sold to her. Medical evidence was also given from which it appeared that the body at the time it was found had been saturated with blood, and that the bones of the neck had been severed by decomposition. The doctor gave it as his opinion that death had resulted from hemorrhage, produced by the throat having been cut, saying that in no other way could he account for the excessive flow of blood, though he admitted in cross-examination that aneurism of a large artery would produce great bleeding.—A Mr. Loughe was then called, and he proved that he had subjected the clothes of the prisoner to a severe chemical analysis, and that by that means and the aid of a microscope he had discovered stains on the coat, which bore distinct traces of blood, and which had evidently been the subject of much washing. There were a good many other stains, with regard to which he could not speak positively. This finished the case for the prosecution. As its conclusion Mr. Brown shortly summed up the facts, and Mr. Sawyer then addressed the jury on behalf of the prisoner.—The jury, after 20 minutes' deliberation, returned a verdict of \"Guilty.\"—His lordship then passed sentence of death in the usual form, adding that he could hold out no hope of mercy, and the prisoner was then removed, sobbing bitterly.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206321492.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 657, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2881, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]