[{"id": "8d0339557fe79688ba7026dfcb88a7b766c76a33", "text": "THE MURDER AT MILE-END.\n\nLast Monday morning the neighbours of John Blair, a journeyman bricklayer, living in Joseph-street, Burdett-road, Mile-end Old-town, observed that the blinds of his house remained down, long after the hour at which they were usually raised. A child, who had been the playmate of Blair's daughter Amelia, was greatly concerned at this, for Amelia had told her of the dreadful threats in which her father indulged. It would seem that round about Blair's house people had misgivings. They appeared to have been prepared by the violence of his conduct and language for a catastrophe. He had given way to drink: he had been suspended from his work at the Bow-common gas works. He had suffered from delirium tremens, and in his excited moments he had been heard to declare that he would murder his family and destroy himself.\n\nBlair was seen to fetch some beer on Sunday evening; and from that time nothing had been heard of him or the family. When the police, at the instigation of the neighbours, broke into the house on Monday morning, they found that the mad drunkard had carried out his awful threats to the letter. His wife lay dead in the front room with her baby in her arms. On the floor by the bed lay Blair's body. In the back room were the bodies of the three remaining children. All, with their throats cut! According to the medical testimony the woman and her children had all been murdered in their sleep; and then the murderer had destroyed himself. Neighbours' testimony goes to show that Blair, when calm and rational, and free from the influence of drink, was an affectionate husband and father. He had a comfortable home. He was, for his rank, fairly prosperous. His suspension from work was, it is believed, caused by his intemperance. Had Blair not given way to the most terrible vice which affects the working classes; which wrecks fair homes, fills prisons, and leads to the workhouse—he would have shrunk with horror and loathing even from the printed record of such a series of crimes as he, with his own drunkard's hand, committed.\n\nBlair's crimes suggest a return to a subject which has been left dormant for some time past. Should not men reduced to the insane condition in which he was, by alcoholic poisoning, be placed under restraint? When a man has become known in his neighbourhood as an habitual drunkard, in whose brain homicidal ideas are working; when he has ceased to have any restraint over himself; when drink has become an unappeasable craving within him; surely the time has come to protect both himself and those who are dependent upon him! Had Blair been put under restraint in time, the probability is that he would have reformed.\n\nBut how is the dipsomania to be handled? When does the danger begin? To whom shall be entrusted the power of locking a man up for drunken habits dangerous to himself and his neighbours? We freely confess that the question is surrounded by difficulties; but it is not the less important on this account. It is a tangled subject which presses for immediate solution, in a society like ours, where half the crime and half the poverty of the land are directly traceable to drunkenness.\n\nIn Blair's case we have evidence that his poor children went to bed at night dreading lest their father should carry out upon them the threats which he was wont to mutter in his cups. The children next door were half prepared to find their playmates murdered any morning. From these indications of the impression the drunkard had produced around him, we may imagine the life his wife must have led, and the long sad hours which preceded the final catastrophe.\n\nThere are scores of men under the control of keepers who are not half so mad as Blair appears to have been for many days before he raised his homicidal hand against his own flesh and blood.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206321007.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 556, "total-output-tokens": 835, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3831, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]