[{"id": "28e7f4df96ef46cb345c15a81185f48bd6697fd6", "text": "CROYDON PETTY SESSIONS.\n\nCommittal for Horse Stealing.—Edward Warne, stableman, of Surrey-street, Croydon, was charged on remand with stealing from Big Boke farm, Coulson, a chestnut galding, value 50l., the property of Mary Ann Sedgwick, of the Watterd brewery. It appeared that the horse had been put out to grass and to rest, and on the afternoon of Whit Monday the prisoner was seen riding the animal at a furious pace towards Croydon. He was pursued for a considerable distance, and was showing the horse to some gipsies when the prosecutrix's manager drove up and gave him into custody. When asked to account for his possession of the animal the prisoner said that his \"governor\" had instructed him to take it out for exercise, adding that he had no intention of stealing it. He now informed the Bench that the horse was old and worn out, and not worth more than 20l. He was guilty of taking it, but it was all through the drink.—Sir Thomas Edridge fully committed the prisoner for trial at the Surrey sessions.\n\nConfession of Murder at Croydon.—At a late hour on Friday night a mulatto entered the Croydon police-court and told the sergeant on duty that he wished to give himself up for causing the death of two men by shooting them, and murderously assaulting another by striking him with an earthenware vessel. As his manner seemed strange the officer detained him in the library and telegraphed his description to all the metropolitan police-stations, with the result that at an early hour yesterday morning a message was received from Rochester, Westminster, stating that the man was \"wanted\" there on a charge of violently assaulting a person in the manner described, and the prisoner was subsequently conveyed to London.—The police regard the self-accusation of murder as a delusion.\n\nHUSBANDS AND WIVES.\n\nWilliam John Thompson, aged 41, a labourer, of Queen's-square, Holloway, was charged on a warrant, at North London police-court, yesterday, with using threats towards his wife, Sarah Thompson.—Prosecutrix, a respectable-looking woman, said the prisoner behaved towards her in a most violent manner, and had done so ever since they had been married. In 1839 he attempted to murder her by cutting her throat, and for that he was sentenced at the sessions to 12 months' hard labour. She met him as he left the gaol, and took him home, but he broke out again and was sentenced to a month's imprisonment for assaulting her. When that sentence had expired they lived together again, but he had frequently threatened her, and she was now thoroughly afraid of him. She did not want to hurt the prisoner; she wanted protection.—Mr. Corser called upon the prisoner to find a security in 20l. to keep the peace for six months; or three months' imprisonment in default.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206276277.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 652, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2776, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]