[{"id": "c18fbb63bfc534ee6d57857512beb056dd187242", "text": "ALLEGED MURDER AT WESTMINSTER.\n\nAt the Westminster Police-court, before Mr. De Rutzen, Henry George Whittenbury, landlord of The Duke of Clarence, Horseferry-road, Westminster, was placed in the dock to answer a charge taken on the morning of the 11th ult. of attempting to murder George Matthews, a potman, by cutting his throat. The injured man died on Sunday night in the hospital, but the form of the charge remained unaltered, in the absence of any testimony as to how far the injury—not in itself mortal—was responsible for death.\n\nMr. Duerdin Dutton appeared for the accused—a comparatively young man—who was brought from the workhouse infirmary looking very ill. He shook violently in the dock, though seated during the brief examination.\n\nIt was stated last week that the accused was seized with delirium tremens. At any rate, his brother, who is a licensed victualler, deputed his own potman, the deceased, to go and look after matters at Horseferry-road. Everything went on quietly till after the house was closed last Wednesday night. At that time the accused was in his own apartment passive enough. Matthews went to bed in a communicating room, and he has since stated that at two o'clock he awoke to find the prisoner, with a horrible glare in his eyes, attempting to cut his throat. A desperate struggle took place, in the course of which Matthews had his throat cut.\n\nInspector Watson, A Division, deposed: About ten minutes past two on the morning of the 11th ult. I was in charge of the Rochester-row, Westminster, police-station. The prisoner was brought in by two constables, who made statements. The prisoner said, \"Inspector, note this—I was going to bed, and I saw the curtains move and a man in the bedroom. I made for him with this razor (producing the weapon from his trousers pocket) and I cut his—head off.\" The razor was stained with blood. Shortly afterwards the injured man was brought to the station by Police-constable Samuels. Matthews had his neck bandaged up, and, pointing to the prisoner, he said, \"That man has cut my throat. It is not very much, and I shall not charge him.\" Whilst the charge was being entered Matthews again said that he did not wish to prefer it. The injured man was removed to the West London Hospital, and he died there last Sunday night.\n\nMr. Dutton: Since the 11th has the accused been very ill?\n\nWitness: Yes; he has been in the infirmary.\n\nMr. Dutton: And this morning, whilst waiting to be brought before the magistrate, has he had a fit?\n\nThe Witness: He has.\n\nMr. Dutton: And has it come to your knowledge that previous to the morning on which this shocking occurrence took place he has had several epileptic fits?\n\nThe Inspector: I have not been told so, and I have no knowledge that such is the case.\n\nMr. Dutton said that of course he could urge nothing against a remark. It had been stated that the accused was suffering from delirium tremens through drink, but he (Mr. Dutton) was instructed that his ailment was epilepsy. It would be proved by medical evidence that prisoner had had a succession of severe epileptic fits.\n\nThe prisoner was remanded till after the inquest, and on account of his condition was taken to Holloway Prison in a cab.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810738.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 757, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3218, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]