[{"id": "fba3f7b958f6cc4ce77684f143fa12c333340bfe", "text": "THE CHARGES AGAINST A SURGEON AND ACCOUCHEUSE.\n\nAt Marylebone police-court on Wednesday, William Turnbull, M.R.C.S., and Mary Nottage, an accoucheuse, both of 146, Hampstead-road, were brought up by Detective-inspector Banister, S division, charged with having caused the death of Charlotte Louise Clifford, a young woman, aged 18, by an alleged illegal operation on or about the 20th November.\n\nMr Batchelor, from the office of the Public prosecutor, stated that the case was adjourned from a fortnight ago for the attendance of an important witness, Mrs Burton. Since then, however, she too had died, and they would hear from witnesses that her death was the result of an alleged operation.\n\nThe facts of the two cases were very much interwoven, and he proposed to recall the witnesses. About the end of October Miss Clifford called on Mrs Burton, and they went out together. Dr. Weather's would state that two women called on him at his house, which was next door but one to that of the prisoners. In consequence of what they said he did not advise or prescribe for them. Afterwards he saw the body of Mrs Burton at the mortuary, and to the best of his belief she was the same person who called on him. On the 31st of October Mrs Burton went out to make some purchases, and was brought home by a friend suffering from what was thought to be cramp in the stomach. She was put to bed, and never got up again. Dr. Turnbull attended Mrs Burton up to the time of his arrest, and the medical man called to attend her afterwards found that she was in a serious condition. A post-mortem examination of the body of Mrs Burton had taken place, and the conclusion arrived at by the doctors was that an operation had taken place, and that the cause of death was peritonitis following the operation.\n\nMr George Weathers, surgeon, of 144, Hampstead-road, said that on or about the 29th or 30th October two women called on him, and he had some conversation with one of them. He only saw one to speak to, and she would be about a little over 30 years of age. The other woman was younger. He neither prescribed for nor advised them; and they left. He afterwards saw Mrs Burton in the St Pancras mortuary, and to the best of his belief it was she who called on him at his surgery.\n\nCross-examined: He had never seen the women before they called on him, and he only saw them for a few minutes. He was unable to describe the younger woman.\n\nWilliam Thomas Nichols Burton, of 6, Churchill-road, Dartmouth-park, said his wife's name was Mary Ann, and her age was 35 the 15th of last March. He knew the deceased Clifford by the name of Louie. About the 28th or 29th of October she called at his house in the evening, and she and witness's wife went out together and remained out for two hours, his wife returning alone. On the Saturday following his wife went out about seven o'clock in the evening, taking with her, to his knowledge, about 7s. She returned about 11 o'clock, accompanied by Mr Reardon.\n\nMr Batchelor was proceeding to question the witness as to the condition of his wife when she returned, when Mr Besley strenuously objected to evidence relating to Mrs Burton being introduced into the case. A discussion on the point took place between the learned gentlemen, and in the end Mr De Rutzen ruled that no further evidence than the fact that Mrs Burton went out with Miss Clifford on a certain night, could be imported into the case.\n\nDr Pepper was recalled, and gave the result of his examination of certain stains found on various articles in the prisoners' house.\n\nThe prisoners, who elected to reserve their defence, were then committed for trial.—On the application of Mr Besley, Mr De Rutzen consented to admit Mrs Nottage to bail in two sureties of £500 each.\n\nMr Batchelor then proceeded to call evidence on the second charge against Dr. Turnbull—viz., for causing the death of Mrs Burton.\n\nDr Reyner, of 138, Camden-road, said that on the 20th of November he was called to see the deceased, and attended her until her death. In his opinion the cause of death was pyemia, consequent on a recent operation.\n\nMr De Rutzen again remanded the case.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206260932.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 987, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4146, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]