[{"id": "a702c9c9479f7e2aed8b69ccad628913ee3e1f22", "text": "OXFORD CIRCUIT.—ABINGDON, FEB. 27.\n\nHIGHWAY ROBBERY.—J. Hargrave was charged with assaulting on the highway W. Musson, with intent to rob him, on the night of the 18th of August last. The prosecutor, who is a farmer, stated that on returning from Abingdon on the night in question, about a quarter before nine, he passed the prisoner. After having passed him a few yards the prisoner came up to him, struck him on the head with a stick, and demanded his money. He refused to give it to him, and said he would fight for it, upon which they had an encounter, the prisoner striking at him, while he parried the blows with an umbrella which he had. In the struggle he dropped his basket, which the prisoner ran away with. Two days after the prisoner was taken into custody at Abingdon, on a charge of attempting to rob the till of Mr. Smith, chemist, whose son caught him in the act. The prisoner having shrewdly cross-examined the witnesses, without shaking their evidence, the judge summed up, and the jury returned a verdict of \"Guilty.\" The judge, in passing sentence, told the prisoner that he was too clever and too desperate a character to remain in this country, and adjudged him to be transported for ten years.\n\nCASE OF MANSLAUGHTER.—Charles Giles, John Briant, and Edw. Cope, were charged with the manslaughter of Charles Gilham, on the 27th of December last, in the parish of Shinfield. From the evidence it appeared that on the day in question the prisoner Giles had a slight disagreement with the deceased, Charles Gilham, who would settle it in no other way except by a fight, which it was agreed should take place at their dinner hour. At that time they proceeded to a field, and the fight commenced, in which the prisoner Giles had the best of the rounds, but would willingly have ceased fighting, but Gilham expressed his determination to fight like a cock and not give up. In the last round the deceased had scarcely strength to stand up, but would not give in; he was, however, carried off the ground, and in about forty-eight hours after he died, and on a post-mortem examination being made by a medical gentleman, a wound was found on the left side of the skull, which, in his opinion, was the cause of death, and was produced by external violence. The prisoners Briant and Cope acted as seconds. It was contended by Mr. Pigot, on the part of Giles, that he was provoked and obliged to fight, that he wished to leave off, and the fight was a fair stand-up fight. Mr. Carrington, on the part of Briant and Cope, maintained that they took no part in the fight until after it had commenced. The jury \"Acquitted\" all the prisoners.\n\nHOME CIRCUIT—HERTFORD, FEB. 28.\n\nBURGLARY.—James Rackley, twenty-three, Daniel Brown, twenty-two, and Alfred Lunnon, twenty-three, were indicted for burglary at the dwelling-house of Mary Stacey, and stealing a £5 note and other monies, her property.—It appeared that the whole number of persons who entered the house was six, and that three of them were armed with sticks, and the fourth had the bar which had fastened the window before it was forced open. The prosecutrix swore positively to the identity of Brown and Lunnon, although their faces were blackened; and as regarded the prisoner Rackley, it was shown that his shoes corresponded with footsteps that were under the window; and it was also proved that, on the morning after the burglary, he was seen in company with the other two prisoners at a beer-shop, and that they all three washed their faces, which appeared to have been blackened with soot.—The jury found all the prisoners \"Guilty,\" and they were sentenced to be transported for fourteen years.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206192813.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 878, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3663, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]