[{"id": "b3eddd64a025f43f28df268d855167e7380887ef", "text": "A CHILD STARVED TO DEATH.\n\nOn Wednesday, Mary Ann Hope, an emaciated little woman of thirty, of dissipated appearance, was charged at Worship-street, with causing the death of her female child, about two years of age.\n\nHopper, a constable of the N division, stated: I was on duty at ten last night in Somerset-place, Hoxton, when I heard a cry of \"Oh, my God, my child is dead;\" I turned round and found there the prisoner with a child in her arms, and she repeated about her child being dead. I took the child from, leaving her standing near me, drunk. She said, \"Give me my child,\" but, as I saw that it was dead, I refused to do so, and took it to the house of Mr. Coward, the divisional surgeon, the prisoner following me. The surgeon pronounced the child to be dead, and I therefore took the body to the workhouse and lodged the prisoner in Robert-street station. I afterwards went to her lodging, in Burrell's-buildings, Kingsland, and found it to be a back room on the top floor. It was in a most filthy state, had no furniture at all in it but part of an old mattress, and stank shockingly. A lodger in the house told me the prisoner was in the habit of coming home intoxicated with the child at all hours of the night, that this was the only child she had, and that her husband is a sailor, whose pay she was receiving.—Prisoner: That's false; I don't receive his money.\n\nMr. Corrie: What appearance did the child present?—Hopper: Well, sir, it looked as though it had been starved.\n\nJane Mason, a married woman, said,—About the time referred to I saw the prisoner at a brewery tap. She had the child with her, and was singing and dancing about. I spoke to her about her child, and she said, \"I think it is dying.\"—Mr. Corrie: A kind of convulsion, I suppose?—Witness: No, sir; it seemed to die quiet and happy. I put its jaw up and closed its eyes, and then the policeman came.\n\nMr. Ross, relieving officer of Shoreditch: I have frequently, sir, seen the prisoner drunk about Shoreditch. Last week she made application to us, and received 3s. 6d. and three loaves. On Monday last an officer brought her to us from the police-station. The child was then with her, and was evidently ill. We offered her an admission to the house at once, but she refused it, saying she could earn enough to keep her out of the house, and, as we could not make a prisoner of her, she left, with some further assistance. I have known her altogether, perhaps, a twelvemonth.\n\nSergeant Townshend: On that day she was brought to me by a constable, who said that the people about her home asserted that the child was starving. I saw the child myself, and it looked as though it was starving. I therefore sent her to the workhouse in company of a constable.\n\nMr. Corrie (to the prisoner): There is no doubt that you have been the cause of this poor child's death, and though, perhaps, you may not be criminally responsible for it, you are yet morally so, for you have been in the practice of drinking and being in the streets with it at all hours, when you and it might have been in the workhouse. (To the officer): I think you had better take her to the workhouse for the present, as an inquest will no doubt be held upon the body, and there may then, perhaps, be further evidence.—Mr. Ross: I am quite willing, sir, to act in any manner you may desire.\n\nThe prisoner, who did not appear at all ashamed of herself, was thereupon taken away by the officer.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206316965.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 869, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3440, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]