[{"id": "c400bea6d80a206976ac4d2893f6f102e4e83586", "text": "THE GREAT SEIZURE OF ARMS.\n\nAt Bow-street, on Monday, Thomas Walsh was brought up for final examination on the charge of treason-felony.—Henry Johnson, licensed carman, of 9, Milk-street, Cheapside, stated that he knew the prisoner by the name of Walsh since August, 1879, to February, 1882, during which time he had been in the habit of hiring witness's vans. (A list of the carmen accompanying the vans was produced.) In February, 1880, prisoner hired a loft in some stables belonging to witness at 18 Wharf, Macclesfield-street, City-road. On one occasion witness saw him engaged in \"tinkering up\" some old guns.—John Dean, who was formerly employed at Messrs. Goedecke's, of Jewin-crescent, City, and knew the prisoner by the name of Walsh, deposed to the purchase of several rifles and revolvers from the firm by the prisoner.—Edward Beard, chief armorer at the Tower of London, said the rifles seized were old Enfield rifles converted into Sniders. They were not of Government make, and the marks of the Crown and the word Tower were imitations. There were 30 Colt's revolvers, 27 being breechloaders. The rifles referred to in evidence and brought by the police from Ireland were of the same description as those deposited at the Tower.—Mr. Abrahams then addressed the magistrate on behalf of the defendant, submitting that no evidence had been adduced bearing upon the charge of treason-felony. He felt strongly the task he had before him in asking for the prisoner's discharge, but he contended that he could not be held as the charge was now framed. The prisoner must be shown to have taken part in a treasonable conspiracy of confederation against the Queen or the Government before his committal on the present charge could be justified. The arms were not sent over to Ireland with any treasonable object, and no evidence had been brought by the prosecution to show that such was the case.—Sir James Ingham committed the prisoner for trial.\n\nIt is stated that a curious circumstance in connection with the prisoner Walsh, who is now at the House of Detention, Clerkenwell, awaiting his trial on a charge of treason-felony, has just come to light. When his linen was sent into the gaol on Wednesday, the authorities discovered a stone-coloured india-rubber ball with his name on it carefully concealed in the bundle. Taken by itself, this, it is added, would not be considered a very important thing, but when it is remembered that immediately before the walls of the House of Detention were blown down in 1867, a similar ball was thrown over as a signal, the authorities have felt themselves justified, in case of any surprise being attempted, in doubling the guard outside the prison.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206252771.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 642, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2697, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]