[{"id": "5e3e5a2683b0ee862b8a1ac70604d4a6c128f5df", "text": "GREAT FIRE IN THE HAMPSTEAD-ROAD.\n\nThe most extensive fire that has occurred for a considerable time past in the neighbourhood of the Hampstead-road, happened on Friday night between ten and eleven o'clock, and was not subdued until an early hour this (Saturday) morning. The premises in which the misfortune commenced were tenanted by several persons, including Mr. Marshall, Mr. John M'Alpine, a coach painter; Mr. Fowler, an organ-barrel maker; Mr. Maddam, a polisher; and two or three others. This property stood at the rear of the houses in Henry-street, and was flanked by a row of cottages let out to poor families, and in the course of a very few minutes a fearful scene presented itself, for the flames seized upon various houses not only in Marshall's-yard, but also several at the rear.\n\nAt that moment a shower of snow was falling, and myriads of sparks were flying over sundry houses near, the effect of which was such that thousands of spectators were drawn to the spot, and had it not been for the opportune arrival of Mr. Superintendent Lockley, with a powerful body of constables, the firemen would have been unable to get near the scene of conflagration. As it was, in forcing back the crowd in the Hampstead-road, the shop-front of one of the houses was forced completely in, the noise of the falling shutters making the lookers-on rush into the road the best way they could. Engines of the London brigade — from Chandos-street, Farringdon-street, Watling-street, King-street, Golden-square — that of the railway company, and some three or four others that were at a fire in Princess-street, Drury-lane (which burnt the top floor of No. 6, let out in tenements), were also quickly in attendance. Copious streams of water were distributed upon the burning property; but for a long time not the least impression could be made upon the fury of the destructive element, and building after building kept falling a prey to the flames. The firemen, under Mr. Stapley, the foreman of the district, kept to their work in their usual intrepid manner, and by one o'clock this morning, or a little after, the flames began to succumb and palpably diminish, but they were even then far from being entirely extinguished.\n\nThe total loss must be considerable, for it is stated that one manufacturer alone had had thirty-five carriages destroyed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206210050.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 555, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2348, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]