[{"id": "530b4b71b9b811653699cf266d9a099cbd5439c3", "text": "THE DAGENHAM MURDER.\n\nIt has already been stated that the grand jury at the Chelmsford Assizes ignored the bill against George Blewett for the murder of Clark, the policeman, at Dagenham, in the year 1846, the learned judge (Mr. Justice Willes), in his charge, having expressed a strong opinion that there was not sufficient corroboration of the evidence of the woman Page to render it probable that the petty jury would convict the prisoner if they should return a true bill. When the bill had been ignored, Mr. Sergeant Parry, who had been retained to defend the prisoner, applied to his lordship to make an order that he should be discharged, but Mr. Justice Willes declined to do so while the grand jury were sitting. Having shortly afterwards got through their business they were dismissed, and Sergeant Parry then renewed his application for the release of the prisoner. His lordship said that, now the grand jury were dismissed the prisoner might be discharged, and he at the same time said that he must state that it appeared to him that the magistrates of the petty sessions who had committed the prisoner for trial, had very properly performed their duty in so doing, and that as the case stood before them they had no alternative but to send the matter to be inquired into. The grand jury had then to exercise their discretion, and it appeared to him that upon the evidence laid before them, they had done quite right in ignoring the bill. The prisoner, George Blewitt, was shortly afterwards discharged from the gaol. There were some very extraordinary circumstances in connexion with the murder of the unfortunate policeman that will be interesting to be made public. It appears that on the night Clark lost his life the sergeant who had the charge of the beat where he was on duty, and who should have met him at certain spots during the night, had absented himself without leave, and when the murder was discovered and he was called upon to give evidence, he was placed in a very unpleasant position, and in order to clear himself he swore that he had met the deceased in the performance of his duty at a certain spot and at a particular hour, and he induced two other constables belonging to the division to come forward and give similar evidence. As the inquiry proceeded it became evident that these witnesses had spoken falsely, and at length one of them admitted that the statement he had made was false. The consequence of this was that a very strong impression was created in the minds of many persons that the unfortunate deceased had met his death at the hands of the sergeant, and this impression was strengthened to a certain extent by the fact, that upon inquiries being made, it turned out that Clark, who was a young man religiously inclined, had on several occasions accompanied the wife of the sergeant to chapel while the latter was on duty, and it was suggested that the murder was the result of jealousy. Nothing, however, transpired to justify any proceedings being taken upon this charge, and the sergeant and the two constables were committed to take their trials at the Chelmsford assizes upon a charge of wilful and corrupt perjury, and they were eventually convicted of that offence, and sentenced to seven years' transportation. Shortly after his conviction the sergeant went out of his mind, and has remained in that state ever since, and nothing more transpired relating to the murder until the woman Page made the statement which led to the committal of the prisoner Blewitt. It was the opinion of almost every one acquainted with the fact that, if the prisoner had been put upon his trial on the present occasion, he must have been acquitted, in which case he would have been altogether relieved from the charge, but by the course that has been taken, if any evidence should be obtained at a future time to confirm the evidence of the woman Page, it will still be competent to try him for the murder, so that it is not at all improbable that the interests of justice will still be vindicated in reference to this fearful crime.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3202426394.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 853, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4072, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]