[{"id": "ce24a0abe71a271c289ecb787236b2857d8b2f94", "text": "MURDER BY A FARMER.\n\nNot more than a quarter of a mile from the scene of the fatal railway accident which happened near Kirby station, on the Lancashire and Yorkshire railway, a frightful murder was committed, both melancholy occurrences being attributable, the former directly, the latter indirectly, to the excessive use of intoxicating liquors. On Thursday last, Henry Shacklady, labourer, was killed on the spot by his employer and brother-in-law, Henry Mercer, of Kirby, farmer, who struck him with a hay-fork three violent blows, the first on his shoulder, on receiving which the deceased fell to the ground, and while prostrate Mercer struck him twice on the head, and inflicted severe wounds each time. Immediate death was the result. Deceased was heard to sob twice, and then it was discovered that he was dead. An inquest was held on Saturday, on his body, before Mr. C. E. Driffield, at the house of Mrs. Ashcroft, Redbrow, Kirkby, at which the following witnesses were examined:—John Jonathan Southward, Martha Webster (the deceased's sister), and Thomas Colovin. Mr. Robert Woods, surgeon, who made a post mortem examination, and policeman 428, gave their evidence. John J. Southward deposed that he and the deceased were leaning on a gate. He saw Mercer go into a field and come out again, but he saw nothing in his hands. Did not see deceased go into the fold of Mr. Mercer at all. Saw Mercer make at deceased with the prong end of a fork. Never heard the deceased speak. Heard him sob once or twice.—Martha Webster was the next witness. She said: My brother was little more than twenty-nine years old, and unmarried. Worked for Mr. Mercer sometimes, who is my sister's husband. She has been recently confined, and I have been nursing her. I did not hear Mr. Mercer and my brother have any words. About half-past five o'clock I saw Mercer come in a hurry. He ran up the garner steps and got a fork out of the garner. I ran out of the house before he came out. He was then coming down the steps with the weapon in his hands. I heard my brother exclaim, \"Thou art not going to kill me, art thou?\" I called out to my brother to run, and he ran. Mercer followed him, and I called \"Stop.\" Mercer overtook my brother after he had run a short distance, knocked him down with the prong end of the fork, and as soon as he fell he struck him twice. The first time he struck him a very severe blow on the head. By the time he struck the third blow I got between them. He then threatened me; but I stepped to one side, and the third blow fell on my brother, who never stirred after he fell. The jury, after deliberating a quarter of an hour, returned a verdict of \"Wilful murder\" against Henry Mercer, who was committed to take his trial at the present assizes.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206308290.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 673, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2764, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]