[{"id": "24775222725d0498215388027c2980ffdd421b4e", "text": "A KING'S CROSS TRAGEDY.\n\nFATAL THRUST WITH AN UMBRELLA.\n\nDr. Danford Thomas held an inquest at St. Pancras coroner's court on Wednesday on the body of John Hackett Jones, aged 48, a carpenter, lately residing at 2, Sidmouth-street, Gray's-inn-road, for causing whose death another carpenter, named Edwin Jones, aged 38 years, had been arrested. The evidence of Jane Jones, the deceased's widow, was that five years ago she cohabited with the prisoner Jones, by whom she had two children. She left him there because of his violence and bad conduct, and went to Wales. At Cardiff recently she married the deceased, who had formerly worked with Edwin Jones as a shopmate, and they returned to London. While on the night of Friday, the 8th inst., the witness and her husband were walking along Euston-road at King's-cross, Edwin Jones (whom she had not seen since she left him five years before) suddenly accosted the deceased, called him a foul name, and plunged the end of his umbrella into his face and then decamped. Other evidence was that the deceased, whose eye was injured, was removed to the Royal Free hospital.—Dr. E. Trevithick, resident surgeon at this hospital, stated that the man sustained a punctured wound or fracture of the roof of the orbit of the eye, and injury to the brain, and died on Saturday.—The jury returned a verdict of \"Manslaughter\" against Edwin Jones.\n\nAt Clerkenwell police-court yesterday Edwin Jones, 38, a carpenter, of 223, Pentonville-road, was charged with the manslaughter of Hackett.—The evidence given at the inquest was repeated.—Jones, on being told of Hackett's death, said he was \"sorry to hear it,\" and denied that he intended to injure the deceased.—The prisoner was again remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206276250.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 448, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1729, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]