[{"id": "5a9c2c710bfa35dd9752f766d879178fd935efa5", "text": "A SUICIDE'S LETTER.\n\nA man named John James Norman should have surrendered to his bail at the Greenwich Police-court, on Monday, on a charge of assaulting a little girl. Last week, however, he committed suicide by hanging, and Mr. Holmes Moss (solicitor) read the following letter he had received from the accused:—“Point Hill House, July 9th, 1889. Dear Sir,—You need not trouble about my case. I am innocent of the charge I am accused of. The police can prosecute the body; they cannot follow the soul. I am not afraid to meet my God. Man is the greatest enemy man has got. If the police would try to prevent crime instead of laying traps to create it, there would not be one half the misery in the world there is. £ s. d. is the god of all classes, parsons not excepted. I am hunted down for trying to do good. My only object, motive, or intention on the 25th of June was to do the dear little children good. For me to come into court with only one witness when they have four, coached and trained for one week before they took action, and another week to complete it; had I the opportunity to go into the witness-box (my mouth is closed) I should not have taken the step I have. Hoping you will read this to the Court, and try to open the way to remove the great obstruction to justice by keeping a culprit's mouth closed in defence of his innocence, believe me, yours respectfully,—J. J. NORMAN. N.B.—If I have judged anyone wrongfully I hope they will forgive me. Mr. Moss, jun., New-cross.” Mr. Kennedy said it was a dreadful tragedy.\n\nMARGARET HUNTER, of 153, St. Pancras-road, threw her baby out of the second floor window, and then jumped out herself. They fell fifteen feet on to a cistern, and were neither severely injured. At Clerkenwell the woman was charged, and committed for trial.\n\nA young man named Frank Browning, aged twenty-one, of Queen's-road, Wickham-lane, near Plumstead, was sitting on a haycock in a field at Black Fen, between Bexley and Eltham, when he was struck in the face by some shots from a gun, some of the missiles entering his left eye. The gun was fired by a lad of fourteen, named Charles Hills, of Scudder's-lane, Bexley, to whom it had been lent. He pointed it, he says, at two sparrows, and did not see Browning until he cried out, when he became frightened and ran away. The injured man has lost the sight of his left eye, and several shots have been extracted from his face and ears.\n\nTHOMAS BURKE, nineteen, a slater, of Anatola-road, Upper Holloway, was charged before Mr. Bros, at the Dalston Police-court, on Monday afternoon, with disturbing the members of the Salvation Army by shouting and swearing and using disgusting language inside the “army” barracks, a duly-registered place of worship, at Salisbury-road, Upper Holloway. Lieutenant Bessie Bellamy deposed that the previous afternoon the prisoner was at the service as stated, and talked loudly and persisted in singing when others had stopped. He talked loudly whilst the captain was reading the Bible. Sergeant Smith deposed to hearing the disturbance, and to asking the prisoner to withdraw. He refused, but on subsequently being detained until a policeman was fetched he asked in a loud voice, “What the devil are you keeping me here for?” The bad language alleged to have been used by prisoner was spoken to; and Police-constable 50 YR having said the prisoner was violent and threw him when arrested, Mr. Bros passed sentence of one month's hard labour. A woman at the back of the court screamed and fainted on hearing this,", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200807975.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 859, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3540, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]