[{"id": "a474ceaac98b9330499cdf853c57183bf545430b", "text": "XIX. Account of a new Method of cultivating the Sugar Cane. By Mr. Cazaud; communicated by Joseph Banks, Esq. P. R. S.\n\nRead February 25, 1779.\n\nCONTENTS.\n\nOBSERVATIONS on the climate, - - - 216\nTable of the rain fallen in the Eastern part of the island of Grenada, from the first of June 1772 to the first of June 1773, - - - 217\nNatural history of the cane, - - - 218\n\nHistory\n\nSystème de la petite Culture des Cannes à Sucre. Par M. Cazaud.\n\nTABLE DES ARTICLES.\n\nOBSERVATIONS sur le climat, - - - 216\nTableau de la pluie tombée à la Grenade dans la partie de l'est depuis le 1 Juin 1772 jusqu'au premier Juin 1773, - - - 217\nHistoire naturelle de la canne, - - - 218\n\nHistoire\nHistory of the roots of the cane, and of its productions under ground, 219\nHistory of the joints of the cane above ground, 241\nHistory of the cane in different soils, with that of the different degrees and different kinds of growth it is subject to in them, 250\nHistory of a revolution in the inside of the cane, and of the arrow which comes out in consequence of that revolution, and constitutes the last stage of the plant's existence 264\nHistory of the cane according to the two different methods of cultivation, and in different years, favourable, dry, and rainy, 270\nView of the cane in its different stages, 278\n\nHistoire des racines de la canne et de ses productions en terre, 219\nHistoire des nœuds de la canne hors de terre, 241\nHistoire de la canne dans les différentes espèces de terres, des divers degrés et de l'espèce d'accroissement qu'elle y acquiert, 250\nHistoire d'une révolution singulière dans l'intérieur de la plante, de la flèche qui la suit et qui forme le dernier développement de la canne, 264\nHistoire de la canne dans les deux systèmes et dans les différentes espèces d'années, favorables, sèches et pluvieuses, 270\nVue de la canne dans ses différents périodes, 278\nTHOUGH the work which I have the honour to lay before the Royal Society was undertaken entirely with a view to private advantage, it appeared to me not entirely destitute of public utility, were that utility no other than what may arise from there existing a regular history of a plant which is worth nine millions sterling to Europe.\n\nThe usual method of cultivating the sugar cane appears more like the consequence of some general observations than the result of such as ought to have been purposely made.\n\nThe methods in use, before mine, are reducible to two.\n\nL'OUVRAGE que j'ay l'honneur de presenter et de soumettre au jugement de la Société Royale de Londres, entrepris uniquement pour des vues particulières, m'a paru susceptible d'une utilité générale, quand il ne devroit produire qu'une discussion sur une plante qui fournit à l'Europe une reproduction annuelle de neuf millions sterling.\n\nLa culture ordinaire de la canne me paroit plutôt être le fruit de quelques observations générales que le resultat de celles qu'on auroit du faire.\n\nOn peut reduire à deux methodes, les systemes établis avant celuy que je propose.\n\nVOL. LXIX.\nThe one consists in making sugar in almost all seasons indifferently, consequently in planting rather (if one may so say) when the planter is best prepared for his work, than at the time which is best suited to the essential end, which undoubtedly should be, to get from the earth, all that can be expected from its fruitfulness after due allowance has been made for the different circumstances of the growth of the cane, and the revolutions it undergoes in the different seasons.\n\nThis first method arose, from the want of proper observations, and the difficulty of procuring the number of negroes requisite to work in another manner; so that the desire of cultivating a greater quantity of land always having kept pace with the augmentation\n\n---\n\nL'une consiste à faire du sucre presque indistinctement en tout temps, et conséquemment à planter, s'il est permis de le dire, plutôt dans le temps où l'on est le mieux arrangé pour cette opération, que dans celui qui conviendroit le plus au but essentiel, qui doit être, de tirer de la terre tout ce qu'on peut espérer de sa fertilité, combinée avec les différentes circonstances de l'accroissement de la canne, et des revolutions qu'elle éprouve dans les différentes saisons.\n\nCette méthode a été une suite nécessaire de la difficulté qu'on avoit dans le principe de se procurer la quantité de nègres qu'il auroit fallu pour travailler autrement, jointe au manque d'observations qui pussent encore diriger. Le désir de cultiver une plus grande quantité de terre augmentant avec le nombre des nègres,\ntation of the negroes, the latter must of course have been always inadequate to the work; whence the only change such a method of culture could ever admit of consisted in making a little more sugar in a good season, and a little less in a bad one.\n\nThe second method, which I call the system of cultivation in the great way, and is that which has been either originally followed or adopted wherever the number of negroes has been answerable to the assurance the slave-merchant had of receiving the price he had agreed to take for them, consists, first, in planting a fourth or fifth of one's land in October, November, and December, when, all the other business of the plantation being finished, there is time to give to this important one all the attention it deserves.\n\nnegres, dont la quantité se trouvoit toujours ainsi disproportionée aux travaux, le seul changement que l'avidité d'étendre ses plantations ait pu admettre dans le premier plan, a donc été de faire un peu plus de sucre dans la bonne saison et un peu moins dans la mauvaise.\n\nL'autre méthode que j'appelle le système de la grande culture a été suivie où adoptée dans tous les pays où la facilité de se procurer des negres a été proportionnée à l'avantage qu'on avait soin d'assurer au marchand, d'en recevoir le payement aux termes stipulés. Cette méthode consiste, 1°, à planter le quart où le cinquième de sa terre en Octobre, Novembre, et Decembre, parce qu'alors tous les autres travaux étant finis, on est tout entier à cette opération importante.\n2dly, In digging very deep trenches, because the deeper the trench the greater the nourishment of the root.\n\n3dly, In planting at great distances, by which the air circulates more freely between the plants, and by that means ensures them a quicker and more compleat maturity.\n\nFinally, in cutting the canes in the four finest months of the year, to wit, in February, March, April, and May, because the sugar is then the finest, is cut with the least trouble, and (at least as is pretended) is supplied in greater quantities by the canes.\n\nWhere this method is followed, about three fourths of the plantation is cut, the remainder is made up partly of young canes, which can only be cut the following year, and partly of such as must necessarily be sacrificed and reserved for the purpose of getting\n\n---\n\n2°, à faire des fosses très profondes, parce que les racines trouvent plus de nourriture dans une plus grande profondeur.\n\n3°, à planter à de grandes distances, parce que l'air circule mieux entre les plantes, et leur procure une maturité plus prompte et plus parfaite.\n\n4°, enfin, à faire la récolte pendant les 4 mois de la plus belle saison, Fevrier, Mars, Avril, May, parce qu'alors le sucre se fait plus aisément, plus beau, et que les cannes, dit-on, en donnent une plus grande quantité.\n\nOn coupe dans ce système environ les trois quarts de la terre destinée aux cannes; le reste est partie en jeunes plantes qu'on ne peut couper que l'année d'après, et partie dans quelque portion de terre sacrifiée nécessairement pour se procurer\ngetting the plants which are wanted after the crop is over.\n\nMy own method, which I now proceed to explain, is this: I employ the whole of the six first months of the year in the business of the crop, and in May and June plant the canes which have been cut in January. This of course induces a necessity of cutting the rattoons at the end of the eleventh instead of the end of the twelfth month, and the planted canes, which should stand fifteen months, at the end of the year: in return, the whole plantation is cut every year.\n\nIt is objected, that besides the first loss from cutting the rattoons one, and the planted canes three months before their time, there is a second which arises from what is cut not being sufficiently ripe. These objections I mean to answer by the history of the cane, that of the seasons, that\n\nprocurer le plan dont on a besoin dans une saison où la recolte est déjà faite.\n\nJe propose d'employer en entier les six premiers mois de l'année à faire la recolte, et de planter en May et Juin, les cannes coupées en Janvier, ce qui entraine la nécessité de couper toujours, les rejettons à onze mois au lieu de les couper à douze, et les cannes plantées à un au lieu de les couper à 15 mois: mais on coupe chaque année toute la terre destinée aux cannes.\n\nOn objecte à ce système, outre la perte qui resulte de l'anticipation d'un mois de coupe pour les rejettons, et de trois mois pour les cannes plantées, le defaut de maturité qui suit de cette anticipation; je réponds à ces objections par l'histoire de\nthat of the effect of those seasons, and from experience.\n\nAfter this, as it is an advantageous consequence (though not a fundamental principle) of my method, that I only plant a sixth part of my land every year, and it is objected to this, that there are some soils which will not give so much as a second crop, I endeavour to investigate what causes can deprive a plant propagating by the gem of its power of giving shoots ad infinitum, and I find none but such arise from a bad method of cultivation.\n\nHaving written in the beginning only with a view of instructing my overseer, and by no means with the presumption of adding to the treasure of natural history by the account of a plant which deserves the pen of a Buffon, my observations (though I flatter myself extended to every\n\nde la canne, des saisons, de leurs effets, et de l'expérience.\n\nJe ne plante aussi annuellement que le sixième de ma terre, mais ce n'est pas l'article fondamental du système, il me paraît seulement en être une suite avantageuse : cependant comme on objecte contre cet article, l'impossibilité prétendue, même d'une seconde coupe dans certaines terres, je cherche les raisons qui peuvent annéantir, dans une plante vivace par sa racine, la faculté de rejeter jusqu'à la consommation des siècles ; et je ne puis les trouver que dans un mauvais système de culture.\n\nQuoique je n'aye écrit dans le principe que pour instruire mon économie, et point du tout avec la présomption d'enrichir le dépôt d'histoire naturelle, de celle d'une plante digne de la plume d'un Buffon, je ne crois pas cependant qu'il y ait un seul point intéressant de cette histoire qui m'ait échappé, mais tous\nevery material point) were scattered, confused and drawn up in the natural order they offered themselves to me, when the necessity of discussing or defending any part of my method obliged me to study the nature of the plant, to try to find out the reason of some phenomena which the experience of many years had taught me the existence of; but I have been obliged to follow a different method now that these observations are to be submitted to the natural judges of every thing that can have influence upon the progress of useful knowledge. In order to form a proper judgment of the merit of the mode of culture I propose, it is necessary to be acquainted with the plant and the climate in which it grows.\n\netoient epars, sans ordre, comme ils s'etoient presentés, à mesure qu'il falloit discuter et établir quelque partie de mon système, et que j'étois obligé de chercher dans la nature de la plante, la raison de quelque phénomène que plusieurs années d'expérience m'avoient fait observer. Mon dessein en les rapprochant, étant de les présenter aux juges naturels de tout ce qui peut influer sur le progrès des connaissances utiles, j'ay du suivre une autre méthode : pour apprécier la culture que je propose il faut connoître la plante, et le climat où on la cultive.\nIn the Windward Islands, the weather is commonly dry from the 15th of February to the 15th of May. The rains are moderate till August; they are very copious the two or three following months, and afterwards decrease till February; consequently there is a succession of nine months rain, and of three months dry weather. The annexed table shews the quantity of rain fallen at Grenada in the East quarter from the first of June 1772 to the first of June 1773, and this is the rain of a common year.\n\nTable\n\nObservations sur le climat.\n\nDans les Isles Antilles, du 15 Fevrier au 15 May, il fait ordinairement sec, les pluyes sont moderées jusqu'en Aouft, elles font tres fortes pendant les deux ou trois mois suivants, elles diminuent ensuite jusqu'en Fevrier: voila donc une succession de neuf mois de pluye suivie de trois mois de sec; voici le tableau de la pluye tombée à la Grenade dans la partie de l'est depuis le 1 Juin 1772 jusqu'au 1 Juin 1773; c'est le tableau d'une année commune.\nTable of rain fallen in the East quarter of Grenada from the 1st of June 1772 to the 1st of June 1773.\n\n| Month     | Rain (inches) |\n|-----------|--------------|\n| June      | 9            |\n| July      | 13           |\n| August    | 11           |\n| September | 19           |\n| October   | 12           |\n| November  | 9            |\n| December  | 18           |\n| January   | 9            |\n| February  | 6            |\n| March     | 2            |\n| April     | 0            |\n| May       | 2            |\n\nTotal of inches of rain, 116\n\nTableau de la pluye tombée à la Grenade dans la partie de l'est depuis le 1 Juin 1772 jusqu'au 1 Juin 1773.\n\n| Month     | Rain (pouces) |\n|-----------|---------------|\n| Juin      | 9             |\n| Juillet   | 13            |\n| Aout      | 11            |\n| Septembre | 19            |\n| Octobre   | 12            |\n| Novembre  | 9             |\n| Decembre  | 18            |\n| Janvier   | 9             |\n| Fevrier   | 6             |\n| Mars      | 2             |\n| Avril     | 0             |\n| May       | 2             |\n\nTotal des pouces d'eau 116\nThere are but few of the minute particulars I am going to mention, but what are somehow or other connected with my method.\n\nThe upper part of the cane, commonly called the head, is the best plant that can be used to propagate it, see fig. 7. see likewise fig. 1.; it is the part from l to n, which in this figure is without its leaves. It is a known fact, that the body of the cane does not come up well, unless there are continued rains from the time of its being put into the ground, till all the shoots are out and pretty strong.\n\nHistory\n\nHistoire naturelle de la canne.\n\nIl est peu des details minutieux dans lesquels je vais entrer qui n'ait un rapport quelconque avec mon système.\n\nLa partie supérieure de la canne appelée communément la tête, est le meilleur plan dont on puisse se servir pour la multiplier, v. fig. 7. v. aussi fig. 1. c'est la partie depuis l jusqu'à n, elle est dans cette figure dépouillée de ses feuilles; il est reconnu que le corps de la canne ne réussit point à moins d'une pluie continue depuis le moment qu'il est en terre, jusqu'au moment où tous les jets sont sortis et assez vigoureux.\nHistory of the roots of the sugar cane, and of its productions under ground.\n\nIf the plant be put into the ground as soon as it is cut, and the weather happens to be very hot and dry, a fortnight often passes before the eye can discover any alteration in the two or three most promising joints; the first being too hard (see a fig. 2.) become immediately dry; the others (see from y to z in the same figure) are only grass, and produce nothing, unless when the last happens to shoot at its extremity.\n\nWhen the dry weather continues, but so as not materially to affect the soil in contact with the inferior part of the plant, one discovers at the end of three weeks, about that part of the joint which lies undermost in the trench,\n\nHistoire des racines de la canne et de ses productions en terre.\n\n1° Si le plan est mis en terre aussi tôt qu'il est coupé, et qu'il survienne de grandes chaleurs sans pluie, il est souvent quinze jours sans que l'œil découvre la moindre alteration dans les deux ou trois nœuds de la plus grande espérance; les premiers, trop durs, v. a, fig. 2. sont d'abord desséchés; les autres, herbacés, v. y jusqu'à z, ne produisent rien à moins que le dernier ne se développe par son extrémité.\n\nSi le sec continue et qu'il ne se fasse pas sentir vivement jusqu'à la terre qui touche la partie inférieure du plan, ou découvre après trois semaines à cette partie\nsome white fibres of about half a line in length and thickness: notwithstanding, however, this beginning of vegetation, the plant still dies, unless it rains, before the soil in contact with these small roots be entirely dry; at least I have always found the earth dry under these small roots, when, in consequence of a long drought, the plant from which they had come was entirely dried up. But I have seen plants, put into the ground as soon as cut, put forth one, and sometimes two sprigs at the end of six weeks, though they had been deprived of rain for above a month. When the plant is somewhat withered, that is, when it has not been planted till some days after having been cut, it thrives sooner when assisted by rain, and dies sooner when deprived of it: the reason I take to be this, it could not wither without losing some part of that moisture which it contains, and which it wanted\n\ndu nœud qui touche le fond de la fosse, quelques fils blancs de la longueur et de la grosseur d'une demi ligne: après ce commencement de végétation, le plan meurt s'il ne pleut pas avant que la terre qui touche ces petites racines soit entièrement desséchée, ou du moins j'ai toujours trouvé la terre sèche sous ces petites racines lorsqu'après un long sec, j'ai trouvé le plan qui les avait données entièrement desséchées; mais j'ai vu du plan mis en terre assez-tôt que coupé privé de pluie pendant plus d'un mois donner un et quelquefois deux jets après six semaines: si le plan est un peu fané, c'est à dire coupé quelques jours avant d'être mis en terre, il lève plus vite s'il est secondé de la pluie, et meurt plutôt s'il en est privé, parce qu'il n'a pu se faner sans perdre une partie de l'eau qu'il contenoit, dont\nwanted to preserve it from the dryness of the surrounding earth, which earth itself also probably sucks up part of its humidity: I am, therefore, apt to think, though contrary to the opinion of a great many people, that it is best to put the plant into the ground as soon as it is cut.\n\n2dly, We all along suppose the weather to be tolerably favourable; then, when the small roots, which sprout about the joint when the surrounding earth has its proper degree of moisture, are of the length of a line and a half or two lines, the bud adherent to it swells; a few days after it lengthens horizontally in the direction of the plant, see b, fig. 2.; it next describes a spiral, c; and at length comes out of the earth like the point of an arrow, d. These are what we call the first productions; they are the immediate productions of the plant. The shaft\n\nil auroit eu besoin pour se soutenir plus longtemps contre la sécheresse de la terre qui l'environne, et qui probablement pompe même une partie de son humidité: je crois donc contre l'opinion de beaucoup de gens qu'il vaut mieux mettre le plan en terre aussitôt qu'il est coupé.\n\n2° Nous supposerons un temps assez favorable; lorsque ces petites racines qui se forment à l'entour du noeur si la terre est par tout humide, sont longues d'une ligne et demi ou deux, le bouton qui luy est attaché paroit gonflé, quelques jours après il s'allonge horizontalement, v. b, fig. 2. suivant la direction dans la quelle le plan est couché, ensuite il decrit une spirale, v. c, même figure, et fort de terre comme une pointe de fleche d. C'est ce que j'appelle les premières productions,\nshaft of the arrow then breaks, the two first leaves expand, see e, e, fig. 3. and rise from twenty-four to thirty inches high. These are, properly speaking, the leaves of the plant, I shall call them the external leaves, though they are in fact inclosed within a quadruple sheath of seminal leaves, see f, f, f, f; but these last rise but a very little way out of the ground. I believe, that the joint, to which the last leaf of this external case is fastened, ought to be considered as the beginning of the stem of the plant which divides its lower part (that which produces nothing above ground) from its upper part, which produces things of various kinds; at least, I have never seen anything produced by this lower part, except these four small leaves, and some roots.\n\n3dly,\n\ntions, qui sont les productions directes du plan, Deux ou trois jours après, le faisceau qui compose cette flèche se développe, les deux premières feuilles se déployent, v. ee, fig. 3. elles s'élèvent jusqu'à 24 et 30 pouces, ce sont les feuilles proprement dites de la plante; je les appellerai extérieures quoiqu'elles soient dans leur origine enveloppées dans un quadruple étui de feuilles féminales, v. f, f, f, f, même figure, parce que celles cy ne s'élèvent que très peu au dessus de la terre: je crois que le nœud auquel est attaché la dernière feuille de cette enveloppe doit être regardé comme le collet de la plante qui divise sa partie inférieure qui ne donne point de productions hors de terre d'avec sa partie supérieure, d'où il en sort de toute espèce: je n'ay du moins jamais remarqué dans cette partie inférieure, d'autre production que ces 4 petites feuilles et des racines.\n\n3°,\n3dly, Till the external leaves are eight or ten inches high, all the nourishment which the plant receives from the earth is by the roots which have sprouted about the joint to which the bud from whence it was produced was fastened: these may, therefore, be considered as a set of roots of the first order, see fig. 5. n. 1.\n\n4thly, But when that time comes, the seminal leaves which formed the sheath, wither, grow red, soon after dry up, and are finally driven away by a set of roots of the second order, which appear in the places to which each of these seminal leaves were fastened. The fourth figure shews the young plant deprived of its four seminal leaves, and provided with its set of roots of the second order, see No° 2, which have taken their place.\n\n5thly,\n\n3°, Jusqu'au moment où les feuilles extérieures sont hautes de 8 à dix pouces, la terre ne transmet de nourriture à la plante que par les racines sorties à l'entour du nœud auquel étoit attaché le bouton qui l'a produite, et qu'on peut regarder comme un premier ordre de racines, v. F. 5. n. 1.\n\n4°, Mais alors les feuilles seminales qui compoisoient l'enveloppe, se fannent, rougissoient, peu de temps après se dessechent, et font bientôt chassées par un second ordre de racines qui paroissent à l'endroit où chacune des feuilles seminales étoit attachée, la fig. 4. presente la jeune plante dénuée de ses quatre feuilles seminales et pourvue de son second ordre de racines, v. No° 2. qui a pris leur place.\n5thly, Each of the external leaves mentioned in the second article (I mean those which appeared first) are likewise so many indications of joints in the ground; so much the more distinct, the more vigorous the leaf is; and in proportion as each of these leaves dries, each of the joints successively produces a row of roots which constitute the third set, see No. 3, fig. 5.\n\nIt is to each of these rows of roots that the joint is fastened which is to furnish the suckers which I call the second productions. The fifth figure shews the plant without either its seminal or its external leaves, the joints of which are in the ground. It appears provided with its first, second, and third set of roots, No. 1, 2, 3. Each row of this third set of roots is intended either to nourish the plant which is to come out of the joint which is fastened to\n\n---\n\n5° Chacune des feuilles extérieures mentionnées à l'article 2 (j'entends les premières folles) annonce aussi un nœud en terre d'autant plus distinct que la feuille est plus vigoureuse, et à mesure que chacune de ces feuilles se dessèche, chaque nœud donne successivement des plantes racinées qui forment le troisième ordre, v. No. 3, fig. 5.\n\nC'est à chacun de ces plans de racines qu'est attaché le nœud qui doit donner les jets que j'appelle secondes productions. La figure 5 présente la plante dénuée tant de ses feuilles seminales que de ses feuilles extérieures dont les nœuds sont en terre; elle paraît ainsi pourvue de son premier ordre de racines No. 1, de son second ordre de racines No. 2, et du 3° No. 3, chaque plan de ce 3° ordre de racines est destiné à nourrir la plante qui sortira du bouton qui lui est attaché, si\nto it, if the season be favourable enough, or if either the season or cultivation be unfavourable to the birth of this bud; in that case, the roots are to contribute to the nourishment of the plant already formed.\n\n6thly, Let us now go back a little. Suppose the season always to continue favourable, and the first shoot to be out of the earth a fortnight or three weeks after planting, consequently the first set of roots formed.\n\nAt five or six weeks end the seminal leaves are expelled by a second set of roots. In nine or ten weeks the first of the external leaves begins to give way to the first row of the third set of roots.\n\nAbout the twelfth or fourteenth week the bud which adheres to the joint which forms the first row of the third set of roots swells, opens, and likewise appears like the shaft\n\nla saison est assez favorable, ou bien à nourrir seulement la plante déjà formée, si le défaut de saison ou de culture s'oppose au développement du bouton.\n\n6°, Revenons sur nos pas, supposant toujours la saison favorable, et le premier jet sorti de terre après quinze jours ou trois semaines, conséquemment le premier ordre de racines déjà formé.\n\nÀ 5 ou 6 semaines les feuilles séminales cèdent au second ordre de racines. À 9 ou 10 semaines la première des feuilles extérieures commence à céder au premier plan des racines du troisième ordre.\n\nÀ 12 ou 14 semaines le bouton attaché au nœud qui forme ce premier plan de racines du 3e ordre, se gonfle, se développe et paraît aussi comme une flèche,\nThis is the immediate growth or production of the main stem already formed. The buds which adhere to the second, third, and fourth row of the third set of roots likewise unfold and appear in regular succession during each of the following weeks, if the rains continue. Still, however, these are only second productions. The third are those which come out of the second in a month or five weeks after, if the rains continue; see g, fig. 5. But we must not forget to observe, with respect to the second productions, that an exceeding favourable season being necessary to their appearance, and this twelfth or fourteenth week (from the circumstance of the plantation, being began in October or November) falling out in February or March, which is the usual time of the greatest droughts, they may be kept\n\nv.f, fig. 5. C'est une production propre de la souche déjà formée: les boutons attachés au 2°, 3°, 4°, &c., plan de racines de ce 3° ordre, se développent aussi et paroissent successivement chacune des semaines suivantes si la pluye continue, mais ce ne sont encore que des secondes productions. Les troisièmes productions seront celles qui un mois ou cinq semaines après sortiront de ces secondes, v.g, fig. 5, si la pluye continue. Mais ce qu'il ne faut pas oublier par rapport aux secondes productions, c'est qu'elles ont besoin pour paraître d'une saison très avantageuse, et que cette 12° ou 14° semaine dans laquelle elles doivent paraître ne tombant eu regard aux plantations de Novembre et Decembre, qu'en Fevrier où Mars, temps du plus grand sec qui suspend presque entièrement la vegetation dans la terre decouverte,\nkept back, and only appear the May or June following, after the rainy season has set in.\n\nThe fifth figure represents the bud (b) which adheres to the first row of the third set of roots, quite come out, and appearing above ground like the shaft of an arrow f. This is the second production. The same figure likewise represents the bud (c) unfolded and appearing in g. This is the third production. It comes out of the first row of roots of the plant f, which must be conceived in a more advanced state of vegetation than it is in the figure.\n\nThe time of, and requisites necessary for, the successive appearances of all these different vegetations, seem to me so many proofs of the fundamental part of my method, to wit, the necessity of planting in the only season fitted to accelerate and preserve them.\n\nLa découverte, ces secondes productions retenues dans la terre ne paraîtront donc qu'en May ou Juin suivant, lorsque les pluies seront décidées.\n\nLa figure 5 présente le bouton (b) du premier plan du 3e ordre de racines développé et paraissant comme une pointe de flèche f hors de terre que nous supposons a. C'est la seconde production. La même figure présente aussi le bouton (c) développé, et paraissant en g. C'est la 3e production, elle sort du premier plan de racines de la plante f qu'on doit supposer plus avancée qu'elle n'est représentée ici.\n\nLe temps et les conditions du développement des ces différentes productions me paraissent autant de preuves de la partie fondamentale de mon système, savoir, la nécessité de planter dans l'unique saison qui soit propre à hâter et entretenir ses développements.\nThe nine months during which you may reasonably look out for a continuation of rain are from the 15th of May to the 15th of February. The progression of the rain keeps, as it were, pace with that of your canes when they are planted in May. Moderate in the beginning, more considerable afterwards, very copious when your canes are big enough to have nothing to fear from them, they lessen gradually as the time of the crop draws near.\n\n7thly, Whenever I stubbed up the stumps of a plant which had been ten months in the ground, I always found a portion of the woody part of the plant very sound: the medullary part was rotten. This made me think that every planted cane continued, for the whole time of its duration, to derive its nourishment not only from the roots of the second and third orders (which may be looked upon\n\n---\n\nLes neuf mois où l'on peut raisonnablement espérer une continuation de pluie, sont depuis le 15 May jusqu'au 15 Fevrier. Les pluies augmentent pour ainsi dire avec vos cannes plantées en May; foibles d'abord, plus considérables ensuite, et par averses lorsque vos cannes sont assez grandes pour ne les plus redouter, cesser enfin par degrés à mesure que le temps de la coupe approche.\n\n7°, Lorsque j'ai déraciné des souches qui provenaient d'un plan mis en terre depuis dix mois, j'ai toujours trouvé très faîne une portion de la partie ligneuse du plan; la partie médullaire était pourrie; et j'ai cru que chaque cane plantée continuait donc pendant qu'elle subsistait à tirer sa nourriture non seulement du second et du troisième ordre de racines qu'on peut regarder comme ses racines propres,\nupon as its own roots) but likewise from those of the first, that is, from those which had sprung about the joint to which the button which produced it was fastened. Fig. 6. represents an entire cane (a) sprung from the plant b, the woody part cc, was as found at the end of ten months as when it was put into the ground: the medullary part was entirely rotted as was likewise the herbaceous, dddd, which forms the top of the head. There is no doubt but the medullary part affords the bud the same nourishment as the lobes of almonds do to the germ which they contain.\n\n8thly, Whenever I stubbed up the stumps of a plant which had been thirteen months in the ground, and the canes of which had been cut a month or two before, I always found all the woody part of the plant which belonged to the stump rotten, the roots of the plant dried up,\n\npres, mais encore du premier ordre de racines, c'est à dire de celles qui s'etoient formées à l'entour du nœud auquel etoit attaché le bouton qui l'a produite. La fig. 6, presente une canne entiere a provenant du plan b, dont à dix mois la partie ligneuse cc etoit aussi saine que lors qu'on l'avoir mise en terre; la partie medullaire etoit entierement pourrie, ainsi que la partie herbacée dddd qui compose la partie superieure de la tête: la partie medullaire fournit sans doute au bouton la nourriture que les lobes des amandes fournissent au germe qu'elles contiennent.\n\n8°, Lorsque j'ay deraciné des souches qui provenoient d'un plan mis en terre depuis 13 mois, et dont on avoit coupé les cannes depuis un ou deux mois, j'ay toujours trouvé pourrie toute la partie ligneuse du plan d'où provenoit la souche,\nup, each of the young rattoons provided with its second and third set of roots, and each of these rattoons fastened in the ground to the joint of one of the canes which had been cut. This joint being still green, I concluded, from the same kind of reasoning, that these rattoons likewise drew their nourishment not only from their own proper roots, but likewise from those of the joint they had come out of, just as the planted cane draws it both from its own roots, and from those of the joint it comes from.\n\nBut as the plant has been always found rotten soon after the cane which it had produced had been cut, I began to suspect, that canes of all sorts, not only the planted but the rattoons likewise, never draw any nourishment but from\n\nles racines de ce plan desfechées, chacun des nouveaux rejettons en possession de son second et troisième ordre de racines, et chacun de ces rejettons attaché dans la terre à un nœud d’une des cannes qu’on avait coupées, ce nœud étant encore verd, j’ay conclu que les rejettons jouissoient aussi non seulement de leurs propres racines, mais encore de celles du nœud dont ils étoient sortis, comme la canne plantée jouit de ses propres racines et de celles du nœud dont elle tire son origine.\n\nMais comme le plan, suivant ce qu’on vient de voir s’est toujours trouvé pourri, peu de temps après que la canne qu’il avoit produite a été coupée, j’ay soupçonné que toutes les cannes non seulement plantées mais même rejettons ne jouissoient jamais que des trois ordres de racines dont j’ay déjà parlé : ce qui se-\nfrom the three sets of roots of which I have spoken. This, if true, is a strong argument against the pretended antiquity of the stools, which are said to be ten, fifteen, and even twenty years old. It is also a very powerful argument in favour of my principle of the inutility of replanting when the stump is not raised above the ground, since grant my suspicion to be grounded, and it follows, that the oldest of the roots of a stool, the canes of which are cut every year, cannot be above two years old.\n\n9thly, In order then to clear up so important a point, I ordered a stool of canes, which had been planted about four years before, had been regularly cut every year, and for the last time about six months before, to be stubbed up. The ratoons were very fine; there were upwards of eighty of them, small and great (hardly a sixth part of this number usually succeeds); the group,\n\nnotwith-\n\nroit bien contraire à la vétusté pretendue des souches qu'on dit être de 10, 15 et 20 ans: et seroit un grand argument en faveur de mon principe de l'inutilité de replanter, lorsque la souche n'est pas élevée au dessus de la terre; puisque dans le cas où mon soupçon seroit juste, la plus vieille de toutes les racines d'une souche dont on coupe les cannes tous les ans, n'aurait pas au delà de deux années.\n\n9°, Pour éclaircir un point aussi important j'ai fait deraciner une souche de cannes plantées depuis quatre ans, coupée régulièrement chaque année, et pour la dernière fois depuis six mois: les rejettons étoient fort beaux, il y en avoit plus de 80 tant grands que petits (il en réussit rarement la sixième partie) la touffe\nnotwithstanding, was not above ten inches in diameter when it came out of the ground. In order not to injure it, I ordered six inches of the surrounding earth to be taken up with it. When I had had it washed and freed from all extraneous earth, I found no vestiges of any wood but that of the canes which had been last cut: I then took each ratoon apart, and found it fastened to a joint of these last canes, which joint was still green. I examined the remains of each of these last canes, and found the kind of bulb, see u, fig. 1. by which they had been fastened to some joints of canes of the preceding year, entirely dried up. I met with no appearance of this last cane, which consequently had rotted, and in place of it there was nothing to be seen but dry roots; roots take a great while to rot.\n\nConclude\n\ntouffe n'avoit cependant pas au delà de dix pouces de diametre à sa naissance hors de terre; pour ne la point endommager, j'ay fait cerner et enlever avec elle six pouces de terre à l'entour, et après l'avoir lavée et debarrassée de toute sa terre, je n'ay vu de trace d'aucun autre bois que de celuy des dernieres cannes coupées; j'ay detaché chaque rejetton séparément, et j'ay vu qu'il etoit attaché à un noeud de ces dernieres cannes, et que ce noeud etoit encore verd; j'ay suivi les restes de chacune de ces dernieres cannes, et j'ay vu entièrement défechée l'espece d'ombilic (v. u, fig 1.) par lequel ils etoient attachés aux noeuds de quelques cannes de l'année precedente; je n'ay vu aucune apparence de cette ancienne canne, qui par consequent etoit alors pourrie, on ne voyoit à sa place que des racines défechées, les racines sont assez long temps à pourrir.\n\nConcluons\nConclude we then, as I suspected, that the rattoons as well as the planted canes derive nourishment only from the three orders of roots of which I have spoke, with this difference only, that the first order of roots belonging to the planted canes comes from the plant which is put under ground; whereas that of the rattoons comes from the part of the cut canes which continue in the ground after they have been cut, and which rots the following year soon after the succeeding rattoons have appeared, so that the third order of roots of a cane which has been just cut becomes the first order of those of the ratoon it is about to produce; which first order, as well as the second, will rot the following year, when new rattoons shall have taken the place of those which shall then be cut.\n\nThe\n\nConcluens comme je l'avois soupçonné que les rejettons ne jouissent comme les cannes plantées que des trois ordres de racines dont j'ay parlé, avec cette différence que le premier ordre de racines des cannes plantées provient du plan mis en terre, et que celuy des rejettons provient de cette partie des cannes coupées qui reste dans la terre, partie qui pourrira l'année suivante peu de temps après que les rejettons subfquens auront paru; de sorte que le troisieme ordre de racines d'une cane qu'on vient de couper, devient le premier ordre de racines du rejetton qu'elle va produire, lequel premier ordre, pourrira l'année suivante ainsi que le second, après que de nouveaux rejettons auront suivi la coupe qu'on aura faite des precedents.\n\nVol. IXIX.\nThe idea, therefore, of having stumps of fifteen or twenty years standing must be given up, since it is proved, that the oldest are those of the last year; but this idea being given up, it can never be assigned as a reason for replanting so often. It will be sufficient, therefore, to replant annually a sixth of one's land: to speak more correctly, it will always be useless to replant, as long as the stump is not raised above ground, and the ground about it is raised as it ought to be by annual and well-directed labours. I say, the ground about must be annually raised, for otherwise it is impossible but that the feet of the negroes and cattle must harden and render it impervious to the roots which are to make their way every year.\n\nIt likewise appears of what consequence it is to cut the canes in the ground in order to prevent the stump from\n\nIl faut donc renoncer à la pretention d'avoir des souches de 15 et 20 ans, les plus vieilles sont de l'année precedente, et cette pretendue vetusté des souches étant démontrée fausse, elle ne doit plus être une raison pour replanter aussi souvent; il suffira donc de replanter annuellement la sixième partie de sa terre, ou pour mieux dire, il sera toujours inutile de replanter lorsque la souche ne sera pas élevée au dessus de la terre et que par des labours annuels et bien faits on aura soin de soulever celle qui l'environne, que les pieds des negres et des bestiaux quand on la travaille ne manqueroient pas d'affaiblir à la longue, et de rendre presque impénétrable aux nouvelles racines qui doivent se former chaque année.\n\nOn voit aussi combien il est essentiel de couper les cannes dans la terre, afin d'empêcher\nfrom rising above ground, consequently how bad the method of moulding up the stumps, thought by so many people to be so good, really is; since it raises the stump every year, and ought, therefore, only to be adopted with respect to those pieces one proposes to replant the next year: then, indeed, it is excellent, but in that single case only.\n\nHence likewise it appears, why rattoons are forwarder at the twelvemonth's end than planted canes are at the end of thirteen. The first order of the roots of the rattoons is in its full vigour at the instant of the crop; that of the planted canes is seldom so at a month's end.\n\nWe likewise see why the rattoons of canes that have been cut at the end of ten, eleven, or twelve months, are always finer than those of canes which have stood fifteen or sixteen months; the woody part of the latter being much\n\nd'empêcher la souche de s'élever; et combien est mauvaise la maxime de rechauffer, que tant de gens trouvent si bonne, qui eleve cependant tous les ans la souche, et qu'on ne devroit suivre que par rapport aux pièces qu'on se propose de replanter l'année suivante, elle est excellente alors, mais dans ce cas seulement.\n\nOn voit aussi pourquoi les rejettons à douze mois sont plus avancés que les cannes plantées ne le sont à treize: le premier ordre de racines des rejettons est dans toute sa force au moment de la coupe, celuy de cannes plantées l'est rarement au bout d'un mois.\n\nOn voit aussi pourquoi les rejettons des cannes coupées à dix, onze, et douze mois sont toujours plus beaux que ceux des cannes coupées à 15 et 16 mois, le\nmuch harder is exactly in the same case as the plant, the first joints of which (as I observed before) produced no shoots, except the season happened to be remarkably favourable.\n\nHence likewise we see, why one never gets any fine rattoons from the grounds which are called exhausted: the planted canes in them are cut at the end of the fifteenth or sixteenth month; at which time the part of their wood which remains under ground, and out of which the rattoons come, is extremely hard. Besides, this is done in February, March, or April, months, as may be seen from the account I have given before of the seasons, not likely to produce miracles of vegetation.\n\nHence, finally, we see, why it is not at all to be wondered at, that the rattoons which I cut before the time should\n\nbois de celles cy beaucoup plus dur est dans le cas du plan dont j’ay remarqué cy dessus que les premiers nœuds qui etoient les plus durs, ne donnoient point de jets à moins d’une saison singulièrement favorable.\n\nOn voit auflj pourquoi l’on n’a jamais de beaux rejettons dans ces terres qu’on appelle épuisées; on y coupe les cannes plantées a 15 et 16 mois, la partie de leur bois qui reste en terre, et d’ou proviennent les rejettons est alors très dure, et d’ailleurs cette coupe se fait en Fevrier, Mars, et Avril, et l’on peut voir par le tableau de la pluye, p. 217, que ces trois mois ne sont pas propres à produire des miracles de végétation.\n\nOn peut conclure auflj qu’il n’est pas etonnant que les rejettons dont j’ay toujours anticipé la coupe aient été (comme je l’ay éprouvé) ceux qui se soient le mieux\nshould have been what I ever found them to be, those which stood the best; that nothing, on the contrary, so much improves a piece of rattoons as cutting them before the time; and that, therefore, this operation (a necessary one when my method is followed) is not without its attendant advantage, which perhaps much lessens the loss which I have supposed to arise from it in page 213.\n\n10thly, Having washed and gently scraped as far up as their beginning (that is, to the kind of bulb I described) two ratoon canes, six months old; the one taken out of a damp, the other out of a very dry soil; the one with fourteen joints above ground, on a length of twenty-eight inches; the other with only two joints, on a length of two inches; I found that the cane which had fourteen joints above ground, had only five rows of roots of the third order on a length of an inch and a half under ground;\n\nmieux soutenus; que rien n’est plus capable de reparer une piece de rejettons que d’en anticiper la coupe; et qu’ainsi l’anticipation des coupes nécessaire dans mon système, n’est point sans un avantage qui diminue peut-être bien considérablement la perte que j’ai supposée, p. 213.\n\n10°, Après avoir lavé et gratté légerement jusqu’à leur origine (jusqu’à cet espace d’ombilic dont j’ai parlé) deux cannes rejettons de six mois, l’une prise dans un terrain humide, l’autre dans un terrain très sec, l’une ayant hors de terre quatorze nœuds dans une longueur de 28 pouces, l’autre ayant seulement cinq nœuds dans une longueur de deux pouces, j’ai vu que la cane qui avait quatorze nœuds hors de terre, n’avait en terre que cinq plans de racine du troisième ordre dans une longueur\nground; whereas the cane which had only five joints out of the ground had fourteen rows of roots, likewise of the third order, on the same length as the others.\n\nThis observation proves, that to the time of the canes jointing, that is, to the appearance of one of its joints above ground, the drying of each external leaf is constantly followed by a row of roots of the third order. One sees too, why canes that are in moist soils joint out of the ground at the three months end; but have then only four or five rows of roots of the third order, distant from each other three, four, and five lines under ground; whereas, on the contrary, in dry lands, or, what comes to the same, in a soil remarkably impoverished for want of cultivation, the canes do not joint above ground before the five months; but then they have under ground\n\nlongueur d'un pouce et demi, et que la canne qui n'avait que cinq nœuds hors de terre, avoit en terre quatorze plans de racines aussi du troisième ordre et dans la même longueur.\n\nCette observation prouve que jusqu'au temps où la canne noue c'est à dire qu'elle voir un nœud hors de terre, le dessèchement de chaque feuille extérieure est toujours suivi d'un plan de racines du troisième ordre; et l'on voit pourquoi dans les terrains humides, les cannes nouent hors de terre à 3 mois, mais alors elles n'ont en terre que 4 à 5 plans de racines du troisième ordre distants les uns des autres de 3, 4, et 5 lignes; dans les terres sèches au contraire, ou (ce qui est égal) singulièrement affaissées par le défaut de culture, les cannes ne sont nouées hors de terre qu'à cinq mois, mais alors elles ont en terre quatorze à quinze\nground fourteen or fifteen joints or rows of roots; distant from each other only a line, and sometimes less; the joints, therefore, of the canes, of a dry or ill cultivated soil, are as many in number as those of a moist and fruitful soil; but the two differ in this: the greater part of the former are short, small, and in the ground; whereas the greater part of the latter are thick, long, and above ground.\n\nIt is therefore the excellence or the defect either of the season, or the cultivation, which keeps back and bastardizes the one sort, which hastens and makes the other thicker: choose, therefore, that season for planting in which the greatest possible succession of rain shall force out of the grounds those joints which, in a drier season, would only have formed a quantity of roots within it,\n\n---\n\nquinze nœuds ou plans de racines distants les uns des autres d'une ligne seulement et quelque fois moins; les nœuds des cannes d'un terrain sec ou mal cultivé sont donc égaux en quantité à ceux des cannes d'un terrain humide ou fertile, mais ils diffèrent en ce que la plus grande partie des uns sont courts, petits, et dans la terre; le plus grand nombre des autres sont gros longs et hors de terre.\n\nC'est donc la bonté ou le défaut de la culture ou de la saison qui retient et abâtardit les uns, précipite et grossit les autres; choisissez donc pour planter la saison où la plus grande continuité de pluie possible, forcera le plutôt à se développer hors de terre, les nœuds qui dans une saison plus sèche formeroient uniquement en terre, une quantité considérable de racines dont l'inutilité est visible.\nthe uselessness of which appears from the state of the lands which are burthened with them.\n\nThe first reason for planting in May or June (see observation the sixth, p. 227.) respected the coming up of the different productions, first, second, &c. in general; that I have just given regards the first appearances of each particular production. We will next consider if my method is equally favourable to those which are to give the plant all the degree of perfection it is capable of acquiring.\n\nHistory\n\nvisible par l'état des plantes qui en sont affligées.\n\nLa première raison de planter en May et Juin, dont j'ay parlé obs. 6. p. 227. interessoit la sortie des différentes productions en général premiere, seconde, &c. la seconde raison dont je viens de parler interesse les premiers développemens de chaque production en particulier, voyons si mon système favorise également ceux qui doivent donner à la plante toute la perfection dont elle est susceptible.\nHistory of the joints of the cane above ground.\n\nWith respect to the joints of the cane, there are two points of equal consequence to be considered, the number and the quality.\n\nWith regard to number, the calculation of it, in both the methods, depends upon so many considerations, that I think myself obliged to reduce the question to its most simple state, by barely declaring, that I now cut all my canes every year, instead of only cutting three-fourths of them, as I used to do when I pursued the other method. Those, however, who wish to know more of it, may see in another part of this paper the only calculation the matter is capable of.\n\nAs\n\nHistoire des nœuds de la canne hors de terre.\n\nIl se présente à l’égard des nœuds de la canne deux points à considérer aussi essentiels l’un que l’autre, le nombre et la qualité.\n\nQuant au nombre le calcul qu’on peut en faire dans les deux systèmes, est subordonné à tant de suppositions que je crois devoir simplifier la question, en exposant que je coupe maintenant toutes mes cannes chaque année au lieu de couper seulement les trois quarts comme je faisois, lorsque je suivois l’autre système. Voyez cependant dans son lieu, l’unique espèce de calcul dont je croye la matière susceptible,\n\nVol. LXIX.\nAs to the quality of the joints; this, I think, is to be decided by the history of them, to which hitherto scarce any attention has been paid, though the slightest would have been sufficient to have shewn the absurdity of the received ideas concerning the age which must be allowed the canes, in order for them to arrive at perfect maturity.\n\nAt the end of the third month, sometimes later, as this depends upon the soil and season, nothing yet appears but a head covered with leaves: see figure 8. from a to z, which is a small sheath containing a number of white leaves which come out by degrees. The leaf b, see fig. 9. falls at length, and discovers a first joint above ground. From that instant to the time of its full growth it acquires four or five joints every month: these also depend\n\n---\n\nQuant à la qualité des nœuds il me semble qu'elle peut être décidée par leur histoire à laquelle on n'a fait jusqu'à présent qu'une mediocre attention, quoique la plus légère eut suffi pour démontrer la fausseté des idées qu'on a eu jusqu'à présent sur l'âge qu'il faut donner aux cannes, pour leur procurer une maturité parfaite.\n\nÀ trois mois quelquefois plus tard (suivant la terre et le temps qu'il a fait) la canne ne présente encore qu'une tige herbacée garnie de feuilles, v. fig. 8. depuis a, jusqu'à z qui est un petit rouleau qui renferme une quantité de feuilles blanches qui doivent se développer par degrés; la feuille b, v. fig. 9. tombe enfin et laisse voir un premier nœud hors de terre. De ce moment jusqu'à celui où elle a pris tout son accroissement elle augmente chaque mois de quatre à cinq nœuds\npend upon the weather and soil, and are longer or shorter, thicker or thinner, according as those are more or less favourable. One may see (figure 1, from i to k) the effects of a continued drought when it sets in in February, and lasts till May or longer. The joints are stunted, and instead of being an inch and a half or two inches long, like those from b to i, which come out in a favourable season, some of them are hardly two lines, and some even less. When the rains begin again and continue, the joints are longer again (see k to l) and like the first from b to i. The effects of the dryness of the soil are exactly similar to those of the weather. I once had a cane in my plantation worthy a place in a collection of natural history: it was of the thickness of a pea, and only three inches long; notwithstanding which\n\nnœuds plus ou moins gros, plus ou moins longs, c'est aussi suivant le temps et le sol, ou peut voir fig. 1, depuis i jusqu'à k l'effet d'un sec très vif lorsqu'il commence avec le mois de Février et qu'il continue jusqu'en May ou plus longtemps; les nœuds sont étranglés et au lieu d'avoir un pouce et demi ou deux pouces de long, comme les nœuds depuis b jusqu'à i produits dans une bonne saison, quelques uns de ceux produits dans le temps du sec, ont à peine deux lignes, d'autres en ont moins: lorsque les pluies recommencent et continuent, les nœuds qui sortent sont plus longs, comme on les voit depuis k jusqu'à l, et tels que les premiers depuis b jusqu'à i. L'effet de l'avidité du sol est exactement le même que celui de la vivacité et de la longueur du sec: j'ai vu chez moi dans une espèce de tuff près d'une carrière, une canne digne d'être mise dans le cabinet d'un curieux, elle était grosse comme une plume à écrire, longue de trois pouces, et\nwhich it had its two and twenty joints very distinct. I sent it in a letter to a person who might have sent me in exchange some six feet long; which, however, would not have had above twenty-two joints any more than mine, if the first joints of both had come out of the earth at the same time.\n\nThe first joint, which comes out either at the third, fourth, or fifth month, always keeps in its first place near the earth, see \\(a\\), fig. 9.; out of this first comes the second, see \\(b\\), fig. 10.; and out of the second a third, after the leaf \\(cc\\) has dried, and is fallen off like the leaves \\(aa, bb\\). Each week produces its joint, or very nearly: a leaf likewise dries and falls off pretty nearly every week. A cane of thirty-two joints, suppose fit to cut, has from five to eight and twenty of them which have lost their leaves; the next five or six still have them, but withered\n\nn'en avoit pas moins ses 22 nœuds tres distincts; je l'envoiai dans une lettre à une personne qui auroit pu m'en envoyer en échange quelques autres de 6 pieds de long et qui dans cette longueur n'auroient eu que 22 nœuds comme la mien ne si elles avoient noué hors de terre en même temps.\n\nLe premier nœud qui paroit soit à 3 soit à quatre ou à cinq mois, reste toujours à sa même place près de la terre, v. \\(a\\), fig. 9., de celuy la sort le second, v. \\(b\\), fig. 10. du secon le troisieme, après que la feuille \\(c, c\\) fera desséchée et tombée comme les feuilles \\(aa, bb\\), même figure, chaque semaine fournit environ son nœud; il se dessèche et tombe donc à peu près une feuille par semaine; dans une canne de 32 nœuds, je suppose, bons à couper, on en voit 25 à 28 dépouillés naturellement de leurs feuilles, et cinq à six autres garnis encore de leurs\nand ready to fall off: the remaining joints, surrounded with green leaves, form the head, which one takes care to cut off after the last leaf has withered. The bare recital of facts seems fully to prove that the withering and fall of a leaf is the only criterion (and a sufficient one it is) of the maturity of the joint to which it adhered; and that the eight last joints of two canes, which are cut the same day, have exactly the same age and the same degree of ripeness, notwithstanding one of the canes themselves may be fifteen, and the other only ten months old. My reasoning is further confirmed by the experiment repeatedly made on two equal quantities of canes, cut the same day in pieces of a different age; it was evident, that each joint of the cane, of a supposed growth of ten months, contained the same quantity of sugar as that of a cane of the supposed growth of fifteen.\n\nThe\n\nleurs feuilles desséchées prêtes à tomber; les nœuds suivant, garnis de feuilles vertes, forment la tête qu'on a soin de couper après la dernière feuille desséchée; la seule exposition des faits me semble démontrer que le dessèchement et la chute d'une feuille, est l'unique preuve (et preuve suffisante) de la maturité du nœud auquel elle était attachée: et que les huit derniers nœuds de deux cannes coupées le même jour sont exactement du même âge et de la même maturité, quand bien même l'une de ces cannes aurait quinze mois et que l'autre n'en aurait que dix; preuve de raisonnement confirmée par des expériences réitérées de deux quantités égales de cannes, prises dans des pièces d'un âge différent, et coupées le même jour, par lesquelles il conste que chaque nœud de cannes prétendues de dix mois contient autant de sucre que chaque nœud de cannes prétendues de quinze.\nThe necessity, therefore, which my method lays me under of cutting my planted canes at the twelvemonth's end, and my rattoons at eleven, has nothing in it which contradicts the proper idea which ought to be entertained of the absolute maturity of this plant. This is decided by experience, and the history of its joints.\n\nWith regard to its relative maturity, that which is of consequence to the sugar, this does not depend on the age, but on the season. In February, March, and April, all the canes, whatever be their age; are as ripe as the nature of the soil ever allows them to be, and accordingly I never fail to make the greatest part of my sugar at this season.\n\nIt will be of use to observe, that in the same week in February I cut in a piece which had been planted ten months a quantity of canes sufficient to yield me four thousand\n\nLa nécessité ou je suis dans mon système de couper mes cannes plantées à douze mois et mes réjettons à onze, n'a donc rien de contraire à l'idée qu'on doit se faire de la maturité absolue de cette plante, maturité décidée par l'expérience aussi bien que par l'histoire de ses nœuds; quant à sa maturité relative, celle qui intéressé le sucre elle n'est pas l'effet de l'âge mais de la saison, en Février, Mars, et Avril, toutes les cannes de quelque âge quelles puissent être, ont la perfection de maturité dont la qualité du terrain les rend susceptibles, et je ne manque pas de faire la plus grande partie de mon sucre dans cette façon.\n\nIl ne fera pas inutile d'observer que j'ai coupé dans la même semaine de Février, dans une pièce âgée de 10 mois, la quantité de cannes nécessaires pour\nthousand gallons or juice, and exactly the same quantity in a piece which had been planted fifteen months. If any body should chance to repeat this experiment, they should be careful to choose the same kind of soil, the same exposition, and the same time of year. The juice of the piece which was ten months old was a little greenish, that of the piece of fifteen months was exceeding brown. The four thousand gallons of juice from each of the pieces gave me the same quantity of very fine sugar, which proves that each joint of canes supposed to be nine months old contains just as much sugar as each joint of a cane to be fifteen months old.\n\nIt likewise proves, that all the joints, whose leaves have dried and are fallen off, have acquired that maturity which I call absolute.\n\n---\n\nme donner quatre mille galons de veufou ou jus, et la même quantité dans une pièce agée de 15 mois (si l'on vouloit reiterer la même expérience il faudroit choisir dans les deux pièces à peu près la même qualité des terre et la même exposition comme on choisirait le même temps) le veufou de la pièce agée des 10 mois étoit un peu verdâtre, celuy de la pièce de 15 mois étoit fort brun; les 4000 galons de veufou de l'une et de l'autre pièce m'ont donné la même quantité de très beau sucre. Ce qui prouve que chaque nœud de cannes pretendues de dix mois contient autant de sucre que chaque nœud des cannes prétendues de quinze.\n\nCela prouve aussi que tous les nœuds dont les feuilles sont desséchées et tombées ont acquis cette maturité que j'appelle absolue.\nIt likewise proves, that it is not the age of the canes but the dryness of the weather, which increases from January to April, which is the cause that in January four hundred gallons of juice commonly yield forty-eight gallons of sugar and molasses, one with another; in February from fifty-six to sixty-four; in March from sixty-four to seventy-two; in April sometimes eighty; after which period the sugar ferments, and even burns when the refiner happens not to be very expert at his business. Hence I concluded, that the greatest perfection of relative maturity to which my canes could arrive was when the juice of them was made up of four parts water, and one part consisting of part sugar and part molasses.\n\nThis last observation likewise proves, that the colour of the juice has nothing to do with either the quantity or\n\n---\n\nCela prouve aussi que ce n’est pas l’âge des cannes mais le sec qui augmente de Janvier en Avril qui fait qu’en Janvier 400 gallons de vesou rendent ordinairement 48 gallons tant sucre que melasse, en Fevrier de 56 à 64; en Mars de 64 à 72; en Avril quelquefois 80. Après quoy le sucre mousse, brule même, si le raffineur n’a qu’une routine; de ce dernier point j’ay conclu que la plus grande perfection de maturité relative ou mes cannes pussent atteindre, etoit lorsque leur jus contenoit quatre parties d’eau et une tant de sucre que de melasse.\n\nCe:à prouve aussi que la couleur du vesou n’interesse ni la quantité ni la qualité\nor the quality of the sugar, but may serve as an indication of the manner in which it is to be made. I should think an object of this importance would not be unworthy the attention of some very great chemist.\n\nOther observations have shewn me that in canes which are perfectly ripe, the quantity of the sugar is equal to that of the molasses.\n\nLet us now examine some other circumstances relative to the growth of the cane, and particularly that of its duration.\n\nlité du sucre, mais elle sert d'indice pour la traiter d'une façon ou d'un autre, et il me semble qu'un objet de cette importance ne seroit pas indigne de l'étude d'un très grand chimiste.\n\nD'autres observations m'ont prouvé que dans les cannes parfaitement mures la quantité du sucre est égale à celle de la melasse.\n\nExaminons quelques autres circonstances de l'accroissement de la canne et surtout celle de sa durée.\nThe account of the cane in different soils, together with that of the different degrees and different kinds of growth they give to it.\n\nWe are not to form our ideas of what a plant is in a country favourable to it, from what we see it in one where all it reaps from the care bestowed on it, is the lengthening out of a wretched existence useless to every purpose but curiosity. The cane to be met with in the hot-houses of Europe is the bare shadow of the American cane. Let us not then estimate the natural duration of the one by the artificial, and in some measure only apparent duration of the other: I with justice call it an apparent duration; for, if the European cane acquires only.\n\nHistoire de la canne dans les différentes espèce de terre, des divers degrés, et de l'espèce d'accroissement qu'elle y acquiert.\n\nIl ne faut pas juger de l'histoire d'une plante dans un climat qui favorise tous ses développements, par son état dans un pays où elle ne retire d'autre fruit des soins qu'on lui donne, que la prolongation d'une triste existence, inutile à tous autres regards que celui de la curiosité. La canne qu'on voit dans les serres en Europe n'est que l'ombre de celle d'Amerique; ne jugeons donc point de la durée naturelle de l'une, par la durée artificielle et en quelque façon apparente de l'autre; je dis, apparente, car si la canne d'Europe ne croît, je suppose que d'un\nonly a single joint each year, fifty-two years of existence in Europe are not more than fifty-two weeks existence in America.\n\nRECITAL OF FACTS.\n\n1st, I have never seen, either in my own plantation or that of any other person, a cane which had more than\n\n(a) When I first made this supposition, I rather conjectured what must be than what I knew exactly; but since that time, Mr. Thouin, of the King's Botanic Garden at Paris, has rid me of the little anxiety I could not help feeling at having ventured an assertion of the truth of which I was not accurately sure. He shewed me a cane which, he believes, to have been planted twelve years ago; it has thirty joints. In order to be convinced that it has grown at the rate of two joints and a half a year, one should be fully satisfied that it was planted twelve years ago; but he likewise shewed me one which he knows was brought from America in a pot ten years ago, and this has only two joints out of the ground. Conclude we then, as I said before, that, in order to know a plant thoroughly, we should study it in the climate to which it belongs.\n\nd'un nœud par chaque année, 52 années d'existence en Europe n'équivaudroient qu'à 52 semaines d'existence en Amerique *.\n\nEXPOSONS DES FAITS.\n\n1e observation, Je n'ay jamais vu chez moi ni ailleurs de cannes qui eussent\n\n* Lorsque je hazardois cette supposition je ne faisois qu'imaginer ce qui pouvoit être; M. Thouin, du Jardin du Roy à Paris, m'a mis en etat d'apprécier une idée sur laquelle je n'étois pas sans une espèce d'inquiétude; il m'a fait voir une cane qu'il croit plantée il y a douze ans; elle a trente nœuds; pour établir qu'elle a cru a raison de deux nœuds et demi par an il faudroit être certain qu'elle a été plantée il y a douze ans; mais il m'a fait voir aussi une cane qu'il faut avoir été apportée d'Amerique dans un pot il y a deux ans, elle n'a que deux nœuds hors de terre: concluons du moins comme je l'avoir dit que pour connoitre une plante, il faut la suivre dans le climat qui lui est propre.\nforty or fifty useful joints (I do not speak of those of the head); nor have I often met with this number upon any, the length of which fell short of seven, or exceeded nine feet.\n\n2dly, I have never seen this length but either in a new foil, or in a foil the moistest that could be without being quite drowned; that is to say, in a soil the most favourable to the quickest and greatest vegetation of the cane.\n\n3dly, In a foil of this kind I have always seen the first joint out of the ground at the three months end; if there had been frequent showers and no hard rains, at the end of two and a half.\n\n4thly, Even in such a foil I have never cut canes at the thirteen months end without finding many of them rotten\n\nau dela de 46 nœuds utiles (je ne parle pas de ceux de la tête) et j’ay rarement vu cette quantité de nœuds dans une longueur moindre de sept pieds, et plus considérable que neuf.\n\n2e observation, Je n’ay jamais vu cette longueur ailleurs que dans un terrain neuf, ou le plus humide sans être noyé, c’est à dire dans le terrain le plus favorable au plus prompt et au plus grand accroissement de la canne.\n\n3e observation, Dans un terrain de cette espèce, j’ay toujours vu la canne nouée hors de terre, à trois mois, quelquefois à deux et demi, s’il y avoit eu des ondées fréquentes sans averses.\n\n4e observation, Je n’y ay jamais coupé les cannes à 13 mois sans en trouver beaucoup de pourries ou presque desschées, pourries et couchées, si l’année avoit été\nrotten or almost dried up; rotten and laid if there had been much rain in the year; almost withered, though still standing, if there had been very little.\n\nIs it not safe to infer from these four observations, that forty-six joints are almost the *ne plus ultra* of the growth of the cane in moist soils? and again, that they are the produce of pretty nearly an equal number of weeks which elapse after the appearance of the first joint? for it is impossible to think, that the canes continue growing till the time in which one finds many of them rotten; but if I am in the right it follows, that canes of the first production, which live after the twelfth or at most after the thirteenth month, live as men do who have past the age of forty, every day takes something from their vigour. The second productions are\n\n---\n\nété pluvieuse, presque désechées quoique sur pied, s'il y avait eu très peu de pluie.\n\nNe peut-on pas conclure de ces quatre observations que ces 46 nœuds sont à peu près le *non plus ultra* de l'accroissement des cannes dans les terres humides, que ces 46 nœuds soient le travail d'à peu près autant de semaines qui s'étoient écoulées depuis la sortie du premier nœud, puis qu'on ne peut supposer que les cannes croissent jusqu'au moment où l'on en trouve beaucoup de pourries, et qu'ainsi l'on peut croire que les cannes de la première production qui subsistent encore après douze ou tout au plus 13 mois se soutiennent comme font les hommes après avoir atteint l'âge de 40 ans, tous les jours avec quelque diminution\nthe only ones which are then in their perfection; the third and fourth have not yet reached it.\n\n5thly, In a good soil, having a favourable exposition, well drained and worked for a number of years, I have never seen any canes with above thirty-eight or forty joints; nor have I ever seen any that had so many when the length of the cane has fallen short of four feet and a half, nor this except in pretty good years.\n\n6thly, I have never seen the first joint of the cane appear in such a soil sooner than the fourth or the middle of the third month.\n\nNor, seventhly, have I ever cut such canes at the fourteen or fifteen months end, but I found some that were either rotted or dried, according to the season; rot-\n\ntion de leur valeur réelle: les secondes productions sont les seules qui subsistent alors dans leur perfection; les troisièmes et quatrièmes ne l'ont pas encore atteinte.\n\n5e observation, Dans un bon terrain bien exposé, égouté, et travaillant depuis plusieurs années, je n'ay jamais vu de cannes qui eussent au delà de 38 à 40 nœuds, ny cette quantité de nœuds dans une longueur moindre de 4 pieds et demi, et ces 4 pieds et demi avec leur 40 nœuds seulement dans des années assez favorables.\n\n6e observation, Je n'ay jamais vu la canne nouée dans cette espèce de terrein avant le 4e mois ou le milieu du 3e.\n\n7e observation, Je n'y ay jamais vu couper les cannes à 14 ou 15 mois sans en trouver de pourries ou desfechées suivant la saison, pourries si je les coupois après\ncultivating Sugar Canes.\n\nfed when I cut them after the January rains; dried when I let them stand the three dry months, and cut them in April.\n\nMay one not infer from the fifth and sixth observations, that from thirty-eight to forty joints are nearly the ne plus ultra of the growth of the cane in a good soil, with a favourable exposition; and that these thirty-eight to forty joints are the produce of a like number of weeks which elapse from the appearance of the first joint, at the fourth month's end, or a fortnight sooner; consequently, that the only difference between the growth of the canes in such a soil, and what it would have been in a moist one, is only that the former joint four or five weeks later than the last would have done.\n\nAnd\n\nlès pluyes en Janvier, dessechées si je les coupois après trois mois de sec en Avril.\n\nNe peut-on pas conclure de la 5e et 6e observation que les 38 à 40 nœuds sont à peu près le non plus ultra de l'accroissement des cannes dans un bon terrein bien exposé et égoutté, que ces 38 à 40 nœuds sont le travail de 38 à 40 semaines écoulées depuis la sortie du premier nœud à 4 mois, ou 3 mois et demi; et qu'ainsi, l'accroissement des cannes dans un pareil terrein ne diffère de celui qu'elles prendroient dans un terrein humide que des quatre ou cinq semaines qu'elles nouent plutôt dans celui-ci que dans l'autre.\nAnd may not one infer from the fifth, sixth, and seventh observations put together, that in a good soil, with a favourable exposition, and well drained, the canes of the first production may live the fourteenth month through, perhaps, if they have got to the fourteenth in February, and the dry weather be not excessive, reach to the sixteenth? but that their existence from thirteen months to fifteen will be like that of a stout hale man between forty and five and forty, who is much mistaken if he thinks himself as strong then as he was at thirty-five? Whence it follows, that it must be advantageous to cut the canes, which grow in such a foil, at the twelve month's end, if the other circumstances of the method which has been adopted allow it; or even at the end of eleven months, if these circumstances require it: because in this last case one may expect a compensation.\n\nEt ne peut on pas conclure de la 5e, 6e, et 7e observations réunies que dans un bon terrain bien exposé et égouté les cannes de la première production peuvent bien se soutenir jusqu'à 14 mois peut-être même jusqu'à 15, si elles ont atteint le quatorzième en Février et que le sec ne soit pas bien vif, mais qu'il en sera de leur état depuis 13 mois jusqu'à quinze, comme de celui d'un homme sec et nerveux depuis 40 jusqu'à 45 ans, qui s'abuse s'il croit être aussi vigoureux qu'à 35. D'où il suit qu'il ne peut être qu'avantageux de couper dans un pareil terrain les cannes à douze mois si les autres circonstances du système qu'on aura adopté peuvent le permettre; et même à 11 mois, si les autres circonstances l'exigent; parce que dans ce cas on peut espérer un dédommagement dans la vigueur\ntion in the additional vigour given to the stump, for the disadvantages mentioned above by thus cutting before the usual time.\n\nObservation the 8th, In a dry but good soil, not manured, but well worked and seconded by the season, I have never seen canes with more than from thirty to thirty-four joints, and these on a length of from three to four feet.\n\nObservation the 9th, I have never seen the first joint of these come out sooner than at the end of four months or four months and a half.\n\nObservation the 10th, When I have cut these at the fifteen months end, I have always found them standing, but very dry, and sometimes a little changed.\n\nMay we not infer from the eighth and ninth observations, that from thirty to thirty-four joints is nearly the\n\nvigueur qu'on procure à la souche par une coupe anticipée.\n\n8e observation, Dans un terrain sec, quoique bon, point fumé, mais bien travaillé et très aidé de la saison, je n'ai jamais vu de cannes qui eussent au delà de 30 à 34 nœuds, et cette quantité dans une longueur de trois à quatre pieds.\n\n9e observation, Je n'y ai jamais vu le premier nœud sortir avant quatre mois, 4 mois et demi.\n\n10e observation, Lorsque j'ai coupé ces cannes à 15 mois, je les ai toujours trouvées sur pied, mais très sèches et quelquefois un peu altérées.\n\nNe peut-on pas conclure de la 8e et 9e observation que ces 30 à 34 nœuds sont\nne plus ultra of the growth of the canes in a soil which is good, though dry; not manured, but pretty well worked, and seconded by the season?\n\nAnd may we not infer from the three observations put together, that these thirty to thirty-four joints are the work of as many weeks which have elapsed since the appearance of the first joint at the end of four months or four months and a half? consequently, that the growth of the cane in such a soil is nearly equal to what it would be either in a moist or in a well-manured soil, having a good exposition, with this difference however, that the moister the soil is, the quicker the canes joint, and the thicker and longer the joints are: still, however, all the real growth of any consequence takes place in the space of from eleven to twelve months.\n\nObservation\n\nà peu près le non plus ultra de l'accroissement des cannes dans un terrein bon, quoique sec, point fumé, mais assez bien travaillé et aidé de la saison.\n\nEt ne peut-on pas conclure des trois observations réunies, que ces 30 ou 34 nœuds sont l'ouvrage d'autant de semaines écoulées depuis la sortie du premier nœud à quatre mois quatre mois et demi, qu'ainsi l'accroissement des cannes dans un pareil terrein, est à peu près égal à celuy qu'elles prendroient dans un terrein humide ou dans un autre bien exposé et egouté, avec cette difference cependant que les cannes nouent d'autant plus vite que le terrein est plus humide, et que dans ce cas les nœuds sont plus gros et plus longs, mais qu'enfin tout l'accroissement réel se trouve renfermé dans l'espace d'environ douze à 13 mois...\nObservation the 11th, In a soil which is drier and more parched, particularly in one where tilling or the season have not a little made up for the disadvantages of the exposition and the soil, I have never seen canes with more than from twenty-four to twenty-eight joints; but this number I have seen even on canes which were not more than two feet high.\n\n12thly, I have never seen the cane joint earlier than the end of the fifth month in this sort of soil.\n\n13th, Whenever, after having attempted to cut these canes in January, at fifteen months, I have waited for them till April, in consequence of not being satisfied with their appearance, I have not it is true found one of them rotted, but I have found many dried up.\n\n14th,\n\n11° observation, Dans un terrain plus sec, plus aride, et sur tout si le travail ou la saison n'ont pas un peu balancé le désavantage de l'exposition et du sol, je n'ai jamais vu de cannes qui eussent au delà de 24 à 28 nœuds, et j'ai vu cette quantité de nœuds même dans des cannes qui n'avoient que deux pieds de haut.\n\n12° observation, Je n'ai jamais vu dans un terrain de cette espèce la canne nouée avant cinq mois.\n\n13° observation, Lorsqu'ayant voulu couper les cannes en Janvier à 15 mois, et n'ayant pas été satisfait de leur état actuel, je les ai attendues jusqu'en Avril, je n'en ai pas trouvé à la vérité une seule de pourrie, mais j'en ai trouvé beaucoup d'entièrement desséchées.\n14th, When canes planted in the same kind of soil have been either of twelve or fifteen months growth in March or April, and that, either unwilling or unable to cut them then, I have waited till May or June, I have always found many dead stumps, the first productions entirely dried up in those which had stood out best, and the second so changed that it has been with great trouble and great attention that I have been able to make sugar of them.\n\nMay not one infer from the eleventh, thirteenth, and fourteenth observations, that from twenty-four to twenty-eight joints are the greatest growth which canes can take in such a soil?\n\nAnd may one not infer from the twelfth observation, that these joints are the produce of an equal number of weeks,\n\n---\n\n14° observation, Dans ce même terrain, lorsque les cannes ont eu dans le mois de Mars et d'Avril soit 12 soit 15 mois, et que je n'ay pas voulu ou pu les couper alors, j'ai trouvé au mois de May et de Juin suivant, beaucoup de taches mortes, j'ai trouvé dans celles qui avoient résisté, le plus grand nombre des premières productions totalement desséchées, et les secondes si altérées par le soleil, que ce n'a été qu'avec beaucoup de peine et d'attention qu'on a pu en faire du sucre.\n\nNe peut on pas conclure de la 11°, 13°, et 14° observation que ces 24 à 28 nœuds des cannes dans cette espèce de terrain sont le non plus ultra de l'accroissement qu'elles peuvent y prendre.\n\nEt ne peut on pas conclure de la 12°, que ces 24 à 28 nœuds sont l'ouvrage d'autant\nweeks, which being added to the five months or five-months and a half, which elapsed before the appearance of the first joint, make only twelve or thirteen months of real growth, both for the canes which are planted in a dry soil, and for those which are planted in a moist one, the difference only, as I observed higher, there is between the length and thickness of the joints excepted?\n\n15th observation, When good care has been taken to manure and work these dry places, I have always seen the productions of them every way equal to those which had come from a soil well exposed and well drained.\n\n16th observation, When heaps of dung have been laid upon particular parts of such a soil, in order to distribute them thence throughout the remainder of the plantation, I have always seen the canes, grown in which had those places which had been covered with the dung, rotted or dried\n\nd'autant de semaines qui jointes au cinq mois, cinq mois et demi ecoulés avant la sortie du premier nœud ne font que douze à 17 mois d'accroissement réel dans les cannes du terrein le plus humide, refermé comme j'ai dit plus haut la différence de longueur et de grosseur des nœuds.\n\n15e observation, Lorsqu'on a eu soin de travailler parfaitement et de bien fumer ces endroits arides, j'y ai toujours vu les productions égales en tout à celles d'un bon terrein bien exposé et égouté.\n\n16e observation, Lorsqu'on a fait des tas de fumier sur quelques parties de ce terrein sec et avide pour les distribuer dans le reste de la pièce, j'ai toujours vu les cannes dans ces petits espaces qui avaient été couverts de fumier, pourries\ndried (according to the season) at the thirteen months end, as the canes of the moist soil were. This difference, however, I found between the two forts when both were cut at the twelvemonths end; the sugar which was made of the canes that had grown on the soil that was too much dunded burned in April; whereas that made from the canes of the moist soil was finer than than at any other season.\n\n17th, I have seen the effects of these heaps of dung ten years after. The part which had been covered with it gave excellent productions at that distance of time.\n\nMay we not conclude from the fifteenth and sixteenth observations, that it is always the fault of the planters, and never that of the plant, if it happens that the cane is not fit to cut at the twelve months end? Now, supposing\n\nou desfechées, suivant la saison, à 13 mois, comme les cannes du terrein humide; j'y ai cependant observé cette différence qu'en les coupant les unes et les autres à douze mois, le sucre des cannes du terrein trop fumé bruloit en Avril, et que celuy des cannes du terrein humide, se feloit alors plus beau qu'en aucune autre saison.\n\n17° observation, J'ai vu, même après dix ans, l'effet de ces tas de fumier, et tous les espaces sur lesquels ils avoient été mis donner encore d'excellentes productions.\n\nNe peut-on pas conclure de la 15° et 16° observation que c'est toujours la faute du cultivateur et jamais celle de la plante si la canne n'est pas bonne à couper\nposing that the canes planted in October and November are fit to be cut at the end of the twelvemonth, the rains which fall at that time prevent the making any sugar, unless one chooses to make it execrable, and kill all one's cattle. I say nothing of December plantations, because, except in very highly favoured soils indeed, it is rare that one plant in ten succeeds, the dry weather is too near.\n\nMay we not infer from the seventeenth observation, that it is likewise the fault of the planters, and by no means that of the soil, if the latter does not afford excellent productions, that is, in other words, good rattoons at the sixth cutting?\n\nFinally, may we not infer from the history of the cane in all kinds of soils, that if there be any in which it can\n\ncouper à 12 mois; or en supposant que les cannes plantées en Octobre et Novembre fussent bonnes à couper douze mois après, la pluye qui tombe alors en abondance ne permettroit pas de faire du sucre à moins qu'on ne voulut le faire abominable et ecraser les bestiaux. Je n'ai point parlé ici des plantations de Decembre parce qu'il est rare que dans les terreins qui ne sont pas privilegiés, il en réussisse deux ou trois sur dix, le sec est trop voisin?\n\nNe peut-on pas conclure de la 17e observation que c'est aussi la faute du cultivateur, et point du tout celle du terrain, s'il ne donne pas encore d'excellentes productions, c'est à dire en d'autres mots, de bons rejettons, à la sixieme coupe.\n\nEt ne peut-on pas enfin conclure de l'histoire générale de la canne dans toutes les espèces de terreins, que s'il en est, ou elle peut subsister jusqu'à 15 et 16 mois.\ncan exist till the fifteenth or sixteenth month, it never grows to any kind of purpose in any after the thirteenth? Perhaps the accuracy with which I have followed it may authorize me to say boldly after the twelfth.\n\nHistory of a singular revolution in the inside of the cane, and of the arrow which comes out in consequence of that revolution, and constitutes the last stage of the plant's existence.\n\nA principal and necessary effect of the dry weather on the cane is, the diminution of the watery parts of its juice. There is no reason, therefore, for being surprized, either that the same quantity of canes which affords from 140 to 160 gallons of it in January should only afford 90 to 100 in April, or that there should be as much\n\nmois, elle ne croît cependant jamais d'une façon utile au delà de 13 ? peut être même dirai-je affirmativement douze, après l'avoir suivie jusques dans son dernier développement.\n\nHistoire d'une revolution singuliere dans l'interieur de la plante ; de la fleche qui la suit, et qui forme le dernier developpement de la canne.\n\nL'effet principal et necessaire du sec sur la canne, est la diminution de la partie aqueuse de son jus; l'on ne fera donc point surpris que la même quantité de cannes qui en donne au mois de Janvier 140 à 160 gallons, n'en donne que 90 à 100\nmuch sugar made from the latter as from the former. This follows of course; but it should seem, that upon the return of the rains, the cane should recover the water, which the heats of February, March, and April, had made it lose: the reverse, however, is what in fact happens; not only the quantity of the juice is less, but the quality of it is worse; it contains less sugar in it, and when the weather is fairly settled, when the rains are frequent and abundant, which generally happens from the first of July to the 13th of August, the whole vegetative faculties of the plant seem employed in the production of the arrow, see oop, fig. 1. During that time the body of the cane is almost totally destitute of juice, which is carried in great plenty towards the head of it. Soon after there comes out from the top of the arrow, a thin\n\nà 100 dans le mois d'Avril, n'y que ces 90 gallons d'Avril donnent autant de sucre que les 160 de Janvier: mais il semblerait qu'au retour des pluies, la canne devrait recouvrer l'eau qu'elle a perdue par le soleil constant de Fevrier, Mars, et Avril; c'est le contraire qui arrive; non seulement le jus diminué, mais sa qualité se détériore, il contient moins de sucre, et lorsque le renouveau est tout à fait décidé, que les pluies sont fréquentes et abondantes, ce qui arrive ordinairement du 1 Juillet au 15 d'Aout, il semble que tous les efforts de la vegetation soient consacrés à la production de la fleche, v. oop, fig. 1. Le corps de la canne est alors presque totalement déstitué de son jus qui se porte en abondance vers la tête de la plante; bientôt il sort de son extrémité une tige\nthin pointed stem, which grows about three feet high in the space of five or six weeks, then blows at the end, and is crowned with a panicle like that of a reed. \\( \\text{oop}, \\text{fig.} \\) 1. shows the arrow crowned with its panicle; it is commonly full-blown towards the end of October, withers soon after, and falls in the following month. Some people pretend, that this panicle contains the seed of the cane; I have sown the kind of seed or dust which comes from it, and nothing has come up. Perhaps the cane which is propagated by shoots bears only empty husks. Be this as it may, when once the arrow has appeared, the cane is in its last stage.\n\nAfter the fall of the leaf, which takes place a little sooner or a little later, according to the season, the joints which preceded it dry up, in their order. This mortification,\n\nassez grêle et pointue qui s'élève dans l'espace de cinq à six semaines jusqu'à la hauteur d'environ trois pieds, se développe enfin par sa pointe et se couronne d'un panache semblable à celui du roseau. \\( \\text{oop}, \\text{fig.} \\) 1. présente la flèche couronnée de son panache; elle est ordinairement tout à fait développée à la fin d'Octobre; peu après elle se dessèche, elle tombe le mois suivant. Quelques personnes prétendent que ce panache contient la semence de la canne, je n'en fais rien, mais j'ai semé l'espèce de poussière ou de graine qui en sort, et rien n'a levé, peut-être que la canne qui vient de bouture ne porte que des graines folles. Quoi qu'il en soit, après que la flèche est sortie, la canne est à son dernier période; et un peu plus tôt, un peu plus tard, après la chute de la feuille (toujours suivant la saison) les nœuds qui la précèdent se dessèchent successivement, etc.\ntification, if I may so call it, never stops, except when there happens to come out a kind of spurious top about the eighth or ninth joint from the arrow, see l, m, fig. 1.\n\nIt comes out of two joints which blow after the fall of the arrow, when there happens to be much rain. This spurious head serves much the same purposes as the true one; for it assists, maintains, and preserves the action of the sap in that part of the cane which still remains alive, so that whenever there is not rain enough to produce it, the last joints die off like the former.\n\nIt is farther to be observed with regard to the arrow, 1st, that this any more than the ripeness does not depend upon the age of the cane, but upon the season. In October and November the canes of six months growth bear arrows like those of twelve or fifteen months; but all canes do not bear arrows.\n\n2d, Though\n\ncette gangrene, si j'ose m'expliquer ainsi, n'est-antecé que lorsqu'il se forme une espèce de fausse tête vers le 8e et 9e avant dernier noeud, v. l, m, fig. 1.\n\nCe sont deux noeuds qui se développent après la chute de la flèche, s'il y a beaucoup de pluie, et qui forment cette fausse tête qui fait en partie l'office de la première, puis qu'elle entretient l'action de la sève dans la partie de la cane qui reste encore saine, et que s'il ne fait pas assez de pluie pour que ces deux noeuds se développent, tous se dessèchent successivement jusqu'à la racine.\n\nObservons encore par rapport à la flèche, 1°, qu'ainsi que la maturité, elle n'est point l'effet de l'âge de la cane, mais de la saison; dans le mois de Septembre ou d'Octobre les cannes de six mois flechent comme celles de 12 et de 15; mais toutes les cannes ne sont pas susceptibles de ce phénomène.\n\nM in 2\n\n2°, Que\n2d, Though some canes have no arrow, they are all subject to that internal revolution of which I have spoken, viz. the diminution and impoverishment of their juices.\n\n3d, Whenever in a plantation, the soil of which, though good, had been accidentally abandoned, there has happened to be found a shrub strong enough to serve as a prop to a cane having an arrow and shoots from its eighth or ninth joint (l, m, fig. 1); these shoots have each of them produced a cane far inferior indeed in beauty to that out of which they had themselves sprung, but which, doubtless, would have wanted nothing to have born an arrow and canes in their season also, but such another shrub as that to which they owed their existence.\n\nI know nothing of the observations upon which the opinion is grounded, that the cane does not come to perfection\n\n---\n\n2°, Que les cannes qui ne flechent pas n'en éprouvent pas moins la révolution interieure dont j'ay parlé, cette diminution et appauvrissement de leur jus.\n\n3°, Que lorsqu'il s'est trouvé dans une pièce de cannes abandonnée (bonne terre cependant) quelque arbrisseau qui a pu servir d'appuy à une cane flechée et aux jets sortis de son 8° et 9° nœud (l, m, fig. 1). Ces jets ont donné chacun une cane beaucoup moins belle à la vérité que celle dont ils sortoient, mais qui n'auroit sans doute eu besoin pour flecher dans son temps, et donner ensuite d'autres petites cannes, que d'être appuyée comme celle qui l'avoir produite.\n\nJ'ignore les observations d'après lesquelles on peut prétendre que la cane a besoin\nfection under fourteen or fifteen months. Those of which I have been giving an account seem very positively to establish that, considered with regard to its greatest usefulness, the cane is an annual plant producing by the root; consequently, the mode of cultivation which agrees best with it, that which will answer best to the planter, will be that which, considering these as the two capital points to be attended to, connects them the best with the necessary influence the seasons of the climate in which the cane grows will have upon it. Now I trust that in these two respects my method will stand the test of examination.\n\nIt remains to speak of the history of the cane according to the two methods.\n\nHistory\n\nbesoin de 14 à 15 mois pour être dans sa perfection : celles que je viens de présenter me paraissent établir d'une façon bien positive que relativement à son plus grand degré d'utilité la canne est une plante annuelle, et vivace par sa racine, qu'ainsi le système de culture qui lui convient, le système le plus avantageux au cultivateur sera celui qui aura ces deux points pour base, et qui les combinera le mieux avec les effets que doivent opérer sur elle, les différentes saisons qui règnent dans les climats où on la cultive, et j'ose croire que mon système peut soutenir l'examen à ces deux regards.\n\nIl me reste à parler de l'histoire de la canne dans les deux systèmes.\n\nHistoire\nHistory of the cane according to the two different methods of cultivation, and in different years, the favourable, the dry, and the rainy.\n\nThe history of the cane, according to both methods, flows so naturally from what I have said above, as well of the seasons as of their influence on the different productions, first, second, and third, that the bare recollection of the time and conditions of their appearance and development will be sufficient to lead us to conclude,\n\n1st, That in favorable seasons, the first productions of canes planted in October and November, and cut fifteen months after, have a greater number of joints than those of canes planted in May, and cut the year after at the end of\n\nHistoire de la canne dans les deux systemes, et dans les differentes especes d'annees, favorables, seches et pluvieuses.\n\nL'histoire de la canne dans les deux systemes decoule si necessairement de ce que j'ai dit cy dessus tant à l'egard des saisons, que de leur influence sur les differentes productions premieres, secondes, et troisiemes, qu'il suffit de se rappeller le temps et les conditions de leur sortie et de leurs developpements, pour conclure:\n\n1°, Que dans les années favorables, les premieres productions des cannes plantées en Octobre et Novembre, coupées quinze mois après ont plus de nœuds que les premieres productions des cannes plantées en May, et coupées l'année d'après\nof twelve months; but that this excess is only equivalent to the vegetation of one month, on account of the dry weather, which necessarily impedes it during the months of March and April. As to the second productions, they are equal in the two methods, those upon the larger scale of cultivation appearing in June to be cut in February, and those of the smaller appearing at the end of August to be cut in May.\n\n2d, The loss in years of drought must be a little more considerable on the small plan than on the other; because there being no second productions (of real value) in that case according to either of the plans, and the difference of the thirteenth month, with regard to the first, remaining entire, one on thirteen must of course be more felt than one on a greater number.\n\n3d, In\n\nd'après à 12 mois, mais que ce plus n'équivaut qu'à un mois de vegetation, attendu l'effet du sec qui dans une terre découverte, la suspend visiblement pendant les mois de Mars et d'Avril; et que les secondes productions sont égales dans les deux systèmes; les secondes productions de la grande culture ne paraissant qu'en Juin pour être coupées en Fevrier, et les secondes productions de la petite culture paraissant à la fin d'Aoust pour être coupées en May.\n\n2°, Que dans les années sèches, la perte doit être un peu plus sensible dans le système de la petite culture, parce que dans l'un n'y dans l'autre système on ne verra paraître de secondes productions (d'une valeur réelle) et que la différence du treizième mois sur les premières demeurant en son entier, un est plus sensible sur treize que sur un nombre plus considérable.\n\n3°, Que\n3d, In rainy years the second and third productions will be the same, according to both the methods, on account of the reason given above; to wit, the equality of the time which elapses between their first appearance and the time of their being cut; and because the advantage which the great method might expect from its first productions will be lost by their being rotten at the time of cutting.\n\nFinally, that the total difference in the produce of a number of years taken together, cannot be considerable enough not to be much more than made up for by the produce of my second crop, or rather by cutting the whole land, instead of cutting only three parts of it.\n\nNotwithstanding the strong reasons I have to determine me to the choice of the small plan, I confess the force\n\n---\n\n3°, Que dans les années pluvieuses, les secondes et troisièmes productions seront égales dans les deux systèmes par la raison que nous avons donnée cy dessus de l'égalité du temps qui s'écoule entre la sortie et la coupe des unes comme des autres, et que le bénéfice que le système de la grande culture pourrait espérer de ses premières productions se trouvera en pourriture au temps de la coupe.\n\n4°, Enfin que la différence totale sur le produit des années combinées ne peut être assez considérable pour n'être pas beaucoup plus que compensée par le produit de ma seconde récolte, ou plutôt par une récolte sur toute la terre au lieu d'une récolte sur les trois quarts.\n\nMalgré l'évidence des raisons qui devolent me decider à suivre le système de la petite culture, j'avoue que la force du vieux préjugé m'a tenu moy même très long\nforce of old prejudices long held me in suspense. I think, however, I may with confidence propose it, as I have the experience of five years to bear me up in affirming that, one year with another, there is a difference of above one sixth in its favour.\n\nEXPLA-\n\nlong tems en suspens, mais je crois devoir le proposer lorsque je puis prouver par une expérience de cinq années consécutives une différence de quelque chose de plus qu'un sixième en sa faveur, une année prise dans l'autre.\nEXPLANATION OF THE FIGURES.\n\nFigure the first shews a cane entirely without leaves.\n\nN° 1. Is the first order of roots; they come out of the joint to which the bud which is to produce the cane is fastened. All they stand in need of to make them come out is the moisture which is contained in the medullar part of the plant, and the little fermentation which arises from the want of circulation after the two extremities y and z have been cut.\n\nN° 2. Shews the second order of roots, composed of its first set aa, of its second bb, of its third cc, of its fourth dd. These four sets of the second order come out\n\nLa figure entiere represente une canne à sucre dépouillée entierement de ses feuilles.\n\nN° 1. Presente le premier ordre de racines, elles sortent du nœud auquel est attaché le bouton qui doit produire la canne. Elles n'ont besoin pour sortir que de l'humidité contenue dans la partie médullaire du plan et de la petite fermentation qui suit le défaut de circulation ou de balancement de la séve après que les deux extrémités y et z ont été coupées.\n\nN° 2. Presente le second ordre de racines composé de son premier plan aa, du second bb, du troisieme cc, du quatrieme dd; ces quatre plans du second ordre\nout of the quadruple sheath \\(abcd\\), which contained the bud. The first set of these roots cannot come out without pushing away the leaf which wraps up the whole, no more can any of the rest; I believe the part marked \\(r\\) is the neck of the plant, or the place at which it comes out of the ground.\n\nN° 3. Shews the third order of roots, composed of its first set \\(ee\\), of its second \\(ff\\), of its third \\(gg\\), and of its fourth \\(hh\\). Each of these sets as it comes out likewise throws down one of those leaves, which in the body of the work I have called the external, or proper leaves of the plant. What is meant to be shewn here is rather the place than the length of them, as they are commonly between twenty and thirty inches long. \\(x\\) and \\(x\\) are the second productions or immediate growths of the stump.\n\nThese\n\nordre proviennent du quadruple étui de feuilles féminales \\(abcd\\), qui enveloppent l'embryon. Le premier plan de ces racines n'a pu sortir sans chasser la feuille enveloppe du tout; ainsi des autres. Je crois que la partie \\(r\\) forme le collet de la plante.\n\nN° 3. Présente le troisième ordre de cannes composé de son premier plan \\(ee\\), du second \\(ff\\), du troisième \\(gg\\), du quatrième \\(hh\\): chacun de ces plans fait ainsi tomber en sortant une de ces feuilles que j'appelle dans l'extrait, extérieures ou propres de la plante: je désigne ici plutôt leur place que leur longueur puisqu'elles ont ordinairement depuis vingt jusqu'à trente pouces. \\(x\\) et \\(x\\) sont les\nThese second productions come from buds which adhere to sets of roots of the third order, which third order is the only one which gives productions out of the earth. The third productions, \\( t, t \\), come out of the second. The number of the sets of roots of the third order is unlimited. The second is confined to four sets. The part between \\( i \\) and \\( k \\) shews the effects of a very dry season; the joints are stunted, and sometimes only two lines long, instead of an inch and a half or two inches. When the rains begin again, the joints which come out are again larger; see from \\( k \\) to \\( l \\), where they are as big as they were between \\( b \\) and \\( i \\).\n\nThe part from \\( l \\) to \\( n \\) is what is made use of for planting; \\( yz \\) is the plant without its leaves. It is, however, commonly put into the ground with its leaves, as in\n\n---\n\nsecondes productions propres de la souche, ces secondes productions sortent des boutons attachés aux plans de racine du troisième ordre qui seul donne des productions hors de terre. Les troisièmes productions \\( t \\) et \\( t \\) sortent des secondes. Le nombre des plans de racine du troisième ordre est illimité; le second ordre est borné à quatre plans. Depuis \\( i \\) jusques à \\( k \\) on voit l'effet d'un sec très vif, les nœuds sont étranglés et n'ont quelquefois que deux lignes au lieu d'un pouce et demi deux pouces. Lorsque les pluies recommencent les nœuds qui sortent sont plus longs, comme on les voit depuis \\( k \\) jusqu'à \\( l \\), tels qu'ils étoient depuis \\( b \\) jusqu'à \\( i \\).\n\nLa partie depuis \\( l \\) jusqu'à \\( n \\) est celle qui sert de plan; \\( yz \\) est le plan dépouillé de ses feuilles, on le met cependant en terre avec ses feuilles tel qu'il\nin figure 7th. \\( u \\) is the ligament by which the bud is fastened to the plant. \\( oo \\) is the last production of the plant, and is called the arrow; it appears at first as an arrow (\\( oo \\)), and is then crowned with a pannicle \\( p \\); it shoots in September or October, and falls in November or December. It is said, that this pannicle contains the seed of the plant.\n\nI have sown it, but nothing has come up. When the arrow has dried, and is fallen off, the joints below it dry one after the other, when there is little or no rain; but if there happens to be much rain, the eighth and ninth, or tenth and eleventh joints from the top (see from \\( l \\) to \\( m \\)) unfold, and form a second head, which keeps up the vegetation in the lower part of the plant some time longer. If these joints were to be supported as\n\n---\n\nqu'il est dans la figure 7. \\( u \\) est l'ombilic par lequel l'embryon est attaché au plan. \\( oo \\) est la dernière production de la canne; on l'appelle la flèche; elle paraît d'abord comme une flèche telle qu'elle est en \\( oo \\) et se couronne ensuite d'une panache \\( p \\), elle sort en Septembre ou Octobre, et tombe en Novembre ou Décembre. On prétend que ce panache contient la graine de la plante.\n\nJ'ai semé cette prétendue graine, rien à levé. Après que la flèche est séchée et tombée, les nœuds qui la précèdent se dessèchent successivement, s'il ne pleut que très peu, ou bien les huitième et neuvième, ou dixième et onzième avant dernier nœud \\( lm \\) se développent et forment une seconde tête qui entretient encore la végétation dans le reste de la plante. Ces nœuds appuyés à mesure qu'ils...\nas they come out, they would produce canes, but of an inferior sort to the others. All canes have not arrows, and the coming out of an arrow depends on the season, and not on the age of the cane.\n\nse développant donneroient des cannes aussi mais beaucoup moins belles que les autres; toutes les cannes ne flechent point; et c'est la saison et non pas l'age de la canne qui décide la sortie de la flèche.\n", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/106419.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 79, "total-input-tokens": 124056, "total-output-tokens": 29512, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 680, 2], [680, 1874, 3], [1874, 3019, 4], [3019, 4570, 5], [4570, 6094, 6], [6094, 7639, 7], [7639, 9174, 8], [9174, 10840, 9], [10840, 12111, 10], [12111, 13101, 11], [13101, 14200, 12], [14200, 15324, 13], [15324, 16709, 14], [16709, 18431, 15], [18431, 20060, 16], [20060, 21741, 17], [21741, 23219, 18], [23219, 24901, 19], [24901, 26411, 20], [26411, 28041, 21], [28041, 29664, 22], [29664, 31289, 23], [31289, 32947, 24], [32947, 34499, 25], [34499, 36130, 26], [36130, 37826, 27], [37826, 39375, 28], [39375, 41052, 29], [41052, 42644, 30], [42644, 44242, 31], [44242, 45915, 32], [45915, 47575, 33], [47575, 49196, 34], [49196, 50158, 35], [50158, 51414, 36], [51414, 53032, 37], [53032, 54820, 38], [54820, 56570, 39], [56570, 58345, 40], [58345, 59981, 41], [59981, 61528, 42], [61528, 62995, 43], [62995, 63879, 44], [63879, 65268, 45], [65268, 67294, 46], [67294, 68771, 47], [68771, 70312, 48], [70312, 71803, 49], [71803, 73168, 50], [73168, 74845, 51], [74845, 76219, 52], [76219, 77818, 53], [77818, 79246, 54], [79246, 80764, 55], [80764, 82380, 56], [82380, 83837, 57], [83837, 85469, 58], [85469, 86777, 59], [86777, 88411, 60], [88411, 90150, 61], [90150, 91903, 62], [91903, 93448, 63], [93448, 94852, 64], [94852, 96250, 65], [96250, 97887, 66], [97887, 99507, 67], [99507, 99993, 68], [99993, 101210, 69], [101210, 102720, 70], [102720, 104453, 71], [104453, 106091, 72], [106091, 106495, 73], [106495, 106495, 74], [106495, 106495, 75], [106495, 106495, 76], [106495, 106495, 77], [106495, 106495, 78], [106495, 106495, 79]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true]}}]