[{"id": "e94046fc51a91cdce08b52bf0d0352afe840297a", "text": "ALLEGED POISONING OF A CHILD BY ITS MOTHER.\n\nOn Monday, the inquest on Mary Theresa Dore, aged four months, lately residing with her mother at No. 4, Lower Grosvenor-place, was brought to a close before Mr. Bedford, at the Malpus Arms, Charles-street, Grosvenor-square. The evidence previously heard appeared in our journal of last Sunday, and which proved that the child had died from arsenic. The following is the substance of the additional evidence given on Monday:\n\n—Mr. Buxton, surgeon, of Ryde, Isle of Wight, said that on Thursday, the 13th ult., he was called to attend the deceased by the mother, who had just arrived in that town with a female friend. He found it suffering from violent sickness and vomiting, but he had no reason to believe that it had taken poison, and he sent some medicine consisting of powders and mixture. The next morning he was called again, when the mother told him that the deceased had still been very sick, but that the last dose had remained on its stomach. He observed that a quantity of bile was mixed with what the deceased brought from its stomach, and judged it was labouring under intus-suspention of the bowels. The mother then took the child back to London.—Mr. H. Waterworth, assistant to the last witness, said that he made up the medicine prescribed. There was no arsenic kept in the surgery.—E. S. Spry, sister of the mother of deceased, said she resided with the rest of the family, at Nos. 4 and 5, Lower Grosvenor-place. The deceased had the thrush from a fortnight after its birth. The first change of importance she observed was on Wednesday night, when it appeared to have the stomach-ache, and the next morning Mr. Woolmer, the family medical attendant, was sent for, but he was absent, and Mr. Driver, one of his assistants, arrived. The deceased was not then vomiting. The surgeon was asked if a journey to the Isle of Wight would do the child harm, and he replied that it would not. Some medicine was sent, and at half-past eight o'clock the mother and child started for the Isle of Wight. The next day they both returned, and on the day after, Saturday, the 15th, the child died. The child was fed sometimes on rusks. The mother and grandmother attended to it, but if anything improper had been given, witness must have seen it. They were both exceedingly fond of the child.—Mr. Rogers, analytical chemist, said he had analysed the medicine prescribed by Mr. Woolmer's assistant, and found nothing of a deleterious nature. He added to his evidence, given on a former day, that the child must, from the appearance of the stomach, have taken arsenic at least two days before death.—Mrs. Morton, of 28, Grosvenor-street West, Eaton-square, said she had had lodgings in the house along with the deceased and the family, and it was she who took the mother and child to the Isle of Wight in return for former kindnesses she had received. The trip had been arranged for a fortnight. Witness rode in a first-class carriage, and the mother, to save expense, in a second-class. Crossing over from Gosport to Ryde the child seemed in a great deal of pain and screamed dreadfully. The mother and grandmother always showed the utmost affection for the child.—Mrs. Spry, the grandmother, here said she kept no arsenic in the house; and Mrs. Dore, the mother, that she had never seen arsenic in her life.—Mr. S. Woolmer, assistant to his uncle, Mr. Woolmer, of Lower Victoria-row, described the composition of the medicine he had made up. The arsenic was kept in a stoppered bottle, tied over with leather, on a high shelf.—The coroner then summed up the evidence, and the jury, after a deliberation of two hours, returned the following verdict:—\"That the deceased, Mary Anne Theresa Dore, came by her death by the administration of arsenic with the guilty knowledge of the persons in whose custody she was—viz., Mary Spry and Mary Ann Dore, and we find the said Mary Spry and Mary Ann Dore guilty of wilful murder.\"—Mrs. Spry, on hearing the verdict announced, exclaimed, \"I hope the Lord will forgive you all, gentlemen.\"—Mrs. Dore, the mother, burst into tears.—They were both committed to Newgate.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206192450.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 999, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4150, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]