[{"id": "ece603e87014eaca2e2aa3edba34867236b3af11", "text": "THE TRIAL OF THE INDIAN OCCULTISTS.\n\nAt the Central Criminal Court, on Monday, before the Common Serjeant, the trial of the four Indian occultists, Heeri Shah, alias Kream Bocesh, Khair Desai, alias Cade, Shahab Bedean, and Karim Bakhsh, on an indictment charging them with a conspiracy to defraud, and with obtaining money by false pretences, in connection with operations for disease of the eye, was resumed for the sixth day.\n\nThe Common Serjeant summed up with great detail. Dealing with the evidence called for the defence, his lordship observed that it could not be disputed but that the prisoners did have some knowledge of eye diseases, although their methods might have had sanction one hundred years ago. Still there was the fact, which had been deposed to by several witnesses, that the treatment used by the Indians had a beneficial effect, and had given satisfaction. It was evident that in some of the cases the Indians were not in a position to diagnose the diseases to the eyes from which some of the patients suffered, as, for instance, atrophy of the optic nerve, which required the use of the ophthalmoscope. No feeling of indignation or displeasure was manifested against these people until the prosecution, when everybody seemed to rise in arms against them. The suggestion of jealousy on the part of the medical profession against these persons was of the wildest stretch of imagination which the learned counsel for the defence could ever have indulged in. All, he thought, would agree that the action which the society had taken was in the best interests of the community, and perfectly justified by the circumstances under which the conduct of the prisoners presented itself. The responsibility of the decision of the conduct and behaviour of the men rested with the jury. Had the prosecution established that these men, either by their conduct or treatment, together with the other circumstances connected with their proceedings, been guilty of conspiring to defraud, and had defrauded, by means of false representations. In this respect the jury had to say whether the prisoners wickedly and deliberately performed operations which they knew to be perfectly useless, and performed them with the full knowledge that they were unnecessary and cruel, and with the object of fraud.\n\nThe jury retired to consider their verdict at fifteen minutes past one. After an absence of two hours they returned into court with a verdict of not guilty. The foreman added a rider to their verdict to the effect that they (the jury) deeply regretted that at present there existed no law which would prevent such persons, with the gross ignorance of the prisoners, from practising surgery.\n\nThe Common Serjeant (to the Jury): I quite concur in your verdict and the rider which you have added. He added that he thought that the verdict of the jury was the safest one at which they could have arrived. The jury were exempted from further service for six years.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812246.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2965, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]