[{"id": "b34bc5d36ef0dc83ea586cdb873c10deae22abf0", "text": "ALLEGED BABY FARMING.\n\nA inquest was held at Newport Pagnell, North Bucks, on Monday, on a boy named Lovell, aged two-and-a-half years, who died suddenly while in the charge of Mrs. Arnold, of Newport Pagnell.\n\nJessie Chapman, of Newington-villas, Zion-road, Thornton-heath, Croydon, deposed that about two-and-a-half years ago the child was brought to her by Mrs. Arnold, who said it belonged to her niece, and she could not keep it herself. It was then only five or six weeks old, and was a very small child. Witness was licensed to take children. The infant had always been a miserable one, and she had taken it backwards and forwards to Bartholomew's hospital. It was pretty well when she took it back to Mrs. Arnold, but it could not walk by itself. Arnold first paid her 25s. a month, which was subsequently reduced to 5s. 2l. 17s. was now owing. Arnold told witness that the mother was dying of consumption in a hospital. A lady once called about adopting the child, she having answered an advertisement. After the last inquest in London in which Arnold was concerned witness tried to induce her to take the boy. Once Arnold told her she was going to see about another baby. She knew other people had had children from Arnold. None of the doctors that had seen the child had suggested that it was suffering from inflammation of the bowels. A medical man told her that she could safely take it to Newport Pagnell.\n\nMrs. Arnold, a well-dressed woman, was examined as to the maternity of the deceased, but now asserted she had had no communication with the mother. She did not know who she was even, but the man who gave her the child said she was dead. She had only seen the father at Clapham junction. In communications with him she wrote to High Holborn. She heard of Mr. Williams by advertisement. She had none of Williams' letters by her. The jury were not satisfied with the evidence, and the inquiry was adjourned for an analysis of the stomach.\n\nA FRIVOLOUS OBJECTION.—Justices Field and Cave, in Divisional court of Queen's Bench, had before them, on Monday, the case of \"The Queen v. the Corporation of Newcastle,\" whose committee had disapproved of plans of a building lodged with them, on the grounds that it would be unsuitable to the locality and injurious to the neighbourhood to have such a building, to be let in tenements, as proposed. The court held that the corporation had no power to disapprove of the proposed building on such grounds, and made a rule for a mandamus absolute.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206269232.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 606, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2503, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]