[{"id": "611bdb5200313df9573290dd697a599422cec465", "text": "NOTICES TO CORRESPONDENTS.\n\nP. J.—The offer of our seed for nothing but a postage stamp turns out a swindle. We have now several letters complaining that they sent stamps as required, and received—nothing. We cautioned people early enough.\n\nK. (Stowmarket).—Lime water is the only thing that will kill the grub and not damage the plant. Auricula seed is generally half a crown or five shillings a packet, but the quality is uncertain.\n\nH. W.—The Egyptian pea is curious, and as good as the ordinary sorts to eat.\n\nCucumbers.—A.—Make the hot-bed four feet thick of dung, let there be six or eight inches of good loam from rotted turves; place two plants in the centre of your sized frame. Sow your own seed if you can; but nurserymen will supply the plants.\n\nAIREDALE HORTICULTURAL AND POULTRY SHOW.—We see nothing really objectionable in the schedule enclosed by J. C., but we prefer less number of subjects and more prizes for each if we have any control. The prizes for cut flowers are too numerous by half. Such spinning out of the prizes enables one man to carry off too many. Still, according to the present system, it is as good as its contemporaries. The show being on the 14th of August, pinks will not be good for much.\n\nD. J.—Messrs. Dillistone and Co., of Sturmer, keep collections of rock plants; they generally run from 20s. to 25s. per 100, or 5s. per dozen.\n\nDelays must often occur in answering correspondents in the paper; our portion is printed first, and the answers are often ten days old, which, in pressing matter, must often be useless. For the twentieth time we beg correspondents who desire early answers to address us at Duggan's house, Fulham; and enclose a directed envelope. We wish to be useful to all the readers of Lloyd's. When the answers interest the public, we will insert them in the paper in due time.\n\nAn Amateur.—We cannot entertain complaints of vegetable seeds, when the failure may be the result of mismanagement or bad seasons.\n\nR. (Exeter).—Very fine flower in other respects, but sadly notched in the petals—a capital bedding variety.\n\nH. B. M.—Too late for a pear tree. Williams's Bon Chrétien will be the best. Have a one year trained tree, and plant in November.\n\nJ. C.—Any nursery will supply you with a scarlet geranium. You must begin with a young plant. But is it to be protected? It will not live out of doors.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206310339.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 610, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2364, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]