[{"id": "0497cadfdb0c53439b9ac23f401b79f8ee9098e2", "text": "CURIOUS ACTION AGAINST MRS. MONSON'S MOTHER.\n\nAt Manchester Assizes, on Thursday, the case of the Lancashire Reversionary Interest Company v. Day, in which Mr. Monson is concerned, was heard. Its public interest turned on the fact that defendant, Mrs. Day, is the mother of Mrs. Monson, and among the witnesses was Mrs. Monson herself. It had some bearing on the Ardiamont matter, as showing the sort of monetary transactions in which Monson was engaged. The issue of the case, which had reference to a loan of £600 by the plaintiff company, was briefly whether or not the signature of Mrs. Day was really her signature or a forgery. One of the clauses of the document which was in question was alleged to be written personally by Mr. Cecil Hambrough, whose death is now the subject of inquiry. Mrs. Monson's evidence was that on September 19th, 1890, Mrs. Day, her husband, and herself executed the deed in question, and Mrs. Day signed the document. She was familiar with her mother's handwriting, and she was also confident that the attesting clause was in Hambrough's writing, with which she was also acquainted. In her cross-examination Mrs. Monson said that she had occasionally been much troubled for money since her marriage, and her husband had latterly been a good deal in the hands of money-lenders. The evidence of Monson, which was taken on commission at Edinburgh, was corroborative. Mr. Yates, on behalf of the defendant, said he did not hesitate to suggest that the signature to the deed was a forgery by Monson. Mrs. Monson had given evidence against her mother, but they must bear in mind that this case might have an important bearing upon another and a graver case, and when she faced the necessity of sacrificing either her husband or her mother, wifelike she stuck to her husband. Specimens of Lieutenant Hambrough's writing were put in, but nothing further of a sensational nature occurred during the hearing of the case. Mr. Yates, Q.C., addressing the jury on behalf of Mrs. Day, contended that the signature was a forgery. He asked the jury whether they did not think that Monson, who had forged one deed and was practised in the art, was likely to do it again when he was hard up. They knew his position, writs were pouring in, he was in want of money, and he had done this sort of thing before. Mr. Smyley, for the plaintiff, expressed surprise at the audacity of Mr. Yates in stating that Monson had forged other deeds. No such thing had been proved, and it was most unfair to bring such accusations against a man over whose head such a serious charge was at present resting. At the conclusion of counsel's address, the jury at once returned a verdict for Mrs. Day.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812374.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 643, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2694, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]