[{"id": "a105a8be3e3a4fd97a1230b69b0e6d5626d4c604", "text": "HORRIBLE ATTEMPT TO MURDER.\n\nA horrible and almost fatal attempt at murder took place on Thursday evening at Woodton, near Loddon, about ten miles from Norwich. It appears that the accused lived with his sister, but was an idle, good-for-nothing fellow, his name being William Millett. He had recently suffered fourteen days' imprisonment for breaking windows of the house, from which he was expelled for his idleness. Ever since his liberation from prison he has frequently threatened her life; and on Thursday evening he (the accused) entered his sister's house, an elderly woman being also present with the poor unfortunate victim. Millett, as soon as he entered the room, snatched from the table a large table-knife, rushed at his sister, and cut her throat. The woman ran away frightened to give an alarm, and the poor girl struggled away from her would-be assassin into the yard, whither he followed her, and recommenced his attack. The poor creature's hand was frightfully cut, and her throat gashed three or four times; but the knife not being very sharp she was not killed on the spot, and up to yesterday afternoon she had not expired. The accused was apprehended on Friday, taken before the magistrates, and remanded.\n\nFRIGHTFUL DEATH.—A man named Henry Gardner, employed at the Wenlock Saw Mills, City-road, met with a horrible death on Tuesday. He had gone down into the ash pit, where the furnace of the boiler is fed, and in walking down the steps must have slipped and fallen against the cog-wheel of the drum, the result being that he was literally torn in pieces. The poor wife, not having her husband come to breakfast as usual, went to the mills to learn the cause, and was amongst the first to learn the sad news.\n\nTHE FATAL \"LARKING\" ON A PIER.—On Tuesday night an inquest was held at St. Bennett's-hill on the body of Ellen Mahoney, aged seventeen years. This was the case reported some time ago on the occasion of the inquest on the body of a young man named Regan, who with the deceased and some other young people, were \"larking\" late at night on the Old Swan pier, when the couple fell into the river and were drowned. Verdict, \"Accidental death.\"\n\nPRINTED and PUBLISHED at 12, Salisbury-square, in the City of London, by EDWARD LLOYD, of Walthamstow, Essex, and LLOYD'S PAPER MILLS, Bow-bridge, near London, and Sittingbourne, Kent.—March 17, 1867", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206227140.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 588, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2375, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]