[{"id": "ef2413267fd1d30ccddae85fc807cc4baf8bcc92", "text": "THE MURDER IN SOMERSETSHIRE.\n\nAt a place called Lype, in the parish of Cotleigh, on the old Minehead and Dunster-road, at the northern extremity of the Brendon-hill, and about six miles from Danster, lived a widow named Coles, with her son and daughter, the former about eighteen years of age, and the latter about eleven. It is a very lonely place, and the house in which they lived having been divided into two, the other was occupied by an aged woman named Norman. Near these houses was a barn, which had not been used for many years, and consequently it is in a very dilapidated state, the wooden floor being gone, and only some stone sleepers remaining.\n\nThe mother of the poor girl, Coles, the victim of this diabolical crime, left her house on the morning of Tuesday last, to go to work, and shortly after she returned, accompanied by a neighbour, to attend to the affairs of the house. About ten o'clock the old woman, Mary Norman, who is eighty-five years of age, in going along the passage through the houses, observed that the door of Cole's house was open, and saw the deceased sitting on one side of the fire-place, while a man named Bailey, who lived at a short distance, was seated on the other. The deceased was not seen alive after that time.\n\nAbout eleven o'clock a man named Sedgebeer, who was working opposite the entrance to Lype, saw Bailey advancing towards the place at which he (Sedgebeer) was in a hurried manner; and, on arriving at the spot where he stood, he said that Bailey was laborious under exertion. But this proceeded to the quarry at which deceased's brother was working, and remained there occasionally working for a short time, during which he partook of the dinner. At four o'clock Bailey left the quarry, and soon afterwards he called at the cottages at Lype, and inquired if \"the old woman (Coles) or any of them\" had returned. His mother replied in the negative, and he then went away. About seven o'clock the boy Coles returned, and, missing his sister, he went to meet his mother, who returned with him, and made inquiries for the poor girl at some neighbouring cottages. Failing to obtain any information respecting her, they searched their own premises, and ultimately came to the door of which they had inquired. The mother went in, and going to a dark part of the barn discovered the body of her child, whose clothes had been thrown up over her person as far as she could see. She carried the body to her house, and then it was seen that her throat had been cut in a most horrible manner.\n\nInformation of the circumstances having been given to the constables, they immediately proceeded to the house of Bailey's father, who lives at a short distance from the cottages, but whose house is in the parish of Luxborough. They found the son in bed, and, having seen that they were come to take him into custody, he charged them with murder, the prisoner answered, \"I didn't murder her,\" but admitted that he had been at the house on his way from work, and stated that on leaving she accompanied him a short distance, and then returned. On him was found a knife, which was, of course, taken from him.\n\nOn examining the barn blood was found on some ashes near the door, and also part of a bucklestrap, which was identified as belonging to the prisoner; the other part was found upon him.\n\nNear the barn is a stream of water, and a little beyond this, from the barn, was discovered a footprint, which corresponded with one of the prisoner's boots. This mark was in a place which a person would pass over in proceeding from the barn to the gate at which Sedgebeer was when the prisoner went towards him. On examining the prisoner's clothes blood was found in different parts, and there was a line of blood over them from left to right, which had been partially washed out.\n\nOn Friday, Mr. Hole, surgeon, made an examination of the body of the deceased, being accompanied by the coroner, Mr. Munckton, and marks of two severe blows were found on the top of the head, and also a mark of a severe blow over the left eye. There were two slats in the neck, one on each side, and these corresponded with the blade of the knife found on the prisoner. There was a horrid gash right across the neck, from left to right, which divided all the principal parts down to the bone, and at the bottom of this was the mark of another stab, between two of the vital vertebrae or neck bones.\n\nFrom the appearances there could be no doubt that the murderer first stunned his victim by striking her on the head, and then dragged her to a darker part of the barn, where, placing the back of her neck on one of the stone sleepers, he completed the horrid crime.\n\nOn Friday, the prisoner was taken before the Rev. G. F. Luttrell and Mr. Hole, at Dunster, magistrates of the district, and an investigation into the circumstances took place. During the proceedings the prisoner remained in a sullen mood, and declined to say anything. His mother, who was present, appeared to be in a state little short of insanity from anguish and excitement. After a long investigation, the prisoner was fully committed for trial on the charge of wilful murder.—Somerset County Gazette.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206306320.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 1183, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5185, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]