[{"id": "3c37af0149c9c9f6dfc83f54a4585c2a518937d8", "text": "A CIRCUS TRAGEDY.\n\nThe trial of Baron de Rahden for the murder of Lieutenant de Kastenkjold, a Danish officer, took place at Riom, France, last week. The Baroness de Rahden, the heroine of the drama, was a circus rider of the haute école. Lieutenant de Kastenkjold made himself conspicuous by his admiration of the baroness, who allowed him to follow her from town to town. The jealousy of the baron was excited, and a duel between the husband and the Danish lieutenant took place at Copenhagen. In this the baron was wounded. A sort of reconciliation followed. De Kastenkjold presented De Rahden with his sword, and the baron gave his adversary his wife's portrait. Unfortunately this friendly adjustment did not prove durable. On the night of August 24th last this trio were at Clermont Ferrand. A few moments before the baroness was to have begun her performance an altercation took place between the two men. The baron fired a revolver at De Kastenkjold, who fell. The next day he died in the hospital. The baroness maintained that her husband's victim was never her lover, although she blamed herself for her levity. She displayed no resentment against her husband at the trial. The jury deliberated for five minutes only, and returned a verdict of not guilty. The court consequently acquitted the prisoner.\n\nBATH MURDER MYSTERY.\n\nAt Bathampton, Mr. Samuel Craddock brought to a conclusion a prolonged inquiry concerning the death of Elsie Adeline Luke, alias Wilkie, who mysteriously disappeared about Bank Holiday, 1891, and whose remains were discovered in a cave at Hampton Down in September last. In summing up the coroner said there could be little doubt that a horrible murder had been committed. A great deal of evidence had been taken to show motive against Arthur Coombs, but he appealed to the jury to dispel from their mind any preconceived suspicion they might have formed with regard to him. Motive itself was not evidence. All it could do was to accentuate a charge which might be formulated against any individual. If the evidence of Phillips and Clare that they saw Wilkie and Coombs together in the summer of 1891 were true, it only proved that he was carrying on an intrigue with Wilkie when he was absolutely engaged to Miss Sheppard. Suspicion might be entertained against a man, but that would not hang him. The police had experienced great difficulties. There was a lapse of time, contradictory evidence, and, he feared, much suppression of truth. Words failed him to denounce the action of Dill in not communicating with the police when he discovered the watch and chain and blood-stained articles. There was no doubt that had Dill done his duty the murderer would have been discovered. If Mrs. Kerry had not destroyed the letters left at her house by Wilkie, but had read them, light might have been thrown on the case. The jury had a difficult problem to solve, and he was afraid they would find it impossible of solution. The jury returned a verdict to the effect that the deceased was murdered by some person or persons unknown.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812378.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 696, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3061, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]