[{"id": "1b759166bba0cc6fe3cda303b24483e59cd3d5c2", "text": "A Police Superintendent Convicted.—James Grant, 45, superintendent in the Hampshire constabulary, was indicted at Winchester assizes for forgery and embezzlement. Prisoner had held his office for many years, and every confidence was reposed in him. He had forged numbers of receipts and appropriated money, taking altogether several hundred pounds.—The judge sentenced the prisoner to five years' penal servitude, and commented severely on the loose way in which the public accounts of Hampshire were audited.\n\nA Patent Medicine Libel.—Dr. Dacre Fox, of Leeds, at Leeds assizes, obtained a verdict for £1,000l. for a libel published by the proprietors of a patent medicine. The libel consisted in the defendant's publishing in one of their pamphlets a statement that the plaintiff had wrongly treated a patient; that he had all but lost his life under the treatment, and that his life had been saved by taking their patent medicine.\n\nSequel to an Elopement.—At Stafford assizes John Wise, 35, steel fitter, was charged with murdering Mary Davis, at Sedgley. The prisoner's wife had eloped with Mrs. Davis's son, and he vainly followed the pair to Liverpool with a loaded revolver. He then asked Mrs. Davis for information, and saying, \"I would treat them like that,\" presented a revolver, which went off and shot her.—The jury convicted Wise of \"Manslaughter,\" but strongly recommended him to mercy. Mr. Justice Mathew sentenced him to six days' imprisonment, and Wise was released.\n\nCharges of Intimidation.—William Sprow, an organising officer of the Dockers' union, was convicted at Winchester of intimidating sailors and inciting to violence during the Dock strike at Southampton last September, and was sentenced to three months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206274507.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 411, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1747, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]