[{"id": "b49fbe5c320d4f1325bae533c4af8b39212fab96", "text": "ATTEMPTED GAROTTE ROBBERY.\n\nOn Thursday, at the Southwark police-court, Dennis Maloney, a tall powerful-looking young fellow, was placed at the bar before Mr. Woolrych, charged with grasping Arthur William Harwood by the throat, otherwise assaulting him, and attempting to rob him of his watch and chain.\n\nThe prosecutor, a furniture polisher, residing in Holywell-street, Strand, said that on Saturday night, about twelve o'clock, he was passing St. George's church, High-street, Borough, when some one suddenly pounced upon him, and seized him violently by the throat, pushing him a little backwards, and at the same time he received a punch in the back. A grasp was then made at his watch, which was pulled out of his pocket, but at that time he succeeded in releasing himself, and caught hold of the prisoner as he was in the act of breaking the watch from the chain. They had a severe struggle, but on hearing footsteps approach the prisoner dropped the watch and bolted across the road up a court. Witness pursued him, and meeting a constable he told him what had taken place, when they both proceeded up the court, and espied the prisoner in a doorway, panting for breath, when he gave him into custody. Witness was positive that the prisoner was the man who had hold of his watch.\n\nWilliam Hodge, 250 M, said he was on duty in Blackman-street, Borough, about one o'clock on Sunday morning, when he saw the prosecutor follow a man across the road, calling out, \"Stop thief.\" When he arrived at the corner of the court, the prosecutor told him that the man who had run up there had garroted him, and attempted to steal his watch. Witness accompanied him up the court, and when they got to the top, he saw the prisoner in a doorway out of breath, and perspiration pouring from his face. The prosecutor came up and said, \"That's the man who attempted to rob me,\" and gave him into custody. The prisoner denied the charge, and went quietly to the station-house. The prosecutor was quite sober.\n\nIn answer to the charge the prisoner said he had been in the Catherine public-house until twelve o'clock. He then went into a pie shop in Redcross-street, and after that was about to enter his house when the constable took him into custody. As for his being out of breath and in a perspiration, he accounted for that by having a quarrel with his mother and a man a few minutes previous. He denied being near St. George's church, or having seen the prosecutor before.\n\nMr. Woolrych observed that a very desperate attempt had been made to rob the prosecutor, and as the evidence was so direct he should commit the prisoner for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222914.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 617, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2629, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]