[{"id": "dd833a5548a11350e0d714dcd7aa1110d9b018a6", "text": "ATTEMPTED MURDER AT BETHNAL GREEN.\n\nThomas Fletcher, described as a horse-hair manufacturer in New Nichol-street, Bethnal-green, was charged, on Friday, at the Worship-street Police court, with wounding a young married woman, named Mary Anne Bragge, with intent to murder her.\n\nThe prosecutrix, who was very weak, stated that prisoner had formed a strong attachment towards one of her sisters, but his affection was not at all reciprocated by the latter, who had recently proceeded to the Continent. The prisoner, however, had been in the occasional habit of visiting at her house; and on the evening of the 19th inst., while she was conversing at the street-door with a lodger, he presented himself in a state of great excitement, and having ascertained upon inquiry that her husband was from home, requested to speak to her alone, as he had something particular which he wished to communicate. She accordingly invited him into the parlour, on entering which the prisoner intimated that he had been informed by her husband that she had received a letter from her sister apprising her of her intention to return home in a few weeks, and commencing upbraiding her with her unkindness in failing to furnish him with intelligence in which he felt so deep an interest. She used her best efforts to pacify him, but became much alarmed on observing in his hand an open clasp-knife, and was endeavouring to avoid him, when the prisoner caught hold of her and struck her a violent blow on the left side, which caused her to stagger back several paces. The instant he had dealt the blow, the prisoner darted out of the room and escaped from the house, and she was not at all aware of the serious injury she had sustained until some time afterwards, when she felt a trickling sensation under her clothes, accompanied by a sense of faintness, and on taking off her dress she discovered that the upper part of it had been perforated by some sharp instrument, together with her stays, which were completely saturated with blood, and that she had received a severe stab in the left side. She was immediately removed to the London Hospital, where she had ever since remained, and her husband proceeded in search of the prisoner, and ultimately gave him into custody.\n\nWilliam Slater, a silk weaver, who was in conversation with the prosecutrix when the prisoner reached the house, fully corroborated the first part of her evidence, and expressed his confident belief that he was sober at the time. Remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206198085.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 560, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2492, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]