[{"id": "2b8d4d2c34a6358d4b8e9920c127a7d37cc8c895", "text": "THE DOMESTIC SERVANT AND HER BABY.\n\nMr. G. P. Wyatt, coroner for East Surrey, held an inquest at the Railway Tavern, New-cross, on the body of Arthur William Lapworth, aged eighteen days, the child of Mary Ann Lapworth, a domestic servant. The mother said the child was born at 59, Hatcham Park-road. The witness went there in consequence of an advertisement she saw in the Sunday papers. She agreed to pay Mrs Church, the landlady, who was to attend her, 15s. per week previous to her confinement, and a guinea a week afterwards. Nothing was said to her about the doctor's fee. The medical man attended her when the child was born, but she did not see him afterwards. By the Coroner: She did not understand that it was necessary for a doctor to call a second time. Mrs. Church did not suggest that the doctor should not see her again, but she once said to her, \"The doctor has come to see the child. I suppose you do not want to see him?\" to which the witness replied, \"No, I don't think so.\" There were three other young children in the house when the witness first went, but two of them were taken away last week. Eleanor Church, of the above address, stated that the deceased was fed on milk and water. She did not think it necessary for the doctor to attend again after the confinement, as the patient got on very well. The Coroner: I should have thought you would have wished him to call, as you paid him out of your own pocket. Witness: Oh, no. The mothers have to pay that, and I told the last witness so. In fact, after she got convalescent we went together and pawned her watch and chain with which to pay him. The witness, continuing, said that she was not a registered midwife, or she would not have called in medical aid; she was only a nurse. By the Coroner: How many children have you in the house in the course of a year—a hundred? The Witness: Oh, no, certainly not. By a Juryman: The mother registered the birth. The witness had not insured its life. Dr. C. Wallace, of 241, New-cross-road, stated that he was called in on June 8th; the child was born when he arrived; he did not see it again until Saturday; it was then in a dying state. He attended it until its death, which took place the following day. By the Coroner: Is it not usual for a medical man to attend a woman in her confinement until the ninth or tenth day? The Witness: Yes; I called the next morning, and Mrs. Church said that the mother of the child did not desire to see me. I attended two other cases in the same house recently, and was treated in the same way. The deceased was healthy when born. I made a post-mortem examination of the body, which was much emaciated, and weighed only 4lb. 5oz., the average weight being between 6lb. and 7lb. There was scarcely any fat about the body, and the stomach contained a little partly-digested food. The immediate cause of death was exhaustion, resulting from a convulsive fit. The jury eventually returned a verdict in accordance with the medical evidence.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810563.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 737, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2991, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]