[{"id": "bb13b5438d1bc0a25434ed58b7bf5b56e863b88f", "text": "CONVICTION FOR MURDER.—At the high court of justiciary, Edinburgh, on Monday, George Collison, an innkeeper at Dalkeith, was charged with the murder of Agnes Paterson or Collison, his wife. The prisoner pleaded not guilty. Mary Blyth, servant girl, gave distinct evidence as to the violent blows which had been inflicted by prisoner with a poker on the head, body, and legs of the deceased, on the 8th of May, and stated that blood flowed profusely from the wounds. The witness, on seeing the assault, cried to the prisoner to leave the breath of life in her, to which he replied that \"it was time she was away.\" Witness assisted Mrs. Collison into bed, when she complained much of her leg, and said to her (witness) that the prisoner would be punished for what he had done. She complained that her leg was broken. Both the prisoner and his wife appeared to have been drinking. Witness saw her mistress early the next day. At that time the prisoner was in bed, and her mistress lying on the floor. Her clothes appeared never to have been off. She was lying at a considerable distance from the bed. There was blood on the spot, which seemed to have come from her leg. She was quite unable to rise. Witness asked her why she was lying there, when deceased said, \"Oh, Mary, after you went up to your bed, he tore me out by the hair of the head.\" Prisoner was awake, and must have heard her, but he said nothing. Witness and another servant girl lifted her up to a chair, and the prisoner afterwards assisted them to get her into bed. Prisoner said to her, \"See what you have done to yourself now, by rising through the night and drinking a bottle of whisky and six bottles of ale.\" Witness knew that this could not have been the case, for deceased, on the previous evening, could give no help to herself, and was unable to leave the bed. During the three months witness had been in prisoner's service, she had seen him use the poker several times to his wife. The lord justice-general having summed up, the jury retired for twenty minutes, and returned with a verdict of \"Guilty,\" with a strong recommendation to mercy. The prisoner was sentenced to be executed on Monday, the 1st of August.\n\nDEATH THROUGH INTOXICATION.—On Saturday forenoon, a painful occurrence, attended with fatal consequences, took place on board the ship Conqueror, at present lying in the Victoria harbour, Greenock. A number of men were engaged in discharging her cargo, which consisted of bags of sugar; and, as usual in such cases, one of the labourers stood over the hatch, steadying the rope by which the bags are lifted. The man stationed at this post on Saturday was named Charles Gorman, who, being somewhat intoxicated, lost his balance while pulling two bags on to the planks, and was precipitated to the bottom of the hold, his head coming in contact with the keelson. He was killed on the spot. He has left a wife and family to lament their loss.—Greenock Advertiser.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206305372.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 690, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2950, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]