[{"id": "c57c0e79010b72c48dc7d15d135d4790e0093c38", "text": "SEIZURE OF AN ILLICIT STILL AT HOLBORN.\n\nPaulo Serafino, 47, a baker, of 5, Milman-street, Holborn, and Erminie Camilo, 27, a waiter, of the same address, were charged at Clerkenwell police-court yesterday with being concerned together in defrauding the Revenue by illicit distillation at 15, Theobald's-road.—Arthur Llewellyn, detective supervisor of the Inland Revenue, said he apprehended Camilo on a warrant at the house in Milman-street, on Friday afternoon. He said to the prisoner, \"I want you to go with me to your factory in Theobalds-road.\" Camilo replied, \"I know of no such place,\" but in answer to further questions, he admitted that he was the brother-in-law of one Derico. They then went to the house in Theobalds-road, and there two revenue officers had the prisoner Serafino in custody. Camilo said, \"It is my brother-in-law's place; I have nothing to do with it.\" Witness and the other officers searched the premises, and found a rectifying apparatus made of copper and of superior workmanship. About 2,000 gallons of \"wash\" ready for distillation, were discovered in puncheons, and about 500 gallons of finished spirit in other utensils. Witness went back to the house in Milman-street, and while at the door a telegram was brought by a messenger to Camilo. He took it in to Camilo's wife and told her to open it in his presence, and she did so. The telegram stated that the man Derico had arrived in Dover, and witness went down there by train in the evening, but failed to apprehend him, finding that he had left the town and gone somewhere else. The apparatus and spirit at Theobalds-road had all been seized by the revenue officers.—Both prisoners, who made no defence at present, were remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206276279.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 459, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1718, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]