[{"id": "40920c50ead0fd5f4c3bbb1752f55303e1fa0245", "text": "WOOLWICH PETTY SESSIONS.\n\n(Before Sir Thomas M. Wilson, Bart., Chairman; Sir John Webb, Capt. Fead, and E. S. Forman, Esq.)\n\nOn Monday, James Baynes, a young urchin, with a \"flippertygibbet\" air and demeanour, and apparently not more than 12 years of age, was charged with stealing a portion of the rations of the privates of the Royal Artillery from the kitchen. The property consisted of some uncooked mutton chops, and a quantity of flour.\n\nThe offender, however youthful in appearance, appears to have been old in iniquity, at least in the eyes of military men, for in consequence of his delinquencies a special order was given to prevent him from entering the barracks; but, notwithstanding all the vigilance of the sentries, he contrived to evade them, by skulking round the sentry-boxes, or darting rapidly to a hiding-place, as soon as the soldier on duty turned his back.\n\nOn Sunday, about 12 o'clock, after he had tried many manoeuvres, he contrived to pass the sentry at the back entrance to the sappers and miners barracks, and was seen skulking into the kitchen, and shortly after was observed stealing away with a parcel. The sentry on duty stopped him at the gate, and on the guard coming up to take the redoubtable offender, it was discovered he had loaded himself with a quantity of meat and flour, which he said had been given to him by a sapper and miner named Ellis, who was acting as assistant cook. The delinquent was then given into the hands of the police.\n\nThe Chairman asked the boy what he had to say to the charge?\n\nThe prisoner repeated his statement, that Ellis had given him the victuals to take over to Mr. Campion, who keeps a \"Tom and Jerry\" shop, called the Royal Sappers' Arms, near the barracks.\n\nThe Magistrates directed Campion to be fetched, as also the father of the boy.\n\nWhilst the officers were going to fetch them,\n\nCaptain Fead asked the boy how he came to have any knowledge of the \"Tom and Jerry shop,\" as he called it?\n\nThe boy—Why, I generally spend my evenings there. (The naivete with which he gave the answer, caused a momentary smile on the countenances of the magistrates.)\n\nThe Chairman—How old are you, then?\n\nPrisoner—Going 14.\n\nThe Magistrates said they feared he had been badly brought up; and the doubt was almost realised by the very appearance of the father, whose appearance was that of a confirmed sot.\n\nThe father said he had given the boy a liberal education, as he had sent him to school for two years.\n\nThe Magistrates after consulting said they would postpone the decision on the case for a few days.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3205297535.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 637, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2570, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]