[{"id": "859c7acc84734c899cad4968b38b7d14db5c2872", "text": "A SCHOOLBOY'S THEFTS.\n\nJOSEPH STEWARD, fourteen, schoolboy, living with his parents at Bangor House, Aberdeen, was brought before Mr. Cooke, on remand, at Marylebone Police-court, charged with stealing, on the 29th ult., a carpet bag containing a coral scarf-pin and other articles, valued at £9, from Euston Station. Mr. Lambert, solicitor, appeared on behalf of the London and North-Western Railway Company, and Mr. Freke Palmer represented the prisoner. The evidence was that the bag belonged to Mr. Pither, a brush maker, living at Pleasant-place, Fulham-road. On the day in question he was a passenger from Birmingham, where he saw the bag labelled and put into the guard's van. When he arrived at Euston the bag was missing. The same afternoon the prisoner went to Edward's Hotel, Euston-square, taking the bag with him. He remained there for a few days, and when the proprietor asked him for the amount of his bill, he replied that he had no money, and said that he had lost a cheque for £30. He tried to escape over a wall, but was detained and taken to the police-station. He was afterwards charged with stealing the bag, and he replied, \"Yes, that is right. I had it from the waiting-room.\" At the time he was wearing the coral scarf-pin. He gave two or three false addresses, but ultimately gave his right name and address, and said that his father was a retired merchant. It was ascertained that he had hired a bicycle at Aberdeen, and had ridden from there to Perth, where, it was asserted, he sold the bicycle for £2, and then came to London with the money. Mr. Lambert said that inquiries had been made into the prisoner's previous career, and from what had been ascertained he should now ask the magistrate to send him for trial. Detective Collins, S Division, stated that he was in receipt of a communication from the Guernsey police, alleging that in August last the prisoner was sentenced to fourteen days' imprisonment, and to be birched, for hotel thefts there—in one instance the offence was said to have taken place at night. The prisoner's father was a highly respectable man, and the prisoner had been a source of great trouble to his parents. The father of the boy, who was very much affected, and appeared to be deeply grieved at his son's position, said that he could not account for his conduct. He had several other children, who were doing well in the world, and the prisoner's behaviour had been a terrible upset to them all. He was quite willing to send him to sea if the magistrate could see his way to admonish him, and then allow him to take him away. Mr. Cooke remarked that the prisoner was a very bad boy. He could not permit that course to be taken. The boy had much better go to a reformatory. Detective Collins said that the prisoner had stayed at three hotels, and had absconded without paying his bills. They, however, had now been paid. Mr. Cooke sentenced the prisoner to ten days' imprisonment, to be followed by four years' detention on the reformatory ship Cornwall, the magistrate observing that it was necessary the prisoner should go to prison before the authorities would receive him on the ship.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812175.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 735, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3149, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]