[{"id": "a5a12614c0d09ea490747a0d5863a69e5d15de83", "text": "MURDER OF A WOMAN.\n\nAt the Southwark police-court, on Monday, Henry Dickens, thirty-one, a labourer employed at Harrods, was charged with the wilful murder of Sarah Scott, a widow, whom he resided at No. 3, White's grounds, Bermondsey. The prisoner appeared in custody, and was allowed to be seated during the examination.\n\nMr. Poveshell (for the prosecution): Mr. Woolrych, I am an inspector of the M division of police. On Saturday night, about six o'clock, the prisoner was brought into 588 M, charged with the wilful murder of Sarah Scott. After I had examined him, I found no marks or bruises on his body, nothing to make me believe he had been fighting, and it might be used against him at another place. The prisoner refused to make any statement, so I wrote down as follows:\n\n\"The deceased Sarah Scott has lived with me at No. 3, White's grounds, Bermondsey. Her husband died four years ago. On Saturday evening we had no dispute. When I came into the house there was no fire. I said, 'Why don't you get my tea?' She answered, 'I can't.' I said, 'Don't you get my tea?' She answered, 'I can't.' I could tell what the look on her face was. Any way, you will suffer for this.\" He then went into the yard, and when he came back he had a gas in his head and caused her death. I then went into the yard, and when I came back she was lying on the floor. I lifted her up and found that she was insensible. I could see blood was going from her. I took her to the nearest hospital. She died next day. She was buried by her husband.\"\n\nMr. Woolrych: Were these voluntary statements?\n\nInspector Raymond: They were, sir; I strictly cautioned him before I took it down in writing.\n\nMr. Woolrych: Was there anyone else in the house?\n\nInspector Raymond: The prisoner pays the rent, and he lives in the deceased's name. After I had finished my examination I proceeded to the house and saw the dead body of Sarah Scott. Dr. Burt, surgeon, examined the body, and said there was a wound on the body while I was there. I saw bruises and wounds on her head.\n\nMr. Woolrych (to the prisoner): Do you wish to ask the inspector any questions?—No, sir. It is just what I told him.\n\nMr. Woolrych (to Inspector Raymond): When I returned to the station-house the prisoner told me that the deceased had been murdered by someone who had entered the house. He said he had seen blood on it, but I don't know that the wounds were caused by that. I then took the prisoner to the police-court, and showed him the wound on the inside edge of the heel of the right foot.\n\nSamuel Conington, 30s., said: On Saturday evening, a little before six o'clock, I was on duty in Bermondsey-road, and heard a noise. When I came near, I saw a woman lying on the floor. I asked her what was the matter, and she pointed to the prisoner. He admitted that he had killed her. He said he had been drinking, and that he had killed her because she had been unkind to him.\n\nJames Haynes, 30s., said: On Saturday evening, about a quarter to six, I was on duty in Bermondsey-road. I heard a noise, and when I came near I saw a woman lying on the floor. I asked her what was the matter, and she pointed to the prisoner. He admitted that he had killed her. He said he had been drinking, and that he had killed her because she had been unkind to him.\n\nMr. Woolrych: Had you any reason to believe she was dead?\n\nMr. Thomas Evans, the divisional surgeon of the M division, said: I was called to No. 3, White's grounds, Bermondsey. I found the prisoner lying on the floor, and when I saw the deceased, Sarah Scott, lying on her back, I found she was dead. I made a superficial examination of the deceased, and found several cuts on the face and head. There was a wound on the back of the head. It was an incised wound on the right side, and a cut on the left side. There was not much blood.\n\nMr. Woolrych: Did you make an examination of the body?\n\nMr. Evans: No, sir, not until I have made a post mortem examination. It may possibly be congestive.\n\nMr. Woolrych: Are you going to make a post mortem examination?\n\nMr. Evans: Yes, sir. I have just received orders from headquarters and directions to report the same at the inquest.\n\nMr. Woolrych: You have seen the prisoner?\n\nMr. Evans: Yes, sir. I have seen him lying on the inside part of the right side. I have observed blood. I think the wound at the back of the head was caused by a blow from a stick.\n\nMr. Woolrych (to the prisoner): Have you anything to say why you should not be remanded until the inquest is over? You have nothing to say?\n\nMr. Woolrych: Then you are remanded.\n\nThe prisoner, who seemed very much depressed in spirit, was then removed to Horsemonger-lane gaol.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206223327.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 464, "total-output-tokens": 1187, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4673, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]