[{"id": "507d6d8ca2ba3f1b04b1ed3158bc7e4967298880", "text": "SHOCKING DEATH OF A BRIDEGROOM.\n\nA TERRIBLE accident, which terminated fatally, occurred at Hatfield Peverel Station on the Colchester line of the Great Eastern Railway, late on Monday night. William Humphreys, a brickmaker's foreman, of Hatfield Peverel, had been to London to be married that day, and on his return the train stopped just outside the station. Humphreys, believing he had reached the platform, stepped out, and fell beneath the wheels, the train proceeding and passing over his legs and arm before he could get up. The unfortunate man was shockingly mutilated, but he retained consciousness and murmured, \"Dear me, to think I should come to this!\" No doctor was in the train, so the sufferer was placed in the brake van and conveyed to Witham, where he was placed in the waiting-room. Two doctors commenced an operation upon him, but, after one leg had been amputated and while the other was being taken off, he passed away while under the influence of chloroform. His marriage certificate was found in his pocket.\n\nEXTRAORDINARY ATTEMPT TO COMMIT SUICIDE.—A prisoner named Griffin, in Belfast Gaol, seized a glass from a passing warder, broke it, and tried to swallow the fragments. A large piece stuck in his throat, inflicting a frightful gash. He has been committed for trial on the charge of attempting suicide.\n\nATTEMPTED SUICIDE AT LUDGATE-HILL STATION.—On Sunday night when the officials were locking-up the station for the night a respectably dressed man, aged about thirty, was discovered in one of the lavatories with his throat cut. He was in an unconscious condition, and the penknife with which he had inflicted the wound was embedded in his neck. After the injury had been attended to by a doctor the patient was removed to St. Bartholomew's Hospital, where he lies in a critical state. There was nothing upon him to lead to identification; he possessed neither money nor valuables, and his sole belongings appeared to be a Prayer-book and a few tracts. The officials at Ludgate-hill say he is a frequent traveller from that station.\n\nPILLAGING A GARDEN.—At the Kingston-on-Thames County Bench, on Saturday, two respectable-looking young men, Arthur Warren, a lithographer, and Alfred Trotman, a cook, living at Tolworth, Surbiton, were charged with stealing four rose trees, value £1, from a garden on Surbiton-hill on the 15th inst. Detective Burdock stated he received information from Mr. John Farmer, the owner, that the roses had been stolen, and he went to Warren's house, where Trotman also lived. One of the stolen trees was planted in the front garden, and he found the other three in a coal-cellar at the rear of the house. There were four other rose trees standing against the wall. The prisoners gave different versions as to how they became possessed of the trees, and were taken to the police-station. Trotman now pleaded guilty, but Warren denied the theft. He said they were coming home from London when they passed the prosecutor's garden. Trotman said he would like to have some rose trees, and went into the garden and pulled up four, saying they would never be missed. The chairman (Mr. W. X. Cockburn) said it was a disgraceful theft for men in the prisoners' positions, but as it was their first offence they would be fined 4s. 6d. or fourteen days' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811332.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 786, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3317, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]