[{"id": "d8b475aa1b9b1a365aca162aadf5b0f9a5e74e9c", "text": "MIDDLESEX SESSIONS.\n\nMONDAY.\n\nThe April quarter sessions commenced this morning, at the Sessions-house, Clerkenwell, before Mr. Sergeant Adams, assistant judge, Mr. Witham, and other magistrates. There were seventy-two prisoners for trial, seventy of whom were charged with felony, and two with misdemeanour.\n\nTHE CASE OF ASSAULT BY TWO SOLICITORS.—Mr. James Phineas Davis, solicitor, of 5, Holles street, Cavendish square, and Mr. David John Davis, his brother, appeared pursuant to recognisances entered into at the last session at Westminster, to receive judgment. It will be remembered that the defendants were tried before Mr. Witham for assaulting John O'Brien, and found guilty, when they were sentenced to pay a fine of 50l. each, but were subsequently ordered to enter into recognisances to appear to-day to receive judgment, it being understood at the time that the sentence pronounced would not be altered. However, Mr. Sleight, who appeared for the prosecution, now said, that on the part of his client, Mr. O'Brien, he was instructed to say, that from what had taken place since the trial, the prosecutor was disposed not to press for the infliction of the full fine imposed by Mr. Witham, but to ask for so much of it as the court might think consistent with the ends of justice.—Mr. Parry, for the defendants, said he was instructed to say, that they regretted the course that had been taken on the trial, and that they had since found that their instructions to counsel with reference to the prosecutor were, in point of fact, foundationless, and they desired to say so most fully.—The assistant judge, after conferring with Mr. Witham, said he thought a most proper course had been taken on both sides, and both himself and Mr. Witham thought, under all the circumstances, that the justice of the case would be fully met by each of the defendants being ordered to pay a fine of 40s.—The court passed sentence accordingly, and the fines having been paid, the parties left the court.\n\nTUESDAY.\n\nDIFFERENCE BETWEEN A JUDGE AND A JURY.—Three men, named Freeman, Tritton, and Phillips, were indicted for stealing three sovereigns from the person of a lascar, named Hassano Moydeen. Mr. O'Brien appeared for the prisoners. This was an ordinary brothel robbery, but the trial lasted a considerable time. The evidence given by the prosecutor varied from the account he originally gave of the transaction, and, in summing up, the assistant judge said there could be no doubt that the prisoners were three great scoundrels, but the evidence was not, in his opinion, sufficient to justify their conviction, and he should recommend them to find them not guilty.—The jury having considered for some time, the assistant judge inquired what they were debating about; if it was whether they were to convict the prisoners? He begged to tell them that there was not sufficient evidence, and if they wished to consider further, they must retire, as he could not allow the business of the court to be delayed.—A bailiff was then sworn, and the jury retired. After a short absence they returned, and found the prisoners \"Guilty.\"—The assistant judge said that was a verdict against the evidence, and he scarcely knew what to do. Disapproving as he did of the verdict of the jury, he could not act upon it as if he concurred in it, but at the same time, as it was the decision of the jury, he did not wish it to appear that he paid no attention to it. Under the circumstances, he should order the prisoners to be remanded till another session, and in the meantime he should consider what would be the best course to take.—The prisoners were then remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206200069.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 833, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3650, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]