[{"id": "306efc48cb556c4facf4e23ca73d8ec0316e53e6", "text": "TRIAL OF LORD M. BERESFORD.\n\nAt the Middlesex sessions on Friday, Lord Marcus Beresford surrendered, in discharge of his bail, to answer an indictment charging him with having assaulted Mr. Thomas Gibson Bowles, the editor and proprietor of Vanity Fair. Mr. Lockwood, Q.C., in opening the case for the prosecution, mentioned that defendant was formerly an officer in the 7th Hussars, and at that time a certain Colonel Trevelyan was also an officer of that regiment. Differences had arisen between Colonel Trevelyan and his wife, and the defendant became the trustee of Mrs. Trevelyan, who no longer had the protection of her husband. Of Mrs. Trevelyan he would say nothing except that for some time past she had been alternating between the workhouse and gaol. On the 4th of October there appeared in Vanity Fair an article which referred to Lord Marcus as Mrs. Trevelyan's trustee, and asked why he did not insist on Colonel Trevelyan keeping his wife from starvation. On the 11th of October a letter appeared in Vanity Fair in which it was stated that Colonel Trevelyan had evaded his responsibility by going abroad, \"while her (Mrs. Trevelyan's) noble trustee, is, we may suppose, too much occupied in some more congenial pursuits than to trouble himself about the lady in whom, perhaps, he once took a lively interest.\" The learned counsel then proceeded to detail the circumstances attending the assault on the plaintiff.\n\nMr. Bowles and other witnesses repeated the evidence they gave at the police-court.\n\nThe Judge, in summing-up, said that whatever might have appeared in the paper complained of, it was no justification for an assault. It was fair to bear in mind that the article and also the letters—from a noble earl especially, if they read between the lines, were of a most offensive character, and must have caused great pain to Lord Marcus Beresford.—The jury found a verdict of \"Not Guilty,\" and his lordship was discharged.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206258239.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 453, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1943, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]