[{"id": "61a7177c1695a3d429a5258116df1ead34c90ced", "text": "DOMESTIC TRAGEDY IN LINCOLNSHIRE.\n\nAn inquest was held at Alford, on Friday, touching the death of Joseph Martin Turner, aged nine years, who was found drowned in Holywell Brick-pit, Alford, on Thursday. The first witness examined was John Martin Turner, the uncle of the deceased, who deposed that the boy and his father, James, a labourer, had resided with him for some time; but in consequence of some remarks he had made to his brother the latter took the boy away to his grandmother's house, and asked for a night's lodging there. As it was not convenient for them to stay, they went back to the house they formerly occupied, and slept in a shed at the back of the building, the father taking off some of his clothing to cover his son. The following day the father visited a beerhouse several times, and his brother John, finding him there, asked him to go home and have a cup of tea, which he and the boy both refused. Nothing more was seen of them until about half-past one on Thursday morning, when the father returned to his brother's house alone, and upon being questioned by the wife as to where the boy was, replied that he did not know, but afterwards stated that he was at Claxby. He also said, \"I walked straight into the well pond.\" It was noticed that his clothes were wet and his face muddy, and the wife told him to change his clothes and get into bed, which he did. On the brother coming down in the morning he went to Claxby to another brother, but found the boy was not there. Together the two brothers returned to Alford, stopping on their way to examine the fish pond at the well, but found nothing. Upon reading a letter, which led to the brother going to Claxby, and which was from the father of the child, it was found that a certain passage which had been overlooked stated that the bodies of both the father and son would be found in the brick-pit. They went to the place and found the body of the boy. Medical evidence having been given that death was caused by drowning, and formal evidence as to the very peculiar behaviour of the father on Wednesday evening and to his subsequent arrest, the coroner summed up, and a verdict of wilful murder against Joseph Turner was returned. The father is stated to have been deeply attached to his son.\n\nALLEGED INGENIOUS FRAUDS.\n\nAt the Bilston Police-court, on Friday, John Herbert Brown, thirty-two, a bookbinder by trade, but who had conferred upon himself the title of Dr. G. H. Adamson, of Park House, Leeds, was committed for trial on six different charges of fraud. The circumstances, although almost the same in each case, were of a most extraordinary character. The prisoner, it appears, adopted the plan of first making himself acquainted with persons resident in Bilston, West Bromwich, and other parts of the district who had relatives in Australia; he then waited upon them, and, stating that he had just come over from the colony on a short visit, said he was entrusted with friendly inquiries from their absent relatives. By this means it is alleged he managed to obtain quantities of valuable articles in the form of jewellery and trinkets, which he promised to convey on his return to Australia to the individuals for whom they were intended. At West Bromwich, it seems, he slightly altered his tactics. Having obtained from Mrs. Willis, wife of a grocer, a number of small articles as presents to her married daughter, he went straightway to another West Bromwich grocer named Hodgetts, and handed over the articles he had obtained from Mrs. Willis as presents from their absent brother, who was about to be married. The bait quickly took, and prisoner was made the happy recipient of a gold Albert guard and silver Jubilee brooch and other valuables as presents for the intending bride and bridegroom, and intrinsically worth about three times the articles he had given in exchange. Prisoner offered no defence, and he was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200808400.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 884, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3933, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]