[{"id": "edc1d5bc68b06fae26f0b49b7d5504a30e592e81", "text": "THE ATTEMPTED WIFE MURDER AT HACKNEY.\n\nOn Thursday, Francis Moretti, twenty-one, confectioner, was indicted, at the Central Criminal court for feloniously wounding Elizabeth Moretti, his wife, with intent to murder her; and in a second count he was charged with an intent to do her grievous bodily harm.—The prisoner was also charged with unlawfully wounding himself with intent to kill himself.\n\nThe prisoner was a foreigner, and at the time the occurrence took place he was carrying on the business of a confectioner at 105, Hackney-road, where he resided with his wife, to whom he was married shortly before Christmas last. It appeared that on the 9th May the prisoner and his wife had a slight quarrel, but nothing much to speak of, and at night they were the same as usual, and went to bed about eleven o'clock. The prisoner's wife was awake in the morning about six o'clock by something at her throat, and found herself covered with blood and her throat cut. The prisoner was by her side, and had then an ice spoon in his hand. She went to the window and called out, and got on to the cistern, and from there down into the garden, and then into the house of a neighbour, by whom she was immediately taken to the hospital. Upon proceeding afterwards to the house, the prisoner was found up-stairs with his throat cut very severely. A razor was found in one of the rooms down stairs, and there were marks of blood on the floor from that room to the room upstairs, where the prisoner was found. The prisoner was taken to the hospital, where he and his wife remained until the 20th of June. The wound in his wife's throat was very severe, the windpipe having been severed; and she was for some time in extreme danger. The prisoner's wound was also a very severe one.\n\nThe prosecutrix was still in a very weak state and appeared to have entirely lost her voice, her evidence having to be repeated; and the surgeon from the hospital expressed a doubt whether she would ever recover.\n\nIn answer to Mr. Montague Williams the prosecutrix said the prisoner had always treated her with the greatest kindness. He had sometimes been rather strange in his manner, and told the customers that they came to rob him, and on the day previous to the occurrence he went into the garden and tore up the earth. She added that prisoner's father died a lunatic.\n\nWhen the prisoner was discharged from the hospital on the 20th of June, he was taken into custody, and when told that he would be charged with cutting his wife's and his own throat, he asked how he could be guilty when he was not in his right senses.\n\nThe defence set up by the prisoner's counsel was that he was not in his right mind at the time the act was committed; but no witnesses were called.—The jury acquitted the prisoner on the ground of insanity.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222931.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 648, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2803, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]