[{"id": "b3c58deb631ee7eb327dfb2c8b3b642cb06ca9c9", "text": "The London Coffee and Eating-house Keepers' Benevolent Association.\n\nThe twenty-first annual meeting of the above-named association was held last Monday evening, at the Freemasons' Tavern, Great Queen-street. The attendance was not very numerous. Mr. Lawson, of High-street, Whitechapel, the president of the association, was called to the chair.\n\nThe report of the association was then read by the Secretary, from which it appeared that the sum of £3,533 17s. 11d. was invested in the Funds; that the receipts for the present year were about £200, and the expenditure of the society £180. The annual dinner of the society was held in April last, at which Mr. Alderman and Sheriff Allen presided, supported by distinguished friends of the institution. The Chairman gave the liberal sum of £10 10s.; the Morning Advertiser, twelfth donation of £10 10s.; Mr. Peirse, £5 5s.; an excursion by railway to Broxbourne, which took place on Tuesday last, will prove a source of profit. It also appeared from the report, that the sum of 5s. per week is paid to each pensioner on the society's funds.\n\nMr. Straines proposed, and Mr. Delly seconded, that Mr. Baker be the president for the ensuing year, which was agreed to unanimously.\n\nMr. Eldred was appointed vice-president. That gentleman returned thanks for the honour the association had done him by his election. His best efforts would be devoted to its advancements.\n\nThe appointment of the committee was the next business of the meeting. Three gentlemen retired by rotation, and three by absence a certain number of times from the meetings.\n\nMr. Wisedale proposed that the auditors be re-elected.\n\nThe motion was duly seconded.\n\nMr. Sherwood, one of the auditors, declined re-election, on which Mr. Statham was proposed by Mr. Kirton and seconded by Mr. Hardy, and carried nem. con.\n\nMr. Wisedale proposed the re-election of Mr. Rogers as secretary; Mr. Groombridge seconded the motion, which was carried.\n\nThe alteration of rules in reference to the admission of members was the next subject. An admission fee of ten shillings, which had at the last meeting been reduced from two guineas, was proposed by Mr. Sherwood, seconded by Mr. Wisedale, and carried.\n\nAn alteration in reference to the age at which members should receive relief from the funds was also agreed to. The age of sixty instead of fifty years being substituted.\n\nSeveral gentlemen addressed the meeting on the prospects of the society, suggesting plans for increased usefulness.\n\nA motion was made for the increase of the secretary's salary from £15 to £25, which was carried unanimously.\n\nThe thanks of the meeting were then voted to the chairman, and the meeting separated.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3202426375.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 644, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2692, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]