[{"id": "3b20d3cc3e6a6c69ac2b841864b4a0064936ff71", "text": "THE STRANGE CONFESSION OF MURDER AT BRIGHTON:\n\nHerbert Arthur Green, clerk, 5, Palace-street, Buckingham-gate, Pimlico, was charged on his own confession at Brighton on Saturday with murdering his child, Louisa, aged five, by administering chlorodyne, at Brighton, on the 5th inst. The case was remanded from Westminster police-court.—The prisoner was dressed in black, and his face bore an anxious, woe-begone expression.\n\nInspector Dyer, of the Metropolitan police, stated that on the 11th inst. the prisoner, accompanied by the Rev. Hill Jones, curate of St. Paul's, Eaton-square, came to Rochester-road station and made a statement, in which he confessed that on the 5th inst. he took his two little girls, aged seven and five, to Brighton intending to drown himself and them. When at Brighton he gave each child some chlorodyne from a toy pail and took them for a paddle in the sea. The children screamed so loudly that he brought them back and they were taken to the County hospital, where Louisa died next morning. He afterwards attempted to commit suicide, and was charged at Brighton, but was liberated on his wife promising to look after him. He conscientiously believed he had been the cause of his child's death.\n\nArthur Harold Mansell, assistant to Mr. Read, chemist, Buckingham-palace-road, identified the prisoner as the man to whom he sold a bottle of chlorodyne on the 4th inst.\n\nFrancis Mortimer Rowland, assistant to the house surgeon of the County hospital, said that the child was brought to that institution on the 4th inst., and he remained with her until she died. A post-mortem was made, and some fluid was found in the left pleura and some congestion, with a slight consolidation of the basis of both lungs. He believed death was due to the condition of the lungs and secondary shock. The fluid in the stomach smelt like peppermint. Such a smell might be found with anything saturated with chlorodyne.\n\nThe prisoner, who had no questions to ask, was remanded for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206277693.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 486, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1996, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]