[{"id": "3680eee91bb25663d689f772fc1f75de5e6cd5cc", "text": "Mr. Gladstone's speech formed the topic for discussion at the meeting of the \"Patriotic society\" of working men, in their room, at Kirby-street, on Monday night.—Mr. Roberts, president of the Revivers of British Industry, was put in the chair as an impartial critic, and the debate was opened by Mr. Winn, plasterer.—A resolution was then moved by Mr. Savage, die-sinker, to the effect, \"That Mr. Gladstone had vindicated his policy from the insinuations made against it, had proved himself to be the most practical and patriotic minister of his time, and was entitled to the support of the meeting in the measures he desired to pass for the benefit of the masses.\"—The resolution was seconded, and several able and energetic speeches were made in its support, to the general effect that, although Mr. Gladstone might not go so far in the direction of Democracy as many in the meeting could desire, he had given more opportunities than any former minister for the progress of Liberal measures.—An adverse amendment was moved and seconded, but was defeated by an overwhelming majority.—Mr. George Odger, who spoke in the course of the debate, drew a broad line between Mr. Gladstone and several of the members of his Ministry. It was, in his opinion, the bounden duty of every Englishman to thank Mr. Gladstone for his past conduct as a politician (cheers).—Putting an interpretation different from that of previous speakers on the Premier's statement that he would think thrice before going to work to abolish the House of Lords, Mr. Odger regarded this as a hint that he would wait until he had the more pronounced support of the people. It was true, as Mr. Gladstone had said, that they thought too much of the Lords; they had a sneaking regard for them—the regard of a sneak, not that of a man (cheers). Let them discard this feeling altogether, and at a future meeting express their opinions on the question in unmistakeable terms (cheers). Mr. Gladstone's earnestness in the cause of progress had never been equalled by any prime minister; but with the present House of Commons no statesman, were he an angel from Heaven come down to legislate, could carry any good measure. He would therefore add to the resolution a hope that in the future Mr. Gladstone would take into his Government men of more earnestness and sympathy with the wants and claims of the working people.—With this rider the resolution approving of Mr. Gladstone's policy was adopted.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206238108.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 561, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2457, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]