[{"id": "e777e83229eb04bbfc79cb86442ae77ca5b93bb7", "text": "THE POISON MYSTERY.\n\nCOMMENTS OF THE COMMON SERGEANT.\n\nIn charging the grand jury at the Old Bailey on Monday the Common Sergeant, reviewing the Calendar—which he said was the heaviest he had known during the twenty years he had been connected with the court—dwelt particularly upon the charge against the man Neill. He explained that the prisoner was charged with the murder of four young women, with the attempted murder of another woman named Louisa Harris, and with sending letters demanding money with menaces. Neill, he continued, was an American, and he seemed to have received to some extent the education of a doctor, and to have at one time been a student at St. Thomas's Hospital, although this was not very clear. Prisoner undoubtedly came to this country in September last year and took lodgings in South London. He went back to America, but only for a short time. In September, last year, two women, named Shrivell and Marsh, were found dying in the streets from strychnine poisoning. There would be direct evidence that the prisoner was acquainted with these women, because there was found in his possession, when arrested, a piece of paper which contained the address of these women in Marsh's handwriting, and when their deaths were under investigation the coroner received a letter, which would be proved to be in the handwriting of the prisoner, stating that he was in possession of information proving that a medical student named Harper had poisoned the women.\n\nJust before this a Dr. Harper, of Barnstaple, received a letter, also said to be from the prisoner, demanding £1,500, and stating that unless he received this amount the writer would give information incriminating his son, Mr. W. H. Harper, in the murder of the two women. It could not be too widely known that the sending of such a letter was in itself a most serious offence. A curious and remarkable fact was that this letter and that sent to the coroner was written upon note-paper which bore the same water-mark, and was in every way identical with two letters admitted to be in prisoner's handwriting. As to the woman Clover, there would be evidence that he was in her company within a short time of her death, and the woman Harris gave specific evidence of the prisoner trying to induce her to take pills, and when arrested prisoner was found to be in possession of pills and capsules. There was a great deal of other evidence with which it would not be necessary to trouble them, as they (the grand jury) would probably be of opinion that, having regard to the serious nature of the case itself, it would be better that the whole of the facts should be investigated by a judge and jury. His lordship mentioned other cases, and the grand jury retired to their duties. Mr. Geoghegan applied for a postponement of the trial until next Sessions, stating that it was impossible to prepare the man's defence in time for the present Sessions. The case was accordingly postponed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810790.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 647, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2962, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]