[{"id": "f091549f01608104eed37b2959ad16c44711792b", "text": "THE STABBING AFFRAY IN CLERKENWELL\n\nMR. S. F. LANGHAM, coroner, held an inquiry at St. Bartholomew's Hospital with respect to the death of John Reed, twenty-one, a meat-market porter, of Stamford-street, Blackfriars, who is alleged to have been stabbed by a boot and shoe maker named Robert Rosenkranz, in a shop in St. John-street, Clerkenwell. Robert Somerville, a little boy, deposed that he lived at 5, Rahere-street, Clerkenwell, and was employed at Rosenkranz's shop. On Saturday morning three men entered the shop. They picked up a pair of boots, and were going to walk out of the shop with them when the accused stopped them and took the boots away. Reed, the deceased, afterwards picked up a box of matches from the bench, and then taking up a chair, struck the accused on the back three times with it. The Coroner: What was that for? Did he say anything? The Witness: He did not say a word. I was then sent for the police, but the three men refused to let me leave the shop. At this time Rosenkranz had a shoemaker's knife in his hand, and the deceased ran against it. The Coroner: Now did the accused take the knife up to strike the deceased with? The Witness: No, sir. The deceased fell on to the knife in a struggle with my master. Mr. Rosenkranz was cutting leather at the time, and he used the knife in self-defence. The Coroner: Who told you to say \"self-defence\"? The Witness: I heard someone say so. Herbert Winfred, of 151, Great Saffron-hill, a butcher's porter, stated that on Saturday morning he was standing outside 63, St. John-street, and saw Reed and Lee fall against the shop. The witness at once went up to him, and found that he was bleeding from a wound in the chest. He turned to the witness, exclaiming, \"Oh, Sid, I have been stabbed!\" and added that the man in the shop had done it. By the Coroner: I was not one of the three men who entered the shop, and know nothing further of the occurrence. The boy Somerville (recalled) said he was certain that the witness was one of the men whom he saw in the shop. Winfred: It is a falsehood. The Boy (bursting into tears): It is not. Mr. Osborn, solicitor for the accused, elicited from the witness that he had been with Reed that morning. Police-constable Stevens deposed to being called to the shop on the morning referred to. He found Reed lying outside it, bleeding from a wound in the chest, and at once had him placed in a cab and conveyed to the hospital. Subsequently, on the door being opened, Winfred pointed to Rosenkranz, who was in the passage, and said, \"He is the man.\" By Mr. Osborn: Winfred was then the worse for drink. He afterwards arrested the accused. Police-constable 244 G stated that he asked the deceased when at the hospital how the affair occurred, but he replied, \"I shan't tell you.\" Robert Rosenkranz, the accused, was then sworn, but his evidence was not proceeded with, as the jury said they were satisfied it was a pure accident. Dr. Wagner deposed that the deceased was received at the hospital suffering from a stab in the chest. He rallied, and two days afterwards an operation was successfully performed. He seemed to progress very favourably, but died suddenly on Sunday. Subsequently the witness made a post-mortem, and found that pericarditis and inflammation of the peritoneum had been set up as a result of the injury to the chest. Death resulted. The coroner summed up, and the jury eventually returned a verdict of accidental death.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810641.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 874, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3453, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]