[{"id": "a84d682640323f78ac43049f309090443ecdad82", "text": "DARING JEWEL ROBBERY.\n\nA robbery of valuable jewellery, the property of the Countess Howe, was effected at Portsmouth Harbour Railway Station shortly after noon on Sunday. A special train, with the Prince and Princess Edward of Saxé-Weimar, the Countess Howe, and other guests of the Duke of Richmond during the Goodwood week, reached the station just after a steam packet in which they intended to cross to Cowes had moved off from the station pier. It was decided to take passage in another boat, with the view of joining the Cowes steamer at Clarence Esplanade Pier, Southsea. At this time the traffic to and from the Isle of Wight is exceptionally heavy, and at noon on Sunday the railway staff were busily engaged in facilitating the transfer of luggage from train to steamer, and vice versa. A crane is employed to remove an iron \"cage,\" which will hold a large quantity of goods. This cage, which is in charge of the railway servants, was fully employed during the morning. The luggage of Prince and Princess Edward and the other passengers by the special was placed in the cage, which was about to be set in motion, when a lady's maid in the employ of the Countess Howe, who had travelled from Chichester in charge of a dressing-case containing a quantity of her mistress's jewellery, was proceeding to the steamer. On reaching the cage, and learning that it was to be swung from the station and on to the deck of the steamer, which was lying alongside the pier below, she, by direction, it is said, of Countess Howe, placed the case, which was somewhat heavy, in the cage. It is believed that some other article was placed on the top of it, and that immediately after the crane was in motion. The maid was under the impression that it would reach the steamer as soon as she did, and she at once went down two flights of steps on to the pier and passed over to the steamer. The cage was in course of transit, and on its reaching the deck the servant went to where it alighted to resume possession of the dressing-case, when, to her consternation, it was missing. An alarm was at once raised, but the thief or thieves had by this time got clear of the station. Within a brief period a detective officer was on the spot and a searching inquiry was instituted. No one was seen to touch the cage, but it is clear that someone managed to get possession of the case. Up to the present the police have not succeeded in making an arrest. The articles of jewellery were of the value of upwards of £1,000. The case contained also £90 in bank notes and gold.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811892.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 593, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2555, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]