[{"id": "a5c16706eb1d90d21bcfe268d4282a5f792a6535", "text": "CHROYDON.\n\nAt the borough police-court, Eliza Gillard, an elderly woman, was charged with refractory conduct and refusing to perform her allotted task at the Union Workhouse. Murdoch Mitchell, the labour superintendent, stated that the prisoner was admitted into the workhouse as a casual on Sunday night, and the following morning she was told to clean some pannikins and spoons. She refused to do so without assistance, saying that she would prefer picking oakum. He afterwards found that she had been smoking, and she handed him a pipe. The master ordered the witness to give prisoners a good beating. Without telling him (Tuesday) morning her husband had left the house and she threw the oakum into the road after picking about an ounce of it. The prisoner told the magistrates that she and her husband and child were obliged to leave their furnished lodgings, and being unable to obtain others they had to seek shelter in the casual ward. So far from doing no work she claimed this day's goods—scissors, brass handles, and other things. She had to dress herself in a cold room with the windows wide open, and having a bad chest she asked the official to put her into a warm room. The wife of the labour superintendent said that the tramps will be sent away in a day or two. As to smoking, her doctor had advised her to do so, but the clothes referred to belonged to another woman. Mitchell, recalled, said the prisoner was in a lavatory, but she was put into the oakum room to pick oakum. There was no fire in the room, nor was it heated. The prisoner was in there two hours without a fire. Prisoners were not to see the doctor and said he might have to till half two o'clock. Mitchell, in answer to the Bench, said the floor of the oakum room was of concrete. Elizabeth Everton, a witness called by the prisoner, said she knew nothing of the latter until she asked her to fetch a policeman, \"because they were screwing her hands round the bars of the gate.\" The prisoner said she had first thrown the oakum into the workhouse. Mr. Harold Pye-Smith (chairman) said the Bench felt that the prisoner was insubordinate, for if she went into the workhouse she must do as she was told. They thought, however, that she was not treated with the consideration that might have been shown her being put in a cold room, and so on, and she would be discharged. From this they gave her; they ought to be made to treat poor people better.\n\nTHE TROUBLES OF A MUSICAL CLOWN.\n\nThe case of \"Caminada v. O'Gust\" came before his honour Judge Lumley Smith, Q.C., in the Westminster County Court, and was for claim for 50s., for scoring a waltz for the defendant, a musical clown at the Palace Theatre.\n\nThe defendant admitted that the plaintiff took down a waltz which he whistled and scored it for him, but he said that was done as a friend, and besides that the plaintiff was to participate in the profits.\n\nHis Honour said he did not think the work was done as a friend, and gave judgment for the amount claimed, with costs.\n\nThe defendant asked for time to pay, as he had a large family.\n\nHis Honour: What do you mean by a large family?\n\nA gentleman who acted as interpreter for the defendant replied that he had to keep his wife, four children, four brothers, and his mother.\n\n(Laughter)\n\nMr. Oliver, for the plaintiff, said his salary was £25 a week at the Palace.\n\nAn order to pay by instalments was made.\n\nA CONSTABLE'S FREAK.\n\nPolice-constable George St. Aubyn, 214 Y, aged twenty-three, was charged recently on a warrant, at the North London Police-court, with having absconded from the police service. It was stated that the prisoner should have paraded for duty on November 22, and as he did not do so a warrant was obtained for his arrest. Subsequently the prisoner surrendered at Holloway Police-station, and stated that he had gone into the country to visit friends, and could not get back. He repeated that statement to the magistrate. Inspector Davies mentioned that a decoy and trap which the prisoner had hired from a tradesman on the morning that he had absconded had not been returned, and the police desired to ascertain whether the prisoner's story concerning them was a true one. A remand was ordered, on bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200813774.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 556, "total-output-tokens": 978, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4218, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]