[{"id": "b79f14366edb8e5a8ba59734f3618cf68d67a746", "text": "ANOTHER SHAM DETECTIVE.\n\nAt the North London police-court on Thursday Henry Feneley, 25, labourer, of Brand-street, Hornsey-road, was charged with personating a policeman at the house of Mr. William John Harris, tobacco manufacturer, of Croyde house, Alexandra villas, Seven Sisters-road.\n\nThe prosecutor stated that on the previous night the prisoner knocked at his door. Witness answered almost simultaneously with his servant, and asked the prisoner his business. The prisoner said \"I want to see to the window fastenings of your house, I have just been told off with another detective and a special constable, to warn housekeepers of the numerous robberies that have taken place in this neighbourhood.\" Witness asked him what station he had come from? The prisoner replied, \"From the Y division—Hornsey-road station.\" Knowing he was in the N division witness got suspicious, and detained the prisoner in conversation so as to be able to identify him if necessary. The prisoner was smoking a wooden pipe, which witness also thought unprofessional. Witness asked the prisoner to show some authority—a card, a staff, or some other things usual to detectives. The prisoner replied that he had not his papers with him then, but would have them at 12 o'clock. Prisoner gave his name and address as \"Henry Robinson, Charteris-road.\" After he had gone witness informed the police, who told him they knew nothing of the prisoner. About midnight witness went to his garden gate to see if he could catch a glimpse of the prisoner, and the very second man who passed happened to be the prisoner. Witness seized him and dragged him into the hall, notwithstanding the protestations of the prisoner that he was not the man. There was a struggle between them, and Mrs. Harris blew a police whistle. This brought Police-constable 141 Y on the scene, who took the prisoner to the police-station.\n\nThe prisoner now, in an injured-innocence kind of tone, declared that a great mistake had been made.—In reply to the magistrate the constable said he found a screwdriver, a piece of wire, and a knife upon the prisoner, but no money. Sergeant-gaoler Baker swore to the prisoner as having been charged at this court in July with being concerned, with others, in a breaking and entering job, when he was sentenced to six weeks' hard labour.\n\nThe prisoner, who did not deny this, was remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206277695.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 540, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2372, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]