[{"id": "f3f0d62628ff7a5034afa209c37a19d89b4d5c7d", "text": "EXTRAORDINARY ATTEMPT TO MURDER.\n\n[From our latest editions of last week.]\n\nOn Saturday, Capt. John Orwin, late master of the ship Copse, was charged at the Thames police-court with feloniously cutting and wounding Henry Cuckmore, cook and steward of the same vessel, with intent to murder him.\n\nMr. Charles Young, solicitor, defended the prisoner, who is a man about thirty years of age, with large red beard and moustache. He did not betray any indications of insanity, nor is that line of defense to be set up for him. Prisoner had been brought from Lisbon in custody.\n\nHenry Cuckmore was examined at great length, and deposed to an attempt having been made to cut his throat in his berth on the 21st of last July, while the ship was at sea. That attack was made by the prisoner, who charged another man with the offence. After that the prisoner gave witness a bottle of opium, and wanted him to put it in the men's coffee. He proposed that they should kill the whole of the crew, and then run the vessel to some port and sell her. Witness, however, refused to have anything to do with the diabolical plot. The captain repeated the proposition on several occasions, and rather than join in it witness attempted to jump overboard, but was prevented. On the night of the 31st July witness was again attacked, and severely stabbed. He raised an alarm, and then became insensible. When he came to himself he was lying on a bed in the cabin, and found the captain was in irons. The mate took command of the vessel, and took her to Lisbon, and saw the British consul, who sent the men home.\n\nAfter some confirmatory evidence the prisoner was remanded.\n\nSENDING BAD MEAT TO MARKET.—On Friday, at Guildhall, Gerard Samson, of Preston, Dorsetshire, a butcher, was summoned for sending six pieces of diseased beef to Leadenhall-market for human food.\n\n—Mr. Baylis said this was a very aggravated case. A farmer residing near Preston had a cow that had been afflicted with \"bearing down\" in July and previously in January, so that she was in a very diseased state from inflammation. In other respects the cow was a fine animal, and worth about £18., but in consequence of the disease the animal was labouring under it was sold for the sum of £5. After the defendant had had the cow, and found the condition it was in, he went to the farmer from whom he bought it, and offered to lose half the £5. if he would lose the other half. The farmer refused, and then he had the cow killed and dressed. Some portions of the meat were given to the defendant's pigs, and the rest he sent up to London, where it arrived in a most stinking state from the diseased condition of the animal. The inspectors of meat having proved the above facts, Sir R. Carden sentenced the prisoner to a month's hard labour.—Mr. Chilcott, the farmer, was then called forward, and told by Sir R. Carden that he was almost as culpable as the defendant, and might have been placed at his side had he been sent to the Old Bailey.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206228201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 717, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2985, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]