[{"id": "c91fa41f92f4e96cda6f6f982b3adc90d95c12ce", "text": "THE CHARGE BY MRS. PITTENDREIGH.\n\nOn Wednesday James Plato attended at Worship-street police-court, in answer to an adjourned summons charging him with having assaulted Mrs. Sarah Pittendreigh (well known from the Tichborne case and her many appearances before this court), with a felonious intent. Mrs. Pittendreigh stated that the defendant entered the passage of the house in which she lodged, and calling out her name brought her out of her bed-room; that then the defendant seized her, forced her down, and attempted the offence with which he was charged. Finding himself frustrated by her struggles, he beat her with his fists about the head and body, and, after getting her down a second time in the passage, was pulled off by the complainant's daughter and a man who came in from the street. The case had been adjourned for Mrs. Pittendreigh to bring witnesses to corroborate her statement.—John Thomas Pittendreigh, the son, chemical worker, now said that, on the evening of the 6th (the day after the alleged assault), he was at his mother's house when the defendant called to apologise for what had happened. He used bad language, and endeavoured to assault the witness.—Andrew McKewen, an old soldier, wearing several medals and clasps, said that he was a watchman, and was passing the house on the night in question, and saw the defendant, not as the complainant said in the passage, but outside the house with his hand jammed in the door. He could not get away, and when witness had relieved him by pushing the door the man went away, and Mrs. Pittendreigh followed him (witness) to get his name and address.—Eliza Plato, daughter of the defendant, was called, and said that on the night of the 5th instant she and her mother were waiting for the defendant coming home, and at a quarter to one o'clock, when he was coming down the street the worse for drink, Mrs. Pittendreigh called him over, and he was just going to the door when witness and her mother ran out. Then Mrs. Pittendreigh shut the door, ran upstairs, and threw a pail of water out of the window upon them. Afterwards Mrs. Pittendreigh opened the door, and struck her father on the head with a poker. She tried to shut the door, and jammed her father's hand in it, as he was found by the witness McKewen. Her father had lately received 200l. as compensation for an accident he had had. Mrs. Pittendreigh had been heard to say that she meant to have some of the money for herself.—Mrs. Pittendreigh made several speeches, but ultimately the case was dismissed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206328934.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 618, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2538, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]