[{"id": "874a7c485124c09518624ba11fb0401e1be6834a", "text": "SOUTHWAIR.\n\nBRUTAL ASSAULT ON A WOMAN.—Robert Shea, 40, bricklayer, was charged with two assaults.—About six o'clock on Saturday evening, Constable 131 M., while on duty in High-street, Borough, saw the prisoner strike a woman on the head with a hod and knock her down, causing her to bleed very much. Somebody led her to a surgery, and the prisoner was taken into custody. He then tripped the constable up and kicked him in the jaw. Another constable coming up, he was removed to the station.—The woman did not appear to prefer the charge against the prisoner, who pleaded drunkenness as an excuse.—Mr. Partridge said he trusted that before long an act of Parliament would give magistrates power to order flogging in such cases. As it was, he sentenced him to six months' hard labour.\n\nLAMBETH.\n\nTHE BAKERS AND THE SMOKE ACT.—The case of Arthur Shears, baker, Crampton-street, Newington, reported a fortnight ago, was decided by Mr. Chance. Mr. Russell appeared for the Bakers' Protection society, and stated that the trade complained that the police reported cases which ought not to have been taken, and that the matter was being taken up in the House of Commons. Mr. Chance adjourned the matter in order to make a personal inspection of the place, and witness the fire being lighted. Accordingly he had visited the place and seen the operation. It was a fine day, and he said he had seen no smoke from the furnace, which, in his opinion, ought to have been mentioned. One of the constables said that he had seen the smoke for one minute and a-half.—Inspector Dann said he had not, on the occasion of the visit of the magistrate, seen the smoke, which he should have noticed.—Mr. Chance said he could not convict in this case, and dismissed the summons.\n\nIn another case, against a baker named Giles, evidence was given that black smoke was issuing for 17 minutes.—The defendant's wife positively denied this; but Mr. Chance ultimately inflicted a small fine of 2s. 6d. on the defendant. In two other cases similar fines were imposed.\n\nATTEMPTED MURDER OF A WOMAN.—Frederick Canterbury, a labourer, was again charged with cutting and wounding Susannah Simmonds, with intent to murder her.—Police-constable Brock said he was on duty about a quarter before 10 o'clock on the night of Monday week in Rodney-road. He heard a great disturbance, and on going to No. 121 in the road he found the prisoner knocking loudly at the door. He refused to go away, and continued knocking for about three-quarters of an hour, but no one answered. About 11 o'clock the woman came out, and said she had been living with the prisoner some 15 years, but she did not wish to have any more to do with him. Prisoner swore he would not leave her, and followed her as she walked away. He abused her, and, with an oath, said \"if she did not go home with him he would 'do for her.'\" The prisoner then drew a knife from his pocket, and, making a blow at the woman, said, \"Take that.\" She called out that she was stabbed, and prisoner, turning to witness, said, \"Here is the knife,\" at the same time holding out a long-bladed pocket-knife. The injured woman was taken to St. Thomas's hospital.—The prosecutrix, who appeared to be still suffering much from the injuries inflicted upon her, was obliged to be seated whilst giving her evidence, which fully confirmed that of the constable. She further added that for a long time past prisoner, whilst under the influence of drink, had treated her in a brutal manner.—Mr. Chance committed him for trial.—The prisoner, on leaving the dock, begged the prosecutrix to come and see him, but she refused.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206239287.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 877, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3619, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]