[{"id": "1ad3b39e592386f1bc379f73e8a20071a74445ec", "text": "SPECIAL SUNDAY MORNING EDITION.\n\n'YESTERDAY'S LAW.\n\nQUEEN'S BENCH.\n\nTHE EAST-END SPIRITUALIST CASE.—Mr. Ignatius Williams appeared before the Lord Chief Justice and Mr. Justice Mellor, and said he appeared for William Lawrence, who was sentenced to three months' imprisonment for obtaining money under false pretences. A writ of error had been granted, and he would now proceed to argue the case. He applied to set aside the verdict and judgment, on the ground that the alleged offence did not come within the meaning of the statute with reference to false pretences. There were two counts, one of which was for obtaining money by falsely pretending that he (Lawrence) had power to communicate with the spirits of deceased persons, and produce them in a materialistic form. His first point of argument was that there was no allegation of a false existing fact.—Mr. Justice Mellor: But he said that he was able to summon and produce spirits. That is not a matter of opinion.—The Lord Chief Justice: He says, not that he will do so, but that he has the power and the will to produce the spirits.—Mr. Williams said that no one could say that the spirits were not present.—The Lord Chief Justice: The question of appearances was a question for the jury; it was a matter of fact and not of opinion.—After some further discussion, the Lord Chief Justice said that it was perfectly clear that the defendant had falsely pretended that he had the power to call up and produce spirits. That was clearly a false pretence within the meaning of the act of Parliament. It would be very mischievous indeed if it could be supposed that delusions of this kind could be carried on, not as a mere matter of amusement or of scientific investigation, but for the sordid purpose of obtaining money by such representations. The offence was clearly proved, and the indictment was perfectly in order.—Mr. Justice Mellor concurred.—Lawrence, who had been out on bail, then surrendered to the tipstaff of the court, who accompanied him to Holloway, where he will undergo his sentence.\n\nTHE QUEEN v. GREYSON AND ANOTHER.—This was an indictment for conspiracy, the prosecutor being Mr. Lawrence Levy, formerly an attorney, and the defendants being a firm of solicitors. The allegation was that the defendants conspired with one Symes to prefer a charge of perjury against the prosecutor, which was dismissed by the magistrate, and further that the defendants conspired with Symes to go before a magistrate and prefer an indictment against the prosecutor, which came on for trial before Mr. Baron Pollock at the Kingston assizes, when Symes, through his counsel, withdrew from the prosecution.—The case, part heard on Friday, was resumed yesterday, when the jury \"Acquitted\" the defendants.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206327837.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 618, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2760, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]