[{"id": "5cf39594d2dd8fbf318d2d9b36e4a3e881d399a0", "text": "At the Mary-le-bone Police Office on Friday, Henry Riddle, foreman to Robert Towser, a chimney-sweeper, residing in Adams' mews, Portman-square, appeared before the magistrates on a summons obtained against him by Reed, the chief messenger to the overseers of Mary-le-bone, charging him under the 4th and 5th of William IV., c. 35, with the following act of cruelty towards James Arnold, a boy, about 12 years of age, and who for some time past has been in Towser's employ.—Mr. Rice, a baker, at No. 31, Upper Seymour-street, Portman square, deposed, that on Friday afternoon, the 18th inst., his kitchen-chimney by some accident caught fire, and in consequence of information thereof being communicated to the defendant Riddle, he soon afterwards came to the house, bringing with him the boy Arnold, whom he at once desired to ascend, notwithstanding the ignited soot was at the time coming down in large flakes into the grate.\n\nMr. Rawlinson—Did you remonstrate with Riddle upon the inhumanity of his conduct?—Complainant—I did, and begged of him not to send the boy up, as he would inevitably be suffocated, to which he replied, \"Oh, d—n it, I've many a time been up a chimney ten times worse than that myself, and why can't he do it?\" At this period I had occasion to go up stairs, and made my way on to the roof, just as a friend of mine was about to pour down a quantity of water, when I begged of him not to do so, as I fancied I heard the voice of some one within a short distance of the top of the chimney; we both listened, and heard some one faintly say, \"For God's sake take the chimney-pot off, or I shall be suffocated!\" With some difficulty we tore away the mortar, and, having removed the pot, we beheld the poor boy Arnold, who kept crying out, \"On, pull me up, pull me up!\" My friend then thrust down his arm, and, laying hold of the little sufferer, succeeded in extricating him from his perilous situation.\n\nMr. Rawlinson—Was the chimney at this time still on fire?—Complainant—It was, Sir.—Mr. Rawlinson—in what condition did the boy seem when lifted out of the chimney?—Complainant—He seemed almost in a lifeless state, and in my carrying him in my arms down stairs I was fearful he would not recover. After the lapse of a little time I gave him a small quantity of brandy, and he in a great measure revived; Riddle then took hold of him, and leading him to the roof of the house, insisted upon his descending from the top to the bottom of the chimney, which he did, and he and Riddle then left the place.—Mr. Rawlinson (to Riddle)—What answer have you to make for ill-treating this poor boy in so shameful a manner?—Riddle—The boy is not an apprentice, and he was not sent up the chimney before a quantity of water had been thrown down.—Mr. Rawlinson, after remarking upon the atrocious nature of the offence, ordered Riddle to find bail to answer the charge at the sessions, at the same time expressing a hope that a severe example would be made of him.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3205295615.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 769, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2977, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]