[{"id": "ab3e1301095ad03185c1bafdbeb8399373c3c1c5", "text": "IRELAND.\n\nThe possession of the late James Carey’s seat in the Dublin Town council was decided on Monday. The candidates were the same as on the election which has since been declared invalid, Dr. Wade (Liberal) and Mr. Shanks (Conservative), and as before Dr. Wade was returned. The numbers were—Wade, 124; Shanks, 110.\n\nIn the Nisi Prius Court, an application was made on Tuesday in the case of “Connolly v. Carroll,” on behalf of the defendant, for extension of time to defend. The action was brought to recover £2,000 for alleged slander arising out of the case under investigation at Bruff, county Limerick, in which the plaintiff in the present proceedings, Dr. Connolly, is charged, with his brother, with having conspired to murder Carroll, the defendant. The slander complained of is the statement of Carroll that the plaintiff had conspired to murder him. The application was granted.\n\nAt the Kilmengue, county Kildare, Petty Sessions, on Tuesday, the Rev. S. G. Cotton, manager of the Coragh orphanage, was summoned for committing an aggravated assault upon five orphans by chaining and logging their legs. Defendant took a preliminary objection to the presence of one of the magistrates on the bench, Mr. Bury, alleging that he had an animus against him. Mr. Bury declined to withdraw. The case was eventually adjourned for a fortnight.\n\nOn Thursday the Rev. Thomas Ferris, Castle Lyons, county Cork, was evicted from his residence, a small farm which he held on the estate of Mr. John Walker Perrett. A large force of military and constabulary accompanied the sub-sheriff. The Rev. T. Ferris was the first priest who espoused the Land League programme in the East Riding of Cork.\n\nOn Friday night three farmers, named Casey, Summer, and Nester, were lodged in Limerick gaol, charged with having fired at and wounded a man named Culhane, who took a farm from which a farmer named Naughton had been evicted for non-payment of rent. Three shots were fired at Culhane, whose son, a police-constable, was with him at the time.\n\nAn important discovery of concealed arms was made on Tuesday in a bakery establishment at 121, North Main-street, Cork, and three respectable-looking young men, named Michael Sweeney, John Fitzgerald, and Joseph Stack, were brought before Mr. McDermott, R.M., at the police-office, and charged with having possession of the arms. The prisoners were remanded for eight days on bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206255424.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 593, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2417, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]