[{"id": "c07a05d33f120eee568469756c690b3f99558102", "text": "ADA HATCHARD, ten, and George Hatchard, seven, school children, living at 11, Chargeable-street, Canning-town, were charged, before Mr. Baggallay, at the West Ham Police-court, with being concerned in stealing a purse and contents from the person of Charlotte Savage. Neither of the children could be seen above the rails of the dock, and when they were charged Mr. Baggallay appeared surprised at the accusation. The evidence showed that at half-past eight o'clock on Tuesday night Mrs. Savage went into an eel-shop in the Victoria Dock-road. Mr. Corrigan served her with some stewed eels, and having paid for them she put her purse into her pocket. The prisoners and a younger sister were in the shop, and a minute or two after they had left Mrs. Savage missed her purse. Mr. Corrigan ran after the children, and he declared that while he was watching them he saw Ada \"try\" several ladies' pockets, and he seized her with her hand in one. She was asked for the purse she took in his shop, and she said she had not got it. She and the others were taken back to the shop, and when Constable Hatfield questioned them Ada produced two sixpences and a halfpenny and George two pennies, and they said that was all they had. At the police-station lid. was found tied in the pinafore of the younger child, and in George's coat pocket was a florin. Here he said, \"Ada took the purse and threw it over the wall after we took the money out. We have only had two to-night.\" He further stated that he had given money to his mother to get things out of pawn with. Later in the evening the purse was found on the railway line which runs alongside the Victoria Dock-road. The father of the children, in answer to Mr. Baggallay, said he knew nothing about the affair, and the mother stated that the children left home while she was out. She had a few things in pawn, but the children had never brought any money home. She did not know they had ever stolen purses before. Mr. Baggallay said he had a strong suspicion, but there was not enough to act upon. The Father: I beg your pardon, but the girl had a heavy fall some years ago, and is not responsible for her actions. Mr. Bagallay: Nonsense, nonsense; sit down. I have a strong suspicion, and what you have just said does not lessen that suspicion. I shall discharge the children now, and I would advise their father and mother to be careful in the future. Constable Hatfield asked for instructions as to the disposal of the money found on the children, and Mr. Baggallay told him to hand over the amount Mrs. Savage lost in the purse and keep the remainder till someone applied for it.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810651.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 638, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2625, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]