[{"id": "09c6f36f9586d6cec56f5994ccabc8ce37268fd8", "text": "SINGULAR CHARGE OF ABDUCTION.\n\nFrederick Arbery, 20; a respectable-looking young man, was indicted at the Old Bailey on Wednesday for taking Elizabeth Catherine Tremlett, a girl under 16 years of age, from the custody of her parents and without their consent.—The father of the young woman kept a beerhouse at Clapton, where the prisoner was a customer, and he and the young woman in question got on friendly terms. On the 1st of March Miss Tremlett left her father's house and met the prisoner, and he took her to lodgings that he had provided for her at Northfleet, under the representation that he wanted the apartments for himself and his sister. About the time the prisoner went away with this young woman he had been engaged to be married to another girl, from whom he had at various times obtained £50, under the pretence that he required the money to purchase furniture, and the wedding day was fixed for the 8th of March. Elizabeth Catherine Tremlett was sworn, and said that she left her home because she was not kindly treated, and her sisters were treated more kindly than she was. She said she left home entirely on her own accord, and if the prisoner had not taken her she should not have returned home. She met the prisoner at Hackney-downs railway station, and she told him that she was 13 years of age, because she wanted him to take her away. Preparations had been made by the prisoner to marry her. She went to her father's after she went away with the prisoner, and he would not listen to her, but ordered her out of the house. We were to have been asked in church at Northfleet on the Sunday following, when he was taken upon this charge, I believe he intends to marry me now.—Justice Brett: Does he?—Mr. Brindley said he believed prisoner really intended to marry the witness.—Mr. Justice Brett: Very well, we shall see what he will do when it is all over.—Mr. Brindley, on behalf of the prisoner, contended that there had been no abduction on his part, and he said that if this prosecution had not been instituted, in all probability the prisoner and this young girl would have been married before this. The Judge, in summing up, explained the law to the jury, and they returned a verdict of \"Guilty.\" The learned judge told the prisoner he had acted like a mean, bad fellow. He had obtained a large sum of money from a respectable young woman under the pretence that he intended to marry her, and had then gone away with another girl who was younger and prettier, and spent the money he had obtained from the first young woman in enjoying himself with the other, and his conduct had altogether been most disgraceful. He then sentenced him to six months' imprisonment with hard labour.\n\nFATAL PRIZE FIGHT AT AINTREE.\n\nOn Monday, John Mahony, Michael Farragher, Joseph M'Ann, Thomas Glennon, John Coyle, and John Jones were indicted at the Liverpool assizes for the manslaughter of Simon Looney, at Aintree, on the 2nd of August.—On the day in question the police saw a crowd of roughs going in the direction of the Aintree racecourse. Some races were then engaged in, but ultimately a ring was formed, in which Mahony and Looney, having stripped everything but their trousers and boots, began to fight. The police sent for assistance, but in the meantime the fight went on for about forty minutes in regular rounds, when the man Mahony was heard to call out that he had won. Then the police, seeing assistance coming up, broke into the ring and took Looney, who was about to be carried away, into custody. Subsequently the man died of concussion of the brain, produced probably by the blows from the fist, the deceased being in every respect a powerful and healthy young man.—The jury found the prisoners \"Guilty,\" recommending Mahony to mercy.—The Judge, in passing sentence, addressing Mahony, said that, although the fight had been forced upon him, he had had the power of refusing.—Mahony was then sentenced to four months' imprisonment and the others to six weeks' imprisonment each.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206323842.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 917, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4011, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]