[{"id": "de9fc11b9a8e05134258b0573c45afbf13bb1a86", "text": "ALLEGED CRUELTY BY A MOTHER.\n\nFrances Halahan, living at 157A, Wickersley-road, Lavender-hill, S.W., appeared to answer a summons at the instance of the National Society for the Prevention of Cruelty to Children for unlawfully ill-treating her little daughter, Frances, and two sons, aged twelve, nine, and five years respectively, in such a manner as to cause them unnecessary suffering and injury to their health. Mr. George F. Bell supported the summons on behalf of the society. Mr. F. Cole, an officer of the society, had, in consequence of receiving a letter of complaint he visited the children at their schools, and they alleged brutality on the part of the mother. He visited her, and told her that Frances complained of being kept in the yard without her clothes. The mother replied she could come in if she chose. The boy William had six or seven marks across his shoulders. He was in a neglected and dirty condition, his body not having been washed for some time. Mr. Hopkins: He had a throbbing in the back, and nothing more? Witness: Yes. Mrs. Stacey, a neighbour, said she had heard the children repeatedly crying. On one occasion one of the children exclaimed, \"Oh, don't, mother; oh! don't.\" She had heard Frances fall out of bed and knocked at the wall, and received a reply, \"Stacey, my mother is beating me, and won't let me go to bed.\" She had seen Frances with a black eye and swollen face, and heard the defendant say, \"You dare tell any one; I'll murder you.\" The children had complained of hunger, and she had given Frances food over the garden fence. The noise of beating had been kept up all day and night. A woman, living in the same house as the defendant, was also called. She stated that on one occasion she had heard the children and she heard her say, \"Are you going to kill me quite, mother?\" The girl Frances, a healthy-looking child, was called, and said her mother had struck her with a broom-handle, and kept her in the yard without boots or socks. Replying to the magistrate, the girl admitted that her mother struck her because she ran off with her purse, told lies, and stayed out at night. Mr. Hopkins granted an adjournment for further witnesses, and remarked that Mr. Bell could see the letter which the defendant had produced.\n\nAN INCORRIGIBLE OFFENDER.\n\nA girl, who on this occasion gave the name of Kate James, but who is known under other appellations, and who was some time back forcibly rescued from the custody of Mr. Hall, the missionary, was charged, at the Bow-street Police-court, before Mr. Lushington, with theft. The prosecutor, Morris Hulter, a diminutive Russian tailor, said that about three weeks ago he met the prisoner, whom he knew by sight, and another girl about eleven o'clock at St. Martin's Lane. She called to him, and he went back to her. The other girl caught hold of his right arm, and prisoner then came close to him on his left. Five minutes before he had his purse, containing £15 in gold, in his left-hand pocket. The girls went away, and in about ten minutes he found, on examining his purse, that £14 had been taken out of it. He gave information to the police, and on Tuesday night he again saw the prisoners with two others. On going to meet them, she rushed at him, and the other also tried to make off, she then two striving to detain him. He broke away and followed the prisoner, whom he gave into the custody of 831 E in Villiers-street. She said she did not know the prosecutor. Detective-sergeant Vedder proved a previous conviction in the name of Elizabeth Williams, and told the story of her rescue from Mr. Hall when being sent in his charge by Sir John Bridge to a home. She was committed for trial.\n\nATTEMPTED THEFT OF LETTERS.\n\nEdward White, a shabbily-dressed lad of eighteen, was charged, at the Bow-street Police-court, with attempting to steal letters. A letter-carrier named Ramsay stated that he was entrusted with the morning delivery in York-street, Covent-garden. He delivered three bundles of letters, numbering about five hundred in all, into the letter-box of the Stage newspaper at No. 16. He placed them on the standing-up as he finished putting the letters into the box. Witness moved on to continue his delivery, but upon again looking round he saw the prisoner with his arm barred and thrust up to the elbow into the letter-box at No. 16. He called to Police-constable 20 E, who was in the street, and gave prisoner into custody. There had been numerous complaints of lost letters. A clerk from the office of the Society said a number of letters had been missed lately, and that on one occasion he saw a hand thrust from outside into the letter-box. The prisoner, who when apprehended told the policeman that he \"did it for a game,\" and had already been bound over on a former charge, was sentenced to three months' imprisonment.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810718.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 1133, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4840, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]