[{"id": "00221b7645a8494889100cff0a29d78efcb4f72d", "text": "EMBEZZLEMENT BY A TRAVELLER.\n\nOn Thursday, Robert Simpson, late clerk to Messrs. Lee and Jourdein, the well-known and extensive colliery-owners, was brought up on remand at Bow-street police-court on a charge of embezzlement.\n\nIt appears that in September, 1861, the prisoner was engaged by Mr. Jourdein upon very high recommendations to take charge of one of their numerous branch establishments, situated at Putney. His duties were to superintend the business of the Putney branch; to travel in that locality and take orders from customers; to receive money in payment for coals supplied, and to account for the same in a weekly report, which he delivered to Mr. Jourdein every Monday at the head office of the firm, 9, Lancaster-place, Strand. He was paid a salary of £2, 8s. a week besides travelling expenses, and he had a house at Putney free of rent and taxes. Lately Messrs. Lee and Jourdein had discovered that a small sum which was due from a customer had been paid to the prisoner, who had not accounted for it, and, as Mr. Lewis explained, such occurrences were very annoying, as customers felt it to be unpleasant to have accounts sent in again after they had been paid. Upon calling on the prisoner for an explanation the prosecutors received a letter from the prisoner, acknowledging that during the first eighteen months he had received about £60, which he had not accounted for, and giving a list of the customers whose payments he had kept back. In that letter he expressed great regret for his conduct, and begged hard to be forgiven for the sake of his wife and children. At the former hearing Mr. Lewis observed that Messrs. Lee and Jourdein were most reluctant to prosecute the prisoner, on account of his hitherto excellent character. He had been for many years well known and highly respected in the neighbourhood where he resided, and was the very last person they would have thought capable of any dishonesty. But considering the extent to which they had been robbed, having lost upwards of £3,000 by the defalcations of clerks during the last two years, they felt they had no course but to give the prisoner into custody.\n\nMr. Hall said it would be best to take that course in every instance.—Mr. Lewis said that when appeals were made and letters written similar to that of the prisoner, speaking in a most affecting manner of his wife and children, kind-hearted people found it very much against the grain to act with severity and harshness. Messrs. Lee and Jourdein had therefore forgiven several dishonest clerks, but they felt that they could not go on in such a course for ever.\n\nUpon the case being called on on Thursday, however, Mr. Lewis said that some representations had been made by the prisoner's friends, which induced the prosecutors to believe that a lenient course might properly be adopted. His friends, it appeared, were willing to send him abroad, and there to find some employment for him. Hoping that the imprisonment and anxiety he had already undergone might operate as a warning for the future, Messrs. Lee and Jourdein were desirous, with the magistrate's permission, to withdraw from the prosecution. He wished distinctly to assure the magistrate that they acted thus purely from motives of compassion, and not with a view to any compromise, which, if offered, would have been indignantly refused.\n\nMr. Hall discharged the prisoner, observing that he ought to feel deeply indebted to the prosecutors for their kindness.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206218932.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 782, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3474, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]