[{"id": "e703b89c9f24b718e623b3754a7d1e300f02342b", "text": "ATTEMPTED MURDER OF A MERCHANT.\n\nAt the Bow-street Police-court, five men named James Palmer, Samuel Scandland, Leon Weiner, Adolphus Weiner, and Daniel Jacoby, have been charged with being concerned with a man (already convicted) named Dasant, with attempting to murder Jules Tabak, a diamond merchant, and stealing £2,000 worth of diamonds. Inspector Langham deposed that from information received he went with other officers and arrested the accused on the present charge. Mr. Tabak, a diamond merchant, of 5 Belgrave-street, Buxton-road, deposed that in March 25th, two men came to his house, and asked him to show them some diamonds. Two parcels were shown them. While the men were looking at the diamonds the prisoner Palmer struck witness two heavy blows on the head. He was stunned, the two men ran away, and stole one hundred and eighty carats of diamonds, value £1,400. One of the men (Dasant) was arrested, and has since been convicted and sentenced to penal servitude. He positively identified Palmer as the other man. Mrs. Tabak was called, and identified Palmer as one of the men concerned in the robbery. She did not identify him at first. Eleanor Deminzio, the daughter of the man Dasant, deposed that on March 25th, the day of the robbery, the prisoner Palmer called on her and beckoned her to the corner of the street. He asked for her father. He said, \"I struck the old man. He screamed, and his wife came upstairs and we were obliged to run away. I dare say your father will blame me for all this, but my brother was outside and did all he could to stop the servant.\" Witness asked if the servant was stopped. Prisoner replied in the negative. She asked if her father had got away. Prisoner replied, \"No,\" and told her she had better pack up her luggage and get away from the house at once, and leave her luggage in the cloak-room. He said, \"You know where Weiner lives. You must go down to him and tell him to assist you. Witness packed up her luggage and took it to Waterloo Station, and afterwards went to Adolphus Weiner's house. She packed the luggage and sent it to Waterloo Station the same day. She then went to 6, Dyers' Buildings, and saw Adolphus Weiner. Directly she saw him he said, \"For God's sake go away! I will send you to Castle-street.\" She went there, where she shortly after met and took her to a wine shop in Chancery lane. Witness said, \"You have got my father into this trouble, and I shall expect you to get him out of it.\" He denied at first that he knew anything about it. She told him that her father had told her about the affair from the beginning. He said that all he did was to get her father a situation. She said she knew that was false, and that he sent her father to Mr. Tabak. First he said he would not assist her at all, and then he gave her 5s., and said he would give her that every week until she got employment. He said whatever she did she must not come near Dyer's Buildings, because he was watched. Then she went to Jacoby's house, but he was not at home. She saw him, however, on the following Friday at his place in the Edgware-road. He said he did not know they were going to strike him. Witness told him he must take the money for her father's maintenance in the House of Detention. He promised to do so, and met witness the next night in Aylsham-bury-street, Clerkenwell. She gave him 10s. for her father. On the following Monday she was to meet the elder Weiner, who promised to give her £2 12s. for the rent then due by her father. Weiner did not turn up, but subsequently she saw Jacoby, who gave her 4s. to pay the rent. He told her not to go to Weiner's place at all. He promised to meet her at the Marble Arch the following Wednesday, but by the advice of Palmer and his wife she did not go. On March 25th, after seeing Palmer, she went to the house of her mother-in-law. He came in and sat for his wife. They took witness to their house, and sent for her luggage from Waterloo. She remained in the house for nine weeks. Witness knew the whole of the prisoners, who were in the habit of coming to the house of witness's father. Three weeks after Christmas Jacoby came to their house with a bottle of chloroform. They tried it on the kitten. On a subsequent occasion the elder Weiner took a rabbit to the house and witness was ordered out of the room. When she returned the windows were open, and there was a strong smell of chloroform in the room. She believed they had tried it on the rabbit. The accused, who protested their innocence, were remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200803382.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1107, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4529, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]