[{"id": "a77836fd030e878da112c906e34d9103971fa88b", "text": "THE TOTTENHAM TRAGEDY.\n\nThe shocking murder of a little boy two years old by his mother has horrified the neighbourhood of Tottenham. The boy was a dark-eyed little fellow, with black curly hair, and being a bright child, was noticed and petted by the neighbours and children around. There are two other children—a boy Wilfred, aged eight, and a girl Grace, aged six—and all that can be said about them at present is that they are supposed to be the children of Mary Green, the prisoner in custody. While residing at Page-green she has always represented herself as a married woman, the wife of a sailor at sea, and passed as Mrs. James. A little more than two years ago she resided in Newton-street and subsequently lodged with a midwife. The neighbours considered she had one great fault, and that was a habit of sitting with her head out of the window, or being out in the front nearly all day, reading novels, till at last she fell into lazy habits, and neglected both herself and her children. She was in receipt of about £2 10s. per month, which used to come regularly by post. Towards the end of each month she would run into debt, but paid up when her money arrived. She used to be visited by a gentleman somewhat older than herself, who she used to say was her father, but beyond that she was very reticent as to her affairs.\n\nIn the early part of last year she gradually got more neglectful and untidy, and would frequently go for days without washing her face or combing her hair. While in this untidy state her father had been heard to say, \"Why don't you wash yourself; and make yourself tidy, as you once used to do?\" She would reply, \"My appearance is good enough for me and the position I am in now, and I have no heart for anything.\" About April last the calls of the visitor ceased, and the woman then seemed to become depressed. The children were shockingly neglected and dirty, and the little girl was both weakly and diseased. When at last the mother was rather sharply remonstrated with she used to reply, \"Life is not worth living. What have I to live and be tidy for?\" Then she took to drink, and grew more dull. She gradually sold her furniture, and getting eight weeks in arrears for rent, received notice to leave. As she clung to her rooms the landlady removed into Barnard-road, near by, and Mrs. James was left in the house by herself. Several days before the murder, the eldest little boy told a neighbour that they were all going to leave, for \"they were going to live in Clapton pond.\" The next day the children were startled by the mother seizing the elder boy, as though about to strangle him, but the door in some mysterious way flew open, and she desisted. On Saturday, the 11th, the children had no food till the mother sold the last things she had—some saucepans and other household utensils, for which she got 3s. When Sunday came, \"with no dinner, no fire; no food, no hope, the tragedy began with the strangling of the youngest child. His terrible death struggles awakened the mother to a sense of pity for the elder boy and girl; and taking them to the police-station she asked what she was to do with them. She then gave herself up for the terrible crime she had committed.\" It is said that the prisoner, Mary Green—for that is her name—is a native of Pimlico, and that she has no parents, her father having recently died. The case is in the hands of Detective Inspector Powell, and the Treasury have taken up the prosecution. It is expected that the gentleman visitor will be called at the next examination.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811421.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 825, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3552, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]