[{"id": "245c0d00404497b8cb33ee2dd6a748304cebf25e", "text": "Conviction of Burglars.—A Notorious Gang.—John Hayes, aged thirty-five, labourer, Samuel Parsons, aged thirty-four, and John Holder, shoemakers, were indicted on Wednesday for attempting to commit a burglary. John Wright, porter at a house in Victoria-street, Westminster, said about two on the morning of the 3d inst. he was awake by a noise at the back part of the house. He got up and went down stairs with another man, and on opening the back door on the basement saw the three prisoners on a piece of waste ground at the back of the house. The police being near they were given in charge. Upon examination of the premises, he found the iron bars had been wrenched out of their sockets. Prisoners all had their boots off. Parsons said, \"We will wait upon you another time. There is nothing taken from the house.\" Police-constable Barrett, 285 B, said he was sent to Victoria-street, and waited in the office. At two o'clock he heard some one on the leads, and, slipping his boots off, ran up and looked about. With the last witness and another man they quickly opened the door and rushed out upon the prisoners, who were breaking into No. 4. The porter presented a revolver at Holder, and threatened to blow out his brains if he moved. The other man had a rifle and bayonet fixed, which he presented at the prisoners. The prisoners said they came there to sleep, and didn't wish to be disturbed. The prisoners' hands were lashed together, and they were removed to the station. When examined, some burglarious implements were found upon them. The other man was examined, and corroborated the above evidence. The Jury found the prisoners Guilty. The prison warders and police-constables proved the prisoners to belong to a notorious gang of burglars, and had repeatedly been convicted. The Court sentenced Hayes to one year, and Holder to two years' imprisonment with hard labour; and Parsons, who was the worst of the three, to penal servitude for seven years.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3202448316.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 2166, "total-output-tokens": 466, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1963, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]