[{"id": "51ce1e4d2a98e6f45fa2bd59465a61e5f7dbfd49", "text": "THE CONDEMNED CONVICT SAUNDERS.\n(Latest Particulars.)\n\nCHELMSFORD, FRIDAY.\n\nYesterday the acting deputy-sheriff, T. M. Gepp, Esq., received information that the grandfather of this culprit died while labouring under insanity. It has already been stated that the convict's mother died a lunatic; and, from the indefatigable exertions of Mr. Gepp, a mass of information has been collected and forwarded to the Home Authorities since the receipt of the reprieve, which expires on Tuesday next. The result of these inquiries has induced Lord Palmerston to authorize two physicians of eminence, and experienced in cases of lunacy, to proceed to Springfield Gaol, and yesterday they arrived, and made a minute examination of the state of the prisoner's mind, but, of course, their opinions were not publicly expressed. They will make a special report forthwith to the Home Secretary of State, and upon that document, the ultimate fate of the criminal will depend on Wednesday next. Among other information obtained by Mr. Gepp is some from the market gardeners of Mortlake, where, it seems, the prisoner was known as \"Silly Charley Saunders,\" and was flippant and idiotic at times, although at others he was a steady workman. He appears to have a great aversion to Irishmen, and labours under the delusion that they entertain feelings of revenge towards him in consequence of his having posted some placards respecting Cardinal Wiseman. The culprit himself, since his condemnation, has related to the chaplain and surgeon of the gaol several acts of violence (or supposed acts) which he declares he has been guilty of. While at work for Mr. Hoare, the brewer, he states that he struck at an Irishman with a sickle in the night, under the impression that the latter would murder him; he also says that he attacked two costermongers and a policeman on Woolwich Common with a knife, but none of these assertions can be traced to have any truthful foundation in them. The opinion of Mr. Gibson, the surgeon of the gaol, is, that he is insane on these points; he also expressed his belief that he is entitled to £1,000, which he wishes to be shared between his own sister and the widow of the unfortunate Mr. Toller, who he still maintains he killed in self defence, despite the religious exhortations and persuasive reasonings of the Rev. Mr. Hamilton. In addition to following the occupation of market gardening the convict has been to Africa as cook in a trading vessel, and also been employed in various barges and fishing smacks. It is the general opinion of the local authorities, that Lord Palmerston's determination will not be known before Monday next.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3202413249.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 611, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2650, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]