[{"id": "8c38277abde36efaff36609ee22b73aabc3dccb8", "text": "BRENTFORD PETTY SESSIONS.\n\nTHE BITER BIT—SINGULAR CASE.\n\nYesterday William Quantill, John Desforges, and John Spratley, a coachman, ostler, and post-boy, in the employ of Mr. Cullin, the landlord of the Castle tavern, Brentford, were charged with appropriating to their own use the sum of £30.\n\nFrom the evidence produced, it appeared that, a few days since, Spratley was hired by a lady and gentleman who alighted at the Castle, from Williams's Reading coach, to drive them to Clapham. On his return he gave a 20l. note, No. 12,688, and a 10l., 14,420, to Quantill to take to London and get changed for sovereigns, saying he had found them in the chaise after he had put his fare down. Quantill, after his return, gave Spratley only £24, saying he should keep the other for his trouble. Spratley, not much pleased with his conduct, gave 21 sovereigns to the prisoner, Desforges, to keep for him, and on his asking him for them on Saturday, he refused to return him more than £14. Spratley accordingly applied to the magistrates on the same day for a summons against his fellow-prisoners. When the magistrates became acquainted with the above circumstances, they ordered all three to be taken into custody.\n\nThe Driver of Williams's coach remembered bringing a lady and gentleman to the Castle, Brentford, but he did not know who they were, as they came to the coach in a post-chaise.\n\nInspector Marchant informed the Bench, that he had that morning received a letter from the Inspector at Clapham, to whom he had written, stating that although he had used every endeavour, he had been unable to ascertain who the parties were whom the prisoner Spratley had driven in his chaise.\n\nThe prisoners, having nothing to say, were remanded for re-examination.\n\nIMPORTANT TO LICENSED VICTUALLERS.\n\nMessrs. Thomas Holford and William English, the landlords of the Chequers and the Ball public-houses, at Isleworth, were each fined £5, and 12s. costs, for selling beer previous to their respective licences being transferred. The informations were laid by a common informer, named John Thomas, whose witness, George Bowley, stated, that on the 20th of October last he went into the defendants' houses, in the first of which he was served with a pint of porter, and in the other with a pot. The licences of the houses were not transferred until the following day, the 21st ult.\n\nThe MAGISTRATES expressed great regret at being compelled to convict in cases of the above nature, and hoped that some member, friendly to licensed victuallers, would bring in a bill to repeal the 9th Geo. IV., cap. 61, sec. 18, under which Act they had no option. It was as painful to them to convict as it was to the defendants to be convicted.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3207165983.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 699, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2714, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]