[{"id": "13ecc140bbb8953c58159a8632c960b8d682b135", "text": "SOUTH DEVON ELECTION.\n\nTo the Editor of the Morning Chronicle.\n\nSir—I yesterday recorded my vote at Kingsbridge in favour of Lord John Russell, and soon afterwards took my departure for London. From what I have seen and heard, I have no doubt but that the Tory candidate will prove successful.\n\nThroughout the county the walls were marked with \"No Russell,\" \"No Popery,\" and similar epithets; and bills, charging Lord John with almost everything that is evil, were extensively circulated.\n\nReports were also afloat calculated to frighten the electors of South Devon, and induce them to believe that Lord John would establish Popery, with all its train of persecuting horrors; but this bugbear to frighten the good people of South Devon is nothing compared to the tyranny exercised by the Tory landholders and parish priests over their tenants and parishioners.\n\nIt is notorious that multitudes of landlords gave their tenants the option of voting contrary to conscience, or the sacrifice of their families by quitting their estates. Hundreds, it is supposed, yielded to the claims of their families; and large numbers, known to be decided Liberals, voted for the Tory candidate to save their families from ruin.\n\nA farmer, with tears in his eyes, came to solicit my advice under these circumstances. I hesitated as to the advice I should give, when he paused, and then exclaimed in an agony of desperation, \"I am determined to do my duty, and await the consequences.\" I could not but admire his patriotism.\n\nIs it right that men and their families should be placed in this dilemma? I have ever been opposed to the ballot, but unless some other remedy can be found, from what the last few days have shown me, I am convinced of its utility.\n\nI have seen flocks of poor tenants driven to the polling place like negro slaves to the market; the squire and parish priest in their carriages, leading; the poor tenants of the parish following; and livery servants bringing up the cavalcade, like whippers-in, to see that none escaped.\n\nIs this freedom of election? Can it be endured much longer? Either let the country be given up to the aristocracy and parsons, or protect the tenants from worse than slavery.\n\nI hope the defeat in Devon will produce a remedy for this horrible evil.—I am, Sir, yours respectfully,\n\nEastcheap, May 5.\n\nR. PEEK.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3207644658.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 520, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2336, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]