[{"id": "bf410540fb29e57bf19bbbfd2b4a5107c1f4ce47", "text": "CHARGE AGAINST A CLERGYMAN.\n\nAt the Portsmouth Police-court, the Rev. William Radcliffe, thirty-eight, was charged, on a warrant, with obtaining by means of false pretences a pair of gloves and a necktie, value 5s., from Mr. William Bowen Thomas, outfitter, of Commercial-road, on the 13th inst. Mr. E. J. Harvey prosecuted. The prisoner, a tall, well-dressed man, was undefended. Mr. Harvey, in briefly opening the case, said that on the 13th inst. the prisoner went to Mr. Thomas's shop and represented himself to be a nephew of the Rev. E. R. Dolling. Believing that to be true, Mr. Thomas supplied him with various articles, but Mr. Dolling, who would be called, would tell the Bench that the prisoner's statement was entirely false. Mr. William Bowen Thomas, outfitter, of Commercial-road, said that on the 13th the prisoner went to his shop and asked for a particular kind of shirt. The witness said he had not got it, and in the course of a conversation which followed the prisoner said he was a clergyman lately invalided out of the army for some weakness of the chest, and that he had been recommended to take riding exercise. He also said he only knew two clergymen in the town, the late Mr. Shuttle and the Rev. Mr. Dolling, of Landport, who was his uncle. Believing his tale to be true, the witness let him have a necktie and a pair of gloves. The Rev. Robert Radcliffe Dolling, vicar-designate of St. Agatha's, said the prisoner was no relative of his, nor had the accused any authority to pledge his credit. Detective-sergeant Munt deposed that on Tuesday afternoon at about half-past two o'clock he apprehended the prisoner in Hampshire-terrace as the accused was going to his lodgings. The witness said, \"I have reason to believe you are the Rev. Mr. Radcliffe,\" and the prisoner replied, \"I am.\" The witness then said he had a warrant for his arrest, and the prisoner said, \"Very well, I'll go quietly.\" The Witness: You have examined my things? The Witness: Yes, and amongst them I found letters of orders in the name of the Rev. William Radcliffe, dated some years ago. On this evidence Mr. Harvey asked for a remand for a week. The prisoner asked that he should be committed at once, so that he might be tried at the quarter sessions on Friday. It would be a great injustice to him to keep him in prison three months awaiting trial. The Bench decided to remand the prisoner in custody for a week. He then applied that his money (£2) should be handed over to him to enable him to telegraph to his friends. The Bench directed that the prisoner should have enough money to enable him to communicate with his friends.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810927.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 653, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2633, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]