[{"id": "807ed32509bc3272f1438991acc010e873e8f929", "text": "MURDER AT PORTSMOUTH.\n\nA very shocking occurrence took place late on Friday, the 22nd Feb., at No. 15, Kettering-place, Mile-end-road, Portsmouth. The person whose life has on this occasion been destroyed, was Amelia Ansell, wife of William Ansell, a steward in the navy, and recently returned to this country in the Albion, 90, on board which ship he was captain's steward.\n\nAnsell and the deceased had been out together on Friday afternoon, and she returned home earlier than he did. Between ten and eleven o'clock a next-door neighbour heard Ansell and his wife quarrelling, and, soon after, the report of firearms. Some persons thereon went into the house and found the unfortunate woman lying on the floor quite senseless, and bleeding profusely from the temple. Medical assistance was immediately procured, but death ensued in about an hour. The police being informed of the tragedy, at once took Ansell into custody. The latter told the constable that it was an accident. He happened to have the pistol in his hand, and his wife touched the cock. He did not know at the time whether it was cocked or not, and that when it went off he was so overwhelmed that he did not hear the report. When he recovered himself he saw the blood gushing from her temple, and he put out his arms and said, \"Amelia, what have I done?\" He ran down stairs, he said, to send for medical aid. The ball entered just above the left temple, and lodged between the right jaw bone and the right ear. But there were some of the fingers of the left hand shot away, as though the hand had been raised to protect the temple.\n\nOn Monday, the prisoner was examined before the borough magistrates. The chief evidence bearing against the prisoner was that of the neighbours in the two houses adjoining his residence in Kettering-street, Mile-end-road, Landport. The houses in this street are separated from each other merely by partitions of wood and plaster, and it appears that the residents of the houses adjoining the prisoner's heard distinctly a quarrel between him and his wife, and ultimately the exclamation from the latter, \"Help, murder! oh, give me time to make my peace.\" Immediately after, the report of firearms was heard. The neighbours, on going into the house, secured the prisoner, and then sent for medical assistance, but it did not avail even to prolong life. The police found a six-barrelled Colt's revolver in the house, five barrels of which were loaded and the other empty. The only cause that can be assigned for the committal of the act is a belief on the part of the prisoner of his wife's infidelity. He was committed for trial at the Winchester assizes. He evinced the deepest emotion in court.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206312608.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 624, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2696, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]