[{"id": "b8ca234cee892f9d614d735aef944907bd4cc181", "text": "STABBING IN SOUTH LONDON.\n\nThe mental condition of Thomas Cutbush, to whose case reference was made last week, has by no means improved since his imprisonment, and there now appears very little probability that he will be able to render any assistance to those who are anxious to show that the police were in error in associating him with the mysterious stabbing cases in South London. His relatives are firm in the conviction that, had the prisoner been allowed to plead, they would have been able to convince the jury of his innocence. The circumstances, they freely admit, were suspicious, but they contend that they were not beyond explanation, and, as to the alleged stabbing of a young lady on Thursday, the 5th of March, they assert that they had evidence that would have shown it to be impossible that it could have been committed by Cutbush.\n\nOne strong point in their favour is the statement made by Mrs. Dickinson, who has been seen by a representative of Lloyd's. Mrs. Dickinson keeps a gunsmith's shop in the Minories, close to the Tower of London, and it was there that Cutbush purchased the dagger that was produced at the police-court. Mrs. Dickinson appears to remember the transaction pretty clearly, and she expresses her conviction that the knife was purchased on Saturday, the 7th March, two days after Miss Johnson was stabbed in the Kennington-park-road. Cutbush appears to have given two reasons for the purchase of the knife, the first being that he was going on board a ship on which there were some foreign sailors, and the second that he wanted it to protect himself against the men who were after him, meaning, presumably, the men sent by the parochial authorities to convey him to the workhouse.—Mr. George Kirk, the solicitor engaged for the defence, told our reporter that he did not feel at liberty to disclose the details of the evidence which he was prepared to offer; but he added that, to put the matter briefly, he intended to establish an alibi. The South London stabbing case therefore remains shrouded in mystery.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206275945.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 459, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2054, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]