[{"id": "ca7213f899368f8be32679fd782e357bd1d715ea", "text": "ARREST OF SALVATIONISTS.\n\nAt the Westminster Police-court, on Monday, William Blaney, twenty-one, described as a cadet in the Salvation Army, living at the barracks in Cheyne-row, Chelsea, was charged before Mr. Sheil with wilfully obstructing the public footway at First-street, Chelsea, by preaching therein, and with refusing to give his name and address when requested to do so by Police-sergeant Howlett, 3 B Reserve. There was another charge against Arthur Reynolds, twenty-two, captain in the Salvation Army, and fourteen other persons, all members of the army, of disorderly conduct, causing a crowd to assemble, and refusing to disperse, at Walton-street, Chelsea, whereby the thoroughfare was obstructed, and a breach of the peace rendered probable. The court was crowded with persons interested in the case. Mr. Superintendent Shepherd watched the proceedings on behalf of the police authorities, Inspector Doogan conducting the case. The prisoners were ranged in two lines across the court. Half a dozen of them were in the uniform of the Salvation Army. The others presented the appearance of respectable working men. Mr. Safford (chief clerk) said he had a letter from a Colonel Nicol, at the headquarters of the Army, asking that the prisoners might be remanded till counsel could be instructed for the defence. Captain Reynolds: I have to ask for a remand, sir. We have had no time to get legal advice. Mr. Sheil: Why have they not sent someone from your headquarters? Captain Reynolds: They have not had time, sir. We all had to be here at ten o'clock this morning. Mr. Safford: The prisoners were admitted to bail between four and five o'clock on Sunday afternoon. Mr. Sheil: What time do you ask for? Mr. Parsons (an officer from the Salvation Army headquarters): I appear on behalf of Messrs. Burton, Matthews, and Ranger, solicitors to the Salvation Army, to ask for a remand for three or four days for the purpose of instructing counsel. Mr. Sheil: I shall do nothing of the sort; it is a ridiculous request. I will remand them until tomorrow, if you like. Mr. Parsons: Make it two days, your worship. Inspector Doogan: There are several gentlemen here as witnesses for the police who cannot very well come on another day. Mr. Sheil: Very well, I will go on with the case now. They have had plenty of time to obtain advice. Mr. Parsons still pressed for a remand. Mr. Sheil: Very well; I will remand them, on the same bail as before. A Police Witness: But, your worship, I have already been kept here since eleven o'clock this morning. Mr. Sheil: I can't help it. If I do not give them time to get counsel it will be a great grievance. I will remand the prisoners to any day that will suit the witnesses. Mr. Superintendent Shepherd: The whole of the prisoners have been on bail since Sunday afternoon. Mr. Sheil: I will go on with the case. After a moment's consideration Mr. Sheil added: No; I think, on consideration of the circumstances, that I will adjourn the case till a later date. The prisoners must be ready with their defence then. A Witness: Your honour, there are over a dozen gentlemen here to-day who perhaps cannot attend again. Mr. Sheil: I can't help it. I cannot go on if they ask for legal assistance. Mr. Superintendent Shepherd agreeing, the further hearing of the case was adjourned. A gentleman put in bail at once for all the prisoners' reappearance.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200807974.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 799, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3397, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]