[{"id": "a459562f898b3af72972e3946262285785000667", "text": "BIRTHS.\n\nJan. 2, at 66, Shepperton Cottages, New North-road, Islington, the lady of Mr. Henry L. Cavaliero, of a daughter.\nJan. 5, at Deal, the wife of Julius Brockman Backhouse, C.B., late Captain and Brevet Major Bengal Artillery, of a daughter.\nJan. 6, at Upper Chapman-street, Commercial-road East, the wife of Mr. J. Clark, of a daughter.\nJan. 7, Royal Circus, Edinburgh, on the 7th inst., the wife of Major Blackburn, 85th Light Infantry, of a son.\nJan. 8, at Manchester-square, the wife of Sidney Gurney, Esq., of a daughter.\nJan. 8, at 10, Lowndes-square, the Hon. Mrs. Mark Kerr, of a son.\nJan. 9, at 37, Leadenhall-street, Mrs. Edward Constance, of twin sons.\n\nMARRIED.\n\nJan. 7, at St. George's Church, Hanover-square, John Fitzgerald, Esq., of Chester-place, to Theophila Sophia, daughter of Abraham Howard, Esq., of Eccleston-square.\nJan. 7, at St. George's Church, Hanover-square, Captain A.C. Gleig, Royal Artillery, to Jessie, only daughter of John Stuart, Esq., M.P.\nJan. 9, at St. James's Church, Francis Boynton Cowper, Esq., 86th Regt., to Jane Cranstoun, youngest daughter of the late F. H. Macnamara, Esq., 52nd Regt.\nJan. 9, at Trinity Church, Clowdesley-square, Islington, Adam Gilson, Esq., of Copenhagen-street, Islington, to Emma, daughter of —— Pine, Esq., of City-road.\n\nDIED.\n\nJan. 6, at Imperial-square, Cheltenham, Major John Williams, R.\nJan. 7, at Portsmouth, Captain Sir Henry Blackwood, Bart., R.N., commanding H.M. ship Vengeance.\nJan. 7, at Queen's-road West (formerly Paradise-row), Chelsea, Miss Anne Bray, aged 80.\nJan. 8, in Woburn-square, Sarah, relict of the late Thomas Davy, Esq., of Gould-square, aged 84.\nJan. 8, at 33, Marine-parade, Dover, Lieutenant-Colonel Baldwin, aged 77.\nJan. 8, aged 33, Catherine Caroline, the beloved wife of the Rev. J. V. Povesh, 16, Tavistock square.\nJan. 8, Ebenezer Thompson, Esq., formerly of Norwood, Surrey, in his 89th year.\nJan. 9, of diarrhoea, Sydney William, infant son of Mr. R. F. Sutcliffe, 19, Long-acre.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206197135.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 681, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1995, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]