[{"id": "23f7d9edfb3934425452f02f908f73d64d084469", "text": "ALLEGED FRAUDS BY SHIPS' STEWARDS.\n\nThe trial of William Henry Harkom, steward of the Agincourt, was brought to a close on Thursday. After three hours' deliberation the Court found as follows:—\"That the eight charges had been fully proved against the prisoner; but, in consideration of his previous good character and the excellent testimonials produced, we only adjudge him to six months' imprisonment in one of her Majesty's gaols, at the expiration of which time to be dismissed the service.\"\n\nThe court-martial for the trial of Charles Townsend, ship's steward of the Inconstant, on charges of fraud and conspiracy, was brought to a close on Wednesday on board the Duke of Wellington.—Mr. Fegan read the prisoner's defence. He contended there was no evidence of conspiracy, as Curtis said he did not pay or make any agreement to pay prisoners any sum for surplus beef.—After two hours' deliberation, the Court found the charges not proved, and \"Acquitted\" the prisoner.\n\nDELIBERATE ATTEMPT AT MURDER.—At the Dumbarton police-court on Monday, a young man, named Thomas M'Donough, a painter or labourer, was charged with attempting to murder, or seriously wound, Stephen Martin, a labourer, by shooting him in the back of the head. It appears that on Sunday night Martin, who lodged in the same house as M'Donough, in Close 171, High-street, was, shortly after seven o'clock, sitting with his back close to an unscreened window reading; when a shot was heard fired in a garden behind, and Martin at once gave the alarm that he was wounded at the back of the head. Along with others in the house and the close, Martin was able to rush out to see who had fired the shot, and amongst those thus engaged M'Donough took an active part. Information was given to the police, and their suspicions falling on M'Donough he was taken into custody. On his being searched two pellets were found in one of his boots, similar to two which were subsequently extracted from the wounded man's neck; and footmarks in the garden, in the direction from which the shot came, correspond exactly with the boots worn by M'Donough when apprehended. On the 30th ult. M'Donough and Martin were fined for a breach of the peace committed in a publichouse where they had quarrelled. The prisoner was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206236342.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 552, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2291, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]