[{"id": "82fb10547b24975f748eaa6fdb86e48d82966509", "text": "Yesterday forenoon, the body of a male person, unknown, apparently about twenty years of age, was discovered by a Thames police inspector floating in the river off Ratcliff. The deceased was taken ashore at the dead house for identification. The body had been in the water nearly a fortnight, and was identified as a mariner. The body showed an injury received before Mr. Humphrey's. Yesterday afternoon, an inquest was held by Mr. Phillips, surgeon, at the London hospital, on the body of Phoebe Grisley, aged twenty-two years, who lately resided with her friends at No. 8, Somerset street, High-street, Whitechapel, who died from the effects of injuries received by fire. It was elicited that the deceased was a woman of ill repute which extended her dress, which must have ignited by the kitchen fire. The jury returned a verdict of \"Accidental Death.\"\n\nYesterday morning, the police authorities of the Whitechapel union offered a reward of £2 for the apprehension of the natural parents of a male child, who had been found lying on the front steps of the workhouse, Charles street, Mile end New town. The deceased was about nine months old, and was only partially dressed. The deceased was seen by the medical officer, and with nourishment the poor little child has recovered and is going on favourably.\n\nYesterday, a child named Alice Humphreys, aged five years, who lived with her parents at Pimlico street, Pimlico, was playing outside of her house, and while leaning against the railing of the area one of them gave way, and the poor child was precipitated into the river, a height of nearly ten feet. She was carried to the hospital, where it was found that her thigh was fractured, besides severe injuries.\n\nYesterday, Mr. Payne held an inquest at Guy's hospital on the body of Mary Hill, aged sixty-five. The deceased lived in Pleasant place, Kennington road, and had been for some weeks confined to her bed. Her landlady, while assisting her to leave her bed, heard something snap twice, when the deceased exclaimed, \"There, my thigh is broken.\" She was afterwards taken to the hospital, where she expired. The house surgeon said the cause of the bone breaking so easily came from a cancer having formed in it and nearly destroyed it. The jury returned a verdict of \"Accidental Death.\"\n\nOn Friday morning, the Rev. Mr. Ambrose, of Park-street, Regent's park, purchased a parcel of theological books at a stall in Regent's park. Amongst them was a work entitled, \"A Christ's Exhortation unto customary awardees,\" by Miles Everdale, black letter, printed by Thomas Hall, without date, but supposed to be 1635. On inspecting the volume he observed two guineas, of the reign of George I., sewn in the cover.\n\nIn the Bankruptcy Court on Friday, there was a dividend distributed under the separate estate of Messrs. Davis and Troughton, bankers, of Shoreditch. It was said the dividend will be 20s. in the pound, with a considerable surplus applicable to the joint estate.\n\nYesterday, Mr. Walthew held an inquest at the Great Man tavern, City road, St. Luke's, on the body of William Cartil, aged sixty years, a shoemaker, who committed suicide by hanging himself at 12 o'clock. While Lion-park, Westcross street, the deceased had been out of employment for the last three months, and had lately received parochial relief to the amount of £1 and a half weekly. He was in great distress and said that he could not bear up against his troubles much longer.\n\nOn Wednesday morning, the deceased was discovered in his room, suspended to the rail of the bedstead. He was cut down, and speedily seen by Dr. Timothy, of Barbican; but the deceased had been dead some hours from strangulation, which had produced dilatation of the upper cervical vertebrae of the neck.\n\nThe jury returned a verdict of \"Temporary insanity, brought on by extreme distress.\"\n\nOn Friday evening, Mr. Walthew held an inquest at the Spotted Dog public-house, High street, Poplar, on the body of Mary Welch, aged thirty-five years, who was found dead in the Limehouse cut of the river Lee, Poplar, on Thursday morning last. The evidence proved that the deceased had left her husband to cohabit with another man, and a few days since she had come words, with the latter individual, and it is supposed that the deceased in a moment of great desperation plunged herself into the water unobserved. A few shillings were found in her pocket, and the deceased on the night before her death had been seen in a state of intoxication. The jury returned an open verdict, \"Found dead in the river Lee, but when, how, or by what means she became immersed they had no evidence to prove.\"\n\nPrinted and published at the Office, 13, Salisbury-square, Fleet-street, in the parish of St. Bride, in the City of London, by EDWARD LLOYD, of 13, Salisbury-square, in the aforesaid City of London.—May 26th, 1861.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206211275.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 1146, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4861, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]