[{"id": "88b099652c7c4f55d00e5f85cf30037fd7111372", "text": "A MERCHANT'S DIVORCE CASE.\n\nThe case of \"Frentzel v. Frentzel, Steiner, and Welch,\" came before the Divorce division on Thursday.—This was the petition of the husband for a dissolution of his marriage on the ground of his wife's adultery with the co-respondents. Answers were filed denying the charges, and the respondent charged her husband with cruelty, and prayed for a judicial separation on that ground.—From the opening of counsel, it appeared that the parties were married Sept. 29, 1856, and petitioner is a silk merchant. After the marriage the parties resided at Stoke Newington, and subsequently the respondent gave way to habits of intemperance, and there was a separation, the petitioner allowing his wife $807. per annum. At that time he had not sufficient evidence to bring a suit for divorce, but subsequently obtained the testimony of servants.—The petitioner was called and spoke to the facts of the marriage, and in cross-examination deposed to quarrels between himself and his wife. On one occasion his wife was hurt, but she was a great actress. He had known Steiner for 20 years. He separated from his wife in 1876, and charged her with committing adultery. The suit was instituted in January of last year. Dr. Welch was living in Stoke Newington-road with his wife. He first called Dr. Welch in to his wife, who pretended to have taken poison. Dr. Welch was frequently at the house, and used to join in the whist parties. A great deal of other evidence was given to show the visits of the co-respondent, and one witness went so far as to state that at midnight he observed the respondent and co-respondent in a position more than suggestive of adultery.—The case was not concluded when the Court rose. The case was continued on Friday, and the jury deliberated for some hours. At the rising of the Court, at a late hour, they acquitted Steiner of being guilty of adultery, and the petitioner of being guilty of cruelty; but said that whether Dr. Welch and the respondent had been guilty of misconduct, they were unable to agree, and were discharged.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206244096.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 489, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2072, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]