[{"id": "79f03515bb63cbcd39f4d1f99dc657fdaf5e9d2f", "text": "TERRIBLE ASSAULTS UPON CONSTABLES\n\nAt the Central Criminal Court, John Milligan, twenty-two, Samuel Milligan, nineteen, and George Martin, nineteen, were indicted for maliciously wounding Police-constables Smeeth and Tappin with intent to murder them. Mr. Elliott and Mr. Biron prosecuted, and Mr. Lawless defended Martin. The evidence in connection with the case, which related to an attempted burglary at Maze-hill Station, Greenwich, and to the subsequent violent assault on the police who endeavoured to arrest the prisoners, will be fresh in the public recollection. On behalf of the prisoner Martin a number of witnesses were called to prove an alibi. Mr. Justice Day, in addressing the jury, said there was in this country an admirable police force, who did their duty, as they had done it in this case, nobly. The jury acquitted Martin, and convicted the Milligans. The two latter were described by the police as being notoriously bad characters and \"pests\" and \"terrors\" to the neighbourhood. John Milligan was sentenced to fifteen and Samuel Milligan to seven years. His lordship awarded the officer Smeeth £20, Tappin £10, and Inspector Easton £5.\n\nBEFORE the mining section of the Labour Commission, Mr. W. Jenkins, general manager of the Ocean Coal Company's Steam Collieries, situated in the Rhondda Valley and the neighbourhood, gave an outline of the conditions of labour in that district. He said that during the last ten years the average loss of life had been one for every 196,000 tons of coals produced. Since 1886 the colliers' wages had risen from 4s. 1½d. a day to 7s. 3d.\n\nMURDEROUS ASSAULT ON A PARAMOUR.—Richard Harris, aged forty-seven, broker, was indicted, at the Central Criminal Court, for maliciously wounding Emily Smith, with intent to murder. Smith had been cohabiting with Harris for some years. On January 4th he returned home, and angry words passing between the parties it was alleged that Harris bolted the doors of the house and then savagely attacked the woman with a pair of tongs, and afterwards with a poker and a chopper, inflicting nineteen terrible wounds. The jury found the prisoner guilty. He urged, in mitigation, that he had taken the woman from a bad life with the view of reforming her. The prisoner was ordered to be kept in penal servitude for seven years.\n\nARREST OF A NOTORIOUS BURGLAR.—A middle-aged man, named Thomas Stone, who has been twice convicted for burglary, one of his sentences being five years' penal servitude, and once for housebreaking, was charged, at the Wandsworth Police-court, with burglariously breaking and entering 14, Lavender-terrace, Battersea, and stealing therefrom eight sheets, six table-cloths, eight men's shirts, and other articles, which were entrusted to Sophia Coles, a laundress, to wash. Police-constable Watkins, 127 V, said that at a quarter to six that morning he was on duty in Falcon-road, and saw the prisoner carrying a sack on his shoulder. He asked him what he had, and he replied, \"Look and see.\" He threw the sack down and ran off. Witness followed and overtook him. He walked quietly to the station. He threw a candle away, and on him were found three boxes of silent matches and two wax tapers. The sack was found to contain the stolen property. Mrs. Coles identified the property, and said that the house had been entered by the kitchen window. Mr. Plowden remanded the prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810128.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 831, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3392, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]