[{"id": "99685bd8a7162c898552f5ae18e78a9527991d4d", "text": "A WOMAN PASSING AS A MAN.\n\nOn Saturday last, a man was found drowned at Mode Wheel, on the river Irwell, in the township of Pendlebury, in the borough of Salford. On going to take the inquest in the afternoon, the body appeared to be that of a man about fifty or sixty years of age. From the evidence it appeared that a man named Yates, employed at the Mode Wheel works, discovered the body in a nearly erect position at half-past six that morning, in the sluice leading from the river Irwell. With the assistance of a man named James Moyles, he got the body out of the water, and conveyed it to the Swan inn, Pendlebury, where it lay until Saturday night.\n\nMary Gorton, who keeps a beer-shop near the Swan inn, stated that on Friday afternoon this man came to her house, and remained from three o'clock until five. He appeared perfectly sober. During the time he remained he asked for a glass of beer and a pipe of tobacco, and had four glasses in all, for which he paid sixpence. Before leaving he inquired of her at what time the gates of the lodge leading to Mode Wheel were closed for the night. She inquired whether he was going to Manchester, when he replied, \"No, to Throttle Nest.\" The witness said \"he appeared to be upset in his mind,\" and she had no further conversation with him. He was a stranger to her before this.\n\nOne of the jury remarked, that if it was the person he supposed, he knew him well. His name was Henry Stokes; but though he was known by this name he was not a man, and his proper name was Harriet Stokes. She had assumed the name and garb of a man for a great number of years, and had served an apprenticeship as a bricksetter, after working as a journeyman, and then for several years in business, having constructed many of the warehouses, chapels, and dwelling-houses in the neighbourhood of Manchester, the last work being the erection of a factory chimney for Mr. Simpson.\n\nThe coroner then directed two women to examine the body, who came back tittering, saying it was true; it was the body of a woman.\n\nHarriett Taylor, who lives in the neighbourhood, said she knew Stokes well. He was a bricksetter. The proper name was Harriet Stokes, but he went by the name of Harry Stokes. Some years ago Stokes married a woman in Manchester. They lived together as man and wife, and kept a beershop, in Quay-street, Manchester. Several of the jury recollected the case, and that ballads were composed and sung in the streets on its being known that the supposed man was a woman.—The verdict was \"Found drowned. Supposed suicide.\"\n\nSince the inquest we have ascertained from inquiries that it is stated that about twenty-five years ago this woman was married to a female, who made complaint that her husband was not a man, and left her in consequence.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206206688.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 661, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2778, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]