[{"id": "ec8d96a952ce7d6dd127fa54276b466b8e56cde9", "text": "A PRETENDED FORTUNE.\n\nRobert Boorer, 25, alias James Porter, a young man who was employed as a groom and a coachman by a music-hall agent, was charged at the Westminster police-court yesterday, on remand, with obtaining money by fraud and false representations from Henry Pope, an omnibus conductor, and others.—The wife of the prosecutor Pope deposed that in the early part of the year 1883 the prisoner was a lodger in her husband's house in Dorset-place, Pimlico. The accused said his name was James Porter, and represented himself as the nephew of Mr. John Porter, the racehorse trainer of Newmarket. In the month of June, at which time prisoner owed over £10l. for board and lodging, he gave out that his uncle Porter had died and left him a fortune. He displayed to Mr. and Mrs. Pope a number of letters on deep mourning notepaper, purporting to be written by a \"Mr. G. W. Lewis, Q.C.\", to the effect that his (prisoner's) presence was urgently required at Newmarket to settle his late uncle's affairs. He also exhibited a fictitious will, the reading of which extraordinary document caused amusement. It set out that the testator left his estates and racehorses to James Porter (the prisoner) subject to an interest to his sister Dorothea, to be paid when she arrived at the age of 21. The value of the estates was set out at 17,870l., and the will concluded \"Signed before the executors, Matthew Dawson and Sir George Chetwynd, both of Newmarket, gentlemen.\" Annexed to the document, and put in evidence by Mrs. Pope, was a schedule or catalogue of the horses and other property which the prisoner said had been sent to him by his lawyers, and this list was headed \"Kingsclere stable.\" It included 139 mares in foal (laughter), 45 yearlings, 20 geldings, broughams, mail phaetons, 207 patent collars, 14 fields, comprising 394 acres 3 roods 2 perches, three fields of new hay, three cornfields, and cattle, poultry, &c. The Popes said that, believing all the prisoner's representations, they advanced him 5l. in order to go to Newmarket to look after his estates and money.—Mr. George Gardner Leader, solicitor, of Mark-lane, E.C., deposed that he was very intimately acquainted with Mr. John Porter, trainer, of Kingsclere, and acted professionally for him. He had never seen the prisoner before, and Mr. John Porter was alive and very well that morning. Witness had made Mr. Porter's will, and it contained no provision in favour of the prisoner (laughter).—Mr. Charles Long, Deputy Chief constable of the county of Cambridge, and superintendent of the Newmarket division, said there was no Mr. John Porter living at Newmarket. Mr. Porter trained at Kingsclere.—Detective-serjeant McGowan, who arrested prisoner, deposed to his confessing he had the money from Mrs. Pope, and offered to repay her by instalments. After leaving her house she saw no more of him for 14 months, when she saw him in charge of a trap outside a music-hall.—Prisoner had obtained money from a servant and others by the same false pretences, but they declined to come forward.—Prisoner called no witnesses, and made no answer to the charge.—Mr. D'Eyncourt committed him for trial to the London county sessions.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206269988.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 808, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3195, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]