[{"id": "6fcea5534db7df9c63449580345540f0f8621211", "text": "THE COURT.\n\nOn Monday, Tousson Pasha, only son of the viceroy of Egypt, was introduced to the Queen by Sir Moses Montefiore, to take leave on his return home.\n\nOn Tuesday, Prince Philip of Wurtemberg, attended by Baron Charles de Guttenberg, arrived at Windsor castle on a visit. Lord John Manners and the Right Honourable Benjamin Disraeli also arrived at the castle, and dined with her Majesty. In the afternoon, the Queen received in the Quadrangle of the castle a 12lb. gun, with harness and complete equipment for the field, given by the Emperor of the French to her Majesty. The Duke of Malakoff arrived from London to present the gun, which had been sent to England in charge of Major Melchior, of the artillery of the French imperial guard. The duke presented Major Melchior, who explained to her Majesty the particulars of the gun, which was afterwards marched and trotted past her Majesty in the Quadrangle. Messrs. Clayton and Bell had the honour of submitting to the Queen and prince consort specimens of painted glass, executed by them for the windows of the University of Sydney, New South Wales. Sir Charles Nicholson, provost of the university, was present to explain to her Majesty the plans of the building.\n\nOn Wednesday afternoon, the Prince of Wales left Windsor castle for Dover, where he embarked at night for Ostend. His royal highness will travel by Brussels and Cologne and proceed to Berlin, on a visit for about three weeks to the Prince and Princess Frederick William of Prussia.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206204170.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1752, "total-output-tokens": 357, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1508, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]