[{"id": "dbbeaf1fc926662e29f624a8687eca209213ce37", "text": "THE MARYLEBONE TRAGEDY.\n\nElizabeth White, 38, a married woman, of 2, Wimpole-mews, Cavendish-square, was brought up on remand, at Marylebone police-court, on Friday, charged with causing the death of Edward White, aged seven, by strangling him, and with attempting to strangle George Wilfred White, aged five years.\n\nMr. Angus Lewis now appeared to prosecute on behalf of the Treasury. He called Mary Deeley, who said she was a widow. She stated she had been taking care of the prisoner's children while she was in a lunatic asylum. That continued for 10 weeks. On the 10th inst. the prisoner was brought back to her home, and witness continued there, the prisoner assisting in the household duties. About 10 o'clock on the morning of the 14th Mr. White went out, leaving witness, the prisoner, and the four children in the living room. Shortly after the prisoner went into the sitting-room, taking with her the three elder children, witness remaining in the other room scrubbing the floor, and the baby was asleep. A few minutes later witness heard screams coming from the sitting-room, and on going there found the door locked on the inside and she could not open it. She sent for a groom next door, and he fetched the butler from the front house.\n\nBy the Magistrate: The prisoner had varied in her conduct. She had named several times about her having been sent to a lunatic asylum, but she never complained about her husband having done so. She appeared to be kind to the children, but took no interest in them.\n\nAfter hearing the medical evidence, Mr. Cooke asked the prisoner if she had anything to say, to which she simply shook her head, the same as she had done on other occasions when she had been spoken to.\n\nMr. Cooke committed her for trial, and ordered her to be removed in a cab.\n\nALLEGED ATTEMPTED WIFE MURDER.\n\nA labourer named Joseph Brindley was charged, at Manchester, on Thursday, with attempting to murder his wife, Mary Ellen Brindley.—It appeared from a statement made by the wife that she got out of bed that (Thursday) morning, when the prisoner dealt her a tremendous blow on the head, which knocked her senseless. Afterwards her screams brought into the house several persons who were going to an adjacent mill to work. A doctor was sent for, and when a police-serjeant arrived Dr. Smith was dressing the injured woman's wounds. The serjeant heard Mrs. Brindley exclaim, \"Oh, Joe, what have you done it for?\" When charged with the offence prisoner made no reply, but on the way to the court he said to the officer, \"I don't know what possessed me to do it. Will it be a six months' job?\" In the room, close to where the woman received the blow or blows, an axe handle, with the head lying near covered with blood, was found, and she believes she was struck with this. A knife was also found at the top of the stairs, and, judging from a mark on the woman's throat, the accused had evidently attempted to cut her throat with it. Dr. Smith has certified that Mrs. Brindley is suffering from two incised wounds, two contused wounds, and four bruises. There is also a slight cut on the side of the throat. The woman was stated to be too ill to appear at the court. The prisoner was remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206270929.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 772, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3215, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]