[{"id": "eb9eae17d27462bb549db6145e60df383a23a2fe", "text": "BAIL COURT.—SATURDAY.\n\nThe Queen v. Harrison.—Mr. Cresswell moved for a rule to show cause why an information in the nature of a quo warranto should not be filed against John Harrison, Wilson Harrison, and James Harrison, commanding them to show by what authority they exercise the offices of freemen of the borough of Lancaster. His affidavits stated, that in April last, John Harrison was admitted a freeman of Lancaster, on the ground of his having served an apprenticeship under an indenture executed in the year 1800, and that immediately after he was admitted, the other two parties, who are his sons, claimed to be admitted freemen, as entitled by birth, and that they were accordingly admitted. He had a number of affidavits showing that the father did not serve the apprenticeship mentioned, and therefore, wished his lordship would grant the rule—Rule granted.\n\nThe Queen v. Postlethwaite.—Mr. Cresswell moved to enlarge the rule which had been obtained against the defendant, who is an attorney at Ulverstone, calling upon him to show cause why a criminal information should not be filed against him for a libel.—Rule enlarged until next term.\n\nThe Queen v. The Bishop of Winchester.—During the sittings last term, on the application of Dr. Free, the Court granted a rule to show cause why a mandamus should not be issued against the Bishop of Winchester, commanding him to hear and decide upon the appeal of Dr. Free, Fellow of St John's College, dated the 26th of May, 1837, and award him immediate sustenance out of the funds of the College, and the arrears thereof from the beginning of the year 1830. Sir W. Follett now showed cause against the rule, contending that Dr. Free has ceased to be a member of the college many years ago, which was decided when the first rule was obtained. A second rule had been discharged in the same manner, and this was the fifth application. Under these circumstances he asked his lordship to discharge the rule with costs. Dr. Free was heard in support of the rule; after which Mr. Justice Patteson discharged it with costs.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3205295659.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 495, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2074, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]