[{"id": "67c9ed75f767a63d9dad56bbf74d59bd01a3f285", "text": "THE MURDERER OF THAIN.\n\nThe public is already aware that the execution of Christian Sattler, the Bavarian, which was to have taken place on Monday last, at Newgate, has been postponed, by the order of the home secretary, to the 8th of February, upon the ground that under the peculiar circumstances of the case, it was considered advisable that the judges of the Court of Criminal Appeal should have an opportunity of considering all the facts of the case.\n\nAs there is no treaty for the extradition of criminals between this country and the Hamburg authorities, but for the circumstance of the prisoner not being provided with the necessary papers, the police of Hamburg could not have interfered with him; and there is no doubt that the arrest of the prisoner was merely a contrivance to get him into the custody of the deceased officer, that he might be brought to England upon the charge of robbing Mr. Ballantine, and that the proceedings taken to effect this object were, to a certain extent, illegal. If the judges, upon consideration of the facts, should ultimately come to the same conclusion, the probability is that the capital sentence will not be carried out, but the punishment will be commuted to such an one as would probably have been inflicted if the prisoner had been convicted of manslaughter only.\n\nWhen the prisoner was informed of the respite, but at the same time told that he must not found any hopes that his life would be ultimately spared, which might prove delusive if the legal point were decided against him, he expressed himself grateful for the respite that was afforded him, and evidently felt the impression that the capital sentence would not be carried out. The prisoner accounts for the extraordinary expressions made use of by him after the transaction, by saying that he was in a very excited state, and observing the angry feeling of the people on board the vessel, he was desirous that they should put an end to him, as, in the first burst of their indignation, they had threatened they would do.\n\nThe prisoner seems to have entirely abandoned his atheistical notions, and attends chapel regularly, and pays great attention to the spiritual consolation offered him by the Rev. Mr. Davis, the ordinary of the gaol of Newgate. He appears to be in a much better state of mind than at the period of his trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201960.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 506, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2347, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]