[{"id": "0be55c27b0c957172177544489843a291b3230ef", "text": "THOMAS FLETCHER, a child only twelve years old, was indicted for stealing two bottles of wine, the property of John Humphery, Esq., M.P., the proprietor of Hayes's Wharf, Tooley-street.\n\nMr. John Jagers, a clerk on the wharf, stated that the prisoner was pot-boy at the Chequers public-house, the back part of which looked on the wharf. On Sunday evening, the 15th of June, the watchman (Flannagan) brought the prisoner to him, with two bottles of wine, which wine belonged to the prosecutor. The witness gave the prisoner into custody.\n\nCross-examined by Mr. Clarkson: There was a counting-house on the wharf, called \"Davis's;\" after the prisoner was in custody witness went in there, and perceived a strong smell of sherry; two mugs were there which had had sherry in them; in all, nine bottles of sherry were missing. The prisoner appeared as if he had been drinking.\n\nWm. Flannagan, the watchman, stated that on the Sunday morning the prisoner brought some beer to him on the wharf, and witness drank of it; in an hour afterwards he brought a pot of ale, and witness again drank; about two o'clock the prisoner brought him two bottles, which he said contained wine, the drainings of other bottles, which were his perquisites, and witness partook of those bottles; he then saw no more of the prisoner until he stopped him at night with the two bottles in question.\n\nCross-examined: Had the key of Davis's counting-house, but, on his oath, was not in there drinking with the prisoner; knew Elizabeth Lee, the bar-maid at the Chequers, but did not see her on that day; he was not drunk, but he had had some whiskey, and such strong stuff.\n\nHutchins, a constable, took the prisoner into custody. In cross-examination, he said he saw in the counting-house two vessels which had had sherry in them; Flannagan appeared as if he had been drinking.\n\nFor the defence, Elizabeth Lee, the bar-maid at the Chequers, was called; and she stated that between five and six o'clock on the Sunday afternoon she called the prisoner to his tea, and not receiving any answer, she went into Davis's counting-house, and there saw Flannagan and the prisoner; on seeing her they both came out.\n\nBy the Recorder: Could not have been mistaken, for in three hours afterwards she was surprised to hear that Flannagan had taken the boy into custody. The prisoner bore an excellent character up to his acquaintance with Flannagan; and if he were acquitted, his master would again take him into his employ.\n\nA number of other witnesses gave the prisoner an excellent character.\n\nThe Recorder, in summing up, commented in strong terms upon the conduct of the witness Flannagan, in drinking beer and ale from the prisoner, for which he did not pay a farthing, and said it appeared clear to him (the Recorder) that, if the prisoner did commit the robbery, it must have been in concert with some one on the premises.\n\nThe Jury instantly acquitted the prisoner, and he was handed over to his friends.\n\nThe Recorder allowed the expenses of all the witnesses except Flannagan, whose conduct he described as infamous.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3207163457.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 732, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3080, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]