[{"id": "46451cefc9bfe0446e8f57f5d023ed428837ba3c", "text": "THE \"FREETHINKER\" LIBELS.\n\nOn Monday, at the Mansion-house police-court, Messrs. Ramsay, Foote, and Whittle, described as the proprietor, editor, and printer of the Freethinker, again appeared, in answer to their bail, charged with having in certain issues of that paper published scandalous and blasphemous libels. Mr. Charles Bradlaugh, the lessee of the premises in Stonecutter-street, where the business of the Freethought Publishing company is carried on, was also summoned for the same offence.—Mr. Bradlaugh, on the opening of the case, raised several technical objections, which the Lord Mayor overruled.—Mr. Moloney refrained from openly reading the libels in court, owing to their odious and blasphemous nature, and at the suggestion of the Lord Mayor he merely supplied the dates of the several issues. In the last number, from which the usual obscene woodcut was omitted, there was a paragraph evidently written by one of the defendants, in which it was stated that he intended to make the ears of the court tingle before he had done with it.—Mr. R. Woodhams, manager of the branch of the London and Westminster bank, St. John's-wood, produced a signature book and an entry relating to the Freethought Publishing company's account. The entry was made by Mr. Bradlaugh, Mrs. Besant, and witness himself, and was dated January, 1877.—The production of the pass-book and certain cheques payable to Ramsay was objected to by Mr. Bradlaugh.—Mr. Moloney said the object of putting in the cheques was to show that Ramsay, Foote, and Whittle were the servants of Mr. Bradlaugh.—Mr. Bradlaugh admitted that Ramsay was the manager of the Freethought Publishing company.—After a lengthy discussion, the Lord Mayor ordered the banker's book and the cheques to be impounded, so as to facilitate reference to them hereafter.\n\nOn Friday, Mr. Lickfold applied that the case might be withdrawn against the defendant Whittle, who was merely the printer, and who knew nothing whatever of the article or contents of the paper complained of. He was willing to undertake that he would not interfere any further with the printing of the paper.—Mr. Moloney being willing, the case was then withdrawn as against Whittle.\n\nThe Lord Mayor committed the other defendants for trial, and fixed Mr. Bradlaugh's bail—himself in 100l., and the other defendants in their own recognisance of 100l. each.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206252794.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 585, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2380, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]