[{"id": "d5389f3516a3f2de242880edc3cb59d11b82b58e", "text": "THE PROVINCES.\n\nBUCKINGHAMSHIRE.—SHOCKING MURDER OF A WIFE.—The little town of Olney was on Monday the scene of a shocking murder. It appeared that some time ago a married woman, Ellen Smith, of Olney, who lived in a cottage Flag-lane, in the yard of a quarryman with her wife, cut her throat from ear to ear with an ordinary shoemaker's knife. The body was found on the floor of the cottage, and the weapon on the floor also. The body was delivered by Sergeant Batchelor, one of the police officers stationed in the town, and gave himself into custody. Mr. Grindon, the surgeon, was summoned to examine the wound. The prisoner, who is a cripple, is about 30 years of age, and has recently left the infirmary. From the evidence adduced it appeared that the deed was attended with some amount of deliberation. On Monday morning the deceased, Mrs. Nicholas, was drinking, with her husband, at the public house. She returned home at half-past eleven o'clock, and he said, \"Jane, what game do you call this?\" She did not reply, but went out again, and returned some time under two o'clock. He asked her to return home, saying she was going with other men while I'm away, but not while I'm here.\" She answered with abusive and insulting language, and at length she said, \"I'll show you.\" She then drew his knife across her throat.\" A woman who was in the house washing took the weapon away from him, and then they resumed work. The prisoner, however, continued to abuse her, and she suddenly retired from his seat, he said, \"Now I will do it.\" With these words he threw her down, and, holding back her head with his right hand, cut her throat with his knife. The woman who had washed the knife held it in his right. The screams of the victim and the washerwoman brought a number of women and children into the house, and soon after in came the landlord of the public house. Some said to him, \"Pray don't! Let her have one struggle.\" But he answered, \"No, no one,\" and hacked at the woman's throat till he had killed her. He then turned towards the road, raised his arms in a wash-tub, put on his coat, and gave himself into custody. The jury returned a verdict of \"Wilful murder.\"\n\nCAMBRIDGE.—THE STRANGE AFFAIR AT CAMBRIDGE.—Thomas Ellington Cotton, of Hereford, schoolmaster, was again brought before the Cambridge magistrates last Tuesday, charged with having committed an assault upon Mr. Dunn, a grocer, for an unlawful purpose. It will be remembered that the prisoner had been to supper with a tradesman and that he was found at four o'clock in the morning late at night, with the window of his room open, and the window of his neighbour's room open, proving the prisoner to have been alone in the front part of the house about two hours before he was found in the laundry. A policeman, who was there, stated that the prisoner was seen sitting on a chair drunk. Whilst the prisoner was addressing the court, a letter arrived from Hereford from his daughter, in which it was stated that the father had been ill for some days. The Bench could not believe the prisoner was on the premises for a felonious purpose, and decided to deal with the matter as malicious mischief. They ordered him to appear before the magistrates at Cambridge next Tuesday, and could not therefore be malicious. The Bench fined him £2, damage £1, and costs or one month's imprisonment. The prisoner said he could not afford to pay the fine, and would rather kill himself than endure it. He was removed in custody.\n\nDEVONSHIRE.—CRUEL MURDER.—In connection with the adjourned trial, the bodies of the seven men and boys, who were killed by the fall of a wall at Stonehouse on the 15th inst., was concluded on Monday. Mr. Snowdon, the owner of the property, Mr. Keen, the contractor, were examined. They stated that, but for the delay of the local board, the wall would have been taken down and rebuilt by that time. Mr. Keen stated that he had been engaged against Snowdon and Blight, the contractor, who engaged the men and sent them into the building to work more extensively. The best bears were saved for the owner. Snowdon and Blight were admitted to bail, themselves in £100, each and two sureties of £100 each.\n\n— SUPPOSED WIFE MURDER.—At four o'clock on Sunday morning last Sarah Gorman, a pensioner of the Royal marines, was found at Morewood, between Halstead and Tunbridge, lying on the road, bleeding very much. Her husband was beside her, taken into custody, his clothes being stained with blood. A broken bottle was found near the spot. The man belonged to Mr. Eyles, farmer, where she died at two o'clock on Sunday. The deceased and her husband had been hopping in and out of the road. On Saturday night they left Tunbridge, and in the middle of the night they were heard quarrelling on the road. Gorman, who is 45 years of age, was brought up on the road, and was found lying on the road. Tuesday. From the evidence it appeared that the deceased, having been cruelly kicked and beaten about the head and body with several sticks, her ribs broken, her face disfigured, and face nearly torn off, was found lying in the road almost dead, her only clothing being a small piece of cotton material over her shoulders. The rest of her clothes were torn from her body. She died on the side of the road. A man named Wigg first discovered the poor woman, having been attracted to the spot by hearing groans and crying sounds. Of Wigg, who was standing near, he was wounded in the knees of his husband, who was crouching under the hedge. The immediate cause of death was effusion of blood on the brain arising from a blow on the head. The body of the murdered woman was returned, assisted by Gompton.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206319497.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 510, "total-output-tokens": 1342, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5677, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]