[{"id": "c69420cbdd9be488b1537389f1635932bd325dfd", "text": "MANSLAUGHTER AT WAPPING.\n\nOn Thursday, Samuel Howard, aged thirty-eight, described as a labourer, was indicted at the Central Criminal Court for feloniously killing and slaying Sarah Smith, a female with whom he cohabited as his wife. Mr. Orridge appeared on the part of the prosecution, and Mr. Ribton defended the prisoner.\n\nIt appeared from the evidence that on the morning of the 2nd of January, between five and six o'clock, the prisoner went to the police station at Wapping, and told the inspector that he had found his wife dead, and he knew that he should be taken up for it; therefore he had come to give himself in charge. The inspector, upon hearing his statement, sent a policeman named Busby with the prisoner to his house, 6, New-court, St. George's-in-the-East. Upon the officer going into his room he found the deceased on the floor, dressed, lying on her back, dead. The prisoner said she had fallen out of bed and struck herself, which killed her. Busby and prisoner then went and fetched a doctor, but it was of no avail, as the deceased had been dead sometime. Several witnesses living in the court proved that they heard the prisoner and deceased quarrelling during the night, and that they heard a fall, but did not take any further notice, and went into their own homes. One witness said he saw the prisoner come home about ten o'clock the previous night, and heard him say, \"I will do for her to-night.\"\n\nDr. Ross, of High-street, Shadwell, said he was called in to see the deceased by the officer on the morning in question. The prisoner told him that when he came home there was no fire and they quarrelled, and he struck her and went out. When coming home again he got into bed, and in the morning he found her dead on the floor. He afterwards made a post-mortem examination of the body. The immediate cause of death was disease of the heart. There were two marks on the face and two at the side of the head by blows, which had accelerated death.\n\nMr. Ribton made an able address on the part of the prisoner, and contended that the unfortunate woman had received the injuries through falling out of bed.\n\nThe common sergeant summed up the facts to the jury, explaining the law in such cases, and after a short consultation they returned a verdict of guilty. The common-sergeant, after a feeling address, sentenced him to twelve months' imprisonment, with hard labour, in the House of Correction.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206213265.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 567, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2423, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]