[{"id": "e2fe4560762b7cbda61eab877ee1e944b137b74a", "text": "BETTING CLUBS AND EMBEZZLEMENTS.\n\nHARRY AUGUSTUS KRUSE, twenty-four, clerk, of Northwold-road, Upper Clapton, was before Mr. Haden Corser at North London Police-court, on Monday, on a charge of embezzling various sums of money collected by him on behalf of his employers Messrs. Matthew Rose and Sons, drapers, of Mare-street, Hackney. Mr. Samuels prosecuted, and Mr. Young defended. The evidence showed that the prisoner had been employed by Messrs. Rose as collector for twelve months prior to last September, when he absconded. Soon after that his receipt book was sent back, pointing out the sums which he had received and not paid in. Mr. Corser: What is the total amount of the defalcations? Mr. Young: The prosecutors have very generously agreed to proceed on one charge only, viz., £2 3s. 4d., received from Mr. Llewellyo, of Coborn-road, Bow. Mr. Corser: What is the total amount? Mr. Young: £39. Mr. Mold, prosecutor's cashier, said he had not received the various amounts which had been marked by the accused. Mr. Corser: What wages had he? Mr. Rose: Thirty-five shillings a week. Mr. Young said the prisoner pleaded guilty, and expressed great sorrow; but he had given due notice to the prosecutors, so that there might recoup themselves from the Guarantee Society. Mr. Ross: Oh, don't think for one moment that we are pressing the case because of the money not having been recovered. Detective-sergeant Whitlock, of the J Division, said he apprehended the prisoner at Tottenham on Saturday night, when the latter replied, to the reading of the warrant, \"All right; I had the money, and shall plead guilty to it.\" Mr. Young said the prisoner had been taken to a club of which he was not a member, and there induced to gamble. He took several small sums of his master's money, and made notes of them in the hope of repaying them. But he became hopelessly involved, and sent back his books and absconded. Since then the prisoner had had three months' serious illness as a consequence of over worry. Mr. Corser remanded the prisoner to consider what he would do with him.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810269.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1246, "total-output-tokens": 532, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2080, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]