[{"id": "5ae5c0ade8e185fe91ae743483a033a43f6eb4b9", "text": "COURT OF COMMON PLEAS.\n\nWALLACK v. WEBSTER.—This was an action for an alleged breach of agreement in theatrical matters (heard on Friday), of which the following is a summary:—Mr. Wallack's engagement with Mr. Webster was from March, 1851, to June, 1852, at 30l. per week, the engagement to be subject to the rules of the theatre. Mr. Wallack appeared and utterly failed. Mr. Webster offered every inducement to Mr. Wallack to cancel the engagement without success. Mr. Wallack subsequently committed various breaches in the rules, and in particular by not attending the preliminary meeting of the company for the season 1851 and 1852, but Mr. Webster being absent from England, and not being informed of such breach being committed, Mr. Wallack was paid a week's salary subsequent to such breach by the treasurer. Mr. Webster, on being informed of the breach, discharged Mr. Wallack, and an action was brought for arrears of salary, and it was objected by Mr. Wallack that the breach was condoned by the payment of the week's salary. At the trial it was intimated to Mr. Webster's advisers that Mr. Wallack would compromise, and offered to abandon all claims on payment of 500l., but 300l. was offered and accepted.—This being a virtual abandonment of an engagement considerably above 1,000l. in value, the compromise was evidently an advantageous arrangement for Mr. Webster, and was literally a verdict in Mr. Webster's favour.\n\nWESTMINSTER COUNTY COURT.\n\nTHE BRIGHTON CASE.—TIMEWELL v. BROOME.—This was an action (before the court on Tuesday) brought by the plaintiff, a tailor, carrying on business at the west-end, against John Broome, of the Rising Sun, Air-street, Piccadilly, to recover the sum of 9l. 10s.—Mr. E. T. Smith, 80, St. Martin's-lane, appeared for the defendant, and applied for an adjournment, on the ground that he had been unexpectedly called away to Birmingham with reference to the Brighton case, which had been so much before the public during the last six months.—The plaintiff's attorney said he had a written offer to pay, and also a written promise to pay.—Mr. Smith: We are prepared to admit 2l. 10s.; for the rest, Mr. Broome denies his liability. My client is not likely to be in town for a fortnight, and therefore I must press for an adjournment.—Plaintiff's attorney: I am afraid, sir, he is very likely to be away, and that is the very reason I want to bring it on now; besides, I understand he is going to leave his house.—The learned judge: I really think I ought to make an order; here is an admission of the debt.—Mr. Smith: I hope your honour will adjourn it, for my client is away about this case which has so long engrossed every one's attention.—The learned judge: It does not engross my attention (laughter).—A man named Haines proved the handwriting of Broome.—Mr. Smith applied for a week, to enable the defendant, if possible, to move for a new trial; and reprobated the practice of making unfounded statements, as had been done against his client with reference to his leaving his house, whilst nothing of the kind was the fact.—Verdict for the plaintiff, with costs, to be paid in a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206199655.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 799, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3140, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]