[{"id": "ec063bc2cab5821b8825df75837ba45c3a5d8616", "text": "PROGRESS OF REFORM.\n\nWe are in a position to state that the organisation conducted by the Parliamentary Reform committee has greatly strengthened itself by adherents from all ranks since the recent conference at the Guildhall coffee-house. Several additions have been made to the committee, and subscriptions for large and small amounts continue to flow into the treasury. A recent circular, which has been extensively distributed, states:\n\n\"The success of this movement must depend on the support it receives from the country. The committee, although they adopted as the result of extensive inquiries their published programme, as likely to be sanctioned by the largest number of constituent bodies, do not prescribe it to any as the basis of their organisation. They are especially anxious that reformers should place themselves in the most advantageous position to pronounce on any Reform bill which may be introduced into parliament, as to how far it fairly complies with the people's reasonable demands. Hitherto their work, which has not been unproductive, has been accomplished at a very moderate outlay; but the time has clearly arrived when a bolder attitude must be taken, and without any elaborate agitation they must be prepared for a very large additional expenditure. Their efforts will necessarily be limited by the means placed at their disposal, and they respectfully solicit co-operation in their endeavours to render the House of Commons truly representative of the people.\"\n\nAmong recent subscribers are Mr. Bazley, M.P., 10l.; Messrs. Crosley, Halifax, 50l.; Mr. J. B. Jeffrey, Liverpool, 10l.; Mr. Wm. Edwards, London, 10l.; Mr. J. H. Dillon, London, 5l.; and several others.\n\nREFORM DEMONSTRATION AT NEWCASTLE.—A great political demonstration was held on Monday night, in connection with the Northern Reform Union. Many hundreds had to go away from the large hall unable to obtain admittance. M. Cook, Esq., president of the union, in the chair. The meeting was addressed by Messrs. Joseph Cowen, jun., Charles Larkin, and James Paul Cobbet. The resolutions of the union were carried unanimously amidst immense enthusiasm and excitement.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206204300.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1246, "total-output-tokens": 477, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2160, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]