[{"id": "1db3efe3797c17a7ddfbbcfaf30fa0f7ab81197a", "text": "MURDEROUS ASSAULT ON A DETECTIVE.\n\nAt the Woolwich police-court, on Monday, W. Smith, 20; Peter Duffy, 26; Arthur Bishop, 25, privates in the B battery of the Depot brigade, Royal Artillery; Robert Winter, 20; and Edward Castello, 26, privates in the A battery, Depot brigade, Royal Artillery, were charged with violently assaulting John King, a detective of the Metropolitan Police force, who was so seriously injured that he was unable to attend. — The first witness was Inspector Butt, who said:— At half-past 11 on Saturday night information was brought to me at Shooter's hill police-station that Detective King had been murdered, and was lying dead in Shooter's hill-road. I sent assistance and a stretcher, and followed as soon as I could get away. On my way to the spot I met the constables carrying King on the stretcher, he being at the time perfectly insensible and bleeding from the forehead. I went with them to the Herbert hospital, where King was admitted, and where he still remains. I reported the case to the Commissioners of Police at Scotland-yard, and today received an order from them to have everyone who could be identified as implicated in the case handed over from the military to the civil authorities, and, in pursuance of the Commissioners' orders, the prisoners have been brought from the garrison guardroom to this court. Margaret Rowley said:— I am a married woman, living at 5, Ree's-buildings, Woolwich. About 11 o'clock on Saturday night I was in the Earl of Moira public-house, Shooter's hill-road, and saw three artillerymen, including Duffy and Bishop, there. There was also a Scots Grey with them. Detective King, who was off duty and in plain clothes, was partaking of some refreshment by himself. The landlord told all the customers it was time to leave, and we all went out. I did not see how the affair began in consequence of the Scots Grey asking me for a pennyworth of nuts, which I went back into the house to serve by the light. When I got out again I saw an artilleryman, who is not here with the other prisoners, strike the detective, and knock him down. He struck him with a stick, and King's head came in contact with the stone step. One of the soldiers said to King, \"You are a policeman. I will knock your brains out.\" King called for assistance, and one of the soldiers knelt on him, whilst the others kicked him frightfully about the body. I entreated them not to murder him, and the soldier who is not here caught hold of me and threw me into the ditch. On recovering I went to the police-station and gave information. The prisoner Bishop said he was only passing up the road when the affray was taking place. The five prisoners were remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206322110.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 648, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2700, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]