[{"id": "a52a448c48078e2c1b7d099856971a7e1610d478", "text": "TERRIBLE STRUGGLE WITH A MADMAN.\n\n[SUBJECT OF ILLUSTRATION.]\n\nMr. Troubeck held an inquest, at St. George's Hospital, with reference to the death of Charles Evans, twenty-two, an architect, of 18, Kensington court-place, who committed suicide on the morning of the 5th inst. Dr. Joseph Arderne Ormerod, M.D., residing at 25, Upper Wimpole-street, W., identified the deceased as his nephew, and stated that he had heard he had been suffering from influenza. Mr. Herbert Campbell Moore, residing at 18, Kensington court-place, said that he occupied chambers with the deceased, and had done so for the last seven months. They used the same bedroom. On Thursday night they both went to bed at ten minutes past twelve. The deceased seemed fairly cheerful, and witness noticed nothing the matter at the time. He had often seemed a little depressed, but had never threatened to commit suicide. Soon after two o'clock on Friday morning witness was awakened by the deceased jumping on him and shouting, \"I am mad, mad!\" at the same time tearing his nightdress to pieces. Witness carried him on to his bed, which was at the other side of the room, and held him down. Ten minutes or a quarter of an hour elapsed, and Evans seemed to get worse. He said to witness, \"I shall have the strength of a madman in a few minutes. I do not want to hurt you, but I am afraid I shall.\" Soon after that the candle began to flicker, and witness got up to light another. He had no sooner got up, however, than the deceased sprang upon him. Witness struck out at him and felled him to the ground, and they were struggling together on the ground for some time. Witness called to the man in the next suite of chambers for help, but he did not seem to hear. Finally they got near the door in the struggle, and witness then managed to get on the top of his opponent, and held him by the throat till he became exhausted. Witness then ran from the room to Mr. Arnold, who occupied chambers downstairs, and knocked at his door. He waited there till Mr. Arnold came out; the deceased in the meantime having recovered, and, getting more excited, was running about the room, knocking the furniture about. They were about to enter the room together, when they heard a crash of breaking glass, and on getting inside they found nobody there. Search was made, and Evans was afterwards found lying stark naked in the timber yard below. By the Jury: They were quite sober when they went to bed. Mr. Reginald Arnold, an artist, who was called to the assistance of the last witness, said he was of opinion that the deceased had jumped on to the chest of drawers which was in the room, and then thrown himself through the window. The apartment was on the second floor and thirty-three feet from the ground. Mr. Cecil Berry, house surgeon, said that the deceased was much collapsed when admitted, and died within three hours, the cause of death being fracture of the spine. The body was much bruised and the forehead was cut. The coroner, in summing up, said it was clear that Mr. Moore and the deceased had had a terrible midnight struggle, and the jury returned a verdict of suicide during temporary insanity.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810117.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 735, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3164, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]