[{"id": "b8c467842507e97d4f03e605fc88cdb30932c892", "text": "A NOTORIOUS ADVENTURESS.\n\nAt the Central Criminal Court, before the Common Serjeant, Frederic Furneau, forty-five, housekeeper, was found guilty of obtaining money by false pretences. Mr. C. F. Gill, who prosecuted, and that the career of the prisoner had been a remarkable one. By representing that she was a lady, who owned a mortgaged property of considerable value, and by producing letters which purported to be written by Colonel Dichenon and other persons, she succeeded in obtaining £40 from a poor woman who kept a newspaper shop in South Lambeth, named Miller, and about £16 from a Miss Dossett, of Wimbledon. Then she disappeared, but was arrested at Leeds. The prisoner was unquestionably a most notorious swindler—indeed, he might say, a celebrated criminal. Practically, the whole of her life had been devoted to obtaining money by false pretences. She had undergone a term of seven years' penal servitude after a former conviction. On the occasion that she received the seven years, which was in 1882, at Warwick, she got many thousands of pounds by passing herself off as Lord Albert Pelham Clinton.\n\nThe Common Serjeant: Did she masquerade in men's attire? Mr. Gill said that the prisoner did not do that, but she represented that she was Lord Albert Pelham Clinton in disguise, and that the disguise was assumed, as she was waiting to obtain a pardon from the Queen in consequence of his having been connected with a certain case. By thus masquerading as a man in female attire, and on the faith of her representations, she obtained large sums of money. She also represented that the late Lord Coleridge knew of the circumstances. The prisoner was a genius of a liar, having regard to the number of people she had imposed upon. An officer of the Birmingham police said that when the prisoner was arrested in 1882 she had 4,000 letters in her possession, written by all classes of persons resident in the United Kingdom, from whom she had obtained or endeavoured to obtain money. Inspector Keen said that the prisoner deceived a poor artist at Leeds and got two pictures from him. Mr. Gill said that the worst feature in the prisoner's career was that she prosecuted a man from whom she had had money, and who pressed for repayment, for demanding money with menaces, and he was convicted and sentenced to 'twelve months' imprisonment, which sentence he underwent. The Common Serjeant regarded the prisoner as an exceedingly dangerous criminal and he sentenced her to ten years' penal servitude.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200813273.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 578, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2511, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]