[{"id": "b24afc93a0712f7c543f7c6d61044a066e249213", "text": "IMPORTANT TO EMIGRANTS.\n\nOn Wednesday, Mr. Henry Hutchings, of 49, King William street, City, ship broker, appeared before the lord mayor, in answer to a summons charging him with a breach of the 73rd section of the Passengers' act, 1855, which provides that \"Any question which may arise respecting the breach or nonperformance of any stipulations in any contract ticket may, at the option of any passenger or cabin passenger interested, be dealt with summarily; and if it is found that a breach of the contract has been committed, the complainant may be awarded such damages or costs as the magistrate may think fit, not exceeding in any case the amount of the passage money specified in the contract ticket and 20l.\"\n\nThe plaintiff, William Woodfine, stated that on the 2nd of May he engaged a passage for himself and wife to New York, and paid 8l. for a second cabin passage, and 1l. 15s. for a railway pass to Liverpool. Mr. Hutchings, who is the agent of the vessel, said she was a beautiful ship, fitted up comfortably, and that he and his wife should have a cabin to themselves. The vessel was to sail on May 6, and he accordingly went to Liverpool, and, on going on board, he found that there was no such thing as a cabin in the ship. Some deal planks were nailed together to form a partition, and fitted up to hold eight persons.\n\nThe lord mayor asked him if there was no skylight? — The complainant said there was not, the place was dark, and men and women, single and married, were all exposed. He asked if that was all the cabins they had, and was told that was all, and, if he did not like it, he could go. He accordingly left the vessel.\n\nThe defendant denied having promised the complainant a cabin to himself, and said that the vessel belonged to Messrs. Baring Brothers, and was fitted up as all passenger vessels are, and certified in the usual manner. He said he had returned the complainant 3l. voluntarily.\n\nThe lord mayor asked the complainant for his contract ticket, and on reading it he said that it stipulated that he should be provided with a second cabin passage.—The complainant said it was not a cabin at all, and he understood that he was to have a cabin to himself.\n\nThe lord mayor said there was no corroborative evidence, and it was impossible for him (the lord mayor) to say whether the cabin which was shown to the defendant came under the class of second cabin. It was impossible for a magistrate to adjudicate in such a matter.\n\nMr. Goodman (chief clerk) asked the defendant if he went to the emigration officer of the port?—The defendant said no, he did not.—Mr. Goodman said he ought to have done so, and he would have surveyed the vessel and given him a certificate.\n\nThe lord mayor said that the defendant's idea about a comfortable cabin might be different from other people's. Some, who had not been in a very good way of life, would perhaps think it a very good cabin, while others might be of his, complainant's, opinion. The question was, was that as good a cabin as could be reasonably expected for 4l. He himself thought that he could not expect anything very beautiful or very comfortable. The summons was dismissed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206211254.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 747, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3167, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]