[{"id": "6480d3ca60972a98a4064c5366e7e5983ab03971", "text": "THE CHARGE OF CONSPIRACY.\n\nAt Bow-street police-court on Monday Mr. Jacob Nathaniel Jonas, solicitor; Mr. Arnold Jacob Marks, his managing clerk, of Norfolk-street, Strand; and Leonard Asher Solomon of Coleman-street, City, appeared to an adjourned summons charging them with conspiracy to defraud Mr. William Cruikshank of £1,000. The allegations were that prosecutor having endorsed a cheque for the amount mentioned, the defendants conspired to recover that amount by putting Solomon forward as a bona-fide holder for value, whereas it was alleged that the cheque was considered to be worthless, and had been entrusted to Jonas to put with other papers.—Mr. Genese, tailor, of Great Russell-street, who had given evidence to show that he had been asked to sue for the amount of the cheque, was recalled for cross-examination by Mr. Willis. He denied that he had urged Jonas or Marks to sue for the amount. Witness admitted he was a bankrupt for £9,000., but had £4,000. owing him. Referring to the prosecution by Mr. Palmer of Beyfus and others, witness admitted that he was included in the charge of conspiracy. The purchase of Palmer's reversion was an honest transaction.—By Mr. Lewis: There was not one word of truth in that suggestion or that the Beyfuses were at the bottom of this matter. He was aware that £6,000. was paid to stop the proceedings in the Palmer prosecution. The case had been opened, and after that the £6,000. was paid.—Mr. Vaughan: I say that if that is a fact it is a scandalous thing.—Re-examination continued: It was stated that Mr. Palmer had gone to Australia and Marks had seen him off. Thereupon the magistrate adjourned the case sine die.—Mr. Wrigal, solicitor, deposed that he wrote to the defendant Jonas, when the claim was made for the amount, and informed him that he considered it to be a fraud. Judgment was signed in the case half-an-hour before witness had put in notice to defend. He had advised prosecutor to make an affidavit that he had no judgments registered against him. A charge of perjury had been preferred.—Mr. David Bensande, of 12, Bouverie-road, South Kensington, deposed that Marks had told him they wanted to get some one to make an affidavit that value had been received for it.—This concluded the case for the prosecution.\n\nOn Tuesday the case for the defence was proceeded with.—The footman and coachman of Mr. Solomon Beyfus deposed that their master, being an invalid, invariably took carriage exercise between one and two o'clock daily, and that on a particular day in September he was not present at a meeting which took place at the Bedford hotel, to the best of their belief. A waiter at the hotel definitely swore that the gentleman was not present on the occasion referred to.\n\nAt the conclusion of the evidence Mr. Cook addressed the court on behalf of Solomon Beyfus, and contended that there was no evidence against him, inasmuch as the fund of £6,000. was created for an illegal purpose, and that Solomon had merely advanced the money to his son.\n\nMr. Lewis, in speaking on behalf of Alfred Beyfus, said that the prosecution had been preferred for the purpose of extortion, the evidence of both Jonas and Marks being utterly unworthy of credence.\n\nThe hearing of the case was further adjourned till the 20th of January.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206260890.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 783, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3296, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]