[{"id": "3b317c0992886cfb99e73358ab3f348249ea43ed", "text": "EXTRAORDINARY MODE OF RESTRAINING A DRUNKEN WIFE.\n\nA singular case has just been brought under the notice of the magistrate of St. Helier's, Jersey. John Le Roy, watchmaker, about 60 years of age, was charged with having fixed his wife's head in a species of iron mask or cage on Saturday. The mask was produced in Court. Its base consisted of a piece of rod iron, about a quarter of an inch thick formed into a ring, about eight or nine inches in diameter. The top was a similar ring, about six inches in width. These two rings were connected by means of seven vertical bars of strong hoop iron, a couple of inches apart. The instrument opened with a hinge in the front, was fastened at the back by means of a padlock, and weighed three pounds. In the front part, immediately opposite the mouth, a piece of iron hoop had been placed horizontally to prevent the wearer from getting anything up to her mouth, though this, it appeared, was ineffectual, as, from the mask being rather too large, she had managed during the short time she had it on to turn it round on her head, and drink a small glass of liquor. It appeared from the evidence of the wife, that her husband forced the mask on her head for the first time on Saturday when she was in a kneeling posture. She was seen in it by some of the neighbours, who went to the police, and gave information; and by their orders the prisoner removed the mask. It seems that he made no secret of the affair, having told some of the neighbours what he intended doing, and had even asked one of the witnesses to allow him to use her head as a model! It also came out in evidence that the prisoner had made a large box into a species of cage with iron bars, into which he was in the habit of placing his wife occasionally. One of the witnesses, in describing the box, said the wife had plenty of room in it and received no injury, \"though it was not the place for a woman to be in.\"—The prisoner, who treated the affair with the greatest nonchalance, said he was not aware that by doing as he had he was acting contrary to the law. His wife was so addicted to drink that he did not know what to do with her. He had looked her up in the house, and she had escaped by the windows in order to get drink. He had placed her five times in the General hospital (the workhouse), but all was of no use; she was incorrigible. His only desire was to put a stop to her drinking.—The wife (who had a half-besotted appearance) admitted the truth of what her husband said, but added that \"it was her only fault.\"—The magistrate advised the man to make his wife an allowance of 5s. per week, and get a separation. Both of them agreed to this, and the prisoner was fined 10s. for the assault, which he cheerfully paid.—The mask was confiscated by order of the magistrate.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206234047.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 668, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2798, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]