[{"id": "6d2551de1135be7cdb2ea3f0cf6d27eff1e31bd3", "text": "A DANGEROUS DAUGHTER.\n\nWilliam Bute, fifty-six, deputy at a lodging-house in Gee's-court, Marylebone, was charged on remand with feloniously committing a rape on his daughter, Isabella Jane, sixteen. The prosecutrix, a tall young woman, said on the night of the 28th January she slept in a room by herself. Between one and two o'clock in the morning she woke up and found her father committing the offence with which he was now charged. She fainted and could remember no more about the matter. When she came to some hours afterwards her father had gone. She spoke to no one about it until Mrs. Howell, who lives in the same house, spoke to her, and then she told her of what had happened. Her father was separated from her mother when she was a child. Prosecutrix had been in a situation, and on leaving went to her mother at Bournemouth. Her mother ill-treated her, so she came to London and lived with her father. She had not spoken to him about the alleged offence; but he had asked her not to say anything about it or give him in charge. She had never had reason to complain of anybody doing a similar thing to her. Mrs. Howell said on the 30th ult. she noticed something which induced her to question the prosecutrix; and the latter then made an accusation against her father. The accused made a statement to the effect that he saw his daughter at the corner of the court on the 23rd. She said her mother had found out where she was in service. She (prosecutrix) had to run away from her across fields and hedges, and in doing so fell into a canal. She also made statements about her mother detrimental to her moral character. Under the circumstances he took her in to lodge where he lived. On the 23rd of January Mr. and Mrs. Howell, their son Arthur, and prosecutrix went for a walk. She ran off with Arthur, and because of that he (the accused) threatened what he would do to his daughter if she repeated her conduct. He denied the accusation the girl now made against him. Dr. Spurgin, divisional surgeon, said he failed to find any evidence of violence. An aunt of the prosecutrix informed the magistrate that the girl had suffered from a spinal complaint, and was now wearing an instrument. The complainant seemed to be affected in her mind, and in her opinion she was not responsible for her conduct. She had been \"carrying on\" for the past twelve months, and there was absolutely no reliance to be placed on what she said. Her mother had been too kind and indulgent to her, and yet she accused her of ill-treatment. Sergeant Webb said the prosecutrix's late employers said very much the same as the girl's aunt had said. They considered her troublesome and dangerous. Mr. Cooked dismissed the charge.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811290.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 643, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2713, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]