[{"id": "4689b07e3f020299d54d32133b68946255b208a3", "text": "ROBBERY FROM AN HOTEL.\n\nBefore the Kingston-on-Thames Bench, a well-dressed young woman, named Bridget Donovan, twenty-one years of age, was brought up on remand charged with stealing from the Oak Hotel, Surbiton, between a date in February this year and the 4th of April a jacket and a sunshade, valued £5, the property of Helen Newton, wife of Mr. Harry Isaac Newton, the landlord. Mr. G. Washington Fox appeared to prosecute, and Mr. T. Young defended. Mrs. Newton stated that the prisoner had been employed at the Oak Hotel as housemaid since Christmas last, and was given notice to leave in consequence of misbehaviour. Witness was away from home from the 19th of February until the 5th of April, and upon returning on the latter date discovered that a large number of articles belonging to her had been stolen, and that plate and jewellery to the amount of about £50 were also gone. Witness went to 22, Adelaide-road, Penge, where the prisoner was employed as a domestic servant, and there identified the jacket and the sunshade produced. The prisoner, she understood, had obtained this situation without giving a character. In answer to Mr. Young, the prisoner said that the articles were left in charge of her husband and her mother, but the prisoner had access to them. Police-constable Johnson, stationed at Penge, deposed to arresting the prisoner at 22, Adelaide-road, Penge, when she produced the jacket and the sunshade, alleging that she bought the jacket at a wardrobe shop at Walton, and that the sunshade was given to her. Detective-sergeant Morley stated that inquiries had been made to try and recover the remainder of the stolen property, but without success, the prisoner denying all knowledge of it. Mr. Young then addressed the magistrate for the defence, putting stress upon the hitherto respectable character of the prisoner, as well as upon that of her parents, in Hersham. She had formerly been in the service of the Duchess of Albany, at Claremont, Esher. The magistrates dealt with her under the First Offenders' Act, and bound her over in the sum of £10 to come up for judgment when called upon.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810558.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 505, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2126, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]