[{"id": "e7c093e868d2985b0f4544f5287d205abaed525a", "text": "THE HANWAY-STREET MYSTERY.\n\nAt Marlborough-street police-court on Tuesday, James Walker, charged with stabbing two persons in Hanway-street, Oxford-street, named Brown and Pollard, and causing the death of the latter, a seaman, aged 21; and further with assaulting a lad, named Edwin Pollard, by biting him on the cheek, was again brought up.—A man named Nears said a woman, called \"Mog Griffin,\" picked up a knife, 2in. in length, and gave it to him, but he threw it away. In answer to the solicitor, the witness said there was no blood on the handle of the knife. Mr. Hudson, house surgeon at the Middlesex hospital, said the length of the wound on Pollard was 1½in. in extent, and 2in. deep.—Edwin Pollard, a lad, repeated the evidence he gave on a previous occasion, and, in answer to questions, admitted, after being severely rebuked by Mr. Newton, that he had not told the truth on the previous occasion, as he had said that the prisoner met with the injury to the head by falling, whereas he got them from kicks he (witness) inflicted on him.—The prisoner told Mr. Newton it was no use asking the witness any questions after that statement.—Alfred Brown, one of the injured men, having given some evidence, the prisoner put some questions, his object being to show that there had been a regular fight or scrimmage between all parties, and the witness, Alfred Brown, said he did not know where he was stabbed or who stabbed him. He did not even at first know he was stabbed.—Inspector Maddocks said that when the prisoner was charged he said, \"The villains used a knife on me, and I did not on them.\" The prisoner, who had a wound on his head, made a statement, which he (Inspector Maddocks) took down.—Mr. Newton: This is the first time, although the case has been before me three or four times, that I have heard anything about this statement. It is monstrous. There never was a case worse conducted. Let the matter be reported. It shall not stop here.—Mr. Atkinson, partner to Mr. Lloyd, divisional surgeon of the E division, said the prisoner's wound could not have been inflicted by the lad's boot, which he examined in court, but with some sharp instrument.—The prisoner, who said he was wounded in the affray, was remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206258240.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 558, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2236, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]