[{"id": "fb10f926bb8b0d910aa8f31570980041105a967b", "text": "TRIAL OF THE REV. JAMES ROE.\n\nOn Wednesday, James Roe, forty-two, a gentlemanly-looking man, described in the calendar as a clergyman, was indicted, at the Central Criminal court, for feloniously forging and uttering a warrant or order for the payment of £6,000, with intent to defraud.\n\nMr. Giffard, in opening the case to the jury, said that the charge against the prisoner was one of a very serious character, and he was sorry to say that the inquiry was rendered still more painful from the fact that the prisoner was a clergyman of the church of England, and filling a highly respectable position in society. The learned counsel said he was fearful that it would be necessary for him to make a somewhat lengthened statement of the circumstances under which the charge was preferred, but a short narrative of the principal facts will be sufficient to put the public in possession of the material points upon which the prosecution was founded. It appeared that the prisoner was the nephew of Mr. Edward Roe, a person of considerable property, residing at Macclesfield, and that this gentleman had two other nephews—Mr. George Hartwell Roe and Mr. John Orme Roe. Mr. Edward Roe died on the 1st of January, 1859, having made a will and codicil on the previous 25th and 30th of December, by which he bequeathed a legacy of £500 to the prisoner, and made his other two nephews his residuary legatees. The prisoner, there was no doubt, was exceedingly dissatisfied with this will, and he took proceedings in Chancery to have it set aside on the ground of the incompetence of the testator, and an issue was directed to be tried by the Court of Chancery. It will be sufficient to state that in all those proceedings the prisoner was defeated, and the validity of the will established. Nothing further appeared to have been done until the middle of last year, when prisoner put forward a letter which he represented to have been written by his uncle on the 30th of December, 1858, and in which was enclosed a cheque for £6,000, payable to himself, his bankers at Macclesfield, for £6,000, and then he took further proceedings in Chancery to endeavour to obtain that part of the estate of the testator. The case on the part of the prosecution, was that this letter was merely an ingenious device on the part of the prisoner, and that not only were the letter and the cheque forgeries, but that the prisoner had also forged the post-office stamp that appeared upon the envelope of the letter. The cheque that was the subject of the prosecution, and an envelope and letter that had been impounded by order of the Court of Chancery during the proceedings, were also produced. The letter was read. It was as follows:—\"Macclesfield, Dec. 30, 1858.—Dear James,—I am being made to do what I do not want. If I am gone when you come use this money for the benefit of yourself and family. (Signed) E. Roe.\"—The cheque in question was written upon the same sheet of paper as the letter. It did not appear to prove that the deceased was not in a condition on the day which corresponded with the date on the cheque, to have written the document in question, and several witnesses deposed that the handwriting was not that of the deceased—moreover, the latter always signed his Christian name in full. Mr. P. Wadsworth, one of the attesting witnesses, however, admitted that the writing of the cheque and the letter was similar to the handwriting of the deceased two or three years before.\n\nMr. Surrey, an engraver, of Fleet-street, deposed to making stamps and letters, capable of forming the words Macclesfield and Bath, which were ordered of him by the prisoner, and his impression was that the stamp which appeared upon the envelope containing the cheque had been made from the impression of one of the stamps ordered.\n\nMrs. Anne Dutton, employed at the Macclesfield post-office, said that the envelope produced could not have passed through their office on the 1st of January, because it bore the initial letter D, which was not used until after the 3rd of January.\n\nMr. John Prior, a clerk in the Bath post-office, deposed that he had examined the envelope which purported to bear the stamp of that office, and he said that it was not a genuine one.\n\nAmongst other evidence given, Mr. George Hartwell Roe deposed that he was the acting executor, and one of the residuary legatees under the will of his uncle; and at the time of his death there was only £1,638.1s. at his bankers' to meet the supposed cheque for £6,000.\n\nThe jury returned a verdict of \"Guilty.\" The learned judge sentenced the prisoner to ten years' penal servitude.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206211940.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1089, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4619, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]