[{"id": "95e2f646a19493dd2314c75725de12a1456253bf", "text": "MURDER BY AN ITALIAN ORGAN GRINDER.\n\nPasquale Panosso, an Italian organ grinder, who was unable to speak English, was charged on Thursday morning at Wigan with the murder of a collier named Bernard Keenan, at Wigan. The prisoner and two other Italians were returning home the previous night when a number of young fellows shouted after them and threw stones at them. The Italians followed the lads, whereupon Keenan interfered, and the prisoner, it is alleged, struck him. Keenan then, it is said, kicked the prisoner, and the latter is alleged to have then drawn a pocket-knife and stabbed him in the chest. Keenan fell to the ground, bleeding profusely, and was removed to a neighbouring surgery, where he died shortly afterwards. The prisoner was arrested later with a bloodstained knife in his possession. The accused was remanded till Thursday next.\n\nThe inquest was opened at the Borough Courts on Saturday morning. Evidence of identification having been given by Margaret Lee, a cousin of the deceased, an order for burial was granted. The Italian Consul has been communicated with. On Friday and Saturday the Italians resident in the town have occupied themselves in the removal of their goods, considerable feeling having been manifested toward them. A witness of the tragedy says Panosso was very much abused by deceased before he retaliated with his hand and finally with a knife, which he plunged into the breast of the deceased. The prisoner does not seem to realise the gravity of the charge, and appears indifferent. He is unable to speak English, having only arrived in this country recently. The inquest was adjourned till Wednesday.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811639.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1752, "total-output-tokens": 375, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1650, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]