[{"id": "b87f492d2a0ab9ec02adfe5d93c698f413664847", "text": "SATURDAY'S POLICE NEWS.\n\nBOW-STREET.\n\nPAYING THE WAITER.—James Bayles, a decently-dressed man, was brought before Mr. Henry, by Edwards, sub-inspector of the Suffolk constabulary, charged with having embezzled various sums of money, collected by him for and on account of his master. Wm. Barton, the keeper of a coffee-house and hotel, in King-street, Westminster, stated that the prisoner had been in his employment some time as out-door waiter, in which capacity it was his duty to attend with the dinners at Gwydyr House, Whitehall, for the convenience of the clerks of the Poor-law board. A few weeks past from a defalcation in some accounts of minor importance, which it was the prisoner's duty to collect and render, witness was induced to make inquiries, and found to his great astonishment, that although he had never authorised the prisoner to make out the bills for the necessaries so sent, they had been sent in and paid. On taxing him with the embezzlement, he at once coolly avowed the fact, and explained that by his directions his wife had made out the accounts, which he afterwards presented, and on being paid signed them in his own name.—Mr. Henry inquired why the prosecutor had not then given him into custody.—Mr. Barton said that upon the promise of the prisoner to refund the whole amount if he were allowed to visit his father in the country, he was induced to leave him at large, and about a fortnight since he went to Suffolk for the professed purpose of procuring the money, but having failed in returning, or taking the slightest notice of the matter, he (prosecutor) had forwarded information to the authorities there, and desired them to apprehend him.—Two gentlemen named Meason and Harrison, clerks at the poor law board, now proved the payment of their accounts to \"the waiter.\"—The magistrate remarked upon the looseness with which the prosecutor had manifestly conducted this part of his money matters, and inquired to what extent he believed he had been robbed.—Mr. Barton said it could not be less than between 50l. and 60l.—The prisoner repeated his acknowledgment of guilt, and was fully committed for trial on two cases.\n\nMARYLEBONE.\n\nA ruffianly-looking Hibernian, named William Britton, was charged with having committed a violent assault on Police-constable Hoare, 85 D. It appeared from the evidence adduced, that on the previous evening the prisoner was creating a \"thunder and owns\" of a \"ruction\" (this was the officer's phraseology) in Harrow-street, Lisson-grove. The officer requested him to \"move on,\" upon which he exclaimed \"who the devil are you?\" at the same time accompanying his interrogatory with the projection of a large stone, which struck him with great force under the right eye. After committing the assault he was instantly pursued by Hoare and another officer, and after a long chase was taken into custody.—The magistrate said that he should, without the infliction of a fine, commit the prisoner for a month to the House of Correction.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206308400.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 702, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3003, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]