[{"id": "259833d156ce307e5df0fd00829ee85aeb82b5bb", "text": "DREADFUL TRAGEDIES IN IRELAND.\n\nA horrible double murder was committed on Monday night at the lodge gate of Westown, the seat of Mr. Hussey, J.P., Naul, county Dublin. A groom in his employment, named Joseph Dorey, killed his wife, a fine young woman of 25, and then dashed out the brains of their infant, six months old. The lodge, the scene of the crime, presented a ghastly sight. The wife's body was fearfully mutilated. The murderer was arrested. Drink and jealousy are supposed to have caused the crime. An investigation was opened on Tuesday at Balbriggan, and adjourned until Saturday.\n\nOn Wednesday a furious attack was made on two prisoners in Kilmainham gaol by Dorey. About one o'clock the chief warder's attention was attracted by cries from the cell in which two other prisoners were confined. He hurried, together with the deputy governor and a policeman, and found that Dorey had savagely assaulted his fellow prisoners, who were bleeding profusely from the wounds inflicted on them by the man. After a long struggle Dorey was pinioned.\n\nA man named Thomas Bickley, who is believed to be insane, was arrested on Tuesday for murdering a woman named Mary Grady at Poolabata, near Capponquin, county Waterford, by cutting off her head. The evidence given at the inquest on the body of Mary Grady showed that the accused entered the house where deceased was; that he rushed at her, knocked her down, put his knee upon her chest, and strangled her. He afterwards dragged the dead body into the yard, where he severed the head from the body with a hatchet. The jury returned a verdict of \"Wilful Murder,\" and the accused was committed for trial to the Waterford assizes.\n\nA terrible affair took place near the village of Doon, co. Limerick, on Friday. Michael Richardson and his cousin, Thomas Richardson, aged respectively 27 and 60 years, went to visit a friend named Duggan, at Coonen, about two miles from Doon. Duggan parted with them about six o'clock. They were then both sober, and no more was known of them. A woman named Ryan found them both lying insensible on the side of the road, with fearful wounds on their heads. The unfortunate men were taken to their homes, where Michael shortly afterwards died, and it was feared Thomas could not survive till the morning. The only cause that can be alleged is that Michael's brother died some time since, and that some dispute occurred between himself and his friends relative to some property.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206250097.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 588, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2459, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]