[{"id": "2c0b74b0431bf20673e7c802d516bd2b9e25864d", "text": "POLICE INTELLIGENCE.\n\nBOW-STREET.\n\nA SCENE IN THE STREET.—Charles Gale, who described himself as a bookbinder, and Elizabeth Gale, who at first said she was his wife, but subsequently acknowledged that she was only living with him, was charged with being drunk and creating a disturbance in Chandos-street, Covent-garden, on Sunday afternoon. —Chandler, 125 F, said that between three and four o'clock on Sunday afternoon, he found the prisoners fighting in Chandos-street, and took them into custody. There was a great crowd assembled.—A gentleman residing in Chandos-street said the disturbance had been going on for twenty minutes before the constable arrived on the scene. He was at dinner with his family when they were disturbed by a great noise in the street. He went to the window and saw the female prisoner making a most furious attack on the man. The latter, it must be admitted, behaved with great forbearance. He tried to keep her off and prevent her from striking him, but did not once lift his hand to strike her in return. She flung herself upon him several times with such violence as to fell him to the ground, and while he was down, she kicked him in the face and jumped upon his chest. She tore the hair from his head in handfuls, and held it up for the admiration of the crowd (a laugh). During a portion of the time that this scene continued a crowd of fully 200 persons was assembled. When the police arrived at last the prisoners seemed sorry for their conduct and went with the police quietly enough. This sort of disturbance was of constant occurrence. Every Sunday afternoon on the closing of the public-houses at three o'clock crowds of thieves and prostitutes poured forth from the public-houses; and began brawling in the street. His main object in attending the court that day was to urge the necessity of some more efficient police protection. Application had been made to the police, and a promise had been made that two constables should be placed on special duty; and yet there was a riot going on for nearly half an hour, and no constable to be seen. These disturbances were repeated not only every Sunday afternoon, but every Saturday night at twelve and every Sunday night at eleven—in fact, as soon as the blackguards of Seven Dials and Bedford-bury turned out of the public-houses.—The male prisoner said he had been out of employment some time, but had just obtained a job, and was to go to work that day. Requiring for this purpose to get out of pawn a coat which his \"wife\" had pledged, he asked her for the duplicate, at the same time telling her she ought not to have pawned it. Upon that she flew into a passion, and attacked him as described. It appeared that both prisoners bore a bad character, the woman being a prostitute, and the man living on the wages of her sin. She has been times out of number charged with drunkenness, riot, and assault. —Mr. Flowers was very sorry to hear a bad account of the man, having at first been disposed to think well of him from the forbearance he had shown in this case. No doubt it must have appeared to the constable, coming in at the last minute, that they were fighting together; but from the evidence of the second witness it was clear that the man suffered great provocation without retaliation. He might be discharged; but the woman must go to prison for seven days.—The magistrate, on reconsideration, inflicted a fine of 15s.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222208.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 771, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3420, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]