[{"id": "b86ae545a6eb33dd7a1a02c0b72a30540dbd115f", "text": "DEATH OF A PENSIONER.\n\nYesterday afternoon Dr. Diplock held an inquest at the Royal Pensioners' hospital, Chelsea, on the body of George Smith, aged 71, a pensioner. From the evidence it seemed that deceased was granted leave on Monday. On Tuesday morning an attendant, upon going his rounds, saw deceased lying on the floor. He appeared to be suffering from drink, and was conveyed to the sleeping ward and placed in bed with his clothes on. The attention of the sergeant of the ward was afterwards called, and as a change seemed to take place in deceased's appearance, he was conveyed to the infirmary. The medical officer was called, but deceased, who remained unconscious, died the same afternoon. Dr. J. Flood stated that death was due to congestive apoplexy, which might have been brought on by drink. The jury returned a verdict accordingly.\n\nSUICIDE BY POISON.\n\nYesterday afternoon Mr. W. Carter resumed and concluded an inquiry at St. Thomas's hospital, into the circumstances attending the death of Mr. William Bennett, aged 48 years, a bootmaker, residing at 1, Johanna-street, Lambeth, who expired in the above institution on the 20th inst. from the effects of poison, which he had taken at his own residence. It appeared from the evidence adduced by several witnesses that the deceased for several days prior to his death had been drinking freely. On Wednesday afternoon he left home and proceeded to a chemist's shop in the Lower marsh, where he purchased two pennyworth of oxalic acid. On his return home he found his wife dozing near the fireplace. She was aroused and saw her husband drinking the contents of a tea cup. She asked him what he was doing, when he replied, \"I am doing what you cannot undo; I am drinking tea.\" Shortly after, while glaring at her, he fell at her feet. Her shrieks brought the assistance of two female neighbours, who sent for medical aid. The deceased was removed to St. Thomas's hospital and died before he was seen by the medical staff. Mr. George Gimblette, one of the house-surgeons, said deceased died from the effects of taking oxalic acid. On opening the head he found a large tumour pressing on the brain. The jury returned a verdict of \"Suicide by drinking poison while labouring under mental derangement.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206243197.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 529, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2262, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]