[{"id": "9fb7a6d4bb7773cf5d789d636558f073c9ca2318", "text": "THE MURDER OF SERGEANT EVES.\n\nOn Friday afternoon, at Chelmsford, James Ramsey, thirty-six, an engine-driver, was charged, before the Latchingdon justices, with having stolen 13½ bushels of corn from Hazleigh Hall, near Maldon, Essex, on the night of the 15th of April last. It was in the course of this robbery that Police-sergeant Eves was murdered, a crime for which John Davis was executed at Chelmsford on Wednesday. Ramsey, it will be remembered, was charged jointly with the others with the murder, but was acquitted. On account of facts which had recently transpired and statements made by the brothers Davis, he was re-arrested on the present charge. The prisoner looked exceedingly well. He was dressed in the coarse blue clothing supplied to prisoners under remand, and was ticketed with a yellow medallion bearing the figures \"C4-30.\" The clerk (Mr. W. J. Brown), having read the charge to the prisoner, asked him whether he had any reason to urge why he should not be again remanded. Ramsey: I understood, sir, last week that I was to be remanded till next Monday. Mr. Elsey Bland (one of the justices): Yes; that is so. You will be remanded till Monday next. The prisoner was then removed.\n\nJames Ramsey, thirty-six, engine-driver, was brought before the Rev. R. Harwood and other magistrates, at Maldon, on Monday, charged with stealing corn from the barn on Hazleigh Hall farm the property of Mr. Fitch, ex-Mayor of Maldon, on April 15th last, the night on which Sergeant Eves, of the Essex Constabulary, was murdered, whilst endeavouring to arrest the thieves. Six men were apprehended on suspicion of being implicated in the murder, and four, including Ramsey and Salls, were committed for trial; but these two were acquitted, and John and Richard Davis were sentenced to death.\n\nThe prisoner Ramsey was driven from Chelmsford to Maldon on Monday in a prison van, and as the vehicle passed through some of the villages the inhabitants hooted and gossiped. At Maldon a large crowd gathered before the Court opened. Mr. Pearce, who prosecuted in the murder trial, also conducted the prosecution in the present instance. Ramsey, who was undefended, gaz'd about the court with an air of indifference, and did not appear disconcerted by his position. Richard Davis attended to give evidence, and was temporarily placed in one of the private rooms attached to the court. The prisoner, replying to the formal reading of the charge, said, \"I know nothing about it, only what I have heard.\"\n\nMr. Pearce, in opening the case, said the witnesses would include not only Richard Davis, but Mrs John Davis, the latter of whom would state that Ramsey called at her house on the evening of the murder, and walked away with her husband.\n\nJohn Moss, a bailiff at Hazleigh, deposed that the prisoner, who had charge of the threshing machine, presented the day before the murder a false tally of corn threshed.\n\nMr. Fitch, the tenant of the farm, was also called. Cross-examined by the prisoner, he said that more corn would have been put into the barn than was stated on the tally, because an allowance had to be made for waste in dressing.\n\nSergeant Hurrell deposed that when he arrested Ramsey the latter said he knew nothing about the murder, and that the Davises had no more to do with it than he had. Ramsey said witness had got hold of the wrong persons, and the job belonged to gipsies who were on the green.\n\nThe prisoner was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811985.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 827, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3453, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]