[{"id": "f094d9b5c5b1b5df32e8533a70a5225921252398", "text": "THE MURDER OF AN ARRAN TOURIST.\n\nA letter, which the police consider to be genuine, has been received by the editor of a Glasgow evening paper from J. W. Laurie, the person suspected of having murdered Mr. Rose, whom he accompanied on a mountain excursion in the Island of Arran. The writer denies that he had anything to do with the death of Mr. Rose, and says he has no intention of giving himself up.\n\nSUPPOSED TRIPLE INFANTICIDE.—At an inquest held at Newport (Mon.) on Tuesday shocking disclosures were made of supposed infanticide in Cross-street, one of the slums of the town. A young woman named Cantwell, employed at a flour stores, was shown to be the mother of three infants, who had all been beaten to death by blows on the temple and the remains concealed in a box kept under her bed in the room where she slept with another sister. The sister declared that she had no suspicion of what was happening. At first the detectives went to the house and accused the young woman, and going upstairs took the remains of one baby, a month dead, from the box. Several hours afterwards the police were induced to pay another visit, and on examining the box found the bodies of two more infants. The medical evidence was that both had been in the box some time, perhaps years, but the one was of greater age than the other. The nose and lips were flattened in each case as though from heavy blows, which fractured the front part of the skull. The coroner decided to adjourn the inquest for the attendance of the brothers, who had kept the house since the death of the mother.\n\nATTEMPTED MURDER ON THE VICTORIA EMBANKMENT.—While a police-constable was going his rounds on the Victoria-embankment on Saturday night he saw two men running along, and simultaneously saw a woman struggling in the Thames. Being a good swimmer he instantly plunged in and rescued her. She stated that the two men had thrown her in. The men got away.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206269952.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1246, "total-output-tokens": 458, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1927, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]