[{"id": "f49595e47182d47840e5a38157adbb4ba5fb6e3a", "text": "SCANDALOUS BREACH OF PROMISE CASE.\n\nIn the Secondary's court, Guildhall, on Wednesday, an action was brought by Miss Bertha Murphy, a barmaid of the Grapes tavern, Jewin-street, City, against Mr. Victor Ouevas, employed as a compositor, to recover £1,000 damages for breach of promise of marriage.—The plaintiff, a fashionably-dressed young lady, said in her evidence that she first became acquainted with the defendant in June, 1882, when she was barmaid at the White Horse; London-wall. They became engaged, and were in the habit of walking out together. He made her presents, and eventually proposed marriage, the final arrangement being that the wedding should take place at the church of the Guardian Angel in the East-end, on the 23rd of January last year. The banns were published, guests were invited, the wedding breakfast was prepared, and friends assembled on that day, the defendant having given her the night previously £5 to pay for a wedding dress, and previously to that time having shown her a house which he had furnished for them. To everyone's surprise a telegram was received from him stating, \"Stop everything today, as a formal objection in the church, which must be settled before. I will call in course of the day.\" Her brothers ascertained that no one had been to the church, and the defendant was telegraphed to at his private and business addresses. On the following morning another telegram was received from the defendant, saying, \"I will call to-night and give full explanation.\" She, however, had never seen him from that time until now, when she saw him in court.—In cross-examination the defendant asked her if she did not know at the time they were walking out together that he was a married man, to which she indignantly replied \"No.\"—Mr. Lee proved the defendant's means as being about £2 per week, and in his defence the defendant, who stated that he lived at Monnow-row, Southwark, said at the time of the courtship, which he did not deny, the plaintiff knew that he was married, and had been told so by several of his fellow workmen. In cross-examination he admitted that he gave her £1, and not £5, for the wedding-dress. It was true that he showed her a house which he had furnished for them. That furniture came from the house in which his wife and children resided in London, but he did not tell the plaintiff so. The marriage proceeding he did not consider was to be binding, but simply as a formal matter, to enable the plaintiff to live with him.—The plaintiff, on being recalled, positively denied that any one informed her that the defendant was already married. On the contrary, she thought the courtship was an honourable one.—The learned Secondary, in summing up, said he never heard a more scandalous defence in a court of justice, and left it to the jury to give the plaintiff such damages as they thought the defendant would be able to pay.—They found for the plaintiff, damages £5.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206258792.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 683, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2937, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]