[{"id": "435477e51d161d80ddb32cf7e68e87f976c5aee5", "text": "CENTRAL CRIMINAL COURT, YESTERDAY.\n\nSINGULAR CHARGE.—James Rowe and Mary Rowe, man and wife, two young, well-dressed persons, surrendered to take their trial for misdemeanor in having unlawfully endeavoured to conceal the birth of a child, of which the female prisoner had been delivered.—It was stated that the prisoners had only recently been married, and they had gone on a tour in the country. It appeared, however, that the female was at the time of the marriage very far advanced in pregnancy, and while they were staying at an hotel at Plymouth, she was delivered of a stillborn child. Her husband, in order to save the character of his wife, did not obtain any medical assistance, but the parties brought the dead body of the child to London, and attempted to dispose of the body by placing it in a lady's garden near Wandsworth, and under these conditions the present charge was preferred. It was admitted that the male prisoner had seduced his companion, and that subsequently made her all the reparation in his power by marrying her, and what was done was merely with the object of saving the female prisoner from disgrace. The magistrate by whom the prisoners were committed for trial, Mr. Bushby, it appeared, had expressed his opinion that a very slight punishment would satisfy the requirements of the law.—The Common Serjeant said he thought that upon these facts he should not be required to do more than to pass a sentence of five days' imprisonment on the man, the effect of which would be that as no evidence was offered against the woman, they would both be at once discharged.\n\nINDECENT WORKS.—John Julian Rochfort, the proprietor of a publication called Quiz, the Satirist, surrendered to take his trial for publishing an indecent and obscene libel, which the publication in question was alleged to be.—Mr. Besley and Mr. Tickle prosecuted for the Society for the Suppression of Vice; Mr. Forest Fulton defended.—The counsel for the prosecution read some portions of articles contained in the publication in question, which he submitted were of a highly immoral and disgusting character.—The jury found the defendant \"Guilty,\" and sentence was deferred.\n\nGeorge Bates, a newsagent in the Broadway, was charged with selling another obscene publication called The Peep Show.—Defendant said he was not aware of the contents of the publication when he disposed of it.—The jury returned a verdict of \"Not guilty.\"\n\nJames Simpson, a newsvendor, carrying on business in Shoe-lane, was charged with a similar offence in relation to the sale of Quiz.—In this case also the jury returned a verdict of \"Not guilty.\"\n\nRobert Emmet, publisher, of 11, Bride's-avenue, pleaded \"Guilty\" to selling the London Peep Show.—The Common Serjeant sentenced Rochfort to six months' hard labour, and ordered Emmet to pay a fine of 50l., and to be imprisoned until that fine was paid.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206245335.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 646, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2881, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]