[{"id": "45d94d72075f87634f8899da1a0d07b55c213225", "text": "THE SUPPOSED MURDER AT CAMBERWELL.\n\nCONCLUSION OF THE INQUIRY.\n\nOn Wednesday evening, Mr. Carter resumed the adjourned inquest on the body of Hannah Read, aged twelve years, who was found drowned in the Grand Surrey canal, as reported in another column.\n\nThe sister, Sarah Read, was now present, and said she saw her sister last alive on Thursday morning, at nine o'clock, at Mrs. Horsley's, in Addington-square, where she had been employed for nine months.\n\nMrs. Horsley said that she had paid the deceased 1s. for milk on the previous day. Witness asked the deceased what she had done with it, and she said either, \"I gave it to mother,\" or \"I am going to give it to mother.\" By the coroner: If her mother had said that she had not received the 1s. she would believe her. She said the reason she was so late home on Wednesday night was, that she stood up, as it rained so hard. Witness expected her to come home on Thursday night, but as she did not she went to look for her, but could not find her, and she returned home and saw nothing more of her till she heard that she was dead. Some dissatisfaction had been expressed by her mistress that she came late of a morning. Did not know that she had formed any intimacy with any lad or boy. Her mother's house was near the canal. She could not account for the fact of her being found in the water. No difference was made in the treatment of the deceased from the other children. She believed that some one must have got the shilling away or else that she lost it, as she was too good a girl. Her firm opinion was that she did not throw herself into the water, as she was too timid, and would not go upstairs of a night without some one with her.\n\nMr. Horsley wished to know whether the can that had contained the milk had been found, as that might lead to the exact spot where she got into the water.\n\nThe father of the deceased said that the child had been put into the water after after she was dead. He then mentioned the names of several persons he suspected, but of course it would be imprudent to mention them at present. He also said that his windows had been all broken by parties who had threatened them.\n\nThe mother of the child was recalled, and said the can was a two-gallon can, with a brass cow impressed upon it, but it had not been found.\n\nThe jury, after consulting together, returned an open verdict of found drowned, there being no evidence to prove how she came into the water. The proceedings then terminated.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206203527.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 592, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2481, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]