[{"id": "c81b3f5ca727225a8ebbc2bc06af04c4a0cf77e6", "text": "SUDDEN DEATH OF MR. GEORGE DRUMMOND.—We have to announce the sudden death of Mr. George Drummond, one of the partners in the eminent banking firm at Charing-cross. The melancholy event took place shortly after two o'clock on Sunday afternoon. The deceased gentleman had attended Divine service and remained to partake of the sacrament; after which he returned to his residence, No. 4, Wilton-crescent, in company with his nephew, Mr. Edgar Drummond. On entering the drawing-room, he sat down in an armchair, and was about to partake of some luncheon, when he raised his hand suddenly to his head, and exclaiming, \"Oh, my God!\" sank down in an unconscious state. Medical assistance was instantly sent for, but the unfortunate gentleman had ceased to exist before the arrival of the family surgeon; in fact, he survived the first symptoms only four minutes. It is understood to be the medical opinion that the deceased's death arose from an undue fatness about the region of the heart. The deceased gentleman was in his 49th year, and was son of Mr. George Harley Drummond, of Stanmore. He married, in 1831, Marianne, daughter of the late Mr. Berkeley Portman, by whom he leaves two sons and two daughters. On Tuesday night an inquiry was taken by Mr. Bedford, as to the cause of the unfortunate gentleman's death. A post mortem examination of the body had been made, and the viscera were found to be generally healthy, but loaded with fat. The heart was also loaded with fat, very pale and flabby, and the blood in a fluid state. The cause of death was fatty degeneration of the heart, the muscular part being worn to the thinness of a sheet of paper. The death might occur at any moment. The jury returned a verdict of \"Natural death from disease of the heart.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206197110.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1522, "total-output-tokens": 435, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1761, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]