[{"id": "a96ebce9df0db727d66ab3dc6b8855a44cef5966", "text": "THE ROBBERY OF JEWELLERY IN NEW BOND-STREET.\n\nOn Wednesday, Margaret O'Grady and Ellen O'Grady, mother and daughter, charged with being concerned in stealing a pair of diamond earrings and other articles of jewellery, of the value of £10/., the property of Mr. Joseph Pake, jeweller, of New Bond-street, were again brought up at Marlborough-street police-court.\n\nJames Holmes, assistant to Mr. Mellish, pawnbroker, of 15, Duke-street, Grosvenor-square, said that he knew the elder prisoner. On the 23rd of December, in the evening, she brought a pair of earrings to pledge, and he offered her 5s. on them, which she took.—Mr. Tyrwhitt: You thought yourself safe in advancing 5s. on articles worth 70l.\n\nThe witness said there were between sixty and seventy persons in the shop at the time. (The earrings were produced.) He was not sure the earrings were the same that he took in. He only just glanced at the earrings and lent the money. He owned that he was very careless in taking them in.\n\nMr. Lewis asked the witness whether, had the earrings been paste, he would have lent 5s. on them.—The witness answered that he should, as they would have been worth the money.\n\nMr. Tyrwhitt observed that if business was carried on in such a way, pawnbrokers' shops would become most dangerous places; in fact, nothing else but receiving-houses.—The witness said that if he had looked carefully at the earrings he would have seen that they were diamonds. Mr. Mellish being absent, they were a hand short, and very busy, it being between half-past seven and eight o'clock when they were pledged. They were redeemed on the 28th by a woman, but he could not say whether by the prisoner or not.\n\nMr. Pyke said that had the earrings been paste, the pawnbroker would not have lent anything on them.—Mr. Tyrwhitt remarked that all he had to say was, that valuable articles were dealt with in these places in a very careless way. Pawnbrokers ought to be aware of the value of such things; indeed, it was their business.\n\nThe elder prisoner said that she went to the St. George's baths that evening to obtain payment of something a person owed her, and on her return from the baths she picked up the earrings in the mews.\n\nMr. Tyrwhitt observed that the elder prisoner had stated that her daughter, who was a dancer at a theatre, had the earrings from a gentleman; that her daughter had a ring to match in her possession, and that was the way she became possessed of them; now she said that she got them in Grosvenor-mews. She would be able to make her statement on her trial, and it would be for the jury to say whether they believed her.\n\nMr. Mellish wished to say that he was quite ignorant of the pledging of the earrings.\n\nThe elder prisoner, after being cautioned by the magistrate, said that she picked up the earrings, and must suffer for it.—She was then committed for trial, and her daughter was discharged.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206224252.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 706, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2899, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]