[{"id": "c1901074421650f052c3e1d05a479ac078a7fcf0", "text": "THE LIVERPOOL POISONING CASE.\n\nCatherine Flannigan and Margaret Higgins, awaiting trial on the charge of poisoning Thomas Higgins, husband of the latter prisoner, and a girl named Jennings, were further charged at Liverpool on Thursday with the wilful murder of John Flannigan, son of the prisoner Flannigan, and Sarah Higgins, daughter of the deceased man Higgins, and stepdaughter of the prisoner Higgins.—After hearing the evidence, the stipendiary committed the prisoners for trial on the charge of poisoning Flannigan, and remanded them on the second charge.\n\nThe Proposed Sewage Works at Kew.\n\n—On Wednesday evening a crowded meeting of representatives of rowing clubs, members of angling and swimming clubs, boat builders, and watermen was held in the assembly room of the Thames Rowing club, Putney, to consider the scheme of the Lower Thames Valley Sewerage Board to establish sewage manure works on the banks of the river, immediately below Kew Railway-bridge. Sixty rowing clubs were represented. The chair was taken by Mr. E. O. Otter, captain of the Thames Rowing club, who said that if they all showed a bold front at the Government inquiry, and that they were determined to resist to the last, the scheme would be defeated. A resolution strongly protesting against the reckless and unjust proposals of the Lower Thames Valley Main Sewerage Board to establish sewage manure works on the banks of the river near Kew gardens station was proposed, cordially supported, and carried by acclamation. The chairman then moved a resolution to the effect that a committee be formed of representatives of the rowing clubs, the watermen, and of the angling, swimming, and other societies interested in the preservation of the Thames from pollution, the duty of the committee being to carry out the foregoing resolutions. Mr. Drake Smith seconded the resolution, which was carried. All present enrolled themselves on the committee. A sub-committee was elected.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206256436.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 435, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1961, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]