[{"id": "efe38ac31fea8053dd97be96e7acf7a30c1dc927", "text": "ATTEMPT TO SHOOT TWO PERSONS.—At Brigg, Lincolnshire, on Tuesday, Frederick Gwerton, a groom, lately in the employment of Lord Yarborough at Brocklesby, was charged with attempting to murder John Cheals, a stud groom, in Lord Yarborough's employment. It was stated that last Friday Cheals remonstrated with the prisoner about the unsatisfactory way in which he had done his work, and gave him a week's notice. The prisoner said, \"If you discharge me you are a dead man.\" The prisoner afterwards procured a revolver and some cartridges from the gun-room of the estate, and went to Cheals' house and demanded an explanation. Cheals desired him to go away, whereupon he drew the revolver and fired two shots. Both, however, missed Cheals, who made his escape. The prisoner then aimed at Mrs. Cheals, but the revolver missed fire. The accused was apprehended the same night in bed, and under his pillow was found a large dagger-shaped knife. He was committed for trial.\n\nFIVE YEARS FOR STEALING POTATOES.—Sentence of five years' penal servitude was passed on Tuesday at the East Kent Quarter sessions upon two men, named May and Baker, for potato stealing. The chairman of the court stated that the career of the prisoner Baker, who was described in the calendar as 62, had been one of continual crime. Ever since 1835 he had been a source of trouble to the police in different parts of the country, and had spent greater part of his life in prison, the terms of his incarceration varying from three months to seven years. The other prisoner had also been sent to penal servitude.\n\nCHARGES AGAINST THE POLICE.—An inquiry has taken place at Worcester respecting certain charges formally made against the Chief constable of Worcestershire and some of his subordinates by Mr. Joseph Chamberlain, M.P., of having acted as partisans and contributed to disturbances at a Liberal demonstration held at Evesham in November, which the right hon. gentleman attended. The County Police committee reported that the charges were groundless, and the Court of Quarter Sessions on Monday adopted their report.\n\nA SINGULAR DISCOVERY.—The district coroner held an inquest, on Monday, on the body of a newly-born male child, which was found in a soap-box, buried in a sand-hold, at Openshaw. A man named Joseph Taylor, a coppersmith, noticing a dog scratching in the place, removed some of the sand, and found the box containing the body, which was wrapped in cotton wool, and covered with white calico, and further wrapped in a newspaper. The jury returned an open verdict.\n\nDAMAGES AGAINST EARL GRANVILLE.—At Stoke-on-Trent, on Monday, Judge Jordan gave a verdict for £150l. against Earl Granville, owner of the Shelton collieries, in an action brought under the Employer's Liability Act by the widow of George Hall, a collier, who was killed in the mines. Referring to an action now pending, brought by the earl against the plaintiff's only witness for perjury, the judge characterised it as a most indecent proceeding.\n\nCHARGE OF SETTING FIRE TO CHILDREN.—On Monday Margaret Robertson, or Brown, 60 years of age, was apprehended at Inverkeithing, near Dunfermline, on the charge of setting fire to her grandchildren, two girls, aged respectively three and two and a half years. They were left in the prisoner's charge during the absence of their parents. One of the children was found lying on the floor and the other in the bed, both being dreadfully charred.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206261004.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 810, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3441, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]