[{"id": "57a1cd115b28fb259e98c1d829a0dced471a1cf6", "text": "EXTRAORDINARY STORY OF A GIRL.\n\nLouisa Gould, seventeen, a well-dressed girl, was charged, before Mr. Haden Corser, at the North London Police-court, with stealing a writing desk containing four £5 notes and £17 in gold, and a quantity of jewellery, the property of Miss Isabella M'Innes, a student, lodging at 4, Bismarck-road, Highgate. The prosecutrix, who is in London for the purpose of studying for a college examination, said that the prisoner was between October 13th and 15th lodging at the same house. She left on the 15th, and on the same day a man named Samuel Arnold brought to her her writing desk, which he said had been found in some private ground in Hornsey-road, together with a pair of woman's gloves. Inquiries were made about the girl, but it was found that she had absconded. Detective-sergeant Couchman said he went to Wareham, Dorset, on Wednesday, where he found the prisoner detained by the local police. She was told that she would be charged with stealing the money from the box, but she replied, \"I know nothing about it,\" but on the way back to London she said that a few night before she met a man in the street who professed to have a grudge against Miss M'Innes. He asked her to get Miss M'Innes out with her, but she replied that she could not do that. Shortly after she saw him outside the house, and heard him go upstairs, creep softly down and go out. She followed and joined him, and he showed her Miss M'Innes' desk, saying that he was going to take it to a friend of his. They walked together round several dark turnings, and in one road he left her for ten or fifteen minutes, saying that he had left the box at a friend's house. He had previously borrowed her gloves, and he said he had left them behind also. He added that she was not to bother, and he gave her £3 to buy another pair with. Before they parted she agreed to meet the man at Waterloo Station and go with him to Bournemouth on the Saturday. They met, but travelled separately, meeting at Bournemouth. He gave her more gold. She left him, and met again after tea. Then he asked her to live with him for a week, but she refused, and he said he had to go back to London on business. He asked her to meet him at Waterloo on Tuesday, the 18th. The statement concluded, \"I did not take the box from the room, neither did I break it open or know its contents, but I agreed to assist him and let him know all I could about Miss M'Innes. The money I had I have left at Bournemouth.\" Couchman added that everything the prisoner was wearing was new, and she had a new watch and chain and handbag. The prisoner now said that the man threatened her with a knife if she told the police. She would have informed the police if she had not been afraid. Mr. Haden Corser reprimanded the prisoner for a week for inquiries.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810928.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 702, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2811, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]