[{"id": "099b8e42b61e77911b5e8602ca899dfe6b45f82d", "text": "SERIOUS CHARGE OF INDECENT ASSAULT.\n\n[From our latest edition of last week.]\n\nAt the Worship-street police-court, on Thursday, the Rev. George Small, fifty-three years of age, described as a missionary, and a teacher of ancient and modern Oriental languages, residing at 24, Wellington-street, Strand, was charged with having indecently assaulted Emma Alice Parker in an omnibus in the Hackney-road. The defendant was further described as of the University of Edinburgh, member of the Royal Asiatic society, the Royal College of Preceptors, the Philological society, the Anglo-Biblical institute, &c.\n\nAlice Emma Parker, the prosecutrix, of 8, Kempston-road South, Kennington-lane, deposed: About half-past six on Wednesday night I entered an omnibus at the Royal-exchange. The prisoner was a passenger in the same vehicle. He had an umbrella in his hand and a book on his knee. He sat next to me. I felt something press my foot, and I moved it. The pressure was repeated, and I again shifted my foot, and on looking down I saw his left hand holding his umbrella, but his right I could not see in consequence of stooping forward. I then felt a hand upon the calf of my leg, on my stocking. I jumped up immediately, and said that a gentleman had placed his hand beneath my clothes. The omnibus was stopped, and my husband, who was outside, was called for. Prisoner did not say a word. I was holding my dress up in my two hands.\n\nCross-examined: I wore a small crinoline. My petticoats were long. I entered the omnibus at Cornhill. I did not notice the prisoner until he left another part of the omnibus to take a place on my left side. I passed him as I entered, but nothing was said or done to me then. The omnibus, which was not full when I went in, became so after the defendant had altered his position. There were five females on the side where he sat. When I got up I said nothing to the prisoner, but told a gentleman, in a whisper, of what had happened. The omnibus was then stopped, and the prisoner, as soon as a policeman was found, given into custody. I do not know how long was the interval between the stoppage of the omnibus and the giving of the prisoner into custody. Prisoner saw me whisper to the gentleman when he was taken into custody. I did not hear what reply he made; I was too confused. When I jumped up, as I have stated, I saw prisoner's right hand, but there was nothing in it. I went towards the door and almost fell. I did not return to that seat. The omnibus travelled fast, but did not jolt about. I did not see that the road was broken up.\n\nBy Mr. Newton: I know it was a man's hand. I felt the finger squeeze my leg. When I jumped up I saw his hand come from beneath my dress.—Cross-examination continued: My petticoats reach the ground. I only held my dress up.\n\nCorroborative evidence was adduced. Numerous testimonials as to the prisoner's character and ability, were also handed in, after which\n\nMr. Newton remarked that he should not take on himself to decide the case, but send it to the sessions. Prosecutrix's evidence had been fully borne out.—Mr. Vann remarked that his client's character was beyond effect from such an imputation as this. Even now the office was full of personal friends ready to testify to his worth.—Mr. Newton observed that the higher the defendant's position the more necessary was it that the whole matter should undergo the strictest and most searching inquiries.—Subsequently bail was accepted, in the rev. gentleman's surety of 100l. and two of 50l.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206228628.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 851, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3519, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]