[{"id": "9927361b0b50c321b83bd5b077957898d19d12e7", "text": "TRIALS AT THE ASSIZES.\n\nOUTRAGE BY A BURGLAR.—Tom Martin was indicted at Winchester for burglariously breaking into the dwelling-house of Mary Ann Bartlett, at Sutton Waldron, with intent to commit a felony therein.—The prosecutrix, a young woman of 26, who was the National schoolmistress, lived with a young girl of 13 in the house, of which they were the sole occupants. On the night of the 2nd of March, the prosecutrix was awakened by a noise, and on going partially dressed, into the girl's room, she found the prisoner attempting to take liberties with the little girl. On her arrival he immediately turned upon her and attempted a criminal assault, at the same time threatening to shoot her if she resisted. She successfully resisted him for some time, and he at last desisted and made his escape, but was subsequently arrested.—The prisoner was convicted and sentenced to 20 years' penal servitude.\n\nSTEALING GOVERNMENT STORES.—John Terry, formerly a boatswain in her Majesty's service, on the Admiralty yacht Enchantress, was indicted at Winchester for stealing certain Government stores.—This case excited considerable interest, as a bill was preferred against the prisoner for this offence at the last Borough quarter sessions at Portsmouth, but was then ignored by the grand jury; a voluntary bill was therefore preferred against him at these assizes, when the grand jury found a true bill.—It appeared that the prisoner had been lately fitting up some houses in the neighbourhood of Portsmouth, and from information they received the police searched these houses, and also that in which the prisoner lived. A large quantity of locks, bolts, hinges, and other brass goods were found, some of which bore the Government mark; some appeared to have been filed so as to obliterate the mark, while in others it had been drilled out. It was proved that warrant officers, to which class the prisoner belonged, were the only class who were not searched on leaving the Government stores at the dockyard at Portsmouth. A carpenter who was in the employment of the prisoner was also called, who had given information to the police, and who described the way in which the marks appeared to have been filed and obliterated.—The jury convicted the prisoner of receiving the goods knowing them to be stolen.—He was sentenced to 12 months' hard labour.—The prisoner had been in the navy 21 years, 17 of which were on foreign service. He had gained the highest distinction, and served in the Ashantee campaign under Admiral Commett. By his conviction he forfeits a pension of £50l. a year.\n\nALLEGED CONCEALMENT OF BIRTH.—Sarah Jane Andrews, 20, servant, was charged at Winchester in concert with Fanny Andrews, 38, her mother, with concealing the birth of her male child, by the secret disposition of the dead body of the said child.—Evidence having been given, the counsel for the defence submitted that the charge of concealment could not be supported, as the younger prisoner had informed her fellow-servant.—The jury acquitted the prisoners.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206244438.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 685, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3041, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]