[{"id": "76d7536d9a4c0dfce71e76e77cacb268670f05e5", "text": "MUTINY ON BOARD A QUEEN'S SHIP.\n\nAt the Mansion-house, on Tuesday, Richard Edwards and James Meek were brought before Alderman Gibbs, upon the charge of having endeavoured to excite a revolt on board her Majesty's cutter Gosamar, on the Dutch coast. The prisoners had been brought home in irons. Mr. Swainson, from the office of the solicitor to the Admiralty, attended for the prosecution; Mr. Wontner appeared for the prisoners.—The following is the essential part of the evidence, which was detailed at considerable length:\n\nMr. D. Hall, second master in her Majesty's navy, and commander of her Majesty's cutter Gosamar, said—The prisoners were able seamen on board the Gosamar, which was at the time I speak of surveying on the coast of the Netherlands. I believe them to be under martial law. I hired them both in Her Majesty's service. On the 16th of September, about eight in the morning, the vessel was lying in the port of Nieuwpoort, in the Netherlands. Edwards advised the crew to come ashore to the quarter-deck. I went on deck and addressed the crew there. One of the crew, named Widyer, said he thought himself not properly treated; and, which the prisoner Edwards turned aside, he demanded his discharge of me. I remonstrated with him, and with the rest of the crew, and explained to them the folly of such conduct, mentioning at the same time that the ship had been robbed of two muskets, which formed part of her ammunition. They said they were sorry for it, or something to that effect; and I said, perhaps when we overhaul the vessel we shall find the fourth gun gone; upon hearing which the prisoner Meek became so violent that some of the other men were obliged to break speaking of me, and pointing at me, he said, \"Let me at—\" Edwards, pointing at Meek, said, \"I know what that man is if he gets from the men;\" meaning, as I believed, that he had no command of himself. To avoid the violence with which I considered myself to be threatened I took refuge in the cabin; I was compelled to leave the quarter-deck for my personal safety. While in the cabin or on the deck I heard Edwards remark, \"He would be killed if he would go to sea in the ship, if he did, he would not work, neither would he let me;\" and he said at the same time, if I took him to sea he should throw me overboard as I was heavy. The position in which I should be in throwing the log would be with my back to the crew, so that I could be thrown over the gunwale. I then went on deck and desired them to go to their duty. The prisoners remained amongst the men, as I had no means of shutting them up. All returned to their duty except Edwards. Meek returned to his duty; but observing that he was not sober, I recommended him to go to bed. I next directed the men to go to breakfast. After breakfast I allotted each man his work, when Edwards coming up, and seeing Widyer at work, put himself in a boxing attitude, and tried to excite him to go ashore and fight. I ordered Widyer to go below to avoid any injury, and Edwards then demanded his discharge, swearing that he did not care a— for me or all the consult on shore. I replied, \"You are in a foreign port, and I cannot discharge you without sufficient funds to pay your passage home; besides which, your services were required here to take the vessel back to England.\" He answered and said he would be—if he could get on the vessel, because he knew that when we got to Grimsby I should imprison him. Finding that he could not get his discharge, he called Meek, and said he would not go without his old chums (Meek); and then both of them went down, packed up their things, and brought them on deck, demanding of me their register dekets. I told them again I would not discharge them, and Edwards said he was discharged by me; and when told by Mr. Jones, the master's assistant, that I had done nothing of the kind, he said the assistant was a —— liar.\n\nAt that moment Meek attacked another of the crew, named John Webb, whom I was obliged to send (bleeding at the ear) out of the ship to avoid further violence. After this transaction the remainder of the crew told me they did not think it safe to go with the vessel if those men remained, and I obtained the assistance of some Dutch soldiers, and had the prisoners conveyed to the guard ship, which lay near the Gosamar.\n\nMr. Wontner said the prisoners never had entertained the most remote idea of exciting a revolt. They were, in fact, two Yarmouth fishermen, who had been hired for duty in a Queen's ship, with the strict regulations of which they were not acquainted. They wanted to go ashore to get fresh provisions, to which they had always been accustomed; and having got drunk, their prudence of course left them, and they were met by the intemperate authority of the commander, who was not disposed to make any allowance for their former habits or condition.\n\nAlderman Gibbs said he would look over the depositions, and give his decision upon the case on Friday.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206196525.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1162, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4971, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]