[{"id": "a32a903b77f9bb75f95d783edf3a0b14151bc9a0", "text": "A THIRD TRIAL FOR MURDER.\n\nAt the County Tyrone assize, which opened on Monday, before Mr. Justice Barry, Thomas Hartley Montgomery was indicted for the third time, charged with feloniously and maliciously killing and murdering William Glass at Newton Stewart, on the 29th of June, 1871. Prisoner's former plea of \"Not guilty\" was recorded, and after a great deal of trouble the jury was sworn to try the case. Prisoner, who was looking rather better than at the last assizes, though still pale, listened very intently to the Attorney-general, who opened the case by relating the particulars of the crime. He recapitulated the career of the prisoner from being bank clerk until he became sub-inspector of police, and was arrested on the present charge. The learned Attorney-general had just concluded his speech when the court rose.\n\nOn Tuesday counsel manifested a marked disposition to exclude irrelevant matter from the evidence. More than half the witnesses to the finding of the money were first quickly disposed of, and then the circumstances connected with the murder were unfolded, during the recital of which the prisoner was very attentive, and wrote communications to his counsel. It was proved that he came out of the bank about half-past three o'clock, and that shortly before he appeared groans, described as resembling the moaning of a cow, were proceeding from the bank office.\n\nOn Wednesday Sub-inspector Purcell gave evidence as to an interview he had with the prisoner, who asked him if a man could be convicted of murder having no blood on his clothes. Witness said: he thought not.—Head-constable Thompson, who accompanied Purcell, gave corroborative evidence.—Miss Margaret M'Clenchan said prisoner's usual dining hour was three or four, but that on the day of the murder he did not dine till between six and seven. He took tea that night at 11, went out, and did not return till six the following morning. He apologised for staying out.\n\nOn Thursday surgical evidence was given that the wounds on deceased were such as could have been inflicted by the knife found in Grange-wood, and that the murderer might have escaped without any marks of blood. It was also proved that there were no traces of blood on the notes, gold, or knife found in Grange-wood. The next evidence was as to the prisoner's pecuniary embarrassments. It was proved, at the time of the murder the prisoner had overdrawn his account at the bank, and that he admitted having lost 800l. of his mother's money. 250l. he had received from constables to invest, and had not invested. The case for the Crown being closed, Mr. Macdonagh addressed the jury for the defence, and had not concluded at the rising of the court.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206319104.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 618, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2708, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]