[{"id": "b9e93998a33856ff93ceff0a6821644a94e2ba49", "text": "UNFOUNDED POLICE CHARGE.\n\nOn Thursday Miss Posner, 22, of short stature, the son of a master tailor, carrying on business in the High-street of Kensington, surrendered to his bail at Hammersmith police-court to answer the charge of being disorderly and assaulting Police-constable Cotterell, 26 T R., by kicking him on the groin while in the execution of his duty.—At the last examination it was alleged that Sergeant Pontin caused the prisoner to be charged because he told him to pay his father the half-crown which he had borrowed of him. The sergeant, on oath, positively denied ever borrowing a half-crown of the prisoner's father, though the latter stated that he came into his shop and asked for one, which he lent him.—The constable was now recalled and questioned by Mr. Besley. He said he had not been to the divisional surgeon about the kick. The prisoner kicked him with his toe, but being so close to him he was not able to kick him with force. He believed the prisoner intended to kick him with force.—Mr. Posner, the father, was recalled. He said that on returning from the station Sergeant Pontin followed, saying, \"I owe you half a crown here it is.\" Witness said he did not wish to have any communication with him, went in and slammed the door.—Mr. Besley called William Littlefield, a decorator, who said that he came up and heard the prisoner say \"Instead of interfering with me, you had better pay my father the half-crown you owe him.\" The sergeant said, \"We don't want any of your nonsense, you had better go indoors; we won't have you loitering about here.\" He then took hold of the prisoner and forced him towards the back entrance of his house. The prisoner said, \"I will have no more of this; I have been interfered with once or twice before; I shall call my father, and he will see into this.\" He then rang the bell. Mr. Posner came down and asked the sergeant the meaning of the bother, and why his son was annoyed in that manner. When he said he would see into it the sergeant turned round to the constable and told him to charge the prisoner, who was then taken to the station. There was no act of violence by the prisoner.—Mr. George Wright Ravenhill, residing in the neighbourhood, said he was passing, and heard the police tell the prisoner to go home. He said he was talking to a friend and was not doing any harm. Something was said about half a crown, and then one of the officers pushed him. He saw the father come out, and heard him say his son should go to the station, but they should not push him about. Witness swore the prisoner did not kick the constable. If he had kicked him he must have seen it, as the prisoner was short and the constable tall.—The prisoner's brother was called, and confirmed the statement of his father as to Sergeant Pontin offering to repay him the half-crown he owed him.—Mr. Bridge said the prisoner must be discharged, as he did not believe the prisoner was guilty. He would not say more than that there ought to be an inquiry into the conduct of the sergeant and constable.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206244094.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 715, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3047, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]