[{"id": "32c0b445ec59bce8069e297cc501c5c8b4777b73", "text": "CHARGE OF FRAUDULENT TRADING.\n\nOn Friday Julius Heitzberg, of Englefield-road, wholesale jeweller and diamond merchant, was re-examined at Bow-street police-court, charged with fraudulent trading under the Debtors act of 1869. At the previous examination it was proved that the prisoner commenced business in 1874 with a capital of about 100l., obtaining large quantities of jewellery from various wholesale houses by paying small deposits on the goods, and then pledging the goods to obtain more by further payment of deposits. According to the statement of Mr. Lewis, the prisoner's \"trading\" was exclusively of this character up to the present year, when, in July last, he filed a petition in the Court of Bankruptcy, representing his unsecured debts to be 9,502l. 14s., and his assets at about 600l. or 700l. Thomas Yull, manager of the business of Mr. Attenborough, pawnbroker, of 121, Minories, produced the books of the firm to show that the prisoner, during the last two years, had pledged jewellery, watches, diamonds, &c., in sums varying from 30l. to 300l., and amounting in the aggregate to nearly 5,000l., at the rate of 15 per cent. The witness then deposed as follows:—I remember the prisoner bringing us two sealed parcels in June last. He told me they contained valuable brilliants, the weight and value being marked outside. He asked me to take charge of them for a day or two, as they were sold under seal. I placed them in a drawer set apart for precious stones. A few days afterwards prisoner called and asked for some of the goods which he had previously pawned, saying that he had a customer for them, and proposing to leave the two sealed packets as security—the latter being represented as of tenfold value. I allowed him to take away two lots of jewellery of the value of 240l. and 200l. respectively. Towards the end of July he called again, and asked for more goods on the same security, and, believing his statements as to the value of the contents of the sealed parcels, I allowed him to have mounted diamonds, gold watches, and other goods, to the value of nearly 2,000l. I never opened the sealed packets, or reported the circumstances to my employer. I have since seen them opened, and found the contents to be mere rubbish. (Mr. Attenborough here observed that it was mere gravel.)\n\nIn cross-examination the witness admitted that he had two dishonoured cheques of the prisoner's in his possession when these transactions took place, and yet he still believed that the packets were genuine; but he did not know at the time that the goods delivered up in exchange were worth over 1,700l. He had been in the trade 26 years, and admitted that he had acted \"injudiciously\" in this matter.—The prisoner was committed for trial; the application of Mr. Williams for bail being refused.\n\nYesterday Mr. Thomas Yull, manager to Mr. Robert Attenborough, pawnbroker, of 121, Minories, was charged at the Mansion-house with stealing and embezzling property of the value of 1,700l., belonging to his employer. The accused was remanded, bail being allowed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206243176.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 770, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3074, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]