[{"id": "3a4dec522ed07a6caa2453766467514e92c3d66e", "text": "THE ALLEGED ATTEMPTED MURDER OF A CLERGYMAN.\n\nAt the Lambeth Police-court, on Thursday, before Mr. Biron, Q.C., Charles Thomas Ritchole, nineteen, described as a labourer, a Ryde-dweller, was again charged, in connection with feloniously and maliciously beating and wounding with intent to murder on December 25th last, Cornelius Ellingham, a retired clergyman, at the Albany, Albany-road, Camberwell. He was further charged with stealing from a bedroom, at the same address, property of the value of £15.\n\nThe prosecutor, whose head was swathed in surgical bandages, was row in attendance. He appeared to be very weak, and said he was accustomed to do odd jobs. On Christmas Eve the prisoner came to his rooms between half-past seven and eight o'clock, and did some odd work, and then sat down reading and smoking. Witness also sat down and had a pipe, and both he and the prisoner had some whisky-and-water. About eleven o'clock witness retired, as she wished to go to bed, but prisoner remained awake. The prisoner remained in the living-room to finish his pipe. Witness fell asleep, but at twelve or half-past he was awakened by his teeth being knocked out. Blood was streaming on the clothes. He saw the prisoner striking at his head with a poker, and tried to work himself out of bed on the opposite side to which the prisoner was standing in order to avoid the blows. He partially succeeded in getting out of bed, and lay quietly by the side. One of the pokers was broken either by striking his head, or by his hand. He could not see prisoner. When the prisoner had given him his quietus he heard the prisoner go into the kitchen to the water-tap and drink some water. The prisoner then returned to the bedroom with the kitchen poker, and struck the witness again on the head. Then finding he (the prosecutor) did not stir, the prisoner took his (the prosecutor's) waistcoat from the foot of the bed, together with his gold watch. Witness pulled the prisoner back, but got into the passage and shouted \"Police\" and \"Murder.\" The prisoner rushed from the living-room, passed witness in the passage, and left the building. Witness could not make any noise, and went back and wrapped a towel round his head, and remained on the bed until five o'clock in the morning. He then heard the milkman, and pulled him all together. He spoke to the milkman, and Dr. Gallie afterwards attended. He was taken to St. Thomas's Hospital, and was still a patient there.\n\nMr. Biron (to prisoner): Have you any questions to ask?\n\nPrisoner: Did he give me the coat, or does he accuse me of stealing it?\n\nThe prosecutor replied that he accused the prisoner of stealing it. He did not give the prisoner a blue coat and vest.\n\nThe evidence of Detective-sergeant Leonard, which was taken at a previous hearing, was now read out.\n\nDetective Burgess stated that when in the prisoner's room, at this court, on Wednesday, December 27th, the prisoner said, \"I admit being there that night. I was drunk. We had been drinking whisky.\"\n\nMr. Biron (to prosecutor): This young man was with you for a number of hours that night?\n\nProsecutor: About two hours and a half, not more. And he had some whisky?—He had some whisky-and-water.\n\nWas he sober?—Perfectly sober; as sober as he is now.\n\nDr. Gallie, divisional surgeon of police, said he was called to the prosecutor's rooms about a quarter to eight on Christmas morning. The prosecutor had sustained three scalp wounds, four of his front teeth had been knocked out, and there was a contused wound on the upper lip. There was a large bruise on the centre of the forearm, and over the left scapula there was a number of bruises all long and narrow. Both shoulders were covered with bruises. On the outer side of the left thigh there were a number of bruises, one being a print by the bone poker. Witness ordered prosecutor's removal to the hospital.\n\nMr. Biron: Taking them altogether, they were very grave injuries.\n\nWitness: Very grave. The prosecutor was now out of danger.\n\nUpon being cautioned in the usual way the prisoner exclaimed, \"I deny it. Mr. Ellingham gave me the blue coat and vest on Christmas Eve.\"\n\nMr. Biron committed the prisoner for trial at the Central Criminal Court.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812528.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 982, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4211, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]