[{"id": "ba7cd6a0611be287a19d179c40fa87ab05c1182c", "text": "DESPERATE ATTEMPTS AT BURGLARY.\n\nTwo attempts have recently been made to break into the house of a man named Woodcock, who is seventy-five years of age, and keeps a small grocery shop at Mankinholes, near Todmorden. The old man and his wife sleep in a bed on the ground floor, in a room lighted by a little old-fashioned window of no great strength, the panes of glass being let into a framework of lead; and one night, about six weeks ago, Woodcock was awoken by a pane of the window being broken, and a hand being thrust through the aperture to unfasten the casement. The old man told the burglar, that unless the hand were withdrawn he would chop it off, and this threat had the desired effect of frightening the ruffian, and causing him to desist. On Friday night last, however, a more desperate attack was made by two burglars, one of whom struck the window a blow with something that had the effect of driving in the whole of the glass and framework together. The burglars then entered the room, and one of them seized the wife, while the other pursued the husband into another room, whither he had gone for a weapon with which to defend himself. It was a dark night, but the old man got hold of a pair of tongs, and struck the burglar who followed him a severe blow with the heavy end of the tongs. The next moment the burglar caught him by the throat with one hand, while he endeavoured to strike him with a carpenter's axe with the other. The grasp of the throat was so severe that it forced blood from the mouth and nostrils of Woodcock, but still the old man succeeded in striking the axe from his assailant's hand by hitting him a blow with the tongs across the wrist. This caused the burglar to stoop and search for the axe, and while he did so Woodcock went through the bedroom and escaped by the window to get assistance from his neighbours. When he returned with some of his neighbours, it was found that the burglars had decamped, without taking anything with them. In the room where the struggle had taken place, a sharp axe and a man's cap were found on the floor. A good deal of blood was on the floor, some of which it is thought had been shed by the burglar in the struggle. Woodcock was a good deal exhausted and excited through the encounter, and several of his neighbours remained with him during the remainder of the night, and, from the care taken of him, it is thought that he will recover from the injuries he sustained. There is reason to believe the police are on the track of the men who entered the house.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206213296.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 601, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2538, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]