[{"id": "b293e0784536f459625d18e2bd14bc428424aa14", "text": "George Harvey, a detective inspector in the Portsmouth police, appeared at a summons, at Lambeth police-court, on Thursday, taken out against him by Mr. Edward Gladstone, late a captain in the Royal Marine artillery, for unlawfully attempting, in order to obstruct the due course of justice, to dissuade one Francis Colville, a person lawfully bound to give evidence, from duly giving such evidence on or about the 29th of July.—Mr. Smyth said he prosecuted in this case on the part of Mr. Edward Gladstone, a gentleman formerly holding the position of captain in the Royal Marine artillery. He was now, however, a member of the English bar. The defendant was at present an inspector of the Portsmouth Borough police, but at the time the offence was committed with which he (Harvey) was charged he was a detective sergeant of the Portsmouth police. He should charge the defendant also with others unknown with conspiring to defeat the ends of justice by preventing witnesses attending to give evidence in the divorce case of \"Gladstone v. Gladstone.\" He thought it right the defendant should know there were other charges against him. At the time the defendant was a detective-sergeant at Portsmouth he was employed by the solicitors to Mrs. Gladstone, the petitioner in the divorce case, as a kind of private inquiry officer. He called upon witnesses on the other side, and did all he could to dissuade them from giving evidence. With regard to the matter in the summons, he should prove that Francis Colville was subpoenaed to give evidence in 1875 in the case of \"Gladstone v. Gladstone\" at the Divorce court, in which the Queen's Proctor intervened. Mrs. Gladstone at first obtained a decree nisi. The day before Colville gave evidence he was followed on to a tramcar in the Westminster-road by the defendant. Whilst on the car, on the way to Woolwich, the defendant called Colville by a nickname he was known by. He ultimately asked him if he was a witness in the case of Gladstone, and upon telling him he was, he asked him to tell him all about it, and handed him either two florins or two half-crowns. Colville told defendant he could speak as to an act of adultery by Mr. Gladstone. Defendant told him not to say anything about it as it would do him no good. They afterwards went to a public-house at Greenwich, and defendant treated him to drink, and told him it would be better for him to move back to London. He declined, however, and went on to Woolwich. The defendant was getting up evidence on behalf of Mrs. Gladstone. He would call evidence in regard to the summons before the Court that day, and then ask for an adjournment, with regard to other matters, which would include that of conspiracy.\n\nFrancis Colville, who said he was a bombardier in H battery of the 2nd Brigade Royal artillery, residing at Woolwich, gave evidence bearing out the statement of Mr. Smyth, and in cross-examination said—I resided at the Westminster Palace hotel during the time the trial lasted. I was with witnesses who appeared on behalf of the Queen's Proctor. There might have been some 25 of them. I knew defendant by sight, but did not then know his name. It was immediately after I told defendant I had business in London that he gave me the money. I was surprised rather, but I had no idea what it was meant for. I said nothing before giving my evidence to the Queen's Proctor as to the interview with defendant, and what had transpired. I did not tell Captain Gladstone.—The case was then adjourned.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206328949.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 802, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3504, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]