[{"id": "a97ff420dd83f04e28c1906e8499950a0e029369", "text": "ACTION FOR LIBEL.\n\nThe hearing of the case of Jones v. Stewart and Co., Limited, Ross and Major was resumed and concluded in the Lord Mayor's Court on Saturday. The plaintiff, Mr. G. C. Jones, a journalist, sued the defendants, who are respectively the publishers, editor, and contributor to the Agnostic Journal, to recover damages for an alleged libel upon him contained in an issue of March 2nd last. It appeared that all the parties had formerly been friends. A book entitled \"The Life of Charles Bradlaugh, M.P.\", was brought out under the name of Mackay, but Mr. Bradlaugh sued Ross and Mackay for libel. In that action the present plaintiff gave evidence for Mr. Bradlaugh, and the result was that an injunction was obtained against the publication of the work. The alleged libel then appeared in the journal, in the form of a letter written by Major, imputing that the plaintiff acted from sinister motives, also that he had deserted his colours in giving evidence, and that after attacking Mr. Bradlaugh violently in pamphlets he had turned round and acted like a \"splenetic weathercock.\" The plaintiff denied this imputation. No evidence was called for the defence, and the jury found for the plaintiff for £30.\n\nOn Friday an occurrence, almost without precedent, happened at Leigh, a village near Sherborne. A farmer, named Charles Perris, found that his bees were swarming, and he proceeded to \"take\" them. He, however, neglected the usual precautions of covering his face, and one of the bees entered his mouth. The insect settled in his throat, and stung the unfortunate man so severely that he died from suffocation, caused by the swelling, in a few minutes.\n\nAt the Clerkenwell Police-court, on Monday, John Lindsey, forty, a carpenter, of Ansell-street, Falham, was charged with violently assaulting John Robert Burrows. The complainant, a ticket collector in the employ of the Metropolitan Railway Company, was collecting tickets at the Farringdon-road Station late on Saturday night, when prisoner asked him when the next train left for Hammersmith. Witness told him, and Lindsey said, \"You might be civil, you drunken fool.\" Burrows said he had answered civilly, and remonstrated with the prisoner for speaking to him in that way, when Lindsey struck him a heavy blow in the face, severely blackening one of his eyes. The prisoner, in defence, said he believed the complainant was drunk at the time. The complainant made him angry by answering his question very sharply. Witnesses were called for the prosecution, who said that the complainant was perfectly sober. Mr. Haden Corser ordered Lindsey to pay a fine of £4, and £1 costs, in default to be imprisoned for a month.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200807889.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 623, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2693, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]