[{"id": "81b0a268716fd0ac7deb316f258959026340848a", "text": "TRIALS AT THE MIDDLESEX SESSIONS\n\nCONVICTION OF A HOUSEMaid.—Mary Dempsey, about 25 years of age, surrendered to her bail to answer a charge of stealing a piece of lace, an ivory ornament, and other articles, the property of her master, Daniel Thomas Murphy, to which she pleaded \"Not guilty.\"—The prosecutrix and her family live at 49, Queen's-gate, and the prisoner was engaged as housemaid to her. In September, 1881, she missed several articles, which she suspected the prisoner had stolen, and about that time her family went to Paris, leaving the prisoner, the cook, and butler in charge of the house, returning in April. In consequence of her son's trunk having been found short of its contents on their return to town in April, she called the prisoner before her, and her box was searched. In it was found a lot of property belonging to the prosecutrix, including mantilla lace, books, &c. Sergeant Brand, a detective of the T division, took the prisoner into custody, as also the butler (Boswell), who was charged at the police-court, but subsequently discharged. The prisoner then declared that one of the pieces of lace found belonged to herself, and was given to her by her late mistress in Dublin, but afterwards admitted that some of the articles did not belong to her.—The jury found her \"Guilty,\" but recommended her to mercy.—The Assistant judge sentenced her to nine months' hard labour, but subsequently reduced the sentence to seven.\n\nCONVICTION OF BURGLARS.—John Smith, John Roberts, and Edward Mason, were charged with feloniously breaking and entering the dwelling-house of Elizabeth White, 3, Nelson-villas, Gunnersbury, and stealing therein a cruet-stand and a desk.—The burglary was effected on the 16th of June, while the prosecutrix left her house for a short time.—The jury found the prisoners \"Guilty,\" and the Assistant-judge sentenced Roberts to 10 years' penal servitude and six years' police supervision. The other prisoners were sentenced to five years' penal servitude each.\n\nPROSECUTION BY A TRADE SOCIETY.—Thomas Sangster, 41, late secretary of the Metropolitan Society of Operative Plasterers, May's-buildings, St. Martin's-lane, surrendered to his bail, for embezzling the sums of 12s. 6d., 3l. 4s. 6d., 1l., and 1l. 5s., received by him on account of the above society. After hearing evidence, the jury found him \"Guilty,\" but strongly recommended him to mercy on account of his previous good character. The Assistant-judge accepted bail for his appearance to receive judgment in a month's time—himself in 50l. and one surety in a like amount.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206252774.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 650, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2584, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]