[{"id": "569b908220d05e92875028f13434a8fdaea38984", "text": "DORSETSHIRE.—EXECUTION AT DORCHESTER.—Henry Wm. Young, 27, a shoemaker, was executed at Dorchester castle, on Monday morning, for the murder of his wife's illegitimate child at Poole, in February last, by crushing it to death as it lay in bed during its mother's absence. Strong efforts were made after his conviction to obtain a reprieve, on the ground that he had been driven to commit the deed by the misconduct of his wife, whom he bitterly reproached, and on whom he laid the blame for his melancholy fate; but the Home Secretary declined to interfere. Since his condemnation the culprit behaved in an exemplary manner, and appeared deeply penitent, paying the closest attention to the ministrations of the chaplain, to whom he made a full confession of his crime. He was visited during last week by his father, mother, two brothers, and sister-in-law. He was quite resigned to his fate, and repeatedly expressed himself ready to die. He received the holy communion on Sunday and again on Monday morning, when, after having slept well, he ate a good breakfast. Berry, the executioner, entered the cell shortly before eight o'clock. After being pinioned, Young walked firmly to the scaffold, which was erected in an outbuilding. The bolt was quickly drawn, and the culprit's body fell six feet, death taking place immediately without a struggle.\n\nThe whole proceedings, from the time of Berry entering the cell to the drawing of the bolt, only took three and a half minutes. The culprit left behind him a letter earnestly warning young men to beware of his fate.\n\nLANCASHIRE.—SELF ACCUSED OF MURDER.—A rough-looking man, who gave the name of Wm. Watts, was charged at Stalybridge, on Monday, on his own confession with the murder of a gamekeeper, named Copley, near Pontefract, on the 29th ult. Late on Sunday night the prisoner visited a local innkeeper whom he knew, and, after pledging him to secrecy, told him he had committed the crime. He made a detailed statement as to how it was done, and said he had since walked to Dunford-bridge in company with Pilmore and Roberts, for whom a reward is offered, and who has since gone to Holmfirth. The police were communicated with, and the prisoner was arrested in a lodging-house. In custody he repeated the story, and said the gun was at Street Town, near Wakefield. On Monday morning he denied the statement, said he was drunk when he made it, and that he had been living in Oldham for a long time. He was remanded for inquiries.\n\nIN SELF-DEFENCE.—Lars Swanson was charged at Liverpool on Tuesday with having caused the death of Thomas Kavanagh, second mate of the Annie Gondey, at sea, on April 13. The magistrate, holding that the prisoner had merely acted in self-defence, discharged him.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206264220.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 658, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2746, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]