[{"id": "aa9bd3cd85473551132d12da0e95096f19177a85", "text": "SERIOUS INJURY TO A CONSTABLE.\n\nTHOMAS BARNBY, also known as Thomas Marks, and stated to be a convict at large on licence, was charged, before Mr. Bushby, at the Worship-street Police-court, with having been concerned with others not in custody in stealing from the person of Samuel Hawley a silver watch, and further with violently assaulting him. There was a second charge against the prisoner of having, in concert with others, violently assaulted Police-constable Heath, 479 G, and occasioned him bodily harm. At a quarter to ten o'clock on the night of the 2nd inst., the prosecutor, Mr. Hawley, who resides in King Henry-road, Ball's Pond, was at the tramway terminus, Finsbury-pavement, where he was hustled, and he then discovered that his watch was missing. He accused a man, who he could not be certain was the prisoner, and was assaulted, thrown down, and kicked. Police-constable 479 G, who was on duty near the spot, rendered assistance, and was severely maltreated, being knocked down and kicked. He was badly injured about the body and head, lost several teeth, and received a fracture of the jaw. He is not yet in a condition to give evidence. The prisoner escaped at the time, but was apprehended several days afterwards by Detective-sergeant Merroney, G Division. The prisoner was remanded by Mr. Bushby till such time as the constable can give evidence.\n\nWILLIAM HEGARTY and Robert Vallance, both labourers, were charged with being concerned in violently assaulting Police-constable 517, T Division. It appeared that on Tuesday afternoon the constable, who was off duty in plain clothes, was passing through Imperial-road, Fulham, when he saw the prisoners stripped, fighting. He went up to separate them, and was knocked down by Vallance. While down he was kicked by Hegarty. He rose and took Hegarty into custody, but that prisoner was rescued by a number of roughs. The prisoners went to the bank of the river and renewed the fight. Witness followed and arrested Hegarty, but was again knocked down and thrown over on to the foreshore. Two other constables came to his assistance and the prisoners were secured. The prisoner Hegarty, who stated that he had knocked off work on account of the rain; alleged that he was not aware that 517 was a constable. The constable said he was known to Hegarty. Mr. Curtis-Bennett sentenced Hegarty to six weeks and Vallance to one month's imprisonment.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810717.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 586, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2411, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]