[{"id": "1c304fcede66035b2a694fc24836bc1a4f530d0b", "text": "CHARGE OF STEALING WATCHES.\n\nAlfred Chambers, a young man, was charged on Friday, at the Middlesex sessions, with stealing 50 watches, value 100l., the property of Robert Shaw. The prosecutor, a watchmaker, carries on business at 108, Upper-street, Islington, and at night was in the habit of removing the watches from the window and putting them into a place of safety. On the 29th of March, at about eight o'clock in the evening, he was so engaged, and had put a number of watches into a box, when a man rushed in, seized the box, and ran away, the contents being worth about 100l. The prosecutor ran after the thief, but there was a crowd, and the man got away. Mr. Henry Ansell, a linen draper, saw a man going under an archway leading to the churchyard with something bulky under his arm. Mr. Ansell pursued him, and the man finding that he was about being overtaken threw down the box and escaped, and the contents of the box were scattered about. The prisoner and another man were seen gathering up the watches and filling a box with them, and it was suggested that the watches should be taken to the station-house, and they said they would do so; but instead of doing so went in another direction. Mr. Ansell still followed, and saw the prisoner holding open the lid of the box, and the other man filling his pockets with the watches. Mr. Ansell then seized the other man, but after a struggle he managed to get away. He then laid hold of the prisoner, who was exactly opposite the prosecutor's shop, and took him at once inside.—The prisoner, in his defence, said the other man asked him to assist in picking up the watches, and that he should have half the reward, and while so engaged he was seized by Mr. Ansell and taken into Mr. Ansell's shop.—Two former employers of the prisoner gave him the highest character for honesty, and it appeared that he was on an errand at the time of this occurrence for his master.—Serjeant Mallett, of the N division, also gave him an excellent character.—The jury immediately returned a verdict of \"Not guilty.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206327966.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 510, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2058, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]