[{"id": "f745bd0bd21594ce62f3a1a71f1c2a78f35ceee6", "text": "POLICE INTELLIGENCE.\n\nBOW-STREET.\n\nIndecent Assault.—A respectably-dressed elderly man was placed at the bar, charged with committing an indecent assault on the person of a boy named Henry Johnson, on the previous evening, in the Strand. The prisoner, on being taken into custody and conveyed to the watch-house, stated his name to be John Bowers, and that he resided at 17, Islington-road. On being carried before the magistrate, however, he altered his story, and stated that his name was Barber. He also declined giving his real address. It appeared that the complainant, who resided with his father at 1, New-inn-yard, Shoreditch, was dispatched on an errand, and that on his way up the Strand the defendant came up to him while opposite to Ackermann's Repository, and assaulted him in an indecent manner. This conduct he followed up until his arrival in Southampton-street, when two gentlemen named Routh and Bennett, who had observed his infamous behaviour, gave him in custody to Monro a policeman of the F division.\n\nThe defendant, when called on for his defence, did not wholly deny the truth of the charge. He stated himself to be living on his own private property; he paid a guinea and a half per week for his lodgings, independent of which he had sufficient to support himself. He was unmarried.\n\nThe Magistrate ordered the defendant to put in bail for his appearance at the sessions to answer the charge, and to give 48 hours' notice; he could not fix the amount of bail until inquiries had been made into his character and real station in life.\n\nThe defendant was then removed in custody, and was conveyed to the New Prison in a hackney coach at his own request. On leaving the carriage, at the door of the prison, he made a bold attempt to escape; being a corpulent man, however, he was unable to move off very quickly, and was immediately again secured by the officer into whose custody he had been delivered.\n\nInformers Defeated.—Mr. Edward Antrobus, of 446, Strand, tea-dealer, appeared to answer to a summons issued at the instance of John Richard Carter, an informer, charging him with suffering a cask to remain on the footway-pavement, on the 29th Nov. Both the informer and his witness, Digby, gave evidence, which was contradicted by four witnesses, and Mr. Minshall dismissed the case.\n\nMARY-LA-BONNE.\n\nA stripling girl, named Mary Ann Flood, was charged under the following circumstances:—Keys, the officer, stated that he observed the prisoner following a very elegantly dressed lady along Paddington-street and soliciting alms. The lady crossed the road several times, and the prisoner followed her each time with the greatest impudence, till finding she could extort no money, she revenged herself by striking the lady on the face with a force that drew blood, and fell to the ground. Keys then apprehended her.—Committed for one month.\n\nMARLBOROUGH-STREET.\n\nA great number of respectable inhabitants of the parish of St. James, attended before a full Bench of magistrates, to argue a question respecting the right of hackney-coaches to stand in Piccadilly, from St. James's church to the Haymarket. The question was considered of so much importance, that the parish employed Mr. C. Phillips to conduct their cause. Evidence was heard on both sides. On the part of the parish, it was contended that the stand, at that particular place, was the occasion of serious obstruction, and placed, in a great many instances, the lives and limbs of passengers in jeopardy.—On the other hand, it was asserted that the stand had been regularly appointed by the Hackney-coach Commissioners, and therefore it ought not to be put down. After a long and patient hearing of the arguments pro and con., the further consideration of the case was postponed to Wednesday next.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3207166294.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 867, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3785, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]