[{"id": "60cae83c6cd6cfc21bd2e001a0e3aa9f57d7e7ee", "text": "A QUEER DISPENSARY.\n\nAt the North London Police-court, on Saturday, Dr. David Hyman Dyte, ef 43, Poole Park, Holloway, was summoned by Mr. Charles Townley for wilfully making and issuing a false certificate concerning the death of Susannah Elizabeth Waller, aged seven months, of 100, Palmerston-road, in contravention of the provisions of the Births and Deaths Registration Act, 1874; and Henry Smyth, of the same address, was summoned for unlawfully using or sending the said certificate knowing it to be false. Mr. Lions, barrister, defended Dr. Dyte and pleaded guilty on his behalf; the other defendant pleaded not guilty. Mr. C. Townley, superintendent registrar of Islington, said this case had caused a good deal of public excitement, not only in the press but in the House of Commons. Dr. Dyte, it appeared, was a well-known medical practitioner, carrying on business in Derby-street, King's-cross. He was also proprietor of a dispensary in Poole's Park, Holloway, a very poor neighbourhood. As far as they could find out the only gentleman who attended there was Mr. Smyth.\n\nAn extraordinary state of affairs existed at the dispensary. The patients were seen by a lady who prescribed for them and dispensed the medicines. A charge of 1s. was made, and when the patients got into a bad way Mr. Smyth appeared on the scene and a fee of 2s. or 2s. 6d. was demanded. The inquiries showed that in four cases in which deaths had occurred Dyte had given certificates although he had never seen the child. Mr. Lions said that Dr. Dyte had very stupidly and illegally done what was charged against him, but there were mitigating circumstances. In this particular case the child died on March 18th, and at that time Dr. Dyte was confined to his house suffering from the effects of a fall, and trusting to Mr. Smyth, who was his unqualified assistant, and knowing the gentleman's ability, he signed the certificate. Dr. Charles R. Drysdale, senior physician to the Metropolitan Free Hospital, said that Dr. Dyte, who was a distinguished student and gold medallist of the London Hospital, was one of the best known and most able of the Jewish doctors in London. Mr. Cerser said he saw no reason why the penalty should be mitigated, and he consequently fined Dr. Dyte £10 or one month in default, and Smyth £5 or fourteen days in default, with costs amounting to £1 13s. 6d. in each case.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810293.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 599, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2385, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]