[{"id": "7c61b64999bb8076ae065ac5e1602c666bdd0f7a", "text": "OUTRAGE ON A MARRIED WOMAN.\n\nAt the Gloucester assizes, on Monday, William Mustow was indicted for a rape on the 22nd of June last at Marshfield.\n\nThe prosecutrix, Fanny Hill, was the wife of John Hill, shepherd, in the service of Mr. J. C. Fry, a large farmer in the parish of Marshfield, and the prisoner, who is a married man, was groom in the service of the same gentleman. The prosecutrix and the prisoner lived in cottages adjoining one another, there being no other houses within a quarter of a mile. The husband of the prosecutrix left home on Friday, June 22nd, and did not return that night. She went to bed at nine o'clock, and at twelve o'clock she was awakened by a rattling at her cottage door. She rose, looked out of the window, and saw the prisoner below. He asked her to come down and give him some matches. She got the matches and threw the box out of the window to him. He then went away. He shortly returned, called to her, and asked her to come down and warm some water. This she declined to do, and thereupon he said he would break in and kill her if she did not. He then got on the porch over the cottage door, and placed his hand on the window sill of her bedroom, but she struck him with a bed key and he dropped down. He then began breaking in the lower window with a stone. She ran downstairs and rushed out of the house trying to get away. He ran after her, caught her, and dragged her into the house. After the struggle, in which she was severely injured and completely exhausted, he accomplished his purpose. He put his hand over her mouth to prevent her screaming and she bit a piece of flesh out of one of his fingers. He then left her and returned to his cottage. She, on hearing his door close, put on her shawl and went to her nearest neighbours, aroused them, and related what had happened. A witness named Ruth Gaisford said the prosecutrix had come to her house at about one o'clock in a state of excitement, with her hair down her back, and bleeding from a wound on her head, and as they returned to her cottage she described the treatment she had received. A man named Fry was called up, and he sent at once for the police, and went with Serjeant Midwinter to the prisoner's cottage. They called to him, and as he did not open his door they burst it open and went upstairs, and found the prisoner sitting on his bed with his finger tied up and bleeding from a wound recently received. The prisoner was taken to the police-station, and on being charged, said it was all the —— drink, and he wished he was in ——.\n\nHis lordship having summed up, the jury found a verdict of \"Guilty,\" and the prisoner was sentenced to fifteen years' penal servitude.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206225742.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 655, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2687, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]