[{"id": "b473dde54d3b75dbcf201d4fc5907839fb5b30d9", "text": "EXTRAORDINARY SUICIDE BY A CHEMIST.\n\nOn Wednesday, a long inquiry was gone into before Mr. W. Carter, the coroner, at the Marlborough Arms Tavern, Westmoreland-place, Camberwell, touching the death of Mr. W. Augustine Dubourg, aged twenty-nine, who destroyed himself in a most remarkable manner.\n\nThe deceased is the son of the Rev. Mr. Dubourg, a dissenting minister at Clapham, and carried on business as a chemist at 7, Wellington-place, Southampton-street, Camberwell. He was a single man, and his servant having left him, a young female, named Dale, went daily to attend to the house, and cook his provisions. On Sunday last he had his meals in bed, which was not unusual on a Sunday. After dinner he told her to come and make his tea between six and seven, which she did. She observed a wine-glass with a piece of writing-paper over it by his side, and while she had gone down to prepare his tea she heard him vomiting, and upon going back she discovered he was in a fit. He opened his eyes, groaned very much, and she ran for Mr. Castles, a neighbour, who ordered a surgeon to be sent for, and Mr Bankier, of the Surrey Villa, attended, but on his arrival he was quite dead. He detected the smell in the room to be that of prussic acid, and the body threw out the same effluvium. A bottle containing the poison was found in the room, and three notes, one addressed \"Betsey,\" another \"Mother,\" and the third \"W. Carter, Esq., coroner.\" This was in the following terms:\n\n\"Southampton-street, Camberwell, April 5, 1851.\n\n\"Dear Sir,—I am so excited I cannot address you, I fear, to such purpose as I wish. It will be evident to you this is the work of my own hand. My health has been failing by degrees, until at last I have found myself so totally unfit for business, particularly such a business as mine. At times I have suffered incredibly—frequently I have been compelled to throw a mixture away three or four times before I could be positive as to which ingredient I had put in it. At another time, for three or four days, I could not calculate what cash I had taken in the day. I am now suffering so much, that I can give no better explanation.—I am, dear sir, yours respectfully,\n\n\"W. Carter, Esq.\"\n\n\"W. A. Dubourg\"\n\nIt will be seen that this is dated the day previous to the commission of the act, and Mr. Bankier said he had observed a great aberration in the deceased's manner.—The jury returned a verdict, that \"The deceased destroyed himself while in a state of temporary insanity.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206197609.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 634, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2497, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]