[{"id": "7db643005c6fad920629bc6ca706e40f3c6fb401", "text": "DOMESTIC TRAGEDY AT BATTERSEA.\n\nAn inquest was held at Battersea, on Saturday, on the body of Mary Ann Hutchinson, aged thirty-one, wife of a grocer, of 41, Dashwood-road, who died under tragic circumstances.\n\nThe husband stated that on Tuesday Mrs. Hutchinson was in the shop as usual, and at half-past eleven in the morning he went to a public-house next door to pay his rent. When he returned his wife grumbled at him. He said, \"If you nag, nag, nag like that, I'll go off and leave the day.\" She replied, \"If you do all I'll go too myself.\" He retorted, \"Don't talk such rubbish,\" and nothing more was said. At half-past seven he went out to order some oil, and when he returned at five minutes to eight he went upstairs without speaking to his wife, who was saving in the shop. Soon after Miss A. Fitzgerald came in, and Mrs. Hutchinson went upstairs to get some money with which to pay an account. As she was a long time gone, he called out, \"Polly, aren't you coming down?\" She replied, \"Tell Mr. Fitzgerald I can't pay him this week, I'll pay him next.\" But he had receipted the bill,\" witness said.\n\n\"Never mind,\" answered his wife, \"tell him to tear it up.\" She then called to him, \"Come up, there's a dear; I want you. Look sharp, I am in such pain.\" He went up and found her lying on the bed, and she said, \"I am in such pain, dear, I have taken poison.\"\n\n\"What poison?\" he asked, but she merely said, \"Taken poison.\" He had one packet of Battle's vermin killer in the house, and he subsequently learned that his wife had taken that poison. Three doctors attended her, but death took place at ten o'clock the same night.\n\nBy the Coroner: They lived happily together as a rule. If they had a growl one minute they were good friends the next. He imagined that she took the poison in a moment of pique to frighten him, as she had said. The witness purchased the poison at Messrs. Walter and Son's wholesale grocers, of 377, Wandsworth-road, in November last, to kill rats.\n\nDr. McLaughlin stated that death was due to strychnine poisoning. The vermin killer contained from twenty-three to twenty-six per cent. of strychnine, and would be very rapid in its action.\n\nMr. W. Walter, of the firm of Walter and Son, was called, and admitted purchasing the poison and selling it to Mr. Hutchinson.\n\nThe Coroner: I am afraid you have got yourself within the four corners of the Pharmacy Act. This was clearly an improper sale of poison, and I shall report it to the Pharmaceutical Society.\n\nThe jury returned an open verdict—that it was doubtful with what intent the poison was taken.\n\nALLEGED MURDER OF A HUSBAND.\n\nSENSATIONAL CASE.\n\nMrs. Jordan, wife of Mr. Hugh Jordan, farmer, of Mountain View House, Loughbrickland, county Down, was on Friday arrested on a charge of causing the death of her husband by administering poison to him on Saturday, the 13th inst. The death occurred so suddenly that a coroner's inquest was deemed necessary. Evidence was given by Mrs. Jordan, Robert Fitzgerald, a servant, and Thomas Kinley, a neighbour; from which it appeared that the deceased had been in Newry Market on the Thursday, and did not return until nine o'clock on the Friday morning. He then took breakfast and started for Banbridge Fair, where he remained until a late hour. He next walked to Loughbrickland, and called on Kinley, who gave him some food. He remained at Kinley's house until about two o'clock on Saturday morning, and reached home an hour later. After drinking some porter he retired to bed, but was unable to sleep. He complained of weakness and pains about the heart, was given tea to drink, and was tended constantly by Mrs. Jordan until his death.\n\nDr. Tweedle and Fegan, who were called in, certified that death was due to exhaustion, brought about by exposure and want of food and rest, and the jury returned a verdict accordingly. For some reason, however, the affair excited the attention and suspicion of the police authorities, with the result that it was decided to arrest Mrs. Jordan upon the serious charge of administering poison to her husband. Meanwhile the body of the deceased has been exhumed, in order that the contents of the stomach may be analysed. Mrs. Jordan was charged before a justice of the peace at Banbridge with the wilful murder of her husband on the 13th inst., and was remanded in custody for eight days, an application for bail being refused on the urgent representations of the police. The affair is causing great excitement throughout county Down.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812533.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 1073, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4503, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]