[{"id": "763d48b7fc33f6271fe6d00d637727d213e4cadc", "text": "TERRIFIC BOILER EXPLOSION.—FOUR PERSONS KILLED, AND SEVERAL WOUNDED.\n\nROCHDALE, SATURDAY MORNING.\n\nA most terrific boiler explosion, which has already resulted in the death of four persons, and so severely scalded four others that not the least hopes can be entertained of their recovery, occurred on Thursday morning last, at New Hey, near Two Bridges, two miles from this borough. The premises where the accident occurred are known as the New Hey Mills, occupied by Mr. S. Berry, as a woollen manufactory. They were three stories high, and comprised two portions known as the old and the new mill, stretching about one hundred and twenty feet in length, and about thirty-six feet wide. Both steam and water power were employed to drive the machinery—the steam-engine and boiler being situated at the extremity of the building. The buildings in the whole, formed three sides of a square, the fourth being the end of the new mill. The space thus left, was partially covered by a roof supported by pillars, and formed a favourite place of congregation for the children of the mill during their leisure time; and, on the morning in question, about half past eight o'clock, seven or eight of them were at play there, when, all of a sudden, the boiler exploded with a fearful noise, and in an instant the whole of the out premises were reduced to ruins. The children, in the place before spoken of, rushed to the door to escape, but the door had been driven inwards by the force of the explosion, and it was some time before it could be opened. When that was accomplished, five of the children came out most frightfully scalded. Eight persons were seriously injured, four of whom expired almost immediately; their names are John Leach, aged fifty-six; Jane Taylor, aged fourteen; Thomas Clegg, aged eleven, [and Thomas Sutcliffe, aged ten. Those injured and not expected to survive are, Edwin Clegg, James Wolfenden, and Ann Platt, all children about three years of age; and James Balfield, aged forty-three. An inquest was appointed to take place this evening.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206191222.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1798, "total-output-tokens": 484, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2057, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]