[{"id": "d548ccbaa6517126e1d9d0146f9c0e5f47b4b7b9", "text": "BLACKSMITH AND BABY.\n\nEdward Butler, described as a blacksmith's striker, of Barborough-street, New Cross, appeared at Westminster, on Saturday, to answer an affiliation summons taken out by Ada McPherson, of Willow-street, Westminster. The complainant said she gave birth to a child—a girl—on September 20th. The defendant, whom she had walked out with for some time, was the father of the child. Complainant's mother, who lives at Bryant-street, New Cross, said that when she became aware of her daughter's condition she called on the defendant and asked him what he was going to do. After a good deal of hesitation he said he did not want his mother to know. (Laughter.) He also stated that he was not then in a position to marry, but would see the girl through it, and pay all the expenses. Defendant: The fact is, your worship, I did not know what to say. I did not want mother to know. (Laughter.) She, however, found it out afterwards, because the girl's brother came round and kicked up a row. The Brother: It's a lie. Defendant, in answer to the magistrate, said he was not aware that he was the father of the baby—he never knew it. (Laughter.) Complainant (exhibiting the infant): It does belong to you, and no one else; you know it, Ted. Why it's the image of you. (Roars of laughter.) Mr. Hopkins: Might I ask, Mr. Butler, how long you have known her? Defendant (hesitatingly): Well, I daresay I have known her five or six years. The Magistrate: Been going out with her? Never once. Complainant (excitedly): How can you stand there and say it? Mr. Hopkins: Have you ever misconducted yourself with her? Witness: Not as I know of, sir. (Loud laughter.) I don't recollect it. Mr. Hopkins: Surely you would remember. Do you remember the girl's mother coming round to your house, and did you say to her that you would see Ada through her trouble? Witness: I am sure I don't know what I said. You know I was really most anxious to get them away from the door so that mother shouldn't know. (Loud laughter.) It was a very awkward situation for one to be in. I believe I said that I knew nothing at all about it. Mr. Hopkins: I am obliged to come to a different conclusion, Mr. Butler. You must pay 3s. 6d. a week till the baby is fourteen years old, and the costs.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812225.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 595, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2270, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]