[{"id": "fd3614f784a40eff7ffe89da6fbb0c13578309b4", "text": "ATTEMPTED MURDER AT A CLUB\n\nOn Thursday considerable excitement was caused throughout the neighbourhood of Pentonville, when it became known that a desperate attempt to murder had been made on the premises of the North London club, 10, Rodney-street, Pentonville, and that the would-be murderer had eluded the vigilance of the police. It appears that during the afternoon the steward of the club received a post-card making an appointment which he went to keep, leaving Harry Karnes, aged 14, in charge, and that a short time after he had left a middle-aged man, known to Karnes as a frequenter of the place, entered and asked where the steward was. On the lad telling him that he had gone out the man threatened him, and, taking up a hammer, he began beating him about the head and body, felling him to the ground. The lad's screams for assistance aroused the attention of some persons living opposite, who, listening to the premises, found Karnes lying in a pool of blood, with severe injuries to the head. A search showed that the would-be murderer had made his escape. The injured boy was at once placed in a cab, and conveyed to the Royal Free hospital, Gray's Inn-road, and, on being examined by Dr. Fergusson, it was found that he had received several severe wounds on the head and was suffering from concussion of the brain. He was at once admitted into the accident ward, and, information of the occurrence having been given to the police, Inspector Radley, of the G division, took from him a statement of what had occurred and a meagre description of the man who had attacked him.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206277691.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 381, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1590, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]