[{"id": "5cf51d843d64ffaae0ed18819bcdbc9069711fdb", "text": "THE OXFORD SCANDAL.\n\nAt the Central Criminal Court, on Friday, before Justice Smith, Maitland Francis Morland was indicted for demanding money by menace from Lord Hothfield and Earl Russell. He pleaded guilty to the charge in Lord Russell's case, but not guilty to the other indictments. Mr. Gill prosecuted, and, in explaining the facts, said the accused attempted to get money from Lords Hothfield, Chesterfield, Russell, Ormathwaite, and Carnarvon. He had pleaded guilty to the real offence. He had been a law tutor at Oxford, notwithstanding the fact that in 1874 at Lewes Assizes he was sentenced to twelve months' hard labour. The letters he had sent to noblemen were stereotyped almost; there was the same lining under certain words, and one letter was practically a reproduction of another. Once having got an answer from any person to whom he wrote he kept it for some time, and then used it to demand money. In all letters except one to Earl Russell he was Mrs. Maitland, but in the first to Earl Russell he was Mrs. Morland. Mr. Gill then referred briefly to the facts already fully reported during the hearing at Bow-street. Mr. Paul Taylor, for the defence, said that considering the seriousness of the offence to which the prisoner had pleaded guilty, he had felt unable to advise him to adopt any other course than to throw himself upon the mercy of the Court. He was utterly unable to explain the prisoner's motive. The mania for letter writing seemed to have seized him four years since, and was inexplicable, but it would be admitted there was no woman in the case. The female was entirely the creation of prisoner's brain. Morland had done honourable service as coach at Oxford, and although he was convicted twenty years since for perjury he had wiped out that stain by good conduct. He hoped the judge would bear in mind his old age and would deal leniently with prisoner. The prisoner, whose white hair and venerable features make him look even older than his years, sobbed piteously while counsel pleaded on his behalf. When asked whether he wished to say anything, Morland asserted that he alone was to blame, and declared that his wife and daughter were entirely innocent of all complicity of the writing of letters. His wife had led the purest of lives, and was unknown to Earl Russell, and his daughter knew no more of the matter than if they had never existed. His establishment at Oxford was always conducted on the strictest moral principles, and he could only appeal to the judge to be merciful to him in his old age, and to deal with him so that he might die in the midst of his family instead of in prison. Might the Judge of Judges be equally merciful to him at the day of judgment. Mr. Justice Smith, in passing sentence, said the prisoner had pleaded guilty to an offence the punishment for which was penal servitude for life. His conduct had been outrageous and depicable. The enormity of the crime was increased by the fact of writing to the intended wife of Lord Russell. Although he was aware he was sixty-five years old, and had been a tutor at Oxford, he could not pass upon him a less sentence than ten years' penal servitude. The prisoner, who seemed to have recovered his composure during the remarks of the learned judge, was then led from the dock.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810213.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 739, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3295, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]