[{"id": "03718ab0823fd724242c9244fd3fb0fbd1a1a0ff", "text": "BROMSGROVE WOMAN KILLED WITH AN AXE.\n\nAime Holman Meunier, alias Pendare, a Frenchman, described as a servant, twenty-five years of age, was tried at Worcester Assizes on Wednesday, for the wilful murder of Charlotte Pearcey at Longeye, near Bromsgrove, on January 13th. The deceased woman, who was seventy-one years of age, lived with her husband in a cottage some distance from any other habitation, and they there sold bread and sweetstuff. On January 9th the prisoner called at their shop and offered some stationery for sale to the old couple and purchased some apples from them. On the morning of the 13th of the same month the woman rose early, leaving her husband in bed; the latter heard some movement in the house shortly after, and in a few minutes he saw the prisoner searching some boxes at the foot of his bed. The prisoner on seeing he was observed at once left the house, locking the door after him. The husband followed him downstairs, and in the shop found his wife lying on the floor unconscious with a terrible wound on the top of her head. Returning upstairs the old man found an axe wet with blood concealed in one of the boxes which the prisoner had been searching. With some difficulty he forced the house door open and communicated with the neighbours and the police. The old woman died the same afternoon, without having regained consciousness. Evidence was given showing that the prisoner left his lodgings at Birmingham early on the morning of Friday, the day of the murder, and returned again in the afternoon, looking very pale, and that he kept to his room until the following Tuesday, his wife explaining that he was not well. On the Tuesday he left his lodgings, taking his boxes with him, but leaving his wife behind, and proceeded to Belgium, where he was subsequently arrested and handed over to the authorities of this country. Evidence was also given of several statements made by the prisoner to his landlady and to the police admitting that he was the man that committed the murder. The defence set up was insanity, but Dr. Cooke, Superintendent of the Worcester County Lunatic Asylum, was of opinion there were no grounds for believing that the prisoner was insane, and Dr. Hyde, the surgeon of the Worcester Prison, gave evidence to the same effect. The jury found the prisoner guilty of wilful murder, and the judge passed sentence of death in the usual way.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811795.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 537, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2401, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]