[{"id": "66a50b3aa45f744f797d45f165b8e91d8880f651", "text": "DARING ROBBERY AT A CHURCH.\n\nOn Monday morning, at an early hour, it was discovered that a most daring robbery had been committed in the vestry-room of the parish church of St. Giles-without, Cripplegate, by some expert thieves.\n\nLate in the evening before (Sunday), the potman of Mr. Wiltshire, whose establishment adjoins the yard of the church at the back, nearly contiguous to the window of the vestry-room, heard something like a tapping at a pane of glass, and a sudden rustling as he passed his master's back door, before the hour of closing. Not taking any further notice of this circumstance, however, he made fast the back entrance, and with the family retired to rest. On Monday morning when he took down the back shutters, he found the vestry window in the churchyard broken, and the lattice-work torn from its place. He immediately informed his master, who sent for the churchwarden, Mr. John Scholes, of the White Horse, Cripplegate, who having instantly proceeded to inspect the premises, with the sexton, Mr. Johns, found that the vestry had been entered, and the master key of the iron safes abstracted from its usual place of keeping. The thief or thieves had evidently entered by the opening in the window, which they had caused by a most ingenious cutting away of the glass. They had apparently carefully examined the safe and its contents, and succeeded in taking away the whole of the gold and silver there deposited, which, however, in consequence of the heavy clearance of the amount of the former week's accumulation, was not a very considerable sum. Several of the drawers in the vestry-room had been \"prised,\" or forced with a lever, the marks of such an application of power being unmistakeably evident. The thieves having been defeated in obtaining any important amount of plunder, then forced the door from the vestry leading into the church, and apparently attempted to force the contribution-box and the plate-chest, which resisted their efforts; for though the fastenings are violated, the contents remain secure. Being thus foiled, it appears that they then opened the closet containing the \"tent,\" or \"sacramental\" wine. This, it appears, was not according to their palate, as they left the bottle upon the floor, and the glass they had used, partially filled, standing beside it, but a small portion having been used from the bottle. The closet containing the best wine was not touched, nor were some pounds in money in the sexton's drawer. The fellows having regaled themselves, left the vestry in a state of confusion, leaving behind them the bags which contained the money they had stolen, and the iron safes open. It is supposed that they obtained admission on Sunday evening to the churchyard, where one or more of them secreted themselves, and that, awaiting their opportunity, they effected the robbery about midnight, and subsequently decamped by the vicarage-house, which at the present time is not inhabited.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206311495.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 662, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2954, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]