[{"id": "145fcd9110d5e7fc6eff9ba21f9338ae02f1ea28", "text": "SENTENCES OF DEATH.\n\nAt the Leinster Winter Assizes, at Wicklow, on Friday, John Couran, an aged man, was indicted for the murder of his wife and Mary Farrell, an old servant, at Borklemore, on May 16th. The evidence showed that the prisoner wanted to get rid of his wife, in order to facilitate the sale of his farm, to which sale Mrs. Couran was opposed. For the defence it was sought to show that the shots which caused death in each case were fired by disguised marauders, but the prisoner was found guilty and sentenced to be hanged.\n\nAt Munster Winter Assizes, on Friday, before Judge O'Brien, the Rev. George C. Griffiths, Protestant clergyman, was tried for the wilful murder of his mother, of Kilflynn, county Kerry. Prisoner had been in financial difficulties. His mother was found dead in her drawing-room with a bullet wound through the head. For the defence medical witnesses were examined to sustain the plea of insanity. The prisoner was found guilty, with a strong recommendation to mercy on account of weak intellect. On being asked had he anything to say why sentence of death should not be passed, prisoner said, in a firm voice, \"I did not, at all events knowingly or intentionally, take the life of another. I do declare that most solemnly before you and before God.\" The accused was then sentenced to be hanged on January 9th.\n\nSuicide of a Child.—George Booth, eleven, the child of a Worcester street musician, committed suicide, on Friday afternoon, by hanging himself to the bed rails. He has given a lot of trouble by sleeping out and playing truant from school. He was recently expelled from the Roman Catholic Schools and entered the Board School last week. He played truant on Friday, and was hunted up and sent home, where he committed suicide for fear apparently of being chastised.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812377.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 432, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1813, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]