[{"id": "239d78457bb5b5f1864369e7eacd06290dbcf51c", "text": "ACTION FOR SEDUCTION.\n\nA remarkable action, which had been once previously tried without the jury agreeing to a verdict, came before the Court of Common Pleas on Tuesday and Wednesday. It was an action for the seduction of the plaintiff's daughter Alice. The plaintiff (Mr. Reeve) was a butcher, and the defendant (Mr. Perren) a corndealer, living at Greenwich. They had been neighbours and intimate friends for about 25 years. The defendant had very frequently lent the plaintiff money, which had been repaid, and at the time when the accusation of having seduced his daughter was made by the plaintiff he was a creditor of the defendant to the amount of £37. He was a man over 50 years of age, and lived with his wife and family, and was in the habit of almost daily going over to the plaintiff's house. The plaintiff was a widower with four children living at home—two boys under 12 years of age and two daughters, Alice and an elder sister, Jessie; 24. About May or June, 1871, suspicions arose as to Alice's condition, but they were not seriously entertained until October. At that time it was ascertained that she was in the family way, and she said the defendant had seduced her in April last. On the 9th of October the defendant went over to the plaintiff's, when he was charged with being the seducer of Alice by the plaintiff in the presence of his two daughters. The defendant at once denied it, and said he was not the father of the child, and afterwards went home and told his wife what had been charged against him. She went over to the plaintiff's, and said, \"it was not her husband, but that it was Parham who was the father of the child.\" Parham was a young man who had been in the service of the plaintiff. Another young man named Brown, who had also been in the plaintiff's service, was called as a witness by the defendant to show that Alice had been too familiar with Parham and him. After this accusation defendant caused his solicitor to write letters to the plaintiff and his daughter Jessie complaining, that the accusation was slanderous, and threatening proceedings if the slander were repeated. An action was also brought by the defendant to recover the £37., and the judgment had been obtained since the first trial, but before judgment the plaintiff's goods were sold off under a bill of sale. About a week after the first trial Alice was confined and the child was born dead. As upon the former trial, witnesses were called on both sides. The daughter Alice, who was said to be of weak intellect, swore positively that the defendant and no one else had seduced her, and the defendant as positively contradicted her. Witnesses were called for the plaintiff to prove that the defendant had been unusually familiar towards Alice, and witnesses for the defendant to prove that Alice was unusually familiar with Parham, and frequently with him in private. But on the present trial no fresh witnesses were called, and Parham, who was called on the first trial by the plaintiff, was not called by either side on this occasion. The case again occupied nearly the whole of two days.—After a very careful and elaborate summing up by the learned Judge, the jury retired, but after being locked up for four hours were discharged without giving a verdict.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206238868.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 729, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3273, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]