[{"id": "4e5fa6c1951c9266836435d8b12318d2b253cc31", "text": "ALLEGED MURDER ON LONDON-BRIDGE.\n\nMr. Payne resumed, at Guy's hospital, an inquiry touching the death of Ann Pettigrew, who, it is alleged, was murdered by her husband on London-bridge.—Mr. Thomas Gore, clerk to the Lord Mayor, said that on hearing of the occurrence, he had attended at the bedside of Mrs. Pettigrew at the hospital. She made a statement, in which she said that while walking over London-bridge her husband kept pushing her, and finally thrust her under the wheel of a brewer's dray. Her leg was crushed, and she was taken away in a cab. Her husband had left her six times, and was now living with another woman. She declared that he pushed her purposely under the dray.—Corroborative evidence having been given, the jury returned a verdict of \"Manslaughter\" against James Pettigrew, and the Coroner, who concurred in the verdict, issued a warrant for his arrest.\n\nOn Wednesday the accused, James Pettigrew, 32, described as a cooper, was brought up at Guildhall, and charged with having caused the death of his wife. The evidence was merely formal, it being simply proved that on the previous evening the prisoner was arrested on the Lord Mayor's warrant, by Enoch Emery, City detective officer, at King's-cross station. In answer to the charge, he remarked that he was never more surprised than when he read the account of the inquest; and that he was going to consult a solicitor in the matter. Upon him 3l. 16s. 10d. and other articles were found, and he was in company with a woman with whom it was stated he had been living. He added that he had only been in London a very short time.—Mr. Oke, the chief clerk, read the deposition of a drayman named Webber, in the service of Messrs. Hoare and Co., in which he stated that on the evening of the 30th of October, while driving over London-bridge, he saw a tall man (the prisoner is six feet high) push a woman with both hands into the roadway. He pulled up at once, but the dray crushed the woman's side against the kerb.—Mr. Alderman White, impressing upon the prisoner, whose manner was somewhat callous, the gravity of the charge, remanded him.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206238641.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1246, "total-output-tokens": 541, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2119, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]