[{"id": "bcc73f031d5f8e0f9fe873eebee9c0ec35cbcd66", "text": "THE ANERLEY TRAGEDY.\n\nAt the Lambeth Police-court, William Kemp, sixty, described as a labourer, of Trenholme-road, Anerley, was charged, on remand, with the wilful murder of George Hayter, by striking him on the head with a poker. He was further charged with assaulting his wife, Marian Kemp, by striking her on the head with a poker. Mr. F G. Frayling, from the Solicitors' Department of the Treasury, appeared for the prosecution; and Mr. Arthur E. Eves, solicitor, defended. Mr. Frayling said the prisoner, his wife, and the deceased man all lived in a small four-roomed house in Trenholme-road, Penge. The prisoner was in the employ of the Lewisham Board of Works, and was out all day at his work. On the night of the 10th he returned home about six o'clock. His wife was boiling some eggs, and Hayter, who was an old man, was sitting on a chair reading a newspaper. The wife said, \"You have been drinking,\" and prisoner then picked up a poker and struck his wife with it. She ran out of the room, followed by the prisoner. Hayter, who was apparently very much frightened, ran into the back garden, and there met the prisoner, who immediately struck him several blows with the poker. Police-sergeant Barrett, S.P., said the prisoner when in the cells at the station made the following statement: \"When I returned home from work she commenced going on at me, as she did on Sunday. This is why I hit her, and I hit the old man because he is as bad as she is.\" Mrs. Susan Chick, who lived next door to the house in which the prisoner lived, said Mrs. Kemp ran through her house with her head bleeding. The prisoner followed a few seconds afterwards with a poker in his hand, and got into the garden at the rear of the house. There he met Hayter, and struggled with him. She saw the prisoner strike Hayter on the head twice with the poker. She went to the street door for assistance, and then went to the window of the back room and saw Hayter lying on the ground. She knew the prisoner and his wife were accustomed to \"jangle\" occasionally. Re-examined: The deceased man was in a very feeble state of health. William Chick, an intelligent boy, said he was in the garden when Hayter scrambled over the fence. About the same time the prisoner came out with the poker. The men struggled, and the prisoner, holding Hayter with his left hand, struck him over the head with the poker with his right hand. When the prisoner had struck the second blow Hayter called out, \"Oh! Will; let me live this day.\" Prisoner said nothing, but struck him another blow. Hayter then fell down, and while he was on the ground the prisoner struck him another blow on the back of the head. Medical evidence having been given, showing that death was the result of the injuries received, Mr. Hopkins again remanded the prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811555.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 685, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2803, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]