[{"id": "9b7f5ec5cbd2d67adbeb69026659c0b4b71a8660", "text": "TRAM ROBBERS IN PARIS.\n\nAn extraordinary incident occurred the other night in Paris. At a late hour a steam tram was passing through the usually peaceful suburb of Puteaux, when the driver perceived a man standing on the line a few yards ahead of the oncoming engine and holding a thick stick. The driver reversed his machine, in order not to run over the man, and got down to demand why the latter refused to move off. Six fellows, who had been hidden by the darkness, thereupon sprang out and assaulted the driver and the stoker, who had come to his colleague's assistance, and who was severely wounded with some blunt weapon. Fortunately, at this juncture, the guards and some passengers flew to the rescue and put the would-be brigands to flight.\n\nTHE HOWARD DE WALDEN CASE.—The recent application by Mr. Searle for the impounding of the documents in the Howard de Walden divorce suits is not to be both the beginning and end of the matter. It is stated that the Treasury have determined to take criminal proceedings for perjury in respect of certain testimony which was given during the hearing of the suits.\n\nA FAMILY MURDERED.—A horrible crime has been committed at Salmadorff, a place situated between Munich and Vienna. Early on Wednesday morning a family, consisting of mother and three daughters, from thirteen to twenty years of age, were cruelly murdered. The murderers, after stealing all they could lay hands upon, set fire to the house and managed to escape. The fire brigade found the victims still alive, but all died in a few hours.\n\nA FORGETFUL VICAR.—A curious incident occurred at the parish church in a certain village in the Weald of Kent on Sunday. The bells had been rung for morning service, and the congregation were seated, awaiting the arrival of the vicar. As he failed to put in an appearance, the churchwardens, after waiting for a considerable time, proceeded to the vicarage. Contrary to their expectations, they found their pastor there in his usual health, but, from some unexplained cause, he had forgotten the day was Sunday.\n\nTHE SANDGATE DISASTER.—The Sandgate Relief Committee have received a cheque for £25 from the Queen, together with a letter expressing sympathy with the sufferers. Her Majesty adds that she is unable to become a patron of the fund. A very heavy wind prevailed at Sandgate on Thursday, and fears are entertained that Spring House will fall altogether should the gale continue. It is considered fortunate that most of the fissures have been filled up, otherwise the probability is that the heavy rains of Thursday would have penetrated to the level of the galt, and so contributed to another subsidence. Subscriptions do not come in very fast. The total amount is about £5,000, which will go but a very short way towards replacing the losses many have sustained.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811435.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 630, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2825, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]