[{"id": "386ade61f9e72d42a66ebc2ca517b180f613461f", "text": "THE COURT.\n\nThe Queen and Prince Albert, accompanied by the Prince of Wales and the Duke and Duchess of Saxe Cobourg, left Claremont at ten minutes past three o'clock on Monday afternoon, in a carriage and four, escorted by a party of the 12th Lancers, for town. Prince Alfred, the Princess Royal, the Princess Alice, and Count Arthur Mensdorff, and the royal suite followed in three carriages and four. The august party arrived at Buckingham Palace at twenty-five minutes before five o'clock. Her Majesty held a court on Tuesday, at Buckingham Palace, when the Bishop of Chester had an audience. Her Majesty and Prince Albert, accompanied by their Royal Highnesses the Duke and Duchess of Saxe Cobourg and Count Arthur Mensdorff, honoured her Majesty's Theatre with their presence in the evening. The royal suite consisted of the Marchioness of Douro, Madame la Baronne de Wangenheim, the Earl of Morley, Colonel Buckley, and Baron Fritsch. Her Royal Highness the Duchess of Cambridge, accompanied by his Serene Highness Prince Frederick of Hesse, and attended by Baron Knesebeck, honoured the performance at the Haymarket Theatre with their presence on the same evening. A deputation of officers of the Army and Navy had an audience of his Royal Highness Prince Albert on Tuesday morning at Buckingham Palace.\n\nDUKE OF CAMBRIDGE'S BIRTHDAY.—Thursday being the natal day of his Royal Highness the Duke of Cambridge, the children of the Queen's free grammar school, Kew, about seventy in number, were regaled with a good dinner in honour of the auspicious occasion, and in the evening the tradesmen to his royal highness dined together, and drank \"Long life and happiness to their royal patron.\" The poor of the district were not forgotten, a plentiful supply of coals, under the supervision of the churchwarden, being sent to each. His royal highness has attained his 74th year.\n\nTHE PRIMACY.—The announcement we made last week as to the elevation of the Bishop of Chester to the vacant archiepiscopal see is confirmed by the following order, which appeared in Tuesday's \"Gazette\":—The Queen has been pleased to order a congé d'elire to pass the Great Seal of the United Kingdom of Great Britain and Ireland, empowering the Dean and Chapter of the metropolitical church of Canterbury to elect an Archbishop of that See, the same being void by the death of Dr. William Howley, late Archbishop thereof; and her Majesty has also been pleased to recommend to the said Dean and Chapter the Right Reverend Father in God Dr. John Bird Sumner, now Bishop of Chester, to be by them elected Archbishop of the said See of Canterbury.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206191683.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 604, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2623, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]