[{"id": "141aa79d1fce7cd7c543c036fcc5203b6832561b", "text": "THE \"SILVER KING\" SHOT.\n\nMr. John W. Mackay, the famous capitalist, was shot at on Friday afternoon in front of the Lick House, San Francisco, by an old miner named W. C. Rippi. The assailant then put the pistol to his own mouth and shot himself, inflicting a wound from which he will die. Mr. Mackay's wound is not necessarily fatal. Mr. Mackay has been here for some time past on business connected with an important lawsuit. For the past few days a white-haired old man had been noticed walking up and down Kearney street every morning, glancing to right and left as though he was watching for someone, and on Friday morning he was seen to keep his hand constantly on his hip pocket. It was a custom of Mr. Mackay to go every afternoon to a jeweller's shop near the hotel to regulate his watch. He was very methodical about this, and always walked there regularly about the same hour each afternoon. On Friday, just as he reached an alley named Sutter street, Rippi, who was a little distance behind him, pulled out his revolver, and with the quickness of a flash, fired a shot at him. The bullet struck Mr. Mackay in the back. The would-be assassin immediately turned round, and exclaiming, \"My God! I'm satisfied!\" placed the revolver close to his mouth, and made an attempt to take his own life. Mr. Mackay was at once driven to the Palace Hotel, and half-a-dozen doctors were summoned.\n\nMr. Mackay has given the following account of the occurrence to a representative:—\"I was on my way to Virginia City, and turned towards a jewellery store to see whether my watch marked correct railroad time. I did not see any white-headed old man, nor did I notice anyone stir. The first thing I knew I heard a voice say, 'Mr. Mackay, you've been shot.' 'Oh, I guess not,' I replied, laughingly. 'Yes you have,' replied the voice; 'I saw the dust fly out of your coat.' Then I saw the old man with the pistol to his mouth as he shot himself. I never knew the man Rippi, but I got a good look at the fellow, and would know him again if I saw him.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811366.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 514, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2040, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]