[{"id": "f9455b414b76cf0946d704abeee2751072da0c02", "text": "ROBBERY BY A RAILWAY GUARD.\n\nOn Thursday, at Worship-street police-court, Thos. Davey, a guard, working on the Woolwich line of railway, was charged with stealing from a luggage-train while in transit between Mile-end and Ipswich.\n\nTwist, formerly attached to the metropolitan division of police, and now employed by Mr. Superintendent Kent, of the Great Eastern line of railway, as a detective, said: Yesterday morning I entered the back compartment of a second-class carriage in the quarter-past seven train (parliamentary), from London to Colchester, &c. Immediately next to it was the luggage break van, and my instructions were to watch it. I got in at the Bishopsgate terminus, and on reaching the Mile-end station, the first at which the train stops, I distinctly felt a vibration of the buffers, as though some person was treading on them to pass over into the six-foot way or middle of the line. I looked through the window, and although nearly dark perceived a man close to the luggage-van, standing as if privately engaged. As the train began to move off, however, he suddenly unlocked the door of the van, entered and closed it. Just as the train entered Stratford the door was again opened, and he alighted, with a basket and bundle, which he did not have when he entered, and made his way across to the opposite platform. I followed and called to him, and said I wished to see the contents of his luggage. I took him into a second-class carriage and found the bundle contained a sailor's jacket, and the basket a pair of boots. He said all were his own property, and that he was going to take them to Woolwich. I conveyed him back to London, and gave him up to my superintendent. He wore his guard's uniform.\n\nMr. Ellison: Do you, prisoner, wish to ask any questions?—Prisoner: I wish to say that I did not cross the buffers.\n\nMr. Henry Kent: I am the superintendent of police on the Great Eastern line. When the last witness brought the prisoner to me I questioned the latter as to his possession of the articles. He said that they belonged to his brother-in-law, who was a foreman, at Woolwich, and that he was, when taken into custody, going there with them. He could not, however, give me any address of his relations, but named his own as being at 40, Oxford-street, Whitechapel. I telegraphed to Ipswich for inquiry to be made as to any sailors having proceeded by the train in question, and if so to ascertain if they had lost anything. I then proceeded to Woolwich, made search for prisoner's brother-in-law, but could not learn about such a person. On returning found an answer to my telegram that the owners of the property had been found, but not without some difficulty, as their luggage was fastened up so neatly it did not appear to have been touched. The men are now present, by my direction, to claim their things, and their evidence will complete the case.\n\nJohn Lewis and James Milne, both sailors, identified—one of them the jacket, and the other the boots, his best. They had seen their luggage placed safely in the break-van mentioned.\n\nMr. Ellison: Robberies by servants are at all times great offences. A certain amount of confidence must necessarily be placed in such persons, and where they succeed in avoiding detection, suspicion, and at times the worst results, follow to those who are perfectly innocent. Yours is an especially bad case, and but for these sailors having to proceed immediately to sea, thereby rendering it impossible for them to attend before a jury, I would most certainly send you for trial, if only as a warning to others. As it is you must go to prison for six months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206224251.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 835, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3645, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]