[{"id": "0840121c9b485f3db8f4dae99f0775315d9acec3", "text": "THE ALLEGED MURDER AT BRENTFORD.\n\nOn Saturday, at the Brentford Petty sessions, Charles Hicks, a shoemaker, 36 years of age, was charged with killing a man named Bernard Burgess, a plate-layer on the Great Western railway. Hicks was lodging with Burgess and his wife, and had been in the house two years. Before he went there Burgess and his wife lived comfortably together, but lately it would appear that Burgess suspected his lodger of undue familiarity with his wife, who was about 10 years younger than himself, but about the same age as the prisoner. The son has stated that his father accused Hicks of taking his mother to the theatre and keeping her out all night, but when closely questioned on the subject he denied that there was any truth in the report, though his father was quarrelling with Hicks about it on Saturday, the 12th inst. On the 14th the prisoner was seen to follow the deceased man out of the house, go up to him behind, seize hold of him by the collar and shake him. He was heard to say, \"I will take care you don't say anything against me. I will murder you if I am hung for it.\" Deceased did not strike the prisoner or offer any provocation, but appeared to be trying to get away from Hicks. The latter struck Burgess under the ear with his fist. The blow felled the old man, who remained on the ground, and never stirred afterwards. The affair took place in the Catherine Wheel-yard, and hearing a disturbance the neighbours went out and attempted to carry Burgess indoors, the prisoner offering some resistance. A surgeon was sent for, and he could not obtain any information as to what had occurred, either from Mrs. Burgess, her daughter, or the prisoner. Burgess died the next day, and a post-mortem examination showed an injury to the brain, which might have been caused by such a blow with the fist as the one given by Hicks, and there was also a small punctured wound, which was probably caused by deceased's head coming in contact with some of the stones in the Catherine Wheel-yard.—Inspector Tarling entered the house shortly after the occurrence, and found the surgeon examining the wounds, and the prisoner, Mrs. Burgess, and her daughter, in an adjoining room. The wife, in answer to a question as to what had happened to her husband, said, \"He has been accusing me of improper conduct.\" The prisoner was then taken into custody, saying, \"I am very sorry; after lodging here two years it has come to this.\" It appeared from the evidence of a Thames lighterman, named Joseph Taylor, that on coming out of his house, Burgess met him, and said, \"Hicks is on to me again. Here he comes; he means settling me.\" Prisoner followed, saying, \"You are a deceitful old man,\" Burgess, referring to what had transpired in the house, said, \"I never said it.\" This witness then went indoors, but on hearing that the old man was dead, he went to lift him up, when the prisoner struck him.\n\nThe Prisoner: I should like the surgeon's assistant to be called to show that I carried Burgess into a room, where the doctor examined him.—Mr. Gillingham, Dr. Earle's assistant, was then sentfor, and on arriving said the prisoner carried Burgess into another room.—The Prisoner: Did not I say, \"Lay down, father?\"—Mr. Gillingham: You made some remark of that kind. Burgess was then alive.—The prisoner was then committed for trial at the Central Criminal court for the wilful murder of Burgess.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206241106.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 791, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3413, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]