[{"id": "bbc43db49aa6820c0c3d600a7933e6b7cd09b835", "text": "MURDER AND MUTILATION.\n\nA PARIS correspondent, telegraphing on Sunday, says:—About ten o'clock this morning a cliffonnier found in the basement of a half-built house near the Buttes Chaumont—the East-end of Paris—what seemed to be a bundle of rags. On opening the parcel it was found to contain a human body cut into twelve pieces. The head alone was missing. These remains were handed over to the police, and on being submitted to a medical expert he declared that they were those of a young woman, and that she could not have been dead over twenty-four hours. The fragments had been powdered over with sawdust, which, from the smell, must have been impregnated with phenic acid. About five hundred yards from the spot where the fragments were discovered traces of blood were found to extend from a house in the Rue Botzaris. The people living there report hearing a violent and protracted barking of dogs during the night.\n\nBIRTH ON THE HIGH ROAD.—A singular occurrence is reported from Gloucester, a woman of the vagrant class on tramp with her husband and children being delivered of a child on the highway. The wife of the ex-mayor of the city, driving by at the time, being informed of the affair, drove the mother and child to a cottage, where they received attention, and thence to Gloucester Union. The woman had left the workhouse at Cheltenham a few hours previously, although protesting she was unfit to travel. Both are now doing well.\n\nMURDER OF A GIRL IN BRUSSELS.—Reuter's Agency, dating from Brussels, October 29th, states: The prisoner Schmidt, who, together with another man named La Haudie, whom the police have as yet been unable to trace, was charged with smothering a young girl in order to obtain the sum of 40,000fr., for which her life was insured, was condemned to death today by the Assize Court here.\n\nROBBING A BLIND MAN.—At the Croydon Borough Police-court, William Robert Tuck, described as a labourer, without a home, was charged with stealing a sovereign, the property of Charles Ralis, his master. The prosecutor, who is blind, stated that he was a wood broker, carrying on business in Parchmore-road, Thornton-heath, and the prisoner was in his service as carman. On Monday morning he handed him a sovereign for the purpose of buying six feet of firewood in London. Later in the day he received a telegram from Brixton stating that his horse and cart had been found at Loughborough Junction, and the prisoner did not return. Witness did not owe him any wages. Police-constable Woolford, 272 W, who arrested Tuck, said the latter admitted having the money, and explained that he and a companion went by train to Brighton on Tuesday, and walked back on Wednesday. Inspector Lemmy informed the Bench that the prisoner had been three times convicted of felony. Mr. Bishop passed a sentence of three months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810954.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 680, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2851, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]