[{"id": "44814af68cc688cc876049f06f97455325e310e8", "text": "ALLEGED STARVATION OF A CHILD.\n\nAt the Central Criminal court yesterday Anne Johnson, 36, a forbidding-looking woman, was charged with the manslaughter of William Onslow, by starvation and neglect. It appeared that the mother of the child in question was a single young woman, and she was delivered of the child on the 27th of March last, in Islington workhouse. It was represented at the time of its birth to be a remarkably fine healthy child, and the mother having obtained a situation as wet nurse placed the child in the charge of the prisoner to take care of, and agreed to pay five shillings a week for providing the infant with food and other necessaries, but not clothing. About a fortnight after the child had been placed in the care of the prisoner, she sent a letter to the mother informing her that the child was suffering from diarrhoea, but subsequently a second letter was sent stating that the child was better, and nothing more was heard about the matter until the mother received a notice from the workhouse informing her that the child was dead. It appeared that on the 22nd of August the lady with whom the mother of the child was living went to the residence of the prisoner at Islington, and saw the child lying on the bed, very dirty, moaning, and apparently very ill, and on the following day she saw the child in the same position, and it appeared to be even worse and was still more dirty. A feeding-bottle was shown that had been used for the child, and this was very dirty. The relieving officer was communicated with, and the child was at once removed to the Islington workhouse, where it died four days afterwards.\n\nMrs. Payne, a witness, who resided in the same house with the prisoner, said that the child was crying almost the whole of the day. She had given it food in the shape of nursery biscuits. Upon one occasion she heard the prisoner say, \"Put a drop of water in the bottle, and that will do for Willie to-night.\" She also said that she saw no food given to the child, and all the milk that was brought in was a pennyworth each day. The family consisted of the prisoner and six children, including the baby, and she got her living by going out occasionally, nursing and taking care of children.\n\nDr. Cowan, the medical officer of the union, said that when he first saw the child it was very weak and emaciated, and he did not think from the first that it would recover. The chest bones were very prominent, and the eyes were staring, but he saw no signs of disease, and the child did not appear to have been altogether neglected. There were indications that the child had been suffering from diarrhoea. There were no marks of external violence. On a post-mortem examination he discovered that all the organs, except two, were healthy, but there was an absence of blood in them. The mesenteric glands were diseased, and to this and emaciation he attributed the death. He stated that diarrhoea would produce much the same appearance as neglect.—Mr. Justice Hawkins upon this evidence ruled that no gross or culpable neglect had been established against the prisoner, and, under his direction, the jury returned a verdict of \"Not guilty.\"\n\nThis concluded the business of a protracted session, and the Court was adjourned until Monday, October 22.\n\nRAILWAY ACCIDENT.—On Friday morning a collision occurred between a passenger and a goods train near the Maidenhead station of the Great Western railway. A down goods train was being shunted on the west side of the station, at about half-past seven o'clock, when it ran into the rear portion of an up train from Reading, doing considerable damage to the rolling stock, but not injuring any passengers. The down line was blocked for several hours.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206328955.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 832, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3732, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]