[{"id": "8e07bdb36929682b13bb7a2f86873024211f060c", "text": "A WARNING TO YOUNG WOMEN.\n\nAt the Marylebone Police-court, a smartly-dressed half-caste, named Archibald Johnstone, aged twenty-eight, who described himself as a gentleman, of Hill-street, Knightsbridge, was brought up on a warrant by Detective-inspector Robson, D Division, as a convict out on license who was getting his living by dishonest means. Mary M'Eachern, who looked about thirty-five years of age, said she was a corset-maker, and resided at 26, New Cavendish-street, Oxford-street. She was with a female friend at Rotten-row, Hyde Park, in September last and met the prisoner, who introduced himself by saying, \"Good evening.\" She responded, and he walked with them to some chairs, where they all three sat down and entered into conversation. When they parted he made an appointment to meet witness on the following Wednesday. On the Tuesday evening, however, she was going out for a walk, and opposite the house she saw the prisoner. They went into Regent's-park and parted about ten o'clock. He made several appointments but did not keep them. The next time she met him was at Oxford-circus, when he asked for the loan of £5, promising to repay him with £2 interest. She refused, and he remarked, \"You can if you like, and you must.\" She afterwards told him she wished to have nothing more to do with him. He said, \"Oh, that is the decision you have come to; then I shall tell everybody that you are a bad woman.\" Since then she had received letters and postcards from the prisoner, in which he made disgraceful assertions which were not true. The magistrate asked if there had been any acts of indecency or immorality between them, and whether witness had ever been to houses of ill-fame with him as suggested in the documents. The witness gave an emphatic denial to all the assertions. The prisoner: The first time I met you, you smiled at me. Witness: No, I did not. Prisoner: Didn't you say you liked my appearance? Witness (scornfully): Certainly not. Prisoner: Didn't you follow me round the band-stand? Witness: No. Prisoner: Didn't you say \"good evening?\" Witness: I never spoke to you. Prisoner: You related to me where you had been and all your affairs? Witness: You asked where I had spent my holiday and I told you. Prisoner: How many times have you visited me at Knightsbridge? Witness: I have not visited you. Prisoner: Will you swear that when I gave you a sovereign you did not ask me for £2? Witness: Certainly not. Prisoner: Did you not refuse to go into a house near Sloane-street with me unless I gave you £5, the same as, you said, gentlemen gave you at Regent-street? Witness (indignantly): No, certainly not. Inspector Robson said after a severe struggle, he secured the key of prisoner's drawer, and found a large amount of correspondence from women from whom the prisoner had evidently been endeavouring to obtain money. Mr. Cooke ordered a remand.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810271.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 706, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2887, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]