[{"id": "9d557a53617104d0694a856339378af24d22f5fb", "text": "THE PIMLICO AND CLAPTON MYSTERIES.\n\nCHARLES WARLAND, thirty, milkman, of Wilton-road, Dalston, and Arthur Edwin Sharp Evans, fifty-four, medical assistant, late of 68 Wrótham-road, Camden Town, were charged on remand before Mr. Lane, at the North London Police-court, on Saturday, with conspiring together in the administration of noxious drugs to Rosa Read, who afterwards died. Evans was further charged with performing an illegal operation on Edith Olive Banister, aged twenty-seven, a lady journalist, of Claverton-street, Pimlico, for whose manslaughter Mrs. Mary Ann Baker was sentenced to three years' penal servitude. Originally Warland, a married man, was charged alone with administering noxious drugs to Rosa Read, a servant-girl with whom he kept company. Evidence showed that at the time of Mrs. Baker's arrest for the Pimlico death, Rosa Read was living in Mrs. Baker's house, where Evans was also a lodger. This led to Evans's arrest, and to Mrs. Baker being brought up on an order from the Home Secretary to give evidence. She admitted that Evans had lived in her house for years, that he was in the habit of receiving patients, both male and female, and that the latter were usually well-dressed and young or middle-aged. Mr. Bodkin, who prosecuted for the Treasury, said there were two other witnesses against Warland, who would be called at the trial. Warland was then called upon to plead, and Mr. C. V. Young, who defended, said that the prisoner would plead not guilty, but witnesses would be called at the trial. Evans, on the Clapton charge, said he had nothing to say, but his family were going to have him legally represented at the trial. The prisoners were then committed to the Central Criminal Court for trial. On Warland being removed the charge against Evans in connection with the Pimlico case was proceeded with. Mr. H. Jones, 42, Claverton-street, Pimlico, a journalist, called as a witness, said that he was instructed by the Institute of Journalists to make a formal protest against giving evidence without payment as a professional man. Mr. Lane: Very well. Mr. Jones then said that he became acquainted with Miss Banister through his being employed on the same newspaper. On October 23rd last he was walking with her, at about six o'clock in the evening, when the young lady's foot slipped down an open coal grating, and she fell. She complained of being hurt, and cried very much. Mr. Bodkin asked for Evans's committal for the felony of committing an illegal operation on Miss Banister, and for manslaughter. Mr. Lane said that the manslaughter was highly technical, and inasmuch as the punishment for that offence would not be greater than the punishment for the felony, he should only commit for the one offence. In reply to the charge the prisoner said that he had not the slightest recollection of any person of Miss Banister's name or description. He could not call her to mind at all. The prisoner was committed for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812711.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 694, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2969, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]