[{"id": "27b97cd6f82b97ee145c6c53a0c550e555e67dab", "text": "THE BERKSHIRE MURDER.—Since the Watchfield murder the police have been making investigation as to the mysterious disappearance of the prisoner Carter's second wife four years ago. The garden attached to the cottage at Eastleaze, near Shrivenham, in which the prisoner then lived, has been dug over and a number of bones have been found. The police were unable to determine whether the remains were those of a human being, and have had them removed to Faringdon for medical examination.\n\nA WEDDING FRUSTRATED.—A wedding party were making final arrangements at the bride's home at Llanelli, Carmarthenshire, on Wednesday, prior to leaving for All Saints' Church, where they were to be married by license. The bride was beautifully attired, and the bridegroom looked cheerful at the prospects of soon becoming a married man, when a messenger from the officiating clergyman brought the sad tidings that he could not perform the ceremony, in consequence of the bridegroom's father having protested on the ground that the bride was twice his age. The gallant youth is determined to take his fiancee to the altar.\n\nSAVAGE ASSAULT BY ITALIANS.—Ammuizio Alloco was indicted for wounding Sabatino Savevio. The prosecutor is an ice-cream vendor, and on the evening of the 12th of July he had an altercation with the prisoner outside a public-house. He had gone home, when the prisoner said he wanted to see him, and on going outside and seeing prosecutor, said, \"I am going to kill you,\" and at once struck him with an ice-knife on the shoulder and arm. A brother of the prisoner, Raphaele Alloco, was said to have also stabbed him on the thigh. The medical evidence was to the effect that prosecutor was found to be suffering from three wounds, one on the head, one on the right arm, and one on the left thigh. There was also a slight wound on the shoulder. The prisoner was found guilty, and sentenced to four months' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811975.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 467, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1921, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]