[{"id": "ee4452d4ddbc78a88bb969dbca02dbf0a3d85140", "text": "A MYSTERY.—In the case of Mr. William Crutchley and Mr. Walter John Turner, who attempted before the Lord Mayor and Town Clerk to procure information and evidence, the result of which did not publicly transpire, Mr. Kemp, barrister, addressing the Court, said before the matter was opened up to him, he had been informed there were gentlemen of respectability, and this charge, as he believed, had been made against them, to enforce the payment of debts, while civil proceedings, with the object of securing the same, were pending. Upon a charge of a very serious nature, the defendants' mouths were closed, but in the civil proceeding they would have had full opportunity of giving their own explanation of the matter in dispute. He did not wish to refer to the matter again. He had no reason to refer to the manner in which summonses had been issued, except to state that the defendants were ready and anxious to explain everything and to account for the charges laid against them. Look to the fact that these civil proceedings were still pending, and that in a short time the defendants would be able to give their version of the circumstances under which the matters complained of took place. For his part, honour, and integrity, he asked the Court to sanction such a reasonable adjournment of this criminal information as the case would justify.\n\nMr. Bealey, counsel for the prosecution, for an adjournment until the end of the prosecution.\n\nThe Lord Mayor said as both sides desired a postponement of the case, he would grant it; if, though the facts stated in the information were true, it was not a matter for conviction, settlement or conviction.\n\nThe hearing of the summons until Feb. 17, and admitted the defendants to bail in the meantime, each in the sum of £1,000.\n\nA RUFFIAN.—Samuel Jackson, a chimney sweep, of 9, Blue-hart-court, Little Bell-alley, was committed for assault on Eliza Stewart. The complainant said she had been with the defendant for five days, and that her husband had left her three times. He had promised her marriage, and every time she left him she induced her to go back again under a promise of marriage. On Monday last, at about nine o'clock, he threatened to kill her, and she went into a house, where she had lived upon what the neighbour had given her. Some time ago he knocked her down, and struck her in the head just after she had been drinking. She fell off the chair, and was now in a very weak condition. Mr. Pratt, who defended the case, said he would not cross-examine the witness if he could help it, as it would only excite the feelings of the witness. Mr. Pratt said he thought the prisoner ought to stand his trial, and that the children were entitled to £5 a week and one to £2. 6d., and the woman ought to have something for herself.\n\nEventually the defendant offered to pay £26 6d. a week, and the prisoner consented to an adjournment, but not without the sovereign to be given to the complainant for her immediate wants.\n\nMARLBOROUGH-STREET.\n\nEXTRAORDINARY CHARGE OF ROBBERY.—Corporal Remington, a young American, giving his address at the New Palace hotel, Buckingham-gate, was charged with stealing a gold watch, of the value of 6s., the property of Mr. Andrews, a grocer, from his shopkeeper's shop. The prosecutor said about 20 minutes past 12 the previous night the prisoner came into his shop and began quarrelling with some of his customers. Mrs. Got the prisoner's watch and stole her gold watch, which she had safe at the time. She then went to the stable to take the prisoner into custody, and the constable asked her whether she would charge him with robbery. She said yes, and that she would charge him with murder. Corporal Newton, the prisoner went away, and he afterwards saw the prisoner at the station.—Police-constable Frith, 14 C.R., said on his way to the station, the prisoner, who had been drinking at the public-house, said, \"I am going to see Newton,\" the constable said the prosecutor was very excited.—Inspector Hamblin said he understood there was a tremendous row in the place. The prisoners, who were there, stated that thieves, thieves, and prostitutes, came nightly to the place about the same hour, for the purpose of making a disturbance, and the absence of seeing strangers and having robberies before me by the police you promised that you would give up the place.—The prosecutor said he intended to go to—Mr. Newton. The prosecutor bet- ter show the prisoner to one of the officers and keep a place which, according to your own showing, is the resort of thieves and prostitutes.—The prisoner was committed for trial.—Subsequently Mr. Lord Mayor, sitting in the town hall, attended, and said that the prisoner might be remanded, stating that the prisoner was well connected, and had means of his own, and that it was incredible that a person in his position should be engaged in the guilt of such a robbery.—Mr. Newton declined to accept bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206322590.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 510, "total-output-tokens": 1125, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4938, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]