[{"id": "b765d464c104c9955fe8ab50fcd54d0eec9e7ad8", "text": "REMARKABLE CONDUCT OF GIRLS.\n\nOn Friday, at the Thames police-court, Alice Maidment, 13, and Sarah Ann Smith, 12, two nicely-dressed, good-looking children, were charged with being concerned in stealing about £4, in gold and silver, belonging to Joseph Bainbridge, a tent-maker.—The prosecutor stated that he lodged at Crown-place, Mile-end, at the house of the parents of Smith. On Sunday he missed a small bag from the top of a birdcage in his bedroom. It contained £3 in gold, two crown pieces, three \"lion\" shillings, and some other silver money.—Henry Thomas Cloke, 13, of 24, Walter-street, Stepney, said that he knew the two prisoners. On Saturday week he saw them in the Old-road. They were both carrying some chinaware and some baby's shoes. He went with them, at their invitation, to a sweetstuff shop, where Sarah \"stood\" him a bottle of lemonade. She changed half-a-crown to pay for it, and she gave him a shilling for himself. He asked her where she got the money from, and she said that her aunt at Stratford had given it to her, but afterwards stated that she had picked up a purse with £1 in it. She invited witness to go out on Sunday, and next morning witness, the two prisoners, and a boy named Christopher Baker, all went to Woodford together for an excursion. Sarah Smith paid the expenses of the whole party. At night, when they got back to Bow station, Smith changed a sovereign there, as she said that she wanted to get a ticket for Southend. The next day witness and Baker, with the two prisoners, went to Gravesend. Sarah paid the expenses and \"stood treat\" for them all.—Henry Payne, detective, deposed that he went to Southend, where he found the two prisoners detained. They had been lodging there since Sunday. In the room prisoners had been occupying was found a quantity of new crochet and other fancy work and six likenesses of the girls in various positions, two of them being equestrian portraits.—W. Gill, detective, H division, said that Mrs. Maidment that morning had handed him a new hat, and Mrs. Smith had also given him a new hat, and a new dress, which she said she was making for Alice Maidment. Witness also saw at Smith's residence a quantity of new toys, such as dolls, mouth organs, china tea sets, &c., evidently all new. At the station the prisoner Smith said, \"I took four sovereigns, and then I was frightened. I went to put them back, but the door was locked. On Saturday night I put the bag down against the kerb in White Horse-lane, and when I went to look for it next morning it was gone.\"—Mr. Lushington remanded the prisoners to the workhouse for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206257731.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 650, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2612, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]