[{"id": "d8f19e44b8693fbf86448d75980316697ae39a52", "text": "INSURING A MOTHER-IN-LAW.\n\nCURIOUS FRIENDLY SOCIETY CASE.\n\nIn the action of Mitchell v. the Liverpool Victoria Legal Friendly Society in the Queen's Bench Division, before Justices Mathew and Cave,\n\nDr. Blake Odgers, Q.C., moved ex parte on behalf of the defendants for a writ of certiorari to bring up the plaint and all proceedings instituted in the Burnley County Court into the High Court for trial. He based the present application on two grounds—first, that difficult points of law would arise on the trial; and secondly, that a jury had been summoned, and that the defendants had said that they could not have a fair trial on the questions of fact. The action was of a somewhat unusual kind. The plaintiff was a grocer living at Burnley; and he had insured the life of his mother-in-law—(laughter)—with the defendants. The question arose whether or not the plaintiff would have an insurable interest in the life of his mother-in-law. (Laughter.) The policy was effected in 1885, and the defendant continued to pay the premiums up to December last. The lady had lived instead of dying—(laughter)—and the plaintiff had ceased to pay the premiums, and brought his action to recover back £22 odd, the amount he had paid. In order to make a cause of action the plaintiff alleged that a representation was made to him in May, 1885, by an agent of defendants', that if he insured his mother-in-law's life he would be paid the money on her death. He did not allege that the representation was made fraudulently or with the knowledge that it was untrue. In August last, the plaintiff was informed by the defendants that the sum assured would not be paid to him on the death of his mother-in-law unless she signed a nomination paper under the Friendly Societies Act. The mother-in-law refused to do this, and the plaintiff now said he had suffered damage by being induced to enter into the insurance. A question of law would arise as to how far any representation made by an agent—if made at all—was admissible in view of the fact that a policy had been granted which was under seal. Then there was the question whether the plaintiff had any insurable interest in the life of his mother-in-law. Finally, he would point out that a jury had been summoned at the plaintiff's instance to decide the question whether any representation was made by the agent or not. The defendants set out in their affidavit that it was a common practice in Burnley and other Lancashire towns for persons to insure the lives of their relations in this and other friendly societies, and deposit the policies with shopkeepers as security for the payment of their accounts. The defendants were informed and believed that this action was brought to a great extent in the interest of a number of tradespeople in Burnley for the purpose, if possible, of establishing a precedent to recover the policy premiums in cases where the holders of the policies were unable to obtain the nomination as required by the Friendly Societies Act. The persons likely to be summoned on the jury to try the plaintiff's case would belong to a class who held policies in these societies either in their own right or by way of security.\n\nTheir lordships refused the motion.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812734.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 705, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3222, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]