[{"id": "ae35c5dde2ce79b0a993e5e05e798555ff5bf563", "text": "SAD CASE OF ATTEMPTED SUICIDE.\n\nOn Tuesday, Margaret Wall, a respectable young woman, was charged before Mr. Norton, at the Lambeth police-court, with attempting to destroy her life.\n\nPolice-constable 487 P deposed that he was called to the prisoner, whom he found at a chemist's shop in Norwood, and was informed that she had taken poison. After having an emetic and the attention of two medical men she recovered, and he took her into custody.\n\nThe prisoner stated that she was a married woman, and had been driven to attempt her life by the conduct of her husband. In fact, he was with her when she was about to swallow the poison, and was fully aware of it.\n\nThe husband, Henry Wall, a fly-driver, here presented himself in the witness-box, and Mr. Norton ordered him into the dock.—In answer to the magistrate, the wife said that she had been married to the prisoner for about six years, and that he had behaved to her in a most shameful manner. He had left her, and she had been obliged to go to service to maintain herself. When he was out of work he came to her, and she helped to keep him. The moment he obtained a situation he was off again. On Sunday last, hearing that he was at Norwood, and being out of a situation and in want of help, she proceeded to the stables near the Crystal-palace, where, after waiting for about two hours, saw her husband. He said if she did not go away he would kick her out, and would have nothing to do with her. She explained to him her situation, and told him she had nothing to eat for hours, but he still refused to aid her in any way. He walked away, and she continually followed him about, even to his meals, but he denied her a portion, and very frequently threatened her. On going to his lodgings at night, she shut the door in her face, and had it not been for the kindness of the landlady she would have had to remain in the streets all night. On the following day she again followed her husband to his breakfast, but he refused to pay for even a cup of tea for her, although she was ill and weak from want. About midday at the stables she again asked him for food or help to get back to her mother, in London, and whilst there she showed him a packet of sugar of lead and some water in a tumbler, and told him that she would take it if he still refused. He said she might do so if she liked, when she mixed the powder in the water in his presence, and instead of preventing her he went away. She afterwards swallowed the poison, and on being questioned by her husband's master she denied that she had done so and ran off. She wandered about for some time, but becoming very ill sank down upon the step of the chemist's shop where she had purchased the poison. Here she was attended to after having confessed what had happened.\n\nThe mother of the accused stated that her daughter had frequently complained of the conduct of her husband, who had endeavoured to persuade her to gain her livelihood in an improper manner, or marry another man.\n\nThe husband denied that portion of his wife's evidence with regard to the poison, and said that he could not be accountable for the acts of his wife. If she did not like the course he took, let her seek her remedy, and he had told her so.\n\nMr. Norton said that it was without exception one of the most painful cases he had ever had before him, and the whole conduct of the husband was disgraceful. He (the magistrate) would sift the facts to the very bottom, and for that purpose would order a remand.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222962.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 814, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3496, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]