[{"id": "50f22bc4a055638a8b6f7d06403b815cb69d9c69", "text": "ACCIDENTS ON THE THAMES.\n\nAbout 10 o'clock on Sunday night a boat accident occurred off Horseshoe wharf, Bankside, Southwark, which resulted in the loss of three lives. A youth named John Jacobs, aged 16, residing at 67, Lower Thames-street, in the employ of Messrs. Gasley and Welch, barge owners, started from Custom-house quay after dinner on Sunday afternoon for a row up the river in a boat belonging to his employers, and was joined by a man named Johnson, a barge watchman. They crossed over to London-bridge stairs and went ashore to get some drink. Here they made the acquaintance of three girls, who pressed them to take them for a row. They all went as far as Battersea, and after remaining there some time returned on the ebb tide. All went well until they reached the Horseshoe wharf, between Cannon-street and Southwark bridge. Johnson was then lying in the stern of the boat, and the lad Jacobs was plying the oars, when—probably owing to the darkness—the boat ran foul of a number of barges, and began to overturn. Johnson leaped up, and succeeded in getting on the barges, with one of the girls, but the others were sucked down together with the boat, and drowned. Johnson and the girl, whose name has not transpired, made their way to the Bermondsey-street police-station and gave information of what had occurred, and the Thames police were at once communicated with, but though dragging took place immediately the bodies were not recovered. A portion of the boat has been found, from which it is concluded that either the boat collapsed when it struck the barge, or has since been cut in two by a passing tug. The lad Johnson, it is stated, had only had three weeks' experience on the Thames, and the spot where the disaster occurred is stated to be one of the most dangerous eddies on the river.\n\nOn Sunday night, when the steamer Glen Rosa was off the Lobster, Gravesend, on her return from Clacton-on-Sea, one of her floats got loose. At the time a lady was sitting on one of the paddle-boxes, and when the float struck the flaps she was precipitated into the river. Being a good swimmer, although injured on her head, she managed to keep afloat until one of the male passengers jumped overboard. A boat then put off to their rescue, and both were saved.\n\nA sad death occurred to an excursionist named Robert Clayton, aged 24, of 42, Luke-street, Norfolk-terrace, Millwall, off Rosherville, about half-past 10 o'clock on Monday morning. He was sitting on the side rail of the passenger steamer Princess of Wales, when, through some unexplained cause, he overbalanced, fell overboard, and was drowned, all efforts to save him being of no avail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206252920.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 658, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2666, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]