[{"id": "d975b04a7b6f99c91f9f24ae3726070868fd5926", "text": "TRIALS AT THE OLD BAILEY.\n\nThe June session of the Central Criminal court was opened on Monday. There were 97 prisoners for trial.\n\nSINGULAR PROCEEDINGS IN A CHARGE OF PERJURY.—In the case of Thomas Joseph George (on bail), charged with perjury, Mr. Metcalfe, who prosecuted, stated that the charge arose out of Chancery proceedings, and that the Vice-Chancellor had expressed his opinion strongly that the prosecution ought not to proceed.—The Recorder said the course was rather novel; but he would allow the prisoner to go on his own recognisances until Thursday, and he would in the meantime consult with the learned judges.\n\nFORGERY.—Sarah Simpson, 53, domestic servant, was charged with uttering a forged cheque for 30l.—On the 3rd of March prisoner, who was cook in the service of Mrs. Stewart, of Pembury-crescent, was sent with a written order for a cheque-book to the Bayswater branch of the London and County bank. A book containing 24 blank cheques and counterfoils was supplied. On the 9th Mrs. Stewart sent her with a cheque for 20l., and she duly returned with the money. On the 15th she presented a cheque for 30l., and received the money. The cheque-book was examined on the 30th, when it was found that four cheques and counterfoils had been abstracted. Mrs. Stewart stated that she had kept the cheque-book in a safe place except when she sent it by the prisoner to the bank; and it was proved by a clerk from the London and County bank that the prisoner was the person who presented the forged cheques.—For the defence, it was urged that the prisoner had entered the service of Mrs. Stewart with five years' good character, and that she previously lived upwards of 10 years in one place. She was a person who was not able to write well, so that the forgery must have been committed by some one else.—The jury found her, \"Guilty,\" of uttering the cheque knowing it to be forged, but recommended her to mercy on account of her previous good character.—The Recorder thought it desirable to respite judgment until next sessions, in order that inquiry might be made as to the person who committed the forgery.\n\nEMBEZZLEMENT.—Alfred Williams, lawyer's clerk, in the employ of Mr. Smith, solicitor in the Temple, pleaded \"Guilty\" to embezzling 12l. 13s. 6d., and stealing 8 cwt. of papers, the property of his employer.—Mr. Besley, for the prosecution, said that the prisoner had been 15 years in the service of Mr. Smith, and had latterly given way to intemperance, but punishment would not have been pressed for had it not been that the law papers which belonged to a notable will case in Chancery had been sold for a penny a pound.—Mr. Turner, addressing the Court in mitigation of punishment, urged that the prisoner had been driven into intemperance and crime through domestic affliction.—The Recorder sentenced him to nine months' imprisonment.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206237078.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 708, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2863, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]