[{"id": "19103bb87c29baf8d30898abd5c00606b30ea070", "text": "THE HIRE SYSTEM.\n\nAt the Shoreditch County Court the case of Dyer and Son v. Mrs. Neal and Mr. S. Carter has been tried by Judge Prentice. The plaintiffs are piano-forte manufacturers, of 14 Stoke Newington-road, and they claimed of Mrs. Neal, who is a laundress, and Mr. Carter, an oilman, the sum of £23 2s., the value of a piano detained, and £2 2s. damages for the defendants having converted the instrument to their own use. Mr. Palmer appeared for the plaintiff, and Mr. Davis was counsel for the defendants. The plaintiffs' case was that in December, 1884, Mrs. Neal had a piano of them upon the hire system. The cost of the instrument was £23 2s., and £2 2s. was paid at once, and the remainder was to be paid at the rate of £1 1s. a month, the piano to become her property if she paid all the instalments. After paying three instalments she got into arrears, but in August last, when £6 6s. was due, she paid £8 10s., making £13 15s. paid altogether. Soon after that she moved away, and it was about two months before she was found. It was then discovered that the defendant Carter, who was her landlord, had taken the piano in pawn for rent. The sum of £1 10s. was due for rent, and Mrs. Neal undertook to pay £6 in six months or forfeit the piano. Cross-examined: The agreement was read over to Mrs. Neal before she signed it. His Honour: Why did she pay £8 10s. when only £6 6s. was due? The plaintiffs said it was of her own free will. His Honour: People do not usually pay more than is due. In answer to further questions, it was admitted for plaintiffs that they were told they could have the piano if they paid £6, the amount of the indebtedness of Mrs. Neal to Mr. Carter, but they refused to do that. They were also offered the balance due on the agreement for the piano, but they refused to accept it. His Honour, in the result, said he must hold that the agreement was good, but he would assist the defendants as much as he could. The plaintiffs acted very improperly in not accepting the balance due under the agreement when it was tendered. He was very sorry that he must give a verdict in their favour, but he should only allow £1 1s. damages, £9 7s. the balance of the £23 2s., and £2 2s. 10½ the costs of the court. Had the £9 7s. been paid into court he would have given judgment for the defendants.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200803389.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 644, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2325, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]