[{"id": "67e184f15d91f5d850365eeff1e111dca74c366d", "text": "PROSECUTION BY THE \"TIMES.\"\n\nAt the Mansion House Justice-room on Friday, John Sawyer, thirty-three, a carman, and Henry Hawkins, thirty-four, a journalist, were charged before the Lord Mayor with stealing and receiving respectively a copy of that day's issue of the Times newspaper. Mr. C. F. Gill was counsel for the prosecution. Detective Holmes, of the City Police, said at five minutes to four that morning he saw the prisoner Sawyer, who was a carman to Messrs. Farington, newsagents, of Fetter-lane, pull up his horse in Bouverie-street, leave his cart, and go to 57, Fleet-street. He almost immediately returned to his cart. A boy left 57, Fleet-street with a copy of the Times directly afterwards, and from what he said to the witness he went back to 57, Fleet-street with the boy and saw Hawkins in the doorway. Hawkins ran upstairs as fast as he could. He followed him to the third floor and told him he should charge him with receiving a copy, or part of a copy, of that morning's issue of the Times. He said he had received none that morning. The witness said \"No, but some one else has for you.\" Detective Davis proved the arrest of Sawyer. Mr. W. Stevenson, of the publishing department of the Times said the one hundred copies issued to Sawyer that morning were all marked, and the one found on the boy was one of these. They were for special postage purposes, and were not for sale in London. The part of the paper found on the boy contained the foreign intelligence. Detective Holmes, being recalled, said the boy stated in the prisoner Hawkins's presence that if he (Hawkins) was not at 57, Fleet-street of a morning he would find a paper on the staircase, which he must take to Dalziel's. That morning he found the paper there, and was taking it to Dalziel's when the Detective stopped him. Mr. Gill said the case would be gone into more fully on the next occasion, but it was a very serious matter, and some other person or persons would have to be arrested. Remanded till Friday on bail.\n\nMURDER TRIAL IN EDINBURGH.—James Fraser, bank clerk, was tried before Lord Adam, at the Judiciary Court, Edinburgh, on Monday, for murdering William Henry Shadwell, attempting to murder Jessie Shadwell, and murdering Mary Grindley, at Polmont, on July 26th last, by stabbing them with a sword. Medical evidence was given to the effect that the prisoner at the time of the committal of the murders was of unsound mind, and unable now to plead, and the Court ordered him to be confined during her Majesty's pleasure.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 614, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2525, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]