[{"id": "921726826978e4521cdae4fe2049783c9dfe27c2", "text": "SHOCKING MURDER BY A LUNATIC.\n\nOn Wednesday afternoon, an inquest was held at the Duke of Cumberland public-house, Henley-hill, near Eastbourne, Sussex, before Mr. R. Blagden, coroner for the western division of that county, on the body of Martha Ann Greenway, who had been murdered by her husband under the following frightful circumstances. It appears that the murderer, who was in good circumstances, and occupied a house in the village, returned from Bethleham hospital on Friday week, where he had been confined for ten weeks, and was supposed to have perfectly recovered from his attack of insanity. The murderer and his late wife were both about fifty years of age, and are said to have lived in perfect harmony together. They had two children aged respectively two years and a half, and eight months, and the husband seemed to have a great affection for the elder child, but did not pay the other any attention. On Saturday morning the accused appeared quite well, but in the afternoon, his conduct was observed to be rather strange, and on Sunday morning he came down to breakfast with only his shirt on, bringing his favourite child with him. In the middle of the day the servant girl went to church, leaving all the family at home, and when she returned, about five o'clock, she could hear and see nothing stirring in the house. She therefore went to her mother's, which was close by, and during the evening she proceeded to Greenway's house three times, but all was silent there, and the girl concluded that her master and mistress had gone to Farnhurst to chapel. About nine o'clock a neighbour heard a child cry, and a noise in a hedge adjoining Greenway's premises. A constable was then sent for, several persons assembled on the spot in a short time, and a search was instituted, which ended in the discovery of the youngest child in the ditch. The elder child was subsequently found in bed, while at the front door of the house a shocking scene presented itself. Lying there was the mutilated body of Mrs. Greenway, who appeared to have been dead for several hours. Her throat was cut from ear to ear. She was also cut on the right cheek, and through her dress to the breast bone. There was another cut from the wound in the throat down to opposite the fourth rib, where the chest was penetrated, and another cut across the cheek to the jaw bone. In the kitchen, immediately in front of the fire-place, was a pool of blood, and near it lay two masses of the deceased's hair, coagulated with blood, and evidently torn violently from her head. The murder, no doubt, took place in the kitchen; but there was no derangement of the furniture of the apartment, so that it did not appear that any great struggle had taken place. The husband was meanwhile nowhere to be found, and a search in all directions proved fruitless. On Tuesday morning, however, he went to a person at Elstead, and asked for money; but, as information of the murder had reached that place, he was immediately given into custody. Upon examination it was found that the shirt he wore was bloody on the sleeves, and he was taken before Arnold Davis, Esq., one of the county magistrates at Midhurst, and remanded to the adjourned inquest; and he now lies in Petworth gaol. It is presumed that the murder was committed with a razor, which, covered with blood, together with a butcher's steel, was found near the pool of blood in the kitchen. Only two witnesses were examined on Wednesday, and the inquest was adjourned.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206210013.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 787, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3499, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]