[{"id": "b91a3a7b979136cfe4f61019282af8a64085c71e", "text": "A JEWISH WEDDING.\n\nAt Marlborough Street Police Court, Barnett Frankell, a plumber, of Bateman Street, Soho, was summoned before Mr. Hannay by Rose Frankell, as his wife, for deserting and neglecting to maintain her and her children.\n\nBoth parties are foreign Jews. The defendant contended that he was not married to the complainant, but the complainant asserted that though their marriage had never been registered they were husband and wife according to Jewish custom, her brother explaining to the magistrate that to constitute a Jewish marriage it was only necessary for a man, in the presence of ten witnesses, to place a ring upon a woman's finger and utter certain prayers. The presence of a rabbi or priest was quite unnecessary, and a ring was not even essential, a coin or any other similar article handed by the man to the woman, to the accompaniment of the prescribed prayers, being equally good for the purpose of the ceremony.\n\nCharles Shatser, a traveller, of Osborne Place, Whitechapel, informed the magistrate that complainant was married in his house to the defendant according to the Jewish religion.\n\nThe summons was adjourned for further evidence to be given respecting the alleged marriage.\n\nA gentleman, who preferred not to have his name made public, now attended from the Chief Rabbi, and told the magistrate that, according to the Jewish rite, any couple could be married providing there were three persons present.\n\nMr. Hannay: But they are not married according to English law, because the marriage has not been registered.\n\nThe Witness: They are not legally married according to the law of the land. The defendant went before the Chief Rabbi, and he had expressed his willingness to keep the children.\n\nMr. Hannay: I cannot make an order, and the summons will be dismissed, but it seems a great shame that such a defence should have been set up.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200813767.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 420, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1874, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]