[{"id": "4ed9388aaf835864a3f130d20d800c0503cc606a", "text": "TRIAL OF THE ISLINGTON MURDERER.\n\nJohn Lynch, 29, tailor, was indicted on Friday at the Old Bailey, for the wilful murder of his wife, Bridget Lynch. The learned counsel for the prosecution, in opening the case to the jury, described it as being one of a melancholy character, the prisoner, at the age of 29 years, being charged with the wilful and deliberate murder of his wife, a young woman only 24 years of age at the time she met her untimely death. The prisoner was a journeyman tailor, and he was married to the deceased about nine years ago, the deceased, of course, at that time being only 15 years of age. They resided at Russell-street, Brighton, and had four children, but the youngest died in June last, and this event appeared to have very much distressed the deceased; and it would seem that the prisoner entertained some feeling of jealousy towards her. The parties came from London from Brighton, on the 23rd of July, and the deceased, with her three children, went to the house of her uncle, a person named Carmoodie, who resided at 2 Peabody-buildings, Islington. The prisoner went to their house on the 30th of July in a state of intoxication, and threw himself on the bed, when the deceased went into the room with the eldest child, and the child ran out exclaiming, \"Oh, daddy is beating mamma,\" and Mrs. Carmoodie went to fetch a policeman. The deceased was then seen to be crying, and the prisoner went up to her and struck her on the side of the head. A policeman then arrived and went into the bedroom, and Mr. Carmoodie asked the constable to put the prisoner out of the place. In the presence of the constable the prisoner attempted to strike the deceased, but the constable put him out of doors, but as the parties refused to make any charge against him he was allowed to go. He returned shortly afterwards and asked the deceased to go with him. She refused, and said, \"What is the use of my going with you, when you have no home to take me to?\" and the prisoner left. The deceased was then sent away to some person in the Commercial-road, but she returned again to Peabody-buildings to the house of her aunt, and it appeared that as she was going along she met the prisoner in Little Britain, and he struck her in the face and made her mouth bleed. The deceased went again to her aunt's on Sunday, the 5th August, about nine o'clock in the morning, and, about five o'clock in the afternoon, was brought by a child, and the deceased put on her hat and went out with her aunt to the corner of Greenman-street, where they met the prisoner, and all three walked some distance together until they arrived at Marquess-road. Down to this time they were all friendly, and no angry words were spoken. The party went into a public-house, and the prisoner asked the deceased and her aunt to drink, and the three had some lemonade and whisky, the prisoner drinking out of the same glass with the deceased. They went out together, and the deceased asked if it paid, and one was watching them, and replied, \"Only Martin and Paddy,\" two of his brothers. The prisoner whistled, and the two brothers joined them, and they all went back to the same public-house and had some whisky and stout, and remained there for about 20 minutes, and one of the two brothers said he was glad to see the prisoner and his wife together again. They all then went to another public-house, and when they came out they stood talking together a short time, and the two brothers then called a cab. At this moment the deceased turned round to Mrs. Carmoodie and said, Aunt, what do you think? Patsy says Johnny has got a razor.\" Martin jumped out of the cab and said something to the prisoner, and the deceased went up to him and said, \"Johnny, surely you have not got a razor about you, what do you want that for?\" He said nothing; and the deceased said, \"Let me try your pockets; Johnny, I've often tried your pockets; it's no harm,\" and she tried to put her hand towards his breast-coat pocket. The prisoner at this moment drew a razor from his pocket inflicted a fearful gash in her throat, and she fell to the ground, exclaiming, \"Aunt, I am killed,\" which were all the words she could utter before she was a corpse. The prisoner asked if the woman was dead, and he then exclaimed to Mr. Carmoodie, \"You see, Jack, I have had my satisfaction; this will teach you to harbour a man's wife and children.\" When the charge was read to him at the police-station, he said, \"I am guilty.\" Then without returning from the box he asked a verdict of \"Guilty\" of wilful murder, and the learned judge passed sentence of death without holding out to the prisoner the slightest hope of mercy.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206328965.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 1109, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4672, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]