[{"id": "5c43f688256407131b89339a9aaa966a54b64ea1", "text": "CHARGE AGAINST THE POLICE.\n\nAt the Westminster police-court, on Friday, a man of gentlemanly appearance, speaking a very strong German accent, stated that he had been referred by the Commissioner of Police to a magistrate to make the following complaint against a policeman, who had unjustly captured him upon a charge of which he knew nothing, and caused his detention of two hours at a police-station.—Applicant's account was, briefly, that he was talking with a lady at midday at Chelsea in a public thoroughfare, when two policemen came up, and one of them said that he had a warrant against him, and he must accompany him to the station. Applicant expressed his extraordinary surprise, but one of the officers persisted in taking him through the streets to Pimlico station, where he was detained, as he was informed, upon some charge of burglary or something in the country; until the arrival of some detective from somewhere, who said he was not the man who was wanted, and he was then told he was at liberty. He wanted redress for the insult and wrong he had endured, and applied to the Commissioner of Police, who, after some time occupied in investigating the matter, told him that his remedy was before a police magistrate, and he had accordingly waited upon his worship.—Mr. Woolrych said as represented it was a case of great hardship and grievance, but it seemed to him to be the subject of an action for another court—it was a mistake.—Applicant repeated that he had been told his remedy was before a police magistrate. He had suffered a gross injustice and exposure before a lady of his acquaintance and the public in the daytime, and he looked for the redress to which he was entitled.—Mr. Woolrych said he would make some inquiries into the matter if the applicant would come again on Monday.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206239297.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 406, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1809, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]