[{"id": "413961b454a6ad272c4d84cf2c00b54050477250", "text": "\"The Wickedest Little Boy.\"\n\nAt the last sessions held at Newington, Samuel Bean, a boy of ten, was tried and convicted of stealing £140 in bank notes from his mother, Ellen Bean. Charles Palmer, and Mabel Palmer, his wife, who kept a coffee-house, together with Mabel Palmer, their daughter, were found guilty of receiving some of the stolen property. The prisoner Bean, after the theft of the money, had gone to Brighton with another boy named Shires, where he had bought a boat for £7. After a short stay there he returned to London, taking lodgings with the Palmers, for whom he bought a number of presents. Amongst his other exploits was to take Mabel Palmer and one of her sisters to Bournemouth, where he hired a pony-trap by the day, and drove them about the neighbourhood. About £45 of the total amount missing was discovered by Detective Thorley at the Palmers' coffee-house, to which he traced the lad Bean after his return to London. The prisoners were now brought up for sentence. Sir Peter Edlin expressed the opinion that Charles Palmer was not so much to blame, as his wife, and sentenced him to four weeks' imprisonment, to date from last sessions, the result being that he was immediately liberated. The woman Palmer was sentenced to three months' imprisonment with hard labour. Before dealing with the juvenile offenders, a person who represented himself as coming from \"the Charing-cross Children's Aid Society,\" stepped into the witness-box and volunteered the statement that that institution had found a situation for the boy Bean. Sir P. H. Edlin said he was obliged to the gentleman for his information, but requested him to stand down, which he did, whereupon he was followed into the witness-box by Detective Thorley, who stated that the society in question had received £12 from Mrs. Bean on the strength of representations that they were going to find their son a situation. The learned chairman then stated that arrangements had been made with Mr. Wheatley, of the St. Giles's Christian Mission, to find homes for the children, Samuel Bean and Mabel Palmer, with a view to their being put into situations, but sureties would be required in each case. The prisoner Palmer, on his release, entered into the required security for his daughter. The lad Bean was detained until the following day for the attendance of his uncle, who had undertaken to enter into recognisances for him. Addressing the juvenile culprit, the learned chairman said: \"I do not stop at saying that you are the wickedest little boy I have ever seen; you are the wickedest little boy I have ever heard of.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810900.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1062, "total-output-tokens": 582, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2605, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]