[{"id": "18f974b628215a705c39fb6e888117747b0abfd7", "text": "THE MYSTERIOUS MURDER AT CARLTON.\n\nOn Thursday, at the Nottingham assizes, John Watson, twenty-eight, cottager, and Mary Watson, thirty-one, his wife, were charged with the wilful murder of Henry Raynor, at Carlton, on the 17th November last. The prisoners pleaded \"Not guilty.\"\n\nMr. Boden opened the case at great length, and then proceeded to call witnesses.\n\nAnn Raynor, widow of the murdered man, stated that at Lady-day last her husband had a house at Carlton, and on the same day a portion of it was sublet to John Watson. There was a scullery attached to the house, with a copper in it. This copper the Watsons had no right to use. Witness's husband left Carlton to come to live at Nottingham in September last. On the 14th November last her husband left home a little after four to go to Carlton. He had a stick and a mat-basket with him. He had a white felt hat on, which he bought of Mr. Simpson at Nottingham. He had his gold watch and chain with him at the time. He was a light amiable man. When witness and her husband were at Carlton they had many annoyances, from whom she did not know. She mentioned the matter to the prisoners, and set a watchman, and then the annoyances stopped. Her husband was an accountant.\n\nOther witnesses deposed that deceased said he was going to Watson's, and their evidence traced him from step to step in that direction, and one of them saw him going into Watson's yard at a quarter-past five in the afternoon. Shortly before eight o'clock his body was found on the adjoining railway, lying across the metals. There was a train due at eight o'clock, and the previous train had passed at 5.17. One witness had been on the spot where the body was found at seven o'clock, and it was not there then. Mrs. Watson had admitted that deceased was at the house at half-past six. The medical evidence was to the effect that death had been caused by strangulation. Footmarks near the spot were proved to correspond with the male prisoner's boots. Superintendent Palethorpe asked Watson to show him all the boots he had. The prisoner pretended to do so, but another pair was afterwards found. There were several dark spots on the boots last found, and Mr. Palethorpe said, \"What's that?\" Prisoner replied, \"It isn't blood, is it?\" Nothing had been previously said about blood. Mr. Palethorpe examined the prisoner's premises, and found spots of blood on a gate in Cleaver's field, near where the body was found. On examining the field next morning he discovered footmarks, which he covered up, and from Aslin's orchard he found footmarks along the way up to Watson's house. On a tree a bough was broken, and there was the appearance of some one having gone through a gap which was close by. In the field where the gap was the grass was all bent one way, as if something had been dragged down to the railway. There was a heelmark in Smith's field which he compared with one of prisoner's boots, and it corresponded. In another part of the field there was a toemark, which corresponded with the prisoner's other boot. Witness found a lilac dress in prisoner's house very much stained with blood, which Mrs. Watson said had been done when they were making black puddings. Witness produced a white canvas bag which had been taken from the female prisoner, and which was supposed to have belonged to Raynor.\n\nThe inquiry was then adjourned till Friday, when Mrs. Tomlinson, the mother of the female prisoner, was called, and stated that the bag in question was one that she had made long ago for Mrs. Watson. The counsel for the defence held that the prosecution had not sustained the charge against the prisoners. The judge, in summing up, said that the case wasn't involved in great mystery, and the jury must arrive at their verdict, from a consideration of the evidence which had been given. After some time the jury gave in a verdict of \"Not guilty.\" This verdict was received with applause, and thousands of persons waited outside the court to cheer the Watsons as they regained their freedom.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206227120.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 932, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4027, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]