[{"id": "0170fa9288241f72a5ce3f295e9e4804eb157f7f", "text": "SHOWMEN AND THE COUNTY COUNCIL.\n\nAt the Marylebone Police-court, on Thursday, Henry Hall, of Fleet-road, Hampstead, appeared before Mr. Cooke, on an adjourned summons taken out by Mr. William Smallpeice, district surveyor, for putting up five wooden structures or erections of a movable or temporary character without having obtained a licence of the London County Council. Mr. Freke Palmer, solicitor, defended. Mr. Smallpeice, in reply to the magistrate, said the structures consisted of canvas booths, a steam roundabout thirty feet in diameter, with a canvas roof, a shooting-gallery with an iron roof and a wooden front, and a travelling caravan. Most of them were on wheels. They were close to the property of an adjoining owner. Mr. Palmer said his client had nothing to do with the show booth, and Mr. Smallpeice withdrew that. Cross-examined: He supposed it would take a week or a fortnight to get a licence from the County Council. Mr. Palmer produced an official document to show that the vestry received rates on an assessment which included the land in question, let out for the purpose of swings, &c. Mr. Cooke, in giving his decision, observed that he had nothing to do with what the vestry had done. This was a matter for the County Council. The mere question of swings was not before him. He had to decide the question of the erection of a certain building. It was not necessary that a building should consist of bricks and mortar; it might be constructed of wood. Nor was it necessary that it should be fixed to the ground. There were two decisions which bore on this case, that in the case of Quilter and Smart being of considerable importance. The Act 45 Vic., cap. 14, sec. 13, was very clear: \"It shall not be lawful for any person to erect or set up in any place any wooden structure of a movable or temporary character (unless the same be exempt from the operation of the first part of the Metropolitan Building Act, 1885) without a licence in writing first had and obtained from the Board.\" The Act, therefore, included wooden structures and movable erections in any place whatever. The object was quite clear—it was to protect against fire. There were certain exemptions in the Act, but these structures did not come within that category. Of course, a mere polo put up for children to swing round it would not come within the meaning of the Act, but a steam roundabout, with an organ in the centre and a canvas cover over it such as had been described, was certainly a building within the meaning of the Act, for which it would be necessary to get a licence from the County Council. He should fine the defendant a nominal sum of 20s., with 2s. costs. Mr. Cooke added that he did not intend his decision in this case to be a side-wind for doing away with fairs; that could be done in quite a different way.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200807899.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 661, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2831, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]