[{"id": "fb2288e2a81f5eb2f568ef71a6f9956b0e439538", "text": "APPREHENDED ON THE HONEYMOON.\n\nAt the Kingston-on-Thames County Police-court, Lily White, twenty-four, a servant, of White Cross, Hallatrow, Somerset, and Charles W. White, sixteen, her husband, were charged on a warrant with having stolen since the 24th of December a gold-ring, value 20s., the property of Beatrice Mary Fulton, of Surbiton. The female prisoner was further charged with stealing other articles belonging to Mrs. Fulton, and with having obtained by false pretences from Mr. H. H. Judd, of Surbiton, three ladies' undervests, value 11s. 10d. Mr. E. J. Marsh defended. The evidence showed that the female was engaged as general servant by Mrs. Fulton four months ago. While the woman was with Mrs. Fulton several articles of jewellery were missed; and the prisoner denied all knowledge of them. Early in January a young lady visited prosecutrix, and during her stay she lost a ring. A fortnight ago the female prisoner left her employment at the expiration of notice, and the male prisoner took her boxes away. Knowing that the parents of the male prisoner were highly respectable people, Mrs. Fulton warned the boy against the girl, but she had since heard that they had got married. The police were communicated with, and the prisoners were apprehended at Templeclough, where they were spending their honeymoon. The male prisoner denied all knowledge of the ring, but he afterwards stated that he gave 10s. and the ring to Mr. Thomas, jeweller, of Surbiton, in exchange for a wedding ring. He admitted that the female prisoner gave him the ring, but he said he had no idea that it was stolen. Mr. Marsh said the girl had induced the boy to marry her whilst she was in a pregnant condition, and that when the girl stole the things she was not accountable for her actions. The magistrates were of opinion that the lad was led into the affair by the woman, and dismissed the case against him. They sent the female prisoner to gaol for a month without hard labour. The other charges were not proceeded with.\n\nSHOOTING A WIFE AT EARLSWOOD. — On Saturday, at Redhill, before the mayor, a wretched-looking man, named Henry Burchell, of White Bushes Cottages, Earlswood, was charged with shooting at his wife with intent to do her grievous bodily harm. Edward Styles, a platslayer, said he was in his garden, some thirty yards away, when he heard the report of a gun. Mrs. Burchell was at that time outside her house, leaning against the window, and as he approached her she said, \"He has shot me.\" With the assistance of some neighbours witness conveyed the woman indoors, and he afterwards informed the police. Dr. Harle, of Earlswood, said he found the woman had been shot through the thigh. The wound was so serious that her removal from the house would be dangerous. She was in a critical condition. Remanded.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810285.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 677, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2823, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]