[{"id": "f24b7dbb846adea1eb962d7af101edd73d6500c6", "text": "SADLY NEGLECTED CHILDREN.\n\nHENRY HOWE, who called himself a jobbing carpenter and furniture porter, with no fixed abode, was charged at the Westminster Police-court with cruelty and neglect to his three children, aged respectively six, eight, and ten. On the 1st inst. a constable saw the prisoner begging at public-houses with three wretchedly-clad little girls, and heard him use very bad language to them. The children were in a fearfully neglected state, and after prisoner was arrested inquiries were made, which resulted in the present prosecution. It was given in evidence that in February last the family occupied an underground stone floor kitchen in Kennington-lane, and that from there the mother of the girls (prisoner's wife) was removed to the workhouse infirmary, dying from consumption. Agnes Thompson, wife of a gas works foreman, deposed that she was a lodger in the same house, and that both before and after the removal of the mother the children were half-starved and filthy. Witness had heard the poor woman groaning and the children crying, but she could only help them to a limited extent. She had given the little girls food, and had known them make their way to the top of the house to beg for bread. One night, after the mother's death, witness went for a policeman, as the children were huddled together on the stones without fire, light, food, covering, or furniture. The only thing in the room was a tin pail. There were four panes of glass out of the windows, and it was freezing hard and snowing heavily. Prisoner's practice was to come home drunk between twelve and one in the morning. He went out about ten in the day, and did not trouble about the children at all. Police-constable 122 L. fully corroborated the foregoing evidence as to the condition of the children and room. He found the little girls clothed only in rags, and took them to the workhouse. The very day after the children had been cleansed and looked after in the workhouse the prisoner took them out, though he had no home or habitation, and that from that time forth and till lately he had been with his family in and out of various workhouses, sending the little ones out to beg in the daytime and taking the money they obtained. Three months' hard labour. The children were taken care of by an official from the Flower Girls' Mission.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810305.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 547, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2340, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]