[{"id": "7c9bfac782cd2977376507745c609f79dd6e545d", "text": "THE MURDER AT PORTSEA.\n\nOn Monday, John Hughes was indicted before Mr. Justice Keating for the wilful murder of Maria Clements, at Portsea, on the 4th of June.\n\nIt appeared from the evidence that the prisoner was a private soldier in the 26th regiment of foot, quartered at Cambridge barracks, at Portsea. The deceased woman, Maria Clements, was the wife of Charles Clements, a stoker belonging to the Diadem, lying in the harbour, and he was frequently detained on board the ship. On Sunday, the 4th of June, in the afternoon, the prisoner and two of his comrades, Parker and O'Neil, left the barracks and went to the Queen's Head public-house, which was near Montague-street. Mrs. Clements came into the public house, accompanied by her two children. She ordered a pint of beer, and then sat down in a chair by the prisoner, with whom she got into conversation about Ireland. The prisoner took her eldest child on his knee. After Mrs. Clements had drunk her pint of beer, she ordered two quarts of beer for the soldiers, and they all partook of it. The time arrived for the soldiers to return to barracks, and Parker tried to persuade the prisoner to go with him to the barracks, but he said he should stay out with the woman. All the party then went to the bar and had some beer. The prisoner endeavoured to induce Mrs. Clements to go home. He took one of the children in his arms, and led the other to the door of Clement's house. He put the children down on the step of the door, and returned to the public-house and again begged the woman to come home. The landlady said, \"What have you to do with the woman?\" She is a married woman.\" The prisoner said, \"She is a 'toxy' (of the same town) of mine, and I want to see her safe home.\" He then went and fetched the children back again to the public-house, and eventually the prisoner and the woman and her children went to Clement's house. She tried to open the door, but could not, and she went to the house of one Davis and asked him to come and open the door for her. The prisoner, however, followed her, and said that he had opened the door, and then the prisoner, Mrs. Clements, and the children, went into the house and shut the door. This was about half-past nine o'clock. The next morning, about six o'clock, the deceased's eldest child, about five years of age, was heard crying outside the door, \"Oh, my mother, my poor mother!\" She was quite naked. Mrs. Harris, a neighbour, went into the house, and found Mrs. Clements lying on her back on the floor with her clothes up round her waist, quite dead, cold, and stiff. She was without shoes or stockings. Upon examining the body there were five distinct marks of teeth on her face and neck. The death of the woman, in the opinion of the surgeon, was caused by one of these bites, which took effect upon the windpipe, producing suffocation. The prisoner was not in barracks all that night, and did not return there till twenty minutes before seven the next morning. Inquiries were made. The husband of the deceased had been on board the ship all night. The prisoner was taken into custody, and in his pockets two stockings were found, which Clements at first said had belonged to his wife; he knew them because she had a very short foot, and was in the habit when she bought stockings of cutting off part of the feet; but upon further examination he found they were not hers. When before the magistrate the prisoner said he had left the woman at the door of her house, had then gone to another public-house, and then to another house, where he remained all night, and did not return to barracks until after six in the morning.\n\nFor the defence a woman called \"Loo\" stated that the prisoner came to her about twelve o'clock that night, and remained with her till six o'clock the next morning. The stockings found upon the prisoner were hers.\n\nThe jury retired for a short time, and then returned a verdict of \"Guilty.\" Sentence of death was passed upon the prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222959.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 932, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3976, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]