[{"id": "bd46c490d13e5bc902a8610ed94fdba9a4f8d2de", "text": "ACTION AGAINST A COMEDIAN.\n\nAt the Southwark County Court, on Monday morning, before his Honour Judge Holroyd, the case of Didcott v. Macdermott was heard. Mr. Armstrong, solicitor, appeared for the plaintiff, who, he said, was a musical and dramatic agent. Defendant was a comedian and vocalist, and was also an agent, and the action was brought against him to recover the sum of £35 11s. S.l., being commission due upon engagements procured for him by the plaintiff. The first item was commission at five per cent. upon Mr. Macdermott's engagement at the London Pavilion at £20 per week, on which engagement there were twenty-three weeks' commission due up to July 29th. Then there was commission at five per cent. upon Mr. Macdermott's engagements at the Cambridge Music Hall at £15 per week, and at Collins's at £12 12s. per week; upon two engagements at Edinburgh and Newcastle at £30 per week; and at the Star, in Dublin, at £40 per week. Mr. R. Andrews, the plaintiff's clerk, was called to prove the claim, and produced the contracts in respect of which the action was brought. The defendant said he was quite prepared to pay the plaintiff £24 1s. 8d., and had brought a cheque with him for that sum. He said he objected to pay commission upon all re-engagements. Not only was that unusual, but— His Honour: I never saw an engagement upon which there was not commission payable upon re-engagements. Mr. Armstrong: Mr. Didcott made this man. He was nobody before Mr. Didcott took him up. The Defendant (excitedly): I was Macdermott before Mr. Didcott ever came into the business. Mr. Armstrong: You are an agent yourself? Defendant: No, I am not an agent. Mr. Armstrong: What does \"Macdermott's Universal Dramatic and Musical Agency\" mean, then? Defendant: That is my brother, Edward Macdermott. Mr. Armstrong: Don't you know that the usual commission is ten per cent.? Defendant: Not with a man of my reputation. Big turns like myself pay five per cent. His honour remarked that where a man put his hand to a certain document, and that document was brought into court, he could not go away from it. He gave judgment for the plaintiff for the amount claimed. The defendant offered to hand over his cheque for £24 1s. 8d. Mr. Armstrong: We would rather not take his cheque, sir. Defendant (excitedly): He has borrowed money of me and my family. I have been brought here to be insulted. Mr. Didcott: He has said he is not an agent. I shall be able to prove right up to the hilt that he is an agent. The parties then left the court.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200808393.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 656, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2536, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]