[{"id": "5130071503a70afcc4187e88d168c8383286f5c4", "text": "TRIALS AT THE MIDDLESEX SESSIONS.\n\nA COURAGEOUS POLICEMAN.—Benjamin Watson, 38, was indicted for breaking and entering a warehouse and stealing a bundle containing two gimlets and other articles, the property of John Carruthers. The prisoner was found \"Guilty,\" and sentenced to four months' imprisonment with hard labour, and Police-constable Cobb, 263 T, was highly commended, and received a reward of £1. for his courageous conduct in the apprehension of the prisoner, with whom he struggled for a considerable time.\n\nCHARGE OF EMBEZZLEMENT FROM A CLUB.—Robert Cox surrendered to his bail to answer an indictment charging him with having embezzled 2s. 6d., 2s., and 9d., received by him for his employer, Ernest Preston. In another indictment he was charged with having stolen four nails and 53 envelopes, the property of Ernest Preston. The prosecutor is the proprietor of the Regency club, Saville-row, and the prisoner had been employed for some months as head waiter, at a salary of 5l. a month, with board. It was alleged that he had kept back part of his takings. Mr. Purcell called witnesses, who gave the prisoner an excellent character. The jury \"Acquitted\" the prisoner.\n\nMURDEROUS ASSAULT WITH A CROWBAR.—John Bayliss surrendered in discharge of his bail to answer an indictment charging him with maliciously wounding John Levi. It appeared that an altercation occurred between the parties previous to this assault, during which the prosecutor pulled the prisoner's nose. Subsequent to this another disturbance took place, in the course of which the prisoner dragged the prosecutor into his own shop, and then struck him over the head and shoulders with a crowbar, inflicting very serious wounds. Witnesses were called on behalf of the prisoner, whom it was stated had been 21 years in the neighbourhood and bore an excellent character. After considerable deliberation, the jury found the prisoner \"Guilty of occasioning actual bodily harm,\" but recommended him to mercy on the ground that he had received great provocation. The Assistant-judge sentenced the prisoner to four months' imprisonment with hard labour, ordering him in addition to pay the costs of the prosecution, to enter into his own recognisances in the sum of 100l., and to find one surety in 100l. to keep the peace and be of good behaviour for two years.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206247284.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 554, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2337, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]