[{"id": "0c777ce5ce7e15415f2fc9802acdab439f6fc041", "text": "BREACH OF PROMISE BY A MARRIED MAN.\n\nAt the London Sheriff's Court, on Friday, before Mr. Under-Sheriff Burohell and a jury, the case of \"Ridge v. Tasker,\" an action for breach of promise of marriage, remitted from the High Court, was held for the assessment of damages. The plaintiff was Miss Mary Ridge, otherwise Costin, a single woman, of 8, Leighton-road, Kentish Town, and the defendant, who is a builder's manager, resides at 107, Crompton-road, Penge. Mr. F. T. Duke, for the plaintiff, characterised the case as one of the most heartless heard in a court of justice. The parties met in 1889, and a promise of marriage was accepted, but unfortunately the defendant was a married man. In 1892, after a courtship of some years, the defendant actually obtained the consent of plaintiff's mother and father to the marriage, and said that he would put up the banns. A number of letters, all of an affectionate description, passed between the parties until in October of last year came a letter in which the defendant said that it was only too true that for the last three years he had been married. \"You may not believe it,\" the letter ran, \"but it is true... I have behaved in the cruelest possible manner to you. I have struggled year by year to be close to you, but then the address you wrote to me was not my own. I have done you a life-long injury, but not criminally, thank God.\" Under such cruel circumstances the learned counsel asked for substantial damages. The plaintiff, a young, prepossessing lady, corroborated the opening of counsel. She was a dressmaker in the employ of a Court milliner, and at the time of the engagement was twenty-one years of age. Defendant passed as a single man, and in 1892 bought a wedding ring. When expecting to hear of the banns being published she heard that he was a married man. During the courtship plaintiff had on more than one occasion given up her business in order to marry the defendant, but he had always put off the wedding. He had given her many presents. The defendant had met her on Monday, Tuesday, and Thursday evenings, and spent all Sunday with her. On one occasion the defendant told her that his father allowed him an income of £300 a-year. The learned under-sheriff having said that the case was a very cruel one, the jury assessed the damages at £200.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200812379.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 582, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2321, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]