[{"id": "af78ac370451e3e227dd206c0f92a873bb772f3d", "text": "ADVENTURE WITH A BURGLAR AT PIMLICO.\n\n[SUBJECT OF ILLUSTRATION.]\n\nAt the Westminster Police-court, on Monday, John Knott, twenty-nine, described on the sheet as a boot-maker, having no fixed abode, was charged with burglariously breaking and entering No. 35, Belgrave-square; the residence of Lieutenant-Colonel Arthur Paget, Scots Guards. Inspector Porter, B Division, watched the case for the Commissioners of Police. Colonel Paget said that he came home from his club about two o'clock on Sunday morning, and let himself in at the front door. As he proceeded upstairs to his own room he had to pass his wife's bedroom, and he noticed with some surprise that the door was wide open. He walked in the room with a candle in his hand, and saw that his wife was asleep, and that her jewels were on the dressing-table. As he turned to leave a man rushed from behind the door and bolted down the staircase. Witness followed him, and finding that he could not overtake the intruder, jumped over the balustrade and fell on him, extinguishing his candle as he did so. They had a desperate struggle together in the dark, and the prisoner, who got underneath, twice threatened to shoot him. Eventually prisoner managed to get away, and rushed into the drawing-rooms. Witness thought he had him safe there, and roused his servants before turning on the electric light. They then proceeded to search the drawing-room, and discovered that the burglar had escaped from a window in the back apartment. A little time elapsed before the police, into whose hands he had fallen, brought him back. In reply to the magistrate, Colonel Paget said he positively identified the prisoner and also recognised him by his voice. Bessie Palmer, housemaid, proved that the back drawing-room window was closed on Saturday evening. She could not say that the window was securely fastened. Constable Holder, 381 B, said that at twenty minutes past two o'clock he was with another policeman in Upper Belgrave-street. They noticed the prisoner drop from the roof of some stables; and over the rails into the street. They immediately gave chase as he ran off. Prisoner turned into Eaton-place, where he was confronted, after a run of 300 yards, by two more policemen. He at once doubled back, and, meeting witness, butted him with his head in the stomach. Constable 223 B laid hold of him. In reply to the question what he was doing on the stable roof, he said, \"I have not been on a roof.\" Subsequently Colonel Paget came along and identified the prisoner. Inspector Porter, B Division, explained the manner in which the prisoner had obtained an entrance to Colonel Paget's house. The man had gone along the roofs of stables for a distance of about seventy yards and then climbed on to leads which enabled him to reach the back drawing-room window. The escape was made in the same way. Witness found footmarks on the outhouses, a chair placed in position by the window, and tallow grease on the sill. Prisoner had on him wax matches and a number of keys, one of them that of a safe. There were red marks on his wrists—indications of the struggle. He gave no account of himself, except that he had lived at a lodging-house in Blackfriars-road. Mr. De Rutzen remanded the prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810602.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 757, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3245, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]