[{"id": "ea8203439078dd8a61c9a84cdcceaa021b122e1d", "text": "HORRIBLE MURDER AT PENDLETON.\n\nThe body of a young woman was found in the Bolton and Manchester canal at Pendleton on Monday night, and a post-mortem examination of the body, which has since been made, seems to show that a brutal murder has been committed, preceded by outrage of an extremely atrocious nature. At an inquest opened at the King's Arms inn, Eccles, on Tuesday evening, the body was identified by two women, who had known deceased, as that of Kate Macdonald, a young woman who was employed in the throstle department of Sir E. Armitage's mill at Pendleton about last Christmas. Her mother was for several years housekeeper to Thomas Rudman, at Baoup. The body was seen floating in the canal near Strawberry-road bridge, Pendleton, on Monday night by Mrs. Sarah Broughton, of Pendleton. On Tuesday Mr. Davis, surgeon, made a post-mortem examination of the body. Externally there were two cuts on the face, one very deep; the upper part of one thigh was contused; and there was much effusion of blood beneath the skin about the lower part of the abdomen. Both arms were fractured, one in two places; the right collar-bone was dislocated; and five or six of the upper ribs on both sides were broken, fragments of which penetrated the lungs and large vessels. The internal and external injuries in the region of the abdomen were of a shocking character, and indicated the brutal nature of the treatment to which the poor creature had been subjected before death. The surgeon was of opinion that the deceased was killed before being put into the water, from the fact that there was no water in the stomach, nor was the brain congealed. There was a considerable effusion of blood under the scalp on each side, but the brain was not injured. From appearances he thought the deceased could not have led a very immoral life. The police being unable to discover where or how the deceased had lived since about Christmas last, the inquest was adjourned to the 20th inst.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206232856.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1292, "total-output-tokens": 466, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1973, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]