[{"id": "0dfd48f6a33ad4ee6d65ebe1f5862fbf072c74e7", "text": "ALLEGED MURDER AT SALFORD.\n\nOn Thursday an inquest was held at Salford respecting the death of James Burns, a mason, aged 30, who died on Tuesday morning under circumstances tending very much to prove that he has been the victim of a murderous outrage. Recently the deceased had been employed, along with other masons—non-unionists—in the erection of a gas-tank in Liverpool street, Salford, and was frequently threatened and molested in going to and from his work. On Monday afternoon Burns was in a publichouse in Regent-road, and was seen in conversation with some men—a mason, it would appear, from the description given. There were three men, and Burns, seemingly wishful to leave them, was observed to walk rapidly from the house. He was followed, overtaken, and in broad daylight, in the presence of a crowd of spectators, was knocked down, kicked, and finally killed by one of his assailants, more brutal than the remainder, taking hold of the poor fellow's hair and literally smashing his head upon the flags. No one, with the exception of a female, interfered, although a soldier is stated to have been an unconcerned spectator throughout.\n\nHaving left Burns in a state of insensibility, and bathed in blood, the men walked quietly away, and so far have not been heard of. Burns remained insensible in the Salford dispensary up to the time of his death. At the inquest his wife told a long and pitiful tale of the persecution and fear under which her husband, who had at one time been a unionist, had laboured since he commenced to work during the present bricklayers and masons' strike in Manchester. A policeman had told her husband that he had been asked to keep out of the way whilst some of the union men gave him a good hiding. Deceased had also told her that a man had come to him whilst at work, and informed him that the society had paid men to disable him the first opportunity that night. The inquest was adjourned for a week. A large number of the spectators of the outrage have been summoned by the police to attend the proceedings.\n\nA PRECIOUS RASCAL.—On Thursday, at Hartlepool, a man named Fowler, who earned some notoriety last June, by eloping with the wife of another mechanic, leaving his own wife and children as a legacy to the parish authorities, was charged with assaulting his wife. The evidence went to show that the fellow had only been released from Durham gaol (where he had been sent for three months for deserting his family) on Wednesday, and that his wife, actuated by a spirit of forgiveness, went there by rail to meet him, and paid his fare home to West Hartlepool. Scarcely had he arrived there before he left the house to renew his connection with his former paramour, to whose residence he was followed by his wife, and on her arrival he assaulted her. The affair was ultimately settled by the defendant promising to allow his wife 9s. per week, the case being withdrawn.\n\nA FARMER IMPRISONED FOR CRUELTY TO HIS HORSES.—On Thursday Mr. John Ginger, of Boxted farm, Hemel Hempstead, was charged before the magistrates at Great Berkhamstead with unlawfully causing three horses, his property, to be tortured. The horses were discovered at plough with old bad wounds on their shoulders, in a state of great suffering and utterly unfit for work. The magistrate sentenced Mr. Ginger to three months' hard labour; Robert Sharp, Mr. Ginger's foreman, was sentenced to be imprisoned for six weeks, and the ploughmen who were with the horses were fined 1s. each, including costs. It should be stated that Mr. Ginger and his foreman had been previously convicted and fined for a similar offence.\n\nTHE FACTORY ACT.—On Thursday William Spearing appeared at Bow-street police-court to three summonses, charging him with employing apprentices after the prohibited hour, thereby infringing the statute.—James Henderson, inspector of factories, deposed that on Friday, 17th September, he visited Messrs. Taylor and Spearing's printing-office in Holborn, at half-past nine o'clock. Three young persons, James Clements, William Duthorl, and George Cressy, were working there.—James Clements was called, and alleged that his master wanted a particular job done that evening. The boys had been playing, or the job would have been finished.—Mr. Vaughan fined the defendant 20s. and costs in each of the three summonses.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206233243.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1001, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4347, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]