[{"id": "ee98ef959d50043d46560bdee4ad2ff9e75cc184", "text": "A PAUPER TURNED DETECTIVE.\n\nWILLIAM SMITH and William Power, until recently pauper inmates of the Holborn Union Workhouse at Mitcham, were charged, at the Croydon Petty Sessions, on Saturday, on remand with being concerned together in stealing from that place a quantity of clothing and 5s. 2d., the property of Frank Bilcliffe, one of the labour masters. During the latter part of October Bilcliffe's quarters were entered by thieves, who completely ransacked his bedroom and stole the articles mentioned in the charge. From what afterwards came to the knowledge of the master, Mr. Simmonds, he instructed a pauper named Wyatt to get into conversation with the prisoners, the result being that the trio arranged to meet in Ham-yard, Great Windmill-street, London. The appointment was kept, and the prisoners then informed Wyatt that they committed the robbery at the workhouse, and had hidden the plunder on a tank over a closet in No. 3 block, adding that they were going to fetch it away at six o'clock that evening. After arranging to meet Wyatt on their return journey at the Elephant and Castle, they started for Mitcham, and Wyatt at once sent a telegram to the master telling him that the men were coming. Mr. Simmonds then procured the assistance of Detective Boswell, and after waiting for some time in the grounds their patience was rewarded by seeing Smith and Power drop over the wall. It was proved that prisoners had been previously convicted, and in committing them for trial Sir Thomas Edridge (chairman) warmly complimented Mr. Simmonds, the workhouse master, on the way in which he had conducted the matter on behalf of the guardians.\n\nGROSS CRUELTY TO A CHILD.—At the Wandsworth Police-court James Toomey, a labourer, living in Mont-street, Battersea, was charged with brutally ill-treating his son aged six years. Detective Gilby said in consequence of the receipt of an anonymous communication he visited the prisoner's house and found the boy in bed, his face being tied up with a piece of rag. Witness removed the rag and asked what was the matter with him. He replied, \"Father has been kicking me.\" He told the prisoner that he should take him into custody for ill-treating his son, and he replied, \"I am very sorry; I got drunk and assaulted him because he broke a plate.\" A little girl who lived in the same house proved having seen the prisoner knock the boy's head against the bedroom door and kick him in the back. Another witness stated that she heard the little boy cry out piteously, \"Oh, daddy, don't kick me so!\" Mr. G. F. Borrows said he was called to examine the child, and found him suffering from a fractured jaw and other injuries of recent infliction. The body was much discoloured from bruises, and there was a wound under the chin, where he had, no doubt, been kicked. The boy was too severely injured to attend the court. Mr. Phillips mentioned that the boy had been subjected to this brutality for a long time past. Mr. Lushington committed the prisoner for trial.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200809847.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 689, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3009, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]