[{"id": "f74ed629032a98447d454849ae271ccde7dcc6f9", "text": "MURDER AND INTENDED SUICIDE.\n\nYesterday, (Saturday), at an inquest held by Mr. Baker, the coroner, at the Victory, Kingsland-road, Shoreditch, information was communicated to him by Mr. Meadows, the summoning officer of the parish, of the following extraordinary case of child murder, in the Regent's canal, Haggerston, by the unfortunate mother, and of the attempted suicide of the latter, who is at present lying in Shoreditch workhouse, where she was removed after having been prevented effecting her self-destruction. It appears that on Tuesday morning last, about eleven o'clock, as some men were passing down Great Cambridge-street, Haggerston, near the bridge which traverses the Queen's-road, they observed a female who was holding a bundle in her hand, plunge into the canal. Several of them went to her assistance, and succeeded in bringing her to the towing-path. While they were so engaged, an infant was observed to be struggling in the water, and which had escaped out of a handkerchief in which it was subsequently ascertained it had been wrapped up. The poor baby soon sunk. Some persons, who were in a state of astonishment at the extraordinary scene, tried to rescue it, but without success. Mr. Meadows, who was in the neighbourhood, upon hearing of the case, obtained the drags, and with the assistance of some policemen attempted to find the body, but in which they were unsuccessful; and it has not been yet discovered. The mother was taken to the Acorn public-house, Great Cambridge-street, where the unfortunate woman was put to bed, and instantly attended to by the landlady, Mrs. Glass. Mr. Hooper, surgeon, Queen's-road, and Mr. Lloyd, surgeon, Mansfield-street, also afforded every necessary assistance. The next day she was removed to Shoreditch workhouse, and has been attended to by Mr. Clarke, the house-surgeon. She still remains there in a very precarious state. The name of the unfortunate mother is Mary Ann Capron, and she resided at No. 7, James-street, Coal Harbour-lane, Hackney-road. She is a single woman, about twenty-five years of age, and very respectably connected. She was delivered about five o'clock on Tuesday morning unknown to her parent, who charged her with having been enceinte, and who suspected that her delivery had taken place, which she denied. She left her home unknown to them, having folded her infant up in a blue handkerchief. In her passage to the canal, which is but a short distance from her residence, several persons saw her, who remarked that she was in a state of great excitement, and occasionally spots of blood were along her path. Mr. Meadows is in possession of the handkerchief.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206304270.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 622, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2656, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]