[{"id": "44dadf7cd407543ab75272bf3e068d21322ec3f8", "text": "STRANGE CASE OF CHILD MURDER.\n\nAt the Leeds town-hall, a young woman named Selina Hollings, domestic servant, was charged with concealing the birth of her infant child. The prisoner, who has been previously convicted of a similar offence, was on Friday, the 21st instant, committed for trial at the assizes, under the coroner's warrant, for the wilful murder of her infant. She had been living in the service of the Rev. Jabez Tunnicliffe, who is the officiating minister at the Burmantofts cemetery, Leeds, but left suddenly on Sunday night week, and went to reside with Mrs. Waite, of Napier-street, Burmantofts, who is the married daughter of Mr. Tunnicliffe. Mrs. Waite did not at the time perceive that the girl was in the family way, but Hollings began to be ill shortly after her arrival, and on the Tuesday night following told Mrs. Waite that she was enceinte, and that Mr. W. H. Tunnicliffe (Mrs. Waite's brother) was the father of the infant which she was expecting. Hollings also further stated that she anticipated being confined the same night, and on Mrs. Waite asking her how she would manage, the prisoner replied, \"I'll manage; I have managed before.\" Mrs. Waite then went to bed, but got up during the night, and returned to the kitchen, where she found the prisoner. Upon her entering, Hollings said, \"I'm glad it is over,\" and pointed to the top of the set-pot, where she observed the body of the child in a towel. Next (Wednesday) morning, W. H. Tunnicliffe went to the house, ascertained that Selina had been delivered, that the child was dead, and thereupon persuaded his sister (Mrs. Waite) to take it up to the cemetery, where he placed the body in a box out of the toolhouse, and interred it, with the assistance of a gravedigger named Joy. It was from the latter \"splitting\" about the transaction that the whole facts came out, and the body was subsequently disinterred and submitted to Mr. Sam Smith, surgeon, who came to the conclusion, from his post-mortem examination, that the child had been born alive, but had not had a vigorous existence, its breathing not having been full. Hereupon the girl Hollings was taken into custody, and committed for trial by the coroner for wilful murder, on the ground that no preparation of clothes or linen had been made; that the prisoner had declined the assistance of another female and a medical man, and intentionally that she had consequently intended to, and had made away with, the life of the infant. Before the magistrates, only sufficient evidence was taken to justify a remand of Selina Hollings, but the court was so satisfied the concealment was premeditated that warrants were issued for the apprehension of W. H. Tunnicliffe and Mrs. Waite, on the ground that they had been aiders and abettors in the concealment. The brother and sister have both been apprehended, and though bail was offered on behalf of Mrs. Waite the mayor declined to admit her to it.—Manchester Examiner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206222380.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 724, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2959, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]