[{"id": "6b4c1a13586d366b9ccf0c6fbc8105ffbf155ac7", "text": "At the Westminster police-court on Wednesday, John William Cattermole, described as of no occupation and residing at 23, Pepys-road, New-cross, was charged on remand with feloniously causing Mary Cecil Siddon to take a noxious drug for an unlawful purpose.\n\nFrom the evidence given at the former hearing it appeared that the father of the girl went to India with his wife in 1869, and in 1873 he returned to London to make arrangements for the education of his two daughters. Eventually the two young ladies came over to England and lived with an aunt of theirs, Miss Annie Siddon, and prisoner and complainant became very intimate, and in consequence he administered to her a noxious drug. The desired effect, however, was not obtained, and on the 7th of May of the present year a child was born.\n\nMiss Mary Cecil Siddon, cross-examined by Mr. Grain, said: Her parents were English. She was now 17, and her sister Jessie, who came over with her, was now 20. She became acquainted with the prisoner almost immediately after her arrival, she had never walked alone with any other man than the prisoner. She knew a young gentleman (whose name was not mentioned), and he used to go to the same school as witness; he would sometimes walk from school with her sister and herself. He had kissed her on the road on one occasion. After he had kissed her she did not walk again with the young gentleman. No man besides the prisoner and the person referred to had kissed her; and no one besides the prisoner had ever taken improper liberties with her. She met the defendant by appointment at various places; and she wrote many letters to the prisoner making appointments. She did not tell her aunt of these appointments. Occasionally she met him when she was supposed to be at school. Before July last year the prisoner told her that he would marry her. Whilst living with her aunt no medical man was called in when witness was unwell, but her aunt gave her some pills, but she gave none to her sister. On the 1st of December, when her father came back to her aunt's house, she did not go down on her knees to him. About a fortnight before that her aunt told her that she would not tell her father what had happened. Witness was not present when her aunt told her father, but after he was told they all went to breakfast. Her mother came to her room and found witness in tears asked what was the matter, and then she referred her to her aunt. The father of her child was the prisoner. On Christmas-day she saw the prisoner at her aunt's house, and she was called into the sitting-room, and was asked by her father whether she wished to marry the prisoner or whether she would go back to India with her parents. Her father and mother did not wish her to marry the prisoner, but she believed they would not have thwarted her in her wishes if she desired to marry him. Witness, her mother, and her aunt were in such a state of mind that on the 21st or 22nd of December they went on their knees. The prisoner had spoken to her about marriage before that. The prisoner gave her a box containing 12 small pills, and she took them at once, all in his presence. Her aunt was at home at the time. About an hour or two after she took them she was very ill. A few days before taking the pills the prisoner had given her some liquid, which he brought in a bottle. The prisoner gave her pills on two occasions. Her intercourse with the defendant lasted until nearly Christmas. She had written many letters in affectionate terms to the prisoner, and in one of them she signed herself \"Your loving wife.\" She was at one time anxious to marry the prisoner. She asked him why he had never written to her, and his reply was: \"You have no proof of me or photograph, and if I like I can go away to the Cape, and no one would ever think anything about it that I have had anything to do with you.\"\n\nRe-examined by Mr. Williams: The last liquid the prisoner gave her had a bitter taste. Her aunt told her on one occasion that if she could get the marriage done before her father came it would be better for every one.\n\nThe sister, Miss Jessie Siddon, stated that she was informed by her sister that Cattermole had given her pills on September 8th, but, despite this fact, witness was not aware of her sister's condition till December. She had also seen her aunt give pills to Mary, ascribing her ailments to biliousness.\n\nAt this stage of the proceedings the prisoner was again remanded, without bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206245353.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 648, "total-output-tokens": 1013, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4468, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]