[{"id": "58d93b3a1d0d0072312e973883e5e99369c7d10e", "text": "EXTRAORDINARY CASE.\n\nThe case of \"Fiske v. Sutthery\" was tried at Guildford assizes on Thursday. It was an action to recover the sum of £22l. odd for the board and lodging of a lunatic gentleman, to which the defendant pleaded that the amount claimed had been paid by him to the plaintiff, and that she had no claim upon him.—The plaintiff was the widow of a medical man and it appeared that in June, 1878, being in rather impoverished circumstances, she, by the advice of her friends, took a house in Richmond for the reception of lodgers. The defendant was a gentleman possessed of considerable property, who was addicted to drinking to excess, and in the year 1878 he was found to be a lunatic, and was placed under the charge of the Court of Chancery, and a committee of his relations was appointed to take care of him. In the course of the year 1879 the defendant, with the consent of the Court of Chancery, resided in the house of the plaintiff as a patient, and four guineas a-week were to be allowed as remuneration for performing this duty. The defendant eventually recovered, and the case for the plaintiff was that he then refused to pay the balance that was due to her, and in the result the present action was brought to recover the amount.—At the close of the plaintiff's case, Mr. Willis called the defendant, and said that he did so in obedience to his instructions, and he would state that he had really paid the plaintiff all that she was entitled to.—Mr. George Sutthery, the defendant, was then lifted into the witness-box. He presented a most pitiable spectacle, being unable to walk, and was only able to crawl along on his knees. He said he had no recollection of dates, and all he could say was that he had given the plaintiff all the money he received from his friends to pay for his maintenance.—Mr. Watkin Williams declined to address the jury in reply, and the learned judge having briefly addressed the jury, they at once returned a verdict for the plaintiff for the amount claimed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206247554.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 485, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2011, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]