[{"id": "2e7ec15261bf0ff9d7fb38dad766d83559850b76", "text": "THE SIN OF CHRISTMAS BOXES.\n\nIn the City of London Court on Monday, an action was brought by Reuben Muggeridge, errand boy, against Mr. E. Stockdale, printer, Great Winchester-street, to recover wages due.—In the course of the case it transpired that the defendant had stopped 2s. out of the lad's Christmas-box, whereupon the learned Commissioner inquired the reason.—The Defendant: Because he made mistakes. One of the mistakes cost me 2l. 8s.—His Honour: But I fail to see what right you had to stop 2s. out of the boy's Christmas-box.—The Defendant: Well, it was not taken from his wages. The Christmas-box money came from me.—The Plaintiff: You said I was to ask the customers.—His Honour: These Christmas-boxes are a great piece of imposition. I want to know what right you had to deduct 2s., because it is very absurd to give a boy 5s., and keep back 2s. From whom did he get the money?—The Defendant: From various customers.—His Honour: That is a vile system. But what business had you to stop any portion of these gifts from customers?—The Defendant: Well, I submit to that.—His Honour: You had better (laughter). You complain of insubordination. What was it?—The Defendant: He refused to get something for the men.—The Plaintiff's Mother: The boy was kept working till 11 o'clock at night without food.—His Honour (to the defendant): Tell me what was the nature of the insubordination. Recent experience shows that when a woman opens her mouth in a court of law she goes on for a week (laughter).—The Defendant: He burnt candles by deliberately throwing them into the fire.—The Plaintiff: I burnt not one.—His Honour: I am afraid this is all rubbish. Pay the boy his wages and behave differently in future. Instead of deducting money from Christmas-boxes, you would confer a boon on society by stopping them altogether, because they only encourage drinking.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206258781.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 469, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1867, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]