[{"id": "db89c926e13371bfa5d09ec4c32025dae27a7c58", "text": "THE REMARKABLE BLACKMAILING CASE.\n\nTEN YEARS' PENAL SERVITUDE.\n\n[SUBJECT OF ILLUSTRATION.]\n\nAt the Central Criminal Court, before the Common Serjeant, Sir Forrest Fulton, Q.C., the trial of Joseph Kopelwitz, twenty-six, and Maria Kopelwitz, his wife, Russian Jews, who were indicted for having administered a stupefying drug to Abraham Isaac Friedman, a Polish Jew, military outfitter, carrying on business in Spitalfields, with intent to enable them to rob him, and with having administered the said drug to compel and induce Friedman to execute a valuable security, was continued and concluded.\n\nThere were other indictments charging the prisoners with having stolen a scarf pin and the sum of £2; with having forged a promissory note for the sum of £150; and for having demanded that sum of money from Friedman. The case occupied the attention of the court for four days, a great number of witnesses having been called on either side, and their testimony having been of a very conflicting character. The allegations made by the prosecution were that there was a plot between the prisoners to induce the prosecutor to go to a house in the Netherwood-road, Addison-road, where they drugged him, partially stripped him, and placed him in a bedroom in a compromising situation with the woman, and subsequently, by charging him with immorality and threatening him, compelled him to sign a paper, which they afterwards produced in the form of a promissory note, for £150, which money was demanded of Friedman. For the defence of the male prisoner witnesses were called who swore that Friedman duly executed the promissory note in satisfaction of certain advances of money, which Kopelwitz made to him, and that he had actually been carrying on an immoral intrigue with Mrs. Kopelwitz. The Common Serjeant, in summing-up the case to the jury, said the charge against the prisoners was one of the gravest known to the law. As regarded the woman, it had been laid down by the Master of the Rolls, in a case singularly analogous to the present one, that if it was proved that the wife acted in the matter independently of her husband, she could not shield herself behind the presumption of the law that she was acting under the coercion of her husband. The jury found both prisoners guilty, but recommended the female prisoner to mercy on the ground that she acted, in great measure, under the influence of her husband. The Common Serjeant: I think it right in this case to ask you, though it does not directly arise by your verdict, whether you think there is no foundation whatever for the gross charges made against Friedman? The Foreman: That is our opinion. The Common Serjeant, in passing sentence, said the prisoners had been found guilty of a most terrible crime, viz., that of beguiling a man to their house through the instrumentality of the male prisoner's own wife, and there drugging him and afterwards bringing a false accusation against him for the purpose of levying blackmail. He was glad to say that this crime was one which was alien to the English people, and did not often come before the courts, but it was one so serious as to be punishable with penal servitude for life. He did not purpose to inflict so serious a punishment as that in this case, but the sentence of the court was that prisoner be sent into penal servitude for ten years. The female prisoner would be sentenced to eighteen months' imprisonment with hard labour. His lordship then ordered the witness Kossman to stand forward, and gave him into the custody of Serjeant James, on a charge of having committed wilful and corrupt perjury.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811228.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 801, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3618, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]