[{"id": "98be4dc3603d8a884f0f5a03286d7d18dd651b19", "text": "CRIMINAL NEGLECT BY A CHEMIST.\n\nMrs. Hopkinson, the wife of a chemist and druggist, in Cock-hill, Ratcliff, was charged at the Thames police-court, with attempting to commit self-destruction by swallowing a large quantity of tincture of opium, sufficient to destroy ten persons.—The prisoner's husband was a person addicted to drinking; he was frequently from home, and he left his wife to administer drugs to his customers, although she was not acquainted with their properties. On Monday week she obtained an ounce and six drachms of very strong tincture of opium, from Mr. Carson, a surgeon, of Cock-hill, who was in the habit of supplying her husband with drugs occasionally. On the same day she had a quarrel with her husband, and swallowed the deadly poison. Mr. Carson was immediately called upon to attend her, and found her in a comatose state. He threw cold water over her, obtained the assistance of another surgeon, took her into the yard, where large quantities of cold water were thrown upon her face, the stomach pump was applied, and an ounce of tincture of opium extracted. The stomach pump was out of order, and Mr. Carson called a cab and accompanied her to the London hospital, where more of the deadly poison was dislodged from her stomach. She had been under medical treatment, and in a state of great suffering, ever since; and that morning, when the magistrate took his seat on the bench, she was arraigned on the charge of attempting her life, when Mr. Carson and Mr. Burgh, house-surgeon of the London hospital, were examined, and detailed the above facts; Mr. Carson added that on asking the prisoner the reason of her committing the awful act, she first said an old man was the cause of it, without further explanation. She afterwards declared she swallowed the poison to frighten her husband.\n\nThe prisoner expressed her sorrow for what she had done, and promised not to repeat the act.—Mr. Hopkinson said he was a good deal from home, chiefly in Derbyshire, and admitted that he drank to excess, and that he left the business in charge of his wife, but did not allow her to sell poisons.—Mr. Yardley denounced, in the strongest possible terms, the conduct of the husband, who, while indulging in his vicious propensities, allowed his wife, who was professedly ignorant of drugs, to administer medicine. The husband had said he did not allow his wife to sell poisons. This case proved the very contrary, for the woman sent for a deadly poison to sell in the business, and she meddled with it to effect her own destruction. There was no business that required greater care and circumspection than the administration of drugs, and if there was any trade which a drunken man ought not to carry on, it was that of a chemist and druggist. The husband of the prisoner might be indicted for manslaughter, for administering poison in mistake for some other medicine. He hoped no person would have the hardihood to go to Mr. Hopkinson's drug-shop on Cock-hill for medicine any more. He discharged the prisoner only in consideration of the sufferings she had undergone.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206314317.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 706, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3088, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]