[{"id": "4ea939102914be1b2ca70dead6a665af0952faa0", "text": "EXTRAORDINARY DEATH OF A POLICE CONSTABLE.\n\nMr. John Troutbeck, the coroner for Westminster, held an inquiry into the circumstances attending the death of Police-constable Joseph Daniels, 259 E, aged twenty-seven years, who was killed early on Sunday morning while taking a prisoner to Bow-street Police-station. Superintendent Steggles, of the E division, was present. Joseph Daniels, a registration agent, of 9, Meeting-House-lane, Peckham, identified the deceased as his son, lately residing at Jubilee-buildings, Waterloo-road. Some time ago he had erysipelas in the face, and the divisional surgeon ordered him to have some of his teeth extracted and replaced by false ones. These he was wearing at the time of his death. Police-constable Alfred Smith, 379 E, said that on Sunday morning at about 12.20 he was in Kemble-street, Clare-market, taking a prisoner to Bow-street Police-station. A crowd of several hundred persons had assembled, and an attempt to rescue the man was made. Witness blew his whistle, and in response the deceased came running up. He took hold of the prisoner's other arm, and they had only proceeded a few yards, when witness missed the deceased, and on looking round saw him lying on the pavement. Another constable came up, and witness went on his way. Police-constable William Stewart, 350 E, said that he was on duty in Newcastle-street, when he heard the whistle blow, and on going to Kemble-street, saw the two constables with a man in custody. Witness broke through the crowd, and then saw the deceased lying on the ground. He immediately undid his collar and sent for an ambulance, on which he conveyed the unfortunate man to the hospital. By the Coroner: The deceased was not knocked down, kicked, or otherwise assaulted. Dr. Eric Law Pritchard, house physician at King's College Hospital, said that deceased was dead when admitted. He had made a post-mortem examination, which revealed that the deceased was an exceedingly healthy man. Just about the larynx witness found a set of false teeth impacted, which had produced suffocation, the cause of death. The teeth were of very inferior make; no doubt they became loosened through the deceased running, and an inspiration drew them down his throat. The jury returned a verdict of accidental death, and added that they thought deceased was over anxious to do his duty.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810451.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 557, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2357, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]