[{"id": "a15f8dc63d45156fc1423ccbba82a96b2e04fdc3", "text": "CHARGE OF POCKET-PICKING.\n\nETIENNE LAY, a respectable-looking little girl, aged thirteen, of Oxbaldstone-road, Stoke Newington, was charged before Mr. Bros., at Dalston Police-court, on Monday, with picking pockets at the Rectory-road Congregational Church on Sunday night. Alderman Fleming Williams, minister of the church, said that recently a great number of purses had been stolen from members of his congregation. On the day in question he noticed this little child moving suspiciously about amongst the women of the church, and he mentioned it to his deacons, Mr. D. A. Romain (who defended): Never mind what you told your deacons. The Magistrate: What did you do yourself with regard to the arrest? Mr. Alderman Williams: She was taken into custody and charged by me as responsible officer of the church. Mr. James Branch, boot manufacturer, a member of the London County Council, and a deacon of the church in question, said that from the description he had from his minister, he watched this child in church on Sunday evening. She was sitting in one of the pews, and from what he saw he felt impressed that she was—Mr. Romain: Never mind your impressions. Witness (continuing) said that at the close of the service the child sat in the seatsome time after she might have gone, subsequently stood at the end of the pew, and then mixed with ladies as they came down the aisle. Witness followed behind, and saw her moving her hands in a very suspicious manner amongst the ladies' dresses. Witness followed her to the church porch, and then thought it best to take her. He noticed that she had her gloves on during the service, but now she had the glove off her right hand. Witness took the child back to a pew, and noticing her moving her hands he asked one of his colleagues to see if anything had dropped upon the floor. They found a crimson plush purse containing a florin and a penny, at her feet, and she said this belonged to her and contained a penny. Witness subsequently asked her when she began to do this, and she said that a servant that she had met on the beach at Herne Bay had taught her how to do it. Cross-examined: He would most certainly have charged the child from what he saw, even if he had not found the purse. He had never seen the child do anything of the kind before. He did not give the child into custody on suspicion, because he knew that she did it. Mr. George Collier, commercial traveller, also a deacon at Rectory-road, said: When the child was taken into the vestry I took hold of the dear little thing by the hand and asked her to sit down on the sofa. She said she lived at home with her father and stepmother. She could not remember her mother. I said, \"Now, my dear little child, tell me why you have done this.\" She replied, \"I have not done it.\" I said, \"Now, tell me, and we will befriend you.\" Mr. Bros.: I am not sure I can take any more of your evidence. There is an inducement for her to make a confession, which is not evidence. Mr. Henry Fitzhenry, another commercial traveller, and deacon of the church in question, said that he recognised the child as one of whom the pastor spoke on the previous Sunday with regard to lost purses. He followed Mr. Branch, and saw the child moving her hands in a very suspicious manner amongst ladies' dresses. He generally corroborated the other witnesses. By Mr. Romain: Unless I had been set to watch possibly I might not have been suspicious of her. Mr. Henry Perkins deposed that the child, when charged, gave a correct address, and from inquiries he made he was of opinion that the child's parents were respectable. Mr. Bros.: On this evidence I shall remand the girl in custody for a week. Mr. Romain asked permission to call the child's father, with a view of giving bail for the accused. Mr. Bros.: If you can prove to me that the purse belongs to the child I might entertain your application. Mr. Romain: I can prove she is a quiet, well-behaved child, who has a money-box and saves most that she gets. The father of the child was only asked as to her age, when he replied thirteen, and Mr. Bros. remanded the child in custody for a week, refusing to take bail.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200808398.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 694, "total-output-tokens": 976, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4159, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]