[{"id": "6f559daf7481a1e7b87624394c1e671cb8c49c92", "text": "A NOVEL CONFIDENCE TRICK.\n\nAt the Manchester City Sessions, before the Recorder, a young man named James Eckersley Thompson, aged twenty-two, was charged with obtaining valuable securities from a maiden lady named Miss Lucilla Prescott, aged fifty-seven. In October, 1891, the prisoner, who had previously been known to Miss Prescott, went to live in her house in Manley Park, a fashionable suburb of Manchester. He told her that a gentleman named Lord, a well-known Manchester solicitor, wished her to marry him, but for his convenience she must assume the name of Roberts, as he had got entangled with an Italian lady. He further represented that Mr. Lord, who was well-known to her, wanted to take her to Sweden, and as her two villas in Manley Park would then be an incumbrance, he desired her to sell them. The prisoner said he would buy one of them, and later stated that he had paid the money over to Mr. Lord. She accepted his statement, although from first to last in the case she had never seen her supposed future husband. The villa was conveyed to Thompson, and she sold the other villa by private treaty. When inquiries came to be made it turned out that the Mr. Lord is a married man with a family, and he indignantly denied any knowledge of Miss Prescott or making her a promise of marriage. He also stated that he had never received any money in respect of the house which the prisoner said he had bought. Thompson was found guilty, and the Recorder, who told him the fraud he had committed was a cruel one, sentenced him to twelve months' imprisonment with hard labour.\n\nAN UNLUCKY BLOW.—A married woman, named Ellen Cox, is in custody at Seaforth, near Liverpool, for causing the death of Rebecca McNab, a single woman, aged twenty-six. Cox went up to deceased and another woman while they were drinking in a public-house; and said to her, \"Are you Dora?\" Without waiting for a reply, Cox struck deceased a heavy blow on the chest with her fist, rendering her unconscious. When seen by a doctor he pronounced life extinct.\n\nSUICIDE ON A RAILWAY.—Edwin Barnes, a member of the Gloucester Gordon League Baseball Club, has committed suicide by placing himself in front of a goods train near that city, the head and limbs being completely severed from the body. From an unposted letter to his sister in service at Bawtry, Yorkshire, there is but little doubt that the reason for the suicide was the opposition of the parents to the marriage of the deceased with a girl inferior in position. All the arrangements had been made for an early marriage, which, however, had been postponed.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200811147.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 596, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2598, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]