[{"id": "9f90eeebf13b015e769ad3ba61a70a7f295d7b32", "text": "A WIDOW AND AN EX-POLICEMAN.\n\nAt the Marylebone Police-court Mr. Cooks had before him a curious squabble between two elderly lovers. The defendant was Henry Price, an ex-policeman, living at 9 Chippenham Gardens, Kilburn, and the complainant Fanny Shepherd, a widow, living at 5 Ernest Street, Notting Hill Gate, who complained of having been assaulted. Mr. Chisholm, solicitor, was for the complainant, and Mr. Clay, solicitor, defended. The parties met in the summer of last year while visiting friends living in Buckinghamshire. They became friendly; and in due course a proposal of marriage was made and accepted. In October they returned to London, and it was arranged that Price should occupy a room in Mrs. Shepherd's house until the wedding, he paying a rental of £2 a week. Price fell ill, and in consequence of that and \"other things\" the lady broke off the engagement. Then she got rid of him out of the house, he owing her the rent of the room. Since then he had annoyed her and had said he would blow her brains out. By arrangement they met on the 16th inst. at the Chippenham Hotel, Shipland Road, where Price was to have returned to the lady her photograph and other love tokens. At that interview he called her opprobrious names, and openly accused her of being an unvirtuous woman. She repudiated the assertion, and then he suggested that they should adjourn to the Salvation Army barracks at Kilburn, where she was to make a declaration—take an oath—that she was a woman of chastity. That was done, and on leaving the Salvation Army they adjourned to a public-house, where he treated her to some brandy. After leaving there he called her \"everything.\" He suggested a walk, and she went with him. When they reached a secluded spot he knocked her down, treated her shamefully, and kicked her on the leg. She got up, cried, and made for an omnibus, but he dragged her back, used terrible language, and knocked her down backwards in front of the people. She was now going in fear of him, for he had said he would murder her. She was with him that day from two p.m. to half-past ten p.m. Cross-examined: It was true she drank whiskey with him six days after the assault. She knocked his pipe out of his mouth because he called her out of her name, and for the same reason she knocked his hat off and jumped on it. Mrs. Mullins, of 135 Carlton Vale, corroborated the complainant as to the assault. Mr. Clay, for the defence, said a difference arose between the parties as to the settlement of their respective incomes. It was her suggestion that they should go to the Salvation Army and make a disclaimer. In the public-house she made a rush at the prisoner, and he simply put up his arm to keep her off, and she went down. The defendant left the police force with a pension and good character in 1877, after seventeen years' service, since which time he had been a bank messenger for thirteen years, and when he left was presented with a watch. A witness having been called for the defence, Mr. Cooke told the defendant he had behaved disgracefully, and ordered him to find two sureties in £25 each for three months, or, in the alternative, to go to prison for two months. The sureties were not forthcoming, and the defendant was removed to prison.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200813276.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 784, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3261, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]