[{"id": "16a407176d8607a9d9f9c0a0d49a24e816ce812f", "text": "DAMAGING MACHINERY.\n\nOn Thursday three boys, named Thomas Laken, Dennis Wright, and Bartholomew Sullivan, were charged at the Thames police-court with wilfully damaging a machine to the extent of 5l.—Mr. Charles Young, solicitor, conducted the prosecution.—It appeared that the prisoners were formerly employed at a large biscuit manufactory in Wapping-wall. At half-past six o'clock on Thursday morning, Charles Whiting, a boy employed in the same factory, saw the prisoner Wright walk to where the large cog-wheel was, and place his hand in that direction, but could not see what he did. He came back to where Whiting was standing, and addressing him said, \"I have put a nut near the cog.\"—In answer to the magistrate Whiting said he knew the nut would injure the machinery where it was placed, but he did not attempt to take it out, and did not inform any of the workmen it was there. About an hour and a quarter afterwards the machine was set in motion by James Shadrick, the engine driver. A sudden crack was heard, and the machine was stopped. It was then ascertained that a portion of the machine was broken, and an iron nut was found in the cog-wheel, which had caused the damage. The police were called, and the prisoners were given into custody. On being told the charge, Laken said Wright took the nuts off a window ledge, and each of them put a nut into the machine. He also stated he had seen Wright put three nuts into the cog-wheel on three consecutive mornings, while Wright on the other hand accused him of being the guilty party.—There being no evidence adduced against Sullivan he was discharged.—Mr. Lushington said he could not doubt both prisoners were concerned in very maliciously damaging their employer's machinery, although probably they did not think so much mischief would have been done; They appeared to be utterly careless as to the amount of damage they had done, and he sentenced each to 10 days' hard labour.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206328941.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 457, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1943, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]