[{"id": "7380b74e8a51ef88485fcb5b690f385dcb0d03bc", "text": "ALLEGED MANSLAUGHTER OF A BOY.\n\nPAINFUL AND EXCITING SCENE IN COURT.\n\nOn Wednesday, Dr. Lankester resumed an adjourned inquiry, at the Fitzroy Arms, Grove-street, Camden-town, touching the death of a boy named William Clarke, whom it was alleged was killed in a fight at the London Printing and Publishing company, Holloway.\n\nIt appeared from the evidence that on Friday, the 15th inst., a dispute arose between deceased, who was fifteen years of age, and a little boy twelve years of age, of the name of Felix Saunders, when the latter (accidentally as some allege) received a blow in the eye. He immediately went and complained to his elder brother, Henry Saunders, who, upon Clarke offering an explanation, struck him in the mouth. Deceased returned the blow by throwing a book at Saunders, who immediately repeated the assault. A struggle then ensued, during which the boys twice fell together, Clarke each time being the undermost. They were then separated by a man named West. The above took place at two o'clock in the afternoon, and at tea time deceased complained of feeling sick, and at eight o'clock went home, where he complained of his head and retired to rest. Next day it was discovered that he had been insensible during the whole of the night, and at one o'clock on Saturday afternoon he expired. Mr. Claremont, surgeon, deposed that death had resulted from a fracture of the skull caused by a fall upon some hard substance. The fall had evidently been occasioned by a blow on the opposite side to the fracture, which was at the back of the head. The skull of deceased was very thin and easily fractured. Deceased, it appeared, resided at Grove-street, Camden-town, and Henry Saunders, who is seventeen years of age, at 18, Scotch-street, Whitechapel.\n\nThe jury, after a lengthened deliberation, returned a verdict of misadventure, coupled with a censure on the elder boy Saunders, the coroner remarking that the jury had inclined to the side of mercy on account of the youth of Saunders, and because they did not wish to destroy his chance of earning an honest livelihood by sending him to prison.\n\nAs the coroner was severely admonishing Saunders, the father of the deceased cried or rather shrieked out, \"Gentlemen, before God Almighty I disagree with the verdict.\"\n\nThe Coroner: These twelve gentlemen are, most of them, fathers—Father (interrupting): But they have not lost an only son.—Coroner: They have done their duty before God—\n\nFather (wildly): I shall meet you at another bar.—Coroner: I am sorry to see an old man, who believes in a day of judgment, crying for vengeance.\n\nThe father continued frantically protesting until Mr. Murray, the coroner's officer, removed him.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206223435.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 636, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2701, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]