[{"id": "c0b4e4bcceeb96e70c97d6674b5278928ca4c2a8", "text": "CHILD MURDER AND MUTILATION.\n\nOn Tuesday, considerable excitement prevailed in Peckham and its vicinity from the discovery of the body of a female child in the house of Mr. Whitby, a highly respectable inhabitant of James street, Commercial-road, Peckham, which had undergone the most extraordinary mutilation by the inhuman mother.\n\nIt appears that on or about the 16th instant, a young woman, named Mercy Steer, servant to Mr. Whitby, seemed to be in very ill-health, and her mistress conceived that all was not right. She, however, left her service on the 20th inst., without any elucidation taking place, and proceeded to her native village, a place called Billinghurst, near Petworth, in the county of Sussex. Having there continued in an ill state of health she found it necessary to obtain medical advice, and the result of which was, that she was found to have been recently delivered of a child. Giving no satisfactory account of this, the circumstance was communicated to Mr. Hay, one of the churchwardens of Billinghurst, who, having ascertained that Mary Steer had been in service at Peckham, a communication was at once forwarded to Mr. Superintendent Lund, of the P division, who placed the matter in the hands of the police, who proceeded to the house of Mr. Whitby, for the purpose of making an examination. On searching the chamber which had been occupied by the woman Steer, there at first appeared no indications of any child birth having recently taken place. A closer inspection, however, showed that the sheets, blankets, and bedding, had been recently washed, with a view to remove any stains, but on the pillows there were some visible traces of blood. A further search showed some marks on the boards of the floor, to obliterate which, some evident, though ineffectual, attempts had been made. A closer investigation brought to light a piece of bedside carpeting, saturated with unequivocal marks of a recent child-birth.\n\nThis discovery led to a more searching examination, and after removing the pan of the water-closet, the right hand of an infant was discovered on the top of the soil. Proceeding further in the examination, the various fragments of the body of a newly-born female child were brought forth, but which had been separated into so many minute portions, as to be almost calculated to destroy all traces of the previous existence of any human body. The object of this mutilation, it would seem, was to force the respective portions through the soil pipe, for which purpose the skull had been divided longitudinally, and the vertebrae had undergone a similar process. The hands had been amputated at the wrists, and the feet at the ankles, the arms at the elbows, the thighs at the hips, and the abdomen divided into several particles. As a matter of course, the heart, spleen, and other portions of the intestines were also subdivided. From a cursory view it would appear that the child was born alive, and must therefore have been subjected to horrid mutilation by the inhuman mother.\n\nThe woman Mercy Steer is now under the surveillance of the Sussex constabulary, and when sufficiently restored to health will be brought to London, in order to undergo the necessary judicial inquiry.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206201407.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 970, "total-output-tokens": 714, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3227, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]