[{"id": "b2096e14f4207140d21bd4839361065a8ecf424c", "text": "A PRISONER'S ADDRESS TO THE JUDGE.\n\nAt the Gloucester assizes, on Thursday, Ellen Tipper, who had been convicted on Wednesday of breaking open a box and stealing 30l., and who had also been previously convicted at Worcester assizes, was brought up before Mr. Justice Smith for sentence.—The prisoner, who was well-dressed, and had altogether an appearance of respectability, begged to be allowed to address a few observations to his lordship before he proceeded to award her her punishment. She then, with some considerable feeling, addressed the judge. After alluding to her former conviction, she said she afterwards went to live with a young man now living in Gloucester, who afterwards slighted her. By the advice of the young man's master she went home, and then he wrote to her and said he should give her up. The prisoner went on in an impassioned manner as follows:—My lord, I can't express to you the bitterness of treatment I experienced from the young man after that; I got a situation, but when they came to know that I had been living with the young man, they cast me out of doors. My lord, it is only through an all-wise Providence that I am here now. I concealed myself two days, and I took poison. My lord, I had not a farthing in my pocket, and I had nowhere to go to. They turned me out of doors. I tried my best to give satisfaction, but I was turned out of doors. I had no friends, and I did not know which way to turn. I had no one to look to, but the Lord God Almighty. He was my only friend. He has been with me, and I now well know the goodness of His hand. I hope this will be a warning to me and to others around me never to be led away by people that are older than themselves, and who ought to know better. I hope that the same Almighty who has forgiven me the sins I have committed—for during the time that I have been in prison I have prayed earnestly, and He has heard me—I hope He will send you, my lord, a kind heart to pass as light a punishment as you can on a poor and unfortunate girl. During the latter part of the prisoner's \"speech\" sobs were audible in several parts of the Court, and at its close the prisoner leant forward on the rail of the dock, and burying her face in her handkerchief appeared to be crying bitterly.—The judge then proceeded to pass sentence. She had, said his lordship, been convicted four times. It was easy enough to say that she was penitent, but no one would believe in her penitence until she showed it by her good conduct. He doubted whether he ought not to sentence her to penal servitude, but would give her another chance by sentencing her to eight months' imprisonment.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206232852.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1016, "total-output-tokens": 629, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2644, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]