[{"id": "ab079f01f8cdbaa6fda8692618fcc5b6809610b9", "text": "CHARGE OF WILFUL MURDER.\n\nCharlotte Cutler, aged 23, an unmarried woman, was indicted at the Old Bailey on Thursday, for the wilful murder of her male illegitimate child. The prisoner was admitted into the Kingston union workhouse on the 3rd of June, and the child was born next morning. On the 2nd of July she was discharged from the union, taking the child with her, and it was stated that at this time it appeared well and hearty. The prisoner, after leaving the workhouse, called at a public-house at Norbiton. She left in the afternoon with her child, which was never again seen alive. On the 18th of July the body of a child was discovered in a ditch at Mortlake, and the case for the prosecution was that the prisoner had wilfully caused the child's death by throwing it into the ditch. Several articles of clothing were found on the body of the child, which were identified by the nurse of the workhouse. When first asked what had become of her child, she replied, \"It's all right,\" and said that she had sent it to Weybridge. She afterwards said that as she was going home with the child, she met a woman near the bridge at Mortlake, and she gave her a shilling to take care of it, and she went away with it; she did not know what became of the child afterwards. She afterwards inquired if a man, whose name she mentioned, and who she said was the father of her child, was in trouble, and when she was told he was not she said that he ought to have been, as he had taken charge of the child.—Dr. Mullens, a surgeon, practising at Mortlake, spoke to the condition of the child, and said he was unable to state what was the cause of death. He added that the child was 23 inches long, and he believed that it was from four to six months old, and he thought it highly improbable that a child only a month old should attain the length mentioned.—Mr. Warner Sleigh submitted that upon this evidence there was no case to go to the jury, as there was nothing to contradict the suggestion that the prisoner's child was alive at the present moment.—The learned judge declined to stop the case, and Mr. Sleigh called Dr. Rogers, the medical officer of the Strand union, who stated that it was a very extraordinary occurrence for a child a month old to be 23 inches long; and he was of opinion, from the evidence in this case, that the child found in the ditch was at least three months old.—The jury in the result \"Acquitted\" the prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206245325.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 832, "total-output-tokens": 591, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2437, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]