[{"id": "f00e943c5865100f18f8b5281de7e98b6fde772b", "text": "ATTEMPTED MURDER BY A FEMALE.\n\nOn Thursday, Maria Hodges was charged, at the Worship-street Police-court, with feloniously cutting and wounding Benjamin Wenman, with intent to murder him.—Constable Ross stated that that morning he was called into the house, No. 7, Angel-court, Whitechapel, where he found the injured man supporting himself against the wall in a lower room, with the front of his dress covered with blood, which was flowing profusely from a frightful wound in the right temple. Having ascertained from the man that he had been stabbed by a woman, who was in the bedroom upstairs; he proceeded there, and found the prisoner standing near the bed, partly undressed. She at once exclaimed, \"I have done it, and don't care if I am hung for it.\" The prisoner at the same time pointed to a penknife which was lying on the pillow, and the blade of which had been broken off close to the handle, and told him that she believed the other part of it was buried in the man's head. She stated further that she had been living for some time with the man, and on apprising him that morning that she was in a pregnant state, he answered with great harshness that he should do nothing for her, and that she must provide for herself in the best way she could. Prisoner was then conveyed in custody to the station-house, and the wounded man was removed to the London Hospital. It having been intimated that the man was in a state of great danger; Mr. Hammond immediately proceeded to the hospital, accompanied by Mr. Hurlstone, the second clerk, and took down his depositions (in the presence of the prisoner), to the following effect:—\n\n\"I have been living with the prisoner since Monday last, but had been intimate with her for some time previously. I got up this morning at six o'clock, but she persuaded me to lie down again, which I did, and fell asleep, but was awake by a sharp pain, and felt that I was wounded on the temple. The prisoner was standing at the bedside with a penknife in her hand, and, seizing hold of my hair, she turned my head round, and attempted to stab me on the other side. I jumped out of bed, and struggled with her; but she got outside of the bedroom-door, and kept hold of the handle, so as to prevent me from following her. I managed at last to make my way down stairs, bleeding 'furiously' from the head, and roused the people of the house, who sent for a policeman. I have suffered great pain, and felt very faint and sick since I received the injury.\"—The prisoner was then brought back to the court. When called upon for her defence, the prisoner said that the man Wenman had been the cause of great trouble and anguish to her, and that she left her situation on Monday night at his instigation. On the preceding evening she complained to him that she felt so unhappy that she did not care how soon she was out of the world, when he replied that the sooner she was out of it the better, and he did not care what she suffered, as he was determined to do nothing for her. He afterwards abused her grossly, and made repeated attempts to strike her; but she had no intention of injuring him, and merely took up the penknife to frighten him, when he suddenly started up, and received the wound before she had time to withdraw her hand.—The prisoner was remanded for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206191822.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1108, "total-output-tokens": 767, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3306, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]