[{"id": "467cfe19f792419498c228d2f2f2e454017eb6ba", "text": "EXPLOSION ON THE THAMES.\n\nAbout nine o'clock on Wednesday morning a steam-tug named the Edward, worked on the high-pressure principle, belonging to Messrs. Olyett and Co., licensed lightermen, of Beer-lane, Lower Thames-street, blew up on the river, near the Custom-house, and those on board, two in number, were instantly killed. At the moment of the accident the tug was moored to some barges in the tier of ship-ping on the north side of the river, between the Custom-house and the Tower. The engineer had come ashore to get his breakfast. The captain, Mr. Evans, was on deck, walking to and fro, and the stoker, George Williams, was below, attending, it was supposed, to the fires, when suddenly a terrific explosion was heard and in an instant a large mass was observed to shoot out of the vessel to a great height and then fall into the river some 300 or 400 yards from the vessel, which at the same moment disappeared under water. The mass proved to be the burst boiler, weighing several tons. A body subsequently came to the surface, which proved to be that of the stoker Williams. His head was completely blown off by the explosion, showing that death must have been instantaneous. The body of the master, Mr. Evans, has not yet been recovered.\n\nA seaman attached to the Hollandia steamer, which was getting under way at the time for a voyage to Holland, was struck by some of the pieces of the wreck, and was so badly injured that he had to be removed at once to Guy's hospital. The unfortunate man succumbed to his injuries on Friday.\n\nThe exploded boiler was raised on Thursday morning, and the wreck of the vessel has been lifted, and got in shore on the mud.\n\nOn Friday Mr. Richards opened an inquest on the body of Joseph Williams, the stoker.—Thomas Charles Towers, the engineer of the Edward tug, was called, and informed by the Coroner that as the evidence might criminate him he would be at liberty to cross-examine any of the witnesses.—Joseph Williams, the father of the deceased man, identified the body. His son was seventeen years old.—John Williams, the brother of the deceased, deposed:\n\nOn Sunday afternoon last I was on board the steam tug Edward with my brother. It was moored off the Custom-house stairs. There were two engineers on board, and the man Thomas Towers, the engine-driver of the tug. I was standing against the fore-cabin, and I heard the man named Barclay tell Towers to get into the boiler and screw up the bolt. Towers got into the boiler, and Barclay said, \"Don't play with it, but screw it up.\"—The Coroner (to Mr. Towers): Have you anything to ask this witness?—Towers: Yes. I never got into the boiler at all.—The Coroner: That is a statement. You can only ask a question of the witness.—The Coroner: Were all the men sober?—Witness: Towers did not seem very sober. They had a bottle with something in it.—Edward Jeremiah Olyatt deposed: I am a licensed lighter-man. The vessel belonged to me. It was a steam tug, formerly called the Thistle, but re-christened the Edward. She was timber-built, and registered at 12 tons' burden. She carried two engines of the nominal power of 12 horses. The engines and boat were built about two years ago. The boiler was worked at an average pressure of 70lb.—Coroner: Has it never been worked at a higher pressure?—Witness: I should not like to say, as I was not always on board.\n\nExamination continued: Towers has been in my employ for three years. He has been temporarily employed as the driver of the engine for about six weeks.—Coroner: Is it customary to put a young man in such a responsible position without being duly qualified?—Witness: I believe it is customary.—At this stage the inquiry was adjourned for a week.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206232857.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 740, "total-output-tokens": 884, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3711, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]