[{"id": "c715940234c7115f9d7e2d727bda8fed4185d488", "text": "A SIGNIFICANT FACT.\n\nThe following circular relative to the inspection of the yeomanry cavalry, has been addressed to the lords lieutenants of counties; by the secretary of state for the home department. This circular appears to be merely the usual official intimation which has been annually issued since Lord John Russell's accession to office in 1835:\n\n\"Whitehall, March 14, 1839. My Lord.—I have the honour to inform your lordship, that an inspection of the yeomanry cavalry by field officers of her Majesty's regular forces, will take place in the present year, and that all corps which shall assemble on permanent duty, or for training and exercise, are to be inspected during their respective periods of assembling. As soon as the precise time and place at which the corps in the county under your charge would wish to be inspected shall be fixed, I request you to notify the same to me, in order that the necessary directions may be given for the attendance of the officer who shall be selected for the duty of inspecting them. It will be necessary that the commandants shall be exact in specifying the duties for which their respective corps wish to assemble, whether upon permanent duty, or for training and exercise, under the 46th and subsequent sections of the Volunteer Act; and, further, that the time and place which are once fixed for the inspection of a corps, should, if possible, be adhered to.—I have the honour to be, my lord, your lordship's most obedient humble servant,—J. Russell. Her Majesty's Lieutenant of the——.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3205295999.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1844, "total-output-tokens": 361, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1542, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]