[{"id": "ed6a0aa472535e088d4a917ca83c73af43fb1386", "text": "FORGERY BY A WOMAN.\n\nOn Monday, at the Central Criminal Court, Mary Agnes Hillingworth, aged twenty, tailor, who was convicted at the July Sessions of offences under the Forgery Act, was sentenced up for fourteen years. Mr. Hill, on behalf of the prisoner, pointed out that she belonged to a most respectable family, and up to the present charges she had borne an excellent character. At the time she committed the offences, and for some time previously, she had been suffering from a very severe attack of hysteria, and had had to be attended by two medical men, and this appeared to have been the cause of her conduct. Of course the Post Office authorities had been put to very great annoyance and inconvenience, but as regarded the forgery no actual pecuniary loss had been sustained. As to the charges and imputations made by the prisoner in the letters and postcards, which formed the subject of one of the indictments, there was not the slightest grounds for them. The father of the prisoner, her nurse, medical adviser, and the vicar of Upper Tooting, the locality in which she resided, were called as witnesses as to the state of health of Miss Hillingworth during the period over which the offences complained of took place. The Recorder, in passing sentence, told the prisoner that he regretted sentence in order that the fullest inquiry might be made into her state of health. He had heard the evidence adduced as to her health, but at the same time it was impossible to deal with cases of this kind unless he treated them as most serious. By a remarkable facility, which she undoubtedly possessed, of imitating handwriting, she had jeopardised the liberty and character of a young lady, the complaint, against whom no charge could have been made; and so successfully had she imitated handwriting that she had deceived a most experienced expert in handwriting, and the young lady was in an act of being convicted on a groundless charge. She (the prisoner) had been convicted on two charges—although there were many other charges which she did not think it necessary should be proceeded with. She had been convicted of forgery in order for the payment of money, the forgery being due to her skill in imitating handwriting, which she no doubt believed would avoid detection. In addition, the jury had found her guilty of sending libellous postcards and letters through the post; and, notwithstanding the kindness of the late Mr. Raikes, when Postmaster-General—who, having had the matter drawn to his attention, promised not to take steps against her if she would desist in her conduct—she still persisted in sending the objectionable missives, having given her assurance not to do so. He ordered her to be imprisoned and kept at hard labour for fifteen months. As she left the dock the prisoner impudently exclaimed, \"You will all live to regret it.\"\n\nSAD DEATH OF A SCHOOLBOY.\n\nAt St. Thomas's Hospital, on Monday, Mr. A. Braxton Hicks, Coroner for the South-Western District of the County of London, held an inquiry into the circumstances attending the death of Garnet Robert Carrington, aged twelve years, son of John Carrington, gamekeeper, of Wraddon, Essex. Mr. E. Golden, assistant master, appeared to watch the case on behalf of the Orphan Working School, Haverstock-hill, N.W. It appeared that on the 18th July last deceased and several school companions were engaged in playing cricket in an adjoining space near the school, when Carrington struck his left arm with his bat. He was admitted to the school infirmary on the 21st, and got better. On the 2nd of August the deceased received a punch, while several of his school mates were thronged around him, attacking its contents. In their eagerness the deceased was pushed down, and his left arm was bent beneath, and broken. He was again admitted to the school infirmary, where he remained until the 15th of the same month, when it was deemed expedient to remove him to St. Thomas's Hospital, under the care of Mr. Clutton, who discovered that Carrington was suffering from fracture of surgical neck of humerus (left). On the 31st of August an excision of the head of the left arm was made. He gradually grew worse, and died. John Herbert Fisher said he was one of the house-surgeons at St. Thomas's Hospital. The deceased was a delicate boy, and lost a great quantity of blood. Death took place on the 16th inst., from exhaustion, following the operation. When the left arm came off by striking himself with a bat while playing at cricket, Mr. Algernon Coote, secretary to the Orphan School, proved that he visited the deceased, and the latter told him that his injuries were the result of an accident. The jury returned a verdict of accidental death.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3200810896.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 602, "total-output-tokens": 1056, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4723, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]