[{"id": "fad3f4b64ce31755c6b3e8394c6c512b1df951ad", "text": "MEDICAL PROSECUTION.\n\nOn Friday, at Bow-street police-court, Charles Watson, otherwise \"Dr. Watson, 1, South-crescent, Bedford-square, governor of the Lock hospital, member of the Royal College of Physicians and Surgeons, &c.,\" who was also advertised as Dr. Hill, Berkeley house, Bedford-square, was brought up on a charge of publishing an obscene book.—Evidence of publication having been given it was proved that 4,190 copies of the work in question were seized in the defendant's residence. The work had been extensively advertised throughout the country, and it was stated that it had been disseminated by hundreds of thousands for the purpose of terrifying the weak-minded, and bringing them within the power of the so-called \"Doctor.\"—Mr. Serjeant Sleigh, on the part of the defendant, urged that he was a duly-qualified medical man in America, and that the work was a scientific publication, no more immoral than similar works by Dr. Courtney and other English medical men.—Mr. Flowers thought the case raised a very grave question, and he committed the defendant for trial.\n\nTHE BERMONDSEY EXPLOSION.—Mr. W. J. Payne resumed the adjourned inquest upon Samuel and George Simmonds, the victims of the Bermondsey boiler explosion, at Guy's hospital, on Friday.—John Walker, of the firm of Cater and Walker, the makers of the boiler, gave evidence, and said he believed the boiler was safe to work up to between 50lb. and 60lb. pressure.—Mr. J. Macfarlane, the inspector, said the rivets, where the explosion took place, were through 5-16 and 7-16 inch plates. The tube was too weak for the pressure to which it was subjected, and ought not to have been worked at the very most at more than 25lb. per square inch. In his judgment all the time the pressure was more than 25lb., the tube had been on the verge of destruction. The boiler was in first-rate condition, and was broken down from sheer over-pressure.—The Coroner summed up at great length, and the jury returned a verdict of \"Accidental death,\" with the recommendation that, in future, all land steam boilers should be subject to Government or other strict supervision, and that a placard should be hung up in every engine-room showing the amount at which the engine may be worked.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206240630.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 545, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2245, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]