[{"id": "57fb7af07ac0fef70addff52e13a426e10b192c3", "text": "TRIAL OF A CLERGYMAN.\n\nThe Rev. J. H. Coglan, a minister of the Church of England; William Henry Manning, and three other defendants, named Terry, Rimmell, and Jolliffe, were indicted, at the Old Bailey, on Saturday, for unlawfully conspiring together to obtain possession of houses and other property, and to deprive the landlords of the possession of the property by fraudulent means.—The charge against the defendants was one of a novel character. Two of the defendants, Manning and Coglan, were already convicted of forgery and fraud at an early part of the session, and the other three defendants were charged with being concerned in the frauds imputed to them by the present indictment.—The case, on the part of the prosecution, was that all the accused had conspired together to obtain by fraud and chicanery property in the metropolis and elsewhere, which was of an eligible character, and could be readily disposed of; and, in point of fact, to deprive the real owners of the property to which they were legally entitled. In one case Terry was let into possession of two shops in Little Pulteney-street upon a three years' agreement, with an undertaking for a lease. Directly he obtained possession the owner was greatly surprised to see a notice posted up outside the shops, to the effect that they were to be let, and that a certain auctioneer would give all information. When the auctioneer was applied to by the owner, the latter was coolly informed that the auctioneer was acting under the instructions of Manning, who acted as the solicitor. The property then appeared to have been re-let, and money was paid as premium; and when the owner sought an explanation he was told he had nothing to do with his property. In this way various properties appeared to have been dealt with, and Terry and Manning then seemed to have gone to Brighton, where they professed to carry on business under the style of the National and Provincial Trade Protection society, under the names of Maxwell, Debenham, and Co. In order to obtain possession of some property at Brighton references were given to Coglan and Rimmell, who was represented to be a wine merchant at Penge; and replies were sent to the effect that Maxwell, Debenham, and Co. were very respectable persons, who were likely to become most eligible tenants. The replies also stated that Maxwell and Debenham had stood in the relation of tenant to the referees, and they were very sorry to lose them.—None of the defendants called any witnesses to facts. Mr. Matthews summed up the case for the prosecution, and he argued that Manning had been clearly proved to be the prime mover in the frauds complained of, and all the others had assisted him to carry them out.\n\nOn Monday the fire prisoners were found guilty of conspiracy, and Manning was, in addition, found guilty of uttering a forged deed, and Coglan of obtaining money and Lion brewery shares by fraud.—Counsel on behalf of Rimmel took a technical objection to three of the counts in the indictment, and in order to give time for consideration of the points, the Recorder postponed sentence until next sessions.—The grand jury made a presentment commending Inspector Conquest, Bow-street, and the officers engaged under his directions for the \"industry and intelligence\" they had displayed in tracing out all the facts of the conspiracy, and the Recorder added that he coincided with the opinion of the grand jury.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206268671.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 786, "total-output-tokens": 749, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3433, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]