[{"id": "40b02f37de22bbdc913ed09ab29608c07f638234", "text": "SCOTLAND.\n\nDARING THEFT OF £175 FROM A BANK COUNTER.—A Mr. Forrester, baker, Gordon-street, proceeded to the Royal bank, shortly before the time of closing, to lodge a sum of money. Having counted out 175l. in large notes he placed them in a bundle on the telling-table, and was about to count out some small notes to make up the sum he wished to lodge, when a party asked him if he could give him a 5l. note for five ll. notes. This he was about to do, when, on turning round, he saw, or thought he saw, a hand hastily drawn from the counter, and when he looked more particularly, found to his surprise that his bundle of 175l. had disappeared. He then observed a smart little fellow hastily leaving the bank, whom he at once suspected of the theft, and whom he immediately followed. On getting to the street, however, the fellow had turned the corner before Mr. Forrester could give the alarm. The daring thief consequently escaped but we hope only to be captured. Information was at once given to the police, but as yet we have not heard of any traces of the rascal having been found.—Glasgow Journal.\n\nCOOL APPROPRIATION.—A \"gentleman,\" dressed in tip-top fashion, arrived at the Golden Lion hotel, Stirling, driving a gig which he had hired in Alloa. Having partaken of refreshment and otherwise made himself comfortable, he informed Mr. Campbell, the hotel keeper, that as he had to visit a gentleman in the neighbourhood, and as his gig was a little dusty, he would avail himself of the use of one of Mr. Campbell's machines, with which he would return in an hour or so, when he would pay for the conveyance and return to Alloa. He accordingly got possession of a horse and gig to visit his friend, but has not since returned. It has been ascertained that the fellow, in company with an accomplice whom he had picked up about the outskirts of the town, drove on to Falkirk, where he changed horses at the Red Lion hotel, and drove on through Linlithgow into Edinburgh, where he has in the meantime been lost sight of. He has thus succeeded in victimising Mr. Campbell of a gig, and Mr. Scott, of Falkirk, of a horse, and what is still more wonderful, he travelled the whole way from Alloa to Linlithgow without paying a single toll—having at each bar represented that he would pay on returning, thus managing to do the toll-keepers.—Stirling Journal.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206205267.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1154, "total-output-tokens": 588, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2357, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]