[{"id": "256d0f2b844f0a0a0db090b553253376a308e735", "text": "BURGLARY, AND HORRIBLE BRUTALITY.\n\nYesterday (Saturday) the metropolitan police received information of a robbery, attended with circumstances of almost unparalleled brutality, having been committed in the parish of Bradwell, near Coggeshall, Essex, on the night of Friday, the 17th inst. From the information received, it appears that between eleven and twelve o'clock, three men, having their faces blackened, broke into the house of an elderly man named James Finch. His housekeeper, who slept below, hearing a noise at the back of the house, crept to the door, which she found nearly broken in. Before she had time to get back the door was broken in, when the men entered. She gave an instant alarm, and her master came down in his night clothes. He cried out \"Murder!\" when one of the fellows placed his hands over his mouth, whilst another held a bludgeon over his head, and threatened to beat his brains out if he did not hold his tongue. They then proceeded to ransack the house, and found gold and silver to the amount of £6. They no doubt expected to find a much larger sum, for in spite of every assurance to the contrary they continued to examine the place, even ripping open the beds, &c. Still disappointed, they made a fire, upon which they placed the housekeeper, and held her there until her clothes became ignited. They then released her, and partially extinguished the flames about her clothing. They continued their demands for more money, and seized the old man; they placed him also on the fire, which, however, by that time, had nearly gone out. They then tied his legs and hands together, and forced him up stairs; there they tied a rope round his neck, and drew him up to a beam till he was nearly strangled; then taking him down again, one of the men put a knife to his throat, and threatened him with instant death if he did not tell where his money was concealed. The old man entreated them to spare his life, and assured them that they had taken every farthing he possessed. Being at last convinced of their mistake, they sat down to refresh themselves, bringing forward unscrupulously what the house contained, and compelling their unwilling host to sup with them. They then helped themselves to four hams, and half the contents of a barrel of pork, which they carried away in a sack. Having forced the old man up stairs with his housekeeper, they took their departure and have not yet been heard of. A reward is offered for their apprehension.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206191883.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1476, "total-output-tokens": 568, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2474, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]