[{"id": "36585fe6fc8e24534408abea574c340845ca5d85", "text": "THE SUMNER AFFAIR.\n\nThe following curious correspondence is published in the Charleston Mercury, United States:\n\n\"To Hon. Preston S. Brooks.—Dear sir,—The undersigned citizens of Charleston, in their own behalf and in behalf of many others, beg your acceptance of the accompanying cane. It has been purchased with the contribution of the smallest coin in use by those who sympathise with and support you in the position you now occupy, in consequence of your recent chastisement of the senator from Massachusetts. We are proud to say that we know of no one in this metropolis who does not share with you in the just indignation which the speech of that senator provoked, and who does not approve the instinct which prompted you to the punishment of one whose sournility should deprive him of senatorial protection, as it has already taken from him senatorial respect. His incendiary and treasonable orations are but the evidences of the length to which the toleration of irresponsible factionists will lead those whose love of country is lost in the desire to gratify selfish notoriety at any cost. Your rebuke, it is to be hoped, will satisfy such men that there are consequences beside those provided by law for which they must prepare. It is not because this senator has been pleased to advocate doctrines the practical adoption of which would develope, as the least of its evils, a dissolution of the union, nor because that in doing so he has exhibited a temper so selfish in its tendencies and indecent in its development as to cause every true lover of his country to regret that he sits in the senate chamber of the union; but it is because he has dared, in contravention of all propriety, and with studied contempt of all decorum, to introduce our state in his debate in terms so gross and insulting that no son of hers could have remained unmoved. In your case additional aggravation was found in the fact that the terms in which your venerable relative was referred to made it your duty, in his absence, to punish the aggressor. You have put the senator from Massachusetts where he should be. You have applied a blow to his back. He has undergone the infamy of personal punishment. His submission to your blows has now qualified him for the closest companionship with a degraded class. But any class, however degraded, will regard with indifference one who, noisy in the assertion of another's rights, is indisposed to assert his own. With great respect, yours truly,\n\n\"S. S. FARRAR.\"\n\nThe following reply was forwarded by Mr. Brooks:\n\n\"Washington, D. C., Thursday, June 12.—S. S. Farrar, Esq.—My dear sir,—I beg to tender my respectful acknowledgments to yourself and the gentlemen associated with you, for the handsome cane received a few days since by express. The act which you are pleased to commend was the result of a sense of duty—a duty which either of my colleagues would have cheerfully performed had they been in my precise situation. I accept the Palmetto cane as an evidence of the generosity of my friends in Charleston, and not for any merit of my own. I have the honour to be, respectfully and truly, your friend and servant,\n\n\"P. S. Brooks.\"", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206313598.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 697, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3170, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]