[{"id": "b59d5a7c90eb72d82c72e059243c4748c2686004", "text": "SUSPICIOUS DEATH OF A WOMAN.\n\nOn Monday, at the Southwark police-court, John Long, 29, was charged on suspicion with having caused the death of a woman named Sullivan in the River Thames, near Waterloo-bridge, on Friday, May 9 last. — Edward Knell, a constable of the Thames police, deposed that on the 26th ult., he was on duty near Millwall, and about half-past six o'clock he saw the body of a female floating in the river. With the assistance of two other constables he removed the remains to the Poplar mortuary. The deceased was about 28 years of age, and the body was much decomposed. An inquest was held on May 28. The body was not identified; and the jury returned a verdict of \"Found drowned.\" — Mary Sullivan said she resided at 95, Bromley-place, Westminster. On Sunday she went with the police to the Poplar police-station, and there she immediately recognised the clothes of her sister, Abby Sullivan, whom she last saw alive on May 9. She left her home at a quarter-past six that morning to go to work, and her friends had not since seen her. Witness did not know anything of the prisoner. — John Sandford, corn porter, stated that on Friday night, the 9th ult., he was at work on a barge near Waterloo bridge. Shortly after 11 o'clock he saw a man and woman go down to the edge of the water. Shortly afterwards he heard the man \"hollering.\" Witness asked him what he wanted, and he replied, \"She's gone down.\" As he kept on calling out witness said to him, \"If you don't be off, the police will be after you.\" Witness did not go to see what was the matter, as he could not get off his barge. — Sergeant Clinch, a detective of the B division, deposed that he and Sergeant Helson went to 22, Cottage-place, Lambeth, where they arrested the prisoner, who made a statement, which Sergeant Helson took down in writing. — Sergeant Helson read this statement, which was as follows: —\n\n\"I saw a woman in the court, Cottage-place. She asked me the way to Westminster, and I showed her as far as the pillar-box in Commercial-road. This was at half-past 10 or a quarter to 11 at night. I left her and went to the Hero and had a pint of beer. I then went up to Waterloo-bridge and looked over and saw a woman on the shore. The tide was running out at the time. I went down the steps and said, 'Where are you going?' She said, 'All right, young man.' She came up to the shore with me as far as the timber. I went to wipe my boots, and while doing so, I heard her splashing through the mud, and before I could get up to her she was in the water and going down with the tide. I then went to the Waterloo Arms and told the landlady.\" The sergeant added that upon being taken to the station Long said, \"The woman I saw on the shore was not the woman I saw in the court.\" On being charged with causing the death he made another statement to Inspector M'Gillicuddy of a somewhat similar character. — Mr. Slade remanded the prisoner.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206244598.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 924, "total-output-tokens": 750, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2929, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]