[{"id": "1181819ce28c3e248ab17b0165ec8b01f27c7843", "text": "BREACHES OF PROMISE OF MARRIAGE.\n\nA jury assembled at Bristol on Tuesday for the purpose of assessing damages in the case of \"Maggs v. Davies,\" an action for breach of promise of marriage, in which the defendant had allowed judgment to go by default. There was a considerable attendance, including several female friends of the plaintiff; but the defendant did not appear, nor was he represented by counsel. The facts of the case were these:—The plaintiff was a milliner, assisting her brother, and the defendant, who was aged 29, was the son of a baker, of Stoke's-croft. In June, 1868, the plaintiff replied to an advertisement in one of the local papers for a shopwoman; but no notice was taken of her application till January, 1869, when the defendant's father called on the plaintiff and said he was the person who had advertised, and asked her if she was still open to take the situation. She said \"Yes,\" and terms being agreed upon, the plaintiff entered upon the situation. After she had been there two or three months, the defendant began to pay her considerable attention, and in March of 1869 he proposed marriage. She told him she must consult her mother, and having done so, she accepted him as her future husband, and it was arranged that they should be married in the spring of 1870. Matters went on smoothly; plaintiff was received kindly at defendant's house by his father and mother and other members of the family, and was looked upon as a future daughter and sister. Defendant some time ago went to America, and in June, 1869, he returned there in the hope of improving his position and providing a suitable home for the plaintiff. He stayed there from June, 1869, to May, 1871, and during the whole of that time he wrote regularly to the plaintiff. Ultimately, just before Christmas, 1872, defendant came home, and plaintiff saw him at his father's house, but there was an evident reticence and reserve on his part. He was anxious to avoid her, but she wrote to him, and he replied that he was not in a position to think of getting married. She thereupon wrote to him a long letter reviewing all the circumstances, and ending with this postscript:—\"Stephen, I now ask you as a man, setting aside all that has occurred, and the obstacles you yourself have raised, are you prepared, within a reasonable time, to fulfil your engagement to me? I have a right to expect an honest, straightforward answer to this question.\" He, however, did not give her one, and when the action was commenced his father went to the plaintiff's solicitors and told them it would be useless to go on as his son had no means. In little more than two months, however, the defendant married another lady.—The plaintiff's brother said the defendant \"appeared to be living as a gentleman of small means and breeding pigs for pleasure.\"—The jury awarded her 100l. damages.\n\nIn a cause (\"Williams v. Rees\") heard at the Shire hall, Haverfordwest, on Tuesday, before the Under Sheriff, the defendant (a Baptist preacher, a native of Newport, Pembrokeshire, but now residing at Loughor, near Llanelli) was assessed in damages to the extent of 300l.", "source": "olmocr", "added": "2025-10-04", "created": "2025-10-04", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdf/3206319258.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 878, "total-output-tokens": 751, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3136, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]