{
  "mediatype": "texts",
  "collection": [
    "cornell",
    "biodiversity",
    "americana"
  ],
  "title": "Contributions to Canadian palæontology",
  "identifier": "cu31924057833257",
  "uploader": "hank@archive.org",
  "addeddate": "2009-11-01 07:03:24",
  "identifier-access": "http://www.archive.org/details/cu31924057833257",
  "identifier-ark": "ark:/13960/t22b9km0x",
  "sponsor": "MSN",
  "contributor": "Cornell University Library",
  "description": [
    "The metadata below describe the original scanning. Follow the \"All Files: HTTP\" link in the \"View the book\" box to the left to find XML files that contain more metadata about the original images and the derived formats (OCR results, PDF etc.). See also the <a href=\"http://www.archive.org/about/faqs.php#140\" rel=\"ugc nofollow\">What is the directory structure for the texts?</a> FAQ for information about file content and naming conventions.",
    "Vol. 3, pt. 1, published in Montreal by W. F. Brown & co",
    "vol. I, pt. I. Report on Invertebrata of the Laramie and Cretaceous rocks in the North-west Territory, by J. F. Whiteaves. 1885.--pt. II. Fossils from the Hamilton formation of Ontario; Fossils of the Triassic rocks of British Columbia; Cretaceous fossils from British Columbia, the North west Territory and Manitoba; by J. F. Whiteaves. 1889.--pt. III. Fossils of the Devonian rocks of the Mackenzie River basin, by J. F. Whiteaves. 1891.--pt. IV. Fossils fo the Devonian rocks of the islands, shores or immediate vicinity of Lakes Manitoba and Winnipegosis, by J. F. Whiteaves. 1892.--pt. V. Additional or imperfectly understood fossils from the Hamilton formation of Ontario, by J. F. Whiteaves. 1898.--vol. II, pt. I-II. Canadian fossil insects, myriapods and arachnids, by S. H. Scudder. 1895-1900.--pt. III. Canadian fossil insects, by A. Handlirsch. 1910. (Memoir no. 12-P)--vol. III, pt. I Vertebrata from the Tertiary and Cretaceous rocks of the North west Territory, by E. D. Cope. 1891",
    "pt. II. Vertebrata of the Mid-Cretaceous of North west Territory, by H. F. Osborn and L. M. Lambe. 1902.--pt. III. Dryptosaurus incrassatus (Cope) from the Edmonton series of the North west Territory, by L. M. Lambe. 1904--pt. IV. The Vertebrata of the Oligocene of the Cypress Hills, Saskatchewan, by L. M. Lambe. 1908.--pt. V. Palæoniscid fishes from the Albert shales of New Brunswick, by L. M. Lambe. 1910 (Memoir no. 3)",
    "vol. Iv, pt. I-II. A revision of the genera and species of Canadian Palæozoic corals, by L. M. Lambe. 1899-1901"
  ],
  "lccn": "gs 06000263//r30",
  "call_number": "QE748 .A2",
  "camera": "EOS-1DS MARK ll",
  "lcamid": "318640",
  "rcamid": "325521",
  "operator": "TZHENG",
  "scanner": "Kirtas APT 2400",
  "ppi": "300",
  "creator": "Geological Survey of Canada",
  "publisher": "Ottawa, Printed by S. E. Dawson",
  "date": "1885",
  "subject": "Paleontology",
  "language": "eng",
  "imagecount": "230",
  "bookplateleaf": "0001",
  "scandate": "20080429033611",
  "foldoutcount": "0",
  "repub_state": "4",
  "publicdate": "2009-11-05 18:22:44",
  "filesxml": "Wed Mar 17 13:27:39 UTC 2010",
  "backup_location": "ia903604_10",
  "ocr": "tesseract 5.3.0-1-gd3a4",
  "ocr_parameters": "-l eng",
  "ocr_module_version": "0.0.18",
  "ocr_detected_script": "Latin",
  "ocr_detected_script_conf": "0.9209",
  "ocr_detected_lang": "en",
  "ocr_detected_lang_conf": "1.0000",
  "page_number_confidence": "73.25",
  "pdf_module_version": "0.0.20"
}