{
  "language": "eng",
  "scanningcenter": "nj",
  "sponsor": "BHL-SIL-FEDLINK",
  "contributor": "American Museum of Natural History Library",
  "date": "1865",
  "subject": [
    "Paleontology",
    "Paleontology",
    "Fossils"
  ],
  "title": "Palæozoic fossils.",
  "lccn": "gs 06000258",
  "collection": [
    "americanmuseumnaturalhistory",
    "biodiversity",
    "americana"
  ],
  "shiptracking": "AMNH02",
  "volume": "v.2, pt.1",
  "publisher": "Montreal : Dawson Bros.",
  "description": [
    "At head of title: v. 1 and v. 2, pt. 1: Geological Survey of Canada, v. 3: Geological and Natural History Survey of Canada",
    "Vol. 1 has subtitle: Containing descriptions and figures of new or little-known species of organic remains from the Silurian rocks. 1861-1865",
    "Vol. 1, p. 1-344 was originally \"printed in four parts between Nov. 1861 and Feb. 1865 under the title 'New species of Lower Silurian fossils.'\"",
    "Vols. 1-2 edited by E. Billings; v. 3 edited by J.F. Whiteaves",
    "Includes bibliographical references and indexes",
    "v. 1. On some new or little-known species of Lower Silurian fossils from the Potsdam group (Primordial zone). On some new species of fossils from the Calciferous Chazy, Black river, and Trenton formations. On some new species of fossils from the Quebec group. New species of fossils from different parts of the Lower, Middle and Upper Silurian rocks of Canada. New species of fossils from the limestones of the Quebec group from Point Lévis and other localities in Canada east. New species of fossils from the Quebec group in the northern part of Newfoundland. New species of fossils from the Quebec group, in eastern Canada, with some others previously described, and some from other formations. New species of fossils from the Califerous formation, with remarks on some others previously described. New species of fossils from the Quebec group in the northern part of Newfoundland, with a few from the Potsdam group. Fossils from various formations in the Silurian and Devonian systems. Species from the Quebec group, published in 1860 / by E. Billings. 1865",
    "v. 2, pt. 1 (no other part published). On some of the fossils of the Gaspé series of rocks. On some new species of fossils, from the Primordial rocks of Newfoundland. On the genus Stricklandia, with descriptions of the Canadian species. Notes on the structure of the Crinoidea, Cystidea and Blastoidea. On some of the fossils of the Arisaig series of rocks / by E. Billings. 1874",
    "v. 3, pt. 1. On some new, imperfectly characterized or previously unrecorded species of fossils from the Guelph formation of Ontario / by J.F. Whiteaves. 1884; pt. 2. Revision of the fauna of the Guelph formation of Ontario, with descriptions of a few new species. Systematic list, with references, of the fossils of the Hudson river or Cincinatti formation at Stony mountain, Manitoba / by J.F. Whiteaves. 1895; pt. 3. The fossils of the Galena-Trenton and Black river formations of lake Winnipeg and its vicinity / by J.F. Whiteaves. 1897; pt. 4. The fossils of the Silurian (Upper Silurian) rocks of Keewatin, Manitoba, the northeastern shore of lake Winnipegosis, and the lower Saskatchewan river. The Canadian species of Plectoceras and Barrandeoceras. Illustrations of seven species of fossils from the Cambrian, Cambro-Silurian, and Devonian rocks of Canada. Revised list of the fossils of the Guelph formation of Ontario / by J.F. Whiteaves. 1906"
  ],
  "mediatype": "texts",
  "repub_state": "4",
  "page-progression": "lr",
  "publicdate": "2013-10-30 10:13:41",
  "creator": [
    "Billings, E. (Elkanah), 1820-1876",
    "Whiteaves, Joseph Frederick, 1835-1909",
    "Geological Survey of Canada",
    "Geological and Natural History Survey of Canada"
  ],
  "updatedate": "2013-10-30 11:22:24",
  "updater": "associate-tara-maharjan@archive.org",
  "identifier": "palozoicfossils21bill",
  "uploader": "associate-tara-maharjan@archive.org",
  "addeddate": "2013-10-30 11:22:26.879118",
  "scanner": "scribe2.nj.archive.org",
  "repub_seconds": "186",
  "ppi": "350",
  "camera": "Canon EOS 5D Mark II",
  "operator": "associate-eric-escobar@archive.org",
  "scandate": "20131031190108",
  "republisher": "associate-joseph-ondreicka@archive.org",
  "imagecount": "206",
  "foldoutcount": "0",
  "identifier-access": "http://archive.org/details/palozoicfossils21bill",
  "identifier-ark": "ark:/13960/t32254605",
  "curation": "[curator]associate-manuel-dennis@archive.org[/curator][date]20131105154255[/date][state]approved[/state][comment]199[/comment]",
  "scanfee": "100",
  "sponsordate": "20131031",
  "backup_location": "ia905709_5",
  "external-identifier": "urn:oclc:record:1050253207",
  "filesxml": "Fri Dec 25 16:36:27 UTC 2020",
  "oclc-id": "4551900",
  "associated-names": "Billings, E. (Elkanah), 1820-1876; Whiteaves, Joseph Frederick, 1835-1909; Geological Survey of Canada; Geological and Natural History Survey of Canada",
  "republisher_operator": "associate-joseph-ondreicka@archive.org",
  "republisher_date": "20131031202359",
  "page_number_confidence": "66",
  "page_number_module_version": "1.0.3",
  "ocr": "tesseract 5.3.0-6-g76ae",
  "ocr_parameters": "-l eng",
  "ocr_module_version": "0.0.21",
  "ocr_detected_script": "Latin",
  "ocr_detected_script_conf": "0.8339",
  "ocr_detected_lang": "en",
  "ocr_detected_lang_conf": "1.0000",
  "pdf_module_version": "0.0.23"
}