[{"id": "f9f7ea67b3582f0733da842999ace097250c11f0", "text": "$13583. Jas B. Coop. $18.00 Deer #948. Robt.\nFarmer $135.50 Janry 88. #1116 Carved Brandon.\nNor am any of these holes on Acheson's list. It\nis almost impossible to get along without the\nholes as the first question they ask is what\nhole was purchased and if I cannot tell them\ndefinitely half of them reproduce the whole thing\nin the Oak Lakes holes. You did not pay me\n#400 or Henry Oliver #83.25 Deer #87. #13645 Ed Parker\n$34.60 Nov 86. #7032 M. Bouland 47.85 met 15\n& Geo P. Davis also in written no. #5397\nRol. 49.35 Janry 86. #92.25-1.6. See Memo 35.954\n#744.10 Janry 86-87. #11376 Harold Aut 1754 Janry 88\nIn this case I see what judgment. #13557 Arthur\nPerry $35.50 Janry 87. #400.23 JC McAnin $83.39\nJuly 89. J H McPherson Janry 86. #3145-6-7 Febry\n86-87-88 the same man. Nor are any of these\non Manbaptist. There are also a few on the\nlist that I have not got in my book. I wish\nyou would let me have all these holes at once\nso that I can proceed without delay. I expect\nto go out to Souris Monday if you can send\nme the Souris holes or I may in any case.\nI don't know how long I will be there but\nexpect Brandon will be my address until\nwednesday or Thursday. Of Grandview.\nalso let me have the last balance of notes along the line as soon as possible. I hope to finish up the lot I have next week and if the rest are no better than the ones I have already gone over they are a mighty poor line. In sending balance of notes stop just me full explanations to save delay in writing and it also helps me very much in deciding what to do in many cases.\n\nI saw Miller about his notes. He is not in business with Parsley but Carries on business under name of Miller & Co. He says business is not his but that an Eastern firm is running it. Rather he is running it for an Eastern firm. He also says he is not worth a cent. Thousands of Dollars are outstanding against him since failure and in any case machinerying etc. So that Rogers offered to return him notes for $5. I offered to settle for $5 the offered me $2 which I refused. What do you think we should do with him settle or more correctly speaking give the notes away (or sell) whose judgment you told me to ask Gilmore about. I did not get time be he promised to write me all particulars I have not heard from him yet. I wish you would let me know the dictates in each case. Yours Wm. R. Royce\nBrandon Sep 16 1896\n\nIn Quinon's Copy\nPoveshell & Co\nBrandon\n\nDear Roy,\n\nMcPhail was in town yesterday and we talked the whole matter over in Pittsboro office. He apparently did not feel like accepting Pittsboro offer. The particulars of which I wrote you on Friday, but at last raised $50. I think I can raise them $30 more but am not sure. I stuck to $20 but they would not come up saying they would sooner fight and if we won let us get what we owed, which they said would be nothing. I think I should before there is $20 due on his mortgage so inconsiderate on his stockcrop he has 110 acres of wheat besides stock, Billy farm help etc. He cannot pay anything this fall so he says but will pay as next year. Allison says that if the man says he will pay he will, but as long as he don't want to we would have hard work to make him\nI think perhaps we had better take $50 if I can get them to that point. I did them yesterday that would not take less than my own responsibility but I could use you about $150.\n\nThe man apparently has had hard times and his paper was worthless.\n\nI am going to return in this morning's mail to be back Thursday or Friday so if you could write me here your opinion in the matter I will endeavor to make some arrangements on my return.\n\nRobert Lewis\n\nI saw Clifford again last Wednesday in this case and I expect to make a settlement by which he will get a few dollars.\n\nI received your letter of yesterday morning and was sorry to know you were suffering from such a severe cold. I did not intend to display so much hurry in my letter as to make it necessary to write me on Sunday.\n\nThe weather has been wet most of the time since leaving Winnipeg and almost nothing has been done by way of stocking. I expect to make arrangements with Thomas by which\nDear Sir,\n\nI am going out to Quebec this morning and am very busy now so I have only a few minutes to write. I received both of your letters OK and will attend to matters suggested. I expect to make a settlement with Thomas by which we can pay off the Engine. The offer I made them was we would pay him $100 out of proceeds of sale and if we got $600 over for Enquire to pay him in full out of proceeds. He of course will help us to sell. I think he will accept these terms. Personally I am satisfied that his bid is good as against ours, if we knew a man at all and I expect the Engine was unsalable before the repairs were put on. Thomas knows a man whom he thinks might buy & we will drive out and see him on my return. Have you any in mind who you think we could sell Thomas soops Engine should bring $650 but I think it would be better to take\nSo that holds over. Can't you not arrange\nsome such firms with Garrett or men like\nAsh Staples Engine. They can't sell it to\nrealize their charges yet so a jumbo on\ntheir hands. I think they should be willing\nto allow a sale to be made or help in a sale\nby us if they receive their ships out of\nproceed. Before I forget it I want you to\nsend me some money. I will be strapped\nby Saturday night unless you do. Send\nit to me here at Brandon. I press you\nright as well send $100. And if wanted\nsale trouble of again resulting in a week\nor two. I have not done very much with\nthese debts as yet but I am working\nseveral schemes by which I hope to make\nsettlements. I may write you in detail when\nI have more time at my disposal as to\nMartin Wells. I hardly know what to say\nif we could get balance act of vessels?\nwould not care but if we cannot I hole-\nloft so the hold we have. In any case\nwe should have balance due by weeks\nput in some shape & if he won't go to work\nDon't you think it would be better for you\nto go up and see him & get the matter in some\nHope for as I now stand it is most unsatisfactory & I am certain well worth paying any more money unless it is in definite shape. I will call arrange with him I would hope the $100 from Shaw.\n\nHave you heard from Meyers, you might be able to wind this up also, if he has not written. I offered to take Bob & Co's half his part (half new secured or if they would pay all I would not stick at a few dollars) I think they will come to this or nearly in fact Meyers almost offered $200 without Co's when I was there. The man don't appear worth much, and it is simply a question of the best possible settlement how does the Fred & Thom smaller? Hardly know who he is that he had no trace after also J. McDonald & Rob. Farmer both judgments so you said. In what court is Israel Don't. Can you tell me who sold the machinery in the Oranator case & all about it as far as you can. There was Crosson living here & I would like to get hold of the right one & make him pay if possible. \n\nYours truly,\n\nP.W. Rowell\nSavills Sept 16, 1890\n\nMr. H. B. Tracy\nBarnstaple\nLondon, Ont.\n\nDear Mr. Tracy,\n\nSince my last writing you nothing very special has occurred on which I can report. I started on my westward trip a week ago today, though not thus far on my journey. The news along the line up to including Brandon with the exception of one or two are all marked NG and in many cases therefore was not far off the mark. But although I cannot report anything very definite for any special case, there are a number of schemes in foot and negotiations pending by which I expect we will be able to net $500. on weeks work. This may seem a small amount but the news were not large, were widely scattered, of course, many $500. contracts marked NG. Those marked good, the few that had well also come all right. The weather has been so wet & disagreeable that driving has been difficult and at some days impossible, but yesterday and today have\nbeen fine tonight and I am in hopes we can look forward to a few weeks of fine weather. During the past 3 weeks we have had rain at least every other day, sometimes more. Sometimes less but always enough to keep the grain wet. Some has commenced to sprout but I think if we get fine weather from now on the damage will not be serious. Of course the greater part of the grain will be Colonel by the rain. The farmers have been in a state of quiet anxiety. Some in their anxiety have stocked grain not yet dry, with the result as I heard today of one man having to pull down a stack his grain was spoiling and I don't think he will be the only one.\n\nBrandon is very pleasant entertaining town. The country around is one of the best farming districts in the Province. It was 20 miles south of Brandon Saturday afternoon and the country all through looks well. I made the 40 miles round trip back after 2:30 P.M. Mr. W. MacDonald also was with me and on the return we had the pleasure for 15 miles of allowing the horses to find the road for us. It was dark raining neither of us knew the road nor would it have made much\ndifference as it was impossible to see the trail but the horses brought us through safely and by 10:30 PM and it was not necessary to say after such a drive and at such an hour I did not object to a good hearty dinner. I expect to drive to Delaware tomorrow 40 miles from here taking in a half dozen parties on the way making the trip about 60 miles & will endeavor to get back the next day by a different road & see a number more.\n\nHow far do you think a credit of a resale or a note would prevent the chance of limitations from running? There are different cases up here where note is more than 6 years past due the payment done and delayed by resale. Also would a note say due 1st Sept 53 & sued 4th Sept 59 be in time to prevent statute from operating as a bar to the claim. I never noticed the point but I would think there could be no doubt that the 3rd would be soon enough as the days of grace should be allowed but how about the 4th. We have two cases in which this arises. Do you think I had better propose the ¼ see Hoop in Stewart debt when I am at Elkton 4½ miles north what we better sell at what it will bring now or wait for an\nincrease in price which they anticipate if this crop is safely harvested.\n\nNews by the papers that you queried DesRosiers Wallace in Toronto the other day has decision been given yet?\n\nI wrote out to Infring's barracks last Monday to Cole in Cold Bay, but he wasn't in. I will call again when I return to Winnipeg.\n\nWith kind regards to all in the office.\n\nYours sincerely,\n\nM. W. Powell\nWinnipeg Sept 23 190\n\nMr. Fraser Esq.\nBarrister & Co.\nBrandon MB\n\nDear Mr. Fraser,\n\nI am in receipt of your letter of 18th inst., which was forwarded to me by Brandon. I must sincerely thank you for your suggestion regarding the Coast.\n\nDuring the past week though I cannot report any large collections or settlements, I have succeeded in disposing of some half dozen disputed cases which have been hanging fire for from only 4 years. There were almost all North American or Globe works. Besides which appear to have been perfectly useless and caused losses of one crop at least to the purchasers in an attempt to make them work. In one case Globe works notes M.B. McPhail. The defendant had obtained an order for security for costs over a year ago but had done nothing since. The debt owed by see work about $600, encumbered to about $500 or $600, a mortgage of $500 on his crop.\nand shock I was almost in a position to defy\non judgment when we got it; though the man\nappeared to be honest and did working, I settled\nthe claim for $50 payable next year. The man\ncould pay nothing this as his crop was mowed\nfor all it was worth; this amount seemed by some\nmore in land. This makes the $50 perfectly\npeculiar. Mr. Gilmour concerned in the settlement\nanother case where the man had died about\n5 years ago, leaving his farm encumbered\nwith heavy liabilities. Nothing had been done since.\nThe face of four notes was $100. I obtained a\nsettlement from widow, who by hard work\nhas pulled the farm out of the hole where\nher husband left it, at $100. This amount is\nperfectly good. This in the report was marked\nbad. The former case being Globe works\nwas not reported on. In another case of\nGlobe works binder while the parties had\nalways refused to pay thus the matter\nstood. The debtor having but little exempt\nfrom seizure. I settled for full face value\n$100 at between 5% payable $100 this\nface balance next secured by mortgage\n$100 see went $50 at the least encumbered\nto the extent of $50. This amount may also be\nConsidered perfectly secure. The other cases were similar in me I settled the whole business $50 for go but the man was mg. as reported by Calvert & local Solicitor that was all I could get out of him in fact they all refused point blank to pay a cent until they are talked into it. I was also able by a little investigation to get some valuable information about two parties who had left the Country. I got their address, found their land, and discovered parties who owe each one of them more than amount of our claim. In one case where our Claim is $150 the man owns a sec. subject to $2000 valued for $50, we will take steps at once to garnish rent, as we can garnish his before judgment. All these cases where settlements were made or where I made a discovery of parties location the sport, where there was me... was \"bad.\"\n\nThe weather for the past five days has been all that could be desired for farming purposes and the stockyard thrashing are progressing rapidly. Should the fine weather continue during the balance of this week as it has every appearance of doing, the green part of the wheat will be stocked. The sample in\nSome localities is not so bad as it was at one time expected to be. In some cases it's badly bleached. But taking the crop as a whole there is going to be a lot of good grain in the country. During last week I drove over 150 miles through central and southern Manitoba and anyone who likes to see plenty and apparent prosperity could not but enjoy the scene. The more I travel through the country the better I like it. I am commencing to navigate a little with a adriver. I drove 36 miles southwest Delaware last Thursday after 3:30 o'clock making some stops on the way. I drove 10 miles after dark without seeing a sign of house or human habitation guiding any course by the stars. The first time I ever put them to practical use rather in Manitoba is the first place I have done so. I have often taken them as pilots here, when I struck the first farm house (and I confess I was getting anxious to find one as I knew I had gone about far enough if I was on right trails) I found myself just 5 miles south of where I wanted to go. But as there was no direct trail or trail which I could follow in the dark I stayed all\night, they were good Scotch Presbyterians\nwho was lacking in surroundings and\nin Bill of fare they made up in hospitality. On\nFriday I drove 80 miles, changed horses\nin the afternoon and on Friday Saturday\n50 more arriving at Brandon at 12 P.M.\nThe farmers appear in much better humor\nthan a week or ten days ago. There is more\nthan hope for the Country yet. I came\ndown to Winnipeg this afternoon to consult\nwith Calvert about several matters which\nnegotiations for settlement were pending\nand also to get notes & instructions for the\ntravels away out west. I am endeavoring\nto get everything in shape so that I can\ngo west again tomorrow evening & will\ncontinue westward until main line is\ncompleted. I find that the farther west I go,\nthe more necessary is careful attention to the\nroads. I expect it will take fully six weeks\nfrom now for me to complete the line when\nthis however is complete I hope to have mobs\nin such a shape as to get off for a week\nor so to visit the Coast. I suppose your\nbrother has fully recovered long before this\nis back at the office as usual with kind regards\n& all\n\nYours sincerely,\n\n[Signature]\nDear Sir,\n\nI enclose a note signed by James Ames for $100. This note is also to be signed by his uncle, John Ames. When so signed, it will be accepted by us in full of our claim provided certain representations made by James Ames as to his financial position is found correct. James Ames promised me Saturday evening last that his brothers would come in and sign this at your office next Saturday night. Enclose also an unsigned note, a duplicate of note signed by James Ames. If you can get all parties to sign this note do so. Keep up the one signed by James. I wish you would do this if it can possibly be done. You can tell them that it will save two witnesses signing note for the usual reason. I fear that the note I send you was signed after 12 o'clock Saturday night. Ames I think is just\nsharp enough to make us trouble if he can. You might return note after receipt to Mr. Calvert.\n\nI also enclose note $136.42. Mr. Hutchinson $710. I did not intend to take this note with me and was not included in settlement. This is a note of Mr. Hutchinson Jr. I hold him to pay the money to you. He promised to do so by 1st November.\n\nI suppose Brandon has given you the order at Massayo Co.\n\nYours truly,\n\nM.M. Powell\nMcGregor Sept 26 1890\n\nF J Calver Esq,\nWinnipeg man.\n\nDear Sir,\n\nRe Williams notes.\n\nI saw Mr. W. Williams about this claim yesterday but could not come to any settlement as he refused to do anything before seeing his Brother. He said he had not heard of claim from the day engine was taken back until now when the agent who took the machinery promised to return notes. He claimed to know the law that we could not collect if we took machinery before judgment. I tried to disabuse his mind of this delusion (if it be delusion) but in any case he claimed that machinery was paid for as we had sold for more than the balance due on notes. I wish you would send me the original bill also a statement showing all payments distinguishing those obtained by resale making up the balance due. I would like this as soon as possible as I am coming down to McGregor to see you in about a week and I promised\nlet them have it before that time you might\nfind it come at winter & I will forward to them\nso I wish to write them a letter at same time\nnow owns 1/2 acre worth $1600 encumbered by mortgage\n& 800 he has 115 acres magnificent wheat\nwhich should yield 30 Bushels acres mortgage\nworth $800 so you see there is a good margin\n& also has 40 acres wheat on his\nbrother William's farm.\nWilliam is down at McGeary buying wheat\nto own 1/2 acre & preemption but has not yet\ngot his patent as he has not lived out long\nenough at any one time. There are no judgments\nagainst him and his prece after paying\nhis preemption should be worth at least $200\n& to first class land. I wish his note had\nnot been outlawed. He was not under the\ndelusion you thought he was in fact he\ntold me straight \"your note is outlawed that\nwould a can't\" but I worked a scheme that\nhelped me out somewhat. I gave the note to Gilmore\nlast night told him to issue with this morning\nwhich I expect he did so I tried the Bluff same\n& said unit was issued to CRO but as case was\nnone to strong I had to act cautiously\nnot push too much & also knew that I\nmust get a settlement in this before his brother saw him about these notes. We got notes for $500. This fall & $400 next fall I enclose notes. I think we could have worked another $200 or $300 out of him had we been in a position to force matters, as his trust showed certainly the good for aunt. After settled this up, got notes in pocket I tackled him about the other with result as above stated.\n\nI wish you would write a good strong demand letter to all parties from whom we have to renew machinery or from whom money has been taken, stating that you must again request payment etc. It would prepare him for the rude awakening that a personal call gives them & I would be better able to make settlements as they would have had time to think matter over. I think the position we should take in any case is, the company took the machinery back so same $600 amount as which we have audited on notes stock to the makers for the balance. Re $1 little Baker, Thomas of Douglas will send you to full of this claim on 1st Nov. I left the house with them & am satisfied we will get\nget the money all ok.\n\nRe Holmes\n\nI did not call you yesterday for reasons that Holmes has so-called wheat which sheriff has not seized & which neither the sheriff, Elliot or Harris knows exists. I saw it when I was out there & then I put it to Curran straight he admitted the fact. They are of course very anxious to settle with us in that in a pinch all round but they wont us to help them through with compromise & I think they will go as the Bois I asked. I have left the case in Barretts hands & you might write him. I told Curran that we should not hold off let the others scoop the pot & that if we delayed he should get us a concession of judgment so that if settlement not carried out we would come in. This he promised to do but I think he is a ——— & Barrett is going to try every other move to secure us. We had better keep dark about this other so acres wheat. I am going up to Union tonight.\n\nYours truly,\n\nM.M. Rowell\n\nThe Barret has seized Bradley crop & the old man claims it. I said we would fight, what do you think? While thinks they will settle Holmes than go to Court.\nVinden Sept 16th 1890\n\nW & Hunter Co.\nBarrester Co.\nDelaware\n\nDear Sir,\n\nI must apologize for not sending you the $5 sooner but I only returned to Brandon. I was again disappointed and became another man's debt in order to get out of town. I have however at last got out of financial straits and beg to enclose the amount with many many thanks for your kindness.\n\nR.S.H. Robinson\n\nI looked this matter over with Calvert who promised to send you note with instructions. Get hold of this money if you can.\n\nR. Oliver Johnson\n\nI find I cannot very well take this role out of Anderson's hands so I have written Johnson to send the money to Anderson not to you. You understand the position will know my reasons.\n\nI also asked Calvert to send you back your note kindly acknowledged receipt as well. Kindly you have received letters. May 13th 1890.\n\nYours truly,\nMcConnell\nVarden Sept 26 1896\n\nAllen W. Turner Esq.\nPoveshull Prairie\nMan.\n\nDear Sir,\n\nRemovals Bank mgr.\n\nor account of the new real property act I find they will not register your mortgage to the bank unless it is put under this act. It had to be done some time as nothing can be done until properly unless it is and must very little for the grantee from the Crown to get approved. It would not cost you more than $4.00 disbursement. I wish you would send your patent into Mr. Calvert so that we can have the necessary proceedings taken. Of course was as mortgages can do it by getting a certificate of your patent from the government making the approval but this is only including useless expenditure to back you up seeing you have patent kindly attend to matter at once I wrote again before some time ago I send in Patent but have not heard from him yet cannot delay application much longer.\n\nYours sincerely,\n\n[Signature]\n\nPoveshull\nDear Sir,\n\nRe Creighton\n\nI drove out & saw Creighton yesterday about his note, you remember writing Calvert telling me that O'Donohue said Creighton had dealt with him on this note; Calvert tells me that O'Donohue never had this note, it did not belong to him and he had no right or authority to settle for it. We had no knowledge that he had done so. Creighton told me that Lady & Calvert who were O'Donohue's solicitors sued him for all these notes and he paid them for same.\n\nCreighton appears to be an honest old gentleman if he stole the pack as I expect he does. O'Donohue must be a rogue. I enclose you note to Creighton and we in the latter part of the week will about it, naturally he does not wish to pay note twice but we certainly are not to blame. I cannot afford to lose for O'Donohue's sin.\n\nThe note now amounts to about £60. I would sooner\nmake a small reduction, considering the circumstances, than to be sued. At the same time Creighton is good for full amounts. If we are entitled to recover we can't reduce our claim too much. He said if he had to pay he did not know whether he could pay all this year or not. We wanted him to wind up this year but I do not wish to press the old man too hard and if he cannot pay this year to renew next fall or next spring. The old gentleman is honest I think if he thinks he has to pay will do so. He will go to Dolly about the matter and perhaps you she can wind the affair up.\n\nRe Ames\n\nIf anything has been done in this case you might drop me at Hob to Mossmanin any time up to 10th Oct also about Creighton.\n\nYours truly,\nMcRee\n\nOne may say that he collected money tapped on account he has against the Company. If the first place he lies as he has no claim against Company. If he had with that we have nothing to do.\nOaklake Sept 30th 1890\n\nJ.G. Calvert Esq.\nWinnipeg\nMan.\n\nDear Sir,\n\nRe Val Williams.\n\nMarily gave me these notes, he owed\ndo nothing with them & said the old man had\ndisposed of his land & his children some\nyears ago the property had again been sold to other\nchildren, Williams is now a squatter carrying\nin Blacksmith Shop in a small way here.\nI gave him back his notes & enclose anew\nnote for $100 with an endorser as good as the\nwheat.\n\nW.M. Williams\n\nI also enclose W.M. Williams' notes.\n\nRe Geo. Wickery\n\nTwo of these notes have been paid off or the\nother principal of the first one the said he had\npaid out the interest in pars around payme-\nnts. The second one the principal was to due date\nwas paid some after due. The note was paid\naltogether they remained only the last hole #3196 30 ft. The machinery as usual was no. the old man was cursing himself because he had paid a cent & refused to pay more. I had quite a time with the old lady she would go everybody in it—after they would pay another cent for the d—thing & they both emphatically declared, I think sincerely though possibly mistaken, that the notes were not theirs & they would swear that his notes were made out signed with indelible pencil &c &c If we went to court & farmers jury I thought it would not be unlikely for them to find us a forgery. More or less a settlement would be the best thing so after some talk a good deal of bluff I got a new note from the old man for $55 which I enclosed & when he pays this I merely think he has paid enough for machine. I gave up old notes as this was only way we could get a new one\n\nRe Crofton\n\nHe says Mary Caldwell sued him for $200 but on all these notes that he paid all to them so somehow told him to pay no attention to our letters. I explained my position to him she is coming into Brandon the last of the week & see about it. I sent the note back\nTo Mr. Donald\n\nThos. Helliwell\n\nI have just seen this man's cousin who says he is back at Rosser farming. If you return here, could you not see this man also Thomas at Rosser.\n\nRe Chisholm\n\nI got these notes from Manby. I saw Chisholm, we did not settle. Chisholm owns 3/4 of section which has 160 acres where he says there are no mowers on his farm so he says, that he will pay if he has to, but not unless. He is a very decent fellow. I think will come to time. Manby wrote him once about note & Chisholm called to see him with a witness & asked who held notes. Manby replied \"the North American Co.\" Chisholm said this was all he wanted machinery &c., to see away. Return your notes I want to have Gilmore issue warrant once on the Bank notes send out for service. I think it will be a 2/3 suit. If County Court would it have to be sued at Brandon? Chisholm said he thought McDonald would be his solicitor. Chisholm is good as cash, we should not settle at any large discount. I would have taken $750 probably. I think now we should get $800 or perhaps $800 & costs. Chisholm returned\nMachine advertised holes in paper.\n\nIf you place holes in Simmons head you might unite. I will write him. If it has to be said in Brandon had we better give them credit.\n\nA. MacDonald\n\nThis man you say lives at Viola. Dole about 40 miles from here. I have nothing else up that way. Can't the Bailiff work him?\n\nI did not get away to Viola last night, as I was too late for train. It was 12 o'clock when I got in. Made between 70-80 miles yesterday with the train. I am going up on freight this am.\n\nReg your note.\n\nEnclose list with man's report in manner when out at Bradwoodine yesterday. Inquired for Mr. McKenzie. There was a Mr. McKenzie who was on Mr. Watt's farm. This man has stripped country. There is another Mr. McKee on our river.\n\nEd Parker so as\n\nReckon Butchering can you get after him? I think this completes my budget this morning.\n\nYours truly,\n\nMr. Russell\nDear Mr. Fraser,\n\nI have nothing very special to report for the past week. The work has been progressing in a fairly satisfactory manner. I have made a number of settlements about the same as those reported in previous letters, but it is not necessary to weary you with the details. Some parties who were supposed to have left the Country I have succeeded in locating, but many more I have not. It seems a pity that these matters were not pushed two or three years ago when thousands of dollars that will now be lost might have been saved. In two or three cases where the parties are good I have written Mr. Calvert to see if perhaps they will come to terms. There are very few who do not appear to realize that our position is good & that they must pay if the facts are as we state them, but they rely on Rogers' letters and in the name...\nThe toys season in the fact that we have not pressed our claims. In more than one case the parties have said \"why didn't you sue Congress if you think you can win?\" or \"I sold you goods and I would not pay why didn't you sue.\" Such persons I have not often doubted as to what we would do in case they would not settle. If we follow up what I have said by a unit I think most of them will come to terms. I honestly can't blame them much for not wanting to pay if they can help it, for to understand the character of the machinery one has to but travel a few miles through the country. I think there can be little doubt but that in many cases the machines have been the cause of loss to the respective owners by loss of crops in attempting to make the things work. I had quite an instructive address from a farmer's wife yesterday about this machinery. I was talking to the husband about hoes when she came up. Her vigorous language for about 15 minutes was along this line \"I would see them all in H— before I would pay another cent for the D— thing or C & wound up by saying that it had caused more swearing in times over than it was worth. I sell d—\nthe husband however notwithstanding standing her protests. The best plan I find is, to use a slang expression, \"To play right with them\" after they have worked off their bile you can generally get down to business. I had quite a delicate case last week when the note was over $200. The note was outlawed, why cannot allowed this, I don't know, unless he thought the man was not or had left the country as a matter of fact he was away for two or three years but is now back. I had him issue a writ suit this as a bluff I got renewals for $50. I think the fellow will try to pay me a year yet we will be able to make him pay. He owns a sec. of his homestead & preemption worth about $300 has not yet got his patent nor paid his preemption which is $400. He has 75 acres of wheat in this year or shares with his brother his farm on the farm next year to work it himself. So although this will a doubtful claim in the sense that we could not at present make the money, I think we are sure to get the amount in any case two at most $600 payable this fall. He will pay his own of his crop, $100 next fall; which expect a pay of next year's crop if not he\nwill have completed his homestead duties hopes to have talent by that time will raise the money in his farm.\n\nThe weather still continues most favorable for harvesting. The last few days are the warmest we have had since I came to Manitoba. By the end of this week the harvest hopes place harvest will be almost completed. Notwithstanding the damage by frost rain the crops will still be magnificent there is not much rain but what will bring a good price as the best has done other years the best price will bring 30c per bushel.\n\nI came down to town today noon will leave for Moosejaw in the Territories tomorrow night.\n\nI saw by the paper that Mr. R.M. Macdonald had been appointed to vacant judgeship in Chy Dist. was this a surprise, I never heard his name mentioned for such a position.\n\nThe driving still continues pleasant this fine weather I made between 70-80 miles yesterday with a span of ponies but did not get in until 10 PM.\n\nYours truly,\n\n[Signature]\nMoosemin Oct 4th 1890\n\nMr. Fraser Esq.\nBarrewood\nLondon M.\n\nDear Mr. Fraser,\n\nYour letters of the 27th Sept.\ncame to hand in due time having been forwarded to me here, as you see by the heading of my letter. I am gradually working my way westward, but I expect to make a considerable halt here as will take some time to get from this town to Regina. Mr. Forbes our solicitor here has more cases for collection by far than any in Manitoba and I might add with a good deal of skill. Knowless about them. I expect he has a rather good practice & his time may be well taken up and I would judge except in a few special cases, he has simply written the parties where they did not pay the thought they were worth it advised suit which advice as he says was in most cases not followed and in many cases where the machinery was not first class he reported this story to Calvert. These also stood over. I have swept to day in\nendeavoring to get the work into shape. There are about 150 holes scattered over a territory about 30 miles East West of this point & extending about 60 miles each side of Ry. My method of procedure was to get a map of the country so through the notes offer description of the mansions then mark every mans name & location on the map. By this means I can take a certain section for each days drive as think the best thing to be done under the circumstances is to personally see every man. Many of them have said no but I am not satisfied that he really knows their position although it will take much longer than I had expected to spend in this district. The expensive as the drives are long from the interest of the Collections for the satisfaction of know who the hole stock of facts is I think I should take the trip around. In fact I have already struck one man whom we never could locate before just caught him the last day before the note outlawed. I got a renewal note payable at Deer. The man so Forbes said says as good as the wheat. Note was no larger ought but interest brought it up to $5. This will go some distance at least to pay expenses.\nAfter two weeks of delightful weather it has again turned cold raining for the past two days. The harvest however is almost completed though some farms are still in the shock form in hopes however that it will clear up before Monday, as I wish to get in a big week's work and we can't do very heavy driving in this country over muddy roads.\n\nI think the crops in the territories are more in favor by far than in Manitoba as yet very little threshing has been done out here and I estimate the damage would be simply guess work. The prices however are very satisfactory to the farmers good wheat bringing from $6.50 to $7.00 per bushel from $6.80 to $7.00 is about the highest they got for good red hard last year.\n\nI noted what you said about the case where Bender knew block at once & could not collect selling forth our position stated that on payment of $5 or $10 we would deliver up the notes also noted your remarks in last letter re delivering up notes in cases where machinery useless to the parties poor. If we were to carry out the idea in its entirety to allow sentiment to govern we would deliver up possibly $2 - $3 at least of our collections.\nOf course I know you don't mean that. The principal I have tried to carry out is to get all I can without really driving the man to the wall. In fact when the claims are at all large we must give the man a chance in our own interests in order that he may work it out. If I continue to work along this line I must still be satisfactory to Mr. Robbitt.\n\nI hope you did not think by my references more than once to the machinery due possible to the fact that I receive out a day but what I said with it was that I thought it was oppression on the part of Mr. Robbitt to collect these notes. I certainly had no such thought. Business is business and in the vast majority of cases where our position is fairly presented to the parties though they believe they have been swindled or possibly they have they don't look upon us as the swindlers oppressors shall our position been properly presented to them before I don't think the settlement would have been so long delayed and I have found that after all is said done there are but comparatively few men but what if you tack to their family & candidly you can soon convince them that you are prepared to deal fairly by them and except in a few cases\nwhen the business has all been done I have left\nthe parties in the best of terms.\n\nDuring the past three weeks I have been\nnavigating the Country without a drive. It\nsaves $ per day. I have not yet lost very often\non two or three different occasions I have\ndriven from 20 to 30 miles after dark through\nan unknown Country turned up so far round\nat the end of the journey. I could not do it\nof course if the days were not bright at the nights\nclear. As there is not much settlement where\nI can make inquiries I have to guide my\ncourse by the sun or stars as the case may\nbe as I think I have before written there\nare no roads or fences in this Country. The\nroads wind in every direction as it is within\n15 minutes of 4 o'clock I must close. In\nordinary Conversation the 1/4 hour system\nis not much used up here.\n\nWith Kind regards to all in this office\n\nYours sincerely,\n\n[Signature]\n\nI would like if Mr. Monk would send me\ntwo more of these books, for writing with\ninkwell pen. I don't think they keep them out.\nW. A. Macdonald Esq.,\nAttorney C,\nBrandon, Man.\n\nDear Sir,\n\nRe: Caughron\n\nThere is John Cobalt here.\n\nRe: Scott\n\nI am just a little surprised at David Scott defending after his direct admissions and promise to pay money to us when out to see him. I do not expect to be back in Brandon unless it is necessary perhaps at all or at least for a couple of months as after I complete my work along the line & this will take me about a month or weeks I must go through to the Coast & down to San Francisco Coming home via U.S. to Wpg. I can however meet as strong an affidavit as you think necessary based upon our conversation while out at Scott's place. Can we move to strike our difference in afft in your CC? I agree with you that it makes a fellow feel like pushing other notes but we don't want to have a protracted fight with a man of straw.\nwhat are these other Scott Notes even for? My collection was all globe works Binder but I see I have only two Notes which would not make up a Binder's price. Do you think it would be wise to delay action until we see how we come out in this present action. I mean lost or making money. There can be no doubt about our being Bond note holders of the North American & Stearns Trust Co. Burns as proper and I am instructed from London that the same applies to Globe Works Notes. These were transferred by Coyle Williams Bank that night afterwards to Kober's account held notes. I will be near for an hour yet if you wish an afft within the time I will be pleased to make it. If not you may let me know when you will. It will keep you posted as to my whereabouts.\n\nEnclosed find $15 borrowed from you family. Sorry to have been so long delayed in writing. Amount accepted my sincere thanks for kindness shown.\n\nYours truly,\n[Signature]\n\nI have rented Robert Sherris unit September\n$50. So kindly let the suit drop you asked\nWatauga Oct 1870\n\nWhitby 9c\n\nMaconville Miss.\n\nDear Sir,\n\nI enclose you a note from Jas. Barker to Watauga Branch, now held by Mr. Goddard for $35. Mr. Campbell informs me that this man should be good for about six which is something over what he promised the other day and has about 400 bushels wheat. I didn't have time to pay all him. Think you told me the other day that you had an agent in Whitewood? He might be able to catch him when he brings wheat. If you think better still, I will send the money made and am not particular how you do it. The note was now signed a number of years. Barker must pay up this year. Kindly give the matter your best attention. There may not be much time to lose, so this is pressing he will likely be selling his wheat. If your agent at Whitewood could get a chattel mortgage from him we might want a month or so but I would not trust him that long until he becomes us. Kindly acknowledge receipt to Calvert.\n\n[Signature]\n\n[Stamp]\n29 Calcut Eggs\nBuy 1/310\nDpq\n\nDear Sir,\n\nEnclosed find following notes:\n#9680, #9686 Campbell Bros. Cash balance of them in Montana or Western States\n#11377, #11378 Parker Smith. I did not see these men as you posted them, so they should be made to pay up this fall.\n\nHenry Oliver $170.94\nRobinson $100.00\n\nYours truly,\n[Signature]\nDear Sir,\n\nEnclosed please find Lucas Mfg. Co. Cash Notes 13514 & 13519.\n\nNote A.M. & William Kligman for $20. I don't see any reason why Hickson should get Commission on this note.\n\nAlso Enclosed find Notes Walker Brody due July 9th for $100 each or $50 each.\n\nYours Truly,\nM. W. Wood\nIndian Head Oct 29 1890\n\nF Tobin Esq\nAttorney\nMontomie\n\nDear Sir,\n\nEnclosed please find note RNCB for $ due January 16 No. 10710.\n\nI didn't see Young Blythe but saw his father. He got off a long story at one narrow spot. I returned them without any case his son is on.\n\nI am informed that the son has a homestead. You had better have a crock at him. The Holzio John Robarts kindly issue a writ at once in his name. I will be glad to hear from you at any time in reference to Collections or any particular but a note kindly acknowledge receipt of this note (signature)\n\nNote written the other day, letter sent Nov 4 1879. Copy will be forwarded.\n\nYours truly,\nM.M. Rowell\nIndian Head\nMarch 1870\n\nJ. Calverley\nDec 1879\n\nMunro\n\nDear Sir,\n\nEnclosed please find following notes:\n\nJames Call et al $1 due January 25\nJames Call et al $5 due January 31\nRobertson et al $20 due January 31\nHoward Scott et al $5 due October 1st 91\nWendy Hamilton et al $466.926.719.65 Cent for dairy farm\nC. Hill $1 in 9069, 9070 & 9071\nMcBell $16 due Nov 86 & 13657\n\nJames McDonald et al 9078, 9079 & 9080\nAngus McKinnon 180 January 18 & 19 due January 19\nJ. Gilles $72 due 75 by 15 copy paid westworth\n\nOnly we cannot again collect.\n\nP. M. Quail et al $18-077, 10078, 10079 & 10080\n\nInsured to you in these before\nyour auction & your due diligence\n\n$114.64.40. November 19\n\nSamuel Henderson $840.30. (not 75 by 15)\n\nJ. Fraser $1355.35 due October 86. send to\n\nWhile we hope he can locate him I heard he was\nworking near Kildonan\n\nJim Bell $30 due October 90 will send you\nHi in fuel in a few days hole does not bear out but I added a to for trouble of going back him\nI Kearns #909719098\nSamuel Reppa farming at High Bluff should be able to pay German crop without judgment\nthat he went out once to make a change how you\nany more of judgment from thing #1269.50\nW Robinson 9575 is due January 16\nHenderson\nJame Bell #9304, 9315, 9357, 9352\nChas Thompson #9329 275 due January wrote you\nbefore about this man\nJoseph Hall #11634, 11633 by writing to St John's\nDakota Bentonton Dakota see if you can\nlet me know I will keep these holes I may be\ngoing near these places\nThis is all at present\n\nYours truly,\nMcReeve\nRegina Nov 7th 1890\n\nA.W. Wickamboy\nAttorney at Law\n\nQuappilano\n\nDear Sir,\n\nEnclosed please find note #9819\nfor a receipt for two due payments $46 & $348. Cavanagh\n& Capilano due January 5th for $100.00 also Chat\nMoss Capilano length American by 216. Moss\nCavanagh to Cox $46. Moss Sandall softball\nMoss Sherratt softball $4.88 Moss McNaught\nvolunt 1/2\n\nKindly acknowledge by J.H. Winnipeg\n\nYours truly,\nW. M. Macdonald", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/2016013-002.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 48, "total-input-tokens": 81244, "total-output-tokens": 12526, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1184, 1], [1184, 2357, 2], [2357, 3192, 3], [3192, 4142, 4], [4142, 4991, 5], [4991, 6047, 6], [6047, 7050, 7], [7050, 7968, 8], [7968, 9086, 9], [9086, 10230, 10], [10230, 10618, 11], [10618, 11499, 12], [11499, 12631, 13], [12631, 13765, 14], [13765, 14885, 15], [14885, 16015, 16], [16015, 16812, 17], [16812, 17233, 18], [17233, 18130, 19], [18130, 19246, 20], [19246, 20323, 21], [20323, 21413, 22], [21413, 22279, 23], [22279, 23207, 24], [23207, 24064, 25], [24064, 24986, 26], [24986, 25727, 27], [25727, 26860, 28], [26860, 27948, 29], [27948, 28824, 30], [28824, 29665, 31], [29665, 30816, 32], [30816, 31965, 33], [31965, 32932, 34], [32932, 33849, 35], [33849, 35004, 36], [35004, 36160, 37], [36160, 37354, 38], [37354, 38366, 39], [38366, 39208, 40], [39208, 40228, 41], [40228, 41198, 42], [41198, 41530, 43], [41530, 41816, 44], [41816, 42487, 45], [42487, 43363, 46], [43363, 44001, 47], [44001, 44420, 48]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]