[{"id": "19ad7ac1b222bc550f514db5587d863dc94d9dfd", "text": "Vancouver BC\nNov 25th 1890\n\nForbes Esq\nAttorney & Co.\nMoosomin MB.\n\nDear Sir,\n\nYour favor of the 3rd inst. came in due time but delayed answering until I heard from Winnipeg in the matter.\n\nI certainly knew of no such understanding as you spoke of. Mr. Calvert says he knows of none though no doubt it was the intention naturally enough to simplify only one solicitor in any one place.\n\nAs to the Gibson note you refer to, I have never seen this note nor paid more head of it until you mentioned it in your letter. I understand you wrote about this man lived East. The note was made for collection was forwarded from there to me while.\n\nAs to the Poller note it was sent to me while there an error in my part but it is only a small matter thus not going so far to make any change.\n\nYou refer to other notes in the hands of some while belonging to Mr. Calvert & Mr. Wilson's Bank. I found they were some very small\nNotes (I don't now just remember the number in which returned by me to Mr. Calvert's suggestion with my concurrence to me while your purely business was so without a single exception, if my memory is correct, you reported the parties to me as agreed from the fact that you had the notes for two or three years I was not able to collect the money it would seem that your statement was correct, for certain special reasons which it is not necessary for me to mention I thought for while might be able to make the money if you surely cannot not blame us for making the transfer that there may be no further misunderstanding between us I might add that I certainly agreed between with you when you stated your time was so taken up with other business that you were not able to look after the Collections as they should be looked after.\n\nTo both Mr. Robott & the Bank we seemed to have been unnecessary delay in recognizing on these Notes & had instructions if I thought it best to transfer all our Collections in the manner to another Solicitor simply because of this delay or want of attention as they thought to their interests and you must admit that the notes were kept in a rather\nConceivably, fashion might be almost impossible without any definite information about the majority of them other than the pictures were \"no good\" would not be found,\" and I think I would have been perplexed in taking the course suggested, but I must say when a person can make time as a gentleman and to me at least it would have been a most unpleasant task to make any transparencies suggested.\n\nI got the holes as far as possible in shape where such were to hang. I sent you instructions to see what the pictures promised to pay. I left the invoices with you for payment, and I wrote advising against any manner of payment except as to the few cases I have before explained.\n\nI must say that all collections made have been promptly remitted, as trust this explanation will be satisfactory matters will go on pleasantly between you and the parties interested. In the meantime, supply the Sanderson Blythe Bristol suits are progressing favorable. I would be glad to hear how they stand whether you have been able to get judgment by default or if there is a chance of settlement getting actually my address will still be Bristol Hope.\n\nYours truly,\n\n[Signature]\nVancouver BC\nNov. 29th 1930\n\nWm Smith Esq\nInappelle St.\nMrs.\n\nDear Sir,\n\nIt is now almost two weeks since you came here from Regina in this matter stating your second opinion in this matter. I have now received a statement from Winnipeg on the matter. The delay being due to the miscarriage of the letter Mr. Calvert says, as I'm assured did, that this last note was never in his records and was a matter of fact Mr. Accord knew nothing about the note at the time of settlement.\n\nThe note did not leave the Winnipeg office until mid June 88 and then sent to Mr. Strong for Collection. Mr. Calvert says he was told the note was not sent because there was no use pressing on this note until mugs was paid as he understood they were paying as fast as they could on the mortgage. I also received a statement from him as to payments made between the date of 61st and 29th about which I specially asked him, as well as a general\nStatement showing all payments made\nI find, as the stores, there were no payments\nwhatever made between the 15th and 24th the\n1st was settled the second action brought\nthis being the case it is absolutely impossible\nthat the last note could by any means have\nbeen included in the statement.\n\nKindly see your client at once show the\nmatter put in shape I have written Mr. Dickens\nfully in the matter she will see you about it\n\nR. Dundas.\n\nHave you been able to get copies of these\nreceipts yet? If not would you kindly have\nhim bring them next week? Copies to Mr.\nCalvert. I will pay your your agency charges\nin the matter otherwise.\n\nR. Cavanagh.\n\nIf this matter is settled without delay I put\nin a satisfactory state I have instructed Mr.\nDickens to make a slight reduction in the rate\nof interest.\n\nYours truly,\nA. M. Powell\nVancouver BC\nMay 23rd 90\n\nThe Last Name is Unknown\nAttorney of\nAnd Spellings\n\nDear Sir,\n\nR. Cavanagh Hopkinson\n\nI have at last received a statement from Winnipeg in this matter of which I have no payments whatever between the $15 paid to settle the first suit and the bringing up of the second action in settlement of which the mortgage was given as by no possibility could this last note have been included. At the same time I cannot see how a deed made up the total amount of mortgage records.\n\nBooks were all burned in a fire he had. I cannot get any information there. When the last suit was brought there appears to have been paid in cash after note. Question due January 8th following payments July 28th 1875; April 8th 90. (This would be the payment referred to in Edwards letter to Rogers. Copy of which Smith has obtained by them to have been made but for which no credit was given.) $15 May 25th 1866. This was paid in settlement of first suit allowing these credits, the balance\ndue on this note & the $20 due January 16th, advanced or would at date of receipt not exceed $50. I don't remember exactly how much I made it, and how second got $1046 in most I can't say. But he says Colvest also states most positively that the last note was not included in this settlement.\n\nI have written Smith that he must see his claims at once show the matter put in shape. This last note bears 1/3rd but as however this difficulty appears in our former statement I wanted him willing to reduce the rate to 9%. Because as the mortgage did not check to $1000 one way or the other as the amounts large I wish you would give the matter your best attention. Have it put in shape at once a new chat mop for balance due an old mop or the note would suit both defendants having good crops this year might be able pay the whole thing off not half this fall share of next would suit.\n\nI am satisfied Smith thinks so we do that our claim is good & they will come to terms. We special reason why I wish the thing straightened out at present as that we will have to amend our claim in Calvert's Bondsmen, we wish to do so\nbefore pulling up securely.\n\nI hope our India enjoyed the trip through to the East.\n\nThe scenes are so awful in their grandeur. No language would fail to convey to the reader any adequate idea or conception of the scenes described.\n\nYou might write Calvert as soon as you get this matter put in shape.\n\nYours truly,\n\nM. B. Reed\nVancouver B.C.\nNov 24 1890\n\nColumbus Company Esq.\nGreenfield House\n\nDear Sir,\n\nI have received your letter some time ago in this matter but instead it was a consequence the matter was overlooked. Though your offer is smaller than we should accept, yet for the purpose of funding the business of which we are anxious to do we will comply with the terms of your letter by accepting the delivery of the plow.\n\nAnd I enclose note for that amount which kindly sign and let me know when you will notify me what he wished done with plow.\n\nYours truly,\n[Signature]\n\nP.S.\nVancouver B.C.\nMay 16th 1890\n\nDear Sir,\n\nYour favor came to hand in due time. But I delayed answering until I could hear from Winnipeg in the matter. My former proposition to you was that if you could not pay the loan this fall we would give you a few months in the second so as however we are anxious to wind the matter up in order to more than fairly meet you, we will accept the full amount paid before the 1st January. If you desire to avail yourself of this chance to settle such a large claim, write to Mr. Calvert Bo-41219 Winnipeg & I will write him your instructions. I understand you still own the acre near Wolsley. Such being the case we only should not accept much less than full amount but as we wish to close all these matters up this proposition is open to you.\n\nYours truly,\nM. Russell\nVancouver, BC\nMay 15, 1890\n\nMr. Halvorson,\n\nDear Sir,\n\nI am sending you this note to let you know that I had written to Alexander but had not received any reply. Upon arriving here I found a letter from him awaiting me stating that he was in Portland. I did not state my business when writing him at Alexander, hence you Saturday to send notice to Portland, but was too late for the mail as there is no mail today. You will not have time to catch me here on 3rd so you had better not send them unless further notify you.\n\nI am at present laid up with a sore knee. Went to see Dr. as soon as I arrived and told me to put it in a cast. I did the former but not the latter as I wanted to keep up my men out here. As a consequence my leg is worse than before. The Dr. says I must keep quiet for a few days. I am spending today in the house but hope to get out tomorrow to work up my men. I go over to New Westminster Wednesday where Frank Wright who owns a note is keeping me on Thursday so to Victoria where Hamilton\nA boat is now lying from China to Seattle & Seattle to Portland & from Portland to San Francisco. If my bag does not come to hand I will be much here a few days longer.\n\nThe trip through the mountains is past description. It must be seen in order to have an idea of its appearance. I would not have missed it for a good deal.\n\nVancouver is a bustling town where everything is new fresh no old houses. The streets are large & fine equally. From the judging from appearances it will be one of the cities of the future.\n\nHave I mentioned Saturday about his note the claims before receipt from Westbrook for the amount stated what the machinery sold for as he Westbrook took machinery back paid up for cash.\n\nI enclose note of ac Hunter due 1st Decr. given for Marquette Rake & Supplicated it to you before I was heading Note to see if I could not catch Marquette but I can get no trace of him.\n\nIf I get back to London by Christmas I won't be able to do much work after my return from this trip.\n\nP.S. Have written Tobes a little which I hope P.M. Roweco will be well remembered.\nVictoria BC\nMarch 16th 1890\n\nAM Peterson Esq,\nAttorney at Law\n\nDear Sir,\n\nThe enclosed mortgage is given by me to the Molson Bank to secure them payment of a note they hold against me for an amount of money I do not wish.\n\nAs you are my Solicitor and acting for me in respect of my Manitoba claims Mr. Powell who acts for the Bank has consented that the mortgage should be sent to you for inspection and is not to be refused or delivered up until you see or hear from Mr. Powell.\n\nIf there is no valid objection to the mortgage you are to deliver it to him for registration and in any case the Bank is not to be placed in a worse position than if they had judgment against me at this date.\n\nYours truly,\nDear Mr. Abbott,\n\nYour telegram of last night is received and contents noted.\n\nAs the night clerk is aware the coat lost by me at your hotel was left by me on the rack at the entrance to the dining room, where a number of other coats were where the elevator boy or some of the clerks was at the time standing, and as I stated before leaving I must hold you accountable for the coat.\n\nYou state in your telegram after speaking of coat claimed by permanent guest \"no knowledge of any other.\" If you wish to infer that I did not have a coat at all or leave it as I state I must thank you for the implication on my honesty. I did have a coat when I arrived and there was no coat to be found when I came to leave. This can easily be proven by the gentleman who came with me to the hotel whom I only knew from having met him in the boat and whose I believe a\nmerchant at Winnipeg, and also by a member of this who saw me with the coat.\n\nIf you wish to know who I am whether I wished you to put up a job or not, you can easily find out in Enquiry. I represent the firm of Fraser & Fraser Solicitors of London & Co., here out here on business for the London Branch of the Molson's Bank, one of the largest Banks of Canada. I can give you a hundred respectable letters from whom you could make inquiries if you wish parties living in San Francisco, Seattle, Victoria, Vancouver, Manitoba or Ontario.\n\nI was recommended to go to your Hotel by a friend a Commercial man travelling on the coast, so took the other gentleman with me as he had intended going to the Grand Café or whatever you call it and something. The coat itself was a brown melton with four Buttons covered with the same cloth as the coat. The collar button was a black one smaller than the others. It was lined with a heavy striped greyish woolen lining and the collar was of the same cloth as the coat. In the pockets were a pair of soiled Kid Gloves & several Ry time letters (possibly some personal letters but am not sure about this).\nand although I cannot relieve you from responsibility, for surely a queen's coat placed where it was, other coats and where yours are often placed in good faith should be protected and unless I am greatly mistaken the law does protect them... yet I think the best course is pursue. If you cannot find any trace of coat around hotel, and I am prepared to take your word for it, though you appear to doubt mine, would be to notify the police of your description of coat as the party taking coat might still be around town or have moved as thieves often do and also advertise it in your daily papers as having been taken from your hotel on the night of 10th December by mistake or intentionally so, offering a reward for its return and threatening prosecution if not returned.\n\nAs the coat is worth between $25-$30 more out here I do not feel like letting the matter drop without making an effort either to get back the coat or its value and apart from the question of legal rights in the media I think it is only fair that you should make some effort to recover the coat. I will be in Great Falls on 19th and will be glad to hear from you there after that date. Box 1311, [illegible] will be my address then.\nSteam Ship Oregon\nMarch 1890\n\nJ.J. Calvert Esq.,\nWinnipeg Man\n\nDear Sir,\n\nReceived your letter enclosing\ntwo letters to Portland, but was unable to find\nthe same. I had left Portland a few days before\nthey had instructions from me to forward his\nmail there for the present.\n\nI was not able to find any news at Seattle\n& thought they cannot be there as all the letters\nfrom them (3) were still in Post Office undelivered\nfor nor could I get any trace of Evans. I think\nwe should see this man at once for service\nthis Bro.\n\nHarold Am. Bishop who was given up as\nlost for a conveyance of his homestead near\nBendview for the debt ($70). Not interested\nwould be worth less anyway. Mr. Sullivan is I\nbelieve at Great Falls & will probably go there.\nhim. I will look up about road and other\nall being well I get to San Francisco Sunday\nthe 14th.\n\nYours Truly,\nP.M. Powell\nIncorporated\n\nDec. 19th\n\nMr. Nelson Eddy\nAutoglyol\nBrandon Man.\n\nDear Sir,\n\nMcLennan Bank & Co.\n\nI sent you a mortgage the other day Hamilton R. Took to the McLennan Bank for incorporation. Enclosing a letter from Mr. Took to this effect as the mortgage is in the usual statutory form and contains no special clauses. I suppose you will have no objection to it. It would be shipped upon inspection you find satisfactory. You would forward it to my address Bay 1319 Winnipeg. I will get it on my return about next week. Our reason for not wishing you to see the mortgage was that he thought you might have sold the place but I guess there is no danger of that.\n\nYours in C.,\nM. W. Powell\nM Sullivan Esq,\nGreat Falls,\nMont.\n\nDear Sir,\n\nI expect to be in Great Falls on Saturday or Monday the 20th or 22nd. I wish to see you on important business. I would like if you would drop a card in the Post Office to let me know where I could find you as I don't expect to be able to stay long in the town.\n\nYours truly,\nM.W. Howell\nGreat Falls  \nDec 26 1890\n\nM Sullivan  \nS S Wallace  \nMaha\n\nDear Sir,\n\nI came up here to see you today about the matter I wrote you some time ago. It was in reference to 3 notes of yours held by the Molson's Bank given to the North American Co. for a McCormick Binder. These notes do you all aware are long since past due. Should have been settled long ago. In fact our delay to this time has been due to the fact that we were not aware of your address until recently. The notes originally were for $110, $70, $110 respectively. There is due upon them for principal, interest, and penalty the sum of $576.63.\n\nKindly undertake by return mail to Box 1319 Winnipeg as unless these notes are paid we must proceed to collect them at once.\n\nYours truly,\nM. Rowell\nWinnipeg Man\nDec 31/59\n\nMr. Manuel Esq\nVancouver BC\n\nDear Sir,\n\nI have submitted your case to the Bank's Collector & stated all the facts herein as well as your offer of settlement and although he is less satisfied as I am about our legal rights in the matter yet in order to avoid the expense of a suit in BC he is willing to make a fair compromise. He thinks $200 is more than fair offer in the Bank's part that we really should not take less in fact would not take that many thousands that as I said when in Vancouver we were assured as to your financial position. However, pleased the matter of a settlement for the last mentioned reason the finally consented to take $200 cash although we both think this is conceding somewhat yet as it was not cost us considerably to proceed but there we wanted to take this sum cash which is practically yours.\nup your Claim for a new ring.\n\nI would like to hear from you by return mail whether you will accept the offer not as I propose returning everything promptly about which I am writing unless it is agreed upon before I wish to instruct our Solicitors in the matter.\n\nIt was understood that I should write your Solicitor in the matter but I have his address in my Statement Book where you got the Book with me so you can inform him of the reason.\n\nMy address is Bowling Green.\n\nYours truly,\n\nM.M. Powell\nDear Sir,\n\nRe McIntosh Transfers\nEnclosed please find original\nartifacts and affidavit of value\nas requested.\n\nRushly have transfers signed\nand certified today address\nwriting as soon as possible\nwith whom or your first will\nunit if they exceed the amount already\nsent.\n\nYours truly,\n[Signature]\n\nMay 7, 1890\nDear Sir,\n\nWe are making some arrangements with Colin H. Cameron so by which he is to return a plow to us. I have written him to deliver it to you. Should you take charge of it when it comes in and effect a useful gift for us.\n\nBe my most farm\n\nI expect to go to Bradview Wednesday to show my new hot press if you have any purchase in view you might help me a line by that time to Bradview. I will be in Brandon Monday.\n\nYours truly,\nRev. Rowell\nDear Sir,\n\nSome time ago I wrote you about purchasing some boxes of shirts but do not have yet an reply would you kindly let me hear from you by return college.\n\nYours truly,\nMorrow\nBoy 1319", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/2016013-003.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 45920, "total-output-tokens": 5352, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 914, 1], [914, 2096, 2], [2096, 3258, 3], [3258, 4181, 4], [4181, 5008, 5], [5008, 5998, 6], [5998, 7115, 7], [7115, 7443, 8], [7443, 7443, 9], [7443, 8006, 10], [8006, 8809, 11], [8809, 9823, 12], [9823, 10900, 13], [10900, 11604, 14], [11604, 12457, 15], [12457, 13600, 16], [13600, 14807, 17], [14807, 15672, 18], [15672, 16359, 19], [16359, 16693, 20], [16693, 17452, 21], [17452, 18304, 22], [18304, 18804, 23], [18804, 19113, 24], [19113, 19559, 25], [19559, 19749, 26]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]