[{"id": "3111876886256cf5585e63c38195e5e25cab83ec", "text": "The Treaties of Canada\nwith the\nIndians of Manitoba\nthe\nNorth-West Territories,\nand Kee-Wa-Tin.\nTO PERPETUATE THE HISTORY AND DEVELOPMENT OF THE PEOPLE REPRESENTED BY THE ABOVE CHIEFS AND WISE MEN THIS COLLECTION HAS BEEN GATHERED BY THEIR FRIEND\n\nEDWARD EVERETT AYER\n\nAND PRESENTED BY HIM TO\n\nTHE NEWBERRY LIBRARY\n\n1911\nIn re\n\nSt. Catharine's\n\nTo The Honorable\n\nChief Justice Hayworth\nTHE TREATIES OF CANADA.\n\nWITH\n\nTHE INDIANS OF MANITOBA\n\nAND\n\nTHE NORTH-WEST TERRITORIES.\n\nINCLUDING\n\nTHE NEGOTIATIONS ON WHICH THEY ARE BASED, AND OTHER INFORMATION RELATING THERETO.\n\nBY\n\nTHE HON. ALEXANDER MORRIS, P.C.,\n\nLATE LIEUTENANT-GOVERNOR OF MANITOBA, THE NORTH-WEST TERRITORIES, AND KEE-WA-TIN.\n\nTORONTO:\n\nWILLING & WILLIAMSON.\nAyer\n168.8\nMau\nM8\n1880\n\nAyer 4186\nTO HIS EXCELLENCY\n\nThe Right Honorable the Earl of Dufferin,\n\nHer Britannic Majesty's Ambassador at St. Petersburg, K.P.P.C.,\nK.C.B., G.C.M.G., &c., &c., &c.\n\nMy Lord,—\nEncouraged by the earnest interest, your Lordship ever evinced, in the work of obtaining the alliance and promoting the welfare of the Indian tribes in the North-West of Canada, and in opening up the Territories for settlement, by obtaining the relinquishment of the natural title of the Indians to the lands of the Fertile Belt on fair and just terms, I have the honor, by your kind permission, to dedicate this collection of the treaties made with them, to your Excellency, in the belief that its publication will be timely, and that the information now supplied in a compact form, may prove of service to the Dominion of Canada.\n\nI have the honor to be\nYour Lordship's obedient servant,\n\nALEXANDER MORRIS,\nLate Lieut.-Gov. of Manitoba, the North-West Territories, and Kee-wa-tin.\n\nTORONTO, March, 1890.\nPREFACE.\n\nThe question of the relations of the Dominion of Canada to the Indians of the North-West, is one of great practical importance. The work, of obtaining their good will, by entering into treaties of alliance with them, has now been completed in all the region from Lake Superior to the foot of the Rocky Mountains. As an aid to the other and equally important duty—that of carrying out, in their integrity, the obligations of these treaties, and devising means whereby the Indian population of the Fertile Belt can be rescued from the hard fate which otherwise awaits them, owing to the speedy destruction of the buffalo, hitherto the principal food supply of the Plain Indians, and that they may be induced to become, by the adoption of agricultural and pastoral pursuits, a self-supporting community—I have prepared this collection of the treaties made with them, and of information, relating to the negotiations, on which these treaties were based, in the hope that I may thereby contribute to the completion of a work, in which I had considerable part, that, of, by treaties, securing the good will of the Indian tribes, and by the helpful hand of the Dominion, opening up to them, a future of promise, based upon the foundations of instruction and the many other advantages of civilized life.\n\nM.\n## CONTENTS.\n\n| CHAPTER                                      | PAGE |\n|----------------------------------------------|------|\n| Introduction                                 | 9    |\n| I. The Selkirk Treaty                        | 13   |\n| II. The Robinson Treaty                      | 16   |\n| III. The Manitoulin Island Treaty            | 22   |\n| IV. The Stone Fort and Manitoba Post Treaties, Numbers One and Two | 25   |\n| V. Treaty Number Three; or, the North-West Angle Treaty | 44   |\n| VI. The Qu’Appelle Treaty, or Number Four    | 77   |\n| VII. The Revision of Treaties Numbers One and Two | 126  |\n| VIII. The Winnipeg Treaty, Number Five       | 143  |\n| IX. The Treaties at Forts Carlton and Pitt   | 168  |\n| X. Treaty Number Seven; or, the Blackfeet Treaty | 245  |\n| XI. The Sioux in the North-West Territories   | 276  |\n| XII. The Administration of the Treaties—The Half-breeds—The Future of the Indian Tribes | 285  |\n| Appendix—Texts of the Treaties and Supplementary Adhesions thereto | 299  |\nTHE\n\nTREATIES WITH THE INDIANS\n\nOF\n\nMANITOBA, THE NORTH-WEST TERRITORIES,\n\nAND KEE-WA-TIN,\n\nIN THE\n\nDOMINION OF CANADA.\n\nINTRODUCTION.\n\nONE of the gravest of the questions presented for solution by the Dominion of Canada, when the enormous region of country formerly known as the North-West Territories and Rupert's Land, was entrusted by the Empire of Great Britain and Ireland to her rule, was the securing the alliance of the Indian tribes, and maintaining friendly relations with them. The predecessors of Canada—the Company of Adventurers of England trading into Hudson's Bay, popularly known as the Hudson's Bay Company—had, for long years, been eminently successful in securing the good-will of the Indians—but on their sway, coming to an end, the Indian mind was disturbed. The events, that transpired in the Red River region, in the years 1869-1870, during the period when a provisional government was attempted to be established, had perplexed the Indians. They, moreover, had witnessed a sudden irruption into the country of whites from without. In the West, American\ntraders poured into the land, and, freighted with fire-water, purchased their peltries and their horses, and impoverished the tribes. In the East, white men took possession of the soil and made for themselves homes, and as time went on steamboats were placed on the inland waters—surveyors passed through the territories—and the \"speaking wires,\" as the Indian calls the telegraph, were erected. What wonder that the Indian mind was disturbed, and what wonder was it that a Plain chief, as he looked upon the strange wires stretching through his land, exclaimed to his people, \"We have done wrong to allow that wire to be placed there, before the Government obtained our leave to do so. There is a white chief at Red River, and that wire speaks to him, and if we do anything wrong he will stretch out a long arm and take hold of us before we can get away.\" The government of Canada had, anticipating the probabilities of such a state of affairs, wisely resolved, that contemporaneously with the formal establishment of their rule, there should be formed alliances with the Indians. In 1870 the Parliament of Canada created the requisite machinery for the Government of the Province of Manitoba and of the North-West Territories respectively, giving to the former a Lieutenant-Governor and Legislature, and to the latter, a Lieutenant-Governor and Council, Executive and Legislative—the Lieutenant-Governor of Manitoba being ex officio Lieutenant-Governor of the North-West Territories. Subsequently the North-West Territories were erected into a distinct government, with a Lieutenant-Governor and Executive, and Legislative Council. The District of Kee-wa-tin, \"the land of the north wind,\" was also established, comprising the eastern and northern portions of the Territories, and placed under the control of the Lieutenant-Governor of Manitoba, and an Executive and Legislative Council. Since 1870, no less than seven treaties have been concluded, with the Indian tribes, so that there now remain no Indian nations in the North-West, inside of the fertile belt, who have not been dealt with.\nIt is the design of the present work to tell the story of these treaties, to preserve, as far as practicable, a record of the negotiations on which they were based, and to present to the many in the Dominion and elsewhere, who take a deep interest in these sons of the forest and the plain, a view of their habits of thought and speech, as thereby presented, and to suggest the possibility, nay, the certainty, of a hopeful future for them.\n\nPrior to proceeding to deal, with the treaties of the Dominion of Canada, it will render this book more complete to present the reader, with information as to three treaties which preceded those of the Dominion, viz., the treaty made by the Earl of Selkirk in the year 1817, those popularly known as the Robinson Treaties, made by the late Hon. William B. Robinson, of the City of Toronto, with the Indians of the shores and islands of Lakes Superior and Huron in the year 1850, and that made by the Hon. William Macdougall, for the surrender of the Indian title, to the great Manitoulin Island, both acting for and on behalf of the Government of the late Province of Canada.\n\nEre however entering upon an explanation of these two first-mentioned treaties, I submit a few brief observations:\n\nThe Indians inhabiting the region covered by the treaties in question, extending in Canadian territory from Lake Superior to the foot of the Rocky Mountains, are composed of distinct tribes having different languages.\n\nThe Ojibbewas, Chippawas, or Saulteaux as they now call themselves, are found in numbers in the District of Kee-wa-tin and the Province of Manitoba. In the North-West Territories they are not numerous except within the limits of Treaty number Four. These Indians migrated from the older Provinces of Quebec and Ontario many years ago.\n\nThe Crees, inhabit the North-West Territories and are divided into Plain, Wood and Swampy Crees, according to the region of the country they dwell in. The Swampy Crees reside in Manitoba and Kee-wa-tin.\n\nThe Black Feet nation are to be found towards the slope of\nthe Rocky Mountains, in the region comprised within the limits of the Treaty number Seven.\n\nA few Chippawayans, or Northerners, dwell within the North-West Territories.\n\nThe once powerful nation of the Assiniboines, or Stonies—a kindred tribe to the Sioux—are greatly reduced in numbers, and are now only to be met with in the North-West Territories.\n\nThe Sioux in the Dominion are refugees from the United States, the first body having come over some fourteen years ago. A large influx of similar refugees, have recently fled to the Dominion from, the same country, as the issue of the recent war between the United States and the Sioux.\nCHAPTER I.\n\nTHE SELKIRK TREATY.\n\nIn the year 1811, the Earl of Selkirk purchased* from the Governor and Company of Adventurers trading into Hudson's Bay, in consideration of ten shillings and certain agreements and understandings contained in the Indenture, a large tract of territory within Rupert's Land described in the Indenture as follows:\n\n\"All that tract of land or territory being within and forming part of the aforesaid lands and territories of the said Governor and Company, bounded by an imaginary line running as follows, that is to say, beginning on the western shore of the Lake Winnipic, otherwise Winnipeg, at a point in fifty-two degrees and thirty north latitude and thence running due west to the Lake Winnipegoos, otherwise called Little Winnipeg, then in a southerly direction through the said Lake so as to strike its western shore in latitude fifty-two degrees, then due west to the place where the parallel of fifty-two degrees north latitude intersects the western branch of Red River, otherwise called Asseniboine River, then due south from that point of intersection to the height of land which separates the waters running into Hudson's Bay from those of the Missouri and Mississippi, then in an easterly direction along the said height of land to the source of the River Winnipic, or Winnipeg (meaning by such last named river the principal branch of the waters which unite in Lake Sagenagos), thence along the main stream of these waters and the middle of the several lakes through which they flow to the mouth of the Winnipic River and thence in a northerly\n\n* Vide Appendix for copy of the agreement in question.\ndirection through the middle of Lake Winnipic to the place of beginning.\" The deed is accompanied by a map intended to show the tract of country, and there is an endorsement on the map that as the surveys were not sufficient to ascertain with precision whether, latitude 52° does intersect the river called Red or Assiniboine River, it was agreed, that in case the waters of Red River, shall on more accurate survey be found, not to extend so far north as latitude 52°, then the west boundary of the tract of land intended to be within the grant, should be a line drawn due north and south, through the post upon the Red River, marked on the plan as \"Carlton House.\"\n\nThe Company reserved the right to call upon the Earl to set off one-tenth, however, of the tract for the use of the servants of the Company—and the Earl covenanted, within ten years, to settle within the tract one thousand families, each of them consisting of one married couple at the least, on pain of revocation of the grant, if on receipt of notice to that effect from the Company he did not, within three years after the receipt of the notice, complete the settlement of the one thousand families.\n\nIn pursuance of his obligations, Lord Selkirk, in the autumn of the year 1811, sent out a number of families from the County of Sutherland, in Scotland, who spent the winter at Fort Churchill on the western shore of Hudson's Bay. On the arrival of spring, they travelled thence to the confluence of the Assiniboine and Red Rivers, and thus was commenced the interesting settlement of the Red River, which is now included in the Province of Manitoba. It is not my purpose to notice here the eventful history of the Selkirk colonists, and I will only note the fact that in 1836, the Company bought back the whole tract, from the heirs of Lord Selkirk, for the sum of £84,000, the rights of colonists who had purchased land between 1811 and 1836, being respected.\n\nIn the year 1817 the Earl of Selkirk, visited his wide domain, and entered into negotiations with the Indian tribes, for the extinction of their title, to a tract of land described as follows:\n*“All that tract of land adjacent to Red River and Assini-\nboine River, beginning at the mouth of Red River and extend-\ning along the same as far as Great Forks at the mouth of Red\nLake River and along Assiniboine River as far as the Musk\nRat River, otherwise called Rivière des Champignons, and ex-\ntending to the distance of six miles from Fort Douglas on every\nside, and likewise from Fort Doer, and also from the Great\nForks and in other posts extending in breadth to the distance\nof two English statute miles back from the banks of the river.”\n\nThe Indians then inhabiting the region were described as\nbeing of the Chippawa or Saulteaux and Killistine or Cree\nnations. They were made to comprehend, the depth of the land\nthey were surrendering, by being told, that it was the greatest\ndistance, at which a horse on the level prairie could be seen, or\ndaylight seen under his belly between his legs. The consider-\nation for the surrender, was, the payment of one hundred pounds\nof good merchantable tobacco, to each nation annually.\n\nThe treaty was signed by Lord Selkirk and by five Indian\nchiefs, who affixed thereto drawings of the animals after which\nthey were named, by way of signature, a *fac simile* of which\nwill be found elsewhere. The surrender was to the Sovereign.\nLord, King George the Third. The treaty was accompanied\nby a map which shows that the tract surrendered extended to\nGrand Forks in what is now United States territory. A copy\nof the treaty will be found in the Appendix and will prove of\ninterest.\n\n* A large portion of the ceded territory is now comprehended in the Ter-\nritory of Dakota, United States.\nCHAPTER II.\n\nTHE ROBINSON TREATIES.\n\nIn consequence of the discovery of minerals, on the shores of Lakes Huron and Superior, the Government of the late Province of Canada, deemed it desirable, to extinguish the Indian title, and in order to that end, in the year 1850, entrusted the duty to the late Honorable William B. Robinson, who discharged his duties with great tact and judgment, succeeding in making two treaties, which were the forerunners of the future treaties, and shaped their course. The main features of the Robinson Treaties—viz., annuities, reserves for the Indians, and liberty to fish and hunt on the unconceded domain of the Crown—having been followed in these treaties. A special feature of the Robinson Treaties, was the adjustment of a claim made by the Indians to be paid, the amount received, by the Government, for the sale of mining locations. This was arranged, by Mr. Robinson, agreeing to pay them, the sum of £4,000 and an annuity of about £1,000, thus avoiding any dispute that might arise as to the amounts actually received by the Government. The number of Indians included in the treaties were stated by Mr. Robinson to be: on Lake Superior, 1240, including 84 half-breeds; and on Lake Huron 1422, including 200 half-breeds.*\n\nThe relations of the Indians and half-breeds, have long been cordial; and in the negotiations as to these initial treaties, as in the subsequent ones, the claims of the half-breeds, to recognition, was urged by the Indians.\n\n* The census return of the Department of the Interior for the year 1878 gives the numbers of these Indians as follows:\n\nChippawas of Lake Superior . . . . . . . . . . . . . . . . . 1,947\nChippawas of Lake Huron . . . . . . . . . . . . . . . . . . . 1,458\nI cannot do better, in giving information with regard to these treaties, than simply to reproduce the Report of Mr. Robinson to the Honorable Colonel Bruce, Superintendent-General of Indian Affairs, in which he describes the course of his negotiations and communicates their results. A copy of the treaties will be found in the Appendix. The Report is as follows:\n\nTORONTO, 24th September, 1850.\n\nSir:—I have the honor herewith to transmit the Treaty which on the part of the Government I was commissioned to negotiate with the tribes of Indians inhabiting the northern shore of Lakes Huron and Superior; and I trust that the terms on which I succeeded in obtaining the surrender of all the lands in question, with the exception of some small reservations made by the Indians, may be considered satisfactory. They were such as I thought it advisable to offer, in order that the matter might be finally settled, without having any just grounds of complaint on the part of the Indians.\n\nThe Indians had been advised by certain interested parties to insist on such extravagant terms as I felt it quite impossible to grant; and from the fact that the American Government had paid very liberally for the land surrendered by their Indians on the south side of Lake Superior, and that our own in other parts of the country were in receipt of annuities much larger than I offered, I had some difficulty in obtaining the assent of a few of the chiefs to my proposition.\n\nI explained to the chiefs in council the difference between the lands ceded heretofore in this Province, and those then under consideration, they were of good quality and sold readily at prices which enabled the Government to be more liberal, they were also occupied by the whites in such a manner as to preclude the possibility of the Indian hunting over or having access to them; whereas the lands now ceded are notoriously barren and sterile, and will in all probability never be settled except in a few localities by mining companies, whose establishments among the Indians, instead of being prejudicial, would prove of great benefit as they would afford a market for any things they may have to sell, and bring provisions and stores of all kinds among them at reasonable prices.\n\nNeither did the British Government contemplate the removal of the Indians from their present haunts to some (to them) unknown region in the far West, as had been the case with their brethren on the American side.\n\nI told them that the two chiefs who were in Toronto last winter (Shingwacouse and Nebennigoebing) only asked the amount which the Government had received for mining locations, after deducting the expenses attending their sale. That amount was about eight thousand pounds which the Government would pay them without any annuity or certainty of further benefit; or one-half of it down, and an annuity of about one thousand pounds.\nThere were twenty-one chiefs present, about the same number of principal men, and a large number of other Indians belonging to the different bands, and they all preferred the latter proposition, though two of them (Shingua-\ncouse and Nebennigoebing) insisted on receiving an annuity equal to ten dollars per head.\n\nThe chiefs from Lake Superior desired to treat separately for their terri-\ntory and said at once in council that they accepted my offer. I told them\nthat I would have the treaty ready on the following morning, and I immedi-\nately proceeded to prepare it; and, as agreed upon, they signed it cheerfully\nat the time appointed.\n\nI then told the chiefs from Lake Huron (who were all present when the\nothers signed) that I should have a similar treaty ready for their signature,\nthe next morning, when those who signed it would receive their money; and\nthat as a large majority of them had agreed to my terms I should abide by\nthem.\n\nI accordingly prepared the treaty and proceeded on the morning of the\nninth instant to the council-room to have it formally executed in the pres-\nence of proper witnesses—all the chiefs and others were present. I told them\nI was then ready to receive their signatures; the two chiefs, Shinguacouse\nand Nebennigoebing, repeated their demand of ten dollars a head by way of\nannuity, and also insisted that I should insert in the treaty a condition\nsecuring to some sixty half-breeds a free grant of one hundred acres of land\neach. I told them they already had my answer as to a larger annuity, and\nthat I had no power to give them free grants of land. The other chiefs came\nforward to sign the treaty and seeing this the two who had resisted up to this\ntime also came to the table and signed first, the rest immediately following.\n\nI trust his Excellency will approve of my having concluded the treaty on\nthe basis of a small annuity and the immediate and final settlement of the\nmatter, rather than paying the Indians the full amount of all moneys on\nhand, and a promise of accounting to them for future sales. The latter\ncourse would have entailed much trouble on the Government, besides giving\nan opportunity to evil disposed persons to make the Indians suspicious of\nany accounts that might be furnished.\n\nBelieving that His Excellency and the Government were desirous of leav-\ning the Indians no just cause of complaint on their surrendering the exten-\nsive territory embraced in the treaty; and knowing there were individuals\nwho most assiduously endeavored to create dissatisfaction among them, I\ninserted a clause securing to them certain prospective advantages should the\nlands in question prove sufficiently productive at any future period to enable\nthe Government without loss to increase the annuity.* This was so reason-\n\n* The annuities under these treaties have recently been increased, the\nfollowing item having been inserted in the Supplies Act of Canada, viz.,\n\"Annual grant to bring up annuities payable under the Robinson Treaty\nto the Chippawas of Lakes Huron and Superior, from 96 cents to $4 per\nhead, $14,000.\"\nable and just that I had no difficulty in making them comprehend it, and it in a great measure silenced the clamor raised by their evil advisers.\n\nIn allowing the Indians to retain reservations of land for their own use I was governed by the fact that they in most cases asked for such tracts as they had heretofore been in the habit of using for purposes of residence and cultivation, and by securing these to them and the right of hunting and fishing over the ceded territory, they cannot say that the Government takes from their usual means of subsistence and therefore have no claims for support, which they no doubt would have preferred, had this not been done. The reservation at Garden River is the largest and perhaps of most value, but as it is occupied by the most numerous band of Indians, and from its locality (nine miles from the Sault) is likely to attract others to it, I think it was right to grant what they expressed a desire to retain. There are two mining locations at this place, which should not be finally disposed of unless by the full consent of Shinguacouse and his band; they are in the heart of the village and shew no indications of mineral wealth, they are numbered 14 and 15 on the small map appended to Messrs. Anderson and Vidal's report. I pledged my word on the part of the Government that the sale of these locations should not be completed, and as the locatees have not, I believe, complied with the conditions of the Crown Lands Department there can be no difficulty in cancelling the transaction.\n\nThe chiefs are desirous that their several reservations should be marked by proper posts or monuments, and I have told them the Government would probably send some one next spring for that purpose. As I know many of the localities I shall be able to give the necessary information when required.\n\nWhen at Sault Ste. Marie last May, I took measures for ascertaining as nearly as possible the number of Indians inhabiting the north shore of the two lakes; and was fortunate enough to get a very correct census, particularly of Lake Superior. I found this information very useful at the council, as it enabled me successfully to contradict the assertion (made by those who were inciting the chiefs to resist my offers) that there were on Lake Superior alone, eight thousand Indians. The number on that lake, including eighty-four half-breeds, is only twelve hundred and forty—and on Lake Huron, about fourteen hundred and twenty-two, including probably two-hundred half-breeds; and when I paid the Indians they acknowledged they knew of no other families than those on my list.\n\nThe number paid, as appears on the pay list, does not show the whole strength of the different bands, as I was obliged at their own request to omit some members of the very large families. I have annexed to this Report the names of the chiefs, their localities, and number of souls in each band as recognized by me in apportioning the money, thinking it will be useful when paying the annuity hereafter.\n\nThis information may I believe be fully relied on for Lake Superior, but the census for Lake Huron is not so perfect; and I would suggest that Captain\nIronside should be furnished with copies of that document and also of the pay-lists, in order that he may correct, in time, any errors that are found to exist.\n\nAs the half-breeds at Sault Ste. Marie and other places may seek to be recognized by the Government in future payments, it may be well that I should state here the answer that I gave to their demands on the present occasion. I told them I came to treat with the chiefs who were present, that the money would be paid to them—and their receipt was sufficient for me—that when in their possession they might give as much or as little to that class of claimants as they pleased. To this no one, not even their advisers, could object, and I heard no more on the subject. At the earnest request of the chiefs themselves I undertook the distribution of the money among their respective bands, and all parties expressed themselves perfectly satisfied with my division of their funds.\n\nOn my arrival at Penetanguishene I found the chiefs Yellowhead and Snake, from Lake Simcoe, and Aissance, from Beausoleil’s Island, waiting to see me, to prefer their claim to a small tract of land between Penetanguishene and the vicinity of the River Severn. I was aware of their intending to make such a claim and took the precaution of asking the chiefs assembled in council at the Sault whether it was well founded, they emphatically declared that those chiefs had no claim on Lake Huron, that they had long since ceded their lands and were in the receipt of a large annuity, this I believe to be the case, and Captain Anderson, whom I met there, is of the same opinion; but I promised to inquire into it and give them an answer, and I will therefore thank you to cause the necessary information from your office to be furnished to me on the subject. Should it appear that these chiefs have any claim I think I could get their surrender of it for a small amount, and there remain sufficient funds at my disposal for the purpose.\n\nThe Canadians resident on the lands just surrendered at Sault Ste. Marie are very anxious to obtain titles to the land on which they have long resided and made improvements; they applied to me after the treaty and I advised them to memorialize the Government the usual way, setting forth the manner in which they were put in possession by the military authorities of the time, and that I had little doubt that the Government would do them justice. I think the survey of the tract should be made so as to interfere as little as possible with their respective clearings and that those who can show a fair claim to the favorable consideration of the Government should be liberally dealt with.\n\nIt will be seen on referring to the treaty that I have kept within the amount at my disposal. Of the £4,160 agreed by me to be paid to the Indians of both lakes, there remains £75 unexpended. I could not from the information I possessed tell exactly the number of families I should have to pay, and thought it prudent to reserve a small sum to make good any omissions, there may still be a few who will prefer claims, though I know of none at present. If not, the amount can be paid next year with the annuity\nto such families as are most deserving; or it may be properly applied in extinguishing the claim made by the Lake Simcoe Indians, should it appear on inquiry to be just.\n\nThe whole amount given to me in August was £5,033 6s. 8d., of this sum their remains £800, which I have placed in the Bank of Upper Canada to the credit of the Receiver-General, and I have prepared a detailed account of the whole, which, with the proper vouchers, I shall deliver to the Accountant of the Crown Lands Department.\n\nI have much pleasure in acknowledging the valuable assistance afforded me by all the officers of the Honorable the Hudson's Bay Company resident on the lakes; and the prompt manner in which their Governor, Sir George Simpson, kindly placed their services at my disposal.\n\nThe report made last year by Messrs. Anderson and Vidal I found of much use to me, and the long services and experience of the former gentleman in Indian affairs enabled him to give me many valuable suggestions.\n\nCaptain Cooper and his officers by attending at the council, and otherwise, gave me most cheerfully all the aid in their power; and Captain Ironside, of your Department, with his assistant, Assickinach, were of essential service to me.\n\nI found it absolutely necessary to have the aid of some one in taking the census of the Lake Huron Indians at the time they were receiving their presents at Manitoulin; and as Captain Ironside was fully occupied in attending to his own duty, I requested Mr. Keating, who had long known the Indians on that lake, to give me his assistance. This he cheerfully and very efficiently did, and afterwards was with me in distributing and paying out the money.\n\nI have, in course of my negotiations with the Indians on the present occasion, collected some information which may be useful to your Department and will at an early day send it to you.\n\nI will thank you to lay the two treaties accompanying this Report before His Excellency, and trust they may meet with his approval.\n\nI have, &c.,\n\n(Signed) W. B. ROBINSON.\n\nThe Hon. Col. Bruce,\nSuperintendent-General, Indian Affairs.\nCHAPTER III.\n\nTHE MANITOULIN ISLAND TREATY.\n\nSome years after the completion of the Robinson Treaties, the then Government of the old Province of Canada deemed it desirable to effect a treaty with the Indians dwelling upon the Great Manitoulin Island in Lake Huron, as a complement to the former treaties, and with the object of rendering available for settlement the large tract of good land upon the Island. The duty was entrusted to the Honorable William McDougall, then Superintendent-General of Indian Affairs, who, in the month of October, 1862, proceeded to the Island, accompanied by the late William Spragge, Esq., Deputy Superintendent of Indian Affairs, and Mr. F. Assicknack, of the Indian Office, Toronto, as interpreter. Mr. McDougall encountered considerable difficulties, but by firmness and decision eventually succeeded in obtaining a surrender from the Indians of the Island, excluding however from the surrender that portion of it easterly of Heywood Island and the Manitoulin Gulf.\n\nThe terms of the treaty, which will be found in the Appendix, were adapted to the peculiar circumstances of the Indians and were well and wisely framed. The result has been to render available for settlement a large tract of land on the Island, much of which is now occupied by a prosperous and thriving population. I conclude this brief notice of an important treaty by submitting, to the attention of the reader, the report of the Hon. W. McDougall, to His Excellency the Governor-General in Council, of the results of his mission.\nMANITOULIN ISLAND, November 3rd, 1862.\n\nThe undersigned has the honor to state for the information of His Excellency the Governor-General in Council, that, under the authority of the Order in Council of the twelfth day of September, 1862, he proceeded early in the month of October last to visit the Great Manitoulin Island, accompanied by William Spragge, Esq., Deputy Superintendent of Indian Affairs, and Mr. F. Assicknack of the Indian Office, Toronto, as interpreter.\n\nThe resident agent, Captain Ironside, under instructions from the Department, had caused the Indians residing on the Island to be notified of the intended visit of the undersigned, and of its object, and had summoned them to attend at Manitowaning on the fourth ultimo.\n\nThe Chiefs and principal men, with the exception of one or two detained by illness, and nearly all the males above the age of eighteen years, were present at the council.\n\nThe undersigned stated the object of his visit, explained the wishes of the Government in regard to the settlement of the Island, and proposed the terms in respect to the Indians specified in the Order in Council authorizing the negotiation. The Indians had selected one of their Chiefs to reply to the overtures of the Government, and without taking time to consider these overtures he proceeded to announce the determination of the Indians to reject them unconditionally.\n\nThe undersigned made some further explanations, and directed an adjournment of the council for an hour, during which time the Indians were requested to consider the propositions he had made with care and deliberation.\n\nOn re-assembling there was an evident disposition among the bands living westwardly of the place of meeting to listen favorably to the propositions of the Government, but the majority were still unwilling to treat, and by intimidation and threats of violence prevented any open expression of opinion except by the old war Chief, Assicknack, who declared his full assent to the wishes of the Government.\n\nAscertaining that the Chief's opposition came from Indians living eastwardly of Heywood Sound, the undersigned determined to modify the propositions of the Government, so as to meet in some degree the objections from that quarter.\n\nHe accordingly adjourned the council until the following Monday, the first day of meeting being Saturday, informing the Indians that those who were disposed to continue the negotiations would remain while those who had resolved to reject every proposition of the Government might go home. He also informed them that no threats or intimidation would be allowed, and that any one who should attempt violence would be surely punished. Nearly all the Indians remained or returned on Monday, and being apprised of the nature of the proposition the undersigned intended to submit, namely, to exclude that part of the island eastwardly of the Manitoulin Gulf and Heywood Sound from the proposed agreement, they came to the adjourned\nmeeting in a more friendly mood and expressed their willingness to surrender for sale and settlement all that part of the island westwardly of the Gulf and Sound.\n\nThe undersigned submits herewith the deed or instrument which embodies the agreement made and concluded between the respective parties. It was executed by the undersigned and the Deputy-Superintendent of Indian Affairs on behalf of the Government, and by nineteen of the Chiefs and principal men on behalf of the Indians.\n\nIn consequence of the modification of the terms of agreement authorized by the Order in Council as above-mentioned and the addition of other terms deemed necessary to prevent future difficulty, and which will be found in the instrument, the undersigned caused a provision to be inserted that it was not to take effect until approved by the Governor-General in Council.\n\nThe undersigned therefore now begs to submit the same for such approval.\n\n(Signed) WM. McDOUGALL,\nSuperintendent-General of Indian Affairs.\nCHAPTER IV.\n\nTHE STONE FORT AND MANITOBA POST TREATIES NUMBERS ONE AND TWO.\n\nIn the year 1871, the late Honorable Joseph Howe, then Secretary of State of Canada, recommended the appointment, by the Privy Council of Canada, of Mr. Wemyss McKenzie Simpson, as Indian Commissioner, in consequence of \"the necessity of arranging with the bands of Indians inhabiting the tract of country between Thunder Bay and the Stone Fort, for the cession, subject to certain reserves such as they should select, of the lands occupied by them.\" Mr. Simpson accepted the appointment, and in company with Messrs. S. J. Dawson and Robert Pether visited the Ojibewas or Chippawa Indians, between Thunder Bay and the north-west angle of the Lake of the Woods, and took the initiatory steps for securing a treaty with them thereafter. On his arrival at Fort Garry, he put himself, as directed by his instructions, in communication with his Honor, the Hon. A. G. Archibald, then Lieutenant-Governor of Manitoba and the North-West Territories. A conference took place between His Honor, Messrs. Simpson, Dawson and Pether, and the Hon. James McKay, a member, at that time, of the Executive Council of Manitoba, and himself a half-breed intimately acquainted with the Indian tribes, and possessed of much influence over them. The Indians in Manitoba, in the fall of 1870, had applied to the Lieutenant-Governor to enter into a treaty with them, and had been informed that in the ensuing year negotiations would be opened with them. They were full of uneasiness, owing to the influx of population, denied the validity of the Selkirk Treaty, and had\nin some instances obstructed settlers and surveyors. In view of the anxiety and uneasiness prevailing, these gentlemen were of opinion \"that it was desirable to secure the extinction of the Indian title not only to the lands within Manitoba, but also to so much of the timber grounds east and north of the Province as were required for immediate entry and use, and also of a large tract of cultivable ground west of the Portage, where there were very few Indian inhabitants.\" It was therefore resolved to open negotiations at the Lower Fort Garry, or Stone Fort, with the Indians of the Province, and certain adjacent timber districts, and with the Indians of the other districts at Manitoba Post, a Hudson's Bay fort, at the north end of Lake Manitoba, the territory being occupied principally by one nation, the Chippawas, of whom the Saulteaux of the lakes are a branch, although there are also a number of Swampy Crees resident within it.\n\nMr. Simpson accordingly issued proclamations, inviting the Indians to meet him on the 25th of July and 17th of August, 1871, at these points respectively, to negotiate an Indian treaty. The Lieutenant-Governor also issued a proclamation forbidding the sale or gift of intoxicating liquors during the negotiation of the treaty, and applied to Major Irvine to detail a few of the troops under his command to preserve order, which request was acceded to.\n\nThe Lieutenant-Governor and Mr Simpson arrived at the Stone Fort on the 24th of July, 1871, but as the Indians had not all arrived the meeting was postponed till the 27th, when a thousand Indians were found to have assembled, and a considerable number of half-breeds and other inhabitants of the country were present, awaiting with anxiety to learn the policy of the Government.\n\nLieutenant-Governor Archibald, after the Indians were assembled opened the proceedings by delivering the following address:\n\n\"On the 13th September last, on my first arrival in the\ncountry, I met a number of you at the mission, I told you I could not then negotiate a Treaty with the Indians, but that I was charged by your Great Mother, the Queen, to tell you that she had been very glad to see that you had acted during the troubles like good and true children of your Great Mother. I told you also that as soon as possible you would all be called together to consider the terms of a treaty to be entered into between you and your Great Mother.\n\n\"I advised you to disperse to your homes, and gave you some ammunition to enable you to gain a livelihood during the winter by hunting.\n\n\"I promised that in the spring you would be sent for, and that either I, or some person directly appointed to represent your Great Mother, should be here to meet you, and notice would be given you when to convene at this place to talk over what was right to be done.\n\n\"Early in the spring, Mr. Simpson, who sits beside me, was made Commissioner. He left his home at once for this Province, by Rainy Lake and the Lake of the Woods.\n\n\"The Indians of the lake districts meet, as you know, on Rainy River yearly, about the 20th June, to fish for sturgeon, and they could not be called together sooner.\n\n\"Mr. Simpson met them there at that time, and talked over their affairs with them, and made certain arrangements with them. He then hurried on to see you, and reached this Province a week ago last Sunday. He then sent messengers at once to all the Indians within certain bounds, asking them to meet him here on the 25th day of July. Some of you were unable to come so soon, and he has therefore, at the instance of those who were here, waited till to-day to open the talk. I believe that now you are all arrived, and ready to proceed to business.\n\n\"It will be the duty of the Commissioner to talk to you on the particular details of the treaty, and I will give place to him presently, but there are one or two things of a general kind\nwhich I would like, before I close, to bring to your notice, for you to think about among yourselves.\n\n\"First. Your Great Mother, the Queen, wishes to do justice to all her children alike. She will deal fairly with those of the setting sun, just as she would with those of the rising sun. She wishes order and peace to reign through all her country, and while her arm is strong to punish the wicked man, her hand is also open to reward the good man everywhere in her Dominions.\n\n\"Your Great Mother wishes the good of all races under her sway. She wishes her red children to be happy and contented. She wishes them to live in comfort. She would like them to adopt the habits of the whites, to till land and raise food, and store it up against a time of want. She thinks this would be the best thing for her red children to do, that it would make them safer from famine and distress, and make their homes more comfortable.\n\n\"But the Queen, though she may think it good for you to adopt civilized habits, has no idea of compelling you to do so. This she leaves to your choice, and you need not live like the white man unless you can be persuaded to do so of your own free will. Many of you, however, are already doing this.\n\n\"I drove yesterday through the village below this Fort. There I saw many well-built houses, and many well-tilled fields with wheat and barley and potatoes growing, and giving promise of plenty for the winter to come. The people who till these fields and live in these houses are men of your own race, and they shew that you can live and prosper and provide like the white man.\n\n\"What I saw in my drive is enough to prove that even if there was not a buffalo or a fur-bearing animal in the country, you could live and be surrounded with comfort by what you can raise from the soil.\n\n\"Your Great Mother, therefore, will lay aside for you 'lots' of land to be used by you and your children forever. She will not allow the white man to intrude upon these lots. She will\nmake rules to keep them for you, so that as long as the sun shall shine, there shall be no Indian who has not a place that he can call his home, where he can go and pitch his camp, or if he chooses, build his house and till his land.\n\n\"These reserves will be large enough, but you must not expect them to be larger than will be enough to give a farm to each family, where farms shall be required. They will enable you to earn a living should the chase fail, and should you choose to get your living by tilling, you must not expect to have included in your reserve more of hay grounds than will be reasonably sufficient for your purposes in case you adopt the habits of farmers. The old settlers and the settlers that are coming in, must be dealt with on the principles of fairness and justice as well as yourselves. Your Great Mother knows no difference between any of her people. Another thing I want you to think over is this: in laying aside these reserves, and in everything else that the Queen shall do for you, you must understand that she can do for you no more than she has done for her red children in the East. If she were to do more for you that would be unjust for them. She will not do less for you because you are all her children alike, and she must treat you all alike.\n\n\"When you have made your treaty you will still be free to hunt over much of the land included in the treaty. Much of it is rocky and unfit for cultivation, much of it that is wooded is beyond the places where the white man will require to go, at all events for some time to come. Till these lands are needed for use you will be free to hunt over them, and make all the use of them which you have made in the past. But when lands are needed to be tilled or occupied, you must not go on them any more. There will still be plenty of land that is neither tilled nor occupied where you can go and roam and hunt as you have always done, and, if you wish to farm, you will go to your own reserve where you will find a place ready for you to live on and cultivate.\n\n\"There is another thing I have to say to you. Your Great\nMother cannot come here herself to talk with you, but she has sent a messenger who has her confidence.\n\n\"Mr. Simpson will tell you truly all her wishes. As the Queen has made her choice of a chief to represent her, you must, on your part, point out to us the chiefs you wish to represent you, as the persons you have faith in.\n\n\"Mr. Simpson cannot talk to all your braves and people, but when he talks to chiefs who have your confidence he is talking to you all, and when he hears the voice of one of your chiefs whom you name he will hear the voice of you all. It is for you to say who shall talk for you, and also who shall be your chief men. Let them be good Indians, who know your wishes and whom you have faith in.\n\n\"You will look to the Commissioner to fulfil everything he agrees to do, and the Queen will look to the chiefs you name to us, to see that you keep your parts of the agreement.\n\n\"It is our wish to deal with you fairly and frankly.\n\n\"If you have any questions to ask, ask them, if you have anything you wish the Queen to know, speak out plainly.\n\n\"Now chiefs and braves and people, I introduce to you Mr. Simpson, who will say anything he thinks fit in addition to what I have said.\n\n\"When you hear his voice you are listening to your Great Mother the Queen, whom God bless and preserve long to reign over us.\"\n\nMr. Simpson also addressed them, and thereafter, in compliance with a request of the Lieutenant-Governor, the Indians retired to select their chiefs and principal spokesmen.\n\nOn the next day the conference was resumed, the chiefs and spokesmen being presented. The Indians, on being asked to express their views, \"stated that there was a cloud before them which made things dark, and they did not wish to commence the proceedings till the cloud was dispersed.\" On inquiry it was ascertained that they referred to the imprisonment of four Swampy Cree Indians, who had been convicted under a local\nlaw, of breach of contract, as boatmen, with the Hudson's Bay Company, and on default of payment of a fine, had been sent to prison. The Lieutenant-Governor, as a matter of favor, ordered the release of these prisoners, and the sky became clear. Next day the Indians met again and declared that they would never again raise their voice against the enforcement of the law, but much difficulty was experienced in getting them to understand the views of the Government—they wishing to have two-thirds of the Province as a reserve. Eventually on the 3rd of August, 1871, a treaty was concluded, its principal features being the relinquishment to Her Majesty of the Indian title; the reserving of tracts of land for the Indians, sufficient to furnish 160 acres of land to each family of five; providing for the maintenance of schools, and prohibition of the sale of intoxicating liquors on the reserves; a present of three dollars per head to the Indians and the payment to them of an annuity of three dollars per head.* (See copy of treaty which will be found in the Appendix.) On the 21st of August Mr. Commissioner Simpson, accompanied by the Lieutenant-Governor, the Hon. James McKay, and Mr. Molyneux St. John (lately Sheriff of the North-West Territories), met the Indians at Manitoba Post, and found them disposed to accept the terms of the treaty made at the Stone Fort, with which they had already become familiar, so that little time was lost in effecting a treaty with them as they had no special terms to prefer. By these two treaties, there was acquired by the Crown, the extinguishment of the Indian title in Manitoba, and in a tract of country fully equal in resources beyond it.\n\nHaving submitted these preliminary remarks, I conclude my notice of these treaties by quoting, as matter alike of historical record and practical interest, the despatches of Lieutenant-\n\n* In consequence of misunderstandings having arisen, owing to the Indians alleging that certain promises had been made to them which were not specified in these treaties, a revision of them became necessary, and was effected in 1875, as will be seen reported hereafter.\nGovernor Archibald and the excellent and instructive report, addressed to the Secretary of State by Mr. Simpson, embracing as it does a full and graphic narrative of the proceedings which took place at the negotiation of these treaties, and of the difficulties which were encountered by the Commissioner, and the mode in which they were overcome.\n\nGovernment House,\nSilver Heights, July 22nd, 1871.\n\nSir,—I have the honor to enclose you copy of a proclamation I have caused to be issued, with a view to prevent the danger arising from intoxicating drinks being given to the Indians, on the occasion of the meeting to negotiate a treaty.\n\nI look upon the proceedings, we are now initiating, as important in their bearing upon our relations to the Indians of the whole continent. In fact, the terms we now agree upon will probably shape the arrangements we shall have to make with all the Indians between the Red River and the Rocky Mountains. It will therefore be well to neglect nothing that is within our power to enable us to start fairly with the negotiations.\n\nWith that view, I have, amongst other things, asked Major Irvine to detail a few of his troops to be present at the opening of the treaty. Military display has always a great effect on savages, and the presence, even of a few troops, will have a good tendency.\n\nI fear we shall have to incur a considerable expenditure for presents of food, etc., during the negotiations; but any cost for that purpose I shall deem a matter of minor consequence. The real burden to be considered is that which has to be borne in each recurring year.\n\nI doubt if it will be found practicable to make arrangements upon so favorable a basis as that prescribed by His Excellency the Governor-General, as the maximum to be allowed, in case of a treaty with the Lake Indians.\n\nNor indeed would it be right, if we look to what we receive, to measure the benefits we derive from coming into possession of the magnificent territory we are appropriating here, by what would be fair to allow for the rocks and swamps and muskegs of the lake country east of this Province.\n\nBut to this subject I shall probably take occasion to call your attention at an early day.\n\nI have, etc.,\n\nADAMS G. ARCHIBALD.\n\nThe Honorable\nThe Secretary of State for the Provinces,\n\nOttawa.\nLower Fort Garry, July 29th, 1871.\n\nSir,—I have the honor to inform you that on Monday last I came to this Fort with the Commissioner to meet the Indians called here, with a view to negotiate a treaty, intending to open the business on Tuesday morning.\n\nIt appeared, however, on inquiry, that some bands of Indians had not arrived on Tuesday morning, and we were therefore obliged to postpone the opening of the meeting till Thursday. On that day the Indians from all the sections of the country to which the invitation extended were found present to the number of about one thousand. A considerable body of half-breeds and other inhabitants of the country were also present, awaiting with some anxiety to learn what should be announced as the policy of the Government.\n\nI enclose you a memorandum of the observations with which I opened the meeting. On reading them you will observe one or two points which may require some explanation.\n\nAt the time of the treaty with the Earl of Selkirk, certain Indians signed as Chiefs and representatives of their people. Some of the Indians now deny that these men ever were Chiefs or had authority to sign the treaty.\n\nWith a view therefore to avoid a recurrence of any such question, we asked the Indians, as a first step, to agree among themselves in selecting their Chiefs, and then to present them to us and have their names and authority recorded.\n\nFurthermore, the Indians seem to have false ideas of the meaning of a reserve. They have been led to suppose that large tracts of ground were to be set aside for them as hunting grounds, including timber lands, of which they might sell the wood as if they were proprietors of the soil.\n\nI wished to correct this idea at the outset.\n\nMr. Simpson followed me with some observations in the same strain, after which the Indians retired to select their Chiefs and spokesmen.\n\nOn Friday morning the Chiefs and spokesmen were duly presented, and after their names were recorded, the Indians were invited to express their views.\n\nAfter some delay they stated that there was a cloud before them which made things dark, and they did not wish to commence the proceedings till the cloud was dispersed.\n\nOn inquiring into their meaning, I found that they were referring to some four of their number who were prisoners in gaol. It seems that some Swampy Indians had entered into a contract with the Hudson’s Bay Company as boatmen, and had deserted, and had been brought up before magistrates under a local law of last session, and fined, and in default of payment sent to prison for forty days.\n\nOf this term some considerable part had expired. A few of the offenders had paid their fines, but there were still four Indians remaining in prison.\n\nOn learning the facts I told the Indians that I could not listen to them if they made a demand for the release of the Indians as a matter of right; that\nevery subject of the Queen, whether Indian, half-breed or white, was equal in the eye of the law; that every offender against the law must be punished, whatever race he belonged to; but I said that on the opening of negotiations with them the Queen would like to see all her Indians taking part in them, and if the whole body present were to ask as a matter of grace and favor, under the circumstances, that their brethren should be released, Her Majesty would be willing to consent to their discharge; she would grant as a favor what she must refuse if asked for on any other ground. They replied by saying that they begged it as a matter of favor only. Thereupon I acceded to their request, and directed the discharge of the four Indians. This was received with great satisfaction. I explained again, that there might be no misunderstanding about it, that henceforth every offender against the law must be punished. They all expressed their acquiescence in what I said. The discharge of the prisoners had an excellent effect.\n\nNext morning the Indians, through one of their spokesmen, declared in presence of the whole body assembled, that from this time they would never raise their voice against the law being enforced. After the order of the release, the Chiefs and spokesmen addressed us, questions were asked and answered, and some progress made in the negotiations. Eventually the meeting adjourned till this morning at ten o'clock.\n\nA general acquiescence in the views laid down by Mr. Simpson and myself was expressed; but it was quite clear, by the proceedings of to-day, that our views were imperfectly apprehended. When we met this morning, the Indians were invited to state their wishes as to the reserves, they were to say how much they thought would be sufficient, and whether they wished them all in one or in several places.\n\nIn defining the limits of their reserves, so far as we could see, they wished to have about two-thirds of the Province. We heard them out, and then told them it was quite clear that they had entirely misunderstood the meaning and intention of reserves. We explained the object of these in something like the language of the memorandum enclosed, and then told them it was of no use for them to entertain any such ideas, which were entirely out of the question. We told them that whether they wished it or not, immigrants would come in and fill up the country; that every year from this one twice as many in number as their whole people there assembled would pour into the Province, and in a little while would spread all over it, and that now was the time for them to come to an arrangement that would secure homes and annuities for themselves and their children.\n\nWe told them that what we proposed to allow them was an extent of one hundred and sixty acres for each family of five, or in that proportion; that they might have their land where they chose, not interfering with existing occupants; that we should allow an annuity of twelve dollars for every family of five, or in that proportion per head. We requested them to think over these propositions till Monday morning.\n\nIf they thought it better to have no treaty at all, they might do without\none, but they must make up their minds; if there was to be a treaty, it must be on a basis like that offered.\n\nThat under some such arrangements, the Indians in the east were living happy and contented, enjoying themselves, drawing their annuities, and satisfied with their position.\n\nThe observations seemed to command the acquiescence of the majority, and on Monday morning we hope to meet them in a better frame for the discussion and settlement of the treaty.\n\nI have, etc.,\n\nADAMS G. ARCHIBALD.\n\nTHE HONORABLE\nTHE SECRETARY OF STATE FOR THE PROVINCES.\n\nLOWER FORT GARRY, MANITOBA, July 30th, 1871.\n\nSir,—I have the honor to inform you, for the information of His Excellency the Governor-General, that I arrived in this Province on the 16th instant, and, after consultation with the Lieutenant-Governor of Manitoba, determined upon summoning the Indians of this part of the country to a conference for the purpose of negotiating a treaty at Lower Fort Garry, on Tuesday, the 25th instant, leaving for a future date the negotiation with the Indians westward of and outside of the Province of Manitoba.\n\nProclamations were issued, and every means taken to insure the attendance of the Indians, and on Monday, the 24th instant, I proceeded to Lower Fort Garry, where I met His Excellency the Lieutenant-Governor.\n\nOn Tuesday, finding that only a small portion of the Indians had arrived, we held a preliminary conference with Henry Prince—the Chief of the Swampies and Chippewas residing on what is known as the Indian Reserve, between Lower Fort Garry and Lake Winnipeg—at which we arranged a meeting for the next day at twelve o'clock, for the purpose of ascertaining the names of the Chiefs and head men of the several tribes. At this preliminary conference, Henry Prince said that he could not then enter upon any negotiations, as he was not empowered to speak or act for those bands of Indians not then present.\n\nIn the meantime it was found necessary to feed the Indians assembled here, and accordingly provisions were purchased and rations served out.\n\nOn Wednesday, the 26th, His Excellency the Lieutenant-Governor and myself met those Indians who had arrived, in council, and addressed them with the view of explaining the purport of my commission, and the matters which were to form the subject of a treaty.\n\nIt having been reported that the Indians who had not then arrived were on their road here, we agreed that another meeting should take place on the following day, at which the Chiefs and head men were to be presented to us.\nOn Thursday, pursuant to appointment, we again met the Indians, when the Chiefs and head men of the several bands present were named and presented. I then explained to them the nature of Indian reserves, and desired them to determine, in council among themselves, the locality in which they desired their reserves to be laid out.\n\nOn Friday, the 28th, we again met the Indians, but they were not then prepared to state their demands, and another meeting was appointed for Saturday.\n\nOn Saturday, the 29th, we again met them, all having by this time arrived. When the subject of reserves came up, it was found that the Indians had misunderstood the object of these reservations, for their demands in this respect were utterly out of the question. After a prolonged discussion with them, I consulted with the Lieutenant-Governor, and determined to let them at once understand the terms that I was prepared to offer, and I pointed out that the terms offered were those which would receive Her Majesty's consent. On further explanation of the subject, the Indians appeared to be satisfied, and willing to acquiesce in our arrangements as hereinafter mentioned; and having given them diagrams showing the size of the lots they would individually become possessed of, and having informed them of the amount of their annuity, it was finally settled that they should meet on Monday, the 31st, and acquaint me with their decision.\n\nThe reserves will comprise sufficient land to give each family of five persons one hundred and sixty acres, or in like proportion, together with an annual payment in perpetuity of twelve dollars for each family of five persons, or in like proportion.\n\nAs far as I can judge, I am inclined to think that the Indians will accept these terms.\n\nI am happy to be able to say that the precautions taken to prevent the introduction of liquor amongst the Indians have been wholly successful, and that perfect order and contentment have prevailed up to the present time.\n\nI have, etc.\n\nWEMYSS M. SIMPSON,\nIndian Commissioner.\n\nThe Honorable\nThe Secretary of State for the Provinces,\nOttawa.\nOTTAWA, November 3rd, 1871.\n\nTO THE HONORABLE\n\nTHE SECRETARY OF STATE FOR THE PROVINCES,\n\nOttawa.\n\nSIR,—I have the honor to submit to you, for the information of His Excellency the Governor-General, a report of my negotiations with the Indians of the Province of Manitoba, and with certain of the Indians of the North-West Territory, entered upon by me, in accordance with your instructions, dated 3rd May, 1871.\n\nHaving, in association with S. J. Dawson, Esq., and Robert Pether, Esq., effected a preliminary arrangement with the Indians of Rainy Lake, the particulars of which I have already had the honor of reporting to you in my Report, dated July 11th, 1871, I proceeded by the Lake of the Woods and Dawson Road to Fort Garry, at which place I arrived on the 16th July.\n\nBearing in mind your desire that I should confer with the Lieutenant-Governor of Manitoba, I called upon Mr. Archibald, and learned from him that the Indians were anxiously awaiting my arrival, and were much excited on the subject of their lands being occupied without attention being first given to their claims for compensation. Amongst the settlers, also, an uneasy feeling existed, arising partly from the often-repeated demands of the Indians for a treaty with themselves, and partly from the fact that certain settlers in the neighborhood of Portage la Prairie and other parts of the Province, had been warned by the Indians not to cut wood or otherwise take possession of the lands upon which they were squatting. The Indians, it appeared, consented to their remaining on their holdings until sufficient time had been allowed for my arrival, and the conclusion of a treaty; but they were unwilling to allow the settlers the free use of the country for themselves or their cattle. Mr. Archibald, and those residents in the Province of Manitoba with whom I conversed on the subject, appeared to think that no time should be lost in meeting the Indians, as some assurances had already been given them that a treaty would be made with them during the summer of 1871; and I therefore, at once, issued notices calling certain of the Indians together, naming two places at which I would meet them. The first meeting, to which were asked the Indians of the Province and certain others on the eastern side, was to be held on the 25th of July, at the Stone Fort, a Hudson's Bay Company's Post, situated on the Red River, about twenty miles northward of Fort Garry—a locality chosen as being the most central for those invited. The second meeting was appointed to be held on August 17th, at Manitoba Post, a Hudson's Bay Company's Post, at the north-west extremity of Lake Manitoba, as it was deemed that such of the bands of Indians residing without the limits of the Province of Manitoba, as I purposed to deal with at present, would meet there more readily than elsewhere.\n\nOn Monday, the 24th of July, I met the Lieutenant-Governor of Manitoba\nat the Stone Fort; but negotiations were unavoidably delayed, owing to the fact that only one band of Indians had arrived, and that until all were on the spot those present declined to discuss the subject of a treaty, except in an informal manner. Amongst these, as amongst other Indians with whom I have come in contact, there exists great jealousy of one another, in all matters relating to their communications with the officials of Her Majesty; and in order to facilitate the object in view, it was most desirable that suspicion and jealousy of all kinds should be allayed. The fact of the Commissioner having arrived was sufficient evidence of the good intentions of Her Majesty's Government, and it seemed better to await the arrival of all whom I had summoned, than to press matters to an issue while any were absent. This, however, entailed the necessity of feeding those who were already there, and others as they arrived.\n\nIt is customary in dealing with Indians to do so, and in this case it was absolutely necessary, for, obviously, it would have been impossible to invite those people from a distance, and then leave them to starve at our doors, or, in search of food, to plunder the neighborhood into which they had been introduced. At that season of the year the Indians were not engaged in fishing or hunting, and consequently large numbers of men, women and children attended at the place of meeting, for all of whom food was provided. The price of provisions, even at the lowest price for which they could be obtained, was high, pork being fifty dollars a barrel, and flour twenty shillings sterling per hundred, and such cattle as I was able to purchase £16 per head; so that the expense of keeping the Indians during the negotiation of treaty and payment of the gratuity, which lasted eleven days, forms no small share of the total expenditure. In addition to this expense, it was thought necessary by the Lieutenant-Governor that Major Irvine, commanding the troops at Fort Garry, should be requested to furnish a guard at the Stone Fort during the negotiations, and that there should be at hand, also, a force of constabulary, for the purpose of preventing the introduction of liquor amongst the Indian encampments. Other expenses of a somewhat similar nature were incurred, which would be totally unnecessary upon any future occasion of payment being made to the Indians of Manitoba. I may here refer to the apparently prolonged duration of the first negotiation, and explain, in reference thereto, the causes, or some of them, that entailed the loss of time and attendant expense. For some time a doubt has existed whether the Chief, nominally at the head of the Indians of the Indian settlement, possessed the good will and confidence of that band; and I thought it advisable to require that the several bands of Indians should select such Chiefs as they thought proper, and present these men as their authorized Chiefs, before anything was said as to the terms of a treaty. The Indians having acquiesced in this proposal, forthwith proceeded to such election; but the proceeding apparently involved discussion and consideration amongst themselves, and two days elapsed before the men chosen were presented for recognition, and the business of the meeting commenced.\nWhen the peculiar circumstances surrounding the position of the Indians of the Province were pointed out, the future of the country predicted, and the views and intentions of the Government explained by the Lieutenant-Governor and myself, the Indians professed a desire for time to think over what had been said before making any reply; and when their answer came it proved to contain demands of such an exorbitant nature, that much time was spent in reducing their terms to a basis upon which an arrangement could be made.\n\nEvery band had its spokesman, in addition to its Chief, and each seemed to vie with another in the dimensions of their requirements. I may mention, as an illustration, that in the matter of reserves, the quantity of land demanded for each band amounted to about three townships per Indian, and included the greater part of the settled portions of the Province. It was not until the 3rd of August, or nine days after the first meeting, that the basis of arrangement was arrived at, upon which is founded the treaty of that date. Then, and by means of mutual concessions, the following terms were agreed upon. For the cession of the country described in the treaty referred to, and comprising the Province of Manitoba, and certain country in the north-east thereof, every Indian was to receive a sum of three dollars a year in perpetuity, and a reserve was to be set apart for each band, of sufficient size to allow one hundred and sixty acres to each family of five persons, or in like proportion as the family might be greater or less than five. As each Indian settled down upon his share of the reserve, and commenced the cultivation of his land, he was to receive a plough and harrow. Each Chief was to receive a cow and a male and female of the smaller kinds of animals bred upon a farm. There was to be a bull for the general use of each reserve. In addition to this, each Chief was to receive a dress, a flag and a medal, as marks of distinction; and each Chief, with the exception of Bozawequare, the Chief of the Portage band, was to receive a buggy, or light spring waggon. Two councillors and two braves of each band were to receive a dress, somewhat inferior to that provided for the Chiefs, and the braves and councillors of the Portage band excepted, were to receive a buggy. Every Indian was to receive a gratuity of three dollars, which, though given as a payment for good behaviour, was to be understood to cover all dimensions for the past.\n\nOn this basis the treaty was signed by myself and the several Chiefs, on behalf of themselves and their respective bands, on the 3rd of August, 1871, and on the following day the payment commenced.\n\nThe three dollars gratuity, above referred to, will not occur in the ordinary annual payments to the Indians of Manitoba, and, though doubling the amount paid this year, may now properly be regarded as belonging to a previous year, but only now liquidated.\n\nA large number of Indians, entitled to share in the treaty, were absent on the 3rd August, and in the belief that I should, almost immediately, be able to obtain a more accurate knowledge than I possessed of the numbers of\nthe several bands, I paid to each person present only three dollars—the gratuity—postponing for a short time the first annual payment. Having completed this disbursement, I prepared to start for Manitoba Post, to open negotiations with the Indians on the immediate north and north-west borders of the Province of Manitoba, promising however to visit the several bands of the first treaty, in their own districts, and to there pay them. By this means the necessity for their leaving their own homes, and for the Government's feeding them while they were being paid, and during their journey home, was avoided.\n\nAfter completing the treaty at Manitoba Post, of which mention is herein-after made, I visited Portage la Prairie, the Indian settlement at St. Peter's, Rivière Marais, and the Town of Winnipeg, according to my promise, and at each place, with the exception of Rivière Marais, found the Indians satisfied with the treaty, and awaiting their payment. At Rivière Marais, which was the rendezvous appointed by the bands living in the neighborhood of Pembina, I found that the Indians had either misunderstood the advice given them by parties in the settlement, well disposed towards the treaty, or, as I have some reason to believe, had become unsettled by the representations made by persons in the vicinity of Pembina, whose interests lay elsewhere than in the Province of Manitoba; for, on my announcing my readiness to pay them, they demurred at receiving their money until some further concessions had been made by me.\n\nWith a view to inducing the Indians to adopt the habits and labors of civilization, it had been agreed, at the signing of the treaty as before mentioned, to give certain animals as a nucleus for stocking the several reserves, together with certain farming implements; and it was now represented to me by the spokesman of the bands, that as the Queen had, with that kindness of heart which distinguished her dealings with her red children, expressed a desire to see the Indians discard their former precarious mode of living and adopt the agricultural pursuits of the white man, they were desirous of acceding to the wish of their great Mother, and were now prepared to receive the gifts she had been good enough to speak of, through her Commissioner, in full. But, as it could make no difference whatever to their great Mother whether these things were given in kind or in money value, her red children of the Pembina bands were resolved to receive them in the latter form. I had put a valuation upon all the articles mentioned in the supplement to the treaty, and could go no further in the matter unless I was prepared to pay them for all these articles at the rates they would now proceed to mention. I declined to comply with the request, and they declined to receive their first annual payment, whereupon I broke up my camp and returned to Winnipeg. As I foresaw at the time, this determination on their part was shortly repented, and a number of their leading men were subsequently paid at Winnipeg; while at the request of the Indians, the money for the remainder, together with a pay sheet, was forwarded to the officer in charge of the Hudson's Bay Company's Post at Pembina, with\ninstructions to pay the Indians as per list as each might present himself. At Portage la Prairie, although the number paid at the Stone Fort was largely increased, there still remained many who, from absence or other causes, were not paid, and by the request of the Chief the money was left for these with the officers in charge of the Hudson's Bay Company's Post, in the same manner as was done for the Pembina bands.\n\nAs I was unable to proceed to Fort Alexander, the payments for the Indians, or for such of them as were present at the signing of the treaty, were sent in like manner to the officer in charge of the Hudson's Bay Company's Post at Fort Alexander; but it may be as well to mention that the number so paid will fall far short of the total number belonging to that place. The latter remark will apply to the Pembina band, for their payment was sent as per gratuity list, and there must necessarily have been others who did not receive payment. All these must receive their back payments during the course of next year.\n\nDuring the payment of the several bands, it was found that in some, and most notably in the Indian settlement and Broken Head River Band, a number of those residing among the Indians, and calling themselves Indians, are in reality half-breeds, and entitled to share in the land grant under the provisions of the Manitoba Act. I was most particular, therefore, in causing it to be explained, generally and to individuals, that any person now electing to be classed with Indians, and receiving the Indian pay and gratuity, would, I believed, thereby forfeit his or her right to another grant as a half-breed; and in all cases where it was known that a man was a half-breed, the matter, as it affected himself and his children, was explained to him, and the choice given him to characterize himself. A very few only decided upon taking their grants as half-breeds. The explanation of this apparent sacrifice is found in the fact that the mass of these persons have lived all their lives on the Indian reserves (so called), and would rather receive such benefits as may accrue to them under the Indian treaty, than wait the realization of any value in their half-breed grant.\n\nThe Lieutenant-Governor of Manitoba having expressed a desire to be present at the negotiation of the treaty at Manitoba Post, His Honor, accompanied by the Hon. James McKay, proceeded thither with me, in company with Mr. Molyneux St. John, the Clerk of the Legislative Assembly of Manitoba, who had assisted me in the duties connected with the former treaty and payments. I left Winnipeg on the 13th August, but owing to adverse winds on Lake Manitoba did not arrive until two days after the time appointed. I found that, in the meanwhile, the officer in charge of the Hudson's Bay Company's Post had been obliged to give some provisions to the Indians pending my arrival; but on my speaking to the leading men of the bands assembled, it was evident that the Indians of this part had no special demands to make, but having a knowledge of the former treaty, desired to be dealt with in the same manner and on the same terms as those adopted by the Indians of the Province of Manitoba.\nThe negotiation with these bands therefore occupied little time, and on the 21st August, 1871, a treaty was concluded by which a tract of country three times as large as the Province of Manitoba was surrendered by the Indians to the Crown. Payment in full, that is to say, the gratuity and the first payment, was at once made; and I have since written to the officers in charge of the Hudson's Bay Company's Posts within the tract above referred to, requesting them to procure for me a reliable census of the Indians, parties to this treaty.\n\nI have referred to the cost of effecting these treaties, and remarked that it will prove to be exceptional. It may be regarded as entirely so, as far as the Indians with whom the dealings were held are concerned. In the future the annual payment will be only one-half to each Indian of the amount paid this year, for the gratuity was the same as the payment, and the heavy expense of feeding the Indians while at the place of meeting and on their journey home, will be avoided by the payment being made at or near their own reserves.\n\nAll the collateral expenses, therefore, of this year, including dresses, medals, presents to the Indians, etc., etc., will not appear in the expenses attending during future payments.\n\nBut it is to be remembered that a large number of Indians, whose lands were ceded by the second treaty, were not present. The distance from the hunting grounds of some to Manitoba Post is very great; but while their absence was to be regretted for some reasons, it effected a very considerable saving in the item of provisions.\n\nDuring the ensuing season, these persons will probably be found at the place where the payments will be made, and will then require their payments as if they had been present at the signing of the treaty.\n\nOf the land ceded in the Province of Manitoba, it will be hardly necessary for me to speak, as His Excellency the Governor-General is already in possession of accurate information touching its fertility and resources; but I may observe that, valuable as are these lands, they are fully equalled if not exceeded by the country of which the Government now comes into possession, by virtue of the treaty concluded at Manitoba Post. Already, settlers from the Provinces in Canada and elsewhere are pushing their way beyond the limits of the Province of Manitoba; and there is nothing but the arbitrary limits of that Province, and certain wood and water advantages found in the territory beyond it, to distinguish one part of the country from the other. The fertility that is possessed by Manitoba is shared by the country and its confines. The water courses of the Province are excelled by those of the territory; and the want of wood which threatens serious difficulty in the one, is by no means so apparent in the other.\n\nThe Indians of both parts have a firm belief in the honor and integrity of Her Majesty's representatives, and are fully impressed with the idea that the amelioration of their present condition is one of the objects of Her Majesty in making these treaties. Although many years will elapse before\nthey can be regarded as a settled population—settled in the sense of following agricultural pursuits—the Indians have already shown a disposition to provide against the vicissitudes of the chase by cultivating small patches of corn and potatoes. Moreover, in the Province of Manitoba, where labor is scarce, Indians give great assistance in gathering in the crops. At Portage la Prairie, both Chippawas and Sioux were largely employed in the grain field; and in other parishes I found many farmers whose employés were nearly all Indians.\n\nAlthough serious trouble has from time to time occurred across the boundary line, with Indians of the same tribes, and indeed of the same bands as those in Manitoba, there is no reason to fear any trouble with those who regard themselves as subjects of Her Majesty. Their desire is to live at peace with the white man, to trade with him, and, when they are disposed, to work for him; and I believe that nothing but gross injustice or oppression will induce them either to forget the allegiance which they now claim with pride, or molest the white subjects of the sovereign whom they regard as their Supreme Chief.\n\nThe system of an annual payment in money I regard as a good one, because the recipient is enabled to purchase just what he requires when he can get it most cheaply, and it also enables him to buy articles at second hand, from settlers and others, that are quite as useful to him as are the same things when new. The sum of three dollars does not appear to be large enough to enable an Indian to provide himself with many of his winter necessaries; but as he receives the same amount for his wife or wives, and for each of his children, the aggregate sum is usually sufficient to procure many comforts for his family which he would otherwise be compelled to deny himself.\n\nI take this opportunity of acknowledging the assistance afforded me in successfully completing the two treaties, to which I have referred, by His Honor the Lieutenant-Governor of Manitoba, the Hon. James McKay, and the officers of the Hudson's Bay Company. In a country where transport and all other business facilities are necessarily so scarce, the services rendered to the Government by the officers in charge of the several Hudson's Bay Posts has been most opportune and valuable.\n\nI have, etc.,\n\nWEMYSS M. SIMPSON,\nIndian Commissioner,\nCHAPTER V.\n\nTREATY NUMBER THREE, OR THE NORTH-WEST ANGLE TREATY.\n\nIn the year 1871 the Privy Council of Canada issued a joint commission to Messrs. W. M. Simpson, S. J. Dawson and W. J. Pether, authorizing them to treat with the Ojibbeway Indians for the surrender to the Crown of the lands they inhabited—covering the area from the watershed of Lake Superior to the north-west angle of the Lake of the Woods, and from the American border to the height of land from which the streams flow towards the Hudson's Bay. This step had become necessary in order to make the route known as \"the Dawson route,\" extending from Prince Arthur's Landing on Lake Superior to the north-west angle of the Lake of the Woods, which was then being opened up, \"secure for the passage of emigrants and of the people of the Dominion generally,\" and also to enable the Government to throw open for settlement any portion of the land which might be susceptible of improvement and profitable occupation. The Commissioners accepted the appointment, and in July, 1871, met the Indians at Fort Francis.\n\nThe tribes preferred claims for right of way through their country. The Commissioners reported \"that they had admitted these to a limited extent and had made them presents in provisions and clothing and were also to pay them a small amount in money, it being fully and distinctly understood by the Indians that these presents and clothing were accepted by them as an equivalent for all past claims whatever.\" The Commissioners having explained to them fully the intentions of the Government as to obtaining a surrender of their territorial rights, and giving in return therefor reserves of land and\nannual payments, asked them to consider the proposals carefully and meet the Commissioners the succeeding summer to come to an arrangement. In 1872, the Indians were found not to be ready for the making of a treaty and the subject was postponed. In the year 1873 a commission was issued to the Hon. Alexander Morris, then Lieutenant-Governor of Manitoba and the North-West Territories, Lieut.-Col. Provencher, who had in the interval been appointed Commissioner of Indian Affairs in the place of Mr. Simpson, who had resigned, and Lindsay Russell, Esq., but the latter being unable to act, Mr. Dawson, now M.P. for Algoma, was appointed Commissioner in his stead. These Commissioners having accepted the duty confided to them, met the Indians at the north-west angle of the Lake of the Woods in the end of September, 1873, and, after protracted and difficult negotiations, succeeded in effecting a treaty with them. A copy of the treaty will be found in the Appendix, and a brief record of the utterances of the Indians and of the Commissioners, which was taken down in short hand by one of the soldiers of the militia force, is hereto subjoined. This treaty was one of great importance, as it not only tranquillized the large Indian population affected by it, but eventually shaped the terms of all the treaties, four, five, six and seven, which have since been made with the Indians of the North-West Territories—who speedily became apprised of the concessions which had been granted to the Ojibbeway nation. The closing scenes were striking and impressive. The chief speaker, Mawe-do-pe-nais, thus winding up the conference on the part of the Indians, in his final address to the Lieutenant-Governor and his fellow Commissioners:\n\n\"Now you see me stand before you all: what has been done here to-day has been done openly before the Great Spirit and before the nation, and I hope I may never hear any one say that this treaty has been done secretly: and now in closing this council, I take off my glove, and in giving you my hand I\ndeliver over my birthright and lands: and in taking your hand I hold fast all the promises you have made, and I hope they will last as long as the sun rises and the water flows, as you have said.\"\n\nThe conference then adjourned, and on re-assembling, after the treaty had been read and explained, the Commissioners signed it and the Lieutenant-Governor called on an aged hereditary Chief, Kee-ta-kay-pi-nais, to sign next. The Chief came forward, but declined to touch the pen, saying, \"I must first have the money in my hand.\" The Lieutenant-Governor immediately held out his hand, and directed the interpreter to say to the chief, \"Take my hand and feel the money in it. If you cannot trust me for half an hour, do not trust me forever.\" When this was repeated by the interpreter, the Chief smiled, took the outstretched hand, and at once touched the pen, while his mark was being made, his last lingering distrust having been effectively dispelled by this prompt action and reply. The other Chiefs followed, and then the interpreter was directed to tell Kee-ta-kay-pi-nais, the Chief, that he would be paid forthwith, but the Chief at once replied, \"Oh no, it is evening now, and I will wait till to-morrow.\" The payments were duly made next day, and so was closed, a treaty, whereby a territory was enabled to be opened up, of great importance to Canada, embracing as it does the Pacific Railway route to the North-West Territories—a wide extent of fertile lands, and, as is believed, great mineral resources. I now quote the official despatch of the Lieutenant-Governor, dated the 14th October, 1873, in which will be found, a full narrative of the proceedings, connected with the treaty, and a statement of the results thereby effected. I also submit a short-hand report of the negotiations connected with the treaty.\nGovernment House,\nFort Garry, October 14th, 1873.\n\nSir,—I have the honor to enclose copy of a treaty made by myself, Lieut.-Col. Provencher, Indian agent, and S. J. Dawson, Esq., Commissioner, acting on behalf of Her Majesty, of the one part, and the Salteaux tribe of Ojibbeway Indians on the other, at the North-West Angle of the Lake of the Woods, on the 3rd of October, for the relinquishment of the Indian title to the tract of land therein described, and embracing 55,000 square miles. In the first place, the holding of the negotiation of the treaty had been appointed by you to take place at the North-West Angle before you requested me to take part therein, and Mr. Dawson had obtained the consent of the Indians to meet there on the 10th of September, but they afterwards changed their minds, and refused to meet me unless I came to Fort Francis. I refused to do this, as I felt that the yielding to the demand of the Indians in this respect, would operate injuriously to the success of the treaty, and the results proved the correctness of the opinion I had formed. I therefore sent a special agent (Mr. Pierre Levaillier) to warn them that I would meet them as arranged at the North-West Angle on the 25th, or not at all this year, to which they eventually agreed.\n\nI left here for the Angle on the 23rd September, and arrived there on the 25th, when I was joined by Messrs. Provencher and Dawson, the last named of whom I was glad to find had been associated with the Commissioners in consequence of the resignation of Mr. Lindsey Russell, thereby giving us the benefit as well of his knowledge of the country to be dealt with, as of the several bands of Indians therein. Mr. Pether, of Fort Francis, was also in attendance, and Mr. Provencher was accompanied by Mr. St. John, of his department.\n\nOn arriving, the Indians, who were already there, came up to the house I occupied, in procession, headed by braves bearing a banner and a Union Jack, and accompanied by others beating drums. They asked leave to perform a dance in my honor, after which they presented to me the pipe of peace. They were then supplied with provisions and returned to their camp. As the Indians had not all arrived, and for other reasons, the 26th, 27th and 28th were passed without any progress, but on the 29th I sent them word that they must meet the Commissioners next morning. Accordingly, on the 30th, they met us in a tent, the use of which I had obtained from the military authorities. I explained to them the object of the meeting, but as they informed me that they were not ready to confer with us, I adjourned the meeting until next day. On the 1st October they again assembled. The principal cause of the delay was divisions and jealousies among themselves. The nation had not met for many years, and some of them had never before been assembled together. They were very jealous of each other, and dreaded any of the Chiefs having individual communications with me,\nto prevent which they had guards on the approaches to my house and Mr. Dawson's tent. On the 2nd October they again assembled, when I again explained the object of the meeting, through Mr. McPherson, an intelligent half-breed trader, whose services I secured. M. Chatelan, the Government interpreter, was also present. They had selected three spokesmen, and had also an Indian reporter, whose duty was to commit to memory all that was said. They had also secured the services of M. Joseph Nolin, of Point du Chene, to take notes in French of the negotiations, a copy of which notes I obtained from him and herewith enclose. The spokesmen informed me they would not treat as to the land until we settled with them as to the Dawson route, with regard to which they alleged Mr. Dawson had made promises which had not been kept, and that they had not been paid for the wood used in building the steamers, nor for the use of the route itself. Mr. Dawson explained that he had paid them for cutting wood, but had always asserted a common right to the use of wood and the water way. He asked them what promise had not been kept, and pointed out that the Government had twice before endeavored to treat with them for a settlement of all matters. He referred them to me as to the general question of the use of the route. They were unable to name any promises which had not been kept. Thereupon I told them I came on behalf of the Queen and the Government of the Dominion of Canada to treat with them with regard to the lands and all other matters, but that they refused to hear what I had to say; they had closed my mouth; and as we would not treat except for the settlement of all matters past and future I could not speak unless they asked me to do so. They conferred among themselves, and seeing that we were quite firm, the spokesman came forward and said that they would not close my mouth, after which they would make their demands. The Commissioners had had a conference and agreed, as they found there was no hope of a treaty for a less sum, to offer five dollars per head, a present of ten dollars, and reserves of farming and other lands not exceeding one square mile per family of five, or in that proportion, sums within the limits of our instructions, though I had private advices if possible not to give the maximum sum named, as the Government had been under a misapprehension as to amounts given to the bands in the United States. The Chiefs heard my proposal, and the meeting adjourned until next day. On the 3rd October the Chiefs again assembled and made a counter proposition, of which I enclose a copy, being the demand they have urged since 1869. I also enclose an estimate I had made of the money value of the demand, amounting to $125,000 per annum. On behalf of the Commissioners I at once peremptorily refused the demand. The spokesmen returned to the Chiefs, who were arranged on benches, the people sitting on the ground behind them, and on their return they informed me that the Chiefs, warriors and braves were of one mind, that they would make a treaty only if we acceded to their demand. I told them if so the conference was over, that I would return and report that they had refused to make a reasonable treaty, that hereafter I would treat with those bands\nwho were willing to treat, but that I would advise them to return to the council and reconsider their determination before next morning, when, if not, I should certainly leave. This brought matters to a crisis. The Chief of the Lac Seul band came forward to speak. The others tried to prevent him, but he was secured a hearing. He stated that he represented four hundred people in the north; that they wished a treaty; that they wished a school-master to be sent them to teach their children the knowledge of the white man; that they had begun to cultivate the soil and were growing potatoes and Indian corn, but wished other grain for seed and some agricultural implements and cattle. This Chief spoke under evident apprehension as to the course he was taking in resisting the other Indians, and displayed much good sense and moral courage. He was followed by the Chief \"Blackstone,\" who urged the other Chiefs to return to the council and consider my proposals, stating that he was ready to treat, though he did not agree to my proposals nor to those made to me. I then told them that I had known all along they were not united as they had said; that they ought not to allow a few Chiefs to prevent a treaty, and that I wished to treat with them as a nation and not with separate bands, as they would otherwise compel me to do; and therefore urged them to return to their council, promising to remain another day to give them time for consideration. They spent the night in council, and next morning having received a message from M. Charles Nolin, a French half-breed, that they were becoming more amenable to reason, I requested the Hon. James McKay (who went to the Angle three times to promote this treaty), Charles Nolin and Pierre Levaillier to go down to the Indian Council, and as men of their own blood, give them friendly advice. They accordingly did so, and were received by the Indians, and in about half an hour afterwards were followed by Messrs. Provencher and St. John, who also took part in the interview with the Council of Chiefs. The Chiefs were summoned to the conference by the sound of a bugle and again met us, when they told me that the determination to adhere to their demands had been so strong a bond that they did not think it could be broken, but they had now determined to see if I would give them anything more.\n\nThe Commissioners had had a conference, and agreed previously to offer a small sum for ammunition and twine for nets, yearly—a few agricultural implements and seeds, for any band actually farming or commencing to farm, and to increase the money payment by two dollars per head if it should be found necessary in order to secure a treaty, maintaining a permanent annuities at the sum fixed. The Indians on the other hand had determined on asking fifteen dollars, with some other demands. In fixing the ten dollars the Commissioners had done so as a sum likely to be accepted in view of three dollars per head having been paid the Indians the first year the Dawson route was used, and that they had received nothing since. In reply to the Indians, I told them I was glad that they had reconsidered their decision, and that as they had done so, being desirous of inducing them to\npractice agriculture and to have the means of getting food if their fishing and hunting failed, we would give them certain implements, cattle and grain, once for all, and the extra two dollars per head of a money payment. This proposal was received favorably, but the spokesmen again came forward and said they had some questions to ask before accepting my proposal. They wanted suits of clothing every year for all the bands, and fifty dollars for every Chief annually. This I declined, but told them that there were some presents of clothing and food which would be given them this year at the close of treaty. They then asked free passes forever over the Canada Pacific Railway, which I refused. They then asked that no \"fire-water\" should be sold on their reserves, and I promised that a regulation to this effect should be introduced into the treaty. They then asked that they should not be sent to war, and I told them the Queen was not in the habit of employing the Indians in warfare. They asked that they should have power to put turbulent men off their reserves, and I told them the law would be enforced against such men. They asked what reserves would be given them, and were informed by Mr. Provencher that reserves of farming and other lands would be given them as previously stated, and that any land actually in cultivation by them would be respected. They asked if the mines would be theirs; I said if they were found on their reserves it would be to their benefit, but not otherwise. They asked if an Indian found a mine would he be paid for it, I told them he could sell his information if he could find a purchaser like any other person. They explained that some of their children had married in the States, and they wished them to return and live among them, and wanted them included in the treaty. I told them the treaty was not for American Indians, but any bona fide British Indians of the class they mentioned who should within two years be found resident on British soil would be recognized.\n\nThey said there were some ten to twenty families of half-breeds who were recognized as Indians, and lived with them, and they wished them included. I said the treaty was not for whites, but I would recommend that those families should be permitted the option of taking either status as Indians or whites, but that they could not take both. They asked that Mr. Charles Nolin should be employed as an Indian Agent, and I stated that I would submit his name to the Government with favorable mention of his services on that occasion. They asked that the Chiefs and head men, as in other treaties, should get an official suit of clothing, a flag, and a medal, which I promised. Mawedopenais produced one of the medals given to the Red River Chiefs, said it was not silver, and they were ashamed to wear it, as it turned black, and then, with an air of great contempt, struck it with his knife. I stated that I would mention what he had said, and the manner in which he had spoken. They also stated the Hudson Bay Company had staked out ground at Fort Francis, on part of the land they claimed to have used, and to be entitled to, and I promised that enquiry would be made into the matter. They apologized for the number of questions put me, which\noccupied a space of some hours, and then the principal spokesman, Mawedopenais, came forward and drew off his gloves, and spoke as follows:\n\n\"Now you see me stand before you all. What has been done here to-day, has been done openly before the Great Spirit, and before the nation, and I hope that I may never hear any one say that this treaty has been done secretly. And now, in closing this council, I take off my glove, and in giving you my hand, I deliver over my birthright, and lands, and in taking your hand I hold fast all the promises you have made, and I hope they will last as long as the sun goes round, and the water flows, as you have said.\" To which I replied as follows: \"I accept your hand, and with it the lands, and will keep all my promises, in the firm belief that the treaty now to be signed will bind the red man and the white man together as friends forever.\" The conference then adjourned for an hour to enable the text of the treaty to be completed, in accordance with the understanding arrived at. At the expiration of that period the conference was resumed, and after the reading of the treaty, and an explanation of it in Indian by the Hon. James McKay, it was signed by the Commissioners and by the several Chiefs, the first signature being that of a very aged hereditary Chief. The next day the Indians were paid by Messrs. Pether and Graham, of the Department of Public Works; the latter of whom kindly offered his services, as Mr. Provencher had to leave to keep another appointment. The negotiation was a very difficult and trying one, and required on the part of the Commissioners, great patience and firmness. On the whole I am of opinion that the issue is a happy one. With the exception of two bands in the Shebandowan District, whose adhesion was secured in advance, and the signatures of whose Chiefs Mr. Dawson left to secure, the Indian title has been extinguished over the vast tract of country comprising 55,000 square miles lying between the upper boundary of the Lake Superior treaty, and that of the treaty made by Mr. Commissioner Simpson at Manitoba Post, and embracing within its bounds the Dawson route, the route of the Canada Pacific Railway, and an extensive lumber and mineral region.* It is fortunate, too, that the arrangement has been effected, as the Indians along the lakes and rivers were dissatisfied at the use of the waters, which they considered theirs, having been taken without compensation, so much so indeed that I believe if the treaty had not been made, the Government would have been compelled to place a force on the line next year.\n\nBefore closing this despatch, I have much pleasure in bearing testimony to the hearty co-operation and efficient aid the Commissioners received from the Metis who were present at the Angle, and who, with one accord, whether of French or English origin, used the influence which their relationships to the Indians gave them, to impress them with the necessity of their entering into the treaty. I must also express my obligations to the detachment of\n\n* Mr. Dawson succeeded in obtaining the adhesion to the treaty of the Chiefs in question.\ntroops under the command of Captain Macdonald, assigned me as an escort, for their soldierly bearing and excellent conduct while at the Angle. Their presence was of great value, and had the effect of deterring traders from bringing articles of illicit trade for sale to the Indians; and moreover exercised a moral influence which contributed most materially to the success of the negotiations. I have further to add, that it was found impossible, owing to the extent of the country treated for, and the want of knowledge of the circumstances of each band, to define the reserves to be granted to the Indians. It was therefore agreed that the reserves should be hereafter selected by officers of the Government, who should confer with the several bands, and pay due respect to lands actually cultivated by them. A provision was also introduced to the effect that any of the reserves, or any interest in them, might hereafter be sold for the benefit of the Indians by the Government with their consent. I would suggest that instructions should be given to Mr. Dawson to select the reserves with all convenient speed; and, to prevent complication, I would further suggest that no patents should be issued, or licenses granted, for mineral or timber lands, or other lands, until the question of the reserves has been first adjusted.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nALEXANDER MORRIS,\nLieut.-Governor.\n\nAttention is called to the ensuing report of the proceedings connected with the treaty, extracted from the Manitoban newspaper of the 18th October, 1873, published at Winnipeg. The reports of the speeches therein contained were prepared by a short-hand reporter and present an accurate view of the course of the discussions, and a vivid representation of the habits of Indian thought.\n\nNORTH-WEST ANGLE,\nSeptember 30, 1873.\n\nThe Lieutenant-Governor and party, and the other Commissioners appointed to negotiate a treaty with the Indians, arrived here on Thursday, 24th inst., having enjoyed delightful weather during the entire trip from Fort Garry. The Governor occupies the house of the officer in charge of the H. B. Post. The grounds around it have been nicely graded and cleared of brush, and surrounded by rows of evergreens planted\nclosely, so as to completely screen the house from wind, and at the same time contribute much to relieve the monotony of the scenery. Immediately west of this, and likewise enclosed by walls of evergreens, is the large marquee used as a Council House, by the contracting parties; and immediately surrounding it to the north and west are the tents of the other officers of the Commission and the officers and men of the Volunteers on detachment duty.\n\nSituated to the eastward, and extending all along the river bank, are the tents of the Indians to the number of a hundred, with here and there the tent of the trader, attracted thither by the prospect of turning an honest penny by exchanging the necessaries of Indian life for such amounts of the price of their heritage as they can be induced to spend.\n\nThe natives now assembled here number about 800 all told, and hail from the places given below. Among them are many fine physically developed men, who would be considered good looking were it not for the extravagance with which they besmear their faces with pigments of all colors.\n\nIt was at first thought probable that the serious business of the meeting would be begun on Friday, but owing to the non-arrival of a large body of Rainy River and Lac Seul representatives, it was decided to defer it until next day. Saturday came, and owing to the arrival of a messenger from the Lac Seul band asking the Governor to wait for their arrival, proceedings have further stayed until Monday. But \"hope deferred maketh the heart sick;\" so the advent of Monday brought nothing but disappointment, and this, coupled with the disagreeable wet and cold weather that prevailed, made every one ill at ease if not miserable. The Chiefs were not ready to treat—they had business of their own to transact, which must be disposed of before they could see the Governor; and so another delay was granted. But Monday did not find them ready, and they refused to begin negotiations. An intimation from the Governor that unless they were ready on the\nfollowing day he would leave for home on Wednesday, hurried them up a little—they did wait on him to-day, Tuesday, but only to say they had not yet finished their own business, but that they would try and be ready to treat on Wednesday. And so the matter stands at present—if the Indians agree amongst themselves, the treaty will be opened to-morrow; otherwise the Governor will strike camp and return to Fort Garry.\n\nDivisions and local jealousies have taken possession of the Indian mind. The difficulties are the inability of the Indians to select a high or principal chief from amongst themselves, and as to the matter and extent of the demands to be made.\n\nIt is many years since these people had a general council, and in the interval many head men have died, while others have grown to man's estate, and feel ambitious to take part in the proceedings. But the fiat has gone forth, that unless a conclusion is arrived at to-morrow negotiations will be broken off for this year.\n\n**BOUNDARIES OF THE LANDS TO BE Ceded.**\n\nBeginning at the North-West Angle eastward, taking in all the Lake of the Woods, including White Fish Bay, Rat Portage and north to White Dog in English River; up English River to Lake Seul, and then south-east to Lake Nepigon; westward to Rainy River and down it to Lake of the Woods, and up nearly to Lac des Mille Lacs; then beginning at the 49th parallel to White Mouth River, thence down it to the north, along the eastern boundary of the land ceded in 1871, embracing 55,000 square miles.\n\nIn the neighborhood of Lac des mille Lacs and Shebandowan are several bands, who have sent word that they cannot come as far as this point, but will accept the terms made at this treaty and ratify it with any one commissioner who will go there to meet them.\n\nThe whole number of Indians in the territory is estimated at\n14,000, and are represented here by Chiefs of the following bands:\n\n1. North-West Angle.\n2. Rat Portage.\n3. Lake Seul.\n4. White Fish Bay on Lake of the Woods.\n5. Sha-bas-kang, or Grassy Narrows.\n6. Rainy River.\n7. Rainy Lake.\n8. Beyond Kettle Falls, southward.\n9. Eagle Lake.\n10. Nepigon.\n11. Shoal Lake (three miles to the north of this point).\n\nNorth-West Angle,\nOctober 1, 1873.\n\nThe assembled Chiefs met the Governor this morning, as per agreement, and opened the proceedings of the day by expressing the pleasure they experienced at meeting the Commissioners on the present occasion. Promises had many times been made to them, and, said the speaker, unless they were now fulfilled they would not consider the broader question of the treaty.\n\nMr. S. J. Dawson, one of the Commissioners, reciprocated the expression of pleasure used by the Chiefs through their spokesman. He had long looked forward to this meeting, when all matters relating to the past, the present, and the future, could be disposed of so as to fix permanently the friendly relations between the Indians and the white men. It was now, he continued, some years since the white men first came to this country—they came in the first place at the head of a great military expedition; and when that expedition was passing through the country all the chiefs showed themselves to be true and loyal subjects—they showed themselves able and willing to support their Great Mother the Queen. Subsequently, when\nwe began to open up the road, we had to call upon the Indians to assist us in doing so, and they always proved themselves very happy to help in carrying out our great schemes. He was, he continued, one of the Commission employed by the Government to treat with them and devise a scheme whereby both white men and Indians would be benefitted. We made to the Indians the proposals we were authorized to make, and we have carried out these proposals in good faith. This was three years ago. What we were directed to offer we did offer, but the Indians thought it was too little, and negotiations were broken off. Since this I have done what was in my power to bring about this meeting with new terms, and consider it a very happy day that you should be assembled to meet the Governor of the Territory as representative of Her Majesty. He would explain to them the proposals he had to make. He had lived long amongst them and would advise them as a friend to take the opportunity of making arrangements with the Governor. When we arrange the general matters in question, should you choose to ask anything, I shall be most happy to explain it, as I am here all the time.\n\nThe Chief in reply said his head men and young men were of one mind, and determined not to enter upon the treaty until the promises made in the past were fulfilled, they were tired of waiting. What the Commissioners called \"small matters\" were great to them, and were what they wished to have settled.\n\nThe route that had been built through the country proved this, and the Commissioners promised something which they now wanted.\n\nThis was taking the Commissioners on a new tack, but Mr. Dawson promptly undertook to answer the objections. He said all these questions had been discussed before; but if he had made any promises that remained unfulfilled, he would be happy to learn their nature. The Chief replied that all the houses on the line, and all the big boats on the waters, were theirs, and they wanted to be recompensed for them.\nMr. Dawson continued, saying he was glad they had now come to a point on which they could deal. The Indians questioned the right of the Government to take wood for the steamers. This was a right which the speaker had all along told them was common to all Her Majesty's subjects. He then referred them to the Governor if they had anything more to say on that subject. Wood on which Indians had bestowed labor was always paid for; but wood on which we had spent our own labor was ours.\n\nHis Excellency then addressed them at some length. He understood that they wanted to have the questions in which they were interested treated separately. This was not what he came there for. Wood and water were the gift of the Great Spirit, and were made alike for the good of both the white man and red man. Many of his listeners had come a long way, and he, too, had come a long way, and he wanted all the questions settled at once, by one treaty. He had a message from the Queen, but if his mouth was kept shut, the responsibility would rest on the Indians, and not with him if he were prevented from delivering it. He had authority to tell them what sum of money he could give them in hand now, and what he could give them every year; but it was for them to open his mouth. He concluded his remarks, which were forcibly delivered, with an emphatic \"I have said.\"\n\nThe Chief reiterated that he and his young men were determined not to go on with the treaty until the first question was disposed of. What was said about the trees and rivers was quite true, but it was the Indian's country, not the white man's. Following this the Governor told the Council that unless they would settle all the matters, the big and little, at once, he would not talk. He was bound by his Government, and was of the same mind to treat with them on all questions, and not on any one separately.\n\nOn seeing His Excellency so firm, and feeling that it would not do to allow any more time to pass without coming to busi-\nness the Chief asked the Governor to open his mouth and tell what propositions he was prepared to make.\n\nHis Excellency then said—\"I told you I was to make the treaty on the part of our Great Mother the Queen, and I feel it will be for your good and your children's. I should have been very sorry if you had shut my mouth, if I had had to go home without opening my mouth. I should not have been a true friend of yours if I had not asked you to open my mouth. We are all children of the same Great Spirit, and are subject to the same Queen. I want to settle all matters both of the past and the present, so that the white and red man will always be friends. I will give you lands for farms, and also reserves for your own use. I have authority to make reserves such as I have described, not exceeding in all a square mile for every family of five or thereabouts. It may be a long time before the other lands are wanted, and in the meantime you will be permitted to fish and hunt over them. I will also establish schools whenever any band asks for them, so that your children may have the learning of the white man. I will also give you a sum of money for yourselves and every one of your wives and children for this year. I will give you ten dollars per head of the population, and for every other year five dollars a-head. But to the chief men, not exceeding two to each band, we will give twenty dollars a-year for ever. I will give to each of you this year a present of goods and provisions to take you home, and I am sure you will be satisfied.\n\nAfter consultation amongst themselves, the Councillors went to have a talk about the matter and will meet the Governor tomorrow morning, when it is expected the bargain will be concluded. Of course the Indians will make some other demands.\n\nImmediately after the adjournment as above, the Governor presented an ox to the people in camp; and the way it disappeared would have astonished the natives of any other land. Half-an-hour after it was led into encampment, it was cut up and boiling in fifty pots.\nTHIRD DAY.\n\nProceedings were opened at eleven o'clock by the Governor announcing that he was ready to hear what the Chiefs had to say. The Fort Francis Chief acted as spokesman, assisted by another Chief, Powhassan.\n\nMA-WE-DO-PE-NAIS—\"I now lay down before you the opinions of those you have seen before. We think it a great thing to meet you here. What we have heard yesterday, and as you represented yourself, you said the Queen sent you here, the way we understood you as a representative of the Queen. All this is our property where you have come. We have understood you yesterday that Her Majesty has given you the same power and authority as she has, to act in this business; you said the Queen gave you her goodness, her charitableness in your hands. This is what we think, that the Great Spirit has planted us on this ground where we are, as you were where you came from. We think where we are is our property. I will tell you what he said to us when he planted us here; the rules that we should follow—us Indians—He has given us rules that we should follow to govern us rightly. We have understood you that you have opened your charitable heart to us like a person taking off his garments and throwing them to all of us here. Now, first of all, I have a few words to address to this gentleman (Mr. Dawson). When he understood rightly what was my meaning yesterday, he threw himself on your help. I think I have a right to follow him to where he flew when I spoke to him on the subject yesterday. We will follow up the subject from the point we took it up. I want to answer what we heard from you yesterday, in regard to the money that you have promised us yesterday to each individual. I want to talk about the rules that we had laid down before. It is four years back since we have made these rules. The rules laid down are the rules that they wish to follow—a council that has been agreed upon by all the Indians. I do\nnot wish that I should be required to say twice what I am now going to lay down. We ask fifteen dollars for all that you see, and for the children that are to be born in future. This year only we ask for fifteen dollars; years after ten dollars; our Chiefs fifty dollars per year for every year, and other demands of large amounts in writing, say $125,000 yearly.\"\n\nAnother Chief—\"I take my standing point from here. Our councillors have in council come to this conclusion, that they should have twenty dollars each; our warriors, fifteen dollars; our population, fifteen dollars. We have now laid down the conclusion of our councils by our decisions. We tell you our wishes are not divided. We are all of one mind.\" (Paper put in before the Governor for these demands.)\n\nChief—\"I now let you know the opinions of us here. We would not wish that anyone should smile at our affairs, as we think our country is a large matter to us. If you grant us what is written on that paper, then we will talk about the reserves; we have decided in council for the benefit of those that will be born hereafter. If you do so the treaty will be finished, I believe.\"\n\nGovernor—\"I quite agree that this is no matter to smile at. I think that the decision of to-day is one that affects yourselves and your children after, but you must recollect that this is the third time of negotiating. If we do not shake hands and make our Treaty to-day, I do not know when it will be done, as the Queen's Government will think you do not wish to treat with her. You told me that you understood that I represented the Queen's Government to you and that I opened my heart to you, but you must recollect that if you are a council there is another great council that governs a great Dominion, and they hold their councils the same as you hold yours. I wish to tell you that I am a servant of the Queen. I cannot do my own will; I must do hers. I can only give you what she tells me to give you. I am sorry to see that your hands were very wide open when you gave me this paper. I thought what I pro-\nmised you was just, kind and fair between the Queen and you. It is now three years we have been trying to settle this matter. If we do not succeed today I shall go away feeling sorry for you and for your children that you could not see what was good for you and for them. I am ready to do what I promised you yesterday. My hand is open and you ought to take me by the hand and say, \"yes, we accept of your offer.\" I have not the power to do what you ask of me. I ask you once more to think what you are doing, and of those you have left at home, and also of those that may be born yet, and I ask you not to turn your backs on what is offered to you, and you ought to see by what the Queen is offering you that she loves her red subjects as much as her white. I think you are forgetting one thing, that what I offer you is to be while the water flows and the sun rises. You know that in the United States they only pay the Indian for twenty years, and you come here today and ask for ever more than they get for twenty years. Is that just? I think you ought to accept my offer, and make a treaty with me as I ask you to do. I only ask you to think for yourselves, and for your families, and for your children and children's children, and I know that if you do that you will shake hands with me today.\"\n\nChief—\"I lay before you our opinions. Our hands are poor but our heads are rich, and it is riches that we ask so that we may be able to support our families as long as the sun rises and the water runs.\"\n\nGovernor—\"I am very sorry; you know it takes two to make a bargain; you are agreed on the one side, and I for the Queen's Government on the other. I have to go away and report that I have to go without making terms with you. I doubt if the Commissioners will be sent again to assemble this nation. I have only one word more to say; I speak to the Chief and to the head men to recollect those behind them, and those they have left at home, and not to go away without accepting such liberal terms and without some clothing.\"\nChief—\"My terms I am going to lay down before you; the decision of our Chiefs; ever since we came to a decision you push it back. The sound of the rustling of the gold is under my feet where I stand; we have a rich country; it is the Great Spirit who gave us this; where we stand upon is the Indians' property, and belongs to them. If you grant us our requests you will not go back without making the treaty.\"\n\nAnother Chief—\"We understood yesterday that the Queen had given you the power to act upon, that you could do what you pleased, and that the riches of the Queen she had filled your head and body with, and you had only to throw them round about; but it seems it is not so, but that you have only half the power that she has, and that she has only half filled your head.\"\n\nGovernor—\"I do not like to be misunderstood. I did not say yesterday that the Queen had given me all the power; what I told you was that I was sent here to represent the Queen's Government, and to tell you what the Queen was willing to do for you. You can understand very well; for instance, one of your great chiefs asks a brave to deliver a message, he represents you, and that is how I stand with the Queen's Government.\"\n\nChief—\"It is your charitableness that you spoke of yesterday—Her Majesty's charitableness that was given you. It is our chiefs, our young men, our children and great grandchildren, and those that are to be born, that I represent here, and it is for them I ask for terms. The white man has robbed us of our riches, and we don't wish to give them up again without getting something in their place.\"\n\nGovernor—\"For your children, grandchildren, and children unborn, I am sorry that you will not accept of my terms. I shall go home sorry, but it is your own doing; I must simply go back and report the fact that you refuse to make a treaty with me.\"\n\nChief—\"You see all our chiefs before you here as one mind;\nwe have one mind and one mouth. It is the decision of all of us; if you grant us our demands you will not go back sorrowful; we would not refuse to make a treaty if you would grant us our demands.\"\n\nGovernor—\"I have told you already that I cannot grant your demands; I have not the power to do so. I have made you a liberal offer, and it is for you to accept or refuse it as you please.\"\n\nChief—\"Our chiefs have the same opinion; they will not change their decision.\"\n\nGovernor—\"Then the Council is at an end.\"\n\nChief (of Lac Seule)—\"I understand the matter that he asks; if he puts a question to me as well as to others, I say so as well as the rest. We are the first that were planted here; we would ask you to assist us with every kind of implement to use for our benefit, to enable us to perform our work; a little of everything and money. We would borrow your cattle; we ask you this for our support; I will find whereon to feed them. The waters out of which you sometimes take food for yourselves, we will lend you in return. If I should try to stop you—it is not in my power to do so; even the Hudson's Bay Company—that is a small power—I cannot gain my point with it. If you give what I ask, the time may come when I will ask you to lend me one of your daughters and one of your sons to live with us; and in return I will lend you one of my daughters and one of my sons for you to teach what is good, and after they have learned, to teach us. If you grant us what I ask, although I do not know you, I will shake hands with you. This is all I have to say,\"\n\nGovernor—\"I have heard and I have learned something. I have learned that you are not all of one mind. I know that your interests are not the same—that some of you live in the north far away from the river; and some live on the river, and that you have got large sums of money for wood that you have cut and sold to the steamboats; but the men in the north have\nnot this advantage. What the Chief has said is reasonable; and should you want goods I mean to ask you what amount you would have in goods, so that you would not have to pay the traders' prices for them. I wish you were all of the same mind as the Chief who has just spoken. He wants his children to be taught. He is right. He wants to get cattle to help him to raise grain for his children. It would be a good thing for you all to be of his mind, and then you would not go away without making this treaty with me.\"\n\nBlackstone (Shebandowan)—\"I am going to lay down before you the minds of those who are here. I do not wish to interfere with the decisions of those who are before you, or yet with your decisions. The people at the height of land where the waters came down from Shebandowan to Fort Frances, are those who have appointed me to lay before you our decision. We are going back to hold a Council.\"\n\nMr. Dawson—\"I would ask the Chief who has just spoken, did the band at Shebandowan—did Rat McKay, authorize him to speak for them? Ke-ha-ke-ge-nen is Blackstone's own Chief; and I am perfectly willing to think that he authorized him. What I have to say is that the Indians may not be deceived by representations made to them, and that the two bands met me at Shebandowan and said they were perfectly willing to enter into a treaty.\"\n\nGovernor—\"I think the nation will do well to do what the Chief has said. I think he has spoken sincerely, and it is right for them to withdraw and hold a Council among themselves.\"\n\nBlackstone here handed in a paper which he alleged gave him authority as Chief, but which proved to be an official acknowledgement of the receipt of a letter by the Indian Department at Ottawa.\n\nThe Governor here agreed with the Council that it would be well for the Chiefs to have another meeting amongst themselves. It was a most important day for them and for their children, and His Excellency would be glad to meet them again.\nThe Council broke up at this point, and it was extremely doubtful whether an agreement could be come to or not. The Rainy River Indians were careless about the treaty, because they could get plenty of money for cutting wood for the boats, but the northern and eastern bands were anxious for one. The Governor decided that he would make a treaty with those bands that were willing to accept his terms, leaving out the few disaffected ones. A Council was held by the Indians in the evening, at which Hon. James McKay, Pierre Léveillé, Charles Nolin, and Mr. Genton were present by invitation of the Chiefs. After a very lengthy and exhaustive discussion, it was decided to accept the Governor's terms, and the final meeting was announced for Friday morning. Punctually at the appointed time proceedings were opened by the Fort Francis Chiefs announcing to His Excellency that they were all of one mind, and would accept his terms, with a few modifications. The discussion of these terms occupied five hours, and met every possible contingency so fully that it would be impossible to do justice to the negotiators otherwise than by giving a full report of the speeches on both sides; but want of space compels us to lay it over until next week.\n\nThe treaty was finally closed on Friday afternoon, and signed on Saturday; after which a large quantity of provisions, ammunition and other goods were distributed.\n\nWhen the council broke up last (Thursday) night, 3rd October, it looked very improbable that an understanding could be arrived at, but the firmness of the Governor, and the prospect that he would make a treaty with such of the bands as were willing to accept his terms, to the exclusion of the others, led them to reconsider their demands. The Hon. James McKay, and Messrs. Nolin, Genton, and Léveillé were invited in to their council, and after a most exhaustive discussion of the circumstance in which they were placed, it was resolved to accept the Governor's terms, with some modifications. Word was sent to\nthis effect, and at eleven o'clock on Friday, conference was again held with His Excellency.\n\nThe Fort Francis Chief opened negotiations by saying:—\n\n\"We present our compliments to you, and now we would tell you something. You have mentioned our councillors, warriors and messengers—every Chief you see has his councillors, warriors and messengers.\"\n\nGovernor—\"I was not aware what names they gave me—they gave their chief men. I spoke of the subordinates of the head Chiefs; I believe the head Chiefs have three subordinates—I mean the head Chief and three of his head men.\"\n\nChief—\"I am going to tell you the decision of all before you. I want to see your power and learn the most liberal terms that you can give us.\"\n\nGovernor—\"I am glad to meet the Chiefs, and I hope it will be the last time of our meeting. I hope we are going to understand one-another to-day. And that I can go back and report that I left my Indian friends contented, and that I have put into their hands the means of providing for themselves and their families at home; and now I will give you my last words. When I held out my hands to you at first, I intended to do what was just and right, and what I had the power to do at once,—not to go backwards and forwards, but at once to do what I believe is just and right to you. I was very much pleased yesterday with the words of the Chief of Lac Seul. I was glad to hear that he had commenced to farm and to raise things for himself and family, and I was glad to hear him ask me to hold out my hand. I think we should do everything to help you by giving you the means to grow some food, so that if it is a bad year for fishing and hunting you may have something for your children at home. If you had not asked it the Government would have done it all the same, although I had not said so before. I can say this, that when a band settles down and actually commences to farm on their lands, the Government\nwill agree to give two hoes, one spade, one scythe, and one axe for every family actually settled; one plough for every ten families; five harrows for every twenty families; and a yoke of oxen, a bull and four cows for every band; and enough barley, wheat and oats to plant the land they have actually broken up. This is to enable them to cultivate their land, and it is to be given them on their commencing to do so, once for all. There is one thing that I have thought over, and I think it is a wise thing to do. That is to give you ammunition, and twine for making nets, to the extent of $1,500 per year, for the whole nation, so that you can have the means of procuring food.—Now, I will mention the last thing that I can do. I think that the sum I have offered you to be paid after this year for every man, woman and child now, and for years to come, is right and is the proper sum. I will not make any change in that, but we are anxious to show you that we have a great desire to understand you—that we wish to do the utmost in our power to make you contented, so that the white and the red man will always be friends. This year, instead of ten dollars we will give you twelve dollars, to be paid you at once as soon as we sign the treaty. This is the best I can do for you. I wish you to understand we do not come here as traders, but as representing the Crown, and to do what we believe is just and right. We have asked in that spirit, and I hope you will meet me in that spirit and shake hands with me-day and make a treaty for ever. I have no more to say.”\n\nChief—“I wish to ask some points that I have not properly understood. We understand that our children are to have two dollars extra. Will the two dollars be paid to our principal men as well? And these things that are promised will they commence at once and will we see it year after year?”\n\nGovernor—“I thought I had spoken fully as to everything, but I will speak again. The ammunition and twine will be got at once for you, this year, and that will be for every year. The Commissioner will see that you get this at once; with regard\nto the things to help you to farm, you must recollect, in a very few days the river will be frozen up here and we have not got these things here now. But arrangements will be made next year to get these things for those who are farming, it cannot be done before as you can see yourselves very well. Some are farming, and I hope you will all do so.\"\n\nChief—\"One thing I did not say that is most necessary—we want a cross-cut saw, a whip saw, grindstone and files.\"\n\nGovernor—\"We will do that, and I think we ought to give a box of common tools to each Chief of a Band.\"\n\nChief—\"Depending upon the words you have told us, and stretched out your hands in a friendly way, I depend upon that. One thing more we demand—a suit of clothes to all of us.\"\n\nGovernor—\"With regard to clothing, suits will be given to the Chiefs and head men, and as to the other Indians there is a quantity of goods and provisions here that will be given them at the close of the treaty. The coats of the Chiefs will be given every three years.\"\n\nChief—\"Once more; powder and shot will not go off without guns. We ask for guns.\"\n\nGovernor—\"I have shewn every disposition to meet your view, but what I have promised is as far as I can go.\"\n\nChief—\"My friends, listen to what I am going to say, and you, my brothers. We present you now with our best and our strongest compliments. We ask you not to reject some of our children who have gone out of our place; they are scattered all over, a good tasted meat hath drawn them away, and we wish to draw them all here and be contented with us.\"\n\nGovernor—\"If your children come and live here, of course they will become part of the population, and be as yourselves.\"\n\nChief—\"I hope you will grant the request that I am going to lay before you. I do not mean those that get paid on the other side of the line, but some poor Indians who may happen to fall in our road. If you will accept of these little matters, the treaty will be at an end. I would not like that one of my\nchildren should not eat with me, and receive the food that you are going to give me.\"\n\nGovernor—\"I am dealing with British Indians and not American Indians; after the treaty is closed we will have a list of the names of any children of British Indians that may come in during two years and be ranked with them; but we must have a limit somewhere.\"\n\nChief—\"I should not feel happy if I was not to mess with some of my children that are around me—those children that we call the Half-breed—those that have been born of our women of Indian blood. We wish that they should be counted with us, and have their share of what you have promised. We wish you to accept our demands. It is the Half-breeds that are actually living amongst us—those that are married to our women.\"\n\nGovernor—\"I am sent here to treat with the Indians. In Red River, where I came from, and where there is a great body of Half-breeds, they must be either white or Indian. If Indians, they get treaty money; if the Half-breeds call themselves white, they get land. All I can do is to refer the matter to the Government at Ottawa, and to recommend what you wish to be granted.\"\n\nChief—\"I hope you will not drop the question; we have understood you to say that you came here as a friend, and represented your charitableness, and we depend upon your kindness. You must remember that our hearts and our brains are like paper; we never forget. There is one thing that we want to know. If you should get into trouble with the nations, I do not wish to walk out and expose my young men to aid you in any of your wars.\"\n\nGovernor—\"The English never call the Indians out of their country to fight their battles. You are living here and the Queen expects you to live at peace with the white men and your red brothers, and with other nations.\"\n\nAnother Chief—\"I ask you a question—I see your roads\nhere passing through the country, and some of your boats—useful articles that you use for yourself. Bye and bye we shall see things that run swiftly, that go by fire—carriages—and we ask you that us Indians may not have to pay their passage on these things, but can go free.\"\n\nGovernor—\"I think the best thing I can do is to become an Indian. I cannot promise you to pass on the railroad free, for it may be a long time before we get one; and I cannot promise you any more than other people.\"\n\nChief—\"I must address myself to my friend here, as he is the one that has the Public Works.\"\n\nMr. Dawson—\"I am always happy to do anything I can for you. I have always given you a passage on the boats when I could. I will act as I have done though I can give no positive promise for the future.\"\n\nChief—\"We must have the privilege of travelling about the country where it is vacant.\"\n\nMr. McKay—\"Of course, I told them so.\"\n\nChief—\"Should we discover any metal that was of use, could we have the privilege of putting our own price on it?\"\n\nGovernor—\"If any important minerals are discovered on any of their reserves the minerals will be sold for their benefit with their consent, but not on any other land that discoveries may take place upon; as regards other discoveries, of course, the Indian is like any other man. He can sell his information if he can find a purchaser.\"\n\nChief—\"It will be as well while we are here that everything should be understood properly between us. All of us—those behind us—wish to have their reserves marked out, which they will point out, when the time comes. There is not one tribe here who has not laid it out.\"\n\nCommissioner Provencher (the Governor being temporarily absent)—\"As soon as it is convenient to the Government to send surveyors to lay out the reserves they will do so, and they will try to suit every particular band in this respect.\"\nCHIEF—\"We do not want anybody to mark out our reserves, we have already marked them out.\"\n\nCOMMISSIONER—\"There will be another undertaking between the officers of the Government and the Indians among themselves for the selection of the land; they will have enough of good farming land, they may be sure of that.\"\n\nCHIEF—\"Of course, if there is any particular part wanted by the public works they can shift us. I understand that; but if we have any gardens through the country, do you wish that the poor man should throw it right away?\"\n\nCOMMISSIONER—\"Of course not.\"\n\nCHIEF—\"These are matters that are the wind-up. I begin now to see how I value the proceedings. I have come to this point, and all that are taking part in this treaty and yourself. I would wish to have all your names in writing handed over to us. I would not find it to my convenience to have a stranger here to transact our business between me and you. It is a white man who does not understand our language that is taking it down. I would like a man that understands our language and our ways. We would ask your Excellency as a favor to appoint him for us.\"\n\nGOVERNOR—\"I have a very good feeling to Mr. C. Nolin, he has been a good man here; but the appointment of an Agent rests with the authorities at Ottawa and I will bring your representation to them, and I am quite sure it will meet with the respect due to it.\"\n\nCHIEF—\"As regards the fire water, I do not like it and I do not wish any house to be built to have it sold. Perhaps at times if I should be unwell I might take drop just for medicine; and shall any one insist on bringing it where we are, I should break the treaty.\"\n\nGOVERNOR—\"I meant to have spoken of that myself, I meant to put it in the treaty. He speaks good about it. The Queen and her Parliament in Ottawa have passed a law prohibiting the\nuse of it in this territory, and if any shall be brought in for the use of you as medicine it can only come in by my permission.\"\n\nChief—\"Why we keep you so long is that it is our wish that everything should be properly understood between us.\"\n\nGovernor—\"That is why I am here. It is my pleasure, and I want when we once shake hands that it should be forever.\"\n\nChief—\"That is the principal article. If it was in my midst the fire water would have spoiled my happiness, and I wish it to be left far away from where I am. All the promises that you have made me, the little promises and the money you have promised, when it comes to me year after year—should I see that there is anything wanting, through the negligence of the people that have to see after these things, I trust it will be in my power to put them in prison.\"\n\nGovernor—\"The ear of the Queen's Government will always be open to hear the complaints of her Indian people, and she will deal with her servants that do not do their duty in a proper manner.\"\n\nChief—\"Now you have promised to give us all your names. I want a copy of the treaty that will not be rubbed off, on parchment.\"\n\nGovernor—\"In the mean time I will give you a copy on paper, and as soon as I get back I will get you a copy on parchment.\"\n\nChief—\"I do not wish to be treated as they were at Red River—that provisions should be stopped as it is there. Whenever we meet and have a council I wish that provisions should be given to us. We cannot speak without eating.\"\n\nGovernor—\"You are mistaken. When they are brought together at Red River for their payments they get provisions.\"\n\nChief—\"We wish the provisions to come from Red River.\"\n\nGovernor—\"If the Great Spirit sends the grasshopper and there is no wheat grown in Red River, we cannot give it to you.\"\n\nChief—\"You have come before us with a smiling face, you\nhave shown us great charity—you have promised the good things; you have given us your best compliments and wishes, not only for once but for ever; let there now for ever be peace and friendship between us. It is the wish of all that where our reserves are peace should reign, that nothing shall be there that will disturb peace. Now, I will want nothing to be there that will disturb peace, and will put every one that carries arms,—such as murderers and thieves—outside, so that nothing will be there to disturb our peace.\"\n\nGovernor—\"The Queen will have policemen to preserve order, and murderers and men guilty of crime will be punished in this country just the same as she punishes them herself.\"\n\nChief—\"To speak about the Hudson's Bay Company. If it happens that they have surveyed where I have taken my reserve, if I see any of their signs I will put them on one side.\"\n\nGovernor—\"When the reserves are given you, you will have your rights. The Hudson's Bay Company have their rights, and the Queen will do justice between you.\"\n\nChief of Fort Francis—\"Why I say this is, where I have chosen for my reserve I see signs that the H. B. Co. has surveyed. I do not hate them. I only wish they should take their reserves on one side. Where their shop stands now is my property; I think it is three years now since they have had it on it.\"\n\nGovernor—\"I do not know about that matter; it will be enquired into. I am taking notes of all these things and am putting them on paper.\"\n\nChief—I will tell you one thing. You understand me now; that I have taken your hand firmly and in friendship. I repeat twice that you have done so, that these promises that you have made, and the treaty to be concluded, let it be as you promise, as long as the sun rises over our head and as long as the water runs. One thing I find, that deranges a little my kettle. In this river, where food used to be plentiful for our subsistence,\nI perceive it is getting scarce. We wish that the river should be left as it was formed from the beginning—that nothing be broken.\"\n\nGovernor—\"This is a subject that I cannot promise.\"\n\nMr. Dawson—\"Anything that we are likely to do at present will not interfere with the fishing, but no one can tell what the future may require, and we cannot enter into any engagement.\"\n\nChief—\"We wish the Government would assist us in getting a few boards for some of us who are intending to put up houses this fall, from the mill at Fort Francis.\"\n\nGovernor—\"The mill is a private enterprise, and we have no power to give you boards from that.\"\n\nChief—\"I will now show you a medal that was given to those who made a treaty at Red River by the Commissioner. He said it was silver, but I do not think it is. I should be ashamed to carry it on my breast over my heart. I think it would disgrace the Queen, my mother, to wear her image on so base a metal as this. [Here the Chief held up the medal and struck it with the back of his knife. The result was anything but the 'true ring,' and made every man ashamed of the petty meanness that had been practised.] Let the medals you give us be of silver—medals that shall be worthy of the high position our Mother the Queen occupies.\"\n\nGovernor—\"I will tell them at Ottawa what you have said, and how you have said it.\"\n\nChief—\"I wish you to understand you owe the treaty much to the Half-breeds.\"\n\nGovernor—\"I know it. I sent some of them to talk with you, and I am proud that all the Half-breeds from Manitoba, who are here, gave their Governor their cordial support.\"\n\nThe business of the treaty having now been completed, the Chief, Mawedopenais, who, with Powhassan, had with such wonderful tact carried on the negotiations, stepped up to the Governor and said:—\n\"Now you see me stand before you all; what has been done here to-day has been done openly before the Great Spirit, and before the nation, and I hope that I may never hear any one say that this treaty has been done secretly; and now, in closing this Council, I take off my glove, and in giving you my hand, I deliver over my birth-right and lands; and in taking your hand, I hold fast all the promises you have made, and I hope they will last as long as the sun goes round and the water flows, as you have said.\"\n\nThe Governor then took his hand and said:\n\n\"I accept your hand and with it the lands, and will keep all my promises, in the firm belief that the treaty now to be signed will bind the red man and the white together as friends for ever.\"\n\nA copy of the treaty was then prepared and duly signed, after which a large amount of presents, consisting of pork, flour, clothing, blankets, twine, powder and shot, etc., were distributed to the several bands represented on the ground.\n\nOn Saturday, Mr. Pether, Local Superintendent of Indian Affairs at Fort Francis, and Mr. Graham of the Government Works, began to pay the treaty money—an employment that kept them busy far into the night. Some of the Chiefs received as much as one hundred and seventy dollars for themselves and families.\n\nAs soon as the money was distributed the shops of the H. B. Co., and other resident traders were visited, as well as the tents of numerous private traders, who had been attracted thither by the prospect of doing a good business. And while these shops all did a great trade—the H. B. Co. alone taking in $4,000 in thirty hours—it was a noticeable fact that many took home with them nearly all their money. When urged to buy goods there, a frequent reply was: \"If we spend all our money here and go home and want debt, we will be told to get our debt where we spent our money. \"Debt\" is used by them instead of the word \"credit.\" Many others deposited money with\nwhite men and Half-breeds on whose honor they could depend, to be called for and spent at Fort Garry when \"the ground froze.\"\n\nOne very wonderful thing that forced itself on the attention of every one was the perfect order that prevailed throughout the camp, and which more particularly marked proceedings in the council. Whether the demands put forward were granted by the Governor or not, there was no petulance, no ill-feeling, evinced; but everything was done with a calm dignity that was pleasing to behold, and which might be copied with advantage by more pretentious deliberative assemblies.\n\nOn Sunday afternoon, the Governor presented an ox to the nation, and after it had been eaten a grand dance was indulged in. Monday morning the river Indians took passage on the steamer for Fort Francis, and others left in their canoes for their winter quarters.\n\nThe Governor and party left on Monday morning, the troops, under command of Captain McDonald, who had conducted themselves with the greatest propriety, and had contributed, by the moral effect of their presence, much to the success of the negotiation, having marched to Fort Garry on Saturday morning.\nCHAPTER VI.\n\nTHE QU'APPELLE TREATY, OR NUMBER FOUR.\n\nThis treaty, is, so generally called, from having been made at the Qu'Appelle Lakes, in the North-West Territories. The Indians treated with, were a portion of the Cree and Saulteaux Tribes, and under its operations, about 75,000 square miles of territory were surrendered. This treaty, was the first step towards bringing the Indians of the Fertile Belt into closer relations with the Government of Canada, and was a much-needed one. In the year 1871, Major Butler was sent into the North-West Territories by the Government of Canada, to examine into and report, with regard to the state of affairs there. He reported, to Lieutenant-Governor Archibald, that \"law and order are wholly unknown in the region of the Saskatchewan, in so much, as the country is without any executive organization, and destitute of any means of enforcing the law.\" Towards remedying this serious state of affairs, the Dominion placed the North-West Territories under the rule of the Lieutenant-Governor and Council of the Territories, the Lieutenant-Governor of Manitoba, being, ex officio, Governor of the Territories. This body, composed of representative men, possessed executive functions, and legislative powers. They entered upon their duties with zeal, and discharged them with efficiency. Amongst other measures, they passed a prohibitory liquor law, which subsequently was practically adopted by a Statute of the Dominion. They proposed the establishment of a Mounted Police Force, a suggestion which was given force to by the Dominion Cabinet, and they recommended, that, treaties should be made, with the Indians at Forts Qu'Appelle, Carlton\nand Pitt, recommendations, which, were all, eventually, carried out. In the report of the Minister of the Interior, for the year 1875, he states \"that it is due to the Council to record the fact, that the legislation and valuable suggestions, submitted to your Excellency, from time to time, through their official head, Governor Morris, aided the Government not a little in the good work of laying the foundations of law and order, in the North-West, in securing the good will of the Indian tribes, and in establishing the prestige of the Dominion Government, throughout that vast country.\" In accordance with these suggestions, the Government of the Dominion, decided, on effecting a treaty, with the plain Indians, Crees and Chippawas, who inhabit the country, of which, Fort Qu'Appelle, was a convenient centre, and entrusted the duty, to the Hon. Alexander Morris then Lieutenant-Governor of Manitoba and the North-West Territories, the Hon. David Laird, then Minister of the Interior, and now Lieutenant-Governor of the North-West Territories, and the Hon. W. J. Christie, a retired factor of the Hudson's Bay Company, and a gentleman of large experience, among the Indian tribes.\n\nIn pursuance of this mission, these gentlemen left Fort Garry in August, 1874, and journeyed to Lake Qu'Appelle (the calling or echoing lake), where they met the assembled Indians, in September. The Commissioners, had an escort of militia, under the command of Lieut.-Col. Osborne Smith, C.M.G. This force marched to and from Qu'Appelle, acquitted themselves with signal propriety, and proved of essential service. Their return march was made in excellent time. The distance, three hundred and fifty miles having been accomplished in sixteen and a half days.\n\nThe Commissioners encountered great difficulties, arising, from the excessive demands of the Indians, and from the jealousies, existing between the two Nations, Crees and Chip-pawas, but by perseverance, firmness and tact, they succeeded in overcoming the obstacles, they had to encounter, and\neventually effected a treaty, whereby the Indian title was extinguished in a tract of country, embracing 75,000 square miles of territory. After long and animated discussions the Indians, asked to be granted the same terms as were accorded to the Indians of Treaty Number Three, at the North-West Angle, hereinbefore mentioned. The Commissioners assented to their request and the treaty was signed accordingly.\n\nOn the return, of the Commissioners to Fort Ellice, they met there, the Chippawas of that vicinage, and made a supplementary treaty with them. These Indians were included in the boundaries of Treaty Number Two, but had not been treated with, owing to their distance from Manitoba House, where that treaty was made. In 1875, the Hon. W. J. Christie, and Mr. M. G. Dickieson, then of the Department of the Interior, and subsequently, Assistant Superintendent of Indian affairs, in the North-West Territories, were appointed to make the payments of annuities, to the Indians, embraced in the Treaty Number Four, and obtain the adhesion of other bands, which had not been present at Qu’Appelle, the previous year. They met, the Indians, at Qu’Appelle (where six Chiefs who had been absent, accepted the terms of the treaty) and at Fort Pelly and at Shoal River, where two other Chiefs, with their bands, came into the treaty stipulations. A gratifying feature connected with the making of this, and the other, North-Western Treaties, has been the readiness, with which the Indians, who were absent, afterwards accepted the terms which had been settled for them, by those, who were able to attend. I close these observations, by annexing, the reports of Lieutenant-Governor Morris, to the Honorable the Secretary of State of Canada, of date 17th October, 1874, giving, an account, of the making of the treaties at Qu’Appelle and Fort Ellice, and an extract, from that of Messrs. Christie and Dickieson, dated 7th October, 1875, describing its further completion, and I also insert, accurate short-hand reports of the proceedings at Qu’Appelle and Fort Ellice, which, were made, at the time,\nby Mr. Dickieson, who, was present, at the treaty, as secretary to the Commissioners. These will be found to be both interesting and instructive.\n\nGovernment House,\nFort Garry, Manitoba, October 17, 1874.\n\nSir,—I have the honor to inform you that in compliance with the request of the Government, I proceeded to Lake Qu'Appelle in company with the Hon. David Laird, in order to act with him and W. J. Christie, Esq., as Commissioners to negotiate a treaty with the tribes of Indians in that region.\n\nMr. Laird and I left Fort Garry on the 26th of August, and arrived at Lake Qu'Appelle on the 8th of September, Mr. Christie having gone in advance of us to Fort Pelly.\n\nWe were accompanied on arriving by the escort of militia under the command of Lieut.-Col. W. Osborne Smith, who had preceded us, but whom we had overtaken.\n\nThe escort took up their encampment at a very desirable situation on the edge of the lake, the Indians being encamped at some distance.\n\nThe Commissioners were kindly provided with apartments by W. J. McLean, Esq., the officer in charge of the Hudson Bay Company's Post.\n\nAfter our arrival, the Commissioners caused the Indians to be summoned, to meet them, in a marquee tent adjoining the encampment of the militia.\n\nThe Crees came headed by their principal Chief \"Loud Voice,\" and a number of Saulteaux followed, without their Chief, Coté. The Commissioners, having decided that it was desirable that there should be only one speaker on behalf of the Commissioners, requested me owing to my previous experience with the Indian tribes and my official position as Lieutenant-Governor of the North-West Territories, to undertake the duty, which I agreed to do. Accordingly, I told the Indians the object of our coming and invited them to present to us their Chiefs and headmen. \"Loud Voice\" stated that they were not yet ready and asked for a delay till next day, to which we assented.\n\nOn the 9th, four Indian soldiers were sent to the Commissioners to ask for two days delay, but we replied that when they met us in conference they could prefer any reasonable request, but that we expected them to meet us as agreed on the previous day, and further that the Saulteaux had not conducted themselves with proper respect to the Commissioners, as representatives of the Crown, as their principal Chief Coté had not met us. Eventually, both the Crees and the Saulteaux met us, with their Chiefs, when I addressed them. They asked time to deliberate and we appointed the 11th at ten o'clock for the next conference.\nThe Crees then left the tent suddenly, under constraint of the Indian soldiers, who compelled the Chiefs to go.\n\nOn the 11th we sent a bugler round to summon the Indians to the appointed conference, but they did not come.\n\nInstead the Saulteaux sent word that they could not meet us except in their own soldiers' tent, distant about a mile from the militia encampment, but we refused to do so.\n\nThe Crees were ready to proceed to the marquee, but were prevented by the Saulteaux, a section of whom displayed a turbulent disposition and were numerically the strongest party. We sent our interpreter Charles Pratt, a Cree Indian, who was educated at St. John's College here, and who is a catechist of the Church of England, to tell the Indians that they must meet us as agreed upon.\n\nIn consequence, about four o'clock in the afternoon, the Crees led by \"Loud Voice,\" came to the conference, but the Saulteaux kept away, though a number were sent to hear and report. On behalf of the Commissioners, I then explained to the Crees the object of our mission and made our proposals for a treaty, but as they were not ready to reply, we asked them to return to their tents and meet us next day.\n\nOn the 12th the Crees and Saulteaux sent four men from the soldiers' tent or council, which they had organized, to ask that the encampment of the militia and the conference tents should be removed half way, towards their encampment.\n\nIn consequence, we requested Lieut.-Col. Smith to proceed to the Indian encampment and ascertain the meaning of this demand, authorizing him, if necessary, to arrange for the pitching of the conference tent nearer the Indians, if that would give them any satisfaction.\n\nHe reported, on his return, that the Indians wished the militia to encamp with them, and that they objected to meet us anywhere on the reserve of the Hudson Bay Company, as they said they could not speak freely there.\n\nHe refused to remove the militia camp, as it was a very desirable place where it had been placed, but with the assent of the Indians selected a spot adjoining the reserve and at a suitable distance from the Indian tents, on which the conference tent was to be daily erected, but to be removed after the conferences closed.\n\nWe then summoned the Indians to meet us at one o'clock, which they did at the appointed place.\n\nAfter the formal hand shaking, which ceremony they repeat at the beginning and close of every interview, the Commissioners submitted their terms for a treaty, which were in effect similar to those granted at the North-West Angle, except that the money present offered was eight dollars per head, instead of twelve dollars as there.\n\nThe Indians declined, however, to talk about these proposals, as they said there was something in the way. They objected to the reserve having been surveyed for the Hudson Bay Company, without their first having been\nconsulted, and claimed that the £300,000 paid to the Company should be paid to them. They also objected to the Company's trading in the Territory, except only at their posts. The Commissioners refused to comply with their demands, and explained to them how the Company had become entitled to the reserve in question, and the nature of the arrangement, that had resulted in the payment by the Government of Canada of the £300,000.\n\nThe conference adjourned to Monday the 14th, on which day the Commissioners again met them, but the Cree Chief \"Loud Voice\" asked for another day to consider the matter, and \"Coté\" or \"Meemay\" the Saulteaux Chief, from Fort Pelly, asked to be treated with, at his own place. They demanded, that the Company should only be allowed to trade at their own posts, and not to send out traders into the Territory—which was of course refused, it being explained to them that all Her Majesty's subjects had equal right of trading. The Commissioners then agreed to grant a final delay of another day, for further consideration. Up to this period the position was very unsatisfactory.\n\nThe Crees were from the first ready to treat, as were the Saulteaux from Fort Pelly, but the Saulteaux of the Qu'Appelle District were not disposed to do so and attempted to coerce the other Indians.\n\nThey kept the Chiefs \"Loud Voice\" and \"Coté\" under close surveillance, they being either confined to their tents or else watched by \"soldiers,\" and threatened if they should make any overtures to us.\n\nThe Saulteaux cut down the tent over the head of one of the Cree Chiefs and conducted themselves in such a manner, that \"Loud Voice\" applied to the Commissioners for protection, and the Crees purchased knives and armed themselves.\n\nThe Saulteaux, one day went the length of placing six \"soldiers,\" armed with rifles and revolvers, in the conference tent to intimidate the other Indians, a step which was promptly counteracted by Lieut.-Col. Smith, calling in six of the militiamen who were stationed in the tent. In this connection, I must take the opportunity of stating that the results proved the wisdom of the course taken by the Commissioners in obtaining the escort of the militia, as their presence exerted great moral influence, and I am persuaded, prevented the jealousies and ancient feud between the Crees and Saulteaux culminating in acts of violence.\n\nThe conduct of the whole force was excellent and, whether on the march or in the encampment ground, they conducted themselves in a most creditable manner.\n\nResuming, however, my narrative, on the 15th of September, the Commissioners again met the Indians at eleven o'clock in the forenoon.\n\nThe Crees had, in the interval, decided to treat with us independently, and the Saulteaux, finding this, came to a similar conclusion. After a protracted interview, the Indians asked to be granted the same terms as were given at the North-West Angle. The Commissioners took time to consider and adjourned the conference until three o'clock.\nIn the interval, the Commissioners, being persuaded that a treaty could not otherwise be made, determined on acceding to the request of the Indians.\n\nThe Indians, having again met the Commissioners in the afternoon, presented their Chiefs to them, when they asked to be informed what the terms granted at the North-West Angle were. These were fully and carefully explained to them, but after a request that all the Indians owed to the Hudson Bay Company should be wiped out and a refusal of the Commissioners to entertain their demands, they then asked that they should be paid fifteen dollars per annum per head, which was refused, and they were informed that the proposals of the Commissioners were final, and could not be changed.\n\nThe Chiefs then agreed to accept the terms offered and to sign the treaty, having first asked that the Half-breeds should be allowed to hunt, and having been assured that the population in the North-West would be treated fairly and justly, the treaty was signed by the Commissioners and the Chiefs, having been first fully explained to them by the interpreter.\n\nArrangements were then made to commence the payments and distribution of the presents the next day, a duty which was discharged by Mr. Christie and Mr. Dickieson, Private Secretary of the Hon. Mr. Laird.\n\nI forward you to form an appendix to this despatch, a report marked \"A\" and \"B\" extended from notes taken in shorthand, by Mr. Dickieson, of the various conferences and of the utterances of the Commissioners and the Indians.\n\nIt is obvious that such a record will prove valuable, as it enables any misunderstanding on the part of the Indians, as to what was said at the conference, to be corrected, and it, moreover, will enable the council better to appreciate the character of the difficulties that have to be encountered in negotiating with the Indians.\n\nOn the 17th I left for Fort Ellice, in company with Mr. Laird, Mr. Christie and Mr. Dickieson remaining to complete the payments, which were satisfactorily disposed of.\n\nBefore leaving, the Chiefs \"Loud Voice\" and Coté called on us to tender their good wishes, and to assure us that they would teach their people to respect the treaty.\n\nThe Commissioners received every assistance in their power from Mr. McDonald of Fort Ellice, in charge of the Hudson Bay Company District of Swan River, and from Mr. McLean, in charge of the Qu'Appelle Post,—I also add, that the Half-breed population were I believe generally desirous of seeing the treaty concluded and used the influence of their connection with the Indians in its favor.\n\nI forward in another despatch a copy of an address I received from the Metis, or Half-breeds, together with my reply thereto.\n\nThe treaty was taken charge of by the Hon. Mr. Laird, and will be by him placed on record in his Department and submitted to council for approval.\nI enclose herewith, however, a printed copy of it, marked \"C,\" to accompany this despatch.\n\nThe supplementary treaty made at Fort Ellice will form the subject of another despatch.\n\nTrusting that the efforts of the Commissioners to secure a satisfactory understanding with the Western Indians will result in benefit to the race, advantage to the Dominion, and meet the approval of the Privy Council,\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nALEXANDER MORRIS,\nLieut.-Gov. N. W. T.\n\nGovernment House,\nFort Garry, Manitoba, October 17th, 1874.\n\nSir,—Referring to my despatch of the 17th inst., (No. 211) I have the honor to report that Mr. Laird and I arrived at Fort Ellice from Qu'Appelle Lakes, on Saturday the 19th of September.\n\nOn Monday, we met the band of Saulteaux Indians, who make their headquarters at Fort Ellice, and who had remained there, instead of going to Qu'Appelle at our request.\n\nThis band have been in the habit of migrating between the region covered by the Second Treaty and that comprehended in the Fourth, but had not been treated with.\n\nWe proposed to them to give their adhesion to the Qu'Appelle Treaty and surrender their claim to lands, wherever situated, in the North-West Territories, on being given a reserve and being granted the terms on which the treaty in question was made. We explained fully these terms and asked the Indians to present to us their Chief and headmen. As some of the band were absent, whom the Indians desired to be recognized as headmen, only the Chief and one headman were presented. These, on behalf of the Indians accepted the terms and thanked the Queen and the Commissioners for their care of the Indian people. A supplement to the treaty was then submitted and fully explained to them, by our acting interpreter, Joseph Robillard, after which it was signed by Mr. Laird and myself, and by the Chief and head man.\n\nThe original of the supplementary treaty will be submitted for approval by Mr. Laird, but I annex a printed copy of it, as an appendix to this despatch.\n\nI also annex, notes of the conference with these Indians, extended from the short hand report taken of the proceedings by Mr. Dickieson, Private Secretary to the Hon. Mr. Laird.\n\nIn the afternoon, Mr. Christie and Mr. Dickieson arrived from Lake\nQu’Appelle, and shortly afterwards proceeded to make the payments to the Indians, under the treaty.\n\nIt was satisfactory to have this band dealt with, as they asserted claims in the region covered by the Manitoba Post Treaty, but had not been represented at the time it was made.\n\nOn the 22nd of September the Commissioners left Fort Ellice and arrived at Fort Garry on the afternoon of the 26th of that month, having been absent a little over a month.\n\nI have the honor to be, Sir,\n\nYour obedient Servant,\n\nALEXANDER MORRIS,\nLieut.-Gov. N. W. T.\n\nThe Honorable\n\nThe Secretary of State for the Provinces,\n\nOttawa.\n\nWINNIPEG, MANITOBA, 7th October, 1875.\n\nSir,—We have now the honor to submit, for your information, our final report in connection with our missions to the Indians included in Treaty No. 4.\n\nAs former reports have made you fully acquainted with the arrangements that had been entered into previous to our departure from this place, any further reference to them is unnecessary.\n\nHaving left Winnipeg on the 19th August, we arrived at Fort Ellice on the 24th, the day appointed for the meeting the Indians of that place. The same evening we had an interview with, and fully explained the terms and conditions of the treaty to some of the Indians who were not present when the treaty was concluded last year. Next morning, by appointment, we met all the Indians and explained to them the object of our mission, and, after considerable discussion, made arrangements to commence paying the annuities next day. This, however, was prevented by heavy rains, which continued more or less to retard our operations on the two following days, the 27th and 28th, but everything was satisfactorily concluded with this band on the evening of the latter day, and on the following morning we started for the Qu’Appelle Lakes, accompanied by an escort of fifteen men of the Mounted Police Force, under the command of Sub-Inspector McIlree, which had arrived at Fort Ellice on the evening of the 26th, and reached our destination on the forenoon of the 2nd September.\n\nAs you are aware, we had heard before leaving Winnipeg, that the number of Indians assembled at the Qu’Appelle Lakes would be very large, but we did not anticipate that so many as we found (nearly five hundred lodges) would be congregated.\n\nWe at once saw that the funds at our disposal to pay the annuities and\ngratuities would be inadequate, and availed ourselves of the opportunity presented by the return of Major Irvine to Winnipeg, to forward a telegram on the 5th September, requesting a further amount of six thousand dollars to be placed to our credit; and we may state here, though out of the order of time, as we found after the first two days payments that we had still underestimated the number of Indians present, we transmitted a telegram to Winnipeg by special messenger, on the 9th September, for a further credit of fifteen thousand dollars.\n\nOn the 3rd September we met the Indians and explained the object of our mission, and, for the benefit of those who were absent last year, the terms and conditions of the treaty, and stated that we were now ready to fulfil so many of the obligations therein contained as the Government were bound to execute this year. The Indians declined saying anything on this occasion, but wished to meet and confer with us the following day, as they had something they wished to speak about. They accordingly met us on the 4th, and made several demands, one of which was that the annuities be increased to twelve dollars per head. We replied that the treaty concluded last year was a covenant between them and the Government, and it was impossible to comply with their demands; that all we had to do was to carry out the terms of the treaty in so far as the obligations of the same required. An idea seemed prevalent among the Indians who were absent last year that no treaty had been concluded then; that all which had been done at that time was merely preliminary to the making of the treaty in reality, which they thought was to be performed this year. The prevalence of this opinion amongst them operated very prejudicially to the furthering of our business, and we saw that until this was done away with it would be impossible to do anything towards accomplishing the real object of our mission. After a great deal of talking on their part, and explanation on ours, the meeting adjourned until Monday morning, as it was necessary that provisions should be issued to the different bands that evening for the following day.\n\nOn Monday (the 6th) we again met the Indians, and as they evidently wished to have another day's talking to urge the same demands they had made on Saturday, we assured them all further discussion on the subject was useless; that if they declined to accept the terms of the treaty we must return and report to the Government that they had broken the promise made last year. They then asked that we should report to the Government what they had demanded. This we agreed to do. After some further explanation to those Chiefs who had not signed the treaty, the payment of the annuities and gratuities was commenced and continued by Messrs. Dickieson and Forsyth on this and the three following days until completed, during which time Mr. Christie conferred with the Chiefs as to the locality of their reserves.\n\nSix Chiefs who had not been present last year when the treaty was concluded, agreed to accept the terms of the same, and signed their adhesion\nprevious to being paid. The instruments thus signed by them are transmitted herewith.\n\nThe suits of clothes, flags, medals and copies of the treaty were given to the Chiefs and head-men as they were paid, and on the 10th the ammunition and twine were distributed, also provisions to each band for the return journey to their hunting grounds.\n\n* * * * *\n\nWe have the honor to be, Sir,\n\nYour obedient servants,\n\nW. J. CHRISTIE,\nIndian Commissioner.\n\nM. G. DICKIESON.\n\nReport of the proceedings at the Conference between the Hon. Alexander Morris, Lieut.-Governor of the North-West Territories, the Hon. David Laird, Minister of the Interior, and W. J. Christie, Esq., the Commissioners appointed by Order in Council to treat with the Indians inhabiting the country described in the said Order in Council, the first conference having been held at Qu’Appelle, September 8th, 1874:\n\nFIRST DAY’S CONFERENCE.\n\nAt four o’clock the Commissioners entered the marquee erected for the accommodation of themselves, and the Indians, who in a short time arrived, shook hands with the Commissioners, the officers of the guard, and other gentlemen who were in the tent, and took their seats.\n\nIt having been noticed that Cote, “the Pigeon,” a leading Chief of the Saulteaux tribe, had not arrived but that several of his band were present and claimed that they had been sent to represent him, His Honor the Lieut.-Governor instructed the (acting) interpreter, William Daniel, to enquire why their Chief had not come to meet the Commissioners, the white chiefs?\n\nTo this question they answered, that he had given no reason. His Honor, through the interpreter, told them that the\nQueen had sent him and the other Commissioners to see their Chief and their nation, and that the least a loyal subject could do would be to meet the messengers of the Queen.\n\nHis Honor then addressed the Crees as follows: \"The Commissioners having agreed that as Lieut.-Governor he should speak to them, as we are sent here by the Queen, by the Great Mother—the Queen has chosen me to be one of her Councillors, and has sent me here to represent her and has made me Governor of all her Territories in the North-West. She has sent another of her Councillors who has come all the way from Ottawa. She has also sent with us Mr. Christie, whom you all know, who has lived for a long time in this country, but who had gone away from it to live in another part of the Dominion of Canada. The Queen loves her Red children; she has always been friends with them; she knows that it is hard for them to live, and she has always tried to help them in the other parts of the Dominion. Last year she sent me to see her children at the Lake of the Woods. I took her children there by the hand, and the white man and the red man made friends for ever. We have come here with a message from the Queen and want to tell you all her mind. We want to speak to you about the land and what the Queen is willing to do for you, but before we tell you, we want you to tell us, who your Chiefs and headmen are who will speak for you, while we speak for the Queen, and we want to know what bands of Crees are here and who will speak for them. We wish to know if the Crees are ready to speak with us now?\"\n\nRa-ku-shi-way, THE LOUD VOICE,—Said in reply: \"I do not wish to tell a lie. I cannot say who will speak for us; it will only be known after consultation.\"\n\nHis Honor the Lieut.-Gov.—\"By to-morrow you will probably have chosen whom you will have to speak for you and the Commissioners will be glad to meet you after you have chosen your spokesmen, and will meet you at ten o'clock. We want you to tell us openly what you want and we will speak to\nyou for the Queen in the same way. The Colonel will send a man round to sound a bugle at ten o'clock to let you know.\"\n\nTo the Saulteaux His Honor said: \"We are here with a message from the Great Mother and want you to open my mouth so that I can tell you what I have to say. If you and your Chiefs will meet together in council and talk it over we will be glad to meet you, if you bring your Chief to-morrow. You must also choose your speakers who will come with your Chief and speak for you.\"\n\nLoud Voice—\"I will tell the message that is given me to tell. I have one thing to say, the first word that came to them was for the Saulteaux tribe to choose a place to pitch their tents.\"\n\nHis Honor—\"This place was chosen because it is a good place for my men—for the soldiers—there is plenty of water and grass, and I will meet you here to-morrow. That is all at present.\"\n\nAfter the departure of the main body of Cree Indians, Saulteaux, from the Cypress Hills, entered the tent saying that they had no Chief, and did not want to go with the main body of the nation, that they had plenty of friends on the plains.\n\nHis Honor said they would hear the Queen's message with the rest of the Indians.\n\nSECOND DAY'S CONFERENCE.\n\nSeptember 9, 1874.\n\nThe Indians, both Crees, Saulteaux and their Chiefs having arrived, His Honor Lieut.-Governor Morris said: \"I am glad to see so many of the Queen's red children here this morning, I told those I saw yesterday that I was one of the Queen's councillors, and had another councillor with me from Ottawa and that the Queen had sent Mr. Christie who used to live amongst you to help us. Yesterday the Cree nation with their Chief were here, the Saulteaux did not come to meet the\nQueen's servants, their Chief was not here. I thought that the Saulteaux could not have understood that the Queen had sent her servants to see them, or they would have come to meet them. If Loud Voice or any other Chief came down to Fort Garry to see me, and I sent one of my servants to meet them instead of shaking hands with them, would they be pleased? I wanted you to meet me here to-day because I wanted to speak to you before the Great Spirit and before the world. I want both Crees and Saulteaux to know what I say. I told those who were here yesterday that we had a message from the Queen to them. Last year I made a treaty with the Indians, 4,000 in number, at the Lake of the Woods. To-day the Queen sends us here. I told you yesterday that she loves her red children, and they have always respected her and obeyed her laws. I asked you yesterday, and ask you now, to tell me who would speak for you, and how many bands of each nation are represented here. I have heard that you are not ready to speak to me yet but do not know it, and I want you to say anything you have to say before all, and I will speak in the same way. What I have to talk about concerns you, your children and their children, who are yet unborn, and you must think well over it, as the Queen has thought well over it. What I want, is for you to take the Queen's hand, through mine, and shake hands with her for ever, and now I want, before I say any more, to hear from the Chiefs if they are ready with their men to speak for them, and if they are not ready if they will be ready to-morrow.\"\n\nCan-a-haii-cha-pew, the Man of the Bow,—“We are not ready yet, we have not gathered together yet. That is all I have to say.”\n\nPeicheto's Son—O-ta-ha-o-man, the Gambler—“My dear friends, do you want me to speak for you to these great men?” (the Indians signified their consent.) “I heard you were to come here, that was the reason that all the camps were collected together, I heard before-hand too where the camp was to be\nplaced, but I tell you that I am not ready yet. Every day there are other Indians coming and we are not all together. Where I was told to pitch my tent that is where I expected to see the great men in the camp. That is all.\"\n\nHis Honor—\"With regard to the camp, the Queen sent one of her chief men of our soldiers with us, and he selected the best place for the men, the place where we are now, and I think it is a good place. At first he thought to have encamped across the river, but he thought this was better ground and chose it. I think it just as well that our tents should be at a little distance from your braves and your camp. I want to say to the Indian children of the Queen that if their people are coming in, that our men have walked a long way here, and must go back again to Fort Garry, and I have other things to do. Mr. Laird has to go back again to look after other things for the Queen at Ottawa. I want to ask the Chiefs when they will be ready to meet us to-morrow.\"\n\nPei-che-to's Son—\"I have said before, we are not ready.\"\n\nHis Honor—\"Let them send me word through their Chiefs when they are ready.\"\n\nTHIRD DAY'S CONFERENCE.\n\nSeptember 11, 1874.\n\nThe Crees and their Chiefs met the Commissioners. The Saulteaux Chief was not present, though most of the tribe were present.\n\nAn Indian, \"the Crow,\" advised the assembled Crees, the Saulteaux not having arrived, to listen attentively to what words he said.\n\nHis Honor the Lieut.-Governor then arose and said: \"I am glad to meet you here to-day. We have waited long and began to wonder whether the Queen's red children were not coming to meet her messengers. All the ground here is the Queen's and you are free to speak your mind fully. We want you to\nspeak to me face to face. I am ready now with my friends here to give you the Queen's message. Are your ears open to hear? Have you chosen your speakers?\"\n\nThe Loud Voice—\"There is no one to answer.\"\n\nHis Honor—\"You have had time enough to select your men to answer and I will give you the Queen's message. The Queen knows that you are poor; the Queen knows that it is hard to find food for yourselves and children; she knows that the winters are cold, and your children are often hungry; she has always cared for her red children as much as for her white. Out of her generous heart and liberal hand she wants to do something for you, so that when the buffalo get scarcer, and they are scarce enough now, you may be able to do something for yourselves.\"\n\nThe Loud Voice (to the Indians)—\"I wonder very much at your conduct. You understand what is said and you understand what is right and good. You ought to listen to that and answer it, every one of you. What is bad you cannot answer.\"\n\nHis Honor—\"What the Queen and her Councillors would like is this, she would like you to learn something of the cunning of the white man. When fish are scarce and the buffalo are not plentiful she would like to help you to put something in the land; she would like that you should have some money every year to buy things that you need. If any of you would settle down on the land, she would give you cattle to help you; she would like you to have some seed to plant. She would like to give you every year, for twenty years, some powder, shot, and twine to make nets of. I see you here before me to-day. I will pass away and you will pass away. I will go where my fathers have gone and you also, but after me and after you will come our children. The Queen cares for you and for your children, and she cares for the children that are yet to be born. She would like to take you by the hand and do as I did for her at the Lake of the Woods last year. We promised them and we are ready to promise now to give five dollars to every man,\nwoman and child, as long as the sun shines and water flows. We are ready to promise to give $1,000 every year, for twenty years, to buy powder and shot and twine, by the end of which time I hope you will have your little farms. If you will settle down we would lay off land for you, a square mile for every family of five. Whenever you go to a Reserve, the Queen will be ready to give you a school and schoolmaster, and the Government will try to prevent fire-water from being sent among you. If you shake hands with us and make a treaty, we are ready to make a present at the end of the treaty, of eight dollars for every man, woman and child in your nations. We are ready also to give calico, clothing and other presents. We are ready to give every recognized Chief, a present of twenty-five dollars, a medal, and a suit of clothing. We are also ready to give the Chief's soldiers, not exceeding four in each band, a present of ten dollars, and next year and every year after, each chief will be paid twenty-five dollars, and his chief soldiers not exceeding four in each band, will receive ten dollars. Now I think that you see that that the Queen loves her red children, that she wants to do you good, and you ought to show that you think so. I cannot believe that you will be the first Indians, the Queen's subjects, who will not take her by the hand. The Queen sent one of her councillors from Ottawa, and me, her Governor, to tell you her mind. I have opened my hands and heart to you. It is for you to think of the future of those who are with you now, of those who are coming after you, and may the Great Spirit guide you to do what is right. I have only one word more to say. The last time I saw you I was not allowed to say all I wanted to say until you went away. What I wanted to say is this, I have put before you our message, I want you to go back to your tents and think over what I have said and come and meet me to-morrow. Recollect that we cannot stay very long here. I have said all.\"\nFOURTH DAY'S CONFERENCE.\n\nSeptember 12, 1874.\n\nIn the morning four Indians, two Crees and two Saulteaux, waited on the Commissioners and asked that they should meet the Indians half way, and off the Company's reserve, and that the soldiers should remove their camps beside the Indian encampment, that they would meet the Commissioners then and confer with them; that there was something in the way of their speaking openly where the marquee had been pitched. Their request was complied with as regarded the place of meeting only, and the spot for the conference selected by Col. Smith and the Indians.\n\nThe meeting was opened by the Lieut.-Governor, who said, \"Crees and Saulteaux,—I have asked you to meet us here today. We have been asking you for many days to meet us and this is the first time you have all met us. If it was not my duty and if the Queen did not wish it, I would not have taken so much trouble to speak to you. We are sent a long way to give you her message. Yesterday I told the Crees her message, and I know that the Saulteaux know what it was, but that there may be no mistake, I will tell it to you again and I will tell you more. When I have given my message understand that you will have to answer it, as I and my friends will have to leave you. You are the subjects of the Queen, you are her children, and you are only a little band to all her other children. She has children all over the world, and she does right with them all. She cares as much for you as she cares for her white children, and the proof of it is that wherever her name is spoken her people whether they be red or white, love her name and are ready to die for it, because she is always just and true. What she promises never changes. She knows the condition of her people here; you are not her only red children; where I come from, in Ontario and in Quebec, she has many red children, and away beyond the mountains she has other red children, and she\nwants to care for them all. Last year I was among the Saulteaux; we have the Saulteaux where I came from. They were my friends. I was the son of a white Chief who had a high place among them, they told him they would do his work, they called him Shekcisheik. I learned from him to love the red man, and it was a pleasant duty and good to my heart when the Queen told me to come among her Saulteaux children and I expect the Crees and the Saulteaux to take my hand as they did last year. In our hands they feel the Queen's, and if they take them the hands of the white and red man will never unclasp. In other lands the white and red man are not such friends as we have always been, and why? Because the Queen always keeps her word, always protects her red men. She learned last winter that bad men from the United States had come into her country and had killed some of her red children, What did she say? This must not be, I will send my men and will not suffer these bad men to hurt my red children, their lives are very dear to me. And now I will tell you our message. The Queen knows that her red children often find it hard to live. She knows that her red children, their wives and children, are often hungry, and that the buffalo will not last for ever and she desires to do something for them. More than a hundred years ago, the Queen's father said to the red men living in Quebec and Ontario, I will give you land and cattle and set apart Reserves for you, and will teach you. What has been the result? There the red men are happy; instead of getting fewer in number by sickness they are growing in number; their children have plenty. The Queen wishes you to enjoy the same blessings, and so I am here to tell you all the Queen's mind, but recollect this, the Queen's High Councillor here from Ottawa, and I, her Governor, are not traders; we do not come here in the spirit of traders; we come here to tell you openly, without hiding anything, just what the Queen will do for you, just what she thinks is good for you, and I want you to look me in the face, eye to eye, and open your hearts to me\nas children would to a father, as children ought to do to a father, and as you ought to the servants of the great mother of us all. I told my friends yesterday that things changed here, that we are here today and that in a few years it may be we will not be here, but after us will come our children. The Queen thinks of the children yet unborn. I know that there are some red men as well as white men who think only of today and never think of tomorrow. The Queen has to think of what will come long after today. Therefore, the promises we have to make to you are not for today only but for tomorrow, not only for you but for your children born and unborn, and the promises we make will be carried out as long as the sun shines above and the water flows in the ocean. When you are ready to plant seed the Queen's men will lay off Reserves so as to give a square mile to every family of five persons, and on commencing to farm the Queen will give to every family cultivating the soil two hoes, one spade, one scythe for cutting the grain, one axe and plough, enough of seed wheat, barley, oats and potatoes to plant the land they get ready. The Queen wishes her red children to learn the cunning of the white man and when they are ready for it she will send schoolmasters on every Reserve and pay them. We have come through the country for many days and we have seen hills and but little wood and in many places little water, and it may be a long time before there are many white men settled upon this land, and you will have the right of hunting and fishing just as you have now until the land is actually taken up. (His Honor repeated the offers which had been given to the Saulteaux on the previous day.) I think I have told you all that the Queen is willing to do for you. It ought to show you that she has thought more about you than you have about her. I will be glad now to have those whom you have selected speak for you and I again ask you to keep nothing back. This is the first time you have had white chiefs, officers of the Queen, so high in her Councils, so trusted by her among you. We have no\nobject but your good at heart, and therefore we ask you to speak out to us, to open your minds to us, and believe that we are your true and best friends, who will never advise you badly, who will never whisper bad words in your ears, who only care for your good and that of your children. I have told you the truth, the whole truth, and now we expect to hear from the two nations and any other tribe who may be represented here. My friend Mr. Laird reminds me that he has come from an Island in the far off sea, that he has go back to Ottawa and then go to his own home, that he was asked specially to help me in speaking to you and advising me. He is obliged to go away as I am, and therefore we want you to answer us.\"\n\nCote, or Mee-may (Saulteaux Chief)—\"I cannot say anything to you. It is that man (pointing to Loud Voice) will speak.\"\n\nLoud Voice (Cree Chief)—\"If I could speak, if I could manage to utter my feelings there is reason why I should answer you back; but there is something in my way, and that is all I can tell you. This man (the Gambler) will tell you.\n\nO-ta-ka-o-nan, or the Gambler.—\"This morning I saw the chief of the soldiers, who asked me what is in your way that you cannot come and meet the Queen's messengers; then I told him what was in the way. And now that I am come in, what do I see? You were rather slow in giving your hand. You said that the Queen spoke through you and spoke very plainly, but I cannot speak about what you said at present; the thing that is in the way that is what I am working at.\"\n\nLieut.-Gov. Morris—\"We have come here for the purpose of knowing what is in your mind. I held out my hand but you did not do as your nation did at the Angle. When I arrived there the Chief and his men came and gave me the pipe of peace and paid me every honor. Why? Because I was the servant of the Queen. I was not slow in offering my hand, I gave it freely and from my heart, and whenever we found I could please you by coming here, we sent the chief of\nthe soldiers to select a suitable place to meet you. You tell me there is something in your mind. If there is anything standing between us, how can we take it away or answer you unless we know what it is?\"\n\nThe Gambler—\"I told the soldier master you did not set your camp in order, you came and staid beyond over there, that is the reason I did not run in over there. Now when you have come here, you see sitting out there a mixture of Half-breeds, Crees, Saulteaux and Stonies, all are one, and you were slow in taking the hand of a Half-breed. All these things are many things that are in my way. I cannot speak about them.\"\n\nLieut.-Gov. Morris—Why are you here to-day? because we asked you to come, because it was a good place to speak with them the reason we wished to see them. I am now quite willing to tell you all about Fort Pelly. The Queen heard that Americans had come into the country and were treating her Indian children badly. I myself sent her word that twenty-five of her Indian children, men, women and children, had been shot down by the American traders, then she resolved to protect her red children, for that reason she has determined to have a body of men on horses as policemen to keep all bad people, white or red, in order. She will not allow her red children to be made drunk and shot down again as some of them were a few months ago. Now you ought to be glad that you have a Queen who takes such an interest in you. What are they doing now up at Fort Pelly? The men must have some place to live in this winter, they cannot live out of doors, and some men have gone to Fort Pelly to build houses for them, and the Queen expects that you will do all you can to help them because they are your friends. There was a treaty before and Indians are paid under it, but we were told as we passed Fort Ellice that there were a few Indians there who were not included in that treaty, and had never been paid, and they agreed to meet us when we go back. I do not quite understand another point. We have here Crees, Saulteaux,\nAssiniboines and other Indians, they are all one, and we have another people, the Half-breeds, they are of your blood and my blood. The Queen cares for them, one of them is here an officer with a Queen's coat on his back. At the Lake of the Woods last winter every Half-Breed who was there with me was helping me, and I was proud of it, and glad to take the word back to the Queen, and her servants, and you may rest easy, you may leave the Half-breeds in the hands of the Queen who will deal generously and justly with them. There was a Half-breed came forward to the table. He was only one of many here. I simply wanted to know whether he was authorized by you to take any part in the Council, as it is the Indians alone we are here to meet. He told me you wanted him here as a witness. We have plenty of witnesses here, but when I heard that, I welcomed him as I had done you, and shook hands with him, and he ought to have told you that. I have given our answer and I have always found this that it is good for men to try to understand each other, and to speak openly, if they do that and both are earnest, if their hearts are pure, they will and can understand each other.\"\n\nThe Gambler—\"I have understood plainly before what he (the Hudson Bay Company) told me about the Queen. This country that he (H. B. Co.) bought from the Indians let him complete that. It is that which is in the way. I cannot manage to speak upon anything else, when the land was staked off it was all the Company's work. That is the reason I cannot speak of other things.\"\n\nLieut.-Gov. Morris—\"We don't understand what you mean. Will you explain?\n\nThe Gambler—\"I know what I have to tell you. Who surveyed this land? Was it done by the Company? This is the reason I speak of the Company, why are you staying in the Company's house?\"\n\nLieut.-Governor Morris—\"The Company have a right to have certain lands granted them by the Queen, who will do\nwhat is fair and just for the Company, for the Indians, for the Half-breeds, and for the whites. She will make no distinction. Whatever she promises she will carry out. The Company are nothing to her except that they are carrying on trade in this country, and that they are subjects to her just as you are. You ask then why I went to the Company's house? I came here not at my own pleasure. I am not so strong as you are. I never slept in a tent in my life before and was only too glad to find a home to go to.\"\n\nThe Gambler—\"I understand now. And now this Company man. This is the Company man (pointing to Mr. McDonald). This is the thing I cannot speak of. The Cree does not know, the Saulteaux does not know. It was never known when this was surveyed, neither by the Cree nor the Saulteaux.\"\n\nLieut.-Gov. Morris—\"The Company are trading in this country and they require to have places to carry out their trade. If the Queen gives them land to hold under her she has a perfect right to do it, just as she will have a perfect right to lay off lands for you if you agree to settle on them. I am sorry for you; I am afraid you have been listening to bad voices who have not the interests of the Indians at heart. If because of these things you will not speak to us we will go away with hearts sorry for you and for your children, who thus throw back in our faces the hand of the Queen that she has held out to you.\"\n\nThe Gambler—\"It is very plain who speaks; the Crees are not speaking, and the Saulteaux is speaking, if the Queen's men came here to survey the land. I am telling you plainly. I cannot speak any other thing till this is cleared up. Look at these children that are sitting around here and also at the tents, who are just the image of my kindness. There are different kinds of grass growing here that is just like those sitting around here. There is no difference. Even from the American land they are here, but we love them all the same, and when the white skin comes here from far away I love him all the\nsame. I am telling you what our love and kindness is. This is what I did when the white man came, but when he came back he paid no regard to me how he carried on.\"\n\nLieut.-Gov. Morris—\"I did not know till I came here that any survey had been made because I had nothing to do with it; but my friend, one of the Queen's Councillors, tells me it was done by the authority of the Queen.\"\n\nThe Gambler—\"I want to tell you the right story. I waited very much for the Queen's messenger when I saw what the Company did. Perhaps he may know why he did so. Perhaps if I were to ask him now he would say. That is what I would think. This is the reason. I am so pleased at what I see here I cannot manage to speak because of the Company.\n\nLieut.-Gov. Morris—\"We cannot see why you cannot speak to the Queen's messengers because of the Company. The Company is no greater in her sight than one of those little children is in yours, and whatever she promises, either to the Company or the little child, she will do. The Company ought not to be a wall between you and us; you will make a mistake if you send us away with a wall between us, when there should be none.\"\n\nThe Gambler—\"I do not send you away; for all this I am glad. I know this is not the Queen's work. He (H. B. Co.) is the head; he does whatever he thinks all around here, that is the reason I cannot say anything.\"\n\nLieut.-Gov. Morris—\"I am very sorry that you cannot answer.\"\n\nThe Gambler—\"The Company have stolen our land. I heard that at first. I hear it is true. The Queen's messengers never came here, and now I see the soldiers and the settlers and the policemen. I know it is not the Queen's work, only the Company has come and they are the head, they are foremost; I do not hold it back. Let this be put to rights; when this is righted I will answer the other.\"\n\nLieut.-Gov. Morris—\"The Company have not brought their soldiers here. This man is not an officer of the Company. I\nam not an officer of the Company. We did not come at the request of the Company, but at that of the Queen. I told you that the Queen had sent her policemen here. You see the flag there, then know that we are the Queen's servants, and not the Company's, and it is for you to decide on the message I have delivered to you.\"\n\nThe Gambler—\"When one Indian takes anything from another we call it stealing, and when we see the present we say pay us. It is the Company I mean.\"\n\nLieut.-Gov. Morris—\"What did the Company steal from you?\"\n\nThe Gambler—\"The earth, trees, grass, stones, all that which I see with my eyes.\"\n\nLieut.-Gov. Morris—\"Who made the earth, the grass, the stone, and the wood? The Great Spirit. He made them for all his children to use, and it is not stealing to use the gift of the Great Spirit. The lands are the Queen's under the Great Spirit. The Chippewas were not always here. They come from the East. There were other Indians here and the Chippewas came here, and they used the wood and the land, the gifts of the Great Spirit to all, and we want to try and induce you to believe that we are asking for the good of all. We do not know how the division between us is to be taken away. We do not know of any lands that were stolen from you, and if you do not open your mouths we cannot get the wall taken away. You can open your mouths if you will; we are patient but we cannot remain here always.\n\nThe Gambler—\"I cannot manage to speak of anything else. It is this I am speaking. All the Indians know how the Company set their land in order long ago. The Company is making it more and that is the reason I am speaking.\"\n\nLieut.-Governor Morris—\"Many, many years ago, before we were born, one of the Kings gave the Company certain rights to trade in this country. The Queen thought that this was not just neither to the white nor the red man. She con-\nsidered that all should be equal; but when the Queen's father's father's hand had been given she could not take it back without the Company's consent; therefore she told the Company that the time had come when they should no longer be the great power in this country, that she would plant her own flag, that she would send her own Governor and soldiers, and that they must cease to have the only right to trade here (and I am glad to know that some of you are good traders), the Queen then told the Company that she would govern the country herself, and she told them she would give them some land. They had their forts, their places of trade where they raised cattle and grain, and she told them they could keep them, and she will no more break with them than she will with you. There is no reason why you should not talk to us. The Company have no more power, no more authority to govern this country than you have, it rests with the Queen.\"\n\nThe Gambler—\"This is the reason I waited for the Queen's messengers to come here because I knew the Company was strong and powerful, and I knew they would set everything in order. Truly since the Company came here they have brought me many things which are good, but the Company's work is in my way and I cannot utter my words.\"\n\nLieut.-Gov. Morris—\"What do you complain of? I can not tell.\"\n\nThe Gambler—\"The survey. This one (pointing to an Indian) did not say so, and this Saulteaux and he was never told about it. He should have been told beforehand that this was to have been done and it would not have been so, and I want to know why the Company have done so. This is the reason I am talking so much about it.\"\n\nLieut.-Gov. Morris—\"I have told you before that the Queen had promised to give the Company certain lands around the forts and she gave them land around this fort. I have told you that what she promised she will do. She has taken all the lands in this country to manage; they were hers; they\nwere her fathers; if she gives you reserves they will be yours and she will let no one take them from you unless you want to sell them yourselves. It will be a sorry thing if this nation and that nation scattered all over the country are to suffer because of this little piece of land I see around me. What good is it going to do to raise up a question of this kind and block the way to our understanding each other when the Queen's hand, full of love and generosity is held out to you? The blame rests with you; it is time for you to talk, to open your mouth, because I cannot take away what shuts it, you must do it yourselves.\"\n\nThe Gambler—\"This is my chief, the Queen never told this man. If this had been told him, I would not have said what I said just now. The Company's store was only there at first. I do not push back the Queen's hand. Let this be cleared up.\"\n\nLieut.-Gov. Morris—\"Once for all we tell you, whatever number of acres the Queen has promised to the Company at this post, they will receive no more and no less. We will ascertain what was promised, and will take care to see that what was promised and that only will be performed with regard to the land around this Fort. We can give you no other answer.\"\n\nThe Gambler—\"I am telling you and reporting what I had to tell. The Company have no right to this earth, but when they are spoken to they do not desist, but do it in spite of you. He is the head and foremost. These Indians you see sitting around report that they only allowed the store to be put up. That is the reason I was very glad when I heard you were coming. The Indians were not told of the reserves at all I hear now, it was the Queen gave the land. The Indians thought it was they who gave it to the Company, who are now all over the country. The Indians did not know when the land was given.\"\n\nLieut.-Gov. Morris—\"I am weary hearing about the\ncountry. You might understand me now. You are stronger than that little boy over there, and the Company is stronger than a single trader, but the Company has its master, the Queen, and will have to obey the laws as well as all others. We have nothing to do with the Company. We are here to talk with you about the land, I tell you what we wish to do for your good, but if you will talk about the Company I cannot hinder you, I think it is time now you should talk about what concerns you all.\"\n\nThe Gambler—\"That is the reason I waited so long. I cannot speak of anything else, my mind is resting on nothing else. I know that you will have power and good rules and this is why I am glad to tell you what is troubling me.\"\n\nLieut.-Gov. Morris—\"I have told you before and tell you again that the Queen cannot and will not undo what she has done. I have told you that we will see that the Company shall obey what she has ordered, and get no more and no less than she has promised. We might talk here all the year and I could not give you any other answer, and I put it to you now face to face—speak to me about your message, don't put it aside, if you do the responsibility will rest upon your nation, and during the winter that is coming, many a poor woman and child will be saying, how was it that our councillors and our braves shut their ears to the mouth of the Queen's messengers and refused to tell them their words. This Company, I have told you is nothing to us, it is nothing to the Queen, but their rights have to be respected just as much as those of the meanest child in the country. The Queen will do right between you and them. I can say no more than what I have said and if the Indians will not speak to us we cannot help it, and if the Indians wont answer our message, we must go back and tell the Queen that we came here and did everything we could to show the Indians we were in earnest in proving her love for them and that when there was a little difficulty, I came at once to meet them half way. What prevents you from coming\nout and speaking openly. I cannot take away the difficulty you speak of, and if you will not answer us, there is no use in talking.\"\n\nThe Gambler—\"I told the chief of the soldiers what was in our way, what was troubling us and now we are telling you. It is that I am working at.\"\n\nLieut.-Gov. Morris—\"What is troubling you?\"\n\nPis-qua (the plain) pointing to Mr. McDonald, of the Hudson's Bay Company—\"You told me you had sold your land for so much money, £300,000. We want that money.\"\n\nLieut.-Gov. Morris—\"I wish our Indian brother had spoken before what was in his mind. He has been going here and there, and we never knew what he meant. I told you that many years ago the Queen's father's father gave the Company the right to trade in the country from the frozen ocean to the United States boundary line, and from the Atlantic Ocean to the Pacific. The Company grew strong and wanted no one to trade in the country but themselves. The Queen's people said, \"no, the land is not yours, the Queen's father's father gave you rights to trade, it is time those rights should stop.\" You may go on and trade like any other merchant, but as it was worth money to you to say to this trader you shall not buy furs at any post, the Queen would not act unjustly to the Company. She would not take rights away from them any more than from you; and to settle the question, she took all the lands into her own hands and gave the Company a sum of money in place of the rights which she had taken from them. She is ready to deal with you justly. We are here to-day to make to you her good offers. We have nothing to hide, nothing to conceal. The Queen acts in daylight. I think it is time you are going to talk with us about the offers we have made.\"\n\nThe Gambler—\"I have made up about no other article. I suppose, indeed, I would make the thing very little and very small. When I get back I will think over it.\"\nLieut.-Gov. Morris—\"I have a word to say to you. In our land we worship the Great Spirit, and do not work on Sunday. I am glad to see that you are going back into council, and I will only ask you to think of these things with single hearts desiring only to do what is right and trusting my words. On Monday morning we will be glad to meet you here and hope we will find then that your heart has come to ours, that you will see that it is for your children's good, to take our hands and the promises we have given. As I told you before we would be glad to stay longer with you, but we are obliged to go away. We ask you then to meet us on Monday morning and Mr. Pratt will tell you so that there may be no mistake as to what we have promised. He has it written down so that it may not be rubbed out.\"\n\nThe conference then ended.\n\nFIFTH DAY'S CONFERENCE.\n\nSeptember 14.\n\nBoth nations, Crees and Saulteaux, having assembled, His Honor Lieut.-Governor Morris again addressed them:\n\n\"Children of our Great Mother, I am glad to see you again after another day. How have you come to meet us? I hope you have come to us with good thoughts, and hearts ready to meet ours. I have one or two words to say to you. It is twenty days to-day since we left the Red River. We want to turn our faces homewards. You told me on Saturday that some of you could eat a great deal. I have something to say to you about that. There are Indians who live here, they have their wives and children around them. It is good for them to be here, and have plenty to eat, but they ought to think of their brothers; they ought to think that there are men here who have come from a distance, from Fort Pelly, and beyond, whose wives and children are not here to eat, and they want to be at home with them. It is time now that we began to understand\neach other, and when there is something troubles us, I believe in telling it. When you told us you were troubled about the situation of this tent, we had it moved. Now we want you to take away our trouble, or tell us what you mean. We are troubled about this. We are servants of the Queen; we have been here many days giving you our message, and we have not yet heard the voice of the nations. We have two nations here. We have the Crees, who were here first, and we have the Ojibbeways, who came from our country not many suns ago. We find them here; we won't say they stole the land and the stones and the trees; no, but we will say this, that we believe their brothers, the Crees, said to them when they came in here: \"The land is wide, it is wide, it is big enough for us both; let us live here like brothers;\" and that is what you say, as you told us on Saturday, as to the Half-breeds that I see around. You say that you are one with them; now we want all to be one. We know no difference between Crees and Ojibbeways. Now we want to ask you are you wiser, do you know more, than the Ojibbeway people that I met last year? You are a handful compared with them; they came to me from the Lake of the Woods, from Rainy Lake, from the Kaministiquia, and from the Great Lake. I told them my message, as I have told you; they heard my words and they said they were good, and they took my hand and I gave them mine and the presents; but that is not all. There was a band of Ojibbeways who lived at Lake Seul, to the north of the Lake of the Woods, 400 in number, and just before we came away we sent our messenger to them. He told them I had shaken hands for the Queen with all the Ojibbeways down to the Great Lake. He told them what we had done for these, and asked them if they found it good to take the Queen's hand through our messenger; they were pleased; they signed the treaty; they put their names to it, saying, We take what you promised to the other Saulteaux; and our messenger gave them the money, just as our messengers will give your brothers who are not\nhere the money if we understand each other. Now, we ask you again, are you wiser than your brothers that I have seen before? I do not think that you will say you are, but we want you to take away our last trouble. What I find strange is this: we are Chiefs; we have delivered the message of our great Queen, whose words never change, whose tongue and the tongues of whose messengers are never forked; and how is it that we have not heard any voice back from the Crees or Saulteaux, or from their Chiefs? I see before me two Chiefs; we know them to be Chiefs, because we see you put them before you to shake hands with us. They must have been made Chiefs, not for anything we are talking about to-day, not for any presents we are offering to you, not because of the land; then why are they chiefs? Because I see they are old men; the winds of many winters have whistled through their branches. I think they must have learned wisdom; the words of the old are wise; why then, we ask ourselves—and this is our trouble—Why are your Chiefs dumb? They can speak. One of them is called \"Loud Voice.\" He must have been heard in the councils of the nation. Then I ask myself, why do they not answer? It cannot be that you are afraid; you are not women. In this country, now, no man need be afraid. If a white man does wrong to an Indian, the Queen will punish them. The other day at Fort Ellice, a white man, it is said, stole some furs from an Indian. The Queen's policemen took him at once; sent him down to Red River, and he is lying in jail now; and if the Indians prove that he did wrong, he will be punished. You see then that if the white man does wrong to the Indian he will punished; and it will be the same if the Indian does wrong to the white man. The red and white man must live together, and be good friends, and the Indians must live together like brothers with each other and the white man. I am afraid you are weary of my talking. Why do I talk so much? Because I have only your good at heart. I do not want to go away with my head down, to send\nword to the Queen, \"Your red children could not see that your heart was good towards them; could not see as you see that it was for the good of themselves and their children's children to accept the good things you mean for them.\" I have done. Let us hear the voice of the people. Let us hear the voice of your old wise men.\"\n\nCote—\"The same man that has spoken will speak yet.\"\n\nKa-kie-she-way (Loud Voice)—This is the one who will speak; after he speaks I will show what I have to say.\"\n\nLieut.-Gov. Morris—\"Understand me, what I want to know is, does he speak for the nations. If you prefer to speak by the voice of an orator I am glad. All we want is to hear the voice of the people, and I asked you at first to choose among yourselves those who would speak for you; therefore I am glad to hear the man you have chosen, and I am glad to hear that after he has done the Chief will speak to us.\"\n\nThe Gambler—\"Saturday we met, we spoke to each other, we met at such a time as this time, and again we said we would tell each other something; now, then, we will report to each other a little again. This Company man that we were speaking about, I do not hate him; as I loved him before I love him still, and I also want that the way he loved me at first he should love me the same; still, I wish that the Company would keep at his work the same as he did; that I want to be signed on the paper. I want you to put it with your own hands. After he puts that there it is given to the Indians, then there will be another article to speak about. The Indians want the Company to keep at their post and nothing beyond. After that is signed they will talk about something else.\"\n\nLieut.-Gov. Morris—\"I told you on Saturday that I had nothing to do with the Company. The Company have a right to trade. I cannot make them buy goods and bring them here, or stop them from bringing them. I dare say some of you are traders; you do not ask me whether you shall buy\ngoods and sell them again, and I do not stop you. It is the same way with the Company. If they make money in bringing goods here they will bring them just as they used to do; and I want you to understand it fully, the Company may have a little more money than the white traders, or the Half-breeds, or the Indians, but they have no more right, they have no more privileges, to trade than the Indians, or the Half-breeds, or the whites; and that is written with a higher hand than ours, and we have no power to write anything, or to add anything, to what is written and remains in the Queen's house beyond the sea.\"\n\nThe Gambler—\"I do not want to drive the Company anywhere. What I said is, that they are to remain here at their house. Supposing you wanted to take them away, I would not let them go. I want them to remain here to have nothing but the trade. I do not hate them; we always exchange with them, and would die if they went away.\"\n\nLieut.-Gov. Morris—\"I do not know whether we rightly understand or not. I think you have spoken wise words; the Company helps you to live, and they have a right to sell goods as other traders. I do not know that I understand you rightly, that you do not want them to sell goods anywhere except at the posts; to keep at their posts there. If that is what you mean, I cannot say yes to that; they have the same right to sell goods anywhere that you have. They are no longer as they were once. The Government of the country, I think I told you that before—understand me distinctly—the Government have nothing to do with the Company, but the Company and all their servants are subjects of the Queen and love and obey her laws. The day has gone past when they made the laws. They have to hear the laws the Queen makes, and like good subjects submit to them.\n\nThe Gambler—\"The Company is not to carry anything out into the country, but are to trade in the Fort. That is what we want signed on the paper; then we will talk on other subjects.\"\nLieut.-Gov. Morris—\"I have told you before, and I tell you again, that the Company as traders have the right to sell goods anywhere they please, just as you have, just as the whites have, just as the Half-breeds have, and we have no power to take it away from them. If the Company were to ask me to say to you that you were not to trade anywhere except in their Fort by the lake, you would think it very hard, and I would say to the Company, No, you shall not interfere with the Indians throughout our land. I would like to give you pleasure but I cannot do wrong; we won't deceive you with smooth words. We will tell you the simple truth what we can do and what we cannot do, but we cannot interfere as you ask us.\"\n\nThe Gambler—\"Cannot you sign such a paper?\"\n\nLieut.-Gov. Morris—\"No; the Queen has signed the great paper, and the Company have no more rights than any one else, but they have the same.\"\n\nKa-kie-she-way (Loud Voice)—\"I would not be at a loss, but I am, because we are not united—the Crees and the Salteaux—this is troubling me. I am trying to bring all together in one mind, and this is delaying us. If we could put that in order, if we were all joined together and everything was right I would like it. I would like to part well satisfied and pleased. I hear that His Excellency is unwell, and I wish that everything would be easy in his mind. It is this that annoys me, that things do not come together. I wish for one day more, and after that there would not be much in my way.\"\n\nCote—\"You wanted me to come here and I came here. I find nothing, and I do not think anything will go right. I know what you want; I cannot speak of anything here concerning my own land until I go to my own land. Whenever you desire to see me I will tell you what you are asking me here. Now I want to return.\"\n\nLieut.-Gov. Morris—\"We asked the Chief to come here.\"\nHe has as much right to be here as another Indian. We cannot go there and ask the people of the two great tribes to meet in one place as they have done when they were asked to meet us. You have had many days to talk together. If the Saulteaux are determined that they want an agreement to prevent the Company from trading, it cannot be given. I think the Chief here spoke wisely. He says he is in trouble because you do not understand each other. Why are you not of one mind? Have you tried to be of one mind? Must we go back and say we have had you here so many days, and that you had not the minds of men—that you were not able to understand each other? Must we go back and tell the Queen that we held out our hands for her, and her red children put them back again? If that be the message that your conduct to-day is going to make us carry back, I am sorry for you, and fear it will be a long day before you again see the Queen’s Councillors here to try to do you good. The Queen and her Councillors may think that you do not want to be friends, that you do not want your little ones to be taught, that you do not want when the food is getting scarce to have a hand in yours stronger than yours to help you. Surely you will think again before you turn your backs on the offers; you will not let so little a question as this about the Company, without whom you tell me you could not live, stop the good we mean to do. I hope that I am perfectly understood; when we asked the chief here we wanted to speak with him about his lands at his place; when we asked “Loud Voice” here we wanted to speak with him about the land at his place; so when we asked the other chiefs here we wanted to speak with them about the lands at their places. Why? because we did not want to do anything that you would not all know about, that there might be no bad feelings amongst you. We wanted you to be of one mind and heart in this matter, and that is the reason you are here to-day. Now it rests with you; we have done all we could. Have you anything more to say to us, or are we to turn our\nbacks upon you, and go away with sorry hearts for you and your children? It remains for you to say.\"\n\nThe Gambler—\"We do not understand you and what you are talking about. I do not keep it from you; we have not chosen our Chiefs; we have not appointed our soldiers and councillors; we have not looked around us yet, and chosen our land, which I understand you to tell us to choose. We do not want to play with you, but we cannot appoint our Chiefs and head men quickly; that is in the way. Now it is near mid-day, and we cannot appoint our Chiefs. This Chief who got up last—the Queen's name was used when he was appointed to be Chief—he wants to know where his land is to be and see it, what like it is to be, and to find the number of his children; that is what is in his mind. He says he came from afar, he had a good mind for coming, and he takes the same good mind away with him. I have not heard him say to the Saulteaux to keep back their land.\"\n\nLieut.-Gov. Morris—\"I think I understand you. We do not want to separate in bad feeling, or to avoid any trouble in coming to an understanding with you; because I do not believe that if we do not agree it will ever be my good fortune to endeavor to do so again. \"Loud Voice,\" the Chief, has told us he wants a day to think it over. The Chief \"Cote,\" from the north, would like to go home, but I am sure he will stop a day and try to understand his brothers, and agree as the others did at the Lake of the Woods. I put my name, and the Chiefs and the head men put theirs, and I gave the Chief a copy, and I told him when I went home to Red River I would have it all written out, a true copy made on skin, that could not be rubbed out, that I would send a copy to his people so that when we were dead and gone the letter would be there to speak for itself, to show everything that was promised; and that was the right way to do. I did so, and sent a copy of the treaty written in letters of blue, gold, and black to the Chief \"Maw-do-pe-nais,\" whom the people had told to keep it for\nthem. He who speaks for the Saulteaux tells us they have not made up their minds yet about the land—he tells us they have not decided to refuse our hands. I am glad to hear him say that, and if it will please my Indian brethren here we will be glad to wait another day and meet them here to-morrow morning, if they will promise me with the words of men that they will look this matter straight in the face; that they will lay aside every feeling except the good of their people, and try to see what is right, and that they will come back and say, 'We have done our best, we have tried to be of one mind, and considered what was best for now, and to-morrow, and the years that are to come when we have all passed away. This is our answer. We are very much in earnest about this matter.'\n\nThe Chief said I was not very well, yet I am here. Why? Because the duty was laid upon me. I was afraid of the journey; but when a Chief has a duty to do he tries to do it, and I felt that if I could do you any good, as I believed I could, I ought to be here. I tell you this, trust my words, they come from the heart of one who loves the Indian people, and who is charged by his Queen to tell them the words of truth.\"\n\nSIXTH DAY'S CONFERENCE.\n\nThe Crees having come and shaken hands, His Honor Lieut.-Gov. Morris rose and said:\n\n\"My friends, I have talked much; I would like to hear your voices, I would like to hear what you say.\"\n\nKa-ku-ish-may, (Loud Voice—a principal chief of the Crees)—\"I am very much pleased with that, to listen to my friends, for certainly it is good to report to each other what is for the benefit of each other. We see the good you wish to show us. If you like what we lay before you we will like it too. Let us join together and make the Treaty; when both join together it is very good.\"\nThe Saulteaux arrived at this juncture, when the Lieut.-Governor said:\n\n\"I will say to the two tribes what I said to the Crees before the Saulteaux came. You have heard my voice for many days, you know its sound. You have looked in my face, you have seen my mind through my face, and you know my words are true and that they do not change. But I am not here to talk to-day, I am here to listen. You have had our message, you have had the Queen's words. It is time now that you spoke. I am here to listen, my ears are open. It is for you to speak.\"\n\nKamooses—\"Brothers, I have one word and a small one, that is the reason I cannot finish anything that is large. You do not see the whole number of my tribe which is away at my back, that is the reason I am so slow in making ready.\"\n\nLieut.-Gov. Morris—\"I want to hear the voice of those who are here, they can speak for themselves and for those who are away.\"\n\nChe-e-kuk (the Worthy One)—\"My ears are open to what you say. Just now the Great Spirit is watching over us; it is good, He who has strength and power is overlooking our doings. I want very much to be good in what we are going to talk about, and our Chiefs will take you by the hand just now.\"\n\nThe Chiefs now rose and shook hands with the Commissioners.\n\nKa-ha-oo-kus-ka-too (he who walks on four claws)—\"It is very good to meet together on a fine day, father. When my father used to bring me anything I used to go and meet him, and when my father had given it to me I gave it to my mother to cook it. When we come to join together one half at least will come.\"\n\nChe-e-kuk (the Worthy)—\"Now I am going to tell you, and you say your ears are open. You see the Qu'Appelle Lake Indians that you wished to see, you hear me speak but there are many far away, and that is the reason I cannot speak for these my children who are away trying to get something to\neat; the Crees my child is not here, the Saulteaux my child is not here, the Young Dogs are not here, the Stonies my children are not here; this is not the number that you see; I am only telling you this, I think I have opened my mind.\"\n\nLieut.-Gov. Morris—\"I know you are not all here. We never could get you all together; but you know what is good for you and for your children. When I met the Saulteaux last year we had not 4,000 there, but there were men like you who knew what was good for themselves, for their wives, for their children, and those not born. I gave to those who were there, and they took my hand and took what was in it, and I sent to those who were away, and I did for them just as I did for those who were present. It is the same to-day. What we are ready to give you will be given to those who are not here. What is good for you, what you think will be good for you will be good for them. It is for you to say, not for us; we have done all that men who love their red brothers can do; it is for you now to act, on you rests the duty of saying whether you believe our message or not, whether you want the Queen to help you or not, whether or not you will go away and let the days and the years go on, and let the food grow scarcer, and let your children grow up and do nothing to keep off the hunger and the cold that is before them. It is for you to say that, not for us; if we had not your good at heart we would not have been here, and we would not have labored these many days, if our hearts were not warm towards you, and if we did not believe what we are doing, would be for your good as children of our Queen. I have said all.\"\n\nKan-oo-ses—\"Is it true you are bringing the Queen's kindness? Is it true you are bringing the Queen's messenger's kindness? Is it true you are going to give my child what he may use? Is it true you are going to give the different bands the Queen's kindness? Is it true that you bring the Queen's hand? Is it true you are bringing the Queen's power?\"\nLieut.-Gov. Morris—\"Yes, to those who are here and those who are absent, such as she has given us.\"\n\nKamooses—\"Is it true that my child will not be troubled for what you are bringing him?\"\n\nLieut.-Gov. Morris—\"The Queen's power will be around him.\"\n\nKamooses—\"Now, I am going to ask you that the debt that has been lying in the Company's store, I want that to be wiped out. I ask it from the great men of the Queen.\"\n\nLieut.-Gov. Morris—\"I told you before we have nothing to do with the Company, we have nothing to do with its debts. I have told you what we will do for you, what the Queen will do for you forever. But the money that the Indian owes the Company is just like the money that the Indians owe to each other or to any trader and is not due to the Queen. We have no power to put money in your hands and your children's to pay your debts, and it would not be right for the Queen to come in and take away either what is between you and the Company, or what is between you and the traders, or what is between you and each other. If one of you owes the Chief is it right that the Queen should wipe it out? I would be very glad if we had it in our power to wipe out your debts, but it is not in our power. All we can do is to put money in your hands and promise to put money in the hands of those who are away, and give you money every year afterwards, and help you to make a living when the food is scarce. I have told you from the first that whether my words please you or not I will tell you only the truth, and I will only speak as far as the Queen has given us power.\"\n\n(He who walks on four claws)—\"Whenever you give to these my children what they desire, then you will get what you want.\"\n\nLieut.-Gov. Morris—\"We will give them what we have power to give. We are ready to hear.\"\n\nKamooses—\"Yes, I understand and my heart also, but it is\nnot large, it is small, and my understanding is small; that is the word I tell you.\"\n\nLieut.-Gov. Morris—\"I have told you what we are ready to do for you. Your understanding is large enough to know what is good for you. We have talked these many days, and I ask you now to talk straight, to tell me your mind, to tell me whether you wish to take our offers or not, it is for you to say.\"\n\nKee-e-kuk—\"Twenty dollars we want to be put in our hand every year, this we have heard from the others. Twenty-five dollars to each chief.\"\n\nLieut.-Gov. Morris—\"If I understand you aright you are mistaken. The Saulteaux did not get twenty-five dollars per head. They get five dollars every year. We promised them five dollars every year, and a messenger was sent this year to pay them that sum. I may tell you that my children at the Lake of the Woods had big hearts to ask. You say you have small. I told them that if the Queen gave them all they asked I would have to ask her to allow me to become an Indian, but I told them I could not give them what they asked, and when they understood that, and understood the full breadth and width of the Queen's goodness, they took what I offered, and I think if you are wise you will do the same.\"\n\n(A proposition was made here by an Indian that they should receive five dollars per head every second year for fifty years, but he must have done so without authority as it was not acceded to by the other Indians who expressed their dissent strongly as soon as the offer was made.)\n\nKamooses—\"I am going to speak for Loud Voice and for the other chiefs. Some chiefs are not here, they are absent, hereafter you will see them. I myself will tell them, and my child that is at my back will tell them also. Will you receive that which I am asking? I want to clear up what the Indians and I want to try and put it right, what my child will say. Well, can you give me that. We want the same Treaty you\nhave given to the North-West Angle. This I am asking for.\"\n\nLieut.-Gov. Morris—\"Who are you speaking for? Is it for the whole of the Indians? (They expressed their assent.) Are you ready to carry it out? (They again assented.) Are your chiefs ready to sign this afternoon if we grant you these terms? (The Indians assented unanimously.) It is now after twelve, we will speak to you this afternoon.\"\n\nThe Conference here ended to allow the Commissioners time to consult.\n\nAFTERNOON CONFERENCE.\n\nThe Indians having assembled, presented the Chiefs, whose names appear on the Treaty to the Commissioners as their Chiefs.\n\nKamooses—\"To-day we are met together here and our minds are open. We want to know the terms of the North-West Angle Treaty.\"\n\nLieut.-Gov. Morris—\"Do we understand that you want the same terms which were given at the Lake of the Woods. (The Indians assented.) I have the Treaty here in a book. You must know that the steamboats had been running through their waters, and our soldiers had been marching through their country, and for that reason we offered the Ojibbeways a larger sum than we offered you. Last year it was a present, covering five years; with you it was a present for this year only. I paid the Indians there a present in money down of twelve dollars per head. I have told you why we offered you less, and you will see there were reasons for it. That is the greatest difference between what we offered you and what was paid them, but on the other hand there were some things promised you that were not given at the Lake of the Woods. (His Honor then explained the terms granted in that Treaty.) We promised there that the Queen would spend $1,500 per year to buy shot and powder, ball and twine. There were 4,000 of\nthem. I offered you $1,000 although you are only one-half the number, as I do not think you number more than 2,000. Your proportionate share would be $750 which you shall receive. Then at the Lake of the Woods each Chief had their head men; we have said you would have four who shall have fifteen dollars each per year, and as at the Lake of the Woods each Chief and head man will receive a suit of clothing once in three years, and each Chief on signing the treaty will receive a medal and the promise of a flag. We cannot give you the flag now, as there were none to be bought at Red River, but we have the medals here. Now I have told you the terms we gave at the North-West Angle of the Lake of the Woods, and you will see that the only difference of any consequence between there and what we offered you is in the money payment that we give as a present, and I have told you why we made the difference, and you will see that it was just. We had to speak with them for four years that had gone away. We speak to you only for four days. It was not that we came in the spirit of traders, but because we were trying to do what was just between you and the Queen, and the other Indians who would say that we had treated you better than we had treated them because we put the children of this year on the same footing as these children through whose land we had been passing and running our steamboats for four years. You see when you ask us to tell you everything, we show you all that has been done, and I have to tell you again that the Ojibbeways at Lake Seul who number 400, when I sent a messenger this spring with a copy of those terms made at the North-West Angle with their nation, took the Queen's hand by my messenger and made the same treaty. I think I have told you all you want to know, and our ears are open again.”\n\nKamooses—“I want to put it a little light for all my children around me, something more on the top. For my chief thirty dollars, for my four chief head men twenty dollars, and each of my young children fifteen dollars a year,”\nLieut.-Gov. Morris—\"I am afraid you are not talking to us straight; when we went away you asked us to give you the terms given at the Lake of the Woods; you asked to know what they were, and the moment I told you, you ask three times as much for your children as I gave them. That would not be right; and it is well that you should know that we have not power to do so; we can give you no more than we gave them. We hope you are satisfied. I have one word more to say, we are in the last hours of the day you asked us for and we must leave you. The utmost we can do, the furthest we can go or that we ought to go is, to do what you asked, to give you the terms granted last year at the Lake of the Woods. We can do no more, and you have our last words. It is for you to say whether you are satisfied or not.\"\n\nKamooses—\"We ask that we may have cattle.\"\n\nLieut.-Gov. Morris—\"We offered you cattle on the first day, we offered your Chief cattle for the use of his band—not for himself, but for the use of his band; we gave the same at the Lake of the Woods. We can give no more here.\"\n\nKamooses—\"We want some food to take us home.\"\n\nLieut.-Gov. Morris—\"When you sign the treaty, provisions will be given to take you home. Now I ask you, are you ready to accept the offer, the last offer we can make, you will see we have put you on the same footing as the Indians at the Lake of the Woods, and we think it is more than we ought to give, but rather than not close the matter we have given it, we have talked long enough about this. It is time we did something. Now I would ask, are the Crees and the Saulteaux and the other Indians ready to make the treaty with us. Since we went away we have had the treaty written out, and we are ready to have it signed, and we will leave a copy with any Chief you may select and after we leave we will have a copy written out on skin that cannot be rubbed out and put up in a tin box, so that it cannot be wet, so that\nyou can keep it among yourselves so that when we are dead our children will know what was written.\"\n\nKamooses—\"Yes, we want each Chief to have a copy of the treaty, we ask that the Half-breeds may have the right of hunting.\"\n\nLieut.-Gov. Morris—\"We will send a copy to each Chief. As to the Half-breeds, you need not be afraid; the Queen will deal justly, fairly and generously with all her children.\"\n\nThe Chiefs then signed the treaty, after having been assured that they would never be made ashamed of what they then did.\n\nOne of the Chiefs on being asked to do so signed; the second called on said he was promised the money when he signed, and returned to his seat without doing so. The Lieutenant-Governor called him forward—held out his hand to him and said, take my hand; it holds the money. If you can trust us forever you can do so for half an hour; sign the treaty. The Chief took the Governor's hands and touched the pen, and the others followed. As soon as the treaty was signed the Governor expressed the satisfaction of the Commissioners with the Indians, and said that Mr. Christie and Mr. Dickieson, the Private Secretary of the Minister of the Interior, were ready to advance the money presents, but the Indians requested that the payment should be postponed till next morning, which was acceded to. The Chiefs then formally approached the Commissioners and shook hands with them, after which the conference adjourned, the Commissioners leaving the place of meeting under escort of the command of Lieut.-Col. Smith, who had been in daily attendance.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/Ayer_168_8_M22_M8_1880.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 130, "total-input-tokens": 189718, "total-output-tokens": 59530, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 96, 1], [96, 321, 2], [321, 386, 3], [386, 386, 4], [386, 386, 5], [386, 386, 6], [386, 723, 7], [723, 757, 8], [757, 1732, 9], [1732, 1732, 10], [1732, 3042, 11], [3042, 3042, 12], [3042, 4060, 13], [4060, 4060, 14], [4060, 5139, 15], [5139, 7234, 16], [7234, 9287, 17], [9287, 9926, 18], [9926, 11572, 19], [11572, 13699, 20], [13699, 15335, 21], [15335, 17077, 22], [17077, 19967, 23], [19967, 23044, 24], [23044, 26214, 25], [26214, 29387, 26], [29387, 31485, 27], [31485, 33023, 28], [33023, 35996, 29], [35996, 36993, 30], [36993, 38615, 31], [38615, 40573, 32], [40573, 42511, 33], [42511, 44499, 34], [44499, 46601, 35], [46601, 48529, 36], [48529, 50677, 37], [50677, 52980, 38], [52980, 55861, 39], [55861, 59057, 40], [59057, 61600, 41], [61600, 63705, 42], [63705, 66626, 43], [66626, 69918, 44], [69918, 73081, 45], [73081, 76303, 46], [76303, 79497, 47], [79497, 82611, 48], [82611, 84978, 49], [84978, 86653, 50], [86653, 88687, 51], [88687, 90511, 52], [90511, 93479, 53], [93479, 96762, 54], [96762, 99986, 55], [99986, 103247, 56], [103247, 106393, 57], [106393, 108652, 58], [108652, 110688, 59], [110688, 112531, 60], [112531, 114003, 61], [114003, 116010, 62], [116010, 117996, 63], [117996, 120051, 64], [120051, 121981, 65], [121981, 124047, 66], [124047, 126076, 67], [126076, 127989, 68], [127989, 129915, 69], [129915, 131873, 70], [131873, 133893, 71], [133893, 135821, 72], [135821, 137925, 73], [137925, 139912, 74], [139912, 141765, 75], [141765, 143643, 76], [143643, 145479, 77], [145479, 147325, 78], [147325, 149242, 79], [149242, 151039, 80], [151039, 152995, 81], [152995, 154160, 82], [154160, 155845, 83], [155845, 157887, 84], [157887, 159985, 85], [159985, 162521, 86], [162521, 165403, 87], [165403, 168408, 88], [168408, 171270, 89], [171270, 173559, 90], [173559, 175937, 91], [175937, 179053, 92], [179053, 180714, 93], [180714, 182739, 94], [182739, 184455, 95], [184455, 186456, 96], [186456, 188178, 97], [188178, 190199, 98], [190199, 192204, 99], [192204, 194152, 100], [194152, 196257, 101], [196257, 198366, 102], [198366, 200361, 103], [200361, 202403, 104], [202403, 204327, 105], [204327, 206348, 106], [206348, 208285, 107], [208285, 210155, 108], [210155, 212109, 109], [212109, 213992, 110], [213992, 216037, 111], [216037, 217935, 112], [217935, 219748, 113], [219748, 221817, 114], [221817, 223870, 115], [223870, 225822, 116], [225822, 227801, 117], [227801, 229668, 118], [229668, 231743, 119], [231743, 233779, 120], [233779, 235585, 121], [235585, 237450, 122], [237450, 239460, 123], [239460, 241310, 124], [241310, 243238, 125], [243238, 244987, 126], [244987, 247045, 127], [247045, 248998, 128], [248998, 250565, 129], [250565, 250565, 130]], "primary_language": ["en", "en", "en", "None", "None", "None", "en", "en", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]