[{"id": "1ac7ebfcafd7da1a9d32ff804e3586a51baad4b1", "text": "Narrative of the Canadian Red River Exploring Expedition of 1857, and of the Assinniboine and Saskatchewan Exploring Expedition of 1858. By Henry Youle Hind, M.A., F.R.G.S. 2 vols. 8vo. Longmans: London, 1860.\n\nIn these two handsome volumes we have an account of the expeditions sent forth by the Canadian Government for the exploration of the vast tract of country intervening between Lake Superior and the Rocky Mountains, partly with the view of ascertaining what portions of this region are adapted for the establishment of colonies, and partly to determine the most practicable route for an overland communication with the colony of British Columbia, planted on the shores of the Pacific. The latter object has been most served by Captain Palliser's investigation of the passes of the Rocky Mountains leading into British territory on the eastern side of that chain; and it is also to the researches of that gentleman that we are indebted for the knowledge of that remarkable belt of fertile country which stretches from Red River in the east to the foot of the Rocky Mountains in the west, and must be of the highest importance in any future scheme of communication between the shores of the Atlantic and Pacific within British territory in North America.\n\nWe have, however, little to do here with the portions of the narrative bearing directly upon these questions, although, of course, all the natural-history information acquired by the gentlemen of the expeditions is of more or less importance in arriving at sound conclusions upon such subjects. Mr. Hind's descriptions of his canoe-voyages through the almost interminable chain of rivers and lakes which occupy so large a portion of the surface of the country explored will be found exceedingly interesting, as are also his accounts of the beauty of much of the scenery through which he passed, and especially of the numerous cataracts occurring in the rivers—the latter far more welcome to the lovers of the picturesque than to the voyageurs, who have to carry their canoes and cargoes over a considerable space of ground at every interruption of this nature. Several of these falls form the subjects of some of the illustrations of the book, and are of great beauty.\n\nStorms of great violence frequently occur in the country traversed by the expeditions, and the hailstones appear to attain a most extraordinary size. They fall with such force as to batter and almost disable the hands of the voyageurs engaged in paddling the canoes, and occasionally even break through the birch bark of which these frail vessels are made, or the still tougher buffalo-skins under which the travellers seek for shelter.\n\nA vast extent of country appears to be quite inapplicable to the purpose of colonization; but many spots of great fertility are found along the course of the rivers. One of these is the Selkirk settlement on Red River, which, however, occupies a part of the eastern extremity of the fertile belt above referred to, stretching from Lake Winnipeg to the foot of the Rocky Mountains. This little settlement appears to be a perfect agricultural paradise, its only\ndrawback being its difficulty of access; and it gives one the most favourable anticipations of the future usefulness of the 65,000 square miles of similar country which, as calculated by Captain Palliser, form the fertile belt in British North America. Agricultural operations in this region seem, however, to be exposed to a drawback which will appear rather novel to English colonists, in the spread of a species of Locust, described by Dr. Harris under the name of *Acrydium femur-rubrum*. These insects were very destructive in the Red River settlement in 1819, but occurred only in small numbers from that year to 1857 (the year of the expedition to Red River), when they appeared in vast quantities over an immense extent of country, in some places devouring everything green that came in their way, and migrating from place to place in such enormous crowds as to give a peculiar appearance to the sky. Many notices of the occurrence of these destructive creatures will be found in Mr. Hind’s narrative.\n\nVast as is the surface still covered by water in the region of the great American Lakes, there is sufficient evidence, according to Mr. Hind’s observations, of its having formerly extended over a far greater area and gradually receded. Long ranges of hills, generally forming the escarpments of plateaux of elevated prairie, run more or less parallel to the general outline of the lake basin, and these have every appearance of having at no very distant period formed the successive shores of an enormous body of water; raised beaches and terraces are by no means of uncommon occurrence; and most of the rivers take their course through broad valleys of erosion, which must have been formed by streams of far greater volume than is attained by the highest floods of the present day. We can understand how this immense amount of surface-water may have been drained off; but Mr. Hind describes another kind of diminution of water-supply which is not quite so intelligible. His investigation of the Assiniboine shows that the quantity of water discharged by that river into the Red River is but little more than half that passing Fort Ellice at a distance of 280 miles from its outlet,—the amounts being 9,979,200 cubic feet per hour at Fort Ellice, and only 5,702,400 at Lane’s Post, distant 22 miles from the confluence with Red River. The most singular part of the business is, that the amount of water in the river increases more than 25 per cent. during the first half of its course from Fort Ellice,—the quantity passing the mouth of the Little Souris being 12,899,040 feet per hour. Thus, according to Mr. Hind, considerably more than half the water passing the mouth of the Little Souris river must be lost in some way during the passage of the Assiniboine from that point to Lane’s Post, a distance of 118 miles. Mr. Hind supposes the loss to take place by evaporation; but although the river receives no considerable affluents during the latter half of its course, this cause seems quite inadequate to the production of an effect of such magnitude, and we can only suppose that the waters must find some other outlet which has escaped the notice of the explorers.\n\nWith regard to the aboriginal population of Rupert’s Land, we find many interesting notices scattered through the pages of Mr.\nHind's narrative; but all the facts brought forward by him assist in proving that the Indians are gradually diminishing in numbers. The instinct of hunting is strong in the Indian; and even the half-breeds, or children of white men by Indian mothers, exhibit the same tendency in its fullest extent. This constitutes one of the greatest difficulties in the way of preserving the remnant of these interesting tribes. Mr. Hind, like all other unprejudiced observers, sees clearly that the work of civilization must precede that of christianization; but so great is the love of the wild life of the prairie-hunter both in Indians and half-breeds that it is almost impossible to keep them in a stationary and settled condition, without which all efforts at cultivation are useless. Indeed such a condition of life on the part of the Indians is so much against the interests of the Hudson's Bay Company, within whose territory these explorations have been carried on, that they appear to be rather lukewarm in the matter and give but cold encouragement to the efforts of missionaries, as the adoption of a settled mode of life and the eschewing of \"fire-water\" would undoubtedly cause a very great falling off in the supply of skins. In fact all the habits of these native tribes seem to tend directly towards their rapid extinction: their fondness for spirits, their love of scalp-taking with its attendant wars, and their utter improvidence would alone be sufficient to account for a steady diminution in their numbers; but when we read Mr. Hind's account of the reckless manner in which they destroy one of their main supplies of game, the Buffalo—nay, actually drive these beasts from their hunting-grounds by carelessly setting fire to the prairies, thus increasing every year the difficulty of obtaining their necessary supplies, we can no longer wonder that the race of the red man seems doomed.\n\nMr. Hind states that the hunters of the Red River district firmly believe in the existence of two kinds of Buffalo, which they call the \"prairie Buffalo\" and the \"Buffalo of the woods.\" These two supposed species are said to differ in size, colour, hair, and horns. The skin of the \"wood Buffalo\" is much larger than that of the common animal; the hair is very short, and the mane is not curled. Two skins, said to be those of the wood Buffalo, seen by Mr. Hind in Selkirk settlement, bore a very close resemblance to the skin of the Lithuanian Bison. The wood Buffalo is said to be very scarce, and to occur only to the north of the river Saskatchewan and on the flanks of the Rocky Mountains. This point might be worth the attention of some of our sporting Englishmen, who seem to find no country too distant now-a-days for their hunting excursions.\n\nThe geology of the Great Basin of Lake Winnipeg, of course, constitutes a prominent feature in this narrative, and many sections are described in the course of the work. The eastern boundary of the basin, and in fact the eastern shore of Lake Winnipeg itself, is formed by the metamorphic rocks belonging to the Laurentian system of Sir Wm. Logan and Mr. Hunt, which constitute a chain of mountains running from the north bank of the St. Lawrence past Lake Superior, and then passing in a north-westerly direction to the\nshores of the Arctic Sea. To the westward these rocks are skirted by a broad belt of Silurian rocks, which form the western shore of Lake Winnipeg, and these, again, are succeeded in a westerly direction by beds of Devonian age,—the two series forming the broad and nearly level district between Lake Winnipeg and the first range of hills. The base of these hills is also formed by Devonian rocks, from which salt-springs issue in many places, and are worked with considerable profit, although in the rudest fashion. No traces of Carboniferous, Permian, Triassic, or Jurassic rocks were detected by Mr. Hind, who, however, states that, in the sections examined by him, a portion amounting to about 400 feet, between the Devonian rocks below and the Cretaceous above, was inaccessible in consequence of its being covered by drift. The most remarkable feature in the geology of Rupert’s Land is the great development of the Cretaceous series of rocks, which form the capping of the hills just mentioned as lying to the westward of Lake Winnipeg, and extend therefrom in a wide plateau, broken here and there by small hills, to the Grand Coteau du Missouri, which they form, and beyond which, in the territory of the United States, they are covered by the Tertiary beds, occupying the greater part of the valley of the Missouri River. Northward these rocks have been traced beyond the north branch of the Saskatchewan River, and their further extension is unknown. Tertiary beds, the search for which was of importance from the circumstance of the occurrence of lignite in them, both in the basin of the Missouri and that of the Upper Saskatchewan, were not met with in the region explored by the expeditions, although rolled fragments of lignite were often met with in abundance in the river-sections of recent deposits.\n\nWith these remarks we take leave of Mr. Hind’s narrative, of which we hope we have said enough to indicate that it contains a great amount of highly interesting information. It is illustrated with numerous excellent woodcuts of localities, Indians, articles of dress, and fossils, and with several maps and geological sections.\n\nTabular View of the Orders and Leading Families of Myriapoda, Arachnida, Crustacea, Annelida, and Entozoa. Society for Promoting Christian Knowledge, London, 1861.\n\nThe title conferred upon this little book by its publishers is hardly, to our notions, expressive of its contents; it is rather a pictorial than a tabular view of the Annulose division of the animal kingdom, exclusive of the Insects and Rotifera, and consists of four large mounted folding plates of characteristic forms of the classes mentioned in its title. These plates are also sold mounted on a roller and varnished, so as to form a diagrammatic illustration of the great group of Annulosa, with the omission, as above stated, of the important class of Insects, which may probably be intended to form the subject of a similar publication.\n\nThe subjects in the present work have been arranged, as stated on the last plate, by Mr. Adam White and Dr. Baird—the former taking", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/biostor-90664.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5352, "total-output-tokens": 2807, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3131, 1], [3131, 6441, 2], [6441, 9714, 3], [9714, 12804, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]