[{"id": "adb7e8728842f62bbb6f1ff1d6d40d9c99bd4228", "text": "THE CITY COUNCIL\n\nThe regular meeting of this council was held on Monday evening, in the city hall, the following Aldermen present: Munro, Amphlett, McCaulay, Cunningham, Maclean, Morrison, Lilley, Sharp, Allibone, McIlwraith, Cowan, Harvey, McManus, McColl, Simpson, Lindsay, Hunter, Campbell, Smith, MacGregor, Sampson, Cameron, McNabb.\n\nMr. Smith moved the election by ballot of three members from the district of Portage la Prairie.\n\nMr. Anderson seconded.\n\nMotion carried.\n\nMr. Smith then moved to call a special meeting of this council to consider the question raised by Mr. Anderson.\n\nMr. Hunter seconded.\n\nMotion carried.\n\nMr. Smith then moved to adjourn until next day noon.\n\nMotion carried.\n\nFRIDAY NIGHT\n\nThe council then adjourned until Friday evening.\n**A Maiden Fair.**\n\n**}**\n\n**}**\n\n**NOTICE TO—**\n\n**SUBSCRIBERS—**\n\n**ACCEPT $5**\n\n**GIVE A CLEAR RECEIPT**\n\nA full January, 1886, that is receipt all arriving, and pay on your full balance of this account, and those who send us your personal property for our safety. We will not charge anything for it.\n\n**ACCEPT $3.50**\n\n**Imported Goods**\n\n**PATENTS**\n\n**New City Bakery**\n\n**Mr. Basenace,**\n\n**Publisher**\nTHE BRANDON WEEKLY MAIL\n\nTHURSDAY, DECEMBER 4, 1897.\n\nLEARNING AT LAST.\n\nThey are gradually coming to the view that there can be no satisfactory terms by which the project can be transacted, and the pre- cedings of the Farmers’ Union, last week.\n\nMr. Parry said he had been re- quested to bring this matter before the house because a special com- mittee on the railway commi- ttee was not going the right way about the question. He spoke of the line between Brandon and the Saskatahene boundary, which he said, seems to have lost sight of the fact that in applying for the Grand Trunk Western line he was losing time. The Local Govern- ment Board has already told him that it was not proper to push the limit of its power until it knew whether such a line would be served by the Dominion Government, so the questions now raised by the Jum der Union, if they are really raised, are whether such a line will be served, or is it going to be pushed beyond the limit of the rights of the Dominion, and if it is not, why not? Is the idea of a split city going to be pushed? Are they going to give up the fact that the Dominion does not want to handle the matter? If they do give it up, what is the theory behind this? It is not practical, and the sooner we get away from the idea that it is going to be a split city, and once the shape of things, that much will be done toward settling the matter.\n\nIt was suggested that a resolution be moved that the Union do all in its power to oppose any attempt to split the City into the two sides, but Mr. Parry said that all such resolutions were futile unless they were backed up by other resolutions.\n\nThe House adjourned.\n\nTHE WINNIPEG TIMES AND PROPOSED ROCK LAKE AND BRANDON R.R.\n\nThe Winnipeg Times, in its issue of Thursday, December 6th, informed our readers that the Chicoutimi Railway Company had completed the track and that the line would be opened for traffic on December 31st, 1897.\n\nTHE RAISIN TRADE.\n\nA great many complaints are being made about the raising of prices for raisins. It is alleged that the merchants are charging exorbitant prices for these fruits. A meeting of the raisin growers has been called to discuss the matter.\nNOMINATION\nFOR\nCIVIC ELECTIONS\n1885.\nCITY OF BRANDON.\n\nNotice\n\nIt is hereby notified, that a meeting of the citizens of the City of Brandon will be held at the City Hall, on Monday, December 1st, 1885.\n\nE. MARTINSON,\nChairman of the Board of Election Commissioners.\n\nMAYWOOD'S TRANSFER CO.\n\nFreight & Baggage\n\nDRAYING\n\nSHOE CO., ROSER AVE.\n\nA MAYWOOD & SONS\n\nHELLYAR BROS.\n\nFIRE INSURANCE\n\nCUSTOMS BROKERS.\n\nMoney to Loan\n\nOFFICE: ROSER AVE.\n\nWARD No. 2.\n\nTo the Electors of Ward No. 2.\n\nGentlemen,\n\nHaving been elected by the Citizens Meeting held in the City Hall last week to represent the ward for a seat on the Council, I desire to make known to you my views and opinions at your disposal. As there are no practical rules or regulations of any kind which can be followed in such matters, I shall rely upon your good sense and judgment in all matters pertaining thereto. I am here to serve you and do everything in my power to promote the welfare of our city.\n\nYours truly,\n\nWm. Johnston.\n\nAtkinson & Nation,\n\nDistrict Agents:\n\nChristmas Presents.\n\nAlso from Goods, Girdles, etc., Ladies' Underwear and Pants, Silk, Cotton, Satin, Ribbon, Corsets, For Sale at 6th Street, etc., etc.\n\nREADY-MADE CLOTHING,\n\nFor Ladies, Gentlemen, Children, etc.\n\nInspection and Comparison Respectfully Solicited.\n\nATKINSON & NATION,\n\nMolesworth Block,\n\nCorner Rosser Ave. and Sixth Street,\n\nBRANDON.\n\nThe Cochrane Manufacturing Co.\n\nLIMITED\n\nManufacturers of the Celebrated\n\nMINNEAPOLIS HARVESTER AND TWINE BINDER,\n\nThe only Binder using the celebrated PRAIRIE TRIP, it is absolutely proof against breakage.\n\nIMITATED BY MANY, EXCELLED BY NONE.\n\nAcknowledged by Farmers and Dealers the VICTOR in the Harvest of 1883.\n\nPRAIRIE FRONT CUT MOWR, TIGER HAY RAKE, LAND ROLLER, 2 & 3 Drawn Hosier Seeders, Wagons, Plows, Harrows, American Prairie Bob Sleighs with Cast Knives.\n\nWe are also Agents for the famous New World's Best Seed, Wheat, Oats, Barley, etc.\n\nSMITH & EVANS, Agents,\n\n9th Street, BRANDON.\n\nTO GET YOUR\n\nEYE\n\nPERFECTLY FITTED\n\nWITH\n\nBEST PEBBLE SPECTACLES,\n\nIN AT\n\nREESOR'S Jewelry Store,\n\nJust to Hand, another lot of\n\nReliable Gold and Silver WATCHES\n\nSolid 18 Karat gold Rings & Fine gold Jewelry.\n\nAlso SILVERWARE & JET GOODS.\n\nRepairing a Specialty.\n\nD.A. REESOR, The Jeweller.\n\nWILSON & CO.\n\nDEALERS IN\n\nHardware\n\nSTOVES\n\nAND\n\nTINWARE.\n\nCORNER 7th and\n\nROSSER AVENUE.\nSHOVED HIM OFF WORK.\n\nShe Wanted More Food—Has Hope Gone Away?\n\nWhat is that woman doing? she asked the judge, turning round in amazement. We found her on the bench and brought her here. She seems to be in great pain.\"\n\nThe woman sat on a bench in the entryway of the building, her head bowed, her hands clasped behind her back. Her dress was torn at the knee; her shoes were very faded; there stood on the ground near her feet a small child.\n\n\"Does she belong to you?\" asked the judge.\n\n\"I believe she does,\" replied the officer, not seeming to care.\n\n\"No! You're lying!\" cried the child, jumping down.\n\n\"Nay, not now,\" said the judge, raising his hand. \"Go on with your work. I will hear you when you are done.\"\n\nThe woman continued to sit, her eyes fixed on the ground.\n\n\"What do you want me to do?\" she asked, her voice wavering.\n\n\"I want you to go back to your husband,\" said the judge, sternly.\n\n\"He wouldn't let me work for him,\" she replied, tears streaming down her face.\n\n\"He has no right to keep you from working,\" said the judge, firmly.\n\n\"But he's cruel!\" cried the woman, clutching at the child.\n\n\"I'm sure he's not,\" replied the judge, dismissively. \"Go back to your work.\"\n\nThe woman sighed, stood up, and walked away. The child followed, crying softly.\n\nINDIAN GIRLS.\n\nAs an example of their docility, even when faced with the loss of their family, these girls prove their adaptability. One girl, found wandering in the street, was seen by a passing Indian woman who approached her and offered her some food. The child accepted the food, smiled, and disappeared into a nearby alley. Another was found crying in a doorway, surrounded by a group of Indians who gave her food and comfort. Despite the trials and tribulations they face daily, these girls maintain their sense of dignity and resilience.\n\nJersey Beauties.\n\nThere are spots as much more enchanting than Jersey. Let them have a word to the beauty-loving stranger.\n\nA Ride for Life.\n\nA Man Switched on a Brand Finished Saturday.\n\nOn Monday, December 9th, 1867, a man was spotted riding a bicycle in the streets of New York City. He wore a dark suit and a bowler hat. Onlookers watched in awe as this daring new mode of transportation transformed city streets into open highways for the first time in history.\n\nMIXED FARMING.\n\nCalifornia papers are urging the farmers of the coast to increase their farming and begin growing more crops. The state has an abundance of these things in its vast farmlands, so large quantities of produce can be marketed in the coming years.\n\nTHE BRANDON WEEKLY MAIL\n\nLETTER TO FARMERS.\n\nWhat May Be Done for the Right Ambition Farmer?\n\nMr. Pond Replies.\n\nNearly two weeks ago, Mr. Pond posted a letter to his subscribers about what farmers could do to improve their situation. It remains to be seen how many farmers read and responded to his suggestions.\n\nOld-fashioned Farmer.\n\nAn Old-fashioned farmer was visiting his young relative in North Carolina. His old friend looked around the house and commented, \"This place is just like my old house back home.\"\nAT SAN JACINTO.\n\nHow Texas Was Captured and Held—General.\n\nAn aged Texas warrior's reminiscences of the War for the Independence of Texas.\n\nThe Commercial Gazette has the following account of an interview with Mr. Hopson, who was an active participant in the battle of San Jacinto, and who has been engaged in the business of tailoring for many years. He was present at the battle of San Jacinto, and his recollection of the events of that day are still vivid in his mind.\n\nMr. Hopson describes the scene of the battle as follows:\n\n\"The battle of San Jacinto was fought on April 21st, 1836, near Houston, Texas. The Texans, under the command of General Sam Houston, defeated the Mexicans under General Santa Anna. The battle lasted from sunrise until noon, and ended in a decisive victory for the Texans. The Mexicans lost over 600 men killed and wounded, while the Texans lost only about 15.\"\n\nMr. Hopson also relates how he came to be present at the battle:\n\n\"I was living in Houston at the time of the battle, and I heard about it through the newspapers. I decided to go to the battle, and I set out on horseback early in the morning. I arrived just in time to see the battle begin, and I was able to witness the entire engagement.\"\n\nMr. Hopson goes on to describe the conditions at the battle:\n\n\"The Texans were well armed and well trained, while the Mexicans were poorly equipped and ill-prepared. The Texans were able to take advantage of their superior training and equipment, and they were able to defeat the Mexicans with relative ease.\"\n\nMr. Hopson concludes by saying:\n\n\"It was a great day for Texas, and it will always be remembered as the day when Texas gained its independence. I am proud to have been there, and I am grateful for the opportunity to share my experiences with others.\"\n\nTHE TORONTO STORE\n\nSELLING OUT.\n\nLEAVING BRANDON.\n\nA Great Shantybuilding Sale—over 100,000 worth of Dry Goods, Clothing, Carpets, Blankets, Pots, Pans, Hats and Caps now on sale.\n\nAs we are engaged in business in Ontario, this sale is SQUARE and NO HURRY.\n\nHeaps of Dry Goods\n\nTo Whom From—Large Stock of Plain and Brocade Silks for Ladies and Men.\n\n100 pieces Dress Goods, from $1.00.\n\n20 pieces Grey and Plain Wool Foursuits, yellow coat, $1.00.\n\n75 Ladies Shawls and Jackets, at half price.\n\nAll goods marked down from 25% to 50%.\n\nCAR LOADS OF CROCEIES.\n\nFresh Fruit from $1.00, Fish from $1.00, Eggs from $1.00, Butter from $1.00, Flour from $1.00.\n\nCome early and take advantage of this Great Sale. You may not have another such opportunity for some time.\n\nTERMS CASH.\n\nSOVEREEN & JOHNSTONE.\n\nToronto Store, Cor. 7th St. & Rosser Ave.\n\nJUST RECEIVED AT\n\nWhitehead & Whitelaw's Store\n\nBRANDON.\n\n25 Cents H.H.D.'s Cases and Wrists of Fine China White and Colored Granite Tea Sets, with a general stock of Delft Crockery and Glassware.\n\nPictures Fine Prints, extra value.\n\n20 Pieces of Sailing, Skating, Cartonales and Ducks, with immense stock of General and Staple Dry Goods.\n\n100 pieces Black and Candies of Fine Tea, carefully selected, far flavor bought low, and will be sold cheap.\n\n900 Pounds Fresh Turnips, Seed, Carrots, Mangold, Turnip, Garden and Flower Seeds, all kinds, at prices below the market can produce.\n\n200 Pounds of Raisins, Fancy Goods, Latest Styles, and Best Value the Market can produce.\n\n400 Kegs Fine Syrup, 150 Boxes Raisins, and 22,000 pounds, or One Car Load of Sugars, all of which are direct importations.\n\nWe especially invite Merchants, Hotel Keepers, to take our stock and compare prices.\n\nWe are agents for the Portage Milling Company. A full stock at their celebrated mill.\n\nWE SELL TOO CHEAP TO GIVE CREDIT.\n\nCOME AND SEE\n\nWHITHEAD AND WHITELAW.\n\nA SURPRISE TO BRANDON!\n\nFall & Winter Goods,\n\nNew Dress Goods,\n\nIn French Cashmere, Cotton Melons, Costume Tweeds, Wool Plaids, Velvet Brule, Union Serge, Brocades, Combination Plaids.\n\nGrey, Colored and Fancy Flannel, extra value.\n\nAlso a full line of Ladies' Mantles and Ulsters, which you should see before purchasing.\n\nFURS.\n\nLadies' beautiful Astrachan Jackets, all at very low prices.\n\nLadies' Buffalo Coats and Fur etc., in Seal, Persian and Grey Lamb, Mink, Silver Gooney, Otter, English Seal, &c.\n\nMen's and Boys' For Coats, Caps, Gauntlets, and Leather Mitts and Gloves.\n\nA large well-assorted Stock of Boots & Shoes, Groceries, Provisions, Crockery, &c.\n\nH. CROSSLEY, 9th Street.\n\nBlood Bitters\n\nBitters\nPRIME RANGERS.\n\nBufflehead, or Black-necked Nasty Kestrel.\n\nThere are not many instances of the prairie's most common birds of bison, hawks and elk that once \"shook the earth\" in the province. Are they extinct? No, not yet. They are in better shape than ever before, and are now an object of deep interest. Last Friday morning, a fine specimen of the rarest moose, that had been shot in the vicinity of Brandon, was found. All day long the body was surrounded by wondering crowds, who truly felt that they had seen a sight of a passing nature. There lay the last survivor of a race which, some years ago, found an asylum in the province. The animal was killed at the age of twelve years, and the greatest wonder is that it should have lived so long. It is not impossible, that his mate, a very rare species, will soon join him.\n\nMUSICAL.\n\nThe members of the L.O.A.S. have arranged for a grand concert on the evening of the 21st inst., and have secured the best talent of Winnipeg. A sufficient guarantee of the excellence of the performers is given by the fact that they are engaged to accompany the Civic Band, and will be heard in the concert hall at 8 o'clock. The programme will consist of selections from the operas of Rossini, Donizetti, Bellini, and others, as well as selections from the works of Mendelssohn, Schumann, and other composers.\n\nCIVIC ELECTIONS.\n\nThe nominations took place on Monday last, Mr. Clark Macdonald being elected. As a result, Mr. Macdonald, candidate for alderman, was nominated for the position of mayor. The election was held at the City Hall, and the result was announced by the Returning Officer.\n\nTHE WALL-PAPER EMPORIUM.\n\nNow open for inspection.\n\n48 Cases Latest Designs in Wall Papers\n\nAt prices to suit all.\n\nWholesale and Retail.\n\nW. H. Saunders, 3 Main Street, Winnipeg.\n\nUxbridge Organs.\n\nFar ahead of all competitors.\n\nMr. C. Cliffe, Brandon.\n\nUxbridge Organ Manufacturing Co., Uxbridge, Ont.\n\nFOR SALE\n\nA fine organ in excellent condition, recently purchased, and in first-class repair. Price $500.\n\nFRED ROSSBERG, V.S.\n\nDEPENDED UPON.\n\nYou can rely upon Mr. Rossberg's failure to give you a pain reliever in chemistries, medicines, patent medicines, or any other form of con-\n\ntrol. It is not only reliable but cheap.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/BRM_1884120401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11394, "total-output-tokens": 4115, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 765, 1], [765, 1175, 2], [1175, 1175, 3], [1175, 3360, 4], [3360, 5730, 5], [5730, 8792, 6], [8792, 13197, 7], [13197, 15462, 8]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]