[{"id": "debaf4929fef2ca4887cb1f0a18c2d6d64917dbe", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [✓] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Additional comments:/\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/\n- [ ] Pages damaged/\n- [ ] Pages restored and/or laminated/\n- [✓] Pages discoloured, stained or foxed/\n- [ ] Pages detached/\n- [✓] Showthrough/\n- [ ] Quality of print varies/\n- [ ] Includes supplementary material/\n- [ ] Only edition available/\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shell contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n4 5 6\nTHE CHURCH IN CANADA.\n\nJournal of Visitation\n\nTO THE WESTERN PORTION OF HIS DIOCESE,\n\nTHE AUTUMN OF 1842.\n\nTHIRD EDITION.\n\nLONDON:\n\nPrinted for\n\nSOCIETY FOR THE PROPAGATION OF THE GOSPEL;\n\nSOLD BY\n\nIVINGTONS, ST. PAUL'S CHURCHYARD AND WATERLOO PLACE;\nBURNS, PORTMAN STREET; HATCHARDS, PICCADILLY;\nT. B. SHARPE, SKINNER STREET, SNOW HILL;\nAND BY ALL BOOKSELLERS.\n\n1846.\nPREFACE.\n\nThe Journals of our Colonial Bishops will form the best materials for the History of the Church in their vast dioceses. Several of them are to be found in the Annual Reports of the Society for the Propagation of the Gospel. That which is now published was considered too long to be inserted in this year's Report, yet too interesting to be abridged; it is therefore now printed in a separate form. The following passage from the Bishop of Toronto's Primary Charge in 1841, contains a summary of the previous history of the Canadian Church:\n\n\"The history of the Church in this Diocese, though doubtless resembling that of many other colonies, is not without peculiar interest. For many years after its first settlement, as the favourite asylum of suffering loyalty, there was but one Clergyman of the Church of England within its extensive limits. This highly revered individual came into the Diocese in 1786, and settled at Kingston, in the midst of those to whom he had become endeared in the days of tribulation,—men who had fought and bled and sacrificed all they possessed in defence of the British Constitution,—and whose obedience to the laws, loyalty to their Sovereign, and attachment to the parent state, he had warmed by his exhortations and encouraged by his example. The Reverend Dr. Stuart may be truly pronounced the father of the Church in Upper Canada, and fondly do I hold him in affectionate remembrance. He was my support and adviser on my entrance into the ministry, and his steady friendship, which I enjoyed from the first day of our acquaintance to that of his lamented death, was to me more than a blessing.\"\nIn 1792, two Clergymen arrived from England; but so little was then known of the country, and the little that was published was so incorrect and so unfavourable, from exaggerated accounts of the climate, and the terrible privations to which its inhabitants were said to be exposed, that no Missionaries could be induced to come out. Even at the commencement of 1803, the Diocese contained only four Clergymen, for it was in the spring of that year that I made the fifth.\n\nIt might have been expected that, on the arrival of the Right Reverend Dr. Fountain, the first Lord Bishop of Quebec, the Clergy would have rapidly increased; but, notwithstanding the incessant and untiring exertions of that eminent prelate, their number had not risen above five in Upper Canada so late as 1812, when it contained upwards of 70,000 inhabitants. In truth, the Colony, during the wars occasioned by the French Revolution, seemed in a manner lost sight of by the public.\n\nFrom this period, the prospects of the Church in Canada have steadily brightened. In 1819, the Clergy in this Diocese had increased to ten. In 1825, they had arisen to twenty-two,—in 1827, to thirty,—in 1833, to forty-six,—and our numbers have now reached ninety.\"\n\nThe official list recently sent home by his Lordship contains the names of 102.\n\nCanada West is divided into 324 townships, each of them averaging an area of 100 square miles—but in 80 of them only is any Clergyman to be found. The entire population of the Province exceeds 500,000, and is rapidly increasing. Nearly 40,000 persons went out to settle there in the year 1842. Being for the most part poor agricultural labourers, they are in a great degree dependent upon their fellow-countrymen at home for the means of public worship, and of education for their children; and those who shall contribute to supply this want, may be the instruments, under a gracious Providence, of maintaining the cause of undefiled religion among a people destined to become the founders of a great and populous empire.\n\n79, Pall Mall,\nChristmas, 1843.\nI LEFT Toronto on my western tour, on the 19th of July, intending first to proceed to the Manitoulin Island and Sault St. Marie, in company with Colonel Jarvis, the chief superintendent of Indian affairs, who was about to distribute the Indian presents. Our party consisted of eleven gentlemen, among whom was that estimable and accomplished nobleman, Lord Morpeth. The day of our departure was excessively hot, and the roads, after a long and severe drought, were very dusty; but the beauty and improvements observable in the country through which we passed amply repaid for these temporary inconveniences. The whole line of Yonge Street evinced a great progress in agricultural cultivation, and the many spacious houses, and even elegant country seats, which meet the eye, proved that wealth as well as comfort had rewarded\nthe industry of the settlers. The well-supplied market of Toronto attests the fertility of the surrounding townships, and no town on the continent can boast a more thriving \"back country.\"\n\nLAKE SIMCOE.\n\nOn the 20th of July we reached the Narrows at the farther extremity of Lake Simcoe, which is a beautiful sheet of water, and the most elevated of all our inland lakes. The banks are in general high; cleared patches presenting themselves here and there, and promising in time, from the fertility of the soil, a large and wealthy population. At the Narrows, a missionary of the Church of England is stationed, the Rev. John McIntyre, who appears to be giving much satisfaction to those among whom he ministers. Many of the members of his congregation are persons of great respectability and intelligence, and consist chiefly of emigrants recently arrived from the mother country. This station was formerly the site of an Indian village; but a few years ago the chief, Yellow Head, and his tribe, removed across the bay to Rama, leaving their houses empty and useless. A lease has been obtained of the Council Chamber, which has been converted into a church of sufficient dimensions for the present congregation, and otherwise very commodious, while the house of the chief, which has also been secured, forms a very excellent parsonage.\nThere are now three clergymen on the north side of Lake Simcoe; a small number when we consider the extensive tract of country which is committed to their charge, but unhappily the full complement, when compared with the supply of clergymen throughout the diocese at large.\n\nPENETANGUISHINE.\n\nOn the morning of the 21st, we crossed the Portage in waggons, a distance of fourteen miles to Coldwater, where we embarked in canoes, and reached Penetanguishine before sunset. I lodged with the Rev. George Hallen, the missionary at this place, a good and pious man, and very attentive to his duties. He is surrounded by a very fine and united family, from all of whom I experienced the greatest kindness during my stay. Finding that we were likely to be detained three or four days, I acceded to the request of Mr. Hallen and Captain Moberley, R.N., with others of the congregation, to consecrate the church, which was just finished; and this impressive ceremony was accordingly performed on Sunday, the 24th. The holy sacrament was administered on the occasion, and it was pleasing to me to observe that Colonel Jarvis the superintendent, Lord Morpeth, and a young gentleman of the party, were among the communicants.\nMANATOULIN ISLAND—LAKE HURON.\n\nOn the 26th we left Penetanguishine, and reached the Manatoulin Island, on Saturday, the 30th. The weather, with the exception of one night, was very favourable. About five o'clock in the afternoon of Friday, the 29th, it began to rain heavily, and to blow strong, so that the lake soon became too rough for the canoes. We therefore hastened to a group of rocks, called Foxe's Islands, on which we landed with some difficulty, about six o'clock, the rain now pouring down in torrents. It was found not a little difficult to select places for pitching our tents, the rocks being everywhere so rough, precipitous, and uneven, and no soil into which the pegs could be driven. In this emergency, we contrived to hold the tents erect, by placing large stones on the ropes or cords, in lieu of pegs driven into the ground; but in this arrangement there was not a little danger, should the wind increase, of both tents and inmates being blown into the lake. The storm becoming more furious, I got my tent removed to a position of greater security in a lower spot, and having the shelter of a few scrubby trees growing out of the fissures of the rock. The party dined in one of the tents; and, notwithstanding the terrible war of the elements without, we were both thankful and cheerful. The rain and wind continued with increased violence during the greater part of the night, and the water found its way into my tent,\nbut fortunately a hollow place in its centre served for a sort of reservoir, from which many buckets of water were emptied in the morning. To sleep was out of the question; for, besides the water running into the tent, the vehemence of the storm drove the rain through the canvass, and I was obliged, even under this shelter, to resort to the protection of an umbrella, to prevent my being thoroughly wet. Several casualties happened during the night, rather of a ludicrous than serious nature; three of the tents were blown down, and the inmates, after extricating themselves from the wreck, had to grope about in their night-clothes, (for it was very dark,) with great caution, exposed to the wind and rain, till they found some one of the other tents which withstood the storm. Early in the morning, the whole party assembled around a large fire to dry themselves, and recount the adventures of the night, which were, on the whole, a source of great amusement. About seven o'clock the wind and rain abated, and the lake became sufficiently calm for the canoes to proceed, and by eight o'clock we were all on the way. Our encampments in the evening were not a little picturesque; nine tents were pitched, and as many fires lighted up; the canoes were all drawn ashore, and commonly turned over. Groups were seen around each fire, and as the darkness increased, shadows were flitting from place to place, while some of the men were seen rolled up in their blankets, and sleeping on the bare rock. Our party never dined till we stopped for the night, which was\noften as late as nine, and once or twice after ten o'clock. The table-cloth was spread on the smoothest part of the rock that we could find, and the guests squatted round in Eastern fashion, with candles or lanterns, according as it was calm or windy, to illuminate the part. During the day we made only one halt of any duration, and that for breakfast; any other stops were but momentary, a few minutes to rest, or to enjoy some beautiful or interesting prospect. For this meal a convenient spot was usually chosen, and while it was preparing, the young gentlemen of the party generally amused themselves bathing. The islands of Lake Huron are exceedingly numerous; indeed but for them it would be very difficult for canoes to navigate its waters. They extend many miles from the coast into the deep lake, and present thousands of the most beautiful channels imaginable, often like a long line of a highly finished canal, and though sometimes a little sinuous, they do not add much to the length of the journey in passing up and down this inland sea, while almost in all cases they become an effectual protection against storms. It is indeed seldom that a canoe, frail as it is, becomes storm stead, unless it be when passing along the outer range of islands, or at the few openings to the mainland. Most of the islands possess something of solitary beauty, some are entirely without any trace of vegetation, others have a few shrubs, and a few stunted trees of the fir genus; again, you see them apparently well wooded till you come near, when you find the trees very\nmuch scattered, of small height, with scarcely any earth, the bare rock everywhere visible, and the roots dug into the seams and crevices for a scanty and miserable nourishment. Most of the islands produce flowers and mosses, and no two of them are alike.\n\nGeologists affirm, that so soon as the slightest vegetation commences, it becomes merely a question of time when the soil arising from the annual decay of the increasing vegetable kingdom shall be sufficient to yield subsistence to man; the period, however, must be very distant when the rocks on the north and eastern shores of Lake Huron and the Thirty Thousand Islands, which they embrace, will be fit for agricultural operations.\n\nOn the first night of our encampment, I discovered that one of our canoes was manned by converted Indians from our mission at the Manatoulin. Before going to rest they assembled together, sung a hymn in their own language, and read some prayers which had been translated for their use from the Liturgy. There was something indescribably touching in this service of praise to God upon these inhospitable rocks; the stillness, wildness, and darkness, combined with the sweet and plaintive voices, all contributed to add to the solemn and deep interest of the scene. I felt much affected with this simple worship, and assisted in conducting it every evening until we reached the Manatoulin Island.\nWe arrived at the island on Saturday, the 30th of July, before sundown, and I accepted the cordial hospitality of the Rev. F. A. O'Meara, our missionary. This gentleman devotes his whole time to the instruction and conversion of the Indians, and for this purpose he has three services every Sunday, two for the Indians and one for the whites. On the 31st the service for the whites commenced at ten o'clock, and after the morning prayer I preached. At twelve o'clock there was a second service for the Indians, whom I addressed, through the interpreter, at some length. I baptized two children, and the services were conducted with great order and solemnity, and apparently had a great effect. Nearly four hundred Indians were present, some of them well dressed and clean—they require a church very much, and measures must be taken to get one built. The whole week was spent in preparing the candidates for confirmation, and endeavouring to convert some of the heathens who had congregated in great numbers to receive presents; for this purpose, besides private conferences, there was service every afternoon.\n\nOn Sunday, August the 7th, after morning prayer to the whites at ten o'clock, I preached a second time; and as the school-house was too small, we adjourned to a large store-house belonging to government, in which a very great number of Indians\nassembled, many converts, but many more, no doubt, from curiosity. Mr. O'Meara read the greater part of the church service, which has been translated into the Ojibaway language. I then addressed the congregation through my interpreter, and proceeded to the confirmation, which I caused to be explained sentence by sentence; this being done slowly and deliberately, so that all could understand, I administered the rite of confirmation to forty-four Indians and five whites. The confirmation service being concluded, I again addressed them at some length, through my interpreter, upon the great responsibility which they had undertaken; and this being finished, we proceeded with the holy communion. The service, from the necessity of an interpreter, was long, but it was solemn and interesting; and no person of a right mind could have witnessed it, and heard the plaintive and beautiful singing of the sons and daughters of the forest, without being deeply affected. I confess that I was nearly overcome by the bright promise of this day's service, and I felt with becoming gratitude to God, that the miserable condition of the long-neglected Indians of this country would now be ameliorated through the medium of our Holy Catholic Church. At this mission a church is much required, for the converts are rapidly multiplying, and the school-house, though very suitable for its purpose, is now too small for the number that usually attend public worship. It is, however, believed, that the want of a church will soon be supplied by a handsome structure of substantial\nmaterials, and large enough to accommodate the probable augmentation by conversion and natural increase for many years. An excellent school is in operation, under Mr. Burkitt; and although the attendance of the children is not very regular, yet their general progress is very considerable, and their parents manifest a strong desire that they should have the benefit of the same instruction as the whites.\n\nDISTRIBUTION OF PRESENTS TO THE INDIANS.\n\nThe number of Indians who were assembled at the Manatoulin Island this year to receive presents, exceeded six thousand, a greater number than on any former occasion. The majority are still Pagans; of the Christians, some belong to the Church of England, others to the Church of Rome, and a few to the Methodists. A considerable portion consists of half breeds of French and Indian extraction, and these being all Romanists, possess a good deal of influence among the natives; and from their continual intermarriages, they acquire for the Church of Rome a very considerable advantage, an advantage which we can believe to be increased by the imposing character of her ceremonies and forms. Still we have much reason to be thankful for the progress of the Church of England at this spot; and there is encouragement in perceiving that with these simple children of the forest there is a strong inclination to adopt the\nreligion of their great mother, the Queen, should they turn from their present superstitions. Of the six thousand Indians, including women and children, who were assembled at the Manatoulin Island, a large portion, perhaps two thousand, live within the boundaries of the United States; and, if to these we add the converted Indians, we shall have scarcely three thousand who are unconverted residing within the British territory; and these are scattered along the banks of Lakes Huron and Superior, and the Lake of the Woods, and some even as far north and west as the Red River. While thus scattered, and not living in bands, but by single families, or at most two or three families, and never remaining long in one place, it is next to impossible to afford them Christian instruction. Deeply sensible of this, Sir Peregrine Maitland, when governor of the province, endeavoured to collect them into villages, and had made some progress in this good work before he resigned his government. The intention of this excellent and pious officer was to place in every village a missionary and schoolmaster of the Church of England, a farmer, carpenter, and blacksmith, and by a diligent course of instruction, to wean them from their erratic life, and give them an acquaintance with farming and the more useful mechanical arts. This plan was followed up by Lord Seaton, who likewise evinced a strong feeling in favour of the Indians, and was anxious for their civilization; but there were many difficulties to encounter; and, under the most favourable arrange-\nments, it will be found that the collecting of Indians into villages must be the work of time. The late disorders in the province necessarily interrupted this, as well as other improvements; but now it is hoped the good work will be resumed with redoubled vigour, and better prospects of success. Until the Indians are collected together, comparatively little can be done towards the amelioration of their condition; and now that they have begun to be convinced by the scarcity of game, that they can no longer live by hunting, they will be the more easily persuaded to adopt the habits of civilized life.\n\nAlthough the number of Indians was so great, nothing could exceed the peace and good order which universally prevailed. No liquors were allowed them. There was no violent excitement of any sort; and, while alive to their own importance, they were exceedingly civil; quiet, and docile. I am persuaded that the same number of whites would have, under the same circumstances, been troublesome; but the poor natives of the lakes and forests were as discreet and submissive to half-a-dozen of officers, as well trained children to their parents.\n\nAll this I attributed in a great degree to the judicious and firm arrangements of Colonel Jarvis, the chief superintendent of Indian affairs, a gentleman who unites in himself, as I believe, far beyond any other person in the province, all the qualities which are most essential to the proper discharge of the\nvarious and important duties of his high and responsible office.\n\nSAULT ST. MARIE.\n\nWe left the Manatoulin Island on the afternoon of the 13th of August, and arrived at the Sault St. Marie a little after sunset, on Monday the 15th. On Sunday the 14th, service was held in a very beautiful island, covered with trees and shrubs, juniper and rose bushes, and many wild flowers. A clean smooth rock overhanging the lake was chosen for the place of worship, which possessed besides the advantage of a free air, (the day being very hot,) that of being distant from a fire which was rapidly spreading, by means of the dry moss, over the island. Those present manifested the greatest attention, and all appeared to be struck with a deep feeling of the solemnity of the scene, and of the wisdom of the provision which called upon them, in this wild and romantic corner of the earth, to pause upon their journey, and to worship their heavenly Father through his Son Jesus Christ. The river which unites lakes Huron and Superior is not so fine as the Niagara or the Detroit Rivers, nor are the rapids of St. Mary equal to those of the St. Lawrence; yet there is a wildness in the surrounding scenery which is not a little striking. There are at present too few Indians at St. Mary's and in the neighbourhood, to justify the establishment of a\nmission, and it is hoped that these few will be induced to join their brethren on the Manatoulin Island.\n\nOn the 21st of August, divine service was performed in the mission church, and about fifty persons, including our party and some Indians and half-breeds, all well dressed and decorous, were present. On this occasion I baptized two children, one of whom was called \"Howard,\" after Lord Morpeth. As time was pressing, I felt it necessary to separate from the party with whom I had spent so many pleasant days, and in whose company I had experienced the greatest satisfaction. Lord Morpeth is a most estimable character; kind, courteous, and considerate; and it is truly refreshing to find a person of his great abilities, and high rank, so sincerely devoted to religion, and at the same time so amiable and unassuming. His lordship gained the goodwill and esteem of every person who had the good fortune to make his acquaintance; our party in a manner idolized him. In regard to Colonel Jarvis, nothing could exceed his kind and frank affability to all, while to me his attentions were most unremitting and affectionate.\n\nOn the evening of the 24th of August, we reached Michellemackemac, a most beautiful island; and the following day we spent in visiting what was most worthy of observation, viz. the old fort, the turret rock, and the arch bridge. The rock consists of one stone ninety feet high, standing upright in the shape of a nearly round tower, and the arch bridge\nlooks like an immense window in the rear of an ancient cathedral. We received much kind attention from the chaplain of the garrison, the Rev. Mr. O'Brien, who went round with us to point out everything worthy of inspection. The garrison was in excellent order, and very neat; and Capt. Scott, the commandant, was very courteous and affable, and amused us with some details of his hunting exploits, in which he particularly excels.\n\nOn the 26th of August we embarked in the steamer \"Bunkers Hill,\" and landed on the following day at Sutherland's wharf, in the township of Moore, on the River St. Clair. Here we were met by the Rev. A. Pyne, who has charge of Moore and Sarnia. We were entertained at the house of this gentleman, and I was much gratified to find that his mission was in a most flourishing state. On the 28th, a confirmation was held in the church, which is a very neat brick building, and which was erected in a great measure through the bounty and exertions of Mr. Sutherland, (after whom the village is named,) aided by the great Church Societies whose beneficence marks every part of the diocese. The church was just finished, and would have been consecrated but for the absence of Mr. Sutherland, who was on a visit to Scotland, and had not left the deed of the land on which the church is built. Twenty-seven young persons were confirmed; and in the afternoon we drove six miles to a neat church built by Mr. Talfourd, where I preached to a small congregation. In the morning, at Sutherland village the congre-\ngation was large, and the candidates for confirmation appeared to be well prepared, and aware of its great importance, as well as of the responsibility they were now assuming. Our mission at Walpole Island, owing to the misconduct of the interpreter, and other causes, has not yet succeeded according to our hopes; but from the arrangements in progress, there is reason to anticipate a speedy and effectual change for the better. I had much conversation with Mr. Keaty, the superintendent of the Walpole Island Indians, a gentleman of great intelligence and ability, anxious for the improvement of the Indians, and from whom the greatest and most efficient assistance may be expected in rendering the Walpole mission effectual. The Indians of the Sable River sent me a deputation, soliciting in the first place a schoolmaster, and by and by a missionary, expressing their firm adherence to the Church of England. The deputation was very interesting, and the speeches characterised by deep feeling. Just as we were departing, the principal chief of the Walpole Indians came to visit me; but no interpreter being at hand, we had very little conversation. I could, however, gather from what was said, their readiness to receive a missionary kindly, and also their anxiety to have a good school for the education of their children. All the Indians, in short, with whom I had any intercourse, expressed the same anxious desire for the instruction of their offspring.\nSANDWICH—AMHERSTBURGH—COLCHESTER.\n\nOn the 30th of August we arrived at Sandwich, and were kindly received by the Rev. T. E. and Mrs. Welby. This mission is in a very healthy and flourishing condition. On the 31st, forty-three young persons were brought forward for confirmation. There was a very good congregation for a week-day, and the candidates seemed aware of the importance of their public profession of truth. In the afternoon we proceeded to Amherstburgh, and were overtaken by a severe thunder-storm, which impeded our travelling, and made it rather late before we reached the place of our destination. On the 1st of September a confirmation was held at Amherstburgh, which is under the pastoral care of the Rev. F. Mack, and eighteen candidates, all very interesting young persons, were admitted to that apostolic rite. This mission at my last visit was very backward; but I am happy to believe that it is rapidly approaching to a more healthy condition. In the afternoon we proceeded to Colchester, where the congregation was waiting. This mission has much improved since I was last there; the congregation has greatly increased; the church has been put in good repair; and proofs appeared on all sides of the acceptable and increased exertions of the missionary, the Rev. F. G. Elliott. Twenty-two persons were confirmed. At Colchester, I was the guest of Major Lachlan, a gentleman of great\nintelligence, surrounded by a most interesting family, by all of whom I was treated with much kindness and respect.\n\nOn the 2d of September we returned to Sandwich, from whence we were to be accompanied to London by the Rev. Mr. Welby; but unhappily the illness of his child prevented him from fulfilling his intention; and, what increased the disappointment, I was deprived of the company of Bishop McCoskry, of Michigan, who was to have accompanied Mr. Welby to London. I very much regretted not being able to cross to Detroit River, that I might pay my respects to the Bishop of Michigan; but my appointments compelled me to proceed to Chatham without delay.\n\nCHATHAM—DELAWARE.\n\nOn Saturday, the 3d of September, it rained heavily all the morning, but nevertheless we proceeded to Windsor to join the steam-boat; but here we had to remain several hours before she made her appearance,—long enough to have gone over to Detroit and visited Bishop McCoskry, had the weather been more favourable and the delay of the steam-boat anticipated. We left Windsor at twelve o'clock, and reached Chatham, sixty miles, as the sun was setting. We met the Rev. W. Hobson on the wharf, who accompanied us to the best hotel. Chatham appears to prosper and increase, but it is matter\nof complaint that the present church is too far from the busy part of the town, and a great desire is manifested to build another in a more convenient position. On Sunday, the 4th, there was an excellent congregation, and twenty-seven were confirmed. An afternoon service was also given, which was pretty well attended, and, on the whole, Mr. Hobson's exertions appear to be yielding very satisfactory fruit.\n\nOn Monday, the 5th of September, we proceeded to Delaware, fifty-eight miles, which we reached early in the afternoon. Here I found both the white and Indian Missions of the Rev. R. Flood in a very flourishing condition. On the 6th, a deputation from the farther part of Caradoc requested assistance towards building a church, and I promised to apply in their behalf to the Society for Promoting Christian Knowledge. As it was a week-day, and in the very midst of harvest, the congregation was not numerous, but attentive and devout. Thirty-two persons were confirmed. In the afternoon we rode to Muncey Town, Mr. Flood's Indian Mission, distant fourteen miles, a mode of travelling to which I had been for a long time unused, but which the state of the roads rendered necessary. There are two villages, Muncey and Chippaway, close to each other, and the interpreters were desired to go round and warn the Indians of both that there would be service next day.\nBAPTISM OF AN INDIAN CHIEF.\n\nOn the 7th of September, Wednesday, the Indians assembled in great numbers: it was a great day. The great Chippawa chief Cunatuny was to be baptized and confirmed. In the two villages there are still several pagan Indians, and yet they, as well as the converted, attend the services of the Church. While they continue pagans, they paint their faces and refuse to kneel. The conversion, however, of the great chief is expected to operate most favourably, and from their love of truth, stronger it is said among the Indians than among the Persians of old, it is anticipated that they will be readily impressed and permanently retained. When some doubts were expressed as to my coming, the Indians exclaimed, \"What, is he not the chief of the Church?—he never can have two words—he is sure to come.\" The school-house, though large and commodious, could scarcely contain half the number assembled, and those that could not get in, stood in groups about the door and windows. The chief was baptized, and appeared well acquainted with the nature and importance of the holy sacrament. He was, after baptism, confirmed with four others. His admission into the Church, by the sacrament of baptism, and his public profession of the faith in coming forward for confirmation, had been with him, for years, matter of deep and solemn consideration. After the service, I shook hands with every individual\npresent, according to the custom of the Indians at all their meetings.\n\nLONDON—CHURCH SOCIETY.\n\nHaving taken horse again for Delaware, and dined with Mr. Flood, we proceeded the same evening in a strong waggon to London, where we arrived between seven and eight o'clock. We drove up to the residence of the Rev. Benjamin Cronyn, and I was highly gratified to find sixteen of my clergy, who assembled from their several missions in order to be present at the great Church Society Meeting, which was appointed to be held on the following day, for the establishment of a district branch of that noble institution. On Thursday, September 8th, divine service was held at ten o'clock, and twenty-six persons were confirmed. The day was unfavourable, yet the congregation was good and highly respectable. After service, I adjourned with my clergy to the courthouse, which was soon filled to overflowing, and where a public meeting was held. The proceedings were highly satisfactory—the resolutions were passed unanimously—many excellent speeches were delivered, and every promise was afforded that a most effective branch of the Church Society was now formed. The Rev. R. Flood brought with him two of the Indian chiefs, who gave something of novelty as well as interest to the meeting. One was the chief who had been baptized and confirmed on the\nprevious day, the other a famous warrior, and nephew to the great Tecumseh; both persons combining with other causes, to attest the devotion of Mr. Flood to his various duties.\n\nSeptember the 9th, having arranged my subsequent appointments for confirmation, and sent them to the Church newspaper for publication, I proceeded to Goderich, which we reached about eleven o'clock at night.\n\nGODERICH.\n\nThe congregation at Goderich are building a large and commodious brick church, which will be a great ornament to the town, and a striking and agreeable object from Lake Huron, which it overlooks. The site has been very tastefully selected on the high bank of the River Maitland, and commands a view, not only of the valley through which the stream meanders, and of the harbour, but also of a vast expanse of the noble Lake Huron. From the church door, on a summer evening, the sun may be seen as from the mast-head of a ship on the ocean, setting in glorious splendour in that inland sea. Towards building the church, the Canada Company have, through their commissioners, given a very handsome donation; this, with a liberal gift of 100l. sterling from the Society for the Propagation of the Gospel in Foreign Parts, untiring in its benevolence, and the generous contributions of the people, will, it is\nbelieved, be nearly sufficient to complete the sacred edifice. With respect to the Diocesan Church Society, no serious movement has yet been made in this large district. It contains as yet only two clergymen. The population is much scattered, and they may in general be considered as beginners in the work, so arduous to new settlers, of cultivating the soil—nevertheless, the promise in spiritual things is cheering. The field, now so vast, will soon, we trust, receive an accession of spiritual labourers to sow the seed and gather the fruits. In the meantime the two missionaries, who being distant from each other, and separated from their brethren in other districts, seemed at first disheartened, have been encouraged to make the attempt to forward the objects of the Diocesan Society, and they are urged on by the munificence of a few individuals, who have thus early got a footing in this fertile district. It may confidently be asserted, that there is no instance in which a vigorous effort and patient perseverance, however barren and unpromising the field may to all appearances have been, will not realise the justice of the prophet's admonition, not to despise the day of small things. Human pride has perhaps not a little to do with the discouragement which is felt at the contemplation of a slender beginning in any enterprise of piety—the eye wanders from the comparatively sterile spot to some scene, perchance, of luxuriance and abundant fruit, and it is pained by the contrast; but the sentiment of doubt and dismay should be checked by the recollection of what our\nblessed Saviour tells us, that \"the least of all seeds\" becomes, by careful nurturing, a wide spreading tree, in whose branches the fowls of the air may find shelter. It is very pleasing, in connexion with these observations, to remark, that of the population of this district, nearly one-half belongs to the church of England.\n\nSunday, Sept. 11.—This proved a most unfavourable day, heavy thunder and showers succeeding each other almost without intermission, and the lightning so violent and near, that a haystack was set on fire at a short distance from the temporary church in which the congregation had assembled. The number collected, notwithstanding the badness of the weather, was very considerable, and twelve candidates were presented for confirmation, by the Rev. R. F. Campbell, the minister of the parish. Many of the young persons, however, who had been prepared, were prevented from attending in consequence of the heavy rain, as the members of the church are scattered over a considerable extent of country, and it is also in its infancy, and a confirmation was held here only two years ago. The responses were more frequent than is often met with, and the service was devoutly joined in—evidences of the careful teaching of the missionary. The same care was manifest in the pious deportment of the candidates for confirmation, and the becoming sense by which they appeared to be actuated of the solemnity and responsibility of the service in which they were engaged.\nGoderich is the most westerly town at present in the diocese, and possesses a very commanding situation on a lofty bank near the mouth of the river Maitland, from which there is a most extensive view of Lake Huron, as well as of the adjacent country. It is very healthy, not only on account of its elevated position, but from its delicious water, fine springs being found in almost every street. The town will soon boast a spacious and excellent church; it has already a large and convenient gaol and court-house, and a good harbour has been constructed at the expense of the Canada Company. It stands in the midst of a fertile country, to the rapidly increasing produce of which it is the most convenient outlet, and which, owing to the judicious arrangements, and liberal measures of the Canada Company, is fast filling with settlers. Goderich gives many indications of future prosperity, and must, at no distant period, be the seat of a large population.\n\nOn the morning of the 14th, we were on our way back to London, by four o'clock, and notwithstanding the great quantity of rain which had fallen during the last few days, the roads, thanks to the Canada Company, were not deep, and London, a distance of fifty-eight or fifty-nine miles, was reached by eight o'clock in the evening.\nLONDON.\n\nThursday, Sept. 15.—To avoid the inconvenience of frequent changes and the impositions often practised, when a conveyance is required suddenly or on any unexpected emergency, I considered it most desirable to engage by the day, for the remainder of my journey, a man with a common farmer's waggon, strongly built, and a stout pair of horses. After breakfast, we drove to the principal station of the Rev. C. Brough's missions in the township of London. I found the church much improved since my last visit, two years ago, and the congregation which assembled on the present occasion was large, and devoutly attentive to the services. Twenty-two persons were presented by Mr. Brough for confirmation, and they, as well as the spectators, appeared much affected with the ordinance. The interest thus excited was not, I trust, of a transient character, but through the Divine blessing aiding the faithful monitions of their pastor, likely to be attended with abundant and permanent fruit. About two years ago, Mr. Brough was removed on account of the health of his family from the Indian Mission on the Manatoulin Island, to the second rectory in the township of London; and he has carried with him to the new scene of his labours that active and untiring energy which rendered him so useful among the native Indians. His different congregations are rapidly increasing, and a love for the Church and her\nedifying and beautiful ministrations is extending on every side. Mr. Brough has the advantage of an excellent parsonage and glebe, tastefully situated on the banks of the river Thames, about three miles from the prosperous town of London, to which, on account of its rapidly growing population, the labours of the Rev. B. Cronyn, its worthy and zealous rector, are now in a great measure confined.\n\nADELAIDE.\n\nHaving breakfasted early on the morning of the 16th, we proceeded to the township of Adelaide; but, on account of the roughness of the roads, we did not reach the residence of the Rev. D. Blake, its kind and amiable minister, until four o'clock, p.m. The township is very level, especially along the line of road; and this has compelled the inhabitants, as a common provision in this new country against the effects of wet weather, to cover large portions with logs, rendering it of all others the most disagreeable and fatiguing species of road to travel upon, especially in a heavy waggon without springs.\n\nSoon after our arrival at Mr. Blake's, the Rev. Arthur Mortimer, a promising young clergyman, and son of the excellent rector of Thornhill, came in from the adjacent township of Warwick. He stated that the late heavy rains had carried away all the bridges on the road from Adelaide, and that it was otherwise so broken up as to have become very\ndangerous; that at one place there was no other way of crossing a deep but sluggish stream than in a small canoe, which was very unsafe, and could take one person only at a time with the ferryman, the passenger being in danger every moment of upsetting. In consequence of these difficulties, Mr. Mortimer inferred that it was impossible for me to reach Warwick; and his mission being new, and having but few fit for confirmation, he had requested them to come to Adelaide. Sensible that Mr. Mortimer had acted with the best intentions, I acquiesced in this arrangement, but with reluctance, because the appointment to Warwick was on Sunday, when there would have been a very general assembly of the people, and an opportunity would have been afforded me of conferring personally with them in reference to building a church, and other matters affecting their spiritual interests. After Mr. Mortimer had finished his sad tale of difficulties, I reminded him, with a smile, that, if he and his candidates could come from Warwick to Adelaide, his Bishop, who had traversed the province from its early commencement, could have gone from Adelaide to Warwick. It was, however, too late to return to the first arrangement.\n\nThe services at Adelaide were, from their number and character, particularly impressive. The church was consecrated, six adults were baptized previous to their being confirmed, and thirty-one persons were brought up by Mr. Blake for confirmation. Of the six adults, three believed that\nthey had been baptized by dissenting preachers or laymen, but not from any impending necessity, and they had become anxious to be regularly admitted into the Church. They stated that they had reflected long and seriously upon the subject, and though for some time they felt a great unwillingness to state their doubts, and apply for valid baptism, yet the more they thought upon it the more important the question seemed, and the more they were convinced that they were not regularly engrafted into the Church of Christ, and therefore not fully entitled to its covenant privileges. In this perplexity of mind, they had very properly recourse to their clergyman; and after receiving his counsel or instruction, they resolved to await the Bishop's arrival, and solicit him to admit them by baptism into the Church. Under these circumstances of doubt and distrust, I administered to them the sacrament of baptism, under the condition which the Rubric has wisely provided: \"If thou art not already baptized, I baptize thee, &c.\"\n\nSunday, 18th September, I preached for the Rev. B. Cronyn, to a very large congregation in the town of London, being happy to afford him some little respite from his labours, which, what with the troops (two regiments being stationed here) and the duties of his increasing parish, are almost incessant. London is a fair specimen of the rapidity with which towns rise and advance in a new country; a few years ago, it could scarcely be called a village, but now it is a large and increasing town, with several\ngood streets, and well-furnished shops, in which you find not only the necessaries, but the luxuries and elegances of life.\n\nAfter an early breakfast on Tuesday the 20th, we proceeded to St. Thomas, seventeen miles, over a very bad road, and arrived there at eleven, A.M. The Rev. Mark Burnham, the Rector of the parish, and a graduate of the University of Oxford, with the Rev. D. Blake, of Adelaide, and the Rev. George Petrie, of Burford, were in attendance to receive me. Here we had also the pleasure of meeting Colonel Burwell, who has done so much for the Church. His name is already extensively and favourably known, as one of the most munificent benefactors whom we can boast of in the province. If, indeed, the more wealthy members of our communion at large would contribute to the maintenance and necessities of the Church with a similar spirit of liberality, little fear need be entertained but that it must soon become a great and influential establishment.\n\nST. THOMAS.\n\nAt St. Thomas, everything was in readiness for the appointed service—the people were assembling from the vicinity, and the village seemed to have put on the appearance of Sunday. It is gratifying to state the very prosperous condition in which I found this parish, owing to the zealous and judicious\nexertions of its exemplary clergyman. The success attendant upon his labours, latterly so very marked and striking, he ascribes, under the Divine blessing, to a more clear and earnest development on his part of the distinctive principles of the Church, the bringing her claims more fully, plainly, and decidedly before his people, as the depository of Divine truth, and the channel of heavenly grace. While he performed his duty conscientiously, with all calmness and zeal, as a minister of Christ, but without bringing forward prominently the government, order, and peculiar excellences of the Church, the necessity of communion with her, by those who expect the privileges and blessings of the Redeemer's sacrifice, matters went on with regularity, and smoothness; his people were decent and discreet in their Christian walk, but they seemed scarcely conscious of any difference between themselves and the sectaries around them. It was not till he pointed out distinctly and emphatically, the nature and privileges of the Church, her close resemblance to the apostolic pattern, the many important and decided differences between her and other \"Protestant denominations,\" that his congregation began to feel that they were a distinct and privileged people; that the matters in which they differed from others were not of small, but of essential moment, and that they manifested themselves no longer lukewarm in her service, but ready to contribute with their substance, as well as by their example, to the advancement of her holy cause. The change, indeed, so justly ascribed to\nthese causes, is very apparent since my last visit, two years ago; the church has been enlarged and repaired, a large and commodious school-house has been built, in which religion forms the basis of instruction, and the distinctive principles of the Church are impressed upon the minds and hearts of the rising generation. Mr. Burnham, with the ingenuousness which always accompanies true piety as well as superior abilities, confessed that he was afraid at first to bring forward, in a very direct or formal manner, the distinctive features of our church polity and order, and that even after the encouragement given to him and the rest of the clergy in my Episcopal charge, at my last visitation, to conjoin instruction upon these important points, with a faithful declaration of the great truths and exhortations to the practical duties of Christianity, he still felt apprehensive of the effect of \"preaching the Church,\" as it is sometimes invidiously termed. But, feeling it his duty to make the attempt, and conducting it in that spirit of gentleness and affection which the Gospel inculcates, and the necessity of which was urged in my Charge, the beneficial results have been most rapid and striking, in a religious as well as practical point of view.\n\nHere, then, we have a proof, that the true way to succeed in any parish is to follow the order of the Church, by which means, all the leading doctrines of Christianity are brought prominently forward, while the people are instructed as to the ground upon which they stand, or ought to stand. It seems,\nindeed, a matter of positive unfairness, and dishonesty, to withhold from the people instruction upon all that concerns their spiritual weal; they have a right to be informed, not only of what constitutes the soundness of the faith, but of whatsoever also may serve to promote unity of belief, and uniformity of practice,—whatsoever may help to keep them a united body, and cause them to shun those divisions upon which every Apostle and apostolic man has pronounced so severe a condemnation. That Christian steward can scarcely be said to give every man his portion, to bring out of his treasures things new and old for the edification and welfare of Christ's heritage, if, while he is faithful in preaching a crucified Redeemer, he omits all explanation of the order, government, and discipline of that Church, which bears so near a connexion with the Saviour as to be called His Spouse, and in relation to which it is said, that they who are grafted into the Church are grafted into Him. The lawfully ordained minister of Christ may lament the religious differences which he perceives around him, and he may appeal to his flock to beware of such divisions; but they must be expected to listen to these monitions with indifference and without interest, unless a full explanation is afforded of what constitutes the distinction between order and latitudinarianism, between the apostolic rule and the inventions which men have substituted for it, between the Churchman and the Schismatic. When these points of difference are fully understood, when the members of a congregation are duly instructed\nin what constitutes the foundation of their ecclesiastical polity, when they know why they ought to prefer and adhere to the episcopal regimen, and that it is not a matter of indifference what form of church government we adopt, or under what administration sit; when they are assured that our beautiful Liturgy, according to which we worship, is not a modern creation, but compiled from holy forms and services, which can in many instances be traced up to the apostolic times; when all these things are set before them earnestly and faithfully, then may we appeal to them, in a voice of authority, to cling to the Church and to avoid those who cause divisions, because that voice will be no \"uncertain sound,\" but its purport will be well understood. In that case, too, the arts of the Dissenter will fail in their effect, and it will be found as difficult to shake the Churchman from his filial affection and devotion, as the loyal subject of the throne from his allegiance. He will not then be thrown helpless, as it were, into the religious arena, and forced to yield to the first combatant who may assail him, but he will be fortified with armour to repel the attacks of his adversaries, and put them to flight.\n\nIn the country parishes in England, especially those into which the teachers of Dissent have not penetrated, it may be thought needless by the clergy to enter into any formal explanation of the claims and principles of the Church, because the former have never been disputed, and the latter never assailed; the Church there is strong in the affections\nof the people, because no rival has ever been seen in competition with her. But shift the position of these people; transfer them, for example, as emigrants, to a transatlantic colony, where the Church holds not the same influence and preeminence, and the disastrous consequences of want of instruction in her peculiar principles are discernible at once. They are thrown, perhaps, into some spot, where the Church is only named to be vilified; and the object of their early reverence and love, through the insidious and unopposed arts of religious deceivers, becomes one at last of indifference, suspicion and hate. Against these melancholy results, the best and only precaution consists in a careful tuition in what constitutes the Church's foundation, and the ground of her excellences; fortified by these instructions, he will not be so easy a prey to those who, from selfish motives, frequently \"lie in wait to deceive.\" Here it may not be inappropriate to offer a suggestion to our brethren in the rural and other parishes in England, that they would prepare the subjects of their charge, who are about to emigrate, against such a contingency, by rendering an explanation of the claims of the Church a portion of their valuable instructions; so that going forth into the wilderness they may not face their adversaries there without shield or spear, but be ready on every point to \"give an answer to every man who asketh a reason of the hope that is in them.\"\nEMIGRANTS SHOULD BRING LETTERS\n\nCOMMENDATORY.\n\nIt may be further suggested, that, if, with such instruction, the Clergy in the mother-country would give to each parishioner, on his or her departure to any colony, a testimonial of membership in the Church, it would add much to the firmness of their profession, as well as to their comfort. It would help to maintain in their hearts an unwavering attachment to their fathers' Church, and continually remind them, that, be their lot cast where it may, they are still within the pale of that loved and hallowed communion. When landed on a distant shore, they would in that case make it their first care to seek out the pastor of that Church of which they are members, and by an exhibition of those credentials be sure to engage that pastor's watchfulness and care. As was the case in the primitive ages of Christianity, go where they would throughout the bounds of the wide world, they would, wherever a lawfully-ordained minister of the Church was to be found, meet a brother and a friend. They would be privileged to kneel everywhere at their Church's altars, and, though the land was a strange one, and its scenes and customs different, and far from those of their young and happier days, they would still experience in their place of pilgrimage the Christian sympathy, and, therefore, the richest comforts, of home.\nRELIGIOUS DIVISION.\n\nWe remark, far and wide, the prevalence of religious division, and its attendant is too frequently in this diocese a feeling of hostility to the Church of England. Both are to be lamented, and deplored; the one is almost the necessary consequence of the other. The very rights of an Institution which claims to be apostolic and divine, and the assertion of whose principles is met, in general, by no better argument than invective, is sure to create jealousy and animosity in the minds of those, who are conscious of having no foundation themselves to build upon, and who, when pressed for reasons, are compelled to acknowledgments which imply, in fact, that there is no such thing as a visible Church at all. And the very maintenance of such an Institution, is always a rebuke as well as a restraint upon the rampant spirit of division; while this spiritual citadel stands there in its strength, the advocates of religious disunion are forced to manifest more exertion in their proceedings; for to that citadel experience assures us, not a few of the sober-minded are in the habit daily of resorting, who have become tired and distressed by the discord and animosity of rival sects and parties. But we must be just in our estimate of the causes of this religious dissension, and the unprovoked hostility which is so frequently manifested towards the Church of England. The people at large have not been made acquainted with\nher tenets, and have not had a fair opportunity of observing the working of her principles; we must not wonder, then, if misconceptions should have prevailed, and that these have been deepened and extended through the selfish practices of agitators. Religious instruction according to the doctrine and discipline of the national Church, was not made to keep pace with the settlement and population of the country; no clergymen were appointed to the several townships, as they became peopled, therefore the inhabitants of those townships necessarily grew up in ignorance of the Church. And if the teachers of various forms of doctrine occupied the ground to which the lawful ministers of the Church should have been appointed, it is not likely that such ignorance should be allowed to remain a passive feeling. The moment that ground was conceived to be trespassed upon by the lawful minister, it would become a matter of expediency and interest to paint the Church in the blackest colours, and, by the most unscrupulous misrepresentations, where honest argument failed—as it ever must fail—to alienate her from every heart, and render her, if possible, an object of suspicion and dislike.\n\nSuch results cannot be wondered at; and when we fairly review their causes, it becomes us to be guarded in our condemnation of those who have admitted the prejudice, and indulged in the animosity against the Church. Of her friends, and especially of her ministers, it is clearly the duty to endeavour to disabuse them of such prejudice, and the expe-\nrience of the last few years brings the completest assurance that we have only to develop the principles and portray the excellences of the Church, to convert the assailant into an advocate—the persecutor into a friend.\n\nBut it is time to return from this long digression, and to say, that, on the occasion referred to, the congregation at St. Thomas was very large, twenty-four persons were confirmed, and my closing address to the candidates, as well as to the congregation in general, seemed to have a visible effect.\n\nAfter service we proceeded to the residence of the Hon. Colonel Talbot, twelve miles distant, and remained there for the night. The Colonel superintended the settlement of this section of the province, and now beholds fifty or sixty thousand inhabitants in the space which when committed to his charge was one dense forest, without a single inhabitant. We were very sorry to find this excellent gentleman very unwell, in consequence of over fatigue in returning from Kingston, but it is hoped, that the strength and vigour of his constitution, through the Divine blessing, will soon triumph over his indisposition.\n\nDUNWICH—ATTACHMENT TO THE CHURCH.\n\nWednesday, 21st Sept.—After breakfast we went to Dunwich, seven miles; and for so thin a population, we found the congregation very respectable.\nThe morning service ended, I preached, and consecrated the burial ground in the midst of the rain, which suddenly came on. There is much that is delightful connected with this parish; it has been for many years formed, but has increased very little, in consequence of all the neighbouring lands being in possession of persons who refuse to sell. The few families which constitute the congregation are entirely rural in their manners and habits, and manifest the strongest attachment to the Church. Of their zeal in her favour they have given many proofs, though but plain farmers, and few in number; they have erected a neat church on a plot of ten acres of land, without any assistance from other quarters: one individual, a farmer, gave 80l. towards its erection; another 60l.; while the land, and also a set of excellent books for the desk, was the donation of an aged lady of the congregation, now departed, who has left for the benefit of the Church a small legacy yet to come. The same people, animated by the spirit of true Church principles, are now preparing to build a parsonage house, as I have promised them in a short time a resident clergyman. At present the Rev. M. Burnham holds an afternoon service at this place, and has done so for many years; but the distance from St. Thomas, nineteen miles, is too great for the permanent continuance of such service; and it has also become desirable that his afternoon labours should be transferred to Port Stanley, where a population is growing up, and the distance to which is only seven miles. Dunwich is\nan excellent position for a Missionary, as the adjacent lands will now be soon in the market, and the townships west of it, along the Talbot road, abound with members of our Church who as yet have been almost entirely deprived of her ministrations.\n\nThe primitive character of the inhabitants of this spot, their devout behaviour at public worship, their affectionate attachment to the Church of their fathers, and the zeal which they have manifested already in its behalf, contributed to make this a most refreshing and gratifying visit. It is worthy, too, of grateful remark, that the cause which has served to keep the congregation of Dunwich so small, has been the means of the extension of the Church in other quarters. From the impossibility of settling their children on the adjacent lands, for so many years locked up from sale, these worthy people have been obliged to purchase farms for them westward, along the shores of Lake Erie, in the townships of Oxford, Howard, Harwich, and Raleigh; and these young persons have carried with them to their new abodes, and implanted there, those sentiments of devout reverence for the Church, and her ministrations, for which their parents have been so distinguished, and in which they themselves were carefully nurtured. This attachment and adherence to the Church on their part, under circumstances, too, of spiritual destitution, more than ordinarily painful, is worthy of the highest commendation; and nothing will give me greater pleasure, than to endeavour to reward it by supplying to them as soon as possible those minis-\ntions of which they have so long been deprived. Measures are in progress for sending a missionary occasionally among them; while the clergyman, who is soon to be settled in Dunwich, will be instructed to make frequent visits to these several townships. Having dined at Colonel Burwell's, we drove back to St. Thomas, in order that we might be enabled to keep an appointment at Richmond, in the township of Bayhum.\n\nRICHMOND.\n\nThursday, 22nd Sept.—We left St. Thomas at half-past six o'clock in the morning, and arrived at Richmond, twenty miles, before eleven o'clock. Here I was met by the Rev. James Stewart, who is supported from the funds of the \"Stewart Mission,\" and has been appointed travelling missionary in the London and neighbouring districts. This gentleman has been only a few months in the diocese; but, during that short period, he has proved himself an active and zealous labourer, and his ministrations are highly acceptable to the people among whom he labours. The village of Richmond is very favourably situated in the midst of a rich country; it is still small, and as yet has no church; and the schoolhouse, which is used as a place of worship, was found insufficient on the present occasion; many having come from a great distance, who belonged to some of Mr. Stewart's other stations. A large\nroom, therefore, at one of the inns was fitted up as well as could be done on a short notice, and this was filled to overflowing. Many of the persons present had never witnessed a confirmation, and some had never been present at the ordinary service of the Church of England, and the effect upon them of the religious ministrations of the day was obviously very powerful. I preached on the nature and character of the Church—the body of which Christ is the head—and stated the necessity, that all who desire to be saved should belong to His body, as the means by which the spiritual nourishment of which He is the source is conveyed to them. After the sermon, fifty persons were presented for confirmation, many of them advanced in life, and all appearing to be deeply affected by the beautiful and affecting ceremonial. I addressed the persons confirmed, and the congregation in general, at more than my usual length, not only on the character of the apostolic ordinance, which they had just witnessed, but also upon the excellences and purity of our Church, as well as her high claims upon all who were anxious on the subject of their eternal salvation. From the deep attention of the audience, and the aspect of their countenances, it is evident that a great impression was made.\n\nHaving partaken of refreshments at Mr. Stewart's rooms, we proceeded on our way towards Woodhouse, twenty-five miles, to Soverein's Inn, where we were glad to halt for the night. Here we met the Rev. Francis Evans, rector of Wood-\nhouse, who had, with the kindest intentions, come thus far, twelve miles, to escort me to his hospitable home, but having already travelled nearly fifty miles, in a very rough wagon, and through bad roads, and having also performed a great deal of duty, I felt too much fatigued to proceed further so late at night, it being then past nine o'clock, P.M. Mr. Evans, however, being well acquainted with the road, and anxious to make farther preparations for my reception on the following morning, returned home by the light of the moon, which was just rising.\n\nWOODHOUSE.\n\nFriday, 23rd Sept.—The church at Woodhouse was built many years ago, when the population was very thin, and its site at the time was chosen to meet the convenience of the comparatively few church-people, who were scattered throughout the neighbourhood. It is, therefore, quite in the country, and is, unfortunately, at a distance from several villages, which have since its erection started up in its vicinity. This locality of the church is now felt to be a great inconvenience; the county town, Simcoe, for instance, is nearly two miles distant, and at this spot one must of necessity soon be erected; while several other villages in the neighbourhood are in a similar situation. The congregation at Woodhouse was very respectable, and more numerous,\nindeed, than could have been expected, as many were absent at the assizes, which were then being held at the county town. Twenty-two persons were confirmed, several of whom had come, through very bad roads, seventeen or eighteen miles. Amongst the candidates for confirmation, it was pleasing to see the children of several emigrants, who had recently arrived, and retained all the freshness of attachment to the Church of their native land. Upon the conclusion of the services we returned to the parsonage, where we were hospitably entertained by the rector, and his accomplished partner, Mrs. Evans. We then resumed our journey, and drove to Brantford, a distance of twenty-six miles, where we arrived about eight o'clock, P.M.\n\nBRANTFORD.\n\nBrantford is a town but of few years standing, but has, nevertheless, attained a considerable size, and, from its favourable position, and the richness of the surrounding country, and more especially from the improvements in the Grand River, which is being made navigable to this place, it must soon become a town of considerable trade. A handsome church has been completed at a considerable expense, and another is in contemplation at Mount Pleasant, five miles distant. On the whole, the prospects of the Church at this place are promising, but, owing to the Rev. J. C. Usher's state of health, which had\nbeen very bad during the greater part of the summer, no confirmation was held. Mr. Usher, however, was said to be better, and likely to be able in a few days to resume his duties.\n\nCONFIRMATION OF NATIVE INDIANS.\n\nSaturday, 24th Sept.—From Brantford we drove to the Mohawk Parsonage, only two miles distant, where we were met by the two missionaries to the Indians, the Rev. Abraham Nelles, and the Rev. Adam Elliott. The prayers were read in the Mohawk language by Mr. Elliott, and the lessons in English by Mr. Nelles. No sermon was delivered, as it would have required to have been interpreted, and occupied too much time. Fifty-four persons were presented for confirmation—forty-nine Indians and five Whites. The church was crowded, especially by Indians of the Six Nations; the address which I made after confirmation was carefully interpreted; and, as I endeavoured to suit myself to their habits and modes of thinking, it appeared to affect them much. The whole service was particularly interesting, and many white people who were present declared that they had never been so much affected. The church stands on a beautiful flat near the river, surrounded by many cottages of industrious and well-conducted Indians attached to the mission; and contiguous to the church are schools, which are carefully visited after the services. In these schools a\ngreat number of promising Indian children, both boys and girls, are taught the rudiments of a common education, carefully founded on religious principles. Very favourable specimens of their proficiency in reading, writing, and arithmetic, were exhibited, and nothing could be more gratifying than the sight of so many of the rising generation of an ancient and warlike people, who had once commanded the greater portion of North America, receiving instruction to qualify them to read the Holy Scriptures in the English tongue, and to enable them to impart the same knowledge to others. It is a tardy, but becoming remuneration for the manifold injuries inflicted upon this unfortunate race.\n\nEDUCATION OF NATIVE INDIANS.\n\nANNEXED to the schools for boys and girls is an institution for the instruction of Indian youths, in housewifery and sewing for the latter, and in various useful mechanical arts for the former. To this institution such boys are transferred as evince a taste and desire for different trades, and the articles thus manufactured are readily disposed of as being fully as good, and somewhat cheaper than can be furnished at the shops of the best mechanics in the vicinity. We passed the night at the parsonage, which is a substantial and comfortable brick house, for which this mission is indebted to the liberality of the New\nEngland Company in London, and to which the Indians, with the sanction of Government, have annexed a glebe of upwards of two hundred acres of excellent land. The parsonage-house is finely situated on a high bank, commanding an extensive view of the valley of the Grand River, and of the canal to Brantford, now in active progress.\n\nThe missionaries at the Mohawk and Tuscorora villages, the schools of boys and girls, and the mechanic institution, besides other schools throughout the Indian settlements, with much generous assistance for other purposes, are all supported by the bounty of the New England Society already mentioned, and reflect the highest credit on that respectable body. Their exertions for the temporal and spiritual amelioration of the Indians of this diocese, merit the thanks of every Christian in the colony, and the members of the association must feel the liveliest satisfaction in knowing how abundant a harvest has already resulted from this exercise of their care and charity; and it is earnestly hoped that the happy effects which have been already manifested upon the moral condition of the Indians in these missions, will encourage them to such a farther liberality as their means may admit, in cultivating the spiritual soil, so much of which still continues waste in this vast diocese.\nTUSCORORA TRIBE.\n\nSunday, Sept. 25.—We proceeded this morning to the Tuscorora village, ten miles, the seat of Mr. Elliott's mission. The congregation was much more numerous than I expected; and, among their number, several Negro families were observed, who, it appears, have intermarried with the Indians of this tribe. This produces a singular variety of complexion among them, but it cannot be discerned that there is any feeling of difference, or that they are affected by anything like a spirit of caste. Mr. Elliott brought forward fifty-eight persons for confirmation, all of whom Indians, or blacks recognised as a portion of the tribe. My address, as usual, was communicated through an interpreter. The services being ended, the chiefs requested a council; they mentioned some religious differences which had arisen among them, and given them much pain, differences which had originated with some Indians, who had recently come from the United States, and who, it appears, had embraced the opinions of the baptists. Before the arrival of these men they had been at unity among themselves, but, since their coming, some of their friends had been deluded, and induced to forsake the Church, and they entreated my advice as to the course which they, the great majority of the chiefs, who still adhered to the Church, ought to pursue. Knowing the fierce passions of these people, and the danger of violent\nmeasures, I exhorted them to kindness and forbearance, and recommended friendly counsel to those who had wandered, impressing upon them that such charitable treatment would be the most likely means of bringing them back. At the same time, I took occasion to confirm their faith in the truths of Christianity as taught by the Church, and pointed out her superiority as the dispenser of the gospel truth, and the appointed channel of Divine grace. The Indian chiefs evinced great shrewdness in the course of this conference, as well as much quickness of apprehension in regard to the superior excellences of the Church in her doctrines and government; and there is little doubt that this partial schism will soon be at an end, and that its present existence may even conduce to the firmer establishment of apostolic order and discipline among the people. In the meantime the Divine blessing upon the labours of both these excellent missionaries to the Indians, Mr. Nelles and Mr. Elliott, is abundantly manifest. Many pagan Indians have, through their ministrations, been brought over to the truth, and every hope may reasonably be entertained that, in a short space of time, not one idolatrous Indian will remain unconverted to Christianity. In the evening of this interesting day we returned to the Mohawk parsonage.\nPARIS.\n\nMonday, Sept. 26.—We drove to the village of Paris, nine miles, and arrived before eleven, A.M. This growing town is beautifully situated on the banks of the Grand River, and a very neat stone church overlooks the stream, rolling over a gravelly bed, with a gentle current. Although the congregation on this occasion was not large, because it was a week-day, yet the Church is evidently prospering, for Mr. Morse, the missionary, brought forward twenty-two candidates for confirmation. At the time of Mr. Morse's appointment to this mission, the church-people were only few in number, but they were zealous and affectionate; and, to the spirited exertions of Mrs. Capt. Dixon, the life of whose husband may be said to have been sacrificed in the cause of his country, conjoined with the efforts of her friends in Edinburgh, and the liberal donations of the Church societies at home, the handsome church of Paris mainly owes its origin and completion. On his first arrival in Canada, the health of Mr. Morse was very feeble, having been impaired by a long residence in a tropical climate, but he is now completely recovered. He has several stations, which he regularly attends in the neighbourhood of Paris, and he is zealously assisted in his labours, especially in his Sunday-schools, by Mrs. Morse, a pious and intelligent English lady, whom he has recently married.\nBURFORD.\n\nHaving partaken of some refreshment, after the services, with Mr. and Mrs. Morse, we proceeded seven miles, to Burford, the principal station of the Rev. George Petrie, one of the Stewart missionaries,* and actively employed over an extensive range of country. There was no church, but divine service was held in a spacious school-house; it was the first time that confirmation had been held in Burford, and people had congregated from all quarters, so that the school-house was not only filled, but many stood outside at the door and windows. The evening service was read by Mr. Morse, and the lessons by Mr. Petrie, after which I preached. Fifty-seven candidates were then presented by Mr. Petrie for confirmation, many of whom were very interesting young persons, and others more advanced in life; the whole scene was very beautiful and affecting, and as it is supposed that more than half the congregation had never witnessed a confirmation,—the effect produced upon them by the present spectacle was very striking. My address to the confirmed was extended so as to embrace the whole congregation, whether belonging to the Church or not, and was said to have made a powerful impression on all who heard it. Many had come from curiosity, rather than from any religious motive, and some, perhaps, with the expectation of having their\n\n* Now maintained by the Society for the Propagation of the Gospel.\nprejudices against the Church confirmed by what they might see of her ministrations; but it is believed that all went away with strong feelings in her favour, and many confessed that they never supposed that her services and ordinances were so spiritual and so beautiful, or that her claims to purity and to a strict adherence to the apostolic model were so exceedingly strong.\n\nThe services being ended, we accepted of the kind invitation of Mr. Haywood, an intelligent Englishman, to partake of refreshments at his house. Mr. Haywood came to this province many years ago, and by his skill in farming and steady industry, has become independent and wealthy. He and Mrs. Haywood are sincerely attached to the Church, and were delighted with the services of the day. They have carefully brought up their children in our communion, though not, as they confessed, without difficulty, because, for a long time, no opportunity was afforded of joining in the ministrations of the Church, while all the strange forms of religion with which this continent is so rife, were frequently presenting their seductions. Mr. Haywood has a very fine family growing up around him, some of whom are already settled in life, and now he says his most ardent wish is likely to be gratified, to see a church built and a resident clergyman, in the village of Burford.\nTuesday, Sept. 27.—We reached the picturesque village of Galt about ten o'clock, and stopped at the inn, which we found very comfortable. Great improvements were conspicuous in this thriving place since our last visit. The village had much increased, and extensive mills are in progress of erection, which will afford employment to the growing population; but the most interesting object was an excellent stone church, not quite finished, but fit for Divine worship,—and the great increase of the congregation. The missionary, the Rev. M. Boomer, has shown much activity and zeal in the discharge of his duties, and the Divine blessing has accompanied his labours, for, although he has had many difficulties to surmount, they have greatly prospered. The township in which Galt is situated, is chiefly inhabited by Presbyterians, and the members of the Church were comparatively few. These few, however, were zealous and generous, and with the aid of the Hon. William Dickson, the original proprietor of the township, and his three sons, and of Absalom Shade, Esq., also a large proprietor and wealthy merchant, assisted by generous donations from the great Church societies in England, a very handsome stone church has been built, on the bank of the river. To Mr. Shade we are particularly indebted, not only for a large subscription, but for the care and activity he has manifested in superintending the\nbuilding of the church. Owing to his judicious and frugal arrangements, a sacred edifice has been erected, not only excellent in its proportions, but so large in its dimensions, as to meet for many years the increase of the population, and that, too, at an expense so moderate, as to surprise those acquainted with the building of churches in other places. The completion of the church, and the presence of an active and efficient clergyman, has already begun to attract English emigrant families, of great respectability, to this beautiful locality, and from the great water-power which it possesses. Galt must eventually become a place of note.\n\nThe congregation on the present occasion was very good, and fourteen persons were confirmed—not an inconsiderable number, when the newness of the mission is considered, and that a confirmation was held here only two years ago. After partaking of some refreshment at Mr. Boomer's, we proceeded to Guelph, twenty-five miles distant, and took up our lodgings at the parsonage-house of the Rev. Arthur Palmer, B.A., the worthy incumbent.\n\nGUELPH.\n\nWednesday, Sept. 28.—The Rev. A. Palmer had met us at Galt, and with the Rev. M. Boomer, accompanied us across the country to Guelph. This place can no longer be called a village, for it has become the district town, where all the county\noffices of the newly-formed district of Wellington are kept, and the courts held. It is prettily situated on the river Speed, a branch of the Grand River; Guelph is distinguished as the first town commenced by the Canada Land Company, whose zeal and well-directed enterprise and assiduity have been of great advantage to the province at large. The situation of Guelph is elevated and healthy, and the population may claim the character of being more exclusively British than almost any other locality in the province. The church, a structure rather elegant in its appearance, stands upon a slight eminence in the middle of the town. The congregation was very good, and thirty-two persons were confirmed. In the evening we returned to Galt.\n\nDUNDAS—ANCASTER.\n\nThursday, Sept. 29.—We reached Dundas, twenty miles, by ten o'clock, A.M. The most gratifying sight on entering this flourishing town, is the church, built in the modern Gothic style. The leading parishioners are wealthy and generous; they are gentlemen also of considerable taste, and are anxious to render their church an ornament to the town. They have been much encouraged by handsome donations from the two great Church societies in England, which had the effect of increasing their own contributions. The missionary, the Rev. W. McMurray, has been very successful in his labours,\nand has greatly increased his congregation. Two years ago, no fewer than eighty persons were confirmed at this place, and on the present occasion, sixteen were added to that number. The service was well attended, and the ministrations of the day appeared to have made the usual good and wholesome impression.\n\nFriday, Sept. 30.—At Mr. M'Murray's desire, I visited a sick man this morning, about three miles from Dundas, who had been long ill of consumption. He had expressed a strong desire to be confirmed, but was unable to leave his bed. He complained of little or no pain, and conversed freely and calmly about his latter end; as from the nature and progress of his disease, there could be no hope whatever of his recovery. He was much gratified with my visit, and said repeatedly it was the greatest comfort that could have been afforded to him in this world. I conversed with him in a kind and consoling manner, and, finding him well instructed, and in a very hopeful state of mind, I administered to him the rite of confirmation. The sick man became animated, and expressed himself greatly comforted, and when I gave him my blessing at parting, his look of grateful thankfulness is not to be described, and can never be forgotten.\n\nAt two o'clock we proceeded to Ancaster, a village which stands in a very elevated situation, and commands a most extensive view of Lake Ontario, and the surrounding country. This is also one of Mr. M'Murray's stations, and evinces\nmarks of his diligent and successful cultivation. The congregation was numerous, and twenty-one persons were confirmed. The services being concluded, we drove to the town of Hamilton.\n\nBINBROOK—HAMILTON.\n\nSaturday, Oct. 1.—We proceeded fourteen miles to Binbrook, the mission of the Rev. J. Flanagan, quite a rural spot, for the very few houses near the church can scarcely be called a village. This being the first time of holding a confirmation at this place, the congregation was much more numerous than might have been expected. Forty-one persons were confirmed, and a salutary impression made upon all present by the services of the day. The church, though small, is very neat, and was built, in a great measure, through the aid and exertions of Mr. Leith, a son of the late Sir James Leith, major-general in the army; who not only contributed very largely himself, but interested his parents and friends in Scotland, in the good work, and freely gave his time and attention to the building during its progress. Mr. Leith has also built a commodious house, which he intends to give as a parsonage, and in the mean time it is occupied as such by Mr. Flanagan and family. In the evening we returned to Hamilton.\n\nSunday, Oct. 2.—There are few places in North America that have increased more rapidly, or that stand in a more beautiful and commodious\nsituation than the town of Hamilton. It is the district town of Gore, at which the assizes and quarter-sessions are held, and returns a member to parliament. From the mountain, which overhangs the town, we have the most magnificent views of Lake Ontario, and the intervening country, as far as Toronto, forty miles. The church, through the great exertions of the Rev. J. G. Geddes, aided by some of his principal parishioners, was now finished, and prepared for consecration. It is a large and handsome structure, capable of containing a great number of people. The congregation in the morning was very large, and the service of consecration commanded the most intense interest. In the afternoon, twenty-three persons were confirmed, and my address seemed to awaken the best feelings of those present, and confirmed, it is hoped, many good resolutions.\n\nCONCLUSION—SUMMARY.\n\nMonday, Oct. 3.—We embarked, at seven o'clock, A.M., on board the steam-boat Britannia, and reached Toronto at midday. I had now completed a long and arduous tour, embracing many tedious journeys, both by land and water, and I confess that I was in body somewhat wearied, but in spirit greatly refreshed. I had scarcely been at home since the 13th of June; having from that date to the time of setting out for the Manatoulin Island, been engaged in forming District Branch Associations of\nthe Church Society. But while so many wearisome journeys were endured, I had the greatest reason to be thankful to Almighty God, who so mercifully preserved my health and strength during the whole period—having never experienced a day's sickness, or been prevented by any accident from discharging my duties, or from keeping my various appointments. During my absence from Toronto, I consecrated two churches and one burial-ground, confirmed 756 persons at twenty-four different stations, and travelled, including my journeys for the formation of District Branches of the Church Society, upwards of 2,500 miles.\nThe following Works, published by the S.P.G. may be had at the Depositories of the SOCIETY for PROMOTING CHRISTIAN KNOWLEDGE.\n\nThe Church in the Colonies.\n\nJOURNALS OF VISITATION.\n\nNo. I. In the Diocese of TORONTO\n\nII. QUEBEC, PART I.\n\nIII. NOVA SCOTIA\n\nIV. NEW ZEALAND, PART I.\n\nV. AUSTRALIA, PART I.\n\nVI. Ditto PART II.\n\nVII. NEW ZEALAND, PART II.\n\nVIII. Ditto PART III.\n\nIX. QUEBEC, PART II.\n\nX. NEWFOUNDLAND\n\nXL FREDERICTON\n\nXII. NEW ZEALAND, PART IV.\n\nXIII. NOVA SCOTIA, PART II.\n\nNos. I. to IX. cloth lettered, in Two Volumes, 5s.\n\nRISE and PROGRESS of the MISSIONS in TENNEVELLY by THOMAS ROBINSON, D.D. late Archdeacon of Madras, and RICHARD CLARKE, Esq. late of the Madras Civil Service. With a Map of the District.\n\nMissions to the Heathen.\n\nNo. I. SAWYERPOORAM (Diocese of MADRAS.) PART I.\n\nII. EDEYENKOODY\n\nIII. SAWYERPOORAM PART II.\n\nIV. CAWNPORE (Diocese of CALCOUPT.)\n\nV. NAZARETH (Diocese of MADRAS.)\n\nVI. LAKE HURON (Diocese of TORONTO.)\n\nVII. SAWYERPOORAM PART III.\n\nVIII. Ditto PART IV.\n\nIX. VISITATION TOUR (Diocese of MADRAS.)\n\nX. EDEYENKOODY PART II.\n\nXI. DIOCESE OF BOMBAY, PART I. (GUZERAT MISSION)\n\nXII. SAWYERPOORAM PART V.\n\nNos. I. to VIII. cloth lettered, in One Volume, Is. 6d.\n\nE. CLAY, PRINTER, BEAD STREET HILL.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_47558.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 77, "total-input-tokens": 121656, "total-output-tokens": 22094, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1721, 3], [1721, 2821, 4], [2821, 2821, 5], [2821, 2821, 6], [2821, 2821, 7], [2821, 2821, 8], [2821, 3190, 9], [3190, 3190, 10], [3190, 3190, 11], [3190, 3190, 12], [3190, 4833, 13], [4833, 6893, 14], [6893, 7719, 15], [7719, 9057, 16], [9057, 10271, 17], [10271, 11714, 18], [11714, 13275, 19], [13275, 14845, 20], [14845, 16232, 21], [16232, 17587, 22], [17587, 19154, 23], [19154, 20519, 24], [20519, 22074, 25], [22074, 23533, 26], [23533, 24866, 27], [24866, 26345, 28], [26345, 27876, 29], [27876, 29338, 30], [29338, 30742, 31], [30742, 32011, 32], [32011, 33381, 33], [33381, 34800, 34], [34800, 36141, 35], [36141, 37443, 36], [37443, 39028, 37], [39028, 40512, 38], [40512, 41801, 39], [41801, 43211, 40], [43211, 44575, 41], [44575, 46077, 42], [46077, 47612, 43], [47612, 48897, 44], [48897, 50477, 45], [50477, 52040, 46], [52040, 53638, 47], [53638, 55208, 48], [55208, 56672, 49], [56672, 58039, 50], [58039, 59485, 51], [59485, 61026, 52], [61026, 62344, 53], [62344, 63908, 54], [63908, 65488, 55], [65488, 66805, 56], [66805, 68320, 57], [68320, 69644, 58], [69644, 70994, 59], [70994, 72350, 60], [72350, 73695, 61], [73695, 75015, 62], [75015, 76426, 63], [76426, 77743, 64], [77743, 79120, 65], [79120, 80534, 66], [80534, 81878, 67], [81878, 83283, 68], [83283, 84613, 69], [84613, 85958, 70], [85958, 87429, 71], [87429, 88782, 72], [88782, 90146, 73], [90146, 90758, 74], [90758, 90758, 75], [90758, 92002, 76], [92002, 92002, 77]], "primary_language": ["en", "en", "en", "en", "None", "None", "None", "None", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]