[{"id": "0c864d06a61c0913fdd7d35c6e684ca2985472de", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nIzaak Walton Killam Memorial Library\nDalhousie University\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n\n4 5 6\n\"OUR BOYS\"\n\nIN THE\n\nRIEL\n\nHALIFAX TO THE SASKATCHEWAN\n\nREBELLION.\n\nA Musical and Dramatic Burlesque\n\nHolloway Bros., Printers, 69 Granville St.\nHALIFAX TO THE SASKATCHEWAN:\n\n\"OUR BOYS\"\n\nIN THE RIEL REBELLION.\n\nA Musical and Dramatic Burlesque,\n\nBy Sergt. L. Dixon,\n\nAND SONGS BY\n\nPrivates R. Blackmore, C. Munro, and S. H. Romans.\n\nAs played at the Academy of Music, Monday and Tuesday, April 12th and 13th, under the patronage of His Honor the Lieut.-Governor, Col. Worsley, D. A. G., and Staff;\n\nHis Worship the Mayor and the Colonel and Officers of the 63rd Halifax Rifles.\n\nHALIFAX, N. S.\nHolloway Bros., Printers, 69 Granville Street.\n1886.\nPREFACE.\n\nOn March 23rd, 1885, word was received in Halifax that Riel had, for a second time, risen in revolt. Fifteen years ago the troops, after a toilsome march of six weeks, arrived at Fort Garry, but the rebel had vanished. Then our Dominion, just born, with discordant elements and race prejudices to overcome, had to temporize, and the foul murderer of Scott escaped justice.\n\nCanada occupied a different position a year ago. Those who in 1870 were laughing children in 1885 stood, \"the sturdy manhood of a generation,\" ready for the call. In a month five thousand of the militia, after having passed through bitter punishment from wet, cold, and hunger, stood on the prairie prepared to uphold the flag and maintain the integrity of the land.\n\nOn April 3rd, (Good Friday), an order from headquarters called into existence the Halifax Provisional Battalion, 384 strong, consisting of 84 Halifax Garrison Artillery, 100 of the 63rd Halifax Rifles, and 168 Princess Louise Fusiliers, with 32 officers. On Monday the battalion stood on parade waiting marching orders. These came four days later, and on the following morning—Saturday, 11th—the first regiment Nova Scotia had ever sent beyond its borders sped onward with eyes firmly fixed on the path of duty, at the end of which was—what? On that day none could tell.\n\nThe Halifax Regiment has no honors to blazon on its colors. Like many a corps in the field, it had plenty of work to do—work necessary and important, but galling to a good corps. Where it was ordered there it went, and those in a position to know can tell whether the Bluenose wished to get to the field or hold back.\n\nThe rebellion bears on its face nothing but sorrow and loss, yet out of it has grown a warmer attachment for the flag and the land. Provincial and party ties were forgotten; we had become one people. In our journey of seven thousand miles kindness was everywhere met, and the feelings thus created—sanctified by the blood of those who fell—will help in making \"This Canada of Ours\" a Nation.\n\nMany friends have a desire to see how \"The Boys\" got on while West. The following few sketches, from the many, have been put into shape to celebrate the first anniversary of the departure of the regiment.\nDRAMATIS PERSONÆ, WITH CAST.\n\nThe Major-General .................................................. Corpl. R. B. Elliot.\nDude—\"an untidy sergeant,\" ...................................... Lce.-Corpl. E. B. Hunter.\nThe Deacon ................................................................. Pte. R. Shaw.\nMac—\"the Deacon's butter,\" ........................................ Pte. H. Macab.\nOrderly Sergeant—\"our general,\" ................................... Pte. C. Mylius.\nColor-Sergeant ............................................................. Corpl. W. C. Sterling.\nSergt.-Major ............................................................... Pte. R. Blackmore.\nOrderly Room Clerk ...................................................... Corpl. W. C. Sterling.\nDick—\"Assistant Orderly Room Clerk,\" ......................... Pte. R. Blackmore.\nHospital Sergeant ......................................................... Pte. L. J. Mylius.\nMickey—\"full private in rear rank,\" ............................... Pte. C. W. McLeod.\nCharley ................................................................. Lce.-Corpl. C. S. Pickford.\nSergeant Picket ............................................................ Lce.-Corpl. W. A. Emerson.\nBeauty—\"always hungry,\" ............................................. Pte. C. Munro.\nDumont ................................................................. Lce.-Corpl. A. Michener.\nNatty ................................................................. Pte. S. H. Romans.\nSergeant Fatigue .......................................................... Lce.-Corpl. C. Waterfield.\nJock—\"the piper,\" ......................................................... Pipe-Major Patterson.\nH. V.—\"that's me,\" ....................................................... Pte. H. Vogel.\nCorporal Sick Parade .................................................... Corpl. R. B. Elliot.\nJim ................................................................. Pte. J. S. Creighton.\nSutty—\"the cook,\" ....................................................... Pte. J. H. Brown.\nChicken ................................................................. Pte. C. W. Romans.\nRookey—\"telegraph operator,\" ..................................... Pte. C. W. Romans.\nScout—1st bugler ......................................................... Bugler E. M. Studd.\nBob—2nd bugler .......................................................... Bugler C. W. Kelly.\nCivilian ................................................................. Lce.-Corpl. C. Waterfield.\nCorporal Guard .......................................................... Lce.-Corpl. J. Mackintosh.\nINTRODUCTORY.\n\nSCENE.—The Halifax Provisional Battalion entering North Street Station. The leading company of the Rifle detachment half way across the stage; the troops in fours, at \"The Trail,\" marking time; the Band of the 63rd \"Halifax\" Rifles in the right playing \"The Girl I Left Behind Me.\"\n\nVoice of the commanding officer in the right heard \"Forward.\" The companies march across, and as the rear exits band ceases.\n\n(Curtain.)\n\nACT I.\n\nSCENE 1.—Interior of a car on the way to the front.\n\nScout.—Let her go Smith.\n\nCharley.—Say, boys, didn't old Halifax give us a good send off?\n\nWill.—Many of the lads behind feel bad at being left.\n\nDeacon.—You bet. Let us give the old corps another cheer. (Cheers begin.) Hold on! Take the time from me. Now, all together.\n\n(Cheers.)\n\nChicken, (waking)—What are you kicking up such a racket for?\n\nDude.—Why, sleepy-head, we have just been cheering the boys left home.\n\nChicken.—By George! had I been awake I would have had a hand—I mean a voice in that.\n\nMickey.—Say, Dick, give us \"Will ye No.\"\n\nScout.—Yes, strike up Dick.\n\nWill.—Order for Dick's song.\n\nDude.—Hold up your clatter in that corner.\n\nMickey.—Go on, Dick.\n\n(Orchestra.)\nWILL YE NO COME BACK AGAIN?\n\nSUNG BY IRE. R. BLACKMORE.\n\nBonnie Charlie's now awa',\nSafely owre the friendly main,\nMony a heart will break in twa'\nShould he ne'er come back again.\n\nChorus.—Will ye no come back again?\nWill ye no come back again?\nBetter lo'ed ye canna be,\nWill ye no come back again?\n\nWe watched thee in the gloaming hour,\nWe watched thee in the morning grey,\nTho' thirty thousand pounds they gie,\nOh, there is none that wad betray.\nCho.—Will ye no, &c.\n\nSweet's the layrock's note and lang,\nLifting wildly up the glen,\nBut aye to me he sings ae sang,\nWill ye no come back again?\nCho.—Will ye no, &c.\n\nJim.—I wonder how many of us will ever see the old town again.\n\nCharley.—There's no telling; but there will be many a sad heart\n\"should we no come back again.\"\n\nDude.—There is no telling who will get back, boys, but \"every bullet\nhas its billet.\"\n\nMickey, (getting up.)—Yes, and every billet has its bullet, or some\nother unhealthy thing. I am sore already.\n\nOmnes.—\"Sit on him. Let up on that.\"\n\nWill.—Why, boys, the Sleeping Beauty has slept through all the\nracket\n\nDude.—Wake him up, Mac.\n\nMac, (shaking Beauty.)—Hi! Hello, Beauty!\n\nBeauty.—Can't you let a fellow get five minutes' sleep?\n\nDude.—Why, man alive, you have been asleep for about twenty-four\nhours. You have hardly opened your eyes since we left\nMoncton, where we had that splendid meal of dirty water and\nbread and mustard sandwiches. We will remember that meal\nfor some time.\n\nBeauty.—What's the matter then? Is there another meal ready?\n\nJim.—Another meal! Don't you ever think of anything except\neating and sleeping?\nBeauty.—Yes, smoking. Give me a match, somebody.\n\nChicken.—I tell you, boys, old Halifax expects us to give a good account of ourselves. Let us remember.\n\nOmner.—Hear, hear, hear him.\n\nNatty, (waking)—Hello! I say, what's all the racket about—the girls?\n\nBeauty.—Oh, of course, the girls are always troubling you.\n\nNatty.—And something to eat is always troubling you. Let us have a song; try the \"Farewell.\"\n\n(Enter rear the O. R. C.)\n\nO. R. C.—Hold on a bit. Give me your letters first, got to post them at Richmond Junction. Hurry up, boys.\n\nNatty.—Get out, you old fraud. You are always coming along at the last moment.\n\nO. R. C.—I am always ready when I'm wanted, anyway, for it's a cold day when I get left.\n\nNatty.—Well, we want you now. Join in the song, and when you are through we will have ready the letters.\n\nBeauty.—What letter?\n\nO. R. C.—The letters from the girls; violet ink, you know, with all the crosses.\n\nNatty.—Come on with the song.\n\n(Orchestra.)\n\nTHE SOLDIER'S FAREWELL.\n\nHow can I bear to leave thee,\nOne parting kiss I give thee,\nAnd now what'ever befalls me,\nI go where duty calls me.\n\nChorus.—Farewell, farewell, my own true love,\nFarewell, farewell, my own true love.\n\nPerchance no more I'll meet thee,\nOr with fond love e'er greet thee,\nThe war clouds roll before me,\nI go where duty calls me.\n\nCho.—Farewell, &c.\n\nI'll think of thee with longing,\nThink thou when tears are thronging,\nAnd with my last fond sighing,\nI'll whisper soft when dying,\n\nCho.—Farewell, &c.\nMickey.—Ha, ha! Look here, boys! I forgot to leave the keys of the safe; there will be fun at the office.\n\n(Enter rear O. Sergt.)\n\nO. Sergt.—Attention! Each man will have on a clean shirt, and have his hair cut close, and any man found cutting his toenails will be put in the cattle car.\n\n(Groans.)\n\nChicken.—Is this sort of thing to be kept up the whole journey.\n\nO. R. C.—For goodness sake, stop grumbling.\n\nChicken.—I'm not grumbling; I was only just saying.\n\n(Bugler blows in Dumont's ear, who jumps on seat in excitement.)\n\nDumont.—Fire! Box 24!\n\nBeauty.—Good, Dumont.\n\nDumont.—I was dreaming, and thought I heard the alarm.\n\nCharley.—Hurrah for Dumont.\n\nO. Sergt.—Richmond Junction, boys. Now, Beauty, another meal.\n\n(Exeunt omnes shouting.)\n\nSCENE 2.—Street, with sign \"Richmond Junction.\"\n\n(Enter left running four members of the H. P. B. with tin pans, looking glasses, whistles, &c. Enter right a drunken civilian.)\n\nDude.—Where's the train?\n\nCivilian.—She's on the (hic) way to the (hic) front. (Party drop parcels in consternation.) Is all (hic) right boys, but (hic) she' here (hic).\n\nDude.—We are left, boys.\n\nNitchie.—Yes, and it's a cold day for us.\n\nPevy.—We have only one thing to do.\n\nNitchie.—And that is to go on.\n\nDude.—Right all the time.\n\nCivilian.—Shay, soldiers, (hic) I like that, (hic) she here (hic) tell you whaz, boys, (hic) shay, have (hic) somethin.\n\nBilly.—That's all right, old man. Say boys, (points to goods), our little shopping expedition has cost us dear.\n\nNitchie.—Yes, it's doubtful if we catch the battalion before it reaches Winnipeg.\nBilly.—Then we have to do the gaps by ourselves. Have to go through mud, snow, and slush, live on what we can pick up and sleep anywhere we can find a hole to crawl into, and all for what—for these, (picks up glass and whistle) for the consolation of looking at my ugly mug to see if my whisker is leaking and of playing \"Good-bye, sweetheart, good-bye.\" Goodness knows I'm paying dear enough for my whistle.\n\nCivilian.—Thaz waz the matter, (hic).\n\nNitchie.—Dr. Johnston said that patriotism was the last refuge of a scoundrel. What terrible scoundrels we must be or else we would turn round and go home again.\n\nDude.—If we did what would the boys down home say we were? But we don't intend going back for a few months, so let us see about moving West.\n\nCivilian.—Shay, boys (hic) if you'll (hic) stay here, I'll (hic) keep you for six (hic) months. (Exeunt soldiers right.) Well I'm beat (hic) soldiers who won't (hic) drink (hic). Shay! Hi! Hello! (Staggers off right.)\n\nSCENE 3.—Camp Desolation. A winter landscape at night.\n\nCol.-Sergt.—Well, boys, here we are at the end of the first gap. My bones are sore yet from that header I took when our team upset.\n\nMickey.—Oh, you needn't crow, for a box of hard-tack fell on me.\n\nSergt.-Major, (in right).—Bugler!\n\nScout.—Here, sir.\n\n(Exit right.)\n\nWill.—Has anybody seen Jock since we arrived? I thought he was finished when their team capsized.\n\n(Bugler in right sounds \"Orderly Sergeants.\")\n\nO.-Sergt.—Goodness me! there's that awful Orderly Sergeants just as a fellow was getting thawed out. I wonder what's wanted now.\n\n(Exit right.)\n\nCharley.—Poor old Jock! His first thought was not for himself. Did you hear him yell out, \"Are the peeps all right.\"\n\nCol.-Sergt.—Yes; what a brick he is. Over sixty, and lamenting for fear he would not be allowed to come on service.\n\nCharley.—He said on the day of the medical examination: \"I have been with the lads during twenty-five years of peace, and now that there is danger they want to leave me behind.\"\n\n(Enter right O.-Sergt. and Bugler.)\n\nO.-Sergt.—Two men for Quartermaster's fatigue.\nJim.—Confound the Quartermaster's fatigue.\n\nDeacon.—Who is next for duty?\n\nO.-Sergt.—You and Mac.\n\nMac.—No you don't.\n\nO.-Sergt.—Yes I do, though.\n\nDeacon.—I was on the last fatigue.\n\nMac.—So was I.\n\nO.-Sergt.—No, you were not.\n\nMac, (aside).—Stick to it Deacon; he hasn't his book.\n\nDeacon.—Now that's a nice statement for you to make. How do you know? You have only been O.-Sergt. since morning.\n\nO.-Sergt.—Oh, I know you were not.\n\nMac.—What a whopper!\n\nDeacon.—Fight, ye mules, I hate peace\n\nO.-Sergt.—Now boys, you know you are only bluffing.\n\nMac.—Bluffing, indeed!\n\nDeacon.—If you gamble, we don't.\n\nO.-Sergt.—Now, I say, let up on this fooling, and come on; the Sergt.-Major is waiting.\n\nMac.—Prove that it's our turn; where's your book?\n\nDeacon.—Yes; trot out your book.\n\nO.-Sergt.—It's in my knapsack; but I say if it's not your turn go on and I'll let you off next time.\n\nDeacon.—Taffy.\n\nMac.—To oblige the general, Deacon.\n\nDeacon, (nudging).—Ah, Mac, that's a different matter.\n\nMac.—Of course. To oblige the general of course we'll go.\n\nO.-Sergt.—Come on, then, boys.\n\nMac.—Got him again, Deacon.\n\n(Exit right.)\n\nDeacon.—You bet, Mac.\n\nMac, (to party at fire).—Tell the boys I'm not to blame.\nDeacon.—And of me tell the girls the same.\n\n(Exeunt fatigue right.)\n\nWill.—I wonder how the boys left at Richmond Junction are getting on.\n\nCharley—Poor boys, they must be getting it rough, fighting their way as best they can, hunting up rations and transport.\n\nCol.-Sergt.—Somebody go and hunt Jock up; coffee is nearly ready.\n\nWill.—Yes, Jock must have his coffee. Oh! here he comes,\n\n(Enter left Jock with pipes.)\n\nJock.—Here I am, lads, safe and sound.\n\n(Cries of \"Here you are, Jock,\" \"Sit here, Jock.\")\n\nMickey.—Recline upon this snowy tree,\nAnd patient wait for hot coffee.\n\nJock.—All right, lads. I am safe and sound, and so are the pipes. I see the cook is hard at it.\n\n(Enter left Orderly-Sergt. and cook with coffee.)\n\nSutty.—It's a cold day when we get left boys.\n\n(All rush for canteens and cook serves out coffee. Enter Mac and Deacon right.)\n\nMac.—It's a cold day when we get left.\n\nO.-Sergt.—Is the fatigue finished?\n\nDeacon.—Well, you see the fatigue job isn't finished, but we are finished with the fatigue job, for we saw Sutty start with the coffee.\n\nSergt.-Major, (in right).—Bugler!\n\nScout.—Here, sir. Hang it all, I suppose it's that beastly \"Orderly Sergeants\" again.\n\nJock.—We are going to have a tough night, lads.\n\n(Charley.—Yes, Jock, and perhaps a tougher day to-morrow. It's away below zero now.\n\nWill.—Tough night, Jock! I'm surprised at you. We will have a beautifully ventilated sleeping apartment, a flat car, with the canopy of heaven for a roof, the soft side of a plank for a mattress, and a blanket two inches thick made of ice.\n\nJock.—Oh, I have seen the beautiful sleeping car, and I guess we will pull through just as lively as any of the troops who have gone on ahead.\n(Bugler in the right sounds \"Orderly Sergeants.\")\n\nO.-Sergt.—There it goes again. (Lays down coffee and runs right.)\n\nMac.—Good-bye, general.\n\nO.-Sergt.—You're a gump. (Exit right.)\n\nBeauty.—It's not fair that the general should be interrupted at his meal, and for fear that he might be hungry before this time to-morrow, I will eat it for him.\n\nWill.—Now, look here, Beauty, that's not fair. It's not in the book, you know, and we never do anything unless it's in the book. (Exit right.)\n\nBeauty.—Well, I don't know whether it's in the book or not, but (finishing coffee) I know it's in this lance-corporal.\n\n(Enter O.-Sergt. right and exit cook left.)\n\nO.-Sergt.—The order is that companies at once get on board the cars.\n\nOmnes.—The what!\n\nO.-Sergt.—I beg pardon, but Col.-Sergts. are at once to get their companies on the—ah—transport, and, dence take it, I must go without my tea.\n\nBeauty.—Don't let that trouble you, general. I ate it for you.\n\nO.-Sergt.—Get out, you gump.\n\nCol.-Sergt.—Pick up your kits, boys; we will call the roll on board. Fall in. General, conduct us to our sleeping apartment.\n\n(Enter Will right running.)\n\nWill.—Oh, boys, you ought to see our major. The colonel told him to get us on board quickly and the major was hurrying the boys up. You know that hole in the road?\n\nCharley.—The deep one full of water?\n\nWill.—Yes; you all know it.\n\nOmnes.—Yes, yes.\n\nWill.—Well, the major was rushing about, and just as he got by the hole he was calling out, \"Fall in boys,\" and in he went. (Laughter.)\n\nCharley.—It's a sorry subject to laugh at, boys, but one can't help it.\nDeacon.—If he can't get a change of clothing he will be stiff before morning.\n\nCol.-Sergt.—Forward, boys.\n\n(As rear of company exits right cook enters left laden with tins, and moves right. Beauty enters right running and knocks cook down. Tussle. O.-Sergt. enters right and tries to separate, but is pulled down and pummelled. O.-Sergt. jumps up angry.)\n\nO.-Sergt.—What do you mean.\n\nBeauty, (face smutty).—Why, it's the general!\n\nSutty.—Why, it's the general!\n\nO.-Sergt.—Get out, you gumps.\n\nSutty.—Beauty, what did you knock me down for?\n\nBeauty.—I didn't see you, Sutty; I was looking for my pipe.\n\nO.-Sergt.—Come, now, no more fooling. Get on board.\n\n(Both rise; Beauty hunts for pipe, and Sutty gathers up tins.)\n\nBeauty.—I've got it. Hold on, Sutty, and I'll help you.\n\nO.-Sergt.—Will you get on board?\n\nBeauty.—Lead on, we will follow:\nTho' my face be sore and smutty,\nI'll stick to you, and so will Sutty.\n\n(Both fall in right, turned inwards. O.-Sergt. passes between; they salute.)\n\n(Omnes exeunt right.)\n\nSCENE 4.—Camp Desolation; daylight. Trolly party on trolly; four eating, one asleep.\n\nNitchie.—Billy, I cry spell O. I am used up.\n\nDude.—So am I.\nI'm all broke up, as you can see,\nA poor old played-out bum!\nOh, Moses! 'but I'm stiff.\n\nBilly.—Let her rest a few minutes longer, boys. Give the complicated machinery of the electric motor time to cool off. I tell you, boys, we are lucky to have got this instrument, (pats trolly)\n\nDude.—That was a nice old tramp we had before we reached this spot. If it had not been for the telegraph poles our name was Dennis.\nNitchie.—We were not wild when told that the battalion had started four hours ahead of us.\n\nPevy.—No, we weren't mad. I felt that it was indeed Desolation, but come on, Billy. Let the captain finish his nap, he was at work all night.\n\nDude.—I tell you, boys, I was mighty well pleased to find on reaching Carlton Place that Capt. Curren, of the Artillery, was reported left behind. They can't punish us without going for him.\n\nBilly.—Let her go, Smith.\n\n(Pevy and Billy start trolly across stage.)\n\n(Exit trolly right.)\n\n---\n\nACT II\n\nSCENE 1.—Prairie. The General's Inspection. The battalion drawn up in line, at open order, standing at ease.\n\nC. O., (in right).—Battalion—attention—shoulder arms—general salute—present arms.\n\n(Bugles sound.)\n\n(Enter left the General.)\n\nC. O.—Shoulder arms.\n\nGeneral.—Let your men order arms, sir.\n\nC. O.—Order arms.\n\nGeneral.—Soldiers: I need not tell you that I am pleased to meet the Halifax battalion and at finding so soldierlike a body of men representing the brigade of your native city. I was grieved on the breaking out of the rebellion, when the stern duties of a soldier's life became apparent, to read despatches of your unwillingness to defend the flag, but the proof that the militia of Halifax was sound at heart may be seen by the battalion which represents it in this campaign, a battalion proud in the knowledge that there is still left in the brigade many good men and true who were not called, yet who stand steady at their posts ready to obey when ordered. I do not intend to occupy much time, but must say that any person, be he officer, non-commissioned officer or private, who makes money or secures position by his connection with the force and refuses to take its risks—refuses to do that which the meanest savage on earth will do, fight for his country—should have the uniform torn off him, and be driven out of the force in disgrace. In the regular service this would be called cowardice, and would earn on the field a firing party and a wooden box. Soldiers: there is a great and glorious book by\nwhich all alike are governed—you, the common soldier, and I, the mighty major-general. That book is \"The Queen's Regulations and Orders.\" Do not stop to question, obey and find out afterward. Be prompt, keep your accoutrements clean and your powder dry, and promotion is sure to be granted you. To men coming from the City of Halifax, renowned as its people are as a reading people, a city which gives such a glorious support to Libraries and Mechanics' Institutes, and which possesses the noblest City Hall in the world, to men such as you it is not necessary to dwell upon the deeds of a man like myself, but for the sake of example I will recount the various steps by which I have risen to the glorious position of a Major-General in the Queen's Army.\n\n(Advances front and sings.)\n\n(Orchestra.)\n\nTHE GENERAL'S SONG.\n\nAir—\"When I was a lad.\"\n\nI joined the army a raw subaltern,\nIn the Crimea read the \"Guide\" by Malton,\nThe work I did was considered so good\nThat a very dashing captain soon I stood.\n\n(All)—That a very dashing, &c.\n\nI studied that Guide so carefully\nThat now I'm Major-General in the Queen's Army.\n\nChorus.—He studied that guide, &c.\n\nThe captain's rank seemed grand to me,\nYet I strove to get higher up the tree,\nSo I read \"Courts Martial\" by Captain Clode,\nThen a full-fledged major forth I rode.\n\n(All)—Then a full-fledged, &c.\n\nI read \"Courts Martial\" so carefully\nThat now I'm Major-General in the Queen's Army.\n\nChorus.—He read \"Courts Martial,\" &c.\n\nIt's true of fighting I had seen but little,\nYet what cared I for such a tittle,\nI worked on the \"Guide\" by Ballantyne\nAnd was made a colonel in the thin red line.\n\n(All)—He was made, &c.\n\nThe colonel's position so suited me\nThat now I'm Major-General in the Queen's Army.\n\nChorus.—The colonel's position, &c.\n\nThen down in your province by the ocean,\nI picked out a farm that suited my notion;\nThe Bluenose people believed in me,\nSo they made me a mighty D. A. G.\n\n(All)—So we made him, &c.\nThis D. A. G. so well suited me\nThat now I'm Major-General in that Queen's Army.\n\nChorus.—This D. A. G. so, &c.\n\nAfter years of study and of toil,\nI became like a native of the soil,\nAnd working on \"Construction\" by Col. Wray\nI was made a Major-General on half-pay.\n\n(All)—He was made, &c.\n\nThis title, kind friends, so tickles me\nThat I'm still Major-General in the Queen's Army.\n\nChorus.—This title, kind friends, &c.\n\nMORAL:\n\nNow Riflemen all lend your ears to me,\nIt matters not, friends, how big they may be,\nGo on with your work, never sticking at trifles,\nAnd become Major-General from the Halifax Rifles.\n\n(All)—And become, &c.\n\nMay the Rifles still the crack corps be\nWhen you're all Major-Generals in the Queen's Army.\n\nChorus.—May the Rifles, &c.\n\nI am fully satisfied with you and will keep you as near myself as I can. I know you want to get up with the 90th, but I want some regiment I know close by me. Whatever duty you may be called upon to perform that you will do. Your country has called you in the hour of her need, and you offer her your lives. Your loyalty and patriotism are worthy of a country with as great a destiny as Canada before it. (To C. O.) That will do, sir.\n\n(Exit General R.)\n\nC. O.—Shoulder arms—close order—march—fours—right—quick march.\n\nSCENE 2.—Camp of the H. P. B.\n\nCharley.—I wonder what carried the General and Colonel Macdonald to \"The Landing.\"\n\nMickey.—Why, you saw them start and know very well their horses carried them.\n\nCharley.—They weren't carried, they rode.\n\nJim.—Well, they didn't take their donkeys with them, anyway, or you two wouldn't be here; but does anybody know why they went?\n\nDude.—Not a rumor has leaked out, but it was probably to move the rear of the 7th on to Clark's Crossing and so make room for us.\nMickey.—You may be right.\n\nWill.—I think I know why they went.\n\nCharley.—Let us have your opinion, Will.\n\nWill.—They want to know for sure how much food there is there before letting Beauty go down,\n\n(Enter left Dick.)\n\nOmnes.—What's the news?\n\nDick.—A telegram from \"The Landing.\" (Crowd gathers shouting questions.) Wait a bit boys, but you had better get your kits packed.\n\n(Chicken and others rush in left.)\n\n(Exit right.)\n\nChicken.—What did old Pen and Ink say?\n\nMickey.—We had better get our kits packed.\n\nChicken.—There is some style about that.\n\n(Bugler in right sounds \"Orderly Sergeants.\")\n\nDude.—Who saw the order book? (rushes into tent). Gracious me! where is that book? I have it! (Rushes out again.) Lend me a pencil, some fellow!\n\nCharley.—Now, Dude, there is no hurry; keep cool.\n\nJim.—Did you say you wanted a pencil, Dude?\n\n(All crowd round tent, right rear, and search pockets, exclaiming, \"Ah, yes,\" \"Oh, certainly,\" etc. Bugler in right sounds \"Orderly Sergeants Double.\")\n\nDude.—There goes the double. Let up on this fooling, and give me a pencil.\n\n(Enter Beauty with face covered with syrup, followed by Dumont with two bottles. They take post left front.)\n\nDumont.—Now, look here, Beauty, what did you drink my syrup for?\n\nBeauty.—Syrup! what syrup! who drank your syrup!\n\nDude.—I'll catch Hail Columbia!\n\nDumont.—You know very well you did.\n\nDude.—I've a pencil of my own, thank you, (rushes out right followed by shouts of \"Good-bye, Dude.\")\nBeauty.—What do I know about your syrup. I'm surprised at you accusing your superior officer (shows stripe) of \"looting.\" Whoever took your syrup must have had about a quart. I hate syrup. Young man, these hands are clean.\n\nDumont.—Perhaps your hands are clean but your face is not, you are syrup from your chin to your eyes, (wheeling Beauty round) look here, boys!\n\nMickey.—Jerusalem! what a pet! (Beauty is spun round by crowd.)\n\nBeauty.—Hold on a bit, (smooches Dumont's face).\nDumont says his syrup I hooked,\nAnd that I am mighty mean,\nThat his accounts are sadly cooked\nHis face doth prove, is seen,\nThe syrup it went back again\nFor to see the plain receipt.\nI tell you, boys, it's a cold day when Dumont can Beauty beat.\n\n(Enter right Col. Sergt.)\n\nCol.-Sergt.—We are off, boys; the Dude is now writing the order. Knock off fooling and everyone to work.\n\nCharley.—What! off at last?\n\n(Enter right Dude.)\n\nDude.—Now for it. (Reads) \"Captains Hechler's and Cunningham's companies will proceed to Saskatchewan Landing at 5 o'clock.\"\n\nMickey.—Off the railway at last.\n\nCol.-Sergt.—Get to work, boys; get to work. (Enter left Sutty.) Sutty, like a good fellow, knock up a tea as soon as you can.\n\nSutty.—All right. Are you going to get those things up at the store?\n\nCol.-Sergt.—Yes, I will see to that.\n\nSutty.—I'll make things hum.\n\n(Exit rear running.)\n\nCol.-Sergt.—Charley, go down and order back the fatigue as soon as possible.\n\nCharley.—Nice run you are giving a fellow.\n\n(Doubles out left.)\n\nSentry.—Hi! corporal! come back and put on your belt.\n\nCharley, (returning).—A fellow doesn't stop to act the dude at a time like this.\n\n(Gets belt and exits left.)\nCol.-Sergt.—Nitchie, get a couple of the boys and hunt up wood enough to make a fire at the halt.\n\nNitchie.—If there were many jobs like that I wouldn't like them.\n\n(Exit rear.)\n\nCol.-Sergt.—Beauty, go to the shoemaker and get the frogs he is repairing, and beg, borrow, or—ahem—appropriate anything you can lay your hands on.\n\nBeauty.—Just so. You have named the right man. I am so sweet, you know.\n\n(Enter left in file the fatigue.)\n\n(Sergt. Fatigue.)—Party, halt, front, right turn, dismiss, (party dismisses). By George! this is great! What's the real news?\n\nWill.—Hechler's and Cunningham's companies go to the Landing at 5 o'clock.\n\nSergt. Fatigue.—Bully for the Rifles!\n\nDude.—Fortune's boys are to be left with the Artillery.\n\nSergt. Fatigue.—We leave them with a good crowd, anyway.\n\nDude.—That's so; they are going to strike tents for us.\n\nSergt.-Fatigue.—Just like the \"A.'s,\" always ready to lend a hand.\n\n(Enter right party of four carrying Beauty.)\n\nBeauty.—Here we are with our \"frog's march.\"\n\n(Col.-Sergt. issues frogs, Sutty enters rear.)\n\nSutty.—Coffee is ready; some one come help bring it up.\n\nBeauty.—Oh! heavenly thought! another meal. I'll get my canteen.\n\n(Exeunt rear cook and fatigue.)\n\nJim.—Come, boys, while we are waiting, let us have some of the Provisional song.\n\n(Enter rear Nitchie.)\n\nNitchie.—We struck a bonanza in wood, I have a sort of idea that it was in some way connected with the officers' mess, but all's fair in love and war.\n\nCharley.—Give us a rest.\n\nJim.—Go on Beauty.\nTHE H. P. B.\n\nAIR—\"Been a listenin'.\"\n\nSUNG BY PTE. C. MUNRO.\n\nInto the Riel rebellion,\nThe Halifax soldiers went,\nThe mission that they went upon\nWas to crush the breeds intent.\n\nChorus—Been marching all the night long,\nBeen hungry all the way,\nBeen working all the day long,\nWith fifty cents for pay.\n\nThe \"medicos\" got quickly through,\nAnd there stood on parade,\nRank and file three fifty-two,\nAnd this division was made.\n\nCho.—Been marching, &c.\n\nThe Sixty-sixth one sixty-eight,\nOne hundred Rifle corps\nArtillery and Rifles mutt,\nSo the A.'s sent eighty-four\n\nCho.—Been march'g, &c.\n\nThe regiment then away did go\nInto the far-off west,\nTo face the savage rebel foe,\nAnd Bluenose courage test.\n\nCho.—Been marching, &c.\n\nMany a weary mile it went,\nAnd suffered from Jack Frost,\nMany a curse was upward sent,\nFor many a meal was lost.\n\nCho.—Been marching, &c.\n\nThe Recording Angel oft let flow\nA gently falling tear,\nAnd when to judgment we may go\nThe record won't appear.\n\nCho.—Been marching, &c.\n\n(Enter Sutty and fatigue with coffee.)\n\nSutty—The baggage teams are coming up, and the captain wants you, sergeant.\n\n(Exit left Col.-Sergt.)\n\n(Party eat quickly; enter Jock playing; men exit to clean canteens and enter again all go to work. Enter left Col.-Sergt. Exit Jock right.)\nCol.-Sergt.—Knapsacks to go on teams with baggage; greatcoats to be worn strapped; everything on the teams; lively now, boys, the general will be here in fifteen minutes. The confounded order read 5 o'clock, it's now after seven, and the teams are only just coming up.\n\n(Stores are carried off and accoutrements donned. Jock enters right, playing, and exits left.)\n\nWill,—Don't forget the band, boys.\n\nNitchie.—We can't afford to do that with thirty-five miles and a prairie bit ahead of us.\n\n(Whistles, mouth-organs, &c., produced. Voice in left calls \"Markers,\" who double out, followed by all except H. V. and two buglers.)\n\nH. V., (with letter).—Bob, I want you to post this for me to-morrow to Bismarck and tell him I will die game. I had better read it to see that no mistake is made. (Reads.)\n\nH. V. TO BISMARCK\n\nMine friend; I am a German man,\nA private in the H. P. B.,\nWhen first I hear de rebel clan\nHad rise in mutiny,\nWhy I put on mine uniform\nAnd stand upon parade,\nTo come out here thro' all de storm\nMit de Halifax Brigade.\nThe time we had in gettin' here,\nMine friend, I can tell you,\nWas putty tough, sleep anywhere,\nAnd meals were always overdue,\nSometimes, mine friend, and this is true,\nOne meal a day was all we get,\nYet all the time we onward flew\nWhile we were starved and soakin' wet—\n\n(Interrupted by voice in left calling \"H. V.\")\n\nH. V.—That's me. I'm coming. I guess the rest will have to keep. Bob, you post this for me, (hands letter).\n\n(Exit left doubling.)\n\nBob.—All right, H. V.,\nI'll post this for thee.\n\n(Sergt.-Major in right calls \"Bugler, sound Retreat.\" Bob answers \"Yes, sir,\" and buglers sound.)\n\nScout.—Good-bye, Bobby.\n\nBob.—Good-bye, Scout, I wish I was going with you.\n\nScout.—So do I, Bobby. If I never see you again remember me to all the boys, and tell McInnis I died game,\nBob.—Say, Scout.\n\nScout.—Yes.\n\nBob.—I have strict orders from Halifax to take care of H. V. I have done so. Now mind what I tell you.\n\nScout.—All right, Bobby.\n\nBob.—Watch over H. V. like a father. Should he fall into a gopher hole rescue something belonging to him, if it is only his straw hat and little hatchet with H. V. on it.\n\nScout.—I swear it.\n\nBob.—Then forward to your sow-belly and hardtack.\n\nScout, (to sentry).—Good-bye, old man. Farewell!\n\nSentry.—Good-bye, Scout.\n\n(Exeunt buglers left. Scene.)\n\nSCENE 3.—Detachment of Rifles on line of march resting and eating at midnight on the open prairie.\n\nMajor.—Hello!\n\nTeamster.—What is it?\n\nMajor.—What are you going around that way for?\n\nTeamster.—This road 's the easiest travelled.\n\nMajor.—How long will you be?\n\nTeamster.—We'll be ahead of you.\n\nMickey.—That's the third time we have heard that to-night, but they have never been as good as their word.\n\nCharley.—They will fail this time. Come, Will, let us have the Maple Leaf.\n\n(Orchestra.)\n\nTHE MAPLE LEAF, OUR EMBLEM DEAR.\n\nWords and music, by A. Muir, B. A.\n\nSung by Lce.-Corpl. Emerson.\n\nIn days of yore, the hero Wolfe\nBritain's glory did maintain,\nAnd planted firm old England's flag\nOn Canada's fair domain.\nHere may it wave, our boast, our pride,\nAnd join'd in love together\nThe Thistle, Shamrock, Rose entwine\nThe Maple Leaf forever.\nChorus.—The Maple Leaf, our emblem dear,\nThe Maple Leaf forever,\nGod save our Queen, and Heaven bless\nThe Maple Leaf forever.\n\nOn many hard fought battle-fields,\nOur brave fathers side by side,\nFor Freedom, homes and lov'd ones dear,\nFirmly stood and nobly died.\nAnd those dear rights which they maintained,\nWe swear to yield them never,\nWe'll rally round the Union Jack,\nThe Maple Leaf, forever.\n\nCho.—The Maple Leaf &c,\n\nIn Autumn time our emblem dear,\nDons its tints of crimson hue,\nOur blood would dye it deeper red,\nShed, dear Canada for you,\nE'er sacred rights our fathers won\nTo foeman we deliver,\nWe'll fighting die, our battle cry,\nThe Maple Leaf forever.\n\nCho.—The Maple Leaf &c.\n\nGod bless our loved Canadian homes,\nOur Dominion's vast domain,\nMay plenty ever be our lot,\nAnd peace hold an endless reign\nOur union bound by ties of love,\nThat discord cannot sever,\nAnd flourish over Freedom's home,\nThe Maple Leaf forever.\n\nCho.—The Maple Leaf &c.\n\nOn merry England's far famed land,\nMay kind Heaven sweetly smile,\nGod bless old Scotland evermore,\nAnd Ireland's Emerald Isle\nThen swell the song both loud and long,\nTill rocks and forest quiver,\nGod save our Queen and Heaven bless,\nThe Maple Leaf forever.\n\nCho.—The Maple leaf &c.\n\n(Voice of major in the right, \"Fall in boys,\" Detachment does so, \"Fours—right—quick march—march at ease,\" Execute names right singing and playing.)\n\n(Curtain.)\nACT III.\n\nSCENE 1.—The fatigue loading scow. Telegraph office. Stores piled right.\n\nSergt. Fatigue.—Just throw in a few more of those bags, boys.\n\nBeauty.—Of course we will. (Sings, \"For we are government mules.\")\n\nSergt. Fatigue.—This trip will finish the loading of that outfit of 250 teams.\n\nMickey.—Yes, the whole outfit will be ready to start at daylight, and the question now is will we be allowed to go with it.\n\nCharley.—By George! I hope so; we didn't come all this distance to do the government mule business.\n\nSergt. Fatigue.—The major is as mad as anybody at being kept here while the boys at Batoche and Battleford are having all the fun.\n\n(Enter left O. R. C.)\n\nDick.—Hello, Rookey, send this despatch at once, will you?\n\nRookey.—All right, Nitchie. (Takes despatch and reads aside.)\n\nSASKATCHEWAN LANDING, May 17th, 1885.\n\nTo Lt.-Col. Macdonald, Commanding Swift Current:\n\nMen impatiently awaiting orders for Battleford. Loading scows now and teams across river. Teamsters openly express intention to cut loose and run on first alarm, unless accompanied by escort. Wire general's instructions.\n\nT. J. Walsh,\nMajor Commanding Detachment.\n\n(A loud.) All right, my hearty. You chaps are mighty anxious to test the marksmanship of the Breeds and Indians.\n\nDick.—It was something like that we left home for.\n\n(Rookey enters office.)\n\nSergt. Fatigue.—What time is it, Dick?\n\nDick.—Almost time for \"Come for the love of grub, boys.\" (Exit left.)\n\nSergt. Fatigue.—That's all she will hold this time boys. We'll haul her round the point and by that time the bugle will blow.\n\n(Fatigue party starts hauling scow off right. Rookey enters from office.)\nRookey.—Hello! herring backs! What have you got for breakfast? Beef all over mud?\n\nSergt. Fatigue.—No; bully beef, and hard tack all over mould.\n\nRookey.—The same old bill of fare. Say, what are you going to have for dinner?\n\nSergt. Fatigue.—The boys were talking of getting you to telegraph to Halifax for fresh cod. Your's is stale.\n\nRookey.—Smart ain't you. Suppose you get fresh fish, how would you use it.\n\nSergeant Fatigue.—Well you would have to hide for the boys swear to use you for sauce. Say Rookey. Herring bones sometimes stick in the throat.\n\n(Exit Sergeant Fat. right.)\n\nRookey (to teamsters). Thats the gayest crowd, I ever saw. Well may Mr. White say that they work all day and half the night singing songs and cracking jokes while doing so. Come into the office, I have a curiosity to show.\n\n(Exeunt omnes to office.)\n\nSCENE 2.—The Camp.\n\nSergt.-Major.—Bugler, sound \"Men's breakfast!\"\n\nBugler.—Yes, sir, (sounds call). Do you want me much, to-day, sir?\n\nSergt.-Major.—No, there is no one to parade to-day.\n\nCorporal of Guard.—The fatigue didn't lose much time knocking off. The boys must be pretty hungry, they have been at it since six o'clock.\n\nSergt.-Major.—Oh! Beauty is with the party.\n\n(Exeunt Sergt.-Major and Bugler 1 R. E. Enter fatigue in file 3 R. E.)\n\nSergt. Fatigue.—Fatigue—halt—front—right turn—dismiss.\n\n(All get canteens, and breakfast is brought in left. Enter running Natty.)\n\nNatty.—Mum's the word, boys, (dodges behind tent).\n\n(Enter O.-Sergt. right.)\n\nO.-Sergt.—I wonder where Natty is; I saw him a moment since. I want him for mess fatigue.\n\n(O.-Set. goes round tent, Natty keeping ahead. O. S. returns, Natty following. O. S. looks in tent, then round once more. Natty dodges inside. O. S. exit left. Natty watches, and coming front sings.)\n\n(Orchestra.)\nTHE MESS FATIGUE.\n\nBY PTE. S. H. ROMANS.\n\nAIR.—\"Bob up Serenely.\"\n\nWhen the orderly sergeant wants you\nTo serve on Mess Fatigue,\nWhich you in superior wisdom,\nDeem certainly infra dig.\n\nChorus—Then is the time for disappearing,\nTake a header in you go,\nAnd when old stripey off is clearing,\nBob up serenely, bob up serenely;\nBob up serenely from below.\n\nWhen for officers mess you're wanted.\nOld stripey hunts in vain,\nFor you as a dude have flaunted,\nAnd trust you may again.\n\nCho.—Then is the Time &c.\n\nThis job your cup overflows.\nHelping that O. M. cook,\nWash dishes and peel potatoes,\nAnd after the table look.\n\nCho.—Then is the time &c.\n\nOn wood and water fatigue,\nYou whistle \"Old Black Joe,\"\nBut may the mess trot out a nig.\nWhen we next on service go.\n\nCho.—Then is the time &c.\n\nWith officers slush you's taunted.\nOf militia its the bane,\nAnd no dude wants to be haunted.\nBy slush on next campaign.\n\nCho.—Then is the time &c.\n\n(After singing of song canteens gathered up and pipes filled)\n\nSergt. Fatigue.—Fall in the fatigue.\n\nMickey.—Here come the cripples, boys.\n\nSergt. Fatigue.—Number, (party numbers), right turn—quick march.\n\n(Exit party right singing. Enter rear Corpl. and five sick; burlesque.)\n\nCorpl. sick.—Right wheel—halt—front—dress.\n\n(Enter 1 R. E. Hos. Sergt.)\n\nHos. Sergt.—Five—ah, yes—um—ah—let me see, (to first man), what ails you?\nNo. 1.—I have a stiff neck.\n\nHos. Sergt.—Ah, yes—um—let me see—oh, certainly—(seizes patient by head and shakes it, patient screams)—um—ah, yes—genuine—stiffabus neckabus—treatment, take these pills, one before each meal, and a powder afterwards. What's next?\n\nNo. 2.—A mule gave me a kick on the shin.\n\nHos. Sergt.—Why didn't you give it back to him? What do you say? You don't like family feuds? (No. 2 mutters.) Silence! Don't contradict me! Let me see. Ah—um—oh certainly. These pills will do for you. What's next?\n\nNo. 3.—Well, sir, oh! oh! oh! I have got, oh! oh!\n\nHos. Sergt.—Silence, sir; how dare you play with me! What's the matter with you?\n\nNo. 3.—Toothache, sir, oh! oh! and earache.\n\nHos. Sergt.—Ah, yes; oh, certainly; don't mention it; (patient dances), keep cool my good man, bear your infirmities like a soldier. Toothacheabus—ah, yes—um—oh, certainly. These pills every half hour. (To No. 4), What's wrong with you?\n\nNo. 4.—I strained my back, am deaf, and have river fever.\n\nHos Sergt.—Nothing like a pill; take these. Now last man, not much the matter with you; my medical knowledge tells me that.\n\nNo. 5.—I strained my arm lifting sowbelly—bruised my foot on the scow, two of my ribs are cracked by a kick from a mule. I have headache, rheumatism, and am nearly broken-hearted, because I have not had a letter from my girl for two weeks.\n\nHos. Sergt.—Ah yes, oh certainly. Complicatabus conglomeratabus, ah yes, oh certainly, take these pills. Remedies never failing, when followed by exercise. Now I have a word to say to you. The sick have been watched for the past week, and I find that they have been acting in a very curious manner, one who had rheumatism so bad that he had to be fed with a spoon went to the river and washed his clothes. Two others paddled across the river in a dug out, and then went riding on Kiouses, and last night the whole of them took part in the foot races and base ball match. Every Hospital Sergeant can proudly proclaim the wonderful cures that have been effected by the pills and and powder used in this campaign, but there is something more than wonderful in these cures. Let me see, oh yes, certainly. Now as to diet. Do not eat turkey (sick, we wont sir) or game of any kind (si k, no sir) keep clear of puddings and pies, (sick, we will sir) brandy and limejuice (sick, rush forward, yes sir). How dare you, stand at attention (sick fall in). You surely were not simple enough to think that I was going to issue brandy, (sick sadly shake their heads). Confine yourselves strictly to the health giving diet of that delicious fat bacon,\nand the delicate hard tack. In regard to this hard tack. It was specially prepared for the troops out of wheat which had been splendidly frozen, and there is also another special feature about this hard tack. With a wonderful knowledge of your needs it was not foolishly kilndried, but was packed hot from the oven into soft wooden boxes, and this foresight has materially helped in the formation of that health giving mould which you find all through it, therefore be careful not to rub that mould off as it is very wholesome, although its properties are beyond your intellectual powers. Nos. 1, 2, 3, 4, detained. No. 5, you are for duty. That will do for to-day.\n\nCorpl. Sick Party.—Attention. Right about turn. Quick march.\n\nHos Seryt.—Corporal.\n\nCorpl. Sick.—Sick, halt, front, dress.\n\nHos. Seryt.—Let me see. After mature deliberation, I think you had better march the sick down, seeing that exercise is good—and place them at work on fatigue.\n\n(Exit Hospital Sergeant right.)\n\nCorpl. Sick.—Sick. Attention. Right turn. Quick march.\n\n(Exeunt. Scene.)\n\nSCENE 3.—River bank; a party washing clothing.\n\nNatty.—I thought we were going to have some fun last night when the alarm sounded.\n\nMickey.—Yes, and it all wound up in the arrest of that sott-headed teamster, Jack, who teams for Curry Bros. He got a bed in the guard tent for prowling around without the password.\n\nDude.—Well, I thought it was teamsters rebelling against going to Battleford, for that was a lively meeting they had yesterday.\n\nDeacon.—I didn't know what the racket was, for the bugler's shout acted like a kind of \"Git thar', Eli,\" and no one stood on the order of his going but went.\n\nSeryt.-Major.—The teamsters would have felt a good deal worse had they known that a band of Poundmaker's Indians came within fifteen miles of them. Say, the big darkey they call the \"general\" was at the meeting and made a speech. He said: \"Look here, you teamsters, you stan' talkin' an' talkin' 'bout what you's goin' to do an' what you's not goin' to do, till de fust ting you know old Pawnbroker be down on top of yous an where am yous den--um--gobbled up.\"\n\nCharley.—There may be chances yet for many to turn up their toes to the daisies before the fun is over.\n\n(Bugler in distance sounds \"Tea Bugle.\")\nBeauty.—Time enough to fight, boys, when the fighting comes; the alarm I like best has just sounded, for I am a ration—al creature.\n\nDumont.—What's for tea?\n\nMac.—Tea and hardtack.\n\nBeauty.—That's what we had for dinner.\n\nMickey.—No, it's not; we had hardtack and tea.\n\nMac.—Oh, Moses! fifty cents a day and found dead on the prairie. Let us have \"Hardtack,\" boys.\n\n(Orchestra.)\n\nHARD-TACK COME AGAIN NO MORE.\n\nAIR—\"Hard Times come again no more,\"\n\nSUNG BY CORPL. W. C. STIRLING.\n\nThere's a song of the flat-foot who toils as best he may,\nOn the river Saskatchewan's shore;\nThough his voice might be merry he's groaning all the day,\nOh! Hard Tack come again no more.\n\nChorus.—'Tis the moan, the groan of the weary,\nSung in the tent and about the door,\nEvery day it is murmured in tones sad and dreary,\nOh! Hardtack come again no more.\n\n'Tis a sigh that does echo across the camping ground,\nTo the man with the rations in his store;\n'Tis a wail that is sounded for many miles around,\nOh! Hard Tack come again no more.\n\nCho.—'Tis the moan, &c.\n\nAs the bottom of a dry dock by the troubled wave,\nThere's nothing I assure you better for;\n'Tis the thing that will linger till the last trumpets stave,\nOh! Hard Tack come again no more.\n\nCho.—'Tis the moan, &c.\n\nIf you wish to make a building, a fine City Hall,\nOr headstone a baker would put o'er;\n'Tis the thing that is wanted but as rations we all bawl,\nOh! Hard Tack come again no more.\n\nCho.—'Tis the moan, &c.\n\nIf you wish to finish \"injuns\" it will them quickly slay,\nAnd dead \"injun's\" safest I am sure;\n'Tis the plan to lower taxes we groan at every day day,\nOh! Hard Taek come again no more,\n\nCho.—'Tis the moan, &c.\nOh! the song that will linger for ever on our ears,\nOutliving the mother-in-law;\nIs the wail of the hungry the veteran volunteers,\nOh! Hard Tack come again no more.\n\nCho. 'Tis the moan, &c.\n\n(Omnes Exeunt right.)\n\nCAMP SCENE.—Evening. Two tents rear. Sentries rear and right.\nMen sewing, reading, writing, smoking, &c.\n\nSergt.-Major.—Bugler! Sound \"Retreat.\"\n\n(Bugler sounds call.)\n\nScout.—Here comes the picket, boys.\n\n(Enter the picket, left, in file.)\n\nCorporal of Guard.—Leave us a lock of your hair, Sergeant.\n\nCharley.—I'll tell the boys you died game.\n\nMac.—Say, don't kill any dead things.\n\nSergt. Picket.—Halt—front. Now go on with your chaff. It's your turn, and we are prepared for it.\n\nDeacon.—What a lovely night you have for outpost.\n\nCorporal of Guard.—When the rain comes in a couple of hours think of the boys doing the grand snore act. (Snores.)\n\nSergt.—Before we go let us have a turn at the crank for a moment.\n\n(Advances front and sings.)\n\n(Orchestra.)\n\nA SOLDIER'S LOT IS NOT A HAPPY ONE.\n\nAIR—\"Policeman's Lot,\" (Pirates of Penzance)\n\nSung by Lce.-Corpl. W. A. Emerson.\n\nWhen the bugle wakens sleepers in the morning,\nCalling up the \"mules\" their days' work to begin,\n'Tis then they scorn the parson's well known warning,\nAnd loudly swear altho' they know 'tis sin.\nThen on the scow their temper they don't smother,\nFighting 'gainst the current isn't fun,\nTaking one consideration with another,\nA soldier's lot is not a happy one.\nWhen the scow upon the river's to be run,\nThe soldier's lot is not a happy one.\nWhen the Captain of the Day is treating strangers,\nAnd having royal times within his tent,\n'Tis then the sentry, like the prairie rangers,\nSmokes cautiously for fear of 'baccy's scent.\nMany serving officers differ from each other,\nAnd the sentry to Regina might be run,\nAh, take one consideration with another,\nA soldier's lot is not a happy one.\nWhen outpost in the rain is to be done,\nThe soldier's lot is not a happy one.\n\nWhen you labor hard all day upon the river,\nLooking forward to an evening's quiet fun,\nIn fearful rage Dumont you would dissever\nOn finding that for outpost you are run.\nWith great delight each rebel you would smother,\nOr stiffen with your clumsy Snider gun,\nAh, take one consideration with another,\nA soldier's lot is not a happy one.\nWhen Dumont from the battlefield has run,\nThis soldiering at \"The Landing\" isn't fun.\n\nTo Picket.—Attention—right turn—quick march.\n\nDeacon.—Fare the well, loved one.\n\nMac.—We'll remember you, love, in our dreams.\n\nSergt.—Fire away, boys. It's your turn to-night; but every dog will have his day, you know.\n\nCharley.—You have a night thrown in.\n\nSergt.—No, I haven't; I am thrown out for a night. Pleasant dreams, boys.\n\nOmnes.—Good night.\n\nJim.—Let us have another song, boys; strike up the \"Valley.\"\n\n(Orchestra.)\n\nTHE RED RIVER VALLEY.\n\nDedicated to \"The Second Scottish Rifle Co.\", by ladies of Winnipeg.\n\nSung by Pte. L. J. Mylius.\n\n'Tis a long time, you know, I've been waiting,\nFor those words that you never did say,\nBut, alas! now my fond heart is breaking,\nFor they say you are going away.\n\nChorus.—Then consider awhile e'er you leave me,\nDo not hasten to bid me adieu,\nBut remember the Red River Valley,\nAnd the maiden whose heart beats for you.\nFrom this valley they say you are going,\nI shall miss your bright eyes and gay smile,\nAnd the sunshine that on me is glowing,\nWhich brightened my pathway awhile.\n\nCho.—Then consider, &c.\n\nRemember the valley you are leaving,\nHow lonely and dreary it will be,\nRemember the heart you are breaking,\nAnd be true to your promise to me.\n\nCho.—Then consider, &c.\n\nAs you go to your home by the ocean,\nMay you never forget the sweet hours,\nWe spent in the Red River Valley,\nOr the love we exchanged 'mid its bowers.\n\nCho.—Then consider, &c.\n\nOh! there never could be such a longing\nIn the heart in a young maiden's breast,\nAs lives in my heart which is beating\nWith love for the boy who came west.\n\nCho.—Then consider, &c.\n\nThe western maid prays for her lover,\nTo the spirit who rules o'er the world,\nMay sunshine his pathway e'er cover,\nGive his griefs to the Red River girl.\n\nCho.—Then consider, &c.\n\n(At the conclusion of song sentries relieved.)\n\nDeacon.—Come, boys, on with the dance. Mac, you are next.\n\nTHE SASKATCHEWAN GUARDS' LAMENT.\n\nBy Pte. C. Munro.\n\nSung by Pte. H. Macnab.\n\nHere we suffer grief and pain,\nOver ice and snow we came\nThree thousand miles and more.\n\nChorus.—Oh, boys, ain't it mournful,\nMournful, mournful, mournful,\nOh, boys, ain't it mournful,\nWe came out here in search of gore.\n\nThey only gave us one suit of clothes,\nWhen we'll get any more dear only knows,\nAway out here in the West.\n\nCho.—Oh, boys, &c.\n\nThey only gave us one meal a day,\nThe rest we took out of government pay,\nNo allowance was made for more.\n\nCho.—Oh, boys, &c.\nEach of us thought when we came away\nWe'd be called upon in many a fray,\nAway out here in the West.\n\nCho.—Oh, boys, &c.\n\nOn a Sabbath day we loaded the punt,\nIn expectation of going to the front,\nBut we didn't get there at all.\n\nCho.—Oh, boys, &c.\n\nSoon, perhaps, we home will go,\nBut many a scalp have we to show\nOf \"Injun\" we killed in the war.\n\nCho.—Oh, boys, &c.\n\n(Bugler in left sounds \"First Post.\")\n\nMickey.—Well, that was a nice comfortable job we had yesterday—from six in the morning till half-past eleven at night.\n\nDumont.—Lovely work for Sunday.\n\nDeacon.—Necessity knows no law.\n\nCharley.—What nice Sunday clothes we had on. Say, if the folks down home could have seen us they wouldn't think we were part of the crowd that sports standing collars and canes.\n\nMoc.—Had we been home what would we have been doing?\n\nNatty.—Why, you would have been in the Gardens mashing and I would have been to Sunday Scho—\n\nOmnes.—Yes, you would.\n\nNatty.—Well, I said I would.\n\n(Enter left Sergt.-Major.)\n\nSergt.-Major.—I'll tell you where he would have been, boys. Standing about Round Church till a policeman told him to \"Move at the corner now.\" I would like to turn in now instead of going for a tramp, for I am so tired I could go to sleep standing.\n\nJim.—That's a standing lie.\n\nMickey.—Oh! he lies standing or lying.\n\nNatty.—Yes, or sleeping or waking.\n\nSergt.-Major.—Good evening. Had I thought that the exigencies of war would necessitate my associating with—ah—gentlemen of your courtesy, e'er I had allowed one scintilla of a patriotic thought to permeate the interstices of my peri-cranium I would have applied for a discharge, for such a heterogeneous conglomeration—\n\n(Interrupted by cries, and exits right. Enter rear Corpl of Guard.)\nCorpl. of Guard.—A buckboard with a mail, boys.\n\n(Party rushes out rear shouting and return carrying Dick and mail bag. Dick exits 2 R. E., party gathers right.)\n\nO.-Sergt. — Hurry up, Dick.\n\nScout.—There's nothing for you this time, general.\n\nMac.—Where is H. V.\n\nH. V.—H. V., that's me. I am everywhere.\n\nDeacon.—Quite a mistake, Beauty, this is mail time not meal time.\n\nBeauty.—No it's not, it's female time.\n\nChicken.—Don't be all night, Jim.\n\nJim—Cheer up, Scotty, there may be something for you.\n\nChicken.—It's a cold day when the orphans get left.\n\n(\"Last Post\" sounded. Enter right Dick.)\n\nDick.—Keep cool, boys. I hold in my hand the fate of many a mule. In a few moments some of you will be smiling as broadly as you have seen Beauty when his eye lights on slapjacks and syrup.\n\nBeauty.—Come on, Dick serve them out.\n\nDick.—The slapjacks you mean. Quite a mistake; I am not the cook. To continue, the other mules whose girls have gone back on them will feel like going behind the hospital tent and kicking themselves. Take my advice and save the kicks till you get back to Halifax and hunt up the other fellow. With these few remarks I surrender you your tidings of comfort and joy.\n\n(The mail is then issued and \"Lights Out\" sounded.)\n\nDick.—The mail goes at four o'clock, boys\n\n(Sentry in rear, orders lights out, and dispute ensues light finally extinguished. Deacon enters from tent, Sentry right challenges, after which Deacon goes rear.)\n\nH. V.—Halt! who comes there?\n\nDeacon.—Friend.\n\nH. V.—Advance friend! throw up your hands!\n\nDeacon.—Its all right H. V.\n\nH. V.—Throw up your hands.\nDeacon.—By George! he means business. (Hands up.) Say H. V. keep your finger off the trigger, that gun might go off, you know.\n\nH. V.—Oh! its you Deacon, all right.\n\nDeacon.—Put your head in soak it is a put up job among you fellows.\n\n(Returns to tent and door fastened; calls on occupants who all snore; finally crawls under the tent all quiet. Enters Charlie from tent and sings.\n\n(Orchestra)\n\nTHE FLAG AND HOME.\n\nAir.—\"Old Folkes at Home.\"\n\nSung by Lie.-CorpL. Pickford.\n\nWay out upon the open prairie,\nThe Rifles roam,\nAnd every lad while resting weary,\nDreams of his Bluenose home;\nOh! sea that is thy margin lying\nTown far away.\nOh! flag that's on thy hill-top waving,\nDown where our old folks stay.\n\nChorus.—Though to-morrow I lay dying,\nTo the lads I say,\nOh, brothers, keep the flag still flying,\nLet it o'er the country stay.\n\nSo fondly now doth memory tingle,\nHearts beating time;\nThat every soul doth sweetly mingle,\nIn love and honors chime,\nIn thought to thee I'm ever turning,\nHome far away.\nAnd love is ever constant burning,\nBrighter by night and day.*\n\nCho.—Though to-morrow, &c.\n\nFoes now within our land are swarming,\nIts life to slay,\nYet for the flag our love is warming,\nIt o'er the land must stay,\nSo we will crush out all disorder,\nTreason will lay.\nAnd make the lines of freedom broader,\nThe flag o'er our land must stay.\n\nCho.—Though to-morrow, &c.\n\n(Curtain.)\nTABLEAU.—Detachment—Four Deep, Prepared for Cavalry.\n\nCEDE NULLIS.\n\nAIR.—\"The Old Brigade.\"\n\nBY PRIVATE R. BLACKMORE.\n\nWhere are the boys of the Sixty-Third\nWho drilled with us side by side?\nShoulder to shoulder was ever the word\nDown by Chebucto's tide;\nThose who fear not battle's roar,\nRiflemen trusty and true,\nWe are but part of the dark green corps,\nWhere are the lads we knew?\nThen steadily shoulder to shoulder.\nHeads erect, boys, firmly tread,\nBravely we'll hold CEDE NULLIS,\nOr sleep with our country's dead.\n\nChorus.—Then steadily shoulder to shoulder,\nHeads erect, boys, firmly tread,\nBravely we'll hold CEDE NULLIS,\nOr sleep with our country's dead.\n\nOver the hills far away they wait,\nFar from the sound of strife,\nWaiting to hear of each comrade's fate\nWho offers the land his life.\nNot in our serried ranks they stand,\nBut they'll obey the call,\nAnd well we know that each comrade's hand\nWill hold our flag if we fall.\nThen steadily shoulder to shoulder,\nHeads erect, boys, firmly tread,\nBravely we'll hold CEDE NULLIS,\nOr sleep with our country's dead.\n\nCho.—Then steadily, &c.\n\nGOD SAVE THE QUEEN.\n\n(Curtain.)\n\nOMITTED IN CAST:\n\nNitchie..............................................Lee-Corpl. F. R. Brown.\nMANAGEMENT.\n\nChairman.\nMAJOR WALSH.\n\nMusical Conductor.\nW. HARRY WATTS.\n\nStage Management.\nSERGT. L. DIXON, PVT. C. W. MYLIUS.\n\nSecretary-Treasurer.\nLIEUT. BUTLER.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30229.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 45, "total-input-tokens": 73504, "total-output-tokens": 17276, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 880, 3], [880, 2008, 4], [2008, 2152, 5], [2152, 2152, 6], [2152, 2654, 7], [2654, 2654, 8], [2654, 4895, 9], [4895, 7543, 10], [7543, 8723, 11], [8723, 10327, 12], [10327, 11821, 13], [11821, 13400, 14], [13400, 15486, 15], [15486, 16693, 16], [16693, 18404, 17], [18404, 19999, 18], [19999, 21578, 19], [21578, 23638, 20], [23638, 25606, 21], [25606, 27379, 22], [27379, 28848, 23], [28848, 30515, 24], [30515, 32031, 25], [32031, 33315, 26], [33315, 35138, 27], [35138, 36495, 28], [36495, 37898, 29], [37898, 39554, 30], [39554, 41352, 31], [41352, 42715, 32], [42715, 45312, 33], [45312, 47581, 34], [47581, 49252, 35], [49252, 50786, 36], [50786, 52505, 37], [52505, 54062, 38], [54062, 55808, 39], [55808, 57411, 40], [57411, 58799, 41], [58799, 60023, 42], [60023, 60023, 43], [60023, 60187, 44], [60187, 60187, 45]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]