[{"id": "8f72dcd7bc1691d905a42c7bbad990ff7b5b5aa6", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL'Institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couverture de couleur\n- [ ] Couverture endommagée\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Le titre de couverture manque\n- [ ] Cartes géographiques en couleur\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Planches et/ou illustrations en couleur\n- [ ] Relié avec d'autres documents\n- [ ] La reliure serrée peut causer de l'ombre ou de la distortion le long de la marge intérieure\n- [ ] Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nPages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image.\n\nLes pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n\n4 5 6\nA SERMON,\n\nBY THE\n\nREV. W. AGAR ADAMSON, D.C.L.\n\nChaplain to the Honorable the Legislative Council of Canada.\n\nPREACHED IN THE CATHEDRAL, QUEBEC,\nON\nWEDNESDAY, 26TH APRIL, 1854.\n\nQUEBEC.\n1854.\nMy Dear Dr. Adamson,\n\nIn expressing the wish of those whose names are subscribed to the accompanying Paper, that you would kindly consent to the publication of your eloquent and impressive Sermon delivered in the Cathedral on Wednesday last, being the day set apart for humiliation and fasting on account of the War between our Country and Russia, I at the same time beg leave to enclose the sum of £40 being the amount which these Gentlemen have coupled with their request for its publication, and which I have much pleasure in handing to you.\n\nI have the honor to be,\n\nDear Sir,\n\nYour's truly,\n\nEDWD. BOWEN.\n\nQuebec, 29th April, 1854.\n\nTo the Reverend\n\nW. Agar Adamson, D. C. L.\n\n&c. &c. &c.\n\nLieut. Genl. Rowan,\nThe Lord Bishop of Quebec,\nRevd. Dr. Mackie,\nSir James Alexander, A. D. C.,\nLieut. Col. The Honble. R. Bruce,\nHonble. J. Rolph,\nThe Honble. Chief Justice Bowen,\nThe Honble. Mr. Justice Meredith,\nThe Honble. Henry Black,\nThe Honble. William Walker,\nThe Honble. Atty. Genl. J. Ross,\nC. E. Anderson, D. R. G.,\nLieut. Col. Wullf, R. E.,\nLieut. Col. Thorndike, R. A.,\nLieut. Col. Stack, 71st. L. I.,\nCapt. Hope, 71st. L. I.,\nCapt. Blennerhasset, 71st. L. I.,\nCapt. Prince, 71st. L. I.,\nCapt. Rich, 71st. L. I.,\nLieut. Johnson, 71st. L. I.,\nEnsign Campbell, 71st. L. I.,\nEnsign Bonham, 71st. L. I.,\nCapt. Phillips, R. A.,\nLieut. Cairns, R. A.,\nLieut. Rankin, R. E.,\nLieut. Brackenbury, R. A.,\nLieut. Noble, R. E.,\nG. B. Symes,\nWm. Price,\nR. Wainwright,\nH. Burstall,\nJ. Tilstone,\nA. D. Bell,\nJ. B. Forsyth,\nH. Anderson,\nWm. Wood,\nHonble. R. Harbord, 71st. L. I.,\nH. S. Anderson,\nH. Cairns,\nJ. Green,\nA. Campbell,\nJno. Cochrane,\nThos. Hammond,\nF. Roche,\nE. A. Meredith,\nA. Holwell, Ordnance,\nA. Stuart,\nF. Andrews,\nJ. Pentland,\nJ. C. Tarbutt,\nC. D. Shanly,\nThos. Hector,\nH. Gowan,\nE. Lemesurier,\nJ. Maxham,\nT. Patrick,\nE. Wilson,\nE. W. Jones,\nA. Taylor,\nS. H. Ayers,\nR. Barrett,\nR. Connor,\nJ. T. Wilson,\nMajor Biscoe, 66th Regt.,\nCapt. Arthur Pilkington, 66th Regt.,\nE. W. Aylmer, 66th Regt.,\nJames Sewell, M. D.,\nS. Derbishire,\nJ. V. Gale,\nCapt. Reeve,\nJ. F. Bradshaw,\nE. Poston,\nRobt. Hamilton,\nCapt. Wetherall, A. D. C.,\nDr. Burton,\nH. J. Noad,\nFennings Taylor,\nHenry Lemesurier, Junr.,\nCapt. & Mrs. Rhodes,\nH. S. Scott,\nJ. F. Taylor,\nGilbert Griffin,\nW. H. Griffin,\nChs. Montizambert,\nJames Clapham,\nLieut. Savage, R. E.,\nThomas Lloyd,\nEdward Burroughs,\nR. Maxwell,\nPemberton Brothers,\nCharles Phillips,\nHon. E. M. Fraser,\nR. E. Cairnes,\nW. Ford,\nJ. Muir,\nGeorge Irvine,\nDr. Simpson, 71st. Regt.,\nS. D. Hamilton,\nE. Wilson,\nJohn Carter.\n\nQUEBEC, MAY 1ST. 4854.\n\nMy Dear Chief Justice,\n\nHowever much you and other friends, whose names are associated with your own, may be mistaken in the estimate which your partiality has formed of my Sermon on the occasion to which you refer, I, at all events, very sincerely desire to express my sense of your approval and your kindness.\n\nThat Sermon was written hastily, without any view to publication, and amid other duties. I have no doubt therefore that the interest it has acquired in the minds of the listeners has not sprung from any intrinsic merit of its own, but from the same source which inflamed the mind of the Preacher, the sympathy we all feel with our beloved Mother Country and the Gallant Nation with which she is allied in the noble and generous struggle in which they are engaged.\n\nA kind friend having generously offered to print the Sermon gratuitously, I am enabled to hand to the Bishop of Quebec, the whole of the sum which you have enclosed to me in order to augment the amount already contributed towards the maintenance and support of the Wives and Children of the gallant Soldiers who have gone to the War.\n\nI have the Honor to be,\n\nDear Sir,\nFaithfully Yours\n\nW. AGAR ADAMSON.\n\nThe Honorable\nChief Justice Bowen,\n&c. &c. &c.\nSERMON.\n\n58th CHAP. ISAIAH, 6th & 7th VERSES.\n\n\"Is not this the fast that I have chosen? to loose\nthe bands of wickedness, to undo the heavy\nburdens, and to let the oppressed go free, and\nthat ye break every yoke? Is it not to deal thy\nbread to the hungry, and that thou bring the poor\nthat are cast out to thy house, when thou seest\nthe naked that thou cover him, and that thou hide\nnot thyself from thine own flesh?\"\n\nThere are my Brethren, but few in our com-\nmunity whose experience embraces an occasion\nlike the present; when the dire necessity and sad\ncasualties of War suggest the duty of fasting,\nhumiliation, and prayer. With some, memory,\nmercifully enfeebled, may but dimly retain the\nrecollection of the past. With others, trials of a\nmore recent and personal nature may have deaden-\ned thought, and obliterated the terrible traces of\nby-gone calamities, but with most, youth and inex-\nperience have concurred in imparting to the grim\nvisage of War, milder features than those which\nthe hideous monster must ever wear. Blessed be\nGod, time heals many afflictions, fresh employ-\nments moderate old regrets, new scenes extinguish\nold sorrows, and so it comes to pass that the per-\nsonal sufferings of one generation descending to\nthe next in a traditionary form only, fail to affect\nthe heart in the dreadful manner in which the\nsterner teacher, Experience, inculcates his hard and\nbitter lessons.\nA period of scarcely less than thirty-nine years has elapsed since the echo of the last cannon died upon the Ear of embattled Europe—since praises and thanksgivings were poured forth to the Author of all good for having restrained the madness of the people and mercifully determined the miseries of War. Confederate monarchs united in ovations of joy, congregated multitudes mingled gratitude with their gladness as they blessed God that the ambition of rulers had been appeased, and the violence of nations quelled into repose. Warm indeed was the welcome, when after a quarter of a century of banishment, the sweet Dove of peace again returned to brood amid the nations of Europe.\n\nThirty-nine years have elapsed since these fair promises were cherished, and though there are many who can never forget the bloodstained record, still individuals as well as communities, have rather been occupied in the consideration of those duties which peace imposes upon civilization, than in dwelling with vain regret upon disasters which have passed away. Our own beloved land, has, we believe, been foremost in promoting these works of amelioration, these labors of love. The Slave, whose condition had in a manner been humanized during the period of War, has been emancipated since the reign of peace, his shackles have been smitten in the dust, and a pledge is thus afforded that the inhabitants of a fourth portion of the globe may yet have reason to rejoice in the blessings of freedom. Political disabilities, have in many particulars been\nmodified, and men have thus learned not only to respect themselves, but to regard with increased interest the country of whose well-being they have become the enfranchised guardians. The humbler classes have been elevated in the social scale. Labor is now regarded as a property, and thus the children of toil, having a vested right in their industry, are no longer looked upon as the unprotected drudges of exacting employers. The axiom has been avowed, and acted upon, that Property has its duties as well as its rights, and one, not the least prominent of these duties, being the instruction of the people, it has followed that the blessings of education have been more generally diffused, Science and Literature have shed abroad their beneficent influences, Art and Taste have elevated the general mind, Wealth and Enterprize, have scattered their blessings broadcast, and Trade and Commerce have concurred in knitting in a common bond, what were generally supposed to be clashing and alien interests.\n\nNor, my Brethren has this interval of peace been occupied in the promotion of sublunary objects only. Oh no, duty to man has not been considered as separated from duty to God. We hope and believe that the work of peace has not been estranged from the work of piety, or that the advantages of commerce have been studied without regard to the claims of charity.\n\nWe believe that in our own beloved Church there has been a great awakening. The chill and cold which seemed to cling like frost work about her\nservices have disappeared; the clarity which was formerly forgotten, or only grudgingly doled out, has of late been manifested in active and well directed benevolence. Her Ministers have, in the fatherland, greatly multiplied in numbers and in zeal, Her Members have also become augmented in a most satisfactory ratio. Her Episcopate has become widely extended, and in the increased number of Her Bishops and Missionaries we have the assurance that the blessings of Her Ordinances will be proportionably diffused. The Church and the State have concurred, though in diverse manners, to foster the growth of blessings for time and for Eternity, blessings whose culture is most advantageously carried on under the genial influence of Peace. But, while we solace ourselves with the satisfactory idea that much has been done, let us never lose sight of the sentence of inspiration, that \"we are but unprofitable servants,\" let us never forget what, alas! may be but too apparent to the Omniscient Judge of all men, that having failed to accomplish what the occasion permitted, God has visited us with His Judgments, making affliction His minister to teach us what prosperity has failed to inculcate. For let us be well assured that Almighty God \"who does not willingly afflict or grieve the children of men,\" has His own special objects to carry out when He visits them with War or Pestilence or Famine. Let us be well assured, though we see it not, that He is most certainly hastening His Kingdom, and that the day is nearer at hand than we wot of, when He shall take \"His Great Power and Reign;\" Let it be our hope and\nprayer, that when He shall accomplish the number of his elect, and hasten his Kingdom, we may be found among the favored instruments of His will, \"who makes even the wrath of man,\" subserve to His eternal praise.\n\nIn the meanwhile, the duties of humanity and civilization have been arrested, the occupations of Science and Literature have been suspended, the offices of Art and Taste have been laid aside, for the blessings of peace are at an end. The sword which has so long slumbered in the scabbard is again unsheathed, the cannon which has kept harmless jubilee at fête and festival, is now to be laden with mischief and prepared to hurl destruction with the tones of its booming voice. Militaty pomp and pageantry will become merged in the wild tumult of sack and slaughter, and Fathers, Sons, Brothers, Lovers, Husbands, our friends and intimates in the family circle and in social life, may soon have to engage, aye, may even now be engaged with the foe in deadly combat. In the presence of such impending calamity, it well becomes us to humble ourselves with fasting.\n\nHaving appealed to the sword, and evoked the aid and blessing of the God of Battles, it is no light source of comfort and satisfaction to us, my Brethren, to feel that whatever may be the issue of this contest—it was not of our own seeking. Indeed, we all know what diligence and patience have been used to avoid this War; to what an extent forbearance has been carried, how diplomacy has been taxed, and mental ingenuity resorted to for the purpose of appeasing an insa-\ntiable ambition, and of averting from Europe, at any cost, save the sacrifice of duty, the horrors and miseries of War. But, the cupidity of the aggressor was only to be appeased by plunder, His craving avarice must be gratified with spoil, for his insatiable ambition, blind to either personal or national rights, has trampled both under foot. Insensible to moral restraint, he has ignored every bond to which he was a party, and by seeking to strip his neighbor of the heritage which had been guaranteed to him by successive treaties, he has shown himself alike indifferent to personal honor and to national rights. So shameless, indeed, have been these infamous transactions, that one after another the supporters of the Russian Emperor have been disarmed. New facts and new revelations have torn to shreds every argument on which they placed reliance. Those who felt inclined in the first instance to excuse him, have been constrained to retire in disgust from the side they had espoused, and cease even to extenuate a cause, which formerly they attempted to defend. The most forbearing portion of our countrymen seem almost unanimously to concur in opinion, that peace can no longer be maintained with honor, and many think it would be incompatible with safety; for the acquisition by Russia, it has been said, of the territory she covets, would render its possessor all powerful for conquest. It would open the path for new hordes of barbarians to pour into Europe from Asia, and hasten a day, which we pray may never dawn, when a new Attila should slumber within the walls of Paris,\nand a new Genseric repose amidst the Palaces of Westminster.\n\nIt is a War wholly unprovoked and wholly unjust. It is an attempt of the strong to trample upon the weak, it is the practical application of the robber law.\n\n\"Let them get who have the power,\"\n\"Let them keep who can.\"\n\nIt is a War entirely wicked on many other grounds, upon which time and this occasion forbid that I should enter, but in the simple view of its being \"might against right,\" it has awakened every heart that can be touched by courage, roused by honor or moved by chivalry, to arise on behalf of the oppressed, and to chastise the oppressor.\n\nNo such unanimity of sentiment was ever before manifested; the thronged Cities and sunny villages of England, the wide pastures and blue hills of Scotland, the verdant valleys and lofty mountains of beautiful Ireland, seem as if they contained but one heart alone, animated by one sentiment, and determined as one man to uphold the right and to avenge the wrong.\n\nNor, my Brethren are we unmoved or indifferent listeners to the news from Europe. The blood of the old world courses through the veins of the new. In the enjoyment of the blessings of freedom, our hearts go with our country in her desire to maintain freedom elsewhere. Nor are we, the inhabitants of these Provinces, the only portion of her transmarine children who can find pride in the greatness, the generosity and lofty spirit of our mother country.\nOh no! for could we travel the bright track of day, could we follow the music of our morning-drum as it circles the globe with its stirring notes, we should find that wherever there stands a British Post \"in tower or fort or tented ground.\" Wherever the red cross flag waves over the head of the Anglo Saxon, the Prayer would be upraised to the King of Kings to \"prosper the Arms of our Sovereign and to confound the devices of her Enemies.\"\n\nLet us not, however, forget the consequences which must attend the impending strife, for, whether we prove victors or whether we shall be vanquished, the results to which I am about to refer, must follow.\n\nWe may, and who shall hinder us? we may, with the countless thousands of Our Sovereign's subjects, lift up our hearts and voices, and, in the sublime language of our National Hymn, say:\n\n\"Oh! Lord, our God, arise,\n\"Scatter her enemies,\n\"And make them fall.\"\n\nWe may hope, and oh! how dreadful the necessity that justifies such a hope, that the flag of our Country unfurled, in faith, on the banks of the Danube, may float in triumph from the ramparts of Sebastopol, that the same meteor Ensign which flouts the breeze in the troubled waters of the Baltic, may fan the air from the glittering domes of St. Petersburgh. We may hope that the escutcheon of our Country shall be blazoned with the names of new victories, for it is for virtue and not territory she struggles, it is for peace and not con-\nquest she fights. And in the glory roll of history, it shall be hereafter recorded to their imperishable honor that when she, and the gallant nation with which she is allied, united their might and mingled their arms in a common cause, it was not for selfish objects they forgot their ancient animosities, but rather that they might consecrate their courage to the noblest aims, and do battle for the peace, civilization and happiness of the world. There are, however, considerations in connection with our hope and prayer, that we could not fail to notice, even did not the words of my text bring them prominently before us. To punish a crime, to protect an ally, and to maintain the integrity of treaties, great personal sacrifices are necessary. Various, indeed, are the contributions which have been and must he made to uphold the fame and greatness of our Country. Thought and labor of no light order fall to the lot of our public men. Toil in the cabinet, Toil in the Senate, Toil at home, and toil abroad. Oh! who may compute the measure of the Statesman's anxiety? And think you that our countrymen and countrywomen in the old land and among the families in this Province, as well as in countries remote from this, are indifferent or grudging contributors to the necessities of this contest? No, Already has the war made its first instalment of exaction. Many a fond wife has with bitterness of heart surrendered the partner of her joys, the father of her children, the provider of bread, and sent him forth as her contribution to the war. Many loving parents, too, have, with their blessing, sent forth their son, the inheri-\ntor of their name, the hope of their age, the solace of their life, as their contribution to the war. Sisters, tender and well favored, have found themselves without their guardian and protector, that by the services of their brother they might make their contribution to the war. And other hearts, besides those knit together by the tie of kindred, hearts wreathed by youth and hope in the gentle bondage of love, have made their contribution to the war, unconscious, it may be, of the unwedded widowhood which awaits them. Nor are these the only contributions, for while fathers, sons, brothers and lovers are engaged in the field, these and other gentle ones besides, will raise their hands, unequal to any hostile weapon, towards heaven, and blend with their confiding prayer, the sacrifice of their broken hearts, and thus prove, it may be, meet offerings to the war. And, my brethren, may we not speak of our soldiers and our mariners? the youth, the blood and the pride of our land, they contribute their honor, their courage and their fidelity to the war. Other lips than mine have sung their praises, other tongues have pronounced their panegyric, other pens have chronicled their fame. The courage of the British sailor has passed into a proverb, the valour of the British soldier has never been challenged, the fame and glory they have acquired on many a troubled sea, on many a well fought field, will not only be worthily guarded, but enshrined in fresh honor it will be transmitted, as a precious heirloom, to ages yet unborn.\n\nEvery appliance that wisdom can suggest, or skill devise, will, we believe, be brought to bear\nupon this contest. Every benefit that courage can achieve or heroism perform, will, we dare affirm, shed its lustre upon this war.\n\nBut let us remember, the remembrance will come full soon, that we are engaged in no little war, that we are opposed by no feeble enemy. The strength and experience of our foe, coming into collision with the martial ardour of our forces gives assurance to the fact, that wherever the red cross flag shall be borne in triumph, it must be carried over waves of death and fields of slain.\n\nWho amongst our friends shall sleep in those liquid chambers? who upon the unsheltered battle field shall bite the dust in mortal agony? Who? Oh! these are some of the considerations with which our hearts are laden. Considerations which should inspire our thoughts, breathe in our prayers, and quicken our charity. These are some of the considerations which should induce us to humble ourselves with fasting, meditation and prayer.\n\nWe shall full soon, my brethren, experience, that our supplications will have an ardent, personal, tender and touching earnestness when we beseech our \"good Lord\" to \"succor, help and comfort all that are in danger, necessity and tribulation.\" Bitterness will point our prayers as we beseech our \"good Lord\" to show \"pity upon all prisoners and captives.\"\n\nNumerous, and precious to many of us will be the memories of those whose names we shall recall as we beseech our \"good Lord,\" to \"defend and provide for the fatherless children, and widows...\"\n\"and all that are desolate and oppressed.\" Desolate and oppressed! who may they be? who can they be, if not the wives and children of our countrymen who have gone to the war?\n\nThe prophet Isaiah in the verse preceding our text, states the negative of his proposition, the character of the fasting and humiliation which is not acceptable to Almighty God. In the words of the text, on the contrary, we are succinctly informed of the characteristics of that humiliation which is pleasing to him. \"This is the fast that I have chosen, to loose the bands of wickedness, to undo the heavy burdens, to let the oppressed go free, and that ye break every yoke, to deal thy bread to the hungry, to bring the poor that are cast out to thy house when thou seest the naked that thou cover him, and that thou hide not thyself from thine own flesh.\" Alms giving as well as prayer should characterize our humiliation—we should deny ourselves that we may benefit others—we should impose restraint that we may practise charity. Good works should quicken our sympathy, and compassion find expression in benevolence, and when the objects which claim our help and pity are such as we are called upon this day to relieve, we think a fitting opportunity occurs for us to illustrate our sense of the fasting chosen by the Lord, and enjoined by his Prophet. Another end will also be gained, for our contributions however small in their amount will not only augment the fund which has been generously created by the bounty of our countrymen at home, but will, at the same time, evince the sympathy we\nfeel with our beloved, though distant land, in the struggle upon which she has entered.\n\nIt is almost presumptuous to enforce the claims of this duty upon your notice; appealing so directly to the human heart, as it does, it scarcely needs the advocacy of the human voice, yet my brethren, as it is my privilege to address you this day, I must claim your pardon, if in my earnestness I urge you to do that which your own benevolent natures would prompt you spontaneously to perform. I speak, my friends, for the noble and the generous, for they are British Soldiers whose claims I would advocate. I speak for those who have gone to fight for Britain's honor, to bleed for Britain's weal, perhaps to die for Britain's sake. They are the depositaries of a sacred trust, for they, the flower of our youth are the guardians of our insulted honor. They, we know, will do their duty and fulfil their trust, and let us hope that from the deathbed of fame, on which many will sleep, they may raise their eyes, prayerfully, to the heavens above them, and die full of hope that when the true and faithful shall rise to the life immortal they may be found to have been \"Soldiers and Servants\" in that glorious army of which the \"Captain of our Salvation\" is the King and Chief.\n\nBut, while the British Soldier is prepared to give his life for British honor, he has left something in the way of claim on British generosity and kindness. In their desolate home, which alas, will afford but brief shelter, he has left his wife, his children, his babes to combat the rough world\nalone. Oh! shall it be, that while the husband and father has gone to contend with the Northern Ravager in his strongholds, his wife and children shall have to struggle with wolf-eye'd want in their own country? shall it be, that, while the husband and father is instrumental in adding fresh glory to the scroll of British renown, his wife shall bear a pauper's name, his children live on Parish penury? Oh no, my brethren this should not, may not, must not be. The husbands and fathers who give us their lives, have a right to expect that we shall afford to their children bread and shelter. That we shall protect them, as far as in us lies, from destitution, and it may be from degradation also.\n\nEvery manly, every grateful sympathy prompts to this end, and we are bound to defend in their helplessness those, whom our brave defenders have consigned to our care.\n\nAnd let us be well assured, my brethren, that the Author and giver of all good things, who by the mouth of his holy Prophet has declared that our fasting and humiliation should be evidenced by our desire to \"loose the bands of wickedness, to undo the heavy burdens, to let the oppressed go free, to break every yoke, to deal our bread to the hungry, to bring the poor that are cast out, to our house, and to cover the naked with clothing,\" will charitably receive this work of ours, and our blessed and adorable Redeemer, who has promised the blessing of mercy to the merciful, will not regard our charity with displeasure, when the objects would succour are the wives and children of brave and faithful British Soldiers.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_43250.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 25, "total-input-tokens": 40258, "total-output-tokens": 7522, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2196, 3], [2196, 3321, 4], [3321, 3514, 5], [3514, 3514, 6], [3514, 4592, 7], [4592, 5328, 8], [5328, 5996, 9], [5996, 7318, 10], [7318, 8726, 11], [8726, 10262, 12], [10262, 11773, 13], [11773, 13389, 14], [13389, 14938, 15], [14938, 16528, 16], [16528, 17966, 17], [17966, 19414, 18], [19414, 21049, 19], [21049, 22686, 20], [22686, 24187, 21], [24187, 25762, 22], [25762, 27326, 23], [27326, 28915, 24], [28915, 28915, 25]], "primary_language": ["None", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]