[{"id": "29634f5de9f0233225e76be661a9f1d5f148777d", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☑ Covers damaged/\nCouverture endommagée\n\n☑ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☑ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n☐ Coloured pages/\nPages de couleur\n\n☐ Pages damaged/\nPages endommagées\n\n☐ Pages restored and/or laminated/\nPages restaurées et/ou pelliculées\n\n☑ Pages discoloured, stained or foxed/\nPages décolorées, tachetées ou piquées\n\n☐ Pages detached/\nPages détachées\n\n☑ Showthrough/\nTransparence\n\n☑ Quality of print varies/\nQualité inégale de l'impression\n\n☐ Includes supplementary material/\nComprend du matériel supplémentaire\n\n☐ Only edition available/\nSeule édition disponible\n\n☐ Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\nLes pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nThe following items shall not be filmed:\n- TINTINUM, a serial publication, (except selected complete issues)\n- Maps, charts, plans, diagrams, etc.\n- Standard book forms without distinctive cover design\n\nMaps, charts, plans, etc., may be filmed separately from the text if they are sufficiently different from the text. The separate film of each map, chart, plan, etc., will be catalogued as a separate item.\n\nThe following materials are not filmed:\n- Blank pages\n- Pages with only a few words\n- Pages with a great deal of space unused\n- Pages all or nearly all in shadow\n- Pages with excessive marginal notes\n- Pages that are completely blank\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 4 | 5 | 6 |\n|---|---|---|\n|   |   |   |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nA Scotch Farmer's Success in the Canadian North-West\n\n1890, Told by Himself.\n\nWith Illustrations from Photographs Taken on His Farm.\nRAILWAY LANDS.\n\nTHE CANADIAN PACIFIC RAILWAY COMPANY have for sale a number of Choice Farms in the Brandon District, shown on the accompanying Map, on the following easy terms:\n\nTERMS OF PAYMENT.\n\nIf paid for in full at time of purchase, a Deed of Conveyance of the land will be given; but the purchaser may pay one-tenth in cash, and the balance in payments spread over nine years, with interest at six per cent. per annum, payable at the end of the year with each instalment.\n\nPrice Lists can be obtained on application to the Company's Land Commissioner, Winnipeg.\n\nL. A. HAMILTON,\nLAND COMMISSIONER.\nA SCOTCH FARMER'S SUCCESS\n\nIN\n\nTHE CANADIAN NORTHWEST\n\nTOLD BY HIMSELF.\n\nWith Illustrations made from Photographs taken on his Farm.\n\n1890.\nA SCOTCH FARMER'S SUCCESS\n\nIN THE\n\nCANADIAN NORTHWEST.\n\nTWO HUNDRED MILLION ACRES.\n\nTwo hundred million acres is the estimated area of fertile lands in the Canadian Northwest. It can well be imagined that, in a territory so vast, localities can be found that possess special characteristics for the growth of wheat. Broadly speaking, farming as practised in this portion of Canada is of three kinds: Wheat growing, mixed farming, cattle and horse raising. For instance, the Province of Manitoba, which is the banner wheat Province, raised in one season thirteen million bushels of wheat, while the District of Alberta and Western Assiniboia supported last year, entirely on their natural grasses, 150,000 cattle, 15,000 horses, and 50,000 sheep. It is the purpose of this pamphlet to give the farming experience of a Scotchman who has been eminently successful in following that branch of agriculture known as wheat raising.\n\nBRANDON, MANITOBA, December, 1889.\n\nMr. L. A. Hamilton, Land Commissioner, Canadian Pacific Railway, Winnipeg, Man.:\n\nDear Sir,—As the time for my departure for Scotland approaches, I feel that it will be impossible to give you an extended and detailed account of my experience as a farmer in this magnificent country, but I enclose you for\npublication, if you approve, a short sketch, which was written from notes taken of an interview with me some time ago, in which the facts are as therein stated, and which covers the ground fully and well, and presents briefly the points that I think would be of interest to those asking for information about farming in Manitoba on a large scale, as seen from the standpoint of an actual farmer. It may also be of interest to you to know the result of my last season's work.\n\nI have now in my farm 2,500 acres, and of this I had under crop 800 acres, over 700 of which was in wheat, which yielded 17,000 bushels. The result, considering the unusually dry season, was highly satisfactory to me, giving a handsome profit on the season's work.\n\nI commenced seeding about the 26th of March, harvesting on the 8th of August, and had the whole crop not only cut and threshed, but delivered at the Brandon Elevator ready for shipment by the middle of September. The wheat turned out a splendid sample, nearly the whole of it grading No. 1 hard and No. 1 extra.\n\nI have 1,750 acres fall ploughed and harrowed, so that I can take advantage of the first opportunity in the spring for seeding. I think it of the greatest importance that the farmer should not only plough in the fall, but harrow as well. It is largely to this that I attribute my unvarying success.\n\nI send you copies of some photographs, made this year, of farming scenes taken at my home. They will give you a better idea of farm life than I can do by writing a descriptive article. In the article enclosed there is only an outline of the method I have adopted, but I will be glad to answer any letters received from those desiring information about Manitoba farming that may be addressed to me at Brandon, Manitoba.\n\nJ. W. SANDISON.\n\nTHE STORY TOLD.\n\nIt is often noted by observers that Manitoba has its greatest admirers amongst those who live within its borders, while its detractors are almost invariably either lazy-bodies, who have lacked sufficient industry to succeed, or else men who never lived in the Province at all.\nIt is only within recent years that one of many instances of what a man can accomplish there, who has industry, ability, push and good judgment, has come before the public. Reference is here made to Mr. J. W. Sandison, who is the successful proprietor of a large wheat farm, some four miles from Brandon, and who has actually under cultivation 2,000 acres.\n\nThe story of his experience in Manitoba, as told by himself, is one which is full of encouragement to young men of industrious habits and good capabilities, intending to take up their abode in that land.\n\nMr. Sandison is a Scotchman, who, after having had a good experience in farming in the Old Country, came to Canada. He farmed in Ontario for a couple of years, and in 1883 resolved to try how a healthy experience and industry would profit him in Manitoba.\n\nThither, then, he went, without capital, relying solely on his own individual efforts, and his career, as will be seen, has been remarkably successful.\n\nHe commenced his Western life by hiring out on a farm for one year at $26 (about £5 5s.) a month. The farm was situate near Brandon, and was a good one. While working as an employé, he had a good opportunity of examining the farming system in the country, and gathering some information, which has proved of extraordinary value.\n\nAfter quitting work as an employé, Mr. Sandison resolved on trying it on his own hook. At first he took a homestead some fifty miles from the Canadian Pacific Railway, but he soon gave that up, concluding that to rent or buy a farm near the line was much more profitable. So, in the second year from his leaving Ontario, he rented a farm of 320 acres within four miles of the C. P. R., and near Brandon.\n\nHe concluded that, in Manitoba, land of the highest price was the cheapest in all cases, and that a man can within two or three years own land for which he has paid $10 or $15 (£2 to £3) an acre, within five to fifteen miles of a railway, while a man working a farm as far back as thirty miles from the line, will practically be able to do nothing.\n\nHe found that a great many people in Manitoba made a mistake in buying say 320 acres of land, and, instead of making every foot contribute a return, only working a little of it at first, and thus be paying interest on land which\nwas yielding no profit, or otherwise have his money lying idle in the land. He worked on the theory above enunciated, and in a very short time was the owner of his land.\n\nOn another point he showed his good judgment. As soon as he was able, he bought the best horses he could procure. This he found more profitable than purchasing inferior or worn-out animals.\n\nHaving got control of half a section, he broke it up at once, and made it pay for itself; then he bought a section, following the same method with it, and now, according to his estimate, the value of capital he has lying in labor alone is equal to $10,000 (£2,000), a pretty good showing, indeed.\n\nAnother point regarding farming in Manitoba which Mr. Sandison brings forward is that the country is particularly adapted to farming on a large scale. It is, or should be, the ambition of every farmer to increase his holdings and the acreage of his crop, and he is perfectly right in this, so long, of course, as he has the labor and machinery to harvest the crops he sows.\n\nIn Manitoba the land is generally level, the fields are square, the furrows a mile or half a mile long, and consequently the farmer can make a correct estimate of the cost of his labor, since each man is required to do a like amount of work at the plough.\n\nAccording to Mr. Sandison's idea, farming is much easier in the Prairie Province than in either the Old Country or Ontario, and, as has been already said, he speaks from actual experience. In the first place the cost of the land is at least one tenth less in Manitoba than in either of the above-mentioned older countries. Then, on the whole, the land is more productive, and a superior article is produced, and especially is this so in regard to wheat.\n\nIn Manitoba it is not necessary to invest money in large barns to house the crops. It is not necessary to invest money in underdraining, as in older countries; neither does the farmer have to provide fencing, except on his permanent pasture. Especial attention should be given to these facts above stated. He also contends that the land is much easier to work, as one-third or one-half more can be prepared in a day than in these older countries.\nTHE YOUNG MAN'S CHANCE.\n\nSpeaking of the prospects of young men going out to Manitoba, Mr. Sandison says there is no difficulty in getting on, if the emigrant is willing to work hard and has a level head; but he is particularly emphatic in advising no one to go there without capital who is not ready to put his whole powers of labor into the work. For the first two years he worked very hard himself at manual labor, but now he finds his time fully occupied in managing his large farm.\n\nHe is convinced that Manitoba is destined to be the agricultural country of the Dominion; and, even now, people undervalue the vitality of the soil, as he considers it is much stronger than the general public imagines. From his own experience he is of the opinion that the much-talked-of summer frosts will be comparatively harmless, as soon as the inhabitants come to thoroughly understand the climate, and those parties who have, so far, suffered thereby have been themselves to blame in not doing their work in the proper season.\n\nGOOD MARKETS.\n\nThere is no lack of a market, and the competition among the buyers is very keen.\n\nThe Manitoba farmer has this advantage: His wheat is worth ten cents a bushel more in the Eastern Market than that of his Eastern competitor, and this advance in price goes a long way to counterbalance the extra cost to the Manitoban of transportation.\n\nMADE MONEY EVERY YEAR.\n\nReferring to his own business affairs and his success, Mr. Sandison says that there has not been a year since he went to the country that he did not make money, and if he were to be approached with an offer of $10,000 for the chance of his profits in 1890, he would not feel at all inclined to take it.\nAfter having farmed in Ontario and Manitoba, he is convinced that he could not have accomplished the same results in any of the older provinces.\n\nBRANDON DISTRICT.\n\nThis district forms part of the central prairie region, extending from Carbery, on the main line of the Canadian Pacific Railway, westward to Moosejaw, a distance of 300 miles, embracing a solid block of fully twenty-five million acres of the richest wheat raising lands. The soil is generally a clay loam of varying depth, not so heavy or sticky as the lands of the Red River valley; consequently, more easily worked, and possessing all the food that the wheat plant requires for its successful growth. The district is well watered by the Assiniboine, Little Saskatchewan, Oak and Souris rivers, all of which streams are timbered along their banks. The prairie level is broken south of the track by the Brandon Hills, a group of hills dotted over with clumps of timber, and intersected by many small lakes. The timber lining these rivers and covering the hills, along with that in the wooded district east of the Assiniboine River, furnishes a fuel supply for the farmers. Brandon, Douglas, Chater, Kenmay, Alexander and Griswold, as market towns, divide the business of the district; each of these places boasts of one or more elevators, and have their quota of grain buyers. Brandon is the county town, and next in size and importance of the towns of Manitoba to Winnipeg. West of Brandon, the country in 1881 was practically a wilderness, there being only one old settler on the north bank of the Assiniboine. But with the spring of 1882 the boom began, and the district was virtually overrun with new comers—speculators in great part. But as the line advanced westward, only the steadily industrious settlers remained to form a solid nucleus for the future city and district.\n\nAmong those who engaged extensively in farming were Messrs. McBurnie, who took 10,000 acres in proximity to the town, and spent over $100,000 (£20,000) in improvements; Mr. Whitehead, who put 500 acres in grain; the Hon. J. W. Sitton and others, who invested largely in farming and stock. The whole district is well adapted for mixed farming—cattle raising and dairying, as well as the culture of cereals. Several stations east and west of the\ncity are tributary to Brandon, drawing their chief supplies from its banks and stores. Of schools and churches there is no lack. Taxes are moderate. Roads are easily maintained.\n\nThe surrounding country is laid out in counties, municipalities, towns and villages, such as may be found in the older portions of the Eastern Provinces. The country is surveyed into sections of 640 acres, half sections and quarter sections, and for miles distant from Brandon an average of a settler on every section, and less, may be found pursuing their callings just as if they had been located on their possessions for a quarter of a century. The country is everywhere dotted with schoolhouses, churches, post offices, etc.; the roads are excellent (owing to the nature of the soil); and there is every convenience that could be expected in a country of many times its age. The County of Brandon comprises six municipalities—Elton, Daly, Cornwallis, Whitehead, Oakland and Glenwood—each consisting of six townships six miles square, with Brandon City in the centre, five railway outlets and inlets radiating from that centre, as well as good roads, post office routes (stage lines), going in every direction. In 1880 the population of this entire county was less than 3,000, with about as many more in the city towards the close of the year, and today the county (city included) has a census of 12,000 people, and comprises about 160,000 acres under crop. The land throughout is mostly undulating, thus affording good pasturage, ample grain soils, good water, and all that is required by nature to make the home of many thousands more of a happy and prosperous people. As the Brandon and Souris R. R. is to reach the Souris coal fields, about 85 miles distant, this fall, where there is an inexhaustible supply of fuel, the fuel question of the West is solved, and henceforth coal of good quality will be had from $4.50 to $5.00 a ton. This should also settle the manufacturing question for Brandon, as it will keep coal, and with it mechanics' wages, at a very moderate figure. The city has all the advantages found in progressive centres of the east, while schools, churches, post offices, and all the conveniences for farm life are to be found at reasonable distances throughout the county, and, in fact, throughout the entire province. The country is steadily developing, and is undoubtedly destined to become one of the most progressive and prosperous districts in the Canadian Confederation.\n\nThe City of Brandon numbers between three and four thousand people. It is growing rapidly, and is one of the pleasantest of western towns. An idea of its trade may be gained from the fact that in the spring no less than eighty self-binding harvesters, machines which cost from $200 to $250 (£10 to £50) apiece, were sent out from its\nimplement agencies in a single day. The trade of Brandon extends to a great distance southward, in which direction is the largest part of the population, and where, after the Brandon Hills have been crossed, is found as good soil as anywhere in the Assiniboine or Souris valleys. Five hundred acres in a single field of wheat is not an uncommon sight in this neighborhood. The city has six grain elevators. These received as much as one million bushels of wheat in one season. In addition to the main line of the C. P. R., railways are now built or under construction south-east to the Tiger Hills District, south-west to the Souris coal fields, north-west into the Little Saskatchewan country. The Dominion Government, after making most exhaustive enquiries, selected Brandon District as the site of the Manitoba Experimental Farm. It is admirably situated on the north slope of the Assiniboine, the location having been selected by Prof. Saunders, of the Central Farm, near Ottawa, as possessing every requisite advantage. It is favored with a good supply of water, plenty of timber, a sufficient diversity of soil, and an excellent situation, as well for agriculture as for the fine prospect (including the city) which it affords. Such an institution is invaluable to the farmers, supplying every information based on experiments and tests, conducted with regard to the soil and climate of the district. The whole of the district is well settled. All the homesteads, free grant lands, within a reasonable distance of Brandon, have been taken up. The Railway Company have a number of desirable sections for sale. These are shown colored on the accompanying maps. Free grant lands can be obtained in the district comprising the western portion of the map. Entries for these can only be made at the Dominion Lands Office, Brandon. Settlers who have sufficient means are advised to weigh well the advice given by Mr. Sandison to purchase lands near to the railway, rather than go some distance from the track, tempted to do so by the offer of free land; but those who have not the means to buy and are desirous of getting homesteads, free of cost, cannot do better than take up land in the western part of the Brandon district.\n\nWe close this pamphlet with several of the many letters received from actual settlers residing in the Province of Manitoba. Is there any other known country where such results can be obtained?\n\n\"In the spring of 1882 I first settled here, being a Scotchman from Monar Beauty, Ross-shire, where I worked on a farm. I came here to better myself, and have done so a good deal. Having only £15 to begin with, I\nhomesteaded, and it is now worth, the land alone, £200. I am perfectly satisfied with this country. I wouldn't wish for a better for farming or stock-raising, and wish hundreds of farmers in the Old Country only knew it.\n\n\"Erinview.\"\n\n\"I am from Muirkirk, Ayrshire, Scotland, and settled in Manitoba in 1878. I was a plowman and had no capital, but now own 640 acres, worth $8,000, or £1,600 sterling; have three horses and 40 horned cattle, and have 160 acres under crop. In 1882 I had 3,000 bushels of wheat, which sold at $1 per bushel, besides 900 bushels of oats and 500 of barley. I do not use manure; use barb wire fencing, costing eighty-two cents per rod with posts. I have bettered my condition by coming here, and am satisfied with the country and the prospects. Settlers arriving here in March can easily rent a piece of cultivated land and put in crop, and if he takes a homestead or buys land afterward he can break it ready for the next year.\n\n\"Portage la Prairie.\"\n\nTHOMAS McCARTNEY.\"\n\n\"I would just say that if this should reach any of my Highland friends in the Old Country, and if they want any information to write me. I am well satisfied with Manitoba, and so is everyone who tries to get along. I came here in 1877 from Ontario with $2,500, and homesteaded and pre-empted 320 acres, which is now worth $8,000. I have 160 acres in crop, have thirty horses and cattle, and have bettered myself ten-fold by coming here.\n\n\"Morden.\"\n\nD. McCUTCH.\"\n\n\"ALEXANDER STATION, MANITOBA, October, 1889.\n\n\"I take the liberty of giving you some of my own experience as a Manitoba farmer. I raised my first crop in 1883 from land broken late in the season of 1882 and backset in the spring of 1883, and had from 5½ acres sown, 196 bushels wheat No. 1 hard. In 1884, had 40 acres rented to another party that yielded 32 bushels per acre. In 1885, the yield was 34 bushels per acre. In 1886 (another dry season), the yield was 20 bushels per acre. In 1887, 160 acres yielded 6,900 bushels, an average of 43 bushels per acre. In 1888, the average was 32 bushels per acre.\"\nIn the present year the average was 15 bushels per acre on 220 acres sown. I had 125 acres that yielded 20 bushels per acre; the balance, on account of a very hard stubble, plowed under last fall, and the season being dry, only yielded 10 bushels per acre. Now, for the seven years I have had crop, the average for wheat was 29 bushels per acre, and oats 43 bushels. And for five years the average of barley has been 25 bushels per acre, with the exception of 1887, when oats ranged 75 bushels; and the present season at 12 bushels, the general average was 50 bushels per acre. Mine is not an exceptional case. There are plenty of others who have as good a record as mine, and some better. The present dry season may be discouraging to new comers, yet it would be unfair to judge our country by the present dry one, and it convinces me that our soil with proper farming will raise a fair crop, under almost any circumstances. My crop this year had almost no rain, as not an inch fell from seeding to harvest. I came here from near Guelph, Ontario, with a capital of about $700 (£140), and now have a farm of about 1,000 acres of land, 450 under cultivation; will sow 350 acres next spring and break 100 more. I have 11 horses, 3 good colts rising two years old, 4 colts rising one year, 12 head of cattle and 20 hogs, in all worth $2,500 (£500). Implements worth $1,000 (£250). Dwelling house, granary and stable, cost $1,500 (£300). Now, it would have taken me a long time in Ontario to have gathered this much together on my capital. The difference with me between there and here is, six good crops and one poor one in seven years in Manitoba, and one good crop and six poor ones in seven years in Ontario. I must say I am well pleased with the country and the prospects before me, and think that anyone who is able and willing to work, and who has some capital to start on, can do well in this new country a great deal easier than in an older country. I can point you to hundreds of settlers who seven years ago had hardly money enough left after coming here to buy a yoke of oxen, who today have a good half section (320 acres) of land, two good teams and everything needed to work their farms, and live comfortably. I would say to new settlers, don't be discouraged, but put in all the crop you can the coming season. It may be a repetition of 1887, as the ground is better ploughed this fall than I have ever seen it before. In conclusion, I would say that you are at perfect liberty to use this letter or any part of it, if of use to you in the interests of emigration, as the statements I have made can be corroborated by plenty of my neighbors, who have done just as well as I have, and some of them better.\n\n\"ALEX. NICHOLSON\n\n\"Reeve of Whitehead, County of Brandon, Alexander Station, Manitoba.\"\nIn the present year the average was 15 bu per acre; the balance, on account of a ve yielded 10 bushels per acre. Now, for th acre, and oats 43 bushels. And for five y of 1887, when oats ranged 75 bushels; ar acre. Mine is not an exceptional case.\n\nbetter. The present dry season may be d the present dry one, and it convinces me circumstances. My crop this year had from near Guelph, Ontario, with a capi land, 450 under cultivation; will sow 35 rising two years old, 4 colts rising one ye worth $1,000 (£250). Dwelling house, long time in Ontario to have gathered thi here is, six good crops and one poor one years in Ontario. I must say I am well one who is able and willing to work, and deal easier than in an older country. I enough left after coming here to buy a good teams and everything needed to we discouraged, but put in all the crop you better ploughed this fall than I have ever this letter or any part of it, if of use to corroborated by plenty of my neighbors,\nCanadian Pacific Government Lands.\n\nTERMS.\n\nIf paid for in full at once, a reduction of $15 per acre will be given; but the amount paid in advance will bear interest on the remaining balance in payment at the rate of one and a half per cent. per annum, from date of installment.\n\nGENERAL TERMS.\n\nAll sales are subject to the following conditions:\n\n1. All improvements must be made on land purchased thereon until final settlement.\n\n2. All taxes and assessments on land purchased must be paid during current year.\n\n3. The Company reserves lands for mineral and coal lands; stone, slate and marble; and tracts for town sites.\n\n4. Mineral, coal and water-power persons giving satisfactory tickets may utilize the lands.\n\nLiberal rates are charged by the Company over their lines to the purchaser.\n\nSSTEAD REGULATIONS.\n\nHomestead regulations provide for the establishment of homesteads in certain sections excepting Nos. 8 and 46 for government lands which are now open for homestead entry. All entries are subject to these rules and regulations, among which is the requirement that any homesteader desiring to make an entry must be within age of being fifteen years.\n\nENTRY.\n\nAny applicant for a homestead shall personally appear before the local land office where he resides or locate in which his claim lies, in which location is situated, or if the homesteader resides in Manitoba, the Permanent Land Office, Winnipeg, or the Commissioner of Land, Ottawa. The land officer will then receive authority to complete the entry. Entry fee is $10.\n\nDUTIES.\n\nA new homestead duties may be performed in making an entry, as following:\n\nA. Homesteading duties are completed with residence to the boundary lines of the district containing the land, during which period the homesteader must be present for more than six months in any one district containing the land.\n\nB. Within two miles of the homestead the homesteader must live constantly in a habitable house erected upon the land. Ten acres must be cultivated by the first year after entry, fifteen acres additional in the second year; ten acres to be in crop the third year.\n\nWithin the first two years, in the second cropping said five acres must be employed in the growing of a habitation house. The entered land is forfeited if commencement of the sixth year. Thereafter, the settler must reside on his lands for at least six months in each year of three.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30702.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 31, "total-input-tokens": 46584, "total-output-tokens": 8570, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 3387, 3], [3387, 5914, 4], [5914, 6047, 5], [6047, 6651, 6], [6651, 6791, 7], [6791, 6791, 8], [6791, 8058, 9], [8058, 10144, 10], [10144, 10144, 11], [10144, 12431, 12], [12431, 14625, 13], [14625, 14625, 14], [14625, 16325, 15], [16325, 18616, 16], [18616, 18616, 17], [18616, 21433, 18], [21433, 24068, 19], [24068, 24068, 20], [24068, 26142, 21], [26142, 28948, 22], [28948, 28948, 23], [28948, 28948, 24], [28948, 28948, 25], [28948, 29924, 26], [29924, 32328, 27], [32328, 32328, 28], [32328, 32328, 29], [32328, 32328, 30], [32328, 32328, 31]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "None", "en", "en", "None", "en", "en", "None", "en", "en", "None", "en", "en", "en", "None", "None", "en", "en", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, true, false, false, true, false, false, true, false, false, true, false, false, false, true, true, false, false, true, true, true, true]}}]