[{"id": "b2522aa6354dd54b3a2f6465d5950400c4bb3476", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/ Couverture de couleur\n- [ ] Covers damaged/ Couverture endommagée\n- [ ] Covers restored and/or laminated/ Couverture restaurée et/ou pelliculée\n- [ ] Cover title missing/ Le titre de couverture manque\n- [ ] Coloured maps/ Cartes géographiques en couleur\n- [ ] Coloured ink (i.e. other than blue or black)/ Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Coloured plates and/or illustrations/ Planches et/ou illustrations en couleur\n- [ ] Bound with other material/ Relié avec d'autres documents\n- [ ] Tight binding may cause shadows or distortion along interior margin/ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nAdditional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nOUR\n\nCONSTITUTIONAL RIGHTS\"\n\nVINDICATED:\n\nOR,\n\nAN ARGUMENT FOR THE\n\nLEGAL PROSCRIPTION\n\nOF THE\n\nTRAFFIC IN ALCOHOLIC BEVERAGES.\n\nIN SIX LETTERS\n\nTO THE\n\nHON. FRANCIS HINCKS.\n\nBY\n\nREVEREND GEORGE CASE,\n\nWESLEYAN MINISTER.\n\nTORONTO, C. W:\n\nPRINTED AT THE CHRISTIAN GUARDIAN OFFICE,\n\nBY THOMAS H. BENTLEY,\n\n1854.\n\nFive cents each; $4 per 100; $30 per 1000.\n\n103036\nONE WORD WITH THE READER.\n\nIf any ask, \"Why is this pamphlet put into the form of Letters and addressed to the Hon. Mr. Hincks?\"—a sufficient answer will be found in the following pages. The Author will only say here, that he entertains for Mr. Hincks no other feelings than those of respect and kindness. He has a profound conviction of that gentleman's talents as a statesman, and does not at all doubt the sincerity of his opinions on the question of a Prohibitory Liquor Law, though he thinks those opinions are wrong.\n\nThe design of these Letters is to present to the Public, in a condensed form, some of those facts and arguments which go to demonstrate the oppressive and unconstitutional character of the present License Laws of Canada. The Author pretends to no literary merit, and asks no praise for his performance. His only wish is to do good in a good cause; and he ventures to indulge the hope that a careful perusal of this little pamphlet will induce the friends of Legal Prohibition to assist in giving it as wide a circulation as possible.\n\nStratford, November, 1854.\nOur \"CONSTITUTIONAL RIGHTS\" VINDICATED: Or, an Argument for the Legal Proscription of the Traffic in Alcoholic Beverages. In Six Letters to the Hon. Francis Hincks. By Reverend George Case, Wesleyan Minister.\n\nTO THE HONOURABLE FRANCIS HINCKS.\n\nLETTER I.\n\nSir,\n\nPermit me, an humble individual, to present to you my respectful salutations, and to invite your attention to a subject of very grave importance, which has, for many months past, deeply and seriously agitated the public mind. I will not trouble you with questions of political partizanship—with these I have nothing to do. But I beg you, Sir, seriously to ponder a question of public Morality; a question in which the governor and the governed, the patrician and the plebeian, the master and the servant, the moralist and the politician, are equally interested. The question to which I refer is—the Legal Prohibition of the Traffic in Alcoholic Beverages.\n\nIn venturing thus publicly to address you, I have no vanity to gratify; and should I venture, in the course of these remarks, to speak in terms of condemnation respecting the line of conduct you have pursued in Parliament, on the question of a Prohibitory Liquor Law, it will not be to gratify revenge. Personally, I have not the honour of being acquainted with you; and of your private character I know nothing, not even by report. I address you as a public man, a member of Parliament, and, till very recently, first minister of the Crown in the Canadian Government. My remarks shall be respectful; and I hope you will weigh them, before you dismiss them.\n\nIt is argued by a certain class of persons, that it is proper and right for the Legislature to legalize the manufacture and sale of Alcoholic Drinks. By another class it is contended that, to legalize the traffic in these drinks, is an assumption, on the part of the Legislature, of a right which it does not possess. The parties in this debate go a step further; the latter asserting that the Government ought to suppress the traffic, now that it exists, by Legislative enactment; while the former as stoutly assert that legislative proscription would involve in it an invasion of the principle of personal liberty not at all justified by the power, or authority, of the civil magistrate. Here, then, is the state of the argument.\nWithout stopping just now to dwell on the absurdity and bad logic of the argument, that the Legislature invades a man's right by withdrawing a privilege which that Legislature itself conferred; permit me to say, Sir, it is important that we examine this subject dispassionately; because if the liquor traffic is right, the public ought to know it, and public excitement and agitation on the subject should cease. But if, on the contrary, the traffic is wrong, then it is TREMENDOUSLY wrong; and you, Sir, should be among the first to acknowledge the wrong; and to aid in correcting it. Before proceeding further, I ought, perhaps, to indicate the particular line of argument to be pursued in these letters. The question to be considered is, not whether the prohibition of the liquor traffic would be a justifiable or an unjustifiable act on the part of the civil legislature; but, more exactly, whether there is any principle of fundamental law to justify the present licensing system? Is the present Liquor Law of Canada a constitutional or an unconstitutional Law?—For the sake of method in the discussion of this subject, permit me, in the first place, to invite attention to the question of\n\n\"Vested Rights.\"\n\nThe phrase \"vested rights,\" as it is employed by the advocates of the Rum Traffic, seems to mean, rights derived from the act of the civil magistrate, in his legislative capacity. Now, Sir, do not be startled if I assert that, in this sense of the phrase, a vested right can not exist. The magistrate may give a legislative expression to a principle of right. He may recognize the right in a human law. But he can not originate a right, any more than he can originate a perfect rule of moral conduct, such as the Decalogue. Legislatures may confer power, or liberty; but power, and right, whether politically or philosophically considered, are two things widely different. Thus the Legislature may empower A, B and C, under certain conditions, to manufacture and sell inebriating beverages; but this legislative authority, or legal permission, does not, and can not, create a right.\n\nMan's fundamental rights are antecedent to all human law.\n\nHUMAN RIGHTS COME FROM GOD!\n\nand whatever is inconsistent with the revealed will of the Moral Governor of the world, cannot be made right by legislative enactment. Any human law which, in its practical operation, injuriously affects man's fundamental rights as a subject of moral and civil government, is out of harmony with all the laws in the universe, opposed to the will of God, and destructive to man's own happiness. Such a law is \"UNCONSTITUTIONAL.\" \"The proper definition of right,\" says Paley, \"is consistency with the will of God.\" I presume, Sir, you will not question the soundness of Paley's philosophy. If the traffic in alcoholic beverages is right, it is so because of its conformity to some\nprinciple of the Divine Government. But if it is, in any way opposed to the pure and benevolent government of the Deity, then, Sir, you and your confreres in Parliament can not sanctify it by legislative \"License.\"\n\nIn my next, I propose to inquire—1st, What are our Rights? and 2nd, How far are those rights affected by the legalized manufacture and sale of Alcoholic Beverages?\n\nWith great respect, Yours.\nLETTER II.\n\nSir,—Having endeavoured in my first letter, to show that human legislation cannot create a right, and that no right, properly so called, can exist apart from the moral government of God, I now proceed, in the second place, to inquire\n\nWHAT ARE OUR RIGHTS?\n\nThese may be enumerated under three general heads—the right of person, the right of property, and the right of conscience. These are sometimes called \"natural rights,\" because their existence does not depend on the special enactments of human legislatures. We might also call them divine rights, inasmuch as they are the gift of the Divine Author of our being, and are designed to be equally the heritage of every one of our race. The first and second may be forfeited to the law by crime; but \"liberty of conscience\" is the indisputable right of even the felon in his cell. The British Constitution, of which you and I, Sir, as British subjects, are, perhaps, equally proud, distinctly recognizes these rights. It declares them to be inviolable, not only as the birthright of the monarch, but equally so as the birthright of the meanest peasant.\n\nTHESE ARE \"VESTED RIGHTS,\"\n\nrights vested in man by his Maker, to be prized and enjoyed equally by all; and, Sir, they must not be wantonly invaded.\n\nIt is not the midnight assassin only, who invades the right of person; nor the concealed burglar only, who disregards the right of property; nor the religious persecutor only, who tramples on the right of conscience. You, Sir, do not need to be told how often crime has found a sanctuary in the Temple of Law; nor how frequently and flagrantly men's moral and political rights have been outraged by the infliction of legal wrong. Sir, THE HISTORY OF CHRISTIAN LEGISLATION DOES NOT FURNISH A MORE FEARFUL AND PAINFUL EXAMPLE OF MORAL AND LEGAL WRONG, THAN IS EVERY DAY SEEN IN\n\nTHE LEGALIZED RUM-TRAFFIC OF CANADA!!\n\nBut I am anticipating the question, \"How far are our rights affected by the legalized manufacture and sale of Alcoholic Beverages? Let us see how the traffic operates.\n\n1. It invades the right of person. Labouried arguments here are altogether unnecessary. A simple statement of undeniable facts will be quite sufficient to establish the truth of my assertions. The Liquor Traffic destroys health. Is not this an invasion of the right of person? It blasts the fairest reputation. And that, Sir, looks like an invasion of right. It often consigns the drunkard to a premature\nand dishonoured grave. If that is not an invasion of the right of person, I know not what is. But that is not all. Drink arms the drunkard, while in life, with the fury of a wild beast, causing him to murder, or otherwise maltreat his wife, children and friends; so that in the case of the sober, as well as of the drunken, the right of person is most violently and wickedly invaded. And if the drunkard commits assault or murder, who makes the drunkard? Why he is made and fitted for his mendish work \"by Act of Parliament;\" and are there then, in the sight of God, no accessories to the drunkard's crimes? Does not the License System \"frame mischief by a law?\" Does it not invade the right of person?\n\nThe British Constitution declares the person of the peaceable, law-abiding subject to be \"sacred and inviolable.\" Yet we have a system in existence among us, by which thousands of Her Majesty's liege subjects are every year consigned to premature death: and that system is sanctioned and protected in its work of ruin by the solemn decisions of a Christian Legislature! And when an Honourable and honoured member of that Legislature endeavoured to carry through the House a Bill for the suppression of the accursed liquor traffic, you, Sir, were among the stoutest opposers of the Bill!! I ask, Sir, respectfully but earnestly, does not your course of action on this question involve in it an invasion of the Constitutional Rights of British subjects in Canada? Does not that traffic, the destruction of which you have so resolutely opposed, invade the right of person?\n\n2. The Rum Traffic invades the right of property. It will not do to say that the value of an alcoholic beverage must be determined by the facility or difficulty with which such article can be obtained, as is manifestly the case with many articles of commerce (as railroad iron for example). For, with whatever ease or trouble an article may be procured, its use is supposed to confer some benefit. But this is not the case with alcoholic drinks. The effect of their use is invariably to inflict more or less of injury. A mercantile firm or a Railroad Company may become bankrupt without sundering the bonds of society, or seriously disturbing its arrangements. But the License system strikes at the very root of the social compact. In all the ramifications of society, that system, as a mighty disturbing force, has produced pecuniary derangement and distress.\n\nLet us suppose that Canada furnishes to her own Distilleries 500,000 bushels of rye annually. This is worth $300,000. The distillers convert this grain into whiskey, and then sell it back to the country for $800,000. You, Sir, enjoy the reputation of being a clever financier: perhaps you can calculate how soon, at this rate, Canada will become rich by her Liquor Traffic. Hodge takes a bushel of rye to the distiller, and gets 3s. for it. He then buys the whiskey made from a bushel of rye, for which he pays 8s. When will Hodge have accumulated a fortune? But let us look again at facts.\nThe traffic robs the drunkard. It takes his money without rendering him a corresponding benefit, or equivalent. Is not that an invasion of the right of property? You may say, \"the drunkard is a consenting party.\" I shall endeavour, in the course of this argument, to show that this is not always the case; but supposing it were so, the drunkard's wife and children are not consenting parties, and they are robbed by this traffic. Do you not know, Sir, that this accursed Liquor system of ours, licensed and upheld by Christian lawgivers, has, in thousands of instances, sent the wives and children of drunkards, with \"lamentation and mourning and wo,\" penniless and friendless to the street? Is the right of property respected in these cases?\n\nAgain, the Liquor system, by inducing poverty and ignorance, and by debasing the moral sentiments, gives rise to fraud, theft, robbery, and a host of minor offences against society. The spirit-vender robs the drunkard, and the drunkard in turn robs his merchant and mechanic; our streets are filled with paupers, and our jails with felons; legions of functionaries are employed to administer criminal justice; the Rum Traffic furnishes them with nine-tenths of their unhappy work; and the sober and industrious are enormously taxed to pay the expense. Does all this, Sir, accord with your ideas of \"the right of property?\"\n\nWith great respect, Yours.\nLETTER III.\n\nSir,—I believe it may be stated with truth that, as a general rule, large fortunes, honestly accumulated, are the growth of years. There are exceptions, certainly; but as a rule, honest toil or honest profit does not bring sudden wealth. And it is a fair inference from this doctrine, that any business whose natural tendency is to bring sudden wealth to those engaged in it, must be morally and politically wrong; more especially if such business brings as sudden poverty and ruin to those who support it. Try the Liquor traffic by this standard of judgment.\n\nSome of the Distilleries, Breweries and \"Hotels\" of Canada are worth many thousands of dollars; many of the Beer and Spirit Manufactories of Great Britain are worth millions. Among the lower orders of liquor venders in Britain and America, there are many, it is true, who, through drunkenness and prodigality, keep themselves wretchedly poor. But the calculating publican who has an eye to his profits, knows very well that a single barrel of whiskey may contain the germ of sudden and enormous wealth. And while the manufacturers and venders of Alcoholic Drinks are amassing wealth, which in many individual cases is very great, and which, in the aggregate, is almost past calculation; how are the consumers of these drinks affected by the traffic? This, sir, is a very grave question. A business transaction between my tailor and myself may be a mutual benefit; but are the whiskey seller and the whiskey drinker equally benefitted by the business transactions of the Bar-room? I could name many individuals in this Province, who, a few years ago, were common labouring men, but who, by investing their first earnings in a barrel of whiskey, a jug of brandy and a tavern \"license,\" are now in a position of pecuniary independence. There might be nothing objectionable in this, if the calling in which these persons are engaged had, like the manufacture of iron or cloth, conferred any substantial benefit on those who have contributed most to its support. But what is the real state of the case? Why, just this: while the venders of \"strong drink\" have been amassing wealth, and indulging themselves and their families in every luxury that nature and art afford, their \"customers,\" or many of them at least, have, through the direct influence of the liquor traffic, sunk to the lowest condition of poverty. I defy any man to name a liquor selling establishment on the globe, that has not been, directly or indirectly, a curse and a pest to society. And to assert that the drunkard is a consenting party to his own and his family's ruin, is a bitter mockery of human weakness. You, sir, know perfectly well that the unutterable horrors of the drinking system have been fastened upon society by the habits of ages. You can not but know also that thousands have, through the indiscretion of their parents, become incipient drunkards in their very childhood. Physiological science has demonstrated that a drunken mother may com-\nmunicate a love of alcoholic drinks to her child before it sees the light. And you know too, that at this moment, there are thousands in this Province who are holding up their manacled hands, and with earnest entreaties and bitter tears, begging you to aid in striking the decisive blow that shall forever free them from the galling chains of their worst enemy. For these persons there is but one hope left, namely, the Legal Proscription of the Liquor Traffic.\n\nI was not a little surprised, sir, when I learned, through the public prints, that you had offered a determined opposition to Mr. Cameron's Prohibitory Liquor Bill. That a public man of your experience and observation in all matters relating to the material interests of a nation; that a minister of the Crown possessing the financiering abilities for which you generally receive credit, and the patriotism to which you lay claim; should be either unable to discover, or unwilling to acknowledge, that the traffic in alcoholic beverages involves in it a most flagrant invasion of the constitutional right of property; is one of those painful exhibitions of obtuseness or perfidy in great men, that sometimes astonish the world. But that you, Sir, should have the temerity to stand up in your place in Parliament, as the public apologist and defender of the rum traffic; a traffic whose history is written in tears and blood—a traffic whose path is strewn with the wrecks of wasted fortunes, ruined health and blasted reputation—a traffic which, on every sea, and in every land has left its victims weltering in blood, and caused the wail of sorrow and the shriek of despair to ascend to heaven, as if invoking the vengeance of God on the supporters and defenders of the foul moral wrongs which it has perpetrated; seems to me to have been one of the most astounding and humiliating spectacles ever witnessed or heard of in a christian land! You will perhaps deny that you are the \"apologist and defender\" of the drunkard making system; but if your uncompromising hostility to the principle of Mr. Cameron's Anti-Liquor Bill does not fairly entitle you to that bad distinction, I know not what could.\n\nIt may not be improper, while on this point, to say a few words about your moral-suasion doctrines. The position you took in the Parliamentary debate on Legal Prohibition, was, in one of its aspects, somewhat amusing. Did you imagine, Sir, when making that dolorous moral-suasion speech of yours, that your honourable colleague, Mr. Cameron, would some day enter the Legislative Assembly Room, like another Oliver Cromwell, with a regiment of \"teetotalers\" at his heels, to drive you and all other \"license system\" defenders from the House with sword and bayonet? The facility with which a wise man may make himself ridiculous is truly surprising.\n\nBut more seriously, Sir, what would you have us use moral suasion for? Is it to dissuade the drunkard from his habits of drunkenness? Do you acknowledge then that drunkenness is wrong? And if so, how will you defend that system of which drunkenness is the legitimate\nand inevitable result? Are you quite consistent with yourself, Sir? You may say, \"the law does not sanction drunkenness.\" But it does sanction the manufacture and sale of the beverages which cause all the drunkenness in the land. And, Sir, in the name of all public and private morality, and of all common sense, on what principle will you defend that abominable system out of which drunkenness, with its long train of bitter evils, so naturally springs? To talk about \"moderation\" is idle and vain; since it is a very dangerous moderation that almost invariably leads to shameless excess. More on this point in my next.\n\nWith great respect, Yours.\nLETTER IV.\n\nSir,—I concluded my last letter by inquiring what you would have the advocates of Legal Prohibition use moral suasion for. Permit me now to ask, to whom shall we address our moral suasion arguments? Shall we thus address the drunkard? I have already shown that thousands are so hopelessly enslaved by drink, that no remedy short of the legal proscription of alcoholic beverages, as an article of trade, can effect their redemption. And to talk to temperance men about using moral suasion with the drunkard, at the same time that you would uphold that system which must, so long as it exists, most thoroughly neutralize all their efforts to emancipate this Province from the thralldom of the vice of drunkenness, is little better than insult and derision. I feel indignant, Sir, when I hear men—especially men who, like yourself, occupy positions of trust, honour and responsibility in their country's service—talk of moral suasion as a means of rescuing the victim of strong drink from a vice which grows out of the rum legislation of this country, as naturally, as thorns grow out of the stalks of the Canada Thistle. Really, Sir, it is bad enough, in all conscience, that a people should be deeply injured, both in person and property, without being outrageously insulted in their moral feelings.\n\nShall we use moral suasion argument with the spirit vender? I presume, Sir, you are acquainted with the history of Negro Slavery in the British West India Islands. You must know something too of the agitation which, a few years ago, so seriously affected the English nation, on the question of giving the Negroes their liberty. And if you have read the stormy debates which arose in the British House of Commons, when the philanthropic Wilberforce came so nobly forward to advocate the heaven-born rights of British Slaves—their rights of \"person, property and conscience\"—and, if possible, to induce the British Parliament, to recognize their rights in a legislative enactment; perhaps you can tell how many English Statesmen were ready to cry out with loyal horror, \"Moral suasion, moral suasion!\" But suppose Wilberforce, and Coke, and Knibb had used no other means than moral suasion, to induce the West India Slave holders to abandon their unholy traffic in human flesh, how would the case of British West India Slavery probably stand at the present time? I fear, Sir, our boast of liberty—of British Freedom—would be about as unmeaning as that of American Slave owners in the Southern States of the neighbouring Republic. And, Sir, I have no hope that any of the means hitherto employed in this Province, for suppressing the evils of the Liquor Traffic, will prove completely effectual, or even comparatively so. To reach the conscience of the rum-seller by moral suasion is about impossible, for he has, or seems to have no conscientious scruples whatever about the morality of his business, so long as he can make it a source of pecuniary profit to himself. The man who, with full knowledge of the mischief he is doing, will cater to the vitiated appetites of his fellow men, and poison his neighbour to death for pecuniary\ngain, will not be very readily reached by moral suasion. He may be \"affected to tears\" by the \"Suasion\" of the Statute Book; but by no other means whatever. Nothing but the strong arm of the civil power can ever crush the system which is inflicting on our country the innumerable and appalling evils of intemperance; and surely it is high time that power was applied.\n\nBefore I leave the subject of moral suasion, I beg liberty to ask another question. For what object should moral suasion be employed, upon a question which concerns an entire community, if it is not to induce such a state of public sentiment as will lead to legislative action and legislative reform? The friends of temperance, Sir, are using moral suasion; not merely for the purpose of saving individual drunkards, or of making the spirit vender ashamed of his legalized iniquity; but for the purpose of correcting public sentiment on a question of national morality. And, Sir, public sentiment is coming up to a more elevated tone. You and others of your way of thinking succeeded in the late Parliament, in gagging the prayer of 80,000 petitioners for a Prohibitory Liquor Law. Perhaps you may ere long have an opportunity to oppose the prayer of Half a Million. If you can do no better, I hope you will at least \"make a virtue of necessity,\" and vote for Total Prohibition.\n\nNever will the rights of person and property be sacredly regarded until the traffic in inebriating beverages shall have been placed, by the voice of wise and beneficent legislation, on the degraded level of a flagrant crime against human Society. Already has God denounced it as a sin against the Divine Government. The civil ruler is morally bound therefore, to denounce it as an infraction of wholesome human law. And the onus of responsibility which thus rests upon the legislator, he may not attempt to throw upon the shoulders of any subordinate civil officer or body. One of the great blunders (the mildest term I can use) of modern rum legislation in Canada, is the law by which Municipal Councils may grant or refuse tavern license in their respective Municipalities. When this law was enacted, our legislators said to the people, \"You now have the liquor traffic entirely in your own hands, and you must manage it in your own way. If you have taverns among you, the fault will be your own, not ours.\" All this is simply absurd, as experience has fully demonstrated. Some Municipalities have withheld licences, but others have granted them; and thus the benefits of the law have been but partial at the best. And, Sir, can you imagine anything more palpably or flatly absurd and ridiculous, than an attempt of the local authorities of Toronto, Hamilton, Montreal or Quebec, to prohibit the manufacture and sale of intoxicating beverages within the limits of their jurisdiction, while a shred of the license law remains to sanctify the traffic? But supposing they could do this: have they any power to interfere with the importation of foreign liquors into the Province? Or could they\nprevent them from being conveyed to every Township in Canada, to scatter \"firebrands, arrows and death\" in every direction?\n\nThe fact is, Sir, the Municipal Councils of Canada feel that their responsibilities in this matter are altogether too great; the people are groaning under the oppressive burden of the License laws; and very soon, if I do not greatly err, the force of public opinion will compel the Legislature of Canada to resume its responsibilities, and deal with the license question as it deserves.\n\nWith great respect, Yours.\nLETTER V.\n\nSir,—I have endeavoured to show that the traffic in alcoholic beverages involves in it, directly and indirectly, a flagrant invasion of the constitutional rights of the subject as regards person and property. In doing this, I have employed plain, common-sense argument, and presented undeniable facts; considering these far better suited to my purpose than the technical jargon of the bar, or long quotations from writers on Constitutional and Statutory Law. Pursuing the same course still further, I shall endeavour, in this letter, to prove that the license laws of this Province do most wickedly invade the dearest right a morally accountable being can possess—a right far dearer than that of person or property—namely, the right of Conscience. It is not herein meant that the laws which sanction the manufacture and sale of alcoholic beverages compel one man to sell and another to drink liquid poison. But it is meant,\n\n1st. That by throwing around the traffic the protection, and investing it with the false respectability of a legal sanction, very tempting inducements are held out to the most unscrupulous speculators in the country, to engage in a business by which their pecuniary gains are enormously and unnaturally increased; their cupidity gratified; and their already cauterized consciences rendered still more obdurate.\n\n2ndly. That the traffic, being legalized, presents almost unbounded facilities for gratifying the abnormal appetites of the thousands who are enslaved by drink; and for drawing the young and inexperienced into the filthy and disgusting vice of intemperance, and involving them in all the disaster and ruin consequent on such a course.\n\n3rdly. That to sanction, by legislative provision, a traffic, of which the aforementioned evils are legitimate fruits, IS TO DEBASE THE NATIONAL CONSCIENCE BY LAW!\n\n4thly. That the laws which now sanction the Liquor Traffic of Canada, are both insulting and oppressive to the consciences of those who, notwithstanding their conscientious objections to the whole Liquor system, ARE COMPELLED, year after year, to witness its demoralizing effects on the community; and to contribute of their honest gains towards the expense of punishing crimes, most of which are induced by the direct operation of the Liquor Laws.\n\nThese propositions, Sir, are not mere random assertions. They contain truths which are susceptible of easy proof.\n\nThe License Laws of this Province inflict injury—moral injury—on the manufacturers and venders of alcoholic drinks. The wicked, I know, will do wickedly, without law, and against law; but for this very reason it is all the more dangerous to \"license\" the iniquities which such would perpetrate. Vice, like virtue, exerts a reflex influence; and in proportion as a man indulges a love of gain, to the detriment of his fellow man, in such proportion he blunts and debases\nhis own moral feelings, and renders himself unable to discover, and unfit to perform the personal and relative duties of a moral and religious being; God knows, Sir, human nature is bad enough, without the incitements of an iniquitous law to legalize its sins.\n\nYou must know, Sir, that the manufacturers and venders of strong drinks, as a class, have never been distinguished for piety, patriotism, or any other good moral characteristic, in any prominent degree. It is morally impossible for them to be so. On the contrary, large numbers of them are drunken, and in every other way, morally worthless creatures,—the victims of their own vocation, or rather, of the laws that sanction their wicked and corrupting traffic! No man possesses a right to inflict either physical or moral injury on himself; and though human law can not punish a man for cutting his own throat, nor for corrupting his own conscience, yet it is I think the manifest duty of the civil magistrate to withhold the sanction of his legislative authority from every system which would lead the desperado into a vicious course of life. And where such a system exists, the utmost power of the civil Legislature should be employed for the purpose of suppressing it. Legalized iniquity cannot consist with good government; and the entire history of the License Laws, in Canada and elsewhere, most conclusively proves that where such laws exist, the moral sentiments are vitiated; immorality and crime come forth from their hiding places; property and life are rendered more or less insecure; and the heaviest calamities that result from the liquor traffic, often fall on the rum-sellers themselves.\n\nBut the License Laws of Canada inflict moral injury and wrong on the consumers of strong drink, as well as on the venders. The drunken are confirmed in their drunkenness; and the youthful and unwary are taught the A, B, C, and then the harder lessons of the same vice. For acquiring these lessons, our Legislature furnishes abundant facilities. Canada abounds with national schools, every one of which has for a superscription on its portal, \"Licensed to sell Wines and other Spirituous Liquors;\" in other words, Authorized by Legislative Enactment to Teach the Gradations of Drunkenness, from the Inceptive to the Pluperfect Degree, according to the most Approved Method of Modern Discovery.\n\nTo the efficiency of the Masters and the expertness of the Disciples, let the Criminal Court, the Jail, the Penitentiary, and the Scaffold, bear witness! Seriously, Sir, the state of society is too appalling to be contemplated without a shudder. Through all the ramifications of the social body, Intemperance has sent its baneful influences; and among all classes of persons, the drinking habits of society have found apologists.\n\nAm I not right then, Sir, in making the assertion that \"to sanction, by legislative provision, a traffic of which the aforesaid evils are\nlegitimate fruits, is to debase the national conscience by law?\" We sometimes hear politicians talk of \"national character,\" \"the public faith,\" &c., and these suppose a public conscience. Well, we have a public conscience; but it is half drowned in whiskey, being \"kept under\" by the weight of a Rum License Statute, tied to its neck! Fortunately, however, the public conscience of Canada, is not too deeply debased, to feel how deeply it is outraged. Already its voice is heard, and ere long, I trust, its solemn protest against the legalized depravities of the Rum traffic will be respected. More on this point in my next.\n\nWith great respect, yours.\nLETTER VI.\n\nSir,\n\nI stated in my last that the License Laws of Canada invade the rights of conscience, inasmuch as they \"are both insulting and oppressive to the consciences of those who, notwithstanding their conscientious objections to the whole Liquor System, are compelled, year after year, to witness its demoralizing effects on the community, and to contribute of their honest gains towards the expense of punishing crimes, most of which are induced by the direct operation of the Liquor Laws.\"\n\nIt is not only by a direct attack upon the civil and religious liberties of the subject, nor by an attempt to coerce a man's religious or political belief into conformity to human standards, that the rights of conscience are invaded. Conscience may be pained—offended—by the crimes which are committed against law; but when the most monstrous and fearful iniquities are practised in open day, in violation of the law of God, and the rights of human society: and when such iniquities are committed by the authority and under the aegis of a Christian Legislature, then conscience is not only offended—it is outraged—it is persecuted. And is it necessary—rather is it possible,—to enumerate the frightful evils under which society groans, by reason of the presence and operation of the legalized liquor traffic of Canada? Shall I tell how that traffic paralyzes men's physical energies? How it extinguishes the light of their reason? How it crushes out their very souls? How it makes the drunkard's wife a widow, and his children orphans? How it blots out the sentiment of self-respect, transforming the once honorable and honored man into a whiskey-guzzling, tobacco-chewing bar-room loafer—a polluted, cringing reptile of the dust? How it drags its unhappy victims down to the lowest depths of poverty and wretchedness? How it impels them to the commission of foulest crimes? How it consigns them to the common jail, the State prison, the penal colony and the gallows?\n\nWeek after week the public newspapers convey to their readers the intelligence of some diabolical outrage against property or life; some instance of murder, or suicide, or \"accidental death,\" produced by the maddening intoxication of alcoholic drink. Pick up almost any public print that comes to hand; and in looking over its items of news, you meet with articles under such captions as these:—\n\n\"Death by Intemperance;\" \"Another Victim of the Liquor Traffic;\" \"Drunkenness and Murder;\" \"Intemperance and Suicide,\" &c., &c.\n\nOr perhaps your eye catches the heading, \"Coroner's Inquest;\" and then you read the particulars of some appalling case of death by intemperance, and of a \"Verdict in accordance with the facts;\" or if the Jury of Inquest chanced to be composed of the venders and\nsoakers of strong drink, the verdict will perhaps be, \"Died by the visitation of God;\" (! ! !) and thus the horrors of the scene are crowned by a daring blasphemy, in which it is sought to make Divine Providence responsible for the united guilt of the drunkard, the drunkard maker, and the makers of the drunkard maker!!\n\nPermit me, Sir, to ask if, in your opinion, these things are trifling or unimportant? Is there no cause of complaint on the part of those who have the conscience to see and feel and deplore the sad effect of the liquor traffic in Canada? Or is there any \"whining cant\" in the assertion that the conscience, the moral feelings, the Christianity, of the sober portion of the Canadian people, are grossly insulted, and wickedly trampled upon by the laws which, in utter contempt of all the remonstrances of Christian men, and of all the denunciations of Jehovah Himself,\n\nMAKE DRUNKENNESS A NATIONAL SIN?\n\nYou will observe, Sir, that, in discussing this subject, I have seemed to confound civil and moral rights. I may just explain that the reason why I have not noticed the philosophical distinctions that obtain between them, is that I consider them to be no more than different exhibitions of the same principle. My civil rights—the rights to which I am entitled as a subject of civil government—are of Divine origin. And my moral rights—the rights of a moral and religious being—should always be recognized, and never invaded by human law. All my rights, whether moral or political, come from God and are, in His sight, equally sacred. So far, therefore, as their inviolability is concerned, there is really no difference between my moral and civil rights. And it is for this reason that I have argued the duty and necessity of recognizing the revealed will of the Moral Governor of the world, as the basis of all human legislation. My moral rights demand the respect of the civil ruler; and my civil rights are of moral force and authority.\n\nThere is a saying that \"he who is only law honest is a great rogue;\" and I may add, on the other hand, that he who makes the revealed will of God his only rule of duty, will very cordially \"honor the King,\" even though there were no human law to punish the crime of treason. He will do more than this. Acting on the principles of moral righteousness revealed in the Bible, he will oppose, by peaceable means, every human law which dishonors God, and works mischief to man. Such a law, Sir, is that which perpetuates the existence of the License system of Canada. That law is morally wrong, and therefore wrong in every other aspect under which it can be viewed;\n\nAND YOU CAN NOT MAKE IT RIGHT!\n\n\"Who can bring a clean thing out of an unclean? Not one.\"\nIt would be interesting to me, Sir, to know by what kind of moral reasoning you would attempt to uphold that system which is the prolific parent of such a brood of moral and other evils. I cannot seriously suppose you would use such a mode of reasoning at all.—The License system does not possess one good moral quality. It ruins men in their pecuniary interests; it destroys health and life; and it debases, insults and persecutes conscience by making us\n\nA NATION OF DRUNKARDS!!\n\nEvery sin that is upheld by Legislative enactments is a National Sin, and may entail National Curses. And every member of the social compact is responsible for the nation's sins, just in proportion as he aids in perpetrating, or shows a spirit of apathy with regard to them. Believing this, I can not, and, God helping me, I will not, look quietly on, while Canada is debased and polluted by the unavoidable operation of an iniquitous law, without lifting up the voice of respectful but solemn and faithful rebuke.\n\nAnd on what principle, Sir, can the present License Law of Canada be defended? The civil magistrate altogether exceeds the limits of the authority delegated to him by God, when he enacts or upholds a law that works moral injury to the subject. I know St. Paul has laid down the principle, that \"the powers that be, are ordained of God;\" by which he can mean no more than that, antecedently, power comes from God; or that civil government is God's ordinance. He can not mean that law is always justice, or that \"might makes right.\" He has clearly enough defined the character of a righteous civil ruler—\"he is the minister of God to thee for good;\" and I put it to you, Sir, whether this character truly belongs to all the Legislators who have aided and abetted the advocates of the License system, and who, by their parliamentary votes, have fastened upon Society the innumerable and frightful evils which that system has hatched and nurtured? If, on this point, you and I differ in opinion, we can soon find an umpire. Let the widows and orphans, the beggars and thieves, the murderers and suicides—made such by the License Laws—judge between us. Strange judges these, but quite competent ones, nevertheless.\n\nWith great respect, yours.\nPost Scriptum.\n\nSir,— \n\nI have endeavored in the foregoing letters to confine myself pretty much to the question, \"Is the License Law a constitutional or an unconstitutional Law?\" And I have also endeavoured to prove that the License system invades every fundamental or constitutional right to which man, as a subject of moral and political government, can lay claim. But the advocates of the rum traffic often raise the argument, \"prohibition is unconstitutional.\" Let us examine the argument, by inquiring—What \"constitution\" does Liquor prohibition contravene?\n\nIt does not contravene the \"constitution\" of God's moral government in the earth; for there is not a principle or precept of it that has not been most wickedly transgressed and set at naught, through the operation of the License Law.\n\nIt does not contravene the \"constitution\" (if there be such a thing) of natural law; for no man has a natural right to do mischief, or to inflict harm on his fellow man.\n\nIt does not contravene the \"constitution\" of political government; for it is the first duty of the civil ruler to protect the lives, property and consciences of his subjects.\n\nBesides, is it not very absurd to talk about the \"unconstitutionality\" of an act by which the legislature withdraws a privilege that was its own gift? Having given a man permission to manufacture and sell alcoholic beverages, has the legislature no constitutional right to withdraw the permission? Shall the legislature thus ignore its own authority? Has the liquor traffic never been compelled to yield humiliating submissions to the government? Rather, has it not been \"like a street vagabond, continually in the hands of the Police?\"—And does not our executive government, in all its branches, high and low, stand in the strange position of one vast \"Vigilance Committee,\" whose business it is to see that its own bantling, the Liquor Traffic, does no mischief? It is surprising to mark the readiness with which people will take up the most illogical and absurd arguments conceivable, and make utter sacrifice of common sense, when self-interest demands the sacrifice.\n\nBut I will not detain you longer. If what I have written has served to convince you that the Legalized Liquor Traffic of Canada is morally and politically wrong, then my present point is gained. If you are not so convinced, I suppose I shall hardly convince you.\nI close my humble and respectful address to you, Sir, by expressing the hope that you and I may live to see the day, when a CANADIAN PROHIBITORY LIQUOR LAW will bring back security to the young and unwary; sobriety to the intemperate; peace and plenty to the homes and families of redeemed inebriates; a higher degree of general happiness and prosperity to our country; and, with all these blessings, complete vindication of\n\nOUR \"CONSTITUTIONAL RIGHTS.\"\n\nWith great respect, Yours,\n\nGEORGE CASE\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_14516.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46204, "total-output-tokens": 11074, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1498, 3], [1498, 2604, 4], [2604, 2966, 5], [2966, 4052, 6], [4052, 6362, 7], [6362, 9227, 8], [9227, 9635, 9], [9635, 12092, 10], [12092, 15120, 11], [15120, 16515, 12], [16515, 19516, 13], [19516, 22596, 14], [22596, 23245, 15], [23245, 26389, 16], [26389, 29430, 17], [29430, 29970, 18], [29970, 32854, 19], [32854, 35784, 20], [35784, 36438, 21], [36438, 39197, 22], [39197, 41916, 23], [41916, 44152, 24], [44152, 46535, 25], [46535, 47031, 26], [47031, 47031, 27], [47031, 47031, 28]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]