[{"id": "a72858040dcbad5653fa106a88b16c9427aba6d7", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nCORRESPONDENCE\n\nRELATING TO THE\n\nEASTERN BOUNDARY OF THE PROVINCE.\n\nFrom Lieut.-Colonel D. R. Cameron, Royal Artillery, to the Right Honourable the Earl of Derby, K. G., Secretary of State for the Colonies.\n\nLONDON, 29th October, 1884,\n\nMy Lord,—With reference to the instructions communicated to me in letters of 29th July and 2nd September by the Under Secretary of State, I have the honour to inform Your Lordship that I have completed my examination of the papers tending to show the intention of Parliament as to the true location of the Eastern Boundary of British Columbia, and I have the honour to submit that the boundary intended runs the following course:—\n\nCommencing at the intersection of the parallel of 49° north latitude with the line of watershed of the Rocky Mountains, northward along that line of watershed to its intersection with the meridian of 120° west longitude from Greenwich, thence northward by that meridian to its intersection with the parallel of 60° north latitude.\n\n(Aannexure 1)—British Columbia was first temporarily established as a Colony for five years, by the Act of 2nd August, 1858.\n\n(Aannexure 2 & 3)—Its boundaries were re-defined by the continuing Act of 28th July, 1863.\n\n(Aannexure 4)—It was united with Vancouver's Island, without alteration of its boundaries, by the Act of 6th August, 1866.\n\n(Aannexure 5)—And it was united to the Dominion of Canada by Order in Council of 16th May, 1871, with effect from 20th July, 1871, without change in its boundaries. Hence the Act of 6th August, 1866 (Aannexure 4), governs the case under discussion.\n\nThe Bill of 1866 passed through all its stages in both Houses of Parliament without debate; and so far as it affects the boundaries of British Columbia may be considered a repetition of the Act of 1863 (Aannexure 3).\n\n(Aannexure 3)—The continuing Act of 1863 was introduced by the Duke of Newcastle (Hansard, vol. clxxii., p. 54), who explained its objects to be to extend the Colony northward, and to continue the Act of 1858.\n\nDuring a long debate which ensued, an allusion was made by the Earl of Donoughmore (Hansard, vol. clxxii., p. 54) to reported discoveries of gold at the head-waters of the Saskatchewan, i.e., to the east of the Rocky Mountains; but no suggestion was made by his Lordship, or by anyone else, to extend the Colony eastward, nor indeed even to vary the definition of the boundaries as submitted in the Bill.\n\nThe Bill passed through its subsequent stages to end through the House of Commons without any reference being made in debate to boundaries other than Mr. Fortescue's explanation (Hansard, clxxii., p. 1322)—\"that its object was to extend the boundaries of British Columbia to the north, so as to include a tract of country in which there were indications of rich gold veins.\" And on going into Committee, Mr. Fortescue's further remarks that \"the Bill was merely for the continuance of an existing Act\" (the Act of 1858 already referred to—Aannexure 1) \"and the annexation of a tract of country to the north of Columbia, and did not require much discussion.\" No remark was made by any other Member of the House of Commons about the boundary, at this or at any future stage of the Bill.\n\nHence it is concluded that so much of the eastern boundary as was defined by the Act of 1858, was still intended to be part of the eastern boundary by the Acts of 1863 and 1866, or,\nin other words, that the line described by the Act of 1858 as \"by the main-chain of the Rocky Mountains,\" is part of the same line described in the Acts of 1863 and 1866 as \"by the Rocky Mountains.\"\n\nThe definitions of the eastern boundary by the Acts of 1858, 1863, and 1866, are as follows:\n\n(Act of 1858, Section 1)—British Columbia shall, for the purposes of this Act, be held to comprise all such Territories within the Dominions of Her Majesty as are bounded to the east by the main-chain of the Rocky Mountains, and to the north by * * *\n\n(Act of 1863, Section 3)—British Columbia shall, for the purposes of the said Act, and for all other purposes, be held to comprise all such Territories within the Dominions of Her Majesty as are bounded * * * to the east from the boundary of the United States northwards by the Rocky Mountains and the 120th meridian of west longitude, and shall include Queen Charlotte's Island * * * * * * to the east from the boundary of the United States northwards by the Rocky Mountains and the one hundred and twentieth meridian of west longitude.\n\n(Act of 1866, Section 7)—Until the Union British Columbia shall include such Territories within the Dominions of Her Majesty as are bounded * * * * * * to the east from the boundary of the United States northwards by the Rocky Mountains and the one hundred and twentieth meridian of west longitude.\n\n(Section 8)—After the Union British Columbia shall comprise all the Territories and Islands aforesaid, and Vancouver Island and the Islands adjacent thereto.\n\nThere can be no doubt as to the intended meaning of the definition of the eastern boundary in the Acts of 1863 and 1866, in so far as this line is defined by a meridian line.\n\nNow, as regards the meaning of the phrases \"by the main chain of the Rocky Mountains,\" and \"by the Rocky Mountains,\" it is to be noted that one essential characteristic of the expressions—in their application to the definition of a boundary—is that they must have been intended to indicate some presumably ascertainable and practical line. The only line of the kind which can be generally predicated as characteristic of mountain ranges is their line of water-shed.\n\nThe words \"by the main chain of the Rocky Mountains\" occurring in the Act of 1858, has special reference to a water-shed line, for it is this line which determines the main-chain.\n\nNow, it has been shewn that there was no intention to change, by the Act of 1863, so much of the eastern boundary of British Columbia as had been settled by the Act of 1858, for the Duke of Newcastle, who had charge of the Bill in 1863, expressly stated that its object was to extend the Colony northward, but otherwise only to continue the Act of 1858.\n\nConsequently the interpretation, appropriate in the nature of things, given above of the words \"by the Rocky Mountains\" occurring in the Acts of 1863 and 1866, is confirmed by the circumstance that these words were intended to be read as synonymous with the expression \"by the main chain\" of the Rocky Mountains previously used in the Act of 1858.\n\nBut there are also generally accepted rules, based upon natural principles, which regulate the interpretation of documents affecting the interests of several parties, and the application of these rules support the views just expressed. Vattel (Law of Nations, Book II., chap. xvii., paragraph 280, p. 251), in discussing the interpretation of treaties says—\"We ought always to affix such meaning to the expressions as is most suitable to the subject or matter in question.\"\n\nParagraphs 244 and 263—\"When a deed is worded in clear and precise terms, when its meaning is evident and leads to no absurd conclusion, there can be no reason for refusing to admit the meaning which such deed naturally presents. To go elsewhere in search of conjectures, in order to restrict or extend it, is but an attempt to elude it. If this dangerous method be once admitted, there will be no deed which it will not render useless. However luminous each clause may be, however clear and precise the terms in which the deed is couched, all this will be of no avail if it be allowed to go in quest of extraneous arguments to prove that it is not to be understood in the sense which it naturally presents.\"\n\nHall (on International Law, Part II., chap. x., p. 281, par. 3 (l.),) says:—\n\n\"When the language of a treaty, taken in the ordinary meaning of the words, yields a plain and reasonable sense, it must be taken as intended to be read in that sense, subject to the qualifications that any words which may have a customary meaning in treaties, differing from their common signification, must be understood to have that meaning, and that a sense cannot be adopted which leads to an absurdity, or to incompatibility of the contrast with an accepted fundamental principle of law.\"\n\nPhillimore (on International Law, vol. II., chap. lxx., par. 3,) says with reference to interpretation:—\n\"Technical words are to be construed according to their technical meaning.\n\n\"This is as universal a maxim as any that can be found in jurisprudence.\n\n\"It finds its application in international jurisprudence chiefly upon questions of geographical or local distinctions.\"\n\nAnd Hall (Part II., chap. ii., par. 38, p. 104,) states:\n\n\"The boundaries of State territory may consist either in arbitrary lines drawn from one definite point to another, or they may be defined by such natural features of a country as rivers or ranges of hills.\n\n\"In the latter case more than one principle of demarcation is possible. Certain general rules, therefore, have been accepted which provide for instances in which the absence of express agreement, or for other reasons, there is doubt or ignorance as to the frontier which may justly be claimed.\n\n\"Where a boundary follows mountains or hills, the water divide constitutes the frontier.\n\n\"Where it follows a river and it is,\" &c.\n\nIf then the words \"by the main chain of the Rocky Mountains\" and \"by the Rocky Mountains\" be admitted to have been appropriately used by the framers of the Acts of 1858, 1863 and 1866, there can be no doubt with regard to the correctness of the interpretation that construes the words as indicating a watershed line.\n\nThere is conclusive evidence of another kind that by the words \"by the main chain of the Rocky Mountains\" and \"by the Rocky Mountains\" the Acts of 1858, 1863 and 1866 did not describe an eastern boundary to British Columbia a line to the eastward of the watershed of the Rocky Mountains.\n\nThe watershed of the mountains was the then accepted western boundary of Rupert's Land, held by the Hudson's Bay Company; and the Government and Parliament desired not to interfere with the territory held by the company under charter until suitable arrangements for the purpose had been effected, or until a judicial decision adverse to the validity of the company's claim should be pronounced.\n\nOn the 5th July, 1849, Mr. Gladstone had moved an address praying \"that steps might be taken to ascertain the legality of the powers in respect to territory, &c., which are, or recently have been, claimed or exercised by the Hudson's Bay Company under the charter of Charles II. (1670),\" &c. (Hansard, 3rd series, vol. evi., page 1355.)\n\nIn making this motion, Mr. Gladstone said (page 1357):\n\n\"The terms of the motion were sufficiently clear to render it manifest that its object was to secure a full and perfect but also a dispassionate enquiry, not into the powers which the Hudson's Bay Company might possess, not into any abuse of their powers which might have been alleged against them, whether truly or unfairly, or any complaints against them, whether properly or improperly, but simply and solely to the legality of those powers.\n\nThose who would advise Her Majesty's Government as to their course, and who would be, he presumed, the law officers of the Crown, might approach this question without the recollection of any hostile debate or controversy upon it, but might regard it as one essentially judicial.\"\n\nAnd again (page 1361), \"he had distinctly said that he did not wish to weaken the company or raise any prejudices at all against their title. It appeared to him, after so much had been said, that it was fair to the company themselves that this title should be investigated; and if the result was satisfactory, the company would greatly benefit from the enquiry;\" and (page 1362), \"upon the question then before the House in relation to the old territories\" (i.e., Rupert's Land, contradistinguished from Vancouver's Island and territory held under license) \"they were happily all unanimously agreed.\"\n\nIn making a return to the address thus moved by Mr. Gladstone, the Government gave the opinion of the Law Officers of the Crown (Parliamentary Papers 542 of 1850, page 7, No. 4, Annexure 6), and (p. 13, No. 15, para. 5, and p. 15, No. 19, para. 3) the Colonial Office recorded that it was obliged to assume the opinion of the Law Officers of the Crown, in favour of the Company, to be well founded.\n\nOn the 5th February, 1857, the Secretary of State for the Colonies, Mr. Labouchere, moved for a Select Committee to consider the state of the country under the Hudson's Bay Company, with a view to its possible colonization, and then said (Hansard, 3rd Series, Vol. cxliv., p. 220) \"As however that proceeding\" (a reference to the Judicial Committee of the Privy Council proposed in 1849) \"would involve considerable expense, the persons opposing the Company declined to carry the matter further, and he was therefore justified in saying...\"\nthat those rights having been enjoyed for a great number of years, and, though frequently challenged, never disproved, must be regarded, so far as authoritative decisions went, as confirmed to the Company.\n\nMr. Roebuck followed Mr. Labouchere, and remarked (p. 226) \"the proper course for the Government to pursue would be to take away the powers of the Company. The Right Honourable gentleman (Mr. Labouchere) had however pursued a different course, and one that would perhaps be more satisfactory to the House.\"\n\nMr. Adderley spoke next, and said (p. 227) \"It mattered little whether the Charter of the Company was valid or not; it could not be maintained in opposition to the rights and necessities of mankind. The Charter if valid could only be matter for compensation.\"\n\nMr. Ellice remarked (p. 230) \"With regard to the Charter of the Company, he should observe that he did not think it would be fair to attempt to set aside its validity on the ground of any original informality in the manner or terms in which it had been granted, after it had been allowed to pass unchallenged for nearly two centuries. At the same time he believed that, if tried, its validity would be established as regarded the principal rights claimed by the Company.\"\n\nMr. Gladstone, believing that the Charter was invalid, said (p. 237) \"The question of the legality of the Charter will I trust be sifted, and sifted to the bottom, by the Committee, but I also trust that it will be sifted by means into which partiality cannot enter. * * * * * I apprehend that the proper course to pursue on such a question is that which used to be taken 200 years ago. * * * Means were taken to raise the issue fairly before the judicial tribunals of the Kingdom, and if these tribunals found that the Crown had exceeded its powers the Charter was quashed, and the subject was relieved from the damage which the Crown would have inflicted on him.\"\n\nMr. Heyley next spoke, and said (p. 238) \"It is quite clear with regard to two portions of the Territory, that they were open to be dealt with in any way that Parliament may say fit, but as to that portion held under the Charter, I agree that the Charter, which hitherto has received no judicial confirmation whatever, ought to be submitted to a tribunal properly invested with the power to decide the question of validity.\"\n\nMr. Laing, who next addressed the House, did not allude to the points hereunder discussed.\n\nMr. Baillie (p. 240) suggested \"that, in order to ascertain the validity or illegality of the Hudson's Bay Company's Charter, of which a preconceived idea appeared to exist, a Committee of the House is not the best tribunal that can be selected. I think it would have been better had the Government ascertained the opinion of the highest legal authorities upon the point, and there can be no doubt of the competence of a Committee to deal with the other branches of the subject.\"\n\nMr. Butt then said (p. 240) \"In common with many other members I am anxious that the question of the legality of the Hudson's Bay Company should be brought under the consideration of the Committee. I mean the validity of the original grant; and also whether that grant, even if originally valid, had been forfeited by an entire disregard to the consideration upon which it was made. The terms of the motion seem to assume the validity of the Charter, and I wish to point out that circumstance to the Right Honourable gentleman, in order that he may vary the terms of the reference to the Committee, if he should think it necessary, so that the whole question of the validity of the Charter may be ascertained.\"\n\nMr. Labouchere, replying (p. 241), said—\"I do not think the terms of my motion are open to the construction which the Honourable and learned gentleman has placed upon them. I do not believe them to imply any opinion as to the legality or illegality of the Hudson's Bay Company's Charter, and certainly I did not intend to convey any such impression. I quite agree with the Right Honourable member for the University of Oxford (Mr. Gladstone) that the Committee itself would be a very improper tribunal to decide a legal question, but if the Committee requires a decision upon that point, it will possess the power of sending it to the Judicial Committee of the Privy Council. * * * * * I only desire that this important and complicated question shall be fairly brought before the Committee, and I am glad to find that the course which the Government have adopted is one which has received the general approval of the House.\"\n\nMotion agreed to. Select Committee appointed.\n\nThus, of the nine members who addressed the House on the motion, eight directly referred to the claims of the Hudson's Bay Company, with respect to Rupert's Land, in terms which\nshew the House of Commons was not prepared to ignore those claims, until a judicial decision should be given adverse to them.\n\nUpon the Select Committee considering its report (Annexure 7), the Chairman (Mr. Labouchere) and Mr. Christy each proposed a draft, and Mr. Gladstone submitted ten resolutions.\n\nOf Mr. Gladstone's resolutions attention is directed to the 1st, 3rd, 5th, 6th, 8th, 9th, and 10th. (Report Hudson's Bay, Parliamentary Papers, 224-260, 1857, p. xiv.)\n\nEach of these, except the 1st and 9th, expresses more or less recognition of the interests of the Hudson's Bay Company, while the 10th directly declares that the Committee came to no decision with regard to the justice or the expediency of raising a judicial issue to ascertain the legal rights of the Company under the Charter.\n\nThe motion was then made and the question proposed—\"That the draft report proposed by the Chairman be read a second time, paragraph by paragraph.\" To this, as an amendment, it was proposed to leave out from the word \"That\" to the end of the question, in order to insert the words \"the Resolutions proposed by Mr. Gladstone be now read a second time,\" instead thereof.\n\nQuestion put— \"That the words proposed to be left out stand part of the question.\"\n\n7 votes were given for and 7 against. Upon which the Chairman voted with the ayes.\n\nThe Committee then proceeded to consider the Chairman's draft.\n\nOf this draft, the 7th paragraph declared that \"it might be desirable to ascertain precisely what is the force of the powers claimed and exercised under it,\" (i.e. the Charter of Charles II.) The 8th paragraph records the Committee's hope that \"without waiting for the result of proceedings of so doubtful and dilatory a character as may appertain to the complete investigation of this ancient charter,\" arrangements might be made for the satisfaction and benefit of those concerned; and the 9th paragraph contemplates a subsequent friendly reference to the Judicial Committee of the Privy Council, and the possible modification, by its decision, of any recommendations the Committee should make.\n\nParagraphs 7 and 8 were read and negatived.\n\nParagraph 9 was negatived by 9 votes to 4.\n\nThe final Report adopted (Annexure 7, pp. iii. and iv., para. 6) refers Parliament to the evidence and appended documents for information as to the nature of the Company's tenure.\n\nIt (paragraph 7) expresses the Committee's trust that there may be no difficulty in effecting arrangements as between Her Majesty's Government and the Hudson's Bay Company, by which these districts (Red River and the Saskatchewan) may be ceded to Canada on equitable principles; leaves it (paragraph 8) to Her Majesty's Government to consider details more maturely before the Act of Parliament is prepared which will probably be necessary to give effect to the scheme; (paragraph 13) records the Committee's inability to say, with any certainty, how far the chartered right claimed by the Company may prove an obstacle to the attainment of the objects they have urged to be desirable, and (paragraph 14) the Committee's confident hope that a spirit of conciliation and justice amongst those interested will enable the Government to present a bill which shall lay the foundation of an equitable and satisfactory arrangement in the event, which the Committee considers probable, of legislation being found necessary for the purpose.\n\nThus the Committee's report and the evidence in connection with it showed that in 1857 neither Parliament nor the Government desired to interfere with the claims of the Hudson's Bay Company under their charter, otherwise than as a result of amicable arrangement, or in consequence of a judicial decision adverse to the validity being obtained.\n\n(Annexure 1)—In 1858 a Bill was introduced into the House of Commons to establish the Colony of British Columbia (at first styled New Caledonia), the predetermined action of the Government in this matter being hastened by an influx of gold miners into the country.\n\n(Annexure 8)—Sir Bulwer Lytton, in moving the second reading of the Bill (Hansard, 3rd series, vol. ch., p. 1105), said—\"I was glad to hear the honourable and learned gentleman, the member for Sheffield (Mr. Roebuck) express his opinion that the present occasion was not a fitting opportunity for raising the question of which he had given notice.\" [Annexure 11, p. 1842.] (To resolve, 2nd, \"that the validity of the exclusive right claimed by the Hudson's Bay Company under this charter ought at once to be determined by process of law\"): \"It is desirable to keep any discussion upon this Bill free from the more angry elements which may be involved in the general question as to the powers of the Hudson's Bay Company by virtue of its charter on the different districts of Rupert's Land on the eastern side...\"\nof the Rocky Mountains, a question which the honourable member for Sheffield will have a distinct opportunity to introduce.\n\nThis statement would appear to be decisive with regard to the contention that in establishing British Columbia the Government had no intention in 1858 to encroach on the Hudson's Bay Company's right in Rupert's Land.\n\nBut, further, during the debate Mr. Labouchere expressed himself (Annexure 8, p. 1107) to the effect that, as regards colonizing, it was necessary, on the present occasion to consider Hudson's Bay Company rights, since outside of Rupert's Land the Crown in its licenses reserved power to resume territory at pleasure.\n\nMr. Roebuck (Annexure 8, p. 1111) \"abstained from introducing any topic connected with the Hudson's Bay Company into the discussion, and he had done so on the understanding that he was to have a day on which that question\" (three resolutions, one being to determine the chartered rights of the company) \"could be debated in the House.\"\n\nMr. Wyld (Annexure 8, p. 1112) \"understood the general feeling of the House to be that the discussion should be confined to the object of the present Bill, and that they should refrain from entering on the subject of the Hudson's Bay territory.\"\n\n\"Not only would there be emigration to these colonies\" (New Caledonia and Vancouver's Island) \"from California, but it would flow in from Canada, as these territories were only 47 days overland from Montreal.\n\n\"That emigration could not take that route without interfering with the territory of the Hudson's Bay Company.\"\n\nMr. Christy (Annexure 8, p. 1116) said:—\"It appeared to be a matter of agreement that the discussion on the main question (i.e., Hudson's Bay Company rights under charter, &c.) was to be taken on the motion of the honourable and learned gentlemen (Mr. Roebuck).\"\n\nThe Bill passed through its third reading and to the House of Lords, without any expression of opinion to modify the statements quoted above; but these statements made during the debate on the second reading of the Bill rendered perfectly clear that the House of Commons dealt with the subject as one which did not in any way affect Rupert's Land.\n\n(Annexure 12)—Similarly in the House of Lords when Lord Carnarvon was moving the second reading of the Bill to establish the Colony of British Columbia, on the 26th July, 1858, he remarked (Hansard, 3rd series, vol. cli., p. 2098):\n\n\"In the first place it must be borne in mind that the whole of this territory\" (i.e., the country affected by the Bill) \"was at present in the main, though not actually, subject to an exclusive license to trade with the Indians, which the Hudson's Bay Company had for many years enjoyed. It was true that that license expired next year. It was also true that the Government had no intention of renewing that license.\" Thus showing that, also in the House of Lords, the Bill was understood not to refer to Rupert's Land.\n\nA still more emphatic indication of the intention of Parliament with reference to their treatment of the rights claimed by the Hudson's Bay Company under their charter, is to be found in the circumstances of the debate on the 20th July, 1858 (Annexure 11, p. 1788), prior to the introduction of the British Columbia Bill into the House of Lords, and on the very day of its third reading in the House of Commons, when Mr. Roebuck submitted the three following resolutions:\n\n1st—That the privileges of the Hudson's Bay Company, about to expire, ought not to be renewed.\n\n2nd—That the legal validity of the exclusive rights claimed by the Hudson's Bay Company under the charter ought at once to be determined by process of law.\n\n3rd—That so much of the territory as had hitherto been held by the Hudson's Bay Company as may be needed for the purpose of colonization, ought without delay to be resumed by the Government of the country.\n\nAnd, although Mr. Roebuck held the strongest views on the impolicy and invalidity of the Company's territorial rights, he nevertheless decided to withdraw his resolution on this subject.\n\n(Annexure 11)—Mr. Roebuck, in supporting his resolutions (Hansard, vol. cli., p. 1791), said:—\"He was told that the Hudson's Bay Company had certain rights which they derived under the charter granted by Charles II. He maintained that the Company had no such rights, and it was the duty of the Government to determine whether they had or no.\n\n\"If the Company had no such rights, Parliament would know how to deal with them; and if they had, Parliament would also know how to deal with them by purchasing them out immediately.\n\"If they had rights the Government ought to buy them out immediately, and if they had none, they had been illegally enjoying the territory for many years, and the sooner they were ousted the better.\"\n\n\"He hoped (p. 1793) the Right Hon. Baronet (Sir Bulwer Lytton) would take immediate steps to ascertain the legal rights of the Hudson's Bay Company, for when those rights were ascertained they would be enabled to compensate the Company. The next measure would be to plant a Colony from the western shore of Lake Superior to the Rocky Mountains, and he entreated the Right Hon. gentleman to carry out this object without delay.\"\n\nViscount Bury in the course of a vigorous argument against the validity of Company's claims under the charter asked (Annexure II, p. 1795), \"Why should all this land (Rupert's Land) be reserved to the Company when neither the Government nor the House know whether they had any right to it?\" And closed his speech (p. 1802) with an expression of his trust \"that Her Majesty's Government would not be backward in acting upon the suggestions that would be made.\"\n\n(Aannexure II)—Mr. Gladstone said (p. 1803) \"Of those propositions the most important is the second,\" (viz., that the legal validity of the exclusive rights of the Company under their charter should be determined by force of law).\n\n(Page 1806) \"It would therefore, I think, appear, without making the House responsible for the arguments which have been addressed to it, that there are very serious reasons in law for questioning the powers at present possessed and exercised by the Hudson's Bay Company.\"\n\n(Page 1808) \"If the Company has rights, then, as my Hon. and learned friend says, the case is clear, it is entitled to the full and absolute enjoyment of them, and cannot be deprived of them except on that ample compensation which it may claim on the ground of justice. It might on the other hand appear that although the Company have not very great rights in law, yet that in point of equity and fairness there are reasons for a liberal entertainment of their claims.\"\n\n\"We should not assume that those who think the legal rights of the Company ought to be tested by an investigation, are therefore of opinion that the Company should be harshly and severely dealt with.\"\n\n(Page 1809) \"I shall not be suspected of any want of sympathy if I venture, respectfully, to submit to them\" (the mover and seconder) \"whether they would not do well to leave the further treatment of the questions for the present in the hands of Her Majesty's Ministers. I think it probable that any division which might take place would tend to create a false impression out of doors; I hope, therefore, that the Hon. and learned Member for Sheffield will listen to the statements which will doubtless be made by Ministers of the Crown, and unless these statements are of a character entirely hostile in principle to his views, he will then be prepared to leave the subject in the hands of the Executive Government.\"\n\nMr. Labouchere (Annexure II, p. 1809) \"believed that every member of the Committee which enquired into this subject a few years ago, including the Right Hon. gentleman (Mr. Gladstone) himself, was of opinion that setting aside the question of charter or no charter, as merely a secondary matter, those vast tracts ought not to be left to chance, but should, for Imperial purposes, be intrusted to the care of somebody or other; the general feeling being that the preference should be given to the existing Company, which was already in occupation of the territory.\"\n\n[Page 1810] \"He could assure the House that when he was in office he looked most anxiously to see if there was any way of having its (the charter) validity tested.\n\nMore than a hundred years ago the Government of that day were anxious to obtain information on the same point, and referred the propriety of raising this question to their Law Officers, men so eminent in their profession as Lord Mansfield, who was then Attorney-General, and Sir Dudley Ryder, who was Solicitor-General.\n\nTheir answer was that considering how long the Hudson's Bay Company had enjoyed and acted under their charter without the slightest interruption, they did not think it was advisable that the Government should try the question of its validity in the courts of law, but should await some implied or expressed declaration of a court of law against it. Well, when he (Mr. Labouchere) was in office he raised the subject again and referred to the Law Officers—Sir Richard Bethell and Sir Henry Keating. Sir Richard Bethell soon afterwards told him, in conversation, that he never could recommend the bringing of a quo\n\"warrant\" against a charter of that description; that he thought it a tyrannical and high-\nhanded proceeding which no Government ought to undertake.\n\n\"The two Law Officers afterwards gave their opinion in writing that the Crown ought\nnot in justice to raise this question as to the general validity of the charter; but that on\nevery legal principle the Company's territorial ownership of the land, and the penegees and\nrights incidental thereto—as for example the right of excluding persons acting in violation\nof their regulations—ought to be deemed valid.\"\n\n[Page 181] \"From conversations he (Mr. Labouchere) had held upon this subject with\nthe most eminent lawyers, both of this country and of Canada, he believed what could be\naffirmed on the matter was, that so far as a right to the territory was concerned, the charter\nwas good, but, that so far as exclusive trade was concerned, the Crown had acted *ultra vires*\nin granting it.\n\n* * *\n\nThe country held under license\n(that is, in contradistinction to the country held under charter) \"was never given to the\nCompany except with the distinct reservation on the part of the Crown of the right to\nestablish Colonies. At the present moment the Government might erect in that part of the\nterritory a Colony without asking the leave of the Company, and the Bill before the House\n\"in reference to New Caledonia\" (i.e., British Columbia) \"was a proof of the correctness of\nhis statement.\"\n\n[Page 1813] \"Lord Grey when Colonial Minister referred the question as to the validity\nof the rights claimed by the Hudson's Bay Company to the Law Officers of the Crown, who\ncame to the deliberate conclusion, to which he (Mr. Labouchere) himself subsequently arrived,\nthat it would not be becoming or consistent with precedent for the Government to institute\nproceedings with a view to try the validity of a charter granted by the Crown. He should,\ntherefore object to the resolution proposed in relation to that point.\"\n\n[Page 1813] \"Under these circumstances he thought the House had better leave the\nmatter in the hands of the Executive Government, whose views would doubtless be explained\nby the Right Hon. Baronet (Sir Bulwer Lytton) opposite.\"\n\nSir Bulwer Lytton, Colonial Secretary, said [Annexure 11, p. 1816]:—\"The license is a\nquestion wholly distinct from that of the charter, the license gives none of the territorial\nrights which the charter assumes, it involves no principle of compensation in case of lands\nwhich Colonies may require.\"\n\n[Page 1819] \"But now comes the difficulty. The land\" (i.e., about Red River) \"he\nwould thus dispose of for colonization is within the charter of the Hudson's Bay Company,\nand if that charter be valid, the land belongs to the Company, but not the monopoly of trade,\nexcept as includes the right of ownership to keep others off the land. The Law Officers\nof the late Government, men of very high distinction, consider that the Crown cannot now\nwith justice raise the question of general validity of the charter.\"\n\n[Page 1820] \"It is our intention to submit the question to the most careful and deliberate\nconsideration of our Law Officers, and ascertain from them whether in equity and justice we\ncould advise the Crown or recommend to Parliament any mode by which to facilitate a\njudicial decision upon this venerable title deed.\"\n\n[Page 1821] \"We can obviously say nothing till their\" (the Law Officers) \"opinion is\nreceived.\"\n\nLord John Russell [p. 1822] said, \"the Right Hon. gentleman (Sir B. Lytton) who has\njust sat down, has a difficult task before him, and I am quite sure that the House will be\ninclined to give him whatever time he may think necessary in order to decide upon the course\nof policy which may seem most useful to the country and most beneficial to mankind.\" *\n\n[Page 1822] \"We have then this further question, what are the rights of the Company?\nNow, coming to this last point, which I think involves the greatest difficulty of all.\" *\n\n(p. 1823) \"if upon the other hand it should be found that they do possess such a right, and\nthat you think it necessary for Imperial purposes to take away from them privileges which\nthey now enjoy, then I think they must be held to have a claim to compensation which you\ncannot resist.\"\n\nMr. Mills [Annexure 11, p. 1826] \"certainly agreed with the spirit of the three resolutions\nproposed by the Hon. and learned gentleman, and he cordially hoped the day was not far\ndistant when the important question alluded to by the noble Lord would be settled in a\nmanner satisfactory to the people of Great Britain.\"\n\nMr. Lowe [Annexure 11, p. 1827] \"held that it would be derogatory to the dignity of\nthe Government, derogatory to the dignity and good faith of the House if they were now to\n\"turn round on the Company and say, 'we have permitted you to occupy this territory for\n200 years; we have recognised your existence in all kinds of public documents, but now we\nwish to get rid of you, and we will not even repay you the capital you have invested in\nposts and buildings for your trading operations; we will raise a question of law, and we will\nchicane you out of the rights which our own charter gave you.' No authority, however\nhigh, could induce him to sanction such a step. It would be disreputable in a private indi-\nvidual, it would be disreputable and infamous on the part of a Government.\"\n\n[Annexure II, Hansard 20, 7, 58, p. 1832] Mr. Christy said:\n\n* * *\n\n\"Even\nif it was decided that the charter was not valid, provision might be made to enable them\"\n(i.e., the Hudson's Bay Company) \"to carry on their traffic in furs in the northern and more\ninhospitable portions of their territory.\"\n\n* * *\n\n[Page 1834] \"He saw no reason why the legal rights of the Hudson's Bay Company\nshould not be settled by a friendly suit, the Crown paying the costs of both sides.\"\n\nMr. Gilpin [Annexure II, p. 1837] \"thought that the question of the charter and its\nvalidity must be thoroughly investigated in the first instance.\"\n\n* * *\n\n[Page 1838] \"He had endeavoured to show that the original grant was illegal, that it was\nopposed to sound policy and public interest, and he earnestly hoped that the House would\ntake its stand on the ground of simple justice, would abrogate unrighteous assumptions, and\nby the adoption of these resolutions of his learned friend the Member for Sheffield, would\ndeclare to the world its determination to uphold against all selfish, private, and illegal claims,\nthe interests of commerce, the extension of civilization, and, above all, the rights of humanity.\"\n\nMr. Kinnaid [Annexure II, p. 1839] \"must, however, express his concurrence in the\nopinion of the Hon. and learned Member for Sheffield that it was most desirable that the\nquestion as to the validity of the Company's charter should be determined.\"\n\nMr. Chichester Fortescue [Annexure II, p. 1840] \"trusted the House would not forget\nthe facts of the case, would not sacrifice the interests of justice, and would not allow them-\nselves to be carried away by the abstract proposition of the Hon. and learned gentleman\n[Mr. Roebuck], which would be committing an act of pedantry instead of an act of states-\nmanship.\"\n\nMr. Wyld [Annexure II, p. 1841] \"thought that the Right Hon. gentleman, the Secretary\nof State for the Colonies, had prepared a satisfactory solution of the question.\"\n\nMr. Fitzgerald remarked [Annexure II, p. 1844] \"that assuming that he and other Hon.\nmembers only desired that the Hudson's Bay Company should be treated with justice and\nliberality, he could not, for his own part, see how it was possible to proceed to deal with\nthem in that spirit until their rights had been ascertained.\"\n\nMr. Roebuck [Hansard 20, 7, 84, Annexure II, pp. 1812-3]—\"But the second proposition\nhe believed the Right Hon. gentleman [Sir E. B. Lytton] did not quite agree with, which\nwas that the rights of the Company ought to be at once ascertained by legal process. The\nRight Hon. Baronet said that he thought the rights ought to be determined, and that he\nwould apply his mind to the consideration of the best mode of determining them; but he did\nnot say that he would do so by means of a legal process. He came, however, so near to his\nproposition that he [Mr. Roebuck] felt that he had better leave the matter in the hands of\nthe Right Hon. Baronet, to be dealt with as he might deem best.\"\n\n* * *\n\n[Annexure II, p. 1844] \"Having made these observations he should, with the permission\nof the House, withdraw his motion.\"\n\n\"Motion by leave withdrawn.\"\n\nThese extracts from the debate on Mr. Roebuck's Resolutions on the 20th July, 1858,\nindicate that all the speakers, with one exception [Mr. Fitzwilliam not having expressed an\nopinion on the subject], consider it proper to recognise the undisproved charter claims of the\nHudson's Bay Company at any rate until a judicial decision against their validity should be\ndelivered, or until the Company voluntarily agreed to their modification.\n\n[Annexure 3]—The Government in 1863, when the continuation Act was passed, sti-\nheld the vi w that Rupert's Land could not be interfered with. On 5th July, 1862, Messrs.\nBaring and Glyn made a proposal to the Government [Annexure 13, Parliamentary papers\n438 of 1863, No. 2, p. 5] towards the establishment of telegraphie and road service to the\nPacific through British territory, and asked would the Government be ready to grant land\nin aid.\n\nIn replying, the Secretary of State for the Colonies, His Grace the Duke of Newcastle,\n(Annexure 13, No. 3, p. 6) \"regretted that Her Majesty's Government could not afford any\n\"direct pecuniary assistance to the object, and that, except in British Columbia, he had no power to make any grant of land for the purpose.\n\n\"He had written to the Hudson's Bay Company, through whose territories any such communication must pass, to enquire what facilities they would be ready to afford to the undertaking,\" and suggested \"that the gentlemen associated with Messrs. Baring and Glyn should place themselves in communication with the Chairman of that Company,\" and \"in case of any satisfactory arrangements being made with them, His Grace would write to the Governors of Canada and British Columbia and endeavour to procure for Messrs. Baring and Glyn some concession of land from those Colonies.\"\n\nIn pursuance of the foregoing, the Colonial Office addressed a letter to the Hudson's Bay Company (Annexure 13, No. 4, p. 6), in which occurs this passage—\"As, however, the proposed communication could only be carried through the territory over which the Hudson's Bay Company claims rights, His Grace though not permitting himself to doubt, from the tenor of your letter of the 19th May, that the Company would afford such facilities as are in their power for co-operating in this great public object, would, nevertheless, be glad to learn distinctly whether they would concede a line of territory to any company which men of such position and character as those who have signed the enclosed letter might form for the purpose.\"\n\nAgain, on the 31st July, 1862, in a letter on the same subject (Annexure 13, No. 9, p. 8) to the Hudson's Bay Company, the Colonial Office refers to the route of communication as \"a road through the country comprised in your charter.\"\n\nOn the 28th April, 1863, (Annexure 13, p. 13) \"Heads of proposals for establishing the telegraphic and postal communication\" were submitted to the Colonial Office by the Promoters' Company, and amongst the terms was— \"No. 1. That the Imperial Government, the Colonies of Canada, and British Columbia shall, within the territories belonging to them, grant to the Company (the promoters' Company) such land belonging to the Crown or Company (i.e., Hudson's Bay Company), and all such rights as may be required, &c., and No. 3. In case the route shall run through Crown lands not within the limits of Canada or British Columbia, nor within the territory claimable by the Hudson's Bay Company, the Company (i.e., the promoters' Company) shall be entitled to demand Crown grants to the extent of five square miles for every mile of telegraph line with such Crown lands.\"\n\nReplying on 1st May, 1863 (Annexure 13, No. 14, p. 13), the Colonial Office remarked:—\n\n\"Article 1.—His Grace sees no objection to the grant of land contemplated in this article, but the rights stipulated for, &c.\"\n\n* * *\n\n\"His Grace apprehends that the Crown land contemplated in Article 3 is the territory lying between the Eastern Boundary of British Columbia and the territory purporting to be granted to the Hudson's Bay Company by this charter.\"\n\n\"His Grace must clearly explain that Her Majesty's Government do not undertake, in performance of this article of the agreement, to go to the expense of settling any questions of disputed boundary, but only to grant land to which the Crown title is clear.\"\n\nIn connection with this remark by the Colonial Office, it may be convenient to note here, that on the 20th July, 1863 (Hansard, 3rd series, vol. clxxii., p. 1052), Mr. Wyld asked the Under Secretary of State for the Colonies, if Her Majesty's Government had signified their intention to grant 1,000,000 acres of Crown territory traversed by a proposed telegraphic line between Canada and British Columbia; if the Government had determined in which district the grant was to be made.\n\nMr. Chichester Fortescue, in replying, stated (Hansard, vol. clxxi., p. 1053):—\"The district to which the question of the Hon. gentleman referred, if it existed at all, lay between the western limits of the boundary claimed by the Hudson's Bay Company and the eastern limits of British Columbia. It was probable it would be under the Government of Canada, as it was separated from British Columbia by a mountain chain.\"\n\nMr. Fortescue is understood to refer here to the part of the line which it was contemplated might leave Rupert's Land before reaching British Columbia in order to strike the Rocky Mountains at a convenient pass, and then the route would necessarily pass through territory included in neither Rupert's Land nor in British Columbia.\n\nIn Parliamentary Papers, 438 of 1863, No. 14, p. 14 (Annexure 13), it will be seen that, under date 1st May, 1863, Mr. Fortescue addressed the promoters of the Telegraphic Company, saying:—\"His Grace takes it for granted that if the Imperial Government and that of British\n\"Columbia should find, on further enquiry, that some other point on the coast would supply a \"more convenient terminus, the Company would be ready to adopt it.\"\n\nThe \"Heads of Proposals\" (Annexure 13, p. 13, par. 3) submitted by the promoters also contemplated alternative routes.\n\nOne of the routes in contemplation is understood to have been westward through Fort Edmonton (N. lat. 53° 30', W. long. 113° 20') to Jasper House, and thence through the Yellow Head Pass. Such a route would have involved the traversing approximately 60 miles of the mountain chain between the western limits of the boundary claimed by the Hudson's Bay Company and the eastern limits of British Columbia at Cow-dung Lake (N. lat. 52° 50', W. long. 118° 40').\n\nThen, on 29th June, 1863, the Colonial Office, writing to Mr. Sandford Fleming, delegate from inhabitants of Red River on the subject, remarks (Parliamentary Paper 438, appendix page 21):\n\n\"With the aid of these two Colonies\" (Canada and British Columbia), \"which have already been addressed on the subject, and by means of a concession to the promoters of the enterprise, of land in the district of country which is free from the rights of the Hudson's Bay Company, the Duke of Newcastle trusts that the execution of the project will be entered upon at no distant date.\"\n\n(Parliamentary Papers 402, 1864, No. 8, p. 16)—Again, in the penultimate paragraph of the Report of a Committee of the Canadian Executive Council, (Annexure 14), on 18th February, 1864, explaining its reasons for proposing to break off connection with the telegraph and postal scheme, it refers to His Grace the Duke of Newcastle as apparently sanctioning the reassertion by the Hudson's Bay of territorial rights not included in the charter of Charles II.\n\nIt has now been shown that from the date of the continuing Act of 28th July, 1863 (Annexure 3), the Government and Parliament indicated their intention not to encroach upon Rupert's Land. It remains to be explained what was the generally and officially recognized western boundary of Rupert's Land.\n\nThe territory is defined in the charter of Charles II. (Parliamentary Papers 224-260, 1857, Hudson's Bay Company, Appendix 11, page 408, to be as follows:\n\n\"All the lands, countries and territories upon the confines of the seas, straits, bays, lakes, rivers, creeks and sounds, in whatsoever latitude they may lie, within the entrance of the straits, commonly called Hudson's Straits.\"\n\nOn July 5th, 1849, Mr. Gladstone, in moving an address to determine the legality of the Hudson's Bay Company's claims (Hansard, third series, vol. evi., p. 1356), said:\n\n\"The original charter was only considered to apply to the territories in the immediate vicinity of Hudson's Bay, and those lands which are watered by the large rivers that run into the bay. Those waters took their source from the Rocky Mountains, and descending thence through various rivers and lakes, at length entered Athabasca Lake, on the west of Hudson's Bay. By these waters the territory over which the Company possessed power under their original charter was usually held and considered to be defined. The territory to the north and to the north-west was comprised within the waters which ran into the Pacific and the Arctic Oceans, and this territory was the subject-matter of the license of exclusive trading granted in 1838.\"\n\n(Annexures 6 & 15)—A reference to maps and to the Hudson's Bay Company's claims submitted in Parliamentary Paper 542 of 1850, p. 4, will show that Mr. Gladstone's reference to Athabasca Lake is erroneous, and that probably he intended to have named Lake Winnipeg.\n\nThe Parliamentary Paper 542 (Annexure 6) was the return made to the address moved by Mr. Gladstone.\n\nIn it (p. 4) the Hudson's Bay Company refer to the charter of Charles II. as defining their rights, and submit a map showing Rupert's Land as the basin emptying into Hudson's Bay. This map shows the Saskatchewan River and its sources as included in Rupert's Land.\n\nIn the evidence taken by the Select Committee (Annexure 7) to enquire into the state of British possessions under the Hudson's Bay Company (Parliamentary Paper 224-260 of 1857), at question 26, Mr. Ross, a member of the Canadian Parliament and successively Solicitor and Attorney-General and Speaker of the Legislative Council, is asked:\n\n\"The watershed line is the recognized boundary (i.e., of Canada) to the north and north-east, is it not?\"\n\nAnswer.—\"That is taken to be the boundary. There is very often a dispute as to where that is.\"\nWith regard to this question and answer it is to be remarked that the boundary of Canada here referred to is determined by the limits of Rupert's Land, under the charter of Charles II.\n\nQuestion 718.—Sir George Simpson, Governor of the Hudson's Bay Company for 37 years, is asked:\n\n\"How would you describe the limits of Rupert's Land to the west?\"\n\nAnswer.—\"The Rocky Mountains to the west.\"\n\nQuestion 737.—\"I (Mr. Gladstone) think you have spoken of Rupert's Land as including, 'from west to east, the whole country beginning from the Rocky Mountains and moving eastward'?\"\n\n\"Yes, to the shores of the bay [i.e., Hudson's Bay].\"\n\n738.—\"Do you understand that to have been the original signification of the term 'Rupert's Land, dating from the period of the charter'?\"\n\n\"Yes; that it includes the land on all waters falling into Hudson's Bay. They form the boundary of the territory.\"\n\n739.—\"There is a reference in the charter to the fall of the water, is there?\"\n\n\"I cannot call that positively to mind; that is the impression on my mind.\"\n\n740.—\"It is difficult, I suppose, for you to state what you would take as the northern boundary?\"\n\n\"The northern boundary of Rupert's Land I call the Methy Portage and Lake, dividing the waters that fall into the Arctic Sea. There is a height of land at the Methy Portage.\"\n\nQuestion 3106.—Sir John Richardson, C.B., is asked:—\"Then there has been no mine opened on the Hudson's Bay territory?\"\n\nAnswer.—\"Not that I know of. The watershed into Hudson's Bay, I suppose, divides the two Governments. The watershed into Lake Superior belongs to Canada, and the watershed in Hudson's Bay to the Hudson's Bay territory.\"\n\nQuestion 4056.—The Hon. Mr. Draper, Chief Justice of the Court of Common Pleas of Upper Canada, deputed by the Canadian Government to attend the Committee in Canadian interests, is asked:\n\n\"Taking the points in the order in which you have mentioned them; first of all with regard to the question of the limits of the Province of Canada, are there any statements which you wish to lay before the Committee on that head?\"\n\nAnswer.—\"I should say with regard to that point that the view which is taken, be it sound or unsound, is this:—At present it is understood by us [i.e., in Canada] 'that the Hudson's Bay Company claims as a legal right all the land which is drained by any streams, no matter how remote their sources may be, which flow into the Hudson's Bay Straits or Hudson's Bay. We consider that as an ill-founded claim' [i.e., as it affects the Canadian boundary].\n\n[Annexure 7]—See Parliamentary Paper 224-260 of 1857, appendix 5, enclosure memorandum.\n\nQuestion 4130 [by Sir John Pakington]—\"We see on that map\" [plans referred to in the Report—Parliamentary Paper 224-260 of 1857—Annexure 7] \"a district close to the line of boundary between the United States and the British territory of very considerable extent, marked pink. I apprehend that that is so marked pink because it does not come within the definition of Rupert's Land, as described by the waters which fall into Hudson's Bay. Is not that so?\"\n\nAnswer—\"I suppose it to be so.\"\n\nIt is to be here noted that the map alluded to [Arrowsmith's] shows a water-shed boundary to Rupert's Land, as in the map [Annexure 7] attached to Parliamentary Paper 542 of 1850; and of these maps Mr. Richard King says, in reply to question 5641:—\"I hold in my hand one of Arrowsmith's very best and recent maps, he being the great authority upon that country\" [i.e., British North-west America].\n\nQuestion 5833.—The Right Honourable Edward Ellice, M.P., connected with the Canadian fur trade and Hudson's Bay Company since 1803, was asked:\n\n\"Have you ever considered the question of a boundary between your territory and Canada?\"\n\nAnswer—\"Yes; I have considered it very much. Until you have some decision of a court of law against it, you must take the words of the charter.\"\n\n\"Taking the grant in connection with the various occasions on which the Legislature and the Government of this country have been cautious to save the rights of the Hudson's Bay...\"\n\"Company, I do not think there can be any doubt as to the boundaries of the Hudson's Bay Company.\"\n\nQuestion 5868.—\"Then you draw a distinction between the western and eastern sides of the Rocky Mountains?\"\n\nAnswer.—\"I draw a great distinction, inasmuch as the Hudson's Bay Company have no exclusive rights whatever to the westward of the Rocky Mountains.\"\n\nQuestion 6057.—\"Did not the Hudson's Bay Company at the time I [Mr. Grogan] am referring to, previous to the junction of the two Companies [i.e., the Hudson's Bay and North-West Companies], claim as unlimited and extended a jurisdiction over Rupert's Land as they do now?\"\n\nAnswer.—\"Yes, just the same.\"\n\n(Annexure 7) Opinion of the Law Officers of the Crown, Sir Richard Bethell and Sir Richard Keating, who had before them the details, including maps showing the claims of the Hudson's Bay Company (July, 1857, Parliamentary paper 224-260, Appendix, p. 404). *\n\n\"On every legal principle the Company's territorial ownership of the lands granted and the rights necessarily incidental thereto (as for example the right of excluding from the territory persons acting in violation of their regulations) ought to be deemed to be valid.\" *\n\n\"The remaining subject of consideration, is the question of the geographical extent of the territory granted by the charter, and whether its boundaries can in any and what manner be ascertained. In the case of grants of considerable age such as this charter, when the words, as is often the case, are indefinite or ambiguous, the rule is that they are construed by usage and enjoyment, including in these terms the assertion of ownership by the Company on important public occasions; such as the Treaties of Ryswick and Utrecht, and again in 1850.\"\n\nBut in connection with the proviso in the charter, making it applicable to only such territory as did not belong to non-British subjects, the Law Officers recommended that the boundary between Hudson's Bay Territory and Canada should be subjected to quasi-judicial enquiry. This exception, however, did not affect the western boundary of Rupert's Land.\n\n(Annexure 1) In 1858 Sir B. Lytton submitted a Bill to Parliament to provide for the Government of British Columbia. In its original form the 1st clause of the Bill defined the eastern and northern boundaries in the following terms:\n\n\"On the East the watershed between the streams which flow into the Pacific, and the Atlantic, and Icy Oceans; on the North the 55th parallel of north latitude.\"\n\nDuring the debate on the second reading, 8th July, 1858, Mr. Wyld (Annexure 8, Hansard, 3rd series, vol. cii., p. 1113) remarked—\"He would at the same time point out the desirability of making an alteration in the existing boundary, which had been found to be an inconvenient one. A degree of latitude had been suggested for that purpose, and he thought it better that the course of the river should be adopted.\" (Sir Bulwer Lytton having previously said, page 1098)—\"that the territory may be considered as extending to the sources of the Fraser River, in latitude 55 degrees.\"\n\nMr. Edward Ellice followed Mr. Wyld in the debate, and was immediately succeeded by Mr. Christy, who said (Annexure 8, p. 1116)—\"He had some objection, however, to the geographical arrangement proposed, and on a future stage he should move an amendment with regard to the boundaries of the Colony which he hoped would commend itself to the approval of the Government. He gathered from those men who had been in the territory that the gold which was found in the Fraser River was merely the débris of the gold that existed in the Rocky Mountains, and he therefore thought it desirable that the boundaries of the new Colony should be extended further north up to Finlay's River, and to the main chain of the Rocky Mountains that ran east and west. He was far from thinking that it would not be a judicious arrangement to confine the Hudson's Bay Company to those northern districts which were productive of profit to them.\"\n\nIn neither of these proposals by Mr. Wyld and Mr. Christy is there any information of a desire to move the eastern boundary. Nor beyond Mr. Wyld's desire to adopt a geographical feature instead of a parallel of latitude, and Mr. Christy's wish to extend the territory northward to the rivers and mountain line, is there any indication of a suggested alteration of clause 1 as it originally stood.\n\nMr. Christy's remarks would make it appear that the Rocky Mountains ran east and west in the neighbourhood of the Finlay branch of the Peace River; but there is no such course followed by the Rocky Mountains, and his allusion to these mountains must be attributed to a misconception of their features.\nHowever, when the Bill was in Committee (Annexure 9, Hansard, p. 1347) Mr. Christy modified his intended amendment, and submitted that the eastern boundary should be \"the main-chain of the Rocky Mountains,\" and the northern boundary \"Simpson's River and the Finlay branch of the Peace River.\"\n\nThese amendments were adopted. As regards the expression \"main-chain of the Rocky Mountains,\" it is to be observed that it is practically synonymous with the water-shed boundary described in clause 1—as the clause was originally submitted,—for it is the main-chain of the Rocky Mountains which forms the divide between the waters flowing into the Pacific and into the Atlantic and Icy Oceans from the United States to north latitude 55°.\n\n(Colonial Office Library No. 461.) A reference to Mr. Wyld's large 4 sheet map of British North America, 1825, affords an explanation of Mr. Christy's amendments. On that map it will be seen that the Rocky Mountain chain is strongly delineated from the United States boundary northward, to a point about 57° north latitude, where the Finlay branch of Peace River is shown as commencing; then carrying the eye westward, Simpson's River may be noted as running due westward into the northern extremity of Observatory Inlet, at, approximately, 56° north latitude; the two rivers forming an almost continuous line.\n\nThe part of the mountain chain is also shown as running east and west along the north of Finlay River, accounting for Mr. Christy's remark on second reading.\n\nIt may be reasonably assumed then that Mr. Christy referred to this map and desired to adopt these supposed geographical features instead of a parallel of latitude, both because of the convenience of such natural features in marking boundary lines, and also to make certain of including the sources of the Fraser River in the new Colony on account of their supposed gold-bearing character.\n\n(Annexure 15) The Simpson's River, apparently copied by Arrowsmith (whose map was laid before the Select Committee) from Wyld's map (1825) of North America, does not really exist. Wyld took the precaution to indicate that the river had not been explored. Arrowsmith neglected this important point.\n\nBut under these circumstances, and with the slightest topographical knowledge of the territory then available, it was natural for Sir B. Lytton, who had charge of the Bill, to describe these amendments as \"one or two verbal alterations only.\" He referred to the amendments in those terms on the 10th July, 1858, when the Bill was recommitted (Annexure 11, Hansard, 3rd series, vol. clii., p. 1767); and the language of Sir B. Lytton on that occasion is consistent only with the supposition that the eastern boundary did not encroach on Rupert's Land, which, as has been shown, he had already affirmed, with the general assent of the House, should not be encroached upon without further investigation and a judicial decision as to the rights of the Hudson's Bay Company under their charter.\n\nThe eastern boundary of British Columbia was not, subsequently, discussed or changed in 1863 or 1866 (Annexure 3 and 4), when Acts defining the boundaries of British Columbia were passed. Lord Donoughmore in 1863, on the second reading of the Bill for the Act passed in that year (Hansard, 3rd series, vol. clxxiii., p. 54), incidentally referred to reports of gold being discovered \"on the eastern side of the Rocky Mountains, on the head-waters of the Saskatchewan River, as well as on the western side,\" in support of his contention that communication should be established from Canada across the continent. But the river Saskatchewan was admitted to be wholly within Rupert's Land, and His Lordship made no suggestion that the eastern boundary of British Columbia should be changed. On the contrary, recognizing the existence of the Hudson's Bay claims on the eastern side of the mountains, His Lordship remarked (Annexure, p. 55) that he believed the Hudson's Bay Company had been a complete bar to the progress of the country.\n\nHence it is concluded the western limit of Rupert's Land was from 1858 to 1866 recognized to be the water-shed line of the Rocky Mountains.\n\nThat in defining British Columbia the Government and Parliament intended to avoid encroaching on Rupert's Land.\n\nThat, consequently, they could not consistently, and did not, indicate an eastern boundary for British Columbia to the eastward of the Rocky Mountains' water-shed.\n\nFinally, it will be found that the main-chain of the Rocky Mountains, or their water-shed line, is that which is shown as the eastern boundary of British Columbia (Annexure 16) on the official map of British Columbia of 1870, by the Hon. Mr. Trutch, appointed in 1870 (Annexure 5) with other delegates to negotiate with the Government of the Dominion of Canada for the union of British Columbia with the Dominion.\nMr. Trutch, a resident in the Colony since 1859, had been employed by the British Columbia Survey Department for several years, and had been Chief Commissioner of Lands and Surveyor-General since May, 1864, very shortly after the passing of the Act of 1863 to define the boundaries of the Colony, and to continue the Act of 1858.\n\nThe map in question was drawn under his direction. He was the first Lieutenant-Governor of the Colony after its union with the Dominion. This map may, therefore, be reasonably held to be decisive of what was considered in 1870 by the British Columbia Government to be the eastern boundary of their Colony, and accepted as such by the Government of the Dominion of Canada.\n\nOn the other hand, there is no discoverable ground for supposing that either of the Acts of 1858, 1863, and 1866, should be construed as locating the eastern boundary of British Columbia, so as to leave an exceptional strip of territory between the eastern boundary of the Colony and the western boundary of Rupert's Land.\n\nIn conclusion, whether the intention of Parliament in defining the eastern boundary line of British Columbia by the Act of 1863 be sought for, by the application of generally accepted rules of interpretation, directly to the wording of the Act, or be sought for by examining the official records to discover what might reasonably be concluded would be the intention, the same result is arrived at, viz., that the Parliament of 1866 intended to describe the Rocky Mountain watershed line when using the words \"by the Rocky Mountains\" (Annexure 4) in the 7th section of the Act for the union of the Colony of Vancouver's Island with the Colony of British Columbia, 6th August, 1866.\n\nI have the honour to be,\n\nMy Lord,\nYour Lordship's most obedient humble servant,\n\n(Signed) D. R. Cameron,\nLieut.-Colonel, R.A.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_13609.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 35178, "total-output-tokens": 16531, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1469, 3], [1469, 2574, 4], [2574, 5970, 5], [5970, 10906, 6], [10906, 15537, 7], [15537, 20315, 8], [20315, 25144, 9], [25144, 29727, 10], [29727, 34382, 11], [34382, 39117, 12], [39117, 43936, 13], [43936, 48703, 14], [48703, 53243, 15], [53243, 57315, 16], [57315, 62013, 17], [62013, 66865, 18], [66865, 68702, 19], [68702, 68702, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]