[{"id": "d01d4d20e62b65e1d07c8d8602b25d88b4431d81", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n  Couverture de couleur\n\n- [ ] Covers damaged/\n  Couverture endommagée\n\n- [ ] Covers restored and/or laminated/\n  Couverture restaurée et/ou pelliculée\n\n- [ ] Cover title missing/\n  Le titre de couverture manque\n\n- [ ] Coloured maps/\n  Cartes géographiques en couleur\n\n- [ ] Coloured ink (i.e. other than blue or black)/\n  Encre de couleur (i.e. autre que bleue ou noire)\n\n- [ ] Coloured plates and/or illustrations/\n  Planches et/ou illustrations en couleur\n\n- [ ] Bound with other material/\n  Relié avec d'autres documents\n\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n  La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n  Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n- [ ] Additional comments:/\n  Commentaires supplémentaires:\n\nIrregular paging:\n[1]- 11, [89]- 141, [33]- 40.\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/\n  Pages de couleur\n\n- [ ] Pages damaged/\n  Pages endommagées\n\n- [ ] Pages restored and/or laminated/\n  Pages restaurées et/ou pelliculées\n\n- [ ] Pages discoloured, stained or foxed/\n  Pages décolorées, tachetées ou piquées\n\n- [ ] Pages detached/\n  Pages détachées\n\n- [ ] Showthrough/\n  Transparence\n\n- [ ] Quality of print varies/\n  Qualité inégale de l'impression\n\n- [ ] Includes supplementary material/\n  Comprend du matériel supplémentaire\n\n- [ ] Only edition available/\n  Seule édition disponible\n\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n  Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nPRESIDENTIAL ADDRESS\n\nBEFORE THE\n\nROYAL SOCIETY OF CANADA\n\nWITH PAPERS FROM THE TRANSACTIONS\n\nBY SANDFORD FLEMING, C.M.G., LL.D., M.Inst., C.E., F.G.S., &c.\n\nPRESIDENT 1888—9.\n\nVOL. 7, SECTION II. EXPEDITIONS TO THE PACIFIC.\n\nVOL. 7, SECTION III. A PROBLEM IN POLITICAL SCIENCE.\n\nMONTREAL\n\nDAWSON BROTHERS, PUBLISHERS\n\n1890\nADDRESS OF THE PRESIDENT.\n\nIn pursuance of notice a public meeting was held at 4.30 o'clock, on Tuesday, in the Railway Committee Room, and His Excellency the Governor-General was pleased to occupy the chair as Honorary President.\n\nThe President of the Society, Mr. Sandford Fleming, then delivered the following address:\n\nMAY IT PLEASE YOUR EXCELLENCY.—It is my agreeable duty on behalf of this Society to offer you our united thanks for accepting today the position of Honorary President. It is especially my duty respectfully to thank your Excellency for presiding at this meeting on the opening day of the present session.\n\nThe Royal Society of Canada since its establishment, has enjoyed the friendship and countenance of each successive Governor-General. We have great satisfaction in knowing that your Excellency takes an interest in our proceedings as your predecessors have done.\n\nIn fulfilling the duties of my office, it would, under ordinary circumstances, be my high privilege to address the Annual Meeting at some length. On this occasion I have the distinguished honor to speak by permission of your Excellency.\n\nFELLOWS OF THE ROYAL SOCIETY.—At the closing meeting of last year I was impelled by a sense of duty to address you on the subject of the choice of President. Sensible of my own deficiencies in many respects in regard to those qualifications which the President of this Society should possess, I desired to relieve my fellow-members from any embarrassment which might arise from observance of the rule followed on previous occasions. I do not feel myself called upon to repeat the opinions I then expressed and which I still hold. They are recorded in my letter of May 21st, 1888, which appears in the last volume of the Proceedings. The views I submitted were overruled, and it consequently became my duty to bow to your decision. I can, therefore, only renew my sincere thanks to my fellow-members who saw fit to place me in this exalted position.\n\nIn addressing the Society on the opening of the eighth session, a primary duty exacts my attention. We cannot refer to the original list of eighty members, nor can we examine, even in a cursory manner, our published proceedings, without observing how many of our body, by their labors and the distinctions they have gained, have justified their appointment as Fellows by the founder of the association on its establishment. I feel warranted in saying that we all feel gratified by the knowledge, that not a few of our Fellows have distinguished themselves in their several walks of life, and that the services of a number have gained public recognition. Among the latter I point with unalloyed satisfaction to those who have obtained positions of importance in the Departments of State to those on whom have been conferred honorary academical degrees; to others who have received high ecclesiastical preferment; and to several who have been directly distinguished by the favor of Her Majesty the Queen. I am sure I only express the general feeling, when I say that every member regards these well merited distinctions as honors which reflect upon the whole Society.\n\nWhile reference to the brighter side of the picture can only be a matter of common satisfaction, on the other hand it is my sad duty to allude to those whose deaths have left blanks in our midst.\nAlthough the years are few since the names of the eighty original members of the Society were inscribed on the charter roll, no less than seven of our Fellows have been removed from our ranks. The last name to be added to the list is that of Dr. George Paxton Young, late Professor of Metaphysics and Moral Philosophy in Toronto University, who has died since our last meeting. Dr. Young was a man eminent for his varied attainments, a mathematician of no common order, distinguished by profound scholarship and as a sincere and earnest seeker after truth. It falls to my lot to perform the sad duty of recording his loss and to pay my humble tribute of respect to his memory.\n\nIt is only necessary to point to the six volumes of published Proceedings in order to prove that since the formation of the Society its members have not been unmindful of their obligations, and that in no way have they failed to attain a fair measure of success. The volumes distributed among the principal learned societies, libraries and educational institutions throughout the civilized world have been accepted as evidence of the intellectual advancement of the Dominion, and it is satisfactory to obtain testimony from many quarters that the good fame of Canada has thus been widely extended.\n\nMy distinguished predecessors in the office I have the honor to hold have referred in some detail to the objects of the Royal Society and the position it is destined to occupy in the Dominion. They have reviewed lucidly and at length the intellectual activity which has characterized the investigations of literary and scientific men throughout the world in recent years, and they have dwelt upon the researches of our own members as they have been submitted at our Annual Meetings.\n\nIt would in no way be profitable if I attempted to pass over the same ground as they have done; I could not hope to glean much of any real value, nor could I expect to add anything of interest to those learned expositions which have been submitted to you. I trust I may count upon your indulgence if I ask you kindly to grant your attention to my humble efforts in another direction.\n\nThere is one subject in connection with our Society which, I consider may with propriety be examined. It is one of wide ramifications, and I may fail to a large extent in the investigation which I purpose to attempt. All enquiry, however, is conducive to truth, especially when honestly made. I trust, therefore, that my examination of the question, however imperfect, will not be out of accord with the spirit that should animate us. If I should be so fortunate as to succeed in awakening the attention of my fellow-members to the subject, particularly those of the Historical Sections, I shall be greatly gratified; of this much I feel confident, that the topic I propose to bring before you, cannot be wholly barren of interest to us as Canadians.\n\nIn opening the volumes of our Proceedings, the reader in any part of the world must be struck with one peculiarity manifest in their pages: I refer to the use of two languages.\n\nThe division of the Society into French and English Sections cannot but arrest attention, so that the query naturally arises, Who, ethnologically, are the French and who the English? Whence arose these peoples thus represented? How came they to assume a position so distinctively traceable not only in this Society but in this country?\n\nI hope that I shall not be considered a trespasser in entering into this field of research, and in attempting an enquiry which does not appertain to the Section with which I am directly connected. I have to ask the forbearance of those to whom the historical facts I may allude to are familiar, although perhaps not so well known to the ordinary reader. Equally I solicit the consideration of members of Sections I and II, if I attach, what may seem to them, undue importance to certain records and traditions of history which have attracted my notice; and I ask each of my fellow-members kindly to overlook any imperfections apparent in my argument.\n\nWe cannot fail to be aware that at no remote period in the world's annals the names of France and England had no place on the map of Europe. It is not necessary to revert to the geological period, when Europe and the British Islands were geographically connected to form one land. There was a time long after the first written memorials of history when the peoples whom we call French and English were unknown among the races of mankind. Writers agree that at one time Gaul and Britain were inhabited by tribes of a common origin. On excellent authority it is held that \"in the exten-\nSociety were\n\nin our ranks.\n\nessor of Meta-\n\nDr. Young\n\ndistinguished\n\not to perform\n\ny.\n\nto prove that\n\nions, and that\n\namong the\n\nworld have\n\nsatisfactory to\n\nextended.\n\nto some detail\n\nunion. They\n\nthe investiga-\n\ndwelt upon\n\nas they have\n\nanything of\n\nthey count upon\n\ndirection.\n\npropriety be\n\nigation which\n\nhonestly made,\n\nout of accord\n\nawakening the\n\nctions, I shall\n\nyou, cannot\n\nmust be struck\n\nvation, so that\n\nVence arose\n\ntraceable not\n\nsearch, and in\n\nly connected.\n\nare familiar,\n\nconsideration of\n\ncertain\n\nof my fellow-\n\nties of France\n\nlogical period,\n\nThere was\n\nFrench and\n\nBritain\n\nin the exten-\nless Latinized. As the Roman power passed away, Gaul and Britain were exposed to new disturbing forces. Inroads were made in both countries by barbarous or semi-barbarous Teutonic tribes known by the various names of Frank, Frisian, Lombard, Saxon, Burgundian, Fleming, Jute, Saxon and Angle. Their character, religion and form of worship differed little; although on occasions they acted in concert, for the most part they engaged in independent expeditions. After unnumbered wars and struggles for the mastery, extending over years of suffering to the people they attacked, these foreign invaders obtained possession of the soil. In Britain the Celt in some districts was displaced and apparently exterminated by the intruding tribes; but a conquered race does not wholly become extinct. Its warriors may be killed in battle, every man may be dispersed or enslaved or destroyed, but the subject women and children are largely spared, to enter in course of time into new relations with the conquerors. Thus, a Celtic element must have remained, even if its name and language in certain districts disappeared.\n\nThe invasions of some of the tribes eventually assumed the character of emigrations and colonizations, notably those of the Saxons and the Angles; the latter gave their name to Southern Britain and the language which they used, in common with other Teutonic tribes, prevailed in the invaded territory. The Franks, on the other hand, gave their name to part of Gaul to be extended eventually from the Atlantic to the Mediterranean; but yielding to the irresistible influence of overwhelming numbers, who generally possessed the Christian religion and a higher civilization than their conquerors, the Franks gradually assumed the language of the Latinized Gaul.\n\nIn thus bringing before our view the national cradles, whence in the succeeding centuries, France and England have sprung, we fail to perceive an independent ethnological origin on the one part or the other. The people of both countries, originally of a common stock, have been moulded in an important manner by additional elements of great force. They were under Roman influence until the fifth century; Teutonic races became dominant until the ninth century, at which period bands of Scandinavian adventurers from the Baltic began to make descents on the coasts accessible to them. The seakings and vikings of the North, who regarded piracy and plunder as the most honorable of all careers, commenced a series of exploits which were continued for many generations. In France these adventurers received the name of Normans. In English history they are described as Danes. Alike in England and in France these Scandinavian tribes firmly established themselves in the most attractive parts of the territory invaded. As the victorious Franks at an earlier date, so in France the new conquerors gradually adopted the language and manners of the people they had overpowered.\n\nIn explanation of the comparative rapidity with which the conquerors became assimilated and absorbed in the general population, we have to remember that the invaders consisted only of men, and that the work of conquest being completed they entered into the ordinary pursuits of life; in establishing themselves in the territory they formed ties and relationships with the native women. They had power in their hands to enforce compliance, and according to the customs of those days, possession followed choice, when some rite of marriage in accordance with the manners of the northern tribes was performed. That willingness or unwillingness on the part of the native womanhood was not in the character of the times, we find an illustration in the conqueror Rollo. At the siege of Bayeux in 890, he captured and carried away a French damsel whom he married according to the Danish usage. The union proved a happy one. The wife of the Dane Rollo became the mother of William Longsword, who in his turn followed the example which his father had set him. Richard the Fearless, was the son of William, and as descent is not exclusively through the sire, in two generations the offspring of the Scandinavian became three-quarters French in blood. That this characteristic feature prevailed is obvious from results which show conclusively the new relationships which sprung up in a comparatively few years. Whatever course was followed, the fact is recorded by historians that in the time of Richard, grandson of Rollo, Normandy had become as thoroughly French as any part of France. To account for the fact that the Danish language should soon be lost, we have only to consider that the conquerors were compelled to adopt the language of the country they had conquered, and that the native tongue was preserved only by the women. It is evident that the conquerors would not have been able to maintain their language and customs unless they had been able to maintain their women.\nonly to consider that as children are brought up by their mothers, and for the first years of their life are continually with them, it is not surprising that they should come to speak only their mother tongue. If the descendants of the Northmen in Normandy became so typically changed in two generations, it is obvious that the same intermingling of genealogy, continued through succeeding generations, would result in the French element in all respects becoming more and more predominant, until the line of separation between the intruding race and the people of the territory would practically cease to exist.\n\nThe Norman invasion of France commenced in the ninth century; Richard the Fearless reigned in the tenth century; by the middle of the eleventh century the descendants of the Scandinavian adventurers had become Frenchmen. They had adopted the Christian faith, and lived according to the customs and habits of their maternal ancestors; with scarcely an exception, no language was spoken throughout Normandy but Romance or French.\n\nIf, in the middle of the eleventh century, an attempt had been made to define the ethnological difference between the French and English peoples the general answer must have been that in point of origin there was no difference. Varieties there were in the component parts of each; even at the present day we meet such varieties equally in France and the British Islands. South of the Channel we find the Celts, the Franks, the Latins and the Germans compounded in an infinite number of different proportions; in the British Islands we have differences between the Highlanders and Lowlanders, between the Irishmen and Englishmen, between the Welshmen and Yorkshiremen, between the men of Cornwall and the men of Kent; but taking the people of France as a whole and the people of the United Kingdom as a whole, at the period of which we speak, it would not be possible to say that in point of ancestry there were any striking distinctions between them. There undoubtedly was less ethnological difference between the two communities separated by the Channel, taking them as units, than between many of the minor divisions in either country. In the middle of the eleventh century no one of the two peoples could be named as a pure race; both were of mixed blood; they were compounded substantially of the same original elements. There were minor differences in the admixture, in the combination and fusion of the elements; possibly there were modifications arising from climate and geographical position; but the two peoples had originated in the same primitive race; they had been subjected to like influences and exposed to the same vicissitudes, differing only in degree.\n\nIn the Celtic race, which formed the basis in both cases, had been infused Roman, Teutonic and Scandinavian stocks. The intruding races, on their arrival in the new countries, we can well imagine, were in the flower of manhood, bold and determined in spirit, the most daring of the tribes whence they sprang. We are warranted in the belief that among them there were those who would take preëminent position in the adventurous type of man. From such as these a healthy vigorous progeny would proceed. The Romans would introduce their civilization, their culture and their powers of organization, to elevate and refine the communities which they subdued. It was the pride of the Roman conquerors to treat their subject States with consideration so long as the central power on the banks of the Tiber was duly recognized. The Northern tribes which subsequently overran the more cultivated provinces of Gaul and Britain, were unlettered, savage barbarians, worshippers of Thor and Woden, who looked on the slaughter of an enemy as a righteous sacrifice to their gods. Under their savage exterior and ruthless natures there were, however, the germs of generous impulses and noble endowments. They had vigor, valor and resolution, and many of the ruder virtues; they required only contact and intercourse with a more cultivated race to be developed into a higher and more estimable condition. In course of years the best qualities of the conquering races becoming gradually absorbed in the populations of Gaul and Britain, could not fail to exercise powerful influences on the character of both nations. To these early influences we may attribute many of the prominent characteristics of the French and English as they are seen at the present day.\n\nAt the period referred to, the language of the two peoples had diverged into different directions.\nIn France the dialect which came into use was the legacy of one set of conquerors; in England other influences led to different results, and the idiom of another set of conquerors prevailed. This difference in language has been continued to the present day; and if other evidence were wanting, it might be argued that the French and English peoples had sprung from entirely different primitive stocks.\n\nLanguage, however, is but an indifferent test of race. There are ample proofs throughout the world that people nearly related may speak widely different dialects; while other communities, between whom there is no affinity of race, may converse in the same idiom. Amongst ourselves, instances are not unknown where an intruding stock, in the midst of a people greatly exceeding it in number, has in two or three generations yielded to the influence surrounding it, and lost the language of their ancestry.\n\nThus it is established by the records of history, that in the eleventh century the peoples of France and the British Islands had an ancestral kinship which was close and real. Before that century came to an end further relationships were created to make the connection still more intimate. The great territorial conquest of William dates from 1066, and it has proved the most important epoch in English history. It is described by English historians as the Norman invasion. It appears to me that with greater propriety and accuracy it might be called the French invasion; not because William himself was the son of a daughter of the soil; not because he was by blood at least five-sixths French, and by education and habit wholly French; not because every one of his ancestors, male and female, for a century and three quarters was, with one exception, native born; not because Normandy, so far back as the time of Richard the Fearless, great-grandfather of William, had even then become thoroughly French; but because the 60,000 followers of the Conqueror who crossed the channel with him, were gathered together from a great part of the whole realm of what is known as modern France.\n\nTo insure success, William offered good pay and a share in the spoils to all who should accompany him. Numerous trains of adventurous spirits poured in to join his standard. They came all ready for the conflict, not simply from Normandy but from Armorica, now called Brittany, on the west; from Flanders on the east, and from Maine, Anjou, Poitou, and the whole country to Aquitaine on the south. To all, such promises were made as should incite them to the enterprise, and thus he gathered the men of all classes from all districts to form his army.\n\nWilliam was faithful to his word; the subjugation of England was complete and the poorest soldier had his reward. The dominion passed into the hands of the invaders; and they were followed by a crowd of adventurers who became identified with the conquerors and shared in the spoils.\n\nIn the years which followed the invasion the original landowners were stripped of their estates. Universal spoliation was the means employed to reward the officers and men who had enlisted under William's standard. The barons and knights who followed his banner had the extensive domains of the dispossessed English allotted to them, while those of lower rank received humbler recompense. Some took their pay in money; others who had stipulated for Saxon wives received the booty they had bargained for. According to the Norman chronicle, William caused them to take in marriage noble ladies, the heiresses of great possessions, whose husbands had been slain in battle. Thus it was that barons of the one country became barons in the other; thus it was that men of no condition in France, whom love of adventure had induced to join William and share his fortunes, became men of rank and station; thus it was that in some cases names hitherto obscure became noble and illustrious in the country they helped to subdue.\n\nThe spoliation was not confined to landed property, for everything worth owning passed into the hands of Frenchmen. The hierarchy soon ceased to be English. French judges administered the law. Every important office in the State was filled by Frenchmen, who thus obtained all the wealth, power and influence in the kingdom. William himself was essentially French, he spoke his mother tongue; he did not and could not speak English; \"he had not even a reminiscence of the language of his northern ancestors, the Danes, then nearly allied to English.\" French became the language of\n\"the court and tribunal, the baronial castle and the merchant's counting house.\" French became the official language of England and so remained until a date nearly three centuries after the arrival of the conquerors. The seven kings who succeeded William on the English throne were French; the greater number of them were born and brought up in France. The effect of every political change during these reigns was to bring to England a fresh number of Frenchmen, and any lands falling to the King's disposal were almost invariably granted to his foreign favorites.\n\nIn the years following the arrival of William it may well be imagined that the fiercest antagonism existed between the conquerors and the conquered—antagonism so intense that no one then living could predict the outcome. In this age we are privileged to take a calm panoramic view of the state of affairs then existing and the results which have followed. It would indeed be difficult to find in universal history a subjugation so complete, a hostility so intense, becoming the ultimate means of so much national prosperity.\n\nIn a remarkable lecture delivered last year by Sir William Groves at the Royal Institution, London, he submitted the proposition that antagonism is not the baneful thing which many consider it; that it is often the precursor of good: \"that it is a necessity of existence and of the organism of the universe as far as we understand it; that motion and life cannot go on without it; that it is not a mere casual adjunct of nature, but that without it there would be no nature, at all events as we conceive it; and that it is inevitably associated with matter and sentient beings.\" The lecturer showed that, though itself an evil, antagonism is a necessary evil. I shall not venture to allude to the evidences of antagonism furnished by him in the physical world, in vegetable life, in the external life of animals and in human society. He pointed out that \"in what is euphemistically called a life of peace, buyer and seller, master and servant, landlord and tenant, debtor and creditor, are all in a state of simmering antagonism;\" that in tranquil commerce and in the schools we have the antagonism of competition; that in nearly all our games and amusements we have antagonism; that in daily life we have class antagonism, religious antagonism, political antagonism and individual antagonism, and that there is more or less antagonism in every condition of society. Sir William Groves did not attempt to explain the cause of this universal antagonism. He only gave evidence of the fact that it is not limited to time or space, and stated his belief that some day it will be considered as much a law as the law of gravitation.\n\nIf antagonism come to be considered a law, it will be necessary, I think, to recognize another principle with tendencies the very opposite. The two principles may be likened to the resultant of two forces; in one case the forces act in contrary directions; in the other case the forces operate in the same direction. As action is followed by reaction, so also it is possible that as the two forces revolve with time, antagonism may be followed by the opposite principle. When this takes place it is evident that, the stronger the forces in antagonism, the greater will be the resultant when these forces come to act as cooperative forces.\n\nA change of this character is exemplified in the history of England. The reversal of the forces was not sudden, it took two or three centuries completely to effect the change. For a number of generations after the French invasion, the line between the descendants of the conquerors and the conquered was sharply drawn. There was the contrast of manners and of thought; there was the primary difference of language; French, being the token of power and wealth and influence, established a defined line of separation between the two peoples. By degrees the feeling of hatred and dislike toned down, antagonism and antipathy yielded to other influences. In 1382, in the reign of Edward III, a statute was passed ordaining that thereafter all pleas in the courts should be pleaded in the English language. The first bill of the House of Commons written in the English language bears date 1485, but long before this the English language began to gain ground. The French and English had commenced to intermingle and intermarry, friendships and near relationships were developed, and, as a consequence, by the fourteenth century a new race had sprung up partaking by descent the qualities of its French and English ancestors.\nThe admixture of race has often proved advantageous in creating the tendency to develop the growth of new qualities. It has been known to bring out a type of character superior to either parent race, to produce a composite race to dominate over both the parent stems. This result may not be attained in all cases, but it cannot be denied that the blending together of the French and English stocks strengthened the intellect of the new nationality, greatly increased its power, and gave an impulse to its prosperity and glory. As the name of \"Englishman\" takes in all natives of the country, of whatever descent, the descendants of the French invaders became Englishmen, indeed the truest of Englishmen. Paradoxical as it may appear, it is mainly owing to French influences incident to the Conquest that the English nation has been moulded to the national character it possesses. It is owing to the introduction of the French element that Englishmen have become what we now find them. The invaders took firm root in England; they engrained upon the nation the best qualities of their own natures. Many of the men who from various parts of France accompanied William, became the founders of great English families. For eight centuries their descendants have held a dominant place in the national councils; they have assumed high command on land and sea, and they have been prominent in the roll of statesmen who have controlled the destinies of the kingdom.\n\nWilliam himself left a lasting impress on the monarchy; the dynasty which he established has continued through to our own time, although not in the direct lineage from father to son. Since the death of William in 1087, the blood of the French conqueror has flowed in the veins of every monarch of England. In the words of Palgrave, \"Magnificent was William's destiny—can we avoid accepting him as the founder of the predominant Empire now existing in the civilized world? Nay, the stripes and stars of the Trans-Atlantic Republic would never have been hoisted, nor the Ganges flow as a British stream, but for the Norman-gauntleted hand.\"\n\nThe French conquest is without a parallel in history. It is the most momentous event which our annals record. It humbled the nation to the last degree, and with other great changes it effected a vast territorial and social revolution. While all this was being accomplished with much pain and suffering for the time being, it must now be recognized that the landing of the French and the settlement of the kingdom by the French, and the ultimate fusion of the conquerors with the conquered, was conducive of the greatest possible good. The French element thus thrown into England under the circumstances in which it was introduced might be expected to produce great and lasting effects. The ethnological result has been to commingle the blood of the two communities, already possessing the affinity of ancestry, and to produce a new national type. By whatever name it may be known, it is a French-English type. The political effect has been to weld together the component parts forming the British nation in so compact a character as to withstand every shock to which it has since been exposed. If after the lapse of eight hundred years we dispassionately view the effects of the historical event, it is impossible to escape the conviction that the direct influences springing from the Conquest have been of lasting advantage to the world.\n\nThe general result of the enquiry into which I have been led may be briefly summarized. We may trace back the relations of the two peoples as they are represented in this Society to a period long anterior to the date when they were first known as French and English. We learn that they sprang originally from a great primitive race which, before the Christian era, spread over western Europe and flourished under a half-developed civilization. In both cases the original stock had been modified by foreign influences similar in character, until the eleventh century, when a powerful French element became intermixed with the English people and penetrated the highest and lowest grades of society. At that period the portion of Europe which is named France contributed the ruling class and the men to form the British aristocracy. To this day the prominent families of England, with few exceptions, trace to France the foundations of their names. From French sources have come those who have helped so much to make Great Britain strong and indissoluble.\n\nThus it was that the descendants of ancient Gaul, modified by the Romans, the Franks and the Danes, have been absorbed and assimilated in the great mass of the English people. The blood of the French, American, and hemispheric races flows in the veins of the great English nation.\nFrench intermingled with the blood of the English has since been carried in the veins of colonists to America, to Australia, and to every British colony, and by British sailors to every port in the two hemispheres; and thus, through the intermixture of the races an Empire has been raised up to girdle the globe.\n\nThese imperfect remarks will, I trust, be found to furnish an answer to the query, Who are the French, and who are the English? The records of history establish that they are not alien in blood, that they have often met in conflict, and that they have frequently cooperated in amity. The character of the relationship which sprung up eight centuries back connected England and France by domestic ties, and the same lineages spread over both lands. The histories of the two nations have been more or less interwoven ever since the French and English people had an existence, and for part of the time the two peoples have had one and the same history.\n\nMy remarks go to show that those whom I have the honor to address, with the people in the Dominion whom they represent, are equally the descendants of the races who laid the foundation of western Europe. Every individual man is more or less moulded by forces which date from a remote past. The subtle influences of ancestry and the conditions due to hereditary transmission affect us all. If the individual be the resultant of remote and occult forces, so also to a great extent is the family and the nation.\n\nThe population of Canada presents the spectacle of two peoples possessing early kinships and affinity of ancestry, subsequently separated for centuries, again forming a reunion in political and social life. A century and a quarter ago, a French population numbering some 60,000 souls, came under the British flag. It is a somewhat singular coincidence that seven centuries earlier the same number of Frenchmen crossed the Channel, eventually to become Englishmen, and to give to the British nation the strength and influence and distinctive characteristics we now find it possessing.\n\nIt is said that history repeats itself; are we warranted in assuming that it will do so in this instance? If the fusion of the French and English after William's conquest was productive of the results I have specified; if the difference of language five to eight centuries back failed to impede the vastly important consequences now traceable; if the absence of complete homogeneity was in no way a hindrance, but on the contrary, proved a solid and substantial advantage by the diversity of talent and strength which it brought; if like causes produce like effects—are we not warranted in looking forward to our future with confidence? It is surely a happy augury that we have become a fully-organized political community, inheriting in common all that is to be cherished in French and English history. To my mind there is the best ground for hope that in coming years the successive generations of Canadians will be distinguished by the best qualities they inherit from their compound ancestry, developed under the free institutions which it will be our happiness to bequeath to them.\n\nIt is indeed true that in the past France and England have frequently been in conflict, but those conflicts have been much less frequent and not more fierce than the domestic struggles in either country. Happily a state of open warfare is no longer the normal condition of society, and all must acknowledge that hostility of race is entirely out of place in this age in this Dominion. We have now reached a stage in our country's progress when antagonism in its strongest and worst aspect has passed away. Whatever their origin or creed or color, all who live within the limits of the broad domain of Canada cannot fail to be convinced that they have interests in common. As the inhabitants of England discovered in the reign of King John in the thirteenth century, so the population of the Dominion must perceive, that no interest of real and lasting importance can exist which are not common to all. This feeling fully developed, the complete identification of general sentiment will be the pledge of lasting friendship, the Magna Charta of a united community. It will elevate our aims and promote aspirations worthy of our common ancestry and our common inheritance—an inheritance which throws upon us weighty responsibilities and the duty of employing our best efforts in working out our destiny. If we do well our part, it will be for the historian of the future to chronicle\nthe results, which we anticipate will follow the reunion and comixture of the French and English on the soil of Canada.\n\nPerhaps I have dwelt at too great length on this topic, and I should not venture further to trespass on your kind indulgence. In closing the remarks which I have the honor to make on this occasion, I shall only ask your permission to add a very few words on other matters. Looking at the four Sections into which the Society is divided and the definite objects for which they are organised, it is obvious that the scope of our researches as an association is broad and deep. The remarks I have submitted come within the cognizance of the Historical Sections. There is another Section which embraces subjects relating to past time. While history takes us back to the earliest dates of existing records, the Section which includes the science of geology carries us to periods in the world's annals a thousandfold more remote, and into fields of research immeasurably wider than the chronicles of the human race. Unlike the historian and archaeologist, the student of geology can look to no aid from human records, his researches go beyond all classical literature; he can find no guide in inscriptions, however ancient, which the hand of man has made.\n\nGeology, to some extent, may be described as a new science, it was within the second decade of the century that it became a recognized study, yet with the aid of subsidiary sciences it has already given us part of the story of the earth. The library of the geologist is found in the recesses of the rocks. He deciphers the writings which have therein been inscribed and which for unknown periods have been secured from the process of decay. Necessarily his researches must be patient and laborious, and it is only by the slow accumulation of facts that he is rewarded by bringing to light remains of manifold organisms which in successive epochs have animated the globe countless centuries before man was called into being. The geologist in his investigations approaches nearer to what we call the beginning; he has revealed to him traces of the natural forces which have operated in moulding the earth to its present form. He is privileged to follow the mutations in the structure of the world, which, if the element of time be not taken into account, are wholly inexplicable, and which can only be accounted for by a slow and gradual development, by the continuity of forces exerted over periods, compared with which the duration of human life on the globe as recorded in history can give but the faintest conception.\n\nHowever much this science has advanced, and however greatly our knowledge has increased during the last sixty years, we are made to feel that we are only on the threshold of greater revelations. In the wide territory of the Dominion we have a boundless field for pursuing geological research. The Canadian Geological Survey has done excellent work in many directions, not simply in forming a vast accumulation of scientific facts, but in performing the great service of establishing the immense value of some of our hidden mineral treasures.\n\nIn the remaining Sections of the Society the subjects for consideration are not specially related to the past; the sphere of their investigations have to some extent a bearing in the opposite direction. I refer to the Section devoted to mathematics and physical and chemical sciences. The aims and hopes of this division of the Society rather lie in the future; not that we should forget our obligations to those who have toiled in past years and to whose researches in science we mainly owe much which is a striking feature in the daily life of modern civilization.\n\nThese sciences cannot be spoken of as modern. We have but to mention the names of Pythagoras, Aristotle, Archimedes, Ptolemy and others, to testify to the efforts of two thousand years back. The seventeenth and eighteenth centuries were made illustrious by men whose names will always be honorably associated with science. Without depreciating, however, the labors of the precursors of what we all recognize as modern times, it may be said that it is the nineteenth century which has witnessed the greatest triumphs in science. Indeed it is within little more than the last half-century that there has taken place a remarkable revolution in human affairs through the growth and influence of the physical sciences and the application of science to the daily life and the multifarious operations of man.\nNo one for a moment can suppose that science has exhausted every field of enquiry. Judging from the intellectual activity which everywhere prevails, the thought forces itself upon us that much will be discovered to astonish and bewilder the human family even in the comparatively short period of another fifty years. Who can foretell what our children may witness and experience in the middle of the twentieth century? Some of us may yet live to see the extent of the influences exerted by science in directions not hitherto dreamed of, and in fields which to many minds appear to set scientific investigation at defiance. Even in the complex domain of politics the wise and practical statesman may benefit his country by the application of scientific principles and methods to the solution of difficult problems.\n\nSix years ago one of the most eminent of our colleagues, the late Dr. Todd, addressed the members at length on the relations of this Society to the State. He dwelt upon the benefits which may be anticipated from the establishment in the Dominion of a body constituted as we are. By way of illustration he referred to the public services rendered during the last two hundred years by the Royal Society of England; services repeatedly acknowledged by the Imperial Government and confirmed by parliamentary votes of money. For many years annual sums have been granted to defray the cost of scientific investigations recommended by that Society as worthy of assistance.\n\nThe Home Government has found that it is of undoubted public advantage to have recourse to the aid and advice of the Royal Society of Great Britain. Our own Government, too, has given evidence of a wise liberality, which we cordially acknowledge. I am confident that I express the feelings of every member of our body, when I say that it will be the constant aim of the Royal Society of Canada to continue to command the respect and confidence of the people and Parliament of the Dominion.\nIV.—\n\nThe discovery of America across the Atlantic was an expedition which had been proposed by Columbus in order to obtain a direct route to Asia; and (2) the discovery of America by the Portuguese.\n\nSo Columbus, when he found himself unexpectedly far from home, turned his thoughts to the new continent which he saw. He was convinced that there he had found the shortest route to the spice islands.\n\nPortugal, however, refused to help him because he wished to go to Asia; and so he turned his thoughts directly toward America.\n\nThis discovery opened up a perilous route for the Spanish and permitted them to establish and maintain their supremacy in the New World. It also led to the discovery of the great Mississippi River.\n\nIt was not until 1497 that Europeans again attempted to reach Cabot's land. This time they discovered Newfoundland.\nIV.—Expeditions to the Pacific. With a brief reference to the Voyages of Discovery in seas contiguous to Canada, in connection with a Western Passage from Europe to Asia. By Sandford Fleming.\n\n(Read May 8, 1889.)\n\nIntroductory.\n\nThe establishment of railway communication from the Atlantic to the Pacific across the territory of Canada, suggests an enquiry into the several maritime and overland expeditions, undertaken from time to time, between the two oceans. It is accordingly proposed briefly to review (1) the maritime expeditions undertaken with the desire of obtaining a western passage from Europe to Asia, in seas coextensive with the Dominion, and (2) the several overland expeditions from the eastern parts of Canada to the shores of the Pacific, from the earliest date.\n\nSix centuries have elapsed, since the most illustrious traveller of the Middle Ages found his way from Europe across the whole extent of Asia, to the limits of the then known habitable world. After an absence of twenty years, Marco Polo returned to his home on the shores of the Adriatic, to bewilder the Venetians with wondrous accounts of the magnificence of Cathay, the splendours of Zipangu, and the vastness of the Orient. He was the first European who looked upon the hitherto unknown Pacific Ocean, which he had reached after tedious journeys through many strange lands, and after traversing the spacious empire of Kublai the Great Khan.\n\nPolo and his companions were the pioneers of commercial intercourse between Europe and Cathay. Other European travellers followed the Venetian noble, who with him bore testimony to the extent, power and wealth of the marvellous old civilizations of Asia; and as a consequence, the enterprise and commerce of the Middle Ages became directed towards the East.\n\nThe populous and wealthy kingdoms of Asia could only be approached by long and perilous overland journeys, through countries inhabited by warlike races, given to hostility and plunder. The route lay by Turcomania, Armenia, Persia, Upper India, Cashmere and across the mountains and deserts of Tibet. Notwithstanding the immense distance to be passed over by caravans, and the dangers and difficulties of the journey, European traders flocked to the remote East. So far as it was possible under the conditions which existed in the fourteenth and fifteenth centuries, commerce flourished over an extended overland route stretching from Genoa, Florence and Venice, to the great marts of eastern Asia.\n\nIt was the possibility of facilitating and increasing the interchange of trade between Europe and Asia which powerfully attracted the imagination of men like Columbus and Cabot. It is not therefore surprising, that an ardent desire was awakened for the discovery of a new and safer route to the East, than the one then followed.\n\nSec. II, 1889. 12.\nI.—MARITIME EXPEDITIONS.\n\n(1) Early Voyages of Discovery in the North Atlantic.\n\nColumbus had formed the belief that the earth had less dimension than it really possesses, and that the continent of Asia extended farther to the eastward. This opinion was the ground of his being confident of reaching Cathay by a western voyage. So firmly was this belief held, that when Columbus set sail in 1492, he was the bearer of a letter from the Spanish court to the Great Khan of the mighty oriental empire.\n\nMore than one European nation was stimulated to activity by the prospects of profitable trade with Asia. As Cathay was the aim of Columbus, so likewise it became the goal of Cabot, who induced Henry VII of England to enter the field of maritime enterprise. The expedition fitted out under the command of Cabot obtained for him the fame of preceding Columbus in the first actual discovery of the new continent. John Cabot sighted the coast of Labrador June 24th, 1497, thirteen months before Columbus beheld any part of the mainland. It was not until August 1st, 1498, on his third voyage, that Columbus for the first time looked upon the shores he had long sought.¹\n\nColumbus discovered the Bahamas in 1492, and the other West Indian Islands in subsequent years, believing them to be outlying islands of Asia. The Archipelago received the name it still bears under the belief that it was within the limits of the Indian Ocean. The great captain did not live to know that another continent, and another ocean, the broadest expanse of water on the surface of the globe, intervened between the West Indies and the shores visited by Marco Polo two centuries earlier. To the day of his death, Columbus was firm in the conviction that the islands and lands, he had discovered, were in proximity to the domain of the Great Khan.\n\nThe two Cabots, John and Sebastian, equally with Columbus, were imbued with the idea, that the shores of Asia were washed by the waters of the Atlantic and they each displayed great activity in pursuing the object of their search. They were each distinguished by lofty enthusiasm, extraordinary courage, and indomitable perseverance, in the work of discovery which they had undertaken.\n\nWhile it cannot be doubted that Columbus was the first who conceived the idea of a western route to the East, it is certain that he was not the first who discovered the new continent. Christopher Columbus, the Genoese, kindled the flame of western maritime adventure, and the result of his first voyage filled Europe with wonder and admiration; it was, however, John Cabot the Venetian and Sebastian, his English-born son, who discovered America. The record shows that the great Columbus never beheld any portion of the North American continent, and that he did not come within sight of South America, until the year in which Sebastian Cabot had made a voyage of discovery along the whole coast between Virginia and the entrance to Hudson Strait. In that year, 1498, Sebastian Cabot, with a fleet of five ships under the English flag, bent upon the effort to find an open sea latitude coast.\n\n¹ Columbus landed on an island named by the Indians Guanahani, October 12, 1492, believed to be San Salvador, one of the Bahamas. The first view he had of the mainland was at the mouth of the Orinoco in South America on August 1, 1498. He died May 20, 1506.\nopen seaway to Asia, followed the land as high as latitude $67^\\circ 30'$, and as far south as latitude $38^\\circ$; thus he discovered during this voyage 1,800 miles of the North American coast.\n\n(2) Attempts in the Sixteenth Century to find a Passage from Europe to Asia.\n\nIn 1500, Portugal, then the greatest maritime nation, sent out Gaspar Cortereal with two ships. The expedition left Lisbon with the view of following up the discoveries of Cabot; it reached Labrador, coasted its shores some six hundred miles, and returned. In 1501 sailed proceeded on a second voyage of discovery; after entering a strait, probably Hudson Strait, the ships were separated by a tempest and that of the commander was lost with all on board.\n\nIn 1508, Thomas Aubert left Dieppe for the American coast to make similar explorations, and it is recorded that he entered the Gulf of St. Lawrence and ascended the river some eighty leagues.\n\nIn 1517, a small squadron was sent out from England by Henry VIII, in command of Sir Thomas Pert and Sebastian Cabot; the object was to continue the former discoveries made by Cabot in the north-west. The ships appear to have entered Hudson Strait, but owing in part to the mutiny of the crew, the expedition proved a failure.\n\nIn 1524, Francis I of France entered the field of discovery; he sent out four ships under the command of Giovanni Verrazzano who coasted from latitude $34^\\circ$ to $50^\\circ$, embracing nearly the whole Atlantic coast of the United States and part of Canada. Spain likewise in this year made an attempt to find a shorter passage by the north-west, to the islands of the Indian Ocean. An expedition was sent out under commander Gomez. He failed in making any important discoveries and returned to Spain after an absence of ten months.\n\nIn 1527, Henry VIII sent out another expedition consisting of two ships, under command of John Rut. In his efforts to proceed westward off the Labrador coast, his ships were beset with ice and one of them foundered in a storm.\n\nIn 1534, France again entered the field. An expedition of two ships was fitted out at St. Malo, and Jacques Cartier was placed in charge. He entered the Strait of Belle Isle, reached a large gulf which he named the St. Lawrence, explored its coasts, discovered Prince Edward Island, Mirimachi Bay, Bay Chaleurs and Anticosti. The following year, Cartier's commission was renewed by the French king, and he set out from France with three ships, again with the view of finding an open passage to Asia. He ascended the St. Lawrence as far as the Indian settlement of Hochelaga, now Montreal. After spending the winter at Stadacona, now Quebec, he returned in the spring of 1536 to St. Malo. Jacques Cartier made a third voyage five years later with five ships. He wintered above Quebec, and returned finally to France in the spring of 1542. Roberval, having been commissioned by the French monarch to command the enterprise, met Cartier on his homeward voyage on the coast of Newfoundland. Roberval did no more than confirm the discoveries of Cartier and then followed him to France.\n\nIn 1536, another expedition consisting of two ships left England. It was promoted by many gentlemen of London, the chief of whom was, named Hore, who was skilled in\ncosmography. Great privation was experienced, and but for the timely appearance and assistance of a French vessel the whole crew would have perished miserably.\n\nIn 1553, an expedition of which the then aged Sebastian Cabot was the chief promoter, sailed under Sir Hugh Willoughby and Richard Chancellor, to end in disaster. The three ships followed an easterly course, and overtaken by winter Willoughby and all his men perished by famine and cold. Three years later another vessel was sent out in a north-easterly direction under the command of Stephen Burroughs. In midsummer, the ship was beset on all sides by masses of ice, and was in danger of being annihilated, so that all efforts to proceed were unavailing.\n\n(3) Efforts in the Sixteenth Century to discover a North-west Passage.\n\nVasco da Gama doubled the Cape of Good Hope, in the year 1498, and established the possibility of reaching Asia by sea; but the navigators of European nations remained in their belief of a western passage to what was then designated the \"East.\" Having this discovery in view, examinations were made on behalf of Portugal, Spain, France, Holland and England, in every parallel of latitude between Darien and the extreme north.\n\nCathay continued to be the object of many adventurous voyages. The discoveries of Columbus and his Spanish followers, the expeditions of Cabot, Cartier and others, having established the existence of a large continent extending north, on the eastern coast, as high as latitude 67° 30', it was plain that the much desired navigable route to Asia must be sought northward of this limit. It is at this stage in the history of maritime discovery that there began a series of expeditions, having generally in view the discovery of a \"North-west Passage,\" which were continued with but short intermission over a period of more than three centuries. Great enthusiasm long continued to be felt for the establishment of trade directly with the marts of India and China; and voyages were undertaken by the most celebrated mariners of the age mainly with this end in view.\n\nInfluenced by national considerations, Martin Frobisher one of England's heroes, who afterwards took part in the defeat of the Invincible Armada, embarked in a series of expeditions. In 1576, he set sail with three ships, and in 1577 and 1578, other expeditions followed under the same commander. In 1578, he sailed with fifteen vessels. Frobisher was followed by John Davis, who made three successive voyages in the same direction in the years 1585, 1586 and 1587. Davis Strait received the name of this commander.\n\n(4) Attempts to find a North-west Passage in the Seventeenth Century.\n\nIn 1602, the enterprise was renewed by some patriotic merchants of London and by the Muscovy Company; two ships were fitted out under the command of George Waymouth, who made for Greenland; after reaching a high latitude they encountered such obstructions from ice and dense fogs, that the crew apprehensive of safety mutinied. The ships returned without adding to previous discoveries. In 1605, the King of Denmark caused three vessels to be despatched under command of John Cunningham. They coasted Greenland and reached latitude 66° 30'; but the seamen refused to proceed further. A smaller expedition went out the following year in command of John Knight, with no better result.\nThe great navigator Henry Hudson was engaged by the Muscovy Company. This commander made voyages in 1607, 1608 and 1609. In the latter year, when exploring the coast of North America for the Dutch East India Company, he ascended the river Hudson. In 1610 he discovered the great inland sea which bears his name; it may well be imagined that on entering on its vast expanse, he felt satisfied that the Pacific Ocean lay before him, and that the problem of a western passage, which had baffled so many, had at length been solved. The illustrious captain never left Hudson Bay. After wintering there he perished miserably on July 22nd, 1611, at the hands of his mutinous crew.\n\nIn 1612, the Merchant Adventurers of London sent out Sir Thomas Battou in command of two ships, to follow up the discoveries of Hudson; during the following year he continued the examination of the new-found inland sea.\n\nIn 1614, Captain Gibbon was despatched on a similar expedition of discovery, but with unimportant results. In 1615 and 1616, Robert Bytow and William Baffin continued the explorations, examining the coasts of Hudson Strait and of the great channel which has since been known as Baffin Bay.\n\nIn 1619, Denmark again entered the field of discovery. In that year Christian IV sent out two well equipped ships commanded by Jens Munk. Munk traversed Davis Strait, but failing to find the desired opening to the west, he struck southward to Hudson Strait and Hudson Bay. He wintered at Chesterfield Inlet, the crew enduring great suffering, so that, when summer returned, out of sixty-five souls, only three survived to make a perilous voyage homeward.\n\nTwo expeditions left England in 1631, under Luke Fox and Captain James; the latter wintered in the ice near Charlton Island, in the southern extremity of James Bay, and returned to England in the October following. Neither of these expeditions discovered a single indication that the desired passage to the west was obtainable.\n\nIn 1670, the Hudson's Bay Company was incorporated and undertook various voyages having in view the discovery of the north-west passage to the Pacific Ocean. The first was undertaken in 1718 by Mr. Knight, governor at Nelson River; the two ships engaged were lost and the crews perished. A search was sent out for the missing ships. The officer in charge, Mr. John Scroggs, upon his return, reported confidently that a passage to the Pacific could be found.\n\n(5) Expeditions of Discovery in the Eighteenth Century.\n\nIn 1742, the British Government having obtained from the officers of the Hudson's Bay Company information which was regarded as furnishing decisive proofs of the existence of a north-west passage, a naval expedition was despatched in command of Captain Middleton. Middleton's two ships wintered in Churchill River. This expedition was followed in 1746 by that of Captain W. Moor, who was sent out to prosecute the same work of discovery.\n\nIn 1769, under instruction from the Hudson's Bay Company, Samuel Hearne was sent out to explore Coppermine River, but without result. In 1770, the exploration was renewed; he conducted the expedition by land, having arrived at the river during the winter. He followed the Coppermine to its mouth, which he reached in July 1771.\n(6) Geographical Discoveries in the Pacific.\n\nIt was not until nearly seven years after the death of Columbus that the Pacific Ocean was seen by Europeans from the newly discovered continent. Vasco Nuñez de Balbao crossed the Isthmus of Darien and was the first to behold the great ocean. This took place upon September 25th, 1513. Six years later, Ferdinand of Magellan emerged from the strait which bears his name, and crossed the ocean to the Philippine Islands. The first Englishman to navigate the Pacific was Sir Francis Drake, who was also the first of his countrymen to circumnavigate the globe. In 1579, Drake, in the hope of finding a shorter way home from the Pacific than by doubling Cape Horn, explored the Pacific coast of North America as far north as latitude 48° N., and it was Drake who gave the name of \"New Albion\" to the western portion of North America, now known as Oregon and Washington Territories. The coast, at a lower latitude, had been visited by Spanish navigators; by Ferrelo in 1543, by Francisco de Gali in 1584, and by Vizcaíno and Aguilar in 1603.\n\nFor more than two centuries after Drake's discoveries, no European navigators have claimed to reach a higher latitude on the Pacific coast, if we except Juan de Fuca, whose voyage by most historians is considered apocryphal.\n\n(5) Fictitious Discoveries of Waterways through the Continent.\n\nThe efforts, above described, to find a navigable passage between Europe and Asia through north-western America, were undertaken from the Atlantic side of the continent. If less activity prevailed on the Pacific side, it cannot be said that any attempt from the western coast was looked upon as inexpedient; indeed at this date a remarkable phase in the history of geography may be noticed. The imagination of navigators, as it were, was allowed to run riot; if the actual explorations were limited, in number and extent, theorizing went on, and several curious fictions were propagated, some of which have been placed on record. Among those which gained currency, one may here be alluded to, as typical of other similar narrations, and for the further reason that the memory of its author has been perpetuated in the strait bearing his name.\n\nA mariner of Greek birth, Juan de Fuca, claimed to have discovered in 1592 a navigable strait connecting the two oceans. He represented that it was to be found on the western coast, in latitude 41° or 48°, and that it had its outlet in the North Sea, through channels not far from Hudson Bay. He described the Pacific inlet of the strait to be thirty or forty leagues wide, increasing in width inland to a much broader expanse of water, through which, after twenty-six days sailing north and north-east he got into the North Sea.\n\nThere was a general idea among navigators that there ought to be such a passage, and consequently the fiction, as it subsequently proved, of Juan de Fuca, with other spurious narratives gained ready credence. The wish evidently assisted the belief, for there remained a firm impression on the minds of cartographers, up to a date later than the middle of the Eighteenth Century, that the continent of North America in its northern part was intersected by channels, inland seas, and water passages in such a manner as would admit of ships passing from one ocean to the other. In illustration of this\ncommon belief, two maps are reproduced, one by the French geographer, De L'Isle, published in 1752, the second by Thomas Jeffrey, geographer to the King of England, published in 1768. For these documents the writer is indebted to the work of Mr. Hubert Howe Bancroft (Vol. XXVII, pp. 128 and 131).¹\n\n¹ In the Parliamentary Library, Ottawa, may be seen a map published in London in 1776 by Thomas Jeffrey, geographer to the King, on which is engraved this note: \"In latitude 55° 'tis pretended that in 1740 Admiral de Fonte entered and sailed by lakes and rivers till he found a ship (as is supposed in Hudson's Bay) from Boston in New England.\"\nIn 1778, the illustrious Captain James Cook received instructions, on his last voyage, to make an examination of the western coast of America in search of the desired passage to Europe; but he found no inlet such as was described by Juan de Fuca. Singularly enough, however, Captain Barclay, after whom Barclay Sound in Vancouver Island is named, discovered, in 1787, a strait about the latitude mentioned by Juan de Fuca, which strait had escaped the observation of Captain Cook. This now well-known inlet then received, and has since borne, the name of the Greek mariner who claimed to have discovered a navigable passage from the Pacific to the Atlantic two hundred years earlier. In 1788, the inlet of Juan de Fuca was explored by Captain Duffin, and again in 1790 by Captain Quimper, who entered the strait and named it Juan de Fuca Strait.\n\nIn 1792, Captain Vancouver made a second attempt to find a northwest passage, and to accomplish this purpose he employed a number of vessels, among which was the Discovery, under the command of Captain George Vancouver. The latter was instructed to explore the entrance of the strait, and to examine the coast as far north as possible. During this expedition, Captain Vancouver visited many places of interest, and made several discoveries. Among these was the discovery of the entrance to the strait, which was named after him.\n\nIn 1793, Captain Vancouver returned to England, having accomplished his mission, and to express his gratitude for the services rendered by Captain Vancouver, the Admiralty presented him with a sword, which he wore throughout his life. It was during this expedition that Captain Vancouver discovered the entrance to the strait, which was named after him.\n\nIt was not until 1846, when Captain Robert Gray visited the strait, that the existence of the strait was confirmed. Captain Gray named the strait after himself, and it has since been known as Gray's Passage.\nQuimper. It need scarcely be added, that beyond the geographical position of the entrance, it has no resemblance to the imaginary passage between the two oceans which Juan de Fuca declared he had discovered.\n\nIn 1728, a Russian expedition under Behring discovered the strait named after the commander, who on this occasion explored part of the North-west coast. In 1741, Behring was again employed, and coasted as far south as Mount St. Elias, which he named. Behring and his crew were rendered helpless by scurvy; he expired in a miserable condition during the winter on an island in the strait, which commemorates his name.\n\nIn 1791, Vancouver was sent out from England in charge of an expedition. The special objects were to ascertain whether the inlet of Juan de Fuca really formed a strait; and to explore the coast from latitude 30° N. as far north as Cook's Inlet, with a view to the discovery of an eastward passage. Those familiar with the peculiar character of the Pacific coast, embraced within the limits of British Columbia and southern Alaska, will understand the necessity of a minute survey; for the passage might have so narrow an entrance as to elude the search made for it. Vancouver examined the coast with great care, surveying all inlets up to latitude 52° and left for England in 1794.\n\nThe thorough examination of the coast by Vancouver, together with the discoveries made by Behring, and the overland travels of Alexander Mackenzie to the mouth of the river Mackenzie in 1789 and across the Rocky Mountain chain, in 1793, together with the expedition of Hearne, twenty years earlier, to the mouth of Coppermine River, swept away all belief in the existence of a navigable passage through the continent. It was now established beyond all doubt, that the continent extends unbroken from the Gulf of Mexico to latitude 69°, the mouth of the great river which bears the name of the celebrated traveller.\n\n(9) Eighteenth Century Attempts to find a passage to Asia across the Polar Sea.\n\nEvery effort to find a navigable channel between the eastern and western coasts of America, having so far resulted in complete failure, the idea of a passage from Europe to Asia across the polar sea, attracted great attention towards the close of the last century. A mass of evidence with regard to its feasibility was laid before the Royal Society whose president Earl Sandwich, was also at the head of the admiralty. The project of an expedition across the pole received the favorable consideration of the king who commissioned two ships for the service. They were placed in command of Captain John Phipps and Captain Lutwidge. Horatio Nelson joined the expedition as a midshipman.\n\nThe expedition left England in June 1773, proceeded almost due north to Spitzbergen, and finally reached latitude 80° 37' when the ships were encompassed by ice and remained in a perilous conditions for some time. Having with difficulty escaped destruction, the ships returned home.\n\nForty-three years later, the British Government again sent out a similar expedition with a corresponding result.\n\n(10) Efforts to find a North-west Passage in the Nineteenth Century.\n\nNotwithstanding so many discouragements, navigators continued to believe in the existence of a North-western passage connecting the Pacific by Behring Strait, to be reached\nby some unknown inlet approachable from the Atlantic between the northern coast of Labrador and Greenland. Influenced by these views, the British Government, being extremely desirous of securing a new route to India, at the close of the war with France, renewed the efforts of discovery by offering a reward of £20,000 to any one, or any body of men who would satisfactorily establish its existence. A north-west passage thus having become a national object, two expeditions were sent out in the year 1818, one under Captain David Buchan and Lieutenant John Franklin, the second under the command of Captain John Ross and Lieutenant Edward Parry.\n\nThese efforts although unavailing did not establish the non-existence of the long sought passage; they rather made the question more interesting and increased the determination to obtain its solution. New expeditions were therefore decided on. In 1819, Captain Parry sailed in command of two ships which after wintering in the north seas returned in 1820. In 1821 he again commanded an expedition which after passing two winters among the Eskimo returned in 1823.\n\nIt was in 1819, that Lieutenant Franklin was despatched by land to the northern coast, in order to survey to the west of Coppermine River. Hitherto the coast had only been visited at two points; by Hearne at the mouth of the Coppermine in 1771, and by Alexander Mackenzie at the mouth of the river which bears his name, in 1789. Franklin was accompanied by Dr. Richardson, Messrs. George Back and Hood. On the return journey the expedition experienced great suffering from cold and starvation, and Hood and many of the men perished.\n\nIn 1824 a combined attempt by four expeditions was organized; under Parry and Lyon from the east; under Beechey from the west entering by Behring Strait; and under Franklin by Mackenzie River. These several expeditions returned in 1826. In 1827, Captain Parry undertook the last of the series of unsuccessful attempts made under his command.\n\nIn 1829, a wealthy gentleman, Sir Felix Booth, undertook to defray the cost of a private expedition, and placed it under the command of Captain Sir John Ross and his nephew James. On this occasion the ships became winter-bound, and were unable to return until 1833, the expedition having passed four winters in the frozen region. The anxiety felt for their safety induced the authorities to send out a land expedition under Sir George Back and Dr. Richard King. These explorers set out in 1833 and travelled by Great Slave Lake and Great Fish River to the arctic seaboard; they returned in 1834.\n\nIn 1836, Sir George Back was placed in command of a naval expedition, to prosecute north-western discoveries. He was obliged to winter in the pack ice and returned to England the following year.\n\nIn 1837, Simpson and Dease, sent out at the instance of the Hudson's Bay Company, reached the mouth of the river Mackenzie. The object of this examination was to connect by actual survey the several points on the northern coast which had been visited by previous explorers. They were engaged in this service until 1839.\n\nIn 1845, a fresh attempt to discover the north-west passage was undertaken by Sir John Franklin and Captain Richard Crozier in charge of a naval expedition with 135 officers and men. The unfortunate end of the expedition is well known. The ships \"Erebus\" and \"Terror\" sailed on May 19th, 1845. They were last seen by a whaler, on the following July 26th, in Baffin Bay. After years of anxiety and uncertainty, and\nmany efforts to obtain tidings of the missing ships, all that could be learned regarding them was comprised in the few relics found by search parties, proving that they had all perished. The memory of these brave men must ever live in the hearts of their countrymen.\n\nIn 1846, Dr. John Rae was entrusted with the work of completing the examination of the coast. He wintered within the arctic circle and remained there until the summer of 1847.\n\n(11) Expeditions in Search of Franklin.\n\nFranklin had been away three years when the British Government considered that the time had arrived, when search should be made for the missing ships. It was therefore determined, early in 1848, to send out three several expeditions. The first, consisting of two ships under command of Captains Moore and Kellett, was to proceed by way of Behring Strait. The second under Sir John Richardson and Dr. John Rae was to go by land, descending Mackenzie River to its mouth, and to follow the coast as far as the Coppermine River. The third, being two vessels commanded by Captain Sir James Ross and Captain E J. Bird, well supplied with stores of every kind, was to proceed by Davis Strait, and to follow Lancaster Sound westward. These relief expeditions left nothing undone to attain the object they had in view; but up to 1850 no traces of the lost ships had been found and renewed efforts became necessary.\n\nIn 1850, expeditions proceeded by Behring Strait under Captains Collinson and McClure; another by Barrow Strait under Captain Austin; a third, by the same route was sent out by Lady Franklin in command of Captain Penny.\n\nIn 1851, Lady Franklin sent out a ship under Captain Kennedy, with Lieutenant Bellot of the French navy as second in command. They wintered in the ice, and made long sledging journeys, adding to geographical knowledge, but without accomplishing the main object of the expedition. They returned to England in 1852.\n\nIn 1852, another expedition was sent out by the British Government, consisting of a number of vessels, in command of Sir Edward Belcher, Captains Osborne, Richards, Kellett and McClintock. Among the officers were Terry, Hamilton, Meacham, Nares, Pim and other well known names connected with the naval service.\n\nIn 1853, Dr. Rae again undertook a land expedition; he completed the coast examination of the previous years, and connected the discoveries of former travellers. Dr. Rae was the first to bring back tidings of Franklin; the news of the fate of the expedition, thus obtained, reached London, October 22nd, 1854. Dr. Rae brought home with him relics of the heroic commander, which are now deposited in Greenwich Hospital. Other relics were subsequently recovered by the McClintock and Hall expedition.\n\nBetween the years 1848 and 1854 some fifteen expeditions were sent out, mainly in consequence of the anxiety felt regarding Sir John Franklin and those who accompanied him. Unwearied exertions were made by Lady Franklin herself; she exhausted her own private means in sending out auxiliary ships to continue the search, while her appeals for aid aroused the sympathy of the civilized world.\n\nThe search was continued from year to year, winter as well as summer. The ships which entered by Behring Strait in 1850 remained in the ice for more than one winter.\nThe \"Enterprise\" under Captain Collinson returned to England in 1854 by the Pacific. The \"Investigator,\" under Captain McClure, never returned. In the second year she reached a palaeoecystic region where she became hopelessly embedded in the ice never to move again. In the third year, her perilous position having been discovered by a sledge party under Captain Pim on a relief expedition, the ship was abandoned, and Captain McClure his officers and crew to find safety marched over the ice to the \"Resolute\" of Sir Edward Belcher's expedition which they reached on June 17th, 1853, after a journey of two weeks. But they did not reach England until the following year. The \"Resolute\" was caught in the pack ice and there remained during the winter of 1853-54. This vessel was eventually abandoned, on May 14th, 1854, to be recovered in 1855, after drifting in the pack nearly a thousand miles. Meanwhile McClure and his men reached England by a relief ship in the autumn of 1854.\n\n(12) General Results of the Maritime Expeditions.\n\nThus terminated the voyages of discovery for a western passage for ships from Europe to Asia. Since Cabot sailed from Bristol in 1497 under the auspices of Henry VII, up to the day, when the return of Franklin was for ever despaired of, there have been almost ceaseless efforts to obtain it. In the numberless attempts to find a north-west passage, England has risked the lives of many of her adventurous sons. It is a story of heroic struggles year after year in ice-enumbered regions, and of daring and unsuccessful attempts for three and a half centuries. The single instance of partial success is that of McClure, who traversed the route from the Pacific to the Atlantic with his ship's crew. His ship was, however, left behind, and a second ship in which he found refuge was abandoned, the voyagers reaching England on board of a third ship after an absence of nearly five years. McClure was honoured and rewarded by the British Parliament; he had demonstrated the possibility of passing between the two oceans, but with the condition that for several degrees of longitude the passage is across an impenetrable region of palaeoecystic ice. We had thus a negative solution to the problem which has tried the skill and daring of navigators ever since America was first discovered, and on which the lives of many hundreds of brave men and many millions of money had been expended. The obstacles to navigation around the northern extremity of the continent have been proved to be insuperable. It had been established beyond all question, that the climatic conditions of the Arctic Ocean render the passage of no commercial value whatever, and that nature has imposed an adamantine barrier beyond the power of man to remove.\n\nII.—DISCOVERIES BY LAND.\n\n(1) Explorations by the French Pioneers.\n\nIf the maritime efforts extending over three and a half centuries, and of which the above is only a faint outline, were, in view of the object sought, completely barren of fruit; the overland journeys must be regarded in a different light.\n\n*The Resolute was found by a whaler from the United States, she was brought into port, and eventually presented to the British Government by the Government of the United States.*\nUp to the commencement of this century, no explorations were undertaken by the Government or by any citizen of the United States, beyond the valley of the Missouri. It is to the northern part of the continent that we have to look for the seat of adventure and enterprise. It is mainly within the territory now known as the Dominion of Canada that the earliest and more important results were obtained.\n\nThe French pioneers displayed remarkable enterprise and activity. As early as 1615, Champlain ascended the Ottawa, and discovered Lakes Huron and Ontario. In 1640, Fathers Jogues and Raymbault were at Sault St. Mary, the discharge of Lake Superior. In 1669, the French discoveries extended to Lake Michigan. In 1673, Jolliet and Marquette penetrated to the Mississippi, and descended its waters as far as Arkansas. In 1682 La Salle descended the Mississippi to its mouth. As early as 1674, an overland expedition from Quebec under father Charles Albanel, reached Hudson Bay, and in 1686 a trader, Noyon, had found his way to the Lake of the Woods.\n\nA great impulse was given to these discoveries early in the following century. La Verendrye the elder, between 1731 and 1739, established various trading posts on Lake Winnipeg and its tributaries, Red River, the Assiniboine and the Saskatchewan. His son, Chevalier La Verendrye, undertook more distant expeditions to the west and south. This adventurous traveller places on record his arrival at some mountains which were probably the outlying highlands or foot-hills which, south of the 49th parallel, extend some degrees of longitude to the east of the Rocky Mountains zone. Under Niverville, the ascent of the river Saskatchewan was made for some considerable distance and the narrative states that the Rocky Mountains were seen.\n\n(2) First overland Journey to the Pacific Ocean.\n\nIn the second half of the century, Canada having passed under British rule, expeditions of discovery were made at the instance of the English trading companies. In 1771, Hearne, under the instructions of the Hudson's Bay Company, which then had been in existence a hundred years, followed the river Coppermine to its mouth on the Arctic Ocean. In 1783, the North-West Fur Company was formed, with its headquarters in Montreal. By the year 1787, its trading posts had reached the river Athabasca, and the following year a post was established on Peace River. In 1789, an officer of the company, Alexander Mackenzie, discovered the great river of the north which bears his name, which he descended to its outlet in the Arctic Ocean. Three years later he arrived at the Pacific coast in latitude about 53°. This intrepid traveller made the first overland journey to the Pacific, north of the Gulf of Mexico.\n\n(3) United States overland Expeditions.\n\nTwelve years after Mackenzie had traversed the continent in the interest of a Canadian fur company, the attempt to reach the Pacific Ocean, was repeated by Lewis and Clark, under the authority of the government of the United States. Up to this period the central region of North America, within the limits of the United States was unknown. Canadian merchants had established trading posts from the St. Lawrence to the Rocky\nMountains and from Hudson Bay to Peace River; they had extended their explorations from Lake Superior to the Arctic Ocean, at a time when the whole region from the Missouri to the Pacific had been untrodden by white men.\n\nCaptain Lewis and Lieutenant Clarke, with a strong and well equipped expedition, left the Atlantic coast in June 1803, and reached the mouth of the Columbia in December, 1805. Returning, the expedition arrived at Washington in February, 1807. Their official journal was not published until 1844. Notes were however given to the public in 1808.\n\nWith the exception of a private expedition, sent from New York three years after the return of Lewis and Clarke, the moving spirit of which was John Jacob Astor, and which ended in failure, there was no intercourse between the United States and the Pacific coast by land until the second quarter of the present century.\n\nAfter the failure of Astor's Company, the first successful attempt in the United States to form a connection with the west was in 1825, when Jedediah Smith led a party across Utah and Nevada to California. The second was in 1832, when Nathaniel J. Wyeth and some twenty others proceeded overland from Massachusetts to Oregon. These were the pioneer waves of the tide of immigration which followed in after years.\n\n(4) Explorations under the great Fur Companies.\n\nThe agents and officers of the Canadian fur companies penetrated the country beyond the Rocky Mountains in all directions. They established trading posts throughout New Caledonia, new British Columbia, (1) in 1805 on McLeod Lake, (2) in 1806 on Stuart Lake, (3) in 1807 on the Jackanoot (now the Fraser) at Fort George, and in 1808, an expedition started from the latter point to trace the Jackanoot to the sea. They discovered Thompson River in 1808; they traversed the river Columbia from its extreme northern bend at Boat Encampment to its mouth in 1811; and their agents were the first Europeans to exercise control in the extensive region now known as Oregon, Washington Territory, and British Columbia. Throughout that vast region early in the century, the Canadian fur companies founded many trading establishments, and gained a dominant influence amongst the native tribes.\n\nEarly in the century the several fur companies were reduced to two, the \"North-West\" and the \"Hudson's Bay.\" In 1821, the rivals became consolidated to form a single organization, henceforth to be known by the name of the \"Hudson's Bay Company.\" The authority of this company was now undisputed, and its influence was supreme, as well throughout the region bounded on the west by the Pacific coast, as to the east of the mountains. In 1839, the company entered into an arrangement with Russia for the lease of Alaska; and its trading posts were established at all eligible points from Behring Strait on the north, to San Francisco to the south. For the time being, the northern Pacific coast was virtually in possession of the Hudson's Bay Company.\n\nIn this condition of affairs the river Columbia proved of paramount importance as the means of intercourse between east and west. For half a century after David Thompson's first descent in 1811, it became the great highway between Canada and the Pacific. There was no natural line of communication more accessible or more available; and at the date when the Oregon Treaty went into force, few travellers attempted to enter\nBritish Columbia by any other route. It is obvious therefore that we are warranted in including in the list of Canadian overland expeditions, the journeys by the river Columbia, up to the period when the Hudson's Bay Company's forts on its banks were evacuated.\n\nThe Hudson's Bay Company, as the inheritor and representative of all previous fur companies, has played an important part in the early history of the western territory within the limits of the Dominion. The extended trade and influence of this vast commercial concern furnishes evidence of extraordinary energy and perseverance. The adventurers and explorers in the service of the company undertook the most fatiguing journeys, and evinced the greatest fortitude in exposing themselves to hardship, privation and danger. It was they who took possession of the territory on both sides of the Rocky Mountains and on both sides of the 49th parallel. They were for many years the only civilized occupants of both banks of the Columbia from its sources to its mouth, and it was not their fault that this region is not now part of the Dominion. They held their ground in Oregon and Washington Territory under the British flag until they were compelled to relinquish their hold by the treaty of 1846. But for the discoveries made under the authority of this fur company, New Caledonia or British Columbia would never have existed, and Canada to-day would be shut out from access to the Pacific.\n\nIt was out of the tangle of diplomacy that the treaty which terminated the authority of the Hudson's Bay Company over the region watered by the Columbia was evolved. But the Oregon Treaty did not at once suspend all the company's operations south of the 49th parallel; it gave certain rights of possession and of navigating the river, subject to the regulations which the Government of the United States might impose. For some years the trading posts were retained, but owing to the conditions of the treaty it became necessary to give up to the United States authorities all the forts of the company south of Puget Sound. In 1860, the Hudson's Bay Company abandoned its various establishments in Oregon and Washington Territory, and the moveable property not disposed of was transferred to Fort Victoria on Vancouver Island, the point at which, as headquarters, the operations of the company, west of the mountains, have since been centred and carried on.\n\nIn the following brief outline of the expeditions undertaken between Canada and the Pacific, no attempt will be made to relate the frequent overland voyages of the brigades of fur-trading canoes, except such of them as have been specially recorded. Intercourse was regularly maintained by the company across the continent during the half century which preceded the abandonment of Oregon. During that period, the route generally travelled on the western side of the mountains was by the Columbia; on the eastern side of the range, the chain of rivers and lakes leading to York Factory were followed.\n\nIII.—CANADIAN OVERLAND EXPEDITIONS.\n\nThe earliest overland journey to the Pacific was made in 1793. In the ninety-two years which intervened between that date and the completion of the Canadian Pacific Railway not less than forty such journeys are on record. They may be divided into three classes, chronologically separated into three periods.\nPeriod I.—From first Overland Journey in 1793 to Oregon Treaty in 1846.\n\nIn the first period, the Hudson's Bay Company and its associated traders appear as the active agents. During these fifty-three years we have a record of thirteen expeditions, which, with one exception, that of Mr. David Douglas, the naturalist, were undertaken by the company's officers who explored the western territory, and planted trading posts over a primeval country, thousands of miles in extent. Geographical knowledge was not the main object of these explorers; but their energy and enterprise enabled them to make discoveries which had the remarkable consequence of establishing rights national in their character, and of gaining information of much general importance and scientific value.\n\n(1) Expeditions of Sir Alexander Mackenzie, 1789-1793.\n\nAmong those who have distinguished themselves by their explorations on this continent, no name is more illustrious than that of Sir Alexander Mackenzie. He ranks the first on the list of overland discoverers. He was the first white man from Canada to reach the Arctic Ocean, the first European to pass through the Rocky Mountains, the first overland traveller north of the Gulf of Mexico to arrive at the shores of the Pacific.\n\nAlexander Mackenzie was born at Inverness, Scotland, it is said, in 1769. It is not known when he arrived in Canada; we, however, learn from himself that in 1785 he was admitted a partner into the fur-trade operations in the west. He had then been five years employed in the office of Mr. Gregory, so that he must have been twenty years of age when he began. His first venture was with some goods to Detroit, at that date little more than a trading post. Thence he proceeded to the Grand Portage, north of Lake Superior, where he commenced his remarkable career. He informs us of his ambitious hopes in the following words: \"I not only contemplated the practicability of penetrating across the continent of America, but was confident in the qualifications, as I was animated by the desire, to undertake the perilous enterprise.\"\n\nFor some years a severe struggle had been going on between several rival establishments, and, independently of the natural difficulties of the trader's life, the greatest opposition was encountered from the common foe, the Hudson's Bay Company. The result was that a union of their several interests was effected; and, in the year 1787, the North-West Company was organized on a solid basis for the purpose of vigorously carrying on the fur trade.\n\nMackenzie became connected with the new company, and we find him in 1789 at Fort Chipewyan, on the Lake of the Hills (Lake Athabasca). On June 3rd, of the same year, he set out on his journey to the north, where he discovered the river which bears his name, reaching its mouth which lies within the Arctic circle. This geographical discovery was of the highest importance, inasmuch as it swept away all dubious conjectures which had been formed as to the existence of a strait or passage for ships through the interior of the North American continent. He returned to Fort Chipewyan on September 12th, 1789.\n\nWe learn from Mackenzie, that on his voyage down the river he had felt himself deficient in the knowledge of astronomy and navigation. He unhesitatingly, therefore, undertook books and for the expedition.\n\nOnce having Ascending winter at Peace River Parsnip. the green so that he on which when Sir down the proceed. length attempt another had to turn precise explorer.\n\nIt the sea different but Mack the sea reached latitude August which the absence undergone work of had been.\n\nSir the picture accompanying be read and enter most are the real\nundertook a journey to England, in order to educate himself in these sciences and procure books and instruments for his future use. It was in this way that he prepared himself for the expedition to the Pacific.\n\nOnce more Mackenzie found his way to Fort Chipewyan, and, on October 16th, 1792, having made every necessary preparation, he left on a journey of further discovery. Ascending Peace River until his progress was impeded by ice, the party remained for the winter at the place where the delay was experienced.\n\nOn May 9th, 1793, when the river opened, the voyage was resumed. He ascended Peace River to the Forks; one branch of which has been named the Finlay, the other the Parsnip. Mackenzie's party followed the latter to near its source, when he crossed to the great river called Tacoutche by the Indians, cutting a passage through the woods so that he could carry his canoe with him. Mackenzie formed the opinion that the river on which he then embarked was the Columbia; a belief generally entertained until 1808, when Simon Fraser followed its waters to the Strait of Georgia. The travellers floated down the Tacoutche five days, meeting Indians with whom some difficulty was experienced. They learned from the Indians that the river they were following was of great length and full of perils. His men becoming mutinous, he decided to abandon the attempt to descend to the mouth of the Columbia, and determined to reach the sea by another route. In order to gain the path to the west used by the Indians, the explorer had to turn back. Fort Alexandria was established twenty-eight years afterwards, at the precise spot where he reversed his course, and was so named in honor of the first explorer.\n\nIt proved fortunate that he so determined; the route described by the Indians led to the sea in sixteen days after leaving the main river. His party had adventures with different Indian tribes; they were placed on short allowance, and underwent hardships, but Mackenzie at last attained his long cherished object. On July 22nd, 1793, he reached the sea overland from Canada, and floated on the tide-water of the Pacific. The point reached is near the Indian village of Bella Coola, on the North Bentick Arm, about latitude 52° 30'. The explorer returned approximately by the same route, reaching on August 24th, the point on Peace River where the party had passed the winter, and from which they had started west on May 9th. They arrived at Fort Chipewyan after an absence of eleven months, during which period they had encountered many dangers and undergone privation. Mackenzie had the unqualified satisfaction of feeling that the work of exploration and discovery he had undertaken, with all its toils and solicitudes, had been crowned with complete success.\n\nSir Alexander Mackenzie's portrait is given in the edition of his works of 1804, after the picture by Lawrence. There is almost a feminine delicacy in the features, but accompanied by a dauntlessness of expression, with a mouth round the lines of which can be read firmness and determination. He describes himself as of an inquisitive mind and enterprising spirit, and as possessing a constitution and frame of body equal to the most arduous undertakings. It was his pride to think that he had added new regions to the realm of British commerce. Mackenzie died in 1820.\nThe explorations of Mr. Simon Fraser were in every sense remarkable, and they have exercised no little influence on the history of British Columbia. He entered the service of the North-West Company, in 1792, at the age of nineteen; ten years later he became a partner. In 1805 a conference was held at Fort William, to discuss the advisability of extending the operations of the company beyond the Rocky Mountains, for the purpose of occupying the territory. The desire was to anticipate the United States explorers and traders, who might establish a claim to its ownership by right of discovery and occupation. It was decided that trading posts should be established in the then unknown territory, and possession by this means taken of it. The duty of carrying out the project was assigned to Mr. Fraser. He soon afterwards left Fort William, made his way to Lake Athabasca, and ascended Peace River in the mountains, where he established a trading post, which he named the Rocky Mountain Portage.\n\nPlacing men in charge, he continued his journey to McLeod Lake, which he discovered, and there also left some traders. In 1806 he portaged to Fraser River, at that date regarded as the main stream of the Columbia, or one of its principal affluents. He left the Fraser, and followed a tributary flowing from the westward, now known as Stuart River, and so named from a companion in the service, Mr. John Stuart. He traced this stream to Stuart Lake; he here established a trading post, the present Fort St. James. He penetrated to Fraser Lake, another of his discoveries, and there also he established a trading station. He gave the name of New Caledonia to the whole territory. In 1807, two canoes with goods, under the charge of Messrs. Quesnel and Farries, reached him; at the same time he received letters urging him to carry on his explorations to the ocean, by the river flowing through the country to the south, in anticipation of parties from the United States, who were displaying some activity at this date; Lewis and Clark having been sent out by the United States Government to the Pacific coast. This year Mr. Fraser established another post, Fort George, on the main stream.\n\nIn the spring of 1808, Mr. Fraser, with Messrs. John Stuart, Jules Maurice Quesnel, and a crew of nineteen men, and two Indians, embarked in four well-furnished canoes to explore the unknown waters which were regarded as a main affluent of the Columbia. They left Fort George on May 28th, where the river is described as 300 yards wide with a strong current. They reached its mouth on July 1st, and found the latitude to be about 49°, establishing that the river was a separate and distinct stream, and not the Columbia, the latitude at the mouth of which was then known to be 46° 20'.\n\nFor a few days after leaving Fort George, the expedition made rapid progress. Sir Alexander Mackenzie fifteen years earlier, had passed over some extent of the distance to the point where, on the advice of the Indians, he turned back, to follow a trail westward to the sea. The Indians whom Mr. Fraser met were friendly, and gave him similar advice; they informed him that the descent of the river was extremely dangerous, that he could not go on, and that the whole party would meet destruction if they made the attempt. The object of the undertaking being to follow the river to the mouth, Fraser declined to turn back. The verification of the Indian description of the navigation was not long delayed, for in a short time appalling difficulties were encountered. A striking narrative of this descent is given in the Journal of Simon Fraser in the work of Senator Masson, recently issued, \"Le Bourgeois de la Compagnie de Nord-Ouest.\"\nOn June 1st, five days after they started, the river narrowed to a canyon possibly the least dangerous of a long series which lay before them. In the first canyon they lost one of their three canoes. On the 5th, the river contracted to a width of not over thirty yards between precipices, the water \"turbulent, noisy and awful to behold.\" They made a portage of a mile over most difficult ground, leaving the men harassed by fatigue. On the 6th, finding a cascade and whirlpool, hemmed in by huge rocks, to avoid portaging, they lightened the canoes and ran the rapids. On the 9th \"the channel contracts to about forty yards, and is enclosed by two precipices of immense height, which, bending towards each other, make it narrower above than below. The water which rolls down this extraordinary passage in tumultuous waves, and with great velocity, had a frightful appearance. However, it being absolutely impossible to carry the canoes by land, all hands without hesitation embarked as it were a corps perdu upon the mercy of the awful tide. . . . Skimming along as fast as lightning, the crews, cool and determined, followed each other in awful silence, and when we arrived at the end, we stood gazing at each other in silent congratulation on our narrow escape from total destruction.\"\n\nAgain on the same day, the journal reads: \"This afternoon the rapids were very bad; two in particular were worse, if possible, than any we had hitherto met with, being a continual series of cascades, intercepted with rocks and bounded by precipices and mountains that seemed at times to have no end.\" At last they found the navigation wholly impracticable, while the precipitous river sides had a most forbidding aspect. Even men of their nerve could proceed no further on the foaming stream. On the 10th they were compelled to abandon the canoes and many articles not absolutely required. They started to travel the rugged banks on foot, each with a load of eighty pounds. To describe the walking would baffle description: only those who know the river can imagine what these travellers endured, passing along the declivity of mountains, ascending and descending rugged rocks, crossing ravines and climbing precipices. On the 19th, they reached a large rapid river flowing from the east, which Mr. Fraser named the Thompson, after his friend and colleague in the work of discovery, Mr. David Thompson.\n\nOn the 20th, they reached what is now known as the Jackass Mountain. \"The ascent was dangerous; stones and fragments of rock were continually giving way from our feet and rolling off in succession.\" Again, on the 25th, we read, \"the ascent was perfectly perpendicular; one of the Indians climbed to the summit and, by means of a long pole, drew us up one after the other. This work took three hours; then we continued our course, up and down hills and along the steep declivities of mountains, where hanging rocks and projecting cliffs, at the edge of the bank of the river, made the passage so small as to render it at times difficult for one person to pass sideways.\"\n\nOn the 26th they came to Spazzum, and on the 29th they emerged from the canyon, and were fortunate enough to obtain a canoe from the Indians in the neighborhood, by means of which they reached tide water on July 1st. The Indians on the coast were exceedingly troublesome, and Fraser was obliged to hasten his departure. His party started on July 3rd, returning by the route they came, and reached their starting point, Fort George, on August 6th.\n\nThat portion of the Fraser from the confluence of the Thompson downwards, is now traversed by the Canadian Pacific Railway. It is possible from the passing train to look upon some of the ground over which the men of Fraser's party struggled, by which some\nidea may be formed of the difficulties the foot-sore travellers overcame. The journey itself was hazardous from first to last; it required the greatest nerve and courage. The travellers, for part of the way, were dependent on the Indians for food, which consisted of dried fish, berries and roots. Except on the upper section of the river, previously visited by Mackenzie, none of the tribes on the route had ever before seen the face of a white man, and caution and prudence were necessary to avoid awakening Indian enmity. The undertaking was bravely and successfully accomplished; and it is no little owing to Simon Fraser and his associate discoverers, Messrs. Stuart and Quesnel, of the North-West Company, that the country north of the 49th parallel is at this date British territory.\n\nMr. Fraser remained in the service of the company for some years after the discovery of the river which has been named in his honor. On his retirement from his position, he was offered a knighthood, but the honour was declined, owing to his narrow circumstances. He died at St. Andrews, above Montreal, at the age of eighty-nine, very poor, and leaving no provision for his family. Such was the fate of this daring explorer, who was so largely instrumental in securing the British foothold on the Pacific coast, without which the Dominion of Canada would have been shut in on the west by the Rocky Mountains.\n\n(3) Travels and Discoveries of Mr. David Thompson, 1790–1811.\n\nDavid Thompson, whose explorations were undertaken early in the century, was a Welshman; he was born in 1750, and educated at the grey coat school, London. He entered the service of the Hudson's Bay Company in 1789; and proceeded to Fort Churchill, where he remained five years. For the succeeding nine years of his life on this continent he was engaged making surveys of the rivers Nelson, Churchill, Saskatchewan and their tributaries, frequently visiting York Factory during that period. Having completed his engagement with the Hudson's Bay Company, he joined the North-West Company, in 1797, when he went to the Grand Portage near Lake Superior. Following his duties as astronomer and geographer to the company, for a number of years he was present with the Mandan Indians in Missouri, at Lae La Biche, Lake Athabasca, the Rocky Mountains and nearly all the stations of the company throughout the vast territory.\n\nIn 1800, Mr. Thompson entered the Rocky Mountains in latitude 51°, probably in the vicinity of the same pass as that followed by the Canadian Pacific Railway. He descended one of the northern branches of the Columbia, which he called McGillivray River. He was, however, driven back by Indians, and compelled to recross the mountains.\n\nIn 1807, Mr. Thompson was again in the Rocky Mountains and was the first to go through what is known as Howes Pass, by which route he reached the Columbia. He ascended that river to the Columbia Lakes and built Fort Kootenay. In 1808, he descended River Kootenay to Kootenay Lake where he entered into trade relations with the Flathead Indians. He returned by another route to Fort Kootenay, descended the Columbia to Blackberry River, and recrossed the mountains by the Howes Pass. He then\n\n---\n\nThree descendants of Simon Fraser survive: his daughter, Miss Catherine Harriet Fraser, who resides in Cornwall, and her two brothers, William, who lives in Hamilton, and Roderick, at present in St. Andrews, County of Stormont.\ntravelled eastward with the furs he had obtained in trade to Rainy Lake House, which he reached on August 2nd. Much suffering was experienced by his party on this expedition.\n\nOn August 4th, he again started for the west and arrived at the Columbia on October 3rd. In his notes he speaks of the Rapid River, now known as the Kicking-horse River. He continued at Fort Kootenay, trading with the Indians and making explorations in the neighbourhood. There is some confusion in the account of Thompson's travels, but it is clear that for several successive years he crossed the mountains many times by various routes. It would appear that late in the autumn of 1819, he ascended Athabasca River to its source, and crossed the mountains by what is now known as the Athabasca pass to the Columbia, where he arrived early in January. He spent the remainder of the winter at the mouth of Canoe River, and in the spring of 1814 he left for the mouth of the Columbia. But he did not follow the stream on this occasion; he ascended the Columbia to its source, crossed McGillivray Portage, and descended Kootenay River, thence by Pend d'Oreille and Spokane Rivers. On June 19th he reached the falls of the Columbia known by the Indians as Hid-koy-Ape (Fort Colville), and thence followed the main river to the Pacific coast, where he arrived on July 15th, 1814. He was kindly received by the officers of the Pacific Fur Company, who had arrived a few weeks earlier and were then establishing Fort Astoria. Mr. Thompson remained here a few days and returned as he came to Fort Colville, thence by Arrow Lakes and the Columbia to the mouth of Canoe River, whence he had started a few months previously to ascend the stream. Mr Thompson was thus the first civilized man to traverse the main stream of the Columbia, certainly that portion of it above Fort Colville, to its source.\n\nIn 1799, Mr. Thompson married Miss Charlotte Small, aged 15. The ceremony took place at He à la Croix, Buffalo Lake. He lived to be eighty-seven, dying at Longueuil, opposite Montreal, on February 16th, 1857, it is sad to write, in extreme poverty. His widow followed him to the grave in a few weeks. Bancroft says of David Thompson: \"No man performed more valuable services or estimated his achievements more modestly.\" He was well educated; and his meteorological and astronomical observations to this day command respect. His map of the Northwest Territories, 1792-1812, \"embraces the region between latitudes 45° and 56° and longitudes 81° and 124°,\" and was made for the North-West Company in 1813-1814. It is in the possession of the Crown Land Department of Ontario.\n\n(4) Journeys of Mr Alexander Henry, 1811-1814.\n\nAlexander Henry started from Montreal in July, 1799, by the river Ottawa. He followed the ordinary route via Lake Nipissing, French River, and Sault St. Mary to Lake Superior, and the canoe route to Lake Winnipeg. Engaged as a fur trader he spent\n\n---\n\nSome of the facts above given are from MSS., now in the possession of Mr. Charles Lindsey of Toronto, giving an account of Mr. Thompson's travels. It is well worthy of publication. An outline of some of the journeys of Mr. Thompson was submitted to the Canadian Institute, Toronto, by Mr. J. B. Tyrell, March 3, 1888. Three daughters of David Thompson survive: Mrs. G. E. Shaw, of Peterborough, Ont.; Mrs. R. Scott, Evansville, Indiana; and Miss Thompson, Ivanhoe, Ohio.\nten years in the neighbourhood of Red River, visiting from time to time the posts at Pembina, Assiniboine and Missouri. He made almost annual visits to Fort William on Lake Superior until 1809, when he started for the Saskatchewan, and in 1810, passed up that river to Rocky Mountain House. In May, 1811, he set out to reach the water flowing westerly to the Pacific. He reached one of the sources of the Columbia, and returned to Rocky Mountain House. From 1811 to 1813, the journal of Mr. Henry is wanting. It may, however, be said that during this period he proceeded in 1812 to Fort Vermilion, and it is inferred that he spent the following year at Henry House near the junction of the Myette and the Athabasca. In 1813, he crossed the Rocky Mountains a second time, on this occasion following the river Columbia to its mouth.\n\nOn December 13th, 1813, Mr. Henry was present at Fort Astoria, when the Captain and crew of H. M. S. \"Raccoon\" landed in uniform, and with some ceremony broke a bottle of Madeira on the large flag staff carrying the Union Jack. They took possession of the country in the name of His Britannic Majesty and named the establishment, which was then owned by the North-West Company, \"Fort George.\" Mr. Henry remarks in his journal, \"the officers of the Raccoon are famous fellows for grog.\" The year following, he was drowned in a heavy storm when about two miles out in the stream of the river Columbia, near the fort. The last entry in his journal, which is preserved in MS. in the Parliamentary Library, Ottawa, is dated Saturday, May 21st, 1814. Mr. Alexander Ross refers to the incident in his narrative of the \"The Fur Hunter,\" (I., p. 38.) \"On May 22nd, some time after the arrival of the Isaac Todd, a boat containing Messrs. Donald McTavish and Alexander Henry, two partners of long standing and high reputation in the service, with six men, was swamped, all hands perishing, in crossing the river, with the exception of one man. Although the accident took place in broad daylight, and in front of the fort, the circumstance was not perceived or known, for some hours after, when John Little, the man who was saved, arrived at the fort, and communicated the intelligence.\"\n\n(5) Journey of Mr. Gabriel Franchère, 1814.\n\nThe ship \"Tonquin\" crossed the bar at the mouth of the river Columbia, March 25th, 1811. She had on board thirty-three passengers, thirty of whom were British subjects, and of these twenty-eight were from Canada. They had passed round Cape Horn from New York; their object was to carry on the fur trade on the Pacific coast, under the name of the \"Pacific Fur Company\"; of which company, Mr. John Jacob Astor, a German by birth, residing in New York, was the principal promoter. The Canadian partners had among them several of the traders who at one time had been in the service of the North-West Company, including Alexander McKay, who had accompanied Sir Alexander Mackenzie, on his overland travels. On April 12th they selected a site for a building in which the business of the company could be carried on. The establishment broke up two years afterwards, and on October 16th, 1813, the Canadian North-West Company purchased the effects and accepted the transfer of Fort Astoria. Some of the clerks who had been engaged by the Pacific Fur Company were reengaged during the winter by the new company. The others returned to Canada, among whom Gabriel Franchère started overland the spring following, and described the journey in a narrative published on his return.¹\n\n¹ Narrative of a voyage to the North-West Coast of America in the year 1812-13-14, by Gabriel Franchère.\nMr. Franchère left Fort George, as Fort Astoria was then called, on April 4th, 1814, in company with some of his companions who had doubled Cape Horn three years earlier, and who were deprived of employment by the turn of affairs on the Columbia. They embarked as passengers with a North-West Company brigade consisting of ten canoes—each with a crew of seven men, in all ninety persons, some of whom were going to posts in the interior. They were all well armed in order to protect themselves against hostile tribes along the river. They ascended the Columbia to the Great Bend, which they reached on May 4th. On Canoe River, they noticed the spot where David Thompson and his party had wintered in 1810-11. Tracing their way across the Rocky Mountains, they reached the upper waters of Athabasca River, which they followed to Little Slave Lake. Their route from this point carried them to Fort Cumberland, Lake Winnipeg and Fort William, where they arrived on July 14th; Mr. Franchère reached his home in Montreal on September 1st.\n\n(6) Travels of Mr. Ross Cox, 1812—1817.\n\nA second ship, the \"Beaver,\" sent from New York by the Pacific Fur Company, arrived at the mouth of the Columbia on May 9th, 1812. Among the passengers was Mr. Ross Cox, who, having obtained a clerkship in the service of the company, had proceeded to Astoria, to assume his duties. In 1831 Mr. Cox published a narrative of his experiences on the Pacific coast, and described his journey overland to Montreal. In these volumes he refers to the arrival on July 15th, 1814, of Mr. David Thompson, astronomer to the North-West Company, in a canoe with nine men. Mr. Thompson had descended the Columbia on an expedition of discovery, preparatory to his company's forming a settlement on that river. Mr. Cox, during the summer of 1812, left for the interior to trade with the Spokane tribe of Indians. The following year, on June 14th, he returned to Astoria, to find a total revolution. The Pacific Fur Company had met with a series of misfortunes. Mr. John George McTavish and Joseph La Rocque, with sixteen men of the North-West Company had arrived and had entered into an agreement to purchase all the effects of the Pacific Fur Company at a valuation, and to give such of the company's servants as desired to return, a free passage home, by Cape Horn or overland. Mr. Cox was one of those who joined the new administration. He left Astoria October 28th to spend the winter in trading with the Flathead Indians in the interior. The following year he returned to headquarters then named Fort George, where he passed two winters. He left for Spokane House on August 5th. Between 1815 and 1817 he was in charge of Fort Okanagan, and in the spring of the latter year he was again at Fort George.\n\nMr. Cox took his departure from Fort George on April 16th, 1817, with a party consisting of eighty-six souls, which embarked in two barges and nine canoes. The brigade ascended the Columbia to Canoe River; the party thence crossed the mountains, and by the usual route reached Lesser Slave Lake, Île à la Crosse and finally Cumberland House. They descended the Saskatchewan, passed through Lake Winnipeg, Lake of the Woods, and Rainy Lake, arriving at Fort William on August 16th. At that date Captain Miles Macdonnell, formerly of the Queen's Rangers, then connected with the expedition of Lord Selkirk, and others were at the fort. There was here encamped a\nmotley gathering of voyageurs, soldiers, Indians and half-breeds. The De Meuron soldiers represented nearly every country in Europe. Besides natives of Canada and the United States, Mr. Cox saw men from the Sandwich Islands, two negroes and an East Indian from Bengal. Proceeding by Sault St. Mary, French River and the Ottawa, Mr. Cox reached Montreal on September 19th, five months and three days from the date of leaving the Pacific coast.\n\n(7) Travels of Mr. D. W. Harmon, 1800—1819.\n\nMr. Daniel William Harmon left Lachine on April 29th, 1800, in company with several other officers, under an engagement of seven years service with the North-West Company. They passed Sault St. Mary on May 30th, reached Grand Portage on June 13th, and Lake Winnipeg on August 10th. In November he was at Swan River post; on October 23rd, 1801, he mentions having met Mr. William Henry at this place. From 1802 to 1807, Mr. Harmon was stationed at Fort Alexandria, Lac la Biche, Qu'Appelle, Danphin, Swan River, Rainy Lake, Bird Mountain and Cumberland House. In 1807 he made a journey to Fort Duncan, on the north shore of Lake Nepigon, where he spent the winter. In 1808 he set out for the far west, reached Lake Winnipeg on August 1st, Cumberland House on August 12th, and Fort Chipewyan on September 7th. He here met Simon Fraser, on his return from the Pacific coast. The same year he reached Dunvegan on Peace River. From 1809 to 1819, Mr. Harmon was engaged at various points in the Peace River region and in New Caledonia to the west of the Rocky Mountains. In 1810 we find him at Rocky Mountain Portage Fort; in 1811, at Stuart Lake; in 1813, at McLeod Lake; in 1814, at Fraser Lake. It does not appear that Mr. Harmon ever reached the Pacific coast; he however passed eight and a-half years on the western side of the Rocky Mountains. The description of his travels and experience accords with the other expeditions related in this paper.\n\nMr. Harmon finally left McLeod Lake on May 8th, 1819, and arrived at Fort William, Lake Superior, on August 15th, the same year, en route for Montreal.\n\nHarmon's Journal, published in 1820, furnishes an interesting narrative of a fur trader's life in these early days. He gives a full and entertaining account of the Indian tribes with which he came in contact on both sides of the Rocky Mountains.\n\n(8) The Travels of Mr. Alexander Ross, 1811—1825.\n\nMr. Alexander Ross, one of the twenty-eight Canadians who landed at the mouth of the Columbia in 1811, has related his adventures during the fifteen years he remained on the Pacific coast, and given a narrative of his expedition across the continent. Mr. Ross was in Upper Canada when he was invited by Mr. Alexander McKay, the senior partner, to join the Pacific Fur Company, then being organized by Mr. Astor. He proceeded with several Canadians to New York, and there embarked for the mouth of the Columbia, with thirty-three different persons, all but three of whom were British subjects. Mr. Ross was present when Astoria was established, and when David Thompson, of the North-West Company, arrived there a few weeks later. He describes the circumstances which led, in the following summer, to the breaking up of the Pacific Fur Company, and the transfer of the stores, etc., to Astoria. He was taken prisoner and employed in service at the interior fort, whom he visited in 1825, and whose fate followed that of the party by the Snake River. Bowl, the chief of the current, was killed by a south-west wind during the winter, by a party of Carleton's men. The party was obliged to overtake the Athabasca House, where they remained until the end of the winter. Two vessels were built in July, 1826, and he embarked for the Pacific coast in the second of them.\nstores, merchandise and buildings to the North-West Company. He informs us, that after Astoria had remained in possession of the latter company for about four weeks, it was taken possession of by the officer in command of H. M. S. \"Racoon,\" in the King's name, and changed from Astoria to Fort George. Four months later Mr. Ross entered the service of the North-West Company, and proceeded to the duties assigned him in the interior. He spent the following twelve years trading with the Indian tribes, amongst whom he had many adventures, and not a few hair-breadth escapes. In the spring of 1825, in company with Sir George Simpson, he set out to cross the mountains. They followed the Columbia to the Great Bend, known as \"Boat Encampment;\" they ascended by the Athabasca pass to a small lake to which the name of the \"Committee's Punch Bowl\" was given. On reaching the main source of the Athabasca, they followed the current of that river to Fort Assiniboine; here they changed canoes for horses, and struck south-easterly across the country for Edmonton. At this post they remained two weeks, during their stay a grand ball was given in honor of Governor Simpson. The party left by a brigade of boats to float down the swift Saskatchewan. They halted at Fort Carleton and Cumberland House. At the latter place they found the Franklin advance party; further down the river they met Captain Franklin and Dr. Richardson on their overland Arctic expedition. The travellers reached Lake Winnipeg and visited Norway House, then a place of considerable business and activity. At this place the traders, on their return from the posts of the company, from Lake Superior on the south, the Rocky Mountains on the west, and Mackenzie River on the north, annually collected the fruits of their labour, to be dispatched to York Factory on Hudson Bay. After remaining two weeks at Norway House, Mr. Ross made the passage of Lake Winnipeg, and early in July, 1825, reached the Red River settlement where after a varied and eventful life he established himself. In 1849 he published a volume describing the career of the Pacific Fur Company, its operations, reverses and final discomfiture; and in 1855 a second narrative of his adventures among the Indian tribes west of the Rocky Mountains.\n\n(9) Travels of Mr. John McLeod, 1822—1826.\n\nAfter the union of the Hudson's Bay Company with the North-West Company, in 1821, Mr. John McLeod was the first officer to cross the Rocky Mountains from the east.\n\nMr. McLeod entered the service of the old Hudson's Bay Company in 1841, and for the ten years previously to the union of the two, he was a zealous participant in the contest with the North-West Company. He was detailed to accompany and assist Lord Selkirk's first brigade of colonists from York Factory to Red River, and he established trading posts at a number of places in the prairie region, to intercept the trade of the rival company. Mr. McLeod, when selected by the united companies to proceed to the west side of the Rocky Mountains, was stationed at Green Lake, about 200 miles north of Fort Carlton. He set out in 1822, with his wife and two young children. He reached Athabasca River, and crossed the mountains by the Athabasca pass to the Columbia, and descended the river to its mouth. In the following years he was engaged at different posts in trade operations; during this time he left Kamloops, followed the Thompson, and descended the Fraser to the Strait of Georgia. Mr. McLeod was in the Columbia district when it was decided to change the headquarters of the company. Fort\nGeorge was open to some objections, and another site was finally selected on the northern bank of the river, about a hundred miles from the mouth. At this point a new central post was established, in 1825, on a large and permanent scale, called in honour of the famous navigator, Fort Vancouver. The new headquarters of the company were placed on the northern bank of the river, in order that it might be indisputably on British soil; there was no probability at that date of the international boundary being established to the north of the Columbia.\n\nIn March, 1826, Mr. McLeod left Fort Vancouver to proceed eastward. He was accompanied by Mr. Edward Ermatinger and Mr. Douglas, the distinguished botanist. The crew consisted of sixteen men, two of whom were Sandwich Islanders. Their route took them to Okanagan and Spokane. They ascended the Columbia to Boat Encampment, the river at the time being much obstructed by ice. The mountains were crossed by the Athabasca pass, then covered with deep snow, and, with much difficulty and some danger, the party reached Jasper House on May 5th. Here he was detained owing to the confinement of his wife, which had taken place in February, the family having proceeded thither the previous October. On horses being sent forward from Edmonton, they continued their journey, and reached that station on May 17th. From Edmonton they embarked in the spring brigade of boats to follow the river Saskatchewan and the chain of waters to Hudson Bay. They reached York Factory in July, having crossed the continent in three months and twenty days. Mr. McLeod was in the service of the Hudson's Bay Company when he died, in 1849, at the age of sixty-one.\n\n(10) Expedition of Sir George Simpson, 1828.\n\nThe expedition of Sir George Simpson, in 1828, is remarkable in every point of view. As resident governor of the Hudson's Bay Company he made frequent visits to the territory of Rupert's Land and the Northwest, in order to examine into the condition of the several posts, and superintend the affairs of the company over which he presided. On this occasion he resolved to travel from Hudson Bay to the Strait of Georgia.\n\nLeaving York Factory, he ascended Hayes River, passing through what was known as the boat route to Lake Winnipeg; at the northern end of which is Norway House. Crossing the north shore of the lake, he passed to the Saskatchewan, which he ascended to Cumberland House. From this point he went northward through the chain of lakes and streams until he reached Churchill River, which he followed to the height of land, Methye Portage. By Clearwater River, he entered the Athabasca, following its waters to Athabasca Lake and Peace River. He ascended Peace River, passing through the main Rocky Mountain chain and, with the aid of horses, he crossed the plateau, a distance of eighty-three miles, to Fort St. James, on the east of Stuart Lake. Sir George Simpson was careful on all occasions to enter the forts he visited with his men, clean and dressed in their best. He carried with him a piper, who also acted as his servant. In this instance the same ceremony was observed; a gun was fired, the bugle sounded, and the piper led the march. There was a meeting to be held here of the chief officers, among whom Mr., afterwards Sir, James Douglas, the first Governor of British Columbia, was present, and, amid a discharge of small arms, Mr. Douglas went out to meet Sir George. Mr. Conolly, the chief factor of the Pacific department, was also expected. He had not arrived. Shortly,\nhowever, after the arrival of the governor, a canoe appeared on the lake, and in twenty minutes, amid a salute of firearms, Mr. Connolly entered the fort.\n\nSir George Simpson left Hudson Bay on July 12th; Mr. Connolly, the Pacific on July 12th. A singular coincidence, says Chief Factor Archibald McDonald, who in his journal records the meeting.\n\nSir George Simpson passed from the lake to Stuart River and the Fraser, which he descended to Fort Alexandria. Horses were taken at this place and the country crossed to Kamloops, a distance of 215 miles.\n\nAt Kamloops, water navigation was resumed, and the start was made in a canoe with twelve paddles. After passing through Lake Kamloops to its outlet, they entered the Lower Thompson, which they descended to its junction with the Fraser. From this point they reached tide water by the same route as that followed by Simon Fraser twenty years earlier. They left Kamloops early on October 6th, and reached Fort Langley, on the Fraser, about twenty-five miles from its mouth, on the 10th, the distance being 264 miles.\n\nThe whole journey from York Factory took ninety days, of which sixteen were passed at the trading posts; consequently the whole time en route was seventy-four days. One remarkable feature of this journey was the short time in which it was made. Sir George was well-known for his rapidity of movement. Ninety miles a day was no uncommon occurrence with him. The canoes would start at 2 in the morning, with rests for breakfast, dinner and supper. The men paddled until a late hour, which the long days of the northern latitudes permitted, sometimes until 8 or 10 at night. The average distance made was fifty miles a day. In some instances seventy-five, eighty, and even ninety miles were covered. The journey recorded was made across the continent from tide-water of the Atlantic to the Pacific. It was carried out without any of the accessories of modern locomotion, in so short a time that, if the facts were not sustained by indisputable evidence, the record might be considered an exaggeration.\n\nSir George Simpson was a man of great force of character, with much administrative ability. He was indefatigable in the discharge of his duties, and his frame was one capable of enduring great fatigue.\n\n(11) Travels of Mr. David Douglas, 1825—1834.\n\nThe distinguished botanist and traveller, Mr. David Douglas, spent a number of years in the country on the Pacific coast, extending from Oregon northward. In 1824 he started from England by sea, and reached Fort Vancouver on the Columbia, in April, 1825. Mr. Douglas is mentioned by Chief Trader John McLeod, as a fellow-traveller up the Columbia in 1826. In that year he crossed the Rocky Mountains; reached Hudson Bay, where he met Sir John Franklin, and returned with him to England.\n\nThis journey, under the title, Peace River; a Canoe Voyage from Hudson Bay to the Pacific, in 1828, was published in Ottawa in 1872. The work is edited by Mr. Malcolm McLeod, son of the Chief Trader John McLeod above referred to. He passed many years of his youth in the Northwest, and crossed the mountains twice with his father before he reached the age of six. Mr. McLeod has added many valuable notes describing the customs and habits of the voyageurs; his information, regarding the geography of much of this still but partially known region, is equally important and interesting.\nIn the autumn of 1829, Mr. Douglas again sailed from England for the Pacific coast of North America. Between the date of his arrival and 1834, his explorations extended generally through the country drained by the Columbia and the Fraser. The two last years of his life were devoted to scientific examinations in British Columbia.\n\nIn his travels through the country he obtained the knowledge of many plants, birds and mammals hitherto unknown; his discoveries include the \"Douglas fir,\" which will always bear his name.\n\nDavid Douglas was born at Scone, Perthshire, in 1798. His end is much to be deplored; he was gored to death by a wild bull in the Sandwich Islands, July 12th, 1834.\n\n(12) Explorations and Travels of Mr. Robert Campbell, 1830—1843.\n\nAmong the adventurous men sent out by the Hudson's Bay Company, to explore the country beyond the Rocky Mountains, Mr. Robert Campbell takes a prominent place. The field of his operations was mainly in the territory to the north of British Columbia, still only imperfectly known.\n\nMr. Campbell was born at Glenlyon, in Scotland; he left home on June 1st, 1830, under an engagement with the Hudson's Bay Company. He landed at York Factory, and proceeded to Fort Garry. He was variously employed until the spring of 1834, when he was transferred to the Mackenzie River district. In 1838 he established a trading post at Dease Lake, one of the sources of the river Liard, an important tributary of Mackenzie River. On this occasion he passed over to Stikeen River, which flows into the Pacific near Fort Wrangle, now well known in connection with the \"Cassiar\" gold fields of British Columbia. In 1840, Campbell travelled up the northern branch of the Liard. Leaving Fort Halkett on the latter river in May, with seven men he ascended the branch several hundred miles into the mountains to a lake which he named Lake Francis; and some distance further, to a second lake, in about latitude 62° N. longitude 130° W., which he called Lake Finlayson. From this point he passed to the western slope, and in two days' travel he discovered a wide stream which he styled the river Pelly. In 1841 a trading post was established on Lake Francis. In 1843, Mr. Campbell left Lake Francis, recrossed the mountain to Pelly River, which he descended for some distance. This river discovered by him proved to be identical with the Yukon which flows into the Pacific far north. Three hundred miles from the sources of the Pelly, Fort Selkirk was established, and the river was explored by Campbell 700 miles to Fort Yukon, established in 1846 by J. Bell of the Hudson's Bay Company, 150 miles within the Alaska boundary. From Fort Yukon, situated almost directly on the Arctic circle and about 145° W. longitude, Mr. Campbell ascended the river Porcupine to its eastern sources, crossed the height of land to Peel River, a small tributary of the Mackenzie, not far from its outlet in the Arctic Ocean. Following the tributary to the main stream, he ascended Mackenzie River to Fort Simpson, his starting point at the mouth of the Liard.\n\nIn 1852-53 Mr. Campbell made a remarkable journey from the Yukon territory to England. He left White River, near the Alaskan boundary, on September 6th, ascended the Pelly to one of its sources, crossed the mountains to a branch of the Liard, which he followed to Fort Simpson, at which place he arrived on October 21st. Winter having set in, he started on snowshoes to make a journey to Crow Wing, on the Mississippi, extending over three months, as he had done in crossing Canada from Chicago. He dispensed on the way, and had been habituated of very late date. Considerable are the Adirondack and Franconia.\n\nPacific coast, the range of the Hudson's Bay Company, long before the mountains were ended.\n\nof the Porcupine river, and thence to the Mackenzie and Peel rivers, the latter being the source of the Mackenzie.\nover sixteen degrees of latitude and twenty-seven degrees of longitude. He had with him three men and a train of dogs; these were changed at the Hudson's Bay posts on his route as he arrived at them. His course lay by Great Slave Lake, Lake Athabasca, Île à la Crosse, Carlton House, Fort Pelly, Fort Garry and Pembina. On March 13th, Mr. Campbell reached Crow Wing, where he obtained horses for the journey to Chicago. From Chicago he started eastward and arrived at Montreal on April the 1st, and such was his dispatch that he was enabled to report himself in London at the Hudson's Bay House on the 18th of that month. From his starting point on the Pelly-Yukon, Mr. Campbell had made a continuous journey of 9,760 miles, nearly half of which was through an uninhabited wilderness, and of this distance some 3,000 miles were passed over in the dead of winter and much of it walked on snow-shoes. In the annals of the Hudson's Bay Company's service, long winter journeys under circumstances similar to the one described are not uncommon. Possibly the long tramps of the intrepid Dr. Rae in 1851, and of Admiral Sir Leopold, then Commissioner, McClintock, in 1853, both in connection with the Franklin Search expeditions are to some extent comparable with them.\n\nMr. Campbell, the discoverer of the Pelly-Yukon, the largest river flowing into the Pacific from the American continent, is still living, and enjoys excellent health, on his ranch in Manitoba. He is one of the last representatives of the great explorers of the Hudson's Bay Company under the old regime. His name comes close to the end in the long list of active and undaunted men who, from the days of Mackenzie, traversed the mountains, and unknown wilds; it would be difficult to find their peers in courage and endurance in any service.\n\nIn 1887-88 the field of Mr. Campbell's discoveries was visited by Dr. G. M. Dawson, of the Geological Survey. Dr. Dawson entered the interior from the Pacific coast by the river Stikeen, passed over to the Liard, and thence to the Pelly-Yukon. He returned by the river Lewis to the Lynn canal on the coast. The journey proved exceedingly fatiguing and not a little perilous. His associates, Messrs. McConnell and Ogilvie remained in the district to carry on astronomical observations and field explorations during the following winter and summer.\n\n(13) Sir George Simpson's Journey round the World, 1841.\n\nSir George Simpson having resolved to travel round the world, left England on March 3rd, 1841, and landed at Boston, whence he made his way to Montreal. His outfit was completed at Lachine, the headquarters of the Hudson's Bay Company in Canada. The expedition started from that village on 4th May; on the 16th of the month the party arrived at Sault St. Mary. After some detention by ice on Lake Superior, Sir George reached Thunder Bay; and ascended by the Kaministiqua to the height of land. He traversed the chain of lakes and rivers to Lake of the Woods, and arrived at Fort Alexander, near the mouth of the river Winnipeg on June 8th. On the third day following, Sir George Simpson was at Fort Garry, having accomplished the journey of 2,000 miles in thirty-eight days.\n\nThere was an ordinary trail from Fort Garry to Edmonton. It passed from point to point across the prairie, and was used by the Red River carts for the transportation of merchandise. It was not always in good condition, but was easily followed along the\nbanks of the Assiniboine to Fort Ellice, thence to Fort Carlton, Fort Pitt and Edmonton. On July 23rd, Sir George left Edmonton, taking a south-western course. He crossed Battle River and Red Deer River and two branches of Bow River. Ascending by a tributary of the latter, he gained the height of land at the Kananaskis pass in about 50° 36' latitude. Descending a tributary of the Kootenay to the main river of that name, the party directed its course to Kulispelm Lake, the source of Pend d'Oreille River which was followed to the Columbia.\n\nAt no great distance, south of the present boundary line, the then Hudson's Bay post of Fort Colville was situated. \"Here then,\" writes Sir George, \"terminated a long and laborious journey of nearly two thousand miles on horseback, across plains, mountains, rivers and forests. For six weeks and five days we had been constantly riding, or at least as constantly as the strength of our horses would allow, from early dawn to sunset, and we had, on an average, been in the saddle about eleven hours and a half a day. From Red River to Edmonton, one day's work with another amounted to about fifty miles, but from Edmonton to Colville, we more generally than otherwise fell short of forty.\"\n\nFrom Fort Colville, the Columbia was descended by canoe. The travellers passed the Company's post of Okanagan and reached Fort Vancouver. From Fort Vancouver, Sir George crossed to Puget Sound, where, on September 6th, he embarked on board the company's steamer the \"Beaver,\" and passed up the Strait of Georgia on a tour of inspection to the various trading ports. He proceeded as far north as Sitka, and reached the quarters of the Russian America Company at New Archangel. He left on September 30th, and returned to Fort Vancouver, whence he travelled to San Francisco, Monterey and St. Barbara. The latter place he left on January 27th, to visit the Sandwich Islands. He returned to Sitka, whence he took ship to continue his remarkable journey. In the voyage he skirted Kamchatka to reach a more western point on the Asiatic coast. He traversed Siberia to gain western Russia, and at St. Petersburg embarked for England. This portion of his journey has no bearing upon his passage across the American continent, but it is worthy of mention as indicating the energy of character and tenacity of purpose which characterized the man.\n\nPeriod II.—From Oregon Treaty in 1846 to Confederation in 1867.\n\nThe Oregon Treaty of 1846, with the United States, and the passage of the Imperial Act, establishing the Dominion of Canada, form epochs of great importance in the history of the northern half of North America.\n\nThe first for ever settled an international dispute which had existed for a quarter of a century, and had awakened feelings on both sides of bitter hostility. It was a turning point in the career of the Hudson's Bay Company; the commencement of a series of events owing to the influence of which the old regime was to pass away. The second was the genesis of a new order of things. It gave birth to Canada as a Dominion, with a national status and with a territory of semi-continental magnitude.\n\nThe time which intervened between the Oregon Treaty and the establishment of the Dominion by the British North America Act may be considered as a period of transition. During these twenty-one years we have records of at least eight expeditions from the\nSt. Lawrence to the western side of the Rocky Mountains. These expeditions, and the objects in view, no longer partook of the character which distinguished the explorations and journeys undertaken during the preceding half-century. The Hudson's Bay Company and its officers ceased to be exclusively and actively connected with them.\n\n(1) Mr. Paul Kane's Travels, 1846—1848.\n\nMr. Paul Kane, of Toronto, had studied art in Europe, and returned to Canada with the determination to devote his time and talents to the completion of a series of paintings illustrative of Indian life and character.\n\nMr. Kane obtained an interview with the governor of the Hudson's Bay Company, Sir George Simpson, who entered cordially into the project, and gave directions to the company's officers to facilitate the artist's movements in every way. He set out from Toronto in May, 1846, his design being, whenever an opportunity offered, to make portraits of the principal chiefs in their native dress, and characteristically to represent on canvas the Indian tribes and the scenery of the almost unknown country.\n\nMr. Kane was enabled to travel to the Northwest with a brigade of canoes of the Hudson's Bay Company, which he joined on Lake Superior. About midsummer he reached Red River; he passed northerly by Lake Winnipeg to the Saskatchewan, which river he ascended to Edmonton. Early in October he left Edmonton, passing by way of Fort Assiniboine, on the Athabasca, to Jasper House; thence he crossed the mountains by the Athabasca Pass to Columbia River, down which stream he made a rapid descent of fifteen days to Fort Vancouver, reaching that place on December 8th.\n\nFort Vancouver, on his visit, contained two chief factors, ten clerks, and two hundred voyageurs. The fort was further enlivened by the presence of the officers of H.M.S. \"Modeste,\" which had been on the station for two years.\n\nThe artist remained at Fort Vancouver until the beginning of January, when he proceeded southward some distance up the river Willamette. He then found his way northward to Puget Sound and Vancouver Island. Here, among various Indian tribes, he spent the summer of 1847. In the autumn he returned to the Columbia, and by the ascent of that river, the route usually followed, he reached Edmonton in December, meeting with hardships and suffering on the journey owing to the lateness of the season. The following spring Mr. Kane passed down the Saskatchewan. At Cumberland House, on June 12th, he met Sir John Richardson and Dr. Rae on their way to Mackenzie River in search of Sir John Franklin. He reached Toronto early in October, 1848.\n\nA full account of Mr. Kane's journey and experience is graphically given in a volume published in 1859, \"Wanderings of an Artist among the Indians of North America, from Canada to Vancouver Island and Oregon.\" Some of Mr. Kane's pictures are to be seen at the Speakers' residence, in the House of Commons, Ottawa; the greater number of them are in the private collection of Senator Allan, Moss Park, Toronto.\n\n(2) Travels of Earl of Southesk, 1859-1860.\n\nIn the spring of 1859, the Earl of Southesk accompanied Sir George Simpson by way of St. Paul, Minnesota, to Red River. He left Fort Garry in June on an expedition to the\nmountains; the route followed was the trail to Edmonton. From Edmonton he proceeded westward to the river McLeod, which he ascended into the heart of the mountains. In gaining the height of land, he followed the eastern slope of the mountains to the sources of Bow River, which he descended until he met the Edmonton trail which Sir George Simpson passed over in 1841, and which Lord Southesk followed. Returning by way of the North Saskatchewan, Fort Carlton and Pelly, he reached Fort Garry in January, 1860. From Fort Garry he passed by way of Minnesota to New York and took passage for England. In 1875 a volume was published with a narrative of Lord Southesk's travels and adventures.\n\n(3) Explorations of Captain Palliser and his Associates, 1857—1860.\n\nThe explorations of Captain Palliser took place in 1857-60, under instructions from the Imperial Government. He ascended the St. Lawrence, and traversed the lakes to Fort William, where his examination may be said to have commenced. He was assisted by several well known scientific men, among whom may be named Dr. Hector and Lieutenant Blokiston, Mr. John W. Sullivan and M. Bourgeau. The examinations made by the expedition extended from Lake Superior to the Okanagan Lakes in British Columbia, and from the frontier of the United States northward to the sources of the chief rivers which flow to the Arctic Ocean.\n\nIn the summer of 1857, the attention of Captain Palliser was directed to that portion of the country lying between Lake Superior and the prairies. The examination was continued up Red River to Pembina, up the Assiniboine to Fort Ellice, and up the Qu'Appelle to the elbow of the South Saskatchewan thence across the country to Fort Carlton on the North Saskatchewan. The members of the expedition arrived at this place in October, and their winter quarters were established here. From Fort Carlton, Captain Palliser started for Fort Garry, the United States and Canada, to return the following spring. Dr. Hector made a winter journey from Fort Carlton up the North Saskatchewan to Fort Pitt, Edmonton and Rocky Mountain House. He also penetrated the first range of mountains.\n\nAt the commencement of the summer of 1858, the various branches of the expedition set out from Carlton to examine the Eagle Hills, Battle River, Red Deer River and Bow River districts. The latter stream was followed to the mountains along the route on which the Pacific Railway is today constructed. The Vermilion and Kananaskis passes were examined and the sources of Kootenay River reached. Dr. Hector returned by Kicking Horse River, and explored in the general direction of the mountains to the Brazeau range, and from the sources of the North Saskatchewan he followed the course of that river to Edmonton. Traces of the wearisome journeys, made by him in this and the following years, are everywhere to be met by the railway traveller in the names of mountains and rivers between Calgary and the Columbia. Captain Palliser extended his journey to the boundary of the United States, and returning northerly reached Edmonton in September. Dr. Hector reached that post in October.\n\nIn January, 1859, Dr. Hector left Edmonton on a journey to the mountains. He made his way by the usual means of travelling in winter to Jaspar House, thence to the Athabasca pass. Returning to Edmonton in April, he immediately left for Fort Pitt. Captain\nPalliser started May for the forks of the South Saskatchewan and Red Deer River, and thence to the district near the United States boundary. He crossed the mountains by the Kootenay pass, followed Kootenay River to Fort Shepherd and Fort Colville; and from Fort Shepherd he made excursions to the westward. On reaching Fort Colville, Dr. Hector descended the Columbia to the sea.\n\nThe reports of the Palliser expedition, presented to the Imperial Parliament in 1863, furnish detailed narratives of the explorations undertaken by the several branches of the survey, with maps showing the routes followed from Lake Superior to the mountains and likewise through the mountains. These documents contain much scientific and general information respecting the central prairie regions, and they throw light on an immense territory previously but little known. The information furnished by this expedition gives indication of the great agricultural and industrial possibilities of vast areas of the interior of British North America. Captain Palliser's report is also remarkable for his adverse recommendation to the British Government in respect to opening up the country for settlement, and for the positive opinion given by him as to the impracticability of constructing a railway through British America to the Pacific. He considered that the whole prairie region north of the 49th parallel was completely isolated and practically unapproachable both from east and west.\n\n(4) Journey of Mr. M. Lawrin, 1860.\n\nMr. M. Lawrin, an old miner, left the forks of Quesnelle, in the Cariboo country, on August 15th, 1860, to cross the mountains to the east. His party consisted of four persons besides himself, and they carried away with them $1,600 in value of the precious metal from the Cariboo \"diggings.\" The little party ascended Fraser River by canoe to its source at Yellow Head Lake. Abandoning the canoe as it could be of no further use, they crossed the Rocky Mountain \"divide\" at the Yellow Head pass, to the rivers Miette and Athabasca, following the latter to Jasper House; proceeding by the trail they found their way to Edmonton and Fort Garry, and finally reached St. Paul, on the Mississippi.\n\n(5) Journey of Dr. A. P. Reid and others, 1861.\n\nSo far, we have had no record of any party or person, other than the officials and explorers of the Hudson's Bay Company entering British Columbia by the Yellow Head or Athabasca passes. Immigrants, attracted by the gold discoveries, generally reached the\n\n---\n\n\"I therefore cannot recommend the Imperial Government to countenance or lend support to any scheme for constructing or, it may be said, forcing a thoroughfare by this line of route either by land or water, as there would be no immediate advantage commensurate with the required sacrifice of capital; nor can I advise such heavy expenditure as would necessarily attend the construction of any exclusively British line of road between Canada and Red River settlement.\" Palliser's Report, p. 6.\n\n\"Still the knowledge of the country, on the whole, would never lead me to advocate a line of communication from Canada across the continent to the Pacific, exclusively through British territory. The time has now forever gone by for effecting such an object, and the unfortunate choice of an astronomical boundary line has completely isolated the Central American possessions of Great Britain from Canada in the east, and also almost debarred them from any eligible access from the Pacific coast on the west.\" Ibid., p. 6.\n\nSee, II, 1889, 16.\nfamed Fraser River by the sea. The few who went overland from the east, struck away from the Saskatchewan to the southward of the international boundary, and entered either by Fort Colville and Portland, or by Fort Colville and Similkameen. Dr. A. P. Reid and five others started to find their way by one of these routes. They left Fort Garry on June 13th, 1861; they travelled by way of Fort Elllice, Carlton, Fort Pitt and Edmonton; turning southward, they crossed Bow River and, by a southern pass, reached Kootenay River. They were weak in numbers and had only an imperfect idea of the difficulties of the route; in consequence, they suffered much hardship, fell short of food, and reached Fort Colville in great distress on November 26th.\n\n(6) Migration of a large party of Canadians, 1862.\n\nThe discovery of gold on the Fraser exercised a powerful influence on the history of British Columbia; so that in 1860 a considerable population had assembled within the province, all, or nearly all of whom, was engaged in mining. The first rush to the gold mines was in 1858; the rich discoveries made in 1861 on William's Creek, caused a second immigration. The excitement resulting from the bountiful presence of the precious metal extended in all directions, so that men gathered from every quarter. In 1862 it influenced many adventurous natures in Ontario to visit the scene of the discovery, in the hope of bettering their fortunes. Many hundreds went round by Panama. A large company was formed to find its way overland; it consisted of 193 men, made up of detachments from Queenstown, St. Thomas, Huntington, Ottawa, Toronto, London, Montreal, Huron and a few from Ogdensburg. They left their homes during the month of April, to rendezvous at St. Paul, Minnesota. From St. Paul they proceeded, by Burbank's stages, to Red River, which they descended, by the steamer \"International,\" to Fort Garry.\n\nAt Fort Garry they completed their organization for the journey. Their number was increased to two hundred by the addition of seven persons from the Red River settlement, among whom were Mr. and Mrs. Schubert and three small children. The expedition left Fort Garry on June 2nd; it formed a train consisting of about ninety Red River carts, each drawn by an ox. There were also about fifty saddle horses with the party. The journey across the plains was necessarily slow, and they only came in sight of Fort Edmonton on July 24th, having accomplished some 900 miles of their journey from Fort Garry, without any serious hardships having been encountered.\n\nAt Fort Edmonton they exchanged the carts for pack saddles, and left for the mountains on July 29th. Their route was by the ordinary trail, imperfectly defined, through forest and swamp to Jasper House, and thence up the valleys of the Athabasca and Myette to the Yellow Head pass, where the river Fraser takes its rise; following which they reached Tête-Jaune-Cache on August 28th. Here those constituting the party were unable to decide as to the route they should follow. It was finally agreed to divide into two parties, each division to act independently of the other and follow the direction it might select. Both of them left Tête-Jaune-Cache on the same day, September 2nd. The larger number made rafts by which they descended the Fraser, which at this point flows north-westerly. Those who trusted to the river had many mishaps and underwent suffering, but they arrived at the mouth of the Quesnel on September 14th. They lost\nthree men by drowning, Robertson, Carpenter and Leader; another died, a young Englishman named Patterson, who succumbed to exposure, and was buried at Fort George.\n\nThe second division of the party, about sixty in number, endeavoured to cross the mountains in a westerly direction to Cariboo, but they were deterred by the immense labour experienced in forcing a passage across the mountains and the difficulty of penetrating through the heavy timber in the valleys. They turned in a southerly direction, and succeeded in reaching the North Thompson. They here constructed large rafts to descend the stream. They killed some of their horses, and \"jagged\" the meat, cutting it in strips and drying it. The remainder of the horses, about forty or fifty, they abandoned, and putting all their effects on the rafts, they proceeded to descend the swift current of the river. As they approached what is called the Grand Rapid, at the head of the fifteen-mile canyon of the Thompson, the leading raft was engulfed in the torrent before those navigating it were aware of the danger; and two men were drawn within the rapids and drowned. The rafts which followed avoided the fate of that before them; by great effort those on board reached the shore in safety, and, with labour and difficulty, forced their way up the precipitous banks. They managed to chamber along the cliffs to the lower end of the canyon, where they formed a second set of rafts and proceeded to shoot the lower rapids; they arrived eventually in great distress at Kamloops on October 11th. On the following morning, Mrs. Schubert—who accompanied this branch of the expedition—gave birth to a daughter! The two men drowned in the Thompson were Wm. Strachan, of London, Ontario, and Frank Penwarden, of St. Thomas.\n\nOf the 193 who left Ontario in 1862, the survivors now resident in British Columbia, as far as known, are J. A. Mara, Mr. and Mrs. Schubert, A. McNaughton, John Bowron, W. Fletcher, D. Simpson, Robert Heron, R. B. McMicking, W. H. Thompson, W. McKenzie, W. Halpenny, Geo. C. Tunstall, D. McQuarrie, R. H. Alexander, Capt. Redgrave, A. McConnell, J. B. McQueen, W. Fortune and J. Fannin, curator of the Provincial Museum at Victoria. The four last named, with Mr. and Mrs. Schubert, came down by the Thompson. The writer is chiefly indebted for information to Mr. Fannin.\n\nThere is a record of a third party which, late in the autumn of 1862, arrived at the Yellow Head Pass. It consisted of three brothers named Rennie and two men named Helstone and Wright. They obtained canoes from the Shuswap Indians to descend the Fraser. The canoes being found bottom upwards with the effects of the men strewn along the banks, led to the belief that they had been drowned. The terrible fate of three of the men became afterwards known. In the descent of the river the men had lashed the canoes together for safety, but they were swamped in a rapid; two of the Rennies gained the shore, the other three men succeeded in reaching a rock. An attempt was made during two days to rescue them. Finally they were hauled ashore, prostrate with fatigue and hunger, and from the frost which prevailed at night, they were so frost-bitten as to be unable to proceed. The two who retained their strength, cut a large quantity of firewood, and, leaving as much of the provisions as they could spare to their comrades, who were to remain behind, they started to obtain help at Fort George, which they imagined to be nearer than was the case. It was not until the twenty-eighth day that they arrived at the fort, frost-bitten, half-dead with hunger and fatigue. Some Indians were at once\n\n---\n\n1The child born on this occasion is now the wife of a well-known settler in British Columbia.\ndespatched to rescue the unhappy men left behind. They returned in a few days, explaining that, owing to the depth of the snow, they were unable to proceed. The writer will leave Dr Cheadle to relate the conclusion of this painful narrative.\n\n\"Other Indians, however, discovered the party some time afterwards. Helstone and Wright were still alive, but, maddened by hunger, had killed Rennie. When they were found they had eaten all but his legs, which they held in their hands at the time. They were covered with blood, being engaged in tearing the raw flesh from the bones with their teeth. The Indians attempted to light a fire for them, when the two cannibals drew their revolvers, and looked so wild and savage that the Indians fled and left them to their fate, not daring to return. The following spring a party of miners, on their way to Peace River, were guided by Indians to the place where these men were seen by them. The bones of two were found piled in a heap, one skull had been split open by an axe, and many of the other bones showed the marks of teeth. The third was missing, but was afterwards discovered a few hundred yards from the camp. The skull had been cloven by an axe, and the clothes stripped from the body, which was little decomposed. The interpretation of these signs could hardly be mistaken. The last survivor had killed his fellow-murderer and eaten him, as shown by the gnawed bones, so carefully piled in a heap. He had in turn probably been murdered by Indians, for the principal part of the dead man's property was found in their possession.\" (p. 322).\n\n(7) Travels of Lord Milton and Dr. Cheadle, 1862—1863.\n\nNo Pacific expedition has attracted greater attention than that of Lord Milton and Dr. Cheadle; that such was the case may be attributed to the literary ability with which the narrative was written. The travellers arrived at Quebec in the spring of 1862, and made their way, without loss of time, to Red River, but not without some of the unpleasant incidents of such a journey, common enough a quarter of a century back. They narrowly escaped being involved in the massacre, by the Sioux, of the settlers in Minnesota, through which State they passed; and in their canoe voyage down Red River they had to undergo serious privation and incur danger.\n\nThey left Red River to proceed to Edmonton, but the season being late, they decided to winter at White Fish Lake, eighty miles beyond Carleton. They reached Edmonton in May, 1863. Here they were advised against following the route by the Yellow Head pass, but the Canadian party, the preceding year, having travelled by it, they determined to follow the trail which so large a party must have left the traces.\n\nThey started from Edmonton on June 8th, 1863. They had with them an Indian, known in the narrative as \"the Assiniboine\"; he was accompanied by his wife and their son, a boy of thirteen. The Assiniboine had but one hand; nevertheless he was an excellent hunter, of undaunted courage and unfailing resource. The guide, Baptiste, whom they had engaged, with a \"Mr. O'B.\", completed the party, which thus consisted of seven persons. The latter individual had drifted westward to Edmonton, possibly with the Canadian party. He was a Cambridge man, with a good knowledge of classics, but the most shiftless and useless of human beings. No one could have been more out of his element, on such a journey. Mention of him threw doubt upon the narrative, but the\nwriter of this paper, from information obtained at Edmonton and British Columbia in 1872, can testify that Mr. O'B was not a creation of fancy, but that he existed in the flesh.\n\nAt the elbow of McLeod River, Baptiste deserted, but the journey was persevered in. The travellers experienced great difficulties, and suffered the hardships incident to a journey through that rugged country; possibly the obstacles would not have been found so trying to men experienced in backwoods life. They continued on the trail of the travellers of the previous year, and on June 29th reached Jasper House. On July 15th they were at the Yellow Head pass. Occasionally they lost the trail, but the intelligence of the Assiniboine invariably regained it.\n\nThey had no definite objective point in British Columbia, and had considered it advisable to follow the route taken by the Canadians, as the trace of it was not wholly obliterated. At Tete-Jaune-Cache it led them to the southward, where the timber became heavier, the obstruction greater, and the route more difficult to follow. Finally they arrived at the spot where the Canadians had made rafts to descend the Thompson, and from this point they were compelled to proceed over untrampled ground.\n\nThey could not retreat or leave the deep valley they had entered, so they continued to follow the river. Their hardships and great privations now really commenced, and except for the indomitable spirit which sustained them, and the resources of the Assiniboine, they must have succumbed. Those familiar with their published narrative, may remember their account of the headless Indian sitting upright as a mummy, with a tattered blanket, by the dead ashes of a fire, with the bones of a horse and a few utensils beside him. The sight came upon them all as a painful warning of what might be their own fate, a slow death by starvation. They were, however, sustained by the hope that they would ultimately reach some settlement. Soon afterwards they were disheartened by the one hand of the Assiniboine becoming disabled. The woman took her husband's place in cutting out the way. They passed the first three weeks of August in the struggle to advance, worn out with fatigue, weak from want of food, and with the prospect before them of death by hunger. They killed their two horses one after the other to supply their want. Pressing forward day by day, on August 14th they came on the traces of human beings. Some bushes had recently been cut, a few \"blazed\" trees succeeded, and they met some Indians who gave them food. Their prowess in eating astonished even the Indians, who are not given to surprise at all of this description.\n\nFinally they reached Kamloops, and for some days the whole party could think of nothing but eating. From Kamloops they found their way to New Westminster and Victoria. They returned to the mainland and passed up to Lillooet, Quesnel and Richfield, to visit the Cariboo gold-diggings.\n\nLord Milton and Dr. Cheadle returned to England by the way of California, Panama and New York. A narrative of their adventures appeared in 1865, \"The North-West Passage by Land,\" which has passed through several editions.\n\n---\n\n1 The reader is referred to Mr. Grant's book, Ocean to Ocean, p. 235, where the record is made of the burial of these remains, June 5th, 1872. The head was found 650 yards up the bank of the river. The skull was brought to Ottawa, and was lost in the fire of the Canadian Pacific Railway offices in the following year.\nThe year following the expedition of Milton and Cheadle, Dr. John Rae, already distinguished as an Arctic traveller, undertook an overland journey to the Pacific. From the east he found his way to Fort Garry, arriving there on June 16th, 1864, and leaving on the 26th he took the route by Fort Pelly to Edmonton. On August 7th he reached the river McLeod, whence he passed to the Athabasca. Following the route taken by Milton and Cheadle, through the Yellow Head pass, he arrived at Tête-Jaune-Cache on August 23rd. Here his Indian guides, having heard of the extremely dangerous character of the rapids, refused to descend the Fraser.\n\nDr. Rae resolved to proceed without the Indians. He succeeded in purchasing two small dug-out canoes from the Shuswaps, a few of whom he met at this place, and accompanied by Richard Turner, Henry Mackenzie and a third man, he left Tête-Jaune-Cache on August 27th. On the fourth day of their descent they reached a dangerous rapid at which there are two portages of considerable length. It was known that disasters had occurred on this part of the river, but all the members of the party were experienced canoe men, and Mackenzie, with great courage, led the way in the smallest canoe. On the 31st, they ran another dangerous rapid many miles long, in which several men had been drowned in previous years. On September 1st they reached Fort George. From the ill-omened reputation of the section of the river above that station, their safe arrival caused astonishment to the chief trader, Mr. Charles; for it had been thought that, owing to the intricate and dangerous navigation, no stranger unaccompanied by a guide could successfully make the descent.\n\nOn September 3rd, Dr. Rae left Fort George, taking with him an Indian guide and one white man. They made the descent to Quesnel, nearly a hundred miles, in one day. On the 4th, accompanied by one man, he paddled down to Alexandria, a distance of thirty-five miles, in less than five hours. From Alexandria, he followed the road to Kidfield, the centre of the mining district. Returning to Alexandria, he obtained horses, and rode to Yale, where he took the steamer to New Westminster.\n\nPeriod III.—From Confederation to Completion of Canadian Pacific Railway in 1885.\n\nAn important change in the annals of Canada begins with the British North America Act. By the Imperial statute, the several British Provinces eastward of Lake Superior were united to form one confederation, and at the same time provision was made for the occupation of the Northwest Territory and the entrance of British Columbia into the Dominion. The union of the Pacific province with the provinces in the eastern part of the continent, necessitated the establishment of a line of communication between them, and the construction of the Canadian Pacific Railway was the consequence. The act of union passed the Imperial Parliament and came into force in 1867; British Columbia entered the Confederation in 1871. Between these dates the Government of Canada purchased the territorial rights of the Hudson's Bay Company. In consequence of the policy adopted to carry out the conditions of the union, there has been a succession of expeditions to the new British Columbia, most of which were railway surveys.\nnew province on the Pacific. Within a period of fourteen years from the entrance of British Columbia into the Dominion, we have a record of eighteen overland journeys, most of which were undertaken in connection with the establishment of the national railway.\n\n(1) Sir Hector Langevin's visit to British Columbia, 1874.\n\nA journey was made to British Columbia by Sir Hector Langevin. It does not strictly come within the list of Canadian overland expeditions, inasmuch as it was made by railway through the United States to San Francisco, thence by steambout to Victoria. It is chiefly remarkable as the first journey undertaken by a Canadian minister to the newly acquired western province of the Dominion. In the summer of 1874 the Minister of Public Works visited the Pacific coast on behalf of the Government, with the view of acquiring some information concerning the new province, especially in relation to the Pacific Railway and its western terminus. His duty was to enquire into the requirements of the western province, and personally to ascertain what public works were imperative. To fulfil the mission assigned him, he visited Victoria, New Westminster, and extended his observations by proceeding to Yale, Lytton, Cariboo, and other localities in the interior of the country. He also made an examination of Bute Inlet, Burrard Inlet, Barclay Sound, Nanaimo, and other points on the coast. Sir Hector Langevin on his return to Ottawa, issued a volume containing an account of his journey and observations, in which was included much valuable statistical information.\n\n(2) Expedition of Mr. Sandford Fleming, 1872.\n\nEarly in 1871 the writer of this paper was appointed engineer-in-chief of the Canadian Pacific Railway. At that time but limited knowledge had been obtained of the immense extent of territory to be explored; and the opinions, which were current regarding it, were not in favor of the possibility of constructing a railway. In 1863 the Home Government presented to Parliament \"the journals, detailed reports, and observations relative to the explorations by Captain Palliser of that portion of British North America which lies between Lake Superior and the Pacific Ocean, during the years 1857, '58, '59 and '60.\" In these documents the opinion had been strongly expressed that the impediments to railway construction were insuperable.\n\nOn January 24th, 1871, the Legislative Council of British Columbia unanimously passed an address to the Queen, praying Her Majesty to admit British Columbia into the Dominion of Canada upon the terms previously arranged. One of the essential conditions was the establishment of a railway \"to connect the sea-board of\n\n---\n\nReport of the Minister of Public Works to the Canadian Parliament, 1875, p. 54. \"It is but ten years since that Captain Palliser, in his report to the Imperial Government, declared the utter impossibility of finding any communication through Canadian territory. . . . This deliberate and forcibly expressed opinion, the result of four years labour in the field, of a man of eminence, aided by assistants of equal culture, ability and energy, may, with propriety, be quoted to show the formidable difficulties to be overcome in the Pacific Railway line. Difficulties which, until the last three years, have been held to be insuperable, and the solution of which calls for unremitting labour and thought.\"\nBritish Columbia with the railway system of Canada.\" The Canadian Government accordingly considered it advisable that the whole distance should be carefully explored, and the writer was instructed to make the necessary organization to carry out the work. The examination was commenced in the summer of 1871 and was continued during the following winter. A large number of surveying parties were engaged between the valley of the Ottawa and the Pacific coast, and in 1872 it became necessary to undertake a general reconnaissance and tour of inspection across the continent.\n\nPrevious to starting on the expedition, the writer, as chief engineer of the Intercolonial Railway, then under construction, had to make an examination of that line; this duty necessitated his presence in Nova Scotia. Accordingly his western journey commenced at Halifax.\n\nGreat interest being felt with regard to the surveys, it was considered advisable to make known to the public as far as was expedient, the information obtained, so that the problem which the Dominion had undertaken to solve could be the better understood. The writer had the good fortune to induce the Rev. G. M. Grant, of Halifax (now Principal Grant, of Queen's College, Kingston), to accompany the expedition as secretary, with the view of publishing a narrative of the journey.\n\nLeaving Halifax on July 1st, 1872, the party arrived at Thunder Bay, Lake Superior, on July 22nd, and Fort Garry, on July 31st. The plains were crossed to Edmonton, which place was reached on August 27th. At Edmonton a detachment consisting of Messrs. Horetsky and Macoun, was despatched by way of Peace River to the Pacific coast. The main party proceeded to Jasper House, crossed the mountains by the Yellow Head Pass to Tete Jaune Cache, and passed southerly by way of the North Thompson to Kamloops, where they arrived on September 28th. From Kamloops they followed the government road to Yale, the head of navigation, and by steamboat reached New Westminster.\n\nAfter crossing the mountains by the Peace River pass, Mr. Macoun passed down the Fraser to its mouth. Mr. Horetsky found his way to the river Skeena, and arrived at Port Simpson, on January 23rd, 1873.\n\nThe writer extended his examination to various points in British Columbia, and returned to Ottawa by way of San Francisco. Full details are given in the Canadian Pacific Railway Report submitted to Parliament. A narrative of the journey by Dr. Grant was published the following year.\n\n(3) Expedition of Adjutant-General P. Robertson Ross, 1872.\n\nIn July, 1872, Colonel P. Robertson Ross, Adjutant-General of Militia, left Ottawa for the Northwest Territory. His route was by Toronto, Collingwood, and the lakes to Port Arthur. Following the old canoe route to Lake of the Woods, he reached the road to Fort Garry, then lately opened. After visiting Pembina he proceeded to Fort Ellice, Carlton, Victoria to Edmonton and Rocky Mountain House. From this point he passed southward to the Blackfeet country and crossed the Rocky Mountains by the North Kootenay Pass. In his narrative, published in the Militia Report for 1872, he gives\n\n---\n\n1 Ocean to Ocean. Sandford Fleming's Expedition through Canada in 1872. By the Rev. George M. Grant.\nhis views as to the number and character of the Indians in the country traversed. Colonel Robertson Ross reached Wild Horse Creek, on the west side of the main range of mountains, and proceeded southerly via Moyais River, Lake Pend d'Oreille, the Spokane and Snake Rivers to Walla Walla and Walula, in Washington Territory, U.S. The portion of the journey across the mountains was tedious and fatiguing. From Walula he descended the Columbia to Portland, and thence passed northward via Olympia and Puget Sound to Victoria, in Vancouver Island, where he arrived on October 28th. Remaining about two weeks in British Columbia, he returned through the United States by way of San Francisco, and by railway to Chicago and Ottawa.\n\n(4) Travels of General Sir W. F. Butler, 1872-1873.\n\nGeneral, then Captain, W. F. Butler left England in 1872, and travelled by way of Minnesota to Red River. He found the village of Fort Garry, afterwards to be known as the city of Winnipeg, under the excitement of an election, the first which had taken place. On October 4th he left for the Northwest. Reaching the forks of the Saskatchewan his intention being to make this place a central point from which the buffalo could be hunted, he remained in this neighbourhood until February, when with a dog-train he started for the west and reached Fort Carleton. On the 11th of that month he left Fort Carleton and passed by the way of Methye portage, the river Athabasca and Athabasca Lake to Peace River. He ascended the Peace River valley, followed the Finlay or North Branch to Ominica, and ascended a western tributary to Germanusen. From Germanusen he passed overland to Fort St. James. Leaving this point on May 25th he travelled southerly to Quesnel on the Fraser, where he arrived on June 3rd. At Quesnel he came within reach of the appliances of civilization to carry him to New Westminster. On his return to England, General Butler published an account of his travels entitled \"The Wild North Land, being the story of a winter journey with dogs across Northern North America.\"\n\n(5) Expedition of the Boundary Commission, 1872-1874.\n\nThe boundary between British North America and the United States, as described in the Treaties of 1818 and 1846, had been in previous years defined and traced from the Atlantic westward to Lake of the Woods, and from the Pacific eastward to the crest of the Rocky Mountains. There remained to be marked out the intervening distance. In 1872 the British and United States Governments appointed a joint commission to trace the line from Lake of the Woods to the summit of the mountains. The British commissioner was Major-General, then Major, D. R. Cameron, R.A. Mr. Archibald Campbell acted in that capacity for the United States. A staff of scientific officers of both nations with mounted escorts were detailed for the service.\n\nThe field operations were begun at Lake of the Woods in the autumn of 1872 and prosecuted to completion during the two following years. A topographical survey was made of the belts of country five miles wide on each side of the line. Iron monuments were planted from longitude 96° to 99° at intervals of a mile; west of the latter point the line was marked by stone pyramids or otherwise at approximate intervals of three\n\nSec. II, 1889. 17.\nmiles, to the summit of the Rocky Mountains, where the line joined that which had been established from the Pacific coast by a similar commission thirteen years earlier.\n\nThe boundary line for the greater part of the distance passed through open ground; where forest land was encountered the trees were cut down and a continuous open passage formed. Dr. G. M. Dawson accompanied the expedition as geologist and naturalist. On the completion of the field work, at the end of 1874, he reported the results obtained. The published volume consists of 379 printed pages, replete with information respecting the resources of the entire distance surveyed.\n\n(c) Journey of Messrs. Jarvis and Hannington, 1874-1875.\n\nThe overland exploration of Messrs. Jarvis and Hannington is worthy of record. They had been engaged in 1874 on a section of the survey of the Canadian Pacific Railway in British Columbia. It being deemed advisable to gain information respecting the Smoky River pass, Mr. E. W. Jarvis was selected for the duty, and at the beginning of winter he received instructions to begin exploration. On December 9th, 1874, with his assistant Mr. Hannington, he left Quesnel on the Fraser for Fort George, to complete his arrangements and obtain an outfit. So soon as the ice was frozen on the rivers, the party, consisting of eight men and six dog trains, started on the hazardous journey across the mountains. They left the Fraser above the Giscome portage, following the North Branch until it terminated in a cul de sac. They returned to ascend a second branch and finally reached the continental \"divide\" on February 25th. After leaving the summit, the dogs became unserviceable from frostbites and exhaustion, so that each man was compelled to carry on his back a share of the necessary supplies, leaving behind everything not absolutely required. They were also placed on short rations. The party crossed an extremely broken mountainous region intersected by tributaries of the Smoky and Athabasca Rivers. The snow was deep, the temperature low and the weather unusually stormy in the elevated region they passed over. They were on the verge of starvation and every member of the party suffered greatly from fatigue and exposure. Nevertheless they succeeded eventually in reaching Jaspar House on March 5th to find it unoccupied. They, however, in their exhausted condition were fortunate in meeting in the neighbourhood a band of Indians who supplied them with some provisions—all they could spare from their meagre store. The weary travellers continued their journey eastward over 200 miles to St. Anne, which they reached in twelve days. Here they found rest and food under the hospitable roof of a Hudson's Bay Company's establishment. From St. Anne they drove to Edmonton, thence to Fort Pitt and Carlton and arrived at Winnipeg on May 21st.\n\nThe journey from Fort George to Winnipeg occupied 116 days, the distance being 1887 miles, of which 932 miles were traversed on snow-shoes. The temperature was at times exceedingly low. For twenty consecutive days in January the thermometer averaged 37 degrees below zero. Mr. Jarvis' narrative of the journey is included in the Canadian Pacific Railway Report of 1877. Mr. Hannington's diary is given in the report of Canadian Archives for 1887 (pp. cx, cxxii).\n(7) Expedition of Major-General Sir Selby Smyth, 1875.\n\nIn July, 1875, Major-General Sir Selby Smyth, commanding the militia, made an official trip through the Northwest Territory. On the 2nd of the month he left Sarnia by steamboat for Duluth, Lake Superior, and proceeded to Fort Garry by Moorhead and Red River. He travelled on wheels to Shoal Lake, where he was met by a division of the Mounted Police, under the escort of which he went to Swan River and to Carlton. The party followed the trail to Fort Pitt, Victoria and Edmonton, thence to Battle River and Red Deer River. At Bow River General Smyth had a conference with the Blackfeet Indians. He passed to Fort McLeod and Old Man's River, a tributary of Bow River. When in this locality, he crossed the frontier to pay his respects to the general officer of the United States commanding in Montana, who was stationed at Fort Shaw. Returning to Fort McLeod he proceeded westward through the Kootenay pass to \"Joseph Prairie,\" where, parting from the Mounted Police, he travelled southward to Walla Walla. He was here met by General Howard of the United States army, hospitably entertained, and escorted for several days down the valley of the Columbia. His journey was continued to the city of Portland, and through Washington Territory to Puget Sound, where he took the steamer for Victoria, Vancouver Island.\n\n(8) Travels of the Marquis of Dufferin, 1876—1877.\n\nOn July 31st, 1876, the Marquis of Dufferin and Ava, then Governor-General of Canada, accompanied by the Marchioness, proceeded by the Central Pacific Railway to San Francisco. They were there met by H.M.S. \"Amethyst,\" and steamed to Victoria. Lord Dufferin was everywhere received with the respect due to his character and station. He visited Nanaimo, and after inspecting the coal mines, travelled northward to Bute Inlet, Skeena River, Queen Charlotte Islands, and arrived at Port Simpson. He returned south to Burrard Inlet. On September 6th he started up the stream of the Fraser; he reached Yale, and continued his journey to Kamloops. Returning to New Westminster, he again crossed the Strait of Georgia to Victoria, and performed the ceremony of driving the first pile of the Esquimalt graving dock. Lord Dufferin left by the \"Amethyst\" for San Francisco, and returned to Ottawa.\n\nThe following year Lord Dufferin proceeded, by the way of St. Paul, to Winnipeg, where he received addresses, and where festivities were interchanged. On September 29th he addressed a large assembly at the banquet given him. During his stay in Manitoba, Lord Dufferin went as far as the Mennonite settlement on Rat River. He also visited the Iceladie settlement, and proceeded up Lake Winnipeg in the steamer \"Colville\" to the mouth of the river Saskatchewan.\n\n---\n\n1 Although political digressions in no way come within the objects of this paper, the writer takes upon himself to refer the reader to Dr. Stewart's work on the administration of Lord Dufferin, in which his speeches on the occasion of this visit to British Columbia are preserved. The time was one of great excitement, and Lord Dufferin's political ability was never more apparent.\n(9) Journey of Mr. Marcus Smith, 1877.\n\nMr. Marcus Smith crossed the continent in 1877, on a tour of inspection of the Canadian Pacific Railway surveys. He had been engaged for some years in extended explorations in British Columbia, but on each of his former expeditions he travelled by San Francisco and the Union Pacific Railway. On this occasion he left Ottawa on May 24th, passed by the lakes to Port Arthur, thence by steamboat and railway, by St. Paul, to Winnipeg. On July 2nd he started from Winnipeg to cross the plains, by way of Fort Elllice. On the 26th he reached Fort Carleton; making a detour to Lac la Biche, he arrived at Edmonton on August 13th. Mr. Smith with his party followed the recently improved trail to Jasper House and Yellow Head pass, which point he reached on September 7th. Two days later he writes at Tete-Jaune-Cache, “Just as we were arriving, a man, W. Roxburgh, came running wildly towards us; he had been nearly two years in charge of that depot all alone, seldom having seen a human being, even an Indian, during that time. He had read all the books in his possession over and over again; had caught fish till he hated the sight of one; had tried gold-mining with a little success; had shot bears, one of which he only killed and seeing it crawling around the depot, he took pity on it and fed it; it came regularly, and at last grew so tame that it became his only friend and companion.” Mr. Smith continued his journey southward, by the rivers Albreda and North Thompson, to Kamloops. From this station he followed the ordinary route to Yale, where he arrived on September 23rd, the fourth month from the day he left Ottawa. From Yale he took the steamer for New Westminster, and returned home by way of San Francisco and the Union Pacific Railway.\n\n(10) Expeditions in connection with the Geological Survey, 1871-1879.\n\nSince British Columbia became part of the Dominion no year has passed without explorations being carried on in the Pacific Province by the officers of the Geological Survey. The chief director, Dr. Selwyn, has frequently made examinations in the territory and has crossed and re-crossed the Rocky Mountains. In 1871, having reached Victoria by way of Chicago and San Francisco, he left in July for the mainland. He followed the valley of the Fraser to Lytton, passed on to Kamloops, and by the North Thompson and the Albreda travelled to Tete-Jaune-Cache. He reached Yellow Head pass on October 21st. Returning by the same route he arrived at Victoria on November 29th, and Montreal on December 26th. For the four years 1871 to 1874 Mr. Richardson was engaged in the geological examination of Vancouver and Queen Charlotte Islands. In 1873 Dr. Selwyn crossed the plains from Red River to the Rocky Mountains and returned by the North Saskatchewan. In 1873 Dr. Bell examined the country between Red River and the South Saskatchewan, and in 1874 the district between Lakes Manitoba and Winnipegoosis.\n\nIn 1875 Dr. Selwyn made an extended exploration of that part of the country formerly known as New Caledonia. He followed the trail to Fort Fraser on Stuart Lake, thence he proceeded across to Fort McLeod near the source of Peace River. On July 3rd he left Fort McLeod and descended Peace River. On July 11th, after passing the mouth of Finlay River, Dr. Selwyn ascended a mountain 4,590 feet above his camp, and 6,220 above the sea. He returned by the same route, descending the Peace River, and reaching the mouth of the river.\nsea. He passed up Pine River, following the stream as far as his canoe would float. He returned to Fort St. John and descended Peace River to Dunvegan; proceeding downstream to the forks, he ascended and partially explored Smoky River. This proved the limit of Dr. Selwyn's expedition, and he returned by the route he had followed. The result of his labours is embodied in the Geological Report of 1875-76.\n\nProf. Macoun, who accompanied Dr. Selwyn, continued the exploration from the mouth of Smoky River to Lake Athabasca; thence he proceeded eastward by the Methye portage and along the ordinary route of the Hudson's Bay Company to Carleton, and returned to Ottawa by way of Winnipeg. The result of Prof. Macoun's exploration is given in \"Geological and Geographical notes\" for the year 1875.\n\nIn 1875 Dr. G. M. Dawson commenced his labours in British Columbia by making an examination east of the lower part of the river Fraser. The following year he made explorations in the basin of the Blackwater, Salmon, Nechako Rivers and Francois Lake. The same season Mr. Richardson continued the examination of the coal fields of Nanaimo and Comox.\n\nIn 1877 Dr. Dawson devoted his time to an extended geological survey of southern British Columbia, and the following season to an examination of Queen Charlotte Island. Dr. Bell spent the summer of 1878 in the country bordering on the Churchill and Nelson Rivers, and three years later he made examinations in the Athabasca and Mackenzie Rivers regions. In 1879 Dr. Dawson accompanied Messrs. Cambie, McLeod and Gordon from Port Simpson, on the Pacific, through northern British Columbia and the Peace River country to Edmonton. From Edmonton, crossing the plains to Winnipeg, he reached Ottawa.\n\nThe services performed by the geological staff have been highly important, and deserve the most respectful mention. The volumes which have annually appeared relate in detail the results of the several explorations, and fully establish the value of the examinations which have been carried on, equally in the interest of general science and in making known the economic materials which are found in the territory.\n\n(II) Travels of the Marquis of Lorne and the Princess Louise, 1881-1882.\n\nIn the summer of 1881, the Marquis of Lorne, then Governor-General of Canada, started on a journey through the Northwest Territory. Part of the Canadian Pacific Railway between Lake Superior and Winnipeg was then under construction, and the rails were laid from both ends, leaving an intervening gap at that date of about seventy miles. Lord Lorne reached Por Arthur by steamer, passed over the railway some 230 miles by a construction train to the end of the track. From this spot the journey was chiefly by canoe through a series of lakes and water channels until he reached the completed railway, by which he travelled to Winnipeg.\n\nFrom Winnipeg, Lord Lorne travelled westward 115 miles by rail to a point where other means of locomotion became necessary. Here he was met by an escort of the Mounted Police under Major Crozier, and thus attended in his further journey, he proceeded over the plains on horseback to the North Saskatchewan, thence to Red Deer district, Calgary and Bow River. Lord Lorne crossed the frontier east of the mountains, and passed into the United States as far as Fort Shaw in Montana. He\nreached this point in September, and returning eastward through Dacota, he revisited Winnipeg on his way to Ottawa, where he arrived after an extended journey of seven weeks in the Northwest, most of the time being at night under canvas.\n\nThe following year (1882), with H.R.H. the Princess Louise, he visited British Columbia. Lord Lorne and Her Royal Highness travelled by Niagara and Chicago to San Francisco, arriving on September 13th. They embarked on H.M.S. \"Comus\" for Victoria, where they landed on the 20th. After a week of ceremonial observances, Lord Lorne and the Princess left for New Westminster on the 29th. Princess Louise returned to Victoria, while Lord Lorne ascended the Fraser to Yale by steamer, thence he proceeded by the old Cariboo road to Kamloops in the interior, returning by the same route.\n\nOn October 7th, the Vice-regal party reembarked on the \"Comus\" for San Francisco. While on the Pacific coast they visited St. Barbara and St. Angelo; after which they returned to Ottawa.\n\n(12) Second Journey of Mr. Sandford Fleming, 1883.\n\nIn the summer of 1883, the writer of this paper was induced to undertake an examination of the route, which has since been located through the Rocky Mountains, for the Canadian Pacific Railway, and on which the line has been constructed. Being at the time in England, he crossed the Atlantic and on his arrival at Halifax proceeded to Lake Superior. At this date the railway was completed from Lake Superior as far west as Calgary; consequently only a few days were required to arrive at the base of the mountains. When at Winnipeg the writer had the good fortune to meet his old travelling companion, Principal Grant, whom he had invited to accompany him. At Calgary, horses were obtained to cross the mountains as far as any trail could be found. The party followed Bow River to the continental \"divide\" where the waters flow eastward and westward to the Atlantic and the Pacific. They descended by Kicking Horse valley to the Columbia, and after following that river for about thirty miles, ascended the Selkirk range of mountains by the valley of Beaver River and descended on the western slope by the valley of the Ille-celle-waet to the second crossing of the Columbia. The journey was continued across the Eagle pass to the Shuswap Lakes. In many portions of the route the trail was difficult to follow, until finally, in the Selkirks, all vestige of a trail ceased. The horses were consequently unable to be taken further, and the party was compelled to go onwards without them. Like other travellers, similarly situated, those who made this journey experienced difficulty and anxiety; they however succeeded in reaching Kamloops and proceeded in the usual way to New Westminster. It is worthy of note that this was the first connected expedition through the mountains, in fact the first continuous journey on the actual route of the railway as established from Lake Superior to the Pacific coast. Dr. Grant wrote several papers in the Toronto 'Week' describing it. The writer's experience was embodied in a volume published the year following.¹\n\n¹ England and Canada, a summer tour between Old and New Westminster, 1884.\nEarly in 1874, the negotiations for the admission of British Columbia into the Canadian confederation took such a form that the successful termination of them was foreseen. The construction of the Pacific Railway was a prominent condition in the articles of union, and in consequence preparations for explorations on a comprehensive scale were commenced. Surveying parties were organized, so as to take the field on the opening of the lakes and rivers. On July 20th of that year the admission of the western province into the Canadian Dominion was consummated—on that day the first detachment of engineers left Victoria, Vancouver Island, to commence explorations between the coast and the Rocky Mountains. The vast territory intervening between the valley of the Ottawa and the Pacific coast, which now became the field of survey, extended within its extreme limits over fifty-four degrees of longitude and ten degrees of latitude. The chief obstacle to be overcome lay in the mountain region to the west and the woodland region to the east, and it became necessary to explore long stretches of trackless and uninhabited territory, portions of which so far as we have any record to show, had never been penetrated by civilized man.\n\nDuring the season of 1874 twenty-one surveying parties were placed in the field, and their operations were continued from year to year. The examinations were much interrupted during the winter, although as far as practicable the work of exploration was carried on both in winter and summer. It would not be possible within the limits of this paper to give even a faint outline of the detail of these years of labour. The results are fully embodied in the several volumes of engineers' reports annually submitted to Parliament. As a rule the work of each party in the field was confined to a particular district and rarely partook of the character of a \"through\" expedition. The engineering corps engaged in the mountain region usually made their way to British Columbia by railway to San Francisco and thence by steamer, returning to Ottawa by the same route. Some individual members of the service who passed overland through the Dominion have been specially mentioned; the following may likewise be referred to.\n\nIn 1879 Messrs. Cambie and McLeod, accompanied by Dr. G. M. Dawson and Rev. D. M. Gordon, left Ottawa by way of San Francisco, for the northern parts of British Columbia. By steamer they arrived at Port Essington, at the mouth of the Skeena, on June 6th, and immediately commenced the ascent of the river by canoe. In two weeks they reached the forks of the Skeena. Leaving the river, they crossed to Babine Lake, which they followed to its southern end, and thence passed over to Fort St. James, on Stewart Lake, where they arrived on July 8th. Thence by land they followed the trail to Fort McLeod on the Parsnip, a tributary of Peace River. At Fort McLeod, the party was divided. Dr. Dawson proceeded across the mountains by Pine River pass, while the main party descended the Parsnip and Peace Rivers. Explorations were continued on the two routes until the end of August, when the two divisions of the party rejoined at Dunvegan, on Peace River east of the mountains. In September they again divided. Mr. Cambie recrossed the mountains by Pine River Pass, and reached the Pacific coast by way of the valley of the Fraser. The remaining members of the expedition followed different routes to Edmonton, and thence across the prairies to Winnipeg. All arrived at Ottawa at the end of the season. Reports from the several\nmembers of this expedition are fully given in the Pacific Railway Engineer Report for 1880.\n\nUp to 1880 the construction of the Canadian Pacific Railway was directly carried on by the Government; at that period the completion of eight hundred miles, embracing some of the heaviest and most difficult sections of the line, had been assured. In that year it became the policy of Parliament to transfer the whole work to private enterprise, and thus the Canadian Pacific Railway Company came into being. The Company has since, with extraordinary energy, carried the work to completion.\n\nThe railway, as constructed through a portion of the mountain region, follows a different route to that previously adopted by the Government. As the directors of the company considered it wise to change the line to a more southern direction, it became indispensable to seek for another pass. For this purpose Major A. B. Rogers with much labour and determination explored the Selkirk Range, and found the pass through which the railway has been constructed.\n\n(14) Journey of Mr. W. C. Van Horne, 1884.\n\nIn the year 1884, Mr. W. C. Van Horne, at that time general manager and vice-president of the Canadian Pacific Railway, accompanied by Mr. S. B. Reed, C.E., reached British Columbia by way of San Francisco, with the object of inspecting the line of the railway and examining the works in progress in the mountains. On August 9th they left Victoria for New Westminster and Burrard Inlet; they proceeded up the valley of the Fraser to Kamloops; on the 14th they took their departure for Shuswap Lake and the mountains. On the 15th they entered the Eagle pass and reached the Columbia; having crossed that river they passed over the Selkirks by the valleys of the Illecelle-wat and Beaver. Again reaching the Columbia at its eastern crossing they ascended that river to Kicking Horse River, the valley of which they followed to the summit. Between the Eagle pass and the source of Kicking Horse River, the journey was made partly on horseback and on foot; much of it was exceedingly tedious and fatiguing. On the 21st, they reached the end of track, which had then been laid to the summit in the Rocky Mountains and by train they travelled to Winnipeg. The railway journey was continued by St. Paul to Montreal, and the travellers arrived at that city on August 29th, twenty days after leaving Victoria.\n\n(15) Journey of Mr. Collingwood Schreiber, 1884.\n\nAs Mr. Van Horne's party emerged from the mountains, Mr. Collingwood Schreiber, Chief Engineer of the Canadian Government Railways, started on the overland journey. He was accompanied by Mr. Pottinger, General Superintendent, and Mr. Archibald, Engineer of the Intercolonial Railway. They proceeded by railway to Oregon, and thence\n\n---\n\n7 See also Mountain and Prairie; a Journey from Victoria to Winnipeg, via Peace River Pass, by the Rev. Daniel M. Gordon, B.D., Ottawa, 1886.\n\nThe circumstances which led to the discovery of the pass through which the railway is established are alluded to in the work of the writer, England and Canada, pp. 267 and 409.\nby rail and steamboat to Victoria, British Columbia. Crossing the Strait of Georgia to New Westminster, they ascended the Fraser to Yale, and proceeding along the line of railway, examining the works under construction, they reached Eagle pass. Thence crossing the Selkirk and Rocky Mountains ranges on the route, already described as followed by Mr. Van Horne the previous month, Mr. Schreiber reached the end of the track at the \"divide\" between the Kicking Horse River and Bow River valleys; continuing his journey eastward by railway, he returned to Ottawa on September 29th.\n\n(16) Visit of the British Association to the Rocky Mountains, 1884.\n\nIn August, 1884, the meeting of the British Association was held in Montreal; on the termination of the session the majority of the members who had crossed the Atlantic visited Toronto and Niagara. Of the number, from eighty to a hundred, including some ladies, accepted an invitation to extend their tour to the Rocky Mountains.\n\nThey left Toronto on September 6th, and by steamboat passed through Lakes Huron and Superior to Port Arthur, where they took the train for the west. The rails were then laid a few miles over the Rocky Mountain summit, so the travellers proceeded to the end of the track and remained some few hours in the neighbourhood. They actually passed the period of their halt in British Columbia—the crest of the Rocky Mountains being the eastern boundary of that province.\n\nOn their return they arrived at Regina on Sunday the 14th. Divine worship was held on this day, the Bishop of Ontario and the Rev. Harry Jones, a member of the British Association from England, officiating. The visitors remained some hours at Gleichen, where they had an opportunity of meeting a large number of Blackfeet Indians. They also made a halt at Winnipeg, where a reception was given them at Government House. They arrived at Toronto on September 19th, after an absence of thirteen days, expressing great satisfaction with the trip. The party included a number of distinguished men. Among them was Dr. Cheadle, who must have contrasted the ease and comfort with which the journey had been made, with his painful experience in crossing the mountains with Lord Milton twenty-one years earlier.\n\n(17) Journey of Sir Charles Tupper, 1885.\n\nSir Charles Tupper, High Commissioner in London, arrived in Canada on August 7th, 1885. After remaining three weeks in the eastern provinces, he left by the Northern Pacific Railway for Portland, Oregon, and thence went to Victoria, British Columbia. His party consisted of Mr. Collingwood Schreiber, Mr. Stewart Tupper, the late Mr. Andrew Robertson, of Montreal, and Mr. Townshend, M.P. After visiting Nanaimo, they crossed to New Westminster and Yale. On October 3rd they left Yale by the recently constructed railway and by train reached the end of the track in the Eagle pass where there remained a gap of forty-seven miles unfinished. Proceeding over the gap on horseback, they met, on September 4th, Lord Lansdowne passing in the opposite direction. On gaining the track laid from the eastward, they took the train for Winnipeg, and by way of Chicago reached Ottawa on October 20th.\n\nSec. II, 1889. 18.\n(18) Journey of the Marquis of Lansdowne, 1885.\n\nThe Governor-General, the Marquis of Lansdowne, accompanied by his staff, Lord Melgund and Mr. Anson, left Ottawa on September 24th by the Canadian Pacific Railway, then uninterruptedly available for traffic by the north shore of Lake Superior. At Dunmore, the point of junction of the narrow-gauge coal-railway, His Excellency proceeded to the mines at Lethbridge. From Lethbridge he travelled on horseback to Fort McLeod, and thence to Calgary, where he rejoined the main line of railway. From Calgary, Lord Lansdowne passed by train to the end of the track then at a point in the Selkirks, eighteen miles east of the second crossing of the Columbia. At this point commenced the gap of forty-seven miles of unfinished work referred to. Two days were taken to ride over this section, on the last stage of which he met, as previously stated, the party of Sir Charles Tupper travelling eastward. When the railway track from the west was reached, Lord Lansdowne and his party took the train and followed it to the then terminus, Port Moody, on Burrard Inlet. Crossing the Strait of Georgia to Victoria on October 6th, he was received with every mark of respect, and in his address at the banquet given him, he remarked that until the present occasion no other governor-general had been able to make the journey entirely through Canadian territory. Remaining some few days at Victoria, the party visited the coal mines at Nanaimo; they left on the 14th for New Westminster. The following day they took the train at Port Hammond, and remained over a short time at Yale, Lytton, Dryneck, and other points. The party reached the end of the track on the morning of the 17th. They here again resumed the saddle, but in the interval of the thirteen days since they passed westward, the gap had been reduced to twenty-eight miles; this distance was accomplished in one day. The train took the party to Winnipeg, where His Excellency was received by the authorities, and entertained at a banquet. In the speech made by him, like each of his two immediate predecessors on similar occasions, he gave a narrative of what he had seen, and spoke of the bright future, which he confidently anticipated. He reached Ottawa by way of Chicago, on October 26th, having made the double journey in little more than a month. Lord Lansdowne's trip was the first occasion on which the new railway route had been followed in both directions across the mountains on the same overland journey.\n\n(19) First through train by the Canadian Pacific Railway, 1885.\n\nThe writer has thus described the several overland journeys to the Pacific, undertaken previously to the completion of the Canadian national railway. He has endeavored to make the catalogue complete, and has included every through Canadian journey of which he could find any account. The important epoch is now reached when the necessity for all such expeditions has for ever passed away.\n\nIt has been stated that when Lord Lansdowne passed through the mountains on his way homewards, there remained twenty-eight miles of rail track to be laid, to complete the connection through the mountains. Nine days later, on October 26th, the Governor-General arrived at Ottawa.\n\nOn the evening of October 27th, when the regular Winnipeg train left Montreal, a\nprivate car, the \"Saskatchewan,\" was attached with the design of proceeding to Port Moody, at that date the terminus—the new city, Vancouver, having no existence. This car contained seven persons: five came the whole way from Montreal, one of them joined at Ottawa, and one on their way to Port Arthur. A delay of two days took place at Winnipeg; finally the party left Winnipeg on Monday, November 2nd, 1885. The train beyond Calgary became \"special;\" it reached the western crossing of the Columbia in fifty-six hours after leaving Winnipeg. The gap, however, was not closed; the work having been retarded by incessant rains, so the train could not proceed further. Early on the morning of the 7th the junction was verging to completion, and at 9 o'clock the last rail was laid in its place. All that remained to finish the work was to drive home one spike.\n\nBy common consent, the duty of performing the task was assigned to one of the four directors present—the senior in years and influence, whose high character placed him in prominence—Sir Donald Alexander Smith. No one could on such an occasion more worthily represent the company or more appropriately give the finishing blows which, in a material sense, were to complete the gigantic undertaking.\n\nSir Donald Smith braced himself to the task, and he wielded the by no means light spike hammer with as good a will as the professional track-layer. The work was carried on in silence. Nothing was heard but the reverberations of the blows struck by him. It was no ordinary occasion; the scene was in every respect noteworthy, from the groups which composed it and the circumstances which had brought together so many human beings in this spot in the heart of the mountains, until recently an untracked solitude. Most of the engineers with hundreds of workmen of all nationalities who had been engaged in the mountains were present. Every one appeared to be deeply impressed by what was taking place. The central figure in the group was something more than the representative of the railway company which had achieved the triumph he was consummating. His presence recalled memories of the MacKenzies and McTavishs, the Stuarts and MacGillivrays, the Frasers, Finlaysons, McLeods, McLoughlins, and their contemporaries who first penetrated the surrounding territory. From his youth he had been connected with the company, which for so long had carried on its operations successfully from Labrador to the Pacific, and from California to Alaska. To-day he was the chief representative of that vast organization which, before the close of the last century, had sent out pioneers to map out and occupy the unknown wilderness, and which as a trading association is in the third century of its existence.\n\nAll present were more or less affected by a formality which was the crowning effort of years of labour, intermingled with doubts and fears, and of oft-renewed energy to overcome what at times appeared unsurmountable obstacles. Moreover, was it not the triumphal termination of numberless failures, the successful solution of the frequently repeated attempts of the British people, ever since America has been discovered, to find a new route to Asia? To what extent the thoughts of those present were turned to the past must with that undemonstrative group remain a secret with each individual person. This much may be said: to all, the scene was deeply impressive, and especially to the many hundreds of workmen who, from an early hour up to the\n\n---\n\nThe other directors present were Messrs. Van Horne, Harris and the writer.\nlast moment, had struggled to do their part, and who were now mute lookers on at the single individual actively engaged—at one who in his own person united the past with the present, the most prominent member of the ancient company of \"Adventurers of England,\" as he was the representative of the great Canadian Railway Company.\n\nThe blows on the spike were repeated, until it was driven home. The silence however continued unbroken, and it must be said that many a more solemn ceremony has been witnessed with less solemnity. It seemed as if the act now performed had worked a spell on all present. Each one appeared absorbed in his own reflections. The abstraction of mind, or silent emotion, or whatever it might be, was however of short duration. Suddenly a cheer spontaneously burst forth, and it was no ordinary cheer. The subdued enthusiasm, the pent up feelings of men familiar with hard work, now found vent. Cheer upon cheer followed as if it was difficult to satisfy the spirit which had been aroused. Such a scene is conceivable on the field of a hard fought battle at the moment when victory is assured.\n\nNot unfrequently some matter of fact remark forms the termination of the display of great emotion. As the shouts subsided, and the exchange of congratulations were being given a voice was heard, in the most prosaic tone as of constant daily occurrence, \"All aboard for the Pacific.\" The notice was quickly acted upon; in a few minutes the train was in motion. It passed over the newly laid rail, and amid renewed cheers sped on its way westward.\n\nOn the same night a telegram was sent to Ottawa and published in the eastern Canadian newspapers. It ran:\n\n\"The first through train from Montreal is approaching Yale, within a few hours of the Pacific coast. The last spike was driven this morning by Hon. Donald A. Smith at Craigellachie in Eagle pass, three hundred and forty miles from Port Moody; on reaching the coast, our running time from Montreal exclusive of stoppages will be five days, averaging twenty four miles per hour. Before long, passenger trains may run over the railway from Montreal to Vancouver in four days and it will be quite possible to travel on special occasions from Liverpool to the Pacific coast by the Canadian transcontinental line in ten days. All are greatly pleased with the work done. It is impossible fully to realize that enormous physical and other difficulties have been overcome with such marvellous rapidity, and with results so satisfactory.\"\n\nThe train arrived at Port Moody the following morning, November 8th. On the succeeding morning the principal newspapers in England published the substance of the above telegram, with the additional important fact that the first through train from Montreal had actually arrived at the coast.\n\nThe party embarked in a steamer to cross to Victoria. They touched near the mouth of Burrard Inlet, the site of the city of Vancouver, then an unbroken forest. In a few hours the vessel entered the Strait of Juan de Fuca; the name of the channel recalled the memory of the Greek adventurer of three hundred years ago, and with it the painful record of the more honest seamen, whose names will for ever be associated with the heroic yet fruitless efforts to discover a new route, in the northern hemisphere, to hold in possession the commerce of Cathay.\n\nIt is difficult to believe that to-day the efforts to obtain this result have been crowned with success. It is quite true that the passage for ships, sought for in vain by every\ncommander from Cabot in the fifteenth to Franklin in the nineteenth century, has not been found; but if it be not possible for a ship to pass from the Atlantic to the Pacific within the limits of the northern hemisphere, the means are now provided for speedily transporting the cargoes of any number of ships from one ocean to the other. The railway journey described from a shipping port on the St. Lawrence to Pacific tide-water, testifies to the fact that the long desired communication is at length established; and if further evidence be needed, it may be found in the circumstance that a consignment of naval stores follows by the next train from the dockyard at Halifax for the use of the Pacific fleet at Esquimalt. It would indeed have astonished the illustrious navigators, Drake, Cook and Vancouver, when in this part of the world, to have been told that the time would come when ships on the Pacific coast could have their stores replenished from a naval station on the north Atlantic within a few days interval from the hour of making the requisition.\n\nThe members of the party who had made the transcontinental journey remained in Victoria a few days. They left on the return trip on November 12th, and reached Winnipeg on the 15th; after a short delay, they continued the journey to Montreal.\n\nThe narrative of the passage of the first train from Montreal to the Pacific completes the record of the expeditions which the writer has endeavoured to describe. It would have exceeded the scope of the enquiry to have referred at any length to the travels of the pioneers who in the early days of French rule were the first to penetrate the unknown western wilderness. A long list of illustrious names in connection with these explorations and adventures will ever be associated with the history of North America; but the briefest outline of their travels would have carried the narrative far beyond the limits of this paper. The writer's object, especially in the second part of the paper, has been to place side by side the several complete journeys which have been made overland between the waters of the two oceans. He ventures to affirm that few more important events are recorded in our history than the first and last of these journeys, between which there is an interval of nearly a century.\n\nOn the roll of famous travellers there is no grander figure than the intrepid Scotchman who was the first to cross the continent north of the Gulf of Mexico. Can there be a more fitting subject for an historical painting for the National Gallery of the Dominion, than the incident of his mixing some vermillion with melted grease, and inscribing on the face of the rock on which he had slept his first sleep by the shores of the Pacific, this brief memorial: \"Alexander Mackenzie, from Canada by land, the twenty-second of July, one thousand seven hundred and ninety-three\"?\n\nEqually appropriate for a painting to hang by its side, is the scene at Craigellachie on the morning of November 7th, 1885, when Sir Donald Smith, spike hammer in hand, is giving the last blow to finish the work of the railway. It marked the close of a long series of events interwoven with the annals of the northern portion of the continent. Can we doubt that the future historian will regard the occurrence, as a turning point in the history of the Dominion, as the beginning of a new page in the life and destiny of the British colonial empire?\nMap of North America, on Mercator's projection, to illustrate \"\nprojection, to illustrate \"Expeditions to the Pacific,\" by Sandford Fleming.\nSimpson's rule is a method for numerical integration, which is used to approximate definite integrals. It is based on the idea of approximating the area under a curve by dividing the interval into smaller subintervals and using trapezoids to approximate the area in each subinterval.\n\nThe formula for Simpson's rule is:\n\n\\[ \\int_a^b f(x) \\, dx \\approx \\frac{h}{3} \\left[ f(x_0) + 4f(x_1) + 2f(x_2) + 4f(x_3) + \\cdots + 2f(x_{n-2}) + 4f(x_{n-1}) + f(x_n) \\right] \\]\n\nwhere \\( h = \\frac{b-a}{n} \\) is the width of each subinterval, and \\( x_i = a + ih \\) for \\( i = 0, 1, 2, \\ldots, n \\).\n\nThis method is particularly useful when the function \\( f(x) \\) is smooth and the integrand can be accurately approximated by a quadratic polynomial over each subinterval. Simpson's rule is more accurate than the trapezoidal rule but less accurate than the midpoint rule for a given number of subintervals.\n\nIn summary, Simpson's rule provides a way to approximate definite integrals numerically by dividing the interval into smaller subintervals and using trapezoids to approximate the area in each subinterval. The method is particularly useful when the integrand is smooth and can be accurately approximated by a quadratic polynomial over each subinterval.\nVII — A Problem in Political Science.\n\nBy Sandford Fleming.\n\n(Read May 8, 1889.)\n\nI propose to direct attention to a scientific question within the domain of politics or civil government which appears to me to be of general interest. It presents a problem which up to the present time remains unsolved.\n\nThe institution of Parliament, as we all know, is of ancient date. In England a general assembly or council of the nation has been held immemorially under various names. Before the Conquest three designations were at various times assigned to it:\n\n1. Mycel Synoth, or great synod.\n2. Mycel Gemot, or great council.\n3. Witenagemot, or council of the wise men.\n\nThe name of \"Parliament\" was not given to the National Council in England until after the Conquest, when the French language was exclusively used by the dominant class, and French became the official language of the English nation.\n\nParliament has greatly changed since its early days. It has grown and developed from century to century, and it may be said to be still in a condition of growth and development.\n\nWhatever may have been the character of the meetings of the wise men before the Conquest, or of the Parliaments which followed, the central idea of Parliament at the present day, is an assembly of individuals representing the whole nation. The functions of Parliament are to act on behalf of the nation as the supreme authority, and—representing the nation—it possesses every power and every right and every attribute which the nation possesses. The fundamental idea and guiding principle of Parliament is, that it embraces all the separate parts which compose the realm, that in fact it is the nation in essence.\n\nThis is the theoretical and proper idea of Parliament, but it cannot be affirmed that the ideal Parliament has ever yet been realized. Indeed it may be held that the means taken to constitute Parliament cannot, in the nature of things, result in producing a national assembly in which every individual elector may be fairly represented and his voice heard. As a matter of fact, under the existing system, it is not practicable to have in the elective house every part of the nation represented; some parts must necessarily remain unrepresented.\n\nSuch being the case, the problem which science may be asked to solve, is simply this: to devise the means of forming an elective assembly which practically as well as theoretically will be the nation in essence.\n\nSee III, 1889. 5.\nWhat is commonly known as the \"Government\" or the \"Administration,\" and how it may be constituted form no part of the problem, but are separate questions which I do not propose to discuss. I merely submit as a general principle, that the Government may be considered in the light of a committee of Parliament, or executive council to carry into effect the acts and resolutions of Parliament and administer affairs to the approval of Parliament.\n\nNations differ in their social and political circumstances, but in all free countries, at least, it is generally recognised that the elective assembly is of the first importance. The theory of the elective assembly is that the whole people or such of the people as are duly qualified to vote shall be equally represented. It cannot be said that hitherto this object has been even approximately attained. Its attainment may indeed be impracticable, but the question is of so much importance that it cannot be unworthy of grave consideration. May we not ask if it be possible to devise some means, by which the whole people of the realm may be brought to a central point, to a focus so to speak, in a deliberative assembly or Parliament.\n\nThe question of electing representatives to sit in Parliament has received the attention of many political writers and has likewise been investigated at length by many celebrated geometers, who have recorded their dissent from the practice followed. Under the present system, members are elected by a part of the community only, while their election is opposed by another part. It is quite true that the intention is to have the majority of the people represented, but even this is not a necessary result of the existing system; moreover it does not follow that the majority of members returned will hold the views and opinions of the majority of the people on any subject. It may happen and frequently does happen, as a direct result of the present system, that legislative power is placed, not in the representatives of a majority, but in those who represent a minority. Sir John Lubbock gives an apt illustration of this result. He supposes a country in which there are 1,200,000 electors who vote with party A, and 1,000,000 who vote with party B. Now if the two parties are evenly distributed over the whole country, it is clear that, under the ordinary system of representation, the weaker party will be utterly swamped. To use a familiar illustration (he remarks) whenever you drop a bucket into the sea, you will bring up salt water. In such a case therefore the 1,000,000 will be practically unrepresented. But we must carry the matter a little further. In the House so elected, let the majority bring forward some bill of an advanced character and carry it by two to one, i.e., by the votes of members representing 800,000 electors and against those representing 400,000, in such a case it is clear that the minority in the House would have with them also the 1,000,000 in the country who were left unrepresented; so that in fact the measure would represent the wishes of only 800,000 electors, and would be opposed by those of 1,400,000. Thus he points out that the result of a system \"of Government by majorities, is, on the contrary, to enable a minority of 800,000 to overrule a majority of 1,400,000.\"\n\nThis illustrates only one of the many defects in the present system, but it is quite sufficient to show that the principle of Representative Government which is inherently good, has not been realised. It is obvious from the very nature of the system practised in electing members, that, in every Parliament, not the whole but only a part of the electors are represented, and that the representatives of a minority may frequently overrule a majority of the people.\nTake the present Parliament of our own Dominion, and in doing so we have a case in which all will acknowledge that the Administration at the present moment is supported by a large working majority of members. At the last General Election (Feb. 1887) the total number of voters on the lists in all the constituencies where contests took place was 948,524. Of this number the votes polled for one party were 370,342 and for the other 354,714. That is to say, 39 per cent. of the whole represents one party, and 37 per cent. the other party in Parliament. As the representatives of the 37 per cent. are swamped in Parliament and are in no way recognised in the administration of affairs, it follows that 39 per cent. of the electors through their representatives have complete control, and the remaining 61 per cent. have practically no voice in the government of the country. Moreover, as the election of members representing the 39 per cent. of votes was in every instance opposed by the voters who number 37 per cent. of the whole, it follows that on all questions settled on strict party lines, Parliament speaks and acts in its decisions by the members who represent but two per cent. of the whole body of electors. This is not an accidental but a common and, indeed, a necessary result, of the present system, which must continue so long as we follow the ordinary method of electing members to sit in Parliament.\n\nThe question presented is this: Is there any means whatever by which a national assembly can be formed approximating more closely to the ideal Parliament?\n\nLet us begin the inquiry by assuming that the electorate consists of only two electors, that they are equal in all respects, in ability, in integrity, in worldly means, in public spirit; that they have each equal claims and equal desires to act as representatives, and that each is equally willing to be represented the one by the other.\n\nUnder such circumstances what course would be followed by the two to settle the question? Would not the natural method be to cast lots? Assuming that the two electors were left to their own resources, removed from all outside influences, would not this be the only rational means by which they could make a choice?\n\nThere are doubtless some minds who would have an innate feeling against resorting to such a practice; the casting of lots being more or less associated with dice-playing, lotteries and games of chance, to which objections are taken on good and sufficient grounds; but in the case presented there remains no way of reaching a decision except by lot. What other course could be followed? A contest would not mend matters; a trial of physical strength and endurance would be at once futile and indefensible. If the object be to turn the two into a single representative unit, unanimity is essential, and while in agreeing in nothing else they could agree in casting lots. Is the principle of settlement by casting lots in itself objectionable? Was it not considered wise and good in ancient times? And would it not be equally good to-day? It is certainly a time-honored usage for determining difficult questions, and is exemplified in many passages in Holy Scripture; indeed the uniform voice of Scripture goes to show that decisions thus obtained are not only wholly unobjectionable in themselves, but that they were considered to have been overruled and directed by special providential interposition.\n\nI shall cite but one example, the selection of an apostle to take the place of Judas Iscariot. An account of this election by casting lots is given in the \"Acts of the Apostles,\" Chap. I, verses 15-26. It is stated that about a hundred and twenty persons were called upon to select one of their number. They proceeded with deliberate wisdom to follow a\nusage regarded by them as a means of obtaining the divine mind. They determined by lot who should be the twelfth apostle, and thus they made a selection to which a cheerful acquiescence was unanimously given.\n\nI have assumed a case of two electors, and pointed out the course which might be followed—indeed, the only rational course which could be followed. If the principle laid down be sound, could it not be applied in other cases? Let us assume that the electorate consists of twenty voters, what could be done in this case? If individual voters in the electorate were equal in all respects, as in the first case referred to, the question would be a very simple one, as it might be settled by casting lots for one of the twenty equally eligible persons. It may be taken for granted that under the circumstances no one would object to make the selection in this way, as being the simplest and best mode of making a choice. It would remove antagonism and promote unanimity; and, by the very act of casting lots, each one of the twenty taking part therein would be an assenting party to the choice made. Men as we ordinarily find them are, however, not alike; they differ much in their qualifications, and their opinions are not the same; we must therefore consider cases in which equal eligibility and uniformity of mind in the whole electorate is not the rule.\n\nFirst, let us suppose that among the twenty electors, five voters favor the choice of A, another five B, another C, and the remainder D. We should thus have A, B, C, D, each equally desired and preferred as the representative of the twenty.\n\n\\[(A + B + C + D)\\] would therefore be the representative unit of the whole. We cannot however take one quarter of A, B, C, and D, and combine these quarters so as to form one individual, but we can reduce the four to one by the principle of casting lots. One of the four can be selected by what may be termed the \"Apostolic\" method, and the person so selected would be recognized as chosen by the twenty electors as the common representative of the whole.\n\nSecondly, let us suppose a case in which there is less diversity of opinion: two groups of five electors each favor A, one group of five prefer B, another C. The selected men would thus stand A, A, B and C, and the representative unit of the whole would be \\[(2A + B + C)\\]. As in the previous case, this complex unit would be reducible to a single individual by casting lots, and it is obvious that the probability of the lot falling upon A, would be as two to one.\n\nThirdly, suppose three groups of five electors desire to be represented by A and one group by B. In this case we should have \\[(3A + B)\\] as the representative unit: in selecting one of them by lot, there is undoubtedly a possibility of the lot falling upon B, but the probability of A's being chosen would be three times greater than the probability in B's case. True it may be said that there should be no possibility of B's being chosen in a constituency where three-fourths of the electors desire A. We must however bear in mind that the primary object is not so much to have particular sections of the country, as to have the whole nation, fairly represented in Parliament. If we look a little further, if we take four constituencies precisely similar to the one under consideration, according to the mathematical theory of probabilities, there would be returned out of the four, three members in sympathy with A and one member in sympathy with B. Again, if we carry the matter still further if we take into consideration every one of the constituencies into which for convenience the whole nation may be divided, it would be found as a\ngeneral result that the representatives returned to sit in Parliament would collectively represent the nation and fairly embody the reason contained in the whole community.\n\nThere is one peculiarity of the system suggested which may be noticed; in every case the election of a representative would be effected deliberately and without conflict. It would be accomplished in fact with unanimous assent. Each individual voter would contribute towards a common result—a result which would be reached on principles equally just and fair to all, and thus command general acquiescence.\n\nThese results are attainable only by bringing to bear, on matters of doubt or difficulty, the principle of settlement adopted by the Apostles. That principle cannot be objected to on scientific grounds, and those who hold the belief that mundane affairs are over-ruled and directed, should have no difficulty in accepting it as a means of promoting harmony and advancing the common good. The belief in a Providence, who takes cognizance of the affairs of men, is the foundation of all religion; communities therefore the social fabric of which is based on Christianity should have no hesitation in leaving matters of the highest moment to the arbitrament of an infinitely wise Providence rather than to the settlement of men with all their individual interests and selfish views, all their prejudices, all their passions, and all their errors of judgment.\n\nI have so far, for the purpose of the argument, assumed hypothetical cases; it remains to be considered how the principles laid down may be applied practically. Let us take for example the election of a single representative in a constituency of 2,000 voters. It is desirable in the first place that each voter or group of voters of one mind, should have perfect freedom of choice in the nomination. Suppose, in order to accommodate every shade of opinion, it be arranged that each hundred voters of one way of thinking name the person whom they would wish to represent them. This would separate the constituency into twenty groups of voters, who would each nominate whomever they most favored. It does not necessarily follow that there would be twenty persons nominated in the constituency, as two or more groups might nominate the same person; a circumstance which would increase the probability of his selection exactly in proportion to the number of groups making him their nominee. On the twenty nominations being made, the next step would be for the persons nominated to proceed, on the principles above set forth, to select one of themselves.\n\nIf unable to make an unanimous choice, they might, as in the case of the twenty electors choosing a representative, sort themselves into smaller groups and, by the application of the principles set forth, proceed to reduce the number of voting units, and finally, by the apostolic method, determine the selection of one person. The person so chosen would be held to be the common choice of the whole 2,000 to represent the constituency in Parliament.\n\nIn the carrying out of such a system, there would be, as in every system, a number of possible contingencies for which provision would have to be made; these I have not deemed it necessary at present to enter into. My object has been briefly to suggest leading principles by which, as it appears to me, the central idea may be realized. If the principles submitted be sound, I venture to think that it is not impracticable to devise proper machinery to elect representatives who when brought into one deliberative gathering, would, so far as such a thing is possible, be a mathematical concentration of the whole electoral body—would in fact constitute an assembly which would closely approximate to the ideal Parliament.\nReferring to the present system an eminent writer asks: \"Is Government only possible by the conflict of opposing principles?\" The familiar expression, \"government of the people by the people,\" cannot be held to mean government of the whole by a part or by the conflict of hostile parts. It must be obvious the united energy and wisdom of a whole nation directed towards one end can only be fully realized, when the supreme power is vested in an instrument chosen by the whole people, and fairly representing the whole people. This is the great problem for solution and it is manifest that if such a Parliament is ever to be constituted, the people, in choosing members to represent them, must in some way be brought to act not in contestation and conflict, but in concert and in concord.\n\nIf it be one of the first political desiderata to have no large minorities left unrepresented in the national assembly, it appears to me essential to seek for some means of securing the cooperation of the whole body of the electors in the election of members to sit in the High Court of Parliament. To obtain this result it is obviously expedient to adopt a system which necessarily does not develop animosity or provoke hostility; the aim should be to promote friendliness and agreement in a matter which concerns all alike. It cannot be denied that the whole community is concerned in having in Parliament not merely nominees, but moderate-minded men of good common sense and sound common-sense representing the more enlightened electoral mind. By electing members whose principles had down these desirable objects would undoubtedly be achieved, and every step would be deliberately taken, free from the excitement and heated feeling which so frequently accompany ordinary elections. In the stage of the proceedings there would be a tendency to return only the best men. In the very first step it is obvious that a candidate must be a person respected and approved by hundreds of voters. It is presumable that no hundred electors of any class or description would deliberately put forward a base or unworthy or even an inferior individual; it is not to be supposed that they would choose one of the least intelligent or least honest or least reputable amongst them as their representative in the candidature. In turn the voters of one hundred would arrange themselves into groups of one hundred, and each group would select some man who on his merits as a citizen would creditably represent them, or who as a statesman commended himself to their favor. In their turn, thus selected by the hundreds would follow the same course, selecting generally the most worthiest and wisest man until the final choice was reached and a member elected to represent the constituency in Parliament.\n\nIt cannot be doubted that if such a system could be put in force, the tendency would be upwards from first to last, and that there would be drawn to the legislature accomplished statesmen men endowed with wisdom and patriotism, practical knowledge and experience. The inevitable effect would be to allay the spirit of faction and remove political animosity in a far higher degree than under the ordinary method of electing members. The voters would situate within the pale of Parliament men in generous sympathy not with a sect only, but with the whole people. Thus might be constituted an august body which as closely as possible would be a true mirror of the enlightened mind of the nation to reflect its opinions, its wisdom and its virtues.\n\nIn a Parliament so constituted perfect unanimity on all questions, perhaps on any question is not to be looked for, and each separate question would have to be settled,\nas it arose, by the voice of a majority. Hence it may be said that as every question would in the end have to be determined by a majority, the Parliament as proposed would be no improvement on the present. It will, however, readily be seen that there is a wide difference between a Parliament representing the whole people, deciding questions by a majority of its own members, and a Parliament in which a part only of the electors has any voice. The proposed assembly would not consist of men placed in their seats in direct opposition to a large number of the people, but a Parliament formed through the cooperation and assent of the whole body of the electors, to promote their common welfare; it would approximately be a microcosm so to speak, of the nation. In and through this Parliament each and every elector would have an equal voice in public affairs.\n\nThe proposal is to substitute in our Parliamentary elections the principle of cooperation for the principle of antagonism, and by this means to choose representatives who when brought together in a deliberative assembly would realize the true idea of Parliament—a \"Witenagemot or great council of wise men,\" representing every part of the realm, and imbued with the spirit of the whole to act in the name of the whole and speak the voice of the united nation.\n\nIf such a Parliament be an object to be desired; if it be a fundamental principle that all who bear the taxation, should share in the representation; if it be the sacred right of every elector to have a just and proper representation in Parliament; then it must be recognized as a paramount duty and an object worthy of the highest efforts of the progressive citizen, to find some means by which such a legislative body may be realized—a complete solution of the problem may be remote, but, as has been stated, Parliament is a growth and development, and in all matters into which the principle of growth enters, the element of time must also enter. The question vitally concerns all free communities, and any change must in the nature of things be preceded by a deliberate and impartial enquiry. I have ventured to submit a scientific solution, it may not be the best means of attaining the desired end, and I offer it with all diffidence merely as a contribution to the general discussion in the hope that it may not be wholly barren of utility. I cannot but think that if the strictly scientific habit of mind be brought to bear on the question, some practical method of solving the problem will slowly and surely be evolved. Whatever the solution I humbly think that it must be based on principles which will not betray the conflicts and contestations which result from political activity under the present system.\n\nIt is held by the most eminent political economists that by cooperating two men will do more work and do it better than four men, or four times four men acting in opposition. Is not the rule of universal application? Can there be cooperation without harmony? Can there be antagonism without discord? And are not discord and harmony in the state likened unto disease and health in the human body? This much will be conceded: the chronic feuds between tribes and races which characterized the history of the human family in a less advanced stage of civilization no longer exist. War is manifestly not the normal condition of society in our time. Is it not therefore an anachronism to perpetuate hostility in the internal affairs of a nation? Is it not in the highest interests of the state that each member of the community, in every matter which concerns him as a citizen, should have the fullest opportunity of acting up to the injunction \"live\npeaceably with all men.\" If the age of belligerency has passed away, is it not eminently fit and proper that we should seek for the removal of the last vestiges of a belligerent age which still remain in our political system?\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_14987.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 90, "total-input-tokens": 156300, "total-output-tokens": 57571, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2846, 3], [2846, 5287, 4], [5287, 5611, 5], [5611, 5611, 6], [5611, 5611, 7], [5611, 5611, 8], [5611, 5611, 9], [5611, 5611, 10], [5611, 8952, 11], [8952, 13602, 12], [13602, 14220, 13], [14220, 19137, 14], [19137, 23694, 15], [23694, 28224, 16], [28224, 32803, 17], [32803, 37576, 18], [37576, 42105, 19], [42105, 46611, 20], [46611, 48583, 21], [48583, 49428, 22], [49428, 52265, 23], [52265, 55626, 24], [55626, 58889, 25], [58889, 62240, 26], [62240, 65495, 27], [65495, 68843, 28], [68843, 69488, 29], [69488, 71428, 30], [71428, 74761, 31], [74761, 78279, 32], [78279, 81578, 33], [81578, 84827, 34], [84827, 88035, 35], [88035, 91442, 36], [91442, 94797, 37], [94797, 98488, 38], [98488, 101835, 39], [101835, 105548, 40], [105548, 109317, 41], [109317, 112761, 42], [112761, 116175, 43], [116175, 119806, 44], [119806, 123233, 45], [123233, 126986, 46], [126986, 130571, 47], [130571, 134110, 48], [134110, 137503, 49], [137503, 141395, 50], [141395, 144837, 51], [144837, 148236, 52], [148236, 151485, 53], [151485, 154880, 54], [154880, 158425, 55], [158425, 161922, 56], [161922, 165661, 57], [165661, 169122, 58], [169122, 172624, 59], [172624, 175895, 60], [175895, 179286, 61], [179286, 182525, 62], [182525, 185818, 63], [185818, 189132, 64], [189132, 192291, 65], [192291, 195782, 66], [195782, 199133, 67], [199133, 202325, 68], [202325, 205897, 69], [205897, 208994, 70], [208994, 212196, 71], [212196, 215526, 72], [215526, 219109, 73], [219109, 222635, 74], [222635, 226071, 75], [226071, 226071, 76], [226071, 226071, 77], [226071, 226135, 78], [226135, 226212, 79], [226212, 227460, 80], [227460, 229928, 81], [229928, 233693, 82], [233693, 237476, 83], [237476, 241151, 84], [241151, 244913, 85], [244913, 248603, 86], [248603, 252291, 87], [252291, 252517, 88], [252517, 252517, 89], [252517, 252517, 90]], "primary_language": ["en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false, false, true]}}]