[{"id": "b71d7e31f687f3b111e2d7b5959363654053ee4c", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\n☐ Couverture de couleur\n\n☐ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\n☐ Encre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\n☐ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/\n☐ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nA BRIEF DESCRIPTION OF NOVA SCOTIA, WITH PLATES OF THE PRINCIPAL HARBORS; INCLUDING A PARTICULAR ACCOUNT OF THE ISLAND OF GRAND MANAN.\n\nBY ANTHONY LOCKWOOD,\nPROFESSOR OF HYDROGRAPHY,\nASSISTANT SURVEYOR-GENERAL OF THE PROVINCES OF N. S. AND C. BRETON.\n\nLondon:\nPRINTED FOR THE AUTHOR,\nBy G. Hayden, Brydges Street, Covent Garden;\nAND SOLD BY CADELL AND DAVIES, STRAND.\n\n1818.\nTO\n\nHIS EXCELLENCY THE RIGHT HON.\n\nTHE\n\nEARL DALHOUSIE,\n\nGOVERNOR OF NOVA SCOTIA, &c. &c. &c.\n\nTO THE\n\nHON. MEMBERS OF HIS MAJESTY'S COUNCIL,\n\nAND TO\n\nTHE MEMBERS OF THE ASSEMBLY,\n\nTHIS WORK IS DEDICATED;\n\nAND AS\n\nAN INFANT OF PROMISE, IS OFFERED TO THEIR NOTICE,\n\nShould it be received under a favourable consideration, no Industry or Care will be wanting, to mature its growth, and render it worthier of the Public, by\n\nTHE AUTHOR.\nINTRODUCTORY\n\nREMARKS.\n\nA MERE technical description of the Harbours of any country can afford little entertainment: but those of Nova Scotia, whose features are so nearly similar, furnish very scanty materials for descriptive composition: this scantiness is still more contracted by the want of leisure, and the strong vicissitudes of the climate, cramping exertion; but probably more by a limited capacity.\n\nGladly would I give this crude mass of information to any person of talent, possessing a local knowledge of the country, who would take the pains to blend with it a particular account of the Province; by whose hand it might be cleared of its imperfections, and weeded of its orthographical and other errors. Improved by such observations and sentiments as the subject would admit, the work might find a place in the libraries of the respectable men of our community, and convey to our good\ncountrymen, at their English firesides, an improved idea of Nova Scotia; and the imaginary wilderness, with its bears and monsters, give place to Acadia, with her happy, exceedingly happy features.\n\nHowever, as I despair of such assistance, and an account of the different harbours may benefit, if not preserve, many valuable persons, plain truth must substitute decoration. Those for whom it is chiefly intended, will receive it as a code of instructions, written in their own style, and will be guided clear of the dangers it points out, into places of safety, where they can rest at ease from their labours, watchless.\n\nActing under the orders of the Lords Commissioners of the Admiralty, and subject to the control of the Naval Commander in Chief, my time is consequently theirs: therefore, having only such periods to devote to this work as a relaxation from my professional duties will admit, much cannot be expected.\n\nLet the eye of scrutiny charitably scan its imperfections; and should it be thrown open to the delicate vision of quick perception, a consideration of the Author's incessant servitude will soften its monotonous discordance. On ship-board, one set of ideas frequently serve a voyage. Deprived of refined female society, which tends to perfection more than any plan of education, and without which the manners are harsh and rude; sailors, who see most, and before whom nature derobes, are seldom gifted with descriptive powers; traversing this terraqueous globe, and pursuing research as a pleasing duty, what exquisite delight should I have derived, had Providence permitted me to give to\nthe world, in suitable language, a just description of the various scenes that have passed in review, during a period of twenty-five years' incessant peregrination.\n\nSecured from necessity in age, by the liberality of the Board I have the honor to serve, and enjoying an income exceeding my wants, I disclaim even the slightest wish to derive pecuniary benefit from this humble attempt to be useful: if it will pay the expense of the publication, I shall be satisfied.\n\nThe Hon. Charles Morris, Surveyor General of the Province, furnished me with many documents, &c. and trebly enhanced the favor by his manner of conferring it. From these papers were drawn much of my information, and the permission of free access to the office essentially aided me.\nA\n\nBRIEF DESCRIPTION\n\nOF\n\nNOVA SCOTIA.\n\nNOVA SCOTIA lies within the 43rd and 46th degree of North Latitude, and between the 61st and 67th degree of Longitude, West from the Greenwich meridian. It is connected with the body of North America, by an Isthmus, about 20 miles wide, which forms the boundary and Eastern line of New Brunswick.\n\nBy a fair computation it contains 15617 square miles, or 9994880 acres: one third of this superficies is occupied by lakes of various shapes and sizes, spread in all directions on the face of the Peninsula. There is no point in the Province 30 miles from navigable water.\n\nThe Southern margin is broken, rugged, and barren, with very prominent features, deep indents, and craggy islands; with ledges\ninserted in the sea, either intended by nature to resist the constant attack of the Western Ocean; or, which is more probable, produced by its action.\n\nThe features of the Northern Coast are soft, and free from rocks: the combined effects of heavy rain, severe frosts, and the sea, make a sensible alteration in its appearance. The few harbors along its whole range, are of very limited capacity. The coal, gypsum, and other minerals, abounding here, are probably of the same strata with those in Cape Breton, as they appear in the same direct line.\n\nThe soil of the interior is generally of a good quality: a great portion of it, free of stone, is easily tilled, and very productive. The forests are composed of Beech; Elm; Oak; black, white, and yellow Birch; Maple; white, prickly, and black Ash; pitch, white, and yellow Pine; white, black, and red Spruce; Larch; Hakmetak, or Juniper; Hemlock; and Fir.\n\nThe temperature, or rather intemperature, is the most equivocal of any part of the world. The following medium meteorologicals will give an idea of the great changes to which it is subject.\n\n| Year | Jan. | Feb. | Mar. | Apr. | May. | June. | July. | Aug. | Sep. | Oct. | Nov. | Dec. |\n|------|------|------|------|------|------|-------|-------|------|------|------|------|------|\n| 1814 | 23   | 27.5 | 30.25| 42.5 | 49.6 | 57.   | 64.   | 64.  | 57.75| 48.  | 39.  | 25.75|\n| 1815 | 22.75| 19.5 | 33.  | 38.  | 47.75| 56.   | 62.   | 61.5 | 55.9 | 44.  | 39.25| 28.75|\n| 1816 | 24.5 | 21.5 | 25.75| 38.  | 46.  | 53.75 | 61.75 | 62.25| 54.5 | 48.  | 41.5 | 28.25|\n| 1817 | 19.3 | 17.9 | 23.8 |      |      |       |       |      |      |      |      |      |\n\n†15.4 †4.7 †8.5\nThe usual mode of finding the mean is incorrect, particularly in these countries, where the changes are sudden and frequent: the common periods for observing it are before sun-rise, at 2 P.M. and 9 P.M. The cold is most intense at 2, 3, or 4 o'clock in the morning; therefore the mercury is seldom observed when lowest, and never taken into the reduction: while the influence which the sun maintains at his meridian is invariably admitted. The third hour in the afternoon, and 10 at night, would, in my opinion, be near the truth. What I conceive to be accurate reductions, are marked †\n\nThe population has been very differently estimated, nor will it be easy to ascertain it exactly, as no census has ever been taken. From the best information, it may be stated at 120,000; as opinion varies from 80 to 160.\n\nThe Aborigines were Indians, similar to those found in the other parts of North America: the most enterprising of these people have deserted the Province, following, as it were, their means of subsistence to the less frequented wilds of Labrador, Canada, Cape Breton, and Newfoundland. The few that are left, say 350 families, 1500 persons, wander from place to place, in all the abjectness of deplorable stupidity. The attempts hitherto made to improve their condition, have not only been abortive, but even productive of evil, by lessening their little energy, and teaching them to expect by begging, what they ought to obtain by common industry.\n\nThe Roman Catholick priests have an ascendancy over them, that checks, in some degree, their propensity to strong drink.\nThrough the medium of these persons, who are actively intelligent, ought certainly all benefits, or what may be intended as such, to be conveyed to them. Their ingenuity appears to be limited to the composition of trifling articles of bark and porcupines' quills, and to have long been at its zenith of improvement. Their honesty, which is exemplified in many instances, appears to arise from apathy; and if the remaining few possessed activity enough to follow their brethren, the Province would be altogether relieved of a useless, idle, filthy race, whose disposition to ramble, and distaste to all social comforts and civilized life, will ever leave them in their present degraded state. One instance will suffice to shew the impossibility of enticing the Indians to any plan suggested by our ideas of decency and comfort.\n\nThe government of Massachussets granted to about 50 families, under the immediate inspection of a respectable missionary, 200 acres of excellent land, improved ready for their use; and as a farther inducement, built for them a chapel. Ten years have these people held their fair possessions, witnessing the progress of the surrounding settlers, from poverty to respectable ease, without the least effort to benefit by their example. These, their characteristic traits, are unalterable. They hunt, clothe, and build, the same as usual, and I believe not one of them shews the least disposition to the mechanic arts.\n\nShould any further attempts be necessary to improve them, would they not be most usefully employed in improving the roads, or forming new ones? in felling and clearing new lands, preparatory to settling them? In thus giving them labour proportionable to their present habits, their wants might, without\nmuch loss, be supported by the Government, as a kind of compensation for its bounty, would accrue to the Province.\n\nThe abuse of humanity is an excitement to dwell a little longer on this subject. The Indian families on the Shubenaccadie, aided so immediately under the eye of Government, will doubtless substantiate the unpleasant truth, that their uncivilized habits are unconquerable, and turn the tide of that bounty, hitherto so ill applied, to the log houses of the poor settlers, immured with large families, in forests that conceal their wretchedness and rags.\n\nWhatever tends to improve the condition of men, is an object desirable to every feeling mind; and in considering the state of the Indians, great caution is necessary to distinguish between change and improvement. Men of common experience must have witnessed the pain, the disappointment, and discomfiture that has resulted from a mistaken notion of conferring happiness.\n\nLord Glenthorn rendering his nurse miserable by bettering her condition, (immediately in point) although the picture of fancy, is wide of caricature.\n\nThe exemplary people called Quakers, in Pennsylvania, have, with a persevering patience peculiar to themselves, tried every art that humanity could devise, to instruct and to infuse into the minds of the Indians, whom they have collected, the ideas of cleanliness, order, and association: affording them example, precept, and every possible inducement to industry and art. What has resulted?\nAn Indian never can be cured of the wandering habit that he has imbibed; all attempts to settle them have been found to establish this fact. Even the infants, taken from their tribe, cannot be civilized.\n\nThe banks opposite the coast, home to the shore, abound in excellent fish: Cod, Haddock, Halibut, Polluck, and various others.\n\nAmericans, alive to the value of this inexhaustible source of wealth, lie at anchor 15 or 20 leagues in the offing, in numbers, well equipped. Their Chebucto boats, from 25 to 70 tons, ride in the middle of the ocean, with buoyancy and ease; while our miserably constructed and ill furnished vessels, hover near the harbors, fearful of being caught by a gale.\n\nThe harbor of Halifax, the capital, latitude $44^\\circ 40'$ N. and $63^\\circ 40'$ West longitude, is large enough to contain any number of shipping in perfect safety. It lies nearly North and South, about 16 miles in length, terminating in a beautiful sheet of water called Bedford Basin, within which are ten square miles of safe anchorage.\n\nThe town is seated on the declivity of a peninsula, at the West side of the harbor, ten miles from its mouth. The irregularity of the buildings, and their elevation one above another, form an imposing and picturesque view.\n\nA light-house on a small island marks the entrance: the lantern is elevated above the sea 210 feet. A small party of artillery are stationed here to attend signals, with two 24-pounders\nas alarm guns. By the attention of these men, several shipwrecks have been prevented. His Majesty's ship Bacchante, in the early part of last year, ran within the breakers; and without the timely alarm of the island guns, would probably have been lost.\n\nS. by E. 24 miles from the light-house, lies the Henercy rock, with 8 feet water on it; E. N. E. one mile from this, is another rock, 12 feet under water; both exceedingly dangerous, and not generally known. The other dangers in this neighbourhood, are distinctly marked on the large sheet of Halifax, and common attention to the directions will ensure safety to the stranger.\n\nHalifax was founded in 1747, under the Earl of Halifax, and settled in 1749; General Cornwallis was then appointed Governor of the Province, by whose directions the town was laid out, and the Peninsula, containing 3,000 acres, divided among the inhabitants, then consisting of 3,000 persons.\n\nSince that period it has been governed by\n\nGeneral Hopson . . . . . . . . . . . . . . . . . . . . . . . . . in 1752\nGovernor Lawrence . . . . . . . . . . . . . . . . . . . . . . 1756\nRd. Monckson, Esq. . . . . . . . . . . . . . . . . . . . . Aug. 17, 1757\nJustice A. Belcher . . . . . . . . . . . . . . . . . . . Oct. 1761\nGov. Ellis, appointed, never sworn into office . . 1761\nGov. Wilmot, 1763, died . . . . . . . . . . . . . . 1766\nHon. Michael Franklin, Lieut.-Gov. 1766, continued two months\nGov. Francis Legge . . . . . . . . . . . . . . . . . . . . . . . . . 1773\nLieut-Gov. Arbuthnot . . . . . . . . . . . . . . . . . . . . . 1776\nLieut.-Gov. Richard Hughes . . . . . . . . 1778  \nLieut.-Gov. Sir And. Hammond . . . . . . . 1781  \nJohn Parr, 1782, died . . . . . . . . . . . 1791  \nRichard Bulkely, president and commander in chief, Nov. 26, to May 14 . . . . . . . . 1791  \nLieut.-Gov. Sir John Wentworth, arrived Jan. and sworn, May . . . . . . . . . . . . . . 1792  \nLieut.-Gov. Sir G. Prevost, Jan. 17 . . . . . 1808  \nSir J C. Sherbrooke, Aug. 19 . . . . . . . . 1811  \nEarl Dalhousie.\n\nOpposite Halifax, on the Eastern side of the harbor, which is there about nine-tenths of a mile wide, the town of Dartmouth was laid out in 1750, and settled; but in the war of 1756, the Indians collected in great force on the Bason of Mines, ascended the Shubenacadie river in their canoes, and at night, surprising the guard, scalped or carried away most of the settlers. From this period the settlement was almost derelict, till Governor Parr, in 1784, encouraged 20 families to remove hither from Nantucket, to carry on the South Sea fishery. The town was laid in a new form, 1500l. granted by the provincial assembly to erect buildings: the spirit and activity of the new settlers, created the most flattering expectations of success. Unfortunately, in 1792, the failure of a house in Halifax, extensively concerned in the Whale-fishery, gave a severe check to the Dartmouth establishment, which was soon after totally ruined. A Mr. Stokes was employed by the merchants of Milford in England, to persuade the Nantucket settlers to remove thither: the offers were too liberal to be rejected, and the Province lost these orderly and industrious people, except Seth Coleman's family, whose great\nand disinterested exertions in behalf of the poor, have secured him the favourable opinion of all men, whose approbation is valuable.\n\nThe lands behind Dartmouth, are increasing in population and agricultural improvement, which has had some effect in recovering the town. It is contemplated to open a communication by canals, connecting the Shubenacadie with the harbor at Dartmouth: this is evidently practicable; but it is questionable, if the country be sufficiently populous, to justify so expensive a labour.\n\nAt the close of the revolutionary war, a number of respectable loyalist families from America, brought to Halifax their property, and became residents; and by their capital, increased the growing importance of the town.\n\nDuring the late war, it became the general rendezvous of our ships, consequently the resort of their prizes, which has materially enriched the place, and extended its commerce. The military and naval arsenals, the public hospitals, the ordnance, and other establishments, have added to its magnitude, and increased its consequence.\n\nThe military, have excellent quarters: 3,000 men, with their proportion of officers, can be comfortably accommodated without encumbering the town.\n\nThe naval yard is seated above the town; the Commissioner's house, and other buildings of the establishment, add much to the beauty of the scenery which presents itself, in ascending the\nharbor. In the late war, a vast number of shipping refitted here, and the mass of labour and duty performed on them, are strong proofs of its good regulation and order.\n\nNorth of the naval yard, and adjoining, stands the naval hospital, with a range of new houses for the officers of that establishment: the buildings are of wood, convenient and spacious.\n\nA rude inelegant square building of stone, is erected on the hill above the hospital, intended as a residence for the naval commander-in-chief. It will probably possess every convenience, and beauty appears not a requisite: it commands a view of the harbor and town.\n\nHalifax, with its suburbs, is composed of 1200 houses, 10,000 inhabitants, two Episcopal Churches, one Scotch Church, (St. Matthews,) two Methodist Chapels, one Anabaptist Meeting, one Roman Chapel, (St. Peter's,) Government House, and the Province Building. The latter, built of free stone, and choice materials, is allowed by connoisseurs, to be a piece of excellent architecture.\n\nSouth-eastern coast from Halifax to Cape Canso, is environed with dangerous ledges, to approach which, requires good charts and confidence. Possessing these a stranger may pursue his route, or take shelter in perfect safety, and the greater the apparent danger, the less he has to apprehend; as the sunken rocks break in coarse weather, shewing the passages between them.\nThe points and headlands, jutting into the sea, present the unfoldings of as good harbors as any in the world; and between the capital, and the eastern extremity of the Province, are twelve ports, capable of receiving ships of the line, and fourteen others, with capacity to shelter merchant vessels abounding in wood, water, fish, and other supplies. Des Barre's plans of the harbors, as well as the general chart of the Province, are published on so extensive and expensive a plan, that precludes the possibility of those possessing them who need them most. All other charts extant of Nova Scotia, are miserably defective and contradictory.\n\nIt may not be improper to adduce an instance or two, of their differences:\n\n| Cape Sable | Rios' Tables | N. 44° 22' 4\" | W. 65° 39' 15\" |\n|------------|--------------|---------------|----------------|\n| Laurie and Whittle | 43 26 | 65 34 20 |\n| Arrowsmith | 43 26 | 65 37 |\n| Des Barre's | 43 26 | 65 34 30 |\n\nBRAZIL ROCK.\n\nLaurie and Whittle's book of directions:—\"This is a very dangerous rock, being dry at low water; there are full 30 fathoms all round it.\"\n\nDes Barre:—\"The Brazil is a small flat rock, with 12 feet of water, and within a cable's distance all round it, you have from\nsix to eight fathoms: it lies E. by S. & S. distant three leagues from Cape Sable.\n\nHolland's Chart, published by Laurie and Whittle, has it S. S. E. nine miles from Cape Sable. In page 9 of the same Chart-sellers book of directions, speaking of Port Matoon, he says, \"you may turn in with a leading wind.\"\n\nErrors will creep in by inattention to the printing, or the want of sound information. It therefore becomes the duty of those who have the means, to correct them.\n\nGEORGE'S BANK\n\nPage 38. Shoal ground of George's Bank, lies in Lat. 41° 38' N. 67° 56' W. Long.\n\nPage 24. The shoalest part of this bank, lies in Lat. 44° 12' N. it has on it from 14 to 4 fathoms, and in some places only 10 feet.\n\nGeorge's Bank shoals, lie in 41° 55' N. and are very dangerous, having in some places only two or three feet water on them: surrounded two or three leagues by rips or breakers which are very dangerous, irregular, and a rapid tide that sets over them most of the time, to the southward.\n\nBlunt's Latitude and Longitude Tables.\n\n\\[\n\\begin{align*}\n\\text{Lat.} & \\quad 41° 45' \\text{ N.} & \\text{Long.} & \\quad 67° 51' \\text{ W.} \\\\\n& \\quad 41° 30' \\text{ N.} & & \\quad 67° 27' \\text{ W.}\n\\end{align*}\n\\]\nThe pilot of the Bulwark declared, in the presence of Captain Milne, myself, and others, that he had landed on the shoal part of George's Bank, and that he believed it dried for at least six miles, and was composed of fine sand. Many of the Cape Cod fishermen assert, they have seen the gulls sitting on it; while others positively insist, that the only danger exists in the heavy and cross sea, caused by the current running forcibly over the uneven ground. These contradictory accounts, as to the position, the danger, and extent of these places, tend more to perplex than inform. Many others might be pointed out, but these are thought sufficient to raise a doubt, and ought to prevent a reliance upon error, until experience guides the selection, and such charts only are used as are accurate.\n\nNo expense has been spared, even to the sacrifice of the common comforts of life, in order to be in possession of the best instruments. These were made by Mr. E. Troughton, and in their accuracy may be placed implicit faith.\n\nThe original names of the places are restored, by which only they are known to the inhabitants and fishermen. Des Barres, in attaching to them the names of noblemen, or men in power, has made his charts of less value; and in one or two instances, has created serious blunders. Inquire of the people of Jedore for Port Egmont, or those of Sheet Harbor for Port North, they know them not, nor would they ever be induced to adopt them. Jestico, a harsh, unpleasant, and unmeaning name, is preferred to Port Hood, although the latter is more pleasing to the ear, and pronounced and recollected with ease: all attempts\nto change the rude Indian names for others of a finer texture have failed; even New Jerusalem and Acadia, have expired.\n\nDIRECTIONS FOR THE HARBOR.\n\nIn approaching from the westward, round the light-house, at the distance of a short league. To avoid the sunken rocks which lie to the southward, when the light bears N.W. by N. haul in N. by W. The flag staves on Citadel Hill, above the town, are distinguishable a considerable distance. By keeping them open of Sandwich Point, you are led clear of the Bell, Litchfield, and Mars rocks, on the West side; and the Rock Head and Thrumb Cap to the East. When arrived at Sandwich Point, which is bold, keep Chebucto Head in sight, by not allowing it to shut in. This plain mark will lead in the fair way home to George's Island, leaving Point Pleasant shoals on the left, and McNab's shoal on the right: round the Island either side, and anchor where you please, in 6, 10, or 13 fathoms, muddy bottom. From George's Island to the confluence of Sackville River, with Bedford Bason, a distance of seven miles, there is not a single obstruction.\n\nThe men of war usually anchor off the naval yard, which a stranger may easily distinguish by the masting sheers. The merchant vessels discharge their cargoes, and take in their lading, along-side the wharves.\n\nIt is necessary, coming from the eastward, to steer for the\nlight-house, or Chebucto Head, until the leading marks are on, which are to be followed as before directed.\n\nSherbrook Tower stands on the spit of gravel extending towards Point Sandwich, from McNab's Island, called Mauger's Beach. Major Wright, the Commanding Officer of Engineers, is constructing a small light-house near the tower, upon an exceedingly good plan, to shew an interior light, by means of which vessels may enter the harbor, and be guided to a safe anchorage. This light will, in all probability, prevent a recurrence of the crowd of accidents by shipwreck on the Thrumb Cap. And if a bell be attached to it, to sound in fogs, worked by machinery, it will be an improvement. Northward of this, under the lee of the beech, is good anchorage, from 9 to 4 fathoms mud, called McNab's Cove; the best shelter is in 7 fathoms, with the Beach and Point Sandwich locked; and George's Island tower touching the N.W. part of the Island.\n\nThe Island now called McNab's was granted to Lord Cornwallis, in the year 1788, and sold by His Lordship to Mr. McNab for a thousand pounds. This property is now considered worth 15 or 18,000 pounds. It contains 1090 acres of tolerably good land; and being for the most part under cultivation, adds much to the beauty of the harbor. The vast quantities of sea-weed thrown on its shores, used as manure, is a great acquisition.\n\nThe S.E. passage formed by McNab's Island, and the main land, is obstructed by a sand bar at the South end, with 8 feet on it at low water: therefore it can be used only by small vessels. Within the bar is 6 to 11 fathoms, soft muddy bottom.\nHerring Cove is inhabited by forty Irish families, who subsist by fishing and piloting. The shores of this nook are a body of solid rock; and small vessels lie perfectly sheltered in shoal water.\n\nHis Majesty's Frigate Tribune's scene of calamity, at the West side of the entrance of this place, on the 23rd of November, 1797, would be a subject worthy of the pencil of the first artist. In a few hours the fragment of her crew consisted of thirteen persons, one of whom, Mr. Galvin, a master's mate, was the unfortunate cause of the disaster. Presuming on his knowledge of the harbor, he imprudently took charge of the ship; with a free wind, and all sail set, ran her on the Thrumb Cap shoal.\n\nIn sailing from Halifax eastward, after rounding the Thrumb Cap, E. by S. twenty-five miles, will clear the outer Jedore ledge: thence to Cape Canso, outside the ledges, the course is E. 10 N. ninety-seven miles.\n\nThe passages within the ledges may be taken with an active vessel, in bad weather; when the water is smooth, many of the dangers lie hid.\n\nThe shore between Halifax and Jedore forms a long shallow bay, with several indents, affording good shelter for coasters. The principal one, Three Fathoms Harbor, has received large vessels in distress, therefore merits attention. The smaller ones, Cole Harbour, Chizetcook, Perpisawick, and Musquidoboit, are\ntoo inconsiderable to be here noticed; yet, as settlements, they are well advanced in agricultural improvement.\n\n**Three Fathoms Harbor** entrance lies eastward of Shut-in Island; and with the wind on shore is a difficult and dangerous navigation: therefore it is only in cases of real distress that a stranger would attempt it. The channel lies two-thirds over to the northward from the Island, and turns short round the starboard point, when within, or to the westward of it.\n\nIn beating to windward, ships may stand to within a mile and a half of the shore, and in the neighbourhood of Devil's Island, to half a mile. The soundings run off tolerably regular, from 8 to 12 and 20 fathoms, sand and mud, with spots of rock.\n\nThe lands are of a moderate height, and rise in easy inequalities, with settlements close to the shore. Red cliffs, forming abrupt heads, may be seen seven or nine miles; and being peculiar to the eastern shore serve to distinguish the position they are seen from. About S. by E. from Shut-in Island, two miles, lie some spots of foul ground, with 4½ to 7 fathoms, that break in heavy gales. Between them and the shore, is 10 to 15 fathoms, clear bottom. Outside of them, you go off, gradually deepening to 35 fathoms.\n\nThe Port of Jedore, alias Port Egmont, is blind and intricate: a shoal, with 11 feet on it, lies at its mouth. The channel is winding, and very narrow.\nAt high water, the mud flats being covered, it wears the appearance of a spacious harbour; but low water is the only time a stranger can navigate with safety. The channel is then shewn, and the water is sufficiently deep for ships of any burden, perfectly secure. The best anchorage is abreast of the sand beach, two miles from the entrance, in 9, 7, or 6 fathoms, stiff mud. About two miles and a half above the beach, the harbor branches; to the left, an arm navigable nearly to its head, with some sunken rocks in it; to the right, a large space of clear bottom, with depth from 3 to 5 fathoms. On the eastern shore, are two deep inlets, Oyster-Pond and Navy-Pool; both choked by a bed of rocks at the entrance. Over these rocks, it is proposed carrying the bridges of the new road along shore.\n\nAt the North part of the eastern branch, Salmon River enters. A ledge lies in its mouth favorable for constructing the bridge of the new road. There is 14 feet on the eastern side of the ledge, and from thence up 5, 7, to 9 fathoms, with perhaps some rocks.\n\nThe river terminates in a strong rapid, from a lake surrounded by barrens, which will ever resist any attempt at improvement.\n\nFrom the summit of a mass of rock, which appeared about 300 feet above the sea level, the eye met a panorama worthy the addition of reptiles, to make it the contrast to beauty. In this frightful desert, a human being, ragged, worn, and ghastly, presented himself, complaining, with evident truth, of fatigue and hunger: those who are permitted to feel the mixt sensations\narising from so providential an aid, may participate in what were the Author's.\n\nAt the eastern side of Jedore lie two islands, called Roger and Barren: between them, and likewise within them, the passage is good, and in case of necessity, anchorage may be found under their lee: from these, the land trenches towards the E.N.E. forming a deep indent, called Clamb Bay.\n\nA number of small islands and ledges lie about this Bay, which are not worthy particular description.\n\nJedore ledges lie five, seven, and nine miles from the harbor's entrance. A brig from Glasgow, under full sail, in the year 1794, struck on a small single rock, and instantly sunk. Three persons were drowned, the rest of the crew with difficulty escaped. Thence it derived its name of Brig Rock.\n\nAn unusually fine day in May, 1815, offered a favorable moment to examine and determine its position. The second master, boatswain, and one seaman, in the jolly boat, left the vessel to sound close to the breaker; while Examiner sounded at a moderate distance around. The water being perfectly smooth, and breaking but very seldom, they incautiously went over it. The sea instantly formed a precipice, which drew the boat to its base, and burst with all its violence. The lead lines were fastened to the thawts, and the leads falling into the interstices of the rock, kept the boat in the breaker. Notwithstanding every exertion, one man sunk: totally possessed by fear, he let\nthe lines and oars, that were thrown him, pass through his hands without an effort.\n\nBrig Rock has on it 3 feet water, about the size of a frigate's long boat: lies S.E. ¼ E. from Jedore Head, and S.W. two miles and a half from Long Island; deep water all round it, 17, 20, to 24 fathoms. The weed on its top frequently floats to the surface. The marks are, a house and barn in Clamb Bay, just open of Long Island, East end, N. 5 E. and the house on Jedore Head open to the N. E. of Jedore Rock.\n\nPolluck Shoal lies South, nine miles from Jedore Head, is about an acre in area, and has 24 feet water on it: in heavy gales it breaks violently.\n\nThe courses are all by compass and given exactly, without any allowances.\n\nLong Island is E. 12 S. from Jedore Head, three miles; to the South of it, lie several very dangerous ledges. The plan shows the depth round and between them. The ends of the Island are bold.\n\nEast from opposite Devil's Island, say two hundred yards, will graze Jedore Rock, and hit the body of Long Island: therefore E. by S. ¼ S. will be the course to clear the ledges.\n\nFrom opposite the South end of Long Island, which may be rounded very close, or very distant, on account of the ledges, the\ncourse along shore is E 4 S. but passing inside the ledges, the courses are various, from E. by S. to E. by N.\n\nNo class of vessels have been so wretchedly conducted and commanded as English transports. Interest and security appears to have regulated their owners, who always insured them. The object of the Transport Board was to hire sound capacious ships on the cheapest terms. During the late wars, agents of transports had their business on their hands, and naval commanders in charge of convoys, frequently found it necessary to place careful people from their own ships, even to the end of the voyage, to conduct the vessels of that class. The owners employed masters that would accept the lowest wages, generally Northumbrians, not remarkable for docility or skill, and the mates and crew of the same character. Such materials for navigation were provided, as these men judged suitable. From this cause may be traced a crowd of evils and calamities; and this digression was produced by the singularly providential escape of a detachment of the Nova Scotia regiment.\n\nThe people of Arachat, alarmed at their unprotected state, on the breaking out of the revolutionary war, for the most part, fled to Jedore, as a place of greater shelter, and remained there till the peace of 1777 when they left their improvements and returned to Arachat. Two royalist families, in 1783, settled it from South Carolina: its population is at present, 23 men, 18 women, 34 boys, 24 girls: total 95.\n\nThe lands at the head of the harbor are stony, but tolerably good. The inhabitants, a sober, industrious, and thriving\npeople, subsist chiefly by coasting, and supplying the town of Halifax with wood, which they cut from the unoccupied lands in the neighbourhood.\n\nLittle Harbor, a place of safety for small vessels, but the passages leading to it require a knowledge of the ledges, many of which are sunken, but between them is water sufficient for the largest ships.\n\nOwl's Head, alias Kepple Harbor, two leagues East of Jedore, and twelve of Halifax, possesses capacity to shelter a fleet. The passage in, is sufficiently wide to turn into it vessels of any description: and at the anchorages, you lie land locked in 6 or 7 fathoms, mud. In choosing a birth in this Harbor, it is usual to be guided by the direction of the wind, taking the Western anchorage in S.W. gales: the Eastern anchorage in S.E. gales.\n\nThree families are settled here, who keep a few cattle, but subsist chiefly by fishing.\n\nThe Head, whence the Harbor takes its name, is round, abrupt, and very remarkable. The land and islands in the neighbourhood are ragged and very barren.\n\nShip Harbor, alias Knowles Harbor, is connected with Owl's Head, by a shallow passage within the islands, navigable for the smallest class of coasting vessels. The proper entrance is deep and bold: a white cliff marked in the annexed plan may be seen at a good distance from the offing, resembling a ship under\nsail; but on approaching it, appears like a topsail schooner. There is anchorage in any part of the harbor, good bottom; above the narrows, a fleet of the largest ships may lay alongside each other, without the smallest motion.\n\nCharles River at the Head of the harbor, proceeds from a chain of lakes, at a small distance. The largest, Charlotte Lake, connects with two others, that are joined to each other by rapids, which afford exceedingly favourable positions for mills.\n\nCharlotte Lake averages one-third of a mile wide, and twelve long, nearly north and south, with an elbow bending eastward, about the middle, opposite Jedore carrying place: the distance from Oyster-pond, does not exceed a mile and a half. The lands on both sides, are clothed with wood of a superior growth, Birch, Beech, Maple, Pine, Spruce, Hemlock, and Ash. The Pine measure in circumference, 12 feet, 6 inches; the Spruce of the same size, and the Hemlock, still larger. This lake commences from two rapids, one running north; the other shapes its course from the north-east, falling with considerable strength, and appears to connect a chain of lakes, bounded by barrens, that have been laid waste by fire. Oak of a good growth, is seen on the bank of this river, and its confluence appears to have been the resort of Indians. The track of a Moose was fresh on the beach, with evident marks of Bears being in the neighbourhood.\n\nThe western side of the entrance into this harbor, is formed by a low rugged island, called Brier's, E. S. E. four miles from Owl's Head. From this island, ledges, partly dry, extend three-fourths of a mile eastward. When past them, you may\nrange along the large island on your West side, and find excellent anchorage under its North point, 6 or 7 fathoms mud; or proceed to Charles River, guarding against the rocks off Black Point.\n\nShip Harbor, proper, commences about seven miles N.W. of Brier's Island, at a beach on the western shore, which has 6 fathoms close to its side. The entrance is one-third of a mile broad, widening as you ascend. Above the island called Green's, are some shoals and ledges, but the anchorages below them, are so capacious and good, there can be no necessity to describe them.\n\nThere are twenty families in the harbor, and on the islands in its neighbourhood, who keep small stocks of cattle. Spars, fire-wood, water, and stock, may be had here.\n\nShoal Bay, in contradiction to its name, possesses a good depth of water, with strong mud, and an excellent anchorage, which is open from either Shoal Bay, or Ship Harbor. To the northward of Charles Island, vessels lie land-locked in 7 fathoms.\n\nA rock that always breaks, lies off the mouth of the harbor. You may pass it close on either side. The water is deep on both shores, and the anchorage shews itself as you ascend; parts of the harbor are sufficiently bold, to admit of vessels of the largest size, lying afloat, alongside the shore; the bottom is black mud. There are seven families, consisting of 41 persons; from them, supplies of stock, &c. may be had.\nTANGIER, like the preceding harbors, is formed by craggy, barren islands, which effectually secure it against all winds: about two miles from the harbor's mouth, is a ledge that dries at low water. Anchor under the eastern shore; the bottom is stiff mud, and the depth 4, 4\\(\\frac{1}{2}\\), and 5 fathoms: There are four families, very comfortably settled here, possessing good tracts of pasture land; they follow the fishing and coasting.\n\nPOPE'S, alias DEANE HARBOR, has a ledge opposite its mouth, forming an obtuse angle with the two points, at three-fourths of a mile from each, with a shoal tail, extending half a mile to the southward: you can pass on either side this ledge, avoiding the shoal, off the outer Tangier Island. The best shelter is under the small island on the eastern side in 6, 7, or 8 fathoms, clay bottom.\n\nA small narrow channel communicates eastward with TAYLOR'S, alias SPRY HARBOR. The two large islands, which the channel separates from the main, are called Gerard's Islands, after those who settled them. These afford shelter, but several dangers lie in the way, and no stranger would take the harbor, except in cases of necessity.\n\nTaylor's Head, which lies on the eastern side of the harbor, being bare of trees, and composed of large white rocks, is distinguishable a long distance. A low shingly beach extends from the point of the head, westward, and is shoal, one-third of a mile off. On the opposite side of the bay's mouth, lies a ledge, and a large dry rock; pass them on either hand, and steer for the East point of Gerard's Islands; sail close to this point: a sunken rock lies off it, 300 yards: thence to the anchorage is safe.\nS.S.E. 3 miles from Taylor's Head, is a dry rock called by De Barre the Hug; the fishermen name it Taylor's Goose. About midway, between this and Beaver Islands, lie the Shag ledges, partly dry, scattered nearly a league East and West. Within and about them is from 7 to 20 fathoms depth.\n\nThe North side of the same channel is called Dutch Town, from its being settled by Dutch families, whose farms are in excellent order, and bespeak great perseverance and industry. Taylor or Spry Harbor is open to the S.E. and S.S.E. winds.\n\nMushaboon, an open port, with a S.E. wind, affords shelter at its head only, in 5, 6, or 7 fathoms mud. It communicates with Sheet Harbor, by a deep and bold passage, between the main land and an island; not a shoal or obstruction in it. You may lash your vessel to the trees, and in 30 feet water, your side touching the cliff, ride secure, perfectly sheltered from all winds: the general depth is from 5 to 8 fathoms, soft bottom.\n\nThere is not an inhabitant in Mushaboon; the lands are so barren, as to be incapable of cultivation. In going through the passage to Sheet Harbor, guard against a sunk rock in its mouth, which, from the smoothness of the water, seldom shews its position. It lies 400 yards off Banbury Island, and may be cleared by keeping the Sheet Rock open of that Island.\n\nThe fishermen living in the neighbourhood are generally ready to attend, on a signal being made.\n\nSheet Harbor derives its name from a blank cliff, on a rocky\nisland at the entrance, wearing the appearance of a sheet. Its capacity is very great, and the deep navigable waters continue to the falls, about nine miles from the Sheet Rock.\n\nThe Islands fronting the harbor form several passages, through which coasters constantly pass and repass; and afford anchorage for vessels of any size.\n\nThe ledges outside shew themselves, excepting the outer one, called by the fishermen \"Yankee Jack,\" from the circumstance of an American fisherman being drowned in its surf. In smooth water it is very dangerous: the position is shewn by the chart. Mr. Gosby, of Halifax, asserts that he struck on a rocky shoal, half a mile South of Yankee Jack. I searched for it without success, yet it may exist.\n\nThe sunken rock within the entrance of the harbor, two feet under water, is in the way coming in. To clear this danger, the Sheet Rock must be kept open of the island next within it, which lies on the Eastern side.\n\nSailing or turning up the harbor, give the sides a very moderate birth; the depth 5 to 11 fathoms, good holding ground. The lands at the lower part of the harbor are stony and barren, but improve towards the head of the navigation, where are two or three farms in tolerable order.\n\nIn 1783, some loyalist families settled this harbor: its present population is, 21 men, 22 women, 51 boys, 62 girls, total 156.\nThe extensive tracts of land in this harbor granted to individuals have much retarded its settlement. The parsimonious steps taken by the heirs, or agents of the grantees, teaze, and harass the feeble attempts of the poor. They drudge on, loath to quit possessions held for many years, yet daily annoyed by the harsh measures of their weightier neighbours. On their first settlement, they erected a church. The frame having decayed, they blended their labors, and prepared a new one. On raising it, they were told the attempt would end in the destruction of the building. \"If they presumed to erect it, it would be burnt.\" The possessor of 10,000 acres could not spare two-thirds of one, for so laudable a purpose. In September, 1815, I saw the frame in a state of decay, lying on the point forming the fork of the harbor, and at the head is a saw-mill frame, under the same circumstances.\n\nAttempts have been made to dispossess these poor people of the sterile and barren spots they have reduced to order, by the labor of many years; and I am pained to add, they have partly succeeded. Neither the court, nor their attorney, was in possession of all the facts relating to the case. To remedy, or even represent the very many existing evils attending a newly settled country, would be useless and unavailing. The above instance of oppression was forced upon my notice.\n\nFrom Sheet Harbor to the eastward is a narrow, winding, but safe channel, formed by Salisbury Island; in the whole of which, the anchorage is secure, from 12 to 28 feet, soft mud. You can go to Beaver Harbor within the islands, but there are several sunken ledges in the way.\nPort Parker, or Beaver Harbor, is zig-zag passages, between islands and ledges, which may afford occasional shelter: the westernmost is Pumpkin Island, the North side of which is quite bold; and the inside, as well as the Beaver large Island, forms an excellent smooth shelter in a southerly gale.\n\nThe island to the Northward of these has in it a deep and bold inlet, where a vessel might lie concealed, and as secure as in a dock.\n\nTo sail into the harbor from sea, border on the Beaver Islands, giving the eastern one a quarter of a mile birth; thence steer up N.N.W. along the side of Sutherland's Isle, leaving to the East of you the Black Rock, which is 10 or 15 feet above the sea, and deep water all round it. Proceed up, and on passing to the West side of the harbor, the houses on the settlement are seen, and you may choose your anchorage, either under Minx Island, or at the harbor's head.\n\nThe basin on the West side, has in it 18 to 20 feet water. You can lie afloat alongside the beach: off the point of the basin, a spit extends North, 300 yards. Four Dutch families from Malagash purchased the western side, 5000 acres, in 1798, from the late Captain Lawson. The property is in good order, and they appear to be doing well: they follow farming, fishing, and coasting.\n\nThe eastern side is a part of 10,000 acres, granted to Colonel Hale, in 1769 or 70. A small rapid river empties itself into the harbor, and at the confluence, four idle families live in most\nmiserable hovels. They attend to cutting wood, for which they get ready cash, and the land remains unimproved. An old soldier of the Prince's regiment has been settled here 15 years, and has cleared about two acres.\n\nWhite Islands, half way between Beaver and Liscomb Harbors, appear of a light stone colour, capt with ever-green. They are about sixty feet above the sea level, bold on the South side: the passage between them is safe, and you may securely anchor inside, good holding ground, 7 to 10 fathoms.\n\nFrom these, the rocks and ledges extend 5 or 6 miles, from East to E.N.E.—they are bold, and mostly dry: the water within them is always smooth.\n\nBay of Islands extends from Beaver to Liscomb, a distance of fifteen miles. The islands, rocks, and ledges, which are innumerable, are mostly seen marking the passages that lie in all directions, with great depth of water within them.\n\nThe eastern entrance of this labyrinth, near Liscomb, is Marie et Joseph, a most excellent harbor. The settlers keep large stocks of cattle, and two coasters. The land is good, and not difficult to clear: here are three families, consisting of 15 persons.\n\nNicomquirque, a small settlement, in the same range: a few salt marshes furnish abundant supplies of winter hay: they are a sober, industrious people.\n\nNewtonquaddy, next East of Beaver, has seven families, upon\nthe side of a shoal river, on land originally granted to Colonel Hale: the grant embraces a part of Beaver Harbor, before-mentioned. The lands are good, and there is considerable marsh about the neighbourhood. The settlement consists of 10 men, 8 women, 14 boys, 20 girls, total 42.\n\nThey have no title to their lands: the possessions being undefined, their disputes are endless.\n\nLISCOMB is justly considered one of the best harbors of this Province: commodious, smooth, deep water, and good holding ground.\n\nSouth, 2½ miles from Smith Point, lies the Black Prince, so called from the ship lost on it. It constantly breaks, and a part of it is uncovered. Smith Point runs off shoal nearly a mile S.S.E. The island side is bold, except a single rock W.S.W. from the South end.\n\nThe harbor's entrance lies about North; and having turned Green Point, its direction is E.N.E. Opposite the first fish stage, half a mile from the shore, is as good a birth as can be desired, in 7 fathoms. Thence the harbor continues navigable 4 or 5 miles. There are two sunken rocks, on the North side, as you ascend. The lands are rocky, and of little value. Three families are here settled, who follow fishing.\n\nA narrow passage, with about 9 feet in it, is formed by Liscomb, alias Bouden Island, leading through towards Jegogan.\nThe S. E. end of Liscomb Island breakers lie off three quarters of a mile eastward; within them, and under the lee of the island, is safe anchorage in 8 to 13 fathoms; and if caught in a S. E. gale, the high land, called Redman's Head, is bold, and affords good shelter in 6 and 7 fathoms clay bottom; the head bearing S. S. E.\n\nThe passage into Jegogan, leads round Redman's Head, at a quarter of a mile distant from the shore. Shag Ledge, from thence, is on the eastern side of the passage, where, under a small island, you may anchor in 4 fathoms, muddy bottom. The land is broken and sterile; one fall r-sides on it.\n\nWedge Island, alias Pierre-à-fusil, is too remarkable to be mistaken, and is an excellent guide to the harbors in its neighbourhood; lying from the entrance of St. Mary's River, South, 2 miles; West, 10 miles from the entrance of Sandwich Bay; and 4 miles, E. N. E. from Liscomb harbor's mouth. The abrupt side of this island is shoreward, and the top of the cliff above the sea 115 feet. Ledges lie off its S.W. end, half a mile; and some sunken rocks obstruct the passage between it and the West point of St. Mary's.\n\nSouth, 2½ miles from the Wedge, lies a fishing bank, covering an area of 200 acres, with 20 to 30 feet on it.\n\nThe River St. Mary is rather difficult of access; a bar of sand lying across the mouth, with 12 feet water on it, which in southerly gales breaks. In approaching the river, border on the eastern shore, to avoid the middle ground, which lies outside the bar, and is in very low tides, dry. The passage over the bar,\nlies on the East side of a small rocky islet; but as it is crooked, no mark can be given: the tide, which is very rapid, shews the passage. By keeping close to the islet, which is bold, you avoid a rock (covered the first quarter flood,) lying opposite to it, near the eastern shore. Thence the channel winds between mud-banks, extending from each shore which are dry at low water; the general depth is from 18 to 24 feet. For about four miles, it runs to the N. N. W. thence two miles, N. by W. and thence N. N. W. two miles to the fork, where it separates: the western branch terminating in a brook; the eastern continues navigable a quarter of a mile from the separation, to the rapids. The town of Sherbrook is at the head of the river, a distance of 12 miles from the sea. The easy communication by water, will tend to raise the town to consideration: there are two saw-mills, a grist-mill, and about twenty houses.\n\nWine Harbor is barred by a sand nearly dry: within the bar is 4 to 5 fathoms. The lands about this inlet are poor. One family, consisting of five persons, has settled and cleared about ten acres.\n\nIndian Harbor, a shallow and unsafe creek, has good lands, well cloathed with pine, maple, beech, birch, and spruce of considerable growth. There are six lakes in a chain, connected with the harbor, and extending nearly across the country to Antigonish. A family named Rude settled here in 1810, and live on the western side of the harbor: they consist of thirty persons, and have made considerable improvements.\n\nEast of Indian Harbor two miles and a half, within heads that\nresemble islands, lies Hollin's Harbor, a place of shelter for coasters, and resorted to by fishermen. In it, are three or four settlers of the worst character, who appear to have chosen it as a retreat from justice. A river called Little Indian, empties itself at the head; its waters take their rise upwards of twenty miles to the N. N. W. draining through several lakes, and join the sea by a considerable brook.\n\nThree miles east of this, is the Port of Bickerton, fit only for small vessels. In it are two families.\n\nThe extensive indent, styled by Des Barre, Sandwich Bay, comprises several good anchorages, and one very superior harbor called Country, navigable for the largest ships upwards of twelve miles from the entrance of the bay. Both shores are bold, and the anchorage is soft mud, with from 5 to 15 fathoms depth.\n\nThe lands adjoining this harbor, were granted in 1783 to the disbanded South Carolina Regiment, who, possessing neither industry nor perseverance, as soon as their provisions were consumed, left the settlement, which still remains in a state of dereliction: two or three that continued, are now owners of very excellent properties.\n\nSixteen families are now seated on the sides of the harbor, and above the navigable waters: the farms are in a state highly creditable to the possessors. Fifty-three bushels of potatoes, besides grain, have been planted this season by Mason, an industrious settler, who lives four miles from the navigable water, with a large family.\nThe river is shallow, descending through some valuable meadow: it rises in the middle of the Province, crossing the Manchester Road, four miles from the sea.\n\nThe new road to Antigonish South River, will open a tract of excellent land, now in a state of wilderness, almost free from water, and on it very little stone. This statement is made from actual examination.\n\nIn October, 1816, five axemen accompanied the Assistant Surveyor General through these lands, in search of a favorable position for laying off lands granted Captain Losack and others: after passing numerous lakes, which feed the waters of Country Harbor, they came to dry good soil, with timber of very large growth: the land in easy inequalities, favorable to settling. No position in the Province is more advantageous for settlers than this harbor: at its mouth the islands afford shelter to fishermen and small vessels, as well as the means of erecting their stages; and the fishing grounds at a short distance in the offing abound in halibut, haddock, and cod: and what they term the bait fishery, that is mackerel, gasperaux, smelt, &c. Salmon are plentiful in their season, and, but for the improvident use of this valuable addition to their means of subsistence, would continue for ages. In the River St. Mary, and many other places, where they are found in great plenty, nets are continually down during the season, and too frequently stretched from side to side of the rivers. Many of the mill dams choke the entire course of the brooks, and the Indians are allowed to destroy them in the narrow passes. These abuses exist unknown to the Government, or means might be used to preserve to posterity this luxury.\nThe ledges lying off Country Harbor generally break: between them are deep passages. There are two rocks to be avoided, coming from the eastward; give Green Island a small birth, and thence up the harbor. From the westward, are two rocks, Castor and Pollux, which are above water; and being bold to, may be approached: from them give Point Mocodome a good birth, to avoid the Bull, an ugly sunken danger, that breaks only in bad weather. The Black Rocks are partly dry, and from them upward there is no danger, and the anchorage is good.\n\nEast of Country Harbor is Isaacs, one of the anchorages here alluded to; and westward is Fisherman's Harbor, a favourite resort of the American fishing vessels, from the advantage of the shingley beach, forming an elbow, convenient to dry their fish. On the eastern side of the Bay, leading to Country Harbor, are three low islands, covered with scrubby trees: the outer is called Green Island, the middle, Goose Island; and Harbor-Isle is the inner, within which is an excellent anchorage. The two latter islands are called by Des Barres, William and Augustus.\n\nSailing eastward from these islands, and within them, you pass two dry ledges, leaving them to the southward; the passage else is clear of danger, and from 10 to 14 fathoms deep.\n\nCoddle's Harbor is a shelter for small vessels: its entrance is on the East side: in bad weather clearly shewn by the breakers.\n\nA deep inlet, called New Harbor, presents itself about seven miles from the islands, connected with a chain of extensive\nlakes; but a bar across the mouth completely obstructs its navigation. The lands are good, and the lakes abound in salmon, trout, gasperaux, and eels. But the harbor not affording shelter, those who at first attempted to settle it, abandoned their project. Even the small vessels that resort to it in the fishing season, are obliged to leave, the moment a southerly wind comes in.\n\nThe shore between Country Harbor and Torbay, except New Harbor, is rocky and sterile, with deep water close in, and regular soundings off, to 20, 25, and 30 fathoms.\n\nTorbay is easy of access from the westward; but E.S.E. of Berry Head, and South of George's Island, lie three very dangerous rocks, which, in smooth water, do not break.\n\nBerry Head is bold, but the low point within, runs off shoal one-third of a mile; thence close under the western peninsula, you have 4, 5, and 6 fathoms mud, excellent smooth anchorage, up to the eastern part of the bay; or you can, when round Berry Head, and steering North a little easterly, anchor E.N.E. of Foster Island, in 3, 5, or 7 fathoms mud, and perfectly safe with any gale.\n\nThere are in this Bay twenty-one families, consisting of ninety-one persons, all comfortably settled, chiefly occupied in the fishery, and building vessels from 40 to 120 tons.\n\nThe lands are very rocky; a few salt marshes enable the settlers to maintain small stocks of cattle.\n\nWhitehaven, the eastern extremity of Torbay, is formed\nby a parcel of craggy islands, the outer and larger of which, called White Head, from the colour of its sides, is seventy feet above the level of the sea: at the distance of 5 or 6 leagues, it appears round and smooth: the passage in, is on either side, running up mid-channel. The anchorage is all good, in 7 or 8 fathoms, a considerable way up. Off the head are two breakers, one S.S.E. the other E. by S. half a mile off. The lands around are hideously barren, appearing the resort only of crows, eagles, and monsters. Large bodies of water empty themselves into the harbor. The fishermen resort hither from Arachat, and the western extremity of the Province, during the spring and summer, for the purpose of catching mackerel, herring, and gasperaux: the American fishermen and privateers have hitherto used it, both in peace and war.\n\nRaspberry Harbor, alias Port Howe, though small, is a safe and commodious anchorage: the shores within the harbor are quite bold. On the eastern side of the entrance is an island; and South-eastward, close to it, a ledge. Round this ledge, and steer in for the harbor. The island which lies in the middle is bold: anchor under it in 7 fathoms.\n\nTwo single rocks are laid down on the eastern side of the entrance from Des Barres: I searched, but could not find them; and entered the port in a gale, without observing them break.\n\nThe country about the harbor, as far as the eye can reach, is a continued barren: here is a quarry of granite, much used for millstones. The shore from Torbay to Cape Canso is exceeding craggy and broken. No adequate idea can be formed of the horrors of this part of the coast, in a southerly gale.\nThe outlet between Raspberry Island and the main is a complete dock, where vessels can lash to both shores, and lie in 30 feet water; but halfway through, it has only 10 feet.\n\nDover Bay is a wild and deep indent, with a number of islands and sunken rocks at its head. Bordering on the western shore, shelter may be found, where the anchor is placed on that side in the chart; or in a South-east gale, by giving a birth to the rocks off the South end of Big Dover Island, (which in bad weather appear distinctly) hauling up under the Island, and anchoring between the small islands on the eastern side: within these islands, Little Dover Passage continues out South-eastward, 5, 6, and 7 fathoms deep, secure in any weather.\n\nThese places deserve notice, as they may afford shelter in cases of emergency: and in time of war, are nests for privateers. From the heights in their neighbourhood, which are bare, may be seen whatever is passing, to a great distance in the offing.\n\nEastward of Little Dover is St. Andrew's Channel, of which no directions can be given; the single rocks are so thickly planted, even those who are well acquainted frequently blunder upon them. This passage leads to Glasgow Harbor, which is, in fact, a part of Canso Harbor.\n\nIn the Tickle, formed by Durell's Island, there is generally, in the spring and fall, a number of small vessels assembled to catch mackerel and herring, of which large shoals pass, having escaped the nets on the S.E. coast, or have made the Cape from a more southerly direction, round Chedabucto Bay, pass through\nthe Gut, thence northerly, their course of migration, I think, might be easily traced to the Polar regions, and dissolve the new and favorite theory of a few who have fancifully packed them in mud during winter; and it is told that a Mr. Pléville-le-Pelley, in Hudson's Bay, saw the bottom completely bristled with their tails and fins, through the mud!\n\nThe extensive Bay of Chedabucto is free of danger; the South shore is high, bold, and nearly straight. Fox Island and Crow Harbor are on this side, and considered excellent fisheries: the latter is a safe anchorage for large vessels. Sailing in or out, pass to the S.W. of the island that lies in the entrance, and run eastward, towards the head, until sheltered: you anchor in 5 to 8 fathoms, stiff mud.\n\nSalmon River rises a considerable way in the interior, and descends through an extensive tract of excellent land. To the northward of this River lies Guysborough, alias Manchester. The river is considerable, and, when over the bar, a place of perfect security for any sized vessels. The entrance is narrow, and the tides run in and out with great velocity. The town is seated on the South side the River; and although very favorably situated, both for foreign trade, and a communication with the interior, it has made little progress. A battery of six 24-pounders commands the entrance.\n\nFrom Manchester, round the North coast of Chedabucto Bay, through the Gut of Canso, even to the head of Bay Verte, the shore is thickly settled, and the land wears a pleasing aspect.\nThe lands in the neighbourhood of Cape Canso are low and sterile, with several rocky islands to the N.E. covered as are the lands, with stunted fir trees.\n\nIn consequence of the many and frequent losses of property and lives in these parts, the Government has humanely directed a light-house to be erected on the southern-most of these islands. This light will not only prevent many serious calamities, but stand as an illumined beacon, at the conjunction of several high roads. The timber and infant coal-trade from the northern districts will receive material benefit from it. Vessels bound to this Province, and to the Bay of Fundy, will confidently run in its parallel of latitude. The Gut of Canso will, by its means, become the common gate-way to and from the Gulph and River St. Lawrence, and it will tend to mitigate the rigors of a late or early passage to Quebec.\n\nS.E. seven-tenths of a mile from the Cape lies the Bull, a sunken rock that generally breaks; and one mile E.S.E. of it, a rock said to exist, discovered by a fisherman of Canso, in 1813, but I could not, in the most diligent search, find it.\n\nCanso Harbor is well sheltered, with good ground, and sufficient depth for vessels of any burden. In a rough sea the dangers of the passages shew, but in smooth water it would be hazardous to enter them without a pilot. The Arachat fishermen frequent the neighbourhood: they are sober, steady men, well acquainted with the intricacies of its navigation: their vessels are schooners from fifteen to forty tons.\nThe course from the North passage of Canso Harbor to the Gut of Canso, is N.N.W. and to Arachat, North.\n\nTides flow till 8 o'clock on full and change, and usually rise eight feet; the flood setting to the northward, the ebb to the southward, at about one mile and a half to two miles per hour.\n\nThe Gut of Canso is formed by the lands of Cape Breton on the East, and those of Nova Scotia on the West. Its general width is a short mile, and twenty-one miles in length, with deep water from end to end. The lands are good, and the hills moderately high, rising in easy acclivities, with settlements on the whole range of the shore, for the most part in good order.\n\nFrom Sandy Point, which forms the western side of the southern entrance, extends a sand-flat about a quarter of a mile from the shore: thence both shores are bold, with anchorage on either side.\n\nSix miles from Sandy Point, on the West side, is Pilot Cove, affording good anchorage out of the strength of the tide, in 6 or 7 fathoms, muddy bottom. On the eastern shore are two sunken rocks, one opposite this harbor, the other a little southward of Balaches Point, both close to the shore, and may be considered a part of it.\n\nShip Harbor, a mile above Pilot Cove, on the opposite shore, is a convenient good retreat.\n\nTwo miles above Ship Harbor is Plaister Cove, on the same\nside. The white plaster cliff shews in approaching from the southward, when opposite Pilot Harbor. This valuable quarry of gypsum appears exhaustless, and very easily wrought. Vast quantities might be exported, if conducted with spirit. At present it can only be shipped at high water. The anchorage at the mouth of the Cove is soft mud, in 4 to 10 fathoms. Opposite stands Cape Porcupine, a bold precipice of five hundred and sixty-two feet high. Here the Gut is only a quarter of a mile wide, and 35 fathoms deep, near the Cape.\n\nTo the northward of Cape Porcupine, the best anchorage is on the western shore, close in.\n\nJust without the entrance lies Aubushee a small harbor, settled by people from Arachat, who are very industrious and thriving. They build a number of vessels, from fifteen to fifty tons. From this harbor a rocky flat extends in a North-westerly direction, about a mile, nearly dry.\n\nFrom Aubushee round the Bay called Antigonish to Cape George, the shore is flat, and free of rocks: under the Cape is good anchorage, in 7 or 10 fathoms, sheltered from westerly winds.\n\nThe branches of Antigonish River rising in the interior, through many miles of as fine land as any in the Province; settled first in 1783, by the Carolina Regiment, and at present populous, and rapidly improving in agriculture. Vessels that load here with plaster, are obliged to complete their cargoes outside the river's mouth, for want of depth.\nFrom Cape George to Merigomish the shore is high, bold, and straight; without a single inlet or place to shelter the smallest description of coasters. In consequence, much inconvenience has been felt, and, I believe, some lives lost. To remedy this evil, the Provincial Government has granted a liberal sum for the erection of a pier, three miles westward of the Cape, and eighteen east of Pictou; at a slight indent called the Barn, from a high rock, resembling a building. The pier, in its present state, shelters small vessels; but its extension is in contemplation, which may be done, to receive vessels of large size. The whole extent is well settled; the large barns and extensive clearances indicate favorably, both of the inhabitants and soil.\n\nPictou Harbor, situate on the N.E. Coast of Nova Scotia, is rather a river than a harbor, with a bar across its mouth, on which, at low water, is fifteen feet; and outside the bar lies a shoal, called the middle ground, seven feet under water. The windmill near the town, in a line with the beach, forming the left or South side of the harbor's entrance, is the mark to clear the middle ground, as also for the deepest water. Over the bar, within the beach, the water deepens to 5, 6, and 7 fathoms, muddy bottom; and continues that depth to the town, opposite which the mud flat extends some distance; leaving the channel about midway between the shores. Just above the town the river divides into three branches, the East, West, and middle. Up the eastern branch, the channel, though winding, is navigable about four miles for vessels drawing fifteen feet; a bar there crosses the river, and the coal is shipped from large flat boats. Above the bar the water runs deep, as high as New-town Glasgow. The pits are nine miles from the town of Pictou, and\nare likely to be worked extensively. The West and middle rivers are navigable a considerable distance, by a narrow winding channel between the mud-banks. The lands are good, and the population rapidly increasing.\n\nTwo miles North of the mouth of Pictou River lies Cariboo, a small harbor, difficult of access, but quite safe inside. Ships load here with timber, but as a pilot is absolutely necessary to enter, directions are superfluous.\n\nOpposite Cariboo Point lies a rocky shoal, half-way across, with ten feet water on it; in circumference a quarter of a mile; round it are 4, 5, and 6 fathoms: the tide, both ebb and flood, runs rapidly over it. The ledges off Cariboo extend upwards of a mile from the shore: some of them dry. Several vessels have mistaken Cariboo for Pictou: the hollow land over the former appears a deep inlet, and Pictou high lands, folding over each other, blind the harbor.\n\nIsle Pictou, the property of the Honorable Sir Alexander Cochrane, contains about two thousand acres of tolerably good soil. Three families have settled on the South side, and their improvements are considerable. Fine quarries of free stone have been opened, and strong traces of coal are visible in several places, about the cliffs. Off the East end lies a spit of rocks half a mile; and E. N. E. four and a half miles, a shoal with 21 feet water on it. Between this isle and Merigonish, the depth is 7 to 11 fathoms, an even muddy bottom.\nE. S. E. eight miles from Pictou, lies Merigomish; a bar of 14 feet crosses the mouth: within, the depth is from 4 to 7 fathoms, soft mud.\n\nFrom Cariboo to Cape John the depth gradually lessens to the shore; say at two miles, 8 or 9 fathoms; round Cape John is Tatmagouche and River John, and a point separating these from Ramsheg Harbor. These Harbors are good, and well sheltered; but as a pilot is absolutely necessary to any vessels entering them, a full description is better avoided. Off Tatmagouche lies Amet, a low isle, from which a flat extends half a mile: thence twenty-five miles is Pugwash, a blind little harbor, with a reef or ledge at its eastern point, and at its mouth a bar of 18 feet. The pilot is in constant attendance, and no ill can accrue from passing the harbor: the mistake would exist only a league or two, as the opposite point, Tormentine, would shew itself.\n\nFrom Pugwash to Point Tormentine is fifteen miles, which may be considered the width of Bay Verte, and its depth from this line to the confluence of the salt and fresh water at its head, is also five leagues. The shores on each side sensibly wash away, leaving cliffs at the Promontories, with flats off each, formed by the earth lost from the shore: the water gradually deepens, and the anchorage is good. Vessels of considerable burthen take in cargoes of timber up the creeks: a channel winding between the flats has 17 to 20 feet water.\n\nThe features of the North-eastern coast are soft and pleasing; the land low and even, or slightly broken by inequalities that\nrelieve the eye. Settlements are formed and forming along the shore; and the interior, from Bay Verte to Amherst, Cumberland, Tantamaree, &c. is in a highly improved state.\n\nA rocky shoal off Point Tormentine, in shape resembling a fan, covers a large extent. The outer part, 20 feet, lies three miles from the point: vessels of small draught pass within it.\n\nThe Straits of Northumberland, formed by Nova Scotia and New Brunswick on the South, and Prince Edward's Island on the North, is about one hundred miles in length, with a pretty general depth of water from end to end, say 10 to 16 fathoms: the bottom is a red stiff clay, good holding ground.\n\nThe dangers in it are the shoal off Pictou Isle, Tormentine ledge, and the shoal to the westward of Prince Edward's: the anchorage on either side is good holding ground.\n\nMy examination of the coast ceased here. At a future period it may be considered worthy attention. Miramichee, Gaspee, as well as the neighbouring parts, are fast lifting into consequence.\nTIDES.\n\nOn the whole S. E. and S. W. coast, when uninfluenced, flow till eight o'clock; to the eastward rather earlier: the general rise is from 6 to 9 feet.\n\nAt Cape Sable the flood-tide sets up the Bay of Fundy, commencing that direction a little eastward of the Brazil Rock; thence to Cape Canso, the general set of the flood is eastward, in a direction with the shore, and the ebb westward.\n\nIn the Harbor of Halifax the tide runs at an easy rate, seldom rising higher than 8 feet.\n\nThe tides between Halifax and Cape Canso are not regular: they flow till near nine o'clock; rising from 6 to 8 feet, the flood setting eastward, the ebb westward. Near Cape Canso, the flood courses northerly through the channels which lie scattered about the eastern extremity of this Province; thence up the Bay\nof Chedabucto: but its bodily strength towards the Gut of Canso, rushing through it with great rapidity. At Cape Porcupine particularly, the narrowest part of the Gut, it seldom runs at a lesser rate than four or five knots: generally flowing a quarter past nine at full and change; the ebb in a contrary direction.\n\nAlong the shore, past Aubushee, Antigonish Bay, rounding Cape George, and continuing through the Straits of Northumberland, the flood sets in a North-westerly direction, and flows till between seven and eight o'clock on full and change: the perpendicular rise, from 4 to 7 feet.\n\nAt Pictou the tide rises on the bar only 3 feet, and within the harbor 6 feet; the cause of this irregularity I had not time to discover.\n\nThese are the tides' natural courses, and although the times of ebbing and flowing do not materially change, they are almost continually varied by the winds.\n\nA southerly gale accelerates the ebb of the St. Lawrence, which with the waters of the gulf are pressed through the Straits of Belle-isle, consequently draining the stream northerly between Cape Ray and Cape North; as also the stream of the Gut of Canso, which for many successive days runs one way.\n\nA North-westerly gale turns the stream southerly between Cape Ray and Cape North, and presses the water through the gut; thence arises the uncertainty of the gut stream, which continues its course southerly till the level of the water is restored. Lateral\nwinds have only a partial effect; for example, a strong easterly wind arrests the ebb in its course through St. Paul's Straits, and increases the stream in either the Belle-isle Straits, or the Gut of Canso.\n\nThis irregularity causes the many wrecks that happen every season in the neighbourhood of Cape North: some of them attended by circumstances truly distressing. No tabular account can ever be given of the currents of the Gulf St. Lawrence, and the Gut of Canso. I have strongly urged the erecting a lighthouse on St. Paul's Island, being convinced it would prevent a recurrence of these dismal calamities.\n\nWhen it is considered that the rivers of the Mediterranean are considerable, and most probably supplied from it, and also the vast exhalations that take place from a sheet of water surrounded by high lands, concentrating and attracting the whole force of the sun's rays, the rush of water eastward through the exceeding narrow pass, the straits or Gut of Gibraltar, is no longer surprising: nor is it necessary to resort to the imaginary understream, to expend the influx.\n\nThe secretion of the waters exhaled continues a considerable time, and when discharged, they are diffused over the face of the earth. I mean the marginal soil of the Mediterranean.\n\nSpeaking of the motion of the waters, this extraneous remark is given to remove the doubts which (without reason) are entertained of the moon's influence. These doubts generate in the irregularities observed in some places, that may be traced to peculiar causes.\n## LATITUDES AND LONGITUDES.\n\n| Location                        | North | West | Var. W | & | Rise |\n|---------------------------------|-------|------|--------|---|------|\n| Halifax, Naval Yard             | 44    | 40   | 765    | 32 | 517  | 28   | 8   | 7 to 9 feet. |\n| Light-house                     | 44    | 28   | 8063   | 30 | 30   |      |     |                  |\n| Green Island, Mahone Bay        | 44    | 25   | 2063   | 58 | 40   | 16   | 12  | 7   | 58   | 6   | 8   |\n| Aspatagoes High Lands           | 44    | 33   | 63     | 69 |      |      |     |                  |\n| Cape Le Hove                    | 44    | 12   | 4864   | 16 |      |      |     |                  |\n| Liverpool Light-house           | 44    | 4    | 64     | 34 | 50   |      |     |                  |\n| Little Hope Island              | 43    | 48   | 5764   | 46 | 43   | 15   |      |                  |\n| Shelburne Light                 | 43    | 40   | 3065   | 8  | 14   |      | 7   | 50   | 6   | 9   |\n| Cape Negro                      | 43    | 33   | 5065   | 15 | 40   |      |     |                  |\n| Brazil Rock                     | 43    | 25   | 3065   | 22 | 14   | 30   |      |                  |\n| Cape Sable                      | 43    | 27   | 4065   | 33 | 14   | 27   | 7   | 45   | 6   | 12  |\n| South Seal Island               | 43    | 28   | 65     | 57 | 30   |      |     |                  |\n| Cape Fourchu                    | 43    | 52   | 66     | 9  |      |      |     |                  |\n| Brier's Island Light            | 44    | 19   | 66     | 20 | 40   | 15   |      |                  |\n\n### Grand Manan, South end\n\n| Location                        | North | West | Var. W | & | Rise |\n|---------------------------------|-------|------|--------|---|------|\n| North                           | 44    | 52   | 5066   | 46 |      |      |                  |\n| Manan, S. E. ledges             | 44    | 37   | 4066   | 40 |      |      |                  |\n| Gannet Rock                     | 44    | 35   | 3066   | 51 | 10   |      |                  |\n\n### Shut-in Island\n\n| Location                        | North | West | Var. W | & | Rise |\n|---------------------------------|-------|------|--------|---|------|\n| Jedore Head                     | 44    | 37   | 2463   | 15 | 30   |      |                  |\n| Southernmost Jedore ledges      | 44    | 38   | 62     | 59 | 30   |      |                  |\n| Owl's Head                      | 44    | 42   | 4563   | 48 | 37   | 17   | 32  | 8   | 30   | 5   | 7   |\n| Cape Spry                       | 44    | 46   | 3062   | 31 | 30   | 17   | 10  |      |                  |\n| Liscomb Harbor entrance         | 44    | 56   | 61     | 54 | 40   | 17   | 17  |      |                  |\n| Wedge Island                    | 44    | 57   | 5561   | 47 | 30   | 17   | 40  | 8   | 37   | 6   | 9   |\n| Green Island, Country Harbor    | 45    | 6    | 561    | 30 | 516  | 16   |      |                  |\n| Berry Head, Torbay              | 45    | 12   | 61     | 18 |      |      |     |                  |\n| White Head, Whitehaven          | 45    | 12   | 2061   | 9  | 18   | 40   |      |                  |\n| Bull Rock, Cape Canso           | 45    | 19   | 5060   | 58 | 30   |      |     |                  |\n| Canso Light, Cranberry Island   | 45    | 21   | 60     | 58 |      |      |     |                  |\n| Sandy Point, South entrance, Gut| 45    | 31   | 61     | 15 | 20   |      |     |                  |\n| North entrance of Canso Gut, or Ship Harbor | 45    | 42   | 61     | 29 |      |      |     |                  |\n| Pictou Island, North end        | 45    | 51   | 62     | 28 | 30   | 19   | 40  | 9   | 6    | 9   |      |\n| South end                       | 45    | 48   | 3062   | 34 | 10   |      |     |                  |\n| Pictou Harbor                   | 45    | 41   | 62     | 40 |      |      |     |                  |\n\n### Sable Island, East point\n\n| Location                        | North | West | Var. W | & | Rise |\n|---------------------------------|-------|------|--------|---|------|\n| West point                      | 44    | 5    | 60     | 3 |      |      |     |                  |\n\nThe mean increase estimated from all the old variations given, make 6' annually.\nHaving commenced at the capital of the Province, and described the coast eastward, it is expedient to proceed with the harbors West of Halifax.\n\n**Ketch Harbor**, a small barred inlet, N. N E. of the light, has 9 feet water at the entrance: inside are 3 and $8\\frac{1}{2}$ fathoms. Twenty families, consisting of a hundred and twelve persons, are here settled, who get a comfortable subsistence, by supplying the market of Halifax with fish: they are a sober, industrious people.\n\n**Sambro Harbor** is a league North-westward of the light-house, easy of access, and perfectly sheltered, with sufficient depth for any vessels. The coasters of Nova Scotia resort hither in bad weather: frequently are collected from forty to fifty small vessels in this retreat.\n\nIn 1780 this harbor was settled; it now has thirty-one families, in all a hundred and fifty-five persons, who are fishermen. The lands are barren, incapable of improvement, except a few spots on which are raised a scanty supply of vegetables.\n\nShips, making the land, by mistake, to the westward of the light, or in foggy weather, being within the ledges, may, by the annexed chart, run into Sambro, or between the light-house and Chebucto Head. Those having charge of ships which frequent Halifax, should know this passage: several vessels have been lost, that by a knowledge of it would have been saved.\n\n**Fennant Harbor**, round the low point next West of\nSambro, has good anchorage, but is seldom visited. The islands contiguous, are bold, and afford within them safe anchorage.\n\nThe other small harbors and indents I have not yet had time to examine: should the survey be continued, they will be added at a future period.\n\nProspect Harbor lies within several small islands, and presents to the eye of a stranger the rudest features of nature. It is extensive and safe; and in bad weather (the only time vessels of consequence would enter it) the dangers shew themselves. The inhabitants, twelve families, have seated themselves on the left side of the harbor's entrance, on two small islands, forming a little cove, in which they have erected their stages, and cure about two thousand quintals of cod-fish, besides mackerel, herring, and gasperaux.\n\nShag Bay and Blind Bay, two deep inlets in the same indent, both possess excellent anchorage: they are situated twenty miles W. N. W. of the light-house.\n\nOn the western side of the entrance of Blind Bay are the islands forming the Port of Dover, a very safe and good anchorage. The best passage is to the eastward of these, giving them a moderate birth, and anchor within the body of the largest island, called Taylor's or Inchkeith, in 7, 9, or 10 fathoms, muddy bottom.\n\nThe lands between Halifax Harbor and Dover are craggy, broken, and barren; the shore iron-bound and steep, scarcely a\ntree to be seen, in the whole distance of twenty miles. Yet in the memory of several persons living this naked tract was clothed, except the outermost projections, with a growth of fir, spruce, hemlock, birch, and beech. The fire getting into the woods at the dry season of the year, and impelled by the wind, spread over the greater part of Halifax township, consuming an immense body of valuable wood, to the great injury of the inhabitants. The wooden fences on the peninsula were destroyed, and Halifax depended, for hay and other supplies of ground provisions, on Massachussets. It was this necessity, stimulated by a bounty on stone fences and English hay, raised on the peninsula, that introduced regular inclosures, and ultimately reduced to order, the lands about the town.\n\nThe line of coast above-mentioned abounds in fish, and the little ports and harbors are most conveniently situated for the fishery. Great quantities of cod, herring, and mackerel, are annually sent to market, chiefly cured.\n\nMargaret's Bay is about twenty-five miles in circumference, in length nine, and two miles wide at the entrance. In this beautiful sheet of water are harbors capable of receiving ships of the line, even against the sides of the shores.\n\nOn the West side of the entrance, about South from S.W. Island, distant one mile and a half, lies a ledge, part of which is above the water, shelving on all sides, and in bad weather the sea breaks on it very heavily. Opposite South-west Island to the E.N.E. lies a rock with 24 feet on it. This rock cannot be\ndeemed a danger, the sea breaking on it in bad weather; the only season the heaviest class of ships could possibly strike it.\n\nSouth-west Island is a body of rock, say 50 feet high, and bold-to on all sides: the passage is good between the Island and Owl's Head: the latter is an abrupt precipice.\n\nNorth-west Harbor is a tolerable anchorage for small craft: the fishermen inhabiting this nook are well circumstanced, and consist of eight families. They occasionally trade to the United States.\n\nFrom the North-west Harbor the western shore of the bay continues bold and rugged. A small rock very close to the shore, above Birch Head, with 6 feet water on it, is the only detached danger.\n\nLong Cove is a good anchorage, with the wind westward: a saw-mill is driven by an excellent stream, supplied by two lakes, handy to the shore: but owing to the fire ranging the woods, a scarcity of timber is felt.\n\nThree miles northward of Long Cove, and nine miles N. N. W. from S. W. Island, is Hubbert's Cove; by keeping the western shore on board may be entered by a stranger, and a ship dismasted or in distress may find a perfect shelter in this recess, and if without anchors, may run on the ground in safety. A cooper, carpenter, and fisherman, are here very comfortably seated, and the ground, capable of tillage, is in excellent condition, and very productive: a saw-mill was last autumn erected on a\nfavorable seat at the neck of the upper lake, and from thence\nthe timber is drawn by oxen to the sea.\n\nHubbert's Ledge is a ridge of rocks, about a hundred fathoms\nin length, and covered at high water, so that in smooth water and\nthe top of the tide, this danger is hidden; but both shores con-\ntiguous to the cove being bold, the ledge is avoided by bordering\non either side. From thence eastward to the North-east corner\nof Margaret's Bay are several indents, with rugged points project-\ning; from these places, the small vessels take building-sand and\nlime-stone, which is here in abundance, and the latter of a\nsuperior quality. Cooper's and Indian Rivers are both shallow\nand rocky nooks, although great resorts for salmon. The trout\nin the lakes above, are in vast quantities; in length from seven\nto thirteen inches, delicate to the taste, and the fish of a deeper\nred than salmon.\n\nMoser Islands are sheep-folds lying in the way to Head\nHarbor, an anchorage of the first order, and so perfect a place\nof safety that a fleet might be securely moored side-by-side,\nunaffected even by a hurricane. The lands are high and broken.\nMason's Point is in itself a good farm, well worked, and stocked\nby strong cattle. There are in this neighbourhood ten families,\nwhose habitations are snug, warm, and crowded with healthy\nchildren.\n\nFrench Cove may be considered an extensive dock, easy of\naccess, and the depth 5, 7, 8, 10 fathoms, mud bottom. Germans,\ninhabit this settlement, whose farms, houses, barns, and vessels,\nshew their persevering industry in a favorable view.\nA shoal with 10 feet water on it, lies opposite the mouth of French Cove, at a distance of two miles; but as the islands on the eastern shore are bold, a vessel seeking shelter can have no business wide of either side.\n\nJolliman's Island is a valuable sheep-fold, and under the lee, the anchorage is safe for ships of any size.\n\nLuke's Island is the property of an Acadian, who keeps on it about eighty sheep: this is also a compleat break to the sea, and the anchorage North-eastward of it is smooth in all seasons.\n\nHagget's Cove and Indian Harbor are fit only for fishing vessels.\n\nShut-in Island is two hundred and eight feet high, covered with wood, and bold to. A ledge 9 feet under water lies between Patty's Point and the South end of the Island. In a southerly gale the water is smooth in the island's lee, and the depth from 10 to 14 fathoms, good bottom.\n\nA sunken rock lies off the second point South-eastward of Patty's Point, distant about three hundred yards; but this danger lies outside the bay.\n\nThe course from Dover or Inchkeith Island, to the eastern point of the bay, is W. N. W. three miles, along a rugged steep shore, against which the sea breaks violently. The high lands of Haspotagoen are very conspicuous, on the isthmus separating Margaret and Mahone Bays: they may be seen seven or eight\nleagues. Immediately below is the small harbor and settlement of Haspotagoen. South, two miles from the western point of Charlotte Bay, a ledge shews itself; and W. N. W. of it, near Mahone Bay, another, called Sea-ledge. They are always uncovered or breaking, and therefore never dangerous with a good look-out.\n\nMahone Bay, next West of Margaret's, is equally extensive, though differently formed. At its entrance are some dangerous ledges, and several small islands, forming commodious harbors, as well as convenient places for fisheries.\n\nAt the head of the bay, the town of Chester was settled in 1760, by thirty families from New England, consisting of a hundred and forty-four persons; they brought with them their stock and cattle, and went industriously to work in clearing the ground, and enclosing their clearances. The small islands at the head, enable them to keep a number of sheep, and present as fine scenery as the imagination can paint.\n\nIn 1784, a few loyalist families came hither with some property, but unacquainted with farming, they expended their money on buildings and unprofitable pursuits. Discouraged and disappointed, most of them abandoned the settlement, and returned to the United States.\n\nThere are two grist, and two saw-mills: good seats for many others are formed of the two principal rivers that fall into this bay. Several schooners and square-rigged vessels have been\nbuilt at this port, which abounds in every wooden material for ship building.\n\nApproaching the bay from the eastward, the first land is Green Island, round, small, bold, and moderately high. Thence to Ironbound and Flat Islands, is about two miles and three quarters, both bold: passing between, proceed to the Tancooks, which are settled; the passes between them are bold, and the anchorage good under the lee, in 7 to 12 fathoms.\n\nSailing the bay towards Chester, the only danger is a ledge, partly dry, about two miles northward of Great Tancook. The islands off the town, make the harbor quite smooth and secure; the depth from 2 to 5 fathoms. Westward of Great Tancook, are two shoals, one with 6 feet on it, a mile and a half W. S. W. of the little islet on the N. W. side of Tancook; the other one-third of a mile off the western point of the island.\n\nThe Bull rock uncovered at one-third ebb, lies a mile and a half South of Tancook, and three-fourths of a mile West of Flat Island; deep water all round it.\n\nChester Church, open of Great Tancook, carries you clean to the westward of this rock, down to the two Duck Islands, which are small, low, and tolerably bold; between them 10 to 14 fathoms. From these Islands to the head of Mahone Bay, along the western shore, are several places of perfect security for vessels of the line.\n\nLunenburg was first settled in 1753, by Dutch and Germans,\ntransported to this country, the two preceding years, at the expense of government. They consisted of two hundred families, amounting to fifteen hundred persons, and were supplied with farming tools, and materials for building. One thousand pounds was expended in stock and cattle; the government maintained them for three years, and till 1762, considerable supplies of flour and grain were annually sent them. At this period, two vessels only were owned by the settlement; but encouraged and supported, they discovered an active spirit of industry, which has met with deserved success; most of them are comfortably settled, and many of them opulent. Vessels of different descriptions are now constantly plying between this settlement and Halifax, carrying to market, chord-wood, lumber, hay, cattle, stock, and all kinds of vegetables. The population may be computed at four thousand two hundred souls.\n\nThe harbor is easy of access, with anchorage to its head. Keep mid-channel between the island at the mouth, and the eastern point. When within the island, border on either side, to avoid a sunken rock lying in the middle, three feet under water. The best passage to turn in is the western. Alongside the wharves are 12 and 13 feet water; close off them, 20 to 24 feet soft mud.\n\nCross Island, containing two hundred and fifty-three acres, in height about 30 feet, lies at the entrance of Lunenburg, the property of Mr. Smith, by purchase: he resides on the N. E. side, in a small nook where coasters lie secure. The Hounds, a ledge of rocks, lie off the N. E. part, across the channel. The West and South sides of the island are bold, and South two miles from the South end, is an excellent fishing bank, from 14 to 17 fathoms.\nIn ascending the bay, opposite the Ovens, which are hollow cliffs on the western side, lies a rock with 12 feet on it, called the Sculpin, about half way across. This place is much exposed to South-easterly gales.\n\nLe Heve granted in 1760 to two hundred and sixty proprietors from Connecticut, few of whom attempted to settle; those who did, remained about a month, and then quitted their situations. The lands have since been re-granted to sundry persons, Germans and others, who have increased in population and improvement. They have erected fifteen saw, and two grist mills; several square rigged vessels have been laden here for the British market, with birch, beech, and pine timber, spars, hand-spikes, capstern-bars, and plank, both oak and pine.\n\nThe land about the harbor, is high and very stony, covered with spruce, birch, beech, pine, and hemlock of a large growth. Above the navigable waters, the lands are very good, and some farms in neat and excellent order.\n\nFrom Lunenburg to the island called Iron-bound, at the eastern entrance of Le Heve, the shore is bold, and the distance about twelve miles; on this island a family resides; from thence to the bar of the river is about four miles, N.W. and the depth 12, 10, 8, 6, and 4 fathoms, and under the islands at the western side good sheltered anchorage. On the bar is twelve feet, and the deepest water one third across from the eastern shore. When over the bar, the water deepens to 4 and 6 fathoms, continuing navigable to the falls which are twelve miles higher. The general width of the river is half a mile: the road from Lunenburg to Liverpool strikes the bank about eight miles up, and a ferry-boat\nattends for the convenience of travellers. On the western point, above the bar, may be seen the remains of a French fort, built in 1737.\n\nCape Le Heve, is an abrupt cliff, 107 feet above the sea, W. by S. eighteen leagues from the entrance of Halifax. One mile S. E. by S. from the Cape, lies the Black Rock, ten feet high, and one hundred feet long, with deep water round it, and 10 to 14 fathoms deep from the shore. From the Cape westward to Cape Metway, the land is broken and craggy, forming a deep bight; behind Cape Le Heve is what Des Barres calls Palmerston Bay, at the head of which is Petit Riviere, a settlement formed by the French. The waters of the river take their rise a considerable distance in the country. The farms of this settlement are in excellent order.\n\nPort Metway, between Cape Le Heve and Liverpool, is considerable, both in its navigable capacity and its consequence as a fishery. The five mills turned by the river annually cut six hundred thousand feet of timber, and find a ready sale for it. This place was settled about the same time as the neighbouring harbors, and under similar circumstances. In July, 1817, there were fifty families, or two hundred and seventy-six persons.\n\nThe entrance is marked by the hill of the western head, and the low ragged islands on the eastern side: the width seven-eighths of a mile, from 5 to 14 fathoms deep, and the bottom even.\n\nS.W. ledge lies from the Frying Pan Island S 1/2 E. three\nquarters of a mile: it breaks in rough weather: the least water on it is 19 feet.\n\nThe Stone Horse, a rock dry at low water, is E. by S. one-third of a mile from S. W. breaker.\n\nOpposite Neil's Point the anchorage is good: the mud-banks from thence narrow the channel, where a pilot is necessary. The tide runs with strength, and flows forty-five minutes past seven at full and change.\n\nLiverpool entrance lies W. by S. twenty-five leagues from Sambro Light-house, and W.S.W. fourteen miles from Cape Le Heve. An island called Coffins, and the western shore, form a deep bay, affording good anchorage for large ships, with the wind off shore: the depth from 5 to 14 fathoms, clear bottom. On the South end of the island a light house is erected, and was for the first time lighted in June, 1816. The light revolves every two minutes, and may be seen at a good distance.\n\nLiverpool Light-house was begun 30th May, 1811, completed 31st December, 1815.\n\n| Diameter at the base | 28 feet |\n|---------------------|---------|\n| Height              | 50      |\n| Lantern's Diameter  | 17      |\n| Height              | 12      |\n| Total Height        | 75      |\n\nThe town was settled in 1760: in 1762 the settlement con-\ntained ninety families, who, it is said, removed hither from Port Seigneur, for the convenience of the river and port for the fishery. Yet it is not easy to conceive a place where nature has done less to favor man. A broken, rocky, barren country, surrounding a port obstructed at the mouth, and possessing a capacity very limited. The settlers originally came from the United States, of industrious, sober habits, and their exertions being unanimous, they not only surmounted these difficulties, but have raised the town to respectability and opulence. Their commerce is extended to every part of the West Indies, and their enterprising spirit, during the late war, was very conspicuous.\n\nThe population is now twelve hundred persons.\n\nAn Episcopal church, a Methodist and Anabaptist meeting, a Custom House, and school, form the public buildings. The latter was built at the expense of James Gorham, Esq. who presented it to the town in 1803. The houses are substantially good, and the regularity of painting them outside, not only improves their appearance, but tends to exclude the native humidity, and materially preserves the buildings, which are chiefly of wood.\n\nS. W. fourteen miles and a half from Liverpool Light-house, lies Little Hope, an island 21 feet high, and 200 fathoms long; three miles from the shore. This is a serious danger, being so low that it cannot be seen at night, any distance: a valuable ship was lost on it in 1815. In my opinion, a sonorous obelisk would guard this danger, at a very trifling expense, by the application of tubes similar to organ-pipes. This idea improved, might be\nso constructed as to be inflated by the slightest air: even a leathern reservoir, that would be filled in strong winds, which in light airs or calms should supply the pipes; and thus, without attendance, an exceeding loud sound, might be continued.\n\nPort Mouton, or Mattoon, alias Gambier Harbor, is nine miles from Liverpool; W. S. W. from the Western Head, is the course to the safe anchorages. In 1783, a small fleet wintered here, which is a sufficient proof of its safety. The port is formed by Mouton Island, lying across the bay. The Black Rocks, partly dry, lie eastward of the body of the island, nearly a mile, and the passage between, has from 15 to 17 fathoms. A spot of foul ground with 20 feet on it, lies N. N. E. of the island, half a mile. The small Spectacle Islands, W. N. W. of the North end of Mouton Island, are seen in approaching the entrance. To the northward and westward of them, in 12 to 20 fathoms, muddy bottom, vessels may lie secure from all winds.\n\nThe Western passage is shoal, used only by coasters; in entering it, a rock near the western shore is visible: pass this rock and the point, and haul up either to the anchorage off the N. W. shore of Isle Mouton, or round the Spectacles.\n\nWestward of Port Mouton, immediately within Little Hope, is Port Jolie, alias Stormont River, an inlet upwards of five miles deep, has scarcely sufficient water for large boats. The lands are barren and very stoney: eleven families are settled on them, who make a comfortable livelihood chiefly by fishing. Between Port Jolie and the Hope, are ledges that shew themselves, and a shoal spot, half way between the island and the main land.\nPort L'Ebert is the third inlet West of Liverpool. The abrupt western head distinguishes the harbor, and it may also be known by Green Island, that lies a mile to the S.W. of the entrance.\n\nThe Port's mouth is the only anchorage for vessels larger than coasters. The depth half a mile above the head, is from 9 to 12 feet, sandy bottom. Fifteen Families inhabit this place originally from New York: they arrived in 1783.\n\nSable River, the fourth inlet West of Port Mouton, affords shelter to the smallest class of fishing vessels only, on account of a bar clogging the entrance. Eleven families, who settled here in 1783, still inhabit this sterile, inhospitable spot. A small nook close to the westward of the river, is called Little Harbor, where two families live.\n\nRagged Islands, W. by S. fifteen miles from Isle Hope, and E. N. E, nine miles from Shelburne Light, are craggy and broken, with a number of very dangerous sunken rocks and ledges. The harbor, which takes its name from them, being difficult of access, is seldom resorted to, but by the fishermen. Inside, the anchorage is good, in 4½ and 4 fathoms. In gales of wind, the uneven rocky ground causes the sea to break from side to side, at the entrance. Off the western head, a short mile, lies a bed of rock, on which the sea always breaks. Between the head and these rocks, there are 6 to 8 fathoms.\n\nIn August, 1812, His Majesty's Brig Emulous steering W.N.W. in a thick fog, at one P.M. struck on the Ragged Island Ledges:\nthree quarters past one, bilged and filled. The Colibri was in company, and let go her anchor in 7 fathoms: at five o'clock got all the crew on board her. The Emulous, in addition to her crew, had one hundred and fifty-six prisoners. At six o'clock next morning, the fog cleared, and they discovered their situation.\n\nIn the deep indent between Ragged Islands and Shelburne, lie the anchorages of Green Harbor and River Jordan: they are places of little note, but well settled. The inhabitants cut quantities of hay on the salt marshes, and follow the fishery.\n\nShelburne Harbor is justly esteemed the best of Nova Scotia, from the ease of its access, and the perfect security of its anchorage.\n\nOn the S. E. point of McNut's Island, at the entrance, stands the light-house. The lantern is 125 feet above the level of the sea; half way down is a small light to distinguish it.\n\nThe dangers in approaching the harbor are the Jig Rock, and the Bull, the former one mile and a quarter S. S. W. 4W. of the light, and the latter, E. N. E. two miles and a half from it.\n\nIt is impossible to view the present state of Shelburne, without the strongest feelings of regret. Buildings that would have credited any city, falling to pieces untenanted. Some hundred houses, with their ornamental parts defaced, and their windows broken, mouldering to ruin: once the dwellings of a respectable, loyal, and wealthy people. The streets are overgrown with grass and weeds. A stranger unacquainted with the history of its decline, would imagine it the effect of dearth or pestilence.\nThe Jig is 6 feet under water, rather in the way of vessels from the westward: therefore bring the light to the northward of the rock's bearings, and steer for the island, which is bold along its eastern shore. The course up is N. W. by N. when past the point, the anchorage is good, in 7, 8, or 10 fathoms. There is a shallow spot on the eastern shore, on which His Majesty's Ship Akbar struck in turning up.\n\nOff Sandy Point, a sand spit stretches, 300 yards. McNut's Island locked with this point, the anchorage is exceeding good: shipping well provided with ground-tackling would here ride smooth and safe in the heaviest storm.\n\nIn the nook or bend below Carlton Point, lies a sunken rock, but not in the way.\n\nCaptain David Milne turned His Majesty's Ship Bulwark in and out of this harbor, during the American War. By his direction the watering place was improved, and a place of shelter formed for seamen, who may be employed watering.\n\nShelburne was first settled in 1764, by Alexander McNut, and associates, who named it New Jerusalem. They received grants of land from the government in the neighbourhood of this harbor, to the amount of a hundred thousand acres: but improved only a small part of the island at the harbor's entrance, and other inconsiderable spots. Most of the lands have since been re-granted.\n\n\"At the close of the revolutionary war in 1783, many thousand\nloyalist families emigrated to this quarter. Pleased with the spacious harbor, they commenced forming the town. These infatuated people expended their fortunes in extravagant buildings, without object or consideration. In 1784, its population exceeded twelve thousand inhabitants; and in October, 1816, there were only three hundred and seventy-four persons in the town and suburbs. Dissappointed in their views, to attract hither the leading people of Nova Scotia, and make this the seat of Government and the emporium of the Province, most of them returned to the United States, or settled in other parts of the country.\n\n\"The misfortune of these people arose principally from their being unfit for either farming or fishing, as they had accumulated their property by commerce; and in the frenzy of enthusiasm, were led to imagine, that a great town, with spacious streets and commodious buildings, would attract the stranger, and pave the way to its greatness. In the short space of two years, they had dissipated their fortunes, amounting, it is supposed, to no less than 500,000 pounds. Happy indeed would it have been, if the late Surveyor-General had succeeded in his strenuous attempts to encourage these loyal people, at the time of their emigration, to settle along the coast in the neighbourhood of Guysborough, at the eastern extremity of the Province, where the lands are exceedingly good, and the fortunes they possessed, would have enabled them to purchase extensive and valuable farms.\"—Charles Morris.\n\nThe river at the head, drains from a range of lakes, lying East and West, twenty miles from the salt water.\n\nOn a river, which empties itself into the harbor, are seated a grist and saw-mill.\nCape Negre, a bold, black, rocky head, S.W. & W. fifteen miles from Shelburne light, is the southern extremity of an island, within which is the harbor, called by Des Barres, Port Amherst, known to the inhabitants and fishermen by the name of Cape Negre (or Negro) Harbor.\n\nIts entrance is rendered difficult by two sunken rocks, one 9 feet under water, N.N.E. of the Cape; the other called the Budget, washes at low water, lies further to the northward, nearly in mid-channel.\n\nIn the passage eastward of the Budget, the water is 10, 12, and 14 fathoms deep, and the best direction to enter the harbor, is one-third from the rocks off the eastern point, till Shelburne light is shut in, which is the mark for being within the danger.\n\nThe N.E. side of Cape Negro Island is bold, affording excellent anchorage, in 4, 5, and 6 fathoms stiff mud.\n\nThe North end of the island is a low shingly beach: from it a bar extends across the harbor, to the eastern shore, with 15 feet water on it. Above, it is navigable six miles, a smooth clay bottom, 3, 4, and 5 fathoms deep.\n\nThe passage on the West side of Cape Negro Island is full of rocks and ledges. Yet in desperate cases, (such as being in a disabled state, and caught by a S.E. gale,) it may be attempted, as the dangers shew themselves. In such circumstances, indecision or timidity would produce certain destruction. The commander's post should be aloft, and, if not possessing confidence, he should affect it.\nClyde River, descending twenty-eight miles from a chain of lakes, that extend E. N. E. and W. S. W. a considerable distance in the interior, falls into the head of this harbor.\n\nThe lands adjoining, were settled by a few families from Cape Cod in 1775, and at present, the population is four hundred and sixty-three persons. They combine farming and fishing with greater success than in any other part of the province, and raise considerable stock.\n\nPort Latour, separated from Cape Negro Harbor by a peninsula, is a shoal, ledgy, and bad harbor, capable of sheltering small craft only. The tide leaves a great part of the head cf it dry. The lands about it are barren, and a little marsh assists to support the families at its head, who by dint of industry and great labour, have cleared ten or twelve acres.\n\nBarrington lies immediately within Cape Sable, and was originally settled by twelve French families, who cleared two hundred acres. In 1760, the lands now constituting the township, were granted to two hundred proprietors from the neighbourhood of Cape Cod; and in 1763, one hundred and sixty families had arrived, and brought with them their stock and fishing vessels. The village of Barrington was laid out, and the settlement assumed the pleasing appearance of prosperity. In 1784, arrived a few respectable loyalist families, whose knowledge of agriculture tended much to improve the place. The lands are stony, but afford excellent pasturage, enabling the inhabitants to keep a large stock of cattle. They have within their reach every necessary of life, and many of its luxuries.\nCape Sable Island contains 2600 acres, a great part of which is under tillage. It has forty-seven families on it, who live in great comfort; many of them in good circumstances.\n\nThe population of Barrington township is 162 men, 163 women, 329 boys, 333 girls: total 987.\n\nThe harbor is choaked by sand flats that extend nearly from side to side. The channel winds between them, and affords safe anchorage in 18 to 26 feet. In S.W. gales there is good shelter on the N.E. side of Cape Sable Island in 4 to 5 fathoms, sandy bottom.\n\nThe passage leading into the Bay of Fundy is much used by coasters, who know its intricacies. The tide of ebb is forced unnaturally through to the eastward, by the bay tide, at the rate of 3, 4, and sometimes 5 knots.\n\nOff Barrington Bay and E. 17 S. nine miles from Cape Sable, lies the Brazil Rock, covering an area of about ten yards. I examined it in a perfectly calm day, and sounded it with a 32 feet pole. A tail extends ninety or a hundred yards from its base, with from 6 to 8 fathoms water. The tide running strong over this, causes a great ripple, and makes the rock appear larger than it really is. The soundings towards the shore are regular, from 15 to 19 fathoms; but to the southward of the rock you fall into 22, 30, and 35 fathoms, say at the distance of one mile. Between Cape Sable and Brazil you have 17, 20, and 24 fathoms, sandy bottom.\nCape Sable is a small low sandy island (distinct from the island before-mentioned,) with a few scrubby trees in a state of decay, on its eastern extremity. The cliffs are white, distinguishable at the distance of five leagues, but are broken and sensibly decreasing. In 1760, by Mr. Des Barres' account, they were one hundred and twenty feet perpendicular, and when this survey was taken, the highest was only sixty-one feet: they range W. N. W. and E. S. E. two miles in the shape of a half-moon, convexing northerly: and off each point is a ledge; the eastern called the Horse-shoe, extending two miles and a half S. E. by S. the western, or Cape Ledge, runs off three miles, formed by detached bodies of shingle and rock. The tide, both ebb and flood, sets immediately across them; the flood westward, the ebb to the N. E. by its rapidity causing a strong break to a considerable distance from the shore.\n\nIt is essential to the safety of those navigating the Bay of Fundy that it be clearly described and distinctly understood. To that end much labor has been bestowed: the vessels and boats kept constantly and actively at work, and even lives expended, by pressing the work with a degree of ardor necessary to its execution.\n\nThe Charts are made upon a scale sufficiently large to shew all the dangers and the intricacies of the channels; that in cases of necessity places of safety may be resorted to without a pilot: although no man, having charge of a vessel of consequence can justify the economy of saving pilotage on a coast where currents, fogs, and changes of weather may confound the best judgment.\nThe description will, if attentively read, remove from the minds of strangers the hideousness with which fancy and ignorance have gloomily clothed this excellent portion of America. Two large ships from Europe were wrecked within a few days of each other, on the S.W. coast of Nova Scotia; and many others, recently accounted for in the same way, sanctions the received ill opinion, without producing the precaution necessary to prevent a recurrence of such losses, arising from the most palpable and unpardonable negligence. I instance a few, and pledge myself for the verity of the statement: the authors of these calamities will doubtless avoid a recognizance, as the mention of them is to excite caution, and not to involve the parties in any further consequences. A valuable coppered ship, with light airs of wind drifted on the rocks, although the fishing lines were in use at the time, and one of them attended by a principal officer of the ship: the breakers heard, and the depth known: in the last extremity, a kedge anchor let go. The ship bilged, and the passengers landed safe.\n\nOn a point from which soundings gradually deepen to a considerable distance, say forty miles, a large coppered ship ran, and having landed her passengers, was sold as usual, for the benefit of the underwriters.\n\nOne ship ran upon a beach, and the crew landed without wetting their feet.\n\nA deep laden brig bound to Passamaquoddy in August, 1817, sailed through the Manan outer ledges, and ran above the dry ledge within the Three Islands: the percussion drove her off\nand having anchored, the crew landed to enquire what part of the coast they were upon.\n\nA ship from Jamaica grounded on the beach within the Mutton Islands, West of Cape Sable; having passed ledges between which a skilful pilot would scarcely venture. After receiving information from the inhabitants what port they were in, they hove off, and proceeded to Halifax, the place of their destination. These happened within a short period, and numerous other instances might be adduced, to prove how little the lead is used, which ought to be constantly kept going in approaching the coast.\n\nThe necessity of frequently sounding with the deep-sea lead, and the expediency of having anchors and cables ready for immediate use, cannot be too strongly urged, or too often repeated. Vessels well equipped, and perfect in gear, wrecked in moderate weather with anchors stowed as in the middle of the Western Ocean, bound into the Pacific, has happened so frequently that such gross idleness cannot be too much reprobated. The serious losses that have thence lately occurred to the underwriters will tempt them to give this little work currency.\n\nScal Island lies W. by N. twenty-one miles from Cape Sable, in length two miles North and South. The Southern part is covered with scrubby trees, elevated thirty feet above the sea. This being the elbow of the Bay of Fundy, presents an excellent position for a light-house. South of the Island's South end, two miles and seven-tenths, is a rock uncovered at low water, on which His Majesty's Ship Blonde was lost in 1777; it has 7, 9, and 10 fathoms round it. The overfall is a mile to the west-\nward of the Blonde, are heavy and dangerous: in a calm, the sloop Examiner lost her bowsprit and nearly swamped. These break and present an alarming spectacle. North of this, four miles, lies a bed of shoal ground (without the tusks,) on which is 16 feet: this causes a violent ripple.\n\nThe American fishermen resort to the island for wood and water: the former they obtain in abundance from the frequent wrecks; the latter is supplied from a large pond in the centre.\n\nFive low ragged islands, between four and five miles N.E. from the seal, are frequently called the North Seals, though known to the fishermen as Mud Islands. Between them and Seal Island the passage is good for any ship. Large vessels should keep within one mile of Seal Island, as the overfalls, eighteen feet, lie a short mile from Mud Island. Soldier's Ledge, bare at half ebb, lies N.W. of the South Mud. Devil's Limb is seen at all times: the Limb's limb at half tide. The smoothest anchorage is within these rocks, in 4 to 5 fathoms, clear sand. Wild fowl and fish are here in abundance.\n\nOn one of these Islands some thousands of Pettrels, or Mother Cary's chickens, annually hatch their young. They burrow under ground diagonally, three or four feet deep, and sit on one egg; flitting about the surface in astonishing numbers, searching for food, and cast a sickly fetid effluvia. Many naturalists have attributed to this little winged mariner the property of breeding its young on the water, by delivering its egg, and diving to catch it under the wing, whence the young one is said to come.\nPubnico, though little known, is an excellent ship harbor, easy of access, and so situated that vessels entering the Bay of Fundy in distress, may find shelter and supplies. From the South end of Seal Island to the entrance of this port, the course is N. 51 E. twelve or thirteen miles, 20 to 16 fathoms deep; in entering the harbor, the depth is 7 to 12 fathoms up to the beach, the proper place of anchorage for a stranger. Above the beach, on the western side, lies a ledge, partly dry at low water.\n\nThe population of Pubnico is forty-four men, forty-five women, one hundred and nine boys, and eighty-seven girls. Two miles South of Pubnico entrance is St. John's Island, from the outer part of which, to the beach in Pubnico, the course is N. N. E. two miles and a half. Under the island's North side, the shelter is good in S. E. gales, and small vessels lie round the beach forming its East part. Coasters use the passage within St. John's, the Mutton, and Bonne-portage Islands, by Cockerwit: thence towards Barrington by Shag Harbor; but none of these places merit particular notice, being generally shoal.\n\nCape Forchu, or Forked Cape, forming an apparent entrance, may be mistaken for the passage into Yarmouth, which is eastward of this Cape. The harbor is safe, but of mean capacity, with sunken rocks in the entrance. The fair way is on the shore, till opposite the point on the East side: at the top of this point or isthmus, stands the battery: under its lee, or to the northward, is the anchorage, in 5 or 6 fathoms, good ground.\n\nCape Forchu Harbor and Yarmouth are one and the\nsame, although in Des Barres' charts they are separated, and by a palpable error, Jebogue is called Yarmouth.\n\nThe town of Yarmouth is above this anchorage upwards of a mile, and is respectable: the houses are large, but scattered; the people generally in good circumstances, and the vast increase of population proves the country's resources good.\n\nThe land in the township exceeds a hundred thousand acres: three thousand are marsh, one thousand dyked, two thousand undyked: the upland improved, may be ten thousand. The yearly produce of hay is upwards of five thousand tons.\n\nIn 1791, thirty years after the first settlers came hither, there were in the township 215 houses, or 1300 souls.\nIn 1808, there were 340 houses, 2500 souls.\nIn 1816, there were 450 houses, 3237 souls.\n\nFrom Cape Fourchu to Point Jegogan is S. § W. the low-land between forms a deep indent; thence to Cape St. Mary's, the land gradually runs high, the Cape being the highest; from Cape Fourchu to Cape St. Mary's is nineteen miles, N § E.\n\nGreen Island and the Gannet rock lie off Cape Fourchu; the latter ten miles distant, is bleached by bird's dung, and thirty-six feet above the sea at high water. Some vile copies of Des Barres mark it as appearing at half tide, and the Admiralty charts have copied this error. His Majesty's Brig Opossum, in 1816, struck on a ledge that appears at half ebb, S. W. of the Gannet, two miles: many vessels with their crews have suffered on it.\nThe course from Seal Island up the bay, to sail westward of this ledge is N. N. W. fourteen miles.\n\nWest of this danger the tide sets North and South, from two to four miles per hour: close to it, it courses W. N. W. and E. S. E.\n\nFrom Cape Sable to pass between Seal and Mud Islands, steer N. W. by W. seven leagues. In this distance are several overfalls from 7 to 15 fathoms, gravelly bottom. These in spring tides break violently. The North end of the Seal Island is bold to one cable's length, 7, 8, 10 fathoms: the opposite side of the channel has a shoal bank in it, on which some ship of war struck in 1796.\n\nTrinity lies S. W. by W. six miles from Cape St. Mary's, and S. by W. sixteen miles from Cape Fourchu: this danger covers a small space, say three-fourths of an acre, and three small rocks shew themselves in low tides: the stream runs forcibly over them: the anchorage in their neighbourhood is tolerably good to stop one tide: the depth is 12 to 15 fathoms for one mile round it. Lurcher lies W. N. W. from Cape Fourchu fourteen miles, has 12 feet on it, and covers an area of three acres with spots of shoal ground; distinct from it a mile to the N. E.\n\nFrom Cape Sable to Tusket passage is N. by W. twenty-seven miles; from Cape Sable, southward of all these West thirty-five miles: the bay is then open, and the course up N. N. W. This course will clear the Lurcher, which is the outer danger; but the tide will make one point difference in the course, as it sets S. E. and N. W. through the Mud and Tusket Islands, and near\nthe Manan ledges; the ebb W.S.W. and flood E.N.E. at a great rate, say four knots.\n\nFrom Seal Islands up to Cape St. Mary, the soundings extend twenty and thirty leagues off: but West of Brier's Island and near Manan ledges, there are 60, 80, and 100 fathoms, at three or four miles distance; therefore in doubtful cases the lead should be kept going.\n\nWithin the Seals, that is, to the North-eastward of them, lie a vast number of Islands, known by the general name of Tusquets, some of them large; with good, although intricate passages leading to the Tusket River, Argyle and other settlements. Many of the Islands are improved and made valuable, affording excellent pasturage for sheep and cattle. The westernmost cluster of these lie North of the Mud and Seal Islands, called the Bald Tusquets, connected by shoals and ledges, leaving East of them a narrow passage, which is distinctly seen on approaching from Cape Sable within the Seals.\n\nFrom the Cape Ledge, the course to the passage is N.by W. The Owl's Head, within the passage, is seen six or eight miles off: this should be kept nearly touching the eastern land, until you get within half a mile of the entrance. A dangerous rock, the Old Woman, seen at two-thirds ebb, lies E.by N. from the small bold, southernmost island, and S.by E. from the passage.\n\nA ledge partly uncovered at low water, extends three-fourths across the entrance from the eastern shore: the western side is\nbold, 7, 8, and 6 fathoms depth: the tide here runs with great strength. Half way through, a small inlet offers shelter to vessels of moderate size, in 4 or 5 fathoms mud, and small vessels anchor inside the Spectacles, the two northernmost islets. At the North entrance a ledge lies, from the West side about half way, obliquely North-eastward.\n\nNorthward of the passage, the tide being less confined, runs easier, and the anchorage is pretty good; the little harbor of Jebogue is shoal, frequented only by coasters.\n\nThe lands are good, of a moderate height, and well settled; wearing the appearance of successful industry.\n\nOn the West side of Brier's Island stands the light-house, a building so vilely constructed, and so ill lighted, that it is justly considered a public nuisance. The author took from its lantern a wooden pane from among many of the same kind: and in consequence of his strong representation, it was altered by the Commissioners of the Provincial Lights, and improved as far as the building would admit; but no reliance should be placed on it.—The population is twenty-five men, twenty-seven women, forty-nine boys, forty-six girls: total one hundred and forty-seven: it contains three thousand acres. Long Island has twenty-two men, twenty-two women, forty-nine boys, forty-two girls, and contains seven thousand acres.\nGRAND MANAN\n\nForms a part of Charlotte County, in the Province of New Brunswick; its length is fourteen miles and a half, width seven miles: the gross contents may be estimated at thirty-seven thousand acres. The northern point is in latitude $44^\\circ 54'$, longitude $66^\\circ 45'$ W.\n\nIt lies nine miles from the nearest part of the district of Maine, and thirty-five miles from Brier's Island, which is to it the nearest part of Nova Scotia. From thus standing in the middle of the Bay of Fundy, it is obviously of importance in a political view, commanding a sight of all that passes to and fro; and possessing places of natural strength, and harbors of perfect security for vessels of war, its retention in the hands of our Government must be desirable.\n\nIt is subject to the same vicissitudes of climate as Nova Scotia, except the winters are less severe, being tempered by the sea air.\n\nIts fisheries are in great esteem with the Americans: towards of a hundred sail of vessels, besides boats, have at one time been seen at anchor on the ridge at Long Cove.\nThe farmers who have lately settled in the interior, speak very favorably of the nature and properties of the soil. All they have attempted, has answered fully their expectations. The ground under tillage may be computed at two thousand acres.\n\nThe soil is in general good, abounding in many places with an argillaceous earth; and to judge from the growth of the timber with which it is covered, there is no doubt it would amply repay the toils of the husbandman. It produces all the species of fir, birch, beech, and maple, in size and quality adequate to all the purposes for which they are generally used.\n\nLime-stone is found on the largest of the three isles, but very little used, from the difficulty of shipping it.\n\nThe population is seventy-one families: seventy-four men, seventy women, one hundred and nineteen boys, one hundred and twenty-one girls, three hundred and eighty-four total. They are chiefly from the States, and from the constant intercourse, are strongly tinctured with American manners and principles; a large portion of the best lands are the property of residents in the United States.\n\nA pair of Moose purchased by Mr. Gerrish, one of the original settlers, were turned on the island, and have considerably multiplied: twelve were killed last winter. They afford excellent and profitable sport for the inhabitants.\n\nIt may not be improper to give a short account of these animals. The Moose, when erect, is six feet high; the male has\nhorns, almost as enormous as the Elk; the stem of them however is not quite so wide, and they branch on both sides like those of a deer. They shed them annually in February and March. Though the hinder parts of this animal are very broad, its tail is not above an inch long. It has feet and head like a camel; its head is about two feet long, the upper lip much larger than the under, and the nostrils are wide. The hair is light grey, mixed with a blackish red. It is very elastic, for though it be beaten ever so long, it will retain its original shape. The flesh is exceeding good food, easy of digestion and very nourishing. The upper lip, which is large and loose from the gums, is esteemed a great delicacy, being of a firm consistence, between marrow and gristle, and when properly dressed, affords a rich and luxurious dish. Its hide makes good leather, being thick and strong, yet soft and pliable. The pace of this creature is always a trot, which is so expeditious, that it is exceeded by few of its fellow inhabitants of those woods. It is generally found in the forests, where it feeds on moss and buds. Though of the deer kind, they never herd as those do. They go eight months with young, and bring forth two at a time: the breeding season is in June. Most authors confound them with the Elk, Deer, or Carraboo, though they are a species totally different.\n\nThe cliffs on the Island's west side are nearly perpendicular, rising 600 feet above the sea level, and but one little inlet, Dark Cove, along the whole range, that will afford shelter even for boats. The northern head is equally abrupt and bold: on the eastern side of it is an anchorage called Whale Cove, in which ships can lie to wait the tides, in southerly gales. The depth is\nfrom 15 to 25 fathoms, but this place is completely exposed to northern gales.\n\nThe Swallow's Tail, or N. E. point of Long Island Bay, named from its horizontal shape, is bold, ragged, high, and barren. This anchorage is easy of access, as an open bay possessing all the advantages of a harbor. Under Long Island, opposite the beach, ships may anchor, even locking the North end of Long Island in with Swallow's Tail, in strong muddy bottom, unaffected by sea or wind from any quarter. In the northern part of the bay the bottom is a stiff clay: and vessels ill provided with gear have rode out severe gales without apprehension. The bottom in the whole bay is muddy with 7 or 8 fathoms, except a ridge extending from the ledge that shews itself within Swallow's Tail, and the North end of Long Island. On this ridge is from 10 to 12 fathoms: it is composed of rocks and gravel. A small bunch of sunken rocks lie half a mile N. N. E. from Long Island point, five feet under water at low spring tides.\n\nUnder Great Duck Island the ground is good: attention to the plan is necessary in running in without a pilot. When the tide is high, the dangers are hidden.\n\nSouth-westward of Duck Island lie Ross, Cheney, and White Head Islands, the latter belonging to W. Frankland, a pilot, who is constantly on the look out; many vessels have been saved from shipwreck by his activity. The cove opposite his house is a resort for fishing vessels, but with an easterly wind it is an ugly place.\nThe western side of Ross Island forms a part of Grand Harbor, a shallow, muddy basin. Ships may enter it and lie in the mud, perfectly secure: a convenience very desirable when without anchor or cable, which may occur to vessels recoverable from the outer ledges. At the entrance the depth is from 5 to 7 fathoms, clay bottom; narrow, yet secure from any sea.\n\nThe lee of Green Islands, and also Kent's or Three Islands, afford good casual anchorage, mud bottom with 7, 10, to 14 fathoms.\n\nWood Island and the S.W. tongue of Grand Manan, form a large space of excellent anchorage. The upper part of this inlet, and the head of it, in a gale of wind, afford secure anchorage. Those places are all well settled, and afford supplies.\n\nThe shore of the district of Maine is bold, and vessels beating through generally stand from side to side, particularly in foggy weather: the channel is seven or eight miles wide, from 2 to 70 fathoms deep. The tide courses regular and strong through it. Under Passamaquoddy Head is good anchorage.\n\nMANAN LEDGES.\n\nThe most dangerous is the Old Ledge, or Proprietor, spreading a face of half an acre at low water. When covered, the tide runs directly over it, at the rate of four knots. From the Gannet, it is N92°E. seven miles. Three miles S.E. from Old Ledge,\nA BRIEF DESCRIPTION\n\nlies Clerk's Ground; and East from it, nearly four miles, lies the Roaring Bull, a bank with 8 fathoms water, carrying an extremely heavy and dangerous ripple. The S.W. end open of the glee. Thence or near the S.W. head kept open of all other land, and sail close to the southward of these dangers. The North-easternmost high land, open of the little lumps of islands, will shew themselves on the east side of the Manan, will clear of the eastward of them. The easterly winds make the rips here impassable.\n\nThe particular marks are given on the chart, but here they would rather confusion than guide a stranger.\n\nSouth of the S.W. point of Water Island lies a range of rocks with deep water between them, carrying a continuous sea, three miles from the shore, come to the Long Point. Therefore, the Tinker, Three Diamonds, Rans, with many others named. Some shew themselves; others have 3 and 7 feet on them.\n\nThe Three Islands, the southernmost of the cluster of Manan, are low and ledgy. The East side of the largest is bold, to the rocks that appear at all times. Off their N.W. sides a sunken ledge lies, called the Constable, dry at low water.\n\nS.S.W. of the Three Isles, four miles, is the Gannet, a small rock, forty feet above the sea; this being dry in all weathers, and near all the dangerous rocks, would be a fine situation for a lighthouse, and save many ships. It has a number of small ledges and sunken rocks about it, that are always breaking.\nVessels damaged or lost on the rocks near Manan, since October, 1791:\n\nShips—British Queen, L. Murray, from Greenock, on the old ledge, damaged.\nGolden Grove, St. John, lost on the old ledge.\nDuke of Kent, sunk on the Middle Ledges, near St. John.\nPenelope, St. John, lost on the old ledge.\n\nBrigs—One from St. John's, with praises, sunk on the old ledge.\nMary-ann, St. John, stove on Long Ledge.\nLeander, England, on a ledge near Three Islands, lost.\n\nSchooners—Mary, Digby, on the Middle Ledges, cargo lost.\nCook, Borden, on the middle ledge, cargo damaged.\nPoveshell, St. John, lost on the old ledge.\n\nThe Wreck, a cluster of small islands, lie from Manan North nine miles; N.E. twelve miles from Passamaquoddy entrance. They are from sixty to one hundred feet high, steep and bold; the passage between them is deep, and as a casual anchorage, their lee is good in 12 to 15 fathoms. Between these islets and Manan, the depth varies from 18 to 30 fathoms, muddy bottom.\n\nThe track marks on the chart show the proper channels up, in case of taking a short cut to the westward.\n\nThe submerged rocks, at a considerable distance from the nearest island, with the rapidity and narrowness of their courses, constitute the chief danger to shipping.\nThese have hitherto been known only to the fishermen, and a few active settlers, who have resorted to these places for the purpose of procuring their winter's supply of fish.\n\nNo chart extant shews the dangers of Manan: no book of directions that I have ever seen, explains the courses and rates of the tides.\n\nThe repeated instances of shipwreck arising mostly from deficient information concerning these dangers and tides, drew from the merchants of St. John's city an application to the Lords of the Admiralty for a survey of the Bay of Fundy.\n\nThe entrance of Passamaquoddy Bay formed by Campo Bello on the South, and Spruce and White Islands on the North, is in width three miles; the greatest depth is 75 fathoms. The tide of flood strikes across from the S.E. land to the White Islands with great strength, and in light winds must be particularly guarded against. The water between is very deep, and inside of White Horse you may anchor in 45 fathoms mud. A ledge N.W. one mile from White Horse, is 12 feet beneath the surface at low water.\n\nThe various harbors and rivers of this interesting bay shall receive their merited attention so soon as the line of demarkation between His Majesty's provinces and the United States is determined.\n\nOn the North part of Campo Bello without Passamaquoddy lies Head Harbor; this is secure, and in it 6, 7, 8, fathoms: it is small and perfectly safe, with mud bottom.\nQuaddy Light stands upon a low point of the N. E. extremity of the district of Maine, and at the S. W. entrance of Passamaquoddy. It is in contemplation the placing an alarm bell in the light-house. Northward of this light, between Campo Bello and Maine, there is good anchorage, but the passage is shoal and intricate. At the Seal and Mud Islands the ebb runs East by South, South-east, and South, as influenced by the shape of the lands, and direction of the winds.\n\nThe city St. John, on the North side of the Bay of Fundy, forty-five miles from Manan, stands on an irregular descent; with a southern aspect, and on entering the river, presents an agreeable and imposing appearance.\n\nThe river's mouth is narrow and intricate; many accidents have happened to those who attempted the navigation without a pilot.\n\nPartridge Island is about two miles southward of the city, answering the double purpose of protecting the harbor, and by its light-house guiding the mariner to the place of his destination: the lantern is one hundred and sixty-six feet above the sea level, and the light is tolerably good.\n\nThe bottom for several miles southward of Partridge Island is muddy, and the depth gradual, from 7 to 20 fathoms, affording excellent anchorage: the passage westward of this island has in it 10 feet, and eastward of it 16 feet: opposite the city the anchoring depth is from 7 to 22 fathoms.\nThree-fourths of a mile North of the light-house stands a beacon, on the end of a rocky ledge, forming the West side of the channel, with deep water close to it.\n\nAfter the first quarter flood, the tide below the surface runs into the harbor; during summer and the depth of winter, at half flood, the tide generally flows in; in the spring and fall, when the river is charged by rains or the melting of the ice, the water streams out, or seaward, continually; therefore at these periods a vessel seldom enters the harbor without a fresh leading wind. At full and change the tide flows until half-past eleven; the vertical rise 24 to 28 feet; common tides rise 18 feet.\n\nWithin the last year a breakwater has been erected at the eastern side of the entrance, below the town, intended to intercept the violence of the sea, occasioned by southern gales.\n\nEvery possible facility and convenience is given to ships wanting repair: they lie upon blocks, and undergo a thorough examination, without incurring the expense, the injury and loss of time, occasioned by heaving down, so strangely persisted in at the contiguous Port of Halifax.\n\nThe river branches many hundred miles zig zag, through a country abounding in excellent timber, coal, limestone, and other minerals: with lands favorable to agriculture—resources that will, if properly managed, enrich the city, and increase its consequence.\n\n\"Common tides rise below the falls from 18 to 20 feet, and\nin spring tides about 4 fathoms: above the falls they seldom rise to more than 4 feet. The current runs down till half-flood, and up till half ebb. The falls are smooth every half tide from fifteen to twenty minutes, at which time they may be passed without danger by all vessels for which there is sufficient soundings: the greatest rise at the falls is equal to half the rise of the tide.\"—R. G. Bruce, Engineer, 1761.\n\n\"River St. John has sufficient depth of water for large ships to the falls, whence it continues navigable eighty miles up into the country for vessels of one hundred tons. At Fort Frederick the tides rise 18 feet, and at Equinoctial spring tides 25 feet; above the falls, it seldom flows more than 4 feet. When the tide has risen 12 feet at the fort, the falls are smooth, after which, during twenty minutes, they are passable. At times of great freshets, which generally happen between the beginning of April and the middle of May, from the melting of the snow, the falls are absolutely impassable for vessels bound up the river, as the tide does not rise to their level.\"—Des Barres.\n\n\"After passing the falls you enter a gullet, which is a quarter of a mile wide and two miles long; winding in different courses, and having 16 fathoms in the channel. Next to this gullet is a fine large basin, a mile and a half wide, and eight miles long, entering the main river.\"\n\n\"There is water sufficient (except in dry seasons) for vessels of fifty tons, as high as Fredericton, and in all the branches of the lakes.\"\n\"In the middle of May (or earlier in favorable seasons) the snow and ice in the country melting, make a general overflow in the river, which in some years rises so high as to inundate all the low lands.\"\n\n\"The overflows were measured in 1765 by the marks set up at Majorfield: the water was found to have flowed 17 feet above the common height of the water in summer.\"\n\nRemarks by Charles Morris, Esq.\n\nTwelve miles westward of Partridge Island is Musquash, that has four fathoms water, with good anchorage at the mouth.\n\nFrom Partridge Island W. S. W. twenty-seven miles, is Point Lapreau; the shore between is bold, the land broken and high. This point ought to be classed as one of the dangers of the Bay of Fundy: many serious accidents have lately happened in the neighbourhood of this promontory. Four miles East of it are the harbors of Dipper and Little Dipper; the former good for small craft; the latter having but 12 feet water, is fit only for boats. Westward of Point Lapreau is Mason's Bay, a deep and ugly indent. Ships bound to the River St. John, dreading to pass its mouth, frequently get imbayed, and some valuable vessels have thus been wrecked. At the head of this bay, is good shelter in a place called Pok-logan.\n\nThe city St. John contains, say nine hundred houses and six thousand inhabitants, but until better materials are collected, an account will not be given: but an idea of the abundance of the finny inhabitants of its waters may be conceived by the fact\nof 50,000 barrels of salmon and herring having been taken and cured the last season, 1817.\n\nFrom St. John's eastward to Quaco, the land is high, and the interior hills rise in easy inequalities; but near the shore the cliffs are abrupt, and the ravines, here and there, deep and gloomy: the indents have beaches, and Black River, twelve miles West of Quaco, is a safe inlet for a small vessel, but dry from half tide. The bank of gravel off Quaco lies W. N. W. and E. S. E. in shape of a sole: the widest and shoalest part westward, leaving a mile space or channel between it and the dry islet off Quaco Point. The bank in itself is a mile long, and a third of a mile wide. Vessels frequently ground on it. The lands in St. Martin's neighbourhood are moderately good, but broken, steep declivities, small vallies, abrupt precipices, and light soil, that does not retain the manure. The bay is often ruined from the limited and short intervals of sun shine; the humid blustering, and changeable weather. The inhabitants struggle hard for a maintenance, and often in vain.\n\nFrom Partridge Island to Annapolis the course is S. 4 E. distance thirty-five miles; the depth across 7, 25, 64, and 40, soft bottom. The gut in clear weather is easily distinguished, and in a fog S. by E. easterly with the ebb, and S. W. with the flood, will certainly hit it. Strangers frequently mistake a fall in the land called Gulliver's Hole, for the Gut of Annapolis: this error is seldom of consequence, as the wind on shore is generally clear.\n\nThe abrupt precipices of the high lands form the gut, and\ncause flurries of wind that course in all directions, and rush violently from the summits of the hills. The tide hurries through the gut with great force. There is not anchorage except very close in shore, near the outer western point. In some places the depth is 40 to 80 fathoms, and in entering Annapolis Basin the scenery is inexpressibly beautiful, and if our wandering countrymen in affluence would cross the Atlantic instead of the Channel, the bold and imposing scenery of Canada, Cape Breton, Acadia, or New Brunswick, would rivet their astonishment. The features of nature are here presented on a grand scale. Lakes oceanic, rivers whose branches or arms would pygmatize the largest in Europe, if divested of their commercial importance.\n\nFor many years a small light-house, standing on the West point of the entrance, directed the navigator to the gut of Annapolis, and a fine harbor, a fertile country, an extensive and profitable fishery with a town settled by authority, and in honor to Her Majesty Queen Ann, were promising advantages, but by a change of circumstances, the capital was removed to a sterile, rocky, and broken neighbourhood: and the light-house being destroyed by fire, was suffered to remain extinct till 1817, when four hundred pounds were voted for the one lately erected: one hundred pounds of this sum was to have been raised by the inhabitants of Annapolis and Digby. But it appears that the whole expense of the building will not exceed three hundred and fifty pounds, and it stands a monument of mistaken economy. The light is to be exhibited from a window, one hundred and twenty feet from the surface of the water.\nIn the American war, most of the vessels belonging to this port were taken; but it is rapidly recovering these losses.\n\nThe farms are growing valuable and extensive. The herring fishery is a source of great profit; they are so well cured that the merchants of Halifax and St. John give them a decided preference for foreign markets.\n\nThe packet between Digby and St. John is well regulated, with good accommodations, and generally makes the passage in a few hours.\n\nThe Bason of Mines and Chignecto Bay, surrounded by valuable settlements, and abounding in coal, plaster, limestone, and other minerals, are at the head of the Bay of Fundy, and will be connected with the account of New Brunswick in the next edition.\n\nShips bound up the Bay of Fundy should make the American shore near Machias, instead of the eastern side, because the former is bold, and the prevalent winds from the westward secures to them the passage.\n\nTIDES\n\nIn the Bay of Fundy are very rapid, but regular; and although the wind against the tide alters the direction of the rippling, and sometimes makes it dangerous, it has little or no effect on the courses of the tides.\nThe flood sets from Cape Sable to the North-westward, at two to three knots, through the Seal Islands and Bald Tusquets: obstructed by these islands, its rate is increased to four or five knots; thence taking the direction of the shore, flows past Cape St. Mary, thence N. N. W. towards Brier's Island. The flood sets but slowly up the extensive Bay St. Mary, which adds to its strength along the eastern shore. This vast body of water rushing up, and the bay narrowing, suddenly causes it to fill the Basin of Mines and Chignecto with vast rapidity, and rise to even 75 feet.\n\nFINIS.\nAPPENDIX.\n\nSo universal an interest appears excited by the preparations to examine the North Polar regions, that there can be no sound reason for not rendering an account of the projected scheme of the voyage to our friends, who favor the publication of this work.\n\nThe ships have sailed, are perfectly equipped, provided with every instrument and implement that a mature consideration of the difficult circumstances likely to present themselves, could suggest.\n\nThe leading scientific men of the country have aided the deliberation of the persons intrusted with the arrangement. The novelty of the subject, the prospect of an increase to geographical knowledge, and there is a reasonable hope that the mysterious cause of the variation of the compass will be brought to light, are inducements to attach to the preceding work an Appendix, illustrative of the voyage in question. To this end an extract from the Quarterly Review, No. 35, is chosen, and a small Polar...\nChart, extending from the northern extremity of the world's axis to 44° latitude, will probably convey all that is desired. A feeling of curiosity will be excited for the fate of the persons embarked in this extraordinary excursion. Various are the conjectures and strange conceptions formed of its ultimatum, but all persons appear to join in an earnest wish for their success.\n\nIt is argued that exploring the Pole is a mere matter of curiosity; an atom of astronomical knowledge will enable the reader to think the contrary. There is the greatest reason to expect, even should the vessels fail in reaching the Pole, or passing into the Pacific, that most material discoveries will result.\nEXTRACTS.\n\nAmong the changes and vicissitudes to which the physical constitution of our globe is perpetually subject, one of the most extraordinary, and from which the most interesting and important results may be anticipated, appears to have taken place in the course of the last two or three years, and is still in operation. The convulsion of an earthquake and the eruption of a volcano force themselves into notice by the dismay and devastation with which, in a greater or less degree, they are almost always attended; but the event to which we allude has been so quietly accomplished, that it might have remained unknown, but for an extraordinary change which a few intelligent navigators remarked in the state of the arctic ice, and the reports of the unusual quantities of this ice observed in the Atlantic. As it is a subject in which the British islands are particularly interested, we shall enter into some detail of the facts, and of their probable consequences.\n\nIt is generally admitted that, for the last four hundred years, an extensive portion of the eastern coast of Old Greenland has been shut up by an impenetrable barrier of ice, and, with it, the ill-fated Norwegian or Danish colonies, which had been established there for more than an equal length of time preceding\nthat unfortunate catastrophe, and who were thus cut off at once from all communication with the mother country; that various attempts have been made from time to time to approach this coast, with the view of ascertaining the fate of the unfortunate colonists, but in vain, the ice being everywhere impervious; and that all hope being at length abandoned, that part of this extensive tract of land which faces the East, took the appropriate name of lost Greenland.\n\nThe event to which we have alluded, is the disappearance of the whole, or greater part of this vast barrier of ice. This extraordinary fact, so interesting to science and humanity, appears to rest on no slender foundation. Both its disappearance from its long-rooted position, and its re-appearance in a more equinoctial latitude, have been witnessed by various persons who have visited it. It had been observed in the summer months of the year 1815, and more particularly in those of 1816 and 1817, by vessels coming from the West Indies and America, as well as by vessels sailing out to Halifax and Newfoundland, that islands, very unusual in magnitude and number, occurred in the Atlantic, many of them as far south as the fortieth parallel of latitude. Some of these were denominated ice-bergs, from a hundred to a hundred and thirty feet above the surface of the water, and several miles in circumference; others were flat islands of packed ice, presenting so vast an extent of surface, that a ship from Boston is said to have been three days entangled in it, near the tail of the Great Bank of Newfoundland. The ship of the Unitus Fratres, proceeding to the missions on Old Greenland, was, last year eleven days becalmed on the coast of Labrador, with the ice-bergs, many of which had huge rocks upon them, gravel, soil, and pieces of wood. The packet from\nHalifax, passed in April last, a mountain of ice nearly two hundred feet in height, and at least two miles in circumference. By accounts from Newfoundland, Halifax, and other northern parts of America, it would appear, that greater quantities of ice were seen in the months of May, June, and July, than had ever been witnessed by the oldest navigators; and that the whole Island of Newfoundland was so completely environed with it, that the vessels employed in the fishery were unable to get out to sea to follow their usual occupation. The source from which these enormous masses proceeded could not long be concealed. It was well known to the Greenland fishermen, that from Staatenhoek, the southern promontory of Old Greenland, an uninterrupted barrier of ice stretched North-easterly, or parallel nearly to the coast, approaching frequently to the very shore of Iceland; and that the small island, situated in lat. 71° 11' long. 5° 30' W. called Jan Mayen's Island, (a sort of land-mark which those engaged in the seal fishery always endeavour to make,) had of late years been completely enveloped in ice; and that from this point it generally took a more easterly direction till it became fixed to the shores of Spitzbergen, from the 76th to the 80th degree of latitude.\n\nThe more central parts of this immense area of ice, which occupy the mid-thal of between Greenland and Spitzbergen, separate from time to time into large patches, and change their positions according to winds and tides; but the general direction in which they move, with the current is from North-east to South-west, or directly towards that part of Old Greenland where the Danish colonies were supposed to be established, and which are immediately opposite to Iceland. Here it would seem those masses\nbecame a kind of fixed nucleus, round which a succession of floating fields of ice attached themselves, till the accumulated barrier, probably by its own weight and magnitude, and the action of the impeded current, at length burst its fetters, and has been carried away to the southward. This at least appears to be the most probable conjecture, though another circumstance will hereafter be adverted to, not unworthy of attention in endeavouring to account for the phenomenon.\n\nIt had been conjectured by philosophers that the remarkable chilliness of the atmosphere during the two last summers, and more particularly with westerly winds, could only be owing to the accumulation, or rather to the approximation of the polar ice to the southward. The reports of the Greenland fishermen on their return in August, 1817, connected with accounts of the ice seen in the Atlantic corroborated this hypothesis. In that month there appeared in the newspapers a paragraph, stating, that, \"in the course of a season, the commander of a brig from Bremen, after making Jan Mayen's island, is about 71° N., stood to the westward in quest of seals; that in 72° he found land to the westward; that she then sailed nearly due North along this coast without seeing ice, observing the sea and inlet and other appearances of the land, till he came to lat. 81° 30', where he found he could steer to the eastward which he did for several days; that he then lost sight of land, and directed his course to the southward and eastward, and in 78° N. fell in with the first fishing vessels he had seen.\" We took some pains to ascertain the truth of this statement, found it corroborated in almost every particular by five different masters of whalers belonging to Aberdeen and to London, to whom at different times, Olafsson, (the person alluded to,)\nmaster of the Eleanora of Hamburgh, (not of Bremen,) had given an account of the course which he steered along the eastern coast of Greenland, from Jan Mayen's Island to the degree of latitude above mentioned; and it appears from the joint testimony of the captain and surgeon of the Princess of Wales of Aberdeen, that, the reckoning in his log-book was worked at the end of every watch, a practice which is also common among Dutch whalers after making the ice; and that, 'both the master and mate were very intelligent navigators.' Since that time we have received from Hamburgh a copy of Captain Ocken's log, a chart of his route, and a letter addressed by him to Messrs. Elliot and Co. of Hamburgh, from all which it appears, that he coasted Greenland with the land in sight, and returning thence, but that the most northerly point which he saw was about 80° N. latitude.\n\nBut we have the direct testimony of Mr. Scoresby the younger, a very intelligent navigator of the Greenland Seas, for the disappearance of an immense quantity of arctic ice. In a letter to Sir Joseph Banks, he says, \"I observed on my last voyage (1817) about two thousand square leagues (18,000 square miles,) of the surface of the Greenland Seas, included between the parallels 74° and 80°, perfectly void of ice, all of which has disappeared within the last five years,\" and he further states, that though on former voyages, he had very rarely been able to penetrate the ice, between the latitudes of 76° and 80°, so far to the West as the meridian of Greenwich, 'on his last voyage he twice reached the longitude of 10° West,' that in the parallel of 74°, he approached the coast of Old Greenland; there was little ice near the\nland; and adding, 'that there could be no doubt but he might have reached the shore had he had a justifiable motive for navigating an unknown sea at so late a season of the year.' He also found the sea so clear in returni... to the southward, that he actually landed on Jan Mayen's Island, which is usually surrounded with a barrier of ice, and brought away specimens of the rocks.\n\nAnother fact deserves to be mentioned. Dr. Olinthus Gregory, who sailed from Shetland to Peterhead in the Neptune of Aberbeen, on her return from the fishery, is said to have reported, that Driscoll the master, not only landed on the East Coast of Greenland about the latitude of 74°, but found and brought away a post bearing an inscription, in Russian characters, that a ship of that nation had been there in the year 1774; which post with its inscription was seen on board by Dr. Gregory. It would seem indeed, that the northern part of the East coast of Greenland has been approached at various times by different nations—Dutch, Danes, and English. Hudson, in 1607, saw the coast nearly in the same latitude as that where Driscoll is supposed to have landed; and actually sent a boat on shore in 80° 25'. It is from Hudson's 'Hold with Hope,' in about 72° to Cape Farewell, that the ice fixed itself to the land from which it has recently been detached.\n\nThat this is the case we can state from the best authority:—intelligence was received at Copenhagen, from Iceland, in September last, of the ice having broken loose from the opposite coast of Greenland, and floated away to the southward, after surrounding the shores, and filling all the bays and creeks of that\nisland; and this afflicting visitation was repeated in the same year, a circumstance hitherto unknown to the oldest inhabitant.\n\nWe have said that the most probable cause for the sudden departure of all this ice, is that of its having broken loose by its own weight. It has been observed, however, as a remarkable coincidence, that its removal was contemporaneous with the period about which the variation of the magnetic needle to the westward became stationary. It is well known that in the sea of Baffin (gratuitously called a bay,) the compass is affected in a most extraordinary manner; and that the variation is greater there than in any other known part of the world; so great indeed, as to lead to the belief that one of the magnetic poles must be situated in that quarter:—But how does this, it may be asked, furnish a clue for the disappearance of the ice, which it would seem has also floated from thence in greater quantities than usual?\n\nThe connexion is certainly not very obvious, though there is reason to believe that it exists. The aurora borealis, for instance, is supposed to owe, if not its origin, at least its intensity to the changes which take place either in the freezing, thawing, or collisions of the polar ice; and in winter, even in Sweden, this intensity is so powerful, and the motions of the aurora so rapid, that a crackling noise is heard not unlike that of the furling of a fan, or the emission of sparks from the cylinder of an electric machine. At such times the magnetic needle has been observed to be so much affected as to vibrate violently with a tremulous motion, and sometimes to fly round the whole circumference of the horizon. The theory of Dr. Franklin to account for the phenomenon of the aurora is not inapplicable to the present state of the\npolar ice. He supposes this meteor to be owing to the vast quantity of electricity accumulated in the atmosphere, and unable to pass off into the earth on account of the non-conducting substance of ice, with which the land and sea are there incrusted; this theory might serve to explain the first notice of the aurora borealis about a century after the fixing of the ice along the coast of Greenland, as well as the rarity of its appearance of late years. At any rate, however, if the electricity of the atmosphere has so extraordinary an effect on the magnetic needle, and the changes which take place in the ice on atmospherical electricity, it would seem not unfair to infer, that the departure of the immense fields and mountains of ice, which for so many centuries have covered the arctic seas, may have had some effect in stopping the career of the western declination of the needle. We merely throw out the hint to draw the attention of those scientific men, who may be employed on the expedition of discovery now in preparation; in the mean time, in our present ignorance of the immediate cause, we must be satisfied to ascribe the revolution that has taken place to the decree of Providence, who, as Paley observes, 'is the author of infinitely various expedients for infinitely various ends,' to consider it as the result of one of those prospective contrivances, which are appointed to correct the anomalies, and adjust the perturbations of the universe.\n\nThe fact, however, of the disappearance of the ice being established beyond any doubt, it becomes a subject of no uninteresting inquiry, whether any and what advantages may arise out of an event which for the first time has occurred, at least to so great an extent, during the last four hundred years?\nAmong other objects which present themselves as worthy of research, the following are no less interesting to humanity, than important to the advancement of science and the probable extension of commerce.\n\nFirst.—The influence which the removal of so large a body of ice may have on our own climate. Secondly, the opportunity it affords of inquiring into the fate of the long-lost colony on the eastern coast of Old Greenland. Thirdly, the facility it offers of correcting the very defective geography of the arctic regions in our western hemisphere; of attempting the circumnavigation of Greenland, a direct passage over the pole, and the more circuitous one along the northern coast of America, into the Pacific.\n\n1. It would be a waste of words to enter into any discussion on the diminution of temperature, which must necessarily be occasioned by the proximity of vast mountains and islands of ice. The authentic annals of Iceland describe that island as having once been covered with impervious woods; and numerous places still bear the name of forest, which produce only a few miserable stunted birches of five or six feet high, and in which all attempts to raise a tree of any kind have for ages proved unavailing. The most intelligent travellers, who, in our time, have visited this island, bear testimony to the fact of large logs of wood being dug out of bogs, and found between the rocks and in the valleys. It is also said that good culinary vegetables were once produced on it; but the cabbages seen there by Mr. Hooker, in the month of August were so diminutive that a half crown piece would have covered the whole plant. Nothing but a deterioration of climate could have wrought these changes; and this can only be\nexplained by the vast increase of floating ice, 'which,' says Hooker, 'not only fills all the bays, but covers the sea to that extent from the shore, that the eye cannot trace its boundary from the summit of the highest mountains.' Sometimes it connects the island in one continued mass with Greenland, when the white bears come over in such alarming numbers, that the inhabitants assemble and wage a national war against them. These masses of ice drive about with such rapidity, and rush against one another with so much violence, that the floating wood brought along with them is said sometimes to take fire by the friction. During this conflict, the weather is unsettled and stormy; but when once the ice becomes fixed to the land, the air thickens, and dense fogs, accompanied by a moist and penetrating cold, destroy all vegetation, and the cattle perish.\n\nSimilar effects, but to a less extent, are said to have been experienced in Switzerland. So little is it there doubted that the progress of cold has kept pace with the progressive encroachment of the glaciers on the valleys, that the first prize of the Society of Berne for improving Natural Knowledge, is appropriated to the best essay on this subject. In the absence of direct proof from thermometrical observation of the increasing chilliness of the climate, it is asserted, on the authority of their annals, that many parts of the Alps, now bare, once afforded good pasturage; that both historical evidence, and remaining traces, prove the existence of forests in places where no tree, at present, can vegetate; and that the lower limit of perpetual frost is constantly descending. The same effect has been experienced in North America. In the year 1816 the mays or Indian corn, did not ripen along the whole coast from Pennsylvania to Massachusetts—a circumstance\nwhich had not happened before in the memory of the oldest inhabitant:—at this time the ice was floating down the shores of the Atlantic as far as the fortieth parallel.\n\nIf such be the facts; and they cannot well be questioned, with regard to these countries, it is equally clear that our own climate, though in a less degree, must have been affected by this vast accumulation of ice on the East coast of Greenland. The distance between the centre of Iceland and Edinburgh is not more than twice, and that from Iceland to London not above three times, the distance between Iceland and the east coast of Greenland. That our climate has been more particularly affected, in the course of the last three years, by the descent of the ice into the Atlantic, and more especially in the summers of the years 1816 and 1817, is a matter of record; for on comparing, by the meteorological register of the Royal Society, the four summer months, May, June, July, and August, of 1805, 1806, and 1807, with the four corresponding months of the last three years, it will be seen that a very considerable diminution of temperature has taken place in the latter periods.\n\n| Year | Great-Mean height | Great-Mean height | Great-Mean height | Great-Mean height | Great-Mean height |\n|------|-------------------|-------------------|-------------------|-------------------|-------------------|\n| 1805 | 72° 52.4°         | 68° 58.2°         | 75° 57.8°         | 64° 53.3°         | 84° 57.9°         |\n| 1815 | 75° 57.7°         | 70° 61.6°         | 83° 62.5°         | 70° 58.2°         | 77° 60.3°         |\n| 1806 | 79° 62.1°         | 72° 62.9°         | 81° 64.5°         | 69° 58.8°         | 85° 66.5°         |\n| 1816 | 79° 65°           | 69° 63.5°         | 81° 64.5°         | 69° 61°           | 80° 66.7°         |\n| 1807 |                   |                   |                   |                   |                   |\n| 1817 |                   |                   |                   |                   |                   |\n\nHere we find a difference of 11°, 12°, and 13°, between the highest temperature of August, July, and June, in the year 1806 as compared with 1816; 16° and 17° between July and May of\n1807, as compared with the highest degree of heat in the corresponding months of 1816; and no less than 20° in the month of May 1807 and 1817; and the mean temperature of the four months is invariably less by several degrees in 1816 and 1817, than in either 1806 or 1807, excepting in the month of June 1817, when ten or twelve hot days occurred with the wind at East; the only ones we had during the summer. In the summers of both years the mercury invariably fell with westerly winds. It can scarcely be doubted, therefore, that the remarkable chilliness of the atmosphere in the summer months of those two years was owing to the appearance of ice in the Atlantic; and if this be admitted, as little can it be doubted, that the destruction of so many thousand square leagues of ice, holds out a rational and not an unpleasing prospect, of our once again enjoying the genial warmth of the western breeze, and those soft and gentle zephyrs, which, in our time, have existed only in the imagination of the poet.\n\nThe invention of the thermometer and the registry of the temperature are of two recent a date to enable us to compare the state of the atmosphere, before and after the accumulation of ice on the coast of Greenland; but there are reasons for believing, that previously to the fifteenth century, England enjoyed a warmer summer climate than since that period.\n\nWe are aware that the changes of temperature depend on a variety of causes, yet the single effect of an atmosphere chilled and condensed over a surface of at least 50,000 square miles of ice, rushing directly upon the British Islands from the westward, may have been equal in its diminishing power to all the rest.\n2. The colony on the West side of Old Greenland increased to four parishes, containing one hundred villages; but being engaged in perpetual hostility with the Esquimaux, the whole were ultimately destroyed by them. The ruins of some of the edifices were still visible in 1721, when that pious and amiable man, Hans Egede, went out with his whole family to settle there, on the re-establishment of a colony on that coast by the Greenland Company of Bergen in Norway. It still exists, and the population, taken but imperfectly in 1802, was found to amount to 5,621 souls; and we have since learnt that, including the Moravian establishments and the natives, who have mostly been converted to Christianity, the total population of the western coast of Greenland may now be estimated at not less than 20,000. They have a few cattle, and a considerable number of sheep, for whose winter subsistence they cut the grass in the summer months, and make it into hay; but they have hitherto in vain endeavoured to bread hogs, these animals being unable to stand the severity of winter.\n\nThe Danish colony on the eastern was still more extensive than that on the western side. According to the Iceland Annals, it appears that it was first settled in the year 983, by Erick the Red; that the country was named Greenland, from its superior verdure to Iceland; that churches and convents were built, and a succession of bishops and pastors sent over; and that, from the latest accounts, it consisted of twelve parishes, one hundred and ninety villages, one bishop's see, and two convents; that, in the year 1406, when the seventeenth bishop was proceeding from Norway to take possession of his see, the ice had so closed in upon the coast, as to render it inaccessible. From that period, till last\nsummer, all communication seems to have been cut off with the unfortunate colonists. It is related, however, by Thormoder Torfager, in his History of Greenland, that Bishop Amand, of Skalholt in Iceland, as he was returning from Norway to that island about the middle of the sixteenth century, was driven by a storm on the East coast of Greenland, off Herjolsness, immediately opposite to Iceland, which the vessel approached so near that the people on board could distinguish the inhabitants driving their cattle in the meadows; but the wind coming fair, they made all sail for Iceland, which they reached the following day, and came to anchor in the Bay of St. Patrick.—Of all the attested relations, this of Bishop Amand, says Hans Egede, 'deserves most to be credited:' 'by this,' he continues, 'we learn that the colony of the eastern district did flourish about a hundred and fifty years after the commerce and navigation ceased between Norway and Greenland; and, for aught we know, is not yet wholly destitute of its old Norwegian inhabitants.'\n\nIt has been supposed by some writers, that the black death, which in 1348, desolated Europe, extended its ravages to Greenland; but this assumption, as Mr. Egede observes, is without any foundation, as an uninterrupted intercourse appears to have been maintained with the colony for fifty-eight years after this dreadful malady had ceased. He thinks, however, that, partly by the change of the government in Queen Margaret's reign, and partly from the continual wars which ensued between the Danes and the Swedes, the Greenland colonists may have been neglected; for it does not appear that any steps were taken for a century, after the unsuccessful attempts of the bishop to land, when the Christians and the Fredericks, calling to mind these remote and long-neglected\npossessions, took measures for inquiring into the fate of their unfortunate subjects. One Mogens Heinson, a celebrated seaman of those days, was employed among others on this service. After many difficulties he got sight of the coast, but could not approach it; and the reason he assigned, on his return, was, 'that his ship was stopped in the midst of its course, by some loadstone rocks hidden in the sea.' Many subsequent attempts were made, but all proved ineffectual.\n\nEndeavours were also used to ascertain their fate from the colony on the western side, by coasting round Staatenhoek; and in one of these expeditions Egede himself embarked, but was obliged to return without being able to effect his humane purpose. The Esquimaux pretend that they are afraid to approach the eastern shore, which they say is inhabited by a tall and barbarous race of men, who live on human flesh.—Thus has terror or malice created cannibals on every unknown or uncivilized part of the globe! After so many attempts, both public and private, how the Danes can now pretend to doubt, as one of their writers affects to do, whether there ever was a colony on the eastern side, is, to us, quite inexplicable, unless it be to palliate their negligence at the first approach of the ice, and their want of humanity since. The Danish government however entertained no such doubts; for so late as the year 1786, Captain Lowenorn, of the Danish navy, was sent out for the express purpose of re-discovering the old colony on the eastern coast. The particulars of this voyage, we believe, were not made public; but the following extract of a letter from Mr. Fenwick (the British consul) to the secretary of the Admiralty, dated Elsinore, 9th September, 1786, proves its failure:—Captain Lowenorn repassed three days ago, for Copen-\nhagen, after a fruitless search of about two months, to find out the Old Greenland; not having been able to penetrate to where it is supposed to be, on account of endless shoals of ice. He left, however, Lieutenants Egede and Rhode, in the New Experiment fishing dogger, to seize any more favourable opportunity which may offer, better than he met with, for penetrating farther, if practicable, to operate any new discoveries after his departure, though entertaining very poor hopes of any success. These lieutenants, we believe, never once got sight of the land.\n\nIt has fallen to the lot of the present age to have an opportunity, which we are sure will not be neglected, of instituting an inquiry into the fate of these unfortunate colonies.\n\n3. Any event that tends to encourage the attempt to amend the very defective geography of the arctic regions, more especially on the side of America, may be hailed as an important occurrence. The removal of the ice may be considered to afford a fair opportunity for prosecuting discoveries in that quarter, for endeavouring to circumnavigate Old Greenland, and to settle the long disputed question as to its insularity, or its connexion with the American continent—to examine the sea usually named Baffin's Bay on the charts—and to attempt the solution of that interesting problem, whether a free and uninterrupted communication exists between the Atlantic and Pacific Oceans, round the northern coast of North America.\n\nSeveral circumstances may be adduced in support of the opinion that Greenland is either an island or an archipelago of islands, in which case Baffin's Bay must be expunged from the\ncharts. A perpetual current, setting down from the northward, along the eastern coast of America, and the western shores of Old Greenland, affords a strong presumption, that between Davis's Strait and the great polar basin there is an uninterrupted communication: for if Greenland were united with the continent of America, and Davis's Strait terminated in Baffin's Bay, it would be difficult to explain how any current could originate at the bottom of such a bay, much less a current that is stated to run sometimes with a velocity of four and even five miles an hour. But this is not the only argument in favor of the continuance of an open sea to the northward. Vast quantities of drift-wood are floated down this northern current, as well as down the eastern side of Greenland, sometimes filling all the bays on the northern coast of Iceland. None of this could have grown to the northward, as not a stick of wood, beyond what a dwarfish coppice of birch may produce, is to be found in a growing state, for many degrees below the places where these logs are cast up, much less to the northward, whence they come. That many of them have recently been in a growing state appears from the fragments of bark and branches still adhering to them: that they have been floating in a warmer climate would also appear from some of them being eaten by the worm, and others having the marks of the workmen upon them. They consist of fir, larch, birch, aspen, and other trees, which are, in fact, the produce both of Asia and America, and, in all probability, have been floated down the numerous rivers of both these continents, (some, perhaps, through Behring's Strait,) into the great polar basin, and carried thence by the circumvolving current through the outlet into the northern ocean. It is fair\ntherefore to conclude that there must exist a free and open passage between this basin and Davis's Strait. The fact of several vessels having been as high as Baffin without observing the least appearance of land, removes all doubt as to the non-existence of the bay, as drawn in the charts. The master of the Larkins, of Leith, gave out that he had been last year as far up as 80°; but on a reference being made to Mr. Wood, the owner, he closely examined him, and found occasion to conclude that he had not proceeded higher to the northward than 77°, but that the sea was clear, and no land in sight. In the same year Captain Lawson, of the Majestic, having passed the ice, ran in an open sea as high as 76° without being obstructed by land.\n\nA third argument in favor of the insularity of Old Greenland may be adduced from a fact, well known to the fishermen, that whales, struck with harpoons on the coast of Spitzbergen are very commonly killed in the Strait of Davis with these harpoons in their bodies, and vice versa; there can be no mistake here, as the names of the vessels, and the ports to which they belong, are always cut into the sockets of their harpoons. Captain Franks, in 1805, struck a whale in Davis's Strait, which was killed near Spitzbergen by his son, who found his father's name on a harpoon sticking in its body: and the same year, in the same place, Captain Sadler killed a whale with the harpoon of an Esquimaux in it. The distance which these wounded whales would have to run round the North of Greenland is so much shorter, and whales are so rarely seen to enter the Strait of Davis round Cape Farewell that the probability is altogether in favor of the former supposition.\nAs the northern coast of America has been found to terminate at the mouths of Mackenzie's River, and of the Copper-mine River, about the 70th parallel of latitude: as Icy Cape appears to be the extreme point of America, on the West, and as no one has traced its termination on the East, beyond the arctic circle, or 67° at farthest, it is reasonable to conclude that the general trending of that coast, from one extremity to the other, may keep within the 69th and 71st parallels of latitude; and this is rendered the more probable by the Asiatic coast running, with the exception of one or two points, nearly along those parallels. The whole distance from the eastern to the western extremity of America, or from A. to B. is little more than four hundred leagues, in which the coast has been seen to terminate at three different and nearly equidistant points: so that it may almost be said that the fourth point only, remains to be discovered. The doubling of this fourth and unknown point A. is the great difficulty to be got over; and it would certainly prove an insurmountable one, if, as in some charts, the continent of America was found to be united with Old Greenland; but the circumstance of the wounded whales and the constant current from the northward, render (as we have already observed) such a supposition highly improbable.\n\nWe are fully aware, that the principal ground of objection to a free communication between the Pacific and the polar basin arises from Captain Cook having found little or no current to the northward of Behring's Strait. Our answer to this is, that there is little or no current in a mill-dam, though its waters may be rushing out with the greatest violence under the flood gate. The inclination of the shores of Asia and America towards each other forms such a dam, into which currents have been observed\nto set with extraordinary velocity along the West coast of America, and the eastern shores of Japan and Kamtschatka. The impenetrable barrier of ice, which stopped the progress of Cook's successors, may be considered as the temporary head and flood-gate of this dam: and as it was eight or ten feet above, it could not be less than fifty or sixty feet below the surface of the sea; but the water was more than a hundred feet deep below this, affording ample space for its escape, which it might do with great velocity, without being in the smallest degree perceptible on the surface. It would be difficult to explain the perpetual egress of a current from the polar basin into the Atlantic, which is a well authenticated fact, without admitting a supply through the only remaining opening into that basin, to answer the demand of that current: those who could suppose the melting of the ice to afford such a supply, would betray a total ignorance of the very little influence which an arctic summer exerts on fields of ice, perpetually surrounded, as they are, with a chilly, and mostly with a freezing atmosphere created by themselves. Besides, the southerly current setting into the Atlantic on both sides of Greenland is perpetual, not only when the ice is melting, but also when the sea is freezing. Lieutenant Parry, of the navy, in returning last year from Halifax, met with an island of ice more than a hundred and fifty feet high, and two others of a smaller size in latitude 44° 21' North, so early as the 2d of April. These ice-bergs must have floated out of the polar basin in the middle of winter, unless they stopped by the way. It has been suggested, we believe, that the disproportion of the opening into the Polar basin through Behring's Strait, and those out of it through Davis's Strait, and between Greenland and Spitzbergen, is fatal to the theory we have assumed: but when\nwe reflect on the vast disproportion that occurs in the breadth of rivers in different parts of their course, and that where widest they are very often found to be deepest, the objection, we think, will not be deemed conclusive, especially if it should be found, as we apprehend it will, that the currents of the ocean, where no land intervenes, are entirely superficial. The Gulf stream between the Bahamas and East Florida is very little wider, and perhaps not much deeper, than Behring's Strait; and yet the water rushing through this passage is of sufficient force and quantity to put the whole northern Atlantic in motion, and to make its influence to be felt in the distant strait of Gibraltar, and on the more distant coast of Africa. It must also be recollected that several of the largest rivers of Asia, and two or three of North America, discharge a very copious supply of water into the polar basin.\n\nThe same circumstance of whales struck with harpoons in the sea of Spitzbergen, or in the Strait of Davis, being found on the north-westward coast of America, as far down as Nootka Sound, affords an additional argument for a free communication between the Atlantic and Pacific: unless it should be contended that such wounded whales took the long and circuitous route by Cape Horn. It was a fact of this kind which, at a very early period, led to the conjecture of a passage from the sea of Japan to the northern Atlantic. Hamel says, 'In the sea to the North-east of Korea, they take every year a great number of whales, in some of which are found harpoons and striking irons of the French and Dutch, who practise the whale fishery at the extremities of Europe: whence we infer (he adds) that there is\nsurely a passage between Korea and Japan which communicates to the Strait of Waigatz.\n\nThe cause of failure in every attempt, either to make the passage, or to ascertain its impracticability, appears of no difficult explanation. Owing to the great depth at which ice floats in water, it must take the ground at a considerable distance from the shore, where as we have already observed, it becomes a nucleus for floating patches to form round it; and the summer sun having little power on such enormous masses, they accumulate in magnitude, and spread over a wider surface, from year to year; and if large fragments were not frequently torn from them and borne away by the currents, the whole surface of the straits and narrow seas would in process of time be covered with ice. Owing to this circumstance, we find the bays and harbors of Newfoundland, of Nova Scotia, and Cape Breton, the Strait of Belleisle, and the shores of the islands in the Gulf St. Lawrence, every year choked up with ice, though all of them are more to the southward than London. The more northerly straits and islands, which form the passages into Hudson's Bay, are of course never free from mountains and patches of ice: and yet all the navigators, proceeding on discovery, have either entered these straits, and had to struggle against the ice and currents, and tides on the east coast of America, or have kept so close to the land on the west coast of Greenland, as to encounter the same obstacles: so that, on the former, the highest point ever reached is the 67th parallel, which is three or four degrees short of the point A. near which, as we have before stated, the north-eastern extremity of America may be expected to be found.\nThe mid-channel of Davis's Strait, on the contrary, is known at particular seasons to be free of ice in much higher latitudes. The master of the Larkins above-mentioned, after passing the ice and reaching the latitude $75^\\circ$ North, the coast of Greenland then in sight to the eastward, stood from hence to the westward, in that parallel, three hundred miles, the sea entirely free, with the exception of here and there a detached ice-berg floating to the southward. At this point he observed a yellow sky, or what is usually termed the land-blink, to the south-west. The position of the ice, however, is constantly changing. The same year the James, of Whitby, meeting with a compact body of ice in latitude $75^\\circ$, turned back and came home; but the Larkins, as we before stated, persevered and got through, when she proceeded as high as $77^\\circ$ found plenty of whales, and the sea clear of ice.\n\nSpitzbergen is usually surrounded with ice: but the sea to the northward is generally so open, that it is a prevailing idea among the whale fishers, that there would be no difficulty of approaching the pole from that quarter. The late Mr. Daines Barrington collected much curious information on this point, and was so well satisfied of the practicability of approaching the pole, that he prevailed on the president and council of the Royal Society to recommend to Lord Sandwich a voyage of discovery towards the North pole: the suggestion was adopted, and the command of the expedition given to Captain Phipps (afterwards Lord Mulgrave) who obviously failed by getting entangled in the ice near Spitzbergen. It is this accumulation of ice round the land, rather than the degree of latitude, that causes the extreme cold and tempestuous weather about Spitzbergen and Nova Zembla: 'it is not the neernesse of the Northpole,' says De Veer, in his\npreface to Barentz's Three Voyages, 'but the ice that cometh in and out from the Tartarian sea that causeth us to feel the greatest cold.' Instead therefore of coming near the land, or endeavouring to pass through narrow straits, it will be prudent to avoid the land, and to keep as much as possible in the open sea, and in or near the edge of the current, where the sea may be expected to be free. This last year the Neptune, of Aberdeen, before mentioned, reached the latitude of $33^\\circ 20'$ in the sea of Spitzbergen, which is within four hundred miles of the pole, the sea open and clear of ice: Dr. Gregory found the master a clear-headed, cautious seaman, and supplied with the ordinary instruments for nautical purposes. We have heard of several other whalers who reached beyond $81^\\circ$ North.\n\nThe surface of the sea, in fact, is not easily frozen in any latitude; the thermometer of Fahrenheit must be down to $27^\\circ$ before a pellicle of ice can be formed; and it will not form even at zero, unless the weather be calm and the surface unruffled; and then only what the whalers call pancake ice. We have frequently the mercury in Fahrenheit's thermometer below zero, yet who ever saw the English channel frozen over, or any part of the Atlantic on this side? It is the narrow seas only, and those without tides or currents, that freeze over. The ice-bergs, or mountains of ice, are generated on the land, either in valleys, or against steep shores; they are avalanches: and it is a remarkable fact, that all the ice, brought by the South-west current round Spitzbergen, is field-ice; whilst that which comes down Davis's Strait is mountain-ice. It is on this ground that we have marked on the diagram the undefined land, which has been named New Siberia, as the probable source of ice-bergs;\nand if this be so, the sea, through which these massy mountains float, must be open; and where they can float, a ship will find no difficulty in sailing. If whole fleets bound to and from Archangel annually double the North Cape in the 72d or 73d parallel, without interruption from ice, why should the polar basin be obstructed in the same or in lower latitudes? Captain Cook was well aware that the ice in Behring's Strait was not permanently fixed, and would probably have succeeded the following year in passing into the basin had his life been spared. It is well known that the Strait of Belleisle is one day so closed up that waggons may pass it, and the next so open, that no ice is to be seen: the same may be the case with Behring's Strait. Lieutenant Kotzebue, it seems, has found no difficulty in passing this strait, nor in entering a deep bay beyond it; to what extent his discoveries may subsequently have proceeded, we have yet to learn. Not a word is mentioned in his report of obstruction from ice, which would appear, indeed, to have also broken up in this eastern quarter, from the multitude of white bears which infested the peninsula of Kamtschatka, at the time when they usually seek their food on the ice, the resort of seals and sea-horses in the spring. The Russians have for some time been strongly impressed with the idea of an open passage round America; and the Kamtschatka frigate, commanded by Captain Golovrin, who was a prisoner in Japan, has proceeded on the same discovery, at the public expense, which Kotzebue is employed on by the private liberality of Count Romanzoff. It would be somewhat mortifying, if a naval power but of yesterday should complete a discovery in the nineteenth century; which was so happily commenced by Englishmen in the sixteenth; and another Vespucius run away with the honours due to a Columbus. There is, however, little to fear on\nthis score. Two expeditions, of two small ships each, are fitting out for northern discoveries and scientific researches; the one, we understand, is to proceed northerly into the polar basin, and to endeavour, by passing close to the pole, to make a direct course to Behring's Strait; the other is to push through Davis's Strait for the north-east coast of America; and, if successful in discovering and doubling the unknown point A, to proceed to the westward, with the view of passing Behring's Strait.\n\nFrom one or both of these expeditions lively hopes are entertained, that this curious and important problem in geography, which engaged the attention of our early navigators, will be solved; and, if a practicable passage does exist, that it will not much longer remain undiscovered. The character of the several officers who have been appointed, and the men of science who, we understand, are to embark on this grand enterprise, and the means in preparation, afford the strongest presumption, that whatever talent, intrepidity, and perseverance can accomplish will be effected.\n\nFour merchant-vessels have been hired, and rendered as strong as wood and iron can make them. Their names are the Isabella and the Alexander, the Dorothea and the Trent; the first two being intended to proceed up Davis's Strait, under the command of Captain Ross; the other two by the route of the north pole, under Captain Buchan, and all four to make the best of their way to Behring's Strait. The Alexander and the Trent are two brigs, the former commanded by Lieutenant Parry, the latter by Lieutenant Franklyn, with a junior lieutenant to each of the four vessels, and two midshipmen, who have served their time and\npassed their examinations, one assistant-surgeon, and a purser. To each vessel have also been appointed a master and a mate, well experienced in the navigation of the Greenland seas and Davis's Strait who are to act as pilots among the ice. All the men to be employed on this bold and hazardous enterprize are to be volunteers, and both they and the officers are to receive double pay. Every preparation has been made of fresh provisions, wine, spirits, medicine, and warm clothing, in the event of their being obliged to winter in the ice, or on the coast of America.\n\nCaptain Ross was long and actively employed in the Baltic, and, having twice wintered there, is well trained to the cold and the ice; he has also been as far to the northward as Cherry, or Bear island in the Greenland seas. Lieutenant Parry, who accompanies him, served for several years on the coast of America, is an excellent navigator, theoretical as well as practical, and has published a valuable treatise, for the use of the young officers in the fleet, on nautical astronomy. Captain Buchan is an active and enterprising officer, who for many years has been accustomed to the navigation of the icy seas in the neighbourhood of Newfoundland and received his promotion to the rank of commander for his zeal and good conduct on that station. He also made a land journey, over ice and snow, into the very heart of Newfoundland, in order to obtain an interview with the natives, being the first European who ever ventured among them. Lieutenant Franklyn, who accompanies him as second in this expedition, was brought up under the late Captain Flinders, and is well acquainted with nautical surveying and the use of instruments. The junior lieutenants in each of the brigs are the sons of two eminent artists, and both good draughtsmen, the one the son of the late Mr.\nHoppner, who conducted Lord Amherst and his party in the open boats to Batavia, after the wreck of the Alceste; the other of the present Sir William Beechy.\n\nIt probably may not strike the reader at first, that the distance from Shetland islands to Behring's Strait, by pursuing the route of Davis's Strait, and supposing a passage along the northern coast of America, on the parallel of $72^\\circ$ is just half as long again as that from the same point on a meridian passing through the pole; such, however is the case; the former being 1,572 leagues, and the latter only 1,048 leagues. The distance by the polar route, from the mouth of the Thames to Canton, is much less than half of that by the usual track round the Cape of Good Hope, being only 2,598 leagues, while the other is 5,500 leagues.\n\nIf an open navigation should be discovered across the polar basin, the passage over the pole, or close to it, will be one of the most interesting events to science that ever occurred. It will be the first time that the problem was practically solved with which the learners of geography are sometimes puzzled—that of going the shortest way between two places, lying east and west of each other by taking a direction north and south. The passage of the pole will require the undivided attention of the navigator. On approaching this point, from which the northern coasts of Europe, Asia, and America, and every part of them, will bear south of him, nothing can possibly assist him in determining his course, and keeping on the right meridian of his destined place, but a correct knowledge of the time, and yet no means of ascertaining that time will be afforded him. The only time he can have with any degree of certainty, as long as he remains on or\nnear the pole, must be that of Greenwich, and this he can know only from good chronometers—for, from the general hazy state of the atmosphere and particularly about the horizon, and the sameness in the altitude of the sun at every hour in the four-and-twenty, he must not expect to obtain an approximation even of the apparent time, by observation, and he will have no stars to assist him. All his ideas, respecting the heavens and the reckoning of his time will be reversed, and the change not gradual as in proceeding from the east or the west, or the contrary, but instantaneous. The magnetic needle will point to its unknown magnetic pole, or fly round from the point of the bowl in which it is suspended, and that which indicated north will now be south; the east will become the west, and the hour of noon will be that of midnight.\n\nThese curious circumstances will probably be considered to mark the passage by the pole as the most interesting of the two, while it will perhaps be found equally easy. We have indeed very little doubt, that if the polar basin should prove to be free from land about the pole, it will also be free of ice. A sea of more than two thousand miles in diameter, of unfathomable depth (which is the case between Greenland and Spitzbergen) and in constant motion is not likely to be frozen over at any time. But if all endeavours to discover a passage to the Pacific by either route should prove unavailing, it will still be satisfactory to have removed every doubt on the subject by ascertaining the fact. In making the attempt, many objects, interesting and important to science, will present themselves to the observation of those who are engaged in the two expeditions. That which proceeds up Davis's Strait will have an opportunity of adjusting the geography of the north-east coast of America, and the west coast of Green-\nland; and of ascertaining whether the latter be not an island or an archipelago of islands; and much curious information may be expected from both. They will ascertain—what is as yet but very imperfectly known—the depth, the temperature, the saltness, and the specific gravity of the sea-water in those high latitudes—the velocity of the currents, the state of atmospherical electricity in the arctic regions, and its connexion, at which we have glanced, with the inclination, declination, and intensity of force of the magnetic needle, on which subject alone a collection of facts towards the upper part of Davis's Strait would be worth a voyage of discovery. It has indeed long been suspected, that one of the magnetic poles will be found in this neighbourhood, as in no part of the world have such extraordinary phenomena been observed, or such irregularities in the vibration and variation of the needle. Captain Muirhead before quoted, states that, by several good observations, he found the variation in latitude $75^\\circ 30'$ no less than eight points; that is to say, when the sun was on the meridian at midnight the needle pointed to the east. A comparison of the magnetic influence near the pole with what it has been observed to be on the equator, might lead to important results; and the swinging of a pendulum as near to the pole as can be approached, to compare with the oscillations observed in the Shetland Islands and in the southern hemisphere, would be a great point gained for science.\n\nEND OF THE APPENDIX.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_21045.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 165, "total-input-tokens": 308354, "total-output-tokens": 53975, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1491, 3], [1491, 2597, 4], [2597, 2597, 5], [2597, 2972, 6], [2972, 2972, 7], [2972, 3406, 8], [3406, 3406, 9], [3406, 4306, 10], [4306, 5919, 11], [5919, 6671, 12], [6671, 6671, 13], [6671, 7409, 14], [7409, 9096, 15], [9096, 10677, 16], [10677, 12424, 17], [12424, 13909, 18], [13909, 15356, 19], [15356, 16921, 20], [16921, 18580, 21], [18580, 19984, 22], [19984, 21365, 23], [21365, 22599, 24], [22599, 23803, 25], [23803, 25442, 26], [25442, 26802, 27], [26802, 26802, 28], [26802, 26802, 29], [26802, 28416, 30], [28416, 29775, 31], [29775, 31173, 32], [31173, 32730, 33], [32730, 34179, 34], [34179, 35395, 35], [35395, 37003, 36], [37003, 38352, 37], [38352, 40004, 38], [40004, 41411, 39], [41411, 43083, 40], [43083, 44567, 41], [44567, 45925, 42], [45925, 47571, 43], [47571, 49048, 44], [49048, 50410, 45], [50410, 51723, 46], [51723, 53291, 47], [53291, 53291, 48], [53291, 53291, 49], [53291, 54886, 50], [54886, 56385, 51], [56385, 56385, 52], [56385, 56385, 53], [56385, 58073, 54], [58073, 59605, 55], [59605, 61048, 56], [61048, 62716, 57], [62716, 64282, 58], [64282, 65814, 59], [65814, 65814, 60], [65814, 65814, 61], [65814, 67343, 62], [67343, 68684, 63], [68684, 70125, 64], [70125, 71932, 65], [71932, 73377, 66], [73377, 74936, 67], [74936, 75950, 68], [75950, 75950, 69], [75950, 76750, 70], [76750, 78202, 71], [78202, 79736, 72], [79736, 84054, 73], [84054, 85475, 74], [85475, 86863, 75], [86863, 88419, 76], [88419, 89820, 77], [89820, 91393, 78], [91393, 92712, 79], [92712, 94120, 80], [94120, 95522, 81], [95522, 97255, 82], [97255, 98930, 83], [98930, 100390, 84], [100390, 101605, 85], [101605, 101605, 86], [101605, 101605, 87], [101605, 103222, 88], [103222, 104881, 89], [104881, 106374, 90], [106374, 107939, 91], [107939, 107939, 92], [107939, 107939, 93], [107939, 109326, 94], [109326, 111038, 95], [111038, 112503, 96], [112503, 112503, 97], [112503, 112503, 98], [112503, 112503, 99], [112503, 114100, 100], [114100, 114100, 101], [114100, 114100, 102], [114100, 115491, 103], [115491, 117105, 104], [117105, 118664, 105], [118664, 120297, 106], [120297, 121868, 107], [121868, 123464, 108], [123464, 124925, 109], [124925, 126471, 110], [126471, 127915, 111], [127915, 129261, 112], [129261, 130327, 113], [130327, 131792, 114], [131792, 133548, 115], [133548, 135031, 116], [135031, 136326, 117], [136326, 137808, 118], [137808, 139052, 119], [139052, 140465, 120], [140465, 141862, 121], [141862, 143314, 122], [143314, 144847, 123], [144847, 146335, 124], [146335, 147920, 125], [147920, 149576, 126], [149576, 150723, 127], [150723, 151308, 128], [151308, 152277, 129], [152277, 152969, 130], [152969, 152969, 131], [152969, 152969, 132], [152969, 152969, 133], [152969, 154258, 134], [154258, 156086, 135], [156086, 157865, 136], [157865, 159691, 137], [159691, 161399, 138], [161399, 163053, 139], [163053, 164846, 140], [164846, 166615, 141], [166615, 168344, 142], [168344, 170175, 143], [170175, 172385, 144], [172385, 174071, 145], [174071, 175854, 146], [175854, 177677, 147], [177677, 179486, 148], [179486, 181134, 149], [181134, 182928, 150], [182928, 184632, 151], [184632, 186478, 152], [186478, 188372, 153], [188372, 190088, 154], [190088, 191801, 155], [191801, 193654, 156], [193654, 195464, 157], [195464, 197361, 158], [197361, 199067, 159], [199067, 200908, 160], [200908, 202659, 161], [202659, 204520, 162], [204520, 206049, 163], [206049, 206049, 164], [206049, 206049, 165]], "primary_language": ["en", "en", "en", "en", "None", "en", "None", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "None", "None", "en", "en", "en", "None", "en", "None", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, true, false, false, false, false, true, true, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]