[{"id": "1ff556600e73428b6e47471fd41b0b220131b010", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n  Couverture de couleur\n\n- [ ] Covers damaged/\n  Couverture endommagée\n\n- [ ] Covers restored and/or laminated/\n  Couverture restaurée et/ou pelliculée\n\n- [ ] Cover title missing/\n  Le titre de couverture manque\n\n- [ ] Coloured maps/\n  Cartes géographiques en couleur\n\n- [ ] Coloured ink (i.e. other than blue or black)/\n  Encre de couleur (i.e. autre que bleue ou noire)\n\n- [ ] Coloured plates and/or illustrations/\n  Planches et/ou illustrations en couleur\n\n- [ ] Bound with other material/\n  Relié avec d'autres documents\n\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n  La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n  Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n- [ ] Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| 10X | 14X | 18X | 22X | 26X | 30X |\n|-----|-----|-----|-----|-----|-----|\n|     |     |     |     |     |     |\n\nThe following features have been checked:\n\n- [ ] Coloured pages/\n  Pages de couleur\n\n- [ ] Pages damaged/\n  Pages endommagées\n\n- [ ] Pages restored and/or laminated/\n  Pages restaurées et/ou pelliculées\n\n- [ ] Pages discoloured, stained or foxed/\n  Pages décolorées, tachetées ou piquées\n\n- [ ] Pages detached/\n  Pages détachées\n\n- [ ] Showthrough/\n  Transparence\n\n- [ ] Quality of print varies/\n  Qualité inégale de l'impression\n\n- [ ] Includes supplementary material/\n  Comprend du matériel supplémentaire\n\n- [ ] Only edition available/\n  Seule édition disponible\n\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n  Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier pli et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second pli, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE\n\nCHURCH MISSIONARY\n\nATLAS,\n\nCONTAINING\n\nMAPS OF THE VARIOUS SPHERES\n\nOF THE\n\nCHURCH MISSIONARY SOCIETY,\n\nWITH ILLUSTRATIVE LETTER-PRESS.\n\nCHURCH MISSIONARY HOUSE, SALISBURY SQUARE.\n\n1859.\n## LIST OF MAPS, &c.\n\n| Map Description                                      | Page |\n|------------------------------------------------------|------|\n| I. Chronological Chart                               | 7    |\n| II. Map of the World                                 | 9    |\n| III. West Africa                                     | 11   |\n| IV. Sierra Leone                                     | 13   |\n| V. The Yoruba Country                                | 15   |\n| VI. The Mediterranean                                | 17   |\n| VII. India                                           | 19   |\n| VIII. India (Languages, with Table, &c.)             | 20   |\n| IX. North India                                      | 21   |\n| X. Sindh and the Panjab                              | 23   |\n| XI. Part of the Bombay Presidency                    | 25   |\n| XII. South India and Ceylon                          | 27   |\n| XIII. Plan of Madras                                  | 29   |\n| XIV. The Telugu Country                               | 31   |\n| XV. Tinnevelly                                       | 33   |\n| XVI. Travancore                                      | 35   |\n| XVII. Ceylon                                         | 37   |\n| XVIII. The Mauritius                                 | 39   |\n| XIX. Part of China                                   | 41   |\n| XX. New Zealand (Northern Island)                    | 43   |\n| XXI. Rupert's Land                                   | 45   |\nPERIODICAL PUBLICATIONS\nOF THE\nChurch Missionary Society,\n\nMONTHLY PUBLICATIONS.\n\nThe Church Missionary Intelligencer. Price Five Pence.\nThe Church Missionary Record. Price Two Pence.\nThe Church Missionary Gleaner. Price One Penny.\nThe Church Missionary Juvenile Instructor. Price One Half-Penny.\n\nThe above publications can be ordered of any bookseller. They are not supplied from the Church Missionary House.\n\n[The Church Missionary Record may be supplied gratuitously to the following parties—\n1. Clergymen having the management of Parochial or District Associations, or otherwise promoting the interests of the Society.\n2. Collectors of 6d. and upwards per week, or of 20s. per annum, made up of weekly, monthly, or quarterly collections.\n\nThe Secretary or Treasurer of any such Association is requested to purchase of a Bookseller such number of Church Missionary Records as the Collectors may be entitled to by the above rules. The cost of the copies of the Record, thus obtained and issued, is to be deducted from the proceeds of the Association; and it is specially requested that specific notice of this may be inserted in the accounts when transmitted to the Parent Society in London.]\n\nQUARTERLY PUBLICATIONS.\n\n1. The Quarterly Token.\n2. The Church Missionary Quarterly Paper.\n\nThe Quarterly Token will be given to Juvenile Subscribers and Collectors under the following conditions:—\n\nTo all who subscribe or collect\n\nA Farthing a week, Threepence a quarter, or\nA Penny a month, A Shilling a year.\n\nThe Quarterly Paper is for the use of weekly and monthly Subscribers of one penny per week, who are each entitled to a copy of the Paper free.\n\nSecretaries of Associations should forward to the Society's House, Salisbury Square, a requisition for such a number of the two Quarterly Publications as they may require, in accordance with the foregoing rules; and Subscribers and Collectors are requested to apply to the Local Secretaries for their copies.\n\nANNUAL REPORT, AND SERMON AND ABSTRACT.\n\nThe following parties are entitled to the Annual Publications, on application to the Secretaries of Associations, who may obtain them by letter addressed as above, to the Society's House:—\n\n1. Annual Subscribers of One Guinea or upward; Benefactors of Ten Guineas or upward; and Clergymen subscribing 10s. 6d. per annum; are entitled to the \"Annual Sermon and Report.\"\n2. Annual Subscribers of Half-a-Guinea per annum are entitled to the \"Annual Sermon and Abstract of Report.\"\n3. Collectors of Two Shillings a-week or upward, are entitled to a copy of the \"Annual Sermon and Report, in addition to the \"Record.\"\n\nPublishers: Messrs. Seeley, Jackson, and Halliday,\n54, Fleet Street, London.\nA large edition of the Church Missionary Atlas, issued in 1857, having been exhausted, it has become necessary to prepare a second for the Press. This new edition is enriched by seven additional Maps, thus embracing the whole of the Society's present sphere of operations. The introduction of colour considerably adds to their usefulness; and the illustrative letter-press, which has been almost entirely re-written, is carried down to the present date, and is augmented to nearly twice the original amount.\n\nIn preparing this compilation, while it will be found, we hope, useful as a book of reference to the general reader in studying the Missionary subject, special reference has been directed to the Parochial Clergy and others, who may be willing to qualify themselves to aid the cause of the Church Missionary Society by their periodical and occasional advocacy at Sermons and Meetings. It may, without presumption, be repeated, that no parochial organization is complete till it embraces a Parochial Missionary Association, or Branch Association, with monthly, quarterly, or at least half-yearly Meetings, to which the people are periodically gathered, not by the allurement of a stranger's voice, or for the sake of the transient excitement of an annual appeal, but by the regular ministrations of their own Pastors, who thus lead them to take a permanent and intelligent interest in the progress of the Gospel throughout the world.\n\nThose who have not thrown themselves practically into the working out of such a system are little aware of the many attractions it presents, and the many incidental blessings it brings with it to a parish. A Missionary Association, thus sustained, weaves a bond of friendly and affectionate intercourse between the Clergyman and his Parishioners, which nothing else can supply. Nothing quickens harmony among a people like keeping steadily before them a great object of common interest to enlist their feelings and energies. And this Missionary object has a peculiar charm for the young, in whom imagination is vivid and active, and who are often enabled to look back in maturer years to emotions of religious interest first awakened in their hearts, when listening to narratives of the need or the power of the Gospel amongst civilized or barbarous heathen. To the pious poor, also, it is a boon not to be overrated: for it at once elevates them from the position of recipients of alms into the dignity of givers; brings home forcibly to their minds the contrast of their many privileges compared with those who are sitting in pagan darkness; wonderfully widens the circle of their knowledge and their sympathies; and often elicits from them such instances of simple faith and homely self-denial as speak volumes to their Pastor's heart.\n\nAbove all, what is the narrative of Missionary triumphs but the testimony of the power and presence of the Lord Jesus Christ? The journals of Missionary life—what are they but modern Acts of Apostles? The subject-matter, the chequered experience, the varying results of the preached Gospel, are found alike in the ancient and in the modern record, and demonstrate that what Christianity was then, Christianity is now. When single detached illustrations are adduced to show how the atheistic Buddhist, the impure and idolatrous Brahmin, the proud Mohammedan fatalist, the cannibal Maori, the ignorant and sensual Negro, all of them equally find the Missionary's message to be the power of God unto salvation—what cheering proofs of the unimpaired energy of our holy religion; what evidences of the Divine origin and all-comprehensive character of the Gospel remedy, suited to every grade of civilization and every type of mind, and powerful to overthrow every other form of worship with which it is brought into contact; what grounds for appeal to the consciences of those who are unwilling to admit its claims to their obedience or its adaptation to their wants! And if prayer for Missions be added to these Meetings for information—and surely without such prayer the most important part of the work is left undone—how wonderfully do such intercessions enlarge the heart, teaching it to embrace all the woes of fallen humanity, filling it with that Christ-like spirit which yearns to bring all mankind to God!\nMissionary enterprise, too, is the symbol of Christian charity. No motive of self-interest awakes it; no hope of future gain keeps it alive. It is the fruitful parent of home efforts for the spiritual good of neighbours and dependents. No flock that is imbued with the Missionary spirit will be deaf to any appeal of Christian philanthropy; and it has in it the seed of blessing to him that gives as well as to them that receive.\n\nAnd who is obviously the person on whom naturally devolves the duty of evoking and fostering this Missionary spirit, if not the Pastor of the flock? Surely on his shoulder must the burden, if it be such, be laid, and the thought cannot be allowed, that he will refuse to bear it. If the great Missionary subject, kept steadily before a parish, be all, in its reflex effects, that experience proves it to be—cementing the pastoral relation, appealing to the young, elevating the poor, developing the habit of Christian unselfishness—it is asked respectfully, how can any be satisfied to leave it untouched, or to commit it to the hands of a stranger at his single annual visit? Such results as have just been indicated can only be attained by the regular, stated, periodical Meetings, at comparatively brief intervals, which are now commended afresh to the attention of the Parochial Clergy. Let it not be thought that we do not remember how arduous are the labours of a parish Pastor in the present day; but we maintain that these periodical Missionary Meetings will lighten and sweeten his toils, and prove a means of getting at his people's hearts which he will not readily forego when he has once essayed them.\n\nNo doubt many are deterred from undertaking such Meetings by a fear that it will be difficult to maintain the interest of them over a long period. But in order to this, two things only are necessary—to love the subject, and to know it—a full heart and a full head. For the want of these, Missionary Meetings may become meagre and disappointing. But where there is not merely that love for the glory of Christ in the salvation of men's souls, which supplies the best qualification for a single or occasional exhortation to the work of aiding Missions, but also an acquaintance with current details of their present progress, there need be no fear of flagging interest. The love for Christ's glory is not ours to give; but it is to facilitate the other requisite for a successful advocate of Missions that the following pages have been compiled. This Atlas will not supersede the necessity of the perusal of the Society's publications, but it will enable the reader to take them up at any point and pursue their study without impediment, the main past facts being brought before him in a small compass, and allusions thus explained which would otherwise embarrass him.\n\nMay it please God, who \"will have all men to be saved and to come to a knowledge of the truth,\" to use these pages to the quickening of interest and exertion in that great enterprise which seems to be the special work set before the Christian Church of our own day and generation!\n\nApril, 1859.\n\nW. K.\n### A.D. Chronological Chart of the Progress of the Church Missionary Society\n\n**Authorized English Version of the Bible, 1811.**\n\n- **1661:** S.P.G. in New England founded at the instance of the Hon. R. Boyle, who preached to the N.A. Indians.\n- **1690:** S.P.C.K. founded.\n- **1701:** S.P.C.K. founded.\n- **1721:** Ziegenbalg & Planchet arrived in India, July 1721.\n- **1723:** S.P.C.K. founded.\n- **1728:** Schmidt commenced Moravian Mission among the Hottentots.\n- **1754:** M.M.S. founded.\n- **1755:** First Col. B.C. (Hove Stanniford) Carey arrived in India.\n\n| Year | Mission Founded | Income | No. Clergy | Labourers | Scholars | Ommu |\n|------|----------------|--------|------------|-----------|----------|------|\n| 1738 |                |        |            |           |          |      |\n| 1800 |                |        |            |           |          |      |\n| 1801 |                |        |            |           |          |      |\n| 1802 |                |        |            |           |          |      |\n| 1803 |                |        |            |           |          |      |\n| 1804 |                |        |            |           |          |      |\n| 1805 |                |        |            |           |          |      |\n| 1806 |                |        |            |           |          |      |\n| 1807 |                |        |            |           |          |      |\n| 1808 |                |        |            |           |          |      |\n| 1809 |                |        |            |           |          |      |\n| 1810 |                |        |            |           |          |      |\n| 1811 |                |        |            |           |          |      |\n| 1812 |                |        |            |           |          |      |\n| 1813 |                |        |            |           |          |      |\n| 1814 |                |        |            |           |          |      |\n| 1815 |                |        |            |           |          |      |\n| 1816 |                |        |            |           |          |      |\n| 1817 |                |        |            |           |          |      |\n| 1818 |                |        |            |           |          |      |\n| 1819 |                |        |            |           |          |      |\n| 1820 |                |        |            |           |          |      |\n| 1821 |                |        |            |           |          |      |\n| 1822 |                |        |            |           |          |      |\n| 1823 |                |        |            |           |          |      |\n| 1824 |                |        |            |           |          |      |\n| 1825 |                |        |            |           |          |      |\n| 1826 |                |        |            |           |          |      |\n| 1827 |                |        |            |           |          |      |\n| 1828 |                |        |            |           |          |      |\n| 1829 |                |        |            |           |          |      |\n| 1830 |                |        |            |           |          |      |\n| 1831 |                |        |            |           |          |      |\n| 1832 |                |        |            |           |          |      |\n| 1833 |                |        |            |           |          |      |\n| 1834 |                |        |            |           |          |      |\n| 1835 |                |        |            |           |          |      |\n| 1836 |                |        |            |           |          |      |\n| 1837 |                |        |            |           |          |      |\n| 1838 |                |        |            |           |          |      |\n| 1839 |                |        |            |           |          |      |\n| 1840 |                |        |            |           |          |      |\n| 1841 |                |        |            |           |          |      |\n| 1842 |                |        |            |           |          |      |\n| 1843 |                |        |            |           |          |      |\n| 1844 |                |        |            |           |          |      |\n| 1845 |                |        |            |           |          |      |\n| 1846 |                |        |            |           |          |      |\n| 1847 |                |        |            |           |          |      |\n| 1848 |                |        |            |           |          |      |\n| 1849 |                |        |            |           |          |      |\n| 1850 |                |        |            |           |          |      |\n| 1851 |                |        |            |           |          |      |\n| 1852 |                |        |            |           |          |      |\n| 1853 |                |        |            |           |          |      |\n| 1854 |                |        |            |           |          |      |\n| 1855 |                |        |            |           |          |      |\n| 1856 |                |        |            |           |          |      |\n| 1857 |                |        |            |           |          |      |\n| 1858 |                |        |            |           |          |      |\n| 1859 |                |        |            |           |          |      |\n| 1860 |                |        |            |           |          |      |\n\n*Incomplete returns from two important Missions.*\nTHE CHURCH MISSIONARY SOCIETY.\n\n\"I saw another angel fly in the midst of heaven, having the everlasting Gospel to preach unto them that dwell on the earth, and every nation, and kindred, and tongue, and people, saying with a loud voice,\n\n'Fear God, and give glory to Him; for the hour of His judgement is come: and worship Him that made heaven, and earth, and the sea, and the fountains of water.'\n\nRev. xiv. 6, 7.\n\nAlmost all commentators on the Book of Revelation who adopt what is termed the historical interpretation of it, and regard it as a prophetic portraiture of the fortunes of the Church, concur, whatever their minor differences, in the opinion that the present is emphatically the era of Missions. It is certain, as a matter of fact, that the commencement of the present century witnessed such an outburst of Missionary zeal as was unknown before, quickening into new energy the few Institutions already established, and initiating many more whose growth and expansion have far outstripped the most sanguine anticipations of their founders. In 1799 the whole amount of English contributions for Foreign Missions did not exceed £10,000, so great was then the general apathy on the subject. Now the annual receipts in the United Kingdom for the same object exceed half a million sterling.\n\nIt must not be supposed, however, that the labours of Christian Missionaries prior to the present century were unsuccessful or unimportant. They were as bright stars in the midnight sky. Not only was their work valuable as laying the foundation of some of our most flourishing Churches among the heathen; but they demonstrated, what was often controverted sixty years ago, both the need and the feasibility of Missions: their experience could be appealed to when the various nascent Societies had as yet none of their own. The holy self-denial of the Moravian Brethren, those pioneers of modern Missions; their experience among the Greenlanders that nothing but the tidings of the love of Christ could reach the heart of a heathen savage; the biographies of Brainerd and Eliot, and other of the Missionaries from the Pilgrim Fathers to the Red Indians; the first agents of the Christian Knowledge Society in South India, Ziegenbalg and Sartorius and Schwarz and Gericke; the saying of the last that \"nothing is so graceless as a Mission without Christ\"—these records, and others like them, had a powerful influence in setting a high standard of personal devotedness for all succeeding Missionaries, and in presenting evidence of the power and presence of the Saviour, both to sustain His servants under their trials, and to witness to their testimony for Him.\n\nThese efforts, however, were but harbingers of far greater. Every section of professing Christians in Great Britain began to arise to their duty towards the heathen. \"Some excellent Churchmen saw this: and while they were prepared to say, 'Grace be with all them that love our Lord Jesus Christ in sincerity;' they could not but wish that the heathen should be evangelized, in accordance with the doctrines and principles of their own Church. Feeling for its high character as a Missionary Institution, and deeply impressed with their past neglect, they were anxious to devise a remedy for it. With this view some Clergymen in the metropolis met together in the year 1799,* to concert measures for sending 'the Gospel of the\n\n*On the 12th of April, the following were present, at the Castle and Falcon, in Aldersgate Street, the Rev. John Venn in the chair; the Rev. Messrs. William Jarvis Abdy, Edward Cuthbert, John Davies, Henry Foster, Thomas Fry, William Goode, William A. Gunn, R. Middleton, John Newton, J. W. Peers, LL.D., Richard Postlethwaite, Joshua Pratt, Thomas Shepherd, Thomas Scott, and Charles H. Terrott. At a subsequent Meeting, on the 15th of April, Sir Richard Hill, and Samuel Thornton, Esq., attended, and signified their readiness to accept the office of Vice-President. On this day, also, Ambrose Martin, Esq., laid the pecuniary foundation of the Society by a Benefaction of 100l.\ngrace of God' to the idolatrous nations of the earth, in connexion with that Church of which they were the devoted servants and attached friends. So culpably indifferent, however, had our Church been to the state of heathen countries, that to Africa and the East no English Clergyman had ever gone forth as a Missionary. Our prayer had long been, that 'God's way might be known upon earth, His saving health among all nations;' but at the period to which we allude, it was evident to every reflecting mind, that the adoption of additional measures had become absolutely necessary, to bring the heathen under the benign influence of the Gospel. Hence arose the necessity for the formation of the Society for Missions to Africa and the East—as the Church Missionary Society was first designated; and it was the first Institution which sent forth Clergymen of the Church of England to preach exclusively to the heathen in those parts of the world. In 1812, its designation was changed to its present form, The Church Missionary Society for Africa and the East. This designation was given to distinguish it from the Missionary Institutions of Dissenting Bodies; and also to afford a distinct intimation that its proceedings would be conducted in conformity with the doctrines and discipline of our Communion; while the catholic spirit of the Society is evidenced by its Thirty-first Law—\"A friendly intercourse shall be maintained with other Protestant Societies engaged in the same benevolent design of propagating the Gospel of Jesus Christ.\" In accordance with the Society's name, we find that the first clause in the Laws which regulate its proceedings is as follows—\"This Institution shall be conducted by a Patron or Patrons, a Vice-Patron, a President, Vice-Presidents, a Committee, and such Officers as may be deemed necessary; all being Members of the Established Church.\"—(Brief View, pp. 2, 3.)\n\nFor the further history of the Society, we must refer our readers to the Brief View of its Principles and Proceedings, supplied on application at the Office, in which the facts stated in a tabular form in the Chart at the head of these remarks are detailed more at length. Sketches of the various Missions will be found below.\n\nIt need only be added here, that in the year 1825, the Society opened an Institution at Islington, for the purpose of training up young men for the office of Missionaries by a sound education in science, classical learning, and theology. From this Institution above 200 students have been ordained: two of the number have been raised to the Episcopate, and eight fill the office of Archdeacon; and about thirty have gone from it to labour as Catechists.\n\nA large supply of Missionaries has been obtained from a Missionary Training Institution at Basle, in Switzerland, and from other Societies on the Continent. These Missionaries, of late years, have finished their studies at Islington, and have received orders in the English Church before going abroad.\n\nIn addition to these, the Society has sent out more than fifty Missionaries from the ranks of the Clergy at home, and from the students of our Universities. The Committee are encouraged to hope that the claims of the heathen are becoming more generally recognised; and they are convinced that there is no wider sphere for the full employment of natural and acquired talents, when sanctified by the Spirit of God, than is presented by the ripening fields in heathen and Mohammedan countries.\n\nThe whole number of European labourers, of all ranks, sent out by the Society to promote the conversion of the world exceeds 470.\n\"The Field is the World.\"\n\nThe whole world is spread before the Christian Church as the field of its labours. The Saviour's parting command indicates no other limits than the race of man—all sprung from a common parent, all involved in a common ruin, all interested in a \"common faith,\" and a \"common salvation.\"\n\nThe population of the world may be viewed in reference to Christian Missions, politically, ethnologically, or religiously.\n\nI. It is obvious that the political relations of a country have a close bearing on the subject. Throughout the vast dominions of Asiatic Russia, through the possessions of the Sultan of Turkey and the Shah of Persia, through the interior of South America, in the Island of Madagascar, direct Protestant Missions are impossible, or are carried on most precariously, because these Governments know little or nothing of the principle of toleration of religious opinion, in most cases exclude the Christian teacher, and in all expose a convert to the peril of martyrdom. The countries cannot be said to be open to the Gospel. In our prayers for the removal of all hindrances to the preaching of the Word, these obstacles should be borne in mind.\n\nII. Ethnology helps us but little in our survey of the Mission field. The great number of conflicting theories and classifications of the races of mankind is enough to prove how little is known certainly or satisfactorily on the subject, for none is so clearly demonstrated as to command universal acceptance. This at least may be said, that all researches, as far as they have hitherto been prosecuted, tend to confirm and illustrate the brief Scriptural statements on the one hand, that God \"hath made of one blood all nations of men for to dwell on all the face of the earth,\" and on the other, that a dislocation or confusion of their languages took place, as at Babel, early in the world's history, such as has hitherto baffled the generalizations of science. The sources of this study of the mutual connexion of various races of men are threefold—their physical and mental endowments, their linguistic affinities, and their customs and traditions.\n\nThe labours of the late Dr. Prichard have demonstrated that the diversities of climate and other external causes are quite sufficient to account for the varieties now found among the human species, without resorting to any theory of the independent origin of different races of men. The identity of the oral traditions of tribes far removed from each other locally, points also strongly to the common origin of mankind. Considerable progress has been made in the comparative study of languages, and many have been classified, collated, and arranged under different families; but as yet our knowledge of the tongues spoken by at least half the population of the world is very superficial and imperfect, and fifty years' more research, conducted under the most favourable conditions, will be needed before any absolute opinion can be pronounced upon the subject.\n\nThe general results already obtained may be thus briefly summed up—the population of the globe being estimated at from 900,000,000 to 1,200,000,000—first, as to (A) races, secondly, as to (B) languages.\n\nA. Races—The most commonly, but by no means universally, accepted subdivisions of the human family, classify them as follows—\n\na. The Caucasian (otherwise called Aryan, Indo-European, Indo-Germanic, Iranian, Sarmatic, &c.) stretching from Iceland to Calcutta, embracing nearly all the nations of Europe, and the inhabitants of the Caucasus, Georgia, Persia, and Northern Hindustan, and including, as one of its leading offshoots (though the linguistic affinities have not yet been clearly made out) the Semitic nations, i.e. Jews, Arabians, and some minor tribes. They number about 360 millions.\n\nb. The Mongolian (otherwise called Turanian, Ugro-Tatarian, Scythian, &c.), being the most populous subdivision, containing about 550,000,000 of souls, and spreading over almost all parts of the continent of Asia not hitherto mentioned, and in Europe including the Turks, Cossacks, Finns, and Laplanders.\n\nc. The Negro of Africa and New Guinea, comparatively very little known; population formerly estimated at 80,000,000, but probably not less than 190,000,000.\n\nd. The Malay, about 200,000,000 more, peopling the Eastern Archipelago, Australia, Madagascar, New-Zealand, and the Islands of the Pacific.\n\ne. The dwindling aborigines of the American continent, now calculated at 1,000,000, are probably to be affiliated either to (c) or (d).\n\nB. Languages.—It is difficult to say how many languages there are in the world. Three hundred is probably a low estimate: the Bible, or a portion of it, exists in 150 different tongues. Our systematic knowledge of the vernaculars of Africa, America, and Northern Asia is very imperfect. The study of philology has naturally made the most progress amongst languages remarkable either for the richness of their literature or the civilization of those who speak them. By far the most important linguistic discovery of modern times was the communication of the Sanskrit language by the Brahmins of Kishnegar to the great Oriental scholar, Sir W. Jones—a sacred tongue which had hitherto been jealously secluded from the knowledge of foreigners. Sanskrit has effected a complete revolution in the science of etymology, and demonstrated undoubted affinities between the grammars and vocabularies of races before regarded as quite distinct—Celt, Saxon, Latin, Greek, Slavonic, Persian, Hindustan.\nThe miracle of Pentecost was a foreshadowing of the reversal of the curse of Babel. Even now the language of every regenerated heart is the same, and faith anticipates the time when the unity of mankind in God shall be gloriously manifested, and when \"a great multitude which no man can number of all nations, and kindreds, and people, and tongues, shall stand before the throne and before the Lamb,\" all participators in the same salvation.\n\nIII. But by far the most important aspect under which the human race is to be viewed with respect to Missionary enterprise is the question of their different existing religions. How the various false creeds in vogue in the world took their origin is a matter of speculation, and probably will always continue to be so, for the data do not exist on which to found any very satisfactory solution. The earliest form of idolatry appears to have been the adoration of the heavenly bodies and the powers of nature. Symbols erected in their commemoration were soon worshipped in the place of the thing symbolized. The worship of deceased ancestors and departed heroes was added; and a vague sense of the malignant power of evil spirits, sometimes deprecated by charms, frequently by bloody sacrifices, often by elaborate and costly ceremonies, is found in practice as the popular religious creed over almost the whole heathen world.\n\nThe following Tables exhibit the most generally received calculations as to the distribution of man according to his religious belief.\n\n| Population of the world | Heathen | Mohammedans | Jews | Christians |\n|-------------------------|---------|-------------|------|------------|\n| Millions                | Millions | Millions    | Millions | Millions |\n| Raumer                  | 650     | 310         | 110   | 5 to 9     | 228       |\n| Gosner                  | 800     | 455         | 140   | 2 to 5     | 200       |\n| Wahlman                 | 900     | 500         | 110   | 8          | 260       |\n| Keith Johnston          | 900     | 484         | 110   | 5          | 301       |\n| Sondermann              | 1600    | 631         | 160   | 9          | 200       |\n| Dieterici               | 1300    | 800         | 160   | 5          | 335       |\n\nOf the heathen by far the largest proportion are Buddhists. This materialistic and practically atheistic form of belief usurps the minds of the great bulk of the population of Eastern and Central Asia. Its adherents number at least 300,000,000. The origin of Buddhism and its date with reference to Brahminism have been the subjects of much controversy, the question being whether the latter is a corruption of the former, or the former a reformation of the latter. The preponderance of evidence is in favour of the last-named hypothesis. Gautama Buddha, the founder of the system, seems to be unquestionably an historical personage, who was born about B.C. 625, having arisen in Behar, North India, and adopted the vernacular of the district, Maghada, a corruption of Sanskrit, as the vehicle for his teaching. This language appears to be identical with Pali, the sacred tongue of Buddhism. The traditions respecting him remained unwritten till 400 years after his death. The chief doctrines of the system are the eternity of matter, the disbelief in any personal Supreme Being, and transmigration of souls, with the attainment of Nirvana or annihilation as the summum bonum. The precepts of Buddha bear a remarkable resemblance to the second Table of the Mosaic Law, and may have been derived from some of the Israelites carried into captivity. The priesthood, marked by a yellow robe, may be assumed or resigned at will by any person. It involves the vows of poverty and celibacy. The apathy and unbelief engendered by Buddhism are more formidable foes to the entrance of the truth than the rankest polytheism.\n\nBrahminism is the well-known creed of at least 160,000,000 of the teeming masses of Hindustan. Its tenets are well known or readily learnt. The gross extravagance of its idolatry, its hereditary priesthood, and its iron bondage of caste, are mighty obstacles; but they are yielding to the preaching of the Gospel, though the proportion of Missionaries to the population is little more than 1 to 500,000. \"Tell English Christians,\" said a native convert \"that we have 330,000,000 of gods, whose slaves we are. And, oh! tell them, that though these gods never spoke before, yet, in the day of judgment, the God of English Christians, who is the God of the whole world, will give each a tongue, to condemn them for not sending the Gospel and more Missionaries to India.\"\n\nThe remainder of the heathen population of the world consists of the fetish-worshippers of Africa; the Indians of America; and the unchristianized portion of the inhabitants of Australasia.\n\nMohammed was born at Mecca, A.D. 570. The Hegira dates from A.D. 622, the period of his flight from his native town. He died ten years afterwards.\n\nThe Christian population is estimated as follows—\n\n| Roman Catholics | Greek Church, Armenians &c | Protestants |\n|----------------|----------------------------|------------|\n| Gosner         | 90,000,000                 | 50,000,000 | 70,000,000 |\n| Keith Johnston | 140,000,000                | 92,000,000 | 78,000,000 |\n| Dieterici      | 170,000,000                | 65,000,000 | 76,000,000 |\nWEST AFRICA.\n\nThe West-African slave-trade, and the awful social wrongs thereby inflicted on the Negro, appeared to point to his country as having the first claim on Christian compassion; and it was to the land of Africa, accordingly, that the Society directed their earliest efforts. From 1804 to 1818 the Mission was tentative rather than settled, and various of the tribes on the sea-coast were visited, from time to time, by our agents. The earliest Missionaries settled among the Susus on the banks of the Rio Pongas, about 100 miles north of the British colony of Sierra Leone; but after labouring there for eleven years, during which time seven out of fifteen fell victims to the climate, the Mission buildings were destroyed by fire at the instigation of the slave-dealer, and the surviving Missionaries compelled to take refuge in the British colony. A station formed among the Bulloms in 1812 could not be sustained beyond six years.\n\nThe present centres of the Society's operations are the promontory of Sierra Leone, the Yoruba country on the Gulf of Guinea, and the banks of the River Niger, notices of which are given subsequently.\n\nThe continent of Africa has been of late years wonderfully opened to Europeans. Recent travellers have been active and successful in geographical researches. The lavish variety of its indigenous products is being rapidly developed. A highway is thus being prepared for the entrance of the Gospel amongst its millions of fetish-worshippers and ignorant Mohammedans. One of the most important contributions towards the knowledge of African languages has been supplied by the labours of one of the Society's Missionaries, the Rev. S. W. Koelle. He has collected specimens of upwards of 100 distinct tongues, not ten of which have yet been made the vehicle of Christian truth and love.\n\nCHRONOLOGICAL STATISTICS.\n\n1804..............Susua.\n1812..............Bulloms.\n1818..............Sierra Leone.\n1840..............Timneh Mission.\n1845..............Yoruba Mission.\n1857..............Niger Mission.\nSIERRA LEONE.\n\nSierra Leone is a rich and fertile peninsula on the western coast of Africa, about twenty-six miles long by twelve broad, with an area of about 300 square miles. It was known to the Portuguese as early as A.D. 1442, and was, even then, employed by them and other nations, including the English, as an entrepôt of the Negro slave-trade. The shore is low; but rugged mountains rise in the interior to the height of 3000 feet, whose serrated outline suggested the name of the locality. Cotton, sugar, cocoa, arrowroot, and, indeed, every species of tropical product, amply repay cultivation there, though the exports are principally confined at present to palm-oil, spices, ivory, bees-wax and timber.\n\nThe population (about 50,000) is composed of elements which do not at first sight appear to afford much promise of Missionary success. In 1787, Mr. Granville Sharpe, commiserating the runaway slaves who had congregated in great numbers in the streets of London, procured their settlement on the peninsula. Four years afterwards the African Company, promoted by Wilberforce and other opponents of the slave-trade, was incorporated, and obtained possession of Sierra Leone, and of various forts and factories on the Gold Coast. A number of Negro soldiers from West-Indian regiments, disbanded at the close of the American war, were the next addition to the population. In 1808, the settlement was transferred to the British Crown, and has since been employed as the principal location of the recaptured Africans from Spanish and Portuguese slavers. Thus the main element consists of the living cargoes of slave-ships captured at sea by the British cruisers engaged in the suppression of the hateful traffic in human creatures, liberated at Sierra Leone in wretched nakedness and degradation, and thus brought under the teaching of the Society's Missionaries. As they had been gathered from upwards of 100 tribes in various parts of Africa, speaking widely-different languages, they were taught to acquire English as a means of intercommunication with each other, as well as the medium of Christian instruction.\n\nThe first signal success rested on the labours of the Rev. William A. B. Johnson, in 1826; the progress has since been steady; and the colony may now be regarded as, in the main, a Christian land. It has its Bishop; its eleven native clergy; its central educational institutions; its primary schools, maintained entirely by indigenous contributions.\n\nMoreover, a reverse process to that which originally accumulated so many fragments of various tribes into one place has now commenced. These liberated Africans are returning to their own native countries—returning, not as they came, but evangelized, civilized, with Missionary ardour and energy, to spread the Gospel in their own native languages many hundred miles away from the British colony. We have no difficulty in now explaining the providential dealings, once so dark, which frustrated the earlier Missions to West Africa, and concentrated them on Sierra Leone.\n\nThese triumphs have not been won without sacrifice. The cultivation of lands, formerly overspread with jungle, has made the locality less fatal than in bygone days to European life; but in the course of the first twenty years of the Mission no fewer than fifty-three Missionaries or Missionaries' wives died at their post. To give but one specific illustration of what has been just stated—in 1823, out of five Missionaries who went out, four died within six months; yet, two years afterwards, six more presented themselves. Two fell within four months of their landing in Africa. The next year three more went forth, two of whom died within six months; and there never has been wanting, up to this very day, a constant supply of willing labourers, to the full extent of the Society's ability to maintain them. Such facts amply refute the slander often\nthrown out against the Christian heroism of Protestant Missions. When we know that they went in faith to do Christ's work to which He called them, aware of the early death that probably awaited them, what other title can we find for them than that of Christ's martyrs?\n\nIn 1840, a branch Mission was commenced in the Timneh country, due east of the colony.\n\nThe little Banana Islands, lying off the southern promontory of the peninsula, now the scene of a flourishing Christian Church, was the place where John Newton, in 1746, entered the service of a slave-trader, and suffered bitter hardships from the severity of the climate and the cruelty of his master's negro mistress. His future career, sketched in his epitaph, written by himself, may be read on the walls of St. Mary's Woolnoth Church, of which he was so many years the Rector—\"John Newton, once an infidel and libertine, a servant of slaves in Africa, was, by the rich mercy of our Lord and Saviour Jesus Christ, preserved, restored, pardoned, and appointed to preach the faith he had long laboured to destroy.\"\n\nHe was one of the founders of the Society, and witnessed, before his death in 1807, the commencement of the West-Africa Mission.\n\n|                  | 1816 | 1829 | 1838 | 1848 | 1858 |\n|------------------|------|------|------|------|------|\n| European Missionaries | 7    | 7    | 7    | 15   | 12   |\n| Native Clergy     |      |      |      | 3    | 10   |\n| Native Agents     | 5    | 9    | 24   | 62   | 67   |\n| Total Labourers   | 17   | 21   | 40   | 84   | 90   |\n| Communicants      | 580  | 1075 | 2018 | 3637 |      |\n| Schools           | 13   | 721  | 22   | 43   | 57   |\n| Scholars          | 1576 | 1104 | 5098 | 5562 | 4499 |\nYORUBA MISSION.\n\nIn 1841, an Expedition, consisting of three steamers of the Royal Navy—the \"Albert,\" Captain H. D. Trotter, the \"Wilberforce,\" Commander William Allen, and the \"Soudan,\" Commander Bird Allen—was sent up the Niger by H. M. Government, with a view to promoting \"the substitution of an innocent and profitable commerce for that traffic by which the continent of Africa has so long been desolated.\" (Parliamentary Papers, No. 57, 1840.) It was accompanied by one of the Society's Missionaries, who had spent ten years in Sierra Leone, the Rev. J. F. Schön, and by Mr. Samuel Crowther, and other native teachers. The Expedition was generally denounced as a failure, for the mortality amongst the Europeans who engaged in it was most disastrous, forty-two white men out of one hundred and fifty having died in sixty-two days. Mr. Schön, however, had thus the opportunity of commencing the study of the Hausa language, which he has since so successfully prosecuted as to have translated portions of the Holy Scriptures into that tongue; and the Christian negroes returned to Sierra Leone with the intelligence that the wars which once wasted their country had ceased, and that the way was now open to them to return to their long-lost home.\n\nThe Yoruba tribe, numbering upwards of 2,000,000, situated upon the Bight of Benin, and northwards nearly to the Niger, were the people who had suffered most of all from the Trans-Atlantic slave-trade, and formed, consequently, the most numerous portion of the re-captured negroes at Sierra Leone. The tidings that their mother-country was again accessible to them at once prompted their return. As they had, however, become acquainted, during their sojourn at Sierra Leone, with Christianity, they stipulated that their Christian teachers should return with them. They did so, and, in the year 1845, occupied the chief town of the Yoruba country—Abbeokuta, with its 70,000 inhabitants—from whence the Gospel has radiated to many of the large towns in the surrounding district. This Mission, one of the second generation, derived rather from the Christianized Sierra Leone than from the Christianizing England, has expanded with remarkable rapidity. The converts have endured, in the best spirit of Christian confessors, bitter persecutions from the heathen priests. In 1851, an invasion by the King of Dahomey, the chief supporter of the slave-trade, was signally defeated by the inhabitants. Subsequently, the slave-trading seaport, Lagos, was captured by British cruisers, and is now the scene of a flourishing Mission Station.\n\nLANGUAGE AND CHRISTIAN BOOKS.—Yoruba: Large portions of the Holy Scriptures—the Liturgy—a Primer—Catechisms, &c.\n\nCHRONOLOGICAL STATISTICS.\n\n| Year | Location       |\n|------|----------------|\n| 1845 | Badagry        |\n| 1846 | Abbeokuta (Oshielle) |\n| 1852 | Lagos (Otta)   |\n| 1853 | Ibadan         |\n| 1853 | Ijaye          |\n\n| Year | European Missionaries | Native Clergy | Native Agents | Communicants | Schools | Scholars |\n|------|-----------------------|---------------|---------------|--------------|---------|----------|\n| 1845 | 2                     | 1             | 3             | 122          | 6       | 418      |\n| 1850 | 5                     | 1             | 10            | 536          | 13      | 775      |\n| 1855 | 7                     | 3             | 28            | 827          | 20      | 951      |\n| 1858 | 7                     | 6             | 34            |              |         |          |\n\n[Turn over, Niger Mission.]\nNIGER MISSION.\n\nIn 1854, a second Niger Expedition penetrated successfully 500 miles into the interior, and found the natives everywhere anxious to receive Christian teachers. Another Expedition during the summer of 1857 was projected by Macgregor Laird, Esq., and successfully carried out with the sanction and aid of H. M. Government.\n\nTwo native Clergymen and five native teachers have been thus enabled to establish themselves at various points on the river, and the Niger Mission was thus commenced, with the cordial welcome of the people, at Onitsha, at Gbegbe, near the Confluence, and at the important town of Rabba. The Hausa language, spoken over the great district drained by the Niger, is one of the most important of the African tongues, being the common medium of communication throughout all North-west Africa, eastward as far as Sierra Leone, and northward even to Tripoli. It is written by the natives in the Arabic character. Considerable progress has been made in the translation into Hausa of the New Testament and part of the Pentateuch.\n\nLANGUAGES AND CHRISTIAN BOOKS.—Hausa: a Primer—portions of the Holy Scripture. Isodama-Ibo: a Primer. Many of these works have been prepared by Christian Africans.\nMEDITERRANEAN MISSION.\n\nAs early as the year 1811 the Society's attention was directed to the Levant, and to the possession of Malta by Great Britain as a promising centre for Missionary operations, chiefly through the representation of the late Dr. Buchanan. A grand and attractive scheme was proposed. It was represented, by persons who had the best means of information, that the resources and spirit of the Romish College de Propaganda Fide had been well nigh extinguished by the revolutions on the Continent; that the minds of Roman Catholics were prepared for listening to the pure doctrines of Scripture; that the decayed Churches of the East—the Greek, Armenian, Nestorian, and Coptic—were prepared for a revival; and that through them, once more quickened by Gospel truth, the Mohammedans of Europe, Asia, and Africa might be most effectually evangelized.\n\nA Mission was accordingly commenced at Malta in 1815. Tours were made through Greece, Syria, Asia Minor, Egypt, and Abyssinia, by able and devoted Missionaries, and the results embodied in the publication of several volumes of \"Christian Researches.\" Much interest was awakened at home; and other Societies, especially those in America, were stimulated to enter on the same field of labour. A printing-press at Malta issued a large supply of religious books and tracts in the various vernaculars. Schools were opened in the island of Syra; and Missions commenced at Smyrna, at Cairo, and Abyssinia.\n\nBut the first hopes have not been fulfilled. Rome has revived. From Abyssinia the Missionaries were expelled. And though we are sure that no labour for Christ's sake is thrown away, the results have been, as yet, of an indirect character, and are probably still undeveloped. Nearer acquaintance with the Oriental Churches has demonstrated the tenacity with which they cling to their superstitious opinions and practices, and their repugnance to scriptural light in its purity. One cannot, however, regret that opportunity was given them of instruction in a purer faith.\n\nMalta was relinquished in 1842, and Palestine occupied in 1852. Jerusalem is therefore now the centre of the Mission, where the Secretary resides, possessing the advantage of the ripe experience of Bishop Gobat, so long a Missionary of the Society, and now Bishop of the United Church of England and Ireland in Jerusalem (consec. 1846).\n\nThe effects of the recent war on the Mohammedan mind are still too recent to be accurately estimated; but it is obvious that prejudices have received a severe shock, and Christian books are making their silent way into the most unexpected quarters. Constantinople is now occupied by the Society's learned and experienced Missionary, the Rev. Dr. Pfänder. Prayerful and watchful expectation will be the present attitude of the friends of Turkish, Egyptian, and Arabian Missions.\n\nSyria contains representatives of almost every religious sect to be found in the Levant, besides others not met with beyond its borders.\n\n1. Mohammedans, the lords of the country, and the most numerous; divided into the Sunni, or followers of Omar, dominant in Turkey, Egypt, Syria, and Hindustán; and the Shíá, or followers of Hassan and Hossein, dominant in Persia, and bitterly hostile to the former.\n\nThe Druses (population 100,000), the Ansayií (population 200,000), the Ismaelites, or Assassins, now few in number, and the Metawileh (population 25,000), may be regarded as heretical offshoots of Islamism, though their particular tenets, which they keep a profound secret, are but imperfectly ascertained.\n\n2. Yezidis, or devil-worshippers, the bulk of whom are to be met with in Mesopotamia and Assyria.\n\n3. Jews (population 40,000), subdivided into Talmudists, Karaites, who reject the Talmud, and are found principally in the Crimea; Chasidim, or fanatics, not dissimilar from Mohammedan dervishes; Habadim,\nor Quietists; and Zoharites, so called from their adherence to the Talmudical book, Zohar.\n\nIn connexion with them may be mentioned the Samaritans, between whom, however, and the Jews, the bitterest hostility still exists. They are now dwindled down to 150 or 200 souls at Nablous (the ancient Sychar).\n\n4. The Christian sects of Syria and the adjoining countries—\n\n(1.) The Greek Church—called by themselves \"The Catholic and Apostolic Oriental Church\"—with the four Patriarchates for Turkey in Asia, having their seats at Constantinople, Alexandria, Antioch, and Jerusalem. The two latter are virtually, though not nominally, subordinate to the Patriarch of Constantinople, and have each under their jurisdiction eight bishoprics.\n\n(2.) The Greek-Catholic Church (population 40,000), was formed by a secession from the Greek Church about 120 years ago. Their liturgical language is Arabic; they receive the Lord's Supper in both kinds; their priests are allowed to marry; they keep Easter after the Oriental tradition; but they acknowledge the Pope's Supremacy, and follow several Romish customs. The Patriarch resides at Damascus, and their ecclesiastical dignitaries are usually Arabs by birth, educated at Rome.\n\n(3.) The Maronite Church (name derived from their first Bishop, who flourished in the seventh century) embraces about 200,000 souls, the descendants of the ancient Syrians. Their ecclesiastical language is Syriac, an unknown tongue to the generality. Their Patriarch resides on Mount Lebanon. They are bigoted and fanatical Romanists, with, however, certain usages of their own, most of their priests being married.\n\n(4.) The Latins are native Roman Catholics of the European Church, but few in number, under the supervision of the convents.\n\n(5.) The Syrian or Jacobite Church consists of but few members. Their Patriarch resides near Mardin in Mesopotamia.\n\n(6.) The Syrian Catholics, but few in number, bear the same relation to the Syrian Church that Greek Catholics bear to the Greek Church—i.e., they are Papists, retaining the language and certain of the rites of the Church from which they have seceded.\n\n(7.) The Armenians in Syria are few in number, but important from their wealth. They are an ancient Oriental church, and their version of the Scriptures (about A.D. 421) is valuable in determining the Greek and Hebrew texts. They have few holidays, and condemn the worship of images. They are governed by four Patriarchs, of whom the principal resides at Erivan.\n\n(8.) The Armenian-Catholics are a papal offshoot of (7), as (2) is of (1).\n\n(9.) The Copts are the Church of Egypt, numbering about 200,000 souls. They are the descendants of the ancient Egyptians, the Arabic form of the name, Kubt, being apparently connected with Ἀριστος. They practise circumcision.\n\n(10.) The Abyssinians regard themselves as a branch of the Coptic Church, though far outstripping them in absurd legends, superstitions ceremonies, and the worship of saints and angels. They regard Pontius Pilate and his wife as saints. Their worship is in the ancient and to them almost unknown Ethiopic language.\n\nLANGUAGES.—Italian, Modern Greek, Arabic, Maltese, Amharic, and Turkish. The Holy Scriptures and the Book of Common Prayer have been translated into them, besides many other Christian Books.\n\nCHRONOLOGICAL STATISTICS.\n\n| Year | Location |\n|------|----------|\n| 1815 | Malta    |\n| 1826 | Cairo    |\n| 1828 | Syra     |\n| 1829 | Abyssinia|\n| 1830 | Smyrna   |\n| 1851 | Nazareth |\n| 1852 | Nablous |\n| 1853 | Jaffa    |\n| 1856 | Khauffa |\n| 1856 | Akka     |\n| 1858 | Constantinople |\n\nThere are 7 Ordained and 3 Unordained Missionaries; 7 Native Agents; 80 Communicants; and 504 Scholars, in 10 Schools, connected with the Mission.\n\nThe American Episcopal Missionary Society, the American Board for Foreign Missions, the American Baptists, and the London Society for promoting Christianity among the Jews, are also labouring in the same field.\nTalmud-\n\nbetween\n\nThey\n\nancient\n\nin Asia,\n\nJerusalem.\n\nPatri-\n\nbishoprics.\n\nby a\n\nlanguage\n\ntheir priests\n\nbut they\n\ncustoms.\n\nare\n\nwho\n\ndescen-\n\nan un-\n\nLebanon.\n\npassages of\n\nChurch, but\n\nTheir\n\nrelation\n\nChurch—i.e.\n\nChurch\n\nfrom their\n\nthe Scrip-\n\nnew texts.\n\nthey are\n\nof (1).\n\nsouls.\n\nof the\n\ncirc-\n\nChurch,\n\nand\n\nhis wife\n\nunknown\n\nGreek, and\n\nhave\n\nLatinople.\n\nAgents;\n\nwith the\n\nfor\n\nfor pro-\n\nfield.\nThe name of India has had a charm for Europeans since the time that Alexander the Great invaded the Panjab; and ever since the discovery of the passage of the Cape it has been found, practically, that every nation which has successively held commercial relations with it, or possessed any footing in its territories, has found them the fruitful sources of opulence and power. Just one hundred years ago, the British authority there, confined to three small forts on the east coast, was struggling for very existence. It was on June 23, 1757, that Robert Clive fought the battle of Plassey, his whole force consisting of 3000 men, not a third of whom were English. The European troops now in India exceed 41,000, and the H. E. I. C. native army reckons 217,000 bayonets. The area of British India is nearly 1,500,000 square miles, and its population 180,000,000. This empire is the growth of a century, and its expansion has continued, in spite of the reluctance of the Government of late years to extend its dominion, till it has absorbed Peshawar on the west, and Pegu on the east.\n\nIndia is inhabited by many different races, with no common tie but the same religion—Brahminism. Its population speak twenty different languages (besides the dialects of the Aborigines of the hills), most of them written in separate alphabets of very diversified structure. The Sanskrit Vedas are the oldest uninspired books in the world.\n\nThere are nearly 500 Christian Missionaries labouring amongst this great assemblage of nations, 115 of them connected with the Church Missionary Society; and the result of their united efforts for forty-five years has, under the Divine blessing, been the conversion of upwards of 110,000 idolaters, (besides 16,000 more in Ceylon,) who have abandoned heathenism, and are affiliated to various Christian Churches, in addition to many who have departed in the faith and fear of Christ.\n\nIt would be unjust and ungrateful not to mention the changed attitude of the H. E. I. C. Government, collectively and individually, towards Christian Missions. The experience of forty years has well nigh disarmed the suspicious fears of earlier days. India is indebted to the Government for many legislative acts which have emancipated her children from some of their cruellest superstitions, though much still remains for philanthropic rulers to do; grants-in-aid are freely made to Missionary schools; and very many eminent members of the civil and military services render every countenance possible, in their private capacities, to Missionary operations. (1857.)\n\nWith the exception of the correction of two or three numerical statements in the third paragraph, so as to accord with the present facts of the case, the preceding passage has been left as it stood in the first edition of the Atlas, issued in May 1857. In that very month burst forth the military rebellion, which has turned all eyes to India. It is needless to recapitulate the details and it is impossible to forecast the full consequences of the earthquake, with the last throes of which the land is yet quivering. But some results are already palpable. The Hand of God, both in the permission of the mutinies, and in their suppression, is traced the most clearly by those who have studied its phases most closely. One can hardly help noticing, e.g. how the great native army of high-caste Hindús and fanatical Mohammedans almost constrained the Government to deal partially with their superstitions, and, under the apprehension of their becoming disloyal and disaffected, to impose practical\ndisabilities on the profession of Christianity. By their own act that army has been annihilated, and the Government is now free to pursue a Christian policy towards India without fear. And it is plain, too, that a more Christian policy must be henceforward pursued. He who has so signally preserved our empire must no longer be dishonoured by those who profess to worship Him. The voice of God demands this. The Christian public of Great Britain will never rest till it is secured. And those who have had the most practical experience in the government of India concur in its plain and paramount duty.\n\nIt has been declared by one of the ablest Indian statesmen (Sir J. Lawrence) that he \"has been led, in common with others, since the occurrence of the awful events of 1857, to ponder deeply on what may be the faults and shortcomings of the British as a Christian nation in India.\" Grants-in-aid were freely made to Missionary schools even before the mutinies, as stated above. To contend for them now would be to contend for what has been already conceded, and it is not to be believed that any possible British Government would either desire or dare to advocate a retrograde policy in this matter. The lessons of the rebellion call us plainly to go forward. The one simple symbol of a Christian policy for India is the removal of the ban which now hinders the Bible from being read in the Government schools by those who desire it. Sound policy dictates this measure; for thus alone can the people's gross ignorance as to the nature of Christianity be dissipated, and the recurrence of such groundless fears as gave rise to the mutinies be met and obviated. Justice to the natives demands it; for they have a right to be made acquainted with the moral code of right and wrong on which their rulers cannot help basing their administration. Compassion to heathen souls pleads for it; for the Gospel, embraced with the heart, is the one true source of happiness either for this world or the next. The honour of God imperatively claims it; for how can we bend the knee in public national thanksgiving to Him for the successes with which He has blessed our arms, and yet, at the same time, perpetuate an indignity to the Book which He gave us, to which we never subjected the heathen Shasters or the Mohammedan Korán?\n\nThe general Map of India is coloured so as to indicate the chief centres of Indian Missions, and the districts specially reached by them. For further information as to the number of Missionaries, &c., the reader is referred to the Table immediately following.\n\nThe subsequent Map, with the Table facing it, furnishes general information respecting the languages of British India and its Dependencies. It need only be added here, that North India generally is peopled by the Caucasian race, and Peninsular India chiefly by the Mongolian. Further details on this subject may be found in the Church Missionary Intelligencer for January 1859.\nthat army\na Chris-\nat a more\nhas so\nby those.\nThe\nAnd\nment of\n\n(Sir J.\nthe occur-\nmay be the\nIndia.\"\nbefore the\nto contend\nthat any\nadvocate a\ncall us\npolicy for\nbeing\npolicy\ntolerance as\nof such\nJustice\nacquainted\npleads\nsource of\nimpera-\nnational\nour arms,\nwhich He\nthe Mo-\n\ncentres\nthem. For\nreader is\n\ngeneral in-\ndependencies.\nby the\nFurther\n### Languages of British India and its Dependencies\n\n| Name of Language | Area in Square Miles | Population | Alphabets | Indigenous Literature | Date of commencement of Missionary operations | Number of Missionaries | Propportion of Ministers to Native Protestant Christians | Christian Literature | Remarks |\n|------------------|---------------------|------------|-----------|----------------------|-----------------------------------------------|-----------------------|-------------------------------------------------|---------------------|---------|\n| 15. Gujarathi    | 50,039              | 4,838,886  | Derived from Sanskrit | Popular Tales | 1813                                           | 7                     | 691,000                                         | Ditto (Katchi)       |         |\n| 16. Mahrathi     | 113,532             | 14,306,362 | Ditto     | Poetry, Tales, Grammar, &c. | 1813                                           | 34 (C.M.S. 13)        | 420,000                                         | Bible, translations, tracts, &c. | Mahrathi, Court language of the Guicowar (Baroda), and other Native States. Gujarathi, the vernacular of Persia, and language of commerce. |\n| 17. Pushtú       | * 7,588             | * 847,695  | Modification of Arabic | Copious in prose and poetry, chiefly history. | 1825 § (C.M.S. 2)      | 2                     | 421,000                                         | Portion of the Scriptures, tracts, &c. | The Bible, Pr.B., and many other works. |\n| 18. Hindustani   | Nowhere localized in Indus, except in the valley of the Upper Ganges and the Mussulman quarters of the large towns. | | | | | | | Ditto. |\n| 19. Persian      | A Government language employed by the Mogul formerly, and still by several Native Courts. | | Arabic slightly modified. | An extensive native literature. | | | | |\n| Total            | 1,396,033           | 181,164,914 | | | | | | | |\n| 20. Burmese     | * 95,243            | * 1,428,331 | Burmese, derived from Arabic. | Considerable. | | 23 | | The Bible, and other translations. Allied to the monosyllabic tongues. | Ditto. |\n| 21. Bhotani      | 19,000              | 560,000    | Little known, probably uncultivated. Independent State. | | | | | |\n\n* British Possessions only included. † Including 80 or 90 Native and Country-born Ministers.\n### Languages of British India and its Dependencies\n\n#### With their Geographical Extension, Population, &c.\n\n| Name of Language | Area in Square Miles | Population | Alphabets | Indigenous Literature | Christian Literature | Remarks |\n|------------------|----------------------|------------|-----------|----------------------|---------------------|---------|\n| 1. Sinhalese     | 12,278               | 1,170,369  | (1) Sinhalese. | Copious. Poetry, Proverbs, Grammar, Ethics, &c., chiefly Tamil. | 11,373 Bible, Book of Data for affiliation of Sinhalese. Common Prayer; not yet complete. Various translations; Total native population of Ceylon (1850), 1,100,948, of which the Tamils included under (2), amount to 538,359. Total superficial area in square miles, 24,770. | |\n| 2. Tamil         | 67,239               | 11,837,428 | Tamil. | Limited in original works; translations from Sanskrit. | 79,633 Bible, Pr.-E. hymns, First Indian language employed in Protestant Missions. Bible translated A.D. 1727. | |\n| 3. Telugu       | 99,905               | 13,020,961 | Telugu. | Limited in original works; translations from Sanskrit. | 3664 Bible, portion of Pr.-E. tracts, translations, &c. | |\n| 4. Malayalam    | 11,280               | 2,851,903  | Malayalam. | Limited in original works; translations from Sanskrit. | 8058 Bible, Pr.-E. tracts, Scriptures and Liturgies of the ancient Syrian Church at Travancore, a cultivated South-Indian tongue; translation now commenced; spoken probably by 150,000. | |\n| 5. Canarese     | 54,173               | 6,259,420  | Canarese or modification of Telugu. | Limited in original works; translations from Sanskrit. | 2612 Bible, Pr.-E. tracts, translations, &c. | |\n| 6. Gondi, Bhojpuri, &c. | 121,873             | 8,801,839  | Uncivilized Hill-Tribes; languages totally illiterate, possibly Mahayana. | A few original works. Translations from Sanskrit. | 1,470,000 (K.G.M.) | |\n| 7. Hindi        | 399,831              | 67,121,682 | Sanskrit (or Deva-ranjan), almost entirely illiterate, Possibly Viharayan. | Modern. Very contemporary translations, Pamphlets, Newspapers, &c. | 1,480,000 | |\n| 8. Bengali      | 89,452               | 261,000,990| Bengali. | Corrupted from Sanskrit. | Ditto. | |\n| 9. Oriya       | 65,759               | 5,058,895  | Oriya. | None. | 906 Bible, translations, tracts, &c. | |\n| 10. Assamese    | 38,275               | 890,690    | Assamese. | None. | 119 Part of Scriptures. | |\n| 11. Nepali      | 54,000               | 1,940,000  | Nepali. | None. | 480,000 | |\n| 12. Kashmiri    | 60,000               | 3,000,000  | Kashmiri. | None. | 38,000 | |\n\nThere are forty Bengali printing-presses in Calcutta.\n\nIndian family of languages, as the Urdu, Rajmahal, &c.\n\nThere are forty Bengali printing-presses in Calcutta.\n\nA fusion of frontier tribes. The Tezpur Mission receives pecuniary aid from the Church Missionary Society.\n\nCourt languages: Persian. Population: chiefly Mohammedans.\n| Language       | Population | Notes                                                                 |\n|----------------|------------|----------------------------------------------------------------------|\n| Bengali        | 89,452     | Modern. Very copious Newspapers, Pamphlets, &c.                      |\n| Oriya          | 65,759     | Corrupted from Sanskrit.                                              |\n| Assamese       | 38,275     | A corrupt Bengali, which has superseded the Aboriginal Ahom and Siamese. |\n| Nepali (or Gurkha) | 54,300   | Hindi                                                                  |\n| Kashmiri       | 60,000     | A Sanskritical Alphabet.                                              |\n| Punjabi (or Sindi) | 10,692,403 | Gurmukhi                                                              |\n| Sindhi         | 90,857     | Two Alphabets derived from the Sanskrit and Arabic respectively.      |\n| Mithani, Kurichi | 90,039    | Derived from Skrit.                                                   |\n| Gujarathi      | 113,332    | Derived from Skrit.                                                   |\n| Mahraathi      | * 7,388    | Modification of Arabic.                                               |\n| Pahari (or Afghan) | 817,685   | Nowhere localized in India, except the valley of the Upper Ganges and the Mussoorie quar ters of the large towns. |\n| Hindustani     | 1,396,033  | Government by Mogul formerly, and still by several Native Courts.     |\n| Persian        | Total      | 181,164,914                                                          |\n| Burmese        | 95,243     | Little known, probably uncultivated. Independent State.              |\n| Bhotani        | 19,000     | British Possessions only included.                                    |\n\nThere are forty Bengali printing-presses in Calcutta.\n\nA fusion of frontier tribes. The Terapore Mission receives pecuniary aid from the Church Missionary Society.\n\nCourt language, Persian. Popul ation chiefly Muhammadan.\n\nMarwari, probably more closely connected with Sindhi than Hindi, and almost of sufficient importance to rank as a distinct language.\n\nMaharathi, Court language of the Gujover (Baroda), and other Native States. Also vernacular of Travels, and language of commerce.\n\nThe Bible, Prayers, &c., translated into many other languages.\n\nThe Bible, and Allied to the moneylible tongues, other translations.\n\n† Including 80 or 90 Native and Country-born Ministers.\nNORTH-INDIA MISSION.\n\nIt was not till the revision of the East-India Company's Charter in 1813, that Christian Missionaries to the heathen were permitted to reside in any part of British India. This privilege, and also the Indian Episcopate, were very mainly won by the efforts of the Church Missionary Society. Evangelistic operations had been previously carried forward by the Missionary-hearted Chaplains of a generation now past—David Brown, Thomason, Corrie, Martyn, Buchanan, Marmaduke Thompson, Hough, and others—names ever dear to those who love the souls of their fellow-men.\n\nThe Society's Stations have gradually ascended the great valley of the Ganges, with its swarming population of 120,000,000, till they have now reached the very frontier-post of the North-west Provinces—Peshawar. The utter inadequacy, however, of the Missionary force to the vast work of diffusing the Gospel through the world is nowhere more painfully apparent than in this Mission. At least one hundred more evangelists might easily be employed there, and find ready audiences. The Society's earliest labours were at Agra (1813), where Abdul Messeeh, Henry Martyn's convert, afterwards ordained by Bishop Heber, was directed and assisted by Corrie. In 1838, a remarkable movement took place at Kishnagar, where 600 families put themselves under instruction. Though their subsequent progress has not been what was at first anticipated, they are forming, it is hoped, the nucleus of a Christian Church, whence the Gospel may radiate over the country districts of Bengal.\n\nThe great Mutiny of 1857 swept over many of the districts occupied by the Society, utterly destroying much valuable property at several of the Stations; but the lives of the Missionaries were mercifully preserved. Important changes may, in consequence, be made; but further time is necessary to mature them. Meanwhile the prospects of Missionary work are most hopeful: obstacles to the progress of the Gospel have been removed in a way that no human foresight could have anticipated; Native Christians have obtained a status in the eyes of both the European and Native community, which they never before enjoyed; three Native Catechists have received Holy Orders (January 25, 1859); a Mission has been commenced at Lucknow, so recently the focus of rebellion, under circumstances of peculiar encouragement; in England, the fund for Indian Missions has reached nearly £50,000; and the Society have taken steps to strengthen, by additional labourers, their existing centres of operations. \"Surely the wrath of man shall praise Thee; and the remainder of wrath shalt Thou restrain.\"\n\nCalcutta itself, a hundred years ago little more than a village and a fort, is now a vast metropolis, and a mighty centre of intellectual activity. The English language and literature have been now for many years made accessible, through the Government and Missionary Colleges, to many thousands of the acute native youth; and various social changes, striking at the very root of the whole system of Hinduism, have been going forward with wonderful rapidity. It is already becoming obvious that recent events will add powerfully to this movement. The late Bishop of Calcutta (D. Wilson), who had already done so much for the cause of Missions, transferred to the Society, shortly before his death, the greater part of a fund which he had designed for a Cathedral Mission, but was unable to carry forward. The annual interest will support three Missionaries, who will be devoted especially to the class just mentioned: two such are now labouring in Calcutta.\n\nLANGUAGES.—Hindustani, Bengali, Hindi, Nepali or Gurkha, Panjabi, or Sikh, Kashmirian, Pushtu, Persian.\n## CHRONOLOGICAL STATISTICS.\n\n| Year | Location       |\n|------|----------------|\n| 1813 | Agra           |\n| 1815 | Mirat          |\n| 1816 | Calcutta       |\n| 1817 | Burdwan        |\n| 1817 | Benares        |\n| 1823 | Goruckpur     |\n| 1831 | Kishnagar      |\n| 1831 | Jaunpur        |\n| 1844 | Himalaya       |\n| 1850 | Bhagulpur      |\n| 1852 | Panjab         |\n| 1854 | Jubbulpur      |\n| 1855 | Peshawar       |\n| 1856 | Multan         |\n| 1856 | Santhals       |\n| 1858 | Lucknow        |\n| 1859 | Allahabad      |\n\n| Year | European Missionaries | Native Clergy | Native Agents | Total of Labourers | Communicants | Schools | Scholars |\n|------|-----------------------|---------------|---------------|--------------------|--------------|---------|----------|\n| 1816 | 4                     | ...           | 4             | 8                  | 120         | 110    | 4689     |\n| 1826 | 8                     | 3             | 120           | 142                | 12          | 54     | 4520     |\n| 1836 | 13                    | 2             | 41            | 62                 | 814         | 59     | 3513     |\n| 184   | 25                    | 1             | 118           | 149                | 1119        | 119    | 7027     |\n| 1856  | 44                    | 1             | 370           | ...                | ...         | ...    | ...      |\n| 1858  | 49                    | 3             | 420           | 482                | ...         | ...    | ...      |\n\n* No returns.\nSINDH AND THE PANJAB.\n\nThe frontier Missions of the Church Missionary Society, on the North-west boundaries of the British Empire in India, are of sufficient importance to demand a separate notice. Watered by the great river Indus, inhabited by vigorous and energetic races, far different from the enervated population of the hot plains of India, and, above all, abutting as they do on the countries which are the religious and political stronghold of Mohammedanism, we can hardly gauge the importance of Christian Missions in Sindh, the Panjab, and Peshawar.\n\nOne peculiar feature, also, of this cluster of Missions is, that they were contemplated as soon as these countries came into British possession, and carried into operation as soon as the necessary arrangements could be made. A few years elapsed, indeed, before the actual commencement of Missionary work in Sindh; but in the other two districts—the scene of so many fierce and sanguinary conflicts—the foundation of a Christian Mission followed almost immediately on their peaceful submission to the British raj. On his first visit to the Panjab, the late venerable Bishop of Calcutta spread out his hands toward that country, as he was sailing down the Indus, with the words—\"I take possession of the Panjab in the name of the Lord Jesus Christ.\" A Mission was commenced at Amritsar, the native centre of the Sikh race, in 1852, under circumstances of much encouragement, and one native has already received holy orders. From the first establishment of this Mission, the British administrators of the Panjab—the late Sir Henry Lawrence and his gallant and efficient staff of subordinates—have encouraged and supported it with the whole weight of their influence.\n\nIn 1855, a Station more interesting still, to which funds amounting to several thousand pounds sterling were contributed by British residents on the spot, was initiated at Peshawar, a town of 60,000 inhabitants, on the western bank of the Indus, amid its Afghan inhabitants. This outpost, amongst a people severed altogether from the races of Hindustan, both by blood and creed, is the first aggression which has been made from the east on the regions most devoted to the False Prophet. Persia, Bokhara, and Afghanistan are the home of Islam, politically as well as religiously; and as Peshawar is much celebrated for its schools of Mohammedan learning, and also as a commercial centre, those who resort thither from all parts are brought into direct contact with Christianity. Many Christian books in Persian, the French of Asia, have already penetrated into these countries, and inquirers have left their native lands to come to Peshawar, where they have been baptized.\n\nOne circumstance connected with the establishment of this Mission is too remarkable not to be recorded here. It is fresh in every memory that the tranquillity which was preserved on the North-west Frontier Districts during the mutinies permitted the withdrawal thence of the troops that garrisoned them. These troops were thus safely transferred to the army before Delhi, and contributed mainly to the successful result of the siege—the great blow that checked the rebellion and preserved India to the crown of England. In taking the chair at a Public Meeting at Peshawar, held on Dec. 19, 1853, to promote the commencement of the Mission there, the Chief Commissioner Col. Herbert Edwardes (the hero of Multan) used these remarkable words—\n\n\"The plans and purposes of the Almighty look through time into eternity. And we may rest assured that the East has been given to our country for a Mission, neither to the minds nor bodies, but to the souls of men.\n\n\"It is not the duty of the Government, as a Government, to proselytize...\"\nIndia. . . . The duty of evangelizing India lies at the door of private Christians; the appeal is to private consciences, private effort, private zeal, and private example. Every Englishman and Englishwoman in India, every one now in this room, is answerable to do what he can towards fulfilling it.\n\n\"It is of course incumbent on us to be prudent; to lay stress upon the selection of discreet men for Missionaries; to begin quietly with schools, and wait the proper time for preaching. But having done that, I should fear nothing. In this crowded city we may hear the Brahmin in his temple sound his shankh and gong—the Muezzin on his lofty minaret fill the air with the azān, and the Civil Government, which protects them both, will take upon itself the duty of protecting the Christian Missionary, who goes forth to preach the Gospel. Above all, we may be quite sure that we are much safer if we do our duty than if we neglect it; and that He who has brought us here, with His own right arm, will shield and bless us, if, in simple reliance upon Him, we try to do His will.\"\n\nFour years subsequently, in the midst of the mutinies, he was able to write as follows—\n\n\"It is of no use to talk of wise or vigorous measures, though in General Cotton we have had the best of commanders. But Providence, God's mercy, has alone kept this frontier in the wonderful state of peace that it has enjoyed since this mutiny invited the very worms to come out of the earth. I assure you I never thought we could have got through this summer without a bloody conflict. Often and often we have been on the verge of it; but is it not a perfect miracle, that while all the Bengal Presidency is convulsed, Peshawar has had less crime than ever was known. I have no sort of doubt that we have been honoured, because we honoured God in establishing the Mission?\"\n\nCol. Edwardes is one of the most earnest advocates for a Christian policy on the part of the Indian Government. Who will say that he has not good ground for his opinion?\n\nLANGUAGES.—Persian, Hindustání, Pushtu (or Afghani), Punjabi, (Sikh or Gurmukhi), and Sindhi with its dialects, Multani, and Katchi.\n\nThe Society's Missionary, the Rev. Dr. Trumpp, is engaged in most important linguistic labours in connexion with the chief frontier tongues, especially in the grammatical analysis of the Sindhi, which he is for the first time reducing to writing, and of which he is compiling a Dictionary.\n\nCHRONOLOGICAL STATISTICS OF THE FRONTIER MISSIONS.\n\n| Year | Location |\n|------|----------|\n| 1850 | Karachi   |\n| 1856 | Hyderabad |\n| 1852 | Amritsar |\n| 1855 | Peshawar |\n| 1856 | Multan   |\n\n| Year | European Missionaries | Native Clergy | Native Agents | Total of Labourers | Communicants | Schools | Scholars |\n|------|-----------------------|--------------|--------------|-------------------|-------------|--------|---------|\n| 1850 | 1                     | 2            | 6            | 18                | 24          | 4      | 86      |\n| 1855 | 8                     | 2            | 16           | 29                | 31          | 6      | 449     |\n| 1858 | 9                     |              |              |                   |             |        |         |\n\nThe American Presbyterian Mission is also labouring at Lahore.\nThe original manuscript was written in Sanskrit script, which is quite different from the Roman script used in modern Indian languages. The manuscript contains a series of prayers and hymns, which are believed to be of great spiritual significance.\n\nThe manuscript is divided into several sections, each containing a different prayer or hymn. The prayers are written in a flowing script, with each word carefully written out. The hymns are more ornate, with elaborate decorations and flourishes.\n\nThe manuscript is believed to have been written by a monk who lived in a monastery in India. The monk was known for his devotion to the Hindu faith and his dedication to writing prayers and hymns.\n\nThe manuscript is now housed in a museum in India, where it is displayed for the public to see. It is an important piece of religious history, and is valued highly by scholars and religious leaders alike.\nWESTERN-INDIA MISSION.\n\nThe Society's Mission to Western India, of which Bombay is the Presidency, was commenced in 1820. Its chief branch upon the island, where is situated the town of Bombay, is the Robert-Money School, an Educational Establishment of a superior order, founded in 1840, in commemoration of an eminent civilian of that name,* and in which a large number of native youths—many of them now occupying posts under Government—have received Christian instruction. Several are employed as Native Teachers amongst their countrymen, and four have been admitted to Holy Orders.\n\nThe population of Bombay is of a very mixed description. It is the resort, owing to its proximity, of traders from Persia and the whole of Western Asia; and many copies of the Holy Scriptures, and other Christian books, have thus found their way into countries as yet closed against the living evangelist, and evidences have been from time to time afforded that a leavening process is thus going forward, and that the good seed thus sown has not been in vain. It is, however, still the sowing time in the Bombay Mission. After the battle of Miani, February 17, 1843, the province of Sindh—90,000 square miles; population 1,870,000—was annexed to the Indian empire; but it was not till 1850 that Missions could be commenced therein, by the occupation of Karachi at the mouth of the Indus.\n\nThe Bombay Presidency contains an area of 253,000 square miles, and a population—including the people of Sindh, Cutch, Gujerat, and Kattiwar—of 22,480,000 souls. The prevailing religion is Brahminism, as in other parts of India; but Mohammedans, Jews, Buddhists, Jains, Lingaites, and Parsis are mingled with them. These last, an enterprising and mercantile race, of which individuals are to be found throughout the East, are sometimes named fire-worshippers, their prophet being Zerdusht, or Zoroaster, their sacred book the Zendavesta, their sacred language the Zend—the archaic sister-tongue of the Sanskrit, through which the Sanskritic affinities, both of the Persian and the German, are chiefly to be traced.\n\nLanguages.—Hindustani, Gujerati, Mahráthi, Sindhi, with its dialect, Katchi, into most of which have been translated either the whole or part of the Scriptures, portions of the Liturgy, and many Christian tracts.\n\n*Attention is directed to a Memoir of the Robert-Money School by the Rev. A. H. Frost, Missionary of the Society, published in the Church Missionary Record for February 1869.\n\n[Turn over.]\nCHRONOLOGICAL STATISTICS.\n\n1820 ........................................... Bombay.\n1833 ........................................... Nasik.\n1840 ........................................... Robert-Money School.\n1848 ........................................... Malligam.\n1850 ........................................... Karachf.\n1856 ........................................... Hydrabad.\n1856 ........................................... Shikarpur.\n\n| Year | European Missionaries | Native Clergy | Native Agents | Communicants | Schools | Scholars |\n|------|-----------------------|--------------|--------------|-------------|---------|----------|\n| 1820 | 1                     |              |              |             |         |          |\n| 1830 | 3                     |              |              |             |         |          |\n| 1840 | 6                     |              |              |             |         |          |\n| 1850 | 8                     |              |              |             |         |          |\n| 1858 | 14                    |              |              |             |         |          |\n|      |                       |              |              |             |         |          |\n|      |                       |              |              |             |         |          |\n|      |                       |              |              |             |         |          |\n|      |                       |              |              |             |         |          |\n|      |                       |              |              |             |         |          |\n\n26\nSOUTH-INDIA AND CEYLON.\n\nPeninsular India very nearly coincides with the Madras Presidency, and its included Native States of the Nizam, Travancore, and Cochin. It is interesting as being the earliest point of contact between India and the British power. Some of the first acquisitions of the East-India Company, when it was a trading and not an imperial body, were formed at various points of the Coromandel coast; and the Carnatic, as the southern part of the Dekhan was then popularly called, was the scene of most of the military struggles of the British under Clive, with the French under Dupleix and Lally, which resulted in the expulsion of the latter, and of their victories over the great Mohammedan power of the South, under Hyder Ali and Tippoo Sultan, whose last hold upon the country was broken by the capture of Seringapatam.\n\nBut Peninsular India is more interesting still, in a Missionary point of view. It was the scene both of the first Roman-Catholic and the first Protestant Missions, and at the present day five-sixths of the Native Christians of India are to be found within the borders of the Madras Presidency. We omit in this computation the Native Romanists of South India, for, numerous as are the descendents of the converts of the Jesuit Missions of the sixteenth and seventeenth centuries among the Fisher caste (for they have never been called to abandon caste), their moral degradation and mental ignorance leave them little distinguished from the heathen by whom they are surrounded, and from whom they have never been in fact severed. No impartial mind will refuse to recognise the great qualifications of Francis Xavier. His ardent enthusiasm, his manifest sincerity, his unsparing self-denial, his devout spirit, his alliance on Christ, have drawn for him only eulogies from Protestant writers. But if an illustration is desired of the downward progress of Romanism, however much counteracted by the personal character of its first teachers amongst a nation, that illustration is furnished by Abbé Dubois' history of Romish Missions in South India, and by the actual state at the present day of the Church founded by the great Spaniard.\n\nA king was the \"nursing-father\" of Protestant Missions in South India. Frederic IV. of Denmark sent out, in 1706, Ziegenbalg and Plutscho, the first Protestant Missionaries to India. He took a deep personal interest in their work, found time to correspond with them even in the midst of his life-and-death conflict with Charles XII. of Sweden, and welcomed to his camp before Stralsund a Tamil Christian, one of the first-fruits of their labours. It is to the honour of the Church of England that our own Archbishop Wake lent the weight of his official position and private sympathy to the labours of these brethren. In 1727, the Danish Missions were transferred to the care of the Society for Promoting Christian Knowledge, and amongst their honoured labourers are to be reckoned Fabricius, Schwarz, Gericke, and Kohloff. To them, directly or indirectly, is to be referred the origin of many of the Missions now engaged in the Madras Presidency. The Tables on the following page, prepared by the recent South-India Missionary Conference, exhibit the present aspect of their work. The figures referring to the Church Missionary Society have been corrected by still later returns. The districts occupied by the Society are coloured pink, of which subsequent notices are given at length.\n\nLanguages.—The languages of South India—Tamil, Telugu, Canarese, Malayalin—belong to the Mongolian stock.—See Language Table.\n## SUMMARY OF MISSIONARY SOCIETIES IN SOUTH INDIA AND CEYLON, DECEMBER 31, 1858.\n\n| Societies                          | Number of Stations | Missionaries and Assistant Ministers | Native Pastors and Ministers | Catechists and Readers, &c. | Number of Communicants | Baptized | Unbaptized Atheists and Church Attendants on Public Worship | Total | Boy's Schools | Total Boys in Schools | Girls' Schools | Total Girls in Schools | Training Schools and Seminaries | Total of Scholars and Students in the Schools and Institutions | English Churches and Chapelries | Commencement of Operations |\n|-----------------------------------|--------------------|--------------------------------------|-------------------------------|-----------------------------|--------------------------|----------|---------------------------------------------------------------|------|---------------|------------------------|-----------------|------------------------|--------------------------------|---------------------------------------------------------------|--------------------------------|--------------------------------|\n| Church Mission Society            | 39                 | 40                                   | 17                            | 306                         | 6182                     | 20,304   | 11,338                                                         | 20,642| 541           | 10,147                 | 4915           | 4                      | 256                  | 15,218                                                        | 2                                | 1814                             |\n| London Mission Society            | 18                 | 26                                    | 1                              | 9                           | 3667                     | 20,114   | 15,030                                                         | 24,894| 142           | 3614                   | 52             | 5                      | 2276                 | 4                               | 127                              | 5                                | 1805                             |\n| Society Propagation Gospel F. P.   | 37                 | 56                                    | 1                              | 9                           | 3667                     | 20,114   | 15,030                                                         | 24,894| 142           | 3614                   | 52             | 5                      | 2276                 | 4                               | 127                              | 5                                | 1726                             |\n| Wesleyan Mission Society          | 26                 | 40                                    | 1                              | 9                           | 3667                     | 20,114   | 15,030                                                         | 24,894| 142           | 3614                   | 52             | 5                      | 2276                 | 4                               | 127                              | 5                                | 1814                             |\n| American Board of Commissioners    | 24                 | 18                                    | 6                              | 128                         | 1224                     | 2060     | 5535                                                           | 7145  | 71            | 277                   | 34             | 3                      | 1233                 | 5                               | 127                              | 5                                | 1814                             |\n| Basle Mission Society             | 14                 | 12                                    | 1                              | 62                          | 943                      | 2060     | 266                                                            | 2126  | 71           | 295                   | 76             | 1                      | 259                  | 3                               | 127                              | 5                                | 1824                             |\n| Free Church of Scotland           | 8                  | 7                                     | 3                              | 25                          | 65                       | 65       | 65                                                             | 718   | 1            | 3                     | 259            | 1                      | 32                   | 1                               | 1100                             | 1                                | 1827                             |\n| Leipic Mission Society            | 15                 | 11                                    | 8                              | 57                          | 3229                     | 4767     | 4767                                                           | 809   | 1            | 3                     | 259            | 1                      | 32                   | 1                               | 1100                             | 1                                | 1827                             |\n| American Reformed Prot. Dutch Church | 1              | 3                                     | 4                              | 2                            | 13                       | 13       | 20                                                             | 20    | 1            | 1                     | 30             | 1                      | 30                   | 1                               | 157                              | 1                                | 1851                             |\n| American Baptist Mission          | 1                   | 3                                     | 2                              | 13                          | 441                      | 441      | 441                                                            | 575   | 5            | 126                   | 50             | 1                      | 701                  | 1                               | 1840                             | 1                                | 1840                             |\n| Baptist Mission Society           | 13                 | 2                                     | 8                              | 2                            | 48                       | 48       | 48                                                             | 567   | 16           | 389                   | 411            | 2                      | 800                  | 1                               | 1812                             | 1                                | 1812                             |\n| Established Church of Scotland    | 2                  | 2                                     | 2                              | 2                            | 48                       | 48       | 48                                                             | 567   | 16           | 389                   | 411            | 2                      | 800                  | 1                               | 1844                             | 1                                | 1844                             |\n| American Lutheran Mission         | 3                  | 4                                     | 3                              | 84                          | 457                      | 50       | 50                                                             | 507   | 16           | 278                   | 79             | 1                      | 457                  | 1                               | 1845                             | 1                                | 1845                             |\n\n## SUMMARY OF MISSIONS IN SOUTH INDIA AND CEYLON, DECEMBER 31, 1858.\n\n| Languages or Nations               | Number of Stations | Missionaries and Assistant Ministers | Native Pastors and Ministers | Catechists and Readers, &c. | Number of Communicants | Baptized | Unbaptized Atheists and Church Attendants on Public Worship | Total | Boy's Schools | Total Boys in Schools | Girls' Schools | Total Girls in Schools | Training Schools and Seminaries | Total of Scholars and Students in the Schools and Institutions | English Churches and Chapelries | Commencement of Operations |\n|------------------------------------|--------------------|--------------------------------------|-------------------------------|-----------------------------|------------------------|----------|---------------------------------------------------------------|------|---------------|------------------------|-----------------|------------------------|--------------------------------|---------------------------------------------------------------|--------------------------------|--------------------------------|\n| Telugu                            | 13                 | 25                                   | 1                              | 30                          | 336                     | 2097     | 1568                                                           | 3665 | 38            | 2261                   | 674            | 1                      | 2935                 | 4                               | 1805                             | 4                                | 1805                             |\n| Canarese                          | 17                 | 43                                   | 3                              | 45                          | 901                     | 901      | 901                                                            | 3258 | 11            | 654                   | 524            | 1                      | 2787                 | 4                               | 1810                             | 4                                | 1810                             |\n| Malayalam                         | 102                | 98                                    | 21                             | 567                         | 13,120                  | 76,237   | 19,474                                                         | 7370 | 12           | 421                   | 3378           | 7                      | 27,265               | 7                               | 1706                             | 7                                | 1706                             |\n| Tamil, { S. India                 | 18                 | 17                                    | 2                              | 44                          | 963                     | 4063     | 76                                                              | 2782 | 76           | 506                   | 2160           | 1                      | 7123                 | 6                               | 1812                             | 6                                | 1812                             |\n| Tamil, { Ceylon                   | 40                 | 36                                    | 11                             | 47                          | 2717                    | 11,373   | 133                                                            | 4942 | 75           | 2160                  | 1131           | 1                      | 2937                 | 6                               | 1812                             | 6                                | 1812                             |\n| Total                             | 205                | 239                                   | 44                            | 838                        | 20,179                  | 107,001   | 36,335                                                         | 12,190| 15           | 515                   | 49,040         | 24                    | 2937                 | 24                              | 1812                             | 24                               | 1812                             |\n| Total, Jan. 1, 1852                | 176                | 239                                   | 503                           | 13,943                      | 94,637                  | 40,918   | 11,059                                                         | 51,977| 31           |                      |                | 31                    | 2937                 | 31                              | 1812                             | 31                               | 1812                             |\n| Increase                          | 29                 | 44                                    | 335                           | 6236                       | 12,364                  | Decrease 4583 | 1131                                                          | Decrease 2937 | 31           |                      |                | 31                    | 2937                 | 31                              | 1812                             | 31                               | 1812                             |\nMADRAS MISSION.\n\nGreat metropolitan cities, such as Constantinople, Shanghai, Hangchow, or the Presidency towns of India, must be regarded as neutral ground for the simultaneous occupation of any number of Missionary Societies, who will find in such central positions convenient head-quarters, or a suitable base of operations on the outlying country all around. Such is the case with Madras. No less than eight Missionary Societies—English, Scotch, American, German—have from time to time planted their representatives within its walls. The Church Missionary Society has not, as a general rule, concentrated its strength on the great towns of India. Other Missionary bodies are much more distinguished for the noble Anglo-Vernacular Institutions which form so prominent a feature in the cities of British India. This Society has been guided by the hand of Providence to rural districts less permeated by European influences. Nevertheless, the Society's work in Madras is neither insignificant nor unproductive, though no Mission has suffered more from a lack of labourers.\n\nMadras, with its suburbs, spreads over an area of eight miles square, and contains an estimated population of 700,000 inhabitants, many of whom converse fluently in at least three native languages, Tamil, Telugu, and Hindustani, understanding something of English besides. The English first obtained a piece of ground for a factory there in 1639. A bare open coast, with a heavy rolling surf, peculiarly dangerous, does not appear a promising locality for successful commercial enterprise; but on this site arose Fort St. George, so famous in the wars of Clive, overlooking one of the most important mercantile operations in the world. Northward lies the native city, Black-Town, surrounded by a strong wall, built to repel the invasions of the Mahratta Horse. It contains (as will be seen by the Plan) many Christian centres of light (coloured yellow), connected with various Missionary Societies. Here, too, we find the Armenian Churches and Romish convents, the mosque of the Moormen, the descendants of Arabian merchants and mercenaries, and many heathen temples, fortresses of superstition and Satan.\n\nThe Mission House and Secretary's Office are situated in one of the leading thoroughfares, the Church Mission Chapel, in which there are three Tamil and three English Services every week, standing in the same compound. A Church Missionary Association, connected with the English Congregation, which furnishes ministerial duty on Sundays to the Clerical Secretary, raises upwards of 100l. per annum, independently of many large subscriptions from Government servants. On the opposite side of the road is the Central Girls' Day-school, an institution which has been much blessed. A second Chapel—Trinity, or John Pereira's, (so called from the name of the previous owner of the land on which it is built,) lies at the S.W. angle of the wall. To the north is the important suburb of Royapuram, embracing what is designated the Tinnevelly Settlement, from the circumstance that, some years ago, many emigrants from that district had planted themselves there, though their numbers are now much decreased. This locality is also occupied by the Society, where it maintains a Native English School, used also as a Chapel and Preaching House, and also a Native Girls'-school, admitting both boarders and day scholars. Preaching is also systematically carried on, with many tokens of encouragement, amongst the horse-keepers at two large stables on the Mount Road, the boatmen and fishermen on the South Beach, and to the Coolies assembling at the Emigrant Dépot to embark for the Mauritius.\nTo the South lies the Mohammedan quarter, Triplicane, (population about 50,000) in the immediate vicinity of the Chepauk palace, the residence of the late Nabob of the Carnatic, who has recently died without an heir. In 1856, a Mission to the Mohammedans was commenced by the establishment of a school, erected through a legacy bequeathed by the Honourable Sybella Harris, daughter of the hero of Seringapatam, assisted by a Grant-in-aid from the Government of 700l.\n\nThe Society now expends 25,000l. per annum on its Missions in South India, and receives most valuable assistance in the disbursement of these Funds, in this, as in the other Presidencies of India, from a Corresponding Committee, composed of several of the leading Civilians, Military Officers, Chaplains, and Merchants, the Bishop being Chairman. Their local knowledge, personal experience of the work, and thorough identification with the principles of the Society, inspire great confidence in their measures and suggestions.\n\n**CHRONOLOGICAL STATISTICS.**\n\n| Year | European Missionaries | Native Clergy | Native Agents | Total of Labourers | Schools | Scholars |\n|------|-----------------------|--------------|--------------|-------------------|---------|----------|\n| 1815 | 4                     |              |              |                   |         |          |\n| 1825 | 2                     |              |              |                   |         |          |\n| 1835 | 1                     |              |              |                   |         |          |\n| 1845 | 4                     |              |              |                   |         |          |\n| 1855 | 2                     |              |              |                   |         |          |\n| 1858 | 3                     |              |              |                   |         |          |\n\nThe Society for Propagating the Gospel, the London, Wesleyan, and Leipsic Missionary Societies, the Established and the Free Church of Scotland, and the American Board (Boston), are also labouring at Madras.\nTELUGU MISSION.\n\nOne of the most extended and populous of the nations of Peninsular India is the Telugu (Telinga) race, stretching along the sea coast nearly from Madras to Bengal, and far inland into the heart of the Dekhan. They were called Gentooes by the earlier European settlers, from the Portuguese word for \"Gentiles,\" or heathen. At one time they gave kings to the Kandian country of Ceylon, and many colonies of them still exist among the Tamils of the south—the descendants of the conquering armies, who overthrew the old Pandyan dynasty in Madura and the south. They number upwards of 13,000,000; and part of their maritime territory—Masulipatam and the Northern Circars—was amongst the earliest acquisitions of the British in Hindustan. Their soft and musical language has long commanded the admiration of Oriental scholars. Yet this territory had been nearly ninety years in possession of the British before any Mission was established there by the Church of England.\n\nMasulipatam is the centre of the Church Missionary Society's operations among this interesting people. It is a large town, containing nearly 100,000 inhabitants. It is mentioned as a flourishing place in the fourteenth century, by Marco Polo, the Venetian traveller; and in the days of the monopoly of the East-India Company, it was one of their chief depôts for the export of cotton-fabrics. The Mission was commenced in 1841 by two Missionaries, one from Cambridge, one from Oxford. The Rev. R. T. Noble undertook the educational department, and established a superior school there, which has yielded him several converts, amongst them three young Brahmins, one of whom is now a candidate for Holy Orders. He is still spared to labour there. The Rev. H. W. Fox, whose biography is well known, commenced, with much encouragement, itinerating labours. He pursued them in a spirit of ardent devotion, but was early called from his labour to his rest. The Mission has recently been recruited with two additional Missionaries from England, and the district of Masulipatam, forming, however, but a small portion of the whole Telugu Country, may now be said to be fairly occupied. We wait in prayer \"the promise from on high\" on their ministrations.\n\nThis district has recently acquired additional importance from the great irrigation works, by which the two great rivers, the Kishna and Godavery, are made available for the purposes of cultivation and of internal communication. Across each, an embankment, or Anicut (see Map), has been thrown, which keeps back the vast body of water that flows down their channels during the rainy season. It is thence gradually conducted by canals over the lower lands, thus clothing them with new fertility. A large corps of skilled native engineers, and a still larger number of labourers, are thus employed at Bezwara and Dowlaisheram, and offer a promising field for the Missionary.\n\n[Turn over.]\nCHRONOLOGICAL STATISTICS.\n\n1841.... Masulipatam.\n1841.... Masulipatam Native English School.\n1854.... Ellore.\n1854.... Vizswara.\n\n|                                | 1841 | 1851 | 1858 |\n|--------------------------------|------|------|------|\n| European Missionaries          | 2    | 1    | 3    |\n| East-Indian and Country-born Missionaries | ...  | 2    | 2    |\n| Native Agents                  | ...  | 8    | 27   |\n| Communicants                   | ...  | 16   | 50   |\n| Schools                        | ...  | 2    | 7    |\n| Scholars                       | ...  | 127  | 353  |\n\nThe London Missionary Society has an important Mission at Vizagapatam. The Free Church of Scotland, and the American Lutherans and Baptists are also labouring amongst the Telugus.\nTINNEVELLY MISSION.\n\nThe Province or District of Tinnevelly forms the southern point of the Indian Peninsula. It is about 100 miles from N. to S. The base of the triangle is about 70 miles broad. The area of the district, about 6700 square miles. Population, in 1856, 1,270,000. Range of thermometer, 86° to 100°. In the northern and westerly parts of the district, rice, the castor-oil plant, cotton, and various grams, are cultivated, and groves of tamarind trees abound. The south is one vast sandy plain, broken only by the tall straight stems of innumerable palmayas—a palm, whose manifold qualities almost supply the absence of other vegetation. The predominant caste, about one-third of the population, is the Shanar, employed in the south in palmyra cultivation; in the north, also in trade and commerce. Brahminical temples, endowed with lands in different parts of Tinnevelly, are to be found especially in the larger towns. The prevailing religion is the aboriginal devil-worship, with idols, bloody sacrifices, and no hereditary priesthood.\n\nIt is not quite certain when, or by whom, Protestant Missions were commenced in Tinnevelly; but certainly through the instrumentality of Schwartz, and the Danish Lutheran Missionaries in connexion with the Society for Promoting Christian Knowledge. In 1785, there was a congregation at Palamcotta of 100 native Christians, under the charge of an ordained Catechist, Sathianadhan. In 1816, the late devoted Rev. James Hough, Chaplain H. E. I. C., found at Palamcotta 3000 converts. The first European Missionaries who ever resided in Tinnevelly were sent there in 1820 by the Church Missionary Society—the Rev. C. T. E. Rhenius, and the Rev. B. Schmid. Great blessing followed the former's labours, and thousands of Shanars sought Christian instruction. Rhenius, however, still a Lutheran, was betrayed into controversy on ecclesiastical questions; and the Society's faithfulness to the Church of England constrained them to dissolve connexion with him. His death soon after extinguished all differences. The advance and consolidation of the Mission have been of late years remarkable. There are now 386 Churches or Prayer-houses in 541 villages; the number of Native Christians being nearly 30,000: two-thirds of these are south of the River Tambraparni.\n\nIn 1854, an Itinerating Branch was formed in North Tinnevelly. The district so occupied by three Missionaries devoted to that especial work is coincident with the Sivagasi district. By these brethren, who move their tents from place to place throughout the locality (1200 square miles), the Gospel has been already preached to as many as 300,000 souls in 1400 villages. Two bodies of converts have been baptized, and there are numerous inquirers. The peculiar and novel feature of interest in this department is, that it is carried on upon the basis of the Native-Christian Church in the south of the Province, a regular monthly succession of Catechists being supplied from the settled Christian districts, and supported from the funds of their Native Missionary Society.\n\nCharitable Societies—The Church Missionary, Bible, Heathen's Friend, Church-Building, Tract and Book, Poor, &c.\n\nEducational Establishments—The Preparandai Institution, founded in 1850, for the training of Catechists and Native Agents—They are educated (in Tamil) in general Theology, with such text-books as \"Pearson on the Creed,\" \"Goode's Better Covenant,\" &c.; Church History; Scripture Geography; and other branches of knowledge. Large numbers of Catechists, and 7 Native Clergy, have been sent forth from it. No Catechist can be employed in the Mission without a cer-\ntificate, from the Missionary who knows him best, of his personal piety—the principle having been laid down, that *None but spiritual agents can do spiritual work*. The *Vernacular Training Institution*, founded in 1856, with Model Boys' and Infant Schools, for the education of Schoolmasters. The *Sarah Tucker Female Training Institution* (1858); a similar establishment for the education of Schoolmistresses. The Government Inspector has recently spoken highly of the Schools in Tinnevelly, and 80 Schoolmasters, and 17 Schoolmistresses, receive a Grant-in-aid from the Madras Government. A school fee is required for every male pupil.\n\n**LANGUAGE**—Tamil, spoken by about 12,000,000 in South India, and one of the aboriginal languages of the peninsula; the tongue in which Protestant Missionaries first preached, and into which the Bible was first translated.\n\n**CHRISTIAN BOOKS**—The Bible, Book of Common Prayer, Hymns, Sermons, Tracts, School-books—a Commentary in preparation.\n\n### CHRONOLOGICAL STATISTICS.\n\n| Year | Place                  |\n|------|------------------------|\n| 1817 | Palamcotta             |\n| 1828 | Dohnavur              |\n| 1832 | Sáthankulam           |\n| 1833 | Pragasapuram          |\n| 1833 | Alvarneri             |\n| 1839 | Méngnánapuram         |\n| 1840 | Suviséshapuram        |\n| 1842 | Paneivilei            |\n| 1844 | Kadáchapuram          |\n| 1844 | Paneivádali           |\n| 1844 | Nallár                |\n| 1845 | Asirvádhapuram        |\n| 1847 | Pávur                 |\n| 1847 | Surandei              |\n| 1848 | Pannikulam            |\n| 1854 | North Tinnevelly Itinerancy |\n| 1866 | Sivagasi              |\n\n| Year | European Missionaries | Native Clergy | Native Agents | Communicants | Schools | Scholars |\n|------|-----------------------|---------------|---------------|--------------|---------|----------|\n| 1820 | 2                     | ...           | 10            | ...          | 8       | 417      |\n| 1830 | 3                     | ...           | 110           | ...          | 63      | 1496     |\n| 1840 | 6                     | ...           | 355           | 849          | 182     | 5392     |\n| 1850 | 11                    | ...           | 449           | 2743         | 257     | 6762     |\n| 1868 | 12                    | ...           | 544           | 4180         | 305     | 7395     |\n\nAmongst the Tamil-speaking people in Tinnevelly, or the immediate vicinity, there are connected with the Missions of the Society for the Propagation of the Gospel 18,000 native Christians; London Missionary Society, 14,000; American Board for Foreign Missions (Boston), 5000. The Map is coloured to indicate the districts severally occupied by the four Societies.\nTravancore, west of Ali, has been\n\nThe 1,000 never a strong native, especially through drum.\n\nThe never inhabited other hill-consider-\n\nThe Christian Patrician privilege that the influence visiting enter-\n\nment book young hope unsup-\n\nproviding how-\n\n1832, Roman larger been\n\nMen\nTRAVANCORE MISSION.\n\nTravancore and Cochin are two small native kingdoms on the southwest coast of India. During the wars between the English and Hyder Ali and Tippoo Saib, their rajahs took the side of the English, and have been, therefore, confirmed in their thrones.\n\nTravancore is by far the larger, containing a population of about 1,000,000, whose vernacular is Malayalim. It is separated from Tinnevelly by the range of mountains called the Southern Ghats, and forms a striking contrast to the flat sandy plains of the latter. It is well cultivated, and, towards the interior, abounds with magnificent forest trees, especially teak. There are numerous backwaters, or lagoons, which run parallel with the coast, and form the natural highway of communication through the kingdom. The rajah, with his Court, resides at Trivandrum.\n\nTravancore is almost entirely inhabited by Hindus, Musalmans never having obtained political supremacy there. The wealthiest of the inhabitants are called Nairs. Their customs differ much from those of other Hindus. The mountains are scantily peopled by various wild hill-tribes—the Arrians (Araans) and others. There is also a considerable slave population, whose political and social degradation is practically very great.\n\nThe feature, however, which specially directed Missionary attention to Travancore is the existence there of an ancient Syrian Christian Church, of about 70,000 souls, whose spiritual head is the Patriarch of Antioch. They have a certain social status and various privileges granted them by the Native Government; and it appeared, that, could they only be reformed, they would exercise a powerful influence on the heathen around. In 1805, Dr. Claudius Buchanan visited and reported on them. Col. Munro, the British Resident, warmly entered into the scheme for their elevation. In 1816, a Mission was commenced among them. Translations of the Scriptures and the Prayer-book were prepared. A College was opened for the training of the Syrian youth. Intercourse was maintained with the Metropolitan. But the fond hopes of a reformation gradually faded away. The Syrians clung to their unscriptural superstitions. And, after a long, patient, and judicious prosecution of the system, it was proved to be hopeless in practice, however beautiful in theory. A separation consequently took place in 1837; and the Mission is now considered as designed for Heathen, Roman Catholics, and Syrians, without distinction. There is now a large body of heathen converts; and two branches of much interest have been commenced, one amongst the hill tribes in the neighbourhood of Mundakyam, and one amongst the slaves.\n\nCochin, which was formerly a station of the Society, has recently been re-occupied.\n\n[Turn over.]\nCHRONOLOGICAL STATISTICS.\n\n1816. . . . . Cottayam.\n1816. . . . . Allepie.\n1833. . . . . Mavelikara.\n1838. . . . . Cottayam College.\n1841. . . . . Trichur.\n1843. . . . . Pallam.\n1849. . . . . Tiruwella.\n1853. . . . . Kunankulam.\n1855. . . . . Mundakyam.\n\n|                  | 1816 | 1826 | 1836 | 1846 | 1858 |\n|------------------|------|------|------|------|------|\n| European Missionaries | 3    | 4    | 6    | 6    | 6    |\n| Native Clergy     |      |      |      | 1    | 6    |\n| Native Agents     |      |      | 1    | 14   | 103  |\n| Communicants      |      |      |      | 165  | 798  |\n| Schools           |      |      |      | 32   | 12   |\n| Scholars          |      |      |      | 907  | 395  |\n\nThe London Missionary Society has an important Mission in South Travancore, chiefly amongst the Tamil-speaking population, numbering nearly 14,000 Converts, (mentioned above, p. 34); and immediately North of Cochin, Missionaries of the Basle Society are labouring, and reckon 1000 Native Christians.\nCEYLON MISSION.\n\nThe Island of Ceylon—\"the almost Indian Isle, Taprobane,\" of Greek geographers, the Sciridib of Arabians, the Lanka Dwipa or Sinhala Dwipa of Sanskrit chroniclers—is one the loveliest in the world. From its position at the apex of the Indian Peninsula, it enjoys two monsoons in the year, and the abundant supply of moisture thus afforded clothes it with perpetual verdure. Palms of all descriptions, especially the cocoa-nut, at least one hundred species of forest trees, from ebony to satinwood, the cinnamon shrub in the lower lands, the coffee plant over the lofty mountains of the interior of 6000 feet high, (supplying 30,000,000 lbs. of the berry annually to Great Britain), contribute beauty, variety, and value to its natural productions. Precious stones are found in the beds of its mountain streams. Ceylon is also one of the chief centres of Buddhism, the holy relic—Buddha's reputed tooth—being preserved at the Dalada Maligawa, in Kandy, to which religious deputations are sent from Ava, and even Thibet.\n\nIt is inhabited chiefly by two races, whose geographical distribution is indicated by the two colours on the Map opposite. The Sinhalese, whose religion is Buddhism, are the most numerous, reckoning upwards of a million: they people the southern districts. The northern part of the island, and the eastern and western coasts, as far as Batticaloa and Chilaw, are occupied by Tamils, probably immigrants originally from the neighbouring continent. They adhere to the Brahminical faith. The Central part is almost uninhabited. In some of the forests are found naked roving tribes, who live by hunting, named Veddahs. Of them but little is known.\n\nSo rich an island would hardly fail to excite the curiosity of foreign invaders. Its first European conquerors were the Portuguese, who, under Almeida, gained possession of the coast line in A.D. 1506. They brought in with them Romanism, which found many adherents among the pliable Sinhalese. In A.D. 1656, the Dutch succeeded in expelling the previous rulers, and, after a century of warfare, established their supremacy over the natives, and proceeded to enforce, by heavy disabilities, a general profession of Protestant Christianity. Many heathen temples, especially in the north of the island, were demolished; the erection of new ones was prohibited; and, unless registered in the Baptismal Roll, no native possessed a secure title to land, nor could obtain Government employment. This attempt to promote the Gospel by measures utterly alien to its spirit, produced, as might have been expected, an outward conformity to Christianity, with a secret adherence to Buddhism and Brahminism—all the more resolute because it was stimulated by persecution. Missionaries find to this day that the duplicity and false profession engendered by this mistaken system are most grievous impediments to the spread of vital godliness in their congregations. In 1796 the Dutch were superseded by the English, who at once repealed this coercive policy, but its evil effects still linger in the native mind.\n\nThe Kandian District, in the centre of the island, retained its independence. In 1815, however, the inhabitants—a fine highland tribe of much promise—wearied with the cruelties of their successive monarchs, solicited the aid of the British to depose their reigning king, and the whole of the country was thus brought under our dominion.\n\nThe Church Missionary Society proposed to itself Ceylon as a Mission field as early as 1801. The circumstances that had induced so extensive a profession of Christianity were not fully known; and India being then closed against Missionaries, it seemed not only important to watch over\nthese large bodies of native Christians, but it was also hoped that the island might prove a basis of operations for the whole East. If further knowledge has modified these expectations, it has not taught us to despair of raising up these our heathen fellow-subjects. The projected Mission was not commenced among them till 1817. Our own statistics show that the labour bestowed has not been in vain; and the present aggregate of native Christians, in connexion with all the various Missionary Bodies labouring amongst them is upwards of 15,000; in this estimate those only being reckoned who are esteemed sincere Christians, not merely baptized Buddhists; and the Communicants number 3600. There are many other encouraging symptoms which cannot be gauged by figures, teaching that \"in due season we shall reap if we faint not.\"\n\nAn interesting Branch was established in 1855 amongst the Tamil Coolies, who come over from the Coromandel Coast, as many as 100,000 yearly, to labour on the Coffee Plantations in the Kandian Districts. A Staff of Missionary Catechists, from the Native Church of Tinnevelly, superintended by a Missionary well acquainted with Tamil, but whose health has proved unequal to the high temperature of India, visit and preach to these labourers on the various coffee estates, their salaries being paid by the proprietors. Eight Catechists thus visited last year 390 estates, and preached with much encouragement to 125,000 hearers.\n\n**CHRONOLOGICAL STATISTICS.**\n\n| Year | Location                  |\n|------|---------------------------|\n| 1817 | Jaffna (Chundiculy, Nellore, Copay). |\n| 1818 | Kandy (Ratnawela).         |\n| 1819 | Baddagama (Bentot, &c.).   |\n| 1822 | Cotta.                    |\n| 1850 | Colombo (Negombo).         |\n| 1855 | Cooly Mission.             |\n\n| Year | European Missionaries | Native Clergy | Native Agents | Communicants | Schools | Scholars |\n|------|-----------------------|---------------|---------------|--------------|---------|----------|\n| 1818 | 4                     |               |               |              | 1       | 44       |\n| 1828 | 8                     |               |               |              | 48      | 1744     |\n| 1838 | 8                     |               |               |              | 52      | 1762     |\n| 1848 | 10                    |               |               |              | 72      | 2577     |\n| 1858 | 10                    |               |               |              | 107     | 3467     |\n\nThe Society for the Propagation of the Gospel, the Wesleyan Missionary Society, the Baptist Missionary Society, are also labouring in Ceylon; and in Jaffna, the American Board of Foreign Missions (Boston).\nMAURITIUS MISSION.\n\nThe little Island of Mauritius lies just within the southern tropic. It is about the size of the County of Herts, our Map of it being of course on a much larger scale than the preceding. It was uninhabited when first visited by the Dutch, in 1598, who named it in honour of Prince Maurice. It became the occasional resort of pirates and adventurers, till regularly colonized in 1644 by the then great maritime nation who had discovered it. In 1712, they abandoned its occupation, and in 1721 the French took possession of it, and peopled it from their colony in the neighbouring Isle of Bourbon. Its geographical position between India and the Cape made it of much importance to their East-Indian trade; and the introduction soon after of the sugar-cane, cultivated by a large slave population, greatly augmented its value. In 1810, the island was captured by Great Britain, whose merchant vessels had been much harassed by the French cruisers that found harbourage at Port Louis and Malhebourg, and it has ever since formed part of our Colonial Empire.\n\nIn 1834, slavery was abolished in Mauritius, and about 90,000 slaves emancipated. A demand which since sprung up for more labour has been met by the promotion of the free emigration of Coolies, or hired labourers (coolie is a Tamil word, meaning \"wages\") from various parts of India. They usually return to their native land with their savings, after periods of service from five to ten years. Some of these Coolies are drawn from the hill tribes of Bengal and Orissa, and the rest from the Tamil people of the South Coast. In 1854, the Rev. Dr. Ryan was appointed first Bishop of Mauritius, and in the same year, one of the Society's Missionaries, the Rev. D. Fenn, visited the island from India for the restoration of his health; and having found how readily these emigrants listened to the preaching of the Gospel, strongly urged the commencement of an effort similar to that which was just being initiated in the Kandian District of Ceylon. For this work, also, two Missionaries have been found, whose state of health terminated their labours in India, but to whom a providential opening has been thus afforded of prolonging their services among people with whose language, religion, and habits they were already familiar.\n\nThe Rev. Stephen Hobbs, after sixteen years' experience in Tinnevelly, has been thus enabled to enter at once on ministrations among the Tamil Coolies, having arrived at Mauritius in October 1856; and the Rev. Paul Ansorge, after many years' sojourn in Kishnagur, followed him in 1857, and has commenced preaching and teaching in Bengali and Hindustani.\n\nA few native Christians have been found scattered throughout the plantations, and form a most important nucleus for a future Church; and the severance of the heathen emigrants from caste, and the absence of idol-temples, festivals, and observances, make them peculiarly accessible to the message of the Gospel.\nSUMMARY OF THE MISSION, 1858.\n\nMissionaries .......... 2\nNative Agents .......... 4\nCommunicants .......... 7\nSchools ............... 2\nScholars .............. 55\n\nThe Society for the Propagation of the Gospel and the London Missionary Society are also labouring in this field. Emigrants, both from Madagascar and from various parts of the East-African Coast, are to be found in the Mauritius.\nThe map shows a part of China, indicating various regions such as Tartary, Manchu, Shan-Tung, Hwang-Hai, and Guang-Si. It also marks missionary stations and the five Consular Posts.\n\nAt this juncture, the connection between the mission in China and the American Missionary Society in the United States becomes evident. The Chinese government had been disposed to allow foreign missionaries to enter China, but the refusal of the Chinese government to grant five Consular Posts to foreign powers was a significant event. This knowledge was shared by the Chinese government at least, and it was not until the following year that the Chinese government officially acknowledged the clergyman's mission.\n\nThis event was significant because it marked a turning point in the relationship between the Anglican Church and the Chinese government. The treaty signed in 1843 allowed foreign missionaries to enter China and, more importantly, provided them with access to the capital city of Beijing. This last event paved the way for the establishment of Christian communities throughout the country, including the boundary of Canton.\n\n\"The missionary's task is now finally accomplished. He has entered the midst of a vast and powerful race which has been destined from day to day to be the subject of a vast and powerful mission. The nation which he has approached upon its borders is a nation which dwells in darkness and under labor and sorrow. The mission of men who have come to proclaim the faith of God among them has been accomplished. The mission has yielded its fruits.\"\nCHINA MISSION.\n\nThe nation of China is the greatest in the world—400,000,000 souls, or about one-third of the human race. Their Government, also, is the oldest. Its organized system, with an army, a written language, historians and other literati, dates back to a period so remote, as to be probably coeval with the immediate successors of Moses. The governors have, indeed, changed, but the system of rule has remained much the same, including in its policy jealous exclusion of foreigners.\n\nAttempts were made, from time to time, by Protestant Missionaries connected with no fewer than seven English and American Societies, to gain a footing in China. The late Rev. Dr. Medhurst, of the London Missionary Society, visited the coast forty years ago. In 1836, our own Society sent a pioneer Missionary to the confines of the empire; but China was not then open. In 1843, a war with England, originating in disputes with reference to the opium-trade, was brought to a close, the Chinese paying the cost of the war, 27,000,000l. sterling, and opening five ports—Shanghai, Ningpo, Fuchau, Amoy, and Hong Kong—to foreigners. At this juncture an anonymous donor, who wished to be known only under the signature of Ἐλεονομοτέρος, \"Less than the least,\" gave 6000l. consols to the Society for the commencement of a Chinese Mission. Three of the ports were subsequently occupied by clergymen in connexion with the Society.\n\nThe year 1850 (Oct.) witnessed the commencement of a movement so momentous, that it is impossible to foretel the consequences of it—the Tae-ping rebellion, which still deprives the reigning Manchu dynasty of some of its largest Provinces. The circulation of the Bible by the rebel chiefs, and their adoption of it as their moral and political code, awakened at first much hopefulness, which may still perhaps be said to be the preponderating aspect of the movement; but their profession of Christianity is so much distorted and mutilated, that serious apprehensions cannot but be entertained as to the ultimate issue.\n\nEven this great convulsion, however, is thrown into the shade by the events of the last year. Another war with China, conducted by the Anglo-French alliance, was brought to a close in October 1858, by a treaty obtained by Lord Elgin, conceding to foreigners of every class, and, by implication, for our Missionaries also, the right of unlimited access into the interior of the country, and has thrown down the last barriers which interrupted our free intercourse with every part of China. Another third of the human race is thus presented to the compassion and the duty of the Christian Church. Let the call for labourers come from one of the Society's former Missionaries—\n\n\"I feel no despondency,\" writes the Bishop of Victoria, \"as to the certain final success of our work as the cause of God Himself. I am sustained by the assurance that God is working out His purposes of mercy and love to our race in these passing events of the East, that this our fallen world shall one day become a temple worthy of its holy and beneficent Creator, and that this vast Pagan empire, now an exile from the great community of Christian nations, shall hereafter participate in the promised outpouring of God's Spirit upon all flesh, and in the predicted blessedness of the renewed earth, 'in which dwelleth righteousness.' But I deplore the want of an adequate supply of labourers to enter upon these fields 'white unto the harvest;' men suited by mental habit and by bodily strength for this peculiar Mission; men whose faith has been long strengthened by secret prayer, and whose love to Christ has been long watered by the heavenly dew of spiritual communion with God; men willing to forego (if needful) the comforts of domestic life, and ready to yield to the possible requirements of a 'present necessity' in being free and\nunfettered by family ties in their itinerancy in the interior from place to place. Once more I reiterate the appeal to the Church at home, 'The harvest truly is great, but the labourers are few.' Once more I appeal to British Christians, that, while India is claiming her need of Missionary sympathy and evangelistic help, in this her day of trial, China may not be overlooked or forgotten in their prayers, nor her four hundred millions receive less than the due amount of consideration and thought in the counsels and deliberations of our Church.\"\n\nLANGUAGE.—Though the Chinese have many spoken dialects, they have but one written language. Their alphabet is symbolic, not phonetic. It represents things, not sounds: just as the inhabitants of Europe, though speaking different tongues, and unable to understand each other's speech, can all read and comprehend the numerals, 1, 2, 3, 4, &c. The Bible, the Morning and Evening Prayers, and various Tracts, have been disseminated widely in Chinese.\n\nCHRONOLOGICAL STATISTICS.\n\n| Year | European Missionaries | Native Agents | Communicants | Schools | Scholars |\n|------|-----------------------|---------------|--------------|---------|----------|\n| 1844 | 2                     |               |              |         |          |\n| 1849 | 7                     |               |              |         |          |\n| 1854 | 10                    |               |              |         |          |\n| 1858 | 8                     |               |              |         |          |\n\nIt is encouraging to know that several other Missionary Societies, English, German, and American, are labouring in this vast field.\nThis problem was somewhat of a voyage from almost round visited still a special island in their savage identified clan population victory.\n\nThe who ship included hoods few some remained sacred.\n\nWar questions become no name through cease deli same present by a \"p\" a church re fixed be yet inive.\nNEW-ZEALAND MISSION.\n\nThe islands of New Zealand, inhabited by the Maori race—a branch, probably, of the Malays of the Eastern Archipelago (p. 9)—and containing some of the finest scenery in the world, are very nearly the Antipodes of England. They were discovered in 1642 by the enterprising Dutch voyager, Tasman, but the fierce gestures of the natives deterred him from landing. He gave it its present name, but its very existence was almost forgotten, until Captain Cook, in the course of his first voyage round the world in 1769, re-discovered it, and, during five successive visits, maintained a friendly intercourse with the natives, of which they still cherish a pleasant recollection. No grain, nor any edible roots, but a species of fern and the kumera, or sweet potato, were found upon the island, and no quadrupeds but dogs and rats. The people were tattooed; their sole dress a mat of the Phormium tenax; amid many noble savage virtues, they were ferocious in the extreme; they dwelt in fortified fastnesses on the hill-sides or mountain-tops, called pas; their clans perpetuating feuds from father to son, which threatened to depopulate the island; and cannibalism was the unvarying result of a victory.\n\nTheir religion consisted in a vague notion of a supernatural power, whom they call Atua, and whom they appear generally to have worshipped without any intervening symbol, besides many inferior Atuas, including the spirits of their ancestors. They had no hereditary priesthood, and no public acts of religious worship; but every child, when a few months old, received a kind of baptism, which dedicated him to some fierce evil spirit. The well-known tapu, or taboo, was the most remarkable of their customs, by which almost anything could be made sacred and inviolable.\n\nThe Rev. Samuel Marsden, chaplain of Port Jackson, New South Wales—called sometimes the Apostle of New Zealand—had his attention directed to the spiritual wants of the Maoris in the year 1806, by becoming acquainted with a chief named Tippahee, who had worked his way from his country to Port Jackson in a trading vessel; and he lost no time in pleading the cause of these islanders with the Church Missionary Society. The New Zealand Mission was decided on in 1809, and three lay agents were sent to New South Wales with a view of proceeding to New Zealand. The massacre of the crew of the \"Boyd\" delayed them until 1814, and, on Christmas-day of that year—the very same day, by a curious coincidence, on which the first Indian Bishop preached his first sermon at Calcutta—Mr. Marsden opened the Mission by proclaiming the Gospel, for the first time, in the Bay of Islands—\"Behold, I bring you glad tidings of great joy!\"—Duaterra (Ruatara), a friendly chief, interpreting to his countrymen. In 1820, two native chiefs, Shungi (Hongi) and Waikato, visited England; and, as they resided for a few months at Cambridge, Professor Lee was enabled to fix the orthography and grammar of the Maori, and the natives rapidly began to learn reading and writing. It was not till 1825, after eleven years of labour, that the first conversion took place, and it was nearly five years more before any other natives were baptized. In 1834 the Mission began to branch out. In 1838, the natives under Christian instruction amounted to 2000. The progress of the evangelization and civilizing of the natives became now very rapid, and in 1842 the first Bishop of New Zealand, on his arrival, described the marvellous success which had been achieved in these memorable words—\"We see here a whole nation of pagans converted to the faith. A few faithful men, by the power of the Spirit of God, have been the instruments of adding\nanother Christian people to the family of God. Young men and maidens, old men and children, all with one heart and with one voice praising God; all offering up daily their morning and evening prayers; all searching the Scriptures, to find the way of eternal life; all valuing the word of God above every other gift; all, in a greater or less degree, bringing forth, and visibly displaying in their outward lives, some fruits of the influences of the Spirit. Where will you find, throughout the Christian world, more signal manifestations of the presence of that Spirit, or more living evidences of the kingdom of Christ?\"\n\nThe colonization of the island has proved a severe trial to the native Church, during which the want of a native pastorate has been severely felt, two Native Catechists only having as yet received Deacons' orders. A subdivision of the Episcopate has now placed the Eastern District, where the Maoris are most numerous, under the care of the Society's experienced Missionary, the Rev. William Williams, now Bishop of Waiau, who will be able to direct his undivided attention to the native race.\n\nThe Society's Mission has been confined to the Northern Island—the Middle and Southern Islands (which last is much smaller than the other two) having been very scantily peopled prior to colonization from Great Britain.\n\nLANGUAGE.—Maori.\n\nCHRISTIAN BOOKS.—The Holy Scriptures, the Prayer-book, &c.\n\nCHRONOLOGICAL STATISTICS.\n\n1814......Northern District (Paihia, Kaitain, Waimate, Kaikohe).\n1824......Middle District (Auckland, Hauraki, Kaitotehe, Otawhao, Waikato, Tauranga, Rotorua, Opotiki, Ahikereru, Taupo).\n1839......Eastern District (East Cape, Uawa, Turanga, Wairoa, Heretaunga).\n1839......Western District (Wanganui, Otaki, Pipiriki, Papawai).\n\n|                  | 1814 | 1824 | 1834 | 1844 | 1854 | 1858 |\n|------------------|------|------|------|------|------|------|\n| European Missionaries | ..   | 2    | 4    | 12   | 23   | 23   |\n| Native Clergy     | ..   | ..   | ..   | 1    | 2    |      |\n| Native Agents     | ..   | ..   | ..   | 295  | 440  | 543  |\n| Total Labourers   | 3    | 12   | 35   | 328  | 476  | 572  |\n| Communicants      | ..   | ..   | 33   | 2851 | 6796 | 5834 |\n| Schools           | ..   | 2    | 14   | 288  | ..   | ..   |\n| Scholars          | ..   | 65   | 420  | 15431| ..   | ..   |\n\n* No Returns.\nNORTH-WEST-AMERICA MISSION.\n\nThis Mission is carried on in the territories of the Hudson's-Bay Company, which was incorporated by a charter granted in 1670 by Charles II., to his cousin Prince Rupert and others, whence the name, Rupert's Land. It was commenced in 1822, at the instance of the Rev. J. West, chaplain to the Company, who compassionated the degraded state of the native tribes, by the formation of a station on the Red River. The Indians, with whom the Society has been specially brought into contact, are the Crees, or Muscaigos, and a branch of the Chippe (Ojibways) named the Saulteaux. The population is very scattered, but the expansion of the Mission during the last few years has been most remarkable. What were extreme points ten years ago are now centres of effort. The first boy taken into Mr. West's school became a catechist, and, after two years' residence, from 1840 to 1842, at a station 500 miles from the Red River (Cumberland), presented for baptism to the European Missionary 85 Indians. He was the first Cree who received ordination—the Rev. Henry Budd. Eastward, the Mission has extended to the Crees of the East Main, upwards of 1500 miles; whilst more than 2000 miles westward a Station has been just commenced on the shores of the Pacific, at Fort Simpson, among the Chimsyan Indians, in the territory since erected into a colony, under the title of British Columbia.\n\nThe first Bishop of Rupert's Land arrived in his diocese August 15, 1849; and to his wise and parental fostering of the native church, and especially in the encouragement of a native pastorate, the prosperous state of the Mission is, under God, very mainly due.\n\nLANGUAGES—Cree and its dialects; Saulteaux; Chimsyan. These languages are very polysyllabic. To facilitate the art of reading, a syllabic system, or kind of short-hand, representing syllables instead of letters, has been extensively and successfully introduced, particularly at Moose Fort, where the tribes are altogether nomad. The usual Roman character is employed for more extensive works.\n\nCHRISTIAN BOOKS.—In Cree: The Gospels of St. Matthew, Mark, and John; 1 Epistle John—the Prayer-book—Hymns, and various Tracts—the Prayer-book, Scripture Texts, Psalms and Hymns, and 1 Epistle John, printed on the Syllabic System.\n\n[Turn over.]\nCHRONOLOGICAL STATISTICS.\n\n1822......Red River (Indian Settlement, La Prairie, Islington.)\n1840......Cumberland (Moose Lake, Nepowewin.)\n1842......Manitoba, or Fairford (Red-Deer River.)\n1851......Moose Fort, James' Bay (Fort George Indians and Esquimaux.)\n1852......Fort Pelly.\n1852......English River.\n1854......York Factory.\n1857......Fort Simpson.\n\n|                  | 1822 | 1832 | 1842 | 1852 | 1858 |\n|------------------|------|------|------|------|------|\n| European Missionaries | 2    | 2    | 3    | 8    | 11   |\n| Native Clergy     |      |      |      |      | 3    |\n| Native Agents     |      |      |      | 8    | 19   |\n| Communicants      |      | 148  | 451  | 507  | 770  |\n| Schools           | 2    | 9    | 12   | 22   | 19*  |\n| Scholars          | 383  | 762  | 724* | 754* |      |\n\n* Imperfect Returns.\n| Date Loaned |\n|-------------|\n|             |\n\nTHIS BOOK MAY NOT BE TAKEN FROM THE LIBRARY\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_43334.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 102, "total-input-tokens": 166054, "total-output-tokens": 39785, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2534, 3], [2534, 4973, 4], [4973, 4973, 5], [4973, 5165, 6], [5165, 5165, 7], [5165, 6661, 8], [6661, 9357, 9], [9357, 13649, 10], [13649, 16765, 11], [16765, 16765, 12], [16765, 22375, 13], [22375, 26444, 14], [26444, 30055, 15], [30055, 30055, 16], [30055, 30055, 17], [30055, 35586, 18], [35586, 40942, 19], [40942, 40942, 20], [40942, 40942, 21], [40942, 42984, 22], [42984, 42984, 23], [42984, 42984, 24], [42984, 42984, 25], [42984, 46884, 26], [46884, 48605, 27], [48605, 48605, 28], [48605, 48605, 29], [48605, 52154, 30], [52154, 53378, 31], [53378, 53378, 32], [53378, 53378, 33], [53378, 57249, 34], [57249, 61206, 35], [61206, 61616, 36], [61616, 61616, 37], [61616, 65189, 38], [65189, 68146, 39], [68146, 68493, 40], [68493, 68493, 41], [68493, 70838, 42], [70838, 73809, 43], [73809, 76310, 44], [76310, 76310, 45], [76310, 76310, 46], [76310, 76310, 47], [76310, 80011, 48], [80011, 81517, 49], [81517, 81517, 50], [81517, 81517, 51], [81517, 85248, 52], [85248, 88533, 53], [88533, 89433, 54], [89433, 89433, 55], [89433, 91928, 56], [91928, 93558, 57], [93558, 93558, 58], [93558, 93558, 59], [93558, 97145, 60], [97145, 110185, 61], [110185, 110185, 62], [110185, 110185, 63], [110185, 113849, 64], [113849, 115920, 65], [115920, 115920, 66], [115920, 115920, 67], [115920, 118836, 68], [118836, 119606, 69], [119606, 119606, 70], [119606, 119606, 71], [119606, 123263, 72], [123263, 125989, 73], [125989, 125989, 74], [125989, 126269, 75], [126269, 129028, 76], [129028, 130041, 77], [130041, 130041, 78], [130041, 130041, 79], [130041, 133743, 80], [133743, 136457, 81], [136457, 136457, 82], [136457, 136457, 83], [136457, 139426, 84], [139426, 139820, 85], [139820, 139820, 86], [139820, 141389, 87], [141389, 145241, 88], [145241, 146911, 89], [146911, 146911, 90], [146911, 147208, 91], [147208, 150906, 92], [150906, 153270, 93], [153270, 153270, 94], [153270, 153270, 95], [153270, 155579, 96], [155579, 155579, 97], [155579, 155579, 98], [155579, 155579, 99], [155579, 156412, 100], [156412, 156505, 101], [156505, 156505, 102]], "primary_language": ["None", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "None", "en", "en", "en", "None", "None", "en", "en", "None", "None", "en", "None", "None", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "None", "None", "None", "en", "en", "None", "None", "en", "en", "en", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "None", "en", "en", "en", "None", "None", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "None", "None", "en", "None", "None", "None", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, true, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, true, false, false, false, false, false, false, false, true, false, false, false, true, true, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, false, false, true, false, true, true, false, false, false, true]}}]