[{"id": "ddb0021d94d42a37b45a3b1d21f3de2a9b39bcd0", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below.\n\n| Reduction Ratio |\n|-----------------|\n| 10X             |\n| 12X             |\n| 14X             |\n| 16X             |\n| 18X             |\n| 20X             |\n| 22X             |\n| 24X             |\n| 26X             |\n| 28X             |\n| 30X             |\n| 32X             |\n\nL'Institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couleur pages/\n- [ ] Pages damaged/\n- [ ] Pages restored and/or laminated/\n- [ ] Pages discoloured, stained or foxed/\n- [ ] Pages detached/\n- [ ] Showthrough/\n- [ ] Quality of print varies/\n- [ ] Includes supplementary material/\n- [ ] Only edition available/\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nLes pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par le dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nDOMINION OF CANADA.\n\nCOPY OF A DESPATCH\n\nFROM\n\nTHE EARL GRANVILLE, K.G.,\n\nTO\n\nGOVERNOR-GENERAL THE RIGHT HON. SIR JOHN YOUNG, BART., K.C.B.,\n\nREPORTING\n\nTHE RECENT FENIAN RAID INTO CANADA.\n\nPresented to both Houses of Parliament by Command of Her Majesty,\n25th July, 1870.\n\nNo. 178.\n\nSir,\n\nI have the honour to acknowledge the receipt of your Despatch, No. 132, of the 9th ultimo, with its enclosures, relating to the recent Fenian raid.\n\nI have read with sustained interest the graphic accounts given by Colonel Smith and Colonel Bagot of the two affairs which resulted in the repulse and rout of the Fenians on the Missisquoi and Huntingdon frontiers. I have sincere pleasure in acknowledging the conduct of the officers, the courage, alacrity, and discipline of the Volunteers and Militia, and the zeal and helpful enthusiasm of the farmers and country people on both the points of attack.\n\nThe discredit and ridicule attaching to these marauders on account of their signal overthrow when they had scarcely crossed the frontier must cripple, if not utterly destroy, the means of re-organizing expeditions as wicked and unjustifiable in their conception as they have proved to be feeble and unsuccessful in their execution. The genuine admiration of the spirit and behaviour of the Canadian levies which pervades the reports of Colonel Smith and Colonel Bagot is the best evidence that their easy success is not so much due to the character of their opponents as to the intrinsic qualities of the Canadians, the promptitude, courage, and intelligence which make individuals distinguished and a nation great.\n\nI have, &c.,\n\nThe Right Honourable Sir John Young, Bart. (Signed) Granville, &c. &c. &c.\n\nLONDON:\n\nPRINTED BY WILLIAM CLOWES AND SONS, STAMFORD STREET AND CHARING CROSS, FOR HER MAJESTY'S STATIONERY OFFICE.\n\n[C.—185.] Price 4½d.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_38279.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 10788, "total-output-tokens": 1697, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1994, 3], [1994, 4435, 4], [4435, 6275, 5], [6275, 6275, 6]], "primary_language": ["en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, true]}}]