[{"id": "ed0b56a2807614bc53be697446cce158779a5e19", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Couverture de couleur\n- [ ] Covers damaged/\n- [ ] Couverture endommagée\n- [ ] Covers restored and/or laminated/\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Cover title missing/\n- [ ] Le titre de couverture manque\n- [ ] Coloured maps/\n- [ ] Cartes géographiques en couleur\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Coloured plates and/or illustrations/\n- [ ] Planches et/ou illustrations en couleur\n- [ ] Bound with other material/\n- [ ] Relié avec d'autres documents\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nAdditional comments:\nCommentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10x 14x 18x 22x 26x 30x\n\n12x 16x 20x 24x 28x 32x\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"À SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nEMIGRATION, LAND AND RAILWAY FRAUDS.\n\nTHE \"COLONISTS' HANDBOOK.\"\n\nCANADA—1882.\n\nPUBLISHED UNDER THE DIRECTION OF THE TRACT COMMITTEE\n\nOF THE\n\nSOCIETY FOR PROMOTING CHRISTIAN KNOWLEDGE.\n\nTo the Standing Committee of the Society for the Propagation of the Gospel in Foreign Parts, and the Tract Committee of the Society for Promoting Christian Knowledge.\n\nREVEREND GENTLEMEN, AND GENTLEMEN:\n\nOn the 12th and 14th August, 1882 I mailed from Windsor, Nova Scotia, printed copies of the preliminary edition of my letter addressed to His Grace the Archbishop of Canterbury, entitled \"An Outcome of the Lambeth Conference, &c.\" as given in the margin. (1)\n\nAt the same period I also sent copies to the Archbishop of York, to all the Bishops of the Church of England named in Whitaker's Almanac for 1882, to a few of the United States Bishops, to the Secretary of the Society for Promoting Christian Knowledge and for the Propagation of the Gospel in Foreign Parts, to various religious periodicals and a few secular papers.\n\nI then proceeded without delay to prepare the promised annotated exposition of the Frauds I had outlined for wider publication, as indicated in my \"Appeal\" at the close of the letter, when two events occurred which relieved me from the pressure of immediately having to make any further inquiries, and induced me to modify the plan I had marked out.\n\nThe first of these in importance but not in order of time was the telegraphic announcement of the serious illness of His Grace the Archbishop of Canterbury, precluding all hope that His Grace would be able for some time to come to give any attention to the subject of my letter. The second event may be thus described.\n\nOn the 17th August I received a copy of the Church Guardian published on the 16th August, at Halifax, Nova Scotia. (2) In this issue of the Church Guardian there appeared an article by the Rev. Edwin S. W. Pentreath, of Winnipeg, Manitoba, also certain editorial correspondence from Winnipeg, which discussed and described some of the results of the influence of the \"Colonists' Handbook,\" and of the visit to that city of the Rev. A. Stylenham Herring, M.A., Vicar of St. Paul's Clerkenwell, London.\n\nThe relief of which I speak arose in part from the circumstance that one of the active agents in producing a portion of the distress that resulted described by the associate editor at Winnipeg in the Church Guardian, and now becoming patent, was an eye-witness of some of the worst of its own most directed charitable work, and therefore in duty bound to make further inquiries, and spare no effort to draw public and competent attention to the state of things, and to do all in his power to lessen the continuance of the evil and the causes which had led to it.\n\nThe Rev. A. Stylenham Herring, being previously warned, (3) possessed during his stay at Winnipeg favourable opportunities for verifying the facts just mentioned arrived at by the associate editor of the Church Guardian, and also given to the public in that periodical. He enjoyed special facilities for obtaining information in confirmation of the reported impending distress in the remote districts to which numerous immigrants had already gone, presumably under the guidance of the \"Colonists' Handbook.\" If he did his duty, he obtained the information clearly conveyed in the extracts, hereafter given, from the Church Guardian.\n\nUnder these circumstances, the alarming indisposition of His Grace led me to the conclusion that considering the urgency of the matter it would be fitting for me to address any further immediate communication to those more directly responsible for the preparation, publication and distribution of the \"Colonists' Handbook,\" namely, the members of the Standing Committee of the Society for the Propagation of the Gospel in Foreign Parts, and the members of the Tract Committee of the Society for Promoting Christian Knowledge, as described in the extract given in the margin. (4)\n\nThis direct communication is the more necessary now because you are collectively and officially commended by Sir Alexander T. Galt, High Commissioner for Canada, and I am invited member of your Joint Committee, for your labours and earnest labors \"in carrying so great a national enterprise to a successful issue.\" When you consider that from the beginning to the end of its descriptive portion the \"Colonists' Handbook\" is not merely fallacious but fraudulent, that its false map and its leading false statements were all pointed out in printed letters to Sir Alexander Galt and others before the \"Colonists' Handbook\" was prepared and published, will not clear your names or the cause of commendation of your alleged assiduous and earnest cooperation in this work?\n\nI give below an extract from Sir Alexander Galt's Official letter to his chief, the Honourable John Henry Pope, Minister of Agriculture for the Dominion of Canada, whose report has been presented to the Canadian Parliament, and is now widely circulated throughout the English language and largely spoken. It has been quoted in the United States Congress, and reviewed or noticed to a large extent in British Newspapers. The report of Sir Alexander Galt it embodies, is at the disposal of every scientific committee in favour of Canadian Pacific Railway Land Bonds, and all the Canadian North-West Land Companies floated in England; but, in consequence of Mr. Pope's report has fallen dead on the vast majority of the recently collapsed Canadian Colonization Companies, who have enjoyed opportunities during the year for estimating its merits.\n\nThis is Sir Alexander Galt's commendation of the efforts of the Joint Committee of the two great Church Societies in England in producing the \"Colonists' Handbook.\"\n\nIt must not forget to say a few words in connection with the action taken by the Church Societies in regard to the unfortunate situation that is taking place from this country. A joint committee has been formed of the Society for the Propagation of the Gospel and the Society for Promoting Christian Knowledge (of which I had the honour to be invited to become a member), and the question has been decided to prepare hand-books of the different colonies for the benefit of intending settlers which should also contain matter of a religious nature for their guidance. These hand-books have been issued and distributed among the clergy, together with a letter from His Grace the Archbishop of Canterbury, directing attention to the importance of such a publication. The committee has enabled copies of these hand-books to be obtained at a low price, and a list of other sources of information has been prepared for distribution by the emigration agent who has arrived in this country. The Rev. Mr. Bridger, of Liverpool, has been requested by His Grace to attend to the matter, and has visited the colonies in Canada, and has been received by the Hon. J. H. Pope, Minister of Agriculture, dated London, May 15th, 1882.\n\nNo person who reads this official letter from the Canadian High Commissioner, not knowing the circumstances, would doubt for a moment that the Joint Committee of the Great Church Societies of England, and the Honorable J. H. Pope, Minister of Agriculture, dated London, May 15th, 1882.\n\nBRITISH NORTH AMERICA.\n\nThe question of the day in our North American Colonies is emigration; of this question the Government has been very anxious to take care for the temporal as well as the spiritual welfare of our young Colonies, and has been willing to obtain trustworthy information as to eligible openings for colonists, and to provide means for their transportation to the Colonies.\n\nIn the spring of 1881 the Standing Committee appointed a Sub-Committee to consider the question of the Colonists' Handbook, and to see what power could be given to them as aiding to their number, the Sub-Committee invited the Standing Committee to meet them, and to nominate three of their members who should share their deliberations; or, instead of doing this, they drew up a handbook containing a list of useful information on matters relating to Canada and the United States, and sent it to the Colonists' Handbook to emigrants. (vide letter to His Grace the Archbishop of Canterbury, page 9.)\n\nShortt Library of Canada\nEngland took an active part in formulating the Colonists' Handbook, or that they are responsible for its contents and influence now for the night. No mercy is shown here towards the poor.\n\nThe editorial in the Church Guardian contains the following sentence, than which few words could be more to the point or more telling in the picture they draw of the condition of poor and neglected English immigrants in Manitoba and the North-West. It reads:\n\n\"At present everything needed by the settler is frightfully dear, this little stock of money is soon exhausted, and it is some two or three years before he is in a position to do much more than live.\"\n\nThe difference between the farmer East and West is that the latter can gain a position of independence much quicker than the former. It must not be supposed, however, that all who land in Manitoba possess the means necessary to make a living. While this may be possible only a few dollars over their passage money, many of them will make the best class of emigrants, but large numbers of them are utterly helpless. It is hard to see what induced them to leave England. They have a lazy idea of taking up land, but they have no practical experience; they are like children in a new country. It is to be hoped, however, that nearly every Englishman who goes to the land of plenty will succeed.\n\nThis is the keynote to be the case that a mindless state of demoralization has never been seen inside of the different immigration centers. The whole work of caring for the immigrants has fallen on the clergy of the Church. Many of these people stay in the city, but most of them settle on land. There is, beside this class, a number of English gentlemen and sons of gentlemen who came out in the spring of last year, possessed of some private means, and families from the older parts of Canada. All these \"are scattered across this huge Diocese.\"\n\nI beg of you, Reverend gentlemen and gentlemen, to contrast this paragraph from the Church Guardian of Aug. 16th, 1882, with a paragraph from the same paper published in the issue of Wednesday, April 26th, 1882.\n\nThe Rev. Mr. Herring, perhaps, the first fruits of the Archbishop of Canterbury's Circular relating to Emigration to the Colonies, has been the arrival in Halifax of two hundred of the very best class of emigrants, under the care of the Rev. J. Bridger, of St. Nicholas Church, Liverpool, who is the superintendent appointed by the Society for Promoting Christian Knowledge to organize the scheme sketched out by the Archbishop. They are all Church people, and will be sent together to the lock-up at the feet of the Church. This is but the first of several large parties who will come to this country under the Church's auspices during the spring and summer.\n\nHow vast is the contrast in four short months between the results depicted in these extracts! It is hard to see what induced them to leave England. Very few, if any, of those who have been making their way through Canada have spent any time in the North-West. Mr. Herring is Chairman of an Emigration Society in London, which has been successful in having persons sent to British Colonies. He is assisted by Mr. J. J. Jones, a member of the London School Board, and their object has been to see the actual condition of things in Canada, with a view to sending out emigrants. In company with Mr. Herring, Mr. Jones visited the various tent sheds, which are in Christ Church Parish, and was shown over them. The tent sheds contain accommodation for 57 families and 60 men. The family rent is 50 cents per week, eight men 15 cents. The building was put up by the City. The Government have a large building, where the accommodation is free.\n\n\"The Rev. Mr. Pentreath took the service, assisted by Rev. H. T. Leslie, the Rev. Mr. Herring reading the Lessons. Mr. Herring preached on, 'Christianity in Manitoba,' and took occasion to allude to the recent scene in the province, but said that nothing could be done there without faith, feeling, and discretion. At the close of the service, on the invitation of the Rector, a number of Londoners came into the vestry to meet Mr. Pentreath.\"\n\nThe Reverend correspondent does not describe the conditions under which life in the Emigrant Shed is borne. Here is a description from an account published in April last; it is dated Winnipeg, April 17th, 1882, and was published shortly afterwards.\n\n\"Worx is not to be got anywhere. I am staying at present in the Emigrant Shed, the only place to be got with my wife and two children, in what I call a cell, 8 feet by 12. No fire; ten 50 cents per day. The caretaker comes round every night at 9 o'clock.\n\nThe paragraphs from the Church Guardian state the wonder why the Rev. A. Stylian Herring and others did not take any open notice of my transmitted representations in April last, when the \"Colonists' Handbook\" was so widely distributed in May, and the distribution continues to be carried still.\n\nThe presence of the Rev. Mr. Bridges in Canada establishes the fact that those who control the \"Colonists' Handbook\" and its teachings are doubly responsible. There is also added to this responsibility the unavoidable consciousness that the misery and the sin is so manifest and great, the remedy and the amendment so easy and plain.\n\nI have proceeded to summarize the pith of the annotations and additions I have been compelled to make in my amplified letter respecting the frauds in the Colonists' Handbook to His Grace the Archbishop of Canterbury. To these I beg respectfully to call your immediate attention on account of the pressing needs of the immigrants to whom they relate, and the continued distribution of the \"Colonists' Handbook.\"\n\nFirst.—I have referred more at length to the infamous anonymous letter from Winnipeg. Its appearance in different forms and wording in these different forms, its origin and its emissions, and have suggested that a competent jury should express an opinion on the whole subject.\n\nSecond.—I have pointed out that in representing the prices of land in Manitoba in 1882 the Committee has been led to introduce the old cheap prices of 1880 from the Colonial Office pamphlet published in that year, and to add the word \"present\" to these old prices. This act I believe is criminal in the face of known facts and the object of the \"Colonists' Handbook.\"\n\nThird.—I have shown that the Committee have been induced to publish the Canadian Government leaflets and other favourable conclusions as to the Colony of Manitoba, which conclusions, I allege, are derived from these facts. I find that these conclusions belong to other and very different figures previously published officially, and as presented in the \"Colonists' Handbook\" is misleading if not fraudulent.\n\nFourth.—I have pointed out the vast distinction between the pamphlet called \"Colonization Companies\" in the \"Colonists' Handbook\" and the Canadian Government leaflets published in England. I have touched upon the recent collapse a very large number of Canadian Colonization Companies.\n\nFifth.—Fever and endemic diseases. I have referred to the Official State and Medical Reports respecting the prevalence of certain types of fever and pulmonary complaints throughout the North-West, which the \"Colonists' Handbook\" declares do not exist.\n\nSixth.—I have touched upon the Royal Commission concerning the Canadian Pacific Railway and the just retrospective consequences springing from the appointment of an officer as Royal Commissioner who, at the time of his appointment, was known to have asked Sir Alexander Galt with false Exhibits, falsely sworn to before a public tribunal of which Sir Alexander Galt was a member and a conscientious recipient of the pretended evidence.\n\nSeventh.—I have further pointed out the continual perversion and misleading use of my own official figures by the Department of Agriculture at Ottawa, by which Sir Alexander Galt is subordinate. I have instanced the object of this perversion and its use in a notable case by another official.\n\nTHE REVEREND SECRETARY'S DILEMMA.\n\nAnd now I must respectfully present you with a dilemma moulded by the Reverend Secretary of the Society for Promoting Christian Knowledge. The interests and claims of the misled and suffering immigrants (for whom he is plugging) are thus offered in incalculable solutions of the whole subject as concerns responsibility. I introduce it as an illustration of the slough into which any one may be led by too great a reliance on the subtleties of officialism, and I feel sure that in the interests of Christian Knowledge which you represent, you will aid me in pressing this dilemma to a solution. I implement it with a further illustration of the turpitude of Sir Alexander Galt in his role as a international matter, whereby he and his allies are dangerous to human official personages of the highest honour into positions of extreme difficulty and hidden danger. This illustration will be found in the accompanying letter addressed to Sir Alexander Galt, in which I have been compelled to express myself that treacherous and covering diplomatic in texts which would make a convict wince, and which I shall in future address to the officials and members of the Society for Promoting Christian Knowledge to the grave deceptions outlined, I received in reply the following words: \"We look to official sources for our information, and cannot enter controversy about what is thus supplied.\"\n\nI turn to the official account furnished to the Canadian Govern-\nmount by Sir A. T. Galt respecting the \"Colonists' Handbook,\" and find that Sir Alexander Galt affirms that \"it is almost impossible to mention any gentleman in particular, when the whole of the Committee has been so assiduous and earnest in carrying so good a work to its legitimate conclusion.\"\n\nIt has been said that \"with whom measure ye meete, it shall be measured unto you.\" Sir Alexander Galt's statement respecting the action of the Committee being official, is beyond controversy and must be accepted by the Reverend Secretary. Therefore, according to the ground of defense taken by the Reverend Secretary, the Joint Committees are clearly responsible for all the falsehoods and misleading statements of the \"Colonists' Handbook,\" which bears the impress of the Society for Promoting Christian Knowledge.\n\nSir Alexander Galt names two gentlemen as particularly earnest in the work—the Rev. Mr. Bridger, of Liverpool, and the Rev. W. Paneckridge, of St. Matthew's, London. Sir Alexander Galt says that the Rev. Mr. Bridger is thoroughly acquainted with all parts of Canada. It is not a matter fitted to create overwhelming suspicion that he has made such extraordinary uses of his knowledge as displayed in the \"Colonists' Handbook.\"\n\nIt follows, sir, Sir Alexander Galt's Official Report of the labors of the Joint Committee of the great Church Societies of the United Kingdom, if the Reverend Secretary's conclusion be just, that, unguardedly acting under the influence of evil counsel, the Committee have been beguiled into doing the following things for the guidance of their poor and uninstructed fellow-countrymen—giving relief from the burden of competitive life reduced to a struggle for existence.\n\n1.—MAP OF THE COUNTRY.—The Committee had at their disposal several official maps of the country the \"Colonists' Handbook\" is chiefly devoted to describing. Some of these maps show the correct delineation of the Canadian Pacific Railway as regards known location and construction. One map shows a grossly false delineation of the same thing as regards location and construction. The Joint Committee were persuaded to choose the one false map and endorse it under the imprint of their authority. The Society for Promoting Christian Knowledge, for the information and guidance of their uninstructed dependants and countrymen, (see map facing the Title Page of the \"Colonists' Handbook.\")\n\n2.—PHYSICAL FEATURES.—The Committee had at their disposal recent official descriptive accounts of the geographical and physical features of the Western Country they undertook to describe, also the geological surveys of alleged other records, palpably false to a scientific expert, but not to an amateur. The Committee were persuaded to reject the recent official description and to present for the information of their fellow-countrymen the burlesques of a Hudson Bay Company's partizan. (See pages 16 and 17.)\n\n3.—CLIMATE.—The Committee had at their disposal corrected and amended Official Government Records of observations carried on uninterruptedly for ten years respecting the climate of a portion of the Western Country they described; also a set of manufactured tables, taken from a Far West newspaper and purporting to represent the same thing. The Committee were persuaded to reject the true official account of their own scientific experts, touching their own country, and accept the misleading and falsified statements of an alien and an amateur, first published in a United States Western newspaper. (Page 23.)\n\n4.—CANADIAN TRADE.—The Committee had at their disposal the Official Records for the past ten years of the months and seasons in Manitoba published by the Government Observatory, together with the opinions of an amateur. The Committee were persuaded to reject the Official Records and to introduce the unverifiable statements of the Hon. J. H. Pope, written ten years ago. (Page 24.)\n\n5.—TRADE RETURNS.—The Committee were presented with Canadian Trade Returns and convinced therefrom. In another of official publications previously published, the same Trade Returns with very different and more recent conclusions were available. The Committee were persuaded to adopt the old conclusions, less justifiable but more favourable towards the false impressions they were designed to create. (Page 12.)\n\n6.—FEVERS, ENDIMIC DISEASES AND PULMONARY COMPLAINTS.—The Committee had before them Official State Reports and Official Records from the offices of the Government respecting the prevalence of certain fevers and endemic diseases; also touching the uncertainty of the climate of the North-West, in cases of pulmonary breakdown, and the general tendency of women over 30 years of age to pulmonary complaints, yet the Committee were persuaded to publish the statement that the country \"is free from pulmonary complaints and fevers of every type.\" (Page 13.)\n\n7.—PRICES OF COMMODITIES.—The Committee had the opportunity for ascertaining information respecting the high prices of commodities in British North America and the North-West, yet the Committee were persuaded to introduce the old cheap prices of 1862 in their book published in 1882 and to add the word \"former\" to those old prices. (Page 22.) This is a deception of surpising\n\n(1) I am informed by excellent medical authority that Pneumonia is frequently fatal in Manitoulin.\n\n8.—THE ASSOCIATE LICENSE FROM WINNIPEG.—The Committee had the opportunity for ascertaining complete information respecting manual labour in Manitoba and the conditions of life there during summer and winter, with the almost insuperable difficulties which attend the acquisition of accessible and suitable Free Grant Land by emigrants, yet the Committee were persuaded to introduce, amongst other matters on these subjects, with altered figures and words, which better had been utterly done service in a newspaper in England and in various other publications. (Page 19.)\n\n9.—FREE GRANTS OF LAND.—The Committee had before them the new Dominion Land Regulations promulgated prior to the issue of the \"Colonists' Handbook.\" Yet they were persuaded to publish a misleading summary purporting to reproduce these regulations. The Committee were also put notice of the Exemption Clauses, which in a large measure neutralized the inducements held out to immigrants by the isolated and unexplained Free Grant Clauses. This omission is of the graved character, for the acquirement of Free Grant Land is one of the leading objects of the poorer emigrants.\n\n10.—COLONIZATION COMPANIES.—The Committee were persuaded to introduce into the \"Colonists' Handbook\" a misleading paragraph respecting \"Companies and persons wishing to assist emigrants,\" yet having before them another official paragraph relating to the same thing, but tending to show \"the Companies and persons\" that they were protected against the emigrants.\n\netc., etc., etc., etc.\n\nIt appears that in every leading particular, the Committee, having the true descriptions and facts within easy reach, have been led to publish false representations respecting the country to which they purposed to direct the attention of uninstructed people through the instrumentality of the clergy of the Church of England. Certainly this act carries with it the penalty of compensation for damages.\n\n11.—RELATION TO THE OLDER PROVINCES OF THE DOMINION.—The Committee devote four times as much space (including the description of the Church of England Settlement Society in Manitoba) in the \"Colonists' Handbook\" to Manitoba and the North-West as to the Provinces of Ontario, Quebec, Nova Scotia and New Brunswick all combined. And this is how the Committee treat the magnificent Province of Ontario. The Committee say of the climate of Ontario—\"The climate is much the same as in some other parts of the Dominion, but certainly not the wintry than in Quebec.\" This is all. Now what is an Englishman seeking information, to make out of this description of the climate of Ontario? His first question would be, \"What other parts of the Dominion?\" And there he would rest—unsatisfied. The injustice done to the older Provinces by the \"Colonists' Handbook\" is enormous. These Provinces have always recommendations and able to afford every facility to immigrants who have been accustomed to the worthy with open arms, and are anxious to receive them still. This injustice has been accomplished by misleading and untruthful efforts to magnify and distort the attractions of Manitoba and the North-West, and obscure the vast resources and claims of the older Provinces who are loyally and gratefully disposed towards the Mother Country.\n\nWhen you, Reverend gentlemen, and, gentlemen, consider that the \"Colonists' Handbook\" begins its teachings by stating that the information it embodies \"may be thoroughly relied upon\" (page 3) you will arrive at a just conception of the extent of injustice and misery the \"Colonists' Handbook\" is capable of creating and the immeasurable harm it occasions.\n\nThere is one appalling fact about the \"Good Work\" which created the \"Colonists' Handbook,\" few will be able to contemplate without a feeling of repugnance or misgiving. But it is a feature which ought to nerve any one associated with the production of the book to extremest action in order to remove the impression it is liable to produce. For it is certain that as long as the \"Colonists' Handbook\" is permitted to deceive uninstructed people of England in the absence of official disavowal, this feature will now present itself to those who know the character of the information imparted, and its effect will be disastrous to morality and impair the influence of true religion.\n\nFirst.—As shown in my letter to His Grace, the information the \"Colonists' Handbook\" conveys is false in all its leading particulars and was known to be so when the book was presented to the Joint Committee by one of its members.\n\nSecond.—Apart from the dishonour of presenting this false information to the Joint Committee of the Great Missionary Societies (a) see the recent statement of the Bishop of Rupert's Land respecting the experience of Manitobans and the North-West. \"The very prosperity of the country is the result of the vast expenditure. It is really almost impossible to get a sufficient number of emigrants to settle in the West—even those who are looking for work.\"\n\n(b) The Handbook drawn up by the Committee of the two Church Societies introduces the subject in the following words—\n\n\"A FEW WORDS TO IMMIGRANTS.\"\n\n(c) It may be taken for granted that the reader of this little book has, for some reason or other, made up his mind to emigrate, and that he and his wife and children, his own country and its prejudices, all of which, it seems, are now casting aside in favour of a new way of living abroad. He will find in this book a simple, straightforward account of the advantages of the West—of the opportunities offered to him by the choice. This information is supplied by the kindness of the Canadian Government, and may be thoroughly relied upon.\"\nTHE SLANDER RESPECTING THE UNITED STATES SPURIOUS FISH AND FISH OIL STATISTICS.\n\nTo Sir Alexander T. Galt, G. C. M., G., High Commissioner for Canada, and H. M. Commissioner at Halifax in 1877.\n\nSIR:\n\nI received your letter of the 3rd May, 1882, a few hours after your departure from England on the 2nd May. You make it impossible for me to reply to you during your stay in England, and you temporarily escaped from the legitimate effect of my communications to the Lord Mayor of London and to Earl Granville.\n\nI have transmit to you a copy of a letter I have addressed to His Grace the Archbishop of Canterbury relative to the frauds imposed by you on the Church Societies of England in relation to Manitoba and the North-West Territory of Canada, printed by the Tract Committee of the Society for Promoting Christian Knowledge in the \"Colonists' Handbook—Canada.\"\n\nI also transmit herewith a letter I have addressed on the same subject to the Standing Committee of the Church for the Propagation of the Gospel in Foreign Parts, and the Tract Committee of the Society for Promoting Christian Knowledge, in which I have further illustrated the meanness and fraudulent character of your work, together with its tendency to Ministers of Religion.\n\nYour conduct concerning the \"Colonists' Handbook\" has been so openly and persistently that I have no hesitation in now openly writing to you on the subject, which might otherwise have been allowed to remain for the present, but shall be shown of diplomatic reserve. But the wilful deception you have practised on the Great Church Societies of the country, in their pursuit of good endeavours, and through them on the clergy of the Church of England, places you beyond the pale of forbearance or charity.\n\nTherefore I most publicly say to you what has been conveyed to me in England privately, namely, that you have deliberately as an excuse and cover for your imposition in relation to the Halifax Fisheries Commission, that the American Exhibits produced in evidence in 1877 were just as bad as the British Exhibits. I now tell you that such a statement, if you have made it as reported, is a slander.\n\nI am aware of the existence of certain falsehoods United States Fish and Fish Oil Statistical Statements, particularly in one year. I have examined into their character and found some of them to be willfully misleading to a very large degree and the imposition of dangerous nature. But these misleading and clearly falsified Statistical Statements, although they appear in important Official United States Documents, were not presented by the Americans as Exhibits in evidence for the purpose of misleading, or employed for any exclusive object; neither were they used in argument at Halifax in 1877, or, as far as I can gather, in any way specially brought forward by the American Commissioners.\n\nMarked reference, however, was made by British Counsel in argument to the points favourable to the British side these manufactured statistics assist in illustrating, although I have no knowledge that the infamy of these manufactured statistics was known to the British Counsel.\n\nThe facts evidence that the spuriousness of these statistical statements known and used by the Canadian Department of Customs long prior to the meeting of the Commissioners in 1877 are the following facts.\n\nFirst.—In the document entitled \"Appendix—Memorandum concerning Article XXI. of the Treaty of Washington,\" which embodies the details of the British Exhibits submitted in evidence, and in the arguments of counsel, certain of the spurious United States statistics are used to illustrate important points against the United States.\n\nSecond.—The figures, the use to which they were put, and the date of their manufacture, when compared with the details of the figures submitted in evidence and given in \"Appendix—Memorandum concerning Article XXI. of the Treaty of Washington,\" and other documents, are matters of indisputable evidence that these spurious United States statistics were but one of a TRAITORS CONSPIRACY AGAINST THE UNITED STATES between an officer or officers of the Bureau of Statistics at Washington, and an officer or officers of Canadian Departments of State, at Ottawa.\n\nBut the documents officially placed in my hands at the close of the Halifax Fisheries Commission, which documents include all the papers before the Commissioners, prove that there is no ground whatever for the slander with which you are credited in England. The same and other Canadian documents establish the fact that the chief British Exhibits were forged and misleading to an enormous extent and that you must have been conscious of their viciousness, after inspection, at the time they were sworn to in evidence, and, consequently, when you assisted in determining the award.\n\nIt is of the highest importance that the character of this conspiracy be publicly known, for the knowledge of its existence is confined to very few. It is made a power for influence and evil of the most dangerous character. It warps grave international matters, which become the mere tools of schemers, and it compromises and fetters honorable men. It gave the power to discredit the \"Colonists' Handbook,\" and it is a vile tool of injustice which ought to be reported to use freely and well for your purposes. Insidious words and imputations are liable to lead even honorable men to silence in a matter which they feel ought to be openly explored, on the ground that it is a dog's business, grossly falsified by the United Kingdom itself.\n\nThe Memorandum concerning Article XXI. of the Treaty of Washington, inevitably leads to the conclusion that the Dominion Government will not use its own dishonourable political power to compel the United States at Washington to give up the inevitable result of the proceedings to the Marquis de la Reine, increase his prestige, and show the world that the infamous plot is a lie.\n\nLord Macdonald, your home minister in the Cabinet, please allow me to escape from this unparalleled slander, and truth and justice will be served.\n\nCompiled by Mr. A. A. Windsor.\n\nTo the Right Honorable MY LORD,\n\na letter I addressed to the Commissioner for Canada, I should have the opportunity for the latter outlining the facts.\n\nTHE SLANDER RESPECTING THE UNITED STATES SPURIOUS FISH AND FISH OIL STATISTICS.\n\nTo the Honorable Commissioner for Canada.\n\nSIR:\n\nI addressed a letter to the Commissioner for Canada, I should have the opportunity for the latter outlining the facts.\n\nTHE SLANDER RESPECTING THE UNITED STATES SPURIOUS FISH AND FISH OIL STATISTICS.\n\nTo the Honorable Commissioner for Canada.\n\nSIR:\n\nI addressed a letter to the Commissioner for Canada, I should have the opportunity for the latter outlining the facts.\nTHE UNITED STATES SPURIOUS STATISTICS AND THE CONSPIRACY WHICH CREATED THEM.\n\nTo the Honourable Frederick T. Frelinghuysen, Secretary of State of the United States.\n\nSIR:\n\nI have the honour to enclose three copies of letters I have addressed to Sir Alexander T. Galt, G. C. M. G., High Commissioner for Canada at London, and the Right Honourable Earl Granville, Her Majesty's Principal Secretary of State for Foreign Affairs, regarding certain spurious United States Statistics used at the Halifax Fisheries Commission in 1877, and a reported slander respecting their origin and use.\n\nIn furnishing you with these copies it is proper that I should briefly point out the leading features of a portion of the spurious Statistics, the actual use made of them, and the nature of the conspiracy they illustrate.\n\nIt is equally necessary for me to say that I had no knowledge of the existence of these spurious United States Statistics, as they occur in the Annual Reports of Commerce and Navigation under examination in Boston during part of June 1881. I may add that this discovery, which is the result of my own unbiased investigation, has enabled me greatly to enlarge the list of fabrications in Canadian Exhibits and Records of Government outlined in the memorandum of what took place at Boston in June 1881, prepared for the information of your predecessor, and described in my communication to Earl Granville, dated Aug. 2nd, 1881.\n\nILLUSTRATIONS OF THE SPURIOUS STATISTICS.\n\nIf you will be so good as to turn to page 3354 of the Documents and Proceedings of the Halifax Commission you will find Table No. XIV., being \"Exports of Fish from the United States to the Dominion of Canada and to the other Provinces of R. N. America.\" This Table forms a part of the \"Statistics produced on behalf of the United States.\"\n\nAn inspection of this Table reveals remarkable annual differences between the Foreign and Domestic Exports of Fish from the United States to Canada. The most notable instance occurs in the year 1873. The exports of Foreign Fish to Canada are given as amounting to $83,927, while the Domestic exports reach $6,452 only, both in striking contrast to the ratios of preceding and subsequent years.\n\nTurning to the United States Commerce and Navigation Report for 1873 we find on pages 218, 219, 220 and 311 the following figures arranged in Table A. To these are added the sums of the exports to Provinces comprehended within the Treaty of Washington.\n### TABLE A\n\n**YEAR 1873**\n\n**UNITED STATES DOMESTIC FISH EXPORTS**\n\n| U. S. Annual Report | Fish—Smoked | Fish—Fresh | Fish—Pickled | Others |\n|---------------------|-------------|------------|--------------|--------|\n| Commerce and Navigation, 1873. |             |            |              |        |\n| Nova Scotia and New Brunswick | 76 | 8 | 2144 | 1712 |\n| Quebec, Ontario, Manitoba, &c. (1) | 44 | 108 | 32 | 2564 |\n| British Columbia | 353 | — | 3 | 3263 |\n| Newfoundland, Pr. El. Is. and Labrador, British W. Indies and British Honduras | 17,971 | 174 | 6530 | 7894 |\n| British Guiana | 2,614 | — | 258 | 3398 |\n| Total | 17,971 | 174 | 6530 | 7894 |\n\n(1) The \"A.C.\" includes Rupert's Land and the North-West Territory.\n\n### UNITED STATES FOREIGN FISH EXPORTS\n\n| Herring | Mackerel | Sardines, &c., in oil | All others | Total |\n|---------|----------|----------------------|------------|-------|\n| Nova Scotia and New Brunswick | 5204 | 5894 | 350 | 1553 | 16001 |\n| Quebec, Ontario, &c. | — | — | 1188 | 1338 | 2526 |\n| British Columbia | — | — | — | — | — |\n| Newfoundland, &c. | 1863 | 1884 | 280 | 3452 | 809 |\n| British Guiana | 210 | — | — | — | — |\n| Total | 822,531 | 59,114 | 10,652 |\n\n### SUMMARY FROM THE FORMER TABLE\n\nTotal U. S. Domestic and Foreign Exports to Nova Scotia and New Brunswick | 822,531 |\n| Quebec, Ontario, Manitoba, &c. | 59,114 |\n| British Columbia | 10,652 |\n| Total U. S. Domestic and For. Exports to Provinces named | 832,297 |\n\nThese totals are exactly the same as those given in the Comparative Table on page 428 of the Monthly Reports of the Commerce and Navigation of the United States for the year 1874, and having taken from the figures given above, the additions are all correct. Now let us analyze the figures.\n\n**First.—** The sum of the Domestic and Foreign Exports of the United States to Quebec, Ontario, Manitoba, &c., in 1873, according to the foregoing Table A and the table published in the Monthly Reports for 1873, page 428, amounts to $899,114. But this sum is also made up of other items taken solely from United States Domestic Exports to all British America, including the West Indies and British Guiana, as represented in Table A. This will appear from an inspection of the following Table B.\n\n### TABLE B\n\n| United States Exports to Quebec, Ontario, Manitoba. | $6,600, Fish Dried and Smoked. |\n|---------------------------------------------------|--------------------------------|\n|                                                  | 18,890, Fish, Fresh.           |\n|                                                  | 2,354,000, Other Cured.        |\n|                                                  | 49,056,840, Oysters.           |\n|                                                  | $51,536,000                    |\n\n| British West Indies | $17,971, Fish Dried or Smoked. |\n|---------------------|--------------------------------|\n|                     | 6,530, Pickled.                |\n|                     | 7,894, Other Cured.            |\n|                     | 3,801, Oysters.                |\n|                     | $36,196                         |\n\n| British Guiana | $2,614, Fish Dried or Smoked. |\n|----------------|--------------------------------|\n|                | 258, Pickled.                  |\n|                | 338, Other Cured.               |\n|                | 1,642, Oysters.                 |\n|                | $4,852                          |\n\n| Nova Scotia and New Brunswick | $76, Fish Dried or Smoked. |\n|--------------------------------|----------------------------|\n|                                 | 2,144, Pickled.             |\n|                                 | 1,712, Other Cured.         |\n|                                 | 2,598, Oysters.             |\n|                                 | $8,530                       |\n\nAdding the sums of these U. S. Domestic exports of fish to North and South British America, we get the value of the total U. S. Foreign and Domestic Exports to Quebec, Ontario and Manitoba as shown in summary from Table A.\n\n$899,114.\n\n**Second.—** The sum of the Domestic Exports of the United States to Nova Scotia and New Brunswick is $6530, and the value of Domestic U. S. 'Fish Pickled' exported to Br. W. Indies and Honduras is also $6530, as shown in Table A.\n\n**Third.—** The sum of the Domestic and Foreign Exports to British Columbia is $10,652. But this amount is also made up of the following Domestic Exports taken from figures in Table A:\n\n- 27,894, Fish, other cured, to Br. W. Indies and Honduras,\n- 2,598, Oysters, to Nova Scotia and New Brunswick,\n- 108, Fresh Fish, to Ontario, Quebec, &c.,\n- 52, Pickled Fish, to Ontario, Quebec, &c.\n\n$10,652.\n\n**Fourth.—** The Foreign Exports of the United States to Nova Scotia and New Brunswick amount to $16,001. But this sum is likewise made up of the following Domestic Exports to different countries given in Table A:\n\n- Fish, other cured, to Br. W. Indies………………….$7,894,\n- Pickled, to do………………………………………..6,530,\n- to Newfoundland……………………………………..1,571,\n- Dried or Smoked, to Quebec, &c……………………..6.\n\n$16,001.\n\n**Fifth.—** Similarly, the Domestic item before enumerated—\n\n- Fish, other cured, to Br. W. Indies………………….$7,894,\n\nis made up of the following mixed Domestic and Foreign Exports—\n\n- $6,530, Exports to N. S. and N. B. or Fish Pickled, to Br. W. Indies,\n- 989, All others, to British Guiana,\n- 258, Pickled, to do, do,\n- 108, Fresh, to Quebec, &c.,\n- 6, Dried, to do,\n- 3, Pickled, to British Columbia.\n\n$7,894.\n\n**Sixth.—** The Domestic item, $17,971, 'Dried or Smoked Fish,' to British West Indies, and the Foreign item $17,929, 'fish—all others,' to Quebec, &c., may be thus compared, being made up of mixed Domestic and Foreign and wholly foreign items, all in Table A.\n\nArranging symmetrical commercial acids in soldered designs is inevitable. The demand...\n$17,951...$16,604 Foreign Exports to N. S., and N. B., 1,338 'all others' to British Columbia, 258 Fish, Pickled, to British Guiana, 210 Herring to Nova Scotia and N. B., 76 Dried Fish to Nova Scotia and N. B., 52 Pickled Fish to Quebec, &c.\n\n$17,951.\n\n$17,929...$16,604\n\n1,338\n\n360 Sardines to N. S., 210 Herring to British Guiana.\n\n$17,929.\n\nSeventh.—Similarly the Foreign Item $20,597 Sardines in Oil, exported to Quebec, Ontario, &c., is made up of the mixed Foreign and Domestic Items—\n\n$17,929 'all others' to Quebec, Ontario, &c., 6,530 Domestic Exports to Nova Scotia and N. B., 4,892 Fish to British Guiana, 280 Sardines to R. W. Indies, 6 Dried Fish to Quebec.\n\n$22,557.\n\nShould any doubt remain in the mind of any one respecting the manufacture of these Tables of Domestic and Foreign Exports of fish from the United States to all British Dependencies in North and South America, let him take the value of the Foreign Exports of the United States to Nova Scotia and New Brunswick. These amount to $16,604, being made up of the following details:\n\n- $5,390 Sardines\n- 1,553 Fish all other\n- 5,204 Herring\n- 5,894 Mackerel\n\n$10,001\n\nPut $16,604 is also made up of—\n\n(1) $7,894 Fish other cured to British West Indies,\n(2) 6,530 Fish pickled to \" \"\n(3) 1,571 Fish pickled to Newfoundland.\n(4) 6 \" dried to Quebec, &c.\n\nTotal, $16,604\n\n(1) And $7,894 'Fish other cured to British West Indies' is made up of—\n\n- $6,530 Fish pickled to British West Indies.\n- 989 Fish others to British Guiana.\n- 258 Fish pickled to \" \"\n- 106 Fresh fish to Ontario and Quebec.\n- 6 Smoked fish to \" \"\n- 3 Pickled fish to British Columbia.\n\n$7,894\n\n(2) And $6,530 'Fish pickled to British West Indies' is made up of the U. S. Domestic Exports to Nova Scotia and New Brunswick, namely—\n\n- $7,894\n\n(3) And $1,571 Fish pickled to Newfoundland is made up of—\n\n- $989 Fish all others, to British Guiana.\n- 350 Sardines to N. S. and N. B.\n- 174 Fresh fish to R. W. Indies.\n- 52 Pickled fish to Quebec, Ontario, &c.\n- 6 Smoked fish to \" \"\n\n$1,571\n\nArranging the foregoing items in order, they furnish the following symmetrical details which no one can say are the result of commercial accident, or blundering, or carelessness; but the conclusion is inevitable, that they are the result of practical and well considered design.\n\nThe denominations are omitted for the sake of brevity.\n\nIn a similar manner the total Foreign and Domestic Exports of the United States to Nova Scotia and New Brunswick, can be shown to be made up of a still larger number of items in the same table, at least twenty in number, and including exports to R. W. Indies and British Guiana.\n\nThe exports of Sardines and Anchovies preserved in oil, are more complex still in their details and very suggestive.\n\nTABLE C.\n\nWhen we turn to the comparative table in the U.S. Monthly Report for 1874, page 428, we find the total importations of fish from the United States by Quebec, Ontario and Manitoba, according to Canadian accounts, amount to $265,832. The total exportations of fish from the United States to the Dominion of Canada are given in the supplementary table, page 428, in the same report, under the Monthly Reports for 1874, page 428, as amounting to only $132,207, according to United States accounts, being just about half of the Fish Imports from the U. S. of Quebec and Ontario alone, according to Canadian accounts.\n\nMultiply $132,207 by 2 it equals $264,594, which differs from $265,832 by $1238, the double of $619. But according to table A taken from the U. S. Commerce and Navigation Returns for 1873, $1238 is made up of—\n\n- $890 Fish all others to British Guiana.\n- 240 Herring to British Guiana.\n- 6 Dried Fish to Quebec, Ontario, &c.\n- 3 Pickled Fish to British Columbia.\n\n$1238.\n\nAnd $619 is made up of—\n\n- $450 Oysters to Newfoundland, &c.\n- 108 Fresh Fish to Quebec, Ontario, &c.\n- 52 Pickled Fish to Quebec, Ontario, &c.\n\nTotal, $619\n\nThis coincidence is so remarkable and improbable that by itself it suggests manipulation of the figures, but when it is added to preceding illustrations all doubt is removed. In various other ways the interchangeable Items are recognized, and seem to serve over and over again. I have another illustration of perfect agreement between United States and Canadian Fish Figures on a large scale; it is too long to be introduced, but it is of startling character.\n\nWHALE AND FISH OILS.\n\nTurning to the comparative table on page 427 of the U.S. Monthly Reports for 1874, we find the \"Whale or Fish Oil\" items for 1873, outrageously false in their representation of Canadian Imports from the United States, alleged to be taken from Canadian accounts. The United States exports of \"Whale or Fish Oil\" to Canada are correctly given. But the corresponding table has been added to the Canadian statement of Whale and Fish Oils, \"Oils in any way unrefined,\" \"Oils crude\" and \"Oils of all kinds crude,\" thus swelling enormously the discrepancies in this comparative table. The significance of this misrepresentation lies in the fact that the artifices employed to swell the discrepancies in the statements made are precisely the same as those employed in the REVERSE direction in the Canadian Exhibits of the ensuing two years, as attested in evidence at Halifax in 1877. The United States comparative table was not submitted in evidence by the United States, but the conclusions drawn from manufactured discrepancies in United States Documents were openly used on the British side under peculiar and very noteworthy circumstances which may be presented at the proper time.\n\nOBJECT OF THE FRAUDS.\n\nOne object of all this deception has relation to the important\nquestion concerning the value of the remission of duties, by the Treaty of Washington. It must be borne in mind that the Commission did meet together at the close of 1873 or early in 1874. The British Agent, Mr. Rodger, came out for the purpose; the Honourable Peter Mitchell, the Dominion Minister of Marine and Fisheries was provisionally appointed British Commissioner. The use of the spurious statistics of 1873 in 1877, when the Commission did meet, is shown in the \"Documents and Proceedings of the Halifax Commission\" of which one illustration may be here given.\n\nUse of the Frauds.\n\nYou will find on page 1880 of these Documents the figures taken from the U.S. Report on Commerce and Navigation for 1873. These spurious figures are used as the basis of argument against the United States schedule of the revenues or duties. The mackerel $178,328, there given in the table at the bottom of the page, is also found at the foot of the column on page 311 of the U.S. Commerce and Navigation Report for 1873. This column involves the item:\n\nNova Scotia and New Brunswick, Mackerel........$5,894,\n\nwhich is also found in Table A. But reference to the Exports of 1873 in Table A, shows that this amount of dutiable mackerel is made up of:\n\nExports of \"Fish all others\" to Nova Scotia and N.B., $4,553,\n\" \" \" \" to British Columbia, 1,338,\n\" \" Fish Pickled to \" \" 3.\n\n$5,894.\n\nSimilarly, the column on page 311 of the U.S. Commerce and Navigation Report for 1873 involves dutiable Herring, $5,204, which is part of the amount $81,775 in the quoted table on page 1880 of the Doc. and Pro. of the Halifax Commission.\n\nBut $5,204 is made up of the following items with which it is grouped in table A of exports of 1873:\n\n$2,144 Fish, pickled, to Nova Scotia and New Brunswick,\n2,614 Fish, smoked, to British Guiana,\n338 Fish, other cured, \" \"\n108 Fish, fresh to Quebec, Ontario, &c.\n\n$5,204.\n\nAgain, the item \"All other $213,534\" in the table given on page 1880 of the Documents and Proceedings of the Halifax Commission, is found by reference to page 311 of the U.S. Commerce and Navigation Report for 1873 to involve the item:\n\n\"All other\" Quebec, Ontario, &c., $17,929\n\nThis has already been shown to be made up of various other compound fish items named in Table A. But Table A is spurious from beginning to end, and the value of the argument based upon another table which involves its spurious figures will now be understood.\n\nIt is clear that the entire table on page 311 of the U.S. Commerce and Navigation Report for 1873 is wholly unreliable, because it involves the spurious items, seventeen in number, which are found in Table A. These have been shown to possess the honestly impossible commercial quality of being mutually interchangeable as regards their respective values in dollars, and yet representing Export of different things to many separate countries. They are commonly manufactured, and are not the result of legitimate commercial operations, or Records.\n\nSardines and Anchovies.\n\nIt will be noticed that \"Sardines and Anchovies, preserved in oil or otherwise,\" which form by far the largest item of the Foreign Fish Exports of the United States to any of the British American possessions, according to the table on page 311 of the \"Commerce and Navigation Reports for 1873\" are not included in one of the tables on page 1880 of the \"Documents and Proceedings of the Halifax Commission,\" and on which table the argument relating to the remission of duties is in part based.\n\nThis special exclusion has afforded a clue to perversion it would not be fitting at present further to describe.\n\nImport Statistics.\n\nI have limited myself in this communication to illustrations of spurious U.S. Export Statistics. U.S. Import Statistics exhibit manipulation of a wholly different type, but of kindred character to Canadian misrepresentations, through the agency of purporting concerted action in executing it. A similar observation applies to misrepresentations in the United States Commerce and Navigation Reports in other years besides 1873. I have furnished an illustration on pages 34 and 35 of the enclosure No. III. and in enclosure No. IV.\n\nCONCLUSION.\n\nTo cut a long subject short, the United States Fish and Fish Oil Statistics of trade are very largely cooked and misrepresented for the year 1873 (to which I confine myself at present) in United States Official Documents.\n\nThe officious complacency in the cooking process are similar to the artifices adopted in the manufacture of the Canadian spurious Exhibits and Statistical Statements outlined in a communication to the Right Honourable Earl Granville, dated August 2nd, 1881, and the documents referred to in that communication. A copy of that communication was duly transmitted by me to your predecessor,—and it is now officially transmitted by the Right Honourable the Earl of Kimberley, the Canadian Secretary of State, the receipt of which was duly forwarded to me. See Enclosure No. V.\n\nThe results of this reciprocal cooking of the Public Documents of both countries dovetail into one another, and irresistibly appear, as used, to be wholly destructive of the vantage ground which a correct representation would furnish the United States in a discussion respecting the remission of duties and kindred subjects, under the provisions of the Treaty of Washington.\n\nTherefore, from these features alone, and quite irrespective of further available evidence, a conviction of participation in conspiracy against the interests of the United States, by certain of its own officers is unavoidable.\n\nApart from the obligation under which I am now placed of addressing you, Sir, which the failure of my recent visit to England has imposed upon me, as specified in my letter to Earl Granville, I have always known that the efforts which have been made in certain quarters to avoid or deter full and open inquiry into the Fishery Frauds, have been designed, not merely to screen dishonourable dealing of atrocious character, but to shelter a slander which may be powerfully revived and used when the opportunity for refuting it is past. Meanwhile this slander continues to be a barrier for pecuniary gain and advancement, regardless of the interests, direct and mutual, of governments of the Governments and people of the United States, the United Kingdom, and the provinces of Canada.\n\nAnd it becomes my special duty, possessing knowledge of the subject through unaided discovery, in the just performance of appointed work, and in the exercise of opportunities for inquiry, that I should not fail to use all proper methods to oppose the unscrupulous attempt to employ similar knowledge for corrupt purposes, and much injurious to unimpeachable honour.\n\nI trust that you will not be disposed to consider that I am wanting in respectful consideration or bearing if I venture to give publicity to this communication, in consequence of the measures taken by the Canadian Government, and the public interest of the subject.\n\nI have the honour to be,\n\nYour obedient servant,\n\nHENRY YOULE HIND, M.A.\n\nCompiler of the Analytical Index to the Documents of the Halifax Fisheries Commission.\n\nWindsor, Nova Scotia, October 16th, 1882.\n\nENCLOSURES—Number I. to VII.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_94578.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 21212, "total-output-tokens": 14216, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1557, 2], [1557, 4034, 3], [4034, 4034, 4], [4034, 12302, 5], [12302, 21814, 6], [21814, 32848, 7], [32848, 39607, 8], [39607, 42073, 9], [42073, 47948, 10], [47948, 53611, 11], [53611, 60837, 12], [60837, 60837, 13]], "primary_language": ["en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, false, false, false], "is_diagram": [false, false, true, true, false, false, false, false, false, false, false, false, true]}}]