[{"id": "c5e70a19ab719f511006a422b34c15e9c8e8b3bc", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThis Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\n☐ Couverture de couleur\n\n☐ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\n☐ Encre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\n☐ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nThe following checks indicate special features of the original which may require special attention in filming.\n\nOrignal contains full page maps, charts, tables, etc., which have been reproduced below at a reduced size so they may be readable, but which are too large to be reproduced in their original size.\n\nOrignal contains elements such as pull quotes, which have been removed from reproduction.\n\nThe following checks indicate special features of the original which may require special attention in filming.\n\nMark the appropriate box if the item contains different sections or parts (e.g., I, II, III... A, B, C...).\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —— (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec la plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont le couverture en papier est imprimée sont filmés en commençant par le premier pli et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second pli, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nBelleville, Ont., May 12th, 1880.\n\nTo the Deputy of the\nMinister of the Interior.\n\nOTTAWA,\n\nSir,—My attention has been called to certain correspondence which appears in a recent copy of The Field newspaper relative to the respective claims of Minnesota and Manitoba as a field for emigration. The question is so important at the present juncture, in view of the extensive emigration likely to take place from Great Britain, that all reliable information on the subject should be collected and disseminated, and I therefore venture to submit the following observations which may, if you think proper, be made public.\n\nAs a resident in Canada for thirty years, who has more than once traversed the country from the Atlantic to the Pacific, and who knows the relatively small Province of Manitoba, the vast expense of fertile lands of the Great North-West beyond, as also a very great part of the north-western portion of the United States, I claim to be in a position to throw some light upon those points which the correspondents, either from hasty conclusions, or from telling only that which tends to bear out their particular views, or from want of sufficient knowledge, have somewhat hazily brought before readers of the journal in question.\n\nI find in a letter, dated 5th April, that one correspondent, in speaking of Manitoba, says—\"The capital of Manitoba is within reach by rail, and, except when roads are heavy in spring, a settler can, with his wagons and carts, reach the confines of the Province in two or three days,\" &c., &c. Another correspondent, under date of the 15th April, contributes an article from the Mark Lane Express, in which are many quotations from letters by Mr. Weld, editor of the Canada Farmers' Advocate, and a woodcut indicative of the difficulties of travelling in Manitoba is reproduced. Regarding that representation, I would say that it is a truthful picture, in part, that what Mr. Weld says he saw is true, and that at certain seasons the roads in the vicinity of Winnipeg are simply horrible. But, at the same time, while admitting these facts, permit me to say that there is another side to the picture, which I can, perhaps, best illustrate by a brief recital of some of my extensive experiences of travelling there. On the evening of the 4th June of last year I left Toronto for Winnipeg, intending to spend six months in the interior of the Territories examining the country. I reached Winnipeg on the 8th June, and found the roads in that vicinity in splendid condition. On the same evening I drove out to the furthest point that Mr. Weld reached (nine miles from Winnipeg) in less than an hour, over a level and hard highway—a simple beaten track, with neither broken stone nor gravel, to entitle it to the name of road. It consisted merely of the rich prairie soil without the covering of grass, and was therefore only a dry-weather road. As the usual summer rains were expected to commence at any time, I hurried my preparations to be off, but the rains commenced the next day, late in the afternoon. In less than an hour vehicles passing through the streets of Winnipeg and along the roads spoken of were lifting the rich black earth in great flakes, and the reign\nof mind spoken of above had commenced. But, fortunately for Manitoba, the rain that closes one mode of travelling opens up another, and, in place of following the road, I determined to proceed by the Assiniboine, as steamboats were then navigating it as far west as Fort Ellice, 220 miles from Winnipeg. I purchased immediately five months' provisions, horses, carts, harness and all other needed articles. Seven days after leaving Winnipeg I reached Fort Ellice with all my material. During the seven days I was on the boat the rain fell almost without intermission. In sixteen days from Toronto I had reached a point 220 miles west of Winnipeg and fifty miles beyond the outer settlements.\n\nAt the time I left Winnipeg, no man with the least claim to common sense would have travelled by the roads, when the steamboats were running every day to Portage La Prairie, sixty miles west of Winnipeg. The plain of Manitoba is easily affected by wet weather; but beyond the confines of the Province—about 109 miles from Winnipeg—the second prairie level is reached, and for 700 miles there stretches a country rich and productive beyond belief, and which offers no impediment to travel. The lands here are still in the hands of the Government, and incoming settlers have nothing to do but to plough and reap. Last year many of the settlers who arrived during May broke up the prairie, and raised excellent crops the same season on this drier and more elevated plateau. All the land west of the Manitoba plain will produce good crops the same year as it is broken up, as hundreds of settlers proved last year, the sod on the higher plain not being so tough as that farther to the east. Last November I saw numbers of settlers who came to the country in May, and raised all the grain and roots they would require for the winter.\n\nMy reason for making special mention of Fort Ellice is to fix a point easy of access, from which settlers can go in any direction and get good and suitable locations, without the fear of bad roads, or a deficiency of wood or water. When lecturing before the Historical Society of Winnipeg last winter, I described a tract containing 16,000,000 acres of first-class land radiating from this point as a centre, and told my audience that as soon as this tract was filled, I was prepared to give them a further instalment. I was then convinced that settlers would flock to this region on the opening of navigation, and such has turned out to be the fact, and two lines of steamers are now plying on the river to accommodate the traffic.\n\nRegarding the climate of this tract, I may say that we picked abundance of ripe strawberries on the 16th June, when ascending the rivers; and about 120 miles west of Fort Ellice, at Qu'Appelle, barley was cut and stacked last year by the 27th July. This is no exception, as I found barley harvested on Peace River, in latitude 59° 24', longitude 116°, on the 6th August, 1875. These two points are over 1,000 miles apart, but the summer climate is almost the same. Of the Red River Valley I have little to say, as there the greater part of the Government lands are already disposed of, but would advise intending settlers to see the country west of Manitoba for themselves before making up their minds for any particular locality, and not turn back (like some men I know) until they stand on the beautiful prairie beyond the bounds of that Province, and see, at least, the portals of the vast country that extends without a break for 700 miles. West of this point I never saw a man who was dissatisfied with his location, or who did not think his ground was the best in the Territories.\n\nOne of the correspondents, speaking of prices, quotes what they were two years ago. To show the changes brought about even in one year, I may state what they were in 1879, when I bought flour in Winnipeg at $2.75 (11s. 6d.) per 100lb., and contracted with Captain Moore, of Prince Albert, for flour delivered at Battleford, 600 miles in the interior, at $4.50 (18s. 6d.) per 100lb. Pork cost in Winnipeg 11½c. (5½d.) per pound, but, outside of that city, beef was nowhere over 10c. (5d.) per pound. One and a half cents per pound was charged for freight between Winnipeg and Fort Ellice. From the above any emigrant can tell exactly what it will cost to place him on the western limits of the settlements, with the whole land before him.\nOne word as to intending settlers. If they are afraid of mosquitoes, mud or work, they had better stay at home, as people of that sort are altogether unsuited for the West. Mosquitoes and mud are two of the drawbacks peculiar to all new countries blessed with rich alluvial soil, but both disappear to a great extent as settlement and cultivation progress. Those who fear to face such temporary annoyances should neither go to Minnesota nor Manitoba, which are both equally affected by the drawbacks mentioned. Many have encountered and overcome these difficulties, and, from my experience, I can truthfully say that none but idlers and cowards fail.\n\nOne of The Field's correspondents scoffs at the idea of Canadians and Americans exchanging the products of their farms and being mutually benefited by so doing, and says—\"I was not aware, prior to reading the above, that British North America, under the fostering care of the Dominion Government and the 'National Policy,' and the United States with their Protective Policy, were setting an example to the world in the matter of reciprocity.\" The same gentleman states that maize cannot be grown in Manitoba, and attempts to make a point in that connection by ridiculing the idea of exchanging products. Does The Field's correspondent think that Americans would raise maize if they could do better by raising wheat? Does he not know that in Iowa and Nebraska everything, from the stove which warms the farmer's children and cooks the corn cake for his breakfast, to the lowest animated thing around his home, is fed on maize? Does he not know that farmers in Northern Minnesota and Dakota, as well as in Manitoba, do not raise maize or fall wheat? Does he not know that sensible men raise what pays best, and that the corn States of Illinois and Indiana are in no sense equal to the wheat States of Minnesota and Manitoba? Yet, in the face of these facts, he condemns Manitoba because raising fall wheat there is still an experiment, and either forgets, or does not care to state, that to raise maize where other crops would pay better would be foolishness. Need I tell him that fall wheat is never raised on the prairies of Minnesota, and that corn, as a farm crop, is not thought of except where the soil is sandy?\n\nRegarding exchanges, it is worth while to mention that along the north shore of Lake Ontario we cultivate immense quantities of barley. This barley is largely grown for the American market, and, although the American Government impose an import duty on it, not less than 3,000,000 bushels a year are shipped across the lakes at an average price of nearly a dollar a bushel. It may be inquired why the Americans buy this grain? The answer is, to mix with their poorer samples, so that American malt may find ready sale in the European market. After disposing of their barley, our farmers buy such quantities of American maize as they may require for cattle feed, at an average price of less than 60c. per bushel. The transaction stands thus: We sell to the Americans 48lb. of barley for 100c., and, when we want it, buy back from them 100lb. of maize for the same money. In other words, we make a clear gain of 52lb. weight of food for our cattle and pigs out of every bushel of barley we exchange. The Manitoba barley is even better than the barley of Ontario, and the increasing population of the Western States is constantly demanding more malt, so that but a very few years will elapse before the same system of exchange will be in operation there. Maize-growing, therefore, on superior soil such as we have, is not to be thought of by the farmer.\n\nAs one of The Field's correspondents has introduced Mr. Weld's name into the discussion, and quoted from him, I shall take the liberty of doing the same.\n\nIn the very article from which the The Field's correspondent quotes, Mr. Weld says:—\n\n\"We cannot convey a correct idea in the small space that we can occupy in one or two issues of this journal; it will take some months to complete our observations on our first trip, which took place in June, generally the wet month in Manitoba, and this season\nit happened to be unusually so. We returned to our office on the 8th July, having been away just four weeks. We saw wheat growing most luxuriantly; it was looking better than the majority of wheat fields we have seen in Ontario. We heard many farmers there, who had taken up lands, speak most favorably of their prospects; many preferred the climate and soil to that they had left in Ontario. Those that were engaged in mercantile pursuits were doing well, and hotel-keepers were doing a good business. Many emigrants were preparing to go into the country to their several destinations.\" Then follows what The Field has already published, after which Mr. Weld informs us why he turned back. \"We went nine miles out of Winnipeg on the main Portage road. This is the road on which most of the travel is done to and from Winnipeg. The rains again descended, and the roads were in too bad a state to induce us to go further. We turned and made back tracks.\" Then follows the illustration. If the readers of The Field had all the facts before them, they would have no difficulty in understanding why Mr. Weld wrote so strongly about mud, water, and all those other terrible things of which he speaks. There are lions in the way, but the man who boldly faces them will always find they are chained.\n\nExcuse me if I now give you one or two more extracts from Mr. Weld's journal:\n\n\"The Canadian Wheat Garden.\n\n\"We have more than once spoken of Canada as the great wheat-growing region of the future, and that future not so distant as some may think. On this subject a New York journal says: 'Supposing the Canadians are right about the extent and richness of their wheat-growing territory in the North-West, the mind recoils from a computation of its productive capacity. Man has never before contemplated such an agricultural feat. Should the enormous Canadian wheat garden be successfully cultivated, its annual crop in future years would come into the business and interests of the entire globe with a revolutionary force and masterly power hitherto unknown to finance and trade.'\n\n\"Our anticipations of the future of our country are no mere speculation. They are based on accurate mathematical deductions. Canada is destined to be the gem of Europe.\"\n\nMr. Weld writes thus in January of the present year, after he had had time to consider in calmness and properly appreciate his experiences of Manitoba, and when the results of some personal discomfort and disappointment had ceased to prejudice his judgment. Need I say that I know the above statements to be true? I have found the country better than the most sanguine anticipated, and have not merely said so, but proved my case. England, in Canada, possesses a country that would make her independent of the world. We can, if need be, raise in the future all her hemp, flax, beef and wheat, and still have immense tracts of land untouched. Let any person turn to the productions of Russia, and then compare the position of our North-West with it. Then let him consider that over 300,000 square miles of territory we have a summer temperature ranging from 65° F. in Lat. 49° to 61° F. in Lat. 62°, and state whether my estimate of 150,000,000 acres of land fit for raising stock and grain is too high. I know the country better than any other living man, and I feel it my duty, in the interests of Britain, to say to those whose patriotism is not a mere sentiment, that England's future is more intimately connected with Canada than to-day appears on the surface.\n\nIn the December issue of Mr. Weld's journal, I find the following:\n\n\"Manitoba Wheat.\n\n\"It was not expected that the United States millers would find it necessary to import wheat in this year of unprecedented abundance in the Western world, yet such is the\nThe millers of Iowa and Southern Minnesota are competitors with those of Quebec in the markets of our Prairie Provinces.\n\n\"The States have had abundant crops, enough to meet all the demands of Europe; but the wheat south of the northern wheat belt is not equal to that in our North-West, and that the flour for shipping may bear the brand A-1, the millers of Minneapolis are purchasing Manitoba wheat, that its hardness may, when mixed with that of softer wheat of a lower grade, so improve it that the American flour may pass in the highest grade. This, certainly, is very complimentary to our North-West farms and farmers. We may fairly expect that a few years will witness the fulfillment of the prediction that the great prairie lands of Canada will be the granary of the Old World, and that the teeming millions of Great Britain need not look beyond her own colonies to supply the deficiency of her home population.\"\n\nWhile in Manitoba, I had many conversations with leading Americans, and learned, to my unbounded astonishment, that the millers of Minneapolis and St. Paul were buying up all the surplus wheat raised in Manitoba last year; that the St. Paul and Manitoba Railway was carrying this wheat at low rates; and more astonishing still, that the American Government were actually allowing it to enter the States free of duty. Not believing the last statement, I went to the American Consul at Winnipeg, Mr. J. W. Taylor, and asked him if it were true, and he replied in the affirmative, explaining that the millers gave him a bond that the wheat was bought for export, and the American Customs Department authorized the remission of duty.\n\nTo Englishmen these facts should suffice to establish beyond question the superiority of Manitoba wheat over any grown in the States. I enclose a copy of the Toronto Globe, of the 4th inst., in which you will find a paper on the Physical Phenomena of Manitoba and the North-West Territories, in which the peculiar climate of the region is fully discussed, and the causes of this hardness of grain accounted for. In the above paper, I have embodied the conclusions of many years of study and observation, and am fully satisfied of their accuracy.\n\nI would wish to draw the attention of Englishmen to the fact that those who write disparagingly of our North-West belong to one of three classes:\n\nThe first class is purely mercenary, but full of energy and ability, and ready to take advantage of every opening to forward the interests of the gigantic land and railway monopolies of the United States, which take care to select and can afford to pay for able men. These men, either by their weak praise or unfair comparisons, do much to injure Canada and exaggerate the quality and productiveness of the inferior lands of the United States.\n\nThe second class are not fit for pioneers; they never should have left their birth place. They are not the men to carve out homes in any new country. Mosquitoes, mud and work are too much for them, and therefore they are out of their element in the West.\n\nThe third class are those persons who, from unworthy motives, will to-day disparage a fair and fruitful land which yesterday they highly praised, and to-morrow would do so again if, for the moment, it appeared to serve a passing purpose. This class, I am happy to say, is not a large one, and they are despised by all who know them.\n\nYours faithfully,\n\nJOHN MACOUN.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30694.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 17244, "total-output-tokens": 5519, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2302, 3], [2302, 4741, 4], [4741, 7957, 5], [7957, 12340, 6], [12340, 16464, 7], [16464, 20234, 8], [20234, 23649, 9], [23649, 23649, 10]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, true]}}]