[{"id": "985c64ae8c52d572f3c9ca0cc0b394b4a1ce4302", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X |     | 24X | 28X | 32X |\n\nThe item is complete and not missing pages.\n\nThe item contains maps, charts, graphs, pictures, etc., which may be filmed separately.\n\nOriginal pages begin prior to first image shown, are filmed separately, or first image shown is not part of the first page shown.\n\nMaps and/or plates may be separated and filmed separately.\n\nThe item is not suitable for microfilming because of its condition.\n\nThe item is not available for filming.\n\nThe item is filmed at the reduction ratio checked below/TINU filmé au taux de réduction indiqué ci-dessous.\n\nMaps and/or plates may be different sizes and may not begin on facing pages. This right is required for all methods.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nREPORT\n\nOF\n\nCOLONEL ROBERTSON-ROSS,\n\nAdjt.-General of Militia,\n\nON THE\n\nNorth-West Provinces and Territories\n\nOF THE DOMINION.\n\nOTTAWA:\n\n1872.\nSir,\n\nIn reply to your letter of the 15th instant, I have the honor to inform you that the company has been engaged in the construction of a new railway line.\n\nYours very respectfully,\n\n[Signature]\n\nBank of England\n\nThe Bank of England\nREPORT\n\nOF\n\nCOLONEL ROBERTSON-ROSS,\nAdjt.-General of Militia,\n\nON THE\n\nNorth-West Provinces and Territories of the Dominion\nfor 1872.\n\nCONFIDENTIAL.\n\nHEAD QUARTERS,\n\nOTTAWA, DECEMBER 10TH, 1872.\n\nCHAP. I.\n\nFrom Ottawa to Fort Garry via the Dawson Route.\n\nSIR,—\nI have the honor to report my return to Head Quarters from Inspection duty in the Provinces of Manitoba and British Columbia, having, in accordance with your wishes and instructions, crossed the continent through Dominion Territory to the Pacific Coast, travelling nearly the whole distance from Fort Garry on horseback.\n\nOn the termination of the Annual training of the Militia in the Provinces of Ontario and Quebec, I proceeded, in the first instance, via Lake Superior and the \"Dawson Route,\" to Manitoba.\n\nLeaving Collingwood on the 16th July in the steamboat for Thunder Bay, (Lake Superior,) the vessel reached her destination early in the\n\nThe Honorable\nTHE MINISTER OF MILITIA\nAND DEFENSE.\nmorning of the 22nd, stopping, en route, at the settlements of Owen Sound, Leith and Killarney on the shores of Lake Huron, and at Gargantua Bay, Michipicoton Island and Neepigon, on Lake Superior.\n\nOn arrival at Prince Arthur's Landing, I found that a considerable and apparently thriving settlement has already sprung up at that place.\n\nThe population including the employés of the Department of Public Works, now numbers about 500; many good houses have been erected, and Municipal Government has been established.\n\nThunder Bay is one of the best and safest harbours on the north shore of Lake Superior, and the surrounding scenery is very beautiful.\n\nAt present, for want of a proper wharf, considerable inconvenience is experienced, but as the one now in course of construction will probably be completed next spring, the landing facilities will then be greatly improved, and be all that is likely to be required for some time to come.\n\nOwing to the great mineral resources and valuable silver and copper mines which exist in this neighborhood, and from the excellence of its harbour, it may reasonably be expected that a wealthy and important settlement will, ere long, be established at Thunder Bay.\n\nF. Prince Arthur's Landing I proceeded on the 22nd July, by waggon, in one day, to Lake Shebandowan, a distance of about forty-five miles, by what may now be fairly considered a good road.\n\nAll the streams have been bridged, and a very substantial structure is erected across the Matawan.\n\nWhen this road shall have been macadamized throughout its entire length, which will probably be effected next summer, it will be as good a one as can be desired.\n\nThe country through which the road passes from Lake Superior to Shebandowan is well wooded and much better suited for settlement than is generally supposed. Although the soil in the immediate neighborhood of Prince Arthur's Landing is somewhat sandy, the greater part of the country passed through is perfectly well suited for farming and agriculture.\n\nAt the Matawan River farming operations had commenced; very fine timothy hay had already been raised at that place, and the growth of the vegetables and cereals which had been but a short time before planted, gave excellent promises.\n\nFrom Lake Shebandowan I proceeded by canoe to the North-west Angle of the Lake of the Woods in seven days, a distance of three hun-\ndred and ten miles, through the chain of inland waters known as the \"Dawson Route,\" towed part of the way by tug steamers.\n\nConsiderable progress has been made in opening up and improving this line of communication through the Dominion to the vast and important territories of the North West, and I am satisfied that if greater means could have been placed at the disposal of Mr. S. J. Dawson, much greater progress towards completing the work would have been made by that able Engineer.\n\nAt the time I passed through, there were only four steam tugs available along the whole route; and there was no steam power on many of the Lakes.\n\nThe portages, however, have been greatly improved. There were horses or bullocks with carts or waggons on nearly all. In many instances a shorter and better route than that originally followed has been adopted, and altogether it is now not only a perfectly available and valuable line of communication during the open season, but it is an indispensable work towards the settlement of the country through which it passes.\n\nAt Fort Francis two steamboats of considerable size are being built; one has already been launched, and both are expected to be finished early next spring. One of these steamboats is intended for Rainy River and the Lake of the Woods, the other for Rainy Lake. Additional tug steamers are also to be obtained, so that by next summer it is expected there will be steam power on all the waters. When this is carried out the journey from Lake Superior to Manitoba through Dominion Territory can be made in four or five days, and the transport of passengers, freight, waggons and horses by the \"Dawson Route\" effected without difficulty.\n\nFor the passage of troops, during the summer season, there is now no difficulty. In October last a detachment of 215 soldiers with two light field guns were conveyed in twenty-five days from Collingwood in Ontario to Fort Garry, in the Province of Manitoba; and by next summer there would probably be no great difficulty in conveying, if required, both cavalry and artillery, as well as infantry, in considerable numbers by the \"Dawson Route.\"\n\nThe country along the banks of Rainy Lake and Rainy River is well wooded with valuable timber, extremely picturesque, and still better suited for settlement than the country between Lakes Superior and Shebandowan. The Lakes and Rivers teem with fish, and self-sustaining settlements could be readily established there with advantage.\n\nFrom most careful enquiries it appears that the number of Indians occupying the country along the line of the \"Dawson Route,\" and who belong to the Ojibbeway tribe, does not exceed a total population of four\nthousand, of whom it is believed about eight hundred are men capable of bearing arms. Although among these Indians there may be some restless characters, they are considered good Indians on the whole, and if kindly but firmly treated, they are not likely to cause any interruption along this route, or offer opposition to the peaceful settlement of the country.\n\nDuring the past summer, the Ojibbeway tribe were apprehensive of an attack from the Sioux, their hereditary enemies, dwelling west of the Red River on the American side of the International boundary line. With a view, therefore, of preserving the peace of the country, supporting our Indian commissioner when engaged in making treaties, and for the protection of settlers, I am of opinion that it would be advisable to encamp a detachment of about one hundred (100) soldiers during the summer months at Fort Francis. This Force could be taken from the Militia now on duty at Fort Garry, returning to that station for the winter months.\n\nI would further suggest that the employés of the Department of Public Works stationed along the line of the \"Dawson Route,\" who will next summer number about four hundred (400) men, should be organized into a Militia Brigade, on the same principle as the Grand Trunk Railway Brigade, to be armed and equipped by the Militia Department; and that the offer to raise a Volunteer Company of Militia at Prince Arthur's Landing, Thunder Bay, be accepted,\n\nThe existence of such a material power along the line, would, I feel sure, prove of the greatest importance. There is no doubt that the passage of troops for the last three years proceeding to and from Fort Garry, has already been attended with the best results.\n\nFrom the North West Angle of the Lake of the Woods, I drove to Fort Garry, in Manitoba, in a waggon with two horses, a distance of ninety-five miles in a day and a half; the journey from Prince Arthur's Landing thus occupying, from want of a sufficient number of steam tugs, nine and a half days.\n\nThe road from the Lake of the Woods to Oak Point, where the Prairie commences, is now as good a one as can be found in almost any country part of the Provinces of Ontario and Quebec—from this point the ordinary carts and waggons of the country, and almost any kind of light carriage or vehicle can be driven without difficulty during the summer season, for thirteen or fourteen hundred miles across the great Prairies of the North West, through one of the most fertile and beautiful countries in the world, to the Rocky Mountains.\nArriving at Upper Fort Garry on the 31st July, I inspected the Military Force on duty there the following day, and the detachments stationed at the Lower Fort and in the Hudson's Bay Company's Post near Pembina, subsequently.\n\nThe Military Force authorized at present to be maintained on duty in Manitoba consists of three hundred men, formed into a Provisional four Company Battalion under the command of a Major, but at the time of my inspection this corps was considerably below its strength, and was divided as follows:\n\nAt Upper Fort Garry ........................................... 181 (all ranks)\nAt Lower \" ......................................................... 20 \"\nAt the Hudson's Bay Company's Post near Pembina. 42 \"\n\nTotal ................................................................. 243 all ranks.\n\nThe decrease in the strength authorized which then existed resulted from the discharge of time-expired men, but as a considerable detachment was despatched to Fort Garry from the Provinces of Ontario and Quebec in October, the number of men authorized is now complete.\n\nI am happy to report that on inspecting the battalion, I found it to be in as satisfactory a condition with regard to drill and discipline, as could reasonably be expected, considering the very short periods allowed for the enlistment of the men, and the officers' uncertain tenure of office.\n\nThe Companies stationed at Upper Fort Garry were encamped at the time of the inspection on the banks of the Assiniboine, about one mile from its junction with the Red River; the cleanliness, neatness and good order of this camp, which was occupied during the whole summer, reflected much credit on Major and Brevet-Lt.-Col. Irvine, the officer commanding the Battalion.\n\nOn inspecting the detachment at Pembina I found that there was insufficient accommodation in the small trading post of the Hudson's Bay Company at that place for the number of men there stationed.\n\nIn view of this fact, therefore, and the desirability at the time of strengthening the force at Upper Fort Garry, with the entire concurrence of the Lieut-Governor of the Province, I directed the strength of the detachment at Pembina to be reduced to 1 sergeant, 1 corporal and 12 men—and there being no necessity for keeping any detachment at Lower\nFort Garry, with the concurrence of the Lieut.-Governor, I directed the return of the party there stationed, to the Upper Fort.\n\nThe Battalion is now concentrated at the Upper Fort, and as the great majority of the men have been recently enlisted to serve for a period of three years, it may be expected that before long the corps will attain to a higher degree of military discipline and training.\n\nThe respectability of character and good conduct as men exhibited by the majority of the individuals composing the corps during the last twelve months, has been conspicuous. The soldier-like bearing and discipline displayed by the Battalion on a recent occasion when called out in aid of the civil power to quell a riot at the time of the elections, in face of an attempt, too, to seduce the men from their duty, proved it to be a corps upon which the Government and the country can rely.\n\nWith regard to the barrack accommodation provided for the Battalion in the Hudson's Bay Company's trading post, known as the Upper Fort Garry, I found it to be very inadequate, unsuitable, and generally unfit for permanent military occupation. The store buildings used as barracks for the men required a considerable amount of repair to make them fit for occupation in winter. They consist of wooden sheds, some of them mere shells.\n\nThe building used as the Officers' quarters, which originally was an excellent one, is now very old and decayed. A very considerable amount of repair is required in it,—the roof should be entirely new shingled, though it is a matter of doubt whether the building will stand such repairs.\n\nThe storage room required for military stores is very inadequate and unfit for keeping such stores with safety—and they are in eight different buildings; one good storehouse being all that is required.\n\nThe Armory in which the spare rifles and arms are kept, is very damp.\n\nA powder magazine is required—the Hudson's Bay Company's magazine is generally well filled with their own powder, and is, moreover, very damp.\n\nWhile making this report on the state of the barrack accommodation at Fort Garry, it is but due to the hon. the Hudson's Bay Company, to state that every assistance and facility in providing for the wants of the troops has been afforded by the gentlemen belonging to that great trading Company, as far as circumstances and their own requirements would admit. In very many instances they have placed themselves and their employés at no inconsiderable personal inconvenience, in order to accommodate the troops, meet the wishes of Government, and the emergencies the case.\nFor the last three years it has been found necessary to maintain a military Force in Fort Garry where only temporary accommodation, as a sort of makeshift, can be provided.\n\nThe men suffer much during the severe weather in winter from want of proper shelter and accommodation; it is difficult moreover to maintain good order and discipline among a body of soldiers when mixed up with civil employés in a Hudson's Bay trading post, and the arrangement altogether, except as a temporary measure, is very inconvenient and unsatisfactory.\n\nUnder these circumstances, provided it be in harmony with the policy of Government, I would respectfully urge that no further time be lost in taking the necessary steps to supply the Military Force required, with proper Barrack accommodation. On enquiring of the men if they had any complaints to submit relative to their pay, rations, &c., and general treatment, in accordance with my duty, they expressed themselves as perfectly satisfied with their rates of pay, scale of rations, and treatment by their officers, but invariably in the most respectful manner complained of the wretched Barrack accommodation.\n\nI feel bound to say that their complaints on this head were just, and to state that it would be only fair to meet the reasonable wants of the men on this point.\n\nAt no great expense, and with very little trouble, suitable log huts can be erected on advantageous ground, and the greater portion of the work carried out by the men themselves.\n\nThis arrangement would, I believe, eventually be found the most economical one for the country, if it be the intention to keep a Military Force in Manitoba, and it certainly is a very essential one for maintaining the efficiency and welfare of troops. Already the amount of money spent on repairing old buildings and constructing new ones in the Hudson's Bay Company's Post would have sufficed to defray the cost of providing proper Barrack accommodation in log huts for the Force stationed at Fort Garry.\n\nI would further urge, if it be the intention of Government to retain any military force on duty in Manitoba, that one hundred (100) men of the Provisional Battalion be supplied with horses and equipped as Mounted Riflemen, and as one officer and some of the men have been trained to Artillery Exercises, that these should be supplied with two of the Horse Artillery guns recently obtained from England. Thus the corps, if ever required to act, could be readily formed into a small Field Brigade, and its military power greatly increased.\n\nWith regard to the necessity for maintaining any Military Force at Fort Garry, no doubt whatever exists in my mind as to the propriety of\ndoing so, in view of the presence of many bands of Indians, considering the primitive state of society in the Province, the strong political party feeling which exists, and the fact that on both sides of the International Boundary Line restless and reckless characters among both white men and Indians, abound.\n\nIt is undoubtedly very desirable to maintain a certain number of Police Constables in the Province under the civil power, some of whom should be mounted, but I feel satisfied that the great security for the preservation of good order, and the peace of the North West Territories, under the changing state of affairs, will for some years, be found to lie in the existence and presence of a disciplined military body, under its own military rules, in addition to, but distinct from, any Civil Force which it may be thought proper to establish.\n\nWhatever feeling may be entertained towards Policemen, animosity is rarely, if ever, felt towards disciplined soldiers wearing Her Majesty's uniform, in any portion of the British Empire.\n\nIn the event of serious disturbance, a Police Force, acting alone, and unsupported by a disciplined Military body, would probably be overpowered, in a Province of mixed races, where every man is armed; to maintain a Military without any Civil Force is not desirable.\n\nI believe that a small number of Constables will be sufficient to maintain order in the Province, provided the Military Force is maintained; but that, in the event of serious disturbance, a large Police Force would be unable to do so, should the military be withdrawn.\n\nDuring my inspection in the North West I ascertained that some prejudice existed amongst the Indians against the colour of the uniform worn by the men of the Provisional Battalion—many of them had said \"who are those soldiers at Red River wearing dark clothes? our old brothers who formerly lived there\"—meaning H. M.'s 6th Regiment—\"wore red coats,\" adding, \"we know that the soldiers of our great mother wear red coats and are our friends.\"\n\nWith the view therefore of re-assuring the Indian mind, and for other reasons, I recommended a change of uniform—this has been carried out, the Militia on duty in Manitoba now wearing red coats, and the matter although apparently small in itself, will probably prove of great value and importance hereafter.\n\nOn the 8th of August I inspected the Winnipeg Field Battery, a Militia Artillery Corps recently organized and composed of citizens resident in the town of Winnipeg.\n\nThis Battery is under the command of Major Kennedy, a very zealous officer, but it has not as yet been armed.\nOn the occasion of inspection the Corps took part in a Field day brigaded with the Provisional Battalion. The Battery was armed for the day with some light Field Guns belonging to the Hudson's Bay Company, kindly placed at their disposal by the Honble. Donald Smith, M. P., chief Factor.\n\nAs soon as circumstances will admit, it is recommended that this Battery should be armed with four of the Horse Artillery Field Guns recently obtained from England, and supplied with the necessary Harness and Artillery Stores.\n\nThe Militia in the Province of Manitoba is under the command of Lt. Colonel Osborne Smith, C. M. G., Deputy Adjutant General, and it is not necessary at present to increase the staff in the Province by the appointment of any Brigade Majors.\n\n---\n\nCHAP. III.\n\nFrom Fort Garry to the Rocky Mountain House.\n\nHaving concluded the inspection of the Militia in Manitoba, accompanied by my son, a youth sixteen years of age, as travelling companion I left Fort Garry on the 10th of August for the Rocky Mountains and British Columbia with one guide only, and an Indian lad of the Saulteaux tribe, to cross the continent through Dominion Territory to the Pacific coast.\n\nThe Hudson's Bay Company provided ten horses, two Red River carts, and a suitable equipment for the party, and undertook to supply any guides, horses and provisions required en route, from the different posts in the Swan River and Saskatchewan Districts, as far as Fort Edmonton or the Rocky Mountain House; but beyond these posts they could not guarantee further progress, nor a safe passage through the country of the Blackfeet Indians, should circumstances require the adoption of that route.\n\nEvery possible assistance, however, was afforded me by the Hon. Donald Smith, M.P., and the gentlemen connected with the Company at the various posts visited, and my best thanks are due to them, not only for many acts of personal kindness and hospitality, but for much valuable information respecting the Indian tribes.\n\nAt the time of departure from Fort Garry, some doubt was expressed as to the propriety of so small a party travelling without a guard through the Indian territory, and especially through the country of the Blackfeet tribe, if found necessary to do so; and I have to thank the Government very\nmuch for the authority conveyed by your telegram to Fort Garry, to take with me, if desired, a personal escort of six soldiers from the Battalion on duty in Manitoba.\n\nOn full consideration, however, and with the advice of those best able to judge, I did not think it advisable to do so. A Military escort of only six men would be inadequate to afford protection in the event of any real danger from the Prairie Indians, and might possibly invite attack.\n\nConsiderable additional expense, moreover, would have been entailed for their transport and subsistence.\n\nProceeding from Fort Garry through the Swan River and Saskatchewan Districts, via the H. B. Company's posts of Forts Ellice, Carlton, Pitt, Victoria and Edmonton, I arrived at the Rocky Mountain House—about twelve hundred (1,200) miles distant from Fort Garry,—in thirty-one days, of which, twenty-five days only were occupied in actual travel.\n\nThe Prairie road or Cart trail extending the whole way from Fort Garry to the Rocky Mountain House, and which has been used for many years by the Hudson's Bay Company, was at that season of the year in excellent order; many of the streams have been roughly bridged by the Hudson's Bay Company's servants, and except at the crossing of the South Saskatchewan River, where we lost a whole day from the necessity of swimming the horses across, and repairing a damaged scow on which to convey over the carts and baggage, we met with very little difficulty or trouble at any time. For great distances the road led over Prairie ground almost as level as a race course.\n\nIt would be desirable to bridge the Little Saskatchewan River, Bird-tail Creek and Snake Creek, between Fort Garry and Fort Ellice, and to improve the descent to, and ascent from the Assiniboine River at Fort Ellice, as owing to the steepness of the road it is somewhat difficult to pass at this point, during rainy weather, with loaded carts. In addition to this, some repairs and improvements are desirable on the road between Fort's Pitt, Victoria, and Edmonton, and across one or two swamps near the Rocky Mountain House, but on the whole a very trifling amount of labour is all that is at present required.\n\nOn the journey from Fort Carlton to Edmonton, a distance of between three and four hundred miles, we were accompanied by the wife of our guide, (an employé of the Hudson's Bay Company,) who with her three young children travelled in a light four-wheeled canvas-covered waggon, driving the vehicle herself, nearly the whole way.\n\nIt was my intention to overtake at Edmonton, if possible, Mr. Fleming, Chief Engineer of the Pacific Railway, who had started from Fort Garry ten days before me for British Columbia and in company with him cross\nthe Rocky Mountains by the \"Tête Jaune\" Pass; on arrival at Edmonton however, I found that he had quitted that point seven days previously.\n\nAs no guides could be obtained at Edmonton either for the Tête Jaune or any other pass, it was necessary to proceed to the Rocky Mountain House, a trading post for the Blackfeet Indians, distant about 180 miles South West from Edmonton, in sight of, and about forty-five miles from the first range of the Rocky Mountains.\n\nBetween Fort Garry and Fort Ellice, a distance of 230 miles, the country is diversified and undulating, generally speaking very good and fertile. In some parts alkali lakes are occasionally met with. The open expanses of prairie are relieved with numerous clumps or patches of wood, termed \"bluffs.\" There is plenty wood suitable for fuel, or for sheltering stock. The wood consists of spruce, willows, birch and poplar, and in the valley of the Assiniboine there is a good deal of oak.\n\nThe land in the lower part of the valley of the Assiniboine, for nearly one hundred miles before its junction with the Red River, is of great richness and fertility.\n\nBetween the Western Boundary of the Province of Manitoba and Fort Ellice, the country in the vicinity of Pine Creek, the Little Saskatchewan River, Shoal Lake, Birdtail Creek, and Snake Creek, is well suited for settlement and farming purposes, more particularly for the raising of stock, but I do not think the soil, generally speaking, so well suited for wheat crops as along the lower parts of the valley of the Assiniboine and Red River.\n\nFort Ellice is situated a short distance from the junction of the Qu'apelle with the Assiniboine River, on the right bank of the latter stream.\n\nIt is well placed in a military point of view, being built on a plateau at the top of a high, steep and thickly wooded bank, about two hundred feet above the river. The river is here about sixty yards in breadth and about fifteen feet in depth. The banks are thickly wooded. The Hudson's Bay Company have erected a bridge across the river.\n\nThe Valley of the Assiniboine is depressed about 250 feet below the Prairie level, and is about three quarters of a mile in breadth.\n\nThe country around the immediate vicinity of Fort Ellice is well wooded and suitable for settlement.\n\nThe wood consists chiefly of poplar of no great size, and there is some oak.\n\nThe Fort itself merely consists of some wooden houses, built of poplar and surrounded by a stockade.\nThe Assiniboine River is navigable for good sized boats all the way from Fort Garry to Fort Ellice, and I believe much further. In spring no great difficulty would probably be experienced in navigating the river, with a stern-wheel steamer of light draught, the whole way from Fort Garry to Fort Ellice.\n\nBetween Fort Ellice and Fort Carlton, on the North Saskatchewan, lies a great extent of country—more than three hundred miles. Throughout a considerable portion of the road followed alkali lakes are prevalent, and for several days I found no good water.\n\nUpon the whole I do not consider the country between Fort Ellice and the Touchwood Hills, which are about midway between Forts Ellice and Carlton, and the country beyond the Touchwood Hills for two or three days' journey towards the North West, so well adapted for settlement as the Province of Manitoba, and the country between it and Fort Ellice.\n\nFrom that part of the country however where the \"Round Hill\" (a conspicuous object about two days' journey south of Fort Carlton,) is situated, to the North Saskatchewan River, and from thence for several hundreds of miles westward to the Rocky Mountains, the value and fertility of the country for agricultural and stock raising purposes has certainly not been exaggerated in the accounts of any travellers.\n\nThe North Saskatchewan at Fort Carlton is about four hundred yards in breadth, with a current of between two and three miles; and it nowhere exceeds that breadth upwards to the Rocky Mountains. Although there are numerous sand bars, it is navigable for large sized boats, and I believe for stern wheel steamers of light draught from within about twelve miles of Lake Winnipeg nearly to the base of the Rocky Mountains. When the river is low, steamboats probably would not be able to pass at Coal Rapids below Carlton. At the proper season of the year for navigation, however, it is only necessary, to make one or two portages the whole way from Fort Garry, on the Red River, to the Rocky Mountain House.\n\nThe land lying between the north and south branches of the Saskatchewan River, near Carlton, and for many miles to the east and West, is particularly well adapted for settlement, and the whole country along the north bank of the North Saskatchewan, extending for hundreds of miles to the westward, is very fertile and admirably adapted for settlement. There are two Half-breed settlements at no great distance from Fort Carlton—one at St. Laura, (French half-breed,) on the south Saskatchewan, about 80 miles south-west from Fort Carlton; the other, an English Half-breed settlement (Prince Albert,) 50 miles east from Fort Carlton, on the north Saskatchewan. The population of St. Laura, last year, was 68 men, 58 women and 198 children, possessing 577 horses; that of Prince Albert, 35 men, 27 women, 81 children, and 181 Indians. The population of these two settlements is probably much increased since this census was\nmade, and it is believed that a considerable number of the half-breed population in Manitoba will leave that Province next summer and move to these settlements.\n\nThe country to the south of the North Saskatchewan, leading towards what are called the Great Plains, I understand is by no means so fertile or so well suited for agriculture; and there is there, I believe, a scarcity of both fuel and water.\n\nSome doubts may exist as to the possibility of raising as large wheat crops along the valley of the north Saskatchewan, from the occasional occurrence of summer frosts, as can be raised in the Province of Manitoba; but I believe that for stock-farming, vegetables and the hardier grains, such as oats, barley, &c., the fertile belt of British North America can hardly be surpassed.\n\nWith regard to the temperature of the climate, on very few occasions was there any interruption to its mildness in the past summer during the months of June, July, August, September and October. On the night of the 17th August, when travelling between Fort Ellice and the Touchwood Hills, I experienced a slight frost, but not sufficient, so far as I could judge, to materially injure wheat crops. Again, on the night of the 10th September, when about two days' journey from the Rocky Mountain House, I experienced another similar frost—these were the only occasions during the past season that I experienced any frosts or cold, until reaching the foot of the Rocky Mountains on the 21st September near the Porcupine Hills, being then at an altitude of between 3,000 and 4,000 feet above the sea level—and at the time of the Equinox, I was stopped for several days by a snow storm, which not unfrequently occurs in the mountains, but rarely so early on the Plains. This snow disappeared from the Plains in a few days, almost as rapidly as it came, and with the above exceptions, from the time of quitting the Lake of the Woods, one hundred miles east of Fort Garry, until reaching the Pacific Coast, a period of three months, the climate was delightful—it was frequently quite unnecessary to pitch a tent when camping for the night; for many nights I slept out in the open air, or lay underneath the cart.\n\nIt takes twenty days to go with large sized row boats, carrying cargo, from Carlton to Fort Edmonton, but a light draught steamer would accomplish the distance in a short time.\n\nGold is to be found in the sand bars of the Saskatchewan the whole way from Fort Edmonton to Carlton, and almost throughout its entire length.\n\nAt Carlton a man can earn from two to three dollars daily, during the proper season by washing the sand of the river,—and at Fort Edmonton from five to six dollars daily for seven or eight months in the year.\nAt Fort Edmonton during the past summer there were only five or six men engaged mining, from one of whom I obtained some good specimens of the Saskatchewan gold, which is considered equal in quality to that obtained in the mines of British Columbia.\n\nThe few miners who have as yet penetrated into the Saskatchewan country state that gold is to be found in nearly all the streams which flow into the Saskatchewan River, and they are of opinion that quite as rich deposits exist on the Eastern as on the Western side of the Rocky Mountains.\n\nThe Hudson's Bay Company's Forts along the line of the North Saskatchewan at Carlton, Pitt, Victoria and Edmonton consist of wooden houses surrounded by stockades; these stockades are about twenty feet high with small bastions at the angles to afford flanking defence—although, probably sufficient to afford protection from Indians, they are of slight strength.\n\nThese Forts are conveniently enough situated for purposes of trade, but in a military point of view are badly placed, being in nearly every instance commanded from the rear by higher ground.\n\nThe Rocky Mountain House, however, is built on a good military site, and could easily be put in a defensible condition.\n\nThe scenery about the Touchwood Hills, as well as in many other sections of the country lying between Forts Garry and Edmonton is extremely picturesque and park-like. At the time of year I passed through, the wild flowers were in full bloom; the prairie covered with beautiful plants, and countless roses, both red and white, presented a gorgeous appearance.\n\nFort Carlton and its vicinity is a desirable spot for settlement, but the whole country along the North Bank of the Saskatchewan to Edmonton is at least equally so, offering in many places superior advantages from the greater quantity and better quality of the timber.\n\nFrom Edmonton to the Rocky Mountain House, especially in the neighbourhood of the Battle River and Wolf Plain, the country is still richer and better wooded.\n\nAt Fort Victoria, where a small settlement has arisen, and at Fort Edmonton I saw several fields of excellent wheat being harvested.\n\nI have no doubt whatever that when the valley of the North Saskatchewan is opened up and settled, it will be found to be very productive.\n\nThat beautiful country lying in the territory of the Blackfeet Indians, extending for about 300 miles along the Eastern base of the Rocky\nMountains towards the International boundary line, with a varying breadth of from 60 to 80 miles, is in respect of fertility, of surpassing richness—in regard to scenery, magnificent.\n\nThe average temperature during the Winter months along the base of the Rocky Mountains in this section of the country, is higher by $15^\\circ$ than that of the Western portion of the Province of Ontario; all over the Saskatchewan country, horses and cattle winter out.\n\nAll travellers and old residents in the North West, testify to the healthiness of the climate—indeed in the pure air of the prairie, sickness is almost unknown.\n\nScattered through the whole of the Saskatchewan country, are numerous lakes generally of no great size; they are the favourite haunts of great numbers of wild duck, and geese.\n\nSome of the Lakes between Forts Carlton and Edmonton, such as Egg Lake, Jack fish and Saddle Lake are, however, of considerable size, and contain immense quantities of White fish.\n\nWild pigeons, and prairie hens abound everywhere.\n\nIn the Touchwood Hills and along the Eastern base of the Rocky Mountains, several kinds of deer and bears are very numerous.\n\nWhen travelling through the Touchwood Hills, I killed a bear of the grizzly species, but one of no great size.\n\nOn the 23rd of September near the Porcupine Hill, at the base of the Rocky Mountains, I killed another grizzly bear of very large size, the animal weighing about 1100 lbs.\n\nIn the country adjacent to the Bow River and thence southward towards the Boundary line, numerous herds of antelope were seen, and some of them killed by our party.\n\nDuring the past summer, the buffalo were very numerous on the Great Plains that lie between the North and South Saskatchewan Rivers.\nCHAP. IV.\n\nFrom the Rocky Mountain House across the mountains, via \"Wild Horse Creek,\" to Victoria, Vancouver's Island.\n\nOn arrival at the \"Rocky Mountain House,\" I learned that to cross the mountains into British Columbia by the \"Vermilion Pass\" with horses was impossible owing to the immense quantity of fallen timber caused by a great storm in the mountains last spring.\n\nAn attempt to cross by this Pass had been made by a party of Assiniboine Indians early in the summer without success.\n\nUnder these circumstances it became necessary to undertake a journey of nearly miles 300 through the country of the Blackfoot Indians and to cross the mountains by the North Rootenay Pass.\n\nThrough the kindness of Mr. R. Hardesty, the gentleman in charge of the Hudson's Bay Company's Posts in the Saskatchewan District, I obtained the services of three guides from the Post of the Rocky Mountain House, one of whom was \"William Munro,\" the Hudson's Bay Company's Interpreter for the Blackfoot Indians, better known throughout the Saskatchewan Country by his Indian name of \"Piskaan.\" This guide is a brave man, and one of the most famous travellers and hunters in the service of the Hudson's Bay Company.\n\nIn company with him and the two other guides, one of whom was a Rocky Mountain Assiniboine Indian, the other a French half-breed, I started along with my son from the Rocky Mountain House, on the 16th September, to pass through the country of the Blackfoot Indians, and cross the Mountains by the Kootenay Pass into British Columbia.\n\nThe Blackfoot tribe of Indians have always been much dreaded and their country carefully avoided by travellers. From information obtained at the Rocky Mountain House, and while travelling, it appears that this tribe which is the most numerous and warlike one of the Prairie Indians in Dominion Territory, is divided into five distinct bands, or rather clans, each band under its own chief, but all maintaining a close connection. These bands are called and known as follows:\n\n1st. The Sik-si-ka or Blackfoot proper; this band numbers about 700 men, 1000 women, 1100 children, possessing about 3000 horses and ponies, 100 dogs, and having the following arms,\n\n- 105 Rifles,\n- 260 Revolvers,\n- 436 Flint guns,\n- 286 Bows,\n- 48 Spears,\n- 37 War Axes.\n2nd. The Pie-gans, (subdivided into Northern and Southern Pie-gans) numbering nearly 800 men, 1,100 women, 1,400 children possessing about 3,500 horses and ponies, 600 dogs, and the following arms,\n\n- 213 Rifles,\n- 412 Revolvers,\n- 320 Flint guns,\n- 181 Bows,\n- 54 Spears,\n- 41 War axes,\n\n3rd. The Ka-na-ans (or Blood Indians) numbering about 600 men, 800 women, 900 children, possessing about 2,500 horses and ponies, 480 dogs, and having the following arms,\n\n- 141 Rifles,\n- 318 Revolvers,\n- 202 Flint guns,\n- 216 Bows,\n- 45 Spears,\n- 32 War axes,\n\n5th. The Sar-cis (or Beaver Indians) numbering about 100 men, 130 women, 150 children, possessing about 150 horses, 300 dogs and having the following arms.\n\n- 6 Rifles,\n- 14 Revolvers,\n- 64 Flint guns,\n- 26 Bows,\n- 4 Spears,\n- 7 War axes,\n\nAlthough the Blackfeet may number altogether about 2,350 men, many of these are old, and some of them mere boys.\n\nIt is not believed that they could bring into the Field more than 1,000 or 1,100 men if as many.\n\nThey keep together by Bands for mutual protection, in what is termed in Military language standing camps; as many as 100 or 150 Tents being pitched together, and their chiefs have control over the young men.\n\nTheir war parties usually consist of only 50 or 60 men, and when on Raiding expeditions against hostile tribes, they can make with horses extraordinary marches.\n\nWith the Blackfeet, as with all the Indians in the Western Prairies, when at war, murder and assassination is considered honorable warfare.\nAmong the Blackfeet as well as among the Sioux, and Plain Crees, are some fine looking men, and they have a bold and military bearing, but on the whole the Indians are not equal to white men in point of physical strength or appearance.\n\nAs a rule the Prairie Indians are bold and skilful horsemen, but they are not very skilful with Firearms.\n\nThe Blackfeet and Plain Crees follow the Buffalo, subsisting entirely by the Chase; they therefore require a great many horses and dogs for transport and hunting purposes.\n\nIn the present year, peace having existed for the past two summers between the Crees and Blackfeet, and accompanied as I was by a guide well known, and related to the latter tribe, I did not think there was much danger in travelling through their country.\n\nThere is always however considerable risk, if mistaken for an American citizen; and on approaching the International line, near the Porcupine Hills, of meeting with hostile bands of the Gros Ventres and Crow Indians from the Territories of Dacotah and Montana, U.S., who frequently cross into Dominion Territory on horse stealing expeditions, and who are not likely, if they fall in with travellers, to make distinctions.\n\nFrom the Rocky Mountain House, the party being increased to five, we took with us twelve horses, one Red River cart for baggage, and carried twelve days' provisions.\n\nAfter leaving the Mountain House, no path or trail could be seen, and we journeyed through the country and over the prairies, led only by the instinct of the guide.\n\nAfter travelling for two days through thick wood country in a southeasterly direction, and crossing the Red Deer and Little Red Deer Rivers, we emerged on the Great Plains, following a route seldom taken by the white man.\n\nOn the 18th September we reached the South Saskatchewan, here called the Bow River, but owing to the difficulty of finding a practicable ford, did not succeed until the following day in effecting a passage with our horses and baggage.\n\nWhilst carrying out this operation the Assininiboine Indian deserted, but subsequently rejoined the party, fearing, probably, to be left alone in the country of the Blackfeet, the hereditary enemies of his tribe.\n\nWe found the water here of the South Saskatchewan icy cold, flowing as it does out of immense Glaciers in the Rocky Mountains.\nOn the 21st September we reached the North West flank of the Porcupine Hills, and when almost at the foot of the Livingstone Range of the Rocky Mountains, about eighty miles to the north of the International Boundary line, our progress was stopped by a violent snow storm, and we were forced to camp on the open prairie.\n\nFor two days and two nights it snowed without intermission, the mountains were soon covered, and by the evening of the 22nd the snow lay two feet deep all over the plain. The situation became somewhat difficult—stopped at a point 250 miles from the Rocky Mountain House, and as far from any other source of supply, with only five or six days' provisions left, the guide declaring that to cross the mountains had now become impossible.\n\nFortunately the storm occurred before entering the mountains or the probability is the animals would have been lost, and our party placed in a very critical position.\n\nOn the 23rd the weather cleared, and on the afternoon of that day we killed a large grizzly bear, which had approached to within a few yards of our camp, the animal having lain all the previous night close to it. This event afforded us a timely supply of meat, relieving our anxiety on that point, although in a case of extremity the horses would have supplied food, it was necessary to save them if possible for transport. We remained snowed up for six days, then, abandoning the cart and all superfluous baggage started on the 27th with the horses for the Kootenay Pass, resolving to push through the mountains if practicable, and if unable to do so to make for Fort Benton, on the Missouri, a United States Military Post in Montana, distant about 200 miles to the South East.\n\nOwing to the depth of snow we did not make more than four miles on the 27th.\n\nOn the 28th we made about sixteen miles, the snow disappearing rapidly, the weather now very fine, and on the following day clearing the snow altogether (our route lying in a southerly direction), we crossed the Belly River, and reached the south end of the Porcupine Hills, opposite the entrance of the Kootenay Pass, about 50 miles to the north of the International Boundary line.\n\nThe country around the Porcupine Hills is justly considered the richest and most beautiful part of the Saskatchewan territory. It is a favourite wintering ground for great herds of buffalo, and of the Blackfeet Indians, who at that season of the year pitch their camps on either slope of the Porcupine Range, or in the sheltered and fertile valleys along the eastern base of the Rocky Mountains.\n\nDuring the nights of the 27th, 28th and 29th we kept on the alert, having during the day time observed the fresh trail of a mounted man,\nkeeping always a short distance in advance of our party, but never visible to us.\n\nFrom certain signs well understood by the Guides from their knowledge of Indians, and Prairie life, they were of opinion that we were being watched at this time, by some scout belonging to a hostile party of the \"Gross Ventre\" or \"Crow\" Indians from south of the line, with a view to horse stealing; it was necessary therefore to keep the horses close to us at night and well hobbled, and to keep a lookout for our own safety.\n\nOn the 30th September when entering the Kootenay Pass, we observed a mounted Indian galloping along the side of a mountain.\n\nAfter some hesitation this Indian approached, and on finding that we were not a party of the dreaded Blackfeet, he exhibited great pleasure.\n\nHe proved to be a scout belonging to a Band of Kootenay Indians who had crossed the mountains from the Western side, to hunt Bullalo on the Eastern Prairies.\n\nAfter proceeding a few miles accompanied by this man, and passing several mounted Indians, posted as scouts on the look-out, we met the main body of the Band on the march, and at the request of the chief, camped and remained a day with them, being treated in the most friendly manner.\n\nThere were about sixty or seventy men in the band—they had with them more than 200 horses, among which were some good animals.\n\nAlthough not actually at war with the Blackfeet, they were apprehensive of attack, and the manner in which these poor Indians performed outpost duty, would have taught a lesson to the soldiers of more civilised countries. One of the leading men insisted upon presenting us with a horse and when I expressed a desire to obtain one or two of their men as guides and to assist in crossing the mountains, the chief directed three to accompany us as far as we wished.\n\nThe Kootenay Indians from the western side of the mountains are much more civilized than the Crees or Blackfeet, (these latter as regards habits of life being little better than mere animals.)\n\nDuring the day I was with them a bell was rung three times in the Camp for prayers. They are noted hunters, good horsemen, and were quite prepared for a brush with the Blackfeet if called on.\n\nContinuing our journey we crossed the Rocky Mountains in two days, riding and scrambling over rough ground.\n\nOwing to the quantity of fallen timber, some of which was of great\nsize, we experienced considerable difficulty in getting the horses through, but except on the summit of the Pass there was no snow on the trail.\n\nThe weather was then, on the 1st of October, very fine and quite mild. On the 4th of October, by which time the provisions were exhausted, we reached the Gold Miner's Camp of Wild Horse Creek, in the Kootenay District of British Columbia, where we were most hospitably received by the Gold Commissioner and Stipendiary Magistrate of the District, Mr. Arthur Vowell, and our wants supplied.\n\nIn crossing the Rocky Mountains by the Kootenay Pass, there are two distinct ranges. The height at the summit of the first Pass is about 6800 feet above the sea—the mountains on either side, however, being double that altitude and capped with perpetual snow. The height of the second Pass is nearly the same; the track is well defined, and has been used for many years by the Kootenay Indians. In some places the path is very narrow, leading over high and dangerous ground—we found it necessary frequently to dismount. The distance from the eastern to the western entrance of the Pass in the Kootanie Valley is about 47 miles. It would be difficult to describe, in adequate language, the beauty and grandeur of the scenery all through. It is impossible to take any wheeled vehicle at present through the Kootenay Pass, and when there is snow in the Mountains in any quantity, horses cannot pass.\n\nThe present horse trail, however, might be easily improved—a party of fifty men could, in the course of a single season, make it equal to the ordinary horse trails in the Province of British Columbia. Considerable labour however would be required to make a waggon road, and to carry a railway across the Mountains by this Pass, it would be necessary to tunnel through two mountains.\n\nThe Stipendiary Magistrate of the Kootenay District, British Columbia, resides at Wild Horse Creek; there is a population of from twenty-five to thirty white men, gold miners there, and about one hundred Chinese. The miners, at that time, were not making more on an average than five or six dollars per man per day. Ample supplies of beef and flour, at moderate price, can be obtained, but the price of clothing and other supplies is very high—such supplies having to be brought on mules or pack horses, either from Walla Walla, in Washington Territory, U. S., or from the town of Hope, on the Fraser River, B.C., a distance of four hundred and fifty miles.\n\nA Custom House has been established at Joseph's Prairie, about 14 miles from Wild Horse Creek with excellent effect, and if a similar one was established on the Eastern side of the mountain, at the Porcupine Hills, a still better result would be obtained.\n\nThe Postal communication from the Kootenay District to Victoria, is as yet very bad, and it is very desirable to improve the present trail\nleading via Osoyoos and the Simil-Kameen to the town of Hope, on the Fraser, or to make a waggon road.\n\nThe District of Kootenay is of great extent, embracing an area of 32,000 square miles. The total population amounts to about eighty-five white men, two hundred Chinese, and 400 or 500 Kootenay Indians.\n\nThere is an immense quantity of fine timber in the Kootenay District and in the Valleys of the Rocky Mountains, chiefly cedar and pine trees, of great height and size, and the mineral resources are believed to be very great. The Valleys between the different Hill ranges, in the Kootenay District are generally speaking fertile and well adapted for farming.\n\nThere are four gold mines in the District, namely: Wild Horse Creek, Perry's Creek, Palmer's Bar and Weaver's Bar—only the two former, however, are being worked.\n\nThe Government of the District is under the able administration of Mr. A. Vowell, Stipendiary Magistrate and Gold Commissioner.\n\nThe place itself is one of the most desolate spots imaginable; a narrow rugged valley, surrounded by lofty wild hills, in the heart of the Rocky Mountains.\n\nFrom Wild Horse Creek, the guides who had accompanied me from the Rocky Mountain House, after obtaining fresh supplies, started on the 8th of October to return homewards, intending to take what they hoped might prove a shorter route, and one safer from risk of Indian molestation.\n\nOn the same day, with one guide only and five horses obtained at Wild Horse Creek, I continued the journey, and after fifteen days' travel, proceeding via the Mooyais River, Lake Pen d'Oreille, the Spokane, and Suake Rivers, arrived at the settlements of Walla Walla and Walula, in Washington Territory, U. S.\n\nIt had been my intention to proceed from \"Wild Horse Creek,\" to the town of Hope on the \"Fraser,\" a distance of 450 miles via Fort Shepherd, Lake Osoyoos, the Okanagan country and Similkameen River, but owing to the lateness of the season the guide was unwilling to take this Route.\n\nThe journey from Wild Horse Creek to Lake Pen d'Oreille was tedious and fatiguing, having only one guide to share with me and my son the labour of travelling with horses for many days along an Indian track encumbered with fallen timber, and through a rugged, densely wooded, and difficult country. The scenery from Wild Horse Creek to Lake Pen d'Oreille, and especially about that Lake is very beautiful, but further south on reaching the Spokane River, U. S., the country presents the appearance of an arid waste—Washington Territory, U. S., being partly situated in what is known as the Great Columbian Desert.\nWashington Territory, U. S., is, however, as well as many parts of British Columbia, admirably suited for horses and cattle, from what is known as \"Bunch grass,\" growing there in great perfection.\n\nFrom Walula, descending the Columbia, I proceeded via Portland, in Oregon, Olympia and Puget Sound, to Victoria, in Vancouver's Island, arriving at Victoria on the twenty-eighth day of October, having accomplished the journey from Fort Garry in seventy days, of which only fifty-one were occupied in actual travel—the distance by the route followed from Fort Garry to Vancouver's Island being nearly three thousand miles—of this distance considerably more than two thousand miles were travelled on horseback.\n\nAfter remaining fourteen days at Victoria, visiting the Island of San Juan, in company with the Senior Naval Officer of H. M. ships, and arranging for the organization of the militia in the Province of British Columbia, I returned to Ottawa via San Francisco and the U. S. Pacific Railway, stopping for two days to visit the Mormon City at the great Salt Lake in Utah Territory.\n\n---\n\n**CHAP. V.**\n\n**General Remarks.**\n\nDuring the journey from Manitoba to the Pacific Coast, an opportunity was afforded me of becoming acquainted with the state of affairs in the Saskatchewan, and the condition of the Indian tribes.\n\nEvery possible information was furnished by the Missionaries whose acquaintance I made, and by the employés of the Hudson's Bay Company; in the course of the journey I met with many bands of Indians.\n\nBetween Fort Garry and Portage du Prairie three large Camps of the Sioux tribe were visited—a portion of the same band who in 1862 massacred some American settlers in Minnesota, U. S., in retaliation for the many wrongs and outrages committed in the first instance on them by American citizens. Ever since that event this band has sought refuge in Dominion Territory. These Sioux Indians live quietly enough apparently among our people, and occasionally assist the farmers at harvest time. The presence, however, of such a wild and warlike looking band in the settlement frequently causes no small apprehensions amongst the settlers dwelling near Portage du Prairie.\n\nBefore reaching Fort Ellice I met two bands of the same tribe, one consisting of about 100 men, unaccompanied by women or children, who\ntold me they had been to visit the Lt. Governor of Manitoba in hopes of obtaining presents. This band belonged to the United States and had come all the way from the Plains South of the Missouri River whither they were returning. These Indians were bold and wild-looking fellows, fantastically dressed and all armed. They were perfectly friendly in their manner.\n\nOn one occasion when far out on the Prairie, a band of ten mounted Sioux after reconmitting from a distance, rode rapidly towards our small party of four, (two of whom were only boys) surrounding us in a moment; on being told by the guides, who spoke their language very well, that I was not an American Citizen, but a British Officer travelling towards the Rocky Mountains, they became quite friendly in manner, shaking hands with us heartily.\n\nSubsequently this band were somewhat bold and pressing in their demands for presents, which we resisted in a firm, but friendly manner, it being bad policy to comply with extortionate demands, or to appear in dealing, with Indians to act from intimidation.\n\nBetween Fort Ellice and Fort Carlton I met some bands of the Saulteaux tribe,—at the various Forts along the North Saskatchewan, several of the Cree tribe, (Plain Crees) and at the Rocky Mountain House some Blackfoot and Assiniboine Indians.\n\nAlthough there may not at present be much risk in travelling through the Saskatchewan territory along the well known track followed for so many years by the Hudson's Bay Company, especially when associated with an employé of the Company, speaking the Indian language, it is a matter of doubt if such can long continue under the changing state of affairs, without the introduction of some Government supported by material force.\n\nBeyond the Province of Manitoba westward to the Rocky Mountains, there is no kind of government at present whatever, and no security for life or property beyond what people can do for themselves.\n\nThe few white men there are in the Saskatchewan country, and at the H. B. C. Forts, frequently expressed to me their conviction that unless a Military Force is established in the country, serious danger is to be apprehended.\n\nThe clergymen of all denominations whom I met with, expressed similar convictions; those at Forts Victoria and Edmonton as representatives of the community, urged me in the most impressive manner to lay their claims for the protection of themselves, their wives and families before His Excellency the Governor General of the Dominion, and the Government of their country.\n\nIt appears that of late years no attempt has been made to assert the\nsupremacy of the law, and the most serious crimes have been allowed to pass unpunished. Hardly a year has passed without several murders and other crimes of the most serious nature having been committed with impunity.\n\nDuring the present year, about three weeks before my arrival at Edmonton, a man by name Charles Coudin, a French speaking half-breed, cruelly murdered his wife at no great distance from the gate of the H. B. Company's Post. I was informed that the criminal might have been arrested but that there was no power to act. This same man had previously most wantonly and cruelly mutilated an old Indian woman by cutting the sinews of her arm so as to incapacitate her for work.\n\nAt Edmonton there is a notorious murderer, a Cree Indian, called Ta-ha-kooch, who has committed several murders, and who should have been apprehended long ago. This man is to be seen walking openly about the Post. Many instances can be adduced of a similar kind, and as a natural result there is a wide spread feeling of apprehension. The gentleman in charge of the H. B. C. Post at Fort Pitt, as well as others elsewhere, assured me that of late the Indians have been overbearing in manner, and threatening at times. Indeed, the white men dwelling in the Saskatchewan are at this moment living by sufferance, as it were, entirely at the mercy of the Indians. They dare not venture to introduce cattle or stock into the country, or cultivate the ground to any extent for fear of Indian spoliation.\n\nWhen at Edmonton and the Rocky Mountain House I was informed that a party of American Smugglers and Traders have established a trading post at the junction of the Bow and the Belly Rivers, about 30 miles due east from the Porcupine Hills, and about 60 miles on the Dominion side of the boundary line; this trading post they have named Fort Hamilton, after the mercantile firm of Hamilton, Heaty & Company, of Fort Benton, Montana, U. S., from whom it is said they obtain supplies. It is believed that they number about 20 well armed men, under the command of a man called John Healy, a notorious character.\n\nHere it appears they have for some time carried on an extensive trade with the Blackfeet Indians, supplying them with rifles, revolvers, goods of various kinds, whiskey, and other ardent spirits, in direct opposition to the laws both of the United States and the Dominion of Canada, and without paying any custom duties for the goods introduced into the latter country.\n\nThe demoralization of the Indians, and injury resulting to the country from this illicit traffic is very great.\n\nIt is stated upon good authority that during last year (1871) eighty-eight (88) of the Blackfeet Indians were murdered in drunken brawls\namongst themselves, produced by the whiskey and other spirits supplied to them by those traders.\n\nAt Fort Edmonton during the present summer whiskey was openly sold to the Blackfeet and other Indians trading at the Post by some smugglers from the United States who derive large profits thereby, and on these traders being remonstrated with by the gentleman in charge of the Hudson's Bay Post, they coolly replied that they knew very well that what they were doing was contrary to the law of both countries, but as there was no force there to prevent them, they would do just as they pleased.\n\nIt is most important for the peace of the country and welfare of the Indians that this smuggling and illicit traffic in spirits and firearms be no longer permitted.\n\nThe establishment of a Custom House on the Belly River near the Porcupine Hills, with a military guard of about one hundred and fifty soldiers is all that would be required to effect the object.\n\nNot only would the establishment of a military post here put a stop to this traffic but it would also before long be the means of stopping the horse-stealing expeditions carried on by hostile Indians from South of the line into Dominion Territory, which is the real cause of all the danger in that part of the country and the source of constant war among the Indian tribes.\n\nIndeed it may be said with truth, that to put stop to horse-stealing, is to put stop altogether to Indian wars in the North West. The importance of the Porcupine Hill in a strategical point of view is very great, commanding as it does the entrance of both the Kootenay Passes towards the West, and the route from Benton into the Saskatchewan territory on the East, the country can be seen from it for immense distances all round. Although hostile to citizens of the United States it is believed that the Blackfoot Indians would gladly welcome any Dominion Military Force sent to protect them from the incursions of other tribes, and to stop the horse-stealing which has for so long been carried on. With excellent judgment they have pointed out the southern end of the Porcupine Hill as the proper place for a Military Post.\n\nIn order to satisfy myself on this point, I spent the greater portion of the 29th September in reconnoitring the ground recommended by them, and if it be the policy of Government to take steps to stop the illicit smuggling which is being carried on, at this part of the Dominion, there is every convenience for establishing a Custom House and Military Post. Timber of large size and good quality for building is close at hand, and the surrounding country is most fertile and favorable for settlement.\n\nThe distance from Fort Edmonton to the Porcupine Hill is about six or seven days journey on horseback, and from the Kootenay Valley on the\nWestern side of the Rocky Mountains, from whence supplies could easily be obtained, about fifty or sixty miles.\n\nFrequent intercourse, and an active trade between the Kootenay District of British Columbia and the Saskatchewan country, would result from the establishment of a Custom House and Military Post at the Porcupine Hills. Many individuals are prepared to settle there if any protection is afforded, and the Indian trade of the country at present tapped by U.S. citizens would remain with our own countrymen. There is a general belief prevalent moreover that valuable gold deposits are to be found near the Porcupine Hills—the unsettled state of the country hitherto has not admitted, however, of much prospecting. A party of four American miners, who crossed through the Kootenay Pass two or three years ago, were all killed by the Blackfeet, near the Porcupine Hill, the moment they entered the Plain on the eastern side; since which event no attempt at prospecting for gold has been made, in that part of the country.\n\nWith regard to the measures which should be adopted for the settlement of the country, I feel satisfied that the introduction of a civil police force unsupported by any Military into the Saskatchewan Territory would be a mistake, and that no time should be lost in establishing a chain of military posts from Manitoba to the Rocky Mountains. The appointment of a Stipendiary Magistrate for the Saskatchewan to reside at Edmonton and act as the Indian Commissioner, is also a matter of the first importance. The individual to fill this important post should be one, if possible, already known to, and in whom the Indians have confidence. I consider that it is very necessary to invite the co-operation of the Hudson's Bay Company in the adoption of any steps towards establishing law and order in the Saskatchewan for the first few years.\n\nA large Military Force is not required, but the presence of a certain force, I believe, will be found to be indispensable.\n\nThe number of the Indians dwelling in the extensive country which lies between the Red River and the Rocky Mountains on Dominion Territory has been, much exaggerated. It is very difficult to arrive at any accurate Indian census, but having made every enquiry during last summer on this point, whilst travelling through the country, from those most competent to judge, I doubt if there are more than four thousand Prairie Indians capable of bearing arms in the Dominion Territory between Fort Garry and the Rocky Mountains, south of the Sub-Arctic Forest, and north of the International Boundary Line,—the total Prairie Indian population amounting, perhaps, to 14,000 or 15,000.\n\nThese Indians are scattered over such an immense extent of country, that anything like a formidable combination is impossible; most of the tribes, moreover, have been hostile to one another from time immemorial.\n\nIt is believed that the Blackfeet and the plain Crees, the two strongest\ntribes, of prairie Indians, may have respectively about one thousand fighting men, but it is doubtful if either tribe could ever concentrate such a number, or if concentrated, that they could long remain so from the difficulty of obtaining subsistence.\n\nAlthough many of the Blackfeet have Breach loading Rifles the Indians generally are poorly armed and badly mounted.\n\nUnder these circumstances it will be readily understood that comparatively small bodies of well armed and disciplined men judiciously posted through the country could easily maintain military supremacy. A body of 50 mounted Riflemen, armed with Breech loading Rifles, is a formidable Power in the Prairie.\n\nI feel satisfied that one regiment of mounted riflemen, 550 strong including non-commissioned officers, divided into companies of 50, would be a sufficient force to support Government in establishing law and order in the Saskatchewan preserving the peace of the North West Territory and affording protection to the Surveyors, Contractors and Railway Labourers about to undertake the great work of constructing the Dominion Pacific Railway.\n\nAlthough the proposed military strength, and consequent expense, may appear somewhat considerable I have been guided by every consideration of economy in recommending the above number.\n\nIt is wiser policy and truer economy to have one hundred soldiers too many, than one man too few; the great extent of the country and detached nature of the service must also be taken into account, and it should be borne in mind that the only thing the Indians really respect, and will bow to, is actual power.\n\nIt should be borne in mind too, that in addition to the Indian element, there is a half-breed population of about 2000 souls in the Saskatchewan, unaccustomed to the restraint of any government, mainly depending as yet upon the chase for subsistence, and requiring to be controlled nearly as much as the Indians.\n\nIf it be in harmony, therefore, with the policy of the Government to do so, I would recommend the establishment of Military Posts at the following places, strength as below:\n\n1. At Portage du Prairie.................. 50 Mounted Riflemen\n2. \" Fort Ellice.......................... 50 \" \"\n3. \" Carlton............................. 50 \" \"\n4. \" Pitt................................. 50 \" \"\n5. \" Victoria............................ 50 \" \"\n6. \" Edmonton......................... 100 \" \"\n7. \" Porcupine Hill.................... 150 \" \"\n\nTotal............................... 500\n\nWith a proportion of Officers and non-commissioned Officers.\nIf no permanent Custom House and Military Post is established at the Porcupine Hills, then the strength of the force at Edmonton should be 250, of which 150 men should be encamped during the summer months at the Porcupine Hills, or at the junction of the Bow and Belly Rivers, returning to Edmonton for the Winter; but the establishment of a Custom House and Military Post at Porcupine Hills is of far more importance and would have a much better general effect towards securing the peaceful settlement of the country than at any of the other places named. During the summer months a detachment of 50 men from this Post might with advantage be employed in opening up the communication across the mountains with the Kootenay District of British Columbia.\n\nIt would be necessary that each of the companies of mounted riflemen should be made as far as possible self-supporting communities, provided with a few carts, intrenching tools, agricultural implements, seed for raising corn, and some cattle. These Military Posts would partake of the character of Military Settlements, in the vicinity of which many settlers would ere long establish themselves.\n\nIt would be very desirable moreover that a medical officer should be appointed to each military post, and his duties not confined to the medical charge of the military only, but extended to all the Indians in the vicinity.\n\nPast experience has proved that no measure is better calculated to secure the confidence and attachment of the Indian tribes than by attending to their wants in time of sickness, and supplying medical aid.\n\nThe men to compose the corps should be enlisted to serve for three years, receiving on the termination of the engagement, (provided they have performed their duties in a satisfactory manner,) the same amount of land as is granted on discharge to the men of the militia in Manitoba, I would recommend that the corps be raised by Volunteers out of the active Militia. It would be desirable to attach to the Military Force at each post three or four half-breeds, or Indians, as scouts, who could serve as Interpreters and usually carry the mail.\n\nAt the places indicated for military posts no great difficulty would be experienced, or expense incurred in hutting the men, they themselves performing the work.\n\nIn the event of this proposed arrangement meeting with the views of Government, I have the honour to submit the accompanying estimate marked \"A\" of the probable expense that would be incurred for the establishment and maintenance of the Military Force proposed, from which it will be seen that the expenditure would be considerably less than $300,000 dollars annually.\n\nI would further beg to suggest, if it be decided to establish any chain\nof military posts, that for the first year the soldiers be employed in laying down a telegraphic wire from Manitoba towards British Columbia, as well as in hutting themselves.\n\nFrom my own knowledge and observation of the country, I think that if proper energy be used the very desirable work of establishing telegraphic communication, from Fort Garry through Dominion Territory, with British Columbia could be carried out by the soldiers in one or two seasons. I would further observe that if it be determined to establish a Military Force in the Saskatchewan next summer, no time should be lost in making the preliminary arrangements. The men and horses should, if possible, be concentrated at Fort Garry in the month of May, their equipment forwarded sooner.\n\nBRITISH COLUMBIA.\n\nWith regard to the organization of the militia in British Columbia it is recommended that one Staff Officer as Deputy Adjutant General of Militia be appointed for the Province, as soon as the Government finds it convenient to do so. It is not necessary at present to appoint any Brigade Majors.\n\nThe formation of two companies of riflemen (Volunteer Militia) in Victoria, and one at Nanaimo, is recommended also the formation of one company of riflemen at New Westminster, another at Burrard's Inlet, on the mainland, and that the New Westminster Battery of Garrison Artillery be reorganized.\n\nThe total population of the Province is only as yet about 12,000 white men, 4,000 half-breeds and 45,000 Indians—the latter mainly dwelling along the coast. The Indians dwelling in the interior of British Columbia are not numerous; the policy of treating them much in the same manner as if they were settlers, appears to have succeeded admirably.\n\nThe following amount of military stores have recently been despatched, by order of the Dominion Government, from England direct by sea to Victoria, for the equipment of the Militia of the Province:\n\n- 1,000 Snider Enfield Rifles.\n- 1,000 Sets of Accoutrements.\n- 1,000 Rifle Uniforms.\n- 1,000 Great Coats.\n- 300,000 Rounds of Ammunition.\n- 60 Tents.\n- 20 Targets complete, with flags.\n- 100 Camp Kettles.\n- 1,000 Knapsacks complete, with Mess Tins and Straps.\n\nIt is very desirable with a view to ultimate economy as well as\npresent efficiency that some building be acquired in Victoria to serve as an Armoury and Storeroom, and that a storekeeper be appointed to the charge of this public property without delay.\n\nI have the honour to be,\n\nSir,\n\nYour most obedient servant,\n\nP. ROBERTSON-ROSS,\nColonel Commanding the Militia of Canada, and Adjutant-General.\n\nI submit with this Report a carefully corrected general map of the North West Territories of the Dominion, showing the route which I followed across the continent; the places recommended for military posts are marked with a cross thus, \"X,\" and the point where it is stated that U.S. smugglers have established a post at the junction of the Bow and Belly Rivers, is coloured in blue.\n\nP. R. R.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30258.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 39, "total-input-tokens": 65890, "total-output-tokens": 18046, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1831, 3], [1831, 4272, 4], [4272, 4272, 5], [4272, 4415, 6], [4415, 4651, 7], [4651, 5611, 8], [5611, 7992, 9], [7992, 10673, 10], [10673, 13216, 11], [13216, 15521, 12], [15521, 18123, 13], [18123, 20798, 14], [20798, 23409, 15], [23409, 25699, 16], [25699, 28425, 17], [28425, 30888, 18], [30888, 33835, 19], [33835, 36561, 20], [36561, 38978, 21], [38978, 40714, 22], [40714, 42999, 23], [42999, 44513, 24], [44513, 46843, 25], [46843, 49545, 26], [49545, 51923, 27], [51923, 54796, 28], [54796, 57401, 29], [57401, 59732, 30], [59732, 62337, 31], [62337, 65057, 32], [65057, 67854, 33], [67854, 70812, 34], [70812, 73378, 35], [73378, 76110, 36], [76110, 78359, 37], [78359, 79088, 38], [79088, 79088, 39]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]