[{"id": "28d9f3c65af79767c528caa8942c6df2cc46541b", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [✓] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [✓] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nMetropolitan Toronto Library\nCanadian History Department\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nMetropolitan Toronto Library\nCanadian History Department\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE GOSPEL IN THE REGIONS BEYOND.\n\nA SERMON\n\nPREACHED IN LAMBETH CHURCH,\n\nON SUNDAY, MAY 3, 1874,\n\nAT\n\nTHE CONSECRATION OF THE BISHOPS OF ATHABASCA AND SASKATCHEWAN.\n\nBY THE\n\nRIGHT REV. DAVID ANDERSON, D.D.\nVICAR OF CLIFTON, FORMERLY BISHOP OF RUPERT'S LAND.\n\nPUBLISHED AT THE REQUEST OF\nHis Grace the Archbishop of Canterbury.\n\nLONDON:\nHATCHARDS, PICCADILLY.\n1874.\nTHE GOSPEL IN THE REGIONS BEYOND.\n\nA SERMON\n\nPREACHED IN LAMBETH CHURCH,\n\nOn Sunday, May 3, 1874,\n\nAT\n\nTHE CONSECRATION OF THE BISHOPS OF ATHABASCA AND SASKATCHEWAN.\n\nBY THE\n\nRIGHT REV. DAVID ANDERSON, D.D.\nVICAR OF CLIFTON, FORMERLY BISHOP OF RUPERT'S LAND.\n\nPublished at the Request of His Grace the Archbishop of Canterbury.\n\nLONDON:\nHATCHARDS, PICCADILLY.\n1874.\nTO THE\n\nBISHOP OF RUPERT'S LAND,\n\nAND THE BISHOPS OF,\n\nMOOSONEE, ATHABASCA, AND SASKATCHEWAN,\n\nThis Sermon\n\nIS AFFECTIONATELY INSCRIBED\n\nBY THEIR FAITHFUL FRIEND AND BROTHER,\n\nDAVID ANDERSON, D.D.\n\nFORMERLY BISHOP OF RUPERT'S LAND.\nTHE\n\nGOSPEL IN THE REGIONS BEYOND.\n\n'To preach the gospel in the regions beyond you.'—2 Cor. x. 16.\n\nThese words contain within them the end and object of Apostolic labour. They are the very echo of the last charge of the Redeemer,—'Go ye into all the world, and preach the Gospel to every creature.' To St. Paul, as not among the chosen ones at that time, a similar commission had been afterwards given, when, as he was praying in the Temple, he was in a trance, and saw the Lord, who said to him, 'Depart, for I will send thee far hence unto the Gentiles.' In his case we can almost trace each step of future progress, and see how, as long as life lasted, the grand desire seemed ever present—'to preach the Gospel in the regions beyond.'\n\nIn his first missionary journey the area is circumscribed, and embraces only portions of Asia Minor. In his next he is summoned to more extended labour—called from Asia into Europe by the man of Macedonia, who appeared to him in vision and said, 'Come over and help us.' Philippi, Thessalonica, and Berea, rejoice in turn at the light, and the Apostle passes downwards from them to Athens and to Corinth. Tarrying at the seat of commerce for a longer season, he lays there the foundation of a Christian Church; and, when taken from his converts, he still turns to them with words of warning and encouragement. An Epistle is addressed to them, in which he states his determination 'to know nothing among them save Jesus Christ and Him cru-\ncified'—an Epistle from which we derive our most precious lessons of the love which binds together the people of God, and of the Resurrection as the keystone of the Christian faith. From Philippi, or one of the other cities of Macedonia, a second Epistle is sent. In it, in the chapter of our text, the Apostle is reviewing his first entrance in among the Corinthians, as matter of the highest rejoicing; or rather, lest he should be betrayed into undue self-exaltation, he qualifies his language, and would speak of it as magnifying the exceeding grace of God. 'We are come,' he says, 'as far as unto you also in preaching the Gospel of Christ;' but at this very moment he looks onwards, and gives expression to the hope that, according as their faith should be enlarged, and the opportunity and means should be afforded him, he might preach the Gospel in the regions beyond them.\n\nWriting soon after from Corinth to the Romans, whom as yet he had never seen face to face, he declares in a similar spirit, 'As much as in me is, I am ready to preach the Gospel to you that are at Rome also.' And towards the end of that Epistle he drops an allusion to a yet more distant plan: 'Whensoever I take my journey into Spain I will come to you.' Spain thus, and Gaul, and, it may be, Britain, lay much on the Apostle's heart,—the desire was there, whether actually accomplished or not we do not know for certain, but the principle of action was throughout life the same—'to preach the Gospel in the regions beyond.'\n\nThe Church of Christ has ever inherited the same charge. For ages she may have slumbered and slept, but with the opening of this century the voice has sounded with power on her ear, and, awaking from her lethargy, our own beloved Church has girded herself afresh for the task. We have proof before us this morning that such labour has not been in vain.\n\nA quarter of a century ago this month,* I was myself sent forth to cement and consolidate the infant Church in\n\n* May 29, 1849.\nRupert's Land. It were idle to deny that it appeared at the time a long and difficult way. The voyage through the icebergs and the Straits (the only method of approach in those days), the long subsequent weeks of exposed travel up the country, brought me at last to my destined home. It was an oasis in the wilderness, the scene already of successful missionary toil, where devoted men of God had laboured and scattered seed, and that with a large blessing, for five and-twenty years.\n\nThat spot has now become the centre of a growing and thriving community, with the prospect of a yet more rapid enlargement, through the tide of emigration which is setting in. It is, too, the capital of the Canadian Province of Manitoba. Here my excellent successor, in addition to unwearied attention to all the weighty details of Episcopal work, devotes much energy and power to large educational efforts, convinced that the hopes of the future would mainly depend upon the training of those who may be the ministers and missionaries of the next generation. Here he has his College of St. John's, cradled and nursed in its infancy by myself; here he plans a Cathedral Chapter, some members of which shall form a Professorial Staff—a Theological Faculty. Here he has in recent years assembled around him a Diocesan Synod of clergy and laity; and now, with the sanction of the Primate, and aided by the liberality of the Church Missionary Society, of the Society for the Propagation of the Gospel, and of the Church at large, he is subdividing the unmanageable territory committed to him, by founding Missionary Bishoprics to meet the wants and exigencies of the land. The seat of the original bishopric remains thus still the seat and centre of influence in the South, and may become at a future day the centre of a Province of our Church.\n\nThe Sunday preceding the first day of Intercession witnessed, in the Abbey near us, the consecration of one*\n\n* The Right Rev. John Horden, D.D., ordained Deacon and Priest at Moose, 1852; consecrated in Westminster Abbey Bishop of Moosonee, December 10, 1872.\nwho, 'as a son with the father, had served with me in the Gospel;' one of my own ordination as deacon and priest, to the eastern Bishopric of Moosonee. There he has a large and independent sphere, stretching from Labrador to York Fort, and from the Straits to the Canadian frontier.\n\nTo-day the noble plan will be consummated by the consecration of two additional Bishops. One* will preside over the Church in the western portion of the land, labouring among the Indians of the plains, and along the valley of that river whose source is in the Rocky Mountains—the river Saskatchewan; whose name, in its sound and meaning, would remind of those surging rapids down which it sends its waters into the inland sea of Winnipeg.\n\nThe other Bishop† will have the northern diocese as his own, along yet mightier lakes, and with rivers which roll down an immense volume and discharge themselves into the Arctic Ocean. Such is the fourfold subdivision of that vast territory, completing and carrying out ideas which, as day-dreams, may at times have flitted across my mind, but which have to-day reality and shape, and a definite existence.\n\nThe object, then, is to carry the Gospel into those regions beyond.\n\nNor think that the Gospel—the Divine message—has lost anything of its power in its transmission through the ages of the past. If sweet the task of the angel who on Bethlehem's plains proclaimed 'Behold, I bring you glad tidings of great joy,' sweet still the announcement of a Saviour and the work of redeeming love. There may be little apparent fruit while we dwell on subordinate topics, and endeavour to carry out merely a moral reformation; but, as the simple story of the birth of Christ is told, and still more as we unfold the record of His agony and death, there will be the burst of deeper emotion, and the cry of the\n\n* The Right Rev. John M'Lean, D.D., D.C.L. (Archdeacon of Manitoba and Warden of St. John's College), Bishop of Saskatchewan.\n† The Right Rev. W. Carpenter Bompas, D.D., Bishop of Athabasca.\nGreenlander will be heard afresh,—'Tell me that story over again.' In each of the dioceses to be formed today we have known of cases in which the story has been listened to eagerly throughout the whole day, and continued onwards through the livelong night. It came to them with all the freshness of a new revelation, meeting exactly their condition as sinners, and supplying their every need.\n\nBut to announce is not the whole of the work to which the Overseers in the Church of Christ are called. It was the Apostle's boast, that 'from Jerusalem round about to Illyricum he had fully preached the gospel of Christ;' preached, that is (as has been well explained), not alone in outline, but filling up and developing the scheme of salvation. In the former case you may do the work of an evangelist, as a herald publishing the glad tidings; in the latter you would pass on and make full proofs of your ministry. In itinerating you may do the former; in frequent visitation, and leaving behind you the settled teacher, you must seek to do the latter.\n\nThere is, however, yet another feature in the Apostle's sketch of his labours, as he depicts them for us in the Epistle to the Romans and in the passage of our text. We find him invariably striving to preach 'not where Christ was named, lest he should build upon another man's foundation.' It was his holy ambition to be ever breaking up virgin soil, finding out fresh and untried ground. This surely will be the undoubted privilege of those to be sent forth today. Some pioneers* may have gone forth to search out the land, but as yet there are only a few spots mapped out and indicated. There remaineth much land to be possessed, permanently occupied for the Lord, in the almost untrodden wilderness. Amid the Indians of the plains, how mighty a work to be done! along the valley of the Saskatchewan, how many a flourishing village and settlement may we hope to see formed! And among the Esquimaux, how many have yet to be approached! how many, by means of the present converts, may be\n\n* Such as Archdeacon Hunter, now Vicar of St. Matthew's, Bayswater, who penetrated into Athabasca and spent a winter there in 1858.\nreached hereafter among those yet unknown islands of the Northern Sea!\n\nIf such be the object, what would be the weapons with which the warfare must be waged, and on which the hopes of victory must depend?\n\nThe Apostle tells us in this chapter, 'The weapons of our warfare are not carnal, but mighty through God to the pulling down of strongholds.' What, then, is the weapon of mightiest power against all the hosts which may oppose? The reply would at once be, The Word in its life-giving and unchanging efficacy. As the warrior, going forth to the fight, girds on his sword of finest temper, so will those to-day assume afresh 'the sword of the Spirit, which is the Word of God.' It will be delivered to each of them in this sacred service in the words of the great Apostle himself which he addressed to Timothy, as no fitter words can be found for the purpose—'Give heed unto reading, exhortation, and doctrine. Think upon the things contained in this Book. Be diligent in them, that the increase coming thereby may be manifest unto all men.' As shepherds they are to go forth, so to feed the flock with the Word, so to bring back the outcasts and to seek the lost, 'that when the Chief Shepherd shall appear they may receive the never-fading crown of glory; through Jesus Christ our Lord.'\n\nIn how many varied tongues will that Word speak over those regions of the world to which they shall be sent! in how many different dialects and shapes! Sometimes in a completed Bible; at other times in a Gospel or short Epistle; not unfrequently in verses or chapters appealing to the heart and conscience, and telling in short compass the way of salvation. Yet how precious are the fragments of the jewel! How very often are a few leaves of the tree of life made effectual for the healing of the soul's disease!\n\nIf, however, the Written Word, and even portions of it, be thus 'quick and powerful, and sharper than any two-edged sword,' God has promised a large blessing to that other weapon, the Preached Word. In the cases which we are\ninvited to contemplate, it will very generally precede the former. It is impossible to wait until the whole volume be translated—the whole of those Scriptures presented which are 'able to make wise unto salvation.' The explanation of the message of life will be going on while the former process is being carried out. Many an anxious inquirer will come with the desire to know what the Great Book (as they call it) has taught us, and in simple form much of saving truth will be communicated before we have in accurate and amended shape all the 'lively oracles of God.' Nor will the preaching be with the symmetry and regularity of a finished sermon; rather will it be, as was often the case with St. Paul, the reasoning out of the Scriptures, the clearing away of the difficulties of the mind, the feeding with the sincere milk the new-born babes in Christ. After all, the secret will be to seize the opportunity—to be instant in season and out of season—to be ready in boat or tent, by lake or river, to preach Christ.\n\nGuilty, indeed, should I be if I omitted one other weapon which must accompany the Word written or preached, without which either of them will be of little avail; and that, as you readily imagine, is Prayer. This is the great instrument of power with God, in yearning for souls. With our Great Pattern Himself, the weapon in the wilderness in conflict with Satan was the Word—the weapon in the garden was Prayer, when, 'being in an agony, He prayed more intensely.' To plead earnestly with God for the conversion of souls, and to pray much with those converted, would be the very strength of missionary and of ministerial work. 'The Christian armour,' it has been well said, 'will soon rust, except it be furbished with the oil of prayer. What the key is to the watch, prayer is to our graces—it winds them up and sets them going.'\n\nSuch are the weapons which are mighty in attacking the strongholds of Satan. Not, in the cases before us, the strongholds of idolatry—not the strongholds of a refined ancestral superstition; but the strongholds of indifference\nand of ignorance—the strongholds of sin and the natural heart—the strongholds which Satan plants on the confines of the kingdoms of light and darkness, where he is ever watching lest we get the advantage over him. The temptations will, we feel sure, be greater there—they will be all the more subtle and peculiar; those of solitude and isolation, those arising from want of congenial society and Christian friendships, those arising from the sight of heathenism in all its deformity and entire forgetfulness of God. How doubly necessary 'to watch unto prayer'—to maintain the closer fellowship and communion with Him whose work it is—with Him who is ready to say, as of His Apostles of old, 'The spirit is willing but the flesh is weak;' or, as He said to St. Paul himself, 'My grace is sufficient for thee, for my strength is made perfect in weakness.' How necessary ever to realize that, however parted from country, and kindred, and friends, in dwelling 'under the defence of the Most High we abide under the shadow of the Almighty;' that 'in the time of trouble He will hide us in His pavilion; in the secret of His tabernacle He will hide us; He will set us up (and keep us) on a Rock.'\n\nAnd now, Brethren beloved about to be consecrated, a few words may be permitted me as to the special work entrusted to you.\n\nIn going forth to the Saskatchewan, you go forth, Brother, in some degree, to an untried work; and yet we would recognize your peculiar fitness for what lies before you. Canada gave you originally for the work in Rupert's Land. Familiar with Colonial life in the diocese of Huron, you cast in your lot with my successor, and, as friends of early life, you have since laboured together as brothers in winning souls, and in educating and training students for the work of the ministry. You have been naturally selected for that field in which your Colonial experience will be most valuable; where you may soon have many hundreds of settlers around you on the rolling prairies, with an easy and productive soil. While we trust that many a village, with village church and\nspire, and village school, may spring up under your superintendence, forget not the Indians of the plain. Let the remnants of the noble race be sought out and gathered in; visited, as much as may be, in their wandering and roving life; settled down, if God permit, in families and permanent and peaceable habitations. It will be yours to contribute towards the solution of that problem which has, perhaps, received its best illustration within the limits of the Hudson Bay territory—the possible preservation of the Indian race, its reception of the privileges of Christianity, and its participation of the blessings of civilized life.\n\nIn leaving for the more distant sphere of Athabasca, Brother, it is to no untried work that you proceed. It is matter of very deep interest to notice the links in the chain of God's providence, which has guided you to this hour. Nine years ago, to-morrow, it was my happy privilege to preach the Anniversary Sermon of that noble Society which mainly sends you forth. I had then heard that he* who was bearing the standard of the Cross in the most advanced position at Fort Youcon was sinking in rapid decline. I read a touching extract from a letter which I had just received from his nearest fellow-labourer,† in which were these words:—'Oh, plead for us, my Lord, plead with God for men and with men for God, that they may come to gather in the harvest here. The time is short, the enemy is active, the Master will soon be here, and then blessed will those servants be who are found working and watching.'‡ On this I grounded my appeal, and said, 'Shall the minister fall in the forefront of the battle, in the remotest outpost, and shall no one come forward to take up the standard of the Lord as it drops from his hands, and occupy the ground?' These were the words which commended themselves to your heart. You offered yourself to the Society, and within three weeks of your offer you were on your way to the far North-\n\n* The Rev. Robert McDonald, C.M.S.\n† The Rev. W. West Kirkby, C.M.S., then at Fort Simpson.\n‡ See Report of the Church Missionary Society, 1865, p. xxii.\nwest. He who was thought to be sick unto death was raised up, restored, to find you by his side, ready to aid and sustain him in his work.\n\nYou have been there for more than eight years, in labours abundant, and your love has not lessened nor your zeal slackened. You have brought home, as the fruit of your labour, portions of Scripture, prayers, and hymns, in seven different dialects or tongues. You are ready to take the precious treasure out with you—the translations printed and prepared by the Society for Promoting Christian Knowledge. You have also one complete Gospel, that of St. Mark, which the British and Foreign Bible Society has enabled you to carry through the press.\n\nBut you left good treasure behind, in souls warmed with the love of Christ and softened by the Spirit of grace. You have the hearts of the Indians and the Esquimaux. Of the former you know tribes whom I have never seen, and whose tongues I have never heard. With the Esquimaux you have been content to live for weeks in the snow-house which they have built for you, breaking to them the crumbs of the bread of life, and leading them simply and lovingly to Christ.\n\nI have seen some of them at Moose and at York, and had one near me for a time, whom I had hoped to ordain, but illness carried him off far from his home. You know them in their natural home; and I trust that for them a brighter day is dawning. They stretch along the whole fringe of the Northern Coast, from the Straits to the Youcon River. Your plan, which appears to me a wise one, is to get some from Greenland, who have been trained by the Danish or Moravian missionaries, who may be able to assist you in teaching them.\n\nYou are now, I am aware, longing to return, wishing ere winter to be again at work amidst ice and snow. Next week you sail with your little missionary band, and we would not detain you. We would only assure you that you go with the best prayers of God's people, who will follow you step by step to your distant solitary outpost. May His presence and the richest consolations of the Spirit go with you both! It\nis an especial advantage of your Consecration, as on this day, that it ushers in a week of sacred commemoration and solemn anniversaries, during which you will have so much of prayer and earnest supplication offered up on your behalf.\n\nThere is, too, something very touching in the thought that our beloved Church, through her appointed Head, lays the hand on the Esquimaux of the remotest North-west to-day—that they are thus indeed 'sought out, a people not forsaken.' It seems to say, that wherever discovery has carried its search, wherever heroism and bold adventure can penetrate, thither shall we endeavour to follow with the gospel of the grace of God. From this Church two more Chief Pastors are now to be sent forth. From the Archepiscopal Chapel of Lambeth, some ninety years ago,* were sent forth two Bishops to give permanence and stability to our Sister Church in the United States. The two have multiplied, and wonderfully has that Church spread; very many her dioceses (as many now as fifty), stretching from sea to sea. With holy rivalry we have planted our Church in our possessions in the North, and now across a continent we meet her in the North-west. We only ask one boon at her hand—that she should plant a Missionary Bishopric in Alaska; and then shall our united work advance more rapidly by that which each supplieth, the one effort being which shall do the most to gather in a people for the Lord.\n\nThus, Christian friends, after the lapse of eighteen centuries are we still endeavouring to drink more deeply into the spirit of the Apostle's words, and to present before our minds more vividly the responsibilities of the regions beyond. From our Island Home how many the opportunities and open doors—more numerous, we cannot but think, than ever since Apostolic days. In what direction can we look, and not be reminded with almost overwhelming power of regions yet beyond?\n\nChina would point to her teeming millions, and the\n\n* On Sunday, February 4, 1787.\nregions beyond her—to Japan, only beginning to 'stretch out her hands unto the Lord.' India, with a growing measure of light, would beseech us to remember our fellow-subjects—by the very want and famine which weighs her down would loudly call on us to send her the bread of life; and would point to the regions beyond, of Burmah and Thibet. Africa, by the close of a second successful campaign, would ask for free-will offerings from grateful hearts; and, by the hut of the lonely traveller and his dying words, would appeal to us to open a highway for the Gospel from East to West. In South America, save on the coast, how little of light! the messengers of the Gospel only beginning to ascend those mighty rivers and penetrate beyond.\n\nIn our own former land in the North, how unfavourable, it might have been said, the spot first selected, how inaccessible, how unlikely to prove a successful centre of Christian light and life! Yet God has richly and signally blessed it, and seems to have yet larger blessings in store. It is a matter of unspeakable gratitude to myself that, in the nine years of my own retirement from the work, I should have been permitted to take part in the consecration of four Bishops, who will now have the oversight of our Church in that land. It is like living a second life to hear of their successful toil, of the rapid spread of God's truth, and the ingathering of souls to the Redeemer's fold.\n\nWhat, then, would be needful for yet greater triumphs? The Apostle tells us in the verse preceding the text,—the enlargement of your faith; and besides, there must be the uplifting of more earnest prayer, the self-devotion of many more men baptized afresh by the Spirit, the consecration of yet larger gifts to the treasury of the Lord. I need scarcely ask you for such offerings to-day. Remember those before you in prayer, remember them by your gifts. And let the inscription on the banner of our Church be ever clear, and legible, and bright, that hers is the call, the privilege, the high mission 'to preach the Gospel in the regions beyond.'\n\nLondon: Printed by JOHN STRANGEWAYS, Castle St. Leicester Sq.\ngoing to 'stretch\nthe following measure\nto the new-subjects—\nfor down would\nnot be there; and would\nnot be there. Africa,\nwould ask for\nthe hut of the\nappeal to us to\nIn South\nthe mess-\nthose mighty\n\nunfavourable,\nhow inacces-\nof Christian\nblessed it,\nstore. It is a\nin the nine\nI should have\nof four Bishops,\nin that land.\nsuccessful toil, of\nof souls\n\ntriumphs?\n—the\nmust be the\nmany\nconsecration of\nneed scarcely\nthose before\nAnd let the\never clear, and\nprivilege, the\nbeyond.'\n\nLeicester Sq.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_10312.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 25, "total-input-tokens": 42420, "total-output-tokens": 7472, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 944, 3], [944, 3425, 4], [3425, 3425, 5], [3425, 3791, 6], [3791, 3791, 7], [3791, 4157, 8], [4157, 4157, 9], [4157, 4389, 10], [4389, 4389, 11], [4389, 5870, 12], [5870, 7862, 13], [7862, 9951, 14], [9951, 11971, 15], [11971, 14142, 16], [14142, 16176, 17], [16176, 18257, 18], [18257, 20344, 19], [20344, 22461, 20], [22461, 24548, 21], [24548, 26533, 22], [26533, 28673, 23], [28673, 29169, 24], [29169, 29169, 25]], "primary_language": ["en", "en", "en", "en", "None", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]