[{"id": "5edf11235e4db09063a8cb553f75d1bee87aa18c", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [x] Bound with other material/\n- [x] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Additional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|----------------|-----|-----|-----|-----|-----|-----|\n|                | 12X | 16X | 20X |     |     |     |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couverture de couleur\n- [ ] Couverture endommagée\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Le titre de couverture manque\n- [ ] Cartes géographiques en couleur\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Planches et/ou Illustrations en couleur\n- [x] Relié avec d’autres documents\n- [x] La reliure serrée peut causer de l’ombre ou de la distortion le long de la marge intérieure\n- [ ] Il se peut que certaines pages blanches ajoutées lors d’une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n’ont pas été filmées.\n- [ ] Commentaires supplémentaires:\n\nLes pages totalement ou partiellement obscurcies par un feuillet d’errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole — signifie \"A SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nEDUCATION AND LIFE.\n\nAN ADDRESS\n\nDelivered at the Opening of the Thirty-second Session of Queen's University, Kingston, Canada,\n\nBY\nJOHN WATSON, M.A.\nProfessor of Logic and Ethics.\n\nPublished by the Alma Mater Society of Queen's University.\nADDRESS.\n\nIt is an opinion somewhat widely diffused in this country that the higher education, which it is the special object of such an institution as this to give, is only useful to those who are about to enter upon a professional career. It may be of importance to those who are to be placed in a sphere of life which demands at least a moderate amount of scholarship, to spend a number of years at a university, but for those who are to be engaged in the practical work of life such a training is unnecessary; it ranks at best no higher than a graceful accomplishment, and may therefore—perhaps advantageously—be dispensed with. It may be fit and proper that the clergy should have a classical education, so that they may be enabled to avail themselves of whatever new light the original documents shed upon the scriptures, and to consult those early Christian writers who made the Latin tongue the vehicle of their thoughts; it may be advisable for students of law to study that wonderful system of jurisprudence, which was won for us by the experience and sagacity of ancient Rome, in the language in which it was written; medical men may find it of advantage to have a tolerable acquaintance with Latin, and some knowledge of Botany and Chemistry, as well as of those subjects which are more directly connected with their common duties; but for non-professional men, who have to deal with the practical affairs of life, such a training is quite superfluous. A good commercial education, in fine—such an education as is supplied by the public schools—is the best preparation for an active life\nof business, and no other is requisite or beneficial. That this is substantially the theory held by a large number, either tacitly or openly, is evidenced by the conspicuous absence from our universities of all, or almost all, except those who are destined for one of the learned professions.\n\nThe assumption that underlies this way of thinking is, that the proper discharge of a particular office is all that can be demanded or expected of any one, and, as a consequence, that no education other than what is required for this end is needed. But, in the first place, is not this pre-supposition incompatible with the conditions of life as they exist in a civilized community? And is not the theory of education based upon it therefore untenable? If it can be shown that society, as at present constituted, would fall to pieces if we granted the validity of this view, we cannot but suspect that the conception of life it involves is fundamentally imperfect, and the superstructure raised upon it weak and unsafe. If it is impossible to exist in a state without being more than a mere instrument of business, and therefore without some extra-technical knowledge, we must conclude either that modern society is based upon an essentially false principle, or that the theory is itself radically unsound. And, secondly, even if such a theory is capable of being practically carried out, we must still ask whether the fulfillment of its conditions is really desirable and fitted to secure the highest good of mankind.\n\nIs it possible, then, let us ask, for men living under the complex civilization of modern times to limit themselves entirely to their practical avocation in life? The very asking of this question is almost sufficient to show that only a negative answer can be given. I shall not insist upon the evident fact that the existence of the family and the responsibilities it entails is an essential condition of modern society, and that this of itself involves relations distinct from those of business. It is of more importance for our present purpose to point out that there are social and political duties from which we can only escape by giving up life itself. As citizens we must interest ourselves, in every opportunity to which we may be necessarily called, in the advancement, improvement, and prosperity of our country. And, as nothing less than the utmost effort of the most cultivated intellects and judgment, and the closest attention and notice and consideration, may throw light upon the subject, doing we anything less will lead to a confusion and perplexity and confusion which could not be removed by his people. We must, if the proper exercise of the possibility of the mind affect the welfare of such topics as the government and representatives of the people, of securing the rights and exercise of the people, men be convinced of the will of the people, and lead in the discussion, pains to express their opinions and feelings to the point where they can hope for the widest acceptance and prosperity of the measures proposed.\nourselves, directly or indirectly, in the welfare of the community to which we belong. As members of the state we are necessarily, from the very nature of our representative government, immediately interested in the prosperity of our country. And, as no civilized nation can now live the isolated life which was possible in ancient times and under a simpler order of society, we must enlarge our field of view so as to take in the condition of mankind at large. A thousand questions of the utmost importance, and of a character so intricate as to require the most cautious consideration and the most finely balanced judgment, are thus continually pressing themselves upon our notice and demanding a rational answer. It is true that we may throw our individual responsibility upon others, but in so doing we act in a way that, if universally carried out, would either lead to a despotic form of government or to the direst anarchy and confusion. It is evident, therefore, that modern society could not exist if the assumption that man's duties are bounded by his peculiar avocation were consistently acted upon. And if the progress of civilization has entailed upon all the responsibility of taking a personal interest in those subjects which affect the common weal, the importance & correct views on such topics is clearly undeniable. In a country in which government is practically vested in the people, whose representatives act in accordance with their wishes, the only means of securing a thoroughly wise legislation is by the possession and exercise of a high intelligence by the people. Let statesmen be ever so wise, they cannot act in direct violation of the will of their constituents. They may, and often do, take the lead in the reform of abuses, but only those of them who take pains to make themselves acquainted with the prevalent opinions of the country, or who have the faculty of foreseeing the point towards which public feeling is insensibly drifting, can hope to bring forward measures which will find general acceptance and be productive of beneficial results. The prosperity of a country, therefore, it may be stated broadly, is measurable by the collective wisdom of its people. If they are\napathetic and indifferent in regard to questions of public importance, the nation sinks into a contemptible obscurity; whereas a strong and healthy interest in such questions is at once the evidence and the cause of ever-increasing prosperity.\n\nNow, can a high public intelligence be produced by a merely technical training? Evidently not. As a matter of fact, an exclusively technical training is inevitably hostile to wide and liberal views; tending as it does to superinduce a host of personal or class prejudices. This distortion of judgment clearly requires to be counterbalanced by a kind of education, which, by widening the field of observation, will generate the habit of considering, in all cases, not merely what seems most beneficial to one's self, or even one's country, but what will conduce to the elevation of the race. What is the best mode of providing this antidote to narrowness of judgment I shall afterwards enquire. Enough has been said to show that purely technical knowledge is impossible without an entire revolution of the present order of society. Men are compelled to form judgments upon questions that have no evident connection with their ordinary work in life; and unless we are prepared to say that, while it requires a special training to form correct judgments in regard to business matters, the decision of the still more complicated questions of social and political life may be safely left to chance, we must admit that some kind of liberal education is essential for the fit discharge of those duties which a man owes to his fellow-citizens, to his country, and to the world. The choice forced upon us really is, whether the settling of grave and important questions is to be left to accident and caprice, or whether wisdom does not counsel us to adopt the more rational course of so developing the intelligence of the country as to render habitual a liberal and far-reaching method of thought. Which of these alternatives it is right to accept, no one can for a moment doubt.\n\nStarting from the assumption that modern society rests upon sound principles, we have seen that a training other than technical is essential to the general welfare; and I shall now\nendeavour to show, by a closer investigation into the relation of education to life, that the theory, which assumes that the only object of education is to fit each man for best discharging his peculiar avocation, implies a totally false conception of human existence. It is an indisputable fact that all those characteristics which go to make up an advanced civilization—organized industry, liberal institutions, high intellectual and moral life—are displayed in their greatest perfection by the Teutonic races. We might almost conclude, therefore, without further investigation, that the zealous cultivation of trade and commerce naturally develops the various powers of man to a high degree of perfection. We do not, however, require to content ourselves with this rough generalization, which might after all be fallacious; we can discover the reason as well as the fact. A comparison of modern society with the condition of man in his lowest stage shows that in the former there is a remarkable degree of complexity as compared with the latter. Men are now drawn into much closer relations, and are more dependent upon each other, than in a more primitive mode of life. The savage who lived by hunting and fishing was almost entirely independent of others. He was only moved to activity by the cravings of natural appetite, and as soon as these were temporarily allayed he relapsed into a state of apathy and indolence. His wants being almost purely animal, and his desires of the simplest kind, he was able to unite in his own person those numerous occupations which are now required to supply the necessities of life for even a single person. It is true that even at this earliest stage absolute independence was impossible. Children had to be nourished until they were capable of providing for their own wants, and thus the germ of the family relation was implanted; while the necessity of seeking the help of blood-relations for defence against enemies tended to knit men together into tribes. But, with these exceptions, the savage was independent of others. This simple mode of life is now completely altered. We are dependent in a thousand ways upon others for our daily sustenance, as well\nas for those many comforts and requirements, without which we can hardly conceive of life as even tolerable. Is this state of things more truly beneficial than that simple mode of life which partially survives amongst existing savage tribes? It undoubtedly is; nor is the reason far to seek. It is only by mutual dependence upon each other that the best powers of men are called forth into exercise. Wide-spread industry tends to eliminate purely self-referent interests; by bringing men into more intimate relations with each other, it generates that mutual trust and confidence which result in a healthy tone of public morality. The individual freely contributes his share of labour for the good of the whole, and is rewarded by finding that he has himself unexpectedly gained in the elevation of his own nature. The seeming sacrifice of independence is really the condition of the only independence that is worth having.\n\nCompare the condition of a baron of the feudal times with that of his modern representative, and you cannot fail to be struck by the contemporaneous development of industrial arrangements and social morality. The principle of feudal times was that only by an elaborate system of defence, and by continual vigilance, could life and property be protected, and that it was vain to expect men to work for the benefit of others except under the influence of constraint and fear. The baron had his moated castle, with its secret passages and dungeons, its drawbridge and portcullis, its men-at-arms and sentinels; while he had a rooted conviction that he could have his wants ministered to only by the keeping of serfs. And yet the peer of today is more secure, without any defensive appliances, than the baron with his embattled tower, and better served by free labourers than he would be by the enforced toil of serfs. With the development of social industry has grown up mutual trustfulness between all ranks and classes; with the liberation of the masses, greater energy, industry and unselfishness. Carlyle, indeed, has said that the principle of modern society is \"freedom, without bond or connection except cash payment,\" while in feudal times men were united by the \"bond of honour.\"\nagainst this implied inferiority of these, as compared with past times, I emphatically protest. The so-called \"bond of honour\" was in reality a bond of force. The feudal lord was perpetually at war with his neighbours, and had to guard continually against the treachery of inferiors; his vassals were forever quarrelling amongst themselves. Nor is it one whit truer that cash payment is now the only bond of connection; the real nexus is commercial honesty and trustworthiness—a kind of \"honour\" infinitely higher than the sulky submission of a baron to his suzerain, or the stupid obedience of a serf to his feudal lord. It is true that this mutual trust, which is the very condition of an industrial system, opens up the way for a violation of faith; but this is the exception and not the rule, or society could not exist for a single hour. It took the world some thousands of years to learn the lesson that the good of all classes is best secured by the freedom of each. The principle ancient as of medieval society was that the forcible subjection of the lower classes is essential to the well-being of the upper; the industrial system of today assumes that higher results are attained by free contract and voluntary labour. So long as the lawful claim of every man to be free was denied and set at naught, human nature was cramped and impeded in its natural development; with the recognition of the inalienable right of freedom, a new state of things was inaugurated, which, though to this day it admits of indefinite improvement, must ever remain the basis of all future progress. The ultimate justification of an industrial system is therefore really a moral one. Any theory which would resolve it into some principle lower than this—the production of the essentials, the comforts and the luxuries of life, the accumulation of wealth, or any similar end—is essentially false, because it fails to gauge the actual or possible nobility of human nature. The satisfaction of our needs! the delectation of our tastes! Man certainly has by nature such cravings, which he instinctively seeks to gratify. But that he has any right to such gratification depends entirely upon whether his higher nature demands it or\nnot. His higher nature does so; and herein lies the justification of the ministering to needs and tastes and pure pleasures; herein lies the justification of an industrial system, which, springing at first from our lower nature, is found to minister to our higher. Whatsoever aids man in purifying the lower and selfish part of his nature, and in reaching up to his full intellectual and moral stature—that has a right to exist; all else will ultimately, by the law of the universe, perish and drop into nothingness. Let it be shown that the simpler life of primitive society produced more perfect men, and it would be our duty to set about destroying the products of long centuries and of the toil of millions—our skillfully constructed machinery, our noble buildings, our wide-reaching commercial arrangements, and to return to the huts and rude life of savages. We cannot, however, thrust back the tide of civilization to its source; and that not merely because we are too indolent to throw off the habits of modern life, but because, having emerged into a purer atmosphere and a clearer light, we cannot go back to the rude and stifling abodes of our forefathers. The industrial life of modern times, with all its imperfections, is more fitted to nourish and develop the intellectual and spiritual life of the individual, and to foster a high tone of public morality, than any other; and in this alone lies its right to exist.\n\nThe principle which we have discovered to be the true end of practical life—the principle that society, in its industrial aspect, exists for the purpose of evolving the mental and moral and spiritual powers latent in human nature—is also the key to a true conception of education. One of the greatest of ancient philosophers, with that wonderful insight into human life for which he was distinguished, sketched an ideal State, the ruling idea of which was that all its energies should be directed towards the physical, intellectual and moral training of its members. And not only did Plato rightly view the state as one vast educational establishment; he also saw that, if it is to be as nearly perfect as the inevitable failings of humanity\nwill allow, there is required some special training of a theoretical kind, in addition to that afforded by a life of industry. For while practical life is undoubtedly essential to the well-being, at once of the individual, of society and of the race, it leaves much of our nature undeveloped; and in so doing really tends to its deterioration. The mind of man is of such a nature that the absence of what is essential to its highest perfection produces a proportionate degradation in other respects. What is not for it is against it. If it is not trained in the proper direction, it inevitably seeks a downward path for itself. If it is not filled with great and ennobling thoughts, it will seek to find satisfaction in what is mean, and petty and evanescent. The fundamental mistake of a purely technical education is, that it tends to concentrate the mind upon what is exclusively personal, and thus to warp the judgment by a variety of prejudices. And this is especially the case with those who are engaged in commercial affairs. The members of the learned professions, while they are by no means freed from the danger of narrowness of thought, find a certain safeguard against it in that breadth of view which all intellectual labour has a tendency to foster. It is otherwise with those devoted to business, where the temptations to indulge in inordinate self-interest are peculiarly strong; and hence they, above all others, require such a training as will counteract this unhappy bias. What is needed is an education other than practical life supplies, which, by raising the mind above purely personal or class interests, and fixing it upon more impersonal subjects, will generate a love of all that is fitted to elevate mankind, and to hasten on the progress of humanity. Men, if we will properly consider it, fall into errors of judgment not so much from imperfect reasoning, as from the want of a sufficiently commanding point of view and of a more comprehensive sympathy. It is vain to say that unselfishness is a thing of the heart and not of the head. This is true in a certain sense, but not in any way that affects the present argument. It is undeniable that culture sometimes serves no better purpose, than to\nminister to personal vanity or to promote self-interest. But just as social industry is not a curse because it renders dishonesty possible, so neither is education to be decried because it is sometimes abused. Ignorance has an inevitable tendency to foster evil, and it may be doubted whether well-meaning but foolish persons do not produce as disastrous effects upon society as the deliberately vicious. The absolute division between the head and the heart, the mind and the soul, so frequently made, is a false and pernicious one. The two are so inseparably united, and so act and re-act upon each other, that an imperfection in the one leads to a corresponding imperfection in the other. Crude, hap-hazard notions lead to social confusion and disorder; a rational and scientific way of thinking to order and prosperity. If the choice really lay between the pious although ignorant and the cultured but vicious, there is no right-feeling person who would not prefer the former. But the real question is whether the interests of society will be best promoted by an intelligent and cultured people or by a prejudiced and unlettered mob. It is impossible, as we have already seen, to escape from the duty of forming judgments on those many questions that affect the welfare of the community; and when it becomes a question whether the most important topics are to be dealt with in a rational and comprehensive way, or left to the mercy of chance and prejudice, who can hesitate for a moment as to which of these alternatives he will accept?\n\nNow it is the peculiar glory of the training which it is the office of a university to supply, that it is eminently calculated to counterbalance the prejudices attendant upon practical life, by generating the habit of taking a wide survey of human life and action. A brief consideration of the nature of the studies comprehended in our curriculum will make it abundantly evident that they are fitted to liberate the mind from the limiting influences of a purely technical education, and to appeal to the universal side of man's nature. The subjects by which such an institution as this seeks to assist those who sincerely wish to gain the priceless treasure of truth, are natu-\nly divided into three classes—natural science, philosophy and philology. Very little need be said in regard to the importance of physical science. However much so-called \"practical\" men may be disposed to undervalue other departments of knowledge, there at least the immense advantages are too palpable to be overlooked. Without the apparatus which science has placed at our disposal—our ships, railroads, machinery, telegraphs—civilization would have stopped centuries ago. What a wide interval is there between the feeble powers of reckoning of primeval man and the intricate demonstrations of Euclid! From Euclid and Archimedes to our own times—nay, from Kepler and Newton to Herschel and Faraday—what brilliant discoveries have testified to the nobility of the human intellect, and opened up worlds of beauty and grandeur, beside which the first vague imaginations of an earlier time are flimsy and superficial! A contemplation of the gradual but steady progress made from the first crude notions of the untutored man, who cowered in fear and trembling before the unintelligible moods of Nature, to the calm, reverential knowledge now possessed of the inner necessities which regulate her aspects, cannot fail to afford a perennial source of wonder and delight. We are sometimes called upon to bow before the sublimity of the universe as shown in the countless worlds that lie on the bosom of illimitable space; but, awe-inspiring as this spectacle is, do not the changeless laws by which those mighty orbs are indissolubly linked together and move in ordered harmony and majesty, teach a lesson nobler still? Can any consideration of the mere number of the stars awaken such an exalted feeling as the perception that the tiniest globule of dew that glitters in the sunlight is the centre of a circumference of forces too vast to be limited or imagined? Although science turns away from the infinite variety of form and colour, and the beautiful play of light and shade, which nature presents to the eye of sense, it reveals a beauty of another and higher kind—the stern beauty of thought, of order and law, of harmony and system amidst seeming disorder and incoherence. And, as the\nboundaries of science are pushed ever further and further back, with what new delight does the student of nature discover that sciences, believed to be disconnected, complement and harmonize with each other, and that laws which seemed at first distinct, are but divergent instances of a higher law! Nor are the advantages of the study of nature intellectual merely. Science not only impresses upon us how wonderfully all nature hangs together, and thus enlarges our view beyond our own petty domain, but it assists in teaching us the all-important lesson of self-sacrifice. The scientific discoveries that have made man the lord, instead of the slave, of nature, are the result of no fortunate stumbling upon truth, but of the most painstaking and sedulous inquiries; for only those whose unswerving devotion has proved them to be worthy are permitted to lift the veil of nature. The illustrious discoverers, who have done so much to benefit their race, had to give up repose and ease for severe mental toil, and—what is much more difficult—to surrender long-cherished opinions and prepossessions at the demand of truth. He who seeks, with singleness of purpose, to discover the secrets of nature, must throw aside all fancies and guesses that will not harmonize with fact, however long and fondly he has cherished them. He may \"scorn delights and live laborious days\" in the eager desire to verify a favourite hypothesis, and, finding after all that he has not seized the right clue, be compelled to begin his labours afresh. If we consider all the sacrifices which have thus been made by men who so yearned for truth that no false glare could induce them to swerve from their direct path, surely we at once gain high views of life, purify our minds by contact with genuine nobility, and learn the moral lesson that \"we are made perfect through suffering!\"\n\nThe study of the outer world is one great means of developing and strengthening the intellectual and moral powers; but, marvellous as are the wonders it discloses, it is insufficient to satisfy all the cravings of the human mind. The progress of natural science is at the same time the development of thought.\ninterpreting visible things, we reason by certain processes, and make use of certain intellectual forms; and the time inevitably comes when these processes and forms are made the subject of special investigation. Man is to himself the centre of all things. Within him is a world of thought that mirrors the forms and laws of external nature, and a world of feelings and desires, that join him by spiritual bonds to his kind, and aspirations that finite and temporal things are insufficient to satisfy. He cannot search into the nature of thought without finding that he is more closely related to the outer world than he at first supposed; he cannot study his social sympathies without perceiving that deep in his spiritual nature lie the impulses which give rise to society, and lead to the consciousness of moral obligations; nor can he adequately explain his noblest longings without tracing them up to their source in the Infinite.\n\nThe origin of philosophy lies in the felt necessity of obtaining some solution of the problems thus opened up. \"The Philosopher,\" as Goethe remarks, \"is he who stands in the centre; to him the lowest must ascend, and the highest come down.\" The rudiments of those fertile studies, whose end is to discover the relation of man to the world, of the individual to society, and of the finite to the infinite, are dimly perceptible at a very early stage of civilization. And as the physical wants come to engross less attention, the feeble consciousness of man awakens to higher life, and his nature, duties and destiny become all-absorbing topics. In the oldest written documents of the race we find deep glimpses into truth curiously interblended with fantastic imagery and puerile superstitions. But at length thought begins to predominate over fancy, reason to usurp the place of imagination; and henceforth philosophy, having learned her true mission, advances without interruption on her onward course. Here, also, as in the realm of natural science, we learn how one generation of thinkers prepares the way for the next. The history of successive systems is not, as is sometimes averred, a record of repeated failures; contemporaneously with the progress of the race, philosophy makes ever nearer\napproaches to truth. No one who has gone over the field with that zeal and devotion which a love of truth always inspires, but has found himself enriched by more elevated views of human life, attuned to higher reverence, and imbued with deeper and more comprehensive sympathy.\n\nHand-in-hand with the development of thought and civilization goes the improvement of language in definiteness, depth and luxuriance. The study of the language of a people is at the same time a study of the thoughts, feelings and motives that sway and govern it. For thought and language are so intimately connected as to be almost inseparable. Without the faculty of embodying our ideas in words, we should be unable to rise above the simple sights and sounds of nature to comprehensive views of human life. Thought is the soul, language the body; and both are essential to the evolution of the powers latent in human nature. As civilization increases, as thought becomes more and more definite, language becomes ever more precise and specific. Ideas that at first hung in a wavering, nebulous mist, settle into shape, and the symbols of those ideas also obtain greater clearness and definiteness. It is this symbolical power of speech which constitutes its essential value as an instrument of human progress. But, like all kinds of symbolism, language brings with it a peculiar danger. It is a characteristic of the symbol that, when it has once come into existence, it is exceedingly tenacious of life; so much so that it clings to existence even after the thing it represents has passed away. When this takes place it becomes a hindrance instead of an aid. Of all kinds of symbolism, language is peculiarly liable to this imperfection. Certain distinctions, of great importance at a given time, and expressing the highest intellectual advance then made, are embodied in words; and henceforth it is practically assumed that the ideas conveyed by those words are placed beyond the region of doubt and criticism. Even after it has become apparent to the few that those ideas are imperfect, and must give place to higher notions that embrace and transcend them, the majority cannot be made to\nunderstand, or only with the greatest difficulty, that distinctions which have become imbedded in popular language may require to be surrendered at the bidding of maturer reflection. This tyranny of language needs to be guarded against; and in what better way can this be done than by studying the speech of peoples of a past age, who are so far removed from the general habits, modes of thought and principles of judgment of our own time that we are compelled to re-think, at every step, the ideas their language was intended to convey. Nor is this awakening of earnest, critical thought, the only advantage derivable from the study of language. Philology unites with science and philosophy in pointing to the essential unity of all mankind, showing how nations dwelling far apart, and the most diverse in habits, customs and ideas, are bound to each other by the ties of kinship, and how the influences of the remote past are working themselves out in the private and social life of to-day. It is of no mean importance to be enabled to reproduce, with vividness and clearness, the ideas and feelings and deeds of long-vanished generations, who have helped us onward to all of good we now possess. It was by dint of hard toil that they won for themselves those principles of practice, polity and social justice, which to us seem self-evident because of our familiarity with them. This is especially true in regard to those two nations of antiquity which, more than any other, have made us what we are. What science or art is there whose origin or improvement is not due to Hellenic culture? What system of legislation which does not owe its perfection to the basis laid by imperial Rome? To estimate rightly the great men of our own land, we must study the masterpieces of poetry, oratory and history saved from the splendid wreck of ancient Greece and Rome. The study of language is, therefore, of the utmost importance; and the wonderful discoveries in philology, made within the present generation, render it doubly so. Recent investigations have shown that the languages spoken in the larger portion of Europe are traceable to the East. It is becoming more and\nevident that the unity of man may be traced to ages the most remote. Languages which had apparently dropped into eternal silence have again become vocal, and disclosed the doings, thoughts and aspirations of men who sank to rest five thousand years ago. In the light of these facts who shall deny that the history of language, like the discoveries of science and the speculations of philosophy, are eminently fitted to strengthen the intellect, expand the sympathies, and elevate the moral nature of man?\n\nThe inference to which the foregoing considerations legitimately lead will have already suggested itself to you. The notion that man must be regarded solely as an instrument for the discharge of a particular office has been shown to be incompatible with the true dignity of human life. In addition to this narrow and limited side of man's existence, there is a more comprehensive and universal aspect under which he must be viewed. He is not only a member of the state, who has a peculiar work to perform; there is also a side of his nature which belongs to him simply as a member of the human race. The various appliances of life appeal either to the particular or the universal side of his nature; practical life more to the former, theoretical more to the latter. Both are indispensable for the education of man's complex nature, for the evolution of those intellectual, moral and spiritual qualities which it is the aim of human existence to raise to their highest excellence. In view of this wide and comprehensive view of human thought and action, there is no distinction of persons; and nothing would more tend to the higher elevation of the individual, and the quickened advance of the race, than the participation of all men in liberal as well as technical education. I see no prospect of a speedy fulfilment of this desirable object. Until there is some readjustment of the relations of capital and labour, or until the right of every member of the State, whatever his rank or condition may be, to the advantages of the highest existing education is recognized, we must content ourselves with an approximation to the ideal of society I have attempted\nEDUCATION AND LIFE.\n\nto set before you. But surely we might, even in the necessarily imperfect state of society that now exists, come nearer to this ideal than we have hitherto done. Many are excluded from the advantages that a liberal training is fitted to impart, and which almost nothing can afterwards counterbalance or replace, because public opinion has not yet risen to a conviction of the importance of the problem. That this state of things will pass away, and with it much of that immaturity of opinion on great questions which it were vain to deny, I confidently anticipate.\n\nYou, gentlemen, to whom glimpses into subjects of great interest and importance are opened up by the range of studies here placed at your disposal, may well feel grateful for the privileges you enjoy; and it remains with you to decide whether they shall be the source of perennial satisfaction to yourselves, and of blessing to others, or whether at the end of your course you shall look back to misspent time with vain regret. You have the option of leading a life of self-indulgence and inertness, the result of which will be a permanent loss of self-command and a gradual deterioration in character, or of manfully facing those unwelcome difficulties which lie in your path, but the overthrow of which will instil into you increased strength and vigour. One of the greatest writers of this century has said that in all God's universe there is no room for a single idle man; and of this you may be assured that, whatever your future walk in life may be, zealous and conscientious toil will bring with it its own exceeding great reward. Be not misled by the stupid fallacy that your failure in duty will be hurtful only to yourself. No man liveth to himself—no man dieth to himself. The influence for good or evil which each of you may exert upon others is incalculable. You are at an age when you may, in great measure, choose what your future life will be—whether it will be the noble life of a Christian and a man of culture, or the purposeless existence of the self-indulgent and ignorant; whether you will be enlightened guides and counsellors of others, or blind leaders of the blind.\n\"The future hides in it\nGladness and sorrow;\nWe press still thorough,\nNought that abides in it\nDaunting us,—onward.\n\nAnd solemn before us,\nVeiled, the dark Portal,\nGoal of all mortal:\nStars silent o'er us,\nGraves under us silent!\n\nWhile earnest thou gazest\nComes boding of terror,\nComes phantasm and error,\nPerplexes the bravest\nWith doubt and misgiving.\n\nBut heard are the Voices,—\nHeard are the Sages,\nThe worlds and the Ages:\n'Choose well, your choice is\nBrief and yet endless:\n\nHere eyes do regard you\nIn eternity's stillness;\nHere is all fulness,\nYe brave to reward you;\nWork, and despair not.\"\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_32332.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 27, "total-input-tokens": 43256, "total-output-tokens": 9646, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2113, 3], [2113, 4552, 4], [4552, 4552, 5], [4552, 4793, 6], [4793, 4793, 7], [4793, 6393, 8], [6393, 9449, 9], [9449, 11663, 10], [11663, 13861, 11], [13861, 16063, 12], [16063, 18274, 13], [18274, 20488, 14], [20488, 22662, 15], [22662, 24887, 16], [24887, 27106, 17], [27106, 29293, 18], [29293, 31462, 19], [31462, 33698, 20], [33698, 35869, 21], [35869, 38035, 22], [38035, 40202, 23], [40202, 42381, 24], [42381, 42981, 25], [42981, 42981, 26], [42981, 42981, 27]], "primary_language": ["None", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]