[{"id": "10e576d81d10615ab7476cb36eed5588ac84cdbd", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| 10X | 14X | 18X | 22X | 26X | 30X |\n|-----|-----|-----|-----|-----|-----|\n|     |     |     |     |     |     |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n☐ Coloured pages/\nPages de couleur\n\n☐ Pages damaged/\nPages endommagées\n\n☐ Pages restored and/or laminated/\nPages restaurées et/ou pelliculées\n\n☐ Pages discoloured, stained or foxed/\nPages décolorées, tachées ou piquées\n\n☐ Pages detached/\nPages détachées\n\n☐ Showthrough/\nTransparence\n\n☐ Quality of print varies/\nQualité inégale de l'impression\n\n☐ Includes supplementary material/\nComprend du matériel supplémentaire\n\n☐ Only edition available/\nSeule édition disponible\n\n☐ Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\nLes pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nThe following items have been microfilmed at reduced size because of their condition:\nThe following items have been microfilmed at reduced size because of their condition:\n\nOriginal pages beginning with... The following pages have been omitted from this reproduction because they are not of sufficient interest to require filming:\n\nThe following pages have been omitted from this reproduction because they are not of sufficient interest to require filming:\n\nMarginal notes and similar items have been omitted from this reproduction because they are not of sufficient interest to require filming:\n\nMarginal notes and similar items have been omitted from this reproduction because they are not of sufficient interest to require filming:\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nOBSERVATIONS D'UN CATHOLIQUE\n\nSUR\n\nL'HISTOIRE DU CANADA\n\nPAR\n\nL'HONORABLE WILLIAM SMITH.\n\n(Extrait de la Gazette de Québec du 11 janvier 1827.)\nOBSERVATIONS &c.\n\n(Extrait de la GAZETTE DE QUEBEC du 11 janvier 1827.)\n\nQuæ venit indignè, pana dolenda venit.\n\nM. l'éditeur,\n\nQuiconque a suivi d'un œil attentif les événements qui se sont succédés en ce pays, depuis sa conquête, est pleinement convaincu des efforts combinés et constants de la prévention et de la malveillance, pour dénigrer les Canadiens, déprimer leurs institutions, et jeter un nuage sur leur religion. D'abord, et assez longtemps, leurs traits ont été signalés et lancés à la faveur des ténèbres; ensuite elles ont osé, mais par degrés, et avec certains ménagements proportionnés aux différentes époques, découvrir leurs batteries cachées; et voilà qu'elles ont fini par jeter tous les masques, pour se montrer sous leurs formes les plus hideuses.\n\nL'homme sage et réfléchi contemple, avec pitié, les anecdotes indécentes et mensongères, lancées périodiquement contre nous dans certaines feuilles vénale; il lit de sang-froid les assertions absurdes de quelques journaux, dirigés par des individus obscurs; et il s'égaie parfois aux dépens de ces étrangers voyageurs, qui ne visitent de notre Canada qu'une partie du fleuve et nos deux villes principales, et qui dans leurs descriptions, comme dans leurs routes, se suivent moutonnièrement. Mais lorsqu'il voit se ranger sous les drapeaux de nos ennemis, des citoyens respectables, dont quelques-uns vivent au milieu de nous depuis près d'un demi-siècle, des hommes qui y tiennent un rang distingué, et qui ont souhaité être loyales aux justes, c'est alors qu'il rentre sérieusement en lui-même, qu'il se livre aux réflexions accablantes, et que dans sa douleur il écrit avec le poète:\n\nQuæ venit indignè, pana dolenda venit.\n\nSi mon âme, en ce moment, est en proie à des émotions profondément senties, elle les doit à cet ouvrage qui voit le jour sous le titre d'Histoire du Canada, etc., et auquel notre concitoyen M. William Smith a eu le rare courage d'attacher son nom. Cette production, si singulièrement informe sous tous les rapports, et si mystérieusement mise au jour après dix années de sommeil, nous annonce sans détour les souhaits et les intentions de nos ennemis. Elle met en évidence cette vérité, non encore avouée ouvertement, que la conspiration commencée à la conquête sous les ombres, et qui se poursuit aujourd'hui au grand jour, avec une violence qui ne connaît plus de mesures, tend directement à affrager de déloyauté le peuple canadien, et à anéantir sa religion.\n\nJe ne puis, M. l'éditeur, faire un volume, et je sais qu'un journal ordinaire ne pourrait accueillir le demi quart des réclamations à faire contre cette nouvelle histoire du Canada. Dans cet embarras, j'ose appeler à l'aide votre feuille, toujours ouverte.\nau malheur et à l'innocence, pour signaler au moins quelques-uns des passages les plus palpablement frappés au coin des passions haineuses. Et pour abréger davantage, je m'attacherai seulement à quelques-unes des inculpations les plus salissantes contre nos maisons religieuses, nos institutions saintes, et les membres de notre clergé ; lesquelles inculpations se dirigent naturellement, et suivant l'intention dernière de l'auteur, contre cette religion si vénérée des Canadiens, et si chère à leur cœur.\n\nJe ne me permettrai qu'une seule exception en faveur d'un passage remarquable, qui se lit à la page 46, 7e vol. L'auteur, en y parlant des aborigènes de notre continent, affirme qu'ils n'ont pas de dieu, ni田野, ni même qu'il n'a aucune idée de la Divinité : \"not the smallest notions of God.\" Cette assertion, dans sa généralité, et en tant qu'elle regarde l'époque de la découverte de l'Amérique, est démentie par tous les monuments de l'histoire. De Acosta, Robertson, Charlevoix, Lafitte, Lescargot et une foule d'autres parlent de temples, d'offrandes, de sacrifices, de prêtres, etc. Quant aux temps postérieurs, se peut-il que l'auteur ignore que la lumière de l'Evangile ait éclairé notre hémisphère (à l'exception des pays découverts dans les dernières trente et quelques années) depuis la Bale d'Hudson jusqu'à la Terra del Fuego ? N'aurait-il jamais entendu prononcer le mot de Paraguay, dont les institutions politiques, appuyées sur des bases religieuses, offraient naguère un miracle sans exemple dans les annales du monde ? ni lu nulle part combien d'hommes apostoliques ont sacrifié leurs vies pour planter la foi dans la portion sud de notre continent, dont les naturels, avec très-peu d'exceptions, ont reçu l'Evangile ? Mais enfin, la mémoire de l'historien du Canada l'aurait-elle trahi, même sur son propre terrain, au point de lui avoir fait oublier que nos missionnaires ont, à différentes époques, arrosé de leurs sueurs et de leur sang ces pays immenses baignés par nos mers méditerranées, par nos grands fleuves, par ceux du Mississippi, de l'Ohio, etc., etc.? Voyez après cela avec quelle grâce ce monsieur vient nous apprendre que des millions de ces peuples infortunés sont forcés, et chose étrange ! horrible fatalité ! par les lois immuables de la nature, à passer de ce monde en l'autre, sans avoir été éclairés des lumières de l'Evangile !\n\nAu reste, le silence profond et affecté de l'auteur sur les missions et missionnaires du Canada, serait inconcevable, si la teneur générale de son travail ne décelait le mystère. Ces missions, soutenues avec tant d'éclat, pendant une longue suite d'années, et si intimement liées avec notre histoire, méritaient, à tous égards, une mention honorable. Les faits de ces hommes de Dieu, qui ont porté le courage évangélique jusqu'à l'héroïsme, les Brébeuf, les Lallement, les Brassani, les Rasles et tant d'autres, n'auraient pas déparé les plus belles pages de l'histoire d'aucune nation au monde. Mais cette belle portion du tableau de notre histoire n'entraîne pas dans le cadre des plans de l'auteur. Au contraire, ces détails l'auraient jeté dans une route diamétralement opposée à son but, comme je m'empressais de le démontrer.\n\nJ'ouvre le même volume à la page 194, et j'y lis, non sans étonnement, que les religieuses de l'Hôpital-Général de Québec (en 1733) :\n\n\".... acceptaient fréquemment des invitations à dîner et à souper,\"\n\"ne mêlaient dans la société, sans égard à leurs voeux, qu'ils \"laisse à leur couvent.\"\n\nCette assertion toute entière est controvée, il n'y a pas un mot de vrai, et je ne puis revenir de mon étonnement que l'auteur ait osé exposer sa réputation comme historien, au point de répéter une fable qui n'a pas même le mérite de la vraisemblance ; lui qui a vécu tant d'années si près de cette maison, et qui ne pouvait ignorer l'estime universelle dont elle jouit à si juste titre ; lui qui, comme un autre, aurait pu, en moins de vingt-quatre heures, puiser à des sources pures, et vérifier les mémoires sur lesquels il s'appuie.\n\nC'est en me portant vers ces sources, que j'ai appris que l'Hôpital-Général avait été longtemps dans un isolement parfait, et entouré d'une forêt épaisse ; que pendant ce temps les religieuses n'ayant pas de clôture \"recrétée\" (paroles dignes de remarque) n'avaient d'une certaine liberté de vaguer autour de leurs bâtiments extérieurs, jardins et petits terrains défrichés, sans pourtant visiter les habitations des laïques, dont les plus proches étaient alors dans la haute ville de Québec ; que la communauté ayant pris, ainsi que la population du pays, vers l'année 1730, un accroissement considérable, Monseigneur Dosquet jugea à propos de donner un mandement qui porte :\n\n\"... Jusqu'à ce qu'il y ait une clôture réglée, voulons que les \"murs de la maison soient en place ; qu'on puisse tout au plus \"aller dans le jardin tel qu'il est aujourd'hui.\"\n\nDans ce mandement, le seul qui ait jamais prescrit la clôture de cette maison, point d'infractions aux règles mentionnées, point de désordres à corriger, enfin point de réformes : au contraire, tout y respire une bonté paternelle ; c'est une douce eshortation à l'amour de Dieu, du prochain, des devoirs monastiques.\n\nMais, M. l'éditeur, ma preuve ne s'appuie qu'indirectement sur ce qui précède : j'ai d'autres témoins, d'autant plus précieux qu'ils portent avec eux l'évidence, sans obliger d'aller fouiller dans les temps passés. Ce sont de simples dates. Celle du mandement cité est du 8 janvier 1730, et celle de la lettre du comte Maurepas du 9 avril 1732. Rapprochez maintenant ces chiffres, et voyez si je ne suis pas en droit, sans blesser les règles des convenances, ni même celles de la modestie, d'appliquer à l'auteur ces paroles : \"Illegatus est verbo oris tui, et captus propriis sermonibus.\"\n\nJe ne nie pas que Maurepas, vendu à la faction philosophique, et qui n'était pas plus fou de religieuses que Condorcet son pâqueriste, ait pu, à l'instigation de quelques malveillants, susciter des tracasseries à cette institution. Mais je regarde comme une cruauté de traduire sur la scène, sans examen, et surtout sans but utile, ces âmes généreuses, qui se dévouent avec tant d'intrepétitude au soulagement de l'humanité souffrante, et dont la vie, selon la nature, est un martyre continu.\n\nLa page 105 offre un passage tout aussi singulier, et tout aussi vrai, que le précédent. Il est vrai que l'évêque de Samos avait fait un cas réservé à lui seul de la vente des boissons fortes aux sauvages. Mais si l'auteur se fût donné la peine d'interroger quelqu'un de ses amis catholiques, il aurait appris que cet état de choses, sans parler des cas de nécessité, admettait des permissions écrites, surtout pour les lieux lointains. Il se serait épargné par là la bêvue de faire venir les gens de Frontenac pour cet\nobjet, et il n'aurait pas chargé sa conscience de cette autre assertion, non moins contraire à la vérité, que l'évêque, sur un ordre du roi, levait immédiatement cette restriction. Cette restriction dura plus de cinquante ans après cette époque, comme il est facile de le vérifier par un mandement de Monseigneur J. F. Hubert en date du 19 décembre 1788.\n\nLa lecture de la note qui est à la page 203, me ramène naturellement sur mes pas pour revoir la page 199. Je relis de même et plus attentivement les deux passages que je viens de discuter, et je recherche de nouveau cet endroit (p. 72) où l'auteur parle du prince comme évêque du dehors de l'église (1). Un violent soupçon, que je conçois à l'occasion de ces différents passages, me fait entreprendre la tâche laborieuse de poursuivre ma lecture, et je ne la termine qu'avec l'ouvrage même. Il n'est guère facile de décrire les différents sentiments d'étonnement, de douleur et d'indignation qui s'emparent tour à tour de mon âme à la vue de tant d'efforts pour détruire ma religion. Vouloir placer à la tête de notre église du Canada un chef laïque, et étranger à nos doctrines, est un attentat à la fois absurde et cruel, qui appellerait sur ma tête cette persécution qui déjà en Angleterre a tant fait couler de sang. Car ce monsieur, qui écrit de l'histoire, ne peut ignorer combien de têtes catholiques ont été abattues sous Henri VIII et plusieurs de ses successeurs, précisément et uniquement pour refus d'admettre cette suprématie du roi, qu'il veut nous imposer.\n\nEt si l'auteur persiste à dire que sous l'ancien régime les princes étaient évêques du dehors, etc., c'est-à-dire dans son sens, chefs de l'église, ma réponse est simple et courte. Les princes catholiques, depuis Constantin-le-Grand, ont toujours été considérés comme protecteurs-nés de l'église et des canons ; et à ce titre, ils ont, à différentes époques, obtenu de la cour de Rome des privilèges et faveurs qui les ont fait participer à la police extérieure de l'église, mais sans toucher en rien au spirituel. Leur reconnaissance n'a pas été stérile : ils ont en retour accordé à l'église une portion de leur pouvoir politique ; et c'est cette communication alternative de pouvoirs et de privilèges qui a amené cet état d'union et d'harmonie (qui ne sont interrompus à la vérité par des prétentions outrées), que nous admirions naguère dans les États catholiques, et que les libéraux et malveillants de nos temps cherchent à détruire, avec un acharnement qui semblerait dire que chacun d'eux a adopté pour devise ces paroles énergiques du poète :\n\n*Floctere si nequeo Divos, Acheronta movebo.*\n\nMais comme il n'existe aucun concordat entre la cour de Rome et celle de Londres ; que les lois du royaume interdisent même à celle-ci toutes relations religieuses avec le souverain pontife ; il s'ensuit que loin d'être le chef de notre église du Canada,\n\n(1) Dans les différents endroits indiqués ici, l'auteur prétend que les rois de France, seuls et de leur propre chef, établissaient et abolissaient les fêtes et cérémonies religieuses, ordonnaient les réformes dans les monastères, l'abolition des cas réservés, etc. Et il en déduit cette conséquence, qu'il établit en principe : Que les rois de France étaient les chefs de l'église du Canada, et que leurs successeurs, les rois d'Angleterre, le sont devenus par le droit de conquête. *Vid. vol. 2, p. 227.*\nsa majesté ne peut pas même en être l'évêque du dehors(2). D'un autre côté, que nos évêques aient, comme ils ont toujours eu, si je suis bien informé, égard aux désirs raisonnables de nos chefs politiques, cela est une loi des convenances comme de l'Évangile; qu'ils se prêtent dans certaines circonstances à leurs intentions pures et droites, rien de plus juste; mais qu'ils deviennent les vice-germes de l'exécuteur, c'est là une toute autre histoire.\n\nL'attaque contre l'abbé Leloutre (pp. 217-18), et surtout l'insinuation qu'il concourut au meurtre du nommé Howe, est à la fois indécente et mal fondée. J'ai eu l'avantage d'interroger à ce sujet des hommes d'honneur et dignes de foi; trois missionnaires qui ont vécu assez longtemps au milieu des Acadiens contemporains de cet abbé, et gouvernés civilièrement par lui. Leur témoignage unanime le donne pour un homme d'honneur, de talent, et de naissance. Il jouissait de la confiance entière de son gouvernement, et de son évêque, dont il tenait des pouvoirs extraordinaires. Et une chose qui surprend quelqu'un, c'est que c'est cet abbé dont la vertu a été évoquée par l'auteur en tyranne, qui interdit et chassa ce mauvais récollet marchand, dont M. Smith a décuplé les vices à la page 246.\n\nLa seule ombre de blâme qui pourrait tomber sur ce très estimable ecclésiastique, ainsi que sur quelques autres missionnaires de ce que l'on appelait alors l'Acadie, serait d'avoir, par des motifs religieux et temporels, exhorté les Acadiens à faire le sacrifice de leurs propriétés, plutôt que de prêter le serment d'allégeance au gouvernement britannique. À ces mots j'entends crier à l'intolérance à la bigoterie. Mais après tout, M. l'évêque, cet abbé Leloutre, ces missionnaires n'étaient pas tous des idiots. Une cruelle persécution, ouverte à cette époque, et qui connaît depuis plus de deux siècles, contre les catholiques en Angleterre, ne devait-elle faire aucune impression sur ces missionnaires? Les confiscations de biens, les chaînes, les cachots et l'exil ne devaient-ils pas entrer dans leurs calculs sur le sort futur de ces Acadiens(3)? J'abandonne avec confiance cette question au tribunal du sens-commun; et pour fermer la bouche à certaines gens, toujours imprudents, toujours malavisées, je me permets de leur donner cette leçon: \"Amen of glass, throw no stones.\"\n\nLe fait, s'il est vrai, de La Jonquière (p. 292) qui déplace un missionnaire, prouve seulement une infraction aux règles établies: jamais aucun de ses prédécesseurs ne s'était arrogé ce droit, et aucun depuis lui ne l'a exercé. Et j'ose prendre ici le ton de prophète pour dire, que jamais nos évêques ne perdront la grâce de Dieu au point d'abandonner à nos chefs laïques la feuille des bénéfices. Ce serait, après la suprématie toutefois, le dernier\n\n(2) Il est digne de remarque que l'exécuteur, lorsqu'il s'est mêlé de la nomination de nos évêques, a toujours prétendu le faire en conséquence de la suprématie, et non en vertu d'aucun concordat avec Rome, ou privilège de nos rois comme successeurs des rois de France.\n\n(3) Ces faits étaient pareillement connus dans le Canada; et comment s'étonner qu'ils inspirassent aux Canadiens une nouvelle ardeur pour la défense de leur patrie, accompagnée d'une certaine horreur pour ceux qu'ils regardaient comme les persécuteurs de leur religion?\nmalheur qui put arriver aux Canadiens. Quant à ceux qui pourraient se scandaliser de la conduite de La Jonquière, il suffit de les informer qu'il vivait à une époque, et sous un gouvernement, où toutes les choses, comme toutes les opinions, chez une certaine classe d'hommes, commençaient à se déplacer, pour amener cette catastrophe, à jamais inégalable, qui devait verser tant de maux sur la France.\n\nMais voici encore un mauvais prêtre (note, p. 291), et qui, à la méchanceté, ajoute la bêtise de tomber mort sur le rivage du fleuve Saint-Laurent. Et de quoi?—De rage; non de celle que les médecins dénomment hydrophobie, mais de cette rage qui est synonyme de transport de fureur.—Et à quelle occasion?—À l'apparition de la flotte anglaise! Il faut, M. l'éditeur, que ce malheureux pêcheur ait été privé de la sépulture des chrétiens car nord et sud au bas de Québec, ni les registres mortuaires, ni même la tradition, ne mentionnent ce fait extraordinaire, ni même la sépulture d'aucun ecclésiastique à l'époque désignée. Et j'affirme la chose pour avoir pris moi-même mes informations sur tous les lieux, à l'exception de trois ou quatre, dont je me suis procuré des renseignements incontestables.\n\nMais si ce misérable périt ignoblement et sans coup férir, il n'en sera pas de même de son confrère du Château-Richer. Tournez, M. l'éditeur, les feuilles, et arrivez à la page 308. Vous y lirez qu'un prêtre se fortifie au Château-Richer, dans une grande maison, avec 80 de ses paroissiens; que le général Wolfe y envoie un détachement de troupes; qu'une correspondance, dont l'auteur donne mot-à-mot une portion, a lieu entre le prêtre et le chef du détachement; et puis vous y trouvez une description de l'attaque, de la défense et du nombre des morts, parmi lesquels se trouve le prêtre, à qui on jeta la chevelure. L'indignation sans-doute s'empare de votre âme à la vue d'un ministre de Dieu qui, contre toutes les règles de ses devoirs, endosse la cuirasse, s'engage dans la mêlée, et meurt les armes à la main. Mais qui viendrait tout-à-coup vous dire, la preuve en main, que toute cette histoire est une fable, un conte-bleu; votre indignation, en changeant d'objet, pourrait-elle se contenir dans les bornes ordinaires? En! bien, monsieur, cette histoire est dans toute la force du terme un conte-bleu, tout aussi bleu que ce couvent de moines placé au même lieu par tant d'autres écrivains. Et si vous ne me croyez, le Château-Richer est encore là: plusieurs de ses vieillards, témoins des événements d'alors, vivent encore; la tradition est fraîche: interrogez, comme j'ai fait, des hommes intelligents et instruits des faits (4).\n\n(4) Cette singulière affaire du Château-Richer est contée avec tant d'apparence de vérité par l'auteur, que je me suis cru obligé d'aller prier aux sources. D'abord, les récits du Château-Richer font que M. Du Biron y fut curé de 1752 à l'année 1753 jusqu'à 1773. Deux vieillards, témoins de tout ce qui s'y passa en '59 et '60, affirment (et la tradition est d'accord avec eux) que ce monsieur n'y fit jamais la guerre, et que le déguisement des gens du Château sous le costume sauvage, est dénué de fondement. Tout ceci est consigné dans un instrument, dressé et attesté sur les lieux le 7 du courant (décembre 1826) par trois dignes membres de notre clergé, et par un jeune monsieur étudiant en médecine.\nSi toutefois il faut à l'auteur une victime réelle, prise dans le clergé, je puis lui en abandonner une dont l'imprudence condui-\nsit à un horrible crime, mais qu'il verra sans doute avec regret\nconsigné dans ces feuilles. Un petit détachement de soldats anglais,\nsous un capitaine fort connu depuis en cette province, débarqua\nà la côte N. Aussitôt les vieillards avec les femmes et enfants du\ns'efforcer dans la forêt. Quelques Canadiens commandés par le\ncapitaine Ni; et au milieu desquels se tenait le curé du lieu (armé,\ndit-on, et par conséquent très-réprehensible), furent surpris et mis\nen déroute. Le malheureux curé, atteint de trois balles et fait\nprisonnier, fut, contre les droits des gens, contre les lois de l'hon-\nneur et celles de l'humanité, massacré, in cold blood, et avec des\ncirconstances si barbares, que ma plume se refuse à les retrai-\nser (5). Se peut-il que le fait que je décrit ici, ait donné lieu à la\nfable du Château-Richer? Il est hors de toute vraisemblance\nque l'auteur eût si mal choisi. Quoi qu'il en soit, détournons\nnos yeux de cette scène d'horreur, dont je sais le nom de l'auteur,\npar les égards dus aux membres vivants de sa famille, et voyons\ndes accusations d'un autre genre, qui se trouvent à la page 331.\n\nLe général Murray, y est-il dit, fit savoir à la supérieure de\nl'Hôtel-Dieu, que c'était en punition de la correspondance\nqu'elle avait entretenue, pendant tout le cours de l'hiver, avec\nl'armée française (qui avait hiverné, remarquez-le bien, à Mon-\ntréal) qu'il avait donné ordre de détruire le moulin et la maison\ndu Capitaine (à Saint-Augustin).\n\nÀ ce passage, dont l'auteur ne fournit aucune preuve, j'op-\nposais avec confiance la communication suivante, reçue d'un\nmonsieur de la plus haute respectabilité, et datée du 30 octobre\n1896:\n\n\"Quelques troupes françaises stationnées à l'ancien domaine\nde Saint-Augustin et ailleurs, s'étant avancées jusqu'à la ri-\nvière du Cap-Rouge, y provoquèrent les Anglais. Ceux-ci les\nmirent en fuite, et les poursuivirent jusqu'au Calvaire. Après\navoir tué une jeune fille dans la maison du domaine, où elle\nétait restée seule avec son père, ils descendirent sur le rivage,\net y mirent le feu au moulin, qui fut réduit en cendres...\"\n\nCe monsieur ne s'est point tenu à des rapports vagues; il a\npris les dépositions d'hommes dignes de foi, témoins oculaires\nde la chose, vieillards habitans de Saint-Augustin, dont les noms\nseront produits au besoin. Et je me persuade d'après leur té-\nmoignage, joint à d'autres circonstances, que cet incendie de\nmoulin est un accident amené uniquement par les événements\nfortuits de la guerre.\n\nMais je suis presque scandalisé des efforts que fait l'auteur ici\net ailleurs, pour écrire un nom cher aux armes britanniques.\nSupposez le fait de la correspondance vrai dans toutes ses circon-\nstances; est-il croyable que le général Murray, placé si haut,\nait pu oublier toutes les convenances au point de se venger si\nlâchement de pauvres filles, vu surtout que cette punition n'é-\ntait plus un remède au mal? M. Smith cherche à me persuader\nque le général est en défaut; et comment s'y prend-il? Par le\nlangage, je ne dis pas indécent, mais brutal, qu'il lui met à la\n\n(5) J'ai sous les yeux un détail très-circumstancié de cette san-\nglate tragédie, fourni par un monsieur très-recommandable\npar ses connaissances, et qui a fort connu les acteurs de part et\nd'autre.\nbouche, à l'occasion de Mad. Saint-Claude, supérieure de l'Hôpital-Général de Québec. Cette dame était d'une naissance distinguée (De Ramsay) et d'une éducation fort soignée; elle méritait d'être élue deux fois à la supériorité de sa maison; aussi les personnes qui l'ont connue, et qui ont vécu avec elle, ne savent si elles doivent plus s'indigner du procédé déshonorant du général, si le fait est vrai, que de la singulière inadéquation de l'historien qui reproche à cette dame précisément la chose qui devait le plus tourner à sa gloire. Et quel est ce reproche?—D'avoir, étant encore sous la puissance française (remarquez bien ceci), encouragé les Canadiens à la résistance, c'est-à-dire, à leur devoir. Quelle nouvelle espèce de crime!\n\nMais comme si ce n'était pas assez d'avoir exposé, dans tout son jour, la brutalité du général envers le sexe (6), l'auteur fournit, à la page 352, un morceau qui seul suffirait pour vouer à une exécration éternelle le nom de ce premier gouverneur du Canada après la conquête. Vous vous étonnez peut-être, M. l'éditeur, de mes expressions; mais voyons. Le général (p. 352), après avoir harangué les habitants de Sainte-Croix et Lotbinière, qui venaient de mettre bas les armes, se tourna, dit le texte, vers un prêtre, et ajouta:\n\n\"Le clergé est la cause de tous les malheurs qui sont arrivés aux pauvres Canadiens, qu'ils retiennent dans l'ignorance, qu'ils excitent à la méchanceté (wickedness) et à leur propre perte... Prêchez l'Evangile qui est votre seule affaire... et n'ayez pas la témérité... de vous mêler de la guerre.\"\n\nIci l'indignation cède à un autre sentiment, celui du plus profond mépris pour l'auteur d'un jargon si pitoyable. Mais j'ai à regretter en même temps de découvrir ici, sous le voile du langage d'autrui, les sentiments bien marqués de l'historien du Canada pour notre clergé, lesquels se manifestent en tant d'autres endroits de son ouvrage. Faire un crime aux membres du clergé de leur loyauté, et de leur dévouement à leur prince et à leur patrie; les blâmer de leurs efforts constants pour encourager les soldats de la nation à rendre à César ce qui est à César, est un langage qui, à mon gré, n'est guère en harmonie avec cet Évangile qu'on leur recommande tant de prêcher. C'est, au contraire, une doctrine que jusqu'ici j'avais toujours cru appartenir exclusivement aux démagogues de tous les temps et de tous les pays.\n\nLa vérité est, que la nécessité de l'obéissance politique des peuples à leurs gouvernements admis et établis, est un principe de religion enseigné et prêché dans toute la catholicité; et nulle part, j'ose l'affirmer, donne-t-on plus d'exemples de cette vertu que dans notre Canada. Et voici un fait peu connu, qui vient à l'appui de mon assertion, et qui seul vaut un volume d'arguments. Quelques champs des paroisses de Saint-François (Rivière-du-Sud), de Saint-Vallier et de Saint-Michel, dans le voisinage de\n\n(6) Il paraît en effet, par le trait suivant, que M. Smith a raison de donner comme peu délicats sur l'honneur quelques-uns des chefs de l'expédition anglaise. Dans une descente à la Pointe-aux-Trembles de Québec, on enleva les sœurs religieuses, avec toutes les jeunes filles du pensionnat, et après les avoir exposées et promenées dans un vaisseau de guerre (quelle indécence!), on les jeta pèle-mêle sur le rivage du Cap-Rouge! C'est dans cette même descente que furent enlevées plusieurs vieillards, dont on n'a jamais eu depuis ni vent ni nouvelle.\nla capitale, offrent aux voyageurs étonnés le spectacle de tombeaux. Qu'est-ce là? demande-t-on ordinairement avec empressement. La réponse est, que ce sont les restes mortels d'individus à qui l'on a refusé les sacrements à la mort, et la sépulture chrétienne après. Mais qui a refusé?—Plusieurs membres du clergé de l'ancien, et quelques-uns du nouveau régime.—Et pourquoi?—Pour avoir maintenu, quelque citoyens paisibles d'ailleurs, que George III n'était pas leur souverain légitime.\n\nLes conclusions sont évidentes, et l'on voit ici la règle de conduite du clergé d'avant la conquête, de celui de 1775, et enfin de celui de 1812, qui a mérité si éhennement, et obtenu, malgré les clamours de ses ennemis, l'approbation du gouvernement.\n\nL'esprit fatigué, et le cœur navré de douleur, je m'éloigne à la hâte d'une discussion où l'auteur met un ton, une mesure, et surtout un langage, qui ne peuvent que dégoûter tout lecteur délicat, \"ad nauseam usque.\"\n\nEn parcourant la page 356, je jette en passant un regard de pitié, mêlé de dépit, sur l'horrible qualification de réprouvé Judas, que l'auteur applique à un prêtre (7), de son aveu même innocent, puisque les armées ennemies étaient en guerre ouverte, et que ce prêtre n'était ni prisonnier, ni sur sa parole d'honneur, &c., &c., &c. Je m'emporte (contre ma promesse, je l'avoue) de me rendre à la page 373, pour me distraire un moment par un nouveau conte-bleu.\n\nUne ville de 200 maisons détruite dans la Baie-des-Chaleurs! Cela me rappelle cette église succursale (chapel of ease) que l'auteur place dans la paroisse de Varennes; ce port de Sainte-Croix à l'embouchure de la rivière Saint-Charles, où il fait hiverner Jacques Cartier, au lieu de la rivière qui porte son nom; cette expression, Saints Sulpiciens, dix fois répétée, au lieu de Sulpiciens; D'Eggs, au lieu de Desgagné, l'un de nos respectables évêques, et contemporain de l'auteur; Lavalinère, nom d'une de nos familles distinguées, au lieu de Lavalinère, homme remarquable par son peu de génie, et encore davantage par ses excentricités; etc., etc., etc.\n\nEn vérité, M. l'éditeur, je serais porté à croire que ce Monsieur Smith a passé sa vie et écrit son histoire au Cap-Horn, ou dans quelqu'une des régions polaires, s'il en existe; tant il défigure nos usages et notre langue; tant il ignore la géographie de notre pays; tant il confond les choses et les personnes, etc.; et cependant on le dit au milieu de nous depuis plus de 40 ans!\n\nJe quitte sans regret le premier volume et reprends avec peine le second, qui offre le rare exemple d'un livre composé presque totalement de notes. Et de quelles notes?—De notes puissées la plupart chez autrui, et dont les trois-quarts sont tellement dénués d'intérêt, que les égards ordinaires pour les lecteurs auraient dû les supprimer. Mais je dois être court pour plus d'une raison, et je me rends de suite aux pages 38 et 39, non pour m'y arrêter, mais pour dire, en passant, que le langage que l'auteur y fait tenir à Monseigneur Briand, est le langage d'un imbécille.\n\n(7) Un prêtre, dit le texte, alla à bord d'un vaisseau anglais, où il fut bien traité par lord Rollo. Le lendemain, au moment où ce prêtre souhaitait du rivage un bon voyage au lord, la bataille des Trois-Rivières s'ouvrit contre le vaisseau et y tua du monde; et voilà le crime qui suit de ce prêtre un autre Judas, et qui lui donne place dans l'histoire.\nUn simple faiseur de prêtres !...Il n'existe rien de semblable dans la hiérarchie de l'église catholique.\n\nMe voici enfin rendu aux conclusions générales de l'auteur contre ma religion ; me voici en présence des anathèmes prononcés contre l'église catholique du Canada. Ce sont là page 226 et les suivantes qui offrent ce scandale. Elles nous apprennent en substance :\n\n1° Que depuis la conquête, nous catholiques, n'avons plus d'évêques en Canada.\n\n2° Qu'à l'époque de la conquête, tous leurs pouvoirs ont été transférés aux souverains de la G-antle-Bretagne.\n\nJe dois ici comme catholique éléver la voix (et plût au ciel qu'elle pût retenir jusqu'au fond du cabinet de Saint-James!) pour publier que tous les parlements, tous les traités, et toutes les capitulations du monde ne sauraient m'arracher ma religion ; que je ne puis, comme je l'ai déjà dit, me soumettre, dans les choses purement spirituelles, à un chef qui professe une doctrine étrangère à ma croyance catholique, et encore moins à un laïque, auquel M. Smith et le procureur-général (par nobilis fratrum!) attribuent, par je ne sais quelle magie, le pouvoir de consacrer le pain et le vin, me conférer les saints ordres, etc. Car ses paroles (p. 227) : \"...The office (of the bishop) was annihilated, and all the powers inherent therein transferred to His Majesty,\" etc., renferment implicitement cette absurdité, ou elles ne signifient rien.\n\nLa droite raison, la justice et l'honneur combattront à mes côtés dans cette lutte, et maintiendront avec moi, contre les conclusions du procureur-général, aide de M. Smith, que la promesse solennelle du libre exercice de ma religion, tant de fois répétée dans les différentes proclamations des généraux et gouverneurs britanniques, et ensuite confirmée par les capitulations de Québec et de Montréal, et par le traité de paix de '63, ne peut être violée sans sacrilège, puisqu'elle m'a été donnée sous la foi du serment.\n\nQue si l'on m'objecte la suprématie du roi, toujours exprimée dans les capitulations et autres actes publics, je répondrai sans hésiter que cette clause est nulle, qu'elle est une lettre morte (a dead letter), parce que cette suprématie n'est pas essentielle au bon gouvernement de la province, même plus de 60 années d'expérience le prennent jusqu'à l'évidence, parce qu'elle ne saurait ajouter un iota de prosperité à l'État ; et afin de dépendamment de toute autre raison, parce qu'elle mépriserait la religion, et avec elle le bonheur de 400,000 fidèles et loyaux sujets britanniques. Que si ces arguments ne produisent pas l'effet désiré, je ne cesserai alors de répéter qu'on m'a offert toute ma religion, et que je ne puis ni ne veux la recevoir morcelée et défigurée.\n\nJe n'ignore pas que plusieurs de ceux qui se tiennent habituellement, la hache en main, à la racine de nos institutions civiles et religieuses, osent prononcer ce blasphème : L'église du Canada, pour exister, n'a pas besoin du souverain-pasteur ; un évêque qui serait nommé uniquement par S. M. Britannique suffit. Que des individus ignorants ou dévorés de préjugés parlent ainsi, cela n'est pas ; que ces gens à conscience engrenée, et pour lesquels la haine est un besoin journalier, affichent de tels paradoxes, il n'y a rien de surprenant en cela ; mais je ne puis revenir de mon étonnement, ni supprimer ma douleur, lorsque je\nremarque des citoyens estimables d'ailleurs, dotés de talents et de savoir, s'abaisser au niveau de tels gens, et faire cause commune avec eux.\n\nLa maxénée se porte naturellement vers un personnage, notre vénérable juge-en-chef, que je ne puis, il est vrai, confondre avec les précédents, mais que j'ai encore l'extrême douleur de voir attaquer ouvertement et d'une manière solennelle, les principes fondamentaux de mon église. J'en atteste son Essai de l'Histoire de la Jurisprudence, etc., où, après avoir peint ma religion d'après les notions et les couleurs jansénistes, il avance, contre la vérité de l'histoire, que l'église gallicane, pendant le schisme d'Avignon, avait rejeté toute autorité étrangère. Ma réponse à l'honorable juge, et à tous ces messieurs qui font et défont les constitutions religieuses à l'instar des constitutions civiles, est celle-ci : Un corps sans tête, ou avec une tête étrangère, est, au moral comme au physique, un monstre.\n\nQuant aux élections de paroisses, dont parle l'auteur à la page 296, où, par parenthèse, il applique jusqu'à trois fois à mon vénérable évêque, et avec, sans-doute, un ris sardonique sur les lèvres, le terme Romish, l'un des plus incivils que fournisse l'idiome anglais, voici la vérité sans fard. Depuis la conquête, la population de nos paroisses s'est prodigieusement accrue ; des forêts entières ont été abattues, et de nouveaux territoires se sont établis sur des étendues immenses ; au point que de toutes parts, l'on n'a cessé, surtout depuis quelques années, de demander de nouveaux pasteurs et de nouvelles cures. À la vue de cette moisson abondante, nos évêques, comme de raison, ne sont pas de meurés spectateurs oisifs. De leur côté, prières, supplications et démarches convenables auprès de l'exécutif, pour obtenir des élections légales de paroisses. Du côté de l'exécutif, délais, entraves, et toujours et éternellement la suprême inadmissible. Dans cette cruelle position, dans cet état violent et contre nature, nos évêques devaient-ils abandonner à leur sort et laisser périr les âmes confiées à leur garde ? Non, M. l'éditeur, non. Aussi la nécessité, cette loi suprême, et le cri de leur conscience, leur ont-ils indiqué une route nouvelle qu'ils ont saisie dans cette extrémité ; et c'est ce qui leur a attiré de notre part des actions de grâces éternelles, tandis que nos adversaires appellent sur eux toutes les malédictions.\n\nJe ne puis quitter ce sujet sans ajouter cette réflexion, qui mérite l'attention sérieuse de tous les hommes sages, que cette cruelle persécution religieuse, que je viens de signaler, ajoutée à tant de distribus, de calomnies, de haines et de mépris, que l'on verse chaque jour sur nous, et qui souvent nous arrivent de cette haute classe qui entoure habituellement ceux qui tiennent en main les rênes du gouvernement, ne peut que produire dans les esprits un état d'irritation, difficile à contrebalancer par une patience même surhumaine.\n\nJe termine, M. l'éditeur, ces pénibles discussions, avec au moins cette douce réflexion, que je me suis acquitté, suivant la mesure de mes forces, et j'ose espérer, avec quelque succès, d'un devoir sacré pour tout honnête citoyen, et avec l'espoir qu'au premier jour le reste de cette pitoyable production de M. Smith sera foutu par quelqu'un de nos patriotes canadiens, de manière à n'être plus jamais produite au grand jour, O ! Utinam ! J'ai l'honneur d'être, etc.,\n\nC\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_41974.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 19, "total-input-tokens": 29746, "total-output-tokens": 12631, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 3422, 3], [3422, 5863, 4], [5863, 5863, 5], [5863, 6007, 6], [6007, 6007, 7], [6007, 8729, 8], [8729, 12145, 9], [12145, 15551, 10], [15551, 18943, 11], [18943, 22274, 12], [22274, 25630, 13], [25630, 29027, 14], [29027, 32496, 15], [32496, 35895, 16], [35895, 39238, 17], [39238, 42663, 18], [42663, 42663, 19]], "primary_language": ["en", "en", "en", "en", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]