[{"id": "692b04515a28f635a5163506cf940d0316a0f4e8", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 4 | 5 | 6 |\n|---|---|---|\n|   |   |   |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"À SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE CANADIAN PACIFIC RAILWAY:\n\nITS GEOGRAPHICAL AND FINANCIAL POSITION.\n\nBY Παν-Ομφαλος.\n\n\"Let go thy hold when a great wheel runs down a hill, it will break thy neck with following it.\"—KING LEAR, II., 4.\n\nLONDON:\nBATES, HENDY, AND COMPANY,\n37, WALBROOK.\n\nDECEMBER, 1888.\nThe following are the names of the members of the Board of Directors of the Company:\n\nMr. John Smith\nMr. Robert Johnson\nMr. James Brown\n\nThe Board of Directors has approved the following resolutions:\n\n1. To increase the authorized capital stock of the Company by $100,000.\n2. To declare a dividend of $0.50 per share on all outstanding common stock.\n\nThe Board of Directors will meet again next month to discuss the company's future plans.\n\nJohn Smith, Chairman\nTHE CANADIAN PACIFIC RAILWAY.\n\nAs there is much interest at the present time in regard to the Canadian Pacific Railway, financially and otherwise, the following description has, as regards the figures, been compiled principally from the Reports and published Statements of the Company, and from the \"Report on Railways for 1887,\" presented to the Canadian Government, and printed in the form of a Blue Book during the Session of 1888, and will serve to indicate the position of the Company, and the character of the country through which the Railway passes.\n\nGEOGRAPHICAL.\n\nThe Canadian Pacific Railway is at the present time 4,660 miles long, according to the Company's weekly traffic statements; and the following detailed distances are taken from the Company's reports and time-tables:\n\nOf the above total of 4,660 miles, 2,905 miles are on the main line, between Montreal and Vancouver; 1,130 miles are in the Provinces of Ontario and Quebec, competing with the Grand Trunk and other railways; and there are 440 miles of branch lines west of Lake Superior, and 183 miles between Sudbury Junction and the Saint Mary River—or the \"Soo.\"\n\nAs regards the main line, from Montreal to Vancouver, there are 649 miles from Callander, running north of Lake\nSuperior to Port Arthur, on which settlement cannot be expected, and on which the traffic is very scanty. The principal traffic to and from the North-West would naturally be taken, via Port Arthur, by the cheaper route, across Lake Superior and Lake Huron, during the open season of navigation; and grain would be accumulated during the winter in the extensive elevators which have been constructed at Port Arthur for the purpose, in readiness for the next open season. This expensive line north of Lake Superior, must therefore be of comparatively little use, and must always be a drag upon the remainder of the system.\n\nThe line between Port Arthur and Winnipeg, 430 miles, is almost destitute of local traffic, and runs through a country of rocks and swamps, offering little inducement to settlers, and it is therefore mainly of use for carrying through traffic.\n\nThe line between Winnipeg and Brandon, 132 miles, is that on which the principal dependence may be placed for settlement and the production of wheat, of which, however, there is, unfortunately, always a risk of damage from early frosts, which has discouraged settlers year after year. In fact, the year 1887 appears to have been the only year during the last seven in which the crops fully matured and were abundant. The crops suffered considerably in 1888.\n\nWestward to Calgary, settlement and wheat-growing diminish, and the Prairie land for a great part of the 700 miles between Brandon and Calgary, some of it alkaline, is liable to suffer from drought in summer. It cannot be depended on for wheat, and the climate and pasture are hardly good for cattle.\n\nThere are 40 miles between Calgary and the Rocky Mountains, which are generally well calculated for feeding cattle and sheep; but for 600 miles further west there is little else but mountain scenery and extensive forests, nearly to Vancouver. This mountain part of the line has been expensive to construct and is expensive to maintain, especially during winter, when\nsnow slides and glaciers are liable to destroy portions of the railway.\n\nThere is no local traffic to speak of on this last portion, and what little tourist traffic arises is for a short time in summer. As regards the through traffic in 1887, the following is extracted from the Company's Report:\n\n\"The difficulties between the American trans-continental lines, mentioned in the last Report, continued without much change until November, 1887, when an agreement was reached looking to the restoration and maintenance of rates. Up to that time the greater part of the freight traffic to and from the Pacific Coast was carried without profit, and some of it at an actual loss; but while satisfactory rates have not yet been fully established a great improvement has been made.\"\n\nAt Vancouver a town is being built, so it is stated, with pecuniary assistance from those interested in the Company, and an attempt is being made to open up commerce with China and Japan. Five steamers are at present employed in this service, and two small steamers to collect traffic along the American Coast; but the results up to the present time are said not to have been satisfactory. Such traffic is competed for with the American lines; and the steamers have not apparently been made to pay their expenses, but have been, and must, it is apprehended, continue to be, a considerable drain on the Company.\n\nOf the lines in Ontario, the Ontario and Quebec is in direct competition with the Grand Trunk between Montreal and Toronto. The Credit Valley Railway, now extending from Toronto to London and St. Thomas, led to the construction of the Ontario and Quebec Railway, and is now, it appears, to be extended from London to Detroit, by means of a railway to be constructed between the existing double line of the Grand Trunk Railway and the existing line of the Michigan Central (formerly the Canada Southern) Railway. When running in\ncompetition with these two lines, it can hardly be expected that this new line from London to Detroit will be satisfactory in a pecuniary point of view.\n\nThe two branches from Winnipeg to the American frontier will in future have to be run in competition with the Red River Railway, constructed by the Manitoba Government, and taken over by the Northern Pacific Railroad Company, and further competition in the district may be expected as the Northern Pacific extends its connections in Manitoba. Other competition is likely to arise when lines are completed through—for instance, from Duluth to Winnipeg, as well as another line, which has already been commenced, between Winnipeg and Port Arthur, through a better country, as stated, than that traversed by the Canadian Pacific route.\n\nThe North Shore line, between Montreal and Quebec, is not a lucrative acquisition of the Canadian Pacific, and will be still less so in the future, now that the channel between Quebec and Montreal has been deepened to 27 feet, for the purpose of running the steamers through from Quebec to Montreal, in place of landing passengers at Quebec.\n\nThe lines in the eastern district have not yet been completed, nor have they, so far, yielded such results as were expected. The traffic upon them is poor, and the line under construction through the State of Maine to St. John is hardly likely to be of any benefit to the Company as regards its financial results.\n\nFINANCIAL POSITION.\n\nIn the last yearly Report of the Company—for 1887—it was stated that the gross earnings for the year were $11,600,000 (£2,320,000), whilst the working expenses were $8,100,000 (£1,620,000); leaving $3,500,000 (£700,000), of which $3,250,000 (£650,000) were appropriated to the payment of\nthe fixed charges—i.e., rents on leased lines, interest on bonds, &c.; and there was a so-called surplus of $250,000 (£50,000). But the cost of road and works maintenance of the whole system (taken for that year at 4,300 miles completed and maintained) was at the rate of only $435 (£87) per mile of railway for the year 1887. For a similar period the average charge for road and works maintenance of the principal Canadian railways, exclusive of the Canadian Pacific Railway, as shown in the note below,* upon 4,160 miles, was at the rate of $922 (£184) per mile of railway per year, leaving a difference of $487 (£97) per mile of railway. Had the charges of the Canadian Pacific Railway for maintenance of road, &c., been in the same ratio as the charges of these other principal Canadian systems of railways, the total charge for such maintenance for the year 1887 would then have been $3,964,000 (£792,800) for the Canadian Pacific system, in place of $1,871,000 (£374,200)—a difference of $2,093,000 (£418,600); and the general working expenses would have amounted to $10,193,000 (£2,038,000), instead of $8,100,000 (£1,620,000) as stated by the Company. Deducting $10,193,000 (£2,038,000), which would thus have approached more nearly to the normal charge for the working expenses of the Canadian Pacific system for the year, from the total earnings, as above given, of $11,600,000 (£2,320,000), there would have remained only $1,407,000 (£281,400) to meet the fixed charges; and there would thus have been a deficit of $1,843,000 (£368,600)\n\n* Note.—The following is a Statement of the cost of the works maintenance of the principal Canadian Railways.\n\n| Miles | Amount | Per mile |\n|-------|--------|----------|\n| Canadian Southern | 362 | $531,502 | $1,468 (£294) Year to June 30, 1887. |\n| Intercolonial | 880 | 782,052 | 889 (£178) Do. |\n| Grand Trunk | 2,918 | 2,522,187 | 864 (£173) Year to Dec. 31, 1887. |\n| Total | 4,160 | $3,835,741 | — |\n| Average | — | — | $922 (£184) |\n| Canada Pacific | 4,300 | $1,871,175 | 435 (£87) Year to Dec. 31, 1887. |\n—in place of a so-called surplus of $250,000 (£50,000)—to be made up from other sources in paying the fixed charges for 1887.\n\nThe ordinary works charges of these principal Canadian railways—all of them having been working for a considerable period—forms the best standard available for estimating the actual or ultimate cost of the works maintenance on a fixed basis of the Canadian Pacific Railway. Although, on the one hand, the traffic may not be so heavy on the Canadian Pacific Railway, yet, on the other hand, the cost of the works maintenance of the Canadian Pacific Railway, especially through the Rocky Mountains and round the north of Lake Superior, having regard to the circumstances, ought obviously to exceed the works maintenance properly charged for railways more completely finished, ballasted, and consolidated in more favoured parts of Canada.\n\nThe Canadian Pacific Company, by the Ontario and Quebec Railway, have already duplicated the main line of the Grand Trunk; they are—hoping for the aid of British capital by fresh issues in London—constructing, or have in contemplation to construct, other lines to compete both with the Canada Southern and the Grand Trunk; and they are constructing a line to compete with the Intercolonial Railway belonging to the Government of Canada, which by the last Report did not earn its working expenses. It is, therefore, clear that the works maintenance of the portions of the Canadian Pacific which are in the Provinces of Ontario and Quebec, must approximate to that of other Railways in those provinces; and, as previously stated, the works maintenance of large portions of the main line, especially on the mountain and other sections, must be comparatively high.\n\nSince the 31st December, 1887, the annual fixed charges of the Canadian Pacific have been increased, partly in consequence of further issues, by at least $1,000,000 (£200,000), the greater portion of which will be a charge\nagainst 1888; whilst the net revenue for the ten months to October 31, 1888, has only been increased by $243,000 (£48,600). The published working statement of the railway for ten months to October 31, 1888—in spite of the apparently insufficient charges which are made for maintenance of permanent way and of bridges and other works—shows only gross earnings $10,720,000 (£2,144,000), and net profits $2,872,000 (£574,400)—insufficient by, say, $328,000 (£65,600), to meet fixed charges, which cannot be less than $3,200,000 (£640,000) up to that date; and, calculating upon receipts for the months of November and December, 1888, similar to those of the same months in 1887 (which were swollen by the abundant harvest of that year), it is difficult to see how the fixed charges for 1888 can be shown to be met out of profits, judging from the accounts as shown so far in the published statements. With an addition to make up a fair normal charge, as above, for maintenance of permanent way, bridges, &c., there would apparently be a very heavy deficit in meeting the fixed charges, especially as now increased, for the year 1888.\n\nIt must be remembered, also, that the rolling stock up to the present time has been constantly increased with additions of new engines and cars, and that as it is subjected to wear and tear, and the influences of climate, a much heavier charge will have to be incurred in properly maintaining it than has been entered in the published accounts up to the present time, though no details of the expenses of locomotive working are published in the Canadian Pacific accounts; and this is another reason why, as heavier sums are incurred for the maintenance of the railway and its equipment, it will be difficult to avoid in future years a serious annual deficiency in the amount required for meeting the fixed charges.\n\nIt is, however, significant, that as the Canadian Pacific line has extended, the net profits, even as shown by their published statements, have been comparatively reduced.\n\nThus, in 1886 the profits were stated at $3,703,000\n(£740,600), and in 1887 at $3,504,000 (£700,800), whilst for 1888 they cannot, it is estimated, exceed $3,700,000 (£740,000) if the receipts and working charges for the remaining two months of the year are on the basis of those for the preceding ten months to October 31, 1888. For these ten months the expenses increased, as shown in the published accounts, over 1887, by $30,000 (£6,000) per week. Since October 21, the gross receipts for the first three weeks of November have only increased at the rate of $10,000 (£2,000) per week, so that, for those two months, the net profit may be expected to be less than for the corresponding period of 1887. The result shown for 1888 may thus be expected not to exceed that shown for 1886, although there has been since the beginning of 1886 an addition of 1,000 miles to the system.\n\nBut again, if the proportionate addition to the fixed charges is made in respect of the $15,000,000 (£3,000,000) of 3½ per cent. Bonds issued this year, and for interest on the bonds of the Algoma Branch, then the fixed charges for the year 1888 may be estimated at about $3,850,000 (£770,000); and for the year 1889, without including the cost of the further extensions contemplated, at about $4,250,000 (£850,000). Comparing these fixed charges, already incurred, and seemingly inevitable for 1889, with the estimated net revenue of 1888, as derived from the Company's figures, $3,700,000 (£740,000), there would be a deficiency of $550,000 (£110,000); and adding to this the sum of $2,093,000 (£418,600), by which the works maintenance, as stated in the last published Report of the Company, was previously shown (page 7) to be under the normal figures, there would be a deficiency of $2,643,000 (£528,600), to be reduced only by any increased net profit that might be earned in 1889, if increasing competition, and other conditions above referred to, admit of improvement in that respect.\n\nIt would appear from the policy of the Canadian Pacific Directors that they have no great faith in the future of\nManitoba and the North-West, inasmuch as their extensions instead of being, as might have been expected, in connection with the main line through those territories, have been mainly in the older parts of Canada, where the proportion of miles of railway to the number of inhabitants is greater than in any other country in the world, and where the rates generally are for that and other causes exceedingly low, as is shown by the results of the railways in Ontario and Quebec.\n\nIrrespective of the further construction of competitive railways above referred to, there are, however, the following reasons for anticipating continued increase of expenses, without a proportionate increase of revenue:\n\n(1) The expenditure out of, or the charges to, capital upon lines open for traffic must necessarily come sooner or later to a close. The expenditure of capital upon the main line, which was opened for traffic in 1885, was in 1886 $6,281,957 (£1,256,400), and in 1887 $3,674,240 (£734,850), making a total expended for these two years of $9,956,197 (£1,991,250). To a great extent that expenditure must apparently have relieved the charges which would otherwise have been made against revenue.\n\n(2) The main line has now been in existence for at least three years, and every year will bring against the revenue a heavier charge for the maintenance and renewal of road, bridges, and buildings, and for the repair of rolling stock, cars, steamboats, and other equipment.\n\n(3) The fares and rates have been steadily decreasing. The rates per ton per mile for freight were, for 1885 1.20 cents, for 1886 1.10 cents, and for 1887 1.006 cents—a decrease since 1885 of 16 per cent.; and the fares per passenger per mile were, for 1885 2.45 cents, for 1886 2.10 cents, and for 1887 1.98 cents—a decrease since 1885 of 19 per cent.\n\n(4) There is already a still further decrease in fares and rates by the construction of the Red River Valley Railroad, from the United States frontier to Winnipeg, and its extension to join\nthe Manitoba and North-Western, which will be worked by the Northern Pacific Railroad; and there is a probability of other extensions into the North-West Territory, from other points in the United States, and of the diversion of traffic to the American lines.\n\nThe following extract from the *Railway Life* for November, published in Toronto, is sufficiently suggestive:\n\n\"The competition of the Red River Valley road to Winnipeg has been marked by the organisation of a series of cheap excursions to the eastern provinces, on November 5, 12, 20, and 27, and December 3, 11, and 17. Dining and sleeping cars will be on each train, and the price for the round trip, good for ninety days, will be $4.00.\"\n\n(5) Further, the proposed extension of the Canadian Pacific line in Ontario to Detroit, as a link in a new line to Chicago, will add another competitor amongst the Trunk Lines of the United States and Canada, and will thus tend to reduce the rates for through traffic; and, as traffic from the North-West will also be diverted by the Northern Pacific and other American lines, the tendency of this extension to Detroit will be to increase competition for traffic via Chicago from the Manitoba District, and to lead to a diversion of such traffic from the main line of the Canadian Pacific to Chicago routes.\n\nSo far, for the present position. But the Canadian Pacific Company, it is reported, are now contemplating a considerable expenditure for new lines, amounting to no less than, say, 25 million dollars, or 5 millions sterling, for, say, 1,000 miles of railway in the Province of Ontario alone, besides expending large sums in controlling other lines, or in connection with their railway in the Eastern districts, and in Manitoba, and the North-West and other districts. They will hardly be able to raise these extra millions of money in New York, or on the Continent, and they must naturally look to the British public to advance money for these purposes in a condi-\ntion of affairs which cannot be considered re-assuring. All the lines to be so constructed in Ontario will compete with existing railways, previously paid for by British investors, who have not had too much reason to be satisfied with the result of their Canadian investments; and it cannot be expected that these new railways will be able to produce better results than those already constructed, especially if the traffic has to be competed for at cut rates with the existing lines.\n\nThe Canadian Pacific have hitherto been very much assisted in bringing out their loans by the recognised agents of the Canadian Government, but it has been shown that the previous issues, and the construction of existing parts of the Canadian Pacific Railway, have not produced the traffic results or profit which the promoters of that system so confidently prophesied, and which investors were sanguine enough to believe; and now that Sir George Stephen has retired from the Presidency of the Canadian Pacific Railway, and is seeking a well-earned repose after his active exertions, there may possibly be a less cautious control over the management of affairs in Canada, and a less earnest advocate with investors in this country.\n\nWhen once default is made in the payment of interest on the various bonds and securities by which this undertaking has been so rapidly encumbered, then a very curious legal question will arise—viz., whether the shareholders, who ought, under present arrangements, to receive for the next five years 3 per cent. upon their shares out of the funds set aside by the Company for that purpose, will be safe so far as that dividend is concerned; or whether it will be competent for those bondholders who fail to receive their interest to seize, by means of legal process, the funds so set aside. It has never yet happened in the history of railways that shareholders have received dividends, whilst the bond or debenture holders, taking priority over them, have been in default; and if this question should arise it will be one no doubt to be fought out on both sides with all\nthe skill that the legal profession can provide, at considerable expense, both to the Company and to the parties interested.\n\nSUMMARY.\n\nOn a review of the foregoing official facts and figures, on consideration of the well-known climatic conditions of the country, and having regard to the foregoing unavoidable inferences, it would appear that:\n\n(1) The main line of the Canadian Pacific Company has been constructed—for political rather than commercial reasons—through territories, of which large portions (altogether two-thirds) are ill-adapted for settlement, and unsuitable for the production of cereals; and any through traffic on this main line must be carried in competition with the American Pacific railways; whilst the lines constructed and being constructed by the Company, mainly in the Provinces of Ontario and Quebec, are and will be subject to constant competition with existing railway systems, previously in great part sufficient for the natural requirements of the country.\n\n(2) On a fair estimate, based on the figures officially published, it does not appear that the Canadian Pacific Company is, even under a system of abnormally low maintenance charges, earning its fixed charges for the year 1888; and the inevitable increase in those fixed charges against the profits of the year 1889 will render it still more difficult, on the basis of similar figures, for the Company to earn them in that year; whilst if the maintenance of road and works were charged with a cost similar to that incurred by other principal Canadian Railways, there would (as shown in the figures on page 10) be an annual deficiency—to be faced in future—cf., say, half a million sterling; or, in other words, a prospective annual loss of that amount if the fixed charges were fully met.\n(3) The rates per passenger [and per ton per mile, taken together, have steadily decreased to the extent of 17 per cent. from 1885 to 1887, and they are likely still further to decrease, in consequence both of the extensions of railways across the American frontier into Canadian Pacific territory and of the extensions of the Canadian Pacific system in other parts of Canada where competition will be increased as the result of these extensions.\n\n(4) The charges against Revenue for the working expenses of the Canadian Pacific Railway must in future increase—(a) because they have hitherto been relieved by the newness of works and rolling stock, and by the large expenditure upon the lines opened for traffic charged against capital; (b) because they must in future approximate more nearly to the expenditure for maintenance upon other Canadian lines, not subject to the disadvantage of having to maintain railways for, say, 1,800 miles through mountainous and other difficult country, subject to intense cold and severe blizzards, and occasional destruction by snowslides; vide Illustrated London News, December 1, 1888, pages 657 and 658, illustrating and describing the snowslides.\n\n(5) The various extensions proposed by this Company at an expenditure of, say, 5 millions sterling, in Ontario and Quebec alone, parallel to or competing with existing railways, must tend, especially in the immediate future, rather to swamp than to assist the general undertaking.\n\nThe English shareholders cannot be expected, under existing arrangements, to exercise much control in regard to such extensions. At the recent General Meeting of the Company, held at Montreal, convened for the 19th and adjourned to the 23rd of November—\n\n\"For the purpose of considering and authorising the terms of a lease to the said Company, from the Ontario and Quebec Railway Company, of the extension of the\nline of the last-named company from London, Ontario, to a point on the Detroit River, and of steam and other vessels to be employed as a ferry across such river, in connection with the said Railway and its business; and also the terms and conditions of an agreement between the two companies for securing the speedy completion of the said extension and the establishment and working of the said Ferry”—there were—it is stated—only five shareholders attending in person, of whom four were directors of the Company.\n\n\"Something is rotten in the State of Denmark.\"—Hamlet, I., 4.\nVIEWS OF THE PRESS.\n\nThe following articles from the London Economist, the London Statist, and the New York Financial Chronicle, in regard to issues of capital, and other newspaper articles, more especially in regard to the Canadian Pacific system, will, no doubt, be read with interest, and are here reprinted, as indicating the views of impartial Journals on both sides of the Atlantic:\n\nTHE ACTION OF THE GREAT LOAN HOUSES.\n\n(From the \"Economist,\" London, November 24, 1888.)\n\nThe speculative community are now reaping what they have sown, for the extreme weakness now shown by Stock Exchange securities is a direct consequence of the eager rush after all kinds of new issues likely to command a premium which has characterised the current year. For some time past the market has been in a very sensitive and unstable condition, owing to the continuous efflux of gold, especially to the Argentine Republic, by whom the most lavish borrowings have been made in London and on the Continent—the total sum raised this year by that country, directly and indirectly, being about £40,000,000. And this week the sharp advance in the value of money, which has been so long threatened, has occurred. The effect upon the stock markets has been very marked, for a state of exaggerated apprehension has prevailed, and speculators for the rise in all departments have shown much anxiety to reduce their commitments to small dimensions. But although much has been done, they are still nervous, being fearful not only in regard to the speculation open for the rise, but in regard to the great mass of new securities which are in the hands of speculative investors. Indeed, the position, as a whole, has been decidedly unsatisfactory, and the future has not been regarded without some apprehension even by those not given to nervous exaggeration. In these circumstances there is a strong temptation to find a scapegoat upon whom all the blame may be cast, and recently the important group of large firms by whom the market has been so industriously fed with new issues, has rather generally been picked out for this purpose. And, as usual, the general feeling on the subject has been partly right and partly wrong.\n\nIt has been wrong, because people have formed mistaken views as to what are the proper functions of these great issuing firms, which act as intermediaries between\nthose who borrow on a large scale and the general body of investors. These firms as we have pointed out before, transact a business which, when kept within legitimate limits, is extremely useful to the public. It consists, like most mercantile operations, in buying in bulk and retailing out in more or less small amounts, only the business is in securities instead of merchandise. In other words, they supply home investors with a variety of investments, which afford channels for the continuous accumulation of capital in this country, and they obtain these investments by ministering to the needs of borrowers, or by the support which they afford to the extension of joint stock enterprise. In doing this, they take care that there shall be no technical flaw in their dealings with the public, that, in fact, the formal terms of their contract shall be fulfilled, and, of course, no firm of standing would identify itself with a new issue which was obviously unsound; but beyond this they do not go. It is no part of their province to inquire into the essential soundness of the securities they offer for sale, for that must be left to the judgment of each individual investor, nor should the mere fact of them acting as sponsors to any new issue be understood to imply any guarantee on their part. In fact, to put it briefly, they simply offer certain securities to the public, and if they do this in a bona fide manner, they cannot be rightly expected to go further, and undertake in regard to investors any duties of a \"trust\" character. The public, however, have been accustomed to look at the matter in another light, and, as a result, we have seen investors taking up, without the slightest regard as to their real character, great masses of securities, simply because they were issued by some firm with a great name. For many investors of this stamp we are afraid there will be some day a sad awakening, just as there was some ten or twelve years ago, when Peru, and other States which had issued large loans, through firms of the highest standing, defaulted so completely, and it may also be said so hopelessly.\n\nIn a measure, however, the public have been right in reprobating the conduct of the great houses which have been inundating the market with new securities, for in too many cases they have not kept within the legitimate limits of their business. On the contrary, they have taken many measures quite outside them. For instance, it has been notorious that some of the difficulties now being experienced in the money market are due to the fact that the firms who had new loans to issue have used very strong means to keep the value of the money artificially low, and have thus neutralised the natural effect which their operations would have had upon the market. Moreover, there has been a good deal of manipulation in the stock markets, in order to give prices an appearance of firmness which otherwise they would have not possessed. The object of these operations has been, of course, to attract investors and induce them to take up securities from which, if left to themselves, they would have probably stood clear. This conduct does not differ in any essential respect from the \"rigging\" of shady company promoters, or the market manoeuvres of unscrupulous American railway magnates of the Jay Gould type. If we take, for instance, the case of the Deccan Mining Company, just investigated, in which the stock market was manipulated in order to induce the public to buy at high prices shares whose value was extremely doubtful, or if we look at some of the tricks which have been played by speculators like Mr. Gould, we shall, no doubt, find some difference in degree, but they are, nevertheless, of essentially the same kind as those which have recently flourished in high circles in London. In such circles the old maxim, noblesse oblige, had once a certain binding power, for there was a jealousy of good\nname and credit which was more powerful than the attraction of a \"fat commission,\" but for some time past this has seemed to have become almost a mere tradition. It may be of little use to utter vain regrets respecting the change, but investors will do well to bear in mind a little more closely in their future dealings, unless they want to lose money. Unfortunately, the public have short memories, or they would not have forgotten the lessons of the last decade, when it was so conclusively shown that the standing of the issuing house had nothing to do with the soundness of the securities they offered to the public.\n\nMESSRS. BARING BROTHERS' ISSUES.\n\n(From the \"Statist,\" December 1, 1888.)\n\nWhen there is action detrimental to the public interest, and yet not infringing any provision of law, restraint can be imposed only by enlightened public opinion. Public opinion, when ill-informed, is apt to make a scapegoat of the wrong person, and to cry out for the wrong remedy, but when well-informed, its influence for good is incalculable. It is the function of the press to inform public opinion, and with that object in view we print below a list of the principal issues made by Messrs. Baring Brothers since the beginning of 1882. The Money Market for some time has been disturbed every now and then by the drain of gold resulting from the foreign issues, more particularly of the present year. Business men in consequence have been made anxious, for the fear is ever present to their minds that money may become suddenly so scarce and dear as to paralyse business, and thereby jeopardise the improvement in trade. The drain of gold has been stopped for the moment, but everybody knows that it may set in again by-and-by, and if foreign issues continue it will go on growing until it becomes a serious danger. It is desirable, therefore, that the influence of public opinion should be brought to bear upon those who are immediately concerned in launching these foreign issues. And to enable this to be done we begin with the list of those issues for which Messrs. Baring Brothers are responsible. The list is a remarkable one. It began, as we have said, in 1882. In 1883 there were no issues. In six years, however, the enormous sum of 95 millions sterling has been brought out by this single house, and with three exceptions—two breweries and the Manchester Ship Canal—all the issues are foreign or colonial. Messrs. Baring Brothers cast their net widely—from China, in the extreme east, to Canada and South America in the extreme west. Naturally, as was to have been expected at the present time, Argentine issues figure very largely, and Uruguay obtained in a single lump 4½ millions sterling, though how the Messrs. Baring could think it deserving of such large credit, either on the score of population, development, or political stability, passes our comprehension. It will be noticed, too, that since 1884, Messrs. Baring have been growing bolder and bolder in their invitations to the public. In that year they offered altogether very little more than 6½ millions sterling; in 1886 they offered over 18½ millions sterling; in the present year, up to date, they have offered somewhat more than 28 millions sterling, irrespective of the Buenos Ayres Drainage, &c., Loan, which we are glad they did not succeed in placing with the public.\n\nIt may be said that it is the business of firms like the Messrs. Baring to bring out loans and companies, and that the fault rests with the investing public if they take too many of the bonds and shares offered. We do not care to bandy words as to which is\nmost in fault; the issuing houses or the public, but it is evident that the public are in a very different position from the great issuing houses. The public consists of a vast multitude of individuals scattered all over the country, without means of communicating one with another—and, therefore, of acting in combination—guided very largely by brokers and bankers, who, in turn, are guided very largely by the issuing houses. The case is different with such a great house as the Messrs. Baring. They are bound, in the first place, to lay before the public such material facts as will enable the public to judge whether the securities offered are a desirable investment; they are bound, secondly, to assure themselves, through their connections of every kind, as to the correctness of the material facts stated. They are able, save under exceptional circumstances, to float an issue, and they can therefore put pressure upon Governments and industrial companies to extract all necessary information. Of course, like everybody else, the Messrs. Baring Brothers may be deceived, but if they take reasonable care to inform themselves, they have done their duty; unless they do so, they have not.\n\nIt is sometimes contended that an issuing house does not guarantee the security it offers, and all that can be expected from it is to ensure a compliance on the part of borrowers and promoters with certain formal conditions. We totally dissent from this view of the duty of issuing houses. The law as it stands no doubt imposes very little responsibility upon issuing houses; it deals rather with directors, who are often mere creatures of the issuing houses, and with promoters. But the law as it stands is notoriously defective, and public opinion ought to step in and enforce upon issuing houses precautions which the law neglects to impose upon them. The issuing houses ought to be required to set before the public all material facts necessary to enable an investor to judge of the character of the security offered to him, and we regret to say that this condition the Messrs. Baring very often fail to comply with. Their prospectuses too frequently are not merely meagre, but quite insufficient to enable anyone to judge of the character of the security. The Messrs. Baring, moreover, never state what compensation they receive for bringing out either a loan or a company, though surely this is a material circumstance. They sometimes, like other loanmongers, act for a commission, but sometimes, it is said, they buy the issue outright at an equal price, and then offer it to the public at a higher price. In no case, however, do they state what profit they stand to make. Messrs. Baring do not explicitly state whether they have taken proper pains to satisfy themselves that the loan or the company is one for which a great English house ought to stand sponsor. Of course their name ought to be sufficient recommendation. One other point is, their dealings with allotments have given rise to widespread dissatisfaction.\n\nIt might reasonably have been expected that the Messrs. Baring would exercise a restraining influence upon borrowers, especially upon Argentine borrowers, when it became evident that they were piling up debt too fast. We admit, of course, that an issuing house benefits the public, while benefiting itself, in offering investors sound securities, provided always that it does not carry the business too far. In this country capital accumulates more rapidly than the means of profitable investment. In new countries the means of profitable investment exceed the supply of capital. To enable the saving classes in this country, therefore, to invest their money safely and profitably abroad, is, no doubt, a benefit to the public; but it ceases to be so when too much capital is sunk in any particular country. We have seen even in so rich a country as France how an extravagant expenditure on military preparations, on railways, canals, and schools, led to a crisis six or seven years ago, from which the\ncountry has not yet recovered. We have seen again frequently in the United State how over-construction of railways ends in a crash. It ought to have been obvious, therefore, to Messrs. Baring long ago that Argentine issues were growing excessive, and that some moderation had become imperatively necessary. It was the duty of Messrs. Baring to use their influence to ensure moderation, for it was largely owing to them and their patronage that Argentine credit stood so high in this market. They ought to have been well aware that when it was known in the Argentine Republic that Argentine securities were being eagerly taken up here, a swarm of promoters would spring up anxious to take advantage of the opportunity that seemed to be offered; and, in fact, London at the present moment and for months past has been overrun with such promoters. But Messrs. Baring Brothers did nothing. It may be said that if they had refused to bring out this or that issue others would have been more complaisant. That surely is no excuse in the mouth of so great a house. It is much better, in the long run, that bad business should not be embarked in than that insecure loans should be foisted on the public by one of the greatest of our houses. In the long run the latter policy does not pay.\n\nChronological record of the principal loans, &c., offered by or issued through Messrs. Baring Brothers and Co.:—\n\n| Date       | Loan                                      | Amnt. & Issue price |\n|------------|-------------------------------------------|---------------------|\n| March, 1882 | Buenos Ayres                              | 6,2049,200          |\n| May        | Atchison Topeka and Santa Fe Railway      | 750,000             |\n| June       | Cape of Good Hope                        | 3,000,000           |\n| Oct.       | Transcaucasian Railway                    | 8,904,200           |\n| March, 1884 | Argentine                                 | 1,683,100           |\n| June       | Canada                                    | 5,000,000           |\n| March, 1885 | Atchison, &c., Railway                    | 1,000,000           |\n| June       | Canada                                    | 4,000,000           |\n| July       | Chinese                                   | 1,500,000           |\n| Jan. 1886  | Argentine                                 | 4,000,000           |\n| Feb.       | Southern Mahratta Railway                 | 1,200,000           |\n| March      | Buenos Ayres                              | 1,933,600           |\n| April      | Canadian Pacific Railway                  | 4,191,500           |\n| Aug.       | Illinois Central Railway                  | 1,000,000           |\n| Oct.       | Guinness, Son and Co.                     | 6,000,000           |\n| Jan., 1887 | Argentine                                 | 4,295,100           |\n| June       | Atchison, &c., Railway                    | 3,000,000           |\n| July       | Italian Railway                           | 6,300,000           |\n| Jan., 1888 | Canadian Pacific Railway                  | 750,000             |\n| Feb.       | Grand Russian Railway                     | 1,888,000           |\n| April      | Uruguay                                   | 4,255,300           |\n| May        | Baltimore and Ohio Railway                | 1,500,000           |\n| June       | Canadian Pacific Railway                  | 3,093,700           |\n| June       | Philadelphia and Reading Railway          | 4,937,200           |\n| Nov.       | Buenos Ayres Drainage, &c.                | 3,500,000           |\nAggregate of the principal public loans, &c., offered by or issued through Messrs. Baring Brothers and Co:\n\n| Year | Amount       |\n|------|--------------|\n| 1882 | £14,703,400  |\n| 1884 | 6,683,100    |\n| 1885 | 9,500,000    |\n| 1886 | 18,325,100   |\n| 1887 | 17,595,100   |\n| *1888| 28,197,780   |\n\nTotal of 5 years and 11 months £95,004,480\n\nExtract from the New York \"Commercial and Financial Chronicle\" of Nov. 3, 1888, on the subject of the reduction of the Chicago Milwaukee and St. Paul dividend.\n\nThis being the state of affairs, what has been the part of investors abroad in bringing it about? Have they been disinterested spectators? Have they lent no aid or support to the new undertakings, but sought to discourage them by withholding the necessary pecuniary means? Is it not a fact, rather, that they have taken with great avidity the securities issued for the new roads? As regards the St. Paul itself, a good part of the new issues have certainly been placed in England. And as regards the issues of many other companies, the same thing may be said. Indeed, it is so well established, that a considerable portion of the money for carrying on the new construction work of the past two years has come from across the ocean (not entirely from Great Britain, of course) that it would be superfluous to argue the point. Suppose now the foreign investor had discountenanced the schemes, taken a decided stand against them, and firmly refused to subscribe money to them. Would not a great many of them have fallen to the ground, and to-day have no existence? But perhaps it will be claimed that the responsibility in such cases is rather remote. Englishmen were not charged with the management of the roads, and simply took the bonds offered because they appeared to be a good investment. Take, therefore, a road directly under English control and ownership. There is at least one such Company in the North-West. Yet that Company has been just as free in building new lines as any other—if anything, a little more so—and it has never had the slightest difficulty in getting from its English supporters all the necessary funds. Even in the case of the St. Paul, it will be admitted, we think, that if English influence instead of American had been paramount, the money would have been just as readily forthcoming and probably just as readily asked for. What justification is there, therefore, for thinking that if the foreign owner had exercised his influence the result now would be any different?\n\n* Eleven months to end of November and exclusive of the Buenos Ayres Drainage and Waterworks issue of November.\nBEWARE OF THE CANADIAN PACIFIC.\n\n(From \"Truth,\" November 15, 1888.)\n\nSir Henry Tyler raised a grave question as to the great rival of the Grand Trunk when he asked at the meeting whether, as time goes on, the Canadian Pacific's net profits will suffice to pay the fixed charges of the line? This remark has induced my friend Emanuel to look into the figures, and the result is a table which I give you below, and which shows the prospects of this greatly subsidised and extravagantly managed line in a very unenviable light:\n\nFixed charges for 1887, as per report ........................................... $3,250,263\nAdditional on £1,000,000 (only four months, interest in 1887) .............. 176,822\nAtlantic and North-West Bonds—\n£1,330,000 at 5 per cent., £66,100, say .................................. $332,500\nLess subsidy .................................................................................. $186,600\nLess charge in 1887 ....................................................................... 9,985\n........................................................................................................ 196,585\n\nAlgoma Branch Bonds—\n£750,000 at 5 per cent., £37,500, say ............................................ 187,500\nLand Grant Bonds (new issue)—\n£3,093,700 at 3½ per cent. for six months, £4,139, say ..................... 370,697\n\nNet revenue in 1887 ........................................................................ $4,021,197\nAdd nine months' net increase .......................................................... $3,504,000\n........................................................................................................ 197,000\n\nTherefore to make up in three months .............................................. $3,701,000\n........................................................................................................ 320,197\n\n........................................................................................................ $4,021,197\n\nThe above estimate of the fixed charges very nearly agrees with that mentioned by Sir Henry Tyler at the Grand Trunk meeting. As regards the Atlantic and North-West Bonds, it may be mentioned that nine months' interest was paid in 1887, but is not traceable in the accounts. This interest was, apparently, paid out of proceeds of bonds in 1887, excepting the proportion for the completed part of the line. There were outstanding at the end of 1887 $3,471,000, less sales on deferred payment, $1,252,827, leaving outstanding at 5 per cent. $2,218,173. Nothing is added above for the Saults Bridge, although the Canadian Pacific own half of that bridge. No addition is further made for the Japan steamers; do the company own them or not? It will be seen that, if the above figures are correct, there is little chance of the Canadian Pacific Company earning the fixed charges. And what then? Surely this is not a time for runous competition and unprofitable extensions!\n(From \"Truth,\" November 29, 1888.)\n\nSince I published my table of the revenue and fixed charges of the Canadian Pacific Railroad (Truth, November 15), this stock has receded over two points, a result at which you will not have been surprised. I am afraid my statement has been sorry news for a good many stockholders, some of whom, by the way, object that possibly the amount of interest on the Atlantic and North-West Bonds and on the Algoma Branch Bonds will not rank in full, as the lines were not yet completed, and that the interest on the Land Grant Bond may also fall short of my estimate. But, after making every allowance for such contingencies, I cannot see how the fixed charges can be covered by revenues. I say this in spite of the Canadian Pacific president's latest utterance, and I really cannot see by what course of jugglery he will be able to show the surplus over fixed charges which he foreshadows. A correspondent writes from Glasgow to the Railway News very hopefully as to the traffic announcements to be anticipated for the next few weeks, and which he expects will be greatly benefited by the opening of the Minneapolis Sault St. Marie and Atlantic, and of the Duluth South Shore and Atlantic lines. It is to be hoped that his expectations of an additional traffic of $100,000 to $200,000 per week will be realised, but I must confess to being somewhat sceptical on this point.\n\nCANADIAN PACIFIC RAILWAY.\n\n(From the \"Financial Times,\" Friday, November 23, 1888.)\n\nThe sharp fall which has taken place during the past few days in Canadian Pacific Stock can hardly have been altogether unexpected. The only subject for surprise is that the drop has not taken place before, but if an explanation of this were needed it probably would be found in the strength with which the stock is held in this country. The fact that it is so largely held as an investment by people who are interested in the development of our great American dependency, always makes it a particularly unthankful task to write anything deprecatory upon the position of the railway or its prospects for the future. But the time has come when it is a serious question whether silence ought to be maintained any longer. It is impossible to deny that the past has been fraught with keen disappointment, and that the future is full of uncertainty. In spite of the fostering care of the Canadian Legislature, in spite of almost unlimited financial assistance in the shape of subsidies, and in spite of the comparative immunity it has enjoyed from serious competition, the road (as a commercial undertaking) can be pronounced little short of a failure. Of course, if the Government guarantee were a perpetual one, there would be little cause for anxiety, but the stockholders are confronted with the knowledge that the guarantee expires in 1893. Can anyone\nseriously believe that even if the development of Canada proceeds at a far quicker rate than in the past the railway will be able to stand alone in five years' time? True it is that there is a possibility that the Government may be found willing to prolong the guarantee, but we fear it is a very faint one. Any such attempt would be met with the most strenuous opposition, and besides this, five years in the history of a new country like Canada may be pregnant with great results, that would make a prolongation of the guarantee an impossibility. Taking the present year, it is more than questionable whether the company is earning its fixed charges. According to the statements issued by the company, they amount to $4,021,197, and to make up this sum it will be necessary that $320,197 increase must be earned by Christmas. What possibility is there of this being accomplished? The amount of grain to be moved falls far short of the anticipations upon which the stock advanced in the summer. Traffics are thoroughly disappointing, and from all accounts they are likely to continue so.\n\nIt is significant also of the unsatisfactory position of the road that during the past three years the gross receipts have increased by $2,991,197, the working expenses by $2,993,683, and the fixed charges by $431,959. Thus, in spite of the increase in the gross earnings, it can hardly be contended that the company is in as favourable a position as three years ago.\n\nTurning to the future, there can be little doubt that the Red River Extension Line will become an accomplished fact, in spite of the opposition of the State subsidised road. The case is now being argued before the Canadian courts, and the decision is expected in a few days. When the Red River Extension Railway is built and in working order, it must cut very seriously into the traffics of the Canadian Pacific, as it will offer much greater facilities to the farmers of Manitoba than the existing line can afford. We know that there is a disposition to underrate the importance of this competition, but we think it will be clear to any unprejudiced mind that if the Canadian Pacific Company could have afforded to treat with contempt its rival, it would not have opposed its construction with the rancour and the bitterness it has. Judging by the enthusiastic manner in which the Manitobans have supported their local line, being ready even to defend it with their lives if necessary, there appears little doubt that when it is constructed throughout it will receive a very large part of the grain transportation and other traffics of the Province. It must also be remembered that the Canadian Pacific has drawn an enormous revenue from Manitoba, and that in no part of its system would competition be more disastrous. But this is what it has to look forward to, and it will be a matter of surprise if its traffics do not in consequence suffer very materially.\n\nThe last and most serious contingency is the disposition of the Canadian Pacific to invade the territories served by the Grand Trunk. Sir Henry Tyler, at the last meeting of the proprietors of the latter company, spoke in no uncertain terms of what the result will be. Those results are already within measurable distance. In this instance, at least, it cannot be claimed that the Grand Trunks are the offenders. Already they have suffered considerable provocation, but it cannot be expected that they will tamely submit for ever. The utterly unjustifiable aggressiveness of the Canadian Pacific must end in a war of rates, and what this means for both companies requires no illustration. Certainly this invasion in the territories of the Grand Trunk Company cannot in the near or distant future bring anything but constant friction, repeated hostilities, and an enormous loss to the proprietors. There is not the\nslightest excuse for it, as the Trunk line certainly provides every transportation facility necessary for the inhabitants; there are no reasonable complaints of the monopoly the company enjoys leading to excessive or extortionate rates; nor is really the volume of business sufficient to tempt the cupidity of a rival. It only seems a part and parcel of the senseless extension of the Canadian Pacific system which has been going on of late, regardless of the rights of others. To this cause is largely attributable the position of the company to-day, the enormous amount of its fixed charges, and the unmanageable figure its capital account has assumed, and yet, in spite of the aggressiveness the Canadian Pacific has shown, we see with what jealous watchfulness it endeavours to preserve itself from the inconvenience of competition.\n\nTaking all these eventualities into consideration, the present price of the stock certainly far more represents its true value than the quotations of a week ago.\n\n---\n\n**THE CANADIAN RAILWAY QUESTION.**\n\n*(From the \"Statist,\" December 1, 1888.)*\n\nThe Grand Trunk and Canadian Pacific Railways, combined, hold and control nearly ten thousand miles of railway, and although the Canadian Pacific, *per se*, is purely a trans-continental line from the Pacific coast to the St. Lawrence River, not at all interfering with the Grand Trunk, still, through a system of extensions, more especially that of the Ontario and Quebec, which is guaranteed by the Canadian Pacific, that system is now interwoven, so to speak, with the Grand Trunk to such an extent through the provinces of Quebec and Ontario as to render sharp competition inevitable; and, as usual, such a competition means low rates and small profits.\n\nConsiderable interest has been aroused recently by a proposition which was submitted to a meeting of the Canadian Pacific shareholders last week, for the extension of the guarantee of the Ontario and Quebec for a further portion of that line from the city of London, Ontario, to the Detroit River, and as this line for a distance of 110 miles would have to be constructed almost within a stone's throw of the Great Western Division of the Grand Trunk, it has caused great anxiety both to the shareholders of the Canadian Pacific Railway and those of the Grand Trunk, because it is believed by the former that these continued guarantees will jeopardise their dividends, and by the latter that it will bring in another competitor for the through American business between Chicago and New York. It is, therefore, not to be wondered at that those concerned should take this serious position of affairs into their careful consideration.\n\nIt was stated in a cable message published by a contemporary that the president of the Canadian Pacific had remarked at the meeting of shareholders of that company, which was called to consider this question, last Saturday, that several attempts had been made to come to an agreement with the Grand Trunk, by which running powers over that line could be secured between London and Detroit, and that these attempts had been unsuccessful. The President of the Grand Trunk, at the meeting of that company's shareholders on the 30th October last, stated, on the other hand, that...\nevery effort had been made on their part to come to an arrangement with the Canadian Pacific, but that they had been unsuccessful. The only way of arriving at the truth after these conflicting assertions was by the publication of the correspondence between the managers of the two companies, and this has been done. On examination of this correspondence we find that the statement made by the Canadian Pacific president, that the Grand Trunk Company would only make an arrangement on condition that the Canadian Pacific Company gave up the right to do business from the Province of Ontario, along its long route round by Smith's Falls and North Bay, to the Canadian North-West, is inaccurate, because there is no such statement to be found in the correspondence; on the contrary, the Canadian Pacific demanded that, if they made an arrangement with the Grand Trunk, that that company should be precluded from using its own American lines for any traffic to the North-West. Now, there are two ways of reaching the North-West from the City of Toronto; one is by the Northern system of the Grand Trunk to North Bay to a junction with the Canadian Pacific main line, a distance of 229 miles, as against 449 miles by the Canadian Pacific via Smith's Falls, to the same point; the other route is by the American connections of the Grand Trunk, by the Chicago and Grand Trunk, and the Detroit Grand Haven and Milwaukee. The restriction, therefore, alluded to was demanded by the Canadian Pacific, and not by the Grand Trunk, as alleged. Another feature is revealed in this correspondence, and that is, that the Canadian Pacific intend building a line from Sudbury Junction parallel with the Northern division of the Grand Trunk Railway to Toronto, and also contemplated another extension of the Ontario and Quebec to the Niagara frontier. So that what with the paralleling of the Grand Trunk from London to Detroit, its Northern division, and the further extension to the Niagara River, the plans of the Canadian Pacific are, of course, perfectly clear. Now, as the Grand Trunk are willing to give the Canadian Pacific running powers from London to Detroit for reciprocal rights of running over their Algoma branch to the Sault Bridge, here is a modus vivendi combining the minimum of damage with the maximum of convenience to the public; furthermore, unnecessary construction would be avoided.\n\nThe solution of this dangerous position is in the hands of the shareholders of the Canadian Pacific Railway, and it is for them to bring proper pressure to bear upon their board of directors to curtail these ambitious and unprofitable extensions, paralleling the existing systems of the Grand Trunk, and materially increasing the guaranteed and fixed charges of the Canadian Pacific Railway. Perseverance in this dangerous course can have but one ending, and that is the pulling down of the financial credit of both companies.\n\nIt should not escape notice that Mr. Van Horne's letter of October 30 was written one month and three days after Mr. Hickson's letter to him. The \"haste,\" therefore, which Mr. Van Horne desires in his correspondence does not appear to have been very genuine. A few dates may be of interest. Mr. Hickson's letter was dated September 27, Sir Henry Tyler sailed from New York on October 6, and addressed a meeting of Grand Trunk proprietors in London on October 30, and on the same day Mr. Van Horne wrote his letter, this being, as before stated, a month and three days subsequent to the letter received from Mr. Hickson, on which date Mr. Van Horne had no doubt heard the result of the proceedings at the Grand Trunk meeting in London.\nTHE C. P. R. PRESIDENCY.\n\nFrom the \"Shareholder and Insurance Gazette,\" Montreal, August 10, 1888.)\n\nThe scheme of connecting the Atlantic and Pacific Oceans by an iron road, entirely within Canadian Territory, originated with the Right Hon. Sir John A. Macdonald, Premier of Canada, and to him must the credit of the scheme which resulted in the materialisation of the idea be accorded. The building of the Canadian Pacific Railway was, however, the work of others. The Presidency of that Company was entrusted to Mr. (afterwards Sir) George Stephen, as all our readers are aware. The amount of hard and constant labour which devolved upon him, developed to its full what vast energy, indomitable perseverance, and solid determination could accomplish. As a result, the Canadian Pacific Railway was begun, carried on, and completed. That the country has been and will be benefited by the construction of this vast undertaking no one possessed of reasoning faculties can deny. That success has attended it under all the circumstances which its construction have given birth to is, however, a consequence which it would have been rash not to expect. The country stood by the company through thick and thin, paid it for the construction of the road, and or its completion made it a present of the work for which it had been paid. To accomplish all this required the presence of qualities of no ordinary kind. It is not to be wondered at, therefore, that relief should be sought from the mental strain which such a vast undertaking imposed upon the president of the company. We therefore congratulate Sir George upon the achievement of all that he has done, and upon the success which culminates all his efforts, and we hope that the rest he now seeks will give new point to his energies and new vim to his faculties. The Canadian Pacific has been a success so far as Sir George is concerned; but while we are disposed to give the company and its late president all the credit which the accomplishment of this great undertaking deserves, we cannot in justice to the country refrain from expressing regret at the aggressive disposition exhibited by this company towards other roads built under vastly less favourable conditions in so far as the country's assistance was concerned. There has been an attempt—a desperate attempt—to sublocate, strangle, and destroy other roads built with the capital of the shareholders, and those for the most part residents of the Mother Country, who not only had faith in Canada's future, but had the courage to apply that faith to their purse-strings and invest their capital in bringing under subjection the wilds of this vast colony. A decent regard for the interests of the people who had paid for and then given the Canadian Pacific Railway to the company, would have, one would think, restrained the grasping tendencies of those from whom to expect some consideration would not have been either ungenerous or un-British. It was both ungenerous and un-British of the Canadian Pacific Railway Company to use the power it had acquired from the people to injure the people and the country by entering into direct competition with roads already established, when the object of such competition was not honourable rivalry on equal terms, but injury whenever and wherever it could be inflicted. The consideration of this position is not unworthy the company at the present day. As to Sir George Stephen's successor we have not much to say. He is a foreigner and an alien. There was no Canadian\ndeemed fit to take his place. The election of Mr. Van Horne as President (retaining the office of General Manager) of the Canadian Pacific Railway, virtually tells Canada and the Canadian people that the road, though built with Canada's money, is intended for foreigners, and no doubt the day is not far distant when foreigners will own and control it for the purpose of making money out of it. The resignation of Sir George Stephen and the appointment of Mr. Van Horne to succeed him are significant. We hope, however, that there is nothing in the significancy, but as it is, foreigners have and have had already too much to say in the management and control of the road.\n\nTHE CANADIAN PACIFIC RAILWAY.\n\n(From the \"Bullionist,\" November 10, 1888.)\n\nThe news from Manitoba is to the effect that the men of the Red River Railway Company have managed to get an engine across the Canadian Pacific line, in spite of legal and mechanical obstructions, and although the latter company promptly destroyed the track, the construction of the extension is being rapidly proceeded with, and before long Northern Pacific trains will be running right through the Manitoba district to Langenberg. It is easy to understand that the Canadian Pacific will strain every nerve to prevent this, but the time is past when it could have done so with success, and soon, in addition to its other troubles, it will find that a considerable portion of the traffic of the only paying portion of their eastern division will be diverted to the American lines for transport to the seaboard. It cannot be said that this new line will make traffic for itself. In any way improve the country through which it runs, as it merely parallels existing roads in a district already too well provided to be worked profitably. It may be that rates have not yet been lowered to any extent, but as soon as the connection shall be completed the struggle will begin, and not merely for local traffic but for a considerable portion of the main line work.\n\nThe existence of this new competitor is the natural outcome of the agreement under which the Dominion Government guaranteed the payment of the interest on the late issue of $15,000,000 Three and a Half per Cent. Land Grant Bonds; for the first clause of the agreement between the Government and the company sets out that the restrictions contained in clause 15 of the original contract, dated the 21st day of October, 1880, between the Government and Sir George Stephen and others on behalf of the company, which gave the Canadian Pacific an absolute monopoly throughout the eastern part of their system, shall be removed; but such were the necessities of the company that, in order to obtain the money they required to complete and equip their road, they were compelled not only to mortgage the whole of their unsold land, but also to give up what to them was an invaluable protection. That their necessity was great is apparent, as at the end of last year, and before the issue of this new loan; the balance-sheet disclosed an excess of more than $3,000,000 of floating liabilities over floating assets. Besides, it must be borne in mind that the endeavour of the Americans to tap the Manitoba district is only a reply to the\nCanadian endeavour to draw traffic from them by way of Sault Ste. Marie and of Detroit, and the annulment of clause 15 of the original contract referred to above gives them the opportunity.\n\nUnder the very favourable conditions upon which the company was placed by the special assistance and large subsidies received, it might reasonably be imagined that the earnings would be sufficient for all purposes; but what do we find? Last year, after providing for fixed charges, there were only available towards dividend on the Ordinary stock $253,854, which is at about the rate of 3/4 per cent. for the year; nor are the prospects of the current year so good, as with increased earnings the working expenses are larger, and the fixed charges considerably augmented.\n\nTurning first to the capital account, let us see what portion of the property has been actually given to the company by the Government and others.\n\n**CAPITAL**\n\n| Description                                      | Amount       |\n|--------------------------------------------------|--------------|\n| Shares issued                                    | $65,000,000  |\n| Loans on mortgage, main line                     | 34,998,633   |\n| \" other lines                                    | 14,226,888   |\n| Cash subsidy                                     | $25,000,000  |\n| Lines handed to the company by Government        | 35,000,000   |\n| (estimated)                                      |              |\n| Proceeds of lands sold                           | 19,225,181   |\n| Land loans, new                                  | 15,000,000   |\n| \" old                                            | 3,471,000    |\n| Bonuses from townships                           | 307,600      |\n| Total grants                                     | 98,003,781   |\n| Floating liabilities                             | 6,599,780    |\n|                                                  | $218,829,082 |\n\nThe land loans included in the above will be paid off as the land is sold, and these sales may, besides, leave a further profit beyond the amount required for such redemption (the agreement whereby the three and a-half per cent. loan was issued provides for the payment off of the old land bonds out of the proceeds of that loan, although this is not included in the Schedule \"A\" attached thereto). But in the meantime the interest must be met out of the earnings of the line, in addition to the interest on the five per cent. mortgage, the mortgage loans, and other guarantees to leased lines not included in the above.\n\nThe capital subscribed has not all been expended on the line, as $15,942,645 had to be deposited with the Government to constitute a fund to provide for the payment of a dividend at the rate of 3 per cent. per annum for ten years from August, 1883, on the ordinary shares; and out of the proceeds of the Canada Central First Mortgage a deposit of $1,500,000 had to be made to secure the sinking fund. Taking the income account of last year, and adding the increase to date, we can easily arrive\nat a fair estimate of the year's takings, and so of the probable income available for all purposes in 1888.\n\nTotal gross earnings, 1887 .................................................. $11,606,412\n\nAdd—\n\nIncrease for present year, ten months, ......................... $1,508,000\nequal, at same rate for twelve months, to ....................... 1,806,000\n\n$13,412,412\n\nLess—\n\nWorking expenses at same ratio as last year. (The monthly statements for 1888 show a larger proportion so far) ................. 9,725,000\n\n$3,687,412\n\nFixed charges 1887 .................................................. $3,250,263\n\nFurther Loans issued since—\n\n3½ per Cent. Loan, half-year only ......................... 262,500\nAlgoma Branch Line Bonds ................................. 173,375\nSaulte Ste. Marie Bridge, half share ......................... —\nOther loans and guarantees ................................. —\n\n$3,686,138\n\nEstimated surplus in 1888 .................................................. $1,274\n\nThis result, it may be remarked, is upon 224 more miles operated than last year. In order to pay 3 per cent. upon the Ordinary shares the sum of $1,950,000 is required, so that the earnings must show a net weekly increase of $17,500, equal to a gross weekly increase of $63,750 beyond what is being earned at the present time, unless the working expenses should be very largely reduced. The very limited increase in the traffics is disappointing, and necessitates that the shareholders should boldly look the position in the face. In five years they will be entirely dependent upon earnings for their income. It has been so long and confidently stated, that \"the Government will extend the guarantee,\" that the future has caused no anxiety. But the idea of an extended Government guarantee is simply moonshine. In point of fact there is no such thing as a Government guarantee, as usually understood, although in the \"Daily Official List\" this note is appended to the shares:—\"Guaranteed by Dominion Government to 1893.\" A part of the capital was sunk in the purchase of a ten years' annuity, and to that extent there is a guarantee for the payment of a 3 per cent. dividend for that period; but this cannot, except by a misapplication of terms, be called a Government guarantee. There is no doubt that this belief in a Government guarantee has always cast a sort of glamour over the property, and given it a fictitious value; but there never was any ground whatever for the statement.\n\nThat the Canadian Government will do anything more for the Canadian Pacific line than it has already done is extremely unlikely in face of the decided public opinion to the contrary, and the bitter opposition of the Grand Trunk party. And this is evidenced by the exceedingly hard bargain the Government drove with them when they undertook to guarantee the last loan. They not only took as security their only valuable asset, but withdrew from them the only power they possessed or securing for themselves a paying traffic.\n\nThe line of itself is maintaining a positive struggle for existence. Everywhere throughout Ontario it is extending its branches at a ruinous cost, and bringing itself into competition with the Grand Trunk. Even now they are\nspending more money and hypothecating the future in order to build a line actually alongside the Canada Southern, so as to be able to boast of a through connection with Chicago, the value of which is more than doubtful except as a means of reducing rates all round. The financial condition of the Company, in spite of the help it has received, is very bad; the earnings, too, are bad, and the only connected idea apparently underlying the policy of the directors is reckless competition with everybody all round. They are like spoiled children; they have received so much that they think then can get more by merely asking, but the chances are much more likely that the Dominion Government will have to take over the line at a date not remote, and adopt the mortgages only, leaving the shareholders out in the cold when their annuity is exhausted.\n\nThe Grand Trunk Company recognise the position thoroughly, and the speech of Sir Henry Tyler to the proprietors at the General Meeting contained no more forcible remarks than when he spoke of the suicidal conduct of the Canadian Pacific, and expressed the determination of his Company to fight, not only for their share of traffic, but against the Dominion Government giving them any further assistance. Thus they are making for themselves bitter enemies in the western division, both with the Trunk and with the American roads, by the extensions to Chicago and St. Paul, which is returned with interest on the one hand in the direction of Manitoba and on the other in Ontario. President Cleveland's retaliation message appears to be forgotten for the time, but it may at any moment be revived and even carried out. What, then, would be the position of the Canadian Pacific? In the summer they can ship at Quebec, but in winter they have absolutely no opening to the Atlantic without passing through a part of the United States, and in order to avoid this they must either run over a portion of the Grand Trunk line or build one for themselves, or else bridge the St. Lawrence River at Quebec, and to do either of these last they have not got money, while in any case it means diminished earnings. At present there is a break in the continuity, and unless the transit can be made entirely through British territory should the necessity arise, our Home authorities would not be justified in making any contract with them or granting any subsidy.\n\nWe decidedly think that partly owing to a sort of patriotic feeling, but more to the misleading statements about a Government guarantee, the shareholders of the Canadian Pacific are living in a fool's paradise; for no reliance whatever is to be placed upon the expectation of the line earning dividends upon its ordinary shares for many years to come, and in the meantime the Directors are carrying out a policy which will, sooner or later, bring the line to utter ruin. The value of a Three per Cent. Annuity for five years is about £13, and, as a speculative contingent stock, the shares will always be worth something, but certainly not what they are at present quoted at. In five years they will have to fight their own battle, and unless something out of the ordinary course occurs, it will be a very hard one.\n\nTHE CANADIAN PACIFIC RAILWAY.\n\n(From the \"Bullionist,\" December 1, 1888).\n\nSince we made some remarks on this company in our issue of the 10th inst., we have heard what the president, Mr. Van Horne, has to say upon the present con-\ndition and future prospects, and it is by no means reassuring to the shareholders. The published correspondence between this gentleman and the managing director of the Grand Trunk line only shows that the divergence of views existing cannot easily be bridged over; nor can we see how it is possible to come to any arrangement satisfactory to both parties. What the Grand Trunk has it wishes to keep, and as a set-off against what the Canadian Pacific diverts in its Eastern section, it asks a share of the Western traffic.\n\nWe before referred to Sir Henry Tyler's words at the last general meeting of the Grand Trunk Company, and although he spoke more in deprecation of the policy pursued by the Canadian Pacific, there was apparent a full recognition of the gravity of the situation, and a well-formed opinion as to the policy to be pursued. From the correspondence we see now that he might have said a great deal more, but he was evidently influenced by the hope that matters might yet be arranged. Last Friday's meeting at Montreal has dispelled this idea, and war to the knife is declared. Hampered as it is by monetary difficulties, Mr. Van Horne's Company is heavily handicapped, while the Grand Trunk has more resources and is unfettered in any way, and besides this is actually independent of the other company. The proprietors in England are only beginning to realise the situation. The assistance given by the Dominion Government in guaranteeing the late loan was too dearly bought. The assistance was perhaps absolutely necessary; so was the mess of potage to Esau. But a birthright once parted with cannot be recovered. What, after all, have the Trunk people to gain from the Canadian Pacific that they cannot get for themselves? What the Canadian Pacific shareholders want is to get the American traffic, as they have found that they cannot live and pay dividends out of the traffics to be obtained in their own country, and in order to achieve this end they are willing to sacrifice everything. The Grand Trunk has suffered enough in times past to make itself, even without immediate competition, and in the process it has accumulated a (nominal) capital of nearly £54,000,000. Of this more than one-half may be fairly set down as absolutely non-dividend stock, and this for a line of 3,943 miles, the whole of which runs through a district well settled, and the most productive in the country. On the other hand we have the Canadian Pacific, of 4,660 miles, the greater part of which runs through the wilderness, and a capital (nominal) of nearly £44,000,000. It is admitted even by the Company, that it is only in the eastern section that it is able to earn anything beyond working expenses, so that if it met with anything like retaliatory competition from the Grand Trunk what will the condition of the Canadian Pacific shareholders be? If they are not very careful as to what they do, they will be unable to meet even their preference charges, and as these consist mainly of mortgage bonds upon different sections, the result would be that the whole of the eastern section must fall to pieces like a house of cards, and the Trunk Company would reap what it has so recklessly sown. What does this eager desire to tap the American traffic mean; is it a legitimate effort to get more business, or is it merely an insane attempt to injure the Grand Trunk so as to force it to make terms? It would almost appear to be the latter, as the Company has no outlet to the sea on the Atlantic side of the Continent without passing over the Grand Trunk or over an American road. A question that the shareholders should ask is by whom is our line controlled, is it de facto an American line, and to be used merely to send traffic to the Vanderbilt Roads? The company being registered in Canada, we\nhave no access to the register, even if that contain sufficient information to enable the question to be answered. The company has deliberately entered upon a course which it must follow to the end, and that end is certainly not what was contemplated by the Dominion Government when it granted the first charter and gave to it certain facilities in the way of monopolies, land grants, and money. It may be noticed too, that, as the company has extended itself in Ontario by almost duplicating the Grand Trunk in every direction, the fostering hand of the Government has been withdrawn, and instead of free gifts, any assistance has been grudgingly given and repayment rigidly enforced, and the clause which gave them protection against American or any other competition has been annulled. At the late Grand Trunk meeting, before mentioned, one of their shareholders brought down the house by his vehement protestations against the Dominion Government giving such favours to the Canadian Pacific as they had done, and were supposed to further contemplate doing; and, the meeting showing great enthusiasm upon this point, Sir Henry Tyler, smiling, endorsed it. But Sir Henry knew better than the indignant shareholder, and better than we ourselves, that the assistance was a sham as regards the present and future. He knows that the Canadian Pacific has had its cake, and has eaten it, and the Grand Trunk interest is quite strong enough in Canada to prevent a reckless distribution of cakes to rivals and competitors. Whether the fault of the inauguration of a policy of active competition is to be laid to the one or the other, there can be no doubt that it is the Canadian Pacific which began it by invading in every direction the territory served by the Grand Trunk, while the latter has hardly moved out of its way to retaliate, except by affording to its customers greater facilities of transport than they had before. And the only reply Mr. Van Horne can make will be found to be, what others in a like position have said before, \"We must live.\"\n\nGRAND TRUNK AND CANADIAN PACIFIC.\n\n(From \"Herapath's Journal,\" December 1, 1888.)\n\nThe President of the Canadian Pacific thinks Sir Henry Tyler's remarks regarding the Canadian Pacific at the recent Grand Trunk meeting \"unfair and unreasonable.\" He says the Grand Trunk Company were approached three times regarding use of their line from London to Detroit without result, and at the last moment that the Grand Trunk proposed impossible conditions as to the Canadian Pacific traffic between Ontario points and the North-West.\n\nThis, at first blush, looks a formidable indictment, but an examination of the correspondence and negotiations regarding the matters in dispute, running from the beginning of June to the close of October just past, leads to the conclusion that the matter is very much the other way. The Grand Trunk appears throughout to be actuated by motives of fairness, and to be desirous of peace, whilst the Canadian Pacific, pursuing what it terms a \"policy,\" seems to be in feverish haste to establish monopolies and cherish exclusiveness.\n\nThe matters in immediate dispute are three in number, and are very simple. The two systems are now coming in close contact, and one of two things must happen\nThey must interchange traffic or they must fight. There is no other logical result. The Canadian Pacific, for instance, wants to get to Detroit, and it becomes a question whether it shall reach it over the Grand Trunk system or by a line of its own. That is the first point in the controversy. Again, by means of the recent acquisitions, the Grand Trunk has good command of the Ontario traffic, and a good junction with the Canadian Pacific at Nipissing Junction. It becomes a question whether the Canadian Pacific shall avail in a friendly way of this means of communication or push into Ontario itself and fight for traffic by building a line to Sudbury, practically parallel to the line the Grand Trunk has just acquired. That is point number two. Then the Canadian Pacific has an undoubtedly fine means of communication with the Western and South-Western States of America by the Sault Ste. Marie route. But the Grand Trunk can reach it too over the Nipissing Junction, and the third point in dispute is whether the Canadian Pacific will allow the Grand Trunk to do this or compel the Grand Trunk to protect itself as best it can by sending the Ontario traffic by other means of communication.\n\nNow for Mr. Van Horne's contentions. He seemed at the outset to recognise the principle that it would be unwise for the Canadian Pacific to build a line of its own from London to Detroit, whilst the Grand Trunk had between the two places 80 miles of double and 30 miles of single track. It became a question of price. Mr. Hickson asked a rental of $85,000 per annum; Mr. Horne stuck to an offer of $65,000, although, on his own showing, it would cost his Company $100,000 a year at least to provide the interest on the capital of the new line. Mr. Hickson could not think of taking the inadequate rental of $65,000, but finally agreed to accept it on condition that the two other points of difference referred to above were pushed on to a settlement. Mr. Horne had previously recognised the general principles affecting these two disputes, and so the terms were entered on. As regards the Ontario traffic, the Grand Trunk wanted free interchange of traffic at Nipissing Junction, differences and terms to be referred to arbitration if necessary. This would not suit the Canadian Pacific. They wanted what they termed an \"exclusive agreement,\" which, translated into Saxon English, means monopoly. Mr. Van Horne virtually said to Mr. Hickson, \"You and I can club together and manage the Ontario traffic for our own advantage; we will keep others out; if you do not do this you will compel us to push into competitive points into Ontario.\" Well, of course, Mr. Hickson scouted this suggestion, for the proposal virtually meant that the Grand Trunk should shut out its allies in the United States. Finally, as regards the Sault Ste. Marie question, the Canadian Pacific refused to refer the matter to arbitration, and declined to formulate any counter proposals. In his concluding letter, in fact, Mr. Van Horne drops it out of sight altogether, so that we may take it as granted that the only reply of the Canadian Pacific to the eminently pacific proposals of the Grand Trunk is a threat to build a line of its own from London to Detroit, and another from Toronto to Sudbury, a denial of interchange of traffic at Nipissing Junction, and, of course, a similar negation of use by the Grand Trunk of the Sault Ste. Marie route. This is what is meant by the three fruitless attempts at negotiation; by the springing of surprises on the part of the Grand Trunk at the last moment by the unfair and misleading statements of Sir Henry Tyler!\n\nThe question has a much wider aspect than a mere difference between the two Companies. Both are systems in an important British dominion—the one exclusively financed by British capital; the other partially so, but largely subsidised by Imperial\nmoney. Now the question is, will this Imperial money be brought into play to injure English capitalists, especially when the pledges given to these capitalists have been shamefully ignored? That is a question for the Dominion Government, perhaps for the Home authorities, slight as is the link now existing between the Dominion Parliament and the Crown. The Canadian Pacific could not for a single day play the part it does without State support. Mr. Van Horne reminds Mr. Hickson that he can afford to build the parallel line from London to Detroit, because the Government will give a subsidy of $192,000. Again, the Canadian Pacific comes to London for money. Will English capitalists back up a policy so unfair, reckless and extravagant? It is something appalling to think of the demoralisation which would ensue if the Grand Trunk and Canadian Pacific entered fairly on a war of rates. It would cripple the Grand Trunk and ruin the Canadian Pacific, already at its wit's ends to meet its fixed charges. And what else can we expect if the Canadian Pacific goes on nursing what it terms a \"policy\"—building a line of 110 miles all for nothing, taking traffic from Toronto to North Bay via Smith's Falls, 449 miles, rather than by the Grand Trunk route, 228 miles; threatening to build a line between Toronto and Sudbury, rather than give and take with the Grand Trunk; totally refusing to give the Grand Trunk access to Sault Ste. Marie? And what answer does it give respecting all this perverse extravagance? Nothing, only that it has a policy, and that it knows its own interests best. People here can judge too, and their verdict upon the whole business will be that the Grand Trunk proposals were moderate, pacific, and fair. That the Canadian Pacific attitude means a mingling of bluster, blundering, and menace. If they imagine they can keep all Canadian traffic on Canadian soil, and so give it an outlet solely by the Eastern seaboard—that is what they mean—they are mistaken. They have had one rebuff on this issue over the Red River question; and the practical reply of the Grand Trunk and its allies will ultimately be no less decisive.\n\nTHE CANADIAN PACIFIC AND GRAND TRUNK RAILWAYS.\n\n(From the \"Railway Times,\" December 1, 1888.)\n\nIt might have been expected that the adjournment of the meeting called in Montreal to consider the rash proposal of the President of the Canadian Pacific Railway to make an independent line from London, in Ontario, to Detroit, at an estimated cost of $2,300,000, and thus to parallel to a considerable extent the Grand Trunk and Canada Southern systems, might have brought with it a less heated and more intelligent view of the question, and have led to the adoption of counsels less injurious to the real interests of the undertaking over which Mr. Horne seems to exercise influence of so doubtful a character. He would appear to have interpreted the condition of the Canadian Pacific's incorporation, which forbade any fusion with the Grand Trunk, as a distinct encouragement to thwart and oppose the latter on every conceivable occasion, and to burden its own newly-fledged existence with responsibilities conceived rather in the spirit of restless competition than of due regard for their adequate fulfilment. The challenge of Sir Henry Tyler, thrown down with\nconsiderable distinctness at the recent meeting of the proprietors, by which he unmistakably impressed upon them the inability of the Canadian Pacific to sustain such additions to its existing liabilities, seems, however, to have been taken up without parley or argument, and the proposed line to have been adopted by the shareholders of the latter with a suspicious unanimity that places them at once in the same category with others who are incorrectly supposed to control the erratic tendencies of certain railway chairmen nearer home. On both sides of the Atlantic the entire correspondence bearing on the subject has been given to the respective proprietaries, and covers ground extending from June to October in the present year, although in his earliest letter Mr. Van Horne intimated that \"an hour\" would suffice to reach an understanding as to the more pressing matters affecting the relations of the two companies, of which the present question may presumably have been one. The hour seems to have extended in the first instance to a matter of forty days, at the close of which Mr. Van Horne wrote curty to Mr. Hickson, that a decision must at once be arrived at as to whether approach to Detroit by the Canadian Pacific should be secured over the Grand Trunk or by its own line. These negotiations had for their object the granting by the Grand Trunk of running facilities to the Canadian Pacific over the line from London to Windsor on the Detroit River, and the equivalent for such an arrangement was the rock on which the discussion foundered. For this 80 miles of double and 30 miles of single track in the very highest state of efficiency, the Grand Trunk had estimated a rental of $85,000 as a fairly reasonable price to pay, but this amount was ultimately waived in favour of the smaller one of $65,000, on the positive statement by Mr. Van Horne that the cost of an independent line—previously estimated to involve an outlay of $3,000,000—would not exceed an outlay of $2,300,000, the interest of which, at 4.3 per cent., would therefore be less than $100,000. On the other hand, the Grand Trunk desired to have the user of the Pacific line from North Bay to Sault Ste. Marie, and the interchange of traffic from Ontario at North Bay or Nipissing, the point at which the newly acquired Northern of Canada section of the former line connects with that of the Pacific; but in deference to the urgent wish of Mr. Van Horne to have the question as to the London and Windsor running agreement settled out of hand, Mr. Hickson had been willing to refer those other matters to arbitration, although it was only in September that Mr. Van Horne discovered that this mode of settlement was unacceptable, and intimated that the consideration of those points would involve so much delay that his board had resolved to construct a line of its own from London to Detroit. He had, indeed, suggested that the proposed interchange of traffic at North Bay might be compensated by the Grand Trunk working exclusively with the Canadian Pacific for the North-West and British Columbia traffic, which, however, as Mr. Hickson had pointed out, was obviously impracticable in view of the Grand Trunk relations with its American connections, with whom a very large business was already exchanged between other points. When it is added that Mr. Van Horne had sought to stipulate that the eighteen months' notice of termination of the London Windsor lease should not preclude the building of an independent line during that period if the Canadian Pacific desired to terminate it, we can scarcely resist the conviction—taking all the circumstances as well as the tone of his correspondence into consideration—that either he desired only to get the particular user of the Grand Trunk's line to Detroit on as low terms as he possibly could, or had already determined to build an independent line after going through the formality of prolonged discussion to which\nhe contemplated giving no serious effect. In this way he hoped to mask the insidious and aggressive nature of his tactics and to throw upon the Grand Trunk the odium of not completing negotiations which he took care to render unacceptable, and therefore impracticable. Mr. Hickson seems only to have committed the fault of imagining that he was treating with a negotiator in a like spirit of good faith to himself, and his able and candid letters, however strictly to the purpose of placing matters in their true light, were thrown away upon such a litigant. Starting with a hard bargain, based upon statistics which have yet to be demonstrated, and, next, admitting every proposal on the other side as a fair subject for discussion without contributing the slightest practicable solution of the attendant difficulties, pleading haste on one point as an excuse for not devoting consideration to others, and finally shelving the whole subject at the moment most convenient to himself, Mr. Van Horne seems to have run over the entire gamut of disingenuous negotiation. It is an axiom of serious business that no matters of importance can be hastily adjusted, which indeed too often leads to the omission of momentous contingencies from adequate prevision and settlement; and hesitation on the part of a negotiator does not necessarily imply his losing the game. As we have already suggested, it remains to be seen whether the projected line—if indeed ever made, as Mr. Hickson quietly says, within a stone's throw of one of the best lines on the same ground—can be constructed for $2,300,000; and, next, whether the credit of the Canadian Pacific can survive to raise that money even at the rate so exactly calculated of 4.3 per cent. Such would not appear to be the view of that usually-discerning authority, the London Stock Exchange, where the 8,100 shares of the Canadian Pacific, after a steady and prolonged decline, from 70 in January of last year to 57, less than a month ago, dropped, on the intelligence of the present ill-fated policy being arrived at, to 52—the lowest point touched during 1887-88. In the face of this pregnant fact it seems idle for Mr. Van Horne to enlarge, as he seems to have done at the Montreal meeting, on the prosperity of the line, seeing, moreover, that he was constrained to admit that from various causes the results of the year's working would fall short of expectations, and that, in spite of an addition of 4 per cent. to its mileage—or 180 miles—the net receipts, over and above present fixed charges, would hardly exceed those of last year. With such an experience it will be interesting to watch the development of this latest stage of fatuity on the part of the Canadian Pacific executive, and to see to what greater lengths the possession of a three per cent. terminable annuity from the Dominion Government seems likely to lead both the railway and its backers in the shape of ultimate disaster.\nThe ridiculous\nmodium\nthere-\nsigning\nand his\ntrue\nbased\nproposal\nhighest\nas\nwhole\nhave\nserious\ntoo\nvision\nsimply\nwhether\nwithin a\nfor\nto\nwould\nStock\nago,\n52—\nseems\nMontreal\nto\nshort of\nor 180\nexceed\nthe\nPacific\ncent.\nboth the\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30668.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 45, "total-input-tokens": 73872, "total-output-tokens": 24492, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1539, 3], [1539, 4102, 4], [4102, 4102, 5], [4102, 4375, 6], [4375, 4837, 7], [4837, 6089, 8], [6089, 8084, 9], [8084, 10001, 10], [10001, 11756, 11], [11756, 13821, 12], [13821, 15770, 13], [15770, 17843, 14], [17843, 19880, 15], [19880, 21891, 16], [21891, 23868, 17], [23868, 25958, 18], [25958, 27740, 19], [27740, 29625, 20], [29625, 30202, 21], [30202, 32567, 22], [32567, 36499, 23], [36499, 40109, 24], [40109, 44136, 25], [44136, 47721, 26], [47721, 50341, 27], [50341, 53316, 28], [53316, 56158, 29], [56158, 59995, 30], [59995, 63250, 31], [63250, 66902, 32], [66902, 70425, 33], [70425, 73662, 34], [73662, 76725, 35], [76725, 79964, 36], [79964, 83408, 37], [83408, 87212, 38], [87212, 90481, 39], [90481, 94361, 40], [94361, 97672, 41], [97672, 101624, 42], [101624, 104568, 43], [104568, 104794, 44], [104794, 104794, 45]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]