[{"id": "b6e5ea86a1ad3b5b864109fb5e75320cfccbc0ce", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\nCa document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nWHICH?\n\nENGLAND OR ROME?\n\nA REVIEW OF THE\n\nGUIBORD BURIAL CASE\n\nFrom the \"Altar and the Throne.\"\n\nPRICE 10 Cents.\n\nMONTREAL:\n\nPRINTED BY A. A. STEVENSON FOR THE PROPRIETOR OF THE \"ALTAR AND THE THRONE.\"\n\n1871.\nWHICH?\nENGLAND OR ROME?\nA REVIEW OF THE\nGUIBORD BURIAL CASE,\nFrom the \"Altar and the Throne,\" Montreal.\n\nIn fulfilment of the promise made in our first number, we now submit a short account of this cause célèbre, and in order that our readers may thoroughly understand the question, we have to go back to the year 1844, when the Roman Catholics of Montreal, whether Irish or French Canadian, had not a single library or reading room or place of meeting, for any purpose whatever, apart from their churches. The feeling that this want should be supplied induced a few French Canadian students to meet in that year and lay the foundation of l'Institut Canadien, a literary society having for its object the mutual improvement and education of its members, through books, newspapers, and discussions or debates. For several years prosperity attended the undertaking, and the society obtained a special act of incorporation in 1853, (see Statutes of Canada, 16 vic., c. 261.) By this act of incorporation minors of 17 years of age were accorded all the rights pertaining to the exercise of membership. Such was the rapid progress of this Institution that every city, town and village wanted to have its Institut Canadien; that being a synonymous term for the library, reading room and debating society. The result of this was that the various faculties of the mind were aroused and light began to dawn on dark places. Protestants who enjoy from their very birth the exercise of the brain's functions can scarcely realize the astonishing effect thus produced on a class of men who had been trained to think that it was not within their province to see anything that was not exhibited to\nthem by a \"patented\" divine in robes. The \"why\" and the \"wherefore\" began to be heard, and they threatened Roman Catholicism as the Guy Fawkes powder plot did the Parliament of England. About 1857 the Roman Catholic authorities realizing their position, decided upon the destruction of this dangerous focus, and began the attack under cover, and by raising side issues. The first gun fired at it was in the shape of a motion to exclude all religious papers, whether Roman Catholic or Protestant. The object of this motion was to exclude the Witness and Le Semeur Canadien for there was not then any Roman Catholic religious paper properly speaking, if we except the True Witness, which was at that date of no more account than it is at the present. A fierce struggle ensued, discussion ran high, an amendment was made, and out of a meeting of 300 was thrown out early in the morning by a small majority. A second meeting was held, and an amendment was again put, and out of 300 votes there was a tie, when the casting vote was given in favor of the amendment. The enemies of free thought acknowledged their defeat; the ballot was then adopted when the advocates of education carried everything before them, and the Institut was triumphant. Jesuitical merchants were unable to induce their clerks to vote with them; and open warfare for the nonce was at an end. Up to this time the instigator of the oppressive opposition was unknown, but two days after the decisive vote referred to, bishop Bourget published a long and elaborate pastoral letter commanding every one to withdraw from the Institut, under pain said to have been decreed by the Council of Trent—Upwards of 150 members in conformity with this order, executed a solemn act of secession in writing.—This was in 1858.\n\nThen indeed did the promoters of the scheme of infallibility, spread fanaticism amongst Roman Catholics, and the Institut Canadien was soon visited by this foul pestilence, for whenever a member found himself deprived of protection or of that strength of mind which animated the arch-angel, he would encounter the sweet face of a priest with the gratifying assurance that he could neither partake of the communion, nor be married by his church until he had withdrawn from l'Institut Canadien.\n\nAs long as a member was known to act uncompromisingly\neither by himself or by his immediate relatives or friends, every thing connected with his church affairs was smooth and comfortable! and this brings us to the case of Guibord.\n\nGuibord was a printer, a fellow apprentice with ex-mayor Workman and John Lovell, and although he did not ascend the ladder of wealth with them, he nevertheless possessed that strong will necessary to the acquisition of wealth, had ambition been associated with his unconquerable faculties of mind. Guibord was a printer! he lived a printer,—he died a printer, not a wealthy one indeed, for had wealth been his, the Roman Catholic Church never would have selected him as the victim of its unrelenting persecution. Guibord died in November 1869, at a time when the blasphemous thermometer of papal infallibility was indicating a temperature of clerical fever heat,—at a time in fact when every priest of Rome imagined that he was not without his share of infallibility. In selecting Guibord as its victim, the Church of Rome singled out one whom it knew to be poor, one who it knew, had no children, no brother not even a sister. It singled out as its victim a poor journeyman printer, believing that as he was poor his friends were also poor. But still in all his poverty Heaven had blessed him with a wife, one who had not forgotten her marriage vows—but loved her husband though he was only a poor journeyman printer. She, alas, had no brother, no friends but those of her poor husband, and it required very little power of ratio-cination on the part of the Romish priests to consider his case as one most admirably adapted for displaying their authority.\n\nThe Roman Catholic Cemetery of Montreal is on the slope of Mount Royal, is approached from the road leading to the picturesque village of Côte des Neiges, and consists of two parts—the one known as consecrated ground—the other as \"the potter's field\"—the latter mentioned being the final depository of drunkards whose corpses have been dragged from the gutter, and the spot where murderers and friendless suicides are thrown with disgust, in eternal oblivion—here the pious church of Rome was willing to bury Guibord the poor printer—here and here alone, and this, not, because he was a murderer, not because he was a drunkard, not because he was a criminal, not because he was a\nsuicide, but because Guibord, the poor, friendless, journeyman printer, was a member of l'Institut Canadien. Yes! Christian burial was refused him by his church and his poor bones the remnants of his mortality were obliged to be taken where? to a Protestant cemetery whose doors were as wide open for their reception, as those of the Roman Catholic were closely barred. In that Protestant cemetery those poor bones still remain a living, terrible protest against Rome's intolerance.\n\nHow striking the contrast between the poor friendless Printer, Guibord, and the rich suicide, Joseph Jodoin. The one was a criminal in the eyes of his church,—the potter's field was all that was open to him,—his crime was poverty! The other, who took that which none but God has a right to take,—his life,—was buried with all the pomp and show which wealth can procure in the romish church,—the wealthy suicide was buried midst the tolling of bells, the burning of tapers and incense.—was buried in consecrated ground,—while Guibord, who died a natural death, was considered a fit subject for the potter's field; but Guibord was a Printer, a poor but honest journeyman Printer, while Jodoin was a wealthy self murderer, whose blood-stained \"golden fleece\" was of more value to the Roman wolves than the honest unstained \"home-spun\" of the poor, friendless, but now, never to be forgotten Printer, Guibord.\n\nIt was in consequence of this refusal to bury her husband that the widow Guibord was forced to apply to our Courts of law in order to compel the curé and church wardens of the parish church of Notre Dame of Montreal to give her husband's remains burial in the Roman Catholic Cemetery.\n\nThe proceedings for this purpose adopted, were an application for a writ of mandamus ordering the burial of Guibord's remains. A prolonged argument of seventeen days took place before the Honorable Mr. Justice Mondelet, senior Judge of the Superior Court for Lower Canada, sitting in Montreal, resulting in the granting of the widow's prayer, by ordering a peremptory writ of mandamus to issue, commanding the curé and church wardens to bury the deceased within six days, and to report the execution of the writ.\n\nThe arguments of counsel and the remarks of the learned and\nindependent judge, and the judgment itself deserves special notice but unfortunately they are so voluminous, that were we to repeat them our readers might think that we were testing the extent of their patience.\n\nThe Church of Rome was not disposed to acknowledge civil law, particularly when its utterances were adverse to its extravagant pretensions that the civil Courts had no jurisdiction over matters strictly ecclesiastical, and accordingly an appeal from the decision of Mr. Justice Mondelet was taken to the Court of Review, consisting of the Honorable Justices Berthelot, M'Kay and Torrance; who after having heard counsel and maturely deliberate, reversed the judgment of the Honorable Mr. Justice Mondelet, and dismissed the action or application:\n\n1st. Because the action should have been brought against the cure personally—and 2ndly. Because the writ was informal.\n\nIt is well known in every country that judges are to be found who are afraid of making themselves disagreeable to the ruling powers whether they be king, clergy, or mob, and these experience no great difficulty in discovering some loophole or question of form by which they wash their hands of an embarrassing case. Such was Pilate's example, when he washed his hands of innocent blood, and gave up the Son of God to a band of relentless priests, to shed his blood.\n\nThe discussion of the technicalities on which the Court of Review based their judgment would present very little interest to the non-professional reader and therefore we will not enter into them here.\n\nUp to this stage the widow of the poor journeyman printer Guibord had been able to avail herself of a charitable provision of law, by which an indigent suitor is allowed to sue in forma pauperis but having lost her action, an appeal from what was considered an unjust judgment could not be taken unless security for the costs of such appeal, in case of failure, were first put in, and this it was supposed would present an insurmountable barrier to her further proceedings, even though she had lawyers so devoted to her cause as to act gratuitously. But sympathy had been aroused and the tyrants of Rome and their sycophants were not yet allowed to proclaim a final victory over the poor printer Guibord, for\nthe required security was given and the desired appeal—an appeal to the Court of Queen's Bench—was quickly taken, and here it was that this now celebrated cause assumed a new shape and a greater importance.\n\nThe decision of the Court of Review had produced an impression on the minds of the friends of the poor widow, and upon the minds of a large class of the community, that the Roman Catholic clerical influence had so much weight over the judges in Review that they had, instead of pronouncing on the merits of the case, resorted to technicalities raised contrary to the most positive enactments of the Code of Civil Procedure, objections which should have been dismissed at once, even though under other circumstances they might have been well founded in law objections which the Honorable Mr. Justice Mondelet had the manliness and intrepidity to dispose of summarily.\n\nTo make this matter understood by our non-professional readers, we would illustrate the matter thus:—It is very clear that the endorser on a promissory note is liable to its payment, provided the note was protested on the third day of its maturity. If, however such note was only protested ten days after maturity no Court could maintain an action against the endorser. So in matters of form the Code of Civil Procedure provides that all these shall be taken advantage of within four days of the return of the action, whereas in the Guibord matter the Defendants pleaded TEN DAYS after the return, that the form of the Writ was defective, that the Writ itself should have contained the command to bury Guibord. His Honor Mr. Justice Torrance admitted that, since 1849, when a Statute was passed to amend the law relating to Writs of Prerogative, the uniform practice had been to insert the order in a petition annexed to the Writ, and not in the Writ itself, but, nevertheless, he concurred in a judgment which dismissed the action, because it was shaped in accordance with that uniform practice, and this, on an objection raised TEN DAYS after the return of the action.\n\nThe action of the widow Guibord was known in France, in Spain, in Austria, and generally in Roman Catholic countries, under the name of Appel Comme d'Abus, appeal against the abuses of the Church. In 1864 the syllabus decreed a number\nof new doctrines which made it a matter of conscience and of eternal consequences for judges who acknowledged the authority of the syllabus to dismiss the action of the widow Guibord. In submitting their case, the Defendants' counsel formally and openly took the ground that the Church, that is the Defendants, were not amenable to the Civil Courts. The Roman Catholic judge in the Court of Review, the Honorable Mr. Justice Berthelot, went further than his Protestant colleagues in dismissing the action. He accepted in its full extent the doctrine of the independence of the Church in the question submitted, and the Appellant anticipated, in consequence, similar views with the four Roman Catholic judges in the Court of Queen's Bench sitting in appeal.\n\nThere is at first sight something plausible in that opinion which may deceive a right minded man if he be not on his guard. Mr. Justice MacKay seems to have fallen a victim to this spurious aspect of the case, although his judgment is not founded on the opinion virtually expressed by him. He doubted, rightly too, whether a Methodist could force the Church of England to bury his relative, also a Methodist, in their burying ground.\n\nIt is not because the church is independent of the Civil Authorities that the Church of England could resist such a demand, but because the deceased Methodist was not a member of the Church of England, and had no right to demand burial in her cemetery.\n\nThe question, as it presented itself, was, whether a church which had acknowledged a man as one of its members during his whole life time,—a church which would have forced that man by compulsory process of the Civil Courts to pay tithes, to contribute to the building or repairs of the church, and even to paying for the cemetery ground, is so independent of all authority that it can refuse a decent burial to the remains of that man, and that his family can have no recourse against that church?\n\nThe affirmative being the doctrine of Judge Berthelot and of the dogma promulgated by the syllabus, the Appellant considered it a matter of paramount importance to know in limine whether the Roman Catholic judges in Appeal considered themselves bound by the syllabus, for if they did, and if the decision of the\nRoman Catholic Bishop was final and not susceptible of Appeal, the Appellant considered it would be a waste of time and of legal research, to show that the refusal to bury Guibord was unfounded. Should such a doctrine prevail it would follow that the Roman Catholics of this part of Canada are eminently privileged inasmuch as they would not recognize any authority as higher than the Church. The Anglican Bishop in Quebec was impleaded for refusing to bury a child, and though the case was dismissed it was on the ground that the Anglican Church had not acknowledged as its cemetery the piece of land, wherein the father wished to compel the Bishop to bury the child. No one ever dreamt of denying the jurisdiction of the Court.\n\nIn the Guibord matter, however, it is different. The pretensions of the Romish Church are exposed as follows, by the Defendants pleadings:—By the treaty of Cession of Canada of 1763, it is declared that the Roman Catholics shall have the free exercise of their religion according to the rites of the Church of Rome. From this it follows that the Roman Catholic bishop is amenable to no authority in the country when he decides that a man has no right to be buried in a Catholic cemetery. Furthermore, the Church of Rome has deemed that it exercises its authority independently of all civil governments, and other doctrines which will be mentioned presently.\n\nCan Protestants look with indifference to the settlement of such pretensions, set up as they are against the Guibord action? If it be true I were such a pretention to be allowed, the Roman Catholic Church which already enjoys the exclusive right of forcing its members by compulsory process of the courts, to support it, would possess an immense power of cohesion and coercion, not only over its own members, but indirectly over the members of other churches, for on pain of being buried like a dog, a Roman Catholic might be induced to join organizations of hostility or propaganda against the members of other churches. To look upon this as a mere supposition is a grave error, for it was fully proved to be a matter of fact in the very Guibord case itself. Guibord was a member of a benevolent society,—in which none but Roman Catholics were allowed to participate. Several of its members gained their living and consequently their\nmeans of supporting the society,—exclusively from Protestant employers. Without enquiring how such societies are propagandist organizations, it cannot be denied but that their influence lends éclat and show to the Romish Church. In public demonstrations, such as the procession of Corpus Christi, or when the St. Patrick's Society or the St. Jean Baptiste Society celebrates its anniversary; we see a great concourse of people filling and blocking up the streets. Now, who compose those crowds? These very Roman Catholic benevolent societies formed under the sanction of parliamentary incorporation, for the glorification and strengthening of the cords of the Romish Church! Each trade is formed into one of these societies, and of these societies it is said fully twenty-five are in existence, with an average membership of 500.\n\nLeaving our readers to connect these statements with the proceedings in the Court of Appeals, we proceed with our narrative.\n\nAt the opening of the December term (1870) of the Court of Appeals, Joseph Doutre, Q.C., one of the counsel for the Appellant, (Mrs. Guibord,) challenged the four Roman Catholic judges as being disqualified on the ground that they belonged to the Church of Rome, which had by the syllabus of 1864 promulgated the following dogmas:\n\n1st. That the ecclesiastic authority was exercised independently of any permit or consent of the civil government.\n\n2nd. That the State and the Queen were not the source of all rights; and that its or their powers were limited.\n\n3rd. That the State, even when it was governed by a Protestant Sovereign, possesses no authority, not even indirectly, over matters of religion; that in consequence it has neither the right of exequatur, nor that of Appel comme d'Alus, (Appeal against ecclesiastical abuses).\n\n4th. That in matters of conflict between the two powers, (the State and the ecclesiastical authority), the latter prevails in preference to the State.\n\n5th. That the civil power has no right to interfere in matters of religion, morals or spiritual things; that the instructions contained in pastoral letters (even, we suppose, if they contained\nlibels or instigations of high treason) cannot be submitted to its decisions.\n\n6th. That Kings are amenable to the jurisdiction of the Church, and that they have no jurisdiction above the Church when questions of jurisdiction are to be decided.\n\n7th. That the Roman Catholic religion should be the only religion recognized by the State, and that, to the exclusion of all other religions.\n\n8th. That the Romish Church has the right of physical coercion, and possesses a direct and indirect temporal power.\n\n9th. That the immunity of the Romish Church and of ecclesiastical persons has no origin in the civil law.\n\nThe recusation or challenge, after enumerating these dogmas, stated that by a recent proclamation of the same church, its head, the Pope, has been declared infallible, and that he must be obeyed as if he were God himself, being superior to all Kings and Sovereigns. It then required the judges challenged to declare whether they considered themselves bound in conscience by such commands of their church.\n\nThis recusation is framed with considerable precision. According to our Code of Civil Procedure, the judges challenged cannot decide on the merits of the recusation, they cannot even be present in Court when the decision is given.\n\nIn presenting the petition of recusation, Mr. Doutre said he hoped the measure he was adopting would not be looked upon as implying want of either respect or confidence. Quite a number of persons were in doubt as to whether our judges were the representatives of the Queen, carrying out the spirit of the laws enacted under Her sanction and those of her predecessors, or whether they were not, in certain matters, governed by the church authority whose seat is at Rome!\n\nChief Justice Duval remarked that it was giving too much importance to the imbeciles who thought that judges recognized any authority but that of the Queen, and the laws enacted under Her authority.\n\nMr. Doutre replied that unfortunately these imbeciles were so numerous and occupied so many positions in life that until the judges would themselves define their stand point, their decisions\nwould remain in many cases without moral weight, and therefore, after due consideration, he thought it essential before arguing his case, to know whether the judges felt themselves competent to hear him and render justice to his client. The condition of the Roman Catholics since the cession of the country had been altered by decrees of new dogmas, some of which if they were adhered to by the judges, would prevent those of the Roman Catholic faith from applying the law of the country. By Chap. 83, §14, George III, which confirmed the treaty of cession, Roman Catholics were granted the free exercise of their religion, but subject to the supremacy of the Sovereign. Several articles of the syllabus declared it to be a heresy to believe that any Sovereign had authority over the laws decreed in Rome, and that in a conflict of jurisdiction in civil matters, it was another heresy to recognize in the civil law the power of pronouncing upon such jurisdiction. The action of the Appellant was, Mr. Doutre said, specially mentioned in the syllabus, to be proscribed, and it was worthy of anathema to make use of that recourse. The judge that would receive such an action, and pronounce favorably upon it, would be liable to anathema and excommunication. He knew very well, he continued, that none of the judges considered themselves bound by anything but the laws of the country; but in the present state of religious exaggeration, his own conviction in that respect was not a sufficient guarantee for his client, or for the public. He had, he said, no doubt that the answers the judges would give to the facts mentioned in the petition would be such as would put the Appellant in a position to withdraw the exception, which she would be happy to be able to do. The opportunity he considered a precious one, which should not be lost to clearly define the position of our Roman Catholic judges in mixed questions, and also to put an end forever to the injurious doubts which are thrown out against their independence and their true position to the Sovereign who appoints, and to the other who claims authority over their consciences with the rights to define their jurisdiction and hurl defiance against the authority of our Queen, our parliaments, and our laws.\n\nThe Chief Justice ordered the Clerk of the Court to take the\npetition, but not to fyle it in the records of the Court, until further orders.\n\nThis recusation took place at the beginning of the term and consisted of four separate petitions, that is, one for each judge.\n\nAfter four or five days consultation, Mr. Justice Badgley, the only judge unchallenged, suggested to Mr. Doutre that he should withdraw the petitions and present them de novo on account of the absence from the bench of one of the judges, at the time they were first presented, but to this Mr. Doutre did not accede.\n\nHowever, the last day of the term arrived, and then the five judges concurred in a judgment, declaring the petitions inadmissible inasmuch as the charges contained in them amounted to accusations against the judges of treason and perjury.\n\nMr. Doutre thereupon moved for an Appeal to Her Majesty's Privy Council. No decision was given on this motion, but the Court suggested that a rule be taken returnable on the first day of March, a course which evidently did not meet with the learned counsel's approbation, as he has not adopted it, preferring, as we understand, to allow the motion to remain as a protest against the judgment and to proceed to the argument, so as to bring the whole matter in Appeal before Her Majesty's Privy Council, should the pretentions of the widow Guibord be unsustained.\n\nThe case is, while we write, being argued before the count on its merits, and the judgment will probably be rendered in the month of June next—a judgment to which our readers will look with no little interest.\n'The Altar and the Throne.'\n\nTHIS Weekly Journal published in the interests of the Loyal Orange Association of British America, is issued EVERY WEDNESDAY, and circulated largely throughout the Dominion of Canada.\n\nIt is not published with a view of perpetuating national animosities, but on the contrary has for its objects the advocacy of free speech, to be shown in all matters of religion, and the treatment of all loyal British subjects on an equal footing, irrespective of creed.\n\nIt will seek to secure Protestant unity throughout the land, and thereby check the attempts that have been made to restrict our civil and religious liberty.\n\nThe maintenance of the connection with the mother country will be constantly upheld, and all attempts to dismember the British Empire will be strenuously opposed. As its name indicates it will be devoted to our religion and our Queen.\n\nEach number will contain all the Orange News, the Orange Constitution, and a tale founded on the connection of the Association.\n\nThere will also be a household corner for the family.\n\nThe general news will also be supplied.\n\nTerms, $2.00 per annum; payable yearly, or half yearly in advance.\n\nDUNBAR BROWNE,\nBooth P.O., or 25 St. Gabriel Street.\n\nMONTREAL, March, 1871.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_38291.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 21, "total-input-tokens": 34354, "total-output-tokens": 6871, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 944, 3], [944, 2050, 4], [2050, 2260, 5], [2260, 2260, 6], [2260, 3942, 7], [3942, 6269, 8], [6269, 8586, 9], [8586, 10837, 10], [10837, 13096, 11], [13096, 15379, 12], [15379, 17637, 13], [17637, 19962, 14], [19962, 22102, 15], [22102, 24215, 16], [24215, 26541, 17], [26541, 28080, 18], [28080, 28080, 19], [28080, 29330, 20], [29330, 29330, 21]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]