[{"id": "ed5f321a3cd5f9f682f0352877e679d78c276644", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couverture de couleur\n- [ ] Couverture endommagée\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Le titre de couverture manque\n- [ ] Cartes géographiques en couleur\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Planches et/ou illustrations en couleur\n- [ ] Relié avec d’autres documents\n- [ ] La reliure serrée peut causer de l’ombre ou de la distorsion le long de la marge intérieure\n- [ ] Il se peut que certaines pages blanches ajoutées lors d’une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n’ont pas été filmées.\n\nPages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nLes pages totalement ou partiellement obscurcies par un feuillet d’errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n|   |   |   |\n|---|---|---|\n| 1 | 2 | 3 |\n\n|   |   |   |\n|---|---|---|\n| 1 | 2 | 3 |\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole — signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE TRUE DATE\nOF\nTHE ENGLISH DISCOVERY\nOF\nTHE AMERICAN CONTINENT\nUNDER\nJOHN AND SEBASTIAN CABOT.\n\nCOMMUNICATED TO THE SOCIETY OF ANTIQUARIES\nBY\nRICHARD HENRY MAJOR, ESQ., F.S.A., &c.\n\nLONDON:\nPRINTED BY J. B. NICHOLS & SONS, 25, PARLIAMENT STREET.\n1870.\nTHE TRUE DATE\nOF\nTHE ENGLISH DISCOVERY\nOF\nTHE AMERICAN CONTINENT\nUNDER\nJOHN AND SEBASTIAN CABOT.\n\nCOMMUNICATED TO THE SOCIETY OF ANTIQUARIES\nBY\nRICHARD HENRY MAJOR, ESQ., F.S.A., &c.\n\nLONDON:\nPRINTED BY J. B. NICHOLS & SONS, 25, PARLIAMENT STREET\n1870.\nENGLISH DISCOVERY\n\nof\n\nTHE AMERICAN CONTINENT\n\nBY JOHN AND SEBASTIAN CABOT.\n\nTo C. S. Perceval, Esq., Dir. Soc. Ant.\n\nMy dear Perceval,\n\nWhile there remain any in this utilitarian age who value accuracy in history, the date of the discovery of the continent of America by English vessels will not be regarded as unimportant. It is well known that Columbus, whose great achievement of 1492 has placed him on a pinnacle of renown which neither rivalry nor detraction can ever eclipse or undermine, was himself preceded in the actual discovery of *terra firma* by John and Sebastian Cabot. It was not till 1498 that that prince of navigators lighted on the north coast of South America, whereas it is a fact beyond all question that in 1497 John Cabot, accompanied by his son Sebastian, was on the east coast of North America. The question is, whether in that year they discovered that coast for the first time, or whether in 1494 it had been already seen by them, though possibly not explored. Both these suppositions have had their advocates at different periods, but in later years the materials for forming a sound judgment on the question have much increased under our hands, and I should not be occupying your time now if I were not of opinion that the entire collection of documents in our possession is sufficient to enable us to come to a decided conclusion.\n\nThe belief that the first discovery was made in 1494 is no novelty. As far back as the year 1594 a German named Nathaniel Kochhaf, but better known by the name of Chytraeus, published at Herborn, in Nassau, a little work entitled *Variorum in Europd Itinerum Deliciae*, in which he prints a large variety of legends which he met with in his travels. In the year 1556 he saw at Oxford a map professing to be by Sebastian Cabot, containing nineteen inscriptions, which he transcribed and printed. Of these the two numbered respectively 8 and 17\nhave been the principal foundation for the belief that 1494 was the date of the important discovery in question. The inscription numbered 8 is as follows:\n\n\"De Terra Nova quam vulgus Baccalios appellat.\"\n\n\"Terram hanc olim nobis clausam speravit Johannes Cabotus Venetus, nec non Sebastianus Cabotus eae filius, anno ab orbe redempto 1594, die vero 21 Iunii, hora 5, sub diurnae, quam terram primum visum, & insulan quandam magnam et appositam insulan D. Johannis nominarunt, quippe que solemnis die festo Domi Johannis aperta fuit. Huius terrae incolae bellibus animalium indumenta, Areu in bello sagittis, speculis, clavis lignis & fundis victur, steriles incultae, tellus est, leonibus, ursis albis, proceribus, cornis, piscibus innumeris, lupis & salmonibus, & ingentibus salis vinius vine longiflumine, aliisque piscium diversis abundat generibus. Horum autem maxima copia est, quae vulgus Baccalios appellat, adhuc insunt accipitres nigri cornuae similis, aquila, perdixque fuscis coloribus, aliisque diversae volucres.\"\n\nWhich I translate thus:\n\n\"John Cabot, a Venetian, with his son Sebastian Cabot, discovered this land, which was formerly hidden from us, on the 21st June 1494 [1594 is an evident printer's error], at 5 o'clock in the morning; to which land they gave the name of \"Prima Vista,\" and to a certain large island near to it the name of St. John's Island, because it was discovered on the festival of St. John. The inhabitants of this land are clad in skins of animals. In battle they use a bow and arrows, darts, wooden clubs, and slings. The country is barren and uncultivated. It abounds with lions, white bears, tall stags, fish in countless numbers, wolves, salmon, huge soles an ell long, and various other kinds of fish. But those are in the greatest abundance which the common people call Bacallios. To these are to be added hawks of a black colour like crows, eagles, partridges of a dark colour, and a variety of other birds.\n\nThat portion of the inscription numbered 17, which affects our question, is as follows:\n\n\"Inscriptio ser Titulus auctoris.\"\n\n\"Sebastianus Cabotus Dux & Archigubernarius sacrae Cesareae Catholicae maiestatis, dini Caroli Imperatoris, haec nominis quinti, & regis Hispaniae, sumnam mihi manum imposuit, & ad formam hanc protrahens, plana figurâ me delineavit, anno ab orbe redempto, nativitate Domini nostri Jesu Christi 1549, qui me iuxta gradum latitudinem ac longitudinem, ventorum situm, tam docte, nam fideliter, navigatoriae chartae instar, descripsit, Geographi Ptolomaei autoritatem, periburnam, Lusitanorum fadem secutus, nec non ex usu atque industria longe navigationis, integerrimi viri Joannis Caboti, natione Veneti, atque Sebastiani astromum peritia, navigandi, arte omnium doctissimi eius filii, auctoris mei, qui aliquotam orbis partem die nostratis chasman apererunt.\n\n... At hee Sebastianus Cabotus, meus autor, occidentalem Oceani adnauigans, ad aquor quoddam devenit, & plagam ubi quarta parte Septentrionum iuxta caeciam ventura acis navigatoriae illium illi rectissime Aretum ostenderet. Quibus de causis & rationibus & nutissimâ nauigandi...\"\nexperience aperissimè constat, defectus & variationes neàs nantice cerebro feri cum Acti observatione.\"\n\nWhich I translate thus, without holding myself responsible for the bad construction of the language:\n\n\"Sebastian Cabot, Captain and Pilot of his Sacred Imperial Catholic Majesty the Emperor Charles, fifth of that name and King of Spain, put upon me the finishing hand, and, projecting me after this form, delineated me in a plane figure in the year of Redemption and of the Nativity of our Lord Jesus Christ 1549; who has described me according to the latitude and longitude of degrees, the position of the winds, so learnedly and so faithfully in the fashion of a sailing chart, following the authority of the geographer Ptolemy and the belief of the more skilled Portuguese, and also from the experience and practice of long sea service of the most excellent John Cabot, a Venetian by nation, and of my author, Sebastian his son, the most learned of all men in knowledge of the stars and the art of navigation, who have discovered a certain part of the globe for a long time hidden from our people. . . . Sebastian Cabot, sailing into the Western Ocean, reached a certain sea and region where the lily of the compass needle pointed due north at one quarter north-north-east. For which reasons, and by the safest nautical experience, it is most clearly evident that defects and variations of the compass frequently occur with observation of the North.\"\n\nSince the time of Chytraeus this theory of the date of 1494 has been propounded at intervals by Harris, Pinkerton, Sir John Barrow, and others, while there have not been wanting those who believed that the rightful date was 1497. Now it so happens that opposite opinions on this subject have been put forth so recently as 1869 by two friends of mine of high distinction in the world of letters, and as it happens in the self-same book, a book of which there are probably not half a dozen copies in England, but with one of which I have had the honour to be presented. It is entitled, A History of the Discovery of the East Coast of North America, particularly the Coast of Maine, from the Northmen in 999 to the Charter of Gilbert in 1578. By J. G. Kohl, of Bremen. Portland, 1869, 8vo. published by the Maine Historical Society. It is a most admirable work, and I am proud to think that it was at my suggestion that the proposal was made to my learned friend to undertake so responsible and difficult a task. In the chain of Kohl's labours the discoveries of the Cabots, of course, formed an important link, and his critical acumen has struck out some very valuable ideas in furtherance of the argument that the first discovery of terra firma was in\n1497, and not in 1494, which I shall presently lay before you. Nevertheless, he concludes his comments with the following sentence: \"From these considerations I repeat that the voyage of 1494, and the locality of the 'prima vista' in Cape Breton, appear to me to be doubtful, though I will not pretend to speak decisively on the subject.\"\n\nAt the close of the volume is inserted as an appendix, A Letter on the Voyages of John and Sebastian Cabot, by M. d'Avezac, of Paris, in which, after the statement of his reasons, that eminent savant thus enunciates his conclusions: \"I assume it then as a fact to be hereafter uncontested, as I have always regarded it as incontestable, that the first discovery of Cabot was made the 24th of June, 1494.\" Now when so distinct a declaration is put forth by one who has gained for himself a world-wide reputation for learning, industry, and critical sagacity, I fear that I risk the charge of great presumption in venturing to contest what my honoured friend has pronounced to be incontestable; on the other hand, I run a similar risk of being thought wanting in that modesty which distinguishes my friend Mr. Kohl when he hesitates to reject the prima vista of 1494 altogether, but simply regards it as doubtful. Meanwhile truth is of more importance than even these considerations, and, if I can only succeed in establishing my point, Mr. Kohl will not object to see the evidence with which he is so well acquainted placed in a new light; nor shall I find anywhere, as I well know from experience, a more large-minded and generous appreciator of the truth than my honoured friend M. d'Avezac, who, in his long and distinguished life, has himself served the cause of truth too often to object to its development be it by whom it may.\n\nNow, since in this discussion the pièce de résistance is the argument on which M. d'Avezac bases his firm conviction that the date of the first sight of the East Coast of America by the Cabots was on St. John's Day, the 24th June, 1494, I think it right to lay before you his own statement in his own words, as rendered into English by the editor of the work I have mentioned. For brevity's sake, I of course quote only those portions of M. d'Avezac's letter which bear directly upon the point with which I am dealing. He says:\n\n\"I come now to the matter in hand. In some place, more or less obscure, in the region of Genoa, if not in the City of Palaces itself (perhaps precisely in Castiglione), toward the middle of the fifteenth century, as I suppose, John Cabota, Caboto, or Cabot was born, who, early in 1460 at the latest, went to live at Venice; married there a daughter of the country, by whom he had three sons; and there, after fifteen years of residence, and by the unanimous\nconsent of the senate, expressed by one hundred and forty-nine votes, obtained from the doge (André Vandramino), on the 28th March, 1476, his naturalization as a citizen of Venice (privilegium civitatis de intus et extra). He had addicted himself, it appears, with great success, to the study of cosmography and the practice of navigation—perhaps he had sought the teaching of the celebrated Florentine cosmographer, Paul Toscanelli; and at all events he had doubtless adopted, with the avidity of a studious adept, the theories professed by that aged sage respecting the disposition of land and water on the surface of the globe—theories, the fame of which had reached even to the Court of Portugal, and had excited there a curiosity, which he satisfied in a well-known letter written from Florence, under date of June 25, 1474, to Canon Fernan Martins, an intimate of Alphonsus V., to which there was annexed a nautical explanatory chart representing the Atlantic Ocean, bounded on the east by the shores of Europe and Africa, and on the west by those of oriental Asia, with a total interval of 130° of longitude between Lisbon and Quinsay, the magnificent capital of the mighty empire of Cathay. At 50° this side of Cathay lay the great island of Zipangu or Japan. At 30° distance from Lisbon, the great island Antilla, or the island of the 'Seven Cities,' was thrust forward, which the maps of the time placed beyond the Azores; with some other islands in a location less fixed, among which the island of Brésil occurred in different places. A direct way was thus boldly traced by the learned Florentine across the Western Ocean, even to that opulent country of the Grand Khan, whose incomparable riches had been seen and related, two centuries before, by the Venetian Marco Polo. The attention of Alouzo V. was diverted by cares nearer home, by a war with strange reverses, from these meditations about a maritime route to the Indies by the west. But Cabot, who in his travels in the East (Ei dice che altre volte esso è stato a la Mecha) had learned from the caravans of Arabia that the spices came from hand to hand from the remotest countries of the East, could not fail to revolve in his brain adventurous thoughts regarding the distant horizon, where that extreme Orient was distinctly indicated, toward which he saw ranged at due intervals, like successive station-houses, the islands of Brésil, of Antilia, and then Zipangu.\n\n\"The new citizen of Venice, taking his wife and sons with him, to go into foreign parts to found an establishment of maritime commerce, in accordance with the cosmopolitan habits of the Venetians, selected for this purpose the English port of Bristol, the channel of which opens exactly toward those western regions, where Toscanelli had pointed out, in the distance, the fortunate shores...\"\nof Cathay. It may be conjectured that it was not far from the year 1477 that the family of Cabot transferred its penates to this port in the extreme west of Europe; for the second son, Sebastian, whom I suppose to have been born in 1472 or 1473, was then only a child.\n\n\"But in 1489, the 15th July, we see a ship and its consort, of eighty tons burden, belonging to the merchant Jay the younger, and conducted by the most skilful mariner in all England, setting forth from Bristol to go west from Ireland to seek the island of Brésil; and, on the 18th of the September following, the news reaches Bristol, that, after a cruise of two months, the expedition had returned to a port of Ireland without having found the island sought. This magister novis scientiis marinarum totius Angliae, I persuade myself, is no other than John Cabot himself.\n\n\"But from a doubt let us pass to a certainty. We have arrived now at the year 1491; and we know this time, appositely, that there then commenced a series of consecutive explorations, which employed, each year, two, three, four caravels, proceeding from the port of Bristol to sail under the direction of John Cabot, the Genoese, for the discovery of the isle of Brésil and of the Seven Cities; this is what the Spanish ambassador Pedro d'Ayala sends officially to his government in a despatch of the 25th of July, 1498, on occasion of the departure of a great expedition confided to this Genoese. 'Los de Bristol ha siete annos que cada anno han armado dos, tres, cuatro caravelas para ir á buscar la isla del Brasil, y las Siete Ciudades, con la fantasía deste Genovés.'\n\n\"At last, on the fourth voyage of this septennial series, in the month of June, 1494, the search is no longer in vain: in one of the legends accompanying the great elliptical Mappe-Monde, published in 1544 by Sebastian Cabot, then grand pilot of Spain, the following indisputable declaration is inscribed, both in Spanish and Latin, and is pointed out by an express reference [in the body of the map], for what relates to Tierra de los Bacalkos: 'This land was discovered by John Cabot a Venetian and Sebastian Cabot his son, in the year of the Firth of our Saviour Jesus Christ, MCCCXCIII (1494), the twenty-fourth day of June (at 5 o'clock) in the morning; to which land has been given the name of 'The land first seen': and to a great island, which is very near the said land, the name of 'St. John' has been given, on account of its having been discovered the same day.'\n\n* His words are:—\"The men of Bristol have for the last seven years sent out every year two, three, or four caravels in search of the Island of Brazil and the seven cities, according to the fancy of this Genoese.\"\nThis same date, 1491, such as we ascertain it on the very map of Sebastian Cabot, preserved at Paris in the Geographical Department of the Bibliothèque Impériale, was extracted in a similar manner in 1556, at Oxford, in a transcript by Nathan Kochhaf (Chytraeus), and copied by Hakluyt in 1589, at the Palace of Westminster, from another edition engraved by Clement Adams. A typographical error, rather than an ill-advised arbitrary correction, changed that date, in this same citation, in a later edition of Hakluyt's collection. This would not be worth mentioning if I were not obliged to give notice here, that more than one careless reader has inconsiderately, and without being sufficiently informed, taken the date thus corrupted for that which Hakluyt had actually copied from the original, engraved by Adams. Nor can this date of 1491, which was really written, be invalidated, on the pretext that the legend did not emanate from Sebastian Cabot himself. From whom then did it come? Its origin may, in my judgment, assuredly be traced to John Cabot, who must be supposed to have inscribed it in Italian, and this explains how the different versions which have been made of it into Latin, while they are identical in substance, are not precisely the same in form. As for the Spanish rendering, it is evidently posterior to the establishment of Sebastian Cabot in Spain. But of what avail is all this? The legends belong incontestably to the chart; for those which, on account of their length, are not included within the interior of the design, are plainly attached to it by references. And, if any one could doubt for a moment that the whole was the proper work of Sebastian Cabot, it would only be necessary, in order to remove immediately all hesitation in this regard, that he should read the first lines of the \"Relato del Autor,\" beginning thus: 'Sebastian Caboto capitán y piloto mayor de la Sacra Cesarea Católica Majestad del Emperador don Carlos quinto deste nombre y Rey nuestro señor, hizo esta figura extensa en plano, anno del nacimiento de nuestro Salvador Jesu Christo de M.D.XLIII. annos,' &c.\n\nI assume it, then, as a fact to be hereafter uncontested, as I have always regarded it as incontestable, that the first discovery of Cabot was made the 24th of June, 1491.\n\nBut, during the period of the successive attempts of this intrepid navigator to find a passage to the Indies by the west, the great fact of the Columbian discovery had been accomplished; and in its train had followed the promulgation of the\n\n---\n\n*Sebastian Cabot, Captain and Pilot-Major of his Sacred Imperial Majesty the Emperor Don Carlos, fifth of this name, and King, our Lord, made this figure, extended in plane, in the year of the birth of Our Saviour Jesus Christ 1544.*\nOn the date of the first Discovery of the American Continent.\n\nPapal bull, adjudging the New World to Spain; and, immediately after, the protestation of Portugal, and the establishment of a line of demarcation, and finally the Treaty of Tordesillas of 7th June, 1494. Accordingly, when John Cabot had, in his turn, discovered new countries, he was obliged to acknowledge that it could pertain only to a sovereign to declare them his own, and to confer the dominion utile over them on the discoverer; and he had recourse to Henry VII., king of England, to escape from the exclusive pretensions of Spain and Portugal. Perhaps after this appeal to the royal intervention he had to contend against jealous influences from abroad; at least it is certain that the Castilian ambassador, Ruy Gonzales de Puebla, received an order from his Court to make representations against every enterprise of this kind. \"Estas cosas semejantes son cosas muy ynciertas y tales que para agora no conviene entender en ellas, y tambien mirad que à aquellas partes no se puede entender en esto, sin perjuicio nuestro o del Rey de Portugal.\" However this may be, the King of England signed at last, at Westminster, the 5th of March, 1496, letters patent to John Cabot, citizen of Venice, and his three sons, Louis, Sebastian, and Sancius, and their heirs, and others concerned, to go by sea, under the royal British standard, for the discovery of unknown lands in the western hemisphere, and to take legal possession of them in the name of the Crown of England, to be enjoyed by him, and his sons and heirs, for their sole use and inheritance, as vassals and officers of the King, reserving one-fifth part of the net profits of all the products which should be entered free of customs at the single port of Bristol.\n\n\"We must probably ascribe to the secret practices of the Castilian diplomacy the delays which attended the departure of the expedition, which did not put to sea until the first days in the month of May, 1497, in a small ship manned by a crew of eighteen men, of whom one was a Burgundian, and one a Genoese; but the greater part were Englishmen from Bristol. It had returned by the beginning of August, for on the date of the 10th of this month the King gave from his privy purse a gratuity of ten pounds sterling 'To hym that found the New Isle.' Some days after, on the 23rd of August, the Venetian merchant Lorenzo Pasqualigo sent from London to his brothers in Venice what he had learned of the results of this voyage. John Cabot had found, at a distance of seven hundred leagues in the west, a firm land, along which he had coasted for the space of three hundred leagues, not having met a living person at the points\n\n* M. d'Avezac gives the original Spanish, but the following is Bergenroth's English version, \"These are very uncertain enterprises and must not be gone into at present. Besides they cannot be executed without prejudice to us and to the King of Portugal.\"\nwhere he had landed, but still having observed there some traces of inhabitants, trees notched, and nets for catching game. On his return he had seen on his right hand two islands, where, however, he had not wished to go on shore on account of the failure of his provisions. He had returned to Bristol after a voyage of three months, having left in the lands which he had discovered a grand cross with the banner of England and that of St. Mark of Venice.\"\n\nM. d'Avezac then proceeds to speak of what those three hundred leagues were. He then treats of the subsequent life and voyages of Sebastian Cabot, and finally gives the following summary of his conclusions as to what he regards as the four voyages of that navigator, made respectively in 1494, 1497, 1498, and 1517.\n\n\"You perceive, then, that with the exception of some secondary details, with regard to which my first decisions have been rectified by a more extended study, I have found in the documents which, within the last ten years, have been exhumed from the archives of Italy, of Spain, and of England, a precious confirmation of what you were pleased to call my plausible theory. Each one of the four voyages of discovery, which I had discriminated in my notices of 1857 and of 1863, is found in fact to present some characteristic trait to distinguish it from the three others. And first of all it is necessary to arrange them in two classes, the one for those performed by John Cabot, the other for those performed by Sebastian; and then to notice their special distinctions.\n\n\"The voyages performed by John Cabot (who had his son with him):—\n\n\"The first voyage, which had been preceded by many similar attempts, the knowledge of which is due to the researches of Mr. Bergenroth in the archives of Simancas, is directly attested by the unanswerable testimony of Sebastian Cabot, who pretends to nothing more, on this voyage, than a first sight of land, and an island situated near by, under the date of 24th of June, 1494.\n\n\"The second voyage, which lasted from the beginning of May to the beginning of August, 1497, is characterised by a navigation of three hundred leagues along the coast, the contemporary delineation of which, reproduced on the monumental chart of Juan de la Cosa, shows us the British standard erected on the 'Cabo de Ynglaterra' (which must have been reached by the end of May, or at the latest on the first days of June, and which is nothing else than the Terra prima vista of the preceding voyage), and then on divers successive points even to the Mar descubierta por Yngleses, on the shore of which no landing appears at that time to have been effected.\n\n\"Voyages performed exclusively by Sebastian Cabot:—\n\n\"The third voyage has for its salient feature the encountering of ice in 56° or\n58° N., in the month of July, 1498; and then, a falling back to the land of Bacallao.\n\n\"And, finally, the fourth voyage has for its characteristic circumstance Cabot's advancing to the north, even to the latitude of 67° 30' N., at the date of the 11th June, 1517, having then before him the coast running east-north-east.\n\n\"It is impossible for one who pays any attention whatever to these distinctive characters to confound any one of these four voyages with either of the other three.\"\n\nNow, in meeting these conclusions of M. d'Avezac's, I propose to prove:\n\n1. That the map on which those conclusions are founded is not by Cabot.\n2. From external evidence, that the first discovery could not have been made in 1494.\n3. That the misleading date is an erroneous transcription from a real map of Cabot's.\n\nM. d'Avezac reasons, and *prima facie* with great force, that the occurrence of 1494, both in the Spanish and Latin legends on the engraved map assumed to be Cabot's, is a double proof of intention in stating that date, and that it was not a casual blunder such as it might have been had the date been given only once; but this argument will be annihilated if I show that the engraved map is not Cabot's, but taken from a Spanish map drawn by Cabot, while the Latin inscription, being made by the map compiler and not by Cabot, of course contains the compiler's repetition of the one date which he had extracted, either correctly or incorrectly, from the original Spanish. Now, as M. d'Avezac has told you, there happen to be two engraved maps of the kind, known as Cabot's maps, bearing this date of 1494; one, that now in the Bibliothèque Impériale, of the same edition as that from which Chytraeus quoted, and on which M. d'Avezac now reasons; the other cut by Clement Adams, now lost, but formerly in the Queen's Privy Gallery at Whitehall, from which Hakluyt has fortunately extracted for us the very Latin legend in question. The subject matter of the Latin legends on these two maps is the same, showing their derivation from the one common Spanish origin, but the language in which they are rendered is entirely different. This fact of itself affords strong evidence that the engraved maps are not Cabot's, but derived from a Spanish map by his hand; because, if Cabot had himself written the legend in Latin as well as Spanish, there would have been no reason for giving a different Latin version in the one engraved map from that which was in the other: Cabot's original language would have been preferred. This reasoning\nOn the date of the first Discovery of the American Continent.\n\nof mine would of course be futile if the engraved map on which M. d'Avezac reasons was published by Cabot himself. To neutralize that conclusion, I lay before you the following judicious remarks by Mr. Kohl, which I will supplement by some comments of my own. And here I must ask you not to suppose that these two distinguished savants are disputants, between whom I have the presumption to interfere. Their respective observations, although brought under one cover by the editor of Mr. Kohl's valuable work, are made entirely without reference to each other, and address themselves solely to the theory which each entertains and advocates. These theories and these comments are public property, and therefore I feel at liberty to use them as best I may, and the more fully I do so, the better justice I shall render both to the writers themselves and to the question at issue. Mr. Kohl, referring to the same Mappemonde, now in the Bibliothèque Impériale in Paris, from which M. d'Avezac derives his arguments, after quoting the inscription numbered 17, already referred to, says:\n\n\"In this inscription the assertion is plain enough, that the celebrated Sebastian Cabot 'made' this map in the year 1544. Who makes this assertion we do not know. By some it is supposed that Cabot speaks here himself; others have thought that it must be another person, and that neither the above inscription nor the other legends of the map were composed by Sebastian Cabot. I agree with the latter opinion. These inscriptions all speak of Cabot in the third person, and they contain assertions, opinions, and expressions which scarcely could be ascribed to him, as I shall endeavour to make clear when I come to speak particularly of them, and show that these inscriptions were probably interpolated by the editor or publisher of the map, or some person employed by them.\n\n\"The inscription No. 17 asserts that Cabot 'hizo esta figura' (made this figure). What this means, and what kind of agency it ascribes to Cabot in the construction of the map, is not clear. Does the inscription pretend that Cabot himself engraved the map? We have never heard that Cabot, like the German Mercator and the Belgian Ortelius, engraved maps with his own hand. It is very probable that the inscription means nothing more than that the map was drawn and engraved after some original manuscript map, supposed to have been made by Sebastian Cabot.\n\n\"The year 1544 is given as the date when the map was engraved, and this date is confirmed by internal evidence.\"\n\nMr. Kohl then proceeds to show from the geography of the map itself his reason for concluding that the engraving and publication are justly placed in the year 1544. He then goes on to say,—\nNeither the publisher of the map nor the place of its publication is indicated, which is a singular, perhaps a suspicious, circumstance. Nearly all good maps of the sixteenth century contain both the name of the publisher and the place of publication. Ortelius, in his great work, 'Theatrum Orbis Terrarum,' gives a catalogue of nearly two hundred maps of the sixteenth century, most of them engraved; and they have, almost without exception, the name of the publisher, the place of printing, and the year of publication. Why have these been omitted on the map? Did not the publisher and printer like to be known?\n\nFrom the fact that the inscriptions and names of the map are written in Spanish, and also because Charles V. in one of the inscriptions is called 'nuestro señor' (our lord), we might be induced to think that the map was engraved and published in Spain. But other considerations render this supposition improbable.\n\nLong before the date of this map there were in Spain very able mathematicians and map-makers; but they made their charts for the King of Spain, or for his hydrographical bureau, and for the use of the Spanish navy. Such charts were kept in manuscript, because the Spanish officials were desirous of preventing their discoveries from being known. In the year 1527, only seventeen years before the date of this map, the English merchant Robert Thorne, in his well-known letter to Doctor Ley, ambassador of Henry VIII. to the Emperor Charles, says that 'in Spain none may make cardes but certain appointed and allowed masters, as for that peradventure it would not sounde well to them that a stranger should know or discover their secretes.' And, in sending to his countryman a very rough and small chart of the world, Thorne entreats him not to show or communicate this chart to the other Courts of Europe, 'because it might bee a cause of paine to the maker.' Is it probable that seventeen years after this the policy of the Spanish Government would have been so changed as to allow a complete and detailed chart of the world to be engraved, printed, and published in Spain in the name of the royal chief pilot?\n\nAll the first engraved maps of the world, particularly of the new world, were published elsewhere than in Spain, and principally in Italy and Germany. Not one of the editions of Ptolemy, to which the first maps of the modern discoveries were attached, was published in Spain. Ortelius, in his catalogue above quoted of two hundred maps and charts of the sixteenth century, has not mentioned a single map representing America, or any parts of it, as having been engraved and published in Spain. The two maps of America which were first printed in Spain, so far as I know, are those added, first, to the Spanish work of Pedro de\nOn the date of the first Discovery of the American Continent.\n\nMedina, 'Libro de grandezas y cosas memorables de Spaña,' published in 1549; and secondly, to Gomara's History of the Indies, published in 1554. These, however, are not sea-charts, but only general outlines of the new world in a very small compass, gathered from well-known foreign publications. The publishing of such small charts might have been easily allowed by the Spanish Government in the middle of the sixteenth century, without incurring any danger of betraying its secrets.\n\n\"Oviedo, in the second part of his great work on the History of America, which he wrote several years after 1544, mentions the map of Ribero made in 1529, and of Chaves made in 1536; but does not allude to a map of Sebastian Cabot as having been published in Spain.\n\n\"The copy of the map of 1544, which I am examining, was found in Germany, but several copies of maps ascribed to Sebastian Cabot formerly existed in England, and one is mentioned by Ortelius as having been seen by him in Belgium. These may have been copies, or perhaps different editions, of the map engraved in 1544, as they all have a general resemblance. But, though seen in other countries, not a single copy is known to have existed in Spain, or to have come from there.\n\n\"We therefore come to the conclusion that the Cabot map was neither engraved nor published in Spain, but perhaps in Germany or Belgium. In Belgium, particularly in Antwerp, many Spanish books were early printed, and there, as well as in Spain, they might call the Emperor Charles \"nuestro señor.\" There, too, they could take more liberty with Spanish secrets; though even there the publisher may have had his reasons for not mentioning his name, or the place of publication.\n\n\"If it should appear probable, for the reasons adduced, that this map was not published in Spain but in some other country, as Belgium for instance, it is rendered extremely doubtful whether Cabot, who was then residing in Spain, had any agency in it. Is it to be supposed that he would direct the work from so distant a country as Spain, examine proof-sheets, correct errors, and do other necessary acts in the publication? This doubt is confirmed by the contents of the map, such as the configuration of the countries, the orthography of the names attached to them, and other circumstances, which go to show that Cabot could not have prepared or inspected the work.\n\n\"In the inscription No. 17 the map is called a marine chart (carta de marcar); but it is not strictly this, but something between a chart and a map, for in regions where the interior was known, as in Europe or Asia, the map gives the rivers, mountains, and cities belonging thereto.\n\"But the shape and outlines of those portions of the old world, although covered by a series of names, are not accurately given. They were much better represented on several maps of the middle of the sixteenth century, particularly on some French and Italian maps. Even the coasts of the best and earliest known of all the seas, the Mediterranean, are here much misshapen and misplaced. Even Spain itself, and also Great Britain, the countries in which Sebastian Cabot passed the greater part of his life, are very carelessly represented: as, for instance, Ireland is made as large as England and Scotland together. In Spain we find places like \"Guadalupe\" mentioned, but not the important harbour of Corunna. In Great Britain several small places are indicated, but not Bristol—that commercial centre in which the Cabots lived, and from which their exploring expeditions proceeded.\n\n\"In connection with Bristol I may also observe, that this map gives to Iceland the longitude of the Shetland Islands, and places it directly north instead of north-west of Scotland. The route from Great Britain to Iceland had been, from time immemorial, familiar to British ships in their yearly traffic. That Iceland was situated north-west and not north of Great Britain must have been known in Cabot's time to every sailor in Bristol. How then can we account for it that Cahot, on a maritime chart, should have made so great a mistake with respect to an island so well known?\n\n\"The ill success of the author in delineating the oldest countries does not lead us to anticipate any better results in his attempts in the new world. I may, however, add that his latitudes and drawings of the new world are, in some instances, better than those of the old world, as in those of Mexico, Yucatan, Florida, and some others.\n\n\"The language of the map is partly Latin and partly Spanish. The Latin is not always correct or elegant. But it is more surprising that the Spanish terms and names are corrupted and disfigured in such an extraordinary way that sometimes it is nearly impossible to make out what the author means. I will give some instances: 'España' is called 'Hispia'; the island 'S. Miguel,' 'S. Migel'; the island 'S. Juan Estevanez,' 'de Juaninos' (?), 'Bimini' is written 'binimi'; the Laguna of Nicaragua 'Laguna de Nicaxagoe.' The Spanish phrase, which occurs on the map, 'por aqui no puede passar' (here one cannot pass), is written 'pora quinopede pasar.' Another Spanish phrase, 'aqui se desembarco Pamfilo de Narvaez' (here landed Pamphilo de Narvaez), is written thus, 'aqui de san barco pamilo de narnaez,' &c.\n\n\"Such errors furnish strong proof that Cabot had no agency either in writing the\nmap or correcting it, or in any way superintending its publication, but, on the contrary, that some ignorant compiler had copied an original manuscript in a very careless manner, and had written, in bad Spanish, his construction of the language. Still, in the inscription No. 17, the map is styled 'a faithful and most learned guide' (fida doctissimaeque magistra).\n\n\"The old maps, it is true, often have a quaint style of their own—a mixture of Spanish, Portuguese, Italian, &c.; but such barbarous language and such false orthography as are seen on this map of 1544 are never found on the maps of Ribero prior to this date, nor on the French charts some years later, where everything is comparatively correct.\n\n\"On this map, in the region of Carolina, a tiger-like animal is drawn, which, with a sweep of his tail, completely covers up, or brushes out, a large section of an important coast. It would appear to be incredible that a distinguished mariner and a mathematician like Cabot should not have been shocked by such a rough and stupid proceeding, and that he should not have corrected the draftsman, who could prefer an elaborate picture of the tuft of a tail to a correct drawing of the coast-line.\n\n\"This may suffice for the present in considering the question how far Sebastian Cabot may be regarded as having made this map; or, rather, it may serve to show how utterly improbable it is that it was either originally drawn by him or executed under his direction or superintendence.\"\n\nAs the inscriptions have never been published I have not myself had an opportunity of examining them, but I am under a strong impression that the Latin inscriptions must much exceed in matter those in Spanish, and treat of subjects untouched on by Cabot in the original. I derive this thought from Mr. Kohl's description of them. He says:\n\n\"They are of the most meagre character; they convey no historical or geographical information such as we should expect from the hand of a master, and especially from the great cosmographer of his age, which Sebastian Cabot is admitted to have been. There is only one subject in all the nineteen inscriptions of the map which appears worthy of Cabot, that is the variation of the magnetic needle, that great discovery of Cabot, which is treated of and explained in the inscription No. 17.\n\n\"Sebastian Cabot is described by Peter Martyr, and others who conversed with him, as an agreeable and modest man. But wherever he is mentioned in these inscriptions, it is with some pompous description like this: 'Navigandi arte astronomiâque peritissimus' (in the art of navigation and in astronomy the most\nexperience of man). Also, in the inscription No. 17, where it is stated that the map was made by Sebastian Cabot, he is called 'Astrorum peritiâ navigandique arte omnium doctissimus' (of all men the most learned in astronomy and in the art of navigation). These expressions would appear to go beyond his customary modesty, if we are to believe that it is Cabot himself who here speaks. It looks rather like the recommendation of a map-seller, who wishes to procure a large sale under colour of a great name; like the speculator complained of by Humboldt, who had published, against his will, some maps under his name, to which he had contributed nothing else.\n\n\"Such also is the following complimentary expression connected with the above, which runs thus: 'Therefore you may use this hydrographical chart as the most faithful and the most learned mistress (fida doctissimae magistra) in sailing to any part of the ocean wherever you should have the mind to sail.' I cannot, therefore, but concur in the opinion both of Mr. Bancroft and Mr. Charles Deane, 'that Cabot himself evidently did not write these inscriptions.'\"\n\nNow, it will be seen from the foregoing statements, that M. d'Avezac speaks of this map as being published by Cabot. Mr. Kohl, on the other hand, in endeavouring to prove that Cabot was not the publisher, arrives at the idea that \"Cabot had no agency either in writing the map or correcting it, or in any way superintending its publication.\" I propose to show that both these inferences are incorrect. Mr. Kohl has here very clearly demonstrated that \"Cabot had no agency in correcting the map, or in any way superintending its publication.\" But when he says that \"he had no agency in writing it,\" I think, if he were really engaged in discussion with M. d'Avezac, he would lay himself open to a very damaging reply; for it would involve him in the dilemma of either arbitrarily and unreasonably rejecting the distinct claim of the map itself to some sort of authorship by Cabot, or else of avowing that Cabot's information was really made use of, but only at second hand. In the latter event, it would be quite competent to M. d'Avezac to say, \"Well, let it be conceded that the map is a compilation, but if only it can be proved that that portion of it which relates to Cabot's discoveries is based upon a map laid down by him, his own assertion that his first discovery was made in 1494 remains in force.\" And on this footing M. d'Avezac's argument would hold an uncommonly strong position, inasmuch as this date of 1494 would have been copied from such original assertion of Cabot by two several map makers: viz. the compiler of the map in the Bibliothèque Impériale, of which that seen in Oxford by Chytraeus is\nonly another edition, and of that by Clement Adams at Westminster, from which Hakluyt gives the extract. Now, I think I can show that, though Cabot was not the publisher, he was the writer of the original map from which that portion of the mappemonde in question was derived. The ignorant copied names of places selected by Mr. Kohl to show that Cabot had nothing to do with the work prove no ignorance of Spanish in the original writer but only in the copyist, and from one of these I can show that the copy was made from a manuscript, and not from a printed map. Thus Laguna de Nicaragua is rendered \"Laguna de Nicaxagoe.\" Instead of an \"r\" we find an v. Now, every one acquainted with Spanish knows that a manuscript Spanish r is of the form of our northern x, and hence it is pretty evident that the transcriber who showed his ignorance of the language by writing \"pora quempele posor\" instead of \"por aqui no puede pasar\" derived his \"Nicaxagoe\" from a manuscript in which the \"r\" was given in a form which he very naturally took for an x. That this manuscript was Cabot's it would be futile to deny in presence of the distinct Spanish legend quoted both by M. d'Avezac and Mr. Kohl to the effect that Sebastian Cabot \"hizo esta figura extensa in phono.\" That the different engraved maps were also derived—so far as regards this portion of them—from the same Spanish manuscript is shown by the Latin translations being different renderings of the same original language. It will then, I hope, be seen that the occurrence of the date of 1494 both in the Spanish and Latin inscriptions on the map is entirely deprived of the force which it would have possessed had this engraved map emanated from Cabot's own hand; nevertheless, M. d'Avezac may well say to me, if you prove that Cabot, with his own hand, wrote in his original Spanish map that his first discovery was made in 1494, what further need of argument? In reply I say, I concede that he drew the original map, but not that he wrote the date 1494, even though such date be so copied by two independent transcribers. Now it might so happen that the shape of the Roman cyphers describing any given number would absolutely preclude the possibility of any mistranscription for another given number. Such is not the case in the present instance. The Roman letter v in the numerals vii.—which represent 7—has only to be carelessly drawn so as to be not well joined at the base, and we have two strokes, which, with the two ones, will make the four strokes which M. d'Avezac quotes from the inscription as representing his number 4. And be it observed that this may occur with far more ease in a manuscript, especially upon vellum, than on an engraved map on paper. The high probability of this mistranscription having occurred is shown by the simple fact that Hakluyt, in reprinting in 1600 the extract which he had\ngiven from Clement Adams's copy of the map in 1589, corrects the date from 1491 to 1497. Hakluyt himself tells us, \"That Cabot's own maps and discourses drawn and written by himself, were in the custodie of the worshipfull Master William Worthington, one of her Majestie's pensioners, who was very willing to suffer them to be overseene and published.\" These manuscript maps have never turned up since, and therefore we are unable to test by ocular proof whether my suggestion of an ill-written v. be correct or not; but they were accessible to Hakluyt, and it is reasonable to infer that he did not make this important alteration in a date without reference to them. In any case, no one can deny that this accident in the way of bad writing was quite possible.\n\nBut now that I have once led you to see that there may have been an error in the laying down of this date, I will now proceed to prove that there must have been; or, in other words, I come to the second division of my task, which is to prove, from external evidence, that the first discovery could not have been made in 1494.\n\nIn the first place, if new lands in the West had been discovered in 1494 by Sebastian Cabot or his father, he himself would not have been unaware of a fact of so great importance, nor would he have failed to mention it when conversing with others at a later date on the subject of his own discoveries, nor would the unquestioned discovery of 1497 have been made the one great subject of claim to distinction.\n\nBut what do we find?\n\nThe following is Cabot's own statement, as made to Gallicazzo Bottrigari, the Pope's legate in Spain, and recorded by the latter in a conversation at a later period with some Venetian gentlemen:—\"When my father departed from Venice many years since to dwell in England to carry on merchandise, he took me with him to the city of London, I being then very young, yet having some knowledge of letters of humanity and of the sphere. My father died at the time when news was brought that Don Christopher Columbus, a Genoese, had discovered the coast of India, whereof was great talk in all the Court of King Henry VII., who then reigned, it being declared to be a thing more divine than human to have found that till then unknown way to the East where the spices grow. From this there sprung up in me a great desire, nay, even a burning of the heart, to attempt some notable thing, and, understanding, by reason of the sphere, that, if I should saile by way of the north-west, I should have a shorter road for reaching India, I caused the king to be informed of my idea, who was very pleased with it, and furnished me with two caravels supplied with all things necessary for the voyage, which\nwas in the year 1496, in the beginning of summer. I began to sail toward the north-west, thinking to find no other land than that of Cathay, and thence to turn toward India, but after some days I found that the land ran towards the north, which caused me infinite vexation. Nevertheless, continuing along the coast to see if I could find any gulf that turned, I found the land still continent to the 56 degree under our pole, and seeing that there the coast turned towards the east, despairing to finde the passage, I turned back and sailed again along the coast of that land toward the equinoctial, always with the object of finding a passage to India, and came to that part which is now called Florida, where, my victuals failing, I resolved to depart thence and return to England, where I found very great tumults of people in rebellion and war in Scotland, for which cause no consideration was given to navigations in those parts.\"\n\nIt will be seen that Cabot's memory was a little indistinct when he says, \"this was, as far as I remember, in the year 1496;\" but happily I am able from this very document itself to replace this piece of loose sand by solid concrete. On his return he states that he found great tumults among the people, and preparation for wars in Scotland. It is well known that this episode in the Perkin Warbeck troubles occurred in 1497; but, as documentary evidence, I adduce the following from the Venetian State Papers, edited by Mr. Rawdon Brown, vol. i. No. 750:\n\n\"News received this morning from England by letters dated August 24th, 1497.\n\n\"That the King of Scotland with his whole army, accompanied by the individual who styles himself Duke of York, had been besieging a place in England on the sea shore (Norham), and King Henry had sent his forces, in number 40,000 men, by sea and land to give battle; so they fought and many fell on both sides, the King of Scotland being put to flight, abandoning all his artillery; but, as the matter is very recent, the writer was unable to learn the number killed.\"\n\nCabot returned to England in the early part of August 1497 from the voyage of actual discovery of America, which M. d'Avezac claims for his second, and I for his first; so that it is manifest that the conversation here recorded had reference to that voyage, while no allusion whatever is made to a previous discovery in 1494.\n\nAgain:—if new lands in the West had been discovered in 1494 by John and Sebastian Cabot, King Henry VII. would not have been unaware either of the fact itself or of its importance, nor would the unquestioned discovery of 1497 have been the one great subject of claim to distinction.\n\nThe interest of Henry VII. in western discovery may be judged from the fact recorded by Ferdinand Columbus, that his father, Christopher Columbus, had\nsent his brother Bartholomew to King Henry, and that when the King saw the map presented to him by Bartholomew he accepted the offer of his brother Christopher with a joyful countenance, and sent to call him into England. In the interval, however, Columbus had made his great discovery for Spain, much time having elapsed in the mission of Bartholomew in consequence of his having been captured and plundered by pirates, and being obliged to delay his appearance before the King until he had saved some money by making sea-charts. Under this disappointment it may be conceived with what pleasure the discovery of lands in the West in 1494 by Englishmen would be received by the King, had such occurred. But what do we find? On the 5th of March, 1496, the King grants a privilege to John Cabot and his sons to sail to all parts of the east, west, and north, under the Royal banners and ensigns, in ships to be provided at their own expense, to seek out and discover whatever islands or countries there might be that had hitherto been unknown to all Christians. These they might subdue and occupy, but they were to pay to the King the fifth part of the gains resulting therefrom. Surely these are not the terms which would be used with reference to the exploring of a land already discovered, and from which great results might be expected. Let us compare this patent with another granted by the same sovereign to the same Cabots on the 3rd of February, 1498, after the unquestionable discovery of the Newfoundland in 1497. We there find the course of proceeding very different. Permission is given to John Cabot to take in any part of England six English ships of 200 tons or under with their requisite apparel, and as many sailors as would go, and convey them to the new found land and islands, with a commandment to all officers and subjects, on seeing these letters patent, to afford every help to the said John Cabot and those who accompanied him.\n\nBut the question may be asked: On what ground was this first patent asked for in 1496? Does it not suggest a discovery already made? In reply I have only to refer you to Cabot's conversation with Bottrigari, already read, and it will be seen that the patent was issued in consequence of the report of Columbus's discovery having increased in his heart a great flame of desire to attempt some notable thing, and his subsequent representation to the King that he could reach India by a shorter route by the north-west. Can anything more plainly show than this that in 1496 this \"notable thing\" had not yet been effected? Can any words state more distinctly than these that this \"notable thing\" was yet to be \"attempted?\" Furthermore, as regards Henry VII., the date of a grant from the privy-purse expenses of £10 to \"him who found the New\nOn the date of the first Discovery of the American Continent.\n\nIsle,\" namely, August 10th, 1497, is tolerably significant in connection with the silence as to any previous discovery by the same man.\n\nBut again:—if new lands in the West had been discovered in 1494 by John or Sebastian Cabot, two Spaniards resident in England as representatives of the Spanish sovereigns, and jealous of their prior claim to the land so discovered, would not have been asleep either to the fact itself or to its importance, nor would the unquestioned discovery of 1497 have been made the one great subject of claim to distinction. But what do we find? The first patent had been granted to Cabot by Henry VII, on the 5th of March, 1496, and on the 28th of that month the following letter is written from Ferdinand and Isabella to Doctor de Puebla, one of their two ambassadors in London:\n\n\"You write that a person like Columbus has come to England for the purpose of persuading the King to enter into an undertaking similar to that of the Indies, without prejudice to Spain and Portugal. He is quite at liberty. But we believe that this undertaking was thrown in the way of the King of England by the King of France, with the premeditated intention of distracting him from his other business. Take care that the King of England be not deceived in this or in any other matter. The French will try as hard as they can to lead him into such undertakings, but they are very uncertain enterprises, and must not be gone into at present. Besides, they cannot be executed without prejudice to us and to the King of Portugal.\"\n\nIn the presence of such a document as this, is it possible to believe that a discovery of America by Englishmen had been previously effected in 1494?\n\nBut, again, the following is a letter from Pedro de Ayala, the other Spanish ambassador in London, written to Ferdinand and Isabella on the 25th July, 1498, after the return of Cabot from his successful voyage of 1497, and when he had started on a fresh voyage under a patent granted by the King on 3rd of February, 1498:\n\n\"I think your Majesties have already heard that the King of England has equipped a fleet in order to discover certain islands and continents which he was informed some people from Bristol, who manned a few ships for the same purpose last year, had found. I have seen the map which the discoverer has made, who is another Genoese, like Columbus, and who has been in Seville and in Lisbon, asking assistance for his discoveries. The people of Bristol have, for the last seven years, sent out every year two, three, or four light ships (caravelas), in\n\n* See Bergenroth's Calendar of State Papers relating to England and Spain. London, 1862, vol. i. page 168.\nsearch of the island of Brazil and the seven cities, according to the fancy of this Genoese. The King determined to send out (ships) because, the year before, they brought certain news that they had found land. His fleet consisted of five vessels, which carried provisions for one year. It is said that one of them, in which one Friar Buil went, has returned to Ireland in great distress, the ship being much damaged. The Genoese has continued his voyage. I have seen, on a chart, the direction which they took, and the distance they sailed; and I think what they have found, or what they are in search of, is what your Highnesses already possess. It is expected that they will be back in the month of September.\n\nI write this because the King of England has often spoken to me on this subject, and he thinks that your Highnesses will take great interest in it. I think it is not further distant than four hundred leagues. I told him that, in my opinion, the land was already in the possession of your Majesties; but though I gave him my reasons, he did not like them. I believe that your Highnesses are already informed of this matter; and I do not now send the chart or *mapa mundi* which that man has made, and which, according to my opinion, is false, since it makes it appear as if the land in question was not the said islands.\" Can anything more distinctly state than this letter does, that, though the Bristol people had sent out expeditions every year since 1491, the King now sent out ships only because now, at length, in 1497, \"they brought certain news that they had found land?\"\n\nBut again:—if new lands in the West had been discovered in 1494 by John or Sebastian Cabot, Venetians in England who took a pride in the glory of their country, as represented by the discoverer, who was their countryman, would not have been asleep either to the fact or to its importance, nor would the unquestioned discovery of 1497 have been made the one great subject of claim to distinction. But what do we find?\n\nThe following is a letter dated from London, 23rd August, 1497, from Lorenzo Pasqualigo to his brothers Alvise and Francesco, about a fortnight after Cabot's return from his successful voyage in 1497:\n\n\"The Venetian, our countryman, who went with a ship from Bristol in quest of new islands, is returned, and says that 700 leagues hence he discovered land, the territory of the Grand Cham (Grand Cam). He coasted for 300 leagues and landed; saw no human beings, but he has brought hither to the King certain snares which had been set to catch game, and a needle for making nets; he also found some felled trees, wherefore he supposed there were inhabitants, and returned to his ship in alarm.\"\nHe was three months on the voyage, and on his return he saw two islands to starboard, but would not land, time being precious, as he was short of provisions. He says that the tides are slack, and do not flow as they do here. The King of England is much pleased with this intelligence.\n\nThe King has promised that in the spring our countrymen shall have ten ships, armed to his order, and at his request has conceded him all the prisoners, except such as are confined for high treason, to man his fleet. The King has also given him money wherewith to amuse himself till then, and he is now at Bristol with his wife, who is also Venetian, and with his sons; his name is Zuan Cabot, and he is styled the great admiral. Vast honour is paid him; he dresses in silk, and these English run after him like mad people, so that he can enlist as many of them as he pleases, and a number of our rogues besides.\n\nThe discoverer of these places planted on his new found land a large cross, with one flag of England and another of St. Mark, by reason of his being a Venetian, so that our banner has floated very far a-field.\"\n\nI ask, is this language compatible with the possibility of a previous discovery of America by Cabot in 1491?\n\nBut, again, under date of 24th August 1497, a day later than the preceding, we have \"News received this morning in Venice from England.\"\n\nSome months ago his Majesty sent out a Venetian who is a very good mariner and has good skill in discovering new islands, and he has returned safe and has found two very large and fertile new islands; having likewise discovered the seven cities, 100 leagues from England on the western passage. This next spring his Majesty means to send him with fifteen or twenty ships.\"\n\nThe above expression, \"has good skill in discovering new islands,\" has led Mr. J. F. Nicholls, the city librarian of Bristol, who has recently brought out a pretty little book on Sebastian Cabot, to think that this letter is a recognition of previous discoveries; but we have only to notice the statement that Cabot \"had likewise discovered the seven cities\" to see that the writer was announcing the final success of those efforts to discover Brazil and the seven cities in search of which Pedro de Ayala tells us he had every year since 1491 induced the people of Bristol to send out caravels. And this leads me to notice that my friend M. d'Avezae adduces this very passage from Pedro de Ayala's letter in corroboration of his date of 1491, as showing that expeditions were at that time sent out to the westward. But Mr. Kohl has made a most sagacious and just\n\n* See Rawdon Brown's Venetian State Papers, vol. i. No. 750.\nobservation on this head, which entirely subverts any such conclusion. \"If,\" he says, \"a great country had already been found there in 1494, it would have been quite unnecessary for the Cabots to persuade the Bristol men to continue their exploring expeditions after that time;\" whereas they were continued in 1495, 1496, and 1497. To my own mind this argument is beyond all reply.\n\nAnother idea has been advanced by Mr. Nicholls which must not be overlooked, as it appears to present a formidable objection. He says:—\"Pasqualigo tells us they were three months on the voyage; yet we find the head of the firm, John, at the Court in London, and in possession of the reward on the 10th of August, 1497. The land was seen, it is said, on June 24th. If they were three months on the voyage—they sailed about the 10th of May—and were thirty-four days beating out; take the same period for their return, including the landing at Bristol, and the two days' journey to London, and it will just give three weeks to do what we venture to say no hydrographer of the present day, with all the knowledge which experience has brought, and all the appliances of science, would venture to attempt in less than as many months.\"\n\nThe remark is very just, but is admirably met by a piece of reasoning which Mr. Kohl had already committed to paper in his valuable work. He says:—\"The first or preliminary exploring expeditions for discovery were generally short excursions; and for good reasons, such as the uncertain nature of the projects, and consequently the difficulty of obtaining the requisite means of conducting them. They usually commenced such voyages with one or two light and small ships, and, after having made a discovery, or even obtained a distant glimpse of some new country, they were eager to return and proclaim their success, and to obtain a reward, and a larger outfit for more thorough explorations. We observe, therefore, that in the history of discovery the first exploring expeditions continued but a very short time, whilst in the second undertaking a large fleet and more ample supplies have enabled the adventurers to remain longer abroad, and to make more thorough surveys. But if we adopt the year 1494 for the first exploring voyage of the Cabots, we find that in the two subsequent years, 1495 and 1496, no voyage at all was performed; and that in 1497, what would then be their second voyage, was a very small undertaking with only one little vessel, the 'Matthew,' from which they returned quickly after an absence of only three months. Such inactivity in the Cabots, the King, and the Bristol men, after the apparently great success of 1494, with the small outfit and quick return in 1497, would be perfectly out of analogy with the usual course of things, and wholly unaccountable. If, on the contrary, rejecting the theory which supposes a voyage to have\nbeen made in 1494, we come to the conclusion that the first successful exploring expedition of 1498, for which Sebastian Cabot was furnished with several ships and three hundred men, with which he explored a tract of coast of more than one thousand leagues in length, and from which he returned after more than half a year's absence, was not his third but his second undertaking; then everything is clear and in harmony with the usual and natural course of events.\"\n\nI will just mention one more piece of corroborative evidence for what it may be worth. William Barrett, the author of *The History and Antiquities of the City of Bristol*, gives, on page 172, the following passage from an ancient Bristol manuscript in his possession:—\"In the year 1497, the 24th June, on St. John's day, was Newfoundland found by Bristol men, in a ship called the 'Matthew.'\"\n\nBy the various documents which I have adduced, so notably independent of each other, yet so concurrent in the testimony which they bear, I trust that I have sufficiently proved that the first discovery could not have taken place in 1494. Against this array of evidence the only document that is pretended to be adduced is an engraved map, which has been satisfactorily shown to be second-hand from Cabot, and consequently liable to the accidents of mis-transcription. I have shown also that the special construction of the numeral admitted of such mis-transcription of the date in question. It has further been shown that as there were two maps bearing the same legend, but rendered differently in the Latin translation, there was one origin for both, but that the original had not the Latin transcriptions at all, and hence the occurrence of the date on both the Spanish and Latin inscriptions loses its force as a double piece of evidence. That the original was Spanish is clear, because all the names of places are Spanish; and that the original was a manuscript I have shown by the ignorant transference into the engraved map of an *x* instead of an *r*, from the Spanish form of that letter when written by the hand. That the original was Cabot's it would be unwarrantable to deny, as both the engraved copies, evidently produced independently of each other, declare the authorship.\n\nI now proceed to the third division of my task, which is to prove that the misleading date was an erroneous transcription from that original manuscript map of Cabot's. In the year 1589 Hakluyt gave in his one-volume edition of the *Principall Navigations* the inscription from Cabot's map cut by Clement Adams containing this date of 1494. When he brought out in 1600 the third volume of his three-volume edition of his great work he again gave this inscription, but with the date altered to 1497. This important change my friend M. d'Avezac regards as a\nmere typographical error little deserving of notice. I am, however, prepared to prove distinct intention in the change. In the very inscription in question, the country \"first seen,\" alias the \"prima vista,\" is said to abound with white bears, an expression which may have well led to the conclusion that Labrador was the country referred to. Now it so happens that in this same edition of Hakluyt, in which the date is altered from 1494 to 1497, is a very remarkable map in which on Labrador is written this inscription:—\"This land was discovered by John and Sebastian Cabot for King Henry VII. 1497.\" My friend may here object that Labrador may have been discovered in 1497, without impugning the \"prima vista\" of 1494, inasmuch as he has distinctly stated that Sebastian Cabot pretends to nothing more in this voyage of 1494 than a first sight of land. If so, then, how comes the very legend which contains this date of 1494 to contain also a very compact and graphic description of the country, of the habits of the natives and their mode of fighting, of the beasts, birds, and fishes, and among them these white bears, which may well be found in abundance in Labrador, but scarcely much to the south, as for instance in Newfoundland, especially in the month of June? I think, therefore, it would be attributing to Hakluyt an imbecile inconsistency to doubt that the change of the date from 1494 to 1497 was other than an intelligent and intentional change.\n\nNow, when I find Richard Hakluyt, himself a Prebendary of Bristol cathedral, altering, in his own book, and as I have shown intentionally, the date of the discovery of the continent of America by Bristol men from 1494 to 1497; and that in correction of the very document in which he had originally stated the earlier date; when I find, moreover, that he had the opportunity of seeing, in the possession of his friend William Worthington, the original figures in Cabot's handwriting from which the dates had been originally taken—an alteration which, if not made on well-ascertained grounds, would have been an unpardonable disparagement of the glory not of Bristol only, but of England—I come to the positive conclusion that he had first satisfied himself upon the point, with his own eyes, from an original map of Cabot's, and also that he had become convinced that that important event, the discovery of the continent of America, had taken place in 1497 and not in 1494, as I have otherwise, I hope, abundantly proved from a variety of concurrent evidence, in which there could be no possibility either of collusion or of mistake.\n\nI am,\n\nMy dear Perceval,\nYours very truly,\nR. H. Major.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_26558.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 37, "total-input-tokens": 69608, "total-output-tokens": 19028, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2442, 3], [2442, 4895, 4], [4895, 4895, 5], [4895, 5149, 6], [5149, 5149, 7], [5149, 5402, 8], [5402, 5402, 9], [5402, 7311, 10], [7311, 10434, 11], [10434, 13145, 12], [13145, 15907, 13], [15907, 18738, 14], [18738, 21444, 15], [21444, 24217, 16], [24217, 27186, 17], [27186, 29969, 18], [29969, 32508, 19], [32508, 35290, 20], [35290, 38059, 21], [38059, 40779, 22], [40779, 43471, 23], [43471, 46104, 24], [46104, 48844, 25], [48844, 51716, 26], [51716, 54427, 27], [54427, 57230, 28], [57230, 60020, 29], [60020, 62752, 30], [62752, 65458, 31], [65458, 68118, 32], [68118, 70993, 33], [70993, 73798, 34], [73798, 76451, 35], [76451, 76451, 36], [76451, 76451, 37]], "primary_language": ["en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]