[{"id": "7994b34bd1e0346308605eef7ef35bd45ceffb3a", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☑ Covers damaged/\nCouverture endommagée\n\n☑ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X |     | 24X | 28X | 32X |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n☐ Coloured pages/\nPages de couleur\n\n☐ Pages damaged/\nPages endommagées\n\n☐ Pages restored and/or laminated/\nPages restaurées et/ou pelliculées\n\n☑ Pages discoloured, stained or foxed/\nPages décolorées, tachetées ou piquées\n\n☐ Pages detached/\nPages détachées\n\n☑ Showthrough/\nTransparence\n\n☐ Quality of print varies/\nQualité inégale de l'impression\n\n☐ Includes supplementary material/\nComprend du matériel supplémentaire\n\n☐ Only edition available/\nSeule édition disponible\n\n☐ Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\nLes pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\nMANITOBA.\n\nAN ADDRESS, DELIVERED AT THE NAIRN LITERARY INSTITUTE, 29th AUGUST, 1889.\n\nBY DUNCAN MACARTHUR,\nWINNIPEG.\n\nPRINTED AT THE \"TELEGRAPH\" OFFICE, NAIRN.\nMANITOBA.\n\nAN ADDRESS BY MR DUNCAN MACARTHUR OF WINNIPEG,\nDELIVERED UNDER THE AUSPICES OF THE NAIRN LITERARY\nINSTITUTE, IN THE PUBLIC HALL, ON THE 29TH AUGUST,\n1889.\n\nMR CHAIRMAN, LADIES AND GENTLEMEN,—\nAlthough I am not a public speaker, I have much\npleasure in responding to the desire of the Literary Institute\nto deliver an address on the Province of Manitoba, where I\nhave lived for many years, and about which I may be supposed\nto possess some accurate information.\n\nBefore doing so, however, I would express a sense of the great\npleasure I feel in being once more, after so long an absence\nin my native County and amongst my own people.\nI see many changes in Nairn, both in the place and in the people.\nThe town has been improved almost beyond recognition, and it\nwell merits the title of \"The Brighton of the North,\" and I am\nglad to find that the spirit of progress is still unabated, and that it\npromises to bear as much fruit in the future as it has done in the\npast. With regard to the people, the changes are even greater\nstill. A large number of strangers have come to reside in the town.\nA new generation has sprung up since I first left, now nearly\ntwenty-five years ago. The boys and girls whom I knew, have\ngrown into middle-aged men and women, and, alas, the majority\nof those who in my time were in the prime of manhood and\nwomanhood, have passed away to that silent land, \"from whose\nbourne no traveller returns.\" As the poet says:—\n\n\"Gone are the heads with the silvery hair,\nAnd the young that were have brows of care.\"\n\nWithout being invidious, there is one honoured name to which\nI must make some reference on this occasion, namely, that of Dr\nGrigor, who was a life-long friend, I may almost say of every\nfamily in this town, and who was perhaps the truest and most\nconstant friend the town ever had; and I am sure his memory\nwill be embalmed in the minds of the people, and that his public\nspirit and his enlightened policy in public matters will exercise a\nbeneficial effect in Nairn for generations to come.\n\nNow, Mr Chairman, I have already said that I am not a public\nspeaker, and I am here to-night almost by accident, having come\nto my native land not to lecture, but partly in obedience to the\ninexorable demands of business, and partly to seek recreation\nafter a long spell of hard work, and to spend a short time amongst\nthe relatives and friends who are still left to me. Moreover, since my arrival my time has been almost wholly occupied, and you must not, therefore, expect any elaborate or exhaustive address from me, but what I shall tell you this evening about Manitoba you can depend upon as being an exact transcript of my own thoughts and beliefs about that great country.\n\nAs you are aware, the North West Territories of Canada before the confederation of the several Provinces of British North America into one great Dominion in 1867—which I may say was the greatest and most successful effort of statesmanship in Canadian politics during this century, as it secured the permanance of British Institutions in North America—was occupied by the Hudson's Bay Company, partly under charter and partly under lease from the Crown, and being required for the purposes of the Fur Trade, colonization was not much encouraged. But when this vast territory was acquired by the Dominion of Canada in 1870 by the purchase of the Company's claims and the extinction of its monopoly, its character as a superior grazing and farming country at once became known and it was made immediately available for settlement, and from that time until now it has continued to attract in an ever increasing degree the attention not merely of the people of Great Britain but of every European country, as being at once the most eligible and the most accessible field for emigration in the world. This immense territory has of late years been divided into the Province of Manitoba which contains the eastern and best portion of it, and into three other territories namely Alberta, Athabasca, and Saskatchewan. Manitoba contains 116,000 square miles or about 75 millions of acres—a larger area of land than is contained in England, Scotland and Ireland put together, and this land is nearly all level and of unsurpassed quality for agricultural purposes. \"The Fertile Belt\" is the name given to a well known tract of land, which has a width of some 300 miles, and which, beginning east of the Red River, and embracing the whole of Manitoba, stretches north-westwards for a distance of at least a thousand miles through the territories which I have just mentioned, and speaking of this illimitable extent of land, I shall never forget my first view of the boundless prairies of the North West. There are times when even prosaic and ordinary men experience feelings which are akin to inspiration, and such a time was this to me. Far away as the eye could reach on every side lay a vast level plain, covered by luxuriant grass, which waved gently and gracefully in the wind, with here and there islands, or clumps of young timber and willows, which gave the scene a park-like appearance. The grass was sprinkled with innumerable flowers, and was the haunt of an endless variety of birds of every shade of plumage. On every side the view was bounded only by the horizon. The canopy of this sublime scene—the vault of heaven—was a perfect dome, in which the summer clouds lay high and light, and whose disc was unbroken by hill or mountain peak. A flood of sunshine\npoured itself on the scene, and as I stood there, a solitary stranger, I felt I was emphatically in a new world, and my imagination pictured to itself the not far distant time when those beautiful and fertile plains would be covered by a network of railways—when they would be cultivated and planted and dotted over with comfortable homes of a prosperous, and a contented people—when the older nations of the world, limited as they are by space, fettered by poverty, and crushed by the exactions of injustice and tyranny, would pour their surplus population, as well as many of their best men into our prairies, and thus enable them to achieve a career and an independence which in their present circumstances is impossible. Now, Mr Chairman, that is nearly twenty years ago, and the outlines of the picture are filling up—the anticipation is being realized, as I shall show you a little later on.\n\nAll competent authorities agree that Manitoba is the garden of the North West, and having traversed the country in every direction, I can bear testimony to the truth of this statement from my own personal observation, and I believe there is not a greater extent of uniformly rich soil to be found in any country in the world. The best proof of its fertility is its products, our root crops are a perpetual wonder to strangers, whilst our wheat and other cereals have gained a world-wide celebrity. Analysts have pronounced our soil to be equal to the best soils in Europe, even after the latter have received the best mechanical and chemical treatment which modern science can bestow. It has been proved repeatedly that we can in Manitoba not only obtain a larger yield per acre, but that we can in addition obtain a greater weight per bushel, than can be got in any other part of the American continent. Then again, owing to the level surface of the country, and the almost entire absence of stones and stumps, the process of preparing the virgin soil for crop is a simple and inexpensive one, and for the same reason all kinds of agricultural machinery can be used to the best purpose with the result of minimizing the cost of labour which is so serious an item in the expenses of the farmer. Excepting a few inconsiderable parts of the Province, there is scarcely a stone or a stump to impede the plough, and unlike the experience of early settlers to other parts of America, where it took years and sometimes a lifetime to hew a farm out of the forest, emigrants to Manitoba can have an entire farm of 160 or 320 acres, or more, according to their means, under crop within twelve months from the date of their arrival in the country. In addition to these advantages our climate is singularly healthy and bracing. In summer it is delightful—warm and bright days followed by deliciously cool and refreshing nights. Spring begins about the 1st of April, which is one of the finest months in the year and during which as a rule no rain falls. Rain generally falls in copious but not too frequent showers from the middle of May until the end of June. July and August are our two warmest months, and the progress of vegetation during those months is astonishing. The arrears of growth sometimes held in check by a tardy spring are fully made up by the teeming luxuriance of our summer months. September is with us perhaps the finest month in the\nyear, agreeably warm and bright—the early part of this month is characterized by the activities of harvest, and the latter by the change of leaf which announces the approach of Autumn. During the whole of October and the first ten or fifteen days of November the weather is generally fine and well adapted for ploughing, threshing, and other farming operations. Winter commences about the middle of November and continues until about the end of March. The latter part of November is generally agreeable as is also the latter part of March. The intensity of winter is experienced during December, January, and February, but, if cold, the weather is bracing and even exhilarating, and many people prefer winter to summer. The discomforts arising from cold are slight, and they are almost invariably caused by the ignorance or imprudence of those who experience them. It may appear incredible to people living in so-called temperate climates to be told that Manitobans can follow nearly all the avocations of out-door life under a temperature varying from 15 to 30 degrees below zero, but such is actually the case. This is due in no small degree to the absence of high winds and to the dryness of the air, which is no less remarkable for this quality than for the amount of electricity which it contains.\n\nComing now to speak of the progress made during my own period of residence in the Province. When I went to Winnipeg, in 1872, it was a remote and insignificant village, 500 miles north of any considerable town in the United States, and containing a population of some 800 souls. It was regarded as the Ultima Thule of settlement and civilization. There was no municipal or other organization of any consequence, and no public improvement of any kind. Everything was crude and tentative, and there were but few indications of the immigration and development which were soon afterwards to set in. Since that time, Winnipeg has become a city of about 23,000 inhabitants. It is the seat of our Provincial Parliament of the Higher Courts of Justice and of a University which embraces nearly all denominations. It possesses several denominational Colleges, a number of denominational and private schools and a large number of public or free schools which provide an excellent education for the young, and in which there are at the present time about 4000 pupils. The Hudson Bay Company, which is an essentially English Corporation as regards its proprietary, and an essentially Scotch Company as regards the majority of its officers and servants, has its local headquarters in Winnipeg. The city contains a large number of substantial and imposing public and private buildings. The principal street is 132 feet in width, and about 2 miles in length, and forms one of the finest avenues in the world—in short, the village of 1872 is now the prosperous capital of a large province.\n\nBut leaving the city, and looking around to the country of which it is the political and commercial capital, we find the progress equally great. The Province has its legislature which enacts laws for the benefit of the people. It is divided into Municipalities, the affairs of which are managed by Councils, which take cognizance and control of education, local public works and other\nimportant local matters. The most perfect order is maintained, and life and property are as safe with us as they are in any part of the Empire. When I first went to the country, the nearest railway was 250 miles distant. At the present time the Canadian Pacific Railway, which runs across the continent, has a mileage in Manitoba of 750 miles. The Manitoba and North Western has a mileage of about 230 miles, and other roads traversing the Province in all directions, have a total mileage of about 300 miles. This extraordinary development has taken place chiefly within the last 10 years, and it will be seen that we are abundantly supplied with railways, which are the most essential factor in the development of a new country, and that the farming community are supplied with every facility to import their supplies and to export their grain and other produce. Then we have Banks, Insurance Companies, Loan and Building Companies, and wholesale establishments, which fully supply all our requirements—indeed the political educational and commercial equipment of the Province may be said to be complete and rather ahead of than behind the actual requirements of the people. Such in brief is a statement of the material and other progress made by the Province of Manitoba in the short space of 18 years. Another point to which I would like to call attention is the superiority of Manitoba as a field for emigration to the contiguous state of Minnesota and Dakota. The northern portions of these States—which are practically under the same climatic conditions as Manitoba—are celebrated for the production of wheat, but it is well known fact that the yield per acre, and the weight per bushel, and the general quality of the grain, are all inferior to what Manitoba can produce. Manitoba is, in sober fact, the best wheat producing country in the world. This is proved by actual results, and it is accounted for by the depth and vast extent of its rich soil, and by the curious but well known natural law, that wheat and other cereals attain their maximum development both as regards quality and yield towards the northern limit of their successful cultivation. Now the isothermal line which indicates this limit runs through the northern boundary of the fertile belt of the North American Continent, which, as I have already said, embraces the whole of Manitoba and the greater portion of our Territories.\n\nBut some people have said to me, what about the frosts and other drawbacks to which you are subject in Manitoba. Well, Mr Chairman, I do not wish to conceal that we have drawbacks in our Province. What country in the world has not! Take Great Britain for example. For some years in this country the crops have been seriously damaged by a succession of wet seasons, particularly in England, but in addition to your occasional drawbacks you have to confront perpetually the grim and double-headed spectre of competition, as regards your grain and cattle. Now we are free from this spectre, but in common with Minnesota and Dakota, which are the best wheat producing States in the American Union, we have had destructive frosts of late years, and we may, like yourselves, expect occasional wet seasons and dry seasons, and other vicissitudes of\nthe weather, but with regard to frosts about which so much has been said, I have known during my residence in Manitoba, a period of twelve years to elapse without any injury to our crops from frost, and people who have lived in the country all their lives have told me that they have known upwards of twenty years to elapse without injury to the crops from this cause, and we may reasonably conclude that the seasons will resume their habitual character and that we shall enjoy in the future, the same immunity from damage by frost as we have enjoyed in the past.\n\nNow, Mr Chairman, I think I have said enough to show you that we have the best field for emigration in the world, such at any rate is my candid belief. You have in the United Kingdom a large and ever increasing surplus population. This is clearly shown by the number of your able-bodied paupers—by the congested state of certain districts in the kingdom, and by the low wages and lack of employment, which prevail in too many parts of the country. Now we have what you want, namely, an enormous extent of rich farming land, and you have what we require, a large surplus population, and the problem is to bring our mutual requirements together. We can absorb your surplus people for an indefinite time to come. We can give free homes and independence to every crofter in Skye and Lewis, to every peasant in Donegal, and, in short, to every man in this country who finds it either necessary or expedient to seek relief from the onerous conditions which govern his life here by emigrating to one of the Colonial possessions of the Empire. Those whom I would particularly recommend to come to Manitoba are—\n\n1. Men with capital who have had experience in farming. For this class there is unbounded scope and assured success in our Province.\n\n2. The smaller class of farmers—industrious men with families who are toiling from year to year, and only making the day and the journey alike—men who on dispenishing would have from £200 to £500 to make a new start with. Such men can be independent for life after being a few years in our country.\n\n3. The crofters, about whom so much has been heard of late who are now occupying areas of land which are quite incapable of sustaining them. We have a number of this class now and they are doing well, and will do better in future as they acquire a little capital.\n\n4. Farm servants both male and female. Men servants are in great demand at high wages, and in a few years they can save enough to acquire farms of their own. Female servants owing to the inequality of the sexes are not allowed to remain long in servitude, but soon find partners for life, and homes of their own in the Far West.\n\nThe land policy of the Dominion is a liberal one. Actual settlers obtain homesteads of 160 acres free and they have the privilege of pre-empting an additional 160 acres which can be bought at a reasonable price and paid by instalments. Churches and schools abound in the Province, and we may now be said to be past the pioneer stage of our existence, and to have entered on\nthe enjoyment of the amenities and comforts of civilization. The accessibility of Manitoba is also a strong argument in its favour. Seven or eight days crossing the Atlantic, and 55 hours from Montreal or New York to Winnipeg is all the time it now takes to get there, and if you will compare this with the time it takes to go out to Africa, Australia, or New Zealand, you will find the result greatly in favour of Manitoba, to say nothing about the many other points in its favour. I am glad to see that emigration has been engaging the attention of the Imperial Government for some time past, and I hope the result will be the adoption of a liberal and practical policy, which will have the effect of relieving you and helping us, by sending to us all your surplus population of the kinds desired.\n\nNow, Mr Chairman, a few words in closing. Since my return to this country I have been much struck with a habit which appears to be very common amongst the people, namely, that of applying the term America to Canada, as well as to the United States, as if the names were synonymous, and I have further been impressed with the lack of correct information, which prevails here about Canada. Now, in Canada and in the United States no distinctions are so well marked as those which indicate the two countries, and there are many and wide differences of a geographical, political, and social kind between the two countries, which find a sort of symbolic representation in their respective names. The terms Canada and Canadians are applied exclusively to Canada and its residents, whilst the term America and Americans are used only in speaking of the United States and its people. The people of both countries scrupulously use the proper names when speaking of each other, and they rather resent any misapplication of the terms, such is the depth and complexion of national feeling on both sides, whilst there is perfect amity between them, except perhaps on the Fisheries question.\n\nThe two countries are in truth twin giants, both unconscious of their strength. They are not mere countries, they are continents with undeveloped, and even undiscerned national possibilities. The one has had a great start as compared with the other, and the United States today has a population of about sixty millions, whilst Canada has only a population of about six millions. But we must not measure those countries or estimate their future greatness by their present population but by their natural resources, and by their capabilities of sustaining the millions of people who are yet destined to be born in them, or to emigrate to them, and a glance at the map of North America will show you that Canada which is bounded, speaking roughly, on the South by the St Lawrence, the Great Lakes, and further West by the forty-ninth Parallel of North Latitude contains nearly as large an area as the United States. The exact area is 3,470,000 square miles, or only one fifth less than the whole of Europe. It possesses immense resources in its fisheries on the Atlantic and Pacific coasts—in its forests in Quebec, Ontario, and British Columbia—in its minerals north and west of Lake Superior and in the Rocky Mountains, which are exhaustless and are only\nnow being developed—in its water powers which afford unequalled facilities for manufactures of all kinds, and above all, in its enormous extent of rich farming and grazing lands, especially in Manitoba and the North West Territories, which have been appropriately named Central Canada. In Manitoba, standing on the eastern confines of the fertile belt, we can in a figurative sense see an immense tract of country, extending from the Red River on the one hand to the Rocky Mountains and to the fertile valleys of the Peace River on the other—a tract of country which contains millions of acres suitable for farming and grazing purposes, and which is sufficient to afford homes, independence and comfort to the surplus population of Europe for centuries to come. Add to these resources the thousands of miles of navigable lakes and rivers, which afford commodious and inexpensive outlets and inlets for the exports and imports of the country, and our great and ever-extending railway systems and you cannot fail to see that Canada is destined to become a mighty nation, and a rival to the United States, which is already the mightiest Republic the world has ever seen. I believe Canada to be the fairest and freest land on earth, and I say this after a residence there of nearly a quarter of a century. She is a land of promise to the best and foremost races of Europe, as well as an asylum for all the poor, oppressed and down-trodden children of men, for she has room on her bosom for all. Her educational, moral, and social institutions are instinct with the truest principles of civil and religious liberty—and her people are characterised by a degree of loyalty and warm-heartedness which would do honour to any country in the world, and my advice to those who are thinking of emigrating is to consider the advantages offered to them and to their children before deciding to go to any other country; in short, in the lineaments of this youngest and fairest of the nations of the world, you can, as in those of Hercules slumbering in his cradle, discern the lines of empire written on her infant face. In this country you are cramped by want of space—every profession and avocation is full—your circumstances not only require but they demand new spheres for your enterprising youth, and for those who are compelled to emigrate. We stand on the threshold of a new land of promise, which, as I have already said, forms the fairest portion of the New World, a land on which millions of our race are yet destined to act out the great drama of life, and which is to witness many new and triumphal marches in literature, science, and art, and in other forms of national development, and we extend to you a cordial invitation to send us your spare sons and daughters, to whom we shall give a warm welcome, and who will become partakers with us in all the benefits arising from the great and glorious heritage which we possess in the new world.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30700.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 26882, "total-output-tokens": 6613, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2747, 3], [2747, 3918, 4], [3918, 4078, 5], [4078, 4078, 6], [4078, 6435, 7], [6435, 9555, 8], [9555, 12898, 9], [12898, 16162, 10], [16162, 19412, 11], [19412, 22484, 12], [22484, 25718, 13], [25718, 28658, 14], [28658, 28658, 15], [28658, 28658, 16]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, true]}}]