[{"id": "1c953cfe9c3fb01139af6062fcd308cc1e690210", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [x] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Additional comments:/\n\nL'institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Pages de couleur\n- [ ] Pages endommagées\n- [ ] Pages restaurées et/ou pelliculées\n- [x] Pages décolorées, tachetées ou piquées\n- [ ] Pages détachées\n- [x] Transparence\n- [ ] Qualité inégale de l'impression\n- [ ] Comprend du matériel supplémentaire\n- [ ] Seule édition disponible\n- [ ] Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —— (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nPETITIONS IN OPPOSITION TO BILL RELATING TO THE NORTHERN RAILWAY OF CANADA.\nCOPIES OF PETITIONS\n\nPRESENTED TO\n\nHis Excellency the Most Noble John Douglas Sutherland, Marquis of Lorne, Kt. G. C. M. G., Governor General of Canada.\n\nTo the Honorable The Senate of the Dominion of Canada, in Parliament assembled.\n\nTo the Honorable The House of Commons of the Dominion of Canada, in Parliament assembled.\n\nPRAYING THAT THE BILL RELATING TO THE NORTHERN RAILWAY OF CANADA MAY BE REJECTED.\n\nBELL & Co., Printers, 13 Adelaide St. East, Toronto.\nI.—Petition of the Bondholders of the Northern Railway Company of Canada.\n\nTo the HONORABLE THE HOUSE OF COMMONS of the DOMINION OF CANADA in PARLIAMENT ASSEMBLED.\n\nThe Petition of the undersigned Bondholders of the Northern Railway Company of Canada.\n\nHUMBLY SHEWETH\n\nThat your Petitioners have observed with much concern a notice in the \"Canada Gazette\" that application will be made to the Dominion Parliament to introduce a Bill to amend the Act respecting the Northern Railway of Canada, passed in the Session of 1877, so as to enable the private Shareholders of the said Company to elect from amongst themselves three Directors on the Board in the place of one, as now provided by Section Twelve of the said Act.\nYour Petitioners would humbly represent that the Capital required to reorganize and keep open the Northern Railway when it was about being closed in 1859, was provided by means of the issue of Bonds, the Share Capital being then considered as nearly worthless, and the owners thereof declining to make the further advances necessary to reinstate the concern.\n\nThat, as an inducement to, and condition of, raising the required Capital, it was provided that the holders of the Bonds should have a power and control in proportion to the amount of their subscriptions, the right being reserved to the Corporations of Toronto and Simcoe, who had subscribed stock, to be represented each by a Director.\n\nThat afterwards, when further additional Capital was required to be raised, the same right of representation was guaranteed to the Bondholders, and that right was throughout retained as an essential condition of the subscriptions.\n\nThat finally, by the Act of 1877, which authorized the issue of £850,000 of First Mortgage Bonds, partly to pay off the Government lien and partly to meet other pressing demands on the Company, it was expressly settled with the concurrence of all parties interested, and was embodied in the Act (Section Twelve), \"that the private Shareholders in the Company should no longer be entitled to vote with the Bondholders at the election of Directors, but might thereafter, by their exclusive vote, elect from amongst themselves one out of the ten Directors then chosen by the joint vote\" of themselves and the Bondholders, and the Bondholders should elect the other nine by their exclusive votes; the two Corporations of Toronto and Simcoe continuing nevertheless to nominate each one Director as theretofore so long as such Corporations continue to be Shareholders in the Company.\n\nThat on the faith of the foregoing provisions, and the various Acts of Parliament embodying the like conditions, your Petitioners have purchased, acquired, and now own Bonds of the Northern Railway Company of different descriptions, especially those issued under the Act of 1877.\n\nAnd that they would regard it as a violation of a most important and essential guarantee if the constitution of the Board\nwere to be in any way altered, or the conditions of the Act of 1877 departed from.\n\nYour Petitioners would further represent that in order to extend and improve the Railway, and give the additional facilities to the localities through which it runs, large advances have been made in England, and they are aware that the creditors, in lending their money, relied on the control which the Bondholders through their Directors might exercise over the administration of the Company's affairs.\n\nThat although they claimed to retain the power of administration to which the faith of the Canadian Parliament is pledged, your Petitioners have always been solicitous that the affairs of the Company should be managed so as to meet the legitimate requirements and convenience of the public in Canada, and as a proof of this they can point to the names of gentlemen of the highest standing as to business capacity and position in Toronto who have from time to time been selected as Members of the Board, and to the fact that no complaints have been made against the manner in which the public interest and convenience have been served in Canada.\n\nYour Petitioners would further point to the accounts of past years and to the financial position of the Company to show that the parties chiefly interested in the Railway are the Bondholders. The bonded debt of the Company amounts to £1,233,90c beyond its floating engagements, while the private share capital (not including that of the Municipalities, amounting to about £78,000, which is specially represented), is only about £85,000.\n\nThe demand now put forward by the private Shareholders is in direct violation of the understanding arrived at during the Session of 1877 (which was embodied in the aforesaid Act.) And your Petitioners cannot for a moment believe that it will be entertained by Parliament.\n\nYour Petitioners would finally beg to call attention to the fact that a considerable part of the money raised under the Act of 1877 was received by the Government in liquidation of its claims as stated in that Act, and that many of your\nPetitioners subscribed this money on the faith that the conditions of the Act as to representation would be adhered to.\n\nYour Petitioners therefore humbly pray that your Honorable House will be pleased to reject any Bill which may be introduced in accordance with the notice above referred to.\n\nAnd your Petitioners will ever pray, &c.\n\nW. H. SMITH.\nHY. MATHER JACKSON.\nWILLIAM LETHBRIDGE.\nWILLIAM FORD.\nJAMES CAPEL & CO.\nJOHN LAWSON.\nSYDNEY LAURENCE.\nLAURENCE, SONS & GARDNER.\nMARSHALL, PAINE & CO.\nJOHN MORNHAM.\nARBUTHNOT, LATHAM & CO.\nFRED. W. BISCHOFF.\nFRED. J. UNDERWOOD.\nF. J. CUTBILL.\nWALTER CUTBILL.\n\nAnd others, together representing a holding of £337,000 stg. in bonds of the Northern Railway.\n2.—Petition of the London Committee of Directors of the Northern Railway Company of Canada.\n\nTo the HONORABLE THE HOUSE OF COMMONS of the DOMINION OF CANADA in PARLIAMENT ASSEMBLED.\n\nThe Petition of the LONDON COMMITTEE OF DIRECTORS of the NORTHERN RAILWAY COMPANY, OF CANADA.\n\nHUMBLY SHEWETH\n\nThat your Petitioners have observed a notice in the \"Canada Gazette,\" that application will be made to the Parliament of Canada at its next session for a Bill to Amend the Northern Railway Company Act, 1877, so as to enable the private shareholders of the said Company to elect from amongst themselves Three Directors on the Board in the place of one, as now provided by Section Twelve of the said Act.\n\nYour Petitioners would refer to the Acts stated in the Schedule to this Petition, to shew that the representation of the Bondholders was an essential condition on raising the necessary capital for the re-organization of the Company in 1859. The Government of Canada and the Shareholders at that time invited subscriptions of new capital to make the necessary outlay to work and improve the road, and from time to time as further capital was required the like condition of adequate representation of the Bondholders on the Board has been adhered to and sanctioned by Parliament.\n\nAt the same time your Petitioners would represent that it has always been their earnest and sincere desire to meet the legitimate requirements of the district through which the road runs, to work it in harmony with Canadian interests, and also to construct new branches to meet the growing wants of the district.\nTo that end they have at all times sought to obtain as representatives on the Board in Canada gentlemen who would give effect to this policy.\n\nYour Petitioners further represent, that in order to carry out these objects, they have from time to time had to obtain large advances of money, and also to issue loans to the English public, and they are aware that the representation of the Bondholders, as defined by Parliament, was at all times regarded as a most important condition by subscribers and creditors, and your Petitioners especially point out that under the Act of 1877 it was after much discussion settled that the private Shareholders should have the right to elect one Representative on the Board from their own number, and no more, the City of Toronto, and the County of Simcoe, continuing to be represented as before.\n\nYour Petitioners further represent that the bonded and other debt of the Company amounts in round figures to about £1,320,000, while the private Shareholders' amount to about £163,000.\n\nThat the proposal now made that the private Shareholders should elect three Directors on the Board would altogether violate the equilibrium as regards the Bondholders' representation.\n\nThat while your Petitioners would refer to the condition of the Company to show that the Shareholders have more than an ample representation for any present or prospective value which can attach to the Share Capital, they cannot too strongly represent that the change now proposed would be regarded by your Petitioners, and by the Subscribers to the different loans, and by the Creditors of the Company in England, as a distinct violation of the condition on which their money was obtained, and they believe it would in every way have a most injurious effect as destroying confidence in the efficacy of safeguards deliberately provided by Parliament.\n\nYour Petitioners therefore humbly pray that your Honorable House will be pleased to reject any Bill which may be introduced in accordance with the notice above referred to.\n\nAnd your Petitioners will ever pray, &c.\nTHE SCHEDULE HEREBEFORE REFERRED TO.\n\nACTS OF THE LEGISLATURE OF THE LATE PROVINCE OF CANADA.\n\n12th VICTORIA, CHAPTER 196.—Incorporating the Toronto, Simcoe, and Huron Railroad Union Company.\n\n13th and 14th VICTORIA, CHAPTER 131.—Changing name to \"Ontario, Simcoe, and Huron Railroad Union Company, and extending limits of authorized Railway.\"\n\n13th and 14th VICTORIA, CHAPTER 81.—Empowering Municipal Corporations through whose jurisdiction the Railway might pass, to assist in its construction and to appoint Directors in case they should so assist.\n\n16th VICTORIA, CHAPTER 51.—Empowering the Company to construct a Harbour on Lake Huron.\n\n16th VICTORIA, CHAPTER 244.—Extending the limits of the authorized Railway, and empowering the Company to construct other Harbours on Lake Huron.\n\n19th and 20th VICTORIA, CHAPTER 73.—Empowering the Company to have, and employ Steamers on Lake Simcoe, &c.\n\n20th VICTORIA, CHAPTER 143.—Containing various other provisions relating to the said Company.\n\n22nd VICTORIA, CHAPTER 117.—Changing the name of the Company to the Northern Railway of Canada, and containing various other provisions.\n\n22nd VICTORIA, CHAPTER 89.—Vesting the Railway property and Corporate rights of the Company in the Crown, for the purposes therein mentioned.\n\n12th MAY, 1859.—Order in Council re-vesting in the Company the said Railway property and rights on the conditions therein mentioned.\n\n23rd VICTORIA, CHAPTER 105.—Declaring that the Company had up to that time complied with all the requirements of the last-mentioned Act, and of the said Order in Council, and confirming the said Order in Council.\n27th VICTORIA, CHAPTER 55.—Making provision for the construction of a Branch from the Railway of the Company to the town of Barrie, and enacting that such Branch when constructed (which it has since been) should form part of the Railway of the Company.\n\nACTS OF THE PARLIAMENT OF CANADA.\n\n31st VICTORIA, CHAPTER 86.—Declaring that the Northern Railway of Canada is a work for the general advantage of Canada, and making various other provisions concerning the Company.\n\n38th VICTORIA, CHAPTER 65.—Rearranging the Capital of the Company, consolidating the enactments relating to the Company, enabling the Company to change the gauge of the Railway, and to amalgamate with the Northern Extension Railways Company, and for other purposes.\n\n40th VICTORIA, CHAPTER 57.—Authorizing the issue of Securities of the Company, and making provision for the election of Directors.\n\nHENRY M. JACKSON,\nChairman of London Committee of Directors.\n3.—Petition of Proprietors of Northern Railway Company of Canada, in Annual General Meeting Assembled.\n\nTo the HONORABLE THE HOUSE OF COMMONS of the DOMINION OF CANADA in PARLIAMENT ASSEMBLED.\n\nThe Petition of the NORTHERN RAILWAY COMPANY OF CANADA in Annual General Meeting Assembled.\n\nHUMBLY SHEWETH\n\nThat it has come to the knowledge of your petitioners that notice has been given in the \"Canada Gazette\" of an application to the Parliament of Canada, for an Act to Amend the Acts relating to this Company, and to authorize and provide for a change in the composition of its Directorate, by securing to the Shareholders a representation upon the Board of five Directors instead of three, as now established by law.\n\nYour petitioners now humbly submit:\n\n1. That the petition for the Bill has been presented without the knowledge or consent of the Company, and without any measure having been taken to ascertain the opinion of the Company thereupon.\n\n2. That the existing capital of the Company (almost exclusively of foreign subscription) has been raised under the pledge and security of successive enactments of the Parliament of Canada, especially providing for the exercise of the franchise by holders of the Company's Debentures, and that in the absence of the security of such franchise the said capital could not have been raised.\n\n3. That by Act 23 Vic., chap. 105, sec. 135, May 12, 1859, authority was given to raise £250,000 sterling, under the special provision \"that\" all holders of the first and second preference\nbonds then authorized should be entitled to vote in the same proportion as the holders of the Stock.\n\n4. That by Act 31 Vic., chap. 86, sec. 10, 22nd May, 1868, it was again enacted that all holders of an issue of third preference bonds thereby authorized, to the extent of £150,000 sterling, should be invested with a similar right to vote at all meetings of the Company, including the election of Directors.\n\n5. That by Act 40 Vic., chap. 57, sec. 3, 28th April, 1877, it was again enacted that in regard to an issue of £850,000 sterling of five per cent. first mortgage bonds, all the holders thereof should be entitled to vote as aforesaid, excepting that in addition to two Directors representing Municipal Stock holdings, one Director should be elected by a separate vote of the Shareholders from amongst themselves.\n\n6. That as a matter of fact the seats at the Canadian Board, which are filled by the vote of the Bondholders, are at present, and have been for very many years, occupied exclusively by Shareholders qualified to serve as Directors, as Stockholders, and not as Bondholders.\n\nYour petitioners therefore humbly submit, that the Parliament of Canada has been pledged by repeated enactments since 1859 to secure to the investors of all the capital of the Company since raised in England a stated and definite participation in the organization and administration of the affairs of the Company, and your petitioners humbly protest that the Bill now presented to your Honorable House would be repugnant to the spirit and letter of past enactments, subversive of the rights thus created, and contrary to the just principles upon which the Parliament of Canada has heretofore held sacred the pledges of its laws.\n\nAnd your petitioners therefore humbly pray that the said Bill may not be passed into law, but may be dismissed.\n\nAnd your petitioners, as in duty bound, will ever pray.\n\n(Signed) FRANK SMITH,\nPresident.\n\n(Signed) FRED. CUMBERLAND,\nManaging Director.\n\n(Signed) WALTER TOWNSEND,\nSecretary.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_25156.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 21, "total-input-tokens": 35228, "total-output-tokens": 5287, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1801, 3], [1801, 4242, 4], [4242, 4242, 5], [4242, 4318, 6], [4318, 4318, 7], [4318, 4780, 8], [4780, 4780, 9], [4780, 5499, 10], [5499, 7711, 11], [7711, 9794, 12], [9794, 10498, 13], [10498, 12088, 14], [12088, 14159, 15], [14159, 15780, 16], [15780, 16710, 17], [16710, 18239, 18], [18239, 20254, 19], [20254, 20254, 20], [20254, 20254, 21]], "primary_language": ["en", "en", "en", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]