[{"id": "f73f68e5dd0c6a11c4fae6405b2ff3f7478a0896", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\n☐ Couverture de couleur\n\n☐ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pailliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\n☐ Encre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\n☐ La reliure serrée peut causer de l'ombre ou de la distortion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\nAdditional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X\n\n12X 16X 20X\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/ Pages de couleur\n- [x] Pages damaged/ Pages endommagées\n- [x] Pages restored and/or laminated/ Pages restaurées et/ou pelliculées\n- [x] Pages discoloured, stained or foxed/ Pages décolorées, tachetées ou piquées\n- [ ] Pages detached/ Pages détachées\n- [x] Showthrough/ Transparence\n- [ ] Quality of print varies/ Qualité inégale de l’impression\n- [ ] Includes supplementary material/ Comprend du matériel supplémentaire\n- [ ] Only edition available/ Seule édition disponible\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/ Les pages totalement ou partiellement obscurcies par un feuillet d’errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\n\nPage 9 has been restored.\n\nCheck box checked below/ Indication indiqué ci-dessous.\n\n| 18X | 22X | 26X | 30X |\n|-----|-----|-----|-----|\n|     | ✔   |     |     |\n\n| 20X | 24X | 28X | 32X |\n|-----|-----|-----|-----|\n|     |     |     |     |\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n|   |   |   |\n|---|---|---|\n| 1 | 2 | 3 |\n\n|   |   |\n|---|---|\n| 1 | 2 |\n| 4 | 5 |\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE QU'APPELLE, LONG LAKE AND SASKATCHEWAN Railroad & Steamboat Co., HAS 1,000,000 ACRES Of Odd Numbered Sections in the Old Settled Districts between REGINA. The Capital City OF THE CANADIAN NORTHWEST. AND PRINCE ALBERT There are still a number of Even Numbered Sections held open by the Dominion Government. AS FREE HOMESTEADS TO ACTUAL SETTLERS. The Odd Sections in these old settled Districts are for Sale without cultivation or residence conditions, at from $2.50 per acre upwards. One-tenth cash and the balance in nine annual payments with interest at 6%. Osler, Hammond & Nanton, General Agents, 381 MAIN STREET, WINNIPEG.\nTHE QU'APPHELLE, LONG LAKE AND SASKATCHEWAN Railroad & Steamboat Co., HAS 1,000,000 ACRES Carefully Selected Land BETWEEN REGINA The Capital City —OF THE— CANADIAN NORTHWEST —AND— PRINCE ALBERT ON THE NORTH SASKATCHEWAN. FOR SALE AT FROM $2.50 PER ACRE UPWARDS. One-Tenth Cash; Balance in nine Annual Payments with Interest at 6 per cent. A SPLENDID INVESTMENT OSLER, HAMMOND & NANTON General Agents, 381 MAIN STREET, WINNIPEG, MAN.\nSurface.\n\nGently undulating prairies; rolling open prairies with lakes and ponds; rolling prairie interspersed with bluffs of poplar; high rolling country, portions of which is heavily timbered with spruce, jack pine, etc.\n\nClimate.\n\nSimilar to that of Manitoba, summer days long and bright, lengthening as you go north. The settlers on the North Saskatchewan enjoy 18 hours sunshine in the long days in summer. Winter days are cold, clear and calm. Tornadoes and Cyclones unknown.\n\nSoil.\n\nClay loam to sand loam with a rich clay subsoil to sand, runs in streaks. As CULTIVATION GOES NORTH, it has been found that the rich sandy loams, return quicker and better crops than the heavy clays, grain ripens earlier with equally as good a berry, and does not throw such an immense growth of straw, as the heavy clays, and it is much easier to work.\n\nFUEL AND BUILDING MATERIAL.\n\nThere is practically none on the plains. There are some scrubby trees along rivers, streams and coulees. To the north there are bluffs of poplar, ample for fire wood, fence rails, etc. Further north, spruce and jack pine, and the great forests along the North Saskatchewan are reached. Fire wood is worth about $1.50 per cord. The large Lumber Mills on the North Saskatchewan supply building material as cheaply as in the most favoured parts of Manitoba.\n\nThere are miles of coal outcrop on the North Saskatchewan.\n\nWater.\n\nThe Country is well watered; every one cannot locate on the banks of a runnlog stream, but any one can get a plentiful supply of good water by digging a few feet for it.\n\nWild Fruits,\n\nsuch as Red Plums, Cherries, Raspberries, Strawberries, Gooseberries, Red and Black Currants, Cranberries, Saskatoons grow wild in the bluffs and sheltered valleys on the banks of the Rivers, Streams and Coulees.\n\nFish.\n\nWhite and Jack Fish are to be found in Long Lake, Qu'Appelle and both Saskatchewan, and Trout in spring creeks running into these rivers.\n\nGame.\n\nStarting on the plains in the south and heading north, the following birds and animals will be found: Prairie Chicken and Partridge, Duck, Fox, Badger, Cayotes, Mink, Muskrat, Beaver, Otter, Martix, Fisher, Rabbit, Bear, Deer, Elk, Moose.\nNo. 1 HARD.\n\nPrince Albert Wheat.\n\nWith a view of letting intending settlers know what their prospects are for obtaining good crops of wheat in the Prince Albert District, we draw their attention to the following facts:\n\nSamples of wheat grown in the above district last year were sent by the Commercial to different Milling Publications and Grain Merchants.\n\nRead Carefully\n\nsome of their comments upon the samples furnished, especially those of\n\nThe Miller, London, England, to which journal three bags were sent. The Miller comments as follows:\n\n\"We are greatly obliged for the splendid samples of wheat which have reached us. The grain, which is in very fine condition, is a magnificent sample of Northwestern wheat, and was shown by the chondrometer to weigh 68 pounds to the bushel. A sample has been exhibited on Mark Lane Corn Exchange, where it was pronounced by competent judges to be fully equal to the choicest Duluth wheat, and was valued—taking a mean quotation—at 41 shillings per quarter. We shall be pleased to forward small samples of the wheat to any millers who will notify their wish to receive them.\"\n\nE. Seckel & Co., grain commission merchants, Chicago, write: \"Your favor received, and also sample of wheat, for which accept our thanks. We exhibited same on 'change and it attracted quite a good deal of attention. We must say that it is the finest sample of spring wheat we have laid our eyes on. One of our millers here would like to know the value of this wheat in your market, and the rate of freight to Chicago, if you can kindly give us the same.\"\n\nA. C. Buell & Co., a leading Chicago grain firm write:\n\n\"I have your letter, accompanied by a sample of splendid wheat. A country that can raise such wheat as that sample will be sought after by many millers, and the product of Minnesota and Dakota is fast deteriorating.\"\n\nFrom the publisher of the Miller's Review, Philadelphia:\n\n\"With reference to the sample of wheat grown in the Prince Albert district, my people at the office report it to be something entirely out of their experience, and they know pretty well what fine wheat and large crops of it are. I desire to show this wheat on our Exchange, and I will report to you the opinions of some of its members. It seems to me the wheat matures in a remarkably short time from the date of sowing. I will be pleased to write you what our dealers have to say about it.\" Yours very truly, H. L. Everell.\n\nMiller's Review, Philadelphia:\n\n\"Among the samples displayed by Hancock & Co., of the Philadelphia Commercial Exchange, recently, was a small one from the territory of Saskatchewan, nearly three hundred and fifty miles north of the boundary line between the United States and the British possessions. It excited considerable attention, partly from the fact that the samples on the tables of Hancock & Co. usually are of interest to buyers, and partly, too, from the fact that the grain in the little blue box was of an exceptionally fine type of red spring wheat. The letter appended gives the history of our getting it, and as we did not wish to keep the sight of our beautiful stock from the appreciative gaze of millers and commercial men, we submitted it to Major Hancock, and through his offices it was introduced to the Chamber and to the notice of the members on 'change. The Major pronounced the wheat as handsome as any he had ever seen, and he was sorry that the machinations of freight combines and tariffs so effectually kept such stock away from millers and grain men in this section and prohibited any substantial investment in this fine product of the far North.\"\nTHE QU'APPELLE, LONG LAKE\nAND\nSaskatchewan Railroad & Steamboat Co'y\n\nWas opened for Traffic in the Fall of 1890.\n\nThe Commercial, (the financial authority of Manitoba and the Northwest) with its usual enterprising foresight, sent a special agent into the district served by the new railway for the purpose of looking up its resources, etc.\n\nWe take the liberty of copying a few of the statements as published by The Commercial from men known to us personally who have been residents in the district for a number of years, justly concluding that statements made by actual residents of undoubted integrity will carry more weight than anything else:\n\nWM. MILLER came from Huron County, Ont., in 1870, and located near Rockwood, near Winnipeg, Manitoba, where he remained for two years. Moved to the Saskatchewan in 1873 and took up land quite close to where Prince Albert now stands. Likes the Saskatchewan country better than Ontario or Manitoba. Has farmed seventeen seasons, and states that his wheat will average about 40 bushels per acre eight years out of the seventeen. The remaining nine years he estimates that his wheat crop would average one year with another 25 bushels per acre. The poorest wheat crop he has had was in 1889, owing to the drought, when the yield was 18 to 20 bushels per acre. This was the first year he had suffered from drought to any extent. The crops in 1890 were later with him than he ever had before, and he had about eight acres of wheat under by November, balance of his crop escaped early injury. Mr. Miller has kept a diary since he came to the country, so that his statements are not made from memory. He states that his own crop has varied from 40 to 80 bushels per acre in different years except 1889, when it was about 20 bushels per acre. Horses, cattle, sheep and hogs have all done well with him. As the oldest Canadian settler in the district, and one who has farmed continuously since he arrived, Mr. Miller's testimony is of special interest.\n\nCHAS. MAIN, for sixteen years a resident, has farmed for ten years on quite a large scale. His property is within the present corporation limits of the town of Prince Albert. He has never had what could be called a failure in wheat. In 1889 the crop was light from drought, but could not be called a failure. Late wheat had been affected with frost in some years, but this was usually owing to careless farming. There has always been abundance of hay, even during the driest years, and vast quantities of the natural prairie hay goes to waste annually.\n\nJAMES McARTHUR, banker, Prince Albert, is interested in a large sheep ranche. He says it costs less to keep sheep over the winter than during the summer. The region is a great hay country, and hay can be put up for the winter at a cost of about $1 per ton. Sheep can be kept through the winter at a cost of about 25 cents per head, when handled on a large scale. They are free from disease. Hay has never been scarce. The growth of the natural prairie grass is luxuriant. Water is readily obtained everywhere. Where there is not good surface or running water, it can be obtained in wells at a depth of 10 to 14 feet. Mr. McArthur also believes the country is remarkably well adapted to raising horses, and grain and root crops are phenomenally successful.\n\nFREE HOMESTEADS.\n\nThere are free homesteads in this district, and we sell our lands at from $2.50 per acre upwards. One-tenth cash; balance in nine annual payments with interest at 8 per cent.\nHow Long is it Going to Take\n\nthe pioneers of Manitoba and the Northwest Territories to convince Ontario and Eastern province people that we enjoy a better climate all the year round than they do. That the conditions of life for the poor man are better here than they are east.\n\nHere are statements from two well-known gentlemen.\n\nJ. M. Campbell moved to the North Saskatchewan country in 1874. He has a ranch at Stony Creek, 60 miles southeast of Prince Albert. He has farmed about 100 acres, and has never had a crop failure. His wheat, one year with another, has averaged 25 bushels per acre or over, while oats have yielded about 50 to 60 bushels per acre on an average for a number of years back. Mr. Campbell, like many others, has given more attention to stock, as the isolated nature of the settlement previous to the advent of the railway, rendered the market for grain rather small. He thinks the country a remarkably favorable one for raising horses. His horses winter out, and \"rustle\" their own living. His horses are of the native breed, crossed with Canadian stallions. They average 1200 pounds weight. He has taken first prize with horses which were out all winter and were never fed a straw. Cattle require feeding in the winter, though young stock will do without stabling, if fed. Sheep, he says, do with an open shed for shelter, covered overhead. They require feeding for about two months. Cattle need feeding about three months during the winter, on an average. Hogs have paid him well. In this district Mr. Campbell says the settlers are all doing well, despite their distance from a railway. Most of them started poor. They are loaded with stock now, which they sell for Indian and mounted police requirements, and a market for their other products is found in the same way to some extent.\n\nJ. Knowles, banker, Prince Albert, is also interested in a large stock and farming enterprise, which has been carried on four years. On the ranch are 100 horses and fifty head of cattle. About 100 acres of land were cropped in 1890. Wheat yielded 20½ bushels per acre, and is of fine quality, though a portion which was late was injured by frost. The horses are mostly wintered out, without any stabling. About 77 head will be wintered out this winter. They do better in this way than when kept up and stabled, and come out fat and healthy in the spring. Mr. Knowles thinks cattle require some kind of stabling. For young stock, straw thrown up over a shed will be sufficient shelter. Cattle have been known to live out all winter on what they could pick up, but this is not the proper way of keeping them. Stock of all kinds are very healthy, and Mr. Knowles has never lost a hoof by disease.\n\nMr. Campbell says his horses winter out and \"rustle\" their own living. He takes prizes with them, too. Mr. Knowles says his do better wintered out than stabled. As a matter of fact the great bulk of the cattle in Manitoba and Assiniboia are not stabled at all; fed nothing but hay during the winter, and the steers are turned off for beef in the spring. The time will come when this country will be rated at its true merit. But land will not be selling then at from $2.50 per acre upwards, one-tenth cash and the balance in nine annual payments, with interest at 6 per cent.\n\nTo young men, who have some \"sand,\" we say, get here, if you have to walk.\nTo an Old Resident of this Country\n\na certificate of character for Manitoba or the Northwest Territories would be considered superfluous. But our country wants men. We have to import them from the east. We therefore give certificates from three more of our people, as we are determined to convince Fathers in the east that this is the place for their children.\n\nJ. A. Macdonald, a native of Manitoba, settled on the North Saskatchewan in 1866, and his property is now within the corporation limits of Prince Albert. He was the first settler to take up land and remain on it. He tells the same story of successful operations in farming, and never had what could be called a failure of his crop. Since 1884 he has done little in the line of growing grain, having gone principally into stock. Hay is secured in abundance for winter feeding, and can be put up at a cost of about $1 per ton. This is the natural prairie hay which grows without any cultivation, and is always a heavy crop. Cattle are very healthy, they will do on straw, but with good care will make good beef in the spring on hay alone. Mr. Macdonald estimates that it costs from $10 to $15 to raise a three year old steer, which is then worth $30 to $40. There are no losses in stock to provide against. Hogs and sheep pay well.\n\nIsaias McCall, for ten years a resident, has farmed six miles from Prince Albert and raised stock, giving his attention mainly to the latter. He has found the seasons favorable and has always had a good crop of coarse grain, having given little attention to wheat. The season of 1890 he had a good volunteer crop of oats and barley. He had intended summer fallowing the land and did not plow it in the fall, but a crop came up in the spring from seed that had fallen from the previous crop. This looked so well that it was allowed to grow, and produced a crop of 25 to 30 bushels per acre. Mr. McCall has some imported Durham cattle and they have done well with him.\n\nS. J. Donaldson, who came to the country in 1876, and served in the Mounted Police force, has farmed for six years. He has grown feed grains principally for his livery business in Prince Albert. He grew some flax one year as an experiment, and it produced an immense crop of seed. He threshed 2000 bushels of oats off 30 acres in 1888, and in 1890 had the same quantity from an acre or two less of land. The crop was estimated by counting the number of sacks. In 1889, the dry year, he only had 400 bushels off the same acreage.—Commercial.\n\nThree Years from Now\n\nthere will not be a good quarter section open for homestead within twenty miles of this Railway.\n\nTake time by the fore-lock young men, if you want a homestead.\n\n(7)\nHomestead Regulations.\n\nAll even numbered sections excepting 8 and 26 are open for homestead entry (160 acres) by any person sole head of a family, or any male over age of 18 years.\n\nENTRY.\n\nEntry may be made personally at the local land office in which the land to be taken is situated or if the homesteader desires he may, on application to the Minister of Interior, Ottawa, or to the Commissioner of Dominion Lands, Winnipeg, receive authority for some one near the local office to make the entry for him. A fee of $10 is charged.\n\nDUTIES.\n\nUnder the present law homestead duties may be performed in three ways, to be decided on making entry:\n\n1. Three years' cultivation and residence, during which period the settler may not be absent for more than six months in any one year without forfeiting the entry.\n\n2. Residence for three years within two miles of the homestead and afterwards actual residence for 3 months in a habitable house erected upon it prior to application for the patent. Ten acres must be broken the first year after entry, 15 acres additional in the second and 15 in the third year; 10 acres to be in crop the second year and 25 acres the third year.\n\n3. A settler may reside anywhere for the first two years in the first year breaking 5, in the second cropping said 5 and breaking additional 10, also building a habitable house. The entry is forfeited if residence is not commenced at the expiration of 2 years from date of entry. Thereafter the settler must reside upon and cultivate his homestead for at least six months in each year for three years.\n\nDOMINION LAND OFFICES.\n\n(FIGURES INCLUSIVE.)\n\nBattleford District—tp 31 to 36, r 7 w 3rd M to 7 w 4th M; t 37 to 38, r 6 w 3rd M. to r 7 w 4th M.; t 39 no'ds, r 1 w 3rd M to 7 w 4th M.—E Brokovski, Battleford.\n\nPrince Albert District—tp 39 nor'arts, r 13 w 2 mer tp 10 w 3 M.—J. McTaggart, Prince Albert.\n\nQu'Appelle District—tp 10 to 23 r 1 to 39 w 2nd.—W. H. Stevenson, Regina.\n\nTouchwood District—tp 24 to 31, r 1 to 30 w 2; tp 32 to 36, r 1 w 2nd Mer. to r 6 w 3rd Mer.; tp 37, 38, 2nd Mer. to r 5 w 3rd Mer.—Business transacted at Birtle.\n\nSwift Current District—tp 1 to 30, r 1 to 30 w 3rd Mer.; tp 31, r 1 to 6 w, 3rd Mer.—All business transacted at Regina.\n\nSYSTEM OF SURVEY.\n\nTownship Diagram showing the Road Allowance.\n\nA Section contains 640 Acres and forms 1 mile Square.\n\nROADS.—The new system in use in the Territories gives 66 feet round each two sections, 1 and 12, 2 and 11, etc.\nTOWN SITE\n\nowing to the building of the Qu'Appelle and Long Lake Railways, new towns have been established such as Prince Albert, Saskatoon, etc., which are greatly increasing in population and to meet the requirements of new arrivals, the Company have laid out the following Town Sites:\n\nTOWN SITE LAID OUT AT PRINCE ALBERT, DUCK LAKE, SASKATCHEWAN, MONTANA.\n\nAt all of which points good lots are available suitable either for business purposes or residences.\n\nAll the above mentioned Town Sites are now, and will increase in population as more people flow into the Country.\n\nThere is a Good Opening in these Towns for Merchants, and others wishing to invest their capital will find a good rise with the Country.\nOWN SITES.\n\nThe Qu'Appelle and Long Lake Railroad, old and well established towns such as\n\nSaskatoon & Duck Lake\n\npopulation and to meet the demands upon them, and the Company have had,\n\nOWN SITES\n\nLAID OUT AT\n\nALBERT,\n\nDuck Lake,\n\nSASKATOON\n\nMcDOWELL,\n\npoints good lots can be obtained for business purposes or residences.\n\nmentioned Towns are on the rise in population next summer, as Settlers\n\nOpening in these Towns for\n\nwishing to invest Capital to advantage, and\nHOW TO REACH THE\n\nOF THE\n\nQu'Appelle, Long Lake & Saskatchewan Railroad & Steamboat Line\n\nPARTIES FROM THE\n\nAND THE\n\nEASTERN PROVINCES OF CANADA\n\nCan Purchase Return Tickets from any of the Railway Stations in the Eastern Provinces.\n\nPRINCE ALBERT, DUCK LAKE & SASKATOON ON THE\n\nQu'Appelle, Long Lake & Saskatchewan Railroad\n\nAnd get the Benefit of the Special Rates during the Season.\n\nParties from the United States\n\nTickets to Gretna, in Manitoba, and Settlers' Excursion Rates to Prince Albert and Saskatoon.\nREACH THE LANDS\nOF THE\nSong Lake & Saskatchewan\n& Steamboat Company.\n\nTRAINS FROM ONTARIO\nAND THE\nPROVINCES OF THE DOMINION\n\nObtain Tickets from any of the Canadian Pacific Railway Stations in the East direct to\n\nPRINCE ALBERT, DUCK LAKE OR SASKATOON\n\nON THE\nLake & Saskatchewan Railroad\n\nIn benefit of the Settlers' Excursion Rates during the Season.\n\nUnited States can buy Regular Rates in Manitoba, and from that Point get the Rates to Prince Albert, Duck Lake or Saska-\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30703.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 27880, "total-output-tokens": 7138, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1468, 3], [1468, 2823, 4], [2823, 4011, 5], [4011, 5279, 6], [5279, 5910, 7], [5910, 6343, 8], [6343, 8532, 9], [8532, 12149, 10], [12149, 15646, 11], [15646, 19007, 12], [19007, 21698, 13], [21698, 24175, 14], [24175, 24889, 15], [24889, 25358, 16], [25358, 25358, 17], [25358, 25358, 18], [25358, 25358, 19], [25358, 25358, 20], [25358, 25871, 21], [25871, 26345, 22], [26345, 26345, 23], [26345, 26345, 24]], "primary_language": ["None", "en", "en", "en", "en", "fr", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, true, true]}}]