[{"id": "f36dff4075bc4f72b384065f95320e939a4ff34f", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n  Couverture de couleur\n\n- [ ] Covers damaged/\n  Couverture endommagée\n\n- [ ] Covers restored and/or laminated/\n  Couverture restaurée et/ou pelliculée\n\n- [ ] Cover title missing/\n  Le titre de couverture manque\n\n- [ ] Coloured maps/\n  Cartes géographiques en couleur\n\n- [ ] Coloured ink (i.e. other than blue or black)/\n  Encre de couleur (i.e. autre que bleue ou noire)\n\n- [ ] Coloured plates and/or illustrations/\n  Planches et/ou illustrations en couleur\n\n- [ ] Bound with other material/\n  Relié avec d'autres documents\n\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n  La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n  Si peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n- [ ] Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|----------------|-----|-----|-----|-----|-----|-----|\n|                |     |     |     |     |     |     |\n|                |     |     |     |     |     |     |\n\nL'institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/\n  Pages de couleur\n\n- [ ] Pages damaged/\n  Pages endommagées\n\n- [ ] Pages restored and/or laminated/\n  Pages restaurées et/ou pelliculées\n\n- [ ] Pages discoloured, stained or foxed/\n  Pages décolorées, tachetées ou piquées\n\n- [ ] Pages detached/\n  Pages détachées\n\n- [ ] Showthrough/\n  Transparence\n\n- [ ] Quality of print varies/\n  Qualité inégale de l'impression\n\n- [ ] Includes supplementary material/\n  Comprend du matériel supplémentaire\n\n- [ ] Only edition available/\n  Seule édition disponible\n\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n  Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol \\(\\rightarrow\\) (meaning \"CONTINUED\"), or the symbol \\(\\nabla\\) (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole \\(\\rightarrow\\) signifie \"A SUIVRE\", le symbole \\(\\nabla\\) signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nSir CHARLES TUPPER moved the second reading of Bill (No. 63) respecting a certain Treaty between Her Britannic Majesty and the President of the United States. He said: Mr. Speaker, in rising to move the second reading of this bill, I desire to state that I have on several past occasions experienced the kind indulgence of both sides of the House; I should hesitate to undertake, in the present state of my health, bringing forward the very important subject it now becomes my duty to lay before the House. I am glad to know, Sir, that the question of the protection of our fisheries, and of the results that have followed the course that was adopted by the Government and Parliament of Canada, has not been a party question. I am glad to know, Sir, that in approaching the very important subject that I am now submitting to the House, I can rely on the patronage and cooperation of this question by gentlemen on both sides of the House, who are so thoroughly familiar, and who on various occasions and in various capacities have been called on in the past to deal with it. For more than a hundred years this question has been a source of irritation between the Imperial Government of Great Britain, the Government of the United States, and the people and Governments of British North America. So long ago as 1783 a treaty was made between the Government of Great Britain and the Government of the United States at Paris. Article 3 of that treaty provided:\n\n\"It is agreed that the people of the United States shall continue to enjoy, during the term of this agreement, the right of fishing on the banks, and on all the other banks of Newfoundland; also in the Gulf of St. Lawrence, and at all other places in the sea where the inhabitants of both countries used to carry on heretofore to fish; and also, that the inhabitants of the United States shall be allowed the liberty of every kind on such part of the coast of Newfoundland as British fishermen shall use (but not to dry or cure the same on that island), and also on the coasts, bays and creeks of all other of His Britannic Majesty's dominions in America; and that the American fishermen shall have liberty to dry and cure fish in any of the unsettled bays, harbors and creeks of Nova Scotia, Magdalen Islands and Labrador, so long as the same shall remain unsettled; but so soon as the same, or either of them, shall be settled, it shall not be lawful for the said fishermen to land, cure fish or smoke fish thereon, although they may purchase for that purpose with the inhabitants, proprietors or possessors of the ground.\"\n\nNow, I need not say to the House that the concession made to the people of the United States to enjoy in common with British subjects the fisheries of this country, was a treaty of a very extraordinary and abnormal character. I need not remind the House that the Treaty of Ghent, which was made between Great Britain and the United States at the termination of the War of 1812, is found to be entirely silent upon this subject, for the reason that the Government of Great Britain had arrived at the conclusion that it was impossible to permit the continuance of such an unwarranted interference with the rights of the people of British North America as had been enjoyed by the people of the United States under the Treaty of 1783. The Government of Great Britain took the ground that the treaty was not affected by the war. That position, however, was strongly controverted by Her Majesty's Government, and as the representatives of the United States Government had been instructed not to concede on the question of the fisheries, and the Government of Great Britain were equally inexorable on that point, the only course that could be adopted was to give the question the entire go by. It therefore found no place in the Treaty of 1812. The Government of Great Britain, however, acting upon the principle that they would not be bound by a principle which has come to be recognized throughout the world—that a war abrogates all treaties, and especially treaties of that character—asserted their rights in those territorial waters of British North America, and proceeded to seize fishermen of the United\nStates for trespassing in these waters. The result of that course was the Treaty of 1818, in which this question was again considered by the two Governments, and I may call attention to the terms of the principal article of that treaty, so far as the fisheries are concerned:\n\n\"Whereas differences have arisen respecting the liberty claimed by the United States for the inhabitants of their vessels to take and cure fish of every kind, and to have and use the harbors of Newfoundland, and coasts in America, it is agreed between the high contracting parties that the inhabitants of the said United States shall have forever, in common with the subjects of His Britannic Majesty, the liberty to take fish of every kind on that part of the southern coast of Newfoundland which extends from Cape Ray to the Rames Islands, on the western and northern coast of Newfoundland; from the said Cape Ray to the Quiripi Islands, on the shores of the said islands, and also on the coasts, bays, harbors and creeks, from Mount Joli, on the southern coast of Labrador, to and through the Strait of Belleisle, and thence along the north coast of Newfoundland, and also in the exercise of any of the exclusive rights of the Hudson's Bay Company; and that the American fishermen shall also have liberty, forever, to dry and cure fish in any of the harbors or bays of Newfoundland, and on any part of the coast of Newfoundland hereabove described, and of the coast of Labrador; but so soon as the same, or any portion thereof, shall be settled, it shall not be lawful for the said fishermen to dry and cure fish thereon, except as stated without previous permission for such purpose with the inhabitants, proprietors or possessors of the ground; and the United States hereby renounce forever any liberty heretofore enjoyed by them in the exercise thereof, to land, to settle, to reside on or within three marine miles of any of the coasts, bays, creeks or harbors of His Britannic Majesty's dominions in America, not included in the above mentioned limits; and further, that the American fishermen shall be permitted to enter and lay up their vessels for the purpose of shelter and repairing damages therein, or purchasing wood, fish, or provisions, or for no other purpose whatever. But they shall be subject to all restrictions which may be necessary to prevent over-taking, drying, or curing fish therein, or in any other manner whatever abusing the privileges hereby reserved to them.\"\n\nNow, Sir, that treaty which was made between the Government of Great Britain and the Government of the United States, seventy years ago, has been the cause of constantly recurring irritation and difficulty between the two countries; and I need not remind the House that no portions of Her Majesty's dominions have been so vitally and deeply interested in that question as those now known as the Dominion of Canada and the Province of Newfoundland. This treaty is very striking in two particulars. It gives the same territorial advantages, but to a very limited extent only, on certain portions of the coast of Newfoundland and what is now known as Canada, to the Government of the United States, as were given under the Treaty of 1793, and in return—for that unparalleled concession by any Government of one country to another—was secured the formal renunciation, on the part of the Government of the United States, of the liberty for their fishermen to enter any other portion of the jurisdictional waters of what was then known as British North America, except for four specified purposes. Even the privileges enjoyed under those four specified purposes were distinctly declared to be subject to their use in such a manner as in no way to abuse the privileges thus granted. The adoption of this treaty was followed, by the passage of laws on the part of the Imperial Parliament and also of the British North American Provinces for the purpose of giving it effect. Of course, although the treaty distinctly laid down the International law as between the two countries, special legislation was requisite in order to provide a means for carrying that treaty out and for enforcing its provisions on the part of Great Britain and on the part of British North America. The exclusion of the United States fishermen from the fishing grounds of British North America led again to collision and difficulty. Seizures were made. The old difficulties that had existed before the formation of the treaty were again called into activity by the presence of United States fishermen in our waters, and by the measures which were taken, especially by Great Britain, for the purpose of protecting the rights of the inhabitants of British North America. The result of these difficulties was the Reciprocity Treaty of 1854. The firm stand taken by Her Majesty's Government, the firm position taken to uphold the undoubted rights of the subjects in British North America, led to the adoption, in 1854, of what is known as the Reciprocity Treaty, a treaty which for twelve years removed all difficulties in connection with this question. On that occasion there was no attempt to limit, define, or interpret the points that had been raised in the controversy between the two countries, but they received their quietus, and all these difficulties were removed for the time, by the adoption of a policy of giving to the Provinces of British North America and Newfoundland certain commercial privileges by which the trade between this country and the United States was extended.\n\nI may say that I took the opportunity, when delivering my speech on the financial condition of the country a year ago, to draw the attention of the House to the results of that treaty, and will just call the attention of the House again for a moment to a single extract in that speech, in which I referred to the trade results of what is known as the Reciprocity Treaty of 1854. It will be found that the United States, during those twelve years, from 1854 to 1865, exported to British North America home products to the extent of $300,903,370 and foreign products to the extent of $62,379,718, the total exports to British North America being $363,183,083. The imports from the British Provinces into the United States during that period amounted to $267,812,131, showing a balance during the twelve years in favor of the United States of $95,370,952. That is to say, that they sent under the provisions of that treaty into the British North American Provinces, $95,000,000 more than they took from that country. I have often been at a loss to know how any person in the United States, and much less how any person in Canada could disparage that treaty, or could speak of it as a one-sided treaty, altogether in favor of British North America, and not equally in favor of the United States.\n\nMr. CHARLTON. Would not the excess include goods passing through the country in bond and in transit, such as the exportation of wheat through the western canals?\n\nSir CHARLES TUPPER. I think not. I think the hon. gentleman will find that these are the legitimate figures connected with the trade of the two countries, and I noticed, shortly after the delivery of that speech, that the Hon. T. F. Bayard, the Secretary of State of the United States, was interviewed in relation to this question, and, so far as the account of that interview went, I understood him to confirm the accuracy of the figures which I had used on that occasion. I say I have been greatly at a loss to know how, under the circumstances, any person can be found, excepting in this country, to treat this as a one-sided measure in the interest of Canada. So far as what is known as Canada is concerned, we know that the trade of our country took a very great bound, and that the result of the Reciprocity Treaty was to give a very sudden and great and steadily continued impetus to our trade with the United States; but, as I said before, the result was to give a still greater expansion of trade to the United States in relation to British North America. I am glad, after spending some three months in Washington, to be able to say that I had very intimate intercourse with gentlemen of different politics holding high positions in the Senate and House of Representatives, that I took many opportunities of discussing this question with them, and that the result is that I did not find one statesman in the United States who expressed his satisfaction with the termination of that treaty. I believe the general expres-\nalso in that country is that commercially it was a mistake to have terminated that treaty, and that it would have been infinitely better for the United States and for Canada if it had been continued. That treaty was not abrogated on commercial grounds. It was not in consequence of any commercial reasons that the abrogation took place, but it was, as is well known, in consequence of an unhappy sentiment which grew up in the United States, that, during the time of the Civil War which rent that country asunder, the sympathies of the British North American Provinces were very strongly with the South. I think there is every reason to question the soundness of that opinion, although from the nature and the position of our country, being neutral territory, advantage was taken of it by the Southerners, by those who were engaged in carrying on that war from the South, to make Canada a basis of operations, the Government of Canada never showed the slightest favor, but took every means in their power to prevent British North America being made use of in that struggle. I think, if the records of the United States were examined, it would be found that ten Canadians, or ten British North Americans, fought in the ranks of the Northern side for every one who fought on the Southern side.\n\nSir JOHN A. MACDONALD. Twenty.\n\nSir CHARLES TUPPER. I am inclined to think that my right hon. friend is nearer the mark than I am when he says they were twenty to one. I scarcely know of any aid being given to the South, while we know that at this moment the Government of the United States are paying a large sum of money to persons who were British subjects then and are British subjects now, in Canada, for their services during that war. Taking that as the best test that the country can show as to where its sympathies were, as far as the most substantial and important part of them could be found, it will be seen that British North America afforded a greater degree of support and assistance to the North than to the South. Now, I may say that the Treaty of 1854 removed for twelve years all these difficulties, but, unfortunately, from the causes to which I have alluded I believe to a large extent, a misapprehension of the true facts of the case led to that treaty being abrogated. Both parties in this country, both parties in the various Provinces—because it was before the Union of Canada—regretted that abrogation. I believe there was not a Province in what is now the Dominion of Canada that did not make every exertion first of all to avoid the abrogation of that treaty, and, after it was abrogated, to endeavor to have it or something equivalent to it restored at as early a period as possible. But those efforts were unsuccessful; and then, while those efforts were being continued, as hon. gentlemen opposite know, Canada resorted to a system of licenses to prevent too sharp an interference with the long accustomed habit of United States fishermen of fishing in the waters of British North America. We adopted a mode of endeavoring to prevent collision and difficulty. While there might be any hope of our being able to settle this question by a recurrence to something like the Treaty of 1854, every effort was made by the adoption of licenses to remove irritation and prevent collision of every kind, in order to favor, as far as possible, the solution of the question in that way; but ultimately we were obliged to fall back on the principle of protecting our fisheries; we were obliged to adopt such measures as the fishermen had a right to expect at our hands; being excluded from the American market by high duties, having their calling very seriously interfered with, they had a right to demand at the hands of the Government and the Parliament of Canada that measures should be taken for the protection of the rights which they undoubtedly enjoyed and which, under the Treaty of 1818, had been settled in what one would suppose was as clear and concise and emphatic a manner as it was possible for any question to be settled. The result was that seizures were again made, and the American fisherman, encroaching upon the waters of British North America, found themselves again in difficulties. The consequence was, as you all know, that in 1871 a new treaty was made, and I have often thought of the old adage, that everything comes to him who waits, and then I have thought of the maxim in which my right hon. friend on my left was attacked in this House and out of it, in connection with the Washington Treaty, and the satisfaction he must have experienced when, after the treaty had been in operation for ten years, there was not a single public man in Canada but was ready to do everything possible to maintain and to continue that very treaty. On that occasion, as hon. gentlemen know, my right hon. friend made the same effort to settle this question upon the lines that had been adopted in 1854; the effort was to obtain from the United States, instead of a money payment for the privileges which their fishermen were anxious to enjoy in the waters of Canada, such an expansion of commercial intercourse between the two countries as would satisfy the wishes of the people of Canada, and be a settlement that would commend itself to the judgment and approval of everybody. That effort, however, was not successful; and when the treaty was presented for consideration to this House I remember well when hon. gentlemen on the other side of the House felt it their duty to criticize very severely that treaty, and we were compelled, in self-defence, to say something in its support—I remember very well appealing to hon. gentlemen opposite, as I shall appeal to them to-day, not to press the Government unduly to show to Parliament and to show to the country the advantages that were obtained by the Washington Treaty of 1871. One of the conditions of the treaty was that an international arbitration should be placed at Halifax for the purpose of adjusting the greater value of the fisheries of Canada to the people of the United States over and above the remission of the duty on fish and the corresponding right to fish in their waters, so as to arrive at the amount that should be paid by the United States to Canada. I appealed to hon. gentlemen opposite on that occasion not to compel us, in self-defence, to show that the treaty which had been signed was one advantageous to Canada, not to compel us to take such strong grounds as would be used against us when that arbitration, at a subsequent time, should take place. Well, Sir, I am sorry to say that my appeal on that occasion was not as successful as I trust it will be on this occasion; I am sorry to say that we were forced to make some very strong and very clear statements to the House in defense of what my right hon. friend was putting his name to the Washington Treaty of 1871. Well, just as I expected, and nobody knows better than the hon. member for Halifax (Mr. Jones), who sits opposite—for this arbitration took place in the city where he lives—no person knows better than himself, that one main element of the United States case was the production of the very speeches which we had been compelled to make on the floor of this House in defense of that treaty. Every word that we uttered on that occasion was used to our disadvantage and to our detriment. I will not say that it was very successfully used, because I do not think that Canada has any great right to complain of the amount that was awarded on that occasion—$5,500,000 for the period during which the treaty was to last—and the benefits derived by the people of the United States over and above those which were conceded by removing the duties on fish. Many persons have said, Sir, that we were not only successful in that\narbitration, but that we were too successful, that, in fact, the award that was made was the main reason why the United States took the earliest possible moment to denounce that treaty and to terminate it. I do not believe, myself, that the award was too great. I believe it is almost impossible to over-estimate the advantages of enjoying the fisheries that, fortunately for us, are contained in the jurisdictional waters of Canada. But, unfortunately, that treaty was abrogated. And, Sir, I must, in passing, pay my tribute to the hon. member for East York (Mr. Mackenzie), who at that period led the Government of the country, and who knew better than any other gentleman in the discharge of what he conceived to be, and what undoubtedly was, the duty that he owed to Canada in the high position he occupied, adopted measures to prevent that question of money ever being considered. The hon. gentleman sent one of his colleagues, or if not one of his colleagues at the time, a gentleman belonging to his party, of great ability and of great attainments, the late Hon. George Brown,—he sent him to Washington to co-operate with the British Minister at Washington, and once more a strenuous effort was made to settle this question of the greater value of our fisheries over those of the United States, and over the advantages to be derived from having an opportunity of selling our catch free in the American market; I say, he obtained the appointment by Her Majesty's Government of the Hon. George Brown as a plenipotentiary, and that gentleman exhausted every effort in his power to carry out the views of the hon. member for East York, and again revive the Reciprocity Treaty of 1854. As that treaty had been refused on a former occasion, he went further than the lines of that treaty, and by introducing a certain number of articles to be passed free between the two countries, as well as the natural products of the two countries, he endeavored to enlarge and expand what had been obtained by the Treaty of 1854. I believe there was not a single item which was free under the Reciprocity Treaty of 1854, that the Hon. Mr. Brown did not embody in the treaty which he signed, as to be made free between Canada and the United States, under the Treaty of 1874, which draft treaty was arrived at between the two Governments. As I said before, and as I said the other day, I feel it is only right, in passing, to say, that the effort to obtain the freest possible commercial intercourse between Canada and the United States, consistent with the rights and interests of the two Governments is a policy that does not belong to one party only, but it is the proper policy of both parties in this country. The hon. member for East York showed his hearty appreciation of the value of such a policy when he was leading his Administration, just as much as my right hon. friend showed it on the occasion of going to Washington in 1871, and on all and every occasion when that question has come up for consideration. But the Senate rejected that treaty, or, at all events, did not take it up, and consequently we were thrown back upon arbitration; and I think it is a matter of sincere gratification, and always will be to the people of Canada, to know that after the most careful and painstaking examination, after taking all the sworn testimony that could be adduced on the side of the United States, and by Canada, and after the most careful consideration of that testimony, and the most consideration of the whole question, the international commission awarded no less than $5,500,000, or something approaching $500,000 per annum, as the value of the fisheries of Canada over and above those of the United States and the additional advantage of a free market in the United States for the fish of Canada. Now, Sir, under these circumstances, that Treaty of 1871 was abrogated on 1st July, 1885. But I must do the Government of the United States the credit to say that they seemed to be equally impressed with the Government of Canada as to the importance of avoiding the difficulties and collisions that were likely to arise out of the abrogation of that treaty, and as those difficulties were likely to again present themselves a measure was arranged jointly between the Government of the United States and the Government of Great Britain, on behalf of the Government of Canada, for the purpose of endeavoring to prevent those difficulties again presenting themselves. Past experience had shown both countries how exceedingly undesirable it was to have men like the fishermen of the two countries, who were away from home, who were dependent on each other, control enormous tracts of land, carrying out measures the end of which it might be very difficult to foresee; and at the suggestion of the British Minister, Mr. Bayard, then and now the distinguished Secretary of State of the United States, entered into a temporary arrangement whereby American fishermen were allowed the privileges of the treaty during the remainder of the season—that is, the season of 1885—with the understanding that the President should bring the question before Congress at its next session, and recommend a joint commission by the Governments of the United States and Great Britain to consider the question \"in the interest of good neighborhood and friendly intercourse between the two countries, that afford the fullest scope for reciprocal advantages and extension of trade between the United States and British North America.\" I use Mr. Bayard's words. The Government of Canada most readily assented to this view, and true to the policy that had been invariably pursued on both sides of this House, that of doing everything possible to promote trade relations between the two countries and to remove difficulties connected with the fisheries, the Government at once agreed that if the President would send to Congress a recommendation for the appointment of a commission having such objects in view, they would allow the American fishermen to have the same free access to the fisheries of Canada, as they have enjoyed during the continuance of the treaty. President Cleveland, writing good faith with the Governments of Great Britain and Canada, sent a message to Congress on 5th December, 1885, promising that:\n\n\"In the interest of good neighborhood and of the commercial intercourse of an adjacent community, the question of the North American fisheries is one of much importance.\"\n\nHe recommended a commission:\n\n\"Charged with the consideration and settlement, upon a just, equal, and honorable basis, of the entire question of the fishing rights of the two Governments.\"\n\nUnfortunately, the Senate did not approve the recommendation. The fishermen of Gloucester, who naturally I suppose, confined their attention to their own interests, and regardless of the effects of the course they proposed to pursue, at once petitioned Congress in the most earnest manner against any such proposal. They declared they did not want to have anything to do with the fishing grounds or waters of Canada, and they induced the Senate to reject the proposal by a vote of thirty to ten, and the proposal was rejected accordingly. We were then thrown back, necessarily, upon the only means of protecting the rights and interests of Canada. I may say that a very mistaken apprehension has arisen from some quarters that we are all partial and biased in this country to obtain reciprocal trade relations with the United States. The policy of obtaining the free interchange of the natural products of the two countries, the products of the sea, of the forest, of the farm and of the mine, as I have said, has been continuously the policy of both parties in this country, and they have pressed that in season and out of season upon our great neighbors to the south of us. And that, unfortunately, has led to a very erroneous impression. When my hon. friend the Minister\nof Marine and Fisheries was compelled to adopt the same policy that had been adopted by the hon. member for Northumberland (Mr. Mitchell), who organised that department with great ability and who filled the position of Minister of Marine and Fisheries with equally great ability during a considerable time; I say, when the Minister of Marine and Fisheries fell back upon the same policy his predecessor had adopted under like circumstances and took such measures as were absolutely necessary and indispensable for the protection of the rights and interests of the fishermen of Canada and United States, he complained bitterly. Difficulties again took place. Fishermen, perhaps, are the most intractable and uncontrollable people in the world, and when a fisherman gets on board his little smack he thinks he is monarch of all he surveys, and he can go where he pleases, and do what he pleases. The result was that, as before, collisions occurred. Those parties brought themselves under the operation of the law, and it was absolutely necessary, as I have said, in the defence of the rights of Canadian fishermen, to make examples of those parties who showed that disregard for law. The result was, an entirely erroneous impression grew up throughout the United States, was shared by the Government, and by the Senate, by the House of Representatives. It was accepted by the great body of the people; and the press and the people of the United States, almost without exception, came to the conclusion, without a particle of ground to justify it, that Canada was enforcing a most harsh, ungenerous and unwarrantable construction of the terms of the Treaty of 1818, for the purpose of forcing reciprocal trade relations upon the United States. Hon. gentlemen opposite know that this became a universal sentiment in that country. One can understand the mass of the people in the United States sharing such an impression. People ask and at the outset it seems a reasonable proposition: \"Why is it that the fishermen of the United States of America cannot obtain the same consideration in a Canadian port that a Canadian fisherman obtains in the United States ports?\" Well, Sir, the answer is obvious. The American Government renounced the right to enter our waters, as England and Canada never did renounce the right to enter the waters of the United States of America. The United States, in consideration of certain territorial rights over a portion of our country, in a part of Newfoundland and Labrador, and the Magdalen Islands, and in consideration of obtaining such territorial rights as I believe are unparalleled in the world in any other country, renounced the right to their fishing vessels of any kind whatever to come into the jurisdictional waters of Canada or British North America, as it was then called, except for specified purposes, and then under such terms and conditions as would prevent them abusing the exceptional privileges which the treaty allowed. This is obvious, but you cannot make the mass of the people understand it, and it is astonishing how many men of standing and position in the United States seem never to have grasped the fact that the fishermen of the United States occupy an entirely different position in the waters of Canada from that which the fishermen of Canada occupy in the waters of the United States. This was not done by the Government of this country, but once cast, Sir, how easy it is that the mass of the people, not understanding these terms, not understanding the character of this treaty, and not understanding the obligations which the Government of the United States had taken in regard to this question, should be misled. Then, Sir, another difficulty arose, and that was with reference to the rights that those fishing vessels should enjoy when in our waters. It was claimed by the Government of the United States, in 1818, that as no commercial vessel could come into the waters of British North America from the United States, that there was no inter- course, that those were privileges given to the fishing vessels by that treaty beyond anything that was enjoyed by any other class of vessels. And when a changed condition of things came about; when the commercial arrangement of 1830 had, as they contended, entirely changed the status of their fishing vessels in our waters—since, as they said, under that commercial arrangement it was provided that their trading vessels could enter freely the ports of British North America and our trading vessels could enter their ports—as there was no exemption or exclusion of fishing vessels, they claimed that right had been acquired by the fishing vessels that merely took them out of the category of the Treaty of 1818, under which they were restricted from going into our waters for any but the four purposes. I think, Sir, that that contention, upon examination, proves to be entirely unfounded. I do not think it would be possible for any constitutional lawyer to maintain that proposition for a single moment. The arrangement of 1830 was a commercial arrangement, founded upon an Act of Congress, on the one side, authorising the Government of the United States whenever the King in Council would admit United States vessels to the Bermudas, the West Indies and the British West Indies; and whenever the King in Council would, by proclamation, admit their vessels to the ports, they would admit our vessels in the same way to theirs. It was, therefore, a bilateral arrangement entered into and based upon an Act of Congress, on proclamation made by the President and upon the Order in Council made by the King. Now, Sir, the treaty is a superior instrument to that Order in Council, and that Order in Council is silent as to fishing vessels. The treaty solemnly declared that the people of the United States renounced forever the right to claim for a fishing vessel any such commercial privileges whatever. And under those circumstances it is a principle in law, constitutional as well as general law, that once accepted by all countries, that cannot be repealed and change and after a specific provision by a general one unless some arrangement had been subsequently provided as to such specific provision. The general terms as to vessels in the commercial arrangement of 1830 and the absence of any reference to fishing vessels, left fishing vessels exactly in the same position as they were before. But, Sir, that was not the only ground. It was also claimed that in the Washington Treaty of 1871, to which my right hon. friend was a party, there was a bonding clause, and that this bonding clause provided that the United States vessels were authorised to enter into their co-operatives and the same way that Canadian vessels were allowed to tranship their cargoes in bond through the United States. But again, Sir, not only was there no reference made to fishing vessels being relieved from the renunciations of the Government of the United States under the Treaty of 1818, but there was the fact—hon. gentlemen opposite, many of whom watched this matter at Halifax, well know—that when this question was raised and the representative of Canada said: \"You are enjoying privileges here in the transhipment of fish under the treaty, and you are enjoying the advantage of buying bait and supplies of all kinds for your fishing vessels under the treaty, you must consider what is due to the Government of Canada for those privileges which you enjoy\"—I say, Sir, there was the fact that Mr. Foster, acting as the Agent of the Government of the United States, moved a resolution declaring that under the Washington Treaty, the Government of the United States had no such right and no such privilege to tranship a cargo of fish or buy bait or supplies of any kind whatever. Although during the Reciprocity Treaty of 1854 it had been freely permitted by the Government of Canada during the 12 years that Treaty was in force, they declared that under clause 29 of the Washington Treaty, as it stands there\nStates adopting such a barbarous policy as that of non-intercourse with a friendly power, we stand in the proud position of knowing that if that policy were adopted by Canada, we have no means of communication and have the most complete means of communication from the farthest and most remote section of our country down to the sea.\"\n\nI think, Sir, that that was calculated to show that we had to a certain extent protected ourselves from the ruinous position we should have been placed in if we had not those means of inter-communication; and I do not think that was inviting non-intercourse or intimating that it was a policy of which I approved. I said further:\n\n\"Non-intercourse would not be an amiable evil. I would deeply deplore it; even more so than the House and every intelligent Canadian would deplore any interruption of their commercial relations which exist between this country and the United States, but I cannot forget that, if the policy of non-intercourse were adopted, it would lead to the abandonment of those channels of communication between ourselves.\"\n\nIn another place I said:\n\n\"While I most earnestly hope no such policy will be adopted.\"\n\nI thus call attention for a moment in passing to the language I then used in order to show that I was not guilty of the supreme folly that I would have been guilty of if I had spoken of non-intercourse between 50,000,000 of people of the United States of America and 5,000,000 on this side of the line as anything but what every intelligent Canadian would deplore, as I think every intelligent American ought to deplore it. But, Sir, I will just say that this speech does not seem to have been attended with the very unpleasant results that some people in this country feared, who thought it adopted too defiant a tone for a small people like the people of Canada, and was calculated to endanger the good feelings existing among those who desire results. All I can say is that those remarks received a very considerable amount of attention in the press of the United States. Some portions of them appeared in leading journals in the United States; and the result was, Sir, that instead of having any reason to suppose that I had been guilty of an indiscreet act in making the references which I felt as a member of this House, I was bound to make in dealing with the position in which the country stood, the only result, so far as I am aware, was this. I do not know that the speech had any connection with it; but I know that, as a friend—have no objection to mentioning that it was Mr. Winne—at an early day after this speech was delivered, intimated to me that he had had a long conversation with the Secretary of State of the United States, Mr. Bayard, and that that gentleman had said that he would be very glad to have an opportunity of discussing the mutual relations of Canada and the United States with either my right hon. friend the Premier of Canada or myself. I brought that statement under the notice of His Excellency the Governor-General and my right hon. friend; and as it was quite impossible for him to leave his seat in Parliament at that time, I took advantage of the Easter holidays to accept this informal invitation. I went down to Washington, and was presented to Mr. Bayard by Her Majesty's Minister there. Our conversation on that occasion, as you are aware, was personal and private, but the House will be able to gather what the effect of that conversation was, when I refer to the result. It was on the 21st of May that I had that interview with Mr. Bayard, and I can only say that it was a very gratifying one in every possible respect. That distinguished gentleman seemed fully to appreciate what he owed to the great country in which he filled the high position of Secretary of State, and he showed also his appreciation of the importance of maintaining the closest friendly commercial relations with Canada. I am relieved, however, from any violation of secrecy in regard to that\ninterview in view of the correspondence which occurred, Mr. Bayard told me that he would repeat our conversation to the President of the United States, and I did communi-\ncate to me the result of it. On the 23rd of May, I received a letter with which hon. gentlemen are all familiar. I will not trouble the House with reading the whole of it; but it is necessary, in order to give a proper view of the basis of the conference from which this treaty has resulted, that I should draw the attention of the House to some of the remarks made by Mr. Bayard in that letter. In his letter to me he said:\n\n\"The immediate difficulty to be settled is found in the Treaty of 1818 between the United States and Great Britain, which has been ques-\ntioned since it was concluded, and to-day is subject to interfere with the settlement of the great and important questions existing in the most important commercial relations and interests which have come into being since its ratification, and for the adjustment of which while the difficulties of the former treaty have been discussed during the past two years, I am confident we both seek to attain a just and per-\nmanent settlement—and there is but one way to procure it—and that is by a straightforward treatment of all the issues and stated points in the existing state of the relations of these countries. I say commercial, because I do not propose to include, however indirectly, by any in-\ntention, however partial or oblique, the political relations of Canada and the United States, nor to effect the legislative independence of either country.\"\n\nI am glad to know that Mr. Bayard had too much respect for the people of Canada—and he has since learned, in the most conclusive manner, that his views were well founded—to come to any other conclusion than that no Canadian would ever consent to be legislated for by any other country in the world.\n\n\"When you were here I prepared to send my reply to the 'observa-\ntions' upon my proposal for the settlement (of November 15 last), which were communicated to Mr. Phelps by Lord Salisbury on March 26, and which you have already seen, and which I now present to your consideration. Your visit and invitation to see, at this juncture, was most kindly received, and of this I endeavored to impress you. Conversation with the President has confirmed these views, and now it remains to get them practically into effect. Great Britain has the right to be the party to deal with the United States, the surveys of that Government alone are authorized to speak for her, and she has obligations which must be fulfilled by a legally constituted commission. Great Britain is willing to arrange here, with whomsoever may be selected to repre-\nsent the United States' terms of agreement, for a median stand to meet the requirements of the situation, and to settle the existing disputes. It appears to me that as matters now stand the colony of Newfoundland ought to be represented and included for a single ar-\nrangement, and that a representative of the United States ought to be involved. I should, therefore, be informed speedily through the proper channel as to the authorization and appointment by the Imperial Gov-\nernment of such a personage.\"\n\nThe gravity of the present condition of affairs between our two countries demands entire frankness. I feel we stand at the parting of the ways. In one direction there is war, ready to break out for reasonable fear of reciprocal jealousies, and filled with the fruits of prosperity arising out of a friendly cemented by mutual interests, and ended by disaster because based upon jealousy; on the other, carried away by terrific rivalry, and destined long henceforth to the destruction of which victory means the destruction of an adjacent prosperity without gain to the prevalent party—a mutual, physical and moral desolation which ought to be avoided by positions on both sides, and which I am sure no two men will exert themselves more to prevent than the parties to this unofficial correspondence.\"\n\nI replied on the 10th June to Mr. Bayard in the following terms. I will not trouble the House by reading the whole of the letter, but only such parts that will show the basis of this conference:\n\n\"My Dear Mr. Bayard—I had great pleasure in receiving your letter of May 23, even though the impression which it made on me was an anxious adjustment of the fisheries question and the maintenance of the cordial commercial relations between the United States and Canada, under which such vast and continual benefits have grown up. I entirely agree in the statement that there must seek to arrive at a just and permanent settlement—and that there is but one way to procure it—and that by a straightforward treatment on a liberal and statesman-\nlike basis of the existing commercial relations between us. I am particularly your suggestions that as the interests of Canada are so immediately concerned; Her Majesty's Government should be invited to depute a Canadian statesman to negotiate with you—my views were to make a peaceful conclusion and also a common plan to end all disputes, and I feel no doubt that a negotiation thus undertaken would greatly increase the prospects of a satisfactory solution.\"\n\nI concluded by saying:\n\n\"I have thought it my duty and also the most effectual manner of giving effect to my mission, to make known to Lord Lansdowne the substance of my correspondence with you. He is strongly desirous of facilitating a settlement, and will at once bring the matter before the Secretary of State, who, in an early stage of his administration, will be enabled to take steps for facilitating, by means of personal communica-\ntions with your government, a medium such as you have described, and also for arriving at an understanding in regard to a lasting adjust-\nment of our commercial relations.\"\n\nThe result you know, I will read, in order to place the House in full possession of the exact state of affairs, an extract from Mr. Bayard's letter to Mr. Phelps, the American Minisiter in London:\n\n\"The visit here of Sir Charles Tupper, on behalf of the Canadian Government, was received with satisfaction, and was regarded as an indication of the desire for the settlement of existing difficulties, and for the increased commerce of commercial intercourse between the United States and Canada. In consequence of the statement made by Sir Charles Tupper on his return to Canada, I wrote him a personal and unofficial letter on 31st May, and received on 6th June his reply, and copies of this correspondence were duly sent to you. Yesterday, Sir Lionel West handed me a copy of his comment, the following copy of a tele-\ngram to him from Lord Salisbury:\n\n\"The Secretary of State will formally propose the appointment of a Commission as suggested by Mr. Bayard. I shall be glad if Sir Charles Copper, Mr. Bayard's Government will agree with great pleasure.\"\n\n\"SALISBURY.\"\n\n\"And I have just telegraphed you to the following effect:\n\n\"Earl, Minister, Londono.\n\n\"Sir Lionel West handed me yesterday a telegram from Lord Salis-\nbury agreeing to the negotiation suggested by Mr. Bayard informally in his letter, and copies of which I have enclosed. After his flight to this capital, and requesting me to make a formal proposal which will be forwarded to you at once.\n\n\"BAYARD.\"\n\nI intend to read but two other extracts as the only other parts of this correspondence which are pertinent to the sub-\nject:\n\n\"The number of plenipotentiaries to be employed on either side does not appear to me to be important in itself. The treaty of 1818 comprehended the same kind of question, substantially, and as I have before remarked in my correspondence with you, was negotiated by the Earl of Elgin, at that time Governor General of Canada, and Mr. Wm. Eustis, then Secretary of State for Foreign Affairs. After refer-\nring also to our prior treaties with Great Britain, it will be found that the number of plenipotentiaries employed on either side varied, and was frequently unequal.\"\n\nHe further said:\n\n\"It is regarded by the President as of the highest importance that a distinct and independent representation of Her Majesty's delegation at the United States and Great Britain touching the question of the rights which belong respectively to the citizens of the United States and the subjects of Her Britannic Majesty in relation to the fisheries on the coasts of the British possessions in North America, and to any other question which affects the trade and commercial relations between the United States and those possessions. You are, therefore, instructed to propose to His Majesty's Principal Secretary of State for Foreign Affairs the appointment of a special Envoy Extraordinary and Plenipotentiary, to meet in the city of Washington a Plenipotentiary of the Government of the United States, duly authorized by the Secretary of State, to treat for the settlement of all questions of a public nature which have arisen out of the fisheries on the coasts of British North America, and all other questions affecting the relations between the United States and Her Britannic Majesty's possessions in British North America.\"\n\nThe House having heard these extracts, will at once under-\nstand the circumstances under which this conference was brought about and plenipotentiaries appointed on both sides. Her Majesty's Government appointed the Right Hon. Joseph Chamberlain as leader of the conference on the British side; they appointed Her Majesty's Minister at Washington, Sir Lionel Sackville West, as the second plenipotentiary. The Colonial Minister sent a despatch to Lord Lansdowne, the Governor General of Canada, to say that the British Govern-\nment wished the Government of Canada to say who would be acceptable as representing the Government of Canada at this conference, and it is only right to my right\nhon. friend (Sir John A. Macdonald) that I should say that they intimated, as it was very naturally to be expected they would, that the appointment to that position of the same distinguished gentleman, who had acted as a Joint High Commissioner in 1871 with such ability and success, would be entirely acceptable to Her Majesty's Government. I came out to Canada with the slightest idea whatever that I would be appointed in connection with this commission. I returned here after having discharged in London the duties which were incumbent on me and which I had been called upon to perform. Immediately, my right hon. friend told me that he was anxious that I should go to Washington as the third plenipotentiary. Lord Lansdowne was good enough to join in expressing his desire that I should fill that position. I dare say, if the truth were known, my right hon. friend here thought that having so much to do with the resolution of this conference, and representing as I did the power of government in its plenipotentiaries of Canada, and interests of one of the most populous of the Maritime Provinces, the Province of Nova Scotia, there was a certain fitness in my being called upon to discharge this duty. I thought that, under the circumstances, I could not decline, but I made it a condition that I should have the able and invaluable assistance of my colleague, the Minister of Justice, as the legal adviser of the British side at this conference, as I knew that matters of the greatest importance would arise in which the opinions and the advice and the legal and constitutional knowledge of that hon. gentleman would be invaluable. With the utmost readiness, he has promised me his consent to associate himself with me in that capacity; and I must, at the same time tender my heartfelt thanks to the Minister of Marine and Fisheries, whose province I was to a certain extent apparently invading, for the very zealous and hearty and valuable co-operation which his intimate knowledge of that subject enabled him to give me. I take this opportunity of saying that a statement which has been made by leading public journals in this country in reference to my own position on that occasion is erroneous. A good deal of sympathy has been expressed for me. I have had many letters from the great leaders whom I have received even from my opponents, but an amount of sympathy has been extended to me which I must disavow having any occasion for. A great deal has been said and a great deal of sympathy has been expressed, as to the unfortunate position in which Sir Charles Tupper found himself in Washington in battling on the one side for the rights of Canada, and finding the pressure of Her Majesty's Government on the other side; and that in fact I was compelled, by the strong line which was taken by Her Majesty's representative, Mr. Chamberlain, to yield and surrender what it must have cost me great distress, pain, and suffering to do. I could be no party to the position I occupy in this House if I did not at once disavow anything of the kind. I do not think it would have been possible for Her Majesty's Government to have made a better or a more judicious selection than they did in Mr. Chamberlain, as the leader of the British side in that conference. That hon. gentleman is one of the foremost statesmen in England; that right hon. gentleman, as the House very well knows, as the leader of the Radical party in Great Britain, was perhaps especially qualified, by the position he occupied in Imperial politics, to be an admirable envoy to the United States of America. After three months of very intimate intercourse and association in the city of Washington, I have no hesitation in saying that I do not believe it would have been possible for Her Majesty's Government to select any gentleman who would have been more acceptable to all parties in that great capital. In regard to my own position in that conference, I have already shown the House how largely I am responsible for what has taken place. The conference was initiated from the interview which took place between myself and Mr. Bayard. I was subsequently asked to serve as one of Her Majesty's plenipotentiaries on that important mission; but I am bound to say that if, instead of the Right Hon. Mr. Chamberlain or Mr. Bradshaw, who I had had as my colleague in two of the former statements of Canada, taken from either side of the House, it would have been impossible to have had the contentsions of Canada more uniformly supported than they were from the beginning to the end. If there is any mistake, if this treaty is not what Canada had a right to expect it should be, I am bound to say that there is no man more responsible for that than myself. These hon. gentlemen, from the beginning to the end, stood by the interests of Canada in the most unflinching way. I have heard, in this House and out of this House, that it was desirable that the time should come when Canada should support her own plenipotentiaries and envoy to deal with the negotiation of this treaty; but I speak from experience and from a knowledge of the facts when I say that a greater mistake it would be impossible to conceive. In the position which Canada occupies, great and important as it is, and with the great future we have undoubtedly before us in the development of the enormous resources of this country, while the time may come when we will be in a position which will enable us to go into an international conference with that power and influence which alone will qualify a plenipotentiary to negotiate effectively with other countries until that time comes it is impossible to overrate the value of having the Empire of Great Britain behind me. A plenipotentiary is able to command, when he is fighting a keen and hard battle for his country, just that amount of influence and power which that country commands among the States of the world; and I say that, until we obtain that influence and that power, nothing would be more detrimental or suicidal to the best interests of Canada than to divest ourselves of the potent influence of standing under the aegis of the mightiest Empire in the world. Now, I must say a single word with reference to my colleagues. The Hon. Mr. Government of the United States have already given you a tolerable insight into the views of Mr. Bayard. That hon. gentleman, as the House knows, is the worthy representative of a long line of the most eminent statesmen in the United States, and no person in the Government of that country commands more uniformly or more deservedly the respect and confidence of the United States than the Hon. T. F. Bayard, the Secretary of State. In the Hon. W. L. Pattnam, we had opposed to us a gentleman occupying so distinguished a legal position in New England that his name has been frequently heard within the last fortnight as the probable successor to Mr. Hamilton Fish, the late Hon. Charles Francis of the United States, we had in him a gentleman more intimately acquainted with the fishing interests of the United States than almost any other gentleman who could be suggested, and whose legal standing and position are calculated to obtain the confidence and respect of all who know him. In the third plenipotentiary representing the United States, we had Mr. Angell, President of the Michigan University at Ann Arbor, a gentleman who, although a supporter of the Republican party, was selected in consequence of his great knowledge of international law and the fact that he had been chosen by a republican Government to be in the United States to discharge most important duties as a Commissioner to China, in the arrangement of a treaty. I do not believe, Sir, that it would be possible for any Government in the United States to select three gentlemen more eminently patriotic, more heartily devoted to the interests of their country, than the three gentlemen I have named; and after sitting face to face with them for three months in keen\nand sharp controversy, the only result of our communica-\ntion has been to leave upon my mind the very highest\nrespect for the character, standing and ability of those\ngentlemen, and a desire not only of continuing the acquaint-\nance which I had the pleasure of making with them, but\nthat it should perpetuate a genuine and thorough friend-\nship. I can only say, Sir, that when I came to meet them\nin conference, I was greatly surprised, and you will not be\nsurprised to hear me say, that the one after hearing the\npapers I shall read with reference to commercial inter-\ncourse. After the statement of the President of the United\nStates in his Message of 1885, asking for a commission, after\nthe letters which passed between Mr. Bayard and myself,\nyou will readily understand that I went there expecting and\nlooking forward to a settlement of this question on very\nmuch the same lines as those upon which it had been\nsettled in 1854, and to some extent, in 1871. I am\nrightly in saying that the instructions with which I was\ncharged by the Government were to obtain, if the case pos-\nsible, as near an approach to the Reciprocity Treaty of\n1854 as I could obtain, that is, the policy of carrying out\nfree exchange in the natural products of the two countries.\nI was to urge that policy, and I think you will have no\ndoubt as to the course pursued by me after reading the\nproposition that I made in the conference on the 3rd\nDecember, 1887:\n\n\"Sir Charles Tupper begged leave to submit a note containing\nthe following proposal from the British plenipotentiaries. That with a view\nto the elimination of difference in connection with the fisheries,\nit is proposed by His Majesty's Government to make reciprocal\nagreement between both countries that all the privileges enjoyed during the existence\nof the fishery articles of the Treaty of Washington, in consideration\nof the reciprocal agreement for granting free trade in commercial in-\ntercourse between the United States and Newfoundland.\"\n\nIt has been suggested that this is very vague. Well, I\nconfess I am unable to see it. I considered that in formulat-\ning that proposal, I was bound to ascertain if the Govern-\nment of the United States were prepared to accept any\ngreater freedom of commercial intercourse, to ascertain to\nwhat extent they were prepared to meet Canada in order\nto secure for their fishermen the enjoyment of the advan-\ntage which they had under the Treaty of 1854, and under the\nTreaty of 1871. If that proposal does not formulate as\nbroad and as general an invitation to the Government of\nthe United States, as could be made, provided they were\nwilling to deal upon a commercial basis at all, I should be\nvery hard put, if any hon. gentleman will point out to me\nwherein the proposition is wanting. And what did Mr.\nAngell say?\n\nMr. MILLS (Bothwell). The offer is unrestricted.\n\nSir CHARLES TUPPER. The hon. gentleman says\nthe offer is unrestricted and I intended it should be so.\nI intended to give the Government of the United\nStates the fullest opportunity of stating just how far they\nwere prepared to go in reciprocal trade with Canada. I\nknow, Sir, that the air was full of theories of commer-\ncial union, full of proposals of unrestricted intercourse, and I\nthought I could not do a better service to Canada, under\nthese circumstances, than to ascertain at the very outset\nwhat was the position of the United States as to that ques-\ntion. I do not hesitate to tell you what that position is. I\ndo not intend to make reference to a past debate, in which\nI regret very deeply I was not able to participate, although\nas a large and important gentleman, I sit with the question on\nboth sides of the House. I think you are rather fortunate\nin not having another speech inflicted upon you on that\noccasion by myself; but I am bound to take this oppor-\ntunity of saying that, you may go to Washington, as I did;\nyou may mingle for three months, as I did, with the lead-\ning men of all parties and all classes; you may go through\nthe House of Representatives from beginning to end, and\ncanvass every man, and you may go to the Senate of the\nUnited States and canvass every man, and I say you will\nnot find a single man who will talk to you on the subject of\nunrestricted reciprocity, as I did not find one at the time\nwhen public attention was being turned to it in this country.\n\nMr. MILLS (Bothwell). There are two Bills before\nCongress.\n\nSir CHARLES TUPPER. Was it not desirable that we\nshould know what the views and sentiments of the United\nStates were upon the subject? Talk to them, Sir, of com-\nmercial union—I tell you that I did not meet a man of any\nparty, I did not meet an American statesman who would\nnot hold up both hands for commercial union with Canada.\nWhy, Sir? Because he knows that it would give Canada to the\nUnited States, he knows that you would never occupy the\ndegrading position of having a neighboring country make\nyour tariff and importation regulations for you. I say, Sir,\nit is a condition of things from which the most ardent\nCanadian would recoil. This proposition of unrestricted re-\nciprocity, of free trade with the United States, with liberty\nto make our own tariff with the rest of the world, I say I did\nnot meet a man—I discussed this question fully and freely\nfrom day to day with scores of leading public men in the\nUnited States—I did not meet a man that would talk about\nsuch a thing for a single moment. Why, Sir, they treated the\nvery proposition with scorn. They said: \"Do you suppose\nthat we intended to make a free trade arrangement with Canada\nthat would involve free trade with England, and destroy\nthe position that we occupy in relation to all the vast in-\ndustries of this country?\" I say, Sir, that under these cir-\ncumstances I did a service to Canada. And you have got\nthe answer. You did not get from Mr. Bayard the state-\nment: \"If you will go the whole length of unrestricted\nreciprocity with us, if you will make everything free,\nthen we will talk with you.\" Nothing of the kind.\nHere is the answer, coming from the leader of the Admin-\nistration of the United States, which conclusively shows\nthat we were going to say, but, in the interesting and\nanimated discussion that took place in this House, I will now\nsay it was a waste of time to take up a fortnight of the\ntime of Parliament in discussing that which it is just as\nrational as to have been discussing how to construct a rail-\nway from Canada to the moon. The answer is here:\n\n\"While concluding their proposal heretofore submitted—on the 30th\n ultimo—and fully sharing the desire of Her Britannic Majesty's pleni-\npotentiaries to remove all causes of difference in connection with the\nfisheries, the American plenipotentiaries are convinced, after careful\nconsideration, of the desirability of the proposal, and are respectfully\nsubmitting the proposal conveyed to them on the 3rd instant as a\nmeans to the desired end, and to the greatest freedom of reciprocal\ncommerce, which proposal would necessarily be adjusted to the present\ntariff of the United States by congressional action, which adjustment\nthe American plenipotentiaries consider to be mutually impermissible\nwithout such an arrangement as is proposed by Her Britannic\nMajesty's plenipotentiaries. It still appears to the American plenipo-\ntentariants to be possible to bring about an adjustment of the\npresent tariff of the United States by congressional action, which\nwill be honorable to both parties and remove the present causes of complaint\nto which end they are now—as they have been from the beginning of\nthis conference—ready to devote themselves.\"\n\nMr. Bayard gives a further illustration of the position in\nhis letter to the Senate. It is dated Washington, 22nd\nMarch, and in it he says:\n\n\"In conformity with the favorable course pursued in previous\nnegotiations, when the conference met it was agreed that an honorable\nconfidence should be maintained in its deliberations, and that only\nresults should be sanctioned such as might be made by the plenipo-\ntentariants should sign under the direction of the plenipotentiaries. With\nI have therefore shown the grounds on which the United States plenipotentiaries refused in the most positive manner, as they have stated in their reply, over and over again, to take up the question of trade relations. You may ask me then what Mr. Bayard meant by using the words \"these commercial questions and this commercial intercourse between the two countries.\" I confess I was misled. I confess frankly I took the same view as hon. gentlemen would take, I think, on reading his letter to me and my letter to him and his instructions to Mr. Phelps, and I was not prepared to be met by an absolute refusal on the part of the United States plenipotentiaries to take up and consider the question of commercial intercourse at all. But the explanation was given, and I think it is right and fair that in his absence he should give it. Mr. Bayard stated that he had been throughout his great desire to have the freest commercial intercourse between us consistent with the position and interest of the two countries. He says, if you want to see the policy of the Government of the United States you have it in the President's Message to Congress; there is our policy. Our policy is to meet this enormous surplus revenue in the United States, not by a reduction which will strike at the labor and capital of the country by reducing the duty on manufactured articles simply and purely, but it is to meet it by two courses—by making everything that operatives use cheap, by making it free, by making the natural products of the two countries free; in other words, by removing the duties from the food and things that are used by operatives, and by removing the duties from raw materials, which instead of injuring the manufacturing industries is a protective policy. I say, Sir, that after studying the policy of the United States, of the Democratic Party—the free trade party of the United States as they are very improperly called, for there is no free trade party in the United States, they have got beyond that long ago—after examining their policy, after reading the President's message, after reading the report of the Secretary of the Treasury, after reading the speech of Mr. Carlisle, the Speaker of the House, Representative on taking the chair, I have come to the conclusion that their policy is just as close to the policy of the Government of Canada as any two things possibly can be. Our policy is to make natural products free; our policy is to make raw materials free; our policy is to make the country as cheap a country as we can for the artisan, and at the same time to give his labor a full return, by such protection of the manufacturing industries of the country as will build up those manufactures and give employment to the people. Now, Sir, that is our policy. Mr. Bayard and those other gentlemen said that \"there is only one way to reach this (for Congress alone can take the initiative of this article), and, in account of the excitement that has been excited in this country by those fishery difficulties you have an unanimous Bill passed by the House of Representatives and passed by the Senate and assented to by the President, you have to meet what they hold was the inhospitable conduct (they used good deal stronger terms in some of their State papers I am very sorry to say), of Canada in reference to the treatment of their fishermen, our representatives have said that they would never purchase from Canada any immunity for their fishermen by reciprocal trade arrangements—imbued, as their minds were, with the idea that we had adopted this policy to force reciprocity upon them. Their immunity we did it for this purpose, instead of doing it as we did it to protectors' rights. While we were ready to have the freest commercial intercourse in the natural products of the two countries we never attempted to use that as a means or as a lever by which to coerce the people of the United States. We were simply and wholly animated by a desire to protect as we were bound to\ndo the fishermen of this country who are engaged in one of our greatest and most important industries.\n\nSir, what was this \"Non-Intercourse Bill\"? It not only provided for shutting Canadian fishing vessels of all descriptions out of their ports but it contained a provision against all interchange of trade. Here is one of the provisions:\n\n\"That whenever the President of the United States shall be satisfied that American fishermen are visiting or being in the waters or at any port or place of the British Dominions of North America, or are then lately have been denied the privilege of entering such port or place, or have been subjected to any act or acts which may have been unjustly vexed or harassed in the enjoyment of such rights, or subjected to unreasonable restrictions, regulations, or treatments in respect to cargoes or other property carried, stored, or landed, or sold at such ports or places, or whenever the President of the United States shall be satisfied that any such fishing vessels or fishermen having a permit under the laws of the United States have been denied entry into any port, place or places, in the British Dominions of North America, or are then lately have been denied the privilege of entering such port or place, or have been subjected to any act or acts which may have been unjustly vexed or harassed in the enjoyment of such rights, or subjected to unreasonable restrictions, regulations, or treatments in respect to cargoes or other property carried, stored, or landed, or sold at such ports or places, or whenever the President of the United States shall be satisfied that any other vessels of the United States have been denied entry into any port, place or places, in the British Dominions of North America, or are then lately have been denied any of the privileges therein accorded to the vessels of the United States, or have been unfairly vexed or harassed therein by the authorities thereof, than, and in either or all of these cases, he shall cause to be issued a proclamation to that effect, to deny vessels, their masters and crews of the British Dominions of North America, any customhouse or water port or place of or within the United States, excepting in case of necessity, storm or stress of weather or needing supplies as to the President shall seem proper where such vessels shall have come directly from said dominions on such distressful voyage or by way of some port or place in such desired voyage elsewhere.\"\n\nAnd this point, covering complete non-intercourse with the entire country,\n\n\"and also to deny entry into any port or place of the United States of fresh fish or salt fish or any other product of said dominions or other goods coming from said dominions to the United States.\"\n\nThat was the law placed upon the Statute-book of the United States by the unanimous vote I believe of both the House of Representatives and the Senate of the United States.\n\nIf there was \"no\" at all it was impossible. That expressed the sentiments and the feeling in the United States of America, and our friends the plenipotentiaries representing the United States, said: \"If we make a treaty with you affecting the tariff, however small the inducement you might be willing to accept, it is certain of absolute rejection by the Senate, because the Congress of the United States have stated their position firmly, and they will not permit any interference on the part of the Administration of the United States by treaty, with anything that involves a change in the fiscal laws of the United States.\n\nThey said, secondly, that not only was that the case, but such was the hostility of public men in regard to Canada and the treatment by Canada of their fishermen, that if tomorrow any relaxation of the tariff of the United States was made by an Act of Congress it would contain a clause excepting Canada from its operations so as to deny us its advantage. But they said our policy is proclaimed to the world; you will see it everywhere: our policy is as far as we can to make the natural products that come into the country free and what lies in the way of that policy is this irritation connected with the fishery question. If we can secure that, we will secure the whole thing; and you will see at once that our own independent policy—the policy of the United States on this question of commercial intercourse—will be such as to produce the most intimate commercial relations again with the Dominion of Canada.\" And, Sir, under those circumstances, denied as we were the free consideration of the question, of which fact I have given you abundant evidence, we turned our attention to the only means by which we could avert what everybody could feel would be the greatest disaster that could befall this country. We tried to get back to the treaty, and while it could be averted and there were the removal of the causes of irritation between the United States and Canada (for it was Canada rather than Great Britain that was referred to) and by removing those causes of irritation, and giving free scope to this policy to which they were committed, we believed that it would at a very early day give us everything that we could desire in the way of greater freedom of commercial intercourse. Now, Sir, I am in somewhat a similar position to explain: this treaty, which I have now reached, to that in which I was in 1871, when defending the treaty of our right hon. friend, after somewhat different circumstances. Then I said: \"Every word that you force us to say in support of this treaty will be used against us at Halifax in diminution of the payment that we are entitled to for the greater value of our fisheries.\" To-day I am in a somewhat similar position. For, every word that I say in defense of the treaty to which I have put my hand and to which I ask the sanction of this House with the utmost confidence, every word that I say in support of it may be used to-morrow in the Senate of the United States, where support to the treaty may be more difficult to obtain than it is in the House of Commons of Canada. The House will, therefore, understand that on this occasion it cannot be expected from me that I shall point out very elaborately the advantages accruing to Canada under the treaty to which we have placed our hands. What I say is this—I say, Sir, that the course that has been adopted in reference to this treaty has been adopted with a view to secure in the only way that was found practicable, the best interests of Canada. I am told, in fact I received a message, that the hon. leader of the Opposition wished me to lay on the Table of the House a map showing what Canada claimed under the Treaty of 1818, and rope up the heady question, and altogether to show what the result of this treaty was—how much we had surrendered—or how much we had secured. I can only say that I am not able to respond to that invitation, for this reason, that this treaty provides, in regard to the delimitation, that the work shall be done by commissioners, two appointed on each side, eminent men of high qualifications, who shall mark on British admiralty charts the lines as they are laid down and agreed to in the treaty. My hon. friend the leader of the Opposition will at once see that it would not do for me to anticipate the action of that court of delimitation, or to undertake in advance to set aside the important duties with which they are charged, and give exactly my view of it.\n\nMr. LAURIER. I have seen it done.\n\nSir CHARLES TUPPER. He has seen it done, and he has seen it done in this very case. I have seen in the New York Herald—I do not know who gave it to them—the delimitation marked; and I have seen in the Globe newspaper that very enterprising journal which gives so much attention to these important questions—this question of delimitation dealt with, and a map published showing the results of the delimitation, both as to Newfoundland and as to Canada. Now, I do not intend to endorse the letter-press of this article, which declares that there has been a complete surrender of Canadian interests by myself; but I will say this much, that this is a very good effort on the part of the Hon. Mr. Laurier to bring before the country the results of the delimitation as described in the treaty. It is very specifically described in the treaty, and those who study this map attentively, will, I think, be able to form a very fair idea of the results—quite as\ngood as they would from any unauthorized map which I could have constructed, and which I would have no right to lay before the House. I do not think it was a complete surrender, and I will briefly tell the House why. But before proceeding to that matter, I may say that there was one subject on which I was glad to find that the American plebiscites had been generally more entirely at one. They expressed no wish to acquire the right to fish in the jurisdictional waters of Canada. With that expression of opinion on their part I heartily concurred. I believe, Sir, it would have been difficult to obtain any possible treaty that could repay Canada for having her invaluable fishing grounds thrown open again to United States fishermen. With the recent modes of catching fish by means of purse seines, my fear would be that if our fishing grounds were thrown open to our neighbors to the south of us, in ten or fifteen years we should have very little bottom fishers than they have. Before such an event would lead to their destruction, and, therefore, I was very glad to find that there was no desire on the part of the United States to acquire the right to fish in the inshore fishing grounds of Canada; and I want it to be kept steadily in view that in all the arrangements provided by this treaty, Canada holds for Canadians her fishing grounds for their own exclusive use and benefit; and, Sir, with the intelligence, the industry, and the enterprise of our people, I am quite certain that they will be able under the provisions of this treaty to hold their own anywhere.\n\nI will now, Sir, proceed to deal with the subject of the treaty itself and I take up first this important question, that of defining what need not rely upon that there is a question in controversy. It is a question, as my hon. friend from Northumberland (Mr. Mitchell) knows, has been a most fertile cause of discussion between the United States and Great Britain and Canada. The Americans have maintained that what we termed our exclusive right to shut them out of all bays was not well founded in the treaty. They have maintained that they had an indefeasible right under that treaty to approach within three miles of the shore of any bay or indentation. My hon. friend shakes his head, but I hold in my hand authorities, and I could give them to him by the score, in which they have again and again maintained that position, and demanded that right.\n\nMr. MITCHELL. Did not Great Britain for forty years enforce her construction of that Treaty of 1818?\n\nSir CHARLES TUPPER. I can only say that nobody knows better than my hon. friend that Great Britain induced him to recall his regulations and instructions, after he had issued them, and restricted his jurisdiction to within three miles of the shore.\n\nMr. MITCHELL. And why? Because Great Britain could control the Government of this country, and I had to do it; that is why.\n\nSir CHARLES TUPPER. Never mind. My hon. friend's enquiry was as to the position of Great Britain, and I give it to him. Great Britain has always contended, and has rightly contended, for technical exclusion from any bay, and the Crown officers of England have sustained that contention. But my hon. friend knows that it is one thing to hold a technical construction, and it is another to undertake to enforce it.\n\nMr. MITCHELL. Will the hon. gentleman let me put one question to him? He states that Great Britain has held a technical construction of the Treaty of 1818. I would say that Great Britain has actually enforced her technical construction for forty years. And with reference to what the hon. gentleman says about exclusion from bays, the first decision was given in reference to the Bay of Fundy, where the headland on one side was American and the headland on the other was Canadian or Nova Scotian. That was the first give-away of our treaty rights.\n\nSir CHARLES TUPPER. My hon. friend then means that for the first forty years Great Britain held a particular view which she has abandoned for the last forty years.\n\nMr. MITCHELL. I do not mean that. I will say what I mean if the hon. gentlemen will let me. I say that for the first forty years Great Britain legitimately enforced that contention and the Americans recognised it. Under the decision in the case of the Bay of Fundy, one side of which was American and the other side Nova Scotian, it was held that that bay was not exclusively an English bay, and upon the decision in that case our rights were given away and suspended by England, and were not enforced as strictly as they have been before.\n\nSir CHARLES TUPPER. Well, I do not intend to be drawn into a discussion by my hon. friend, because I do not question very much his statement; but I want to ask him whether he thinks a right which is technically claimed but practically abandoned for forty years, is gaining in strength. I take a different view. But perhaps my hon. friend will allow me to proceed, and reserve his remarks for a future period. On the 17th September, 1845, Lord Stanley wrote to Lord Falkland—\n\n\"Her Majesty's Government have attentively considered the representations contained in your despatches respecting the policy of granting licenses to American fishermen to fish in the bays of the Bay of Fundy, and other large bays of a similar character on the coast of New Brunswick and Nova Scotia; and apprehending, from your statement, that such a concession would be injurious to the interests of the British North American Provinces, they have abandoned the intention we had entertained on the subject, and shall adhere to the stipulations of the treaties which exist between Great Britain and the United States, relating to the fisheries, except in so far as they may relate to the Bay of Fundy, which has been thrown open to the North Americans under certain restrictions.\"\n\nSo that Lord Stanley, intimated practically that what was done in the Bay of Fundy was to be the rule.\n\nMr. MITCHELL. No.\n\nMr. MILLS (Bothwell). The very opposite.\n\nSir CHARLES TUPPER. He says in so many words that this was what they had intended but that they had abandoned the idea upon representation.\n\nMr. MILLS (Bothwell). Let the hon. gentleman read it again.\n\nSir CHARLES TUPPER:—\n\n\"Mr. Everett thought that the negotiations were now in a most favorable state—\"\n\nThat is, after the Bay of Fundy was given up.\n\n\"for a full and satisfactory adjustment of the dispute. He had the fullest assurance that the British Government contemplated a further extension of the same policy by the adoption of a general regulation that American fishermen should be allowed freely to enter all bays of which the mouths were not more than six miles in width.\"\n\nIn May, 1846, Lord Stanley communicated this intention to Lord Falkland, who immediately replied. Then Nova Scotia came forward, and Canada came forward, and the effect of their firm remonstrances, based on this constitutional right, was that he receded from the intention to allow the Americans to go within three miles of the shore, and decided to maintain the original contention.\n\nMr. MILLS (Bothwell). Hear, hear.\nSir CHARLES TUPPER. That is what I said exactly. I come to this question, and, as I said before, no public officer, in my judgment, no Minister, ever exhibited more zeal or ability in the management of his department than did my hon. friend.\n\nMr. MITCHELL. Never mind that.\n\nSir CHARLES TUPPER. From the time it was organized under his charge he showed the greatest possible determination to hold on to all that he had and to get as much as he could in the interests of Canada. Now, I will draw the attention of my hon. friend and the House to the fact that, actuated by that motive, in 1870, he sent out the following instructions:\n\n\"In such capacity your jurisdiction must be strictly confined within the limits of three marine miles of any of the coasts, bays, creeks, or harbors of Canada, with respect to any action you may take against American fishing vessels and the United States citizens engaged in fishing.\"\n\nMr. MITCHELL. Under instructions from England.\n\nSir CHARLES TUPPER. No. This is before the pressure, as the hon. gentleman will see, but he went on trying to get in the thin end of another wedge, and I commend his attempt. He said:\n\n\"Where any of the bays, creeks, or harbors, shall not exceed ten geographical miles in width, you will consider that the line of demarcation extends from headland to headland, either at the entrance of such bay, creek, or harbor, or from and between given points on both sides thereof, at any point nearest the shore, where the channel does not extend ten miles wide, and may include foreign fishermen and fishing vessels therefrom, or since, if found within three marine miles of the coast.\"\n\nThen he went on to give the jurisdiction and the action that should be taken under it; and the bays from which he instructed his officers to exclude American fishing vessels are those ten miles in width. What followed? We have a despatch from Lord Granville to the Governor General:\n\n\"Her Majesty's Government hopes that the United States fishermen will not be for the present prevented from fishing except within three miles from land or in bays which are less than six miles broad at the mouth.\"\n\nThat is the answer to the instructions. My hon. friend, I grant you, was under compulsion; he was, I grant you, under pressure from Her Majesty's Government; but that only makes the case stronger from my standpoint, and my standpoint is that, in the position we occupy, dependent upon Her Majesty's Government for that right and that strength, and however which will therefore regard for the interests of the people of this country, we must pay some deference to Her Majesty's Government. Considering the fostering care which Her Majesty's Government have at all times given the interests of Canada, we are bound to reciprocate by meeting any just claim for consideration from the party which is mainly involved in our contentions. Therefore, I say my hon. friend was right, but he did withdraw that instruction, and he issued in its place the following instructions, as contained in a report of Council:\n\n\"The Council is aware that when the British Government in 1843 opened the Bay of Fundy to American fishermen, as an amicable relaxation of treaty rights, the act was officially regarded as a practical abandonment by the British authorities of the similar instructions in Convention of 1818. It was immediately followed by a demand for general application to all inlets exceeding six miles in width.\"\n\nSo that I say to my hon. friend that I gave his own terms, as sustaining the statement that I made of the demand of the Government of the United States to have access to our waters within three miles of the shore, whether in bays or out of bays.\n\nMr. MITCHELL. I promised not to interrupt the hon. gentleman, and I will not; but I will simply say that I have a complete answer to that.\n\nSir CHARLES TUPPER. No doubt the hon. gentleman is so ingenious that he could answer himself over and over again.\n\nMr. MITCHELL. He is so careful in his public capacity that he can do it.\n\nSir CHARLES TUPPER. I have no fault to find with my hon. friend in his public capacity as a Minister. I have a great deal more fault to find with him in his private capacity, as sitting on the other side of the House.\n\nMr. MITCHELL. Do you think there is much difference between us.\n\nSir CHARLES TUPPER. Here is a despatch from Downing Street, dated 6th June 1870:\n\n\"Her Majesty's Government are fully aware that no step should be taken which would prejudice the question—what are Canadian waters? Or should admit the right of United States fishermen to fish within those waters except within the limits prescribed by the Convention of 1818?\"\n\nBut they do not abandon the hope that the question of abstract right may yet be avoided by some arrangement between Canada and the United States, or that the limits may be definitely settled by arbitration. They say, and I think it advisable that the United States fishermen should not be excluded from fishing within three miles from the shore, or in the unusual case of a bay which is less than six miles wide at its mouth but proceeds to a greater width, as in the case of the Great Bear, or the back of her treaty right, if the prospect of an arrangement between or for the coast is likely to interfere practically with the protection of the Canadian fisheries.\n\nThat was also a despatch from Lord Granville, June 6th, 1870. Now, under the pressure of this, as my hon. friend has stated, he changed his instructions in reference to the ten miles and put in six miles, and forbade his officers to interfere with the American fishermen, not as in the first instructions he gave, if they were within three miles of the mouth of the bay, but only if they were within three miles of the shore, and he says:\n\n\"Until further instructed, therefore, you will not interfere with any American fishermen unless found within three miles of the shore, or within three miles of a line drawn down to the mouth of a bay or creek, which is less than six miles wide, or within three geographical miles in width at its mouth. In the case of any other bay, as Baie des Chaleurs, for example—\n\nThe very bay he excluded them from was more than ten miles wide.\n\n\"You will not interfere with any United States fishing vessel or boat or any American fishermen, unless they are found within three miles of the shore.\"\n\nMr. MITCHELL. Under positive instructions from England, against my representations and everything else.\n\nSir CHARLES TUPPER. I think I have satisfied my hon. friend that, as far as Her Majesty's Government were concerned, while they maintained the abstract right under the treaty, they were unwilling to raise the question of bays, and the result is, as my hon. friend knows, that for the last thirty-four years, certainly since 1864—and I will\nnot go further back than 1854—there has been no practical interference with American fishing vessels unless they were within three miles of the shore, in bays or elsewhere.\n\nMr. MITCHELL. Will his honor allow me to ask him one question?\n\nSir CHARLES TUPPER. I would ask the hon. gentleman not to do it now. I was in hopes to finish by 6 o'clock and I am sure the House will sympathise with me in that desire. The Government instead of considering this as a question passed beyond controversy, did what? The hon. gentleman was a member of the Government at the time, and the Government adopted the proposal of Sir Alexander Macdonald to go to Lord Kimberley and ask for the appointment of a commission on which England and the United States and Canada would be represented, to settle what was the correct view in reference to the British bays, to settle this very question of delimitation.\n\nMr. MITCHELL. Oh, no, not that.\n\nSome hon. MEMBERS. Order.\n\nMr. MITCHELL. For the purpose of maintaining colonial rights to the fisheries as claimed by England.\n\nSir CHARLES TUPPER. I will read from a despatch sent by Lord Kimberley:\n\n\"Mr. Campbell brought under my consideration the following subject, viz., the question of the occupation of the Canadian fishery encroachment by foreign fishing vessels. On this point I enclose with your Ministry's instructions that it would be desirable that the questions which have been so long a source of dissatisfaction with the United States to the geographical limits of the exclusive fishery rights of Canada under the Treaty of 1818, should be settled, by a joint British and American commission, on which the Dominion should be represented. Her Majesty's Government have promised the United States Government the appointment of such a commission.\"\n\nI give that to the House; as the proof that, so far from this being regarded as a matter upon which no question could arise, it was not so treated. Lord Kimberley, in a despatch of the 10th October, 1870, said:\n\n\"The object of Her Majesty's Government is, as you will observe, to give effect to the wishes of your Government, by appointing a joint commission, on which Great Britain, the United States and Canada are to be represented, with the view of enquiring what ought to be the geographical limits of the exclusive fishery rights of Canada with American colonies. In accordance with the expressed desire of your advisers, it is proposed that the enquiry should be held in America.\"\n\nAnd then there is a memorandum from the Foreign Office giving the reasons for the appointment of that commission, and from that I will read a single sentence:\n\n\"The right of Great Britain to exclude American fishermen from waters within three miles of the coast is unambiguous, and is believed, uncontested. But there appears to be some doubt what are the words \"within three miles\" as applied to bays, creeks and harbours. When a bay is less than six miles broad, it cannot be within the three miles limit, and therefore clearly within the meaning of the treaty; but, when it is more than that breadth, the question arises whether it is a bay of Her Britannic Majesty's dominions.\n\nI hope I have satisfied the House that, so far from the question of delimitation, when we took it up at Washington, being one which was settled, it could not remain an open question in which Canada and Great Britain on the one side maintained an extreme contention, and the United States Government maintained the very reverse, which was also an extreme contention.\n\nMr. MITCHELL. Nothing of the kind.\n\nSir CHARLES TUPPER. If I have not made it clear to the hon. gentleman, I am sure I have not been so unfortunate with the rest of the House. Now, what more? The hon. gentleman knows that, in the first place, the Government of Canada had agreed to a commission to ascertain what these rights were. Would we agree to a commission to ascertain whether a foot of land in Canadian territory was ours or belonged to someone else? The hon. gentleman knows that we would not. But we did agree to this commission. My hon. friend from Bothwell (Mr. Mills) seemed a little while ago to be somewhat reticent as to whether there were any doubts still on this subject. A great many members in this House will recollect that, when the Treaty of Washington had been arranged, that hon. gentleman moved in this House that, before the Halifax Commission should sit, the doubts respecting our geographical limits should first be settled. I am not saying that I did not agree with him, but I say that at that time the question was not raised properly, and I opposed him, and I gave my reasons for so opposing him. If you look at the debates of that date, you will find, in the statement made by my right hon. friend and myself of the Government, and through hon. gentlemen on both sides of the House, that the desire was expressed that these doubts, which undoubtedly did exist, should be set at rest, but we did not think the time opportune before the sitting of that Halifax Commission. When we changed sides, and the hon. member for Bothwell (Mr. Mills) sat on this side of the House, with the hon. member (Mr. Blake) who, I regret to know, is no longer able to lead that side of the House, after having pressed upon us the vital importance of having this question settled before the Halifax Commission sat, they forgot all about it. When they had to deal with the responsibilities of office and to discharge the duties which rest upon Ministers of the Crown, they dealt with them, and it is not desirable to raise the question before the sitting of the Halifax Commission, and they have allowed it to sleep until now. I am frank to say that the plenipotentiaries now have made concessions on this question.\n\nMr. MITCHELL. Hear, hear.\n\nSir CHARLES TUPPER. The hon. gentleman says \"hear, hear,\" but did he ever hear of any two nations, or of any two individuals, who had a difficulty or controversy between them, going into an arrangement to be mutually settled and adjusted without both sides giving way in some degree or other? I think the very spirit and policy of this Commission which was proposed, was to ascertain, to settle and to remove these doubts, and I say, when we met these gentlemen and they proposed to us this ten mile limit, and said: If you give up the extreme contention that no bay, however broad its mouth, can be entered by an American fisherman, we will agree to take the ten mile limit, and when they met us further and said that, in addition to that they would take up and consider the question of any special bays we thought ought not to be open to foreigners, then we took this question as we were bound to take it, and found a solution by mutual concession. Instead of giving into their contention that they could go into the Baie des Chaleurs within three miles of the shore, we made a treaty by which they cannot enter the Baie des Chaleurs at all. And the hon. gentleman knows that the Miramichi Bay, and a number of other bays that we consider of vital importance to be kept free from any kind of intrusion, have been conceded to us. We met them in a spirit of mutual concession. I have no hesitation in saying that I believe that when we parted, and long before we parted, we were animated by the conviction that, even if the countries we represented made such concessions, as far as could possibly be done, to find such a solution as would settle these questions that have disturbed the intercourse and threatened the peace of the two greatest English-speaking nations of the world, on the best terms that we could possibly find.\nMr. MILLS (Bothwell). Will the hon. gentleman tell us the meaning of article 5?\n\nSir CHARLES TUPPER. If the hon. gentleman will possess his soul in patience for a little while, I will try to do so. What is article 5? If the hon. gentleman has it in his hands, perhaps he will read it.\n\nMr. MILLS (Bothwell).\n\n\"Article V.—Nothing in this treaty shall be construed to include within the common waters any such interior portions of any bays, creeks, or harbors as cannot be reached from the sea without passing within the three marine miles mentioned in Article I of the Convention of October 18, 1818.\"\n\nSir CHARLES TUPPER. I am obliged to my hon. friend for the question, and I will give him a most explicit answer. I am utterly sure, a satisfactory answer. I hold the delineation of a.m. in this hand. It is imaginary; it is true, but it is not the least just what you may meet with at the mouth of any bay. This bay is fifteen miles from mainland to mainland, and yet under the instructions of my hon. friend from Northumberland (Mr. Mitchell) not to go within three miles of the shore, they could not get into that bay. Why? Because there are islands in the mouth of the bay, and the island carries its three miles of marine jurisdiction stretched around it, the same as the mainland. I will send it over to my hon. friend to show him just what that article means, and the reason why it was necessary, in order to provide for possible contingency by which a bay being fifteen miles wide, they could not get into it. Now, I said: You do not propose by that ten-mile arrangement to enter a bay that you could not enter under the six-mile arrangement, do you? Certainly not. Then I gave them this delineation, and that clause was put in the treaty for the purpose of giving effect to it, and to prevent giving any possible uncertainty. Now, Sir, as I said before, we were met in a broad and liberal spirit, and I think the sentiment that animated us on both sides was that we owed it to each other and to the countries we represented, not to quarrel over points of minor importance, but adjusted such that if it were possible to find a solution that would be agreeable to both countries and advantageous to all, it was our duty to find that solution, and to agree upon terms that we could honorably ask Great Britain on the one side, and the United States on the other, and Canada, to accept, as a great improvement upon the existing condition of things. Therefore, as I said, we made the concession, not of anything that has been enforced practically by Canada, but the abstract right to exclude from bays that were more than six miles wide.\n\nIt being six o'clock, the Speaker left the Chair.\n\nAfter Recess.\n\nSir CHARLES TUPPER. Before passing away entirely from the subject of delimitation, to which I drew the attention of the House for some time, I would like to say that, in addition to the doctrine which has been admitted on all sides to exist and required to be set at rest, the Government of the United States had a very strong standing ground, a very strong position, in the delimitation which was adopted by what was called the North Sea convention, a convention between Her Britannic Majesty, the German Emperor, the King of Prussia, the King of the Belgians, the King of Denmark, the President of the French Republic, and the King of the Netherlands, regulating the North Sea fisheries. This convention was signed at The Hague on the 6th May, 1882; and if, upon a deliberate review of the bays from which foreign vessels should be excluded, these powers adopted the principle of limiting that exclusion to bays that were less than ten miles in width, you can readily see the strong position the Government of the United States would have in claiming that the delimitation should have some regard to the international policy of these great countries that had been dealing with a precisely similar question. Article 2 of the convention says:\n\n\"The fishermen of each country shall enjoy the exclusive right to fish within a distance of three miles from low water mark.\"\n\nThe three-mile limit mentioned in Article 2 of the Convention of October 18, 1818, shall be measured seaward from low water mark; but at every bay, creek or harbor, not otherwise specially provided for in this treaty, such three marine miles shall be measured seaward from a line drawn across the bay, creek or harbor in the part nearest the entrance at the first point where the width does not exceed ten marine miles.\n\nAs I have said before, to accept the delimitation, to accept as the jurisdictional waters of Canada from which foreigners shall be excluded, the ten-mile limit as proposed by the Government of the United States, was to stand not only upon the ground that a good deal of doubt and hesitation seem to have been exhibited by Her Majesty's Government and the Government of Canada in dealing with that subject, but they had in addition the precedent of the Hague convention, where all the great powers to which I have referred had joined, and the Canadian Government had decided that the fishermen of all countries should be at liberty to come into any waters where the bay was more than ten miles wide at the mouth. When we accepted this ten-mile delimitation, which was all that appears to have been aimed at by any Canadian Government, the extreme limit that any person had proposed as a matter of delimitation, we made it a condition of the acceptance of that restriction that certain bays should be exempt from its operation, and although I have not furnished hon. gentlemen opposite with a chart on which those delimitations are marked by myself, as I thought it would hardly do to do that, it will be seen that the examination of such exceptions as has been given on this subject, that the exceptions which the plenipotentiaries of the United States were willing to concede have left us very small ground for complaint, although I frankly state it was a concession made by the plenipotentiaries of Her Majesty for the purpose of arriving at a common ground on which we could solve the difficulties with which this question was surrounded. Our concessions did not stop there. I am quite ready to admit, and I think it might as well be stated in the outset, that the Canadian Government would find it, I would find it, quite as difficult as my friends the plenipotentiaries of the United States would find it, to justify this treaty if it was to be examined in the light of the extreme contentions maintained on both sides previously. I need not inform the House that in diplomatic intercourse it is customary, it is right for the representatives of a Government to state the strongest and most advanced ground that they possibly can sustain in relation to every question, and I would not like, I confess, to be tried before the House by the ground taken by my hon. friend the Minister of Justice and by the Minister of Marine and Fisheries. The ground they took was quite right; they were authorized by the strict terms of the treaty, and they were justified in doing so; they would have failed in their duty to this House and to this country if, called upon to deal with this question as a matter of diplomatic intercourse and discussion between the Government of the United States and of Canada, they had not taken the extreme contention that the literal terms of the Treaty of 1818 would warrant. They did their duty in adopting that course; but when it comes to a question of conference, to a question of international discussion for the purpose of ascertaining whether between the extreme contention on the one side and the extreme contention on the other, any standing ground may be found on which the two parties may meet and settle a dispute of great international\ndifficulty by mutual concession, the case is entirely altered, and the responsibility resting upon the plenipotentiaries of any country would be very great if they refused to consider fair and reasonable concessions on the one side and to meet them by fair and reasonable concessions on the other. So that I have no hesitation in saying that, dealing with this great question in that spirit, dealing with a question that is of such importance to the British Empire of vital importance to the Government of Great Britain, we were constantly threatened with embarrassment and serious difficulties and collision with the great country to the south of us, a question, too, of great magnitude to the United States of America, a question of still greater magnitude, in my judgment, to the people of Canada, one on which we had more at stake and more to lose in a great struggle of that kind than either of the great countries to which I have referred—I say looking at the question in that broad and national spirit, looking at it with a desire to remove the possibility of what I consider would be the greatest misfortune that could happen to the fisheries world—considering between the two great English-speaking nations—looking at it from that broad standpoint, it would have been criminal on my part and on the part of those who represented Her Majesty's Government and the interests of the people of Canada, if they had not endeavored, by making fair and reasonable concessions, to find a common ground that would present a solution of those important and serious questions, that might enable a treaty to be formulated and accepted as a just and equitable settlement upon both sides. As I have said, our concessions did not rest at the delineation. We came now to the most important portion of the treaty, and that is the question of Canadian fishing vessels in our waters. I trust I have explained article 5 to the satisfaction of the hon. member for Rothwell (Mr. Mills), and the other articles immediately following refer to the mode of delineation and do not require any special remarks from me.\n\nArticle 9 says:\n\n\"Nothing in this treaty shall interrupt or affect the free navigation of the Strait of Canso by fishing vessels of the United States.\"\n\nI may explain to the House that that was not a surrender of British interests or Canadian interests at the delineation, or at the request of the plenipotentiaries of the United States. That clause was inserted in the treaty by ourselves, and for this reason: That the rule for the delineation which was adopted, the ten-mile rule, would have necessarily excluded, if we took in Chedabucto Bay, which we did take in by making the delineation, as hon. gentlemen will see, not from one side of the main land of the bay to the other, which would have opened it to the United States, but from the island between; by that delineation the United States would have been shut out altogether from passing through the Strait of Canso because they could not have gone into Chedabucto Bay and therefore we asked that Chedabucto Bay should be excluded from the delineation, which made it an exclusive bay in order to prevent their being shut out of the navigation of the Straits of Canso. Well, Sir, under those circumstances we met that by providing nothing new. We provided simply that nothing in this treaty should interrupt the free navigation of the Straits of Canso, as previously enjoyed by fishing vessels to which we confined it, and in that way we avoided making an exception of Chedabucto Bay, which is the entrance from the Atlantic side to the Straits of Canso. Article 10 provides:\n\n\"That United States fishing vessels entering the bays or harbors referred to in Article 1 of this treaty shall conform to harbor regulations common to them and to fishing vessels of Canada or Newfoundland.\"\n\nI do not think that requires any reference on my part because it speaks for itself, and it simply provides that whatever harbor regulations there are in force the fishing vessels shall be obliged to conform to them. Article 10 further provides:\n\n\"They need not report, enter, or clear, when putting into such bays or harbors for shelter or repairing damages, nor when putting into the same, outside the limits of established ports of entry, for the purpose of purchasing wood or of obtaining water; but they may, and shall, maintain a constant watch during twenty-four hours inclusive of Sundays and legal holidays, within any such port, or communicating with the shore therein, may be required to report, enter, or clear; and no vessel shall be excused hereby from giving the information to boarding officers.\"\n\nI may say, Sir, with reference to this, that a great deal was made of the apparent injustice of subjecting fishing vessels obliged to put in for humane purposes, such as vessels in distress and vessels under stress of weather to rigorous restrictions. A great deal was made of the difficulties that were thrown in their way, and of obstructions that were put in their way, and by Canada in the way of their exercising and enjoying all those privileges that the Treaty of 1818 clearly and distinctly provided they should enjoy. I think, Sir, that this House and the people of this country will agree with me that it was not undesirable in the interests of good neighborhood, in the interests of the good reputation of Canada for humane and friendly consideration to fishing vessels obliged to put into our ports for shelter, and especially where they had under the treaty a right to come in under such circumstances, that we should remove any obstructions or hindrances that lay in their way. It was argued, on the other hand, that the United States fishing vessels were not treated with the same stringency that those vessels were which under treaty right are permitted to come into our waters for those four purposes, and evidence was placed before the conference to show that in the port of Portland the course pursued was a more liberal course than the stringent regulations which had been used in Canada. The collector of that port who had been collector for 30 years was examined and gave his testimony as to the treatment of the Dominion vessels in the United States waters. He was asked:\n\n\"During the time you have been deputy collector, whether or not, there have been numerous cases of Dominion vessels, including vessels engaged in the fishery trade, which, if they failed to report, though lying more than twenty-four hours, have not been imposed for such failure during the term of your service?\"\n\nHis answer was, as I remember:\n\n\"If there were any instances of Dominion vessels failing to report while lying more than twenty-four hours, their names have not been recorded by the port officer. I do not recall from memory a single instance where or where a penalty was imposed, and I find no record of any such payments in the accounts of this office.\"\n\nUnder those circumstances we felt that we might fairly allow vessels that had no connection with the shore fishing vessels coming in distress, or vessels coming in under stress of weather to take shelter on our coast, that we might fairly exempt them from reporting for a period of 24 hours provided they did not touch the shore. It was represented that in many cases the previous regulations had involved great hardship and difficulty, that the custom houses were remote from the outlying portions of the harbor where the shelter was obtained, and that to remain long enough to go to the custom house, suffer delay, and make the necessary report would involve a very serious delay and might prevent them getting to sea at all the time they would desire. I do not conceive that any very great injury to our interests is likely to result where these privileges are only extended to vessels which are not permitted at all to communicate with the shore. The moment they have a communication with the shore, that moment it is incumbent upon them to report, or they are liable to the pains and penalties provided by this Act if they do not do so. I think this House will agree with me and I believe the people of this country will agree with me that it was a wise provision to\nrelieve them of what they found to be a great hardship, and so aid in effecting the removal of a very false impression abroad where people did not understand how stringent the necessity was for guarding our coasts.\n\n\"They shall not be liable in such bays or harbors for compulsory pilotage.\"\n\nIt was represented that a fisherman coming in by distress or by stress of weather might be compelled to take a pilot or was subject to the charge not a pilot and that this was felt to be very onerous while the fact is that our own fishermen were practically free from any such pilotage regulations and it was therefore a concession to remove the pilotage dues. I admit it was a concession to relieve them from the charge of pilotage. It was a case in which in my judgment \"the play was not worth the candle,\" and the money that would be obtained for pilotage was very small, while it would create a most unpleasant impression abroad if it were understood that while giving them the shelter the treaty compelled us to give them, we took the opportunity to force upon them a charge for pilotage that they did not require and which they thought unnecessary.\n\nMr. MITCHELL. Are not vessels under a certain size exempted from pilotage, Sir Charles?\n\nSir CHARLES TUPPER. Under 80 tons they are exempt. As my hon. friend knows our fishermen are pilots themselves, and they do not require to pay, and this was practically putting their fishermen upon the same footing as our own fishermen in regard to this charge.\n\nMr. MITCHELL. Certainly.\n\nSir CHARLES TUPPER. And the same regulation, we were informed, was the practice in the ports of the United States. At all events we believed that that was not a very great concession to make.\n\nMr. MITCHELL. It is not much.\n\nSir CHARLES TUPPER. My hon. friend is right; it is not much. I think he will quite agree with me it was too small a matter to quarrel over—too small a matter to be a question of a breach between two nations.\n\nMr. MITCHELL. If you did nothing more than that we would be satisfied.\n\nSir CHARLES TUPPER. At the same time it was a contention, and it was a concession for the purpose of meeting them halfway as far as we were able, and which we were glad to be able to do. The article further says:\n\n\"They shall not be liable in such bays or harbors for compulsory pilotage; nor when therein for the purpose of sheltering repairing fishing purposes, fishing or other objects which may be liable for harbor dues, tonnage dues, buoy dues, light dues, or other similar dues; but this enumeration shall not permit other charges inconsistent with the enjoyment of the liberties reserved or secured by the Convention of October 20, 1818.\"\n\nThe truth is that although there appears to be a considerable concession in that, it does not amount to much from the fact that they have no light dues. In Newfoundland where they have, either heavy light dues or a much more serious concession than it is in Canada, but Mr. Winter, the able Attorney General of Newfoundland, whose advice and assistance we had throughout these negotiations, felt that that was a concession which the island of Newfoundland would not object to although they would lose something in the way of light dues. Now, Sir, article II provides:\n\n\"United States fishing vessels entering the ports, bays and harbors of the eastern and north-eastern coasts of Canada or of the coasts of Newfoundland under stress of weather or other casualty may unload, reload, tranship or sell, subject to customs laws and regulations, all fish on board, which shall be landed, or transferred on board another vessel, or be disposed of in any manner, and may repatriate cattle, provisions and supplies damaged or lost by disaster; and in case of death or sickness shall be allowed all needful facilities, including the shipping of crew.\"\n\nI do not think, Sir, I shall have to take much time in satisfying this House that, although it is a very considerable and important concession, and although we were not compelled, in my judgment, under a strict literal interpretation of the Treaty of 1818 to make it, yet it was a wise and judicious concession to make. Why would we thought of Canada if an American or a United States fishing vessel did not like to use the word American, because I think it is a term we have as much right to as our neighbors; I prefer to speak of them as the people of the United States, and ourselves as Canadians, and when I speak of the whole continent of America, I do not hesitate to apply the term American to the people of both Canada and the United States—but what would be thought of Canada if a vessel of the United States, loaded with fresh mackerel or fish of any other description, were driven by stress of weather, and perhaps in a sinking condition, be compelled to \"escort\" to Quebec or Montreal instead of allowing her to discharge her cargo or sell it on paying the duty and go upon a marine slip for repairs, we said: No, you must throw overboard the whole of your cargo, because we find you are not allowed to bring your fish into Canada?\n\nMr. MITCHELL. Do you not refuse a vessel that privilege?\n\nSir CHARLES TUPPER. I say that under the Treaty of 1818, we could refuse. Under the strict interpretation of that treaty, they had no right to unload their cargo and tranship or sell it; but what I say is that in making this concession it is an undoubted concession—we were only acting from the dictates of humanity and with a due regard to the credit and reputation of our country all over the world.\n\nMr. MITCHELL. But I ask the question, did you not refuse it in one case?\n\nSir CHARLES TUPPER. No, I did not refuse.\n\nMr. MITCHELL. You would not, I know; you are too warm-hearted.\n\nSir CHARLES TUPPER. If my hon. friend really wants a frank answer—and he knows how frank I desire to be on all these occasions—I will tell him. We said: Under this treaty you have no right to do it, but we will allow you to do it when the application was made; but, we said it must not be regarded as a precedent, but it is a concession, and in attempting to reach a settlement of these questions there must be concessions on both sides. Article II further provides:\n\n\"Licenses to purchase a stipulated quota of entry of the aforesaid coast of Newfoundland, in Newfoundland, for the homeward voyage; such provisions and supplies as are ordinarily sold to trading vessels shall be granted to United States fishing vessels in such ports promptly upon application and without charge, and each vessel, being licensed, licensed to enter may, after having also been accorded upon all occasions such facilities for the purchase of casual or needful provisions and supplies as are ordinarily granted to trading vessels; but provisions and supplies shall not be obtained by barter, nor purchased for resale or trade.\"\n\nThat was another concession. There is no doubt at all, Sir, that these were rights which under the strict terms of the Treaty of 1818 they could not demand, nor could they insist upon them being granted; but at the same time I think I am within the judgment of the House on both sides, when I say that in the case of a vessel which is homeward bound and requires provisions or needful supplies to take her home, if, for instance, she has some of her rigging carried away, or some of her salt washed overboard, and is obliged to lose\nher voyage is going back to a distant port to rest, a provision that she may obtain casual and needful supplies of that kind was demanded in the interests of good neighborhood, and it was not going too far to say that we would allow them to enjoy these advantages. Therefore, Sir, I am glad to believe that article 11 will meet with the hearty approval of the House and the country, and that they will feel that we have only acted with a wise judgment, and with due regard to the best interests of Canada for the sake of removing an international unpleasantness, in putting these provisions into this treaty. Article 12 provides:\n\n\"Fishing vessels of Canada or Newfoundland shall have on the Atlantic coast of the United States the same privileges accorded and secured by this treaty to United States fishing vessels in the aforesaid waters of Canada and Newfoundland.\"\n\nI do not pretend that this is accomplishing a great deal, because, as is well known, Canadian fishing vessels do not require to resort to any great extent to the waters of the United States; but at the same time it is a reciprocal arrangement, and it shows that we are not granting anything to the fishermen of the United States that they are not reciprocally entitled to extend to the fishermen of Canada. Article 13 provides:\n\n\"The Secretary of the Treasury of the United States shall make regulations providing for the conspicuous exhibition by every United States fishing vessel of its official number on each bow; and any such vessel found guilty of disobeying such regulations shall be liable to pay with such violations shall not be entitled to the license provided for in this treaty. Such regulations shall be made by Her Majesty's Government previously to their taking effect.\"\n\nThe object of that is obvious. Under the arrangements of the Government of the United States every vessel has an official number, and it will save a great deal of trouble if that official number is required to be exhibited in such a conspicuous form that the fishermen of the United States will know that it is an American fishing vessel. That will enable you to investigate her character and position and everything about her. Although I have seen the Government of the United States very severely criticised for subjecting these vessels to such an indignity, I do not regard it in that light at all. It is purely a matter of business between the two countries for the purpose of facilitating the recognition of vessels, and thus making it much easier to deal with any question that may arise in relation to her; and when a Canadian fishing vessel has been given a license, the moment you see a vessel, you will know whether she has a license or not. This measure gives you an opportunity of identifying a vessel, and protecting your fishing grounds much more effectually than you could do without it. Article 11 provides:\n\n\"The penalties for unlawfully fishing in the waters, bays, creeks, and harbors referred to in article 1 of this treaty, may extend to forfeiture of the boat or vessel and appurtenances, and also of the supplies and tackle used therein, and the contents thereof; and for preparing to such extent to unlawfully fish therein, forfeiting shall be fixed by the court, not to exceed those for unlawfully fishing.\n\nThat is to say, if you are able to establish a charge against the vessel of unlawfully preparing to fish, the court may in its judgment forfeit the vessel, but a discretion is left with the court, which it had not before, of imposing a comparatively much lighter penalty than the forfeiture of the vessel. I do not think anybody will question the wisdom of dealing with this question as we have done. We have left the penalty for unlawfully fishing to extend to the forfeiture of the vessel and everything appertaining to her. I think the House will agree with me that the penalty for the lighter offence may be lighter, and that the efficiency of the law is likely to be much greater with the lighter penalty than with the extreme ones that existed before.\n\n\"And for any other violation of the laws of Great Britain, Canada or Newfoundland relating to the right of fishing in such waters, bays, creeks, or harbors, penalties shall be fixed by the court, not exceeding in all three dollars for every ton of the boat or vessel concerned. The boat or vessel may be held for such penalties and forfeitures.\"\n\nThat penalty does not apply to unlawful fishing or preparing to fish, but it applies to the lighter offences, such as attempting to purchase bait or anything of that kind. The penalty is reduced to a reasonable amount, $3 per ton, but yet sufficient in the judge's opinion to secure prompt and more prompt and effective administration of the law than would be secured if you raised the penalty a great deal higher.\n\n\"The proceedings shall be summary and as inexpensive as practicable.\"\n\nI do not know that anybody but the judges in the courts of Vice-Admiralty could complain of that. The object of every civilized country should be to have the laws administered in an inexpensive and summary mode as practicable.\n\n\"The trial (except on appeal) shall be at the place of detention, unless the judge shall, on request of the defence, order it to be held at some other place adjudged by him more convenient.\"\n\nThat is to say, it is proposed that instead of bringing these cases to the Court of Vice-Admiralty at Halifax, or St. John, N.B., or Quebec, as the case may be, it is proposed that a judge shall be sent to deal with the case in a summary manner, that the trial shall take place immediately after the prisoner, jurors, witnesses, and all present, and the facts can be ascertained, and thus save the cost and inconvenience occasioned by laying up a vessel for a year or two while awaiting judgment.\n\nMr. MITCHELL. Such as occurred in the Adams case.\n\nSir CHARLES TUPPER. There are two sides to that case. The delay did not rest altogether with us, but a very long delay took place at the instance of the owners of the Adams.\n\n\"Security for costs shall not be required of the defence, except when bail is required. Reasonable bail shall be accepted. There shall be proper appeals available to the defence only; and the evidence at the trial may be used on appeal.\"\n\nThat is, we do not propose to appeal against the judgments of our own judges, but we allow an appeal to foreigners who are affected by the judgments of our own judges and who have not the same confidence in their judgments that we have. All this is done for the purpose of saving time and costs, thus avoiding endless irritation through delay.\n\n\"Judgment of forfeiture shall be reviewed by the Governor General of Canada in Council, and the Governor in Council of Newfoundland, before the same are executed.\"\n\nThus in a case in which, for unlawfully fishing or for unlawfully preparing to fish, the judge forfeits the vessel, that decision shall not be carried into execution until the Governor General in Council shall have had the opportunity of deliberately examining the evidence upon which that judgment was founded, so as to remedy the judgment if they think there is any ground for the exercise of greater lenity than the judge has felt himself able to use.\n\nArticle 16, as I said, a contingent article. As I have already informed the House, the proprietaries of the United States stated they were quite unable to put anything in the treaty that would necessarily touch the fiscal policy of their country. They said that to do so would be simply to invite rejection of the treaty, on the ground that they had infringed the jurisdiction which Congress possessed, the United States Congress having, as I have shown the House, adopted, in the most emphatic form, the policy not to allow any changes in their tariff except by the act of Congress itself. We therefore put this in the contingent clause. We provide absolutely for the concessions that have been made with reference to indemnification, and with reference to the treatment of United States fishing vessels, who are compelled to resort to our ports in distress, in a period of casual supplies or for a homeward voyage. All these were made absolute by the treaty; but when it came to that which is of great value to the United States fishermen, when it came to\nthat which enables the United States fishermen to make Canada a base of supplies for the purpose of better competing with our own fishermen. We then felt that we had a right to take advantage of it. His Majesty's government, however, not being able to support the extreme contentions of the Canadian Government, his gentlemen will find that, on the other hand, the plenipotentiaries of the United States, who had, as a matter of diplomatic intercourse, taken a very strong ground as to the indefeasible rights of American fishing vessels to obtain, in our ports, as commercial vessels, whatever supplies they required for carrying on their fishing—to be able to purchase bait, to be able to purchase supplies of every kind and to be able to transport their fish—they will find that our friends on the other side had, in the same way, to concede a great deal as compared with the extreme positions that they had made. Here is what provided, as just and proper security to the interests of the fishermen of Canada, who have the right, while excluded by heavy duties from the markets of the United States, to such protection as the Treaty of 1818 has provided for them, that whenever the question arises as to Canada being made the basis of supply for the American deep sea fishing vessels—because the question of fishing is not in controversy at all, the Americans having given up the right to catch fish in the inshore waters of Canada—that only can be done for a sufficient quid pro quo. We have, therefore, provided in article 15:\n\n\"Whenever the United States shall remove the duty from fish-oil, whale-oil, or oil, and fish, as aforesaid (except fish preserved in oil), but the provisions of this article shall not apply to the fisheries of Newfoundland, including Labrador, as well as from the usual and necessary casks, barrels, kegs, cases, and other usual necessary coverings, and also from the usual and necessary coverings and cases for the produce of fisheries carried on by the fishermen of the United States, as well as the usual and necessary coverings of the same, as above described, may be admitted free of duty into the Dominions of Canada and Newfoundland.\n\n\"And upon such removal of duties, and while the aforesaid articles are allowed to be brought into the United States by such subjects as may be entitled thereto under the provisions hereof, the said bays and harbors of the aforesaid coasts of Canada and Newfoundland shall be accorded to United States fishing vessels by annual licenses, free of charge, for the following purposes:\n\n\"1. The purchase of provisions, bait, ice, seines, lines, and all other supplies and outfits;\n\n\"2. The purchase of fish, for transport by any means of conveyance;\n\n\"3. Shipping of crews.\n\n\"Supplies shall not be obtained by barter, but bait may be so obtained.\n\n\"The like privileges shall be continued or given to making vessels of Canada and Newfoundland on the Atlantic coasts of the United States.\"\n\nI think that is a measure which will meet with the hearty approval of the House. I think that will be regarded as a fair and reasonable proposition, that, if fishing vessels of the United States are allowed to make Canada a base for obtaining their supplies and furnishing all the materials necessary for the outfit of a fishing-vessel, and for transporting their catch, and making our harbors and ports the means of carrying on their industry, the fishermen of Canada, with whom they are in that case better able to compete than they could otherwise, are entitled to have their fish entered free in the ports of the United States. While the plenipotentiaries of the United States were not able to make this an absolute provision, I do not hesitate to say that I look confidently to the period in the not remote future when it will be made free and the fishermen of the United States will be able to obtain all the advantages in our ports which are here given to them. It will be observed that we have made this much larger in its provisions than either the Reciprocity Treaty of 1818 or the Washington Treaty of 1871, and as we have made it cover many places which were not covered by either of those treaties, and not only that, but we have taken care to guard against what might be called the rather sharp practice, if such a term were admissible in regard to a neighboring country, that, while allowing our fish to come in free, they should impose a duty upon the cans or tins or coverings in which the fish were included. More than that, we have made this cover all the inland waters of Canada, as well as the sea coast, and have made this provision as to the entry of free fish, and that they take advantage of the clause, and make Canada the base of their supplies, apply to the fish of British Columbia, that is, to the whole of Canada, the same as it does to the Atlantic coast. I think I have now dealt with the treaty in its entirety as it stands, and I have only to refer to the modus vivendi in Schedule B, which provides that, while this treaty is sub judice, before it can be ratified by the Senate of the United States, the Parliament of Canada and the Legislature of Newfoundland, during two years or pending that ratification, until those privileges to which the American fishermen would be entitled if our fish is made free, those privileges shall be enjoyed by the American fishermen without the payment of $1.50 per ton. I need not tell you that, on the eve of the ratification of a treaty of this kind by the Senate of the United States, a collision between the fishermen of the two countries or anything which would incite hatred or become a cause of prejudice would probably prevent the ratification of a treaty which would be otherwise ratified, and to prevent that we offered in this modus vivendi for two years the privilege to these United States fishermen of obtaining these various benefits which are provided for in the treaty by the payment of $1.50 per ton. I do not think it will be doubted as an extraordinary rate, and I think it will greatly conduce to good neighborhood between the United States and Canada. This modus vivendi was accepted by the United States plenipotentiaries in the most kindly spirit. They recommended the President to submit it to the Senate for their information, and I think I may say that it carries on the face of it the approval of the Governments of both countries. Now, having referred to the various provisions of the treaty, I am happy to say that I shall have to detain the House but a few minutes longer; but I would like to say, in addition to the Hon. Mr. Kent, has been accomplished by this treaty, I have told you what position Canada stood in with regard to the United States of America before the initiation of these proceedings. I have told you that we stood face to face with an enactment which had been put on the Statute-book by a unanimous vote of Congress, ratified by the President, providing for non-intercourse between the United States and Canada. I need not tell you that that bill meant commercial war, that it meant not only the ordinary suspension of friendly feeling and intercourse between two countries, but that it involved much more than that. If that bill had been brought into operation by the proclamation of the President of the United States, I have no hesitation in saying that we stood in the relation to that great country of commercial war, and the line is very narrow which separates a commercial war between two countries from an actual war. Speaking a year ago, I pointed out in my remarks, with a view to prevent the possibility of such an Act going into force, all the advantages that in our present position we could avail ourselves of to protect ourselves against such an unfriendly act on the part of the United States. I said then that it would be a mistake to say so much as that there was any element of the attitude of social relations which exist between Canada and the United States could contemplate such an Act going into operation without feeling that it would tear up from the foundation these intimate social and commercial relations which exist between these two countries, which, in friendly commercial rivalry, are making rapid progress which has attracted the attention of the civilised world. It would produce a condition of things the end of which no man could foresee. If that Act had been adopted, we had no means of looking to any increased com-\nmercial intercourse between that great country and the Dominion of Canada. Under those circumstances, it behoved the Government of Canada to adopt any means in its power to avert such a disaster, which, great as it would have been to Canada, would also have been a grievous blow to the United States. But it would be a very poor compensation for the injury which we would sustain, to know that we had a companion in misfortune suffering more than we suffered ourselves. We found Congress putting on the Statute-book a direction to the President that, on the first United States vessel being seized or harassed, or refused the advantages which they said they were entitled to, he, as the Executive of that country, should put that Non-intercourse Act into force. That was the condition of things when I went down last Easter to see Mr. Bayard at Washington. If you compare the condition of things to-day with the condition of things that existed then, there is no man, I care not how partisan he may be, who would not be friendly to this Government. He may be, who can judicially look at the position of this question then and now, without coming to the conclusion that we have emerged from midnight darkness into the light of day under the auspices of this treaty. It may be said: Suppose that the treaty is rejected by the United States Senate—a not impossible contingency—I need not tell the House that one of the advantages we enjoy under British institutions, is that we are saved from the bitterest and most violent antagonisms of party that every fourth year the Presidential election brings about in the United States. Now any man who knows anything of the politics of the United States, knows that however good a measure is, however valuable, however much it commends itself to the judgment of every intelligent statesman in that country, it is a matter almost of honor on the part of the party in opposition to prevent the Government of the day from doing anything that would give them any credit or strengthen their hands in the country; that on every occasion of Presidential election, it is next to impossible to induce a Republican majority in the Senate to sanction anything that a Democratic Administration has carried through, however valuable that may be. But, Sir, take the very worst contingency, suppose this treaty is rejected by the Senate, what then? Will we be relegated back to the position we stood in a year ago? Not at all. If our efforts, by mutual conciliation, by concessions on both sides, to find a common ground, that we could present to all the parties to the treaty, as an honorable and equitable agreement, that might be fairly accepted, if these efforts had failed, if, after three months' negotiations, we had broken up with embittered relations, because we found that it was impracticable to get any common ground of meeting on which the Governments of the two countries could agree, there is no question that matters would have stood in a worse position than that in which they stood when we undertook these negotiations. But, Sir, that is not the position. Let the Senate of the United States tomorrow reject this treaty, I trust they will not do so; I have a hope that there is independent sentiment enough in the most Republican party in the United States, who have the power at their disposal today in the United States Senate, to allow that sentiment of patriotism to outweigh the party advantages they might hope to obtain by preventing the present Administration from settling this vexed question—but when they remember that for 70 years, these questions have been agitated which are now disposed of, they may see that if they should come into power themselves at any early date it would be an advantage to have this vexed question between the two great English-speaking nations of the world set at rest, that there may be no renewal of the difficulties which have existed so long a time. But let me take the very worst contingency, that of the rejection of this treaty, and how do we stand? Why, Sir, let me read from a letter of the Secretary of State of the United States, written to the citizens of Boston, who invited him to go there to deliver a speech upon the treaty. In Mr. Bayard's letter, of 26th March, he says:\n\n\"I am convinced that the welfare and true interest of our country and of just and wise treatment of the British American population on our northern frontier alike counsel the adoption of the treaty. In its interpretation, negotiation and conclusion, I can only say that I am convinced, and my belief is that those of a similar mind and patriotic intent have been allowed place or expression, nor can a trace or suggestion of partisanship be justly alleged. The vast and difficult question to which the treaty relates, the history of this nation, the relations of its national waters of another, began with the first dawn of our reconquered independent existence as a nation and ever since has conspicuously presented itself as a subject of controversy, of discussion, of debate, of indignation or pre-eminently disputed. Meanwhile, the surrounding circumstances have importantly changed in advance with rapid and vast growths. The spirit of the times remains unchanged in its terms by several centuries of such material progress and development as is manifest, as we of to-day are the witnesses. Unless the Treaty of 1818 shall be wholly thorough and secure, it will be but to the dangerous extent that the Queen Anne Act, so ably and zealously carried out by Lord Bathurst of Bathurst, in 1815, and which had realized all efforts of negotiation and of Ghent in the year previous, it is manifest that a joint and equitable administration of the rights with which the respective relations of mutual needs must be agreed upon between Great Britain and the United States and this, I affirm, is done by the present treaty.\"\n\nAgain he says:\n\n\"Conciliation and mutual neighborly concessions have together done the honourable and honest work in this treaty, paved the way for the relations of peace and prosperity which it contemplates.\n\nNow, Sir, I ask you whether all the time, all the trouble expended in this matter is not amply compensated for by the declaration of the Secretary of State of the United States bearing his tribute and his testimony to this Treaty as a fair, equitable and just interpretation of the Treaty of 1818. And what more, Sir? Let me read from the Message of the President of the United States:\n\n\"As a result of such negotiations, a treaty has been agreed upon between Her Britannic Majesty and the United States, concluded and signed in this city, under the authority of the Senate, on the 14th of February last, and which I now have the honor to submit to the Senate. The recommendations that it has received the consent of that body, as for the ratification, constitute, in order that the negotiations thereof, may be duly exchanged and the treaty carried into effect. The treaty meets my approval, because I believe that it supplies a satisfactory and complete adjustment, and a basis of future relations to both parties, of the difficult and vexed question to which it relates. A review of the history of this question will show that all formal attempts made at its settlement, including the provisions of the second article of the Treaty of October 20, 1818, have been unsuccessful and with the lapse of time the difficulty and obscurity have only increased.\n\n\"The negotiations in 1854, and again in 1871, ended in both cases in temporary reciprocal arrangement of the tariffs of Canada and Newfoundland, and the award of a part of the territory of the St. Lawrence River by the United States. Under these the real questions in difference remain unsolved, in abeyance, and ready to present themselves anew, just as soon as the conventional arrangements were abrogated.\n\n\"The situation, therefore, is precisely that which existed at the Treaty of 1871, and a grave condition of affairs, presenting almost identical the same features and causes of discontent by the United States and dissatisfaction by the British Government in this situation, confronted us in May, 1894, and has continued until the present time.\n\n\"The four purposes for which our fishermen under the Treaty of 1818 were permitted to fish within the five and a quarter degrees of latitude, and within the belt of three hundred miles, were stated under a fair and liberal construction, and their enjoyment secured without such conditions and restrictions as in the past have embarrassed and obstructed their operations.\n\n\"The enforcement of penalties for fishing or preparing to fish within the inshore and exclusive waters of Canada and Newfoundland is to be conducted in such manner as to avoid delay or arbitrary action, thus protecting the defendant fishermen from punishment in advance of trial, delays, and inconvenience and unnecessary expense.\n\n\"The possibility of arrest for fishing in the actual distress, with liberty to unload and sell and transport their cargoes, is full and liberal.\n\n\"These provisions will secure the substantial enjoyment of the treaty rights for our fishermen under the Treaty of 1818, for the contention has been steadily made in the correspondence of the Department of State, and by our Minister at London, and by the American negotiators of the treaty.\n\n\"The treaty now submitted to you has been framed in a spirit of liberal equity and reciprocal benefits, in the conviction that mutual\nadvantage and convenience are the only permanent foundation of peace and friendship between States, and that with the adoption of the treaty now placed before the Senate, a beneficial and satisfactory intercourse between the two countries will be established as well as procure perpetual peace and harmony.\n\nIn connection with the treaty now submitted I desire to also pay my respects to the Senate a written offer or arrangement in the nature of a medusa head, tendered on the conclusion of the treaty on the part of the British plenipotentiaries, to secure kindly and peaceful relations between the two countries, and for the further consideration of the treaty by the respective Governments and for the enactment of the necessary legislation to carry its provisions into effect if approved.\n\nThis proposal was made at their own motion, agreed to by the British government, not only without any attempt to coerce, but pending the ratification of the treaty, but appears to have been dictated by a friendly and amicable spirit.\n\nI ask you to contrast that language with the position we occupied a year ago in regard to the great Republic to the northward. We then had no treaty with them, and I ask what is the changed position of Canada? Yesterday we stood face to face with a No-intercourse Bill, sustained by the united action of the Senate and House of Representatives, sustained by almost the whole press, Republican and Democratic, of the United States, sustained with few exceptions by a prejudiced, irritated and exasperated people of 6,000,000 lying on our borders. What, I repeat, is our position today? If that treaty were rejected by the Senate to-morrow, we have gained this advantage ground, that we stand in the position of having it decided by the Senate, instead of the United States and by the President of the United States that Canada has been ready to make, and that Her Majesty's Government, behalf of Canada, through her plenipotentiaries, have made an arrangement with the plenipotentiaries of the United States that is fair, just and equitable, and that leaves that country no possible cause of complaint. What is the result? The result will be this: that let a fisherman complain to-morrow of our interpretation of the treaty, of the enforcement of our most extreme construction of the treaty, the answer to him is this: Nobody is to blame for the inconvenience you suffer except the Senate of the United States. Your President, the executive of your party; Democratic or Republican from end to end of the United States, declared it was a fair settlement. They represent an undoubted majority, in my judgment, of the people of the United States to-day, and I believe they will represent it to-morrow. We stand in the position that instead of being alone with the whole United States, President, Government and people all against us, all denouncing us as adopting a harsh and barbarous interpretation of an old, antiquated treaty for the purpose of forcing reciprocity upon them, we occupy the vantage ground of having these men out of their own mouths declaring that nothing has been wanting on the part of the Government of His Majesty to put in practice the Dominion of Canada to place this question on a fair and equitable basis such as might honorably be accepted by the United States. I hold we have accomplished that without injuring in the slightest degree the fisheries of Canada, without injuring Canadian interests to any extent whatever. We have made concessions, as I have said, but we have made them with the avowed object of placing all our people, not only the fishermen, but the agriculturist, the lumberman, every man in this country in a better relation with the United States than he was before. What is the result? As I have said, Mr. Borden told me the American plenipotentiaries told us that there was but one way of obtaining what we wished. You want greater freedom of commercial intercourse. You want relaxation in our tariff arrangements with respect to natural products in which you are so rich and abundant. There is but one way to obtain it. Let us by common concession be able to meet on common ground and remove this irritating cause of difficulty between the two countries out of the way, and you will find that the policy of this Government, the policy of the President and of the House of Representatives, the policy of the great Democratic party of the United States, will at once take an onward march in the direction you propose, and accomplish steadily that which you would desire, is the only way by which it can ever be attained. These were not empty words, these were the sober utterances of distinguished statesmen, who pointed to the avowed policy of the Government of the United States as the best evidence of the sincerity of what they said. What has happened already? Already we have action on the part of the Executive of the Government of the United States, I mean Mr. Mills, the gentleman whom the United States Congress represents, the Government of the day, and stands in the position most analogous in the United States to the Finance Minister in this House, the Chairman of the Committee on Ways and Means, who propounds the policy of the Administration in the House. How is he selected? The Democratic party sustaining the Government selects a man as Speaker of the House of Representatives, who is in accord with the policy of the Administration for the time being, and Mr. Carlisle, the Speaker of the House of Representatives, nominates the Chairman of the Committee of Ways and Means and all the members of the committee, and therefore the Chairman of that committee occupies the position of representing the Government in bringing forward such Bills as will represent the views and sentiments of the Democratic party in the United States supporting the Administration. What have we seen? The ink is barely dry upon this treaty before he, as the representative of the Government and Chairman of the Committee of Ways and Means, brings forward a measure to do what? Why, to make free articles that Canada sends into the United States, and upon which last year $1,300,000 of duty was paid.\n\nSome hon. MEMBERS. We paid?\n\nSir CHARLES TUPPER. I ask, Sir, if that is nothing.\n\nSome hon. MEMBERS. Who paid?\n\nSir CHARLES TUPPER. I do not intend to insult both the great political parties of this country who have since 1854 and long before maintained that the interests of Canada—the interests of British North America—were intimately bound up in obtaining free intercourse with the United States for our natural products—I do not intend to insult the two great parties in this country by telling them that they were fools, that they did not know what they were doing. During the present hour we have adopted the policy on both sides of the House, and we have pledged ourselves to the people of this country that if we have power to obtain a free market for the natural products of our country with the United States, and I say you must answer me the question as to whether that was an act of supreme folly or whether it was wise statesmanship on the part of both parties in this country to adopt that policy, before you ask me such a question as \"who pays the duty?\" I say that under this Bill which has been introduced and which, I believe, will pass, for it does not require two-thirds of the Senate where the Republican majority is only one in the whole House to pass it, and it requires a majority of one only and I am very confident that the Bill will pass during the present session. Modified it may be, but I am inclined to think the amendments will be still more in the interests of Canada than as the Bill stands to-day. If this is the case I think we may congratulate ourselves upon securing the free admission of our lumber, upon which was paid during the last year no less than $1,315,450. On copper ore made free by the Mills' Bill we paid, or there was paid—to make it meet the views of the hon. gentlemen opposite more correctly—$95,945.\nOn sale $21,892 duty was paid. This is rendered free by the Mills' Bill. I am sorry to find as I hoped would be the case from the first copy of the Bill that came to me that potatoes were not included amongst vegetables. I am sorry to find there is a doubt, as to whether the term \"vegetables not specially enumerated\" will not exclude potatoes. In grappling with this policy of making the natural products of the two countries free, you do not expect any person who wants to carry a Bill to put a heavier load upon his shoulders than he is able to carry, lest he may break down and do nothing. You expect him to take it in detail, and as I believe, you will find the policy contained in this Bill of making those natural products of Canada free, carried out until you have perfect freedom of intercourse between the natural products of Canada and the United States of America. Of course we send last year 1,319,289 lbs. of one kind, and a variety of other kinds, upon which a duty was paid to the extent of $193,852. Now as I say on articles of prime importance and interest to Canada (the removal of duty by the Mills' Bill amounts to no less than $1,800,193. You will be glad to hear that I do not intend to detain the House any longer. In discharge of the duties—the very onerous and important duties—of one of Her Majesty's plenipotentiaries at that conference, I have steadily kept in view what in my heart and judgment I believed were the best interests of Canada. In the measure which I have the honor to submit to this House I believe will be found embodied a Bill which it is of the most vital importance to Canada to pass. As it stands today the Government of the United States have only my signature to sustain the course that has been taken. I was not there as the representative of the Government of Canada, nor can my signature to the Treaty necessarily imply the approval and support of Her Majesty's Government of Canada. I occupied on that occasion the position of one of Her Majesty's plenipotentiaries, charged not only with the responsibility of what I owed to Canada, but also the responsibility of my duty to the Empire. I can only say, Sir, that I felt I would best discharge my duty to the Empire by steadily keeping in view the interest of Canada. I believe, Sir, that there is no way in which any public man in this country can promote the interests of the great Empire of which we form a part, better, or as well as by taking such a course of public action as will build up a great British community in this northern portion of the continent of America. I believe, Sir, that we owe it to the Empire as well as to ourselves, steadily to keep in view every measure that will conduce to the rapid progress of Canada, the development of our inexhaustible resources and the building up of a great and powerful British Dominion on this side of the Atlantic. I say, Sir, that in the discharge of my duty I have steadily kept that conviction in view, and I believe the course which has been pursued will not only commend itself to the judgment and the support of the great majority in this House, but that the great majority of the people in this country will feel that in the adoption of this treaty we are taking a step that is calculated to conduce to the progress and greatness and best interests of Canada.\n\nPrinted by MacLean, Roger & Co., Parliamentary Printers, Wellington Street, Ottawa.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_27159.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 27, "total-input-tokens": 47120, "total-output-tokens": 35597, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2845, 3], [2845, 5330, 4], [5330, 9518, 5], [9518, 18029, 6], [18029, 25816, 7], [25816, 33745, 8], [33745, 41757, 9], [41757, 45739, 10], [45739, 55585, 11], [55585, 63571, 12], [63571, 71668, 13], [71668, 75672, 14], [75672, 84107, 15], [84107, 91214, 16], [91214, 98028, 17], [98028, 105635, 18], [105635, 113410, 19], [113410, 121604, 20], [121604, 128958, 21], [128958, 137251, 22], [137251, 145689, 23], [145689, 155180, 24], [155180, 163211, 25], [163211, 166628, 26], [166628, 166628, 27]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]