[{"id": "113f53d1efd89fc4f838888f32d9898b0f7a2f0b", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL'Institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/\n- [ ] Pages damaged/\n- [ ] Pages restored and/or laminated/\n- [ ] Pages discoloured, stained or foxed/\n- [ ] Pages detached/\n- [ ] Showthrough/\n- [ ] Quality of print varies/\n- [ ] Includes supplementary material/\n- [ ] Only edition available/\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nThis item is filmed at the reduction ratio checked below.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole — signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nReligious Excitements tried by Scripture,\nAND THEIR FRUITS TESTED BY EXPERIENCE.\n\nA SERMON,\n\nPREACHED IN THE PARISH CHURCH,\n\nON SUNDAY, THE 13TH FEBRUARY, 1842.\n\nBY\n\nTHE REV. T. B. FULLER,\n\nRECTOR OF THOROLD, IN THE DISTRICT OF NIAGARA.\n\nTORONTO:\n\nHENRY ROWSELL, KING STREET.\n\n1856.\nREPLY\n\nTO HEADS OF FIFTY FAMILIES REQUESTING COPY OF SERMON FOR PUBLICATION.\n\nIn reply to your letter of the 15th instant, just received by me on my return from Missionary duty, requesting me to allow you to publish my Sermon, delivered by me last Sunday in Thorold Church, I beg to say, that though it was not prepared with the most distant idea that it would be of any service beyond our more immediate neighbourhood, and although I can claim for it little originality; yet, since the heads of almost every family have united in the request so kindly transmitted by you, and have expressed their opinion that its publication will be serviceable to the cause of truth, I hesitate not to comply with your request—with what judgment, time will shew. It has been with no reluctance. My object in allowing its publication, as in its preparation, has not been fame, but utility. I believe that the cause of truth requires error to be honestly and fearlessly exposed. I believe that we are surrounded with error. Believing thus, I should be the veriest coward in the world, and utterly unworthy of my calling, were I afraid to preach and to publish what I solemnly believe to be true, lest, by combatting the errors, I should be exposed to the censures of those who differ so widely from us.\n\nThat the Giver of every good and perfect gift may guide you into all truth,—may enable you, through His grace, to live godly, righteous and sober lives here, and, for the merits of Jesus Christ, bestow upon you eternal life hereafter,—is the earnest prayer of,\n\nMy Friends and Parishioners,\nYour affectionate Pastor,\n\nNIAGARA FALLS, February 21st, 1842.\n\nThis Sermon being out of print, and its republication having been urged upon me by several of my brethren in the Ministry, I have consented to republish it.\n\nTHOROLD, 4th June, 1856.\n\nT. B. FULLER.\nA SERMON, &c.\n\n\"Beloved, believe not every spirit; but try the spirits, whether they be of God.\"—I John, iv. 1.\n\nThese are the words of the beloved disciple of the Lord Jesus Christ, the disciple who was privileged to lean on the bosom of the Son of God, whilst clothed with humanity. He appears to have been singled out by the Saviour on account of his sweet and amiable disposition. All his writings breathe that spirit. \"Beloved,\" says he, \"let us love one another: for love is of God: and every one that loveth is born of God, and knoweth God. He that loveth not, knoweth not God: for God is love. In this was manifested the love of God towards us, because that God sent his only begotten Son into the world, that we might live through him. Herein is love, not that we loved God, but that he loved us, and gave his Son to be the propitiation for our sins. Beloved, if God so loved us, we ought also to love one another.\"—(I John iv. 7-11). Yet, my brethren, his love did not cause him to leave those committed to his care, or those within the reach of his influence, exposed to the various errors that were rife in his day, without lifting up his voice against them. Even the sweet and amiable John could say, \"Beloved, believe not every spirit: but try the spirits, whether they be of God; for many false prophets have gone out into the world.\" In the same manner spake a greater than John,—one, who so loved us, as to spare not his own precious life, but to offer it up a ransom for our sins. \"There shall arise,\"—said He, \"who spake as never man spake,\"—\"There shall arise false Christs and false prophets, and shall show great signs and wonders; insomuch, that, if it were possible, they shall deceive the very elect.—Behold, I have told you before.\"—(Matt. xxiv. 24, 25). From these words of the blessed Saviour and his beloved disciple, we\nlearn three important facts. First, That we must expect errors and the propagators of errors; Second, That, these propagators of errors may be enabled \"to shew great signs and wonders: and Third, That, nevertheless, it is the duty of the Ministers of Christ to raise their voices against anything which may appear to them to partake of that nature.\n\nAt the time of St. John the extraordinary gifts of the Holy Spirit were still vouchsafed to men. Yet, even then, in those highly favoured times, when \"they spake with tongues, as the Spirit gave them utterance,\" \"many false prophets had gone out into the world.\" Even then, when an Elymas was struck \"blind for a season,\" or an Ananias and a Sapphira were struck dead, propagators of error went about, almost \"deceiving the very elect.\" Whilst St. Paul lived, the Judaizing teachers endeavoured to obscure the free salvation of the Gospel by teaching the disciples that they ought to conform to the law of Moses. To meet this error, St. Paul wrote his epistles to the Romans and to the Galatians. The doctrine of justification by faith only, as set forth in those epistles, was perverted after his time, so that men were led to suppose that a lifeless faith, a mere belief that such a person as the Saviour did come down from heaven, lived, died, and rose from the dead, was quite sufficient; though that faith produced no effect whatever upon their lives and conduct. To meet this error, St. James wrote his epistle. In like manner the very epistle, whence our text is taken, was written to meet the false teaching of those who denied the real deity of Christ, who explained away his proper humanity and the reality of his sufferings and death, as an atoning sacrifice. \"At this time,\" as an eminent commentator remarks, \"heretics came forward much more openly than at an earlier period.\"\n\nFrom that time to this error has prevailed. Even in St. John's time there were the Ebionites, the Cerinthians, the Gnostics, the Nicolaitans, and many others. Since his death, amongst a thousand minor heresies, we have recorded in ecclesiastical history those of the Manicheans, of the Arians, and of the Pelagians. In the present day we have sects without number, holding doctrines diametrically opposite to each other: some denying the Divinity of the Saviour, others the existence of a place of punishment hereafter; some laying aside both the Sacraments of the Gospel,\nothers \"forbidding little children to be brought to Christ.\" Can all be right?—Is truth so multifarious? St. Paul says, \"There is one body.\"—(Eph. iv. 4). And again, \"One Lord, one faith, one baptism.\"—(Eph. iv. 5). He says, in his epistle to the Corinthians, \"I beseech you, brethren, by the name of our Lord Jesus Christ, that ye all speak the same thing, and that there be no divisions among you.\"—(1 Cor. i. 10). Accordingly, in our incomparable Litany, we pray, \"From all error, heresy and schism, good Lord deliver us.\" This may appear illiberal in this age of false liberality. But we need not dread being considered illiberal, if we have for our companion in reproach the great Apostle of the Gentiles. But it may appear to some, that where error prevails, it may safely be left to God, to show mankind that it is error; that we may wisely adopt the language of Gamaliel, \"If this counsel or this work be of men, it will come to nought.\"—(Acts v. 38). This, however, was not the opinion of St. Paul, nor that of St. John. Mankind, unhappily, are more inclined to error than to truth. They, therefore, require to be warned of the former, and to be directed to the latter. This was the opinion of the great Reformers of the sixteenth century. They saw the whole of Christendom sunk, not in Pagan, but in Popish darkness.—They feared not \"to cry aloud;\" but buckled on their armour, and manfully exposed the errors wherewith the Church of Christ had become so enveloped in the course of ages, that had St. Paul or St. John risen from the dead, they could scarcely have recognized that Church, which was \"built upon the foundations of the Prophets and Apostles, Jesus Christ himself being the chief corner-stone.\" They were enabled, through the grace of God, to expose errors and to remove those corruptions; and have transmitted the precious bequest to us, the Church as she was in the first, the purest ages of Christianity. She presents to us the \"one Lord, the one faith, the one baptism.\"—(Eph. iv. 5). They had much to contend with. Their warfare was against principalities and powers. The Church of Rome had her wonders, her false miracles, and her astonishing prodigies. The power with which she swayed men's minds was truly surprising. She hurled mighty sovereigns from their thrones, and placed creatures of her own in their stead. She absolved subjects from their allegiance, or rather, she\nprofessed to do it. She rendered the murder of those whom she styled \"heretics\" meritorious in the sight of God, or rather, she asserted her power of doing so, and acted on that assertion, and all Western Christendom bowed to her will. But the Reformers arose in the spirit of St. John, and cried, \"Beloved, believe not every spirit; but try the spirits, whether they be of God.\" They preached salvation through the sole merits of our Lord and Saviour Jesus Christ. They brought every thing to the test of God's own word; and all the additions of men they threw away, and retained only what had been known in the early ages of Christianity. They acknowledged no penances, no pilgrimages, no purgatory necessary to the salvation of the immortal soul. They declared, as the Saviour had done before them, \"He that believeth and is baptized shall be saved; but he that believeth not shall be damned.\"—(Mark xvi. 16). They acknowledged no intercession of Saints necessary to the admission of a soul to bliss. But, whilst they reduced the blessed Virgin Mary, St. Peter, and all the other Romish Saints to their proper station, they exalted the Saviour, as the only \"name under heaven given among men whereby we can be saved.\"—(Acts iv. 12). And, my brethren, we must do the same. If we conceive that we see others in error, it is no want of charity, but the exercise of the truest charity, to declare it. Such was the charity of the blessed Saviour and his chosen Apostles.\n\nThe Saviour, on every occasion, shewed the greatest regard for the truth, both by revealing what was right, and by reproving what was wrong; and yet he so loved the world that he laid down his life for all, enemies as well as friends. All the Apostles evinced their love for mankind, by spending their days and willingly laying down their lives, that the truth of the Gospel might be made known to all nations; yet they sharply rebuked error, wheresoever they found it, and unequivocally condemned divisions in the Church, wheresoever they perceived them. On these holy examples, it becomes us to build our practice; and hence we ought to conclude, that the strongest proof of Christian love we can exhibit is to warn men of their errors, and to point out to them, as far as we are able, the narrow path which our Lord trod, and in which his disciples ought to walk, even to the end of time. \"Charity rejoiceth in\nthe truth,\" and therefore would not lead us to believe that error or indifference, in regard to things sacred, is harmless or safe. Consequently the prayer of our Church is, \"that all who profess and call themselves Christians, may be led into the way of truth, and hold the faith in unity of spirit, in the bond of peace, and in righteousness of life.\"—(Prayer for all conditions of men). I frankly admit that, in my opinion, Christian love or charity does not go to the length of deceiving any one, by speaking \"peace, where there is no peace,\" or falluring the unwary into danger, by calling evil good, or good evil; or of making any indifferent to things sacred, by the groundless and unscriptural assertion, that it will make no difference at the day of judgment, whether a man has endeavoured, in all respects, to keep the unity of the spirit in the bond of peace; or had, on account of convenience, or prejudice, or some such motive, separated himself, and thus lent himself to promote dissension, and strife, and all sorts of bitterness amongst those who bear the Christian name. It becomes us, therefore, to give heed to the injunction of the text, \"Beloved, believe not every spirit; but try the spirits, whether they be of God.\" But, you may enquire, \"How are we to try them?\" I answer, \"By the Word of God.\" It is the only rule. (See Article sixth). For all true religion must be conveyed to us by revelation from heaven in the first place, dictated to us by infinite wisdom, perfect goodness, and eternal love. What is recommended to us by a being of such transcendent perfections, cannot be improved upon by poor, weak, short-sighted, ignorant man. It must remain fixed, according to the will of Him who first gave it. If anything deserves to be called folly and madness, it is the preferring human inventions to the wisdom which comes from above.*—This was the error into which the Church of Rome fell.—This was the secret spring whence flowed all her corruptions. She was unwilling to abide by the directions of the Word.\n\n* The following language was used by one Buchard, a Presbyterian Minister, and a great promoter of \"Protracted Meetings,\" at Woodstock, in Vermont, in 1835:—\"You like improvements in every thing, excepting religion. Must things always go on in the same old way? When I was young, we used to winnow grain with a fan, and it was slow work. Afterwards a machine was invented that would work much faster.—The more work it turned off the better. So with religion. I used to work as hard as I could to get 8, 9, 10 or 11 converted. I expect to live to see 3,000 converted in a day.\"\nof God; but chose to herself, one after another, the inventions of man. (See last page of No. 21, Vol. V. of The Church). —What was the adoration and invocation of Saints? What the adoration of relics? Man's inventions. What else was her purgatory, her auricular confession, her transubstantiation?—These were some of the things with which she had corrupted the purity of the doctrine of Christ. The Reformers tried her by the Word of God; retained what was in accordance therewith, and rejected the rest. And so must we do with those, in our days, who would bring in among us newly invented plans and unscriptural practices. We must try them by the Word of God. Had the Church of Rome done this, she never would have departed from the faith. Had the Protestants of Geneva and Germany done this, they would not have fallen into the mire of Neology. Man's inventions may appear beautiful to the eye, and admirably adapted to the end he has in view, but \"there is no wisdom, nor understanding, nor counsel, against the Lord.\"—(Prov. xxi. 30).\n\nIf, therefore, you hear any practice of your fellow-Christians spoken of, however excellent it may appear, and however great may be the success which attends it at the first, bring it \"to the law and to the testimony,\" and if you find that it accords not with that test, beware of it. No doubt many inventions adopted by the Romish Church appeared excellent at the time of their adoption, and admirably adapted to the end she had in view; but we know to what they led. No doubt the practice of some of our fellow-Christians of the present day, of begging, and persuading, and frightening, and dragging people up to a particular seat, appears an admirable plan. —But do we find any notice of such a practice in the Word of God? We find the blessed Saviour and his Apostles \"preaching the word,\" and trusting to the Holy Spirit to apply that word to the consciences of their hearers. On the great day of Pentecost, St. Peter preached to the assembled multitude, and when they \"heard, they were pricked in their heart, and said unto Peter and the rest of the apostles, Men and brethren, what shall we do?\" Then Peter said unto them, Repent and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost.\"—(Acts ii. 37, 38). When the Philippian jailor cried out to Paul and Silas, saying, \"Sirs, what manner of men are these? who have received this word by night, and this is the first day of the week? Here we find the true way of salvation, formed by the Lord, unless we find it for you, for Christians, for you now, you must assert, that you sit in the seat of Moses, to whom all the world was assailed, and none of those that you say that you are, but of the Jews only. 23, 33. But they who received the word knew that it was not to them only, but to each of those in the same language.\n\nHow then came it upon the Gentiles? The nations were not without feeling, and they heard \"the word of the Lord by name.\" This is the true trite saying: You shall not mock.\nSilas, \"Sirs, who must I do to be saved?\" the answer he received was this, \"Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house.\"—(Acts xvi. 30, 31). Here we find Jesus Christ acknowledged as the only \"way, the truth, and the life.\"—(John xiv. 6). But we are informed, that there are those, in this our day, who say, that unless you go in the way they point out, a way of which we find no mention made in the Bible, there is no salvation for you,—that, unless you are willing to declare yourself for Christ and place yourselves under their special direction, you must consider yourselves \"for the Devil.\" It is asserted that, when they have brought up to this particular seat those whom persuasion, fear, or force has been able to love, they entirely forget the direction of St. Paul, to do all things \"decently and in order\" (I Cor. xiv. 40), but assail the throne of grace with such shouts, as would make one imagine that they supposed \"the Lord's ear was indeed heavy, that he could not hear.\" You that have witnessed this, compare it with what St. Paul says: \"If therefore the whole Church be come together into one place, and all speak with tongues,\" (that is, in a confused manner, so that none can understand what is said), \"and there come in those that are unlearned, or unbelievers, will they not say that ye are mad?\" \"God is not the author of confusion, but of peace, as in all churches of the saints.\"—(I Cor. xiv. 23, 33). Though this language was first addressed to those who misapplied the \"gift of tongues,\" yet it must be acknowledged by all sober-minded Christians as applicable to those who, a score at a time, address the throne of grace, each at the height of his voice, some in supplication, some in thanksgiving, some in deprecation, and others in the language of triumph.\n\nHowever well calculated this confusion may be to work upon the passions, or to affect a heated and excited imagination, it ill accords with that humble, holy, chastened feeling of adoration with which we sinners should approach \"the high and lofty One that inhabiteth eternity, whose name is Holy,\"—Him, who thus speaks of himself, \"To this man will I look, even to him that is poor and of a contrite spirit, and trembleth at my word.\"—(Isaiah lxvi. 2). You all remember how Elijah, the prophet of the Lord, mocked the worshippers of Baal and said, \"Cry aloud; for\nhe is a god; either he is talking, or he is pursuing, or he is on a journey, or peradventure he sleepeth, and must be awaked. And they cried aloud, and cut themselves after their manner with knives and lancets, till the blood gushed out upon them.\" How different the manner of Elijah! \"And it came to pass at the time of the offering of the evening sacrifice, that Elijah the prophet came near, and said, Lord God of Abraham, Isaac, and of Israel, let it be known this day that thou art God in Israel, and that I am thy servant, and that I have done all these things at thy word. Hear me, O Lord, hear me, that this people may know that thou art the Lord God, and that thou hast turned their heart back again.\"—(I Kings xviii. 27, 28,—36, 37).\n\nAnd again, to the same Elijah the command was given, \"Go forth and stand upon the mount before the Lord. And, behold, the Lord passed by, and a great and strong wind rent the mountains, and brake in pieces the rocks before the Lord; but the Lord was not in the wind: and after the wind an earthquake; but the Lord was not in the earthquake: and after the earthquake a fire; but the Lord was not in the fire: and after the fire a still small voice. And it was so, when Elijah heard it, that he wrapped his face in his mantle, and went out, and stood in the entering in of the cave. And, behold, there came a voice unto him, and said, What doest thou here, Elijah?\" &c.—(I Kings xix. 11–13).\n\nSt. James, speaking of heavenly wisdom, says, \"The wisdom that is from above is first pure, then peaceable, gentle, and easy to be entreated, full of mercy and good fruits, without partiality, and without hypocrisy.—And the fruit of righteousness is sown in peace of them that make peace.\"—(James iii. 17, 18). \"It is sown in peace,\" says an eminent commentator, \"not amidst great noise and disturbance: and by those who make peace, who are both peaceable and peacemakers, in the Church and in the world.\"—(Scott in loco). But we are told by some that the fruits of these meetings are good. It may be so. God sometimes brings good out of evil. But are we therefore to countenance the evil? I should be sorry to believe that there are no true disciples of the Lord Jesus Christ within the pale of the Romish Church. But are we, on that account, to countenance her pretended sacrifice of the Mass, her adoration of the Host, and her intercession of the Saints? Surely not. Many assert that which is contrary to the truth. Are we not \"happier\" to go dressing as they do, that they do not see no visage like this, to whom there are so many wranglings? Many say, \"We have a system of the United States against us, and we find it so.\" Almost every one in heresy. Wesley and the Church of England this ripe fruit of the spirit. \"I hear the sound and the voice of perfect holiness. Surely we must try them.\"\n\nBut where is he whose soul is pure? There is none. And surely, if he affirms it (Romans ii. 29), and Paul says, hypocrites, false slyters, liars, that they are very true, who is so imperator?\nnot. But if some are benefitted by these meetings, (as it is asserted), are we on that account to sanction proceedings which are at variance with the spirit of St. Paul’s epistle to the Corinthians, with the general tenor of God’s word? Are we to sanction a system which pronounces a creature “happy” or “accursed,” according as he is willing or not to go to an appointed seat, which allows of persons addressing females in the most obtrusive manner, and, when they decline their officiousness, authorises the declaration, that they are “going to the Devil.” This, my brethren, is no vision of my brain. A lady, not eight miles distant from this, told me that she was thus treated.—But if the fruits are so good, why so many contentions? Why so much wrangling? Why so much evil-speaking? Why so many divisions in those sects that adopt this system,—a system which has rent asunder the Presbyterians in the United States, and exhibited two bodies contending against each other? And within this very Province we find the same system producing the same effects. Almost every year or two Methodism sees a division in her ranks, so that now we have several bodies of Wesley’s professed followers, all calling themselves Churches, and all opposed to and opposing each other. Is this right? Is this as it ought to be? Are these the fruits of the Spirit? Is this obeying the injunction of St. Paul, “I beseech you, brethren, that ye all speak the same thing, and that there be no divisions among you: but that ye be perfectly joined in the same mind, and the same judgment.” Surely it is well for us “not to believe every spirit; but to try the spirits, whether they be of God.”\n\nBut some will aver, that there is great zeal amongst those whose proceedings are condemned. That too may be. There are few more zealous than the followers of Rome. And St. Paul did not deny that the Jews had “zeal,” but he affirmed, that with it they wanted “knowledge.”—(Romans x. 2). Our Saviour, too, addressing the Scribes and Pharisees, said, “Woe unto you, Scribes and Pharisees, hypocrites! for ye compass sea and land to make one proselyte.”—(Matt xxiii. 15). But still some one will aver, that the favourers of these strange practices are very devout, very temperate, and very self-denying. But, my brethren, who is more devout than the Romanist? who is more temperate than the follower of Mahomet, who drinks not even\nwine? and as to self-denial, none of the present day are to be compared to the pillar-saints of the fifth century, who \"stood motionless upon the tops of pillars, expressly raised for the exercise of their patience, and remained there for several years, amidst the admiration and applause of the stupid populace.\"—Mosheim, 1st vol., 5th century). I make not these statements, brethren, to insinuate that those who are zealous, devout, temperate, or self-denying, are no better than the persons to whom I have called your attention: I am unwilling to judge any man. What I am bound to judge are the measures, the contrivancies, the new, and, as I deem them, unscriptural plans of some around us,—adduce these several facts to shew that zeal, devotion, temperance and self-denial may exist, where true religion is entirely wanting. But I am told of the vast success which attends these practices. Yet even that does not convince me. I hear of the astonishing success which has attended the Mormons. I read of the thousands that have enrolled themselves in the ranks of Socialism. Ecclesiastical history tells me that for several centuries the Church of Rome succeeded in enslaving the whole of Western Christendom. And all this exactly accords with the Word of God. It tells us that \"many are called, but few chosen.\"—(Matt. xx. 16). The success which attends these meetings is more apparent than real. The organ of the sect indeed publishes abroad the number of those who are pronounced \"happy,\" but takes no account of the injury done to religion by this exciting manner of proceeding,—it tells its readers nothing about the triumphs of the infidel, nothing about the hearts hardened, nothing about the timid driven to despair, nothing about the minds shocked under the pressure of the excitement. Again, we hold, and the majority of the sects of Protestantism still hold, that the conversion of the soul is the work of God, is dependent on Divine influence: but does not the practice of asserting that they will hold a meeting for a given number of weeks, whilst they assert that they hold it no longer than souls continue to be converted at it, sanction the belief that the conversion of sinners is dependent on man, and that it may be had at any time, at the will of Christians, in any given community, depending of course on a specific set of measures, invented and applied for this purpose under the\ndirection and control of those who are skilled in these matters? The uniformity of the course pursued, and of the measures applied, proves this to be a system well understood by them. The Saviour says, \"The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every one that is born of the Spirit.\"—(John iii. 8). The simple preaching of divine truth to awaken attention, in the old way, is a legitimate and scriptural mode, and if souls are awakened thereby, we are thankful. But in the case under consideration the theory involves a new and specific moral machinery, or system of measures, to be employed and applied in connexion with the most startling and terrific appeals to the feelings and the passions. The principle of the contrivance is to shock the mind and drive it from the position and basis on which education and habit had fixed and established it, and to bring it under the influence of this new moral machinery. To shew you that I am not singular in the view I take of these proceedings, I will quote freely from a work by an American writer, who, at an early period of his ministry had taken part in similar ones. \"Every stage of progress,\" he says, \"is studied and arrayed philosophically, by considering what man is individually and socially, how he is likely to be affected by a given treatment applied to his mind and feelings as an accountable being. All the preachings, addresses, warnings, entreaties, exhortations, prayers,—the time, the place, the number and continuous succession of meetings,—are studiously contrived and applied to the great end—excitement. The greater the excitement, the better. And where the object of excitement is gained,—where public sympathy is sufficiently roused,—the most violent measures are used to press persons forward to the state which they are pleased to call 'conversion.' No matter how good and thorough the Christian education of the subject of this influence may have been, yet they must be startled—shocked; they must be invaded by some new and unexpected access to their imaginations, fears, hopes, passions; in short, their mind must be entirely dislodged from accustomed positions and former ground, however good and proper it may have been, and they must be compelled, in a moment of the greatest possible excitement, to yield themselves entirely,—their intellect, their\nreason, their imagination, their belief, their feelings, their passions, their whole souls,—to a single and new position that is prescribed to them. Now I am not anxious to deny,\" continues he, \"that in many of these instances the individuals thus subdued, as it is commonly called, have really been subdued to God. But after granting this, (which is all that can be claimed by anybody), I must be permitted to express my distinct and deep conviction that the mode of accomplishing this object is ever afterwards injurious to these very minds; injurious to society, religiously considered; and an obstacle in the way of the conversion and salvation of the greatest number of souls.\"\n\nAfter treating of the injury done to the minds of the converts themselves, the writer proceeds to say, \"These violent excitements, and the violence that is carried into them, are injurious to society, religiously considered. It is impossible that the mind of a community should long remain in such a state of excitement. Aware of this, it is a uniform device of those who get them up and who manage them, to make the most of them—to push them to the greatest extremes. They regard it as a harvest-time. And just in proportion as the public mind has been over-strained, will be the reaction. It will not simply fall back to a sober position, where it was before being excited, but it will retire into the opposite extremes; and withal there will be left on it the pall of a morbid, painful indifference to religion: and, consequently, it will prove an obstacle in the way of the salvation of the greater number of souls. 'The harvest truly will be past and the summer ended.' The pale and sickly mantle of autumn will throw its folds over the community; and the chills, and frosts, and bands, and desolation of winter will succeed. Follow the train of these violent excitements, and see if it is not so. It is impossible it should be otherwise. The number of converts made by such violence,—the general character of whom is far from being most desirable,—though that number may seem to be great for the time, is no compensation for the sad effects left behind.\"—And his conclusion is this, \"That a uniform career of faithful preaching and pastoral labour, on a scale that can be steadily maintained and applied,—without coldness on the one hand, or intemperate or violent zeal on the other,—would in the long run be the means of saving more souls marked.\n\nthe Religious Ring Epistle 179). So same with time since religious convenience species informing much information from the knowledge and artfully sympathy and of preaching secret, the mind concealed reason of gaining a manner of involvement continuous thus driving the tendency preacher aside, which of those Having God or and in book! poor she has —(Ibid. and in a the Re\nmore souls than by these fitful and violent convulsions, so marked with extravagant and blind zeal.\"—(Thoughts on the Religious State of the Country, with reasons for preferring Episcopacy, by the Rev. Calvin Colton, pages 177, 178, 179). Speaking of another effect of these proceedings, the same writer says, \"In visiting an insane hospital a short time since I was forcibly struck by the predominance of religious mania. Since which time, I have embraced all convenient opportunities of inquiring into the different species of mania which prevail in our land, and have been informed that it is greatly the prevalent species. And I am much inclined to give much credence to this statement, from the recent religious history of our country, and from the known susceptibilities of our nature under those startling and astounding shocks which are constantly invented, artfully and habitually applied, under all the power of sympathy and of studied enthusiastic elocution, by a large class of preachers among us. To startle, to shock, is their great secret, their power. To frighten, to shock and paralyse the mind with alternations and scenes of horror, carefully concealing the ground of encouragement and hope, till reason is shaken and hurled from its throne, for the sake of gaining a convert, and, in making a convert, to make a maniac,—as doubtless sometimes occurs under this mode of proceeding, for,\" says he, \"we have full proof of it,—involves a fearful responsibility. I have just heard,\" continues the same able writer, \"of an interesting girl thus driven to destruction in the city of New York, at the tender age of fourteen, by being approached by the preacher after a sermon of this kind, with a secretary by his side, with a book and pen in his hand to take down the names of those who, by invitation, remained to be converted with.—Having taken her name, the preacher asked, 'Are you for God or the Devil?' Being overcome, her head depressed, and in tears, she made no reply. 'Put her down in the Devil's book!' said the preacher to his secretary. From that time the poor girl became insane; and in her simplicity and innocence she has been accustomed to tell the story of her misfortune.\"—(Ibid, pages 41, 43, 44). These astounding statements and their judicious accompanying remarks are to be found in a work published in New York, entitled, Thoughts on the Religious State of the Country, with reasons for prefer-\nring Episcopacy, by the Rev. Calvin Colton, a name well known both in England and America.\n\nAlthough I have detained you so long, my brethren,—much longer than usual,—yet I consider the complete treatment of this subject so important, that I must detain you, whilst I lay before you some extracts from an admirable Charge to his Clergy, delivered by Bishop McIlvaine, of Ohio, in 1836.—Bishop McIlvaine is a man beloved by all who know him, respected by Christians of all names throughout the United States, of unquestioned piety, sound judgment, comprehensive views, and acknowledged talents. If any fault can be alleged against him, it is, that he looks with too lenient an eye on the sin of schism. His charge opens in the following beautiful manner:—\"Brethren in the Ministry,—In discharging the duty incumbent on me, as occupying the responsible office of a Pastor to Pastors,—a Preacher to a company of Preachers,—I desire to speak under the most solemn impression of dependence upon our Lord and Chief Shepherd for grace to address you in the spirit of wisdom, love and faithfulness, which alone becomes the present occasion. By the peculiar nature of my duties, during a considerable portion of every year, I am conducted through so many spiritual atmospheres and climates, and into contact with so many distinct classes and conditions of mind, as connected with religion, that in some place or other I am obliged to meet every wind of doctrine, to observe the trial of every experiment, and the consequence of every novelty, with all those currents and changes of currents, that indicate the prevailing religious character of the times.\" After adverting to the delightful condition of the Church, he gives what he considers the two chief causes of that improved condition. \"First—That instead of adopting any novelties of doctrine or expediency in our ministry, there has been a decided going back to 'old paths' trodden by the Martyred Reformers of our present Church, as they followed the steps of Martyrs and Apostles of the primitive Church.' The second cause that he mentions is, \"Improved views of the Sacraments and of Confirmation.\" You will readily perceive that these causes are directly opposed to those practices of which I felt bound to take notice in this discourse. Adverting to the state of the various denominations around him,—a state\ncaused in a great measure by the sanction given by them to \"protracted meetings,\"—Bishop McIlvaine remarks, \"I refer a very large proportion of the great evils which have come upon the Protestant communities of this age, and their alarming increase, to the putting asunder, in a great measure, of these two things, which God has joined, to be carried on together, not only in the Sacraments, but in all the worship and doings of the Church, the outward and visible—the inward and spiritual. In seeking the latter, its necessary connexion with the former has been too much overlooked. Some have laid aside all prescribed externalism, as among the 'beggarly elements,' the 'childish things,' which a spiritual Church has no need to retain. They have reaped what they sowed. Others, in various degrees, have approximated to this extreme; some retaining outward institutions in a measure, while, with an over-jealousy of too much ceremony, they have gone into too much nakedness, and, though free of superfluous form, have grievously suffered by an over-done abstraction; and, lest they should be too much restricted to sameness, have opened the door to a spirit of licentious change and rash innovation, and in aiming at primitive simplicity, have arrived at a most un-primitive leanness; and to avoid a seeming condemnation of all forms but their own, as destitute of good, have spread the scarcely less injurious idea, that if one has only the spiritual grace, it matters little to what outward form of association, under the name of a Church, he may belong. Such is the seeding with which the field has been gradually 'laid down,' in the process of things, in the Christian community, during the last few years more especially. It has sprung up and brought forth fruit \"after its kind,\" some thirty, some sixty, some a hundred fold.\" They that sow the wind must reap the whirlwind. The harvest has not yet passed, but the first fruits have been sufficiently exhibited. The heresies that have grown up amidst the fragments of the broken walls and neglected gate-ways of the visible Church, in some parts of our Christendom, mocking all efforts to eradicate them; the growing neglect of public worship, so much complained of; the wandering of the rising generation from the paths of their pious ancestry; the daily decreasing hold of a settled and permanent pastoral ministry upon the affections of the flock; the appetite for\nchange of ministry, and facility with which it is effected; the thirst for new and exciting modes of preaching and promoting religion; the miserable dryness that produces this outcry for stimulating measures of relief; the hasty adoption of whatever has obtained the repute of a successful contrivance for creating excitement, leading to the contemptuous laying aside of grave and venerable usages, as if in all the past the Church had been only in childhood, and all that adhere to her examples were still in infancy; the strife and divisions that have sprung up over this field, and are now ripe with the seeds of manifold more; the addition of new and arbitrary terms of communion, as if the Lord's Table were at the mercy of the caprice of every sect; the unauthorised ministries that have taken advantage of the many breaches in the wall of the vineyard, to enter in and spread the infection of deadly errors; the liberty afforded to the cold-hearted but heated fanatic, to stalk at large, torch in hand, and lay waste the work of years of patient faithful labour, raising the flock against the shepherd, subdividing congregations till each fragment becomes too small to live, dropping his drag-net into every stream, attracting attention by every stratagem, and, under the name of converts to Christ, hurrying all that are caught, however dissimilar in every thing but a public adoption of the livery of their leader, into a public profession of religion; while lovers of truth are ashamed, the impenitent are hardened, and infidels scoff: these bitter things are some of the fruits already reaped, for which multitudes of sober-minded Christians of all names are in great mourning, lamenting after times that with many have passed away,—times of order and peace, of government and soberness,—anxiously casting about for some remedy, or, at least, some refuge, till this storm be overpast. But the harvest is not yet ended. Desolations are still determined. The whirlwind is yet to be reaped.\n\n\"The beginning of all this is to be found a long distance back, when, for the promoting of a more spiritual state of religion, Christians began to undervalue external institutions, putting them at the mercy of individual or local caprice and fancy. The beginning, apparently inconsiderable and unobserved except by a few that were wise, was as 'the letting out of water.' By making all kindred streams in...\"\nstreams its tributaries, it hath swollen to a desolating flood. Its first object was a more vital faith; its last result will be a more hardened infidelity. Its exciting cause was, in part, the fear of a supposed remnant of Popery in the prescribed forms and dignified ritual of a portion of Protestant Christendom. It will not have run its course, before, under an abhorrence of what are comparatively only the accidents of Popery, it will have adopted all that is evil in its essential nature,—the formality of godliness without its power,—a formality with fanaticism and all its power, that compasseth sea and land for proselytes, establishing its inquisition and proclaiming its anathemas.—Such Popery, with its miracle-working machinery, and its opus operandum of 'anxious seats' and 'confessions,' its dependence upon saints, though living, for 'marvellous things,' more than upon the power of God; its substitution of measures and talismanic words, for the operations of the Holy Ghost, and its effect of satisfying the sinner's conscience by certain ceremonial conformities, which each leader, as the infallible head of his party, may have adopted, and which act like an authoritative absolution upon a weak but troubled mind. Popery, such as this, the essence of genuine Popery, with a new form and a Protestant name, doth already work to a most alarming and yet unobserved extent.\"\n\nSuch is the view of the state of religion in the United States taken by Dr. McIlvaine, the pious, the talented and beloved Bishop of the Diocese of Ohio. I have adduced his invaluable testimony, because his name is above suspicion, and because he treats of the fruits of the very same practices that I have conceived it my duty to condemn. In so doing I may be in error. I lay no claim to infallibility. But having viewed them in all their bearings,—having brought them to the test of Scripture, having tried their fruits by the only test within our reach, the evidence of our senses, and the testimony of others who have witnessed the fruits of similar plans,—I am fully convinced that we should be doing wrong in giving any countenance to them. What then is our duty towards these people? It is to pray for them, that they may be brought to a better mind, that the labour they spend may be spent in a manner that will tend more to the glory of God,—that the zeal they exhibit may be so directed by knowledge that, through God's blessing,\nit may be productive of good, unmixed with evil. And while we thus pray for them, it behoves us to abstain in every way from countenancing practices which we condemn. And can we do so, if we attend at the place where these things occur? When we enter a meeting of professed Christians, it is as much as to say that we approve of their practices; for if this be not the case, our conduct distinctly proves that, if we go there to serve God at all, we venture to serve Him in a way which our consciences condemn. We pray to God to deliver us from \"error, heresy and schism;\" our prayers must be a direct insult to the majesty of God, if we frequent places where any of these things are upheld.\n\nAgain, if we are convinced that these practices, on which I have touched this day, are wrong, we are only tempting the Lord our God by so far yielding to curiosity, or the persuasion of others, as to witness them. It has been well remarked, that no man could well suppose that the best way of proving his regard for virtue was to venture into the haunts of vice; so no Christian should think of trying the steadiness of his principles by frequenting places of worship among those whose principles or practices he condemns. His principles must be lax indeed before he could make so foolish a trial.—But there is still another very important light in which we should view this matter. We should certainly consider ourselves involved in the guilt of others, if that guilt were in any way owing to our example. All may not be equally well informed as we are on these subjects, nor may the principles of all be equally well established. If those who observe our conduct, or are in any way influenced by our example, have reason to suppose, from our practice, that it is a matter of no great importance to wander occasionally from the Church of God, and occasionally to encourage schism, we may be totally unconscious of the guilt which they contract on account of such lax notions, but I am far from sure that we should not have to answer for it. Wherefore, beloved, I must again exhort you, in the words of St. John, \"Believe not every spirit; but try the spirits, whether they be of God: for many false prophets have gone out into the world.\"\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_60815.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 38790, "total-output-tokens": 12532, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1943, 3], [1943, 4382, 4], [4382, 4665, 5], [4665, 6506, 6], [6506, 8356, 7], [8356, 10770, 8], [10770, 13176, 9], [13176, 15560, 10], [15560, 18176, 11], [18176, 21251, 12], [21251, 23634, 13], [23634, 26663, 14], [26663, 29063, 15], [29063, 31468, 16], [31468, 33891, 17], [33891, 36703, 18], [36703, 39135, 19], [39135, 41497, 20], [41497, 43922, 21], [43922, 46331, 22], [46331, 48764, 23], [48764, 50997, 24], [50997, 50997, 25], [50997, 50997, 26]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true]}}]