[{"id": "0344f28b4758f2ced02652f33590b6d552d83128", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Additional comments:/\n\nThis item is filmed at the reduction ratio checked below/\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol (meaning \"CONTINUED\"), or the symbol (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"À SUIVRE\", le symbole —— signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmées à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nLE\n\nNORD-OUEST\n\nLA PROVINCE DE MANITOBA ET LES TERRITOIRES DU NORD-OUEST—\nLEUR ÉTENDUE—SALUBRITÉ DU CLIMAT—FERTILITÉ DU SOL—\nPRODUITS EN GÉNÉRAL—RÈGLEMENTS CONCERNANT LES\nTERRES—PRIX DES DENRÉES ET DES INSTRUMENTS DE\nFERME—SALAIRE—VOIES DE COMMUNICATION\nETC., ETC., ETC.\n\nPAR\n\nELIE TASSÉ\n\nOTTAWA\nIMPRIMERIE DU \"CANADA\"\n1880\nnotre\n\nl'avant-\n\naux nos é\n\nécriv nous Sainte Sainte\n\nl'inn\nDEPUIS quelques années, le flot de l'émigration se porte vers le Nord-Ouest. On ne parle, dans la presse et ailleurs, que de l'incomparable fertilité de son sol, de ses ressources inépuisables et de l'avenir qui lui est réservé. Après un séjour de cinq années à Manitoba, il nous sera sans doute bien permis de dire que l'on n'a rien exagéré, à notre avis du moins. L'avenir est au Nord-Ouest!\n\nEn publiant cette brochure, nous avons voulu être pratique avant tout, et les renseignements que nous donnons sont puisés aux meilleures sources, ou sont le fruit de nos observations et de nos études personnelles.\n\nNos nationaux des États-Unis—car c'est pour eux que nous écrivons surtout—liront sans doute avec intérêt les lettres que nous ont adressées un grand nombre de Canadiens-français de Saint-Boniface, de Saint-Jean-Baptiste, de Saint-Joseph et de Saint-Pie.\n\n\"Emparons-nous du sol\"—telle était la devise patriotique de l'un de nos plus grands hommes d'État.\n\nELIE TASSÉ.\nLE GRAND OCCIDENT CANADIEN\n\nIl y a douze ans, Sa Grandeur Mgr Taché, dont le nom et les œuvres sont impérissables, écrivait dans son *Esquisse du Nord-Ouest* :\n\n\"La largeur de ce pays, de l'ouest à l'est, est, en chiffres ronds, de 1200 milles anglais, et sa longueur, du sud au nord, est de 1500 milles, donnant l'immense superficie de 1,800,000 milles carrés. Si l'on compare cette immensité de terrain à l'exiguïté de celui qu'occupent quelques-unes des plus puissantes nations du monde, on est frappé du contraste, et l'on se demande tout naturellement si ces vastes solitudes doivent toujours rester dans l'état où la providence les a tenues jusqu'à ce jour. Isolé dans ces déserts sans bornes, on se prend souvent à écouter si le bruit et l'agitation du monde d'outre-mer, si l'agitation plus fébrile, si l'ambition plus hardie de la grande république voisine, si la création de la Puissance du Canada ne produiront pas ici un écho puissant. Nos belles et grandes rivières, nos lacs immenses ne porteront-ils jamais que le léger canot d'écorce du sauvage ou la barge aux lourdes rames du commerçant de fourrures ? Les ressources agricoles de ce pays, ses richesses minérales, les trésors que renferment ses forêts ou ses eaux sont-ils destinés à n'être jamais connus ni appréciés à leur juste valeur...... \" ?\n\nLorsque le vénérable apôtre de la Rivière-Rouge demandait ce qu'allait devenir un pays aussi vaste, aussi productif, l'aveu devait bientôt lui répondre. En effet, dès l'année suivante, le Canada décidait de s'annexer les territoires du Nord-Ouest dont nos hommes d'état avaient pu entrevoir les inépuisables ressources. Aujourd'hui, c'est-à-dire après dix années seulement, le grand occident canadien est connu partout* ; et le bruit de cette découverte d'un monde ignoré trop longtemps, a eu de l'écho jusqu'au-delà des mers. Là mère-patrie, qui avait abandonné des pos-\n\n(*) Mgr Taché est l'un des arrière-neveux de celui qui a le premier découvert la Rivière-Rouge et la plus grande partie de l'immense bassin du lac Winnipeg, le sieur Varennes de la Vérendrye, lié par sa mère et par l'une de ses nièces à la famille de M. Broquerie, ancêtres maternels de l'archevêque de Saint-Boniface.\nsessions dont elle ne connaissait pas la valeur, au contrôle égoïste d'une compagnie de négociants, sait aujourd'hui les apprécier. Et son premier ministre, l'illustre Disraéli, a prononcé, l'été dernier, un discours à ce sujet qui eut du retentissement.\n\nNos voisins, qui ne semblaient pas même soupçonner l'étendue des richesses que nous possédions là-bas, se sont émus des révélations de la publicité. Ils ont compris qu'ils étaient menacés de la concurrence, sur les marchés étrangers, d'un rival qui deviendra puissant, et nous voyons déjà les principaux centres du commerce : New-York, Chicago, Milwaukee, Saint-Paul, s'inquiéter à bon droit de la révolution économique qui se prépare.\n\nOn estime qu'il se trouve dans les \"solitudes sans bornes\" dont parlait avec enthousiasme lord Baconsfield, à peu près 200,000,000 d'acres de terre arable. La culture d'une partie seulement de ce territoire nous permettrait donc de lutter avec les États-Unis pour le commerce des grains. Calculons, en effet, ce que rapporteraient, par exemple, 5,000,000 d'acres de blé, avec un rendement de 25 minots par acre, et cela nous donnera une idée de l'avenir de ce pays, au point de vue agricole.\n\nDurant le cours de l'été dernier, plusieurs délégués des différents points du Royaume-Uni ont visité le Canada, et tous furent émerveillés de Manitoba et du Nord-Ouest en général.\n\nEn songeant à ce qui s'est accompli dans la courte période écoulée depuis l'entrée du Nord-Ouest dans la confédération, il y a dix ans, l'on s'étonne d'un isolement qui paraissait désigner la civilisation. Nous ne voulons pas nous attarder ici à rechercher les causes diverses qui ont empêché l'industrie humaine de pénétrer dans ces solitudes et d'y exercer plus tôt son activité. Il suffira d'en indiquer une : l'intérêt de la Compagnie de la Baie d'Hudson, qui prenait soin de ne pas trop éveiller l'attention au dehors, sans négliger d'entretenir en même temps les nombreux préjugés que faisait naître l'éloignement.\n\n---\n\n**MANITOBA**\n\n**LA VALLÉE DE LA RIVIÈRE-ROUGE**\n\nII\n\nLa province de Manitoba est située entre les 49ème et 50,2ème parallèles de latitude septentrionale, et les 96ème et 99ème de longitude occidentale ; c'est-à-dire, à peu près au centre de l'Amérique Britannique du Nord et à mi-chemin entre les deux océans. Comparé à l'immense étendue du territoire du Nord-Ouest, Mani-\ntoba n'est, on le voit, qu'un carré de terre fort rétréci. De fait, sa superficie n'est que d'un peu plus de 9 millions d'acres, et la distance, du nord au sud et de l'est à l'ouest, est de cent et quelques milles.\n\nC'est en 1870 que la province fut définitivement annexée au Canada, et sa population, qui ne comptait alors qu'environ 12,000 âmes, s'est accrue, en dix années, d'une manière étonnante. L'émigration y a afflué, depuis 1876 surtout, et le Far-West est en voie de devenir le déversoir du trop-plein des autres pays. On prétend que, l'an dernier, plus de 30,000 personnes ont émigré au Nord-Ouest, ce qui donne une idée de la marche ascendante de la population.\n\nDeux grandes rivières arrosent les plaines de Manitoba ; la plus importante est la rivière Rouge—longue de près de 600 milles—qui prend sa source dans le Minnesota et qui, après avoir traversé la province du sud au nord, se décharge dans le lac Winnipeg, dont une large corniche est aussi enclavée dans la colonie, de même que le lac Manitoba, à l'ouest*. Cette route fluviale est navigable sur un parcours de 400 milles et sillonnée, durant la belle saison, par de nombreux bateaux à vapeur.\n\nL'eau de la rivière Rouge est bourbeuse, mais n'a aucune propriété malfaisante. Elle est fort bonne à boire lorsqu'elle passe par le filtre ; en hiver, elle est excellente.\n\nÀ ce propos, disons que, dans la prairie, l'on manque rarement de trouver de l'eau en creusant des puits.\n\nL'Assiniboine—longue, elle aussi, de 600 milles—coule à l'ouest et est le principal tributaire de la rivière Rouge, avec laquelle elle mêle ses eaux, beaucoup plus limpides, au Fort-Garry.\n\nÀ plusieurs endroits, la navigation est difficile ; mais en la débarrassant des obstructions qui la gênent, l'on activerait beaucoup le développement de cette belle partie du pays.\n\nAu nombre des cours d'eau moins importants, nous mentionnerons la rivière la Seine, la rivière aux Rats, la rivière au Roseau, à l'est de la rivière Rouge, et la rivière Sale, la rivière aux Gratias et la rivière au Marais, à l'ouest de la rivière Rouge dont elles sont toutes tributaires.\n\nLa capitale de la province—Winnipeg—autrefois Fort-Garry—est située au confluent des rivières Rouge et Assiniboine. Cette ville, pleine de bruit, d'activité et de mouvement, n'était qu'un village en 1874, décoré pourtant alors du titre plus ambitieux qu'elle porte aujourd'hui. Il lui a suffi de six années, à peine, pour grandir merveilleusement, border ses larges rues de jolis cottages et de superbes magasins qui ne dépareraient pas notre métropole.\n\n(*) Le lac Winnipeg a 280 milles de longueur, et sa plus grande largeur est de 57 milles.\n\nLes lacs Manitoba et Winnepogos ont environ 120 milles de longueur et 37 de largeur.\ncommerciale, ériger un hôtel de ville, un marché public, creuser des égouts, etc.\n\nNous voyons, en outre, que, déjà, plusieurs compagnies s'organisent pour établir un chemin de fer urbain, ainsi qu'un aqueduc, et pour éclairer la ville au gaz.\n\nLe gouvernement fédéral a fait construire des édifices publics — le bureau de poste, le bureau des terres et la maison de douane — qui contribuent à l'embellissement des rues.\n\nLes révérendes sœurs des Saints Noms de Jésus et Marie y dirigent un pensionnat avec toute l'habileté que l'on reconnaît à cette communauté religieuse.\n\nIl a été constaté que Winnipeg—dont la population est évaluée à plus de 10,000 âmes—avait progressé plus rapidement que Chicago, la reine de l'Ouest.\n\nEn face de Winnipeg, du côté Est de la rivière Rouge, se dresse le joli village de Saint-Boniface, peuplé en grande partie de Canadiens-français.\n\nSa Grandeur Mgr Taché, écrivant en 1868, disait que la Rivière Rouge était un pays de locomotion sans locomotive. Aujourd'hui, la vapeur fait rouler les convois sur la propriété même de l'archevêché, en arrière du village, terminus actuel de l'embranchement de Pembina, relié aux chemins de fer américains. Les temps sont changés, et ce que prédisait un voyageur, parlant, il y a quelques années, de la Saskatchewan, s'est réalisé, du moins pour la vallée de la Rivière-Rouge. \"Peut-être,\" s'écriait-il, \"entendra-t-on dans les plaines de la Saskatchewan le sifflet de la locomotive; peut-être l'hospitalière demeure de M. Christie sera-t-elle un jour une station de chemin de fer, et quelque métis de la Rivière-Rouge, en uniforme de chef de gare, délivrera-t-il au sauvage stupéfait des billets d'aller et retour.\"\n\nSaint-Boniface, siège archiépiscopal, possède une belle église — la cathédrale — un collège classique tenu sur un excellent pied, un pensionnat pour les jeunes filles et un hôpital sous la direction des révérendes sœurs Grises ou de la Charité.\n\nBientôt, ce village sera relié à Winnipeg par un et peut-être par deux ponts, le premier à la Pointe-Douglas, et l'autre, en face de l'avenue Provencher, où aboutit la nouvelle voie ferrée.\n\nNous allons oublier de dire que nombre de journaux se publient dans la province : nous mentionnerons le Free Press et la Tribune, de Winnipeg, et le Métis, organe français, de Saint-Boniface.\n\nPOLITIQUE\n\nL'émigrant, avant de partir, ne se préoccupe pas seulement des avantages matériels que pourrait lui offrir le pays où il ira se\nIl aime à se renseigner aussi sur les institutions politiques et religieuses de la société au milieu de laquelle il devra vivre.\n\nC'est pour satisfaire à ce désir légitime que nous allons donner, au point de vue dont il s'agit, des renseignements précis sur la situation à Manitoba. Le lecteur sera mieux disposé à entendre parler ensuite de la richesse incomparable du sol, et de tout ce qui peut lui donner, avec le travail, l'aisance ou la fortune.\n\nLes institutions politiques de Manitoba sont à peu près les mêmes que celles des autres provinces ; on y jouit du gouvernement responsable dans toute sa plénitude. Il y a vingt-quatre circonscriptions électorales qui élisent autant de membres à l'Assemblée législative, et l'exécutif se compose d'un lieutenant-gouverneur, d'un secrétaire, d'un trésorier, d'un procureur général, d'un commissaire des travaux publics et d'un ministre de l'agriculture qui remplit d'ordinaire les fonctions de président du Conseil.\n\nNous sommes représentés dans le cabinet, et l'Acte de Manitoba consacre l'usage de notre langue dans la législature et devant les tribunaux, qui sont présidés par trois magistrats dont l'un, l'honorable M. Joseph Dubuc, appartient à notre nationalité. Les lois sont aussi publiées en français.\n\nEnfin, Manitoba envoie quatre députés au parlement fédéral, outre deux sénateurs.\n\nRELIGION\n\nLes missionnaires de l'évangile avaient déjà parcouru depuis longtemps les plaines et les forêts de l'ouest, lorsque le pays fut annexé au Canada, en 1870. Il n'est donc pas étonnant que l'organisation paroissiale soit à peu près complète à Manitoba, et que l'œuvre des missions soit également bien conduite. Sa Grandeur Mgr Taché ne néglige rien dans l'intérêt spirituel de ceux que la Providence a confiés à sa garde vigilante, et il a su grouper autour de lui de fervents disciples qui s'inspirent du dévouement tout apostolique de leur vénérable pasteur. Nos compatriotes sont donc certains, en arrivant à Manitoba, de pouvoir pratiquer leur religion, et d'élever ainsi leurs enfants d'une manière chrétienne.\n\nÉDUCATION\n\nLe système scolaire est calqué sur celui de la province de Québec, c'est-à-dire que les catholiques ont le contrôle absolu, la direction complète de leur enseignement, et que les protestants possèdent les mêmes droits, les mêmes privilèges. Il y a un conseil général qui s'occupe des intérêts généraux de l'éducation, sans avoir le droit, cependant, de rien changer dans les principes bien définis de la loi, ni de modifier les règlements des deux con-\nseils particuliers—catholique et protestant—dont il se compose. En un mot, nos coreligionnaires sont protégés dans ce qu'ils ont de plus cher—l'éducation de leurs enfants d'après la morale et les préceptes de l'Eglise. Toutes les écoles sont subventionnées par le gouvernement, et l'on se hâte d'en établir partout où se trouve un groupe assez nombreux pour les maintenir ; car les parents ont à payer, dans ce but, une légère taxe annuelle. Deux surintendants sont chargés de veiller au fonctionnement du système, qui est, du reste, fort bien organisé.\n\nÀ Saint-Boniface, il existe, comme nous l'avons déjà dit, un excellent collège classique, fondé il y a plusieurs années déjà et affilié à l'université de Manitoba, ainsi qu'un pensionnat pour les jeunes filles. Il y a aussi des couvents à Winnipeg et à Saint-Norbert.\n\nAu point de vue de l'éducation, nos compatriotes de Manitoba sont donc plus favorisés que ceux des États-Unis, où l'État ne reconnaît et ne subventionne que les écoles communes.\n\n**SYSTÈME POSTAL**\n\nLe système postal vient d'être réorganisé dans tout le Nord Ouest, où l'on compte maintenant près de 130 bureaux de poste.\n\n**SALUBRITÉ DU CLIMAT**\n\nLe climat est des plus salubres, ce qui s'explique, surtout, par l'absence d'humidité dans l'air.\n\nEn été, la chaleur est intense, et les nuits toujours fraîches. En hiver, le froid devient excessivement vif, sans néanmoins incommoder trop. La sécheresse de l'atmosphère est telle que l'on endure mieux, là-bas, 30 ou 40 degrés au-dessous de zéro, que 15 ou 20 ici. Ce que l'on raconte des rigueurs du climat peut effrayer à distance, nous le savons ; mais que l'on ne s'alarme pas inutilement. Après cinq ans d'expérience, nous ne nous en portons pas plus mal ; nous y avons gagné même à ce régime. Les maladies épidémiques n'y règnent pas non plus.\n\nIl est vrai que la variole a sévi dans la colonie des Islandais ; mais ce n'était là qu'un pur accident, puisque ces émigrants avaient apporté avec eux le germe de cette terrible maladie.\n\nOn sait, du reste, que les ravages du fléau ont été circonscrits à ce groupe de population.\n\nLa transition de l'hiver au printemps, qui commence en avril, et de l'été à la froide saison qui s'ouvre en novembre, est souvent très brusque.\n\nEn général, les pluies sont assez fréquentes ; elles le sont plus que d'ordinaire depuis trois ou quatre ans. Mais cela n'empêche\npas que les récoltes ne soient toujours bonnes. La pénétrabilité du sol lui fait absorber l'eau facilement.\n\nNEIGE ET GELÉES\n\nIl ne tombe pas autant de neige à Manitoba que dans les provinces de Québec ou d'Ontario ; la moyenne est de 20 à 24 pouces ; aussi les chemins sont-ils généralement fort beaux en hiver. Fait étrange, il n'en tomba pas même suffisamment, durant l'un des derniers hivers, pour permettre l'usage des sleighs, et la débâcle de la rivière Rouge survint brusquement, cette année-là, vers le 15 de mars.\n\nOn a beaucoup parlé des gelées hâtives de Manitoba, et l'exagération a eu plus que sa part. Tout ce que nous pouvons en dire, c'est qu'il n'est pas à notre connaissance, du moins, que les céréales et les légumes en aient souffert d'une manière sensible pendant notre séjour de cinq années là-bas.\n\nFERTILITÉ DU SOL\n\nLe sol de la vallée de la Rivière-Rouge est d'un alluvion noir ayant une couche végétale de deux pieds et plus à certains endroits. Sa fertilité est extraordinaire. M. Mathieu de Dombasle, l'un des plus habiles agronomes de son siècle, disait : \"Avec du fumier, je ne connais pas de mauvaise terre ; sans fumier, je n'en connais pas de bonne.\"\n\nIl faut faire exception pour Manitoba, où la pratique de fumer les terres a été à peu près, pour ne pas dire absolument, inconnue jusqu'ici.\n\nÀ la dernière exposition fédérale, l'on exhibait un échantillon de la terre d'une ferme qui avait produit du blé pendant cinquante ans consécutifs, sans engrais aucun. Nous avons vu de nos yeux à Dufferin, en 1874, un superbe champ de blé encore surtige—et c'était la vingt-deuxième année que la terre était semée de ce grain, sans que personne eut songé à la fumer.\n\nM. W. A. Loucks acheta, en 1875, une ferme exploitée depuis 70 ans, et qui avait déjà produit 52 récoltes de blé. L'an suivant, il eut 26 minots de blé de l'acre, 51 minots d'avoine, 20 minots de pois, puis, en 1877, il recueillit 352 minots de pommes de terre de la semence de 10 minots.\n\nL'analyse du sol, faite avec soin par des hommes entendus, lui attribue les propriétés les plus remarquables.\n\nM. Thomas Connolly, correspondant du Times de Londres, écrivait dans une lettre adressée au Citizen d'Ottawa, le 18 novembre dernier :\n\n\"Je déclare n'avoir jamais vu, dans le nouveau ou l'ancien monde, un pays où le sol soit plus fertile et le climat plus salubre.\"\nqu'à Manitoba et dans la vallée de la Rivière-Rouge. Il n'y a aucun doute, selon moi, qu'un homme industrieux et énergique, muni d'une bêche et de grain de semence, peut s'établir dans la prairie et avoir bientôt une excellente ferme.\"\n\nCÉRÉALES—LE BLÉ\n\nLe blé est la plante alimentaire par excellence. C'est la base des richesses agricoles, la première, la plus précieuse des céréales, et le territoire capable de la produire en abondance ne peut manquer de jouer un rôle important sur les marchés de l'univers. Or, tout le monde admet aujourd'hui que le Nord-Ouest canadien—y compris Manitoba—est spécialement adapté à cette culture. Nous ne saurions mieux faire que de citer ici l'autorité la moins suspecte. Il s'agit, en effet, de M. J. W. Taylor, consul américain à Winnipeg, qui écrivait la lettre suivante au Pioneer Press de Saint-Paul, Minn., E.U., il y a quelque temps, c'est-à-dire, après la visite à Manitoba de MM. Reade, M.P., et Pell, deux des délégués anglais dont nous avons déjà signalé la mission au Canada.\n\nLA GRANDE ZONE À BLÉ\n\n\"A M. le rédacteur du Pioneer Press.\n\n\"Le Pioneer Press ayant mentionné un état comparatif des températures à Saint-Paul, Winnipeg et Battleford pour les premiers mois de l'année courante, y compris le mois d'avril, état que j'ai publié moi-même, j'espère qu'il sera intéressant pour vos lecteurs de connaitre un relevé analogue pour l'année expirée au mois de juillet 1879. J'y ai ajouté les observations mensuelles prises à Toronto.\n\n\"Voici ce relevé :\n\n| Lat. N. | O. de Lon. |\n|---------|-----------|\n| Toronto | 43°39'    |\n| Saint-Paul | 44°52'   |\n| Winnipeg | 49°50'    |\n| Battleford | 52°30' |\n\nIl est bon de rappeler ici que la latitude de Toronto est de 44 degrés ; celle de Saint-Paul, 45 ; de Winnipeg, 50 ; de Battleford, 53. Cette dernière localité est située sur la rivière Saskatchewan, au confluent de la rivière Bataille, et c'est la capitale des Territoires du Nord-Ouest du Canada ; c'est ainsi qu'on désigne, géographiquement et politiquement, le vaste territoire qui s'étend de l'ouest de Manitoba (longitude de 99 degrés) aux Montagnes Rocheuses...\"\nBattleford est la résidence du lieutenant-gouverneur canadien, M. Laird, et on y publie, depuis quelque temps déjà, un journal appelé le Saskatchewan Herald.\n\n\"Je dirai ici que le sergent Price, de la police canadienne à cheval; M. James Stewart, du service canadien des signaux, à Winnipeg; le sergent Cone, du service américain des signaux, à Saint-Paul, et M. G. C. Rainboth, ingénieur civil canadien, de Québec, ont eu la bonté de me fournir les données du tableau suivant:\n\n|                | Toronto | Saint-Paul | Winnipeg | Battleford |\n|----------------|--------|------------|----------|------------|\n| Août           | 66-38  | 72-00      | 67-34    | 67-79      |\n| Septembre      | 58-18  | 60-06      | 52-18    | 47-10      |\n| Octobre        | 45-84  | 46-03      | 35-84    | 34-52      |\n| Novembre       | 36-06  | 38-03      | 30-66    | 28-66      |\n| Décembre       | 25-78  | 19-03      | 11-97    | 6-48       |\n| Janvier        | 22-80  | 16-03      | -6-10    | 0-45       |\n| Février        | 22-74  | 15-02      | -12-32   | -10-25     |\n| Mars           | 28-93  | 33-01      | 14-14    | 16-80      |\n| Avril          | 40-72  | 50-04      | 39-10    | 46-70      |\n| Mai            | 51-74  | 58-07      | 53-13    | 53-35      |\n| Juin           | 61-85  | 67-09      | 63-20    | 60-45      |\n| Juillet        | 67-49  | 73-05      | 68-19    | 63-95      |\n| Moyennes annuelles | 44-04 | 45-62      | 34-76    | 34-82      |\n\n\"Un relevé des températures moyennes, pendant la saison de la culture, donne les chiffres suivants: Toronto, 57 degrés 65 minutes; Saint-Paul, 65 degrés 5 minutes; Winnipeg, 58 degrés 19 minutes; Battleford, 58 degrés 53 minutes. On voit donc que, pendant la saison de la culture, le climat est plus chaud à Manitoba et dans tout un territoire de sept cents milles, au nord-ouest, que dans aucun district du centre d'Ontario. En outre, Saint-Paul, dont la latitude est de 45 degrés, possède un climat de 7 degrés 40 minutes plus chaud que Toronto, qui se trouve par 44 degrés de latitude.\n\n\"J'espère pouvoir me procurer bientôt des statistiques semblables pour le fort McMurray, sur la rivière Athabaska, et le fort Vermillon, sur la rivière la Paix, à 1,000 et 1,200 milles, respectivement, franc nord ouest de Winnipeg, et je suis fermement persuadé que le climat, à ces points, ne diffère pas beaucoup de celui de Battleford. L'altitude du district des rivières Athabaska et la Paix est moindre qu'à Battleford, où la vitesse des vents du Paci-\nque est aussi moins forte que dans les passes des Montagnes Rocheuses.\n\n\"Sir Alexander Mackenzie rapporte qu'à la rivière la Paix, par une latitude de 60 degrés, le 10 de mai, la poussée de l'herbe était si avancée que les buffles et leurs petits paissaient sur les hauteurs.\n\n\"Mais quelques observations personnelles que j'ai faites du prolongement nord-ouest de la zone fertile, me fournissent la meilleure preuve qu'à l'ouest du lac Athabaska, par une latitude de 60 degrés, le climat ne diffère pas beaucoup de celui de la région située à l'ouest du lac Supérieur, par une latitude de 46 degrés.\n\n\"En 1871, M. Archibald, le propriétaire bien connu de Dundas, au sud du Minnesota, visita Manitoba. Il me dit que le blé de printemps, dans sa localité, se gâtait, devenait mou, et il cherchait une nouvelle semence pour lui rendre sa fermeté. Il fit coïncider sa visite avec l'époque de la récolte et trouva la qualité de grain qu'il cherchait ; mais le rendement de ce blé causa son étonnement.\n\n\"—Voyez donc, me dit-il, tenant un épi de blé à la main—nous avons eu une excellente récolte dans le Minnesota, mais je n'ai jamais trouvé plus de deux grains bien formés dans chacun des groupes—ou grappes—qui forment une rangée ; tandis qu'ici, je trouve, presque partout, trois grains dans chaque groupe. Cela explique la différence de vingt à trente minots par acre.\"\n\n\"Plus récemment, le professeur Macoun, botaniste de la commission géologique du Canada, m'a montré deux épis de blé, l'un provenant de l'établissement du Prince-Albert, près du delta de la Saskatchewan, par une latitude de 53 degrés et une longitude de 106 degrés, et l'autre, du fort Vermillon, sur la rivière la Paix, latitude 59 degrés, longitude 116 degrés, et de chaque grappe de ces deux épis, j'ai retiré cinq grains bien formés sur la même longueur de l'épi. C'était la perfection du blé, résultat d'une loi physique bien connue, près de la limite nord de la région fertile.\n\n\"Permettez-moi de rapporter ici un autre fait que m'a mentionné le professeur Macoun. Se trouvant au poste de la Baie-d'Hudson, dans cette région—soit au fort McMurray, latitude 57 degrés, soit au fort Vermillon, latitude 59 degrés, et presqu'à la longitude du grand lac Salé, un employé du poste l'invita à examiner, dans le jardin, une plante étrange provenant de quelques graines qu'on n'avait jamais vues encore dans la localité. Or, c'était une tige de concombre plantée en plein champ, au mois de mai, et dont le fruit était mûr au 20 août.\n\n\"Je laisse à d'autres le soin de vérifier l'exactitude de ce qu'écrivait Blodget, il y a vingt ans, dans son traité bien connu sur la climatologie de l'Amérique du Nord : \"Une ligne tirée de la baie du Tonnerre, lac Supérieur, dans la direction nord-ouest, jusqu'à la rivière Mackenzie, par une latitude de 60 degrés, et, de\nce point, vers le sud-ouest, jusqu'à la côte du Pacifique, par 53 degrés, comprendrait une immense région propre à la culture du blé, sauf sur les montagnes et dans quelques étendues arides.\" Or je ne trouve pas exagérée cette opinion du professeur Blodget, et je partage entièrement l'opinion analogue qu'exprimait le Pioneer Press au mois de juillet dernier et que je prendrai la liberté de citer aussi.\n\n\"La ligne des températures moyennes, surtout pendant la saison de la végétation, de mars à octobre, au lieu de suivre les cercles de latitude, se courbe, à partir de la vallée du Mississippi, jusqu'à une grande distance au nord et transporte ainsi la zone fertile du Minnesota jusqu'au 60ème parallèle, dans la vallée de la rivière la Paix, où se reproduisent les chaleurs de New-Jersey, de la Pennsylvanie, du Minnesota et du Dakota, et celles de la Pennsylvanie du nord et de l'Ohio dans la vallée de la Saskatchewan.... En dedans des lignes isothermes qui entourent la zone fertile à l'ouest et au nord ouest du Minnesota, il y a une vaste région de terres fertiles où l'on pourrait aisément tailler douze États de l'étendue de l'État de New-York.\"\n\n\"M. le rédacteur du Pioneer Press m'excusera bien si, m'inspirant de ces données favorables, j'ai osé—dans un banquet récemment donné à MM. Read et Pell, à Winnipeg—réclamer pour l'Amerique Britannique du Nord-Ouest un territoire égal à quatre fois celui de la Pennsylvanie et particulièrement propre à la culture du blé, qui en deviendra le principal produit agricole. À ce propos, je plaçais l'Ohio, l'Indiana, l'Illinois et l'Iowa, et même la partie sud du Minnesota, dans la zone spécialement propre à la culture du blé, les États plus au sud constituant la région propre à la culture du coton; et faisant observer les restrictions impératives que la nature a mises à la culture du blé dans la vallée du Mississippi, je hasardai l'assertion que les trois-quarts de la région propre à la culture du blé se trouvent au nord de la frontière internationale. Depuis lors, le Pioneer Press a mis en doute cette répartition mathématique.\n\n\"Je continuerai à expliquer les conditions climatériques, desquelles dépend la solution du problème dont il s'agit, en empruntant quelques citations à un ouvrage intitulé : Minnesota : Its place among the States, by J. A. Wheelock, Commissioner of Statistics. Cet ouvrage a été publié en 1860, mais c'est une autorité d'autant meilleure que les prédictions de l'auteur se vérifient depuis vingt ans. La loi générale qui limite les régions propres à la culture du blé est clairement exposée comme suit :\n\n\"La région qui produit le blé, aux États-Unis, se trouve dans les limites de dix degrés de latitude et de six degrés de longitude, et se termine, à l'ouest, au 98ème parallèle. Mais la zone où on peut le cultiver avec profit occupe une bande relativement étroite le long des limites du district où la température est toujours\nfraîche, et à, pour moyenne, cinquante-cinq degrés au nord et soixante-onze degrés au sud. Cette délimitation exclut toute la région qui se trouve au sud de la latitude de cinquante degrés, excepté l'ouest de la Virginie, et au nord de cette latitude, il faut exclure les districts du sud des États de Pennsylvanie, Ohio, Indiana, Illinois et Iowa, et y comprendre les parties nord de ces mêmes États, le Canada et les États de New-York, Virginie ouest, Michigan, Wisconsin, Minnesota et les vallées des rivières Rouge et Saskatchewan. En termes généraux, on peut dire que la zone où la production du blé atteint son maximum se trouve immédiatement au nord des districts où celle du blé-d'Inde est aussi à son maximum.\n\n\"Le commissaire Wheelock résume très exactement comme suit les arguments en faveur de l'Amérique Britannique du Nord-Ouest :\n\n\"1o Des causes physiques et économiques limitent la culture du blé aux régions où sa production atteint son maximum, c'est-à-dire à moins d'un tiers des États de l'Union, en dedans d'une zone dont la superficie est évaluée, en chiffres ronds, à 250,000 milles carrés, où il faut aller chercher les neuf-dixièmes du blé qui fournit le pain à l'Amérique et une exportation toujours croissante de céréales à l'étranger.\n\n\"2o Dans les limites de cette zone, les mêmes causes climatiques et d'autres tendent à concentrer la culture du blé dans la bande supérieure des États du Nord-Ouest, préférant toujours les districts les plus fertiles.\n\n\"3o Le Minnesota et la région au nord-ouest de cet État offrent les meilleurs districts pour la culture du blé ; la moyenne du rendement y est la plus élevée, les récoltes plus certaines et les produits les meilleurs.\"\n\n\"On ne doit pas oublier que la mission des commissaires Read et Pell, sur ce continent, était de constater les probabilités et incidents de la production des denrées alimentaires, surtout les céréales, pour répondre à la demande en Angleterre. Partant de ce point, le Free Press, de Winnipeg, donne une définition négative de la zone propre à la culture du blé et propose d'exclure les États et provinces dont le produit est moindre que la demande de la population locale. Cette délimitation exclurait les États de la Nouvelle-Angleterre et ceux du sud, New-York, New-Jersey, la Pennsylvanie, peut-être le Michigan ; relèverait l'Ohio, l'Indiana, l'Illinois, l'Iowa et le Nebraska dans la région qui produit le blé-d'Inde, et ne laisserait que le Wisconsin, le Minnesota et le Dakota (certainement au nord du 44ème parallèle) pour la région des États-Unis, à l'est des Montagnes Rocheuses, où il y a toujours un surplus, en dehors de la consommation locale. Naturellement, il faut inclure les districts considérables de la Californie et de l'Orégon ; mais il est douteux que leurs exportations puissent excéder celles de la province d'Ontario.\n\"La grande région intérieure du continent contribuera-t-elle à nos exportations de blé et de farine ? Je veux parler des territoires du Montana, Idaho, Wyoming, Colorado, Utah et Nevada. Prenons le territoire le plus favorisé, celui de Montana. Si grandes que soient ses ressources, je suis forcé de croire qu'un tiers seulement de sa superficie peut être atteint par l'irrigation qui est indispensable, et que ses ressources minières et ses vastes pâturages, pour l'élevage du bétail et des moutons, deviendront le théâtre de son activité industrielle. En 1868, après avoir fait des études minutieuses, en qualité de commissaire chargé de recueillir des statistiques sur les mines, j'écrivais ce qui suit :\n\n\"La superficie du territoire de Montana est de 146,689 35/100 milles carrés, soit 93,881,184 acres—à peu près la même que celle de la Californie, trois fois celle de l'État de New-York, deux fois et demie celle de la Nouvelle-Angleterre, et cependant, des autorités locales déclarent que l'étendue propre à la culture n'est représentée que par un acre sur trente, soit un total de 3,346,000 acres. Naturellement, les animaux domestiques peuvent vivre sur une beaucoup plus grande étendue. La condition nécessaire à la culture est, comme au Colorado et au Nouveau-Mexique, la possibilité de l'irrigation.\"\n\nDans un récent rapport de la Commission nationale de géologie, j'observe que le major J. W. Powell évalue que dans l'Utah, dont la superficie est de 84,476 milles, on peut, en utilisant les cours d'eau, sans construire de réservoirs, obtenir 1,250,000 acres environ propres à la culture du blé. Jusqu'à quelle distance, à l'est, l'irrigation est-elle nécessaire ? C'est ce que je ne saurais dire. Le professeur Henry, du \"Smithsonian Institute,\" fixait la limite à 98 degrés de longitude ; mais 101 degrés, ou trois degrés de plus à l'ouest, surtout à l'ouest de Manitoba, me semble un chiffre plus probable. Dans les régions propres à l'agriculture, l'abondance des récoltes est remarquable ; mais elles sont achetées, aux plus hauts prix, par les mineurs, les bergers et la population des villes. À ce propos, je dois rappeler que les localités du Canada central, sur la ligne qui se trouve 1,600 milles au nord-ouest de Saint Paul—je veux parler de Battleford, Prince-Albert, fort McMurray, fort Vermillon, et le fort plus connu d'Edmonton—sont tous à l'ouest du 105ème cercle de longitude, et en ligne directe de Denver City, le grand lac Salé et même Virginia City, et cependant l'irrigation n'est pas nécessaire dans aucune des régions le plus au nord. C'est le trait marquant de la \"zone fertile\" qui s'élargit, grâce aux altitudes moindres et aux courants d'air venant constamment de la côte du Pacifique—que l'immense trapézoïde dont le sommet aboutit à la rivière Mackenzie, jouit de pluies d'été suffisantes pour toutes les fins de l'agriculture telle qu'organisée dans les États de l'Atlantique et du Mississippi.\n\nJe ne soutiens pas obstinément l'exactitude d'une délimitation faite à la hâte des bornes de cette région fertile, au sud et au nord.\nJ'y renoncerais volontiers si j'étais sûr, à mon tour, que la conclusion suivante du *Pioneer Press* est exacte : \"Dans le territoire de la Baie-d'Hudson, en dehors des anciennes provinces, 200,000 acres de terre sont propres à la culture du blé.\" Pareille admission justifie pleinement la construction d'un chemin de fer sur lequel, dans dix ans, la locomotive franchirait 1200 milles de plus à partir de son point d'arrêt actuel sur la rivière Rouge. Bientôt, peut-être, l'administration des chemins de fer changera le nom du tronc de la ligne de la vallée de la rivière Rouge, pour lui substituer—si le Saint-Paul et Pacifique n'était pas retabli—cette désignation : \"Chemin de fer de Saint-Paul, Minneapolis et Athabasca.\"\n\n\"J. W. TAYLOR.\n\n\"Le 22 novembre 1879.\"\n\nM. Taylor, qui a du talent et de la science, réside à Manitoba depuis plusieurs années, et il a fait une étude spéciale du pays et de ses ressources. Doué d'un esprit observateur et juste, il n'a pas craint de dire la vérité, et son témoignage désintéressé est évidemment d'un grand poids.\n\nLa lettre du consul américain parle par elle-même et s'explique aussi d'elle-même ; c'est une réponse énergique et concluante à la feuille de Saint-Paul, qui le taxait d'exagération.\n\nM. le sénateur John Sutherland, de Manitoba, a déclaré devant un comité, à Ottawa, qu'il avait récolté 60 minots par acre, de blé du printemps, pesant 66 livres. Il a ajouté que l'on en avait eu 70 minots de la semence d'un minot.\n\nSans doute que ce sont là des faits isolés ; mais ils prouvent la force extraordinaire de production du sol.\n\nLa moyenne du rendement du blé, qui est haut, bien fourni et surmonté d'un épi serré et abondamment garni, est de 25 minots par acre.\n\nIl est établi, en outre, que la farine provenant de ce grain est de la meilleure qualité.\n\nVoici quelle est la pesanteur du blé comparée à celle des États suivants de la république voisine :\n\n| État       | Pesanteur du blé |\n|------------|-----------------|\n| Manitoba   | 63 à 66 livres   |\n| Minnesota  | 63 à 65 livres   |\n| Illinois   | 52 à 58 livres   |\n| Ohio       | 57 à 60 livres   |\n| Pennsylvanie | 57 à 60 livres |\nL'AVOINE\n\nOn la cultive avec le plus grand succès ; le rendement est quelquefois prodigieux. Citons quelques cas :\n\nM. Alex. Murray, M.P.P., de Saint-Charles, a eu, en 1876, une moyenne de 90 minots d'avoine par acre, sur un espace de 7 acres.\n\nM. Wm McLeod, de High-Bluff, en a récolté 600 minots sur 6 acres, de la semence de 12 minots.\n\nM. Donald McKay, du même endroit, en a recueilli 1,100 minots sur 10½ acres.\n\nLa moyenne est de 45 à 50 minots par acre.\n\nL'ORGE\n\nUn seul acre en a rapporté 60 minots. C'est assez dire que l'orge vient à merveille. La moyenne du rendement par acre est d'environ 35 à 40 minots, pesant 50 à 55 livres.\n\nLE SEIGLE — LE SARRASIN\n\nLe seigle a été négligé jusqu'ici ; on peut en dire autant du sarrasin.\n\nPOIS\n\nLe rendement est considérable : de 25 à 30 minots l'acre.\n\nMAÏS — BLE-D'INDE\n\nIl est une espèce particulière au pays qui pousse fort bien ; mais tous les essais n'ont pas réussi d'une manière très satisfaisante. La variété dont nous parlons ici est plus petite que celles des autres provinces.\n\nLIN ET CHANVRE\n\nCes plantes industrielles trouvent dans le riche sol du Nord-Ouest tout ce qu'il faut à leur développement. On nous dit que cette culture était fort répandue, naguère, dans la colonie de la Rivière-Rouge, et que l'impossibilité d'en écouler les produits explique seule son abandon. Rien n'en empêcherait donc, aujourd'hui, de la faire revivre.\nPOMMES DE TERRE\n\nElles poussent à souhait et atteignent des proportions pour ainsi dire exagérées—ce qui ne nuit en rien, cependant, à leur goût exquis.\n\nIl est connu qu'un seul acre en a donné, plus d'une fois, 600 minots.\n\nAinsi, par exemple, M. J. W. Sifton, l'un des entrepreneurs du Pacifique canadien, en a récolté 275 minots dans un rayon d'un quart d'acre.\n\nM. F. C. Shipp, de la Pointe-Douglas, à Winnipeg, a extrait de son jardin l'un de ces tubercules pesant 4 livres.\n\nIl a été éclipsé, toutefois, par M. John Omand, de Saint-James, qui a exhibé, à Winnipeg, une pomme de terre de 5 livres. Nous l'avons vue de nos yeux.\n\nLa moyenne est de 400 à 500 minots par acre.\n\nNAVETS—PANAIS\n\nOn en a retiré plus de 1,000 minots d'un acre. Ils sont fort remarquables, en outre, par leur grosseur.\n\nM. J. B. Clarke, de Saint-James, a récolté, en 1876, une moyenne de 1,000 à 1,200 minots de navets par acre, sur une étendue de 7 acres.\n\nÀ l'exposition provinciale tenue à Winnipeg, la même année, l'on exhibait un navet pesant 36½ livres ; nous avons pu vérifier le fait nous-même. Ce phénomène végétal a été expédié aux États-Unis pour y figurer au Centenaire, où il brilla, dit-on, au premier rang parmi ses congénères.\n\nLa moyenne de la production des navets est de 500 à 700 minots par acre.\n\nLes panais poussent également bien.\n\nBETTERAVES\n\nElles pèsent jusqu'à 16 livres ; c'est l'exception sans doute, mais l'on voit quelle peut être la moyenne de leur volume.\n\nAjoutons que le sol convient parfaitement à la betterave à sucre, et que l'on parle d'organiser une industrie des plus lucratives.\n\nLES CHOUX\n\nRien de plus beau à voir que ce produit, admirable par son développement et sa qualité. À l'exposition provinciale de 1876, il y en avait une collection splendide. On en pesa un du poids de 26 livres ; nombre d'autres pesaient 25 livres.\nCAROTTES\n\nElles poussent aussi bien que les betteraves et sont excellentes.\n\nOIGNONS\n\nIls sont vraiment superbes. On s'étonne de leurs dimensions qui paraissent extravagantes.\n\nMELONS, CONCOMBRES, CITROUILLES\n\nAvec un peu de soin, l'on réussit.\n\nCitons ce qu'écrivait un voyageur dans le Tour du Monde, en 1860, parlant de la ferme d'un M. Gowler, sur l'Assiniboine :\n\n\"Ses propriétés sont considérables ; il ne peut même en cultiver qu'une partie, dont cinquante en céréales ; le reste en maïs, en navets, en pommes de terre, les plus belles qu'il soit possible de voir. Ses melons n'ont pas de pareils et pèsent jusqu'à six livres. Le jardin de la ferme lui fournit en outre, avec beaucoup de légumes variées, le tabac nécessaire à son usage. Quant aux fourrages, la prairie est là pour en fournir.\n\n\"Il est à regretter que toutes les exploitations rurales de la Rivière Rouge ne puissent rivaliser avec celles-là. Certes, ce n'est pas la nature qui déjoue les espérances de l'agriculteur, ni le sol qui contrarie ses efforts. Il n'en est pas de plus fertile et de plus favorable. Le maïs croît partout ; on le plante vers le 1er juin, et il est mûr à la fin d'août ; j'en dirai de même du blé, qu'on récolte trois mois après l'avoir semé ; un foin d'une qualité supérieure couvre des milliers d'hectares ; les plantes potagères, en usage au Canada, se développent avec une vigueur peu commune sur les bords de la rivière Rouge et de l'Assiniboine. Tout est réuni pour faire de la colonie un centre de production sans égal.\"\n\nNous avons vu à la dernière exposition fédérale tenue à Ottawa, dans le pavillon de Manitoba, des pommes de terre du poids de 4 livres, des betteraves de 8 livres, des carottes de 2 livres, des oignons ayant 1 pied, et des choux, 4 pieds de circonférence. M. C. de Cazes, de Winnipeg, a exposé de magnifiques échantillons de cannes à sucre.\n\nEt notez bien qu'il avait fallu extraire tout cela au moins trois semaines plus tôt qu'à l'ordinaire, afin d'arriver à temps à Ottawa.\n\nEn résumé, nous pouvons dire que tout ce qui se trouve d'ordinaire dans le jardin potager croit à merveille.\nIl y a abondance de fruits sauvages au Nord-Ouest, parmi lesquels se trouvent le raisin, la prune, la fraise, la cerise, la merise, la framboise, la catherinette, la senelle, la gueule noire, la poire, la groseille, la gadelle, le bluet, la mûre, l'atoca, etc., etc.\n\nLa culture des fruits n'a guère préoccupé le colon jusqu'à ce jour ; mais son attention, éveillée par des expériences satisfaisantes, se tourne un peu plus de ce côté-là.\n\nM. W. B. Hall, de la paroisse de Headingley, située à une courte distance de Winnipeg, possède un fort joli jardin planté d'arbres fruitiers de toute espèce, au nombre de près de 100.\n\nÀ la dernière exposition fédérale, nous avons vu des pommes de Manitoba.\n\nÉLÈVE DES ANIMAUX\n\nTous ceux qui ont pu admirer les immenses prairies qui se déroulent à perte de vue dans les territoires de l'Ouest, s'accordent à dire que c'est le pays où l'élevage des animaux peut se faire avec le plus de succès et le moins de frais. De bonne heure, au printemps, les troupeaux quittent l'étable pour se répandre dans la plaine où croissent, en grande variété, les hautes et grasses herbes. (Il en a été exposé, à Ottawa, près de 20 échantillons.) Et durant la belle saison, c'est-à-dire du 15 juillet au 15 de septembre, le cultivateur coupe le foin dont il a besoin pour l'hiver, sans avoir rien à débourser.\n\nÀ l'automne, les animaux sont dans la meilleure condition possible, et la saine température de la froide saison favorise aussi leur développement.\n\nJusqu'ici, l'on a trop négligé ce genre d'industrie, qui assure un bénéfice considérable. Des milliers d'animaux—chevaux, bestiaux*, moutons, cochons—sont expédiés chaque année des États voisins de la république, et il faut que le commerce soit bien lucratif pour qu'il y ait profit à envoyer de nombreux troupeaux, du Montana, par exemple. Un Canadien-français, M. J. Demers, qui habite ce territoire américain, en a amené plus de 1,500 à Manitoba, et il y trouvait son compte.\n\nÀ ce propos, les directeurs de la Société d'agriculture provinciale disaient dans l'un de leurs rapports :\n\n\" Il serait fort à désirer que l'on s'occupât davantage de l'élève des bêtes à cornes, cochons, moutons, vu que les besoins des nouveaux colons, les partis d'explorateurs, d'arpenteurs et autres, au service du gouvernement, la police du Nord-Ouest, devront rendre le marché local très profitable durant plusieurs années.\"\n\n* Le bœuf domestique a été importé en 1825, et le mouton—qui n'a jamais été attaqué par aucune maladie—en 1833.\n\"Les prairies, dit Mgr Taché, ont de quoi nourrir un nombre infini de bestiaux, non-seulement à cause de leur étendue, mais aussi par la nature même et la richesse de leurs produits, qui valent les meilleurs prés de trèfle.\n\n\"Les animaux de boucherie s'engraissent dans les prairies naturelles sans aucun secours, et quand l'animal est dans les conditions de santé, il atteint assez rapidement un état qui le rend digne des meilleurs marchés.\"\n\nLe vicomte Milton et le Dr W. Cheadle, qui ont traversé les Montagnes Rocheuses, disent aussi dans leur ouvrage, publié en 1866 :\n\n\"Nous avons lâché nos chevaux, au début de l'hiver, à la Belle Prairie\". Bien qu'ils eussent été fort maigres quand la neige avait commencé à tomber, ils étaient devenus de vraies boules de graisse. La pâturage est si nourrissant que même en hiver, où ils ont à chercher leur nourriture sous la neige, les animaux engraisse rapidement, pourvu qu'ils trouvent des bois où s'abriter contre les rigueurs de la température.\n\n\"Les vaches laitières et les bœufs de trait, près de la Rivière Rouge, sont dans une condition presque aussi belle que celle du bétail nourri dans les étables et amené à l'exposition de Baker Street.\"\n\nLe gouvernement affirme des terres à foin de 40 acres, ainsi que des pâturages, pour faciliter, sans doute, l'élevage des animaux — exploitation qui deviendra, bientôt, l'une des plus importantes.\n\nQui a foin a pain, dit le proverbe, et c'est vrai, puisque, dit-on, le foin des prairies naturelles et artificielles, ce n'est pas seulement du pain, mais aussi de la viande, du lait, de la laine et du travail.\n\nLe rendement du foin est de 3, 4 et 5 tonnes l'acre.\n\nLAITAGE\n\nÀ l'élevage des animaux, se relie une autre industrie domestique qui accroît les bénéfices considérablement : nous voulons parler du commerce de laitage, de la fabrication du beurre et du fromage, articles dont la vente est aussi facile que rémunérative, même sur le marché local.\n\nLES ABEILLES\n\nElles s'acclimatent aisément ; on assure que les expériences faites jusqu'ici ne laissent aucun doute à ce sujet. Voilà donc encore une industrie à laquelle le colon peut se livrer avec avantage.\n\n* Belle Prairie est située près de la rivière aux Coquilles, à l'ouest.\nLes rivières et les lacs en sont peuplés. Mentionnons la perche et le crapet, assez rares toutefois ; le doré et la carpe, abondants ; le brochet et le maskinongé, qui atteignent des proportions remarquables ; la laquèche, ou \"Gold Eye,\" que l'on prend en grande quantité ; le poisson blanc, dont il se fait un commerce considérable ; la barbue, qui fréquente surtout la rivière Rouge et les lacs situés dans le voisinage, ainsi que les tributaires du lac Winnipeg, où apparaît aussi l'éturgeon, etc., etc. Dans les rivières arctiques pullulent le saumon et la truite ; cette dernière, ou plutôt une variété, habite aussi les lacs dont les eaux sont tranquilles.\n\nANIMAUX SAUVAGES, GIBIER, ETC\n\nLe Nord-Ouest est le pays des animaux à fourrures, du gibier en général. Nous pouvons mentionner surtout le bison, le boeuf musqué, l'ours, l'orignal, le caribou, le cerf, le chevreuil, la gazelle ou cabri, le loup, la chèvre et le mouton des montagnes, le renard, le blaireau, le carcajou, le chat sauvage, le chat tigre, la martre, le vison, le castor, la loutre, l'hermine, le lièvre, le lapin, le rat musqué, la belette ; aussi, dans un autre ordre, le faisan ou poule de prairie, la perdrix, la tourte, les canards, les oies, etc.\n\nEn deux jours, l'honorable James McKay et son serviteur ont tué plus de 500 canards, outre un nombre considérable de poules de prairies, etc.\n\nTrois chasseurs émérites, de Winnipeg, ont également abattu, en deux jours, près du lac Winnipeg, près de 900 canards.\n\nL'un de nos amis en a tué 100 durant une seule journée, à treize milles de distance de Winnipeg.\n\nBOIS\n\nIl est indéniable que le bois est relativement rare au Nord-Ouest. Mais cet inconvénient—compensé par mille autres avantages—tout malheureux qu'il puisse être, ne saurait devenir un obstacle à la colonisation. Jusqu'ici l'on n'en a que peu souffert, et le chemin du Pacifique—avec ses embranchements—devra rapprocher bientôt Manitoba de la grande région boisée qui se développe à l'est. On sait, en effet, que les vallées de la rivière la Pluie, de la rivière Winnipeg, et le territoire compris entre le lac des Bois et la rivière Rouge, en renferment d'immenses quantités de différentes espèces. D'autre part, les rivières Rouge, Assiniboine, la Seine, au Rat et autres sont également bordées de deux lisières de bois, et là et là dans la prairie se dressent aussi de jolis bouquets.\nA l'ouest, de grands cours d'eau traversent la forêt dont Mgr Taché estime la superficie totale à environ 480,000 milles carrés, de même qu'il évalue à 60,000 milles carrés l'étendue des prairies, et au même chiffre, ou à peu près, le prolongement du vaste désert américain au-delà de notre frontière, c'est-à-dire du 49ème parallèle.\n\nLes principales essences de bois que l'on trouve à Manitoba, à Keewatin et à l'ouest, sont l'ébène, la plaine, le pin rouge et blanc, le cèdre, le chêne, l'orme, le frêne, l'épinette, le bouleau, le tremble, le liard, le tilleul, le sapin, le cyprès, etc.\n\nLe bois de construction est importé, en grande partie, des États voisins ; on l'expédie en radeaux, par la voie de la rivière Rouge, et il est scié dans la province. Il y a de grandes scieries à Winnipeg et ailleurs.\n\nIl paraît que le gouvernement américain a ordonné l'exploration de treize townships, couverts de pins, sur les tributaires du lac à la Pluie. On en profitera donc.\n\nUne certaine quantité de bois de chauffage vient de la même source, outre ce que fournit le pays.\n\nNous publions les priv plus loin.\n\nCHARRON\n\nIl est constaté depuis longtemps que le Nord-Ouest recèle de riches mines de houille, dont l'analyse a établi la valeur ou la supériorité. Nous n'avons pas besoin de disserter sur le rôle que joue aujourd'hui le charbon dans le domaine de l'industrie.\n\n\"Les terrains houillers que traversent les différentes branches de la Saskatchewan sont une grande source de richesse, dit Mgr Taché, et favoriseront la colonisation de cette vallée, où la nature a multiplié des sites d'une beauté qui défie ce qu'il y a de plus remarquable au monde en ce genre.\" Plus loin, il ajoute : \"Les mines de charbon que renferme le district de la Saskatchewan lui assurent une importance incontestable. L'immense dépôt houiller se montre à découvert aux falaises du grand fleuve.\"\n\nLe vicomte Milton et son ami, le Dr Cheadle, en parlent ainsi :\n\n\"Les bords de la rivière Pembina laissent voir la section d'un magnifique gisement de charbon, ayant quinze à vingt pieds de profondeur....On a encore trouvé le charbon, au nord, sur les rivières Macleod, Athabasca, Fumerose, de la Paix, et Mackenzie : vers le sud, sur la Saskatchewan et les rivières de la Bataille et du Cerf. À Edmonton, dans la falaise qui domine le bord de la rivière, on en voit un gisement qui est employé pour la forge. Ainsi, on a observé des couches de houille où plusieurs endroits, dispersées dans un espace de plus de dix degrés de latitude, mais presque invariablement sous le même méridien. En tirant une ligne depuis la rivière Mackenzie jusqu'au confluent de la rivière\ndu Cerf, dans la Saskatchewan méridionale, on aurait trouvé exactement celle qui détermine la position des gisements de charbon, observés jusqu'ici. Ils ont une étendue considérable et formeront sans doute, un jour, un des principaux éléments de la richesse de ce district de la Saskatchewan, que la nature a si extraordinairement favorisé.\"\n\nIl est indubitable, dit le professeur Macoun, que dans la région à l'ouest d'Edmonton, laquelle est bornée au nord par la rivière Athabaskaw et au sud par la rivière du Daim-Rouge, il existe un terrain houiller d'au moins 25,000 milles carrés ; et dans cette vaste étendue l'on peut espérer que l'on trouvera des veines exploitables à des profondeurs qui excéderont rarement 300 pieds, et souvent, comme dans le cas des veines épaisses plus haut décrites, très-favorablement situées pour l'exploitation au moyen de galeries pratiquées à la surface.\n\nLes rapports géologiques confirment ces renseignements. Il y a quelques mois, l'on a fait grand bruit de la découverte de riches dépôts de houille près de la rivière Souris, l'un des tributaires de l'Assiniboine et dont la source se trouve près de la frontière, à plus de 300 milles à l'ouest de la rivière Rouge. Bien plus, une compagnie devait s'organiser de suite pour exploiter la mine et en transporter les produits à Winnipeg.\n\nTOURBE\n\nLes dépôts tourbeux abondent au Nord-Ouest, et l'on sait que la tourbe, à défaut de bois ou de charbon, fournit un excellent combustible.\n\nLES TERRES—HOMESTEADS—PRÉEMPTIONS, ETC.\n\nLes terres à Manitoba sont groupées par townships, lesquels—au nombre de 360—mesurent six milles carrés chacun et couvrent une superficie d'à peu près 14,000 milles, ou soit plus de 9,000,000 d'acres.\nA leur tour, les *townships* sont divisés en sections—ils en contiennent 36 chacun—disposées et numérotées de la manière indiquée par le diagramme suivant :\n\n**DIVISION D'UN TOWNSHIP**\n\n| N. |\n|----|\n| 31 | 32 | 33 | 34 | 35 | 36 |\n| 30 | 29 | 28 | 27 | 26 | 25 |\n| 19 | 20 | 21 | 22 | 23 | 24 |\n| 18 | 17 | 16 | 15 | 14 | 13 |\n| 7  | 8  | 9  | 10 | 11 | 12 |\n| 6  | 5  | 4  | 3  | 2  | 1  |\n\nUne section, d'un mille carré, se compose de 640 acres.\nUne demi-section, de 320 acres.\nUn quart de section, de 160 acres.\nUn demi quart de section, de 80 acres.\nUn quart de quart de section, de 40 acres.\n\nAinsi donc, 4 quarts de section constituent une section subdivisée comme suit en 16 quarts de quart de section :\n\n| N. |\n|----|\n| 13 | 14 | 15 | 16 |\n| 12 | 11 | 10 | 9  |\n| 5  | 6  | 7  | 8  |\n| 4  | 3  | 2  | 1  |\n\nLa loi du *homestead* confère au colon le droit de propriété sur la terre qu'il doit cultiver durant trois années avant d'obtenir son titre du gouvernement. Il faut être âgé d'au moins dix-huit ans pour avoir le bénéfice de cette loi si libérale, et l'inscription du lot ne coûte que $10. C'est là ce qu'on appelé aussi une concession gratuite.\nLa loi de préemption permet au colon d'acheter—outre son homestead—un nombre égal d'acres, dans le voisinage immédiat, à des prix déjà fixés, variant de $1 à $2.50 l'acre, selon la distance du chemin de fer du Pacifique, et aux conditions déterminées par le gouvernement.\n\nIl importait de bien renseigner le lecteur sur ces différents points, avant de faire connaître et de discuter les règlements qui concernent les terres publiques du Nord-Ouest.\n\nRÈGLEMENTS DE JUILLET DERNIER—LEUR SUPPRESSION\n\nAu mois de juillet dernier, le gouvernement décida de modifier la loi. Il fallait songer alors à se créer de nouvelles sources de revenus pour poursuivre les travaux du chemin de fer du Pacifique avec toute l'activité possible. Et il n'était que juste de faire contribuer à l'exécution d'une entreprise nationale aussi coûteuse, ceux qui devaient en bénéficier d'une manière plus directe et plus prompte. Nous allons donc analyser les règlements promulgués et mis en vigueur le premier jour d'août 1879.\n\nL'ordre du conseil portant la date du 2 juillet, divisait le pays en cinq zones ou bandes, désignées par les lettres \"A\" \"B\" \"C\" \"D\" \"E,\" et se déroulant successivement de chaque côté de la voie transcontinentale dont le tracé imaginaire suivait la \"quatrième ligne de base à partir de la rivière Rouge, à l'ouest, jusqu'à son intersection, par une autre ligne située entre les rangs 21 et 22, à l'ouest du premier méridien principal, pour de là se diriger tout droit au confluent des rivières aux Coquilles (Shell) et Assiniboine.\"\n\nUn coup d'œil sur la nouvelle carte que vient de publier le département de l'intérieur, à Ottawa, indiquerait mieux le cours supposé du Pacifique, et permettrait de juger exactement de la situation des zones ou bandes que nous allons décrire.\n\nLa première bande \"A,\" voisine du chemin de fer et devant comprendre une largeur de cinq milles de chaque côté de la route, était fermée à l'occupation gratuite ; c'est-à-dire que le colon ne pouvait y prendre un homestead : il avait à payer six piastres par acre.\n\nLa deuxième bande \"B,\" mesurait une largeur de quinze milles de chaque côté de la route.\n\nIci le colon avait la liberté de s'établir sur un homestead, en versant la somme de $10.00 pour les frais d'inscription, et de préempter la même étendue de terrain voisine de son lot, à raison de $2.50 l'acre, dans les sections portant les numéros pairs—celles portant les numéros impairs étant réservées pour être vendues au compte du Pacifique, au taux de $5 l'acre.\n\nLa troisième bande \"C,\" de vingt milles de largeur, était également ouverte aux homesteads ainsi qu'aux préemptions—le ter-\nrain ainsi préempté se vendant $2.50 l'acre—dans les sections portant les numéros pairs ; les autres, portant les numéros impairs, étant réservées pour être vendues au compte du Pacifique, au chiffre de $3.50 l'acre.\n\nLa quatrième bande \"D,\" de la même largeur que la précédente, offrait un accès encore plus facile à l'émigrant, qui, outre son homestead, pouvait préempter et acquérir des terres affectées au Pacifique—sections portant les numéros impairs—au prix uniforme de $2 l'acre.\n\nLa bande \"E,\" la dernière et la plus éloignée de la ligne, était large de cinquante milles ; là encore, les conditions devenaient fort faciles. On n'exigeait pour les terres préemptées et appartenant au Pacifique, que $1.00 de l'acre, tout en concédant un homestead.\n\nEnfin, le gouvernement, pour faciliter davantage la colonisation, permettait à l'émigrant de ne payer que les quatre-dixièmes du prix de vente au bout de trois ans, avec intérêt à six pour cent, et le reste, en six versements annuels égaux.\n\nAussitôt qu'il fut connu que l'on avait diminué de moitié les homesteads et les prémptions—dont l'étendue n'était plus que de 80 au lieu de 160 acres chacun—and que le prix des terres était ainsi accru, les agents américains se mirent en campagne. Ils déprécièrent sans scrupules les avantages que le Nord-Ouest canadien présentait à l'émigration, sans omettre d'attribuer aux États-Unis une supériorité que nous leurions. Il y eut, d'autre part, une discussion assez vive dans la presse canadienne, et un marchand distingué de Winnipeg, M. Wm Bathgate, publia dans le Times de cette ville des lettres remarquables, en réponse à ceux qui décriaient injustement le Canada au profit de nos voisins.\n\nNous reproduisons l'extrait suivant :\n\n\"Voici ce que je lis dans le Mercury, de Guelph, à la date du 25 septembre :\n\n\"D'abord, l'accès des terres, dans les territoires du Nord-Ouest, a été ver- tuellement interdit aux personnes qui se proposent de s'établir comme colons. Sur une distance de plusieurs milles, de chaque côté de la ligne du chemin du Pacifique, le prix de l'acre est fixé au chiffre élevé de six dollars. Plus en arrière de ce seul débouché, elles coûtent cinq, quatre et trois dollars l'acre. À moins de se rendre dans la solitude la plus éloignée, à cent dix milles de toute issue et de toute ligne de transport, le colon ne peut se procurer des terres qu'en les payant le double de leur valeur. Point de terres, point de droit de prémption pour l'émigrant pauvre, ou qui n'a que des ressources modestes.\"\n\nCette citation contient autant de faussetés que de mots.\n\n\"On lit dans les règlements publiés concernant les terres :\n\n(On les connaît déjà.)\n\n\"Ainsi, un colon de la bande \"B,\" à une distance de cinq à vingt milles du chemin, reçoit gratuitement un octroi de quatre-\nvingts acres de terre. Et s'il achète quatre-vingts acres de plus, il paie, au bout de trois ans, les quatre-dixièmes\n\n| Du prix d'achat, $200 | $80 00 |\n|-----------------------|--------|\n| Avec intérêt          | 36 00  |\n\n$116 00\n\nQuatrième année, $20, avec intérêt, $7 20 ................. 27 20\nCinquième \" 20, avec intérêt, 6 00 ..................... 26 00\nSixième \" 20, avec intérêt, 4 80 ..................... 24 80\nSeptième \" 20, avec intérêt, 3 60 ..................... 23 60\nHuitième \" 20, avec intérêt, 2 40 ..................... 22 40\nNeuvième \" 20, avec intérêt, 1 20 ..................... 21 20\n\nLes 160 acres lui coûteront dans dix ans .................. $261 20\n\n\"Et, cependant, le rédacteur du Mercury écrit :\n\"Point de terres, point de préemption ; on ne peut obtenir les terres que pour deux ou trois fois leur valeur.\"\n\"Que connaît ce journaliste au sujet de la valeur des terres de ce pays ? Il n'est jamais venu ici et a dû bien peu entendre parler de notre pays, au sujet duquel il a lu encore moins, pour faire, de bonne foi, pareille assertion. Ou, s'il est bien renseigné, il dénature volontairement la vérité, n'indique aucunement par quel calcul il arrive à fixer la valeur des terres dans ce pays, et voudrait que chacun se contente de son ipse dixit.\n\n\"Comme la valeur des terres dépend de celle de leurs produits, nous ne pouvons arriver à une juste évaluation et donner une idée exacte de la valeur des terres qu'en les comparant aux terres avoisinantes du Minnesota et du Dakota. MM. Howard, White, Crowell et Cie., éditeurs du Daily Commercial Bulletin, de Chicago, en évaluant la récolte des États-Unis, s'expriment ainsi : \"Le rendement moyen de la récolte, dans le nord-est des États-Unis, est estimé à 12,92 minots par acre, contre 11,42 minots l'année dernière.\"\n\n\"La moyenne du rendement est fixée à 14,11 minots pour le Minnesota et 15,80 minots pour le Dakota.\n\n\"Il est impossible de calculer la moyenne de notre récolte de blé, cette année, parce qu'on en a encore battu trop peu. Mais d'après des conversations avec des personnes venant de diverses parties du pays, et avec d'autres personnes qui s'attachent à calculer cette moyenne, elle est, au moins, de vingt-cinq minots par acre, bien que la saison ait été fort humide et que la récolte des terres basses ait été plus ou moins endommagée. Il faut considérer aussi qu'une grande partie de la récolte provient de terres qui sont en culture depuis plus de 40 ans et sur lesquelles on n'a jamais mis d'engrais. Un colon de la petite Saskatchewan m'informe qu'il espère obtenir, au moins, 35 minots par acre pour sa première récolte, et d'autres portent ce\nrendement à 45 minots. MM. Knight et Crawford, commerçants de denrées alimentaires, m'informent que, près de Poplar-Point, ils ont acheté de l'avoine d'un cultivateur qui dit qu'elle a rendu 75 minots par acre, en sortant de la machine à battre, et que les 75 minots de cette avoine représentaient le poids de 96 minots. Ils m'ont appris également que l'avoine noire de Tartarie pesait 44 lbs. à la sortie de la machine, et, une fois nettoyée, 48 lbs. au minot.\n\nDans le Guide de Manitoba par Begg, on trouve le rapport suivant des récoltes de 1856 : M. Good, Grassmere, 37 minots par acre ; MM. McIver et Greenwood disent qu'ils ont récolté 25,000 minots à 35 minots par acre, et qu'ils ont atteint le chiffre de 50 minots. On pourrait citer plusieurs autres chiffres, qui prouvent le rendement énorme du blé dans cette province. Au Minnesota et au Dakota, M. Dalrymple lui-même ne réclame, sur sa grande propriété, que vingt minots par acre.\n\nPrenant pour moyenne le faible chiffre de vingt-cinq minots par acre, nous aurions neuf minots de plus par acre qu'au Dakota, et neuf minots de plus qu'au Minnesota. Supposant que le colon puisse obtenir une terre, au Minnesota et au Dakota, à environ 25 milles du chemin de fer—ce qui, me dit-on, est la distance la plus rapprochée à laquelle on puisse obtenir des concessions—et qu'il paie $6 l'acre, à 5 milles du chemin de fer, ici, dans deux ans, il récoltera une moyenne de 18 minots par acre de plus qu'au Minnesota ou au Dakota, ce qui paiera sa terre, et au delà, et lui assurera une bonne propriété.\n\nEn outre, les frais de charroi du produit de 160 acres, pendant dix ans, sur la distance extra de 20 milles, au Minnesota ou au Dakota, paiera plus qu'amplement le prix de $6 l'acre, parce que le charroi, sur cette distance, du produit d'un acre ne coûte pas moins de 60 cents.\n\nUn autre point à considérer est le fret jusqu'au lac. Actuellement, M. Dalrymple paie environ 25 cts. par minot jusqu'à Duluth et Saint-Paul. M. Dalrymple dit que le fret lui coûte 15 cts. par minot du Dakota aux mêmes ports, et de là, jusqu'à New-York, 10 à 12 centins. Par conséquent, le colon du Dakota a un avantage de 10 centins par minot. Mais quand nos 431 milles (à peu près) de chemin de fer seront terminés, M. Brydges déclare que, vu la supériorité du nivellement, on pourra transporter le blé à raison de cinq centins par minot. On dira que le prix est trop faible. Mais quand M. Mackenzie était au pouvoir, il avait donné ordre de transporter le blé, de la Rivière-du-Loup à Halifax, pour 2½ centins par minot. Naturellement, la ligne perdait à ce prix. Mais comme cette perte est inutile, admettons que l'évaluation de M. Brydges est trop faible et accordons-lui 7½ centins. Nous trouvons ainsi que le cultivateur de Manitoba a un avantage de 7½ centins sur le colon du Dakota, qui, en prenant 25 minots\npour moyenne de production, donne un profit annuel de $1.88 sur le produit exporté de chaque arpent de terre. En dix ans, la période qu'il lui faut pour payer sa terre, il gagne, à Manitoba, $18.80 de plus que le cultivateur du Dakota sur le fret seulement, ce qui équivaut au produit de neuf minots de plus par acre. On dira que les cultivateurs du Dakota profiteront du bas prix de notre transport et enverront leur blé par notre ligne. Mais cela serait contraire aux intérêts des lignes qui viendraient ainsi alimenter la nôtre, et elles adopteront, pour les produits du nord, un tarif qui forcera les expéditeurs à prendre leurs lignes. Les bateaux transporteront bien peu de blé l'automne, vu la baisse des eaux, et les inconvénients des transbordements, des bateaux en char, coûteront encore les avantages du bas prix.\n\nMais la grande objection aux réglements est qu'ils n'accordent que 80 acres, au lieu de 160 comme au Dakota. Mais il faut observer que 80 acres ici produisent autant que 120 acres là-bas; que la culture d'un acre coûte $8, d'après M. Darlymple, qui emploie tous les instruments les plus perfectionnés; et qu'ayant 40 acres de moins à cultiver, le cultivateur du Manitoba économisera trois cent vingt dollars par année. Ainsi donc, le colon de Manitoba qui prend une terre, en conformité aux réglements du gouvernement actuel, se trouve infiniment mieux que le colon qui prend une concession ou achète un droit de préemption d'après les lois du Dakota.\n\nJe suis, etc.,\nWM BATHIGATE.\n\nWINNIPEG, LE 20 OCTOBRE 1879.\n\nIl ressort de cette citation plusieurs faits importants. L'auteur établit que nous pourrions transporter les grains du Nord-Ouest canadien au taux de 7½ cents sur le chemin du Pacifique, tandis que les lignes américaines exigent 25 cents par minot, de Winnipeg à Duluth ou à Saint-Paul. C'est-à-dire que nous épargnerions 17½ cents par minot. En d'autres termes, l'exportation des céréales par la voie du Pacifique, qui sera bientôt en opération entre la Baie du Tonnerre et la Rivière-Rouge, coûterait $1.88 par acre—Le rendement d'un acre étant de 25 minots en moyenne —et par la voie des États Unis, $4.38 de plus par acre, annuellement. Cette différence considérable en faveur du Canada représente une valeur annuelle qui, virtuellement, réduit d'autant le prix de vente de la terre et permettrait au cultivateur d'acquérir ses titres de propriété, en bien peu d'années, avec le produit seul de ces épargnes. Comme le fait remarquer aussi avec justesse M. Bathgate, les terres de l'occident canadien produisent\nbeaucoup plus que le sol du Minnesota ou du Dakota—nos voisins l'admettent eux-mêmes—et la qualité l'emporte sur la quantité, puisque les frais d'exploitation deviennent alors relativement moindres.\n\nLes calculs qui précèdent n'ont rien de fantaisiste ; ils s'appuient sur des faits et des garanties qui ne sauraient nous tromper, comme celle, par exemple, que nous offre la politique ministérielle au sujet du Pacifique, dont la partie qui s'étend du lac Supérieur à la Rivière-Rouge sera probablement ouverte d'ici à un an.\n\nUne dernière réflexion à ce propos : il en coûte à peu près autant pour le transport des produits de Winnipeg à Saint-Paul ou à Duluth que de ces deux endroits à Liverpool. Ce monopole ruineux que nous avons dû subir va heureusement cesser.\n\nLES RÈGLEMENTS EN VIGUEUR\n\nLes réglements dont nous venons de parler n'existent plus ; ils ont été annulés par un ordre subséquent du Conseil, et remplacés par d'autres. Nous avons voulu, cependant, en discuter la valeur, afin de rétablir la situation sous son véritable jour. Il est certain que nombre de gens ont pu être trompés par ceux que l'intérêt poussait à établir un parallèle injuste pour notre pays—et il importait de dissiper ces fausses impressions.\n\nLa visite de Sir John A. Macdonald et de Sir Leonard Tilley en Angleterre a permis d'adopter une politique encore plus libérale. Comme nous le disions, le but des réglements du mois de juillet dernier était surtout de créer par la vente des terres, à des prix variant de $1 à $6, un fonds, qui devait permettre de poursuivre les travaux du Pacifique, sans trop obérer les finances nationales. Tout le monde sait aujourd'hui que la mission du premier ministre et de son collègue se rattachait à ce grand œuvre qui achèvera de consolider la confédération, et c'est au succès qui lui est attribué que nous devons sans doute les derniers règlements datés du mois d'octobre.\n\nAprès avoir démontré que nous n'avons rien à envier à nos voisins sous la loi de juillet, le public appréciera davantage la supériorité incontestable de la loi nouvelle sur la loi américaine. Avant d'indiquer ces heureux changements, disons que le territoire reste divisé en cinq bandes \"A\" \"B\" \"C\" \"D\" et \"E\" et de la même largeur, comme autrefois.\n\nLes homesteads et préemptions ne contiennent plus seulement 80, mais 160 acres—ce qui rend à la propriété l'étendue ordinaire—and sont concédés dans les cinq bandes. On a supprimé l'article qui exigeait $6.00 de l'acre pour les terres comprises dans la zone \"A,\" voisine du chemin de fer.\nAinsi, les terres susceptibles d'être préemptées dans les sections portant les numéros pairs, seront vendues aux prix suivants : Dans les bandes A, B et C, à $2.50 (deux piastres et cinquante centimes) l'acre ; dans la bande D, à $2 (deux piastres) l'acre ; et dans la bande E, à $1 (une piastre) l'acre.\n\nAu bout de trois ans, les quatre-dixièmes du prix de vente seront exigibles avec l'intérêt, au taux de six pour cent par année ; et le reste sera payable en six versements annuels, portant le même intérêt.\n\nLes terres du Pacifique situées dans les sections portant les numéros impairs, seront vendues aux prix suivants : Dans la bande A, $5 (cinq piastres) l'acre ; dans la bande B, $4 (quatre piastres) l'acre ; dans la bande C, $3 (trois piastres) l'acre ; dans la bande D, $2 (deux piastres) l'acre ; dans la bande E, $1 (une piastre) l'acre.\n\nConditions de vente : Un dixième au comptant, lors de l'achat ; et la balance payable en neuf versements annuels égaux, avec intérêt au taux de six pour cent par année sur ce qui restera dû.\n\nPour faire ressortir avec plus de force les règlements du mois de juillet, et ceux du mois d'octobre dernier, nous les mettrons en regard, à l'aide d'une analyse sommaire :\n\n**REGLEMENTS DU MOIS D'AOUT**\n\n**BANDE \"A\"**\n\nPas de concession gratuite de *homesteads*. Prix des terres, $6.00 de l'acre\n\n**BANDE \"B\"**\n\n*Homesteads* gratis, à condition de les occuper durant trois années, et de payer $10.00 pour l'inscription.\n\nPrix des terres préemptées, $2.50 l'acre. Prix des terres du chemin de fer, $5.00 l'acre.\n\n**BANDE \"C\"**\n\n*Homesteads* gratis, comme ci-dessus. Prix des terres préemptées, $2.50 l'acre. Prix des terres du chemin de fer, $3.50 l'acre.\n\n**BANDE \"D\"**\n\n*Homesteads* gratis, comme ci-dessus. Prix des terres préemptées, $2.00 l'acre. Prix des terres du chemin de fer, $2.00 l'acre.\nBANDE \"E\"\n\nHomesteads gratis, comme ci-dessus. Prix des terres préemptées, $1.00 l'acre. Prix des terres du chemin de fer, $1.00 l'acre.\n\nREGLEMENTS DU MOIS D'OCTOBRE\n\nBANDE \"A\"\n\nHomesteads gratis, à condition de les occuper durant trois années, et de payer $10.00 pour l'inscription. Prix des terres préemptées, $2.50 l'acre. Prix des terres du chemin de fer, $5.00 l'acre.\n\nBANDE \"B\"\n\nHomesteads gratis, comme ci-dessus. Prix des terres préemptées, $2.50 l'acre. Prix des terres du chemin de fer, $4.00 l'acre.\n\nBANDE \"C\"\n\nHomesteads gratis, comme ci-dessus. Prix des terres préemptées, $2.50 l'acre. Prix des terres du chemin de fer, $3.00 l'acre.\n\nBANDE \"D\"\n\nHomesteads gratis, comme ci-dessus. Prix des terres préemptées, $2.00 l'acre. Prix des terres du chemin de fer, $2.00 l'acre.\n\nBANDE \"E\"\n\nHomesteads gratis, comme ci-dessus. Prix des terres préemptées, $1.00 l'acre. Prix des terres du chemin de fer, $1.00 l'acre.\n\nLes principales dispositions de la loi canadienne relative aux terres sont donc :\n\n1o. La concession gratuite d'un homestead de 160 acres, dans les cinq bandes qui se déplient de chaque côté de la ligne du Pacifique, à condition que le colon paie la légère somme de dix piastres, pour l'inscription du titre, au bureau des terres ;\n\n2o. Le droit de préempter un lot voisin, de même étendue, à des prix variant de $1.00 à $2.50 l'acre ;\n\n3o. La faculté d'acheter les terres que le gouvernement a mises en réserve pour aider à la construction du Pacifique, au taux de $1.00 à $5.00 l'acre ;\n40. Le privilège d'un délai de dix ans pour payer, ce qui, on le conçoit, est d'un avantage immense pour le colon.\nOn ne pourrait être plus libéral, vraiment\n\nLA CULTURE DES ARBRES FORESTIERS\n\nPour encourager la culture des arbres forestiers, le gouvernement accorde au colon, en sus de son homestead et de son droit de préemption, le privilège de s'inscrire pour un autre quart de section dont il aura la pleine propriété au bout de six ans, et après y avoir fait des plantations d'arbres sur une étendue de 32 acres, durant les quatre premières années.\n\nLOTS A BOIS\n\nLorsqu'il n'y a pas de bois sur une ferme, l'on peut, en s'adressant au bureau des terres, obtenir un lot boisé, de pas plus de 20 acres, dans le voisinage, à raison de $1.00 l'acre.\n\nVoilà qui achève de renseigner l'émigrant, d'une manière à peu près complète, croyons-nous, sur une question de la plus haute importance pour lui.\n\nTERRES PUBLIQUES AUX ETATS-UNIS\n\nPour obtenir un homestead aux États Unis, il faut compter 21 ans, être citoyen américain, ou avoir signifié son intention de le devenir, puis occuper et cultiver son lot pendant cinq années avant de recevoir le titre nécessaire de propriété.\n\nAu Canada, il suffit, on le sait, d'être âgé de 18 ans et d'occuper et de cultiver sa terre durant trois ans, pour avoir droit à une patente.\n\nOù se trouve, ici, la supériorité des avantages ?\n\nChez nos voisins—dans le Minnesota, le Dakota, etc.—il n'y a que deux prix pour les terres appartenant au gouvernement, c'est-à-dire $2.50 l'acre pour celles qui se trouvent dans les limites des réserves affectées aux chemins de fer, et $1.35 l'acre pour les lots ordinaires. Il faut payer, en outre, dans un espace de temps beaucoup plus restreint qu'à Manitoba.\n\nLes frais d'inscription de homesteads ne sont pas les mêmes dans tous les États, comme l'indiquent les tableaux suivants :\nInscription de homesteads dans le Michigan, le Wisconsin, l'Iowa, le Missouri, le Minnesota, le Kansas, le Nebraska, le Dakota, l'Alabama, le Mississippi, la Louisiane, l'Arkansas, la Floride, l'Ohio, l'Indiana et l'Illinois.\n\n| Acres | Prix par acre | Commissions | Honoraire | Total des honoraires et commissions |\n|-------|---------------|-------------|-----------|-----------------------------------|\n|       |               | Payable lors de l'inscription | Payable lorsque le certificat est donné | Payable lors de l'inscription |\n| 160   | $2.50         | $8.00       | $8.00     | $10.00                            | $26.00                           |\n| 80    | $2.50         | 4.00        | 4.00      | 5.00                              | 13.00                            |\n| 40    | $2.50         | 2.00        | 2.00      | 5.00                              | 9.00                             |\n| 160   | $1.25         | 4.00        | 4.00      | 10.00                             | 18.00                            |\n| 80    | $1.25         | 2.00        | 2.00      | 5.00                              | 9.00                             |\n| 40    | $1.25         | 1.00        | 1.00      | 5.00                              | 7.00                             |\n\nInscription de homesteads dans la Californie, le Nevada, l'Orégon, le Colorado, le Nouveau-Mexique, l'Arizona, l'Utah, le Montana et à Washington, Idaho et Wyoming.\n\n| Acres | Prix par acre | Commissions | Honoraire | Total des honoraires et commissions |\n|-------|---------------|-------------|-----------|-----------------------------------|\n|       |               | Payable lors de l'inscription | Payable lorsque le certificat est donné | Payable lors de l'inscription |\n| 160   | $2.50         | $12.00      | $12.00    | $10.00                            | $34.00                           |\n| 80    | $2.50         | 6.00        | 6.00      | 5.00                              | 17.00                            |\n| 40    | $2.50         | 3.00        | 3.00      | 5.00                              | 11.00                            |\n| 160   | $1.25         | 6.00        | 6.00      | 10.00                             | 22.00                            |\n| 80    | $1.25         | 3.00        | 3.00      | 5.00                              | 11.00                            |\n| 40    | $1.25         | 1.50        | 1.50      | 5.00                              | 8.00                             |\n\nLes frais d'inscription de homesteads varient donc—suivant les Etats et le prix des terres—de $18.00 à $26.00 et de $22.00 à $34.00.\nAu Canada, nous exerçons le droit de préemption en payant de $1.00 à $2.50 l'acre, avec un délai de dix ans pour compléter le paiement ; et nous n'avons à donner que $10 au bureau des terres pour les homesteads.\n\nLequel des deux pays l'emporte encore sur ce point ?\n\nEnfin, les compagnies de chemins de fer de la république vendent les terres que leur a octroyées le gouvernement à des prix parfois exorbitants, tandis qu'on offre celles du Pacifique canadien à des conditions tout à fait acceptables.\n\nN'avions-nous pas raison de dire que la législation de notre pays pouvait soutenir avantageusement la comparaison avec celle des États-Unis ?\n\nM. Thomas Dowse, l'un des rédacteurs du Commercial Advertiser de Chicago, et qui a publié une brochure sur \"Manitoba et les Territoires du Nord-Ouest,\" pense comme nous ; et son témoignage ne peut être suspect, puisqu'il n'est pas intéressé à surfaire la valeur de notre pays, au détriment du sien.\n\nM. James Trow, M. P. et président du comité de colonisation aux Communes, a publié, lui aussi, des lettres sur le Nord-Ouest, qu'il a visité en tous sens, et voici ce qu'il en dit :\n\n\"Il est évidemment bien mieux de prendre un homestead dans un pays aussi riche et aussi productif, que d'acheter des terres des compagnies de chemins de fer dans le Dakota, le Nebraska ou le Kansas, à raison de $3.00 à $10.00 l'acre. Je ne connais pas de pays qui offre autant d'avantages au pauvre homme, de même qu'aux capitalistes et aux manufacturiers.\"\n\nM. Kenneth Mackenzie, agronome distingué qui réside au Portage-la Prairie, disait devant un comité des Communes : \"Je n'ai pas vu dans le Minnesota ou le Dakota de grains ou d'autres produits agricoles qui puissent égaler ce que nous avons dans Manitoba. Je me suis trouvé dans ces États à toutes les saisons, et il y a dans le Minnesota des cultivateurs de mes amis qui viendraient s'établir à Manitoba, s'il pouvaient vendre leurs propriétés là-bas.\"\n\nTrois délégués écossais, MM Elliott, Logan et Shaw, qui ont aussi visité le Nord-Ouest, viennent de faire rapport de leur mission. Le premier, parlant de Manitoba, s'exprime ainsi :\n\n\"Manitoba et le territoire du Nord-Ouest sont le meilleur pays pour la grande culture ; et je pourrais ajouter : pour le pauvre colon.\"\n\nLe deuxième ajoute :\n\n\"Malgré la beauté d'Ontario, je préfère Manitoba, où les cultivateurs devraient émigrer.\"\n\nLe dernier termine en disant que le Nord-Ouest, contenant près de 200,000,000 d'acres de terre, devait, dans un avenir peu éloigné, fournir au reste du monde une grande partie des denrées alimentaires.\nEnfin, voici ce que répondirent au reporter d'un journal d'Halifax, deux délégués anglais, MM. Biggar et Cowan, qui visiterent Manitoba durant le cours de l'été dernier :\n\nQ.—Que pensez-vous de Manitoba comparé au Minnesota et au Dakota ?\nR.—Il n'y a pas de comparaison. Le rendement à Manitoba l'emporte de beaucoup et le sol y est plus riche.\n\nQ.—Si vous deviez vous fixer ici, où iriez-vous ?\nR.—Nous aimerais mieux payer $10 l'acre à Manitoba que d'accepter comme cadeau des terres du Minnesota.\n\nGARE AUX AGENTS AMÉRICAINS\n\nNous mettons donc nos nationaux en garde contre les agents peu scrupuleux qui sont payés pour engager les émigrants à s'établir sur le territoire américain. On les rencontre partout, ces gens du métier ; à Duluth, à Saint-Paul, à Saint-Vincent, aux Grandes Fourches et sur les convois des chemins de fer. Rien ne leur coûte à affirmer, et ils vous disent avec le plus grand sang-froid du monde que le Nord-Ouest canadien est impropre à la culture et que les États-Unis offrent, par contre, des avantages incomparables. Nous avons démontré ce qu'il fallait en croire. Quelques-uns, séduits par les belles paroles, le ton mielleux, les promesses éblouissantes des personnages en question, se sont laissé entraîner. Ils le regrettaient toujours, mais il était souvent trop tard. Le nombre des dupes n'est heureusement pas considérable. Que nos compatriotes ne prêtent pas l'oreille aux exagérations ou aux mensonges qu'on voudra leur débiter ; qu'ils poursuivent leur chemin sans se préoccuper du mal que l'on pourra dire de nos territoires. Personne, à coup sûr, n'est assez naïf pour penser qu'un homme qui vous guette ainsi au passage n'a d'autre motif que celui de se rendre utile ou agréable. Non, ce n'est pas, croyez-le, votre intérêt personnel qui inspire son éloquence ; et si l'on vous arrête sous le beau prétexte de vous enrichir, c'est pour mieux vous tromper. Dans cette propagande dont il faut se méfier, la fin justifie les moyens. Pourvu que l'exploitation rapporte des bénéfices, tout est bien ; et nous pourrions ajouter : tout est là. Les grands spéculateurs, les compagnies de chemins de fer qui possèdent d'immenses étendues de terre aux États Unis, ont à leur service de ces colporteurs de mensonges qui ne craignent pas de ruiner l'avenir d'une famille pour gagner leur salaire et enrichir le patron. Comme il est facile de les reconnaître, nos nationaux, qui sont avertis, devront traiter leurs avances comme elles le méritent.\n\nIl y a quelques années, plusieurs postes, tels que Moorhead et Fisher's Landing, ainsi que les bateaux et les convois de chemins de fer—ceux du Pacifique du Nord spécialement—étaient\ninfestés d'escrocs qui pillait les voyageurs. Les plus habiles de ces filous, désignés sous le nom de \"Three card monte men,\" avaient un mode d'opération infaillible. Et les malheureux qui succombaient à la tentation de jouer aux cartes avec eux, devaient invariablement faire leur deuil de ce qu'ils mettaient au jeu. Il suffit de signaler ces faits pour empêcher l'émigrant de tomber dans le piège.\n\nGOUT DE LA VIE A MANITOBA, PRIX DES DENRÉES, SALAIRES ET GAGES DES TRAVAILLEURS\n\nNous avons observé que ceux qui ont écrit sur Manitoba ne disent que peu de chose du coût de la vie, des salaires et des gages de l'artisan, du travailleur. Personne encore, que nous sachions, n'a pris la peine de bien faire connaître à l'étrangerce que lui vaudra son travail ou ce qu'il lui faudra payer là-bas, pour les produits et les articles dont il aura besoin. Il est essentiel sans doute de fixer le colon qui se prépare à émigrer, sur la valeur du sol et sur le rendement de la récolte, mais il est aussi fort important de l'instruire à l'avance des opérations du marché. Les mécomptes deviennent alors impossibles ; on sait avant le départ à quoi s'en tenir.\n\nNous croyons donc que la liste des prix publiée plus bas sera consultée avec avantage par les intéressés, qui pourront de la sorte, assoir leurs calculs sur des données recueillies avec le plus grand soin.\n\n| Occupation                  | Minimum | Maximum |\n|----------------------------|---------|---------|\n| Typographes (à la journée) | $2.00   | $2.50   |\n| Relieurs                   | 2.00    | 2.50    |\n| Menuisiers                 | 1.75    | 2.50    |\n| Ebénistes                  | 2.00    | 2.50    |\n| Charrons                   | 2.50    | 3.50    |\n| Maçons                     | 3.50    | 4.00    |\n| Briquetiers                | 1.75    | 2.50    |\n| Forgerons                  | 2.50    | 3.00    |\n| Meuniers                   | 1.50    | 2.50    |\n| Peintres                   | 2.50    | 3.50    |\n| Plâtriers                  | 1.75    | 2.50    |\n| Meubliers                  | 2.50    | 3.00    |\n| Mécaniciens                | 1.75    | 2.50    |\n| Boulangers                 | 3.00    | 4.00    |\n| Cordonniers                | 2.00    | 2.50    |\n| Tailleurs                  | 3.00    | 4.00    |\n| Orfèvres                   | 2.50    | 3.50    |\n| Horlogers                  | 1.50    | 2.50    |\n| Serruriers                 | 1.50    | 2.00    |\n| Ferblantiers               | 1.00    | 1.50    |\n| Plombiers                  | 2.50    | 3.50    |\n| Fondeurs                   |         |         |\n| Profession                        | Minimum | Maximum |\n|----------------------------------|---------|---------|\n| Selliers (à la journée)           | $1.50   | $2.50   |\n| Bouchers                         |         |         |\n| Jardiniers                       |         |         |\n| Brasseurs                        |         |         |\n| Confiseurs                       |         |         |\n| Journaliers                      |         |         |\n| Femmes                           |         |         |\n| Commis de nouveautés (au mois)   | $40.00  | $100.00 |\n| Commis-épiciers                  |         |         |\n| Commis-pharmacien                |         |         |\n| Cabaretiers                      |         |         |\n| Barbiers                         |         |         |\n| Cuisiniers                       |         |         |\n| Cochers (avec pension)           |         |         |\n| Palefreniers et conducteurs de voitures (avec pension) (au mois) | $15.00 | $25.00 |\n| Serviteurs                       |         |         |\n| Servantes (dans les familles)    |         |         |\n| Servantes (dans les hôtels)      |         |         |\n| Garçons de ferme                 |         |         |\n\nVoilà pour les salaires et les gages des classes ouvrières ; l'énumeration est assez complète.\n\nPassons maintenant aux prix des terres, instruments agricoles, animaux, grains, produits, denrées et articles de toute espèce.\n\nTerres, longeant les rivières, prix par acre.............$6.00 à $10.00\n\nTerres à l'intérieur : prix variant selon la distance du chemin de fer ; impossible de préciser, si ce n'est pour les terres du gouvernement, dont les conditions de vente sont établies ailleurs.\n\n| Instrument                        | Minimum | Maximum |\n|-----------------------------------|---------|---------|\n| Machine à semer                   | $75.00  | $90.00  |\n| Machine à moissonner              | $120.00 | $140.00 |\n| Machine à faucher                 | $80.00  | $100.00 |\n| Machine à moissonner et à faucher [combinée] | $175.00 | $200.00 |\n| Machine à battre                  | $800.00 | $1200.00|\n| Machine à vanner                  | $30.00  | $45.00  |\n| Râteau traîné par un cheval       | $40.00  | $50.00  |\n| Charrue                           | $25.00  | $30.00  |\n| Hesse                             | $20.00  | $25.00  |\n| Pelle                             | $1.00   |         |\n| Bêche                             | $1.25   |         |\n| Fourche pour le foin              | $0.75   |         |\n| Fourche pour le fumier            | $1.00   |         |\n| Hache                             | $1.25   | $1.50   |\n| Chevaux (canadiens), la paire     | $200.00 | $500.00 |\n| Bœufs, la paire                  | $75.00  | $150.00 |\n| Vaches                            | $25.00  | $40.00  |\n| Item                                      | Minimum | Maximum |\n|-------------------------------------------|---------|---------|\n| Cochon                                    | $10.00  | $18.00  |\n| Mouton                                    | 5.00    | 7.00    |\n| Voiture de ferme à quatre roues (wagon)   | 80.00   | 95.00   |\n| Charrette de la Rivière-Rouge             | 10.00   | 12.00   |\n| Harnais, etc., etc.                       | 12.00   | 60.00   |\n| Farine (de blé)                           | 2.00    | 2.75    |\n| Blé, le minot                             | 0.70    | 0.90    |\n| Maïs                                      | 0.75    | 1.00    |\n| Pois                                      | 0.70    | 0.75    |\n| Seigle, rare                              | 0.55    | 0.60    |\n| Orge                                      | 0.50    | 0.55    |\n| Avoine                                   | 0.43    | 0.75    |\n| Fèves                                    | 2.50    | 3.00    |\n| Pommes de terre                           | 0.55    | 0.60    |\n| Sarrasin [farine]                         | 4.00    | 5.00    |\n| Foin, la tonne                            | 6.50    | 7.75    |\n| Bois de construction [1,000 pieds]        | 18.00   | 60.00   |\n| Bardaoux (le mille)                       | 3.50    | 4.00    |\n| Lattes                                    | 5.00    |         |\n| Portes                                    | 1.50    | 2.50    |\n| Châssis 8 x 10, la paire                  | 1.00    |         |\n| Clous, la livre                           | 0.05    |         |\n| Brique (le mille)                         | 8.00    | 12.00   |\n| Pierre (verge cube)                       | 16.00   |         |\n| Chaux, le minot (au four)                 | 0.25    |         |\n| Lard, la livre                            | 0.08    | 0.09    |\n| Beuf                                     | 0.10    | 0.15    |\n| Mouton                                   | 0.10    | 0.12    |\n| Veau                                     | 0.10    | 0.15    |\n| Dindons                                  | 0.15    | 0.00    |\n| Oies                                     | 0.15    | 0.00    |\n| Poules                                   | 0.10    | 0.12    |\n| Beurre                                   | 0.25    | 0.30    |\n| Fromage                                  | 0.15    | 0.20    |\n| Thé                                      | 0.40    | 0.75    |\n| Café                                     | 0.30    | 0.45    |\n| Sucre                                    | 0.10    | 0.12    |\n| Sirop (gallon)                           | 0.75    | 0.80    |\n| Huile de charbon (gallon)                 | 0.45    | 0.50    |\n| Tabac                                    | 0.50    | 1.00    |\n| Poêle (de cuisine)                        | 20.00   | 52.00   |\n| Poêle (de salle)                          | 5.00    | 25.00   |\n| Couchette                                | 2.50    | 5.00    |\n| Literie (matelas)                         | 2.50    | 10.00   |\n| Bureau de toilette                        | 8.00    | 12.00   |\n| Table                                    | 3.00    | 4.00    |\n| Chaise                                   | 0.75    | 1.00    |\n| Assiette                                 | 0.08    | 0.20    |\n| Tasse et soucoupe                         | 0.08    | 0.15    |\n| Lampe                                    | 0.60    | 1.00    |\n| Sceaux                                   | 0.25    |         |\n| Cuvette                                  | 0.90    |         |\n| Coton, la verge                          | 0.08    | 0.12    |\n| Indiennes                                | 0.08    | 0.12    |\n| Toile                                    | 0.15    | 0.50    |\n| Tweeds, la verge | $0.75 | $2.25 |\n|------------------|-------|-------|\n| Flanelle         | 0.25  | 0.72  |\n| Merino           | 0.60  | 1.25  |\n| Alpaca           | 0.25  | 0.90  |\n| Coutil           | 0.25  | 0.50  |\n| Wincey           | 0.08  | 0.25  |\n| Serge            | 0.25  | 3.50  |\n| Soie             | 1.25  | 3.50  |\n| Étoile à robe    | 0.18  | 1.00  |\n| Draps            | 2.25  | 6.00  |\n| Couvertures, la paire | 2.50 | 10.00 |\n| Paletot          | 3.50  | 25.00 |\n| Pantalons        | 2.00  | 9.00  |\n| Veste            | 1.26  | 6.50  |\n| Chemise de laine | 0.75  | 4.00  |\n| Chemise de coton | 0.50  | 2.00  |\n| Chaussons de laine | 0.25 | 0.30  |\n| Chapeaux en feutre | 0.75 | 4.00  |\n| Bottes, pour hommes | 2.00 | 3.00  |\n| Souliers, pour femmes | 1.75 | 2.50  |\n\nL'utilité des informations qui précèdent est manifeste. Ainsi, en parcourant cette liste, l'émigrant, sachant ce qu'il possède et ce qui lui manque, pourra calculer les frais du déplacement, de l'installation et de l'entretien de sa famille, de même qu'il apprendra ce que lui rapporterait son travail, ou la vente de ses produits.\n\nLES CANADIENS-FRANÇAIS À MANITOBA.\n\nLes Canadiens-français qui ont quitté le pays pour émigrer aux États-Unis, et de là au Nord-Ouest canadien, ont-ils réussi à Manitoba ? À cette question, nous ne craignons pas de répondre : oui, règle générale. Depuis quatre années, plusieurs détachements considérables de nos nationaux, venant surtout des États de la Nouvelle-Angleterre, se sont repatriés. Ce mouvement national, nous l'avons suivi avec intérêt, et après l'avoir favorisé là-bas dans la mesure de nos forces, nous voulons nous y associer encore ici, en en publiant les heureux résultats.\n\nRendons hommage, en passant, à l'esprit vraiment patriotique de nos amis de Manitoba, qui n'ont épargné ni leur temps ni leur argent pour recevoir de la façon la plus sympathique leurs frères des États-Unis. Rien ne leur coûtait lorsqu'il s'agissait d'être utiles, et ces bons procédés n'ont pas peu contribué, sans doute, à populariser la cause de la colonisation. Pour donner une preuve non équivoque du dévouement qui distingue nos compatriotes de Manitoba, il suffira de dire que plusieurs citoyens de Saint-Boniface ont érigé à leurs frais, et sans rien recevoir du gouvernement, un spacieux édifice qui a servi, jusqu'ici, à recevoir les émigrés canadiens.\nNous devons ajouter que ceux qui furent l'objet de cette bienveillance toute fraternelle n'ont pas manqué de le reconnaître hautement et publiquement. Aujourd'hui, l'accueil est aussi cordial, aussi hospitalier que par le passé. Tout le monde rivalise de zèle pour renseigner les nouveaux venus sur ce qu'il leur importe de savoir, et pour les diriger là où leurs aptitudes ou leurs moyens semblent les appeler.\n\nMais nous sommes déjà bien loin de la question que nous nous étions posée tout à l'heure : revenons-y donc. À quelques exceptions près, nos compatriotes ont réussi, en peu de temps, à améliorer beaucoup leur état. Il a fallu, sans doute, de la volonté et de l'énergie ; car tous les débuts sont difficiles. Mais le courage qui ne se rebute pas au premier obstacle, le travail qui persévère, finit par triompher.\n\nÀ l'appui de ces observations qui s'appliquent au Nord-Ouest canadien avec plus de force, croyons-nous, qu'aux autres pays, il serait facile de citer une foule d'exemples. Nombre de nos nationaux qui n'avaient, de fait, rien ou presque rien à leur arrivée à Manitoba, ont déjà acquis une honnête aisance. La plupart sont aujourd'hui les propriétaires de belles et grandes fermes, dans les townships qui leur furent réservés, ou dans les paroisses situées le long des rivières, et les autres exercent leur industrie dans les villages et les villes — à Winnipeg, à Saint-Boniface et ailleurs. Et c'est là, pourtant, l'œuvre de trois ou quatre années de labeur.\n\nAinsi, demandez à ces hommes que la fatigue n'affraie pas, que les sacrifices même ne découragent pas, s'ils regrettent leur départ des États-Unis. Demandez-leurs s'ils voudraient, maintenant, retourner à l'usine, pour s'y assujéter de nouveau à un travail mercenaire et ingrat. Demandez-leur, enfin, s'ils n'aiment pas mieux retirer du sol le pain qui nourrit leur famille, dont la santé se ranime au souffle vivifiant de la prairie et loin de l'atmosphère empestée de la fabrique.\n\nPresque tous vous répondront que la vie dont ils jouissent à Manitoba est mille fois préférable à l'existence, si souvent pénible, qu'ils traînaient à l'étranger. Nous disons presque tous ; car il n'est pas possible d'imaginer un coin du globe — fût-il le plus beau, le plus fertile, le plus largement doué par la nature — qui convienne à tout le monde indistinctement. On a pu, d'autre part, se faire illusion et penser qu'il suffisait de se rendre à Manitoba pour y devenir riche, sans aucun effort. Cette étrange méprise nous expliquerait, alors, les déceptions de certains émigrants qui, fort surpris, apparemment, de ne pouvoir recueillir le riche héritage sur lequel ils comptaient à leur arrivée, sont repartis de suite, dégoutés d'un pays aussi mesquin, aussi désobligeant...... selon eux.\n\nEncore une fois, c'est le travail qui, à Manitoba comme ailleurs, conquiert la fortune. Les richesses naturelles du sol\nrendent plus féconde, il est vrai, l'application de la loi universelle qui condamne l'homme à gagner son pain à la sueur de son front, mais le principe reste au fond le même.\n\nQu'on ne l'oublie pas.\n\nBien que l'on ne puisse avoir raison de suspecter notre franchise et notre vérité, nous avons cru devoir publier deux lettres que nous ont adressées plusieurs de nos compatriotes de Saint-Boniface, de Saint-Jean-Baptiste, de Saint-Joseph et de Saint-Pie. Les signataires ont résidé à plusieurs endroits des États-Unis où ils sont bien connus, et leur témoignage, offert spontanément, donnera au nôtre plus de valeur et de force.\n\nSAINT BONIFACE, Manitoba, 18 décembre 1879.\n\nM. Élie Tassé,\nOttawa.\n\nMonsieur,\n\nNous apprenons que vous préparez une brochure sur l'émigration à Manitoba, et nous désirons vous donner quelques renseignements qui pourront peut-être vous servir, ou plutôt servir à ceux qui vous liront.\n\nNous sommes des colons venus de la Nouvelle-Angleterre et des États de l'Ouest depuis 1876, époque où a commencé l'émigration canadienne-française à Manitoba. Notre expérience du pays est suffisante pour nous permettre d'en parler avec connaissance de cause.\n\nNous pouvons dire tout d'abord que pas un de ceux qui se sont établis d'une manière permanente en cette province ne regrette d'avoir quitté les États-Unis. Au contraire, tous se plaisent et aiment leur nouvelle patrie. Dans les villes manufacturières que nous habitons, nous réussissions à pourvoir au jour le jour à la subsistance de nos familles ; et c'était tout. Ici, nous vivons tout aussi bien, et nous avons l'agréable perspective de pouvoir amasser quelque chose pour nos enfants.\n\nNous sommes actuellement au village de Saint-Boniface, mais un bon nombre d'entre nous ont, dans les différentes paroisses, des terres sur lesquelles ils comptent aller s'établir avant longtemps.\n\nNos amis des florissantes paroisses de Saint-Jean-Baptiste et de Saint-Joseph pourraient, eux, parler de leurs superbes fermes et des magnifiques récoltes qu'ils ont eues cette année. Nous en connaissons plusieurs qui sont arrivés en cette province, en 1876 et 1877, sans argent, ou avec des sommes insignifiantes, et qui ont maintenant sur leurs terres, maisons, étables, dix à quinze animaux, instruments aratoires, et de quarante à soixante arpents en culture qui leur ont rapporté, cet été, 500, 800 et jusqu'à 1,200\nminots de grain. Il en est qui avaient à peine 100 piastres en arrivant dans le pays, en 1876, et qui, après avoir vécu aussi à l'aise qu'aux États-Unis, ne donneraient pas aujourd'hui leurs propriétés pour $2,500. Mais peut-être que ceux-là vous écriront eux-mêmes et vous feront connaître leurs avantages.\n\nQu'il nous suffise de vous dire qu'à notre arrivée ici, nous avons trouvé les choses mieux que nous les pensions. Un accueil des plus bienveillants nous a été fait par les membres de la Société de colonisation. Nous avons été reçus par des frères, et nous avons senti que nous n'étions pas en pays étranger.\n\nPuis, en voyant la fertilité du sol, la facilité de se procurer des terres, soit en obtenant des homesteads du gouvernement, soit en les achetant des gens du pays, il nous a fallu peu de temps pour nous convaincre qu'avec du labour et de l'énergie, tout homme de bonne volonté pouvait, à moins d'être visité par le malheur, vivre sans misère, devenir propriétaire d'une belle ferme et assurer un patrimoine à ses enfants.\n\nDe plus, nous avons l'avantage de posséder partout d'excellentes écoles, où nos enfants peuvent recevoir une bonne éducation catholique.\n\nNous croyons que ces renseignements pourront être utiles à nos nationaux qui végètent aux États-Unis, et les engager à venir partager avec nous les avantages que leur offre la jeune et prospère province de Manitoba.\n\nAgréez, etc.,\n\n(Signé) P. H. Prince, Assomption, Illinois.\nC. F. Charrier, Détroit, Mich.\nJos. Vallée, Saint-Louis, Mo.\nL. D. Bissonnette Saint-Albans, Vermont.\nNapoléon Prince, Assomption, Illinois.\nEdmond Nadeau, Fall River, Mass.\nF. X. Lapierre, Lawrence, Mass.\nJacques Chartier, Nashua, N. Hampshire.\nJoseph Pion, Nashua, N. Hampshire.\nDavid Jannotte, Nashua, N. Hampshire.\nJoseph Lavallée, Woonsocket, R. I.\nP. Fabien Soucy, Ashburnham, Mass.\nOlivier Gendron, Spencer, Mass.\nG. B. Joyal, Woonsocket, R. I.\nJoseph Joyal, Woonsocket, R. I.\nDavid Joyal, Woonsocket, R. I.\nRoger Sicotte, Gardner, Mass.\nNoël Sicotte, Bismark, Dakota.\nJoseph Boisjoli, Lawrence, Mass.\nMichel Carrier, North Adams, Mass.\nAlexis Degagnier, Manchester, N. Hamps.\nVoici maintenant la lettre des colons de Saint-Jean-Baptiste,\nde Saint-Joseph et de Saint-Pie :\n\nM. Élie Tassé,\n\nMonsieur,\n\nNous apprenons avec plaisir que vous préparez une brochure en faveur de la colonisation à Manitoba. Nous ne saurions trop vous louer d’une aussi bonne œuvre et nous osons espérer qu’elle sera bien appréciée par nos frères des États-Unis. En effet, nous serions si heureux de voir tous les Canadiens parfaitement renseignés sur les avantages qu’offre notre jeune province ! Un mot résumant notre position ou faisant connaître les progrès opérés depuis notre arrivée à Manitoba, ne vous serait peut-être pas désagréable.\n\nArrivés à Manitoba en juin 1876, nous trouvions de vastes prairies, d’excellentes terres, mais quelques colons métis et anglais seulement disséminés le long de la rivière Rouge. Pour nous, deux townships nous étaient réservés, mais à plusieurs milles à l’intérieur (c’est-à-dire loin des cours d’eau) ; et plus d’un ancien colon nous trouvait téméraires de nous aventurer ainsi dans une localité qu’on croyait devoir être pour toujours le royaume exclusif des loups, renards et autres individus de même espèce.\n\nCependant, le croirez-vous ? aujourd’hui, grâce à l’activité de notre dévoué agent, M. J. E. Tétu, et des amis qui s’intéressent à la colonisation, il ne reste que bien peu de lots inoccupés dans la partie que nous habitons. Il ne manque pas sans doute de place pour de nouveaux colons ; on peut en établir des milliers, mais il faut s’éloigner un peu.\n\nPour ne pas être trop long, nous nous bornerons à vous dire, qu’en 1876, la partie que nous habitons était connue sous le nom de Sainte-Agathe et ne renfermait que vingt-cinq à trente familles catholiques. À présent, ce même territoire comprend Saint-Jean-Baptiste, qui contient cent vingt familles ; Saint-Joseph, qui en compte quatre-vingts, et Saint-Pie, cinquante, ayant chacune un curé respectif (nous ne parlons que de nos coreligionnaires). Il y a cinq écoles françaises catholiques, une compagnie d’infanterie, une société de Saint-Jean-Baptiste, etc., etc.\n\nEt quant à notre position, nous souhaiterions voir tous nos amis des États-Unis et d’ailleurs contempler nos maisonnettes, nos champs de blé, nos troupeaux relativement nombreux et cette bonne gaieté française rayonnante sur tous les fronts. Oui, monsieur, nous sommes heureux de nous trouver réunis, sans entrave aucune, autour de nos modestes chapelles, comme nous l’étions autrefois autour des clochers qui nous ont vu naître.\nAh ! chers amis, vous qui êtes condamnés au labeur ennuyeux et malsain des manufactures, venez ici goûter la douce liberté de propriétaires indépendants. Il en coûte quelque travail, quelque peine ; mais qu'il est doux pour un père de famille de pouvoir se dire : voici mes enfants autour de moi, avec des propriétés à eux, leur assurant pour toujours, s'ils le veulent, une vie aisée et paisible.\n\nA ceux qui repartent d'ici et qui méprisent Manitoba, nous n'avons qu'une réponse à faire. La terre promise valait sans doute mieux que l'esclavage dur et pénible que les Égyptiens faisaient peser sur les Israélites. Combien, cependant, de ces derniers regrettaient l'Égypte à cause du voyage à travers le désert ! De même ces Canadiens se laissent décourager à raison du travail quelque peu pénible de quelques années avant de devenir, comme nous le sommes, maîtres et indépendants, pouvant, avec un travail aisé, vivre dans l'abondance de toutes les choses nécessaires.\n\nVoilà, cher monsieur, un aperçu bien court à la vérité, mais pouvant vous donner une idée du développement qui s'est opéré ici et dans la province entière ; car on peut dire avec raison de tout le pays ce que nous avons dit de Saint-Jean-Baptiste, de Saint-Joseph et de Saint-Pie.\n\n(Signé) François Parent.\nAntoine Duval.\nAntoine Bellavance.\nDelphis Plante.\nHilaire Roy.\nSaul Gendron.\nPierre Pontbriand.\nHenri Lécuyer.\nPierre Parenteau.\nAlfred Dozois.\nToussaint Benoît.\nLouis Marcil.\nOuésime L'heureux.\nJoseph Bellerive.\nRaphaël Roberge.\nTrefflé Picard.\nFrançois Mercier.\nFrançois Dumont.\nCharles Déry.\nAmbroise Sarrasin.\nToussaint Brault.\nEtc., etc., etc.\n\nLe langage de nos nationaux de Manitoba est inspiré non-seulement par la vérité, mais par l'intérêt qu'ils portent à leurs\nfrères des États-Unis. Nous avons visité nous-même les établissements de Saint-Jean-Baptiste, de Saint-Joseph et de Saint-Pie, lesquels sont groupés ensemble à une légère distance de la frontière sur le côté occidental de la rivière Rouge, et nous pouvons dire que l'on n'en exagère ni la prospérité ni l'importance. Les deux townships dont il est question dans la dernière lettre sont superbes, et les récoltes abondantes. M. l'abbé Fillion, de Saint-Jean-Baptiste, a déployé une intelligence et un zèle remarquables dans la direction de ces colonies devenues très florissantes, et qui se composent d'hommes énergiques et industriels. Comme on le voit, l'apôtre de la religion est aussi l'apôtre de la colonisation ; le prêtre suit l'émigrant ; la chapelle et l'école se dressent à côté de la demeure du hardi pionnier ; l'œuvre intellectuelle et morale marche de pair, lorsqu'elle ne la devance pas, avec l'œuvre matérielle. C'est l'harmonie, en un mot, du véritable progrès.\n\nCEUX QUI DOIVENT OU PEUVENT ÉMIGRER\n\nLa masse des émigrants appartient à la classe agricole. On comprend que, dans un pays neuf comme Manitoba, le travail—excepté celui de la ferme—ne saurait occuper une multitude de bras. En 1876, tout était encore à créer, pour ainsi dire, dans le domaine de l'industrie, et cette organisation du capital et du travail ne s'opère ni en un jour ni en une année. Aussi la presse n'a-t-elle jamais manqué de dire franchement la vérité sur ce point. Mais, en dépit de tout, le nombre des petits capitalistes, des commis, des artisans et des gens d'affaires de toute espèce, qui sont allés à Manitoba, est considérable, et la plupart ont prospéré, soit à Winnipeg, qui se peuple avec une rapidité merveilleuse, ou soit à Saint-Boniface, à Emerson, à Selkirk, à Sainte-Anne, à la Baie-Saint-Paul, à Saint-Jean-Baptiste, à Saint-Norbert, à Saint-François-Xavier, au Portage-la-Prairie, etc., etc.\n\nAujourd'hui, la situation n'est plus la même absolument. De grandes entreprises publiques se poursuivent et donnent de l'emploi à une foule de personnes. Nous voulons parler des chemins de fer. Actuellement, toute la partie du Pacifique qui s'étend du lac Supérieur à la rivière Rouge est en voie d'exécution, et le gouvernement, qui a donné, en outre, un contrat de 100 milles à l'ouest de Selkirk, se propose de continuer les opérations sur un parcours de 200 à 300 milles aussitôt que possible.\n\nLa compagnie du chemin de fer de colonisation du Sud-Ouest se prépare également à construire une voie qui irait de Winnipeg à la montagne de Pembina, et les citoyens d'Emerson ont constitué une compagnie qui veut établir une ligne entre cette entreprenante petite ville et la montagne de la Tortue.\nEnfin, il sera érigé, l'été prochain—en toute probabilité du moins—un et peut-être deux ponts sur la rivière Rouge, reliant Winnipeg à Saint-Boniface, et, plus tard, un autre à Emerson.\n\nVoilà autant d'entreprises et de projets assurant ou promettant de l'ouvrage à des milliers de colons qui, tout en cultivant leurs terres, pourront gagner de l'argent. Il est facile de calculer ce que pourrait rapporter, ainsi, le travail d'une famille composée de trois ou quatre enfants capables de manier le pic ou la pelle. Et remarquez bien que rien n'empêcherait de mener de front l'exploitation de la ferme. Nous connaissons des Canadiens-français qui ont pu réaliser, par ce moyen, suffisamment d'épargnes pour acheter les animaux ou les instruments aratoires qu'exige la culture.\n\nNous pensons donc que l'on peut maintenant, avec des moyens beaucoup plus limités que par le passé, se créer par le travail un avenir à Manitoba, pourvu que l'énergie supplée à l'insuffisance du capital acquis.\n\nÀ l'appui de ce qui précède, nous citerons la lettre suivante adressée, en 1874, à un M. Lillies, de West-Pilkington, Ontario, par ses enfants résidant à Manitoba :\n\n\"Ne craignez rien pour nous ; car nous réussissons mieux qu'à Ontario, en dépit des ravages des sauterelles*. Deux d'entre nous ont gagné $166 par mois à faire et à vendre de la chaux ; un troisième a réalisé $5 par jour, en moyenne, avec son attelage, en travaillant sur le chemin de fer ; enfin, le quatrième exerce son métier de charroin à Winnipeg, où il retire $60 par mois. L'avenir nous apparaît sous les plus belles couleurs.\".....\n\nOn voit ce que peuvent accomplir là-bas, à défaut de grandes ressources pécuniaires, le courage et l'activité.\n\nFEUX DE PRAIRIES\n\nAu Nord-Ouest, l'on entasse généralement en meules, dans la prairie ou près des habitations, le foin et le grain. Or, à l'automne, il y a presque toujours des feux de prairies, et le colon ne saurait, en conséquence, prendre trop de précautions pour soustraire sa récolte aux atteintes de l'élément destructeur. Les lois locales sont fort sévères sur ce point ; elles punissent celui qui met le feu, de même qu'elles obligent le citoyen à prendre certaines mesures pour protéger sa propriété. Il suffira d'ouvrir le statut pour se renseigner.\n\nLES SAUTERELLES\n\nElles firent leur première apparition dans le pays en 1818, et y détruisirent les moissons durant trois ans consécutifs. Environ\n\n* Ce fléau est disparu depuis cinq ans.\nquarante ans plus tard, ce terrible fléau exerça de nouveau ses ravages. Nous avons été témoin nous même de l'arrivée des sauterelles, en 1874. Leurs bataillons, qui s'agitaient dans les airs, étaient si serrés, que le soleil en était obscurci, et ces vilains insectes, lorsqu'ils descendirent des hauteurs, recouvraient le sol de leurs masses grouillantes.\n\nCe redoutable fléau, qui fait disparaître du sol toute végétation, n'est pas particulier à nos régions ; il sévit, avec la même violence, dans le Minnesota, le Dakota et autres États de l'Ouest. Depuis 1876, les sauterelles ont disparu, et il n'est pas probable qu'elles reviennent de sitôt.\n\nLES SAUVAGES\n\nIl existe beaucoup de préjugés au dehors sur le compte des sauvages. Nous avons reçu nous-même plus d'une lettre, lorsque nous étions à Manitoba, nous demandant s'il était bien vrai que les Peaux-Rouges étaient aussi nombreux que féroces dans ces parages. Nous pouvons répondre aujourd'hui comme alors : les sauvages à Manitoba sont établis sur des réserves, et il n'y a pas lieu de les redouter, pour deux raisons :\n\n1o Parce que leurs dispositions sont tout à fait pacifiques ;\n2o Parce qu'ils ne sont pas assez forts, numériquement parlant, pour entreprendre rien de sérieux contre la population blanche.\n\nIl y a sans doute, dans les territoires du Far-West, des milliers de sauvages, mais ces tribus errent, pour la plupart, à des centaines de milles de distance, et sont disséminées dans la forêt ou dans la plaine. De sorte que leur présence, là-bas, n'offre aucun danger pour Manitoba, trop souvent confondu avec le Nord-Ouest tout entier.\n\nCOMMENT SE RENDRE À MANITOBA\n\nNous avons voulu renseigner l'émigrant d'une manière précise sur les grandes voies qui conduisent à Manitoba. Il est important de le bien fixer sur ce point. Ainsi donc, l'on pourra choisir l'une ou l'autre des lignes ou routes suivantes :\n\nVOIES FERRÉES\n\nI\n\nChemin de fer du Grand-Tronc—de Chicago.\nChemin de fer de Chicago, Milwaukee et Saint-Paul—de Chicago à Saint-Paul.\nChemin de fer de Saint-Paul, Minneapolis et Manitoba—de Saint-Paul à Saint-Vincent.\nEmbranchement de Pembina du Pacifique Canadien—de Saint-Vincent à Saint-Boniface.\nPar cette voie, l'émigrant ne change de convoi que trois fois seulement.\n\nII\n\nChemin de fer du Grand-Tronc—de à Chicago.\nChemin de fer de Chicago et du Nord-Ouest—de Chicago à Saint-Paul.\nChemin de fer de Saint-Paul, Minneapolis et Manitoba—de Saint-Paul à Saint-Vincent.\nEmbranchement de Pembina du Pacifique Canadien—de Saint-Vincent à Saint-Boniface.\nPar cette voie encore, l'on ne change de convoi que trois fois.\n\nIII\n\nChemin de fer du Grand-Tronc—de à Détroit.\nChemin de fer du Michigan Central—de Détroit à Chicago.\nChemin de fer de Chicago, Milwaukee et Saint-Paul—de Chicago à Saint-Paul.\nChemin de fer de Saint-Paul, Minneapolis et Manitoba—de Saint-Paul à Saint-Vincent.\nEmbranchement de Pembina du Pacifique Canadien—de Saint-Vincent à Saint-Boniface.\nPar cette voie, il faut donc changer de convoi quatre fois.\n\nIV\n\nChemin de fer du Grand-Tronc—de à Détroit.\nChemin de fer du Michigan Central—de Détroit à Chicago.\nChemin de fer de Chicago et du Nord-Ouest—de Chicago à Saint-Paul.\nChemin de fer de Saint-Paul, Minneapolis et Manitoba—de Saint-Paul à Saint-Vincent.\nEmbranchement de Pembina du Pacifique Canadien—de Saint-Vincent à Saint-Boniface.\nPar cette voie, il faut aussi changer de convoi quatre fois.\n\nPAR TERRE ET PAR EAU\n\nV\n\nChemin de fer du Grand-Tronc—de à Sarnia\nSteamers de la Compagnie de transport du Nord-Ouest—de Sarnia à Duluth, par les lacs.\nChemin de fer du Pacifique Américain du Nord—de Duluth à Glyndon.\nChemin fer de Saint-Paul, Minneapolis et Manitoba—de Glyndon à Saint-Vincent.\nEmbranchement de Pembina du Pacifique Canadien—de Saint-Vincent à Saint-Boniface.\n\nVI\n\nChemin de fer du Grand-Tronc—de à Toronto.\nChemin de fer du Nord—de Toronto à Collingwood.\nSteamers de la Compagnie du lac Supérieur—de Collingwood à Duluth.\nChemin de fer du Pacifique Américain du Nord—de Duluth à Glyndon.\nChemin de fer de Saint-Paul, Minneapolis et Manitoba—de Glyndon à Saint-Vincent.\nEmbranchement de Pembina du Pacifique Canadien—de Saint-Vincent à Saint-Boniface.\n\nOn sait que le gouvernement s'entend avec certaines compagnies pour le transport des émigrants à certaines conditions.\n\nAGENTS D'EMIGRATION\n\nETATS-UNIS\n\nCharles Lalime, Worcester, Mass.\nTous les Canadiens des Etats-Unis, ceux de l'Est comme de l'Ouest, pourront s'adresser à cet agent, qui, puissamment secondé par la Société de Colonisation de Manitoba, le Travailleur, de Worcester, et autres amis de l'œuvre, a dirigé, depuis 1876, un fort courant d'émigration au Nord-Ouest.\nW. C. B. Grahame, Duluth.\n\nCet officier est spécialement chargé de recevoir les émigrants, à l'arrivée des bateaux à vapeur, de prendre soin de leur bagage, de les mettre en garde contre les agents américains et de leur fournir, en un mot, tous les renseignements dont ils ont besoin pour se rendre à destination.\n\nMANITOBA\n\nJean E. Tétu, Dufferin et Emerson.\nEn entrant dans la province de Manitoba, l'émigrant, quel qu'il soit, est bien aise de rencontrer un agent qui lui fasse bon accueil. Aussi, est-il juste de dire que M. Tétu n'a rien négligé pour don-\nner aux nouveaux venus tout le confort possible, après le débarquement, et les aider ensuite à se placer sur les terres.\n\nW. Hespeler, Winnipeg.\n\nJusqu'ici, les membres si dévoués de la Société de Colonisation se sont fait un devoir d'aller eux-mêmes souhaiter la bienvenue à nos compatriotes.\n\nQuébec :—(Cité).—L. Stafford.\n\" Montréal.—J. J. Daley.\nOntario :—Ottawa.—W. J. Wills.\n\" Kingston.—R. Macpherson.\n\" Toronto.—J. A. Donaldson.\n\" Hamilton.—John Smith.\n\" London.—A. G. Smyth.\nNouvelle-Écosse :—Halifax.—E. Clay.\nNouveau-Brunswick :—Saint-Jean.—Samuel Gardner.\n\nIV\n\nÀ l'est et à l'ouest de Manitoba\n\nÀ l'est de Manitoba, c'est-à-dire entre le lac Supérieur et la rivière Rouge, une certaine partie du terrain coupé par les marais ou les rochers est impropre à la culture. Mais il ne faut pas croire que cette région est partout la même, de nulle valeur. Écoutons, par exemple, ce que disait un touriste traversant le pays :\n\n\" Un peu plus loin que le lac de la Pluie, la scène change, et l'on entre dans la vallée de la rivière la Pluie. Là, point de portages, point de rapides, un cours d'eau magnifique de plus de 100 milles, se déroulant au milieu de 200 à 300,000 acres de terre végétale, bordé de fleurs d'ormes, de peupliers, de vieux chênes tout enlacés de plantes grimpantes ou de convolvulus en fleurs. Ailleurs, ce sont de grandes prairies verdoyantes. Des millions d'oiseaux peuplent cette vallée splendide qu'on dirait un jardin abandonné, et qu'on ne quitte qu'à regret pour s'engager sur la nappe verdâtre du lac des Bois, quels que soient la variété de ses îles et le magnifique panorama de ses côtes.\"\n\nOn a découvert là de riches mines d'or et d'argent, l'été dernier.\n\nÀ l'ouest de Manitoba, se déroulent à perte de vue les prairies est les forêts. Les vallées des rivières Assiniboine, Saskatchewan et de la Paix sont fort belles et capables de nourrir des millions d'habitants. Seul, le bassin fertile de la Saskatchewan, qui prend sa source à quelque distance des Montagnes Rocheuses, et qui coule sur un parcours d'à peu près 1,500 milles, arrose une vaste contrée, renfermant, dit-on, 90,000,000 d'acres de terre.\nA 280 milles du lac Winnipeg, dans lequel elle se décharge, cette rivière se divise en deux grands bras, qui s'étendent, le premier, au nord, sur un espace de 1,092 milles, et le second, au sud, sur un espace de 1,054 milles. La plus grande distance qui sépare ces deux bras est de 300 milles.\n\nLe vicomte Milton et le Dr Cheadle en parlent ainsi dans leur ouvrage :\n\n\"Les riches prairies du bassin fertile de la Saskatchewan ont un sol alluvial de trois à cinq pieds de profondeur, et n'attendent que la charrue. Elles offrent leurs herbages sans fin, qui, dans les temps antérieurs, ont engraisé d'innombrables bandes de bisons, à nos troupeaux domestiques. Les forêts, les lacs et les cours d'eau varient le paysage et promettent leur bois de construction, leurs poissons et leurs millions de volailles sauvages. Eh ! bien, ce pays superbe, capable de subvenir aux besoins de 20,000,000 d'habitants, est complètement négligé. Cependant, ce riche pays agréable n'est pour ainsi dire qu'à un pas de nos champs d'or à la Colombie britannique.\"\n\nDepuis longtemps déjà, la compagnie de la Baie-d'Hudson a placé des bateaux à vapeur sur la Saskatchewan, qui deviendrait aisément navigable avec quelques améliorations. La vallée de la rivière de la Paix est, en outre, d'une richesse remarquable, et les explorateurs en parlent tous avec avantage. On assure que là aussi, une nombreuse population pourrait subsister, en se livrant à la culture.\n\nDes gisements d'or considérables ont été découverts, il y a plusieurs années déjà.\n\nNous pouvons ajouter que le sel se trouve en quantité au Nord-Ouest.\n\nMaintenant, qui pourrait prédire ce que l'avenir réserve au Nord-Ouest canadien ? Imaginons, pour un instant, ces immenses territoires habités par des millions de producteurs et de consommateurs ; de florissantes villes s'élevant là et là, dans la plaine traversée par des chemins de fer, le long des cours d'eau ou des lacs reliés ensemble par des canaux ; le commerce et l'industrie activés et soutenus par une production agricole énorme ; l'achèvement du Pacifique qui permettrait l'exportation facile de l'excédant ou du surplus, et enfin (si le projet est bien praticable), l'ouverture d'un port à la Baie-d'Hudson qui rapprocherait Liverpool de plusieurs centaines de milles.\n\nEncore 20 années, et nous assisterons, en toute probabilité, à une transformation complète, non-seulement de Manitoba, mais du Nord-Ouest tout entier.\nLE JOURNAL D'AGRICULTURE ILLUSTRE\n\nThe Illustrated Journal OF AGRICULTURE\n\nCes publications mensuelles—16 pages quarto—bien illustrées, sont sous le contrôle du département de l'agriculture et des travaux publics. Les renseignements qu'on y donne s'appliquent essentiellement aux besoins du cultivateur canadien. On s'efforce surtout de faire connaître les pratiques agricoles qui ont le mieux réussi dans notre pays, tant pour l'AGRICULTURE proprement dite que pour l'horticulture, l'arboriculture, l'apiculture, etc.\n\nM. Ed. A. Barnard en est le rédacteur en chef. M. l'abbé Provancher est attaché à la rédaction, pour ce qui regarde l'Entomologie et les Sciences naturelles en général.\n\nDes COLLABORATEURS SPÉCIAUX dirigent les départements de l'Apiculture, de l'Elevage des volailles, etc.\nToute question d'intérêt général, ayant trait à ces divers sujets, est référée au spécialiste, qui répond, gratuitement, par l'entremise du journal, et même par la malle si les circonstances l'exigent.\n\nANNONCES.\n\nLes journaux d'agriculture illustrés ont, ensemble, une circulation mensuelle de 22,000 exemplaires. Ils forment le meilleur intermédiaire possible entre les cultivateurs et tous ceux qui ont des annonces à publier.\n\nCeux qui ont des terres, des moulins à scie ou à farine, etc., etc., à vendre feront bien de le faire savoir au soussigné.\n\nLA SOUSCRIPTION ANNUELLE\n\nEST\n\nd'Une Piastre, payable d'avance.\n\nTARIF DES ANNONCES:\n\nDans les deux journaux ........................................... 5 cents du mot,\n30 \" par ligne.\nDans un journal seulement................................. 3 \" du mot,\n20 \" par ligne.\n\nLes journaux d'agriculture illustrés sont envoyés gratuitement à tous les membres des sociétés d'agriculture et d'horticulture reconnues par la loi, dans la province de Québec.\n\nPour tous renseignements, s'adresser à\n\nEd. A. BARNARD,\n\nDirecteur de l'Agriculture.\n\nNo. 10, Rue Saint-Vincent, Montréal.\nBUREAU DES PÊCHERIES,\n\nOTTAWA, 9 FÉVRIER 1880.\n\nAVIS PUBLIC.\n\nOn attire l'attention du public sur les dispositions suivantes de la loi des Pêcheries :\n\nIl est défendu de pêcher avec des rets ou des seines sans licence. Les rets doivent être levés du samedi soir au lundi matin de chaque semaine.\n\nIl est défendu de tendre des rets ou des seines de manière à barrer les chenaux ou baies.\n\nIl est défendu de tuer le poisson sur les frayères.\n\nIl est défendu de détruire le fretin du poisson.\n\nIl est défendu de se servir de matières explosibles ou poisonneuses pour prendre le poisson.\n\nLes Sauvages sont obligés de se conformer aux lois des Pêcheries aussi bien que les Blancs.\n\nToute personne trouvée coupable de violation des règlements susdits se rend passible d'amende et des frais, en outre de la confiscation des rets, seines, etc., etc., ou, à défaut de paiement, s'expose à être emprisonnée.\n\nNul ne devra prendre, tuer ou vendre le poisson pendant le temps défendu.\n\nPar ordre,\n\nW. F. WHITCHER,\nCommissaire des Pêcheries.\nCIRCULAIRE.\n\nDÉPARTEMENT DES DOUANES.\n\nRÈGLEMENT concernant les voitures des voyageurs, etc., etc.,\nqui traversent la frontière.\n\nLe Ministre des Douanes a sanctionné les règlements suivants,\nafin d'assurer l'uniformité de la pratique suivie dans les ports\nsitués sur la frontière, au sujet des \"voitures des voyageurs ou\ndes voitures chargées de marchandises,\" et ainsi, aussi, d'accorder\nla plus grande latitude possible à ceux qui visitent le Canada,\nsans nuire en rien au revenu :\n\n1o. Les diligences et fiacres réguliers dont les propriétaires\nou les conducteurs sont connus des officiers, pourront traverser\nla frontière et revenir dans l'espace de deux jours, sans être\nobligés de faire une entrée à la douane, mais sujets, néanmoins,\nà l'inspection ordinaire.\n\n2o. Les voyageurs ayant l'intention de rester plus de deux\njours au Canada, devront, dans tous les cas, faire l'entrée de leurs\nchevaux, voitures et équipement ; et, s'ils ne veulent pas revenir\nau même point où ils sont entrés, ou s'ils sont incertains à ce\nsujet, ils devront remettre au Percepteur le montant entier des\ndroits sur tels chevaux, voitures et autres articles imposables ; et\nces droits seront remis lorsqu'il aura été prouvé d'une manière\nsatisfaisante que les articles en question auront été rapportés aux\nEtats-Unis.\n\nCeux qui auraient l'intention de revenir par le Port d'Entrée\npourront faire leur entrée comme ci-dessus, et fournir, au lieu\nd'argent, le cautionnement accepté d'un résident, devant égaler\nle montant des droits : à la condition, aussi, que ce cautionnement\nsera mis en force, si l'on dépasse le délai prescrit.\n\n3o. Le délai accordé aux voyageurs n'excédera pas un mois,\net, s'il est dépassé, les entrées seront censées être bona fide des\nentrées impliquant le paiement des droits, et seront portées aux\ncomptes du port.\n40. Tous les deniers reçus en dépôt, par les Perceuteurs, d'après les règlements ci-dessus, devront être déposés ad interim, si possible, dans une banque, au nom du Perceuteur, et, si cela est impossible, dans quelque autre place sûre, au crédit du Perceuteur, et il sera envoyé au département, à chaque trimestre, un compte séparé de l'argent reçu et de la manière dont il en aura été disposé.\n\n50. Les entrées dans tel cas devront contenir une description telle des chevaux, voitures, qui permettrait au percepteur ou à tout autre officier de les identifier à leur départ du Canada; et il sera donné au propriétaire ou à la personne faisant une copie de cette description, ce qui sera son permis pour voyager dans le pays.\n\nJ. JOHNSON,\nComm. des Douanes\n\nDépartement des Douanes,\nOttawa, 1er janv. 1880.\n\nSTATUTS DU CANADA.\n\nLes volumes suivants des Statuts de la Puissance du Canada, etc., peuvent être obtenus de l'imprimeur de la Reine pour le Canada, à Ottawa, comme suit :\n\n| Volume | Année | Prix |\n|--------|-------|------|\n| 31     | 1ère partie, 1867... | $1.00 |\n| 31     | 2nde \" 1868... | 1.00 |\n| 32 et 33 | \" 1869... | 1.50 |\n| 34     | \" 1870... | 0.80 |\n| 35     | \" 1871... | 0.80 |\n| 36     | \" 1872... | 2.00 |\n| 37     | \" 1873... | 1.60 |\n| 38     | (Vol. 1) 1874... | 1.60 |\n| 38     | (Vol. 2) 1875... | 1.50 |\n| 39     | (Vol. 1) 1876... | 0.80 |\n| 39     | (Vol. 2) 1876... | 0.80 |\n\nOrdres en Conseil ayant la forme des lois... 1.25\n\nUn escompte est accordé au commerce.\n\nB. CHAMBERLIN, J. C. AIKINS,\nImprimeur de la Reine, Secrétaire d'Etat.\nOttawa, février 1880.\nHOTEL DU GOUVERNEMENT, OTTAWA.\n\nMardi, 6ème jour de janvier 1880.\n\nPRÉSENT :\n\nSON EXCELLENCE LE GOUVERNEUR-GÉNÉRAL EN CONSEIL.\n\nSUR la recommandation de l'honorable ministre du Revenu de l'Intérieur, et en vertu des dispositions de la 48ème section de l'acte passé durant la session du Parlement du Canada, tenue en la 42ème année du règne de Sa Majesté, chapitre 16, et intitulé : \"Acte pour amender et refonder les lois concernant les poids et mesures.\"\n\nIl a plu à Son Excellence, par et de l'avis du Conseil Privé de la Reine pour le Canada, d'ordonner et il est par le présent ordonné que les règlements suivants relatifs à l'inspection des poids et mesures, outre les règlements établis par l'ordre en Conseil du 14 août 1879, ont été approuvés et adoptés, à savoir :\n\nE. Vérification et étalonnage des poids, mesures et balances dans les ateliers du fabricant, et leur transport.\n\n1o. Pour la première vérification et le premier étalonnage des poids, mesures et balances aux ateliers de fabrication, les honoraires pourront être payés de suite, ou bien le paiement pourra être différé, si le manufacturier le préfère, aux conditions suivantes :\n\n(a) L'article portera le nom du fabricant et un numéro consécutif de fabrique, ou toute autre marque qui servira à l'identifier avec le certificat de vérification ;\n\n(b) La vérification et l'étalonnage pourront se faire avant que les articles soient emballés pour le transport, ou lorsqu'ils sont tels que le fabricant peut les ajuster finalement, ou plus tard, selon que la chose sera le plus convenable ;\n\n(c) Si le fabricant paie les honoraires de suite, l'estampe noire ordinaire indiquant le montant de ces honoraires sera empreinte sur le certificat de vérification, et ce certificat devra être empaqueté avec, ou antrement attaché à l'article auquel il se rapporte, afin de l'accompagner ;\n(d) Si le fabricant préfère différer le paiement des honoraires, une estampe rouge spéciale devra être empreinte sur le certificat de vérification, laquelle estampe n'indiquera pas le montant des honoraires que désignera le certificat comme à l'ordinaire. Ce certificat devra aussi être empaqueté avec ou attaché à l'article auquel il a rapport, afin de l'accompagner ;\n\n(e) Lorsque les articles vérifiés et étalonnés comme susdit sont emballés, les ballots ou paquets les contenant devront porter à l'extérieur—\n\n(1) Un double du \"numéro de fabrique\" ou de toute autre marque devant servir à identifier l'article ;\n(2) Les mots : \"Honoraires payés,\" ou \"Honoraires non payés,\" selon le cas ;\n2o. Les articles vérifiés et étalonnés, comme ci-dessus prescrit, pourront servir au commerce, ou passer des ateliers du fabricant dans la boutique du commerçant, ou du magasin d'un marchand à un autre ; mais\n3o. Les articles accompagnés d'un certificat portant une estampe rouge, ou ceux qui ne sont pas accompagnés d'un certificat qui les identifie, devront être vérifiés de nouveau, et seront sujets au paiement des honoraires, lorsqu'un inspecteur ou son assistant les trouvera en usage dans le commerce ;\n4o. Lorsqu'un fabricant de poids, mesures ou balances désirera transporter quelques produits de sa manufacture au magasin d'un commerçant sans le soumettre au procédé de la vérification, il pourra le faire aux conditions suivantes :\n(a) Les articles porteront le nom du fabricant et un \"numéro de fabrique\" consécutif, ou toute autre marque, qui serviront à les identifier ;\n(b) Si les articles sont emballés, le ballot portera le numéro de la fabrique ou toute autre marque devant les identifier ; aussi, le nom du fabricant et le mot : \"non vérifié\" ;\n(c) Le fabricant notifiera de ce transport l'inspecteur de la division d'où proviennent les articles non vérifiés, avec une formule que fournira le département.\n\n(F.) Les poids, mesures et balances importés au Canada seront soumis aux règlements suivants :\n\n1o. Le percepteur des douanes aux ports où les articles sont importés, devra donner avis à l'inspecteur ou à l'assistant-inspecteur des poids et mesures, le plus rapproché de l'entrée au port de ces poids, mesures et balances ; et cet avis indiquera le nombre et donnera la description des articles, d'après la facture, ainsi que les noms et domiciles des personnes auxquelles les articles sont consignés ;\n\n2o. Pourvu que les articles restent dans les ballots ou paquets primitifs, ils pourront être transportés de la maison de douane ou d'un entrepôt de douane au magasin d'un importateur, et du magasin d'un commerçant à un autre, sans être vérifiés, aux conditions suivantes :\n(a) Lorsque l'on sera prêt à transporter les articles, le propriétaire donnera avis à l'inspecteur des poids et mesures le plus rapproché, ou à son assistant, sur une formule fournie par le département, du nombre de ces articles dont il donnera aussi la description ;\n(b) Sur les ballots ou paquets contenant les articles transportés, devront être écrits lisiblement les mots : \"Poids,\" \"Mesures,\" ou \"Balances,\" selon le cas, et le mot : \"non vérifié.\"\n\n3o. Lorsque des poids, mesures ou balances sont importés pour être livrés directement à une personne qui entend s'en servir pour le commerce, il faut alors que ces articles soient envoyés directement de la maison de douane où ils\nétaient entrés pour la consommation, au bureau de l'inspecteur des poids et mesures, ou de son assistant, le plus rapproché de la maison de douane ou de la personne à laquelle les dits articles sont adressés pour les fins du commerce, — selon que la chose sera le plus convenable, — pour y être vérifiés et étalonnés avant d'être livrés à la personne qui doit s'en servir pour le commerce.\n\nVoici si un importateur ou un commerçant de poids, mesures ou balances désire expédier un article de son entrepôt avant de le vérifier, directement à une personne qui entend s'en servir pour le commerce, il pourra le faire, pourvu que l'on prenne des arrangements pour que l'article soit transporté au bureau de l'inspecteur ou de l'assistant-inspecteur des poids et mesures, le plus rapproché de l'endroit où l'article doit servir, pour y être vérifié avant d'être livré pour les fins du commerce.\n\nG. Rien dans ces règlements supplémentaires, ni dans aucun autre règlement précédent, ne sera censé empêcher l'importation, la fabrication, le transport ou l'établissement, avant leur vérification, de balances à bascule de toute espèce, conformes aux exigences de la loi, mais qui ne peuvent servir ni être convenablement vérifiées avant qu'elles soient placées sur une base solide. Mais l'usage de ces machines à peser pour les fins du commerce sera illégal, jusqu'à ce qu'elles soient vérifiées et étalonnées.\n\nH. 1o. Les poids en fer pesant une demi-livre ou moins pourront être vérifiés, pourvu qu'ils soient d'une substance telle que l'on puisse y fixer solidement un tampon de métal mou sur lequel l'estampe pourra être empreinte, et après que ce tampon de métal mou y aura été ainsi fixé par la personne qui présentera les poids pour les faire vérifier.\n\n2. Lorsqu'un poids en fer sera présenté pour être vérifié, ou lorsque ce poids aura perdu son tampon de métal mou, il ne pourra être ajusté ou étalonné de nouveau avant que l'ouverture dans laquelle avait été placé le tampon soit agrandie au fond, en présence de l'inspecteur, afin que l'expansion du plomb qui servira à l'ajuster empêche qu'il ne soit encore enlevé.\n\nJ. O. COTÉ,\nAssistant Greffier du Conseil Privé.\nPARLEMENT FÉDÉRAL\n\nRègles relatives aux avis de bills privés.\n\n51. Dans le cas de toute demande de bill privé, proprement du ressort législatif du Parlement du Canada suivant les dispositions de l'Acte de l'Amérique Britannique du Nord, 1867, et ayant pour objet, soit la construction d'un pont, d'un chemin de fer, d'un chemin à barrières ou d'une ligne télégraphique ; soit la construction ou l'amélioration d'un port, d'un canal, d'une écluse, d'une digue ou d'une glissière, ou autre ouvrage semblable ; soit la concession d'un droit de passage d'eau, l'incorporation de professions ou métiers, ou d'une compagnie de banque ou autre compagnie par actions ; soit la concession à une ou plusieurs personnes de certains droits ou privilèges exclusifs ou particuliers ; soit le pouvoir de faire quelque chose qui, dans ses effets, pourrait toucher aux droits ou à la propriété d'autrui, ou concerner une classe particulière de la société ; ou ayant pour objet quelque amendement de même nature à un acte antérieur,—un avis, énonçant d'une manière claire et intelligible la nature et l'objet de la demande, et signé (excepté s'il s'agit de corporations déjà existantes) par les pétitionnaires ou de leur part, est nécessaire et doit être publié comme il suit.\n\nDans les provinces de Québec et de Manitoba :\n\nUn avis doit être inséré dans la Gazette du Canada en anglais et en français, ainsi que dans un journal anglais et un journal français du district intéressé, ou en anglais et en français dans le même journal, s'il ne s'en publie qu'un seul dans ce district ; ou, s'il n'y paraît pas de journal, alors la publication de l'avis en anglais et en français doit se faire dans un journal du district le plus voisin où il s'en publie.\n\nDans les autres provinces :\n\nUn avis doit être inséré dans la Gazette du Canada et dans un journal du comté ou des comtés-unis intéressés, ou, s'il n'y paraît pas de journal, alors la publication doit se faire dans un journal du comté le plus voisin où il s'en publie.\n\nLa publication de ces avis durera, dans chaque cas, la période de deux mois pendant l'intervalle de temps qui s'écoulera entre la clôture de la session précédente et la prise en considération de la pétition. Un exemplaire des numéros des journaux, reproduisant la première et la dernière insertion de l'avis, devra être transmis au greffier de chaque Chambre.\n\nSi la pétition demande l'autorisation de présenter un bill privé ayant pour objet la construction d'un pont de péage, le pétitionnaire ou les pétitionnaires devront, en même temps qu'ils donne-\nront l'avis prescrit par la règle précédente, donner aussi, de la même manière, avis des péages qu'ils entendent exiger, de l'étendue du privilège, de la hauteur des arches, de l'espace à l'aissier libre entre les culées ou les piliers pour le passage de radeaux et des navires; et mentionner de plus s'ils se proposent de construire un pont mobile, et quelles en seront les dimensions.\n\nToute personne désirant obtenir un bill privé devra, dans les huit jours qui précéderont l'ouverture du Parlement, déposer au bureau du greffier de la Chambre dans laquelle le bill doit prendre naissance, une copie de ce bill en langue anglaise ou en langue française, avec une somme suffisante pour en payer la traduction et l'impression. Il en sera imprimé 600 exemplaires en anglais et 200 en français; la traduction devra être faite par les officiers de la Chambre, et l'impression par l'entrepreneur des impressions. Le pétitionnaire aura aussi à payer au comptable de la Chambre une somme de $200, plus le coût de l'impression de l'acte dans les Statuts, et remettra le reçu de ce paiement au greffier du comité auquel ce bill aura été renvoyé. Le dit paiement sera effectué immédiatement après la seconde lecture, avant la prise en considération du bill par le comité.\n\nAucune pétition pour l'obtention d'un bill privé ne sera reçue par l'une ou par l'autre Chambre après les dix premiers jours de la session.\n\nROBERT LEMOINE,\nGreffier du Sénat.\n\nALFRED PATRICK,\nGreffier des Communes.\n\nRègles du Sénat relatives aux avis de bills de divorce.\n\n72. Quiconque a l'intention de demander un bill de divorce, doit donner avis de son intention, et spécifier d'avec qui et pour quelle cause il veut divorcer. L'avis doit être inséré pendant six mois, à la Gazette du Canada, et dans deux journaux du district (si c'est dans les provinces de Québec et de Manitoba,) ou du comté ou des comtés-unis, (si c'est dans les autres provinces,) où le pétitionnaire résidait ordinairement lors de la séparation; et, si le nombre voulu de journaux n'y paraît pas, alors la publication de l'avis devra se faire dans le district, le comté ou les comtés-unis voisins.\n\nUn exemplaire en manuscrit de l'avis devra être signifié, à l'instance du pétitionnaire, à la personne d'avec laquelle il veut divorcer, si le lieu de la résidence de cette dernière peut être connu; et la preuve de cette signification ou de la diligence faite pour l'effectuer, doit être produite sous serment devant le Sénat et à sa satisfaction, lors de la pétition.\n\nROBERT LEMOINE,\nGreffier du Sénat.\nRÈGLEMENTS\n\nConcernant certaines terres publiques qui devront servir au chemin de fer du Pacifique.\n\nDÉPARTEMENT DE L'INTÉRIEUR,\n\nOTTAWA, 14 octobre 1879.\n\nAVIS PUBLIC est par le présent donné que les dispositions suivantes, qui seront censées être applicables aux terres se trouvant dans la province de Manitoba, et dans les territoires situés à l'ouest et au nord-ouest d'icelle, sont substituées aux règlements portant la date du 9 juillet dernier, et déterminant la manière de disposer des terres publiques situées dans un rayon de 110 milles (cent dix milles) de chaque côté de la ligne du chemin de fer du Pacifique, lesquels dits règlements sont par le présent annulés :\n\n1. \"Jusqu'à ce que l'étude ultérieure et finale du dit chemin de fer ait été faite à l'ouest de la Rivière-Rouge, et pour l'utilité de ses règlements, la voie du dit chemin de fer sera supposée se trouver sur la quatrième base ouest, jusqu'à l'intersection de la dite base avec la ligne qui se trouve entre les rangs 21 et 22, à l'ouest du premier méridien principal, pour de là se diriger, en suivant une ligne directe, jusqu'au confluent des rivières Shell et Assiniboine.\n\n2. \"Les terrains situés de chaque côté de la ligne seront respectivement divisés en bandes de la manière suivante :\n\n\"(1) Une bande de cinq milles, de chaque côté du chemin, immédiatement en contact avec lui, sera appelée la bande A ;\n\"(2) Une bande de quinze milles, située de chaque côté du chemin, et voisine immédiate de la bande A, sera appelée la bande B ;\n\"(3) Une bande de vingt milles, située de chaque côté du chemin et voisine immédiate de la bande B, sera appelée la bande C ;\n\"(4) Une bande de vingt milles, située de chaque côté du chemin, et voisine immédiate de la bande C, sera appelée la bande D ; et\n\"(5) Une bande de cinquante milles, située de chaque côté du chemin et voisine immédiate de la bande D, sera appelée la bande E.\n\n3. \"Les sections portant les numéros pairs dans chaque township qui se trouve dans les différentes bandes ci-dessus décrites, seront affectées aux homesteads et aux préemption, de 160 acres chacun, respectivement.\n\n4. \"Les sections portant les numéros impairs dans chacun des dits townships seront fermées aux homesteads ou préemptions, et réservées et reconnues comme terres du chemin de fer.\n\n5. \"Les terres du chemin de fer situées dans les différentes bandes seront vendues aux prix suivants : Dans la bande A, $5 (cinq piastres) l'acre ; dans la bande B, $4 (quatre piastres) l'acre ; dans la bande C, $3 (trois piastres) l'acre ; dans la bande D, $2 (deux piastres) l'acre ; dans la bande E, $1 (une piastre) l'acre ; et les termes de vente seront comme suit : Un dixième payable au comptant, lors de l'achat ; et la balance, payable en neuf versements annuels égaux, avec intérêt au taux de six pour cent par année sur ce qui restera dû.\n\n6. \"Les terres affectées aux pré-emptions dans les différentes bandes seront vendues aux conditions et aux prix suivants : Dans les bandes A, B et C, à $9.50 (deux piastres et cinquante cents) l'acre ; dans la bande D, à $2 (deux piastres) l'acre ; et dans la bande E, à $1 (une piastre) l'acre. Les termes de vente seront comme suit : Quatre-dizaines de la somme totale, et les intérêts de cette dernière au taux de six pour cent par an, devront être payés à l'expiration de trois années à partir de la date d'entrée en possession ; les autres six-dizaines devront être payées en six paiements annuels à partir de la dite date avec intérêt au taux sus-mentionné, sur telle balance du prix d'achat qui d'année en année restera impayée.\n\n7. \"Tous les paiements, soit pour les terres du chemin de fer, soit pour les\npré-emptions, dans les différentes bandes, seront faits en argent, et non avec des certificats (scrips) ou des mandats militaires ou de police.\n\n8. \"Tous les argentés reçus en paiement de terres pré-emptées appartiendront à, et formeront partie du fonds destiné au chemin de fer, de la même manière que les argentés reçus en paiement des terres du chemin de fer.\n\n9. \"Ces dispositions auront un effet rétroactif, en ce qui concerne toutes les inscriptions, ou en ce qui concerne les ventes de terres du chemin de fer, faites en vertu des règlements du 9 de juillet, lesquels sont par le présent annulés, et il sera tenu compte de tous les paiements faits en sus et au-delà des prix indiqués.\n\n10. \"L'ordre du Conseil du 9 de novembre 1877, concernant les terres entièrement affectées au chemin de fer dans la province de Manitoba, ayant été annulé, toutes les personnes qui se sont établies de bonne foi sur les dites terres, en vertu du dit ordre du Conseil, paieront, en vertu de ces dispositions, pour les terres pré-emptées, le prix fixé dans chacune des bandes. Lorsqu'une personne aura pris deux quarts de section en vertu de tel ordre du Conseil, elle pourra garder en vertu de ces dispositions, comme homestead, le quart de section sur lequel elle se sera établie, et, comme pré-emption, l'autre quart de section, — que ce homestead et cette préemption se trouvent, oui ou non, sur une section portant un numéro pair. Tous les argentés payés par telle personne pour les terres qu'elle aura prises, en vertu du dit ordre du Conseil, seront portés au crédit de sa pré-emption, en vertu de ces dispositions. Quiconque aura pris un quart de section en vertu de l'ordre du Conseil mentionné, aura le privilège de le garder comme homestead et pourra prendre un autre quart de section, comme pré-emption, l'argent déjà payé par lui devant être porté au crédit de telle pré-emption.\n\n11. \"Toutes les prises de possession de terres seront soumises aux dispositions suivantes relatives au droit de passage du chemin de fer du Pacifique Canadien ou de l'importé quel autre chemin de fer de colonisation du gouvernement faisant sa jonction avec le dit chemin de fer :\n\na. \"Si le chemin de fer traverse une terre occupée comme homestead, le gouvernement aura le droit de passage libre, de même qu'il pourra construire librement les stations là où elles seront jugées nécessaires.\n\nb. \"Lorsque le chemin de fer traversera des pré-emptions ou des terres du chemin de fer, prises avant la date actuelle, le gouvernement pourra prendre possession de telle partie du dit terrain qui sera nécessaire pour les stations ou les sablonnières, et le propriétaire pourra seulement réclamer le prix par lui payé au gouvernement pour tel terrain, à raison de tant de l'acre.\n\nc. \"Si, après la localisation finale du chemin de fer à travers des terres non arpentées mais non prises à cette époque, il se trouve que quelque personne occupe des terrains dont l'intérêt public exige de garder, le gouvernement se réserve le droit de prendre possession des dits terrains en payant à l'occupant la valeur des améliorations par lui faites.\n\n12. \"Les réclamations provenant de l'occupation, après la date actuelle, d'un terrain non arpenté, lors de la prise de possession, et pouvant être compris dans les limites affectées par les règlements ci-dessus ou par leur application ultérieure à de nouveaux territoires, seront dorénavant régées conformément aux conditions ci-dessus relatives aux terres qui se trouvent dans la zone particulière où cet établissement pourra être situé, sujet à l'opération de la sous-section c de la section 11 de ces règlements.\n\n13. \"Toutes les entrées faites après la date de l'occupation, pour des terres inoccupées dans les limites de l'agence de la Saskatchewan, seront considérées comme provisoires jusqu'à ce que le tracé de la ligne ait été fixé à travers les territoires, après quoi on disposera finalement de ces terres en vertu de ces règlements en tant qu'ils s'appliqueront à la zone particulière où se trouvent ces terres, sujet toutefois à l'opération de la sous-section c de la section 11 de ces règlements.\n14. \"En vue de favoriser la colonisation en réduisant le prix des matériaux de construction, le gouvernement se réserve le droit d'accorder des licences renouvelables chaque année, en vertu de la section 52 de l'Acte concernant les terres fédérales, 1879,\" pour couper du bois marchand sur toutes les terres situées dans les diverses zones ci-dessus désignées, et toute occupation ou vente de terres dans les limites du territoire auquel s'appliquent ces licences, seront pour le moment sujettes à l'opération de ces licences.\n\n15. \"Il est bien compris que les dispositions ci-dessus n'affecteront pas les sections 11 et 29 qui sont les terres réservées aux écoles publiques, et les sections 8 et 26 qui sont des terres de la Compagnie de la Baie-d'Hudson.\n\n\"On pourra se procurer tous les renseignements nécessaires en s'adressant au bureau des terres fédérales, Ottawa, ou à l'agent des terres fédérales à Winnipeg, ou aux agents locaux à Manitoba ou dans les Territoires.\n\nPar ordre du ministre de l'Intérieur,\n\nJ. S. DENNIS,\nDéputé ministre de l'Intérieur.\n\nLINDSAY RUSSELL,\nArpenteur général.\n\nINSPECTION\n\nDES\n\nPOIDS ET MESURES.\n\nL'acte concernant les Poids et Mesures, X.XXVI Vic., Ch. 41, a été mis en vigueur le premier juillet 1875, par la proclamation publiée dans la Gazette du Canada du 26 décembre 1874.\n\nLes droits d'accise sur les spiritueux, autrefois calculés d'après l'ancien gallon de vin, sont, depuis cette date, calculés d'après le gallon impérial, selon que le prescrit l'acte ci-haut cité : et ces droits se répartissent de la manière suivante :\n\n6\nSur les spiritueux ci-devant frappés d'un droit de 75 centimes par gallon de vin, 90 centimes par gallon impérial ou étalon de la force de preuve.\n\nOn remarquera que le gallon de vin contient 231 pouces cubes et le gallon impérial ou étalon, 277-274. Les quantités indiquées dans le gallon de vin peuvent être réduites en gallon impérial en déduisant un sixième : ou bien, les quantités indiquées dans le gallon impérial peuvent être converties en gallon de vin, en ajoutant un cinquième : ainsi\n\n\\[ 20 \\text{ gallons impériaux ou étalons} = 24 \\text{ gallons de vin}. \\]\n\n\\[ 24 \\text{ gallons de vin} = 20 \\text{ gallons impériaux}. \\]\n\n(Signé,)\n\nA. BRUNEL,\nCommissaire du Revenu de l'Intérieur.\n\nMinistère du Revenu de l'Intérieur,\n\n31 janvier 1879.\nCHEMINS DE FER DU GOUVERNEMENT EN OPERATION.\n\nCANADA.\n\nSYSTEME DE L'INTERCOLONIAL\n\nENTRE\n\nHalifax, Saint-Jean et Québec (Pointe-Levis,) avec embranchements pour Pictou et Pointe du-Chêne, se reliant à Halifax, en hiver, avec les steamers de la malle royale de Liverpool (évitant ainsi quatre cents milles de navigation océanique), et en été à Rimouski. Des convois spéciaux, avec chars dortoirs, circulent en connection avec le service de la malle océanique entre Halifax et Rimouski, se reliant au chemin de fer du Grand-Tronc à la jonction de la Chandrière et à la Pointe-Lévis.\n\nEST ! OUEST ! et SUD !\n\nLe système de chemin de fer de l'Île du Prince-Edouard relie Charlottetown, Summerside, Georgetown, Souris et Tignish. Durant la saison de la navigation, ce chemin de fer se relie aux steamers de la Compagnie de Navigation de l'Île du Prince-\nÉdouard, à Summerside, pour la Pointe-du-Chêne, et à Charlotte town pour Pictou, se reliant à ce dernier endroit au\n\nCHEMIN DE FER INTERCOLONIAL.\n\nLE SYSTÈME DU PACIFIQUE CANADIEN\n\n(Embranchement de Pembina.)\n\nFonctionne entre Saint-Vincent, Saint-Boniface et Selkirk,\n\nSe reliant à Saint-Vincent au chemin de fer de Saint-Paul, Minneapolis et Manitoba et au système des chemins de fer des États-Unis.\n\nLes passagers partant de toutes les localités sur l'Intercolonial et le chemin de fer de l'Île du Prince Édouard peuvent obtenir des passages à prix réduits pour Manitoba et les Prairies du Grand Nord-Ouest par les chemins de fer du Grand-Tronc et du Michigan Central jusqu'à Chicago, par les chemins de fer de Chicago, Milwaukee et Saint Paul, et de Chicago et North-Western jusqu'à Saint-Paul, et par celui de Saint-Paul, Minneapolis et Manitoba jusqu'à Saint-Vincent ; ensuite, par le chemin de fer du Pacifique Canadien ;\n\n—AUSSI—\n\npar les steamers de première classe de la Compagnie de transport du Nord-Ouest, voyageant entre Sarnia, Duluth et de la Baie du Tonnerre, durant la saison de navigation.\n\nCOLLINGWOOD SCHRIEBER,\n\nIngénieur en chef des Chemins de fer du Gouvernement en opération.\nGOUVERNEMENT DU CANADA.\n\nBANQUE D'EPARGNES DU BUREAU DE POSTE.\n\n1. Les Banques d'Epargnes du Bureau de Poste, dans Ontario et Québec, sont ouvertes tous les jours pour la réception et le remboursement des dépôts, durant les heures ordinaires du Bureau de Poste.\n\n2. La garantie directe du Gouvernement est donnée par le statut à tous les dépôts faits.\n\n3. Toute personne quelconque peut avoir un compte de dépôt, et peut déposer tous les ans quelque nombre que ce soit de dollars, depuis $1 à $300, ou plus avec la permission du Maître-Général des Postes.\n\n4. Des dépôts peuvent être faits par des femmes mariées, et les dépôts ainsi faits, ou par des femmes qui se marieraient par la suite, seront remboursés à ces mêmes femmes.\n\n5. Relativement aux enfants au dessous de dix ans, l'argent peut être déposé :\n\nPremièrement.—Par un parent ou ami comme curateur pour l'enfant, et dans ce cas les dépôts peuvent être retirés par le curateur jusqu'à ce que l'enfant ait atteint l'âge de dix ans, après quoi le remboursement ne se fera que sur la quittance collective du curateur et de l'enfant ;\n\nDeuxièmement—Au propre nom de l'enfant, et, dans ce cas, le remboursement ne sera fait que lorsque l'enfant aura atteint l'âge de dix ans.\n\n6. Un déposant dans aucune des Banques d'Epargnes du Bureau de Poste peut continuer ses dépôts dans quelqu'autre bureau analogue que ce soit, sans en donner avis ni changer de livret, et peut retirer des deniers de n'importe quel bureau de Banque d'Epargnes qui lui conviendra le mieux. Par exemple, s'il fait son premier dépôt à Cobourg, il peut en faire de subséquents ou retirer ses deniers à la Banque d'Epargnes du Bureau de Poste de Collingwood ou Québec, Sarnia, Brockville, ou tout autre endroit qui lui conviendra le mieux, soit qu'il continue de résider à Cobourg ou qu'il s'établisse ailleurs.\n7. À chaque déposant on fournit un livret, qui doit être produit chaque fois qu'il dépose ou retire des deniers, et les sommes déposées ou retirées y sont inscrites par le maître de poste recevant ou déboursant ces deniers.\n\n8. Le compte de chaque déposant est tenu dans le bureau du Maître Général des Postes à Ottawa, et en outre du reçu du Maître de Poste porté au livret, le déposant reçoit une reconnaissance directe du Maître-Général des Postes pour chaque dépôt qu'il a fait. Si cette reconnaissance ne parvient pas au déposant dans les dix jours qui suivront la date du dépôt, il doit s'adresser de suite au Maître-Général des Postes, par lettre, ayant soin de donner son adresse, et, si c'est nécessaire, écrire de nouveau, parce que le reçu du maître de poste ne suffit pas s'il n'est suivi de celui qui doit lui être adressé d'Ottawa.\n\n9. Chaque déposant doit envoyer son livret, tous les ans, le jour anniversaire de son premier dépôt, pour être comparé avec les livres du département, et pour l'entrée de l'intérêt. Le livret lui sera renvoyé par la malle suivante. Le déposant ne doit jamais, pour nulle autre cause, se dessaisir de son livret.\n\n10. Lorsqu'un déposant désire retirer des deniers, il peut le faire en s'adressant au Maître-Général des Postes, qui lui adressera un chèque pour le montant par la malle suivante, payable à quelque Banque d'Epargnes du Bureau de Poste que le déposant aura pu indiquer dans sa demande.\n\n11. Intérêt aux taux de 4 pour cent par année est alloué sur les dépôts, et l'intérêt est ajouté au principal le 30 juin de chaque année.\n\n12. Il est défendu par la loi aux Maîtres de Poste de dévoiler le nom d'aucun déposant, ou le montant de quelque somme déposée ou retirée.\n\n13. Les déposants n'ont rien à payer pour déposer ou retirer des deniers, ni pour les livrets, non plus que pour leur correspondance avec le Maître-Général des Postes relativement à leurs dépôts.\n\n14. Le Maître-Général des Postes est toujours prêt à recevoir et à écouter toute réclamation, plainte ou autres communications qui lui sont adressées par les déposants ou autres, relativement aux affaires de la Banque d'Epargnes du Bureau de Poste.\n\n15. On peut voir à tous les Bureaux de Poste les règlements complets de la Banque d'Epargnes du gouvernement.\nCANADA — IMMIGRATION.\n\nConcession gratuite de 160 acres de terre de prairie, aux colons qui veulent s'établir dans la province de Manitoba.\n\nConcession gratuite de 100 à 200 acres de terrains boisés, aux colons qui veulent s'établir dans d'autres parties du Canada.\n\nOn peut acheter des fermes en partie défrichées et les bâtiments à des prix raisonnables.\n\nPRIX DE PASSAGE REDUIT.\n\nLes journaliers agricoles et leurs familles peuvent obtenir des billets de passage du Royaume-Uni au Canada, à raison de £5 stg.; pour les enfants au-dessous de huit ans, £2.10s. stg., et les enfants au-dessous d'un an, 10s.; pour les servantes, £4 stg.\n\nLes arrangements ci-dessus seront valides jusqu'à nouvel ordre.\n\nOn peut obtenir tous les renseignements, dans le Royaume-Uni, soit par lettre, ou en s'adressant à l'Agent canadien principal d'Immigration, 31, rue Queen Victoria, C. E., Londres, Angleterre.\n\nSOIN DES ÉMIGRANTS.\n\nLes émigrants trouveront à leur arrivée au Canada, des agents du gouvernement aux endroits suivants :\n\nQuébec—L. Stafford.\nMontréal—John J. Daley.\nOttawa, Ont.—W. J. Wills.\nKingston, Ont.—R. McPherson.\nToronto, Ont.—John A. Donaldson.\nHamilton, Ont.—John Smith.\nSherbrooke, Québec—Henry Hubbard.\nLondon, Ont.—A. G. Smith.\nHalifax, N.-E.—E. Clav.\nSaint-Jean, N. B.—N. Gardner.\nDufferin, Manitoba—Jean E. Tétu.\nWinnipeg, Manitoba—W. Hespeler.\n\nCes officiers du gouvernement vont recevoir les émigrants, à l'arrivée de chaque steamer, vaisseau à voiles ou convoi de chemin de fer, et ils donneront à ceux qui le leur demanderont tous les renseignements et toute la protection possible. Les émigrants devront aussi leur communiquer toutes plaintes à leur arrivée. Les agents fourniront également toutes les informations nécessaires sur les terres ouvertes à la colonisation dans les différentes provinces, sur les fermes offertes en vente, les demandes d'emploi, les salaires et gages, les voies de communication, les frais de transport, etc., etc.; ils recevront, en outre, et transmettront toutes les lettres et envois des immigrants.\n\nOn pourra compter sur l'exactitude des renseignements fournis par les Agents du Canada.\n\nJ. H. POPE,\nMinistre de l'Agriculture.\n\nDépartement de l'Agriculture,\nOttawa, 1880.\nDépartement des Travaux Publics.\n\nL'honorable H. L. LANGEVIN, C. B....Ministre des Trav. Pub.\nG. F. BAILLARGÉ..........................Député.\nL. E. ST. O. CHAPLEAU ...................Secrétaire.\nH. F. PERLEY..............................Ingénieur.\nT. S. SCOTT...............................Architecte-en-Chef.\nJAMES BOWES.............................Assistant-Architecte.\nO. DIONNE.................................Comptable.\nH. AIKINS.................................Assistant-Comptable.\nJ. E. VERREULT............................\" \"\nJ. W. HARPER.............................Paie-Maitre.\nP. CARTIER.................................Secrétaire-Privé.\nL. LEFEBVRE, T. H. ALLEN..............Commis.\nE. P. BANCE, J. COTÉ......................Commis.\nF. J. MACKAY, H. TALBOT...............Commis.\nE. McCARTHY...............................Dessinateur.\nA. POTVIN ET M. WALH....................Messagers.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_38287.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 82, "total-input-tokens": 135844, "total-output-tokens": 50749, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 886, 3], [886, 3324, 4], [3324, 3648, 5], [3648, 3708, 6], [3708, 4685, 7], [4685, 4685, 8], [4685, 6894, 9], [6894, 9261, 10], [9261, 12006, 11], [12006, 14466, 12], [14466, 17001, 13], [17001, 19382, 14], [19382, 21745, 15], [21745, 23871, 16], [23871, 26378, 17], [26378, 29205, 18], [29205, 32131, 19], [32131, 34978, 20], [34978, 38054, 21], [38054, 40203, 22], [40203, 41604, 23], [41604, 43455, 24], [43455, 45570, 25], [45570, 48074, 26], [48074, 50311, 27], [50311, 52695, 28], [52695, 55344, 29], [55344, 57060, 30], [57060, 58221, 31], [58221, 60852, 32], [60852, 63641, 33], [63641, 66294, 34], [66294, 69147, 35], [69147, 71702, 36], [71702, 74246, 37], [74246, 76091, 38], [76091, 77608, 39], [77608, 79467, 40], [79467, 82091, 41], [82091, 84668, 42], [84668, 87331, 43], [87331, 89917, 44], [89917, 92752, 45], [92752, 96489, 46], [96489, 98869, 47], [98869, 101758, 48], [101758, 104142, 49], [104142, 106281, 50], [106281, 108788, 51], [108788, 110541, 52], [110541, 113245, 53], [113245, 115702, 54], [115702, 117805, 55], [117805, 119262, 56], [119262, 120921, 57], [120921, 123064, 58], [123064, 125494, 59], [125494, 125494, 60], [125494, 126288, 61], [126288, 127417, 62], [127417, 128447, 63], [128447, 130275, 64], [130275, 131868, 65], [131868, 133718, 66], [133718, 137099, 67], [137099, 139270, 68], [139270, 141831, 69], [141831, 144378, 70], [144378, 148042, 71], [148042, 152168, 72], [152168, 153741, 73], [153741, 154493, 74], [154493, 155342, 75], [155342, 156543, 76], [156543, 158382, 77], [158382, 160664, 78], [160664, 162889, 79], [162889, 163787, 80], [163787, 163787, 81], [163787, 163787, 82]], "primary_language": ["en", "en", "en", "en", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]