[{"id": "e06d6e52a066b1625608dae443494c685d7e650d", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Additional comments:\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/\n- [ ] Pages damaged/\n- [ ] Pages restored and/or laminated/\n- [ ] Pages discoloured, stained or foxed/\n- [ ] Pages detached/\n- [ ] Showthrough/\n- [ ] Quality of print varies/\n- [ ] Includes supplementary material/\n- [ ] Only edition available/\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|----------------|-----|-----|-----|-----|-----|-----|\n|                | 12X | 16X | 20X | 24X | 28X | 32X |\n\nThe following features have been checked where applicable:\n\n- [ ] Coloured covers\n- [ ] Covers damaged\n- [ ] Covers restored and/or laminated\n- [ ] Cover title missing\n- [ ] Coloured maps\n- [ ] Coloured ink (i.e. other than blue or black)\n- [ ] Coloured plates and/or illustrations\n- [ ] Bound with other material\n- [ ] Tight binding may cause shadows or distortion along interior margin\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming\n- [ ] Additional comments\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|----------------|-----|-----|-----|-----|-----|-----|\n|                | 12X | 16X | 20X | 24X | 28X | 32X |\n\nThe following features have been checked where applicable:\n\n- [ ] Coloured covers\n- [ ] Covers damaged\n- [ ] Covers restored and/or laminated\n- [ ] Cover title missing\n- [ ] Coloured maps\n- [ ] Coloured ink (i.e. other than blue or black)\n- [ ] Coloured plates and/or illustrations\n- [ ] Bound with other material\n- [ ] Tight binding may cause shadows or distortion along interior margin\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming\n- [ ] Additional comments\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —— (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de flmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nAN ESSAY\n\nSUGGESTIVE OF A\n\nSCHEME OF COLONISATION\n\nADAPTED TO THE\n\nWILD LANDS\n\nOF\n\nBRITISH NORTH AMERICA,\n\nAND\n\nESPECIALLY RECOMMENDED TO THE CONSIDERATION\n\nOF THE\n\nGOVERNMENT AND PEOPLE OF CANADA.\n\nBY S. M. TAYLOR\n\nMontreal:\n\nPRINTED AND PUBLISHED BY JOHN LOVELL,\n\nST. NICHOLAS STREET;\n\nTORONTO: WM. C. F. CAVERILL, 87 YONGE STREET;\n\nQUEBEC: JOHN LOVELL, STE. ANNE STREET, UPPER TOWN.\n\nFOR SALE AT THE BOOKSTORES.\n\n1859.\nAN ESSAY\nSUGGESTIVE OF A\nSCHEME OF COLONISATION\nADAPTED TO THE\nWILD LANDS\nOF\nBRITISH NORTH AMERICA,\nAND\nESPECIALLY RECOMMENDED TO THE CONSIDERATION\nOF THE\nGOVERNMENT AND PEOPLE OF CANADA.\n\nBY S. M. TAYLOR\n\nMontreal:\nPRINTED AND PUBLISHED BY JOHN LOVELL,\nST. NICHOLAS STREET;\nTORONTO: WM. C. F. CAVERHILL, 87 YONGE STREET;\nQUEBEC: JOHN LOVELL, STE. ANNE STREET, UPPER TOWN.\nFOR SALE AT THE BOOKSTORES.\n\n1859.\nPREFACE.\n\nREFERENCE is made in the following pages to the question whether the true interests of this Province (so far as these are affected by immigration and colonisation) would be better served by publication of all the real facts in regard to settlement on the wild lands, or of such only as are calculated to convey the most favourable impressions: as much feeling may be excited in Canada upon this point, a special consideration is thought due, not only to exonerate the Author from any unjust reflections that may be entertained in regard to the one of these courses he has pursued; but especially to guard him from any identification with those parties in Canada whose constant task seems to be the depreciation of the country without any honest admission of those peculiar circumstances and natural conditions which justly entitle it to be held in very high estimation.\n\nUndoubtedly there has been pursued during several years a system of announcements, and of other modes of publication, among intending emigrants in Europe, the chief tendency of which was to induce them to come hither and to pass through to the Western States of America, scarcely regarding the more important object of their settlement in our own country. Indeed, so much has this been the case, that the chief purport of the arguments employed in the announcements alluded to is that the route of the St. Lawrence is that by which European emigrants\ncan most cheaply and conveniently reach the \"Far West,\"—a course that would be perfectly unexceptionable had we fully established, for our own colonisation, a sure and permanent system, the want of which constitutes all the objection that is urged against the policy described.\n\nThen, let facts answer to the question, whether the policy that has been pursued has benefitted the country by means of increased colonisation, or whether even it has obtained for Canada the advantage (whatever its value) of being made a highway to the Western States of the Union. As a first fact—one governing all others affecting this question—it may be noticed that emigration to this country has fallen off, not wholly from extrinsic causes, but from some other cause, increasingly mischievous, as may be inferred from the following statistical deductions: that the average annual emigration to Canada during the period from 1831 to 1855 inclusive being 31,729, the number arrived in 1856 was 10,866—in 1857, 448—and in 1858, 18,919, less than the above average; while, during the present season, the decrease in the emigration is enlarging to a fearful amount, in very significant contrast with that arriving at the port of New York. It is very difficult to estimate correctly the proportion of the emigration that still proceeds through Canada to the Western States: whether it falls short of one-third, or (thanks to the efforts in this behalf) it exceeds two-fifths of the emigration by the route of the St. Lawrence, is scarcely worth much thought, with a view to any satisfaction, as if the result were to favour the through-passage principle that has been sought to be established, the degree of benefit accruing to the Province from colonisation must be proportionally smaller.\n\nThe question is, then, with these indisputable facts, shall we still either virtually ignore or gloss over their existence, or shall we adopt a new and more honest course—fully and candidly\nadmit them, deal with them practically, and consummate such a liberal measure of reform as shall afford confidence instead of distrust among intending emigrants, especially as it may be safely assumed that this distrust has, somehow, been so intense and general as to have constituted one of the chief discouragements of our colonisation. Such a course it has been endeavoured to initiate in this Essay.\n\nThe subject of immigration has obtained but an incidental mention in these pages—very much less than that full treatment which many circumstances render desirable. A brief observation will fully explain this apparent neglect: although, in a certain respect, immigration must naturally take precedence of colonisation, it requires, in the preparation of a general system, that arrangements for the settlement of a new population should be made before measures are perfected to obtain the immigration intended for this object. Could we, for instance, induce next season the immigration of 50,000 souls, what, under present circumstances, should be the reception of them on our shores? They would not certainly be encouraged to occupy our cities and towns. Would they be advised to commence hewing their own way in our wildernesses? or would we quietly sink into the position of their carriers to another country?—It may also be observed, that it is especially desirable that Canadian immigration should obtain a full, candid, and distinct exposition of its various phases. Such a work may appear shortly, as an aid in the diffusion of a correct knowledge of Canada, and especially of her just claims to the aspirations of the harassed peoples of Europe.\n\nS. M. T.\n\nMelbourne, Canada East,\nAugust, 1859.\nAs the proper have system the that a com as in not In that that since it may refrar rend It a nu under emip a field and clas his coul\nAN ESSAY,\n\n&c., &c.\n\nAs there have been various schemes of Colonisation propounded and tried in North America, none of which have effected the desideratum of a regular and permanent system of immigration and colonisation, it is just that the proposer of a new scheme should state the reasons that induce him to think that the principles necessary to a correct system have never yet been clearly exhibited, as it is also desirable that he should bring to his task, not mere theory, but the fullest practical experience. In this respect, the Author ventures to express the belief that very few, if any, in Canada, have had the opportunities of such varied experience as have fallen to his lot since his first embarkation from England, which, although it might tend to enforce attention to his views, he only refrains from detailing, lest he should thereby justly render himself obnoxious to the charge of egotism.\n\nIt may, however, be allowed him to explain that, for a number of years, he has been most actively engaged, under Government and otherwise, in the business of emigration to this Province, which afforded him so large a field of observation, in regard to the hopes, expectations, and pursuits of many thousands of immigrants, of various classes and from different countries, as, concurrently with his own experience as a settler even in the \"back-woods,\" could not fail to produce in him a thorough conviction\nthat there was needed some special legislative action, whereby to remedy the grievances that were annually causing bitter disappointment to a considerable number of the immigrants. Under the pressure of this conviction he, some years since, submitted to the Government a scheme of colonisation, which, he had reason to know, met with much serious attention and approbation, although, as he was officially informed, the scheme was of too great a magnitude to be adopted at that time. Admitting, now, the probable justice of this reason for inaction, and, indeed, that the existence of powerful political antagonisms render legislative action very difficult, in consummating any great measure of national progress, he has directed his attention to such a modification of his scheme as would render it easily practicable under present circumstances, and pecuniarily profitable to all parties, besides promotive of the more patriotic object of restoring to Canada her former prestige as the best new Home for intending emigrants.\n\nSurely despite the opinions of those who advocate a laissez-faire treatment of this important subject, when there is brought to bear upon it the deep reflection that it deserves—when it is borne in mind that it involves not only the present and future welfare of the thousands of inexperienced strangers who come to our shores, but the due fulfilment of our destiny among nations—it should not be doubted that, in this enlightened age, with its manifold modes of accomplishing the various objects of public enterprise, some plan of colonisation (be it that now submitted or some other) could be devised, that, in exact adaptation to the circumstances of our country, would attract to us and justly satisfy the emigration that is constantly pouring out from the excessively populous countries of Europe.\nUntil very lately nothing whatever was done, on the land, in preparation for the back-woods settler, on the ground, apparently, that because individuals of that class had been known to have conquered almost inconceivable difficulties (then unavoidable), and had succeeded, by sacrificing many years of comfort, and by the endurance of much suffering, to leave a decent home for their descendants, no such facilitation was necessary under the present more favourable circumstances of the country—really so favourable, it is here submitted, as to permit the adoption of some system having for its object the greater increase of its population and the fuller use of its resources, resulting naturally from a greater influx of labour, skill, and capital—the true constituents of national wealth—all abundant in the older countries, and ready, upon due encouragement, to bestow upon us their fructifying power.\n\nEmigrants, for the greater part, infer from all that they read at home, in Emigrants' Guides and other works, that, when they arrive in the Eldorado which has been described to them, they need lose no time in locating upon wild land; but find themselves, on making the attempt, grievously disappointed in this the chief motive to their emigration. Even so lately as 1857, when certainly some commencement of a system had been made, we find, from the report of the superintendent of the Rivière du Désert Road, that \"emigrants, daunted by such obstructions [want of roads, &c.], after having wandered over great distances in search of land, attracted hither by reports, that good land could be procured at low prices, have been frequently known to go back, seemingly discouraged, in order to obtain elsewhere the object of their search.\" This discouragement, from one cause or another, has been the rule with few exceptions, obliging the repentant parties, as certainly the most prudent remedy\nfor their disappointment, to hire themselves out for months or years before they encounter the certain hardships, privations, and difficulties of a \"bush\" farm, or worse still (at least for the Province), they expend probably the remainder of their means in proceeding further westward, beyond the boundaries of our country. Nor should any be surprised at these results, when the mind's eye is directed to the case of an immigrant, even blessed with health, strength, some capital, and other advantages, being shewn a spot in the wilderness, on which to establish his home and whence to draw his future support —on which there is no commencement of a shelter—not a rood of it disencumbered of its brush or its timber, nor a passable road for a considerable distance by which to take in his supplies.—Must not the mind conclude that, whatever might be his hopes from \"bees\"—from kind and sympathising neighbours—indispensable, indeed, to any progress in the back-woods—he must be a very courageous or an unreflecting man, who, utterly inexperienced, would enter upon such an ordeal of patience and endurance as would then make itself conspicuously evident. If the imagination be further carried to the contemplation of the case of an immigrant just entering upon such a trial, harassed from long travel, incumbered with a large and, it may be, a sick family, then will be presented a picture that should induce a determination to assist in the adoption of any practicable means to avert the possibility of such an exigency befalling any one, whether friend or stranger. That there have been such cases, resulting ultimately in success, is not denied; but it is averred that such were far from general; that very many who have attempted such a trial have been broken down in health, or have abandoned it for avocations of more easy pursuit, though probably affording more meagre\nfinal results than were anticipated by the parties; and that if considerably more aid than a \"swamped-out\" road, amid lands at an inconvenient distance from any settlement, could be remuneratively prepared for this class of immigrants, a large amount of suffering would be averted, successful settlement in the \"bush\" would become general, and emigration from all the civilised countries of Europe would flow hither in constant and augmenting streams.\n\nIt is also further to be observed, that, in the publications that have been made of remarkable instances of success, there has been a probably-unintentional ignorance engendered as to the amount or degree of certain qualifications positively indispensable to a satisfactory result in individual cases; which requisites are but poorly expressed by the general statement that the parties so happily rewarded were necessarily sober, industrious, and frugal; nor (such are the sacrifices really indispensable) would an adequate conception of the truth be conveyed to the mind of any one accustomed to civilised usages by the substitution of the stronger terms, abstemious, hard-working, and parsimonious—qualifications, which, in the general sense in which all such are expressed, have only a relative signification; just as the fare considered as a fast by a rich man would be gratefully enjoyed as a feast by a poor man. Thus may be understood the apparent anomaly exhibited in all sections of the country: that the most utterly-indigent immigrants have risen to independence, while many who arrived and commenced their settlement with more or less capital have sunk to much lower positions in society than those to which they had been accustomed, consequent probably from no degrading or vicious propensity. The cause is obvious enough, when it is borne\nin mind that the Scotch and Irish peasantry generally (and who, especially the latter, have emigrated to this country in large numbers) have been inured from their birth to such privations as can scarcely be exceeded under any circumstances in this country, and who therefore can more readily forego the use of what would be deemed absolute necessaries by other settlers, especially when they have the prospect of ultimately, however distantly, reaping the full reward of their abstinence: thus their formerly-enforced habits of economy become so strengthened by their voluntariness as never to leave them in prosperity. But, on the other hand, those immigrants (even English paupers) who have been accustomed to consider a daily supply of beer, tea, and abundance of animal food, as indispensably necessary to the maintenance of a labouring man in health and strength, cannot but with extreme reluctance forego the use of these and probably other expensive articles, while the means last or can be procured for the indulgence of their previous habits.\n\nIt is certainly not intended, by these remarks, to disparage colonisation in this country by any class; but rather, it is believed, to promote it, by a candid admission that, even under favourable circumstances, the settler upon wild land (as in every other new country) must really make greater sacrifices than he has hitherto been led to believe necessary, as he will thereby be the better prepared to undergo them and avoid the disappointment consequent upon unfounded expectations. It has hitherto been too much the case with parties interested in peopling new countries, whether Canada, the United States, \"Frazer's River,\" Australia, or elsewhere, to paint everything regarding them with a couleur-de-rose; which, on the part of the friends of Canada, is a very mistaken policy, Mr. Lovell's medium, and practical fact, and extensive salubrious must consciously-satisfy the ties of society, and vie with the emigrants.\n\nTwo things have been already noticed in a considerable number of wild lands, easy terms in Canadian lands, that appear the settlement of the hardship, such a number of district) lots up, under certain of the conditions.\n\nThe settlers have a just intention of succeeding to dispense the necessary reasonable should\npolicy, since a reference to her statistics alone (of which Mr. Loveill's *Canada Directory* is an admirable compendium, and, at the same time, is itself an important statistical fact), showing her abundant resources, her varied and extensive means of internal communication, and her salubriousness of climate, with other \"facts and figures,\" must convince all candid enquirers that, under judiciously-established facilities to conquer the first difficulties of settlement in a new country, this Province may vie with any country as a resort for the intending emigrant.\n\nTwo slightly-different plans of colonisation have lately been adopted by the Government, which demand a brief notice in this place. In Lower Canada they are making a considerable number of roads through certain districts of wild lands, and are selling the lots thereon upon very easy terms of credit; the settlers (nearly all French Canadians) being thoroughly skilled in every matter that appertains to the clearing of land and the management of a bush-farm, and inured from their birth to the hardships and difficulties that necessarily characterise such a mode of life. In Upper Canada (in the Ottawa district) they are also making several long roads, of the lots upon which they have been making free grants under certain conditions of settlement. A large majority of the occupants are old settlers of the country.\n\nThe Author, feeling fully certain that the Government have acted throughout these measures with the best intentions towards the settlers, and that a certain degree of success has been the result, is by no means inclined to disparage what has been done; but (as belongs necessarily to his task) he feels compelled to state his reasons for the conviction that a considerable change should be made in their general system.\nIn the first place, admitting (as justified by bitter experience), that to provide an immigrant settler with a road to his location is a most important assistance, yet it is quite insufficient to counterbalance the deficiencies consequent upon his inexperience in the first necessary clearance of his land—a matter of little difficulty to those long accustomed to such work; nor indeed would it need a moment's anxious thought to any settler possessed of a large capital, who could employ the experienced labour of the country, and probably derive therefrom an almost immediate return of his outlay.\n\nFrom Reports lately furnished to the Author by the Crown Land Department, with a promptitude he avails himself of the present opportunity to thankfully acknowledge, it appears that, besides the fact that probably all the settlers on the Colonisation Roads in Eastern Canada have been during a long period of their lives accustomed to the description of exertions required of them, the Free Grant Colonisation Roads in Western Canada, specially provided to meet the requirements of immigrants, do not seem to have been made generally available for their intended object. Refraining to use any information derived from other sources than those contained in these official Reports, it may here be stated that, on the Opeongo Road, the principal in the classification to which it belongs, all the settlers are, \"with but one exception, men who were either brought up in Canada or who have lived some years in it, and are therefore thoroughly acquainted with the process of clearing and cultivating wild lands;\" and on the Hastings Road, also one of the most important of the same class, the superintendent reports, \"that a large proportion of the lots are taken up by young single men, sons of farmers residing in the country,\" and that, \"with the exception\nof a few English and Scotch families, the settlers are all old residents in the Province;\" while none of the reports in respect to the Free Grant roads make the smallest reference to the successful colonisation of immigrants—the main object of this plan of settlement: but the Minister of the Bureau of Agriculture and Statistics, in his general Report, dated 1st May, 1858, very candidly remarks that \"Experience now teaches that newly-arrived emigrants, unaccustomed to the use of the axe, and alike ignorant of the effects of our climate and the rotation of crops, have but little chance of immediate success in settling upon wild lands, unless possessed of sufficient capital to enable them to employ labourers, or pay during the first year or so for the experience which others can furnish. The newly-arrived emigrants, with but little means, should be warned of difficulties in the way of their success; and should rather be encouraged to hire out with the farmers of the country for a season or so, than to undertake farming themselves without experience.\" This is a testimony, coming from such an authority, so remarkably coincident with the Author's opinions, that he could not refrain from incorporating it with the expression of his views, both as to the inefficiency of the system and in regard to the character of that which should be adopted in substitution; and, as a further strong though indirect support to these views, he finds that Mr. Drapeau, the leader of the settlement founded by the Quebec Colonisation Society (who is described by Mr. Boutillier as not a mere theorist, but a practical man, having experienced the miseries and fatigues of the pioneer in the forest), recommends \"that 10 acres be cleared on each lot of 100 acres along the lines of road opened by Government; that a cheap house should be built on each lot; that an advance of £10\nshould be paid to each settler the first year, in order to enable him to purchase seed; and, finally, that in consideration of receiving a lot of 100 acres with the improvements mentioned and the loan of £10, he should agree to pay the Government £75, in six annual instalments; the first payment to be made on the 1st day of January following the second harvest, and to be £3 15s. only, the other payments to graduate in proportion until the seventh, which, as well as the three remaining, would be £10 4s. 4½d.\" Although this scheme is not very clear as that portion that respects the payment by annual instalments, and is open to an objection which will presently be noticed, it fully supports that now under consideration, namely, that the present system of colonisation affords an insufficient preparation to ensure a satisfactory naturalisation of our immigrant population, especially considering that Mr. Drapeau had under his immediate cognizance such an example of colonisation as seemed to have led him to the conviction that, even for settlers born and reared in the country, such extraordinary facilities as he recommends were requisite.\n\nWere it necessary, much more might be added in support of the first and principal objection; but as such would be a task of supererogation, it is desirable to proceed at once to a brief consideration of the second objection to the present system—that its leading principle, making colonisation roads in length instead of in block, entails considerable expense and future loss—in fact, a wasteful expenditure—besides, being less promotive of the work of colonisation. All past experience condemns this principle, as, for instance, that afforded in the case of the \"Craig's Road,\" made at great expense through several counties of the Eastern Townships, whereas, indeed, the grass has not only grown, but a considerable\nportion of it is characteristically covered with \"second growth.\" Some of the roads now in progress vary from 30 to even 72 miles in length; one of which, the Rivière du Désert Road, 47½ miles long (on which after the expenditure of $3740, $6000 more was estimated to be required to make it), seems to have been originated with a special view to the benefit of the lumberers; and, indeed, many of the most lengthy roads have afforded such important advantages to the commerce in lumber as to make it questionable whether \"Lumberers' Roads\" would not be a more appropriate name than that by which they are now designated.\n\nIt may be observed, en passant, that the time has arrived for a full investigation of all the circumstances affecting or resulting from the lumber business—its bearings upon the general interests of the country—to ascertain whether, in fact, we are not committing the folly, on a large scale, of the man who in eagerness of present gain sacrificed future profit, by killing his goose that laid the golden eggs. Certainly, the extensive and very wasteful manufacture of our square timber is not necessitated as a means to furnish employment, while almost all the labour we can command could be so advantageously applied to the more national object of clearing, cultivating, and peopling our extensive territory.\n\nThe making of long roads is no doubt rendered necessary in some cases, to afford convenient accessibility to distant and straggling settlements that have arisen, owing to the absence hitherto of any judicious system of colonisation; such, for instance, as the \"Chester and Ham Road,\" on which, in addition to the amount expended in 1856, more than $1500 was disbursed the following year, partly for the repairs thereon, \"which a newly-opened road constantly requires\"—a road, too, on which a comparatively\ninsignificant number of persons has settled, but which is rendered necessary to the improvement of Ham, one of the townships chosen several years ago for a Government colony, which is 24 miles distant from Danville, through which place, until very lately, it had to draw all its supplies, at an increased distance of more than 20 miles from Quebec, its proper market. The utmost extent of the objection under consideration is that, in all cases of roads required purely for colonisation—where no circumstances exist to impair the general principle which should govern their location and extent—the main object should be to encourage compactness of population; to form villages (without which no rural municipalities can work with the least advantage) as near as practicable to established settlements, to which villages should be transferred the whole charge of the maintenance and repair of the roads the Government may have made for them, and thereby render unnecessary such language as the following, to be found in the report on the St. Francis Road: \"It is needing repairs in several localities, and will soon be impassable if means are not speedily adopted for its repair\"—a description that too generally applies to long roads, and with which is naturally connected the observation very justly made by Mr. Boutillier, that \"it would certainly be found too onerous in many places where roads have been opened, for the small number of settlers as yet established to take on themselves the whole burden of making repairs without receiving any assistance,\" but, as testimony to the existence of a general neglect, or a disposition to encroach on the Government after once receiving a benefit presumptively from their hands, he further observes: \"but there are several which were opened some years ago, and for which no provision has yet been made, notwithstanding the fact that they are\nthickly settled, and which the people are quite numerous enough to keep in repair. * * * * * * * It has now become of the utmost importance, in order that the fruits of former expenditure may not be lost, to take prompt and efficacious measures for keeping in repair the roads which have been opened.”—The opportunity is here taken to express, from particular experience on this point, not only an entire concurrence with Mr. Boutillier’s complaint of the inefficacy of the present municipal system, as far as roads are concerned, but the conviction that a declaratory statute, to define fully all the rights of the public and of individuals respectively, in regard especially to new roads, is imperatively necessary.\n\nAnother objection that may be made to the present system is the adoption of a credit arrangement in the disposal of public lands—an arrangement justifiable only, perhaps, under the somewhat unsettled principles (if there have been any principle) upon which colonisation in this country has been based. When in the absence of any system sufficiently facilitative of settlement, “squatting” has been resorted to,—when immigrants have, through inexperience, chosen otherwise regular locations, under circumstances that ultimately prove so adverse as to make such locations “dear at a gift,”—and when many other circumstances obtain a fair share of reflection,—it need excite no surprise that, unless a more judicious system be adopted, long credits and free grants will continue to characterise the disposal of public lands, in order to arrest the comparative languor of Canadian colonisation. The credit arrangement, especially with the Government as the creditor, is objectionable for several reasons. In the first place, the persons likely to avail themselves of it are much too straitened in their circumstances at first, and for years after their location, to\njustify any confident hope that they generally can surmount the difficulties of their position, in order even to subsist in any comfort, much less that they can comply with the \"easy terms of credit\" to which they have agreed: besides, the incubus of a debt, however small, is frequently, while hopelessly borne, a burthen very destructive to the natural energy of a man—a quality that should particularly distinguish the new settler. Secondly, the Government (acting for the public good) cannot deem it consistent with their main policy to take such extreme measures with those thus indebted as probably would sever their connection with the country; while the chief policy of any other parties in the position of creditors is to get their \"pay\" by any means, however harsh these may be. This distinction alone, as regards creditors, is believed to be inimical to the due operation of the Government's credit arrangement. Thirdly, such a mode of disposal of the public lands implies, however erroneous the idea, that they are of so little value for direct colonisation (not jobbing) as to be unsaleable in any other way; whereas, it is believed, on the contrary, that the establishment of a judicious system of facilities and preparation of the land would attract so many cash purchasers as utterly to preclude all occasion, or even opportunity, to continue the present system.\n\nThe last objection it is intended to urge (any other, of a political character, is purposely avoided in this Essay) is, partly, that the system of free grants to individuals tends to preclude the acceptance of such grants by persons whose large means would enable them to afford to others of the same class important examples of successful settlement; but, chiefly, that it tends, in a large class of cases where it is made available, and just in proportion as the grant is really considered as a free gift—\ngratuitously conferring a substantial advantage upon the recipient—to destroy that feeling of self-dependence which is ever characteristic of a successful settler. It is not intended to be conveyed that, as yet, such a consequence is as general among the Upper Canadian free grant settlers as has been the case among other parties that have been located upon lands in this country; many of whom, having once conceived the notion that they had, somehow or other, been made the objects of the special care of others, did not fail to evince their appreciation of such beneficent intentions by increasing helplessness and by appeals for further aid. There are many, no doubt, on those free grants, imbued with such correct feeling as to be preserved from the mischievous tendency of the system, while besides it is certain that among them is a class of persons whose experience is sufficiently American to preserve their future from such a mistake—who look upon the system as a speculation on all sides, and have therefore made their calculations to participate fully in the present and future advantages it presents to men of enterprise, possessing as they do the peculiar quality of \"spryness,\" to secure the benefits that actually exist rather than to wait in anxious dependence for others that are merely contingent.*\n\n* Since the above was written the Crown Land Department has published a series of Regulations in regard to Upper Canada, the chief purport of which is the abolition of free grants to settlers. The above observations have not been expunged, because although their data are somewhat affected by this change of policy, the arguments employed by the Author expose, as he thinks, some erroneous notion, and parts of the system that remain unaffected by the change. Generally, so far from free grants to individuals having answered the intended object—the facilitation of the settlement of a new population,—he conscientiously believes that many hundreds of immigrants have experienced such unknown and therefore unappreciated difficulties in the locations they\nHowever, notwithstanding these objections (which admit of other support than has here been given), it is very gratifying to find that settlement in the \"bush,\" both in Upper and Lower Canada, has made some little progress within the last two or three years, although at a cost, it is believed, that might have been made to produce much more important results.\n\nThe problem therefore to solve is—What scheme can be devised that would meet the objections that have been urged against the existing system, and at the same time promote colonisation by a more regular and extensive naturalisation of our immigrant population than is the case at present—a solution of which is attempted in the following—\n\nOUTLINES OF A SCHEME FOR COLONISING THE PUBLIC LANDS.\n\n1. It is proposed that the Government should make free grants of the Crown Lands, contiguous to established settlements and otherwise suitable to the purposes of colonisation, to joint-stock associations, under certain guarantees to ensure actual settlement and to preclude the possibility of any portion of such free grants being subjected to the evils of monopoly or jobbing: the said grants to be in the proportion of about 30,000 acres to $15,000 capital stock subscribed by each such association within one year after their organisation and their acceptance and taking possession of the said free grant.\n\nhave made, that a free grant of their land, to be really considered as a boon, would only be a delusion: but, as a subsequent relief in any case where it was ascertained that distress had resulted from occupancy of the public lands, not from the misconduct of the settler, but from a host of difficulties only within the power of society to remove, such a grant would be a measure of compensation easy to bestow, and which might avert utter ruin from the recipient.\n2. That the capital stock of the association should be divided in the proportion of one share for every $150 thereof.\n\n3. That every association availing itself of a free grant should be incorporated and organised in conformity with a special act to be passed for the purpose, and should be bound thereby, before they execute any act of proprietorship on the lands granted to them, to submit a full and true copy of their bye-laws, for certification of conformity by an officer to be appointed by the Government, and should also be bound to submit annually a full and particular account of their affairs.\n\n4. That, for the disposal of the lands comprised in their grant, every such association should be bound to clear not less than 10 acres of the front of each front lot of 100 acres they offer for sale, besides opening a road, in continuance of a main highway through their intended settlement or of a public road in connection therewith, upon the whole front of the said lot; that each such lot of 100 acres (except as hereinafter mentioned) should not be charged at any higher price than $1.50 per acre, and that the rear 100 acres of each such lot should be reserved for two years after the sale of the front lot as a pre-emptive privilege to the settler thereon, at no higher price (if no clearing have been made on it) than 75 cents per acre.\n\n5. That such association should nevertheless be allowed, for a period of two years after the first day of occupation by the first settler, to exempt certain of their farm lots from the operation of the above restricted prices, but in no greater number than in the proportion of one for every 100 lots included in their grant; and that, if any of such reserved lots remain unsold at the end of the said period of two years, they should within one month thereafter be sold by public auction.\n6. That, unless specially authorised and directed by the expressed vote of every shareholder, the association should not be allowed to keep back from sale nor finally dispose of any lot in any other way than by actual sale, in accordance with the provisions of the statute under which they are incorporated and with their advertised terms; and in case of any person being sued in respect to any private bargain whatever on account of the purchase of any land in the settlement, he should be legally exonerated and held wholly irresponsible in such suit, on affording sufficient evidence that he was the first actual settler (originally farming and residing) on the lot or lots of land in respect to which the said suit was instituted, unless otherwise full and satisfactory evidence be given that such original occupation was in virtue of a bona fide hiring of the defendant by the proprietor of the said lot or lots. Also, should any lot or lots, over and above one front and one rear lot, remain unoccupied and uncultivated one month after such land shall have been sold and withdrawn from sale by the association, the proprietor thereof shall forfeit the sum of $5 for each such surplus lot for every month thereafter such land shall continue so unoccupied and uncultivated.\n\n7. That the association should be empowered to reserve 100 acres for the site of a village, and should be required to assign gratuitously, at various times, as the requirements of the settlement might demand, 10 acres thereof, for an academy, council-hall, market-house, &c., and should also be required to assign gratuitously, on any portion of their grant, 50 acres as a public cemetery.\n\n8. That the Government should have the ordering of the site of the village, its streets, and the roads of the settlement; which roads and streets the Government should also, (after they are opened and thoroughly cleared of the timber and brush), bridge or fill up as may be required after the settlement is thereupon completed.\n\n9. That the association should be permitted to levy the value of the land, assessed by the assessor, for one dollar per acre, nor, in case of a bona fide purchaser, for any person who has resided on the land, debt due from the owner in respect thereto, paid by the owner thereof. And that the association or individual proprietors of the land, in the said settlement, may sell, convey, mortgage, or alienate any of the said lots or portions thereof, to the association, or to any person, for such consideration as such person may agree upon.\n\n10. That the association, under the provisions hereinbefore set forth, would be permitted to make contracts with the Government concerning the improvement of the settlement, and the erection of buildings thereon.\n\n11. That the association be permitted to offer for sale, at such prices as they may determine, all the land in the settlement.\nrequisite to make them passable for summer vehicles; after which the Government should discontinue any further expenditure on account of such roads and streets.\n\n9. That the association should not be allowed to sell the village lots at higher rates than $12 per quarter-acre for one class, and $9 per quarter-acre for a second class; nor, for a period of two years after the first day of bona fide residence by the first settler, should sell to any one person more than four quarter-acre lots of such village reserves; and the same exemption in case of action for debt in regard to such village lots as hereinbefore proposed in respect to first occupiers of farm-lots should be allowed by the Court before which such suit might be brought. And, should any village lot or lots, the purchase directly or indirectly of one proprietor, remain unoccupied at the end of one month, in the case of the proprietor residing in North America, and twelve months in the case of the proprietor residing in Europe, after such lot or lots shall have been sold or withdrawn from sale by the association, such lot or lots should be subject to a forfeiture from the owner of $1 for every separate block of such lots for every month thereafter they continue so unoccupied.\n\n10. That any funds arising from forfeitures imposed under the statute or bye-laws by which the settlement would be governed, should be employed, in common with any other public funds that may accrue, by a committee or the first municipal council chosen in the settlement, for general purposes only, such as the erection of public buildings, &c.\n\n11. That the association should be required, before offering the village-lots for sale, to clear the whole of the said lots and open all the roads or streets belonging thereto.\n12. That the association should be required to make effectual arrangements, at the earliest possible opportunity, for the erection and gearing of a good and sufficient saw-mill for the use of the settlement, and for fixing at certain maximum rates the prices of every description of sawn lumber manufactured, and firewood cut, at the mill; which prices should be, to persons belonging to the settlement, no higher than would fairly remunerate the labour bestowed on the timber.\n\n13. That no shareholder, whatever the number of his shares, should be allowed more than one vote in the direction of the affairs of the association.\n\nSuggestions of principal Bye-Laws, &c., for the general Management of the Settlement.\n\n1. That, after the survey and the ordering of the village-site, and the streets and roads, shall have been received, the first business should be the appointment of a thoroughly-experienced person as Manager, and the contracts for the immediate erection of a saw-mill, completely geared with a large circular saw, planing and matching machine, and cross-cut saw; and for the underbrushing and chopping all the timber on 1150 acres—an extent presumed to include all the necessary roads and streets.\n\n2. That, immediately after the erection and gearing of the mill, and its being delivered by the contractors in complete working order, the parties who may have previously agreed to rent (or purchase) the same should be apprised thereof, and should be bound to lose no time in commencing and continuing the necessary lumber operations.\n3. That, at this stage of the general progress, the Manager should be instructed to hire experienced labourers, and to purchase such tools, etc., as may be necessary to the work these parties would have to perform—namely, first, the erecting of one or more plain and substantial sheds, for purposes that may be requisite, according to the season and other temporary circumstances; and, subsequently, as their principal employment, the splitting of the rail-timber, fencing off the streets of the village-site when cleared, storing the rails for future requirements, burning off the brush and refuse timber from the portions of land finished by the choppers, with any other work the Manager may deem to appertain to the business of the association.\n\n4. That it should be the Manager's duty to ensure the due performance of all contracts in which the association may be concerned in the settlement; to receive and duly facilitate the objects of all intending settlers; to strictly preserve the unsold cropped or pasture-lands to their legitimate uses for the time being; and, generally, while duly maintaining order and the rights and privileges of the whole, to give especial attention to the interests of the association, undoubtedly confided to his care.\n\n5. That the association should make, in duplicate, a list clearly distinguishing, by number and otherwise, every lot they offer for sale; one copy to be kept in their office, and one to be furnished to the Manager, who should be advised immediately of any sale, and instructed accordingly.\n\n6. That, on making sale of any lot or lots of lands in the settlement, the purchaser should be furnished with a statement of the improvements that may have been made on such lot or lots, which, in the case of front lots, shall\nconsist at least of 10 acres cleared on the front of each, either ready for cropping or in a state of pasture, and railed off the whole width from the road by which it is bounded, and, so far as cleared, from the adjoining lots; with also a statement of the restricted prices of lumber and firewood in the settlement, and of the rents and prices charged in respect to cleared or pasture-lands, or standing crops of hay.\n\n7. That settlers, being shareholders in the association, should be allowed the remission of 10 per cent. of the purchase-money of any land they may acquire from the association; provided that, in case of any claim of this remission by any settler for more than one lot, it should not be conceded only when the lots for which such claim is made are bona-fide occupied by him as one farm, and an extent of clearing made upon the whole equal to 10 acres at least for each lot.\n\n8. That any shareholder, on becoming a bona-fide purchaser of land from the association and an actual settler, should be allowed to have his share or shares made available, without any deduction whatever, in payment of the purchase-money; but any transfer of the whole or any portion of a shareholder's stock to another party should be chargeable with a moderate fee for the transfer of the said stock in the books of the association.\n\n[With other Bye-laws amplifying, as far as necessary, the provisions contained in the preceding proposals supposed to be regulated by statute.]\nCONDITIONS OF THE SEVERAL CONTRACTS PROPOSED TO BE MADE BY THE ASSOCIATION.\n\nFor Leasing Saw-Mill, if not disposed of by Sale.\n\nThe lessee to have use of mill complete, returning the same and its appurtenances at the expiration of his lease in perfect order, excepting necessary wear and tear; to take from the clearances (before occupation by the respective settlers), for his own use and profit, all timber left as mill-logs and for firewood, and to saw the logs as speedily as possible into the various descriptions of lumber usually required for building purposes; to sell the said lumber and cut firewood, to parties belonging to or employed in the settlement, at no higher prices than those to be agreed on between him and the association, and reserving, for the use of the settlement, in preference to any outside demand, such quantities as shall have been notified to him by the Manager on the first day of every month; and to give security for the payment of the rent agreed upon and of any other dues to the association that may arise during the period of his lease.\n\nFor Felling the Timber, &c.\n\nThe contractors should be bound to underbrush, chop all the timber, and pile the brush, on (it is presumed) 1150 acres, inclusive of roads and streets, whereon the trees would have to be cut level with the ground, as also all small trees that are not more than six inches diameter at the butt; to saw the timber fit for mill purposes (marked by the Manager) into logs of the length of 12 feet and upwards; to chop all other timber into 13 feet lengths; to execute the whole of the work before the\n1st day of April next ensuing; and to give good and sufficient security for the due performance of their contract.\n\nFor Letting Cleared or Pasture-Lands, or Selling Standing Hay, on Lots not previously sold.\n\nThe lessee or lessees of lands for cropping to be put in possession of the clearances fenced and made ready for cropping by the 10th day of May next ensuing, who are to sow with any kind of grain they may choose, provided that they sow therewith one peck of Timothy grass and one pound of Vermont clover seed per acre.—In regard to pasture-lands, lessees should hold possession from the 15th day of May until the close of the season; but no contracts for sale of standing hay need be made before the 1st day of July in any season.—In cases when the price of this crop, or the rent of the cleared or pasture-lands, were not paid previously, no crop or animals on account of which such price or rent had been incurred should be allowed, on any excuse, to be removed from the lands to which they had respectively appertained.\nEstimate of Expenditure and Receipts for the first 2½ years operations of the Association.\n\n**EXPENDITURE.**\n\nRent of office, secretary's salary, and sundry office expenses $2000  \nSurveying and laying out village and farm lots 600  \nSaw-mill, complete, with power adjusted, including a 4 ft. 6 in. circular saw, a cross-cut firewood saw, and a planing and matching machine 3000  \nUnderbrushing, chopping, &c., on 2150 acres at $9 per acre 19,350  \nSalary of General Manager, at $600 per annum 1350  \nTwo labourers, 12 months each, at $20 per month 480  \nOne common labourer, 12 months, at $12 per month 144  \nFour axes, saws, and other tools, with nails, &c., requisite for labourers' work 150  \nSawn lumber for sheds, &c. 100  \nPrinting, stationery, advertising, &c. 700  \nFire insurance on mill 120  \nSundry expenses 300  \n\n$28,294\n\n**RECEIPTS.**\n\n50 farm lots, at $150 each $7500  \n50 \" \" \" $135 \" (shareholders) 6750  \n12 quarter-acre village lots at $12 each 144  \n12 \" \" \" \" $9 \" 108  \nRent of saw-mill, 2 years, at $400 dollars per annum 800  \n\" 500 acres of pasture-land, at $1 per acre 500  \n\" 1000 \" \" cleared land for cropping, $3 per acre 3000  \nSale of standing hay on 80 acres, at $2 per acre 160  \n\n$18,962\nTo arrive at a fair conclusion as to the policy of the scheme now submitted, it is proposed, as most conducive to a thorough understanding of its merits, to consider fully the reasons which should induce the requisite action by each of the three parties—the Government (acting for the public good), the shareholders, and the settlers—upon whom alone would depend the complete success of the scheme. Taking, first, the case of the shareholders, it is to be borne in mind that the arguments for the proposed plan rest by no means on the accuracy of the items furnished as the probable expenditure and income of the association, but upon certain fundamental principles which will shortly be noticed. Those items might prove, in practice, erroneously high or low, although, in regard to the principal items, those for clearing the land and for the construction of the saw-mill, the greatest care has been taken to ensure a correct estimate—one probably exceeding the actual cost. The statement, for the period assumed, has been given with a view of furnishing an approximate idea of the pecuniary advantages that would accrue to the shareholders, as a portion at least of these would consist of a class of the community who would take stock for the sake only of obtaining thereby a profitable investment of their capital.\n\nPerhaps the only objection that a mere capitalist would entertain against the scheme is that probably the profits would not be distributed until the third year of the association's operations—that is, supposing they were to adopt the judicious principle of applying the whole of their available assets the second year in an extensive and timely improvement of their property; for cleared land, seeded down and left to pasture, improves yearly in value, because of the retention of its fertility and the decay of its small roots and stumps. But when there is\nset off against this advisable delay of a distribution of the profits the really excellent position of the general affairs at the close of the period assumed, he even, caring only for the growth of his money, should feel more than compensated by the consequently-greater value of any shares he may have taken in the association. Thus, assuming that the estimate is correct, and that only 100 farm-lots and 24 village-lots would be sold in two years, the general account summary would certainly approximate to the following statement (sinking fractions), in which the items of debt are rated, for this purpose, disadvantageously to the balance in favour of the association; and, to the same end, no account is made of the probable higher value of the lots preserved from the effect of the restricted prices,—30,000 acres being the assumed amount of the grant:\n\n| Dr.                                      | Cr.                                      |\n|------------------------------------------|------------------------------------------|\n| To estimated receipts........$18,962     | By estimated expenditure........$28,294   |\n| Value of mill and other property of the  | Balance in favour of association.........|\n| association ... 5,000                    | 20,923                                   |\n| 10,000 acres, or 100 improved           |                                          |\n| farm-lots, at $150 per lot... 15,000     |                                          |\n| 9850 acres unimproved, at 75 cts. per    |                                          |\n| acre......................7,387           |                                          |\n| 68 village-lots, at $12 each... 816       |                                          |\n| 228 \" \" $9 \" ... 2,052                   |                                          |\n\n$49,217\n\n$49,217\n\nIt might be objected, that, considering the large percentage of profits which would probably result to the association, lower rates of charge for their lands might be made to the settlers. Possibly, it should be so; or, better still, that more land should be cleared on each lot for the same amount of purchase-money: but when it is reflected that, because joint-stock companies are ever\nsubject to peculiar descriptions of loss, for the most part unforeseen, it is only reasonable to calculate for higher rates of profits to meet such contingencies than are usual in individual enterprises. Besides, this objection will lose much of its weight, when it is perceived that, in all probability, a great majority of the shareholders would consist of persons whose object in taking stock in the association would be to avail themselves of its extraordinary facilities and absence of risk to become actual settlers.\n\nIt has not been recommended that the association should, for the sake of greater profit, undertake a variety of speculations in the settlement that apparently they could assume with greater advantage than any other party, because, chiefly, the more scope that is left for individual enterprise the more rapidly would the village fill up and the whole settlement flourish, which indeed should be the main and only object of the formation of the association. It is reasonable to believe that, as the plan of settlement would afford, even to old residents in the country, superior facilities to any that have ever before existed, all the contractors, officers, and labourers, with whom the association would be concerned, would be parties whose principal aim would be to locate themselves in the settlement under such advantageous circumstances; as also that a general store—a description of business that an association of this character should ever, if possible, avoid—would be the first private and independent business, because it would be almost fully remunerative in supplying only the employees of the association, and quite so on the location of the first other settlers.\n\nOne peculiarity of the plan, treated as a source of revenue, requires to be noticed in this place. The village\nlots not sold, or let for cropping, are proposed to be seeded down for a hay-crop subject to disposal as standing hay; as it is also proposed to let, for the current season only, lands ready for cropping and pasture-lands among the unsold farm-lots; and the question naturally arises —Is it probable that revenue could be derived from this source? Perhaps little doubt will be entertained upon this point, when it is considered that, in the earlier years of the settlement, the products obtainable from these lands respectively, especially at the moderate rates of charge stated in the foregoing estimate, must be an important desideratum with settlers, who, at first, would not probably have a sufficient amount of clearing on their own lots to enable them to crop and keep stock to the extent of their ability, and that they might deem accelerative of the position they propose ultimately to achieve. Thus a new settler might, if he possess the small additional means necessary, acquire contiguously to his own lot, a reasonable amount of any description of grain crop, or keep, during summer or winter, any number or kinds of stock he may deem profitable. As not only would the interests of individuals be subserved by this feature of the scheme, but an important advantage would be secured to the whole, as it would avoid the necessitous expense that exists under other circumstances, of conveyance into the settlement of various articles of consumption, especially animal food, which would thus probably cost no more on the spot than elsewhere under the most favourable circumstances.\n\nNo arrangement has been proposed in regard to the establishment of a grist-mill, because one would not be needed until after private individuals, inclined and competent to undertake such a business in the settlement, would have time to erect the necessary plant. In respect\nto the supply of motive power, it may be observed that it would be very desirable if the grant to the association afforded sufficient water-power for the general purposes of the settlement; although for the saw-mill, it is not very material whether its machinery were driven by water or steam. Indeed, the latter might even prove more economical and otherwise preferable to the employment of the power furnished by an irregular and insufficient water privilege. If this description of power were abundant, it would be a judicious exercise of foresight to reserve sufficient not only for a grist-mill, but for a sash and door factory—a description of business which would necessarily meet an immediate and a considerable demand.\n\nBesides the parties briefly alluded to as likely to become shareholders, it is thought that many persons interested in the already established villages, contiguous to the proposed new settlements, would deem it politic thus to encourage an increase of their own neighbourhood, as thereby their properties and trades must become proportionally enhanced in value.\n\nIf it have been satisfactorily shown that the inducements to become shareholders are of the most cogent character—that there is little or no risk, and that, by a judicious management, the property of the association must increase in successive years very considerably in value, which, although not realisable by an increased price, would surely accrue by a rapid accumulation of assets,—the case of the settlers presents an equally if not a more encouraging aspect: hence the greater advantage resulting to those who, actually at a lesser charge, would assume the double position of a settler and shareholder. In fact, so many are the persons—probably thousands—in our cities and towns, who still retain the desire which was the\nstrongest motive to their emigration, that it is expected such joint-stock associations as this scheme contemplates would consist, at first, chiefly of persons resident in this country, notwithstanding the fact that the plan possesses many points of attraction to various classes of intending emigrants; such, for instance, as the monied farmer, who, owning no land at home, could hereby \"improve\" the wilderness according to his own standard of taste at a small cost and in a comparatively-brief period of time, without being necessitated, as very frequently happens with such settlers, to purchase some old worn-out or ill-planned farm—as the capitalist manufacturer, who could most advantageously avail himself of this scheme to introduce his plant and skilled artizans to a country which, owing to peculiar circumstances, presents an attractive field for almost every description of manufactures required in civilised society—as, particularly, co-operative emigration societies, who would find in such joint-stock associations the more important objects of their own organisations accomplished to their hands—and a., for instance, more than all, that numerous class among immigrants, the small capitalists, who probably, and fortunately for themselves, have been accustomed to labour. Their number, their risk of loss, and the intensity of the hope with which they emigrate—that of becoming a \"freeholder,\" which none but an old countryman can realise—demand for their case a special consideration.\n\nAllusion has been made, and testimony given, to the fact, that immigrants wander about the country in search of locations, experiencing of course much disappointment, and probably expending all their means in unprofitable travel. Two cases, out of many that have come under the Author's cognizance, bearing on this point, are so appropriate that he deems it useful to mention them.\nOne was that of a man who had been a land-steward on a nobleman's estate, and who arrived in this country a few years ago with ten in family and about £200 in money. Being hurried westward, he failed to see the Author, as particularly recommended by one of his fellow-passengers. He wrote one or two letters shortly afterwards, lamenting that he had neglected the advice that had been given, that some of his children were sick, that he was neither settled on land nor in any employment, and expressing the wish that the Author would send him some certain encouragement to return, as otherwise he feared to spend the remainder of his money in travelling back. The other was one who arrived in Montreal in 1857, in which city he lodged his family during several weeks, while he searched the country around to select such a partially-cleared farm as was purchaseable with his means (about £150, he told the Author). He, at last, had spent so much of his funds in this manner, that it became an anxious object with him to procure employment at any labour for which he was capable. As before remarked, such cases are common; and although they may be considered, by persons acquainted with the country, as so many cases of folly, it is only just to very many of those unfortunate immigrants, to ascribe their great disappointments to their equally great inexperience; for, as frequently as they may be rightly advised by the Emigrant Agent at Quebec, they are more frequently imposed on by sinister advice, sometimes to extend their travel through the country, and sometimes to locate themselves under disadvantages of which no evidence is presented until it is too late to remedy the evil.\n\nTo understand clearly how such a scheme as is here proposed would apply with advantage to these cases, let it be supposed that an intending emigrant of this class,\nappreciating the strictly-just and legal character of such joint-stock associations, and especially the unusual facilities they would afford to settlers, is induced to proceed at once to the settlement of one of these associations, whereat, let it be further supposed, he arrives with the sum of £150 sterling, or $730—just the sum frittered away in the case last mentioned. The interesting question now naturally arises—How could the disbursement of this sum, under the provisions of the scheme, tend to the sure and early realisation of the object of his emigration, presuming of course that he is possessed of the qualifications requisite to improve his new position? If he were to arrive about the 1st of May (much later or earlier somewhat necessitate a modification of his first course of proceeding), his expenditure may be assumed as follows:\n\n| Item                                                                 | Cost   |\n|----------------------------------------------------------------------|--------|\n| 1. 100 acres of land, with 10 thereof cleared for cropping           | $150   |\n| 2. House, story and a half, 25×20 ft., requiring, for completion, partitioning, plastering, cellaring, and glazing | 80     |\n| 3. 50 bushels of potatoes (20 thereof for seed), at 50 cts            | 25     |\n| 4. 8 \" barley (seed), at 75 cts                                      | 6      |\n| 5. 10 \" oats \" 50 cts                                                | 5      |\n| 6. 2 \" Timothy \" $2.50 cts                                           | 5      |\n| 7. 8 lbs. Vermont clover \" 25 cts                                    | 2      |\n| 8. Axes, hoes, grindstone, with boards, nails, &c                    | 16     |\n| 9. Hire, &c. horses and oxen, for harrowing                          | 8      |\n| 10. Occasional hire at harvesting, &c                                | 10     |\n| 11. 2 barrels of flour and 2 barrels of meal, at $64 average          | 26     |\n| 12. Groceries, pork, &c                                               | 30     |\n| 13. Barn and stable, 30×40 ft., complete, excepting stable fittings  | 150    |\n| 14. 1 cow and 1 pair of 2 year old steers                             | 65     |\n| 15. Pasture for same, 10 acres, at $1                                 | 10     |\n| 16. Spring pig                                                       | 2      |\n| 17. 10 acres of standing hay, at $2                                   | 20     |\n| 18. Stove, utensils, and a few articles of indispensable furniture    | 60     |\n\n$670\nBefore calling attention to the advance made by the settler under the supposed circumstances, it would be greatly assistant to a thorough comprehension of the subject to submit a few necessary explanations on several of the foregoing items. In regard to the 2d, it should be observed that, with the exception of the glazing, the house is presumed to be habitable with the deficiencies mentioned in the estimate, which have been proposed to be left, with a view to the probability that these might either be supplied by himself at his leisure or under his dictation resulting from his later-acquired observation and experience; and, further, that the Author believes that he is able (in a more fitting occasion occur) to suggest a much more convenient and economical mode of building wooden houses than has hitherto been adopted. In respect to the 3d, it has been proposed to crop two acres of the cleared land with potatoes, because these are almost always an excellent crop on new land, and none other, if due labour be bestowed on it, is better calculated to clean new land for any ensuing crop; otherwise, it might be equally profitable to plant one acre with potatoes and one with turnips. 4th and 5th. The other eight acres of the cleared land it is recommended to sow with grain and grass-seed: wheat may do as well as any other cereal, but it is always a more precarious crop. 13th. One thoroughly imbued with foresight, and regardless of a little inconvenience, might, for the sake of making the cellar before rather than after the raising of his house, and for other reasons, contrive to live through the early summer months in the barn, which in that case would be the first building he would raise. Here, perhaps, the inducement for such a party becoming a shareholder prior to his embarkation becomes most striking, as he would not only thereby save $15 of his capital, but also arrive at a point of interest where a suitable house could be built. 15th. If the settler had a very large quantity of wood projected for future labour, it might be unadvisable to sell his family's furniture, as it might be more convenient to use horses for transportation than to purchase advanced lumber.\n\nIt is not until the settler requires a house that it is convenient to acquire land for any purpose, and the suitors for land are a desirable class of people, just as the settler himself is a desirable person during the period when...\n$15 of the first item, but, on account of the settledness of his views, he would perceive the advantages to be derived from a timely disbursement of a portion of his intended outlay, instead of subjecting himself to inevitable hurry and hindrances consequent upon leaving all the business of his location until after his arrival. 14th and 15th. The proposed scheme presents the opportunity, at a very reasonable cost, of the use on the spot of any quantity of cleared or pasture-land, without being subjected to the necessity of performing that description of labour to which as a stranger to the country he would be unaccustomed, and of being enabled to limit or extend his farming operations, the first years, to that point he might deem most judicious according to his circumstances: if these justified a greater outlay than has been assumed, it would certainly be profitable to keep more cows or to commence with a few sheep. The idea of keeping a horse on a bush-farm should never enter into any calculations founded on economy: it is much more a luxury than a necessity that should be reserved for a more advanced stage in his progress.\n\nIt will be seen that, from the time of his commencement until after he has secured his crops, he would not be required to perform any other labour, as far as farming is concerned, than such probably as he had made some acquaintance with in the old country—none demanding any particular skill; but as the preparation for the ensuing season—clearing more land, &c.—would require a description of work which he could scarcely be expected to be competent to perform alone, he would find it judicious to apply some portion of any funds that he may have left to the hiring of sufficient assistance in chopping during the winter. It now remains to be considered what advance should, in all probability, mark such a\nsettler's position at the commencement of the second year. For the outlay he would have made, it might be presumed that he would own 100 acres of land, having eight acres in grass, and (supposing him to have prepared at least three acres during the winter) five acres cleared ready for cropping; a durable house, with a barn and stable sufficient for his requirements for several years; a cow with (if he choose) a rising calf, and a pair of three-year old steers, with which he might do all the team-work he would require; and, it may also be presumed, some of his first year's crops for future sustenance. Still, truth requires the admission that such an advance would not be made without the adoption of such strict habits of economy as would no doubt induce the party to feel that he had subjected himself to much severe privations; but in this, as there have been in similar cases, there would happily come to the settler an almost inconceivable capability of endurance, arising from the prospect of soon achieving a more easy state of circumstances and an eventual resumption of accustomed comforts, besides attaining to a less precarious position than he had ever before hoped to enjoy for his own latter days and for his children's future career.\n\nThe manner in which the proposed scheme would affect one class—those who possess no capital whatever—has not been described; nor can much be said upon this point, simply because it is believed that no one thus circumstanced should ever be advised to locate himself on wild land, not even with the inducement presented to him of a free grant or of a long credit, especially as labour generally obtains so high a price in this country, that, with strict economy, a working-man may save a sufficient sum of money in a few years to acquire a lot of land under the provisions of the scheme,\nbesides acquiring, while working for others, the important advantage of a fund of experience of more real value to him than all the money he might have saved. Thus, such a one, as have resulted in thousands of similar cases, would probably, by working partly on his own land and occasionally for neighbouring farmers, make a more rapid progress towards independence than those who have capital without his skill and experience—in fact, skilled labour is the surest capital in Canadian farming.\n\nThe extract already given from the Report of the Minister of Agriculture fully supports the opinion here expressed, that it is impolitic for immigrants without capital to commence immediate location on wild land; to which may be appropriately added in corroboration the remark very justly made by Mr. Buchanan, the Chief Agent for Emigration, in his Report for 1857. He says: \"no man who possesses health and strength, with a determination to take up such offers of employment as may be made to him, can fail to earn a good livelihood; nor, if he exercise his intelligence, within a short period, greatly to improve his condition and that of his family. Lands are open for inspection or occupation on terms that bring them within easy reach; and the labouring man who is saving cannot be long in any employment without laying-up sufficient store to enable him to become a settler and proprietor of a lot of land which in a few years may be made a valuable farm.\"\n\nAdverting again to the case of the persons in this country who would probably avail themselves of this plan to secure a real participation in its landed interests, a few striking cases out of many that have come under the cognizance of the Author may be mentioned, to show the prevalence of a strong desire among a very large\nproportion of the population now inhabiting our cities and towns, and which is constantly exhibiting itself in various ways; as, for instance, the Quebec Colonisation Society, and the many individuals who have purchased farms, but who yet, during the greater part of the year, follow avocations, many miles distant, from which they derive their entire support. Among the parties who have particularly requested the Author's attention to their wishes in this respect is one who, in a few years, made a considerable property in Montreal, which he desires wholly to exchange for a farm—the possession of which has probably been his constant hope since his first arrival in the country. Another, still holding a permanent office of moderate emolument under Government, bought a considerable quantity of wild land more than 150 miles from the sphere of his duties, which he is bringing by peculiar arrangements into a satisfactory condition as a homestead for his family. During about six years that he has owned this property he has not been able (it is believed) to spend altogether more than four days upon it. Another party, who for several years has held a permanent situation affording a very satisfactory salary, will shortly resign it, having lately bought a farm for $2000, which, although very cheap at the present time, is a price otherwise high, its increased value being chiefly consequent upon its contiguity to an important village, that has, however, been nearly fifty years growing to its present celebrity, and in the midst of which land has lately been sold as village-lots at the rate of more than $400 per acre, that, probably, thirty years ago, would sell for nothing like as many shillings—an increase of value owing, of course, to the increase and concentration of population in the neighbourhood. To such as compose this really numerous class—persons who have\nemigrated to this country with a confident expectation that they would be able with very little loss of time to settle themselves on land, but have been deterred by difficulties they had not foreseen—the scheme proposed would recommend itself with particular force; since, at a moderate outlay, and (being present in Canada) without the necessity of any hasty proceeding, they could, under its peculiar conditions, obtain possession of a large or small farm, with all its natural fertility, and without that host of difficulties that originally drove them from the pursuit of the object which attracted them to this country.\n\nIt now remains to consider the motives that should induce the requisite action on the part of the Government, which, it must be confessed, may not lead to so hopeful a conclusion as in the cases already discussed—not on account of the insufficiency of the reasons that exist for such action, but because the motives of the actors would be subject to various influences, some, it might be, of the most undesirable character. These depositaries of the public trusts should, of course, in the case supposed, be entirely unaffected by considerations promotive of private or personal advantages, which would, on the other hand, legitimately characterise the motives of the shareholders and the settlers; and, as far as they evidence that their action, in the public behalf, is neither stayed nor diverted by the several concealed interests which claim and possess a reciprocated connection with the controlling influences of the country, so far are they entitled to be sustained in their position, should they become the bond fide regenerators of Canada's welfare.\n\nThe Government have continually advertised that certain public lands are purchaseable, under conditions to secure actual settlement, at prices varying from 1s. to\n7s. 6d. per acre, according to locality, being much lower than the prices of other wild lands in the respective neighbourhoods; while, in Upper Canada, they established a free-grant system, the discontinuance of which, however, they have very recently announced under the authority of the Crown Land Commissioner. There seems certainly to have existed an expectation that a large portion of the public lands, offered on credit, would be taken by old residents in the country, and that those offered as free grants would be eagerly accepted by immigrants, which latter system, it has already been seen, has far from realised the original intention. Whatever the objects, it would appear that two courses of policy were pursued: one, applied to lands where sales at any price could be effected, intended presumptively to increase the revenue; the other, employed in localities where settlements could not be made, excepting with a bonus from the public funds to attract it, was followed solely with a view to colonisation. It would be easy, but superfluous, to establish the position that humanity and the best interests of the country demand that every encouragement should be afforded to the development of the latter course of policy, totally unimpeded by any other consideration that might be urged by a too-influential class in the country—the land monopolists and jobbers.\n\nIt is not desired to convey the impression that the present Government were the sole originators of the policy that has been condemned; nor, indeed, that any (wanting the necessary experience) should be censured for its adoption; but rather that, with respect to those lands to which they applied the free-grant system, they not only believed that the public interests were best served by a total surrender of the lands, with besides\nthe accompaniment of a considerable charge on the public funds, but that such a course was wholly sufficient to promote colonisation. However, as such remote or otherwise objectionable localities to which they applied this principle are those which the Author deems it very impolitic to attempt to settle at present, and as it is only those public lands that are contiguous to established settlements that could safely be chosen for operating his scheme, it will remain a question, with some, whether or not the appropriation of these in free grants would cause so considerable a loss of revenue as could not be compensated by the prospective advantages consequent on a more rapid increase of the population of the country. Avoiding, at present, any argument to show that there is scarcely a conceivable sacrifice too great that would accomplish such a result, an attempt will now be made to arrive at some data for determining the probable amount of the requisite sacrifice, as, if it could be proved to be comparatively small, there certainly would not remain to the Government, on pecuniary considerations, a just ground of hesitation to facilitate the establishment of such joint-stock associations as the nature of the scheme requires.\n\nThe change before mentioned as having been made in regard to the disposal of the public lands in Western Canada, with other considerations, renders inopportune any calculations as to the effect on the revenue therefrom which the operation of the plan would necessitate. In respect to the other section of the Province, on referring to the latest (1858) Report from the Crown Lands Department, it will be found that the nett amount of collections for that year in Lower Canada, on account of Crown Lands (the class of public lands that would be most likely to be affected by this plan) was $13,541.75.\nBut, as the object of the scheme necessarily admits of the supposition that the present system of colonisation would be abandoned, there should be deducted from this amount all the disbursements whatever made on account of \"Colonisation Roads,\" which have not been tabulated in the Report, precluding therefore any statement of them here that would not be liable to error. Possibly, there is actually on the whole a loss instead of a gain to the revenue. Assuming, however, the amount officially \"considered as revenue,\" $12,891.63 (which includes \"Crown Instalments\" and \"Crown Arrears of Rent\"), the relinquishment of this small amount could scarcely be deemed such a sacrifice as would induce the Government, in the absence of any other valid objection, to refuse their assent to such a scheme as that proposed. Indeed, if it be decided that the same source of revenue in Western Canada could not judiciously be relinquished—or, in other words, that the public finances would not permit of the direct relinquishment of an annual average of about $160,000 for the sake of the indirect (however great) advantages predicated of the proposed plan, it would seem that Lower Canada, under the circumstances described, presents a very favourable opportunity for testing the principles of any scheme the main object of which is to promote the settlement of the country—not so much by a mere wider diffusion of its present population as by a constantly-increasing addition to its amount, to be obtained from other sources besides Canadian nativity—in fact, from Immigration and Colonisation. This it needs, and must have, before its \"Agriculture, Manufactures, and Commerce\" can really flourish—before its Grand Trunk Railway and canals can be remunerative—and before we can begin to enjoy that real independence which we naturally expect will ultimately characterise the destiny of our country.\n\nargue that the present system of colonisation has been abandoned, and that the amount of expenditure on \"Colonisation Roads\" should be deducted from the total revenue. Possibly, there is actually a loss instead of a gain to the revenue. Assuming, however, the amount officially \"considered as revenue,\" $12,891.63 (which includes \"Crown Instalments\" and \"Crown Arrears of Rent\"), the relinquishment of this small amount could scarcely be deemed such a sacrifice as would induce the Government, in the absence of any other valid objection, to refuse their assent to such a scheme as that proposed. Indeed, if it be decided that the same source of revenue in Western Canada could not judiciously be relinquished—or, in other words, that the public finances would not permit of the direct relinquishment of an annual average of about $160,000 for the sake of the indirect (however great) advantages predicated of the proposed plan, it would seem that Lower Canada, under the circumstances described, presents a very favourable opportunity for testing the principles of any scheme the main object of which is to promote the settlement of the country—not so much by a mere wider diffusion of its present population as by a constantly-increasing addition to its amount, to be obtained from other sources besides Canadian nativity—in fact, from Immigration and Colonisation. This it needs, and must have, before its \"Agriculture, Manufactures, and Commerce\" can really flourish—before its Grand Trunk Railway and canals can be remunerative—and before we can begin to enjoy that real independence which we naturally expect will ultimately characterise the destiny of our country.\nHad not a line of the foregoing been written—not an argument adduced in favour of the scheme—a due consideration, it is believed, of the main principles which have been employed as its basis, will leave at least its chief portion intact from objection, or, in other words, must induce a general admission, that an important measure of change is imperatively required, leaving it only questionable how such a measure should be effected. For the sake of perspicuity these principles may be enumerated and explained as follows:\n\nI. The avoidance of the destruction and waste of the useful timber on wild lands now necessitated by the individualised efforts of settlers.\n\nThis is so well-known an evil as scarcely to require (merely for proof) any reference to the course of proceeding: used on the settler, of getting rid immediately, by \"a burn,\" of every description of timber, which, because of his exigent need, is really an incumbrance. Not only does he, wanting time and other requisites, content himself with a \"slash\" fence, notorious for its inadequacy and very temporary use, but (excepting the really-best timber which he wastefully employs in his log-house) he destroys probably several scores of valuable mill-logs in a few acres of clearance, which description of timber he may be afterwards necessitated to buy, beg, or may be tempted otherwise to obtain from neighbouring lots of land. Many even, after having made a general conflagration of a sugary, or of large quantities of hard or soft wood, have been compelled ultimately to take up new and perhaps distant lots to supply their wants in these respects. Perhaps, not one settler in a hundred have been able to avoid this evil at the commencement of his proceedings.\nOn the main point of this principle—the destruction and waste alleged to be prevalent under the present mode of settlement—there depends a question of great magnitude, which therefore demands a special attention. On this account, let it not be assumed merely upon the Author's assertion that such a loss exists; but, because of the vast importance involved in the consequences of the argument, let a strict enquiry be made into the justice of the allegation. It will be found that in almost all cases of settlement on wild land, even those where the parties are possessed of a moderate amount of capital, the main object in every case is the clearance, in the shortest possible time, of a sufficient extent of land to furnish by cultivation an early subsistence for the settler's family. To obtain this indispensable desideratum, the rudest hovel and a host of inconveniences are submitted to, because chiefly of the want of time to procure the usual requirements of a civilised family: to obtain this main object, in sufficiency, not only must the settler not lose the time, nor incur the expense, but he may not, according to his policy, spare the space out of his first clearance, to store properly all the valuable timber which presents itself (under these circumstances) as the one great obstacle to his subsistence—he feels that every available rod of land must be cultivated.\n\nIn anticipation of the objection that might be urged, it is admitted that some other modes are adopted in clearing land, by which settlers extract some little value from the timber of which they have to effect a riddance, such as cutting cord-wood, making \"black salts\" for ashes, and (not to neglect the mention of any, although the Author knows only of one case where it has been regularly adopted) the making of charcoal; which will be sufficiently answered by the fact that it is very seldom,\nor never, that either of these modes is used in the first clearances made by immigrant settlers, because always in such cases there are necessarily required, besides a certain amount of experience, a considerable previous occupation of the land, and a greater outlay for oxen, provisions, &c., than the value to be immediately realised would remunerate, especially if help have to be hired, as one man alone, however experienced, would be very inadequate to make his work profitable in either case; and it will be remembered that the proposition enunciated applies only to the first clearance made by the settler—to what is well understood as his original settlement upon his location; although, were it not thus beside the question, it could be shown that by either of these modes he would extract less value from the timber than has here been maintained to be practicable under systematic arrangements.\n\nAssuming, then, that this waste of property really exists to some extent, the question becomes interesting as to its amount in the aggregate. Probably, were it hard-wood land that was subjected to this loss, the utmost value of its timber would not be realised, under the provisions of the scheme proposed, as would be the case with the timber of what is called \"black-timbered\" land; still, at its least practicable value under the scheme, the loss will be found to be considerable. Supposing that 40 cords of firewood, on the average, can be cut from an acre of wild land, and that in localities where its marketable price would be $2 per cord, the cost of cutting and carriage would be $1.75 cts., there would result an irreparable loss of $10 per acre: * this is esti-\n\n* It is necessary to remark here, that these calculations are based on the supposition that this work is performed, as usual, wholly by manual labour, and which is the worst paid for of any on which the labourer\nmating the sacrifice marketably; but the ultimate loss to\nthe settler is really very much greater where, as have\nsometimes happened, he has finally been compelled to\ntake up a new lot of land to supply his house with fuel,\nan article which he had been compelled originally to\nlavishly destroy. In the case of clearance of soft-wood\nland, which bears the timber requisite for building pur-\nposes, the loss individually and nationally is immense.\nIn almost all cases the sacrifice (but in a different way)\nhas commenced before the settler reaches the land, in\nconsequence of the lumber operations, from which\nforeigners, not Canadians, derive the greatest benefit.\nOur pine is almost all gone from the accessible districts;\nour spruce is so fast going the same way that, according\nto the reports of some of the superintendents of the new\nColonisation Roads, an insufficiency is left for the purposes\nof settlement; our hemlock (intrinsically a very useful\ntimber) still remains with us in great abundance, because\nits price abroad has not yet reached an amount to attract\nthe lumberers to manufacture it for market, although it\nis said that some lumber of this description obtains a\nprice at present in some parts of the neighbouring States\nfully as high as sawn pine used to be in Canada. Ad-\nmitting that there is now no pine on the Crown Lands\nthat are convenient for colonisation, but that a fair pro-\nportion of spruce still remains, fully adequate to the\npurposes of settlement, this might reasonably be expect-\n\ncan be employed in this country. Firewood constitutes really a very\nlarge item in the internal trade of the country, and machinery should\nbe employed as extensively as possible in its production, which is partly\nthe case at present to satisfy railway demands. Hence the proposal\nthat has been made to furnish, as a portion of the gearing of the mill\nrecommended in this plan, a horizontal saw to cut logs into stove-\nlengths of firewood, as being a method best calculated to promote\neconomy and convenience.\ned to amount to such a quantity per acre as would furnish at least about 5000 feet of lumber, worth on the average when sawn $5 per 1000; making the sacrifice, by the settler's first \"bonfires\" (without estimating the loss of hemlock mill-logs, rail-timber, &c.) $25 per acre. But as the object of this argument is not to establish arbitrarily the amount of this loss, but to prove its existence to such an extent as to constitute a very serious national sacrifice, let it be assumed that useful timber of the value only of $5 per acre is thus wasted, and that it is suffered in the proportion of 10 acres upon every 100 subjected to settlement, we shall find, excluding from the calculation all other wild lands but those offered as \"now disposable\" of the Crown Lands' class, which amount, by the last Report of the Crown Land Commissioner, to 6,345,263 acres, that there would be sacrificed $3,172,630 in this waste of a valuable product that has been, as it were, providentially furnished to hand for the purpose of filling these wildernesses of the earth with their appropriate and destined inhabitants. Nay, let any, the smallest probable amount of loss be assumed as the result of the present laissez-faire system of settlement, there must still result a conviction in every unbiassed mind that the national loss annually incurred must be sufficiently considerable to demand a change to a more rational course of proceeding.\n\nII. The utmost possible economical results to each settler, from a timely preparation, and from the substitution of a thoroughly-digested and general system of settlement for the present isolated efforts of inexperienced individuals.\n\nWere it only a question, whether settlers, the best fitted by experience and every other requisite qualification, would the more satisfactorily obtain their object\nby adopting the principle of complete individualisation or that of comprehensive systemation, the latter would undoubtedly obtain general preference. Then, how much more preferable must this course be for the settlement of such inexperienced parties as compose our immigration! The log-house and barn necessitated under present conditions may not altogether require as much labour for their completion as the framed house and barn (always an object of ambition), easily obtainable under a proper system, but they are incomparably less convenient and durable, and consequently really less economical. The sawn lumber required in the one case, probably to be obtained only at a considerable distance, must cost much more, either in labour or money, than if obtained on the spot at certain fixed cheap rates. The other supplies indispensably needed are obtained, in the case where no general system has been adopted, only at very high charges, while under the scheme suggested, such complete arrangements would exist as would reduce such supplies to the lowest possible price, and with ample means (considering the peculiar advantages derivable from the previously-cleared lands) to supply from the settlement itself, in the shortest convenient period, many of the most important articles of food required by the settler. But it needs not to proceed further in such contrasts than to notice one, the most decisive as to the policy of the fundamental principle now under consideration. That a settler located on land to which there is no road is immeasurably worse circumstanced than one who enjoys a good and legal ingress and egress of his farm cannot be better known than by the Author, as his hardships in this respect have furnished him with his bitterest experiences.—Utterly inconceivable have been the losses he has suffered in various ways, the sickness,\nthe difficulties, and even the dangers to which himself and family have been subjected during sixteen years that (without any legal road) they have had to make their way in and out, excepting as pedestrians, through almost impassable obstacles—the truly-difficult way by which only a dying wife and mother could be conveyed to pass her last days amid the cherished scenes and ties of a Home, endeared even by its troubles, only very soon to be returned thereby to another but a final Home, never more to suffer the disappointments and griefs that too often but very wrongfully appertain to a residence in the Canadian wilderness.—The most advantageous location, as regards soil and other natural conditions, is reduced to a worse than worthless possession, where its communication with established settlements is scarcely practicable.\n\nIII. The almost immediate establishment of a populous neighbourhood, that, under existing circumstances, would require many years to effect.\n\nThe advantages, direct and indirect, to be derived from the operation of this principle are of the greatest importance, as every one's experience in this country must abundantly confirm; and which are therefore here presented as constituting one of the strongest inducements to the adoption of the scheme. A settlement so systematised as to attract the establishment, at once, of a village and its suburbs, affords to its occupants, in the variety of their avocations and pursuits, all that train of advantages which distinguish the populous and older-established villages and towns from the straggling settlements that now obscurely dot our wildernesses, marking a difference so plain in all the characteristics as to need no description. The near vicinity of a post-office, store, mills, a smith, a shoemaker, &c., is not only directly\neconomical to the settler, but is indirectly so in the saving of considerable labour and time, and in the establishment, to some extent, of a convenient market of exchange.\n\nBut there is a wider aspect in which this portion of the subject may be viewed for corroboration of the argument. Were Canada mulcted in its extent of the Hudson's Bay Territory, or were a hundred million acres of remoter wilderness added to it, the value of its occupied parts would remain precisely the same, unless indeed its already sparse population were to be further attenuated by diffusing any portion of it over the surrounding wildernesses, when such value must be proportionally decreased. Were, for instance, the same amount of wealth created and marketed, with the same amount of population, in Montreal, if occupying only half its present area, the whole value of its present real property would attach to its diminished extent, and vice versa. So, a new settlement, with a population of 1000 souls, concentrated in an area of five miles square, would enjoy a value in its property more than would belong to it if straggled over a length of 20 or 30 miles.\n\nAn appeal may here be made to that influential party who are strenuously exerting themselves to procure a protection or rather an establishment of Canadian manufactures, by the imposition of a duty on those of foreign production, to give the question a serious consideration, whether not only a considerable augmentation of the population of the country, but also its concentration, would not be the main and natural promoters of their cause. Should the agriculturists, as might be expected under a fostering system of colonisation, so preponderate as to glut the country with their produce, the utmost limit of cheapness of such commodities would be reached,\nand the ultimate effect would be twofold: the over-production would be arrested, driving new capital, skill, and labour into (chiefly) the production of manufactures, for which an important home market had already been created. So, also, might the Grand Trunk Railway interest (with which the country is so intimately concerned) consider seriously whether the like influences, believed to be favourable to the establishment of Canadian manufactures, would not aid them more pecuniarily than they have seemed by their policy to comprehend—whether a constant, remunerative, and an unfrangible way traffic would not (all things considered) operate more advantageously on their balance-sheet than an uncertain through traffic, to secure which from precariousness they must, at considerable expense, continually contend with other similar interests, now existing or in embryo, to present a line of travel between distant termini that the uncertain public may be induced to favour. It is by no means intended to disparage every measure they adopt for obtaining a remunerative through traffic; but rather, that they should not make the achievement of this desideratum an exclusive policy; and that they should fully appreciate the fact, that a large way traffic, necessitated by an increased Canadian population, would be itself the surest promoter of that which was the main intention of the construction of the Grand Trunk Railway.\n\nThe three main principles above enunciated are submitted as establishing undeniably the proposition that a radical change is urgently needed in our system of colonisation. The following are suggested as fundamentally appertaining to such a change—as those most desirable for the present requirements and circumstances of the country for effecting a new system of settlement, the necessity of which it is presumed all will admit.\nIV. The practical enlistment of the sympathy, interest, and patriotism of the people, which have at present no opportunity for useful exertion in the work of colonisation.\n\nIt is here felt, and might be urged as justification of the plan of joint-stock association, that no Government of a country should undertake any description of public enterprise or speculation that is clearly within the province and ability of the people to accomplish. The most that belongs to a Government to do in such a case is to provide legislative facilities; but, in a new country, it is frequently requisite that they should afford, besides, pecuniary or other aid, in initiation or continuance of a public improvement, which it would be very imprudent in an individual, or even a joint-stock company to incur the risk of undertaking. Therefore, with some, it might be a question, in regard to any scheme deemed capable of operating the change shown above to be necessary, whether it should be left wholly to the Government to effect, or such measures should be enacted as would leave this important work to be accomplished chiefly by the people. At present, the whole business of colonisation depends, more or less, and not very definitely, on the official duties appertaining to the Emigration Department, the Bureau of Agriculture and Statistics, and the Crown Land Department; and however the gentlemen in management of these Departments may be disposed, from patriotic motives, to give their hearts as well as hands to this work, the mere circumstance of the official routine to which they are subjected, unassisted by any general cooperation on the part of the public, is calculated to substitute on their part an apathetic performance of their duties for that hearty zeal which would result from a system intended to afford them and the public a fuller scope for action in this behalf. It is believed that all classes in the\ncountry would, were the opportunity afforded, work with a sympathy in this cause: hence the suggestion that legislative facilities should be provided for the formation of such joint-stock companies as have been projected in this scheme, in which shares might be obtained at a very moderate cost, and from which profit might reasonably be expected to accrue, while loss would seem to be impossible.\n\nV. The increased estimation that would be accorded to Canada as a new Home for intending emigrants.\n\nThis must unquestionably follow were such extraordinary facilities for settlement as the scheme provides offered to the nations of Europe—facilities so attractive as would induce many residents in Canada, and even thousands in the United States (who had made a mere highway of this country), to assist in peopling our wildernesses. There is virtually in Europe a competition among the parties who are respectively interested in the new countries that desiderate the bone and sinew, as well as capital, which peculiar circumstances make abundant there, and upon which newer countries depend for prosperity and ultimate independence; and, as before observed, Canada, were her real statistics of progress known, and especially were there presented to the intending emigrant the opportunity of successful settlement which a liberal scheme of colonisation would afford, might not only vie with any other country seeking the same object, but she would attain to the highest eminence of fame as a resort for the industrious, the enterprising, and the intelligent citizens of the world.\n\nVI. The encouragement of an influential class of settlers on wild land, who hitherto, have been indirectly discouraged.\n\nA due attention to this principle necessarily induces\nthe consideration of the fact that our wild lands are generally occupied by the indigent or by persons possessing but very limited means. The constant advertisement that has been made that such lands are obtainable at an easy credit or as free grants favour the supposition that their occupation by large capitalists, from the vast difficulties that attach to it, is never to be expected; thus leaving their natural place to be filled by those whose straitened circumstances must necessarily tend to exhibit results that apparently confirm this erroneous idea. That it is really erroneous, let the case be supposed of a person possessing the sum of $1000 sterling, determining to settle under the provisions of the scheme submitted; and it will be found, by calculations based upon the data already given, that such a one might acquire an estate of at least 200 acres in extent, with a good house and outbuildings, 60 acres of his land cleared (the first crop from which would probably be fully equivalent in value to the labour expended on it), leaving a reserve fund of about $700 of his original capital, and the whole achieved without the necessity of any labour from himself.\n\nBecause the Author is cognizant of the fact that some gentlemen possessing abundant capital—(one who made him a call a few months since, owning a considerable yearly income, expressed a particular wish to select a desirable location on wild land that he could improve to his own taste)—he submits the following estimate of outlay, not by any means as exact, but as a sufficiently close approximation to the actual expenditure that would be needed in the case already supposed. One reason that obviously precludes any exactness of estimate is that it applies to parties whose means enable them to exercise a latitude in their views and modes of effecting their object that is utterly denied in other cases. Thus,\nin regard to the first item, the erection of a house—a very good one has been completed in the Author's neighbourhood for $832, and which may be briefly described as a story-and-a-half dwelling, containing eight rooms, with a verandah in front; and including, under the same cost, a shed and horse-stable; while, not half a mile from it, one is in course of construction that is estimated to cost $2800. This will be two stories and a half high, containing fifteen rooms besides closets, with a verandah on three sides; the whole area covered being 33 feet by 60 feet: and another, also of a superior character, is nearly completed at about half a mile's distance from the latter, the erection and finishing of which (exclusive of painting) is contracted to be completed for $2500. The like variety may be assumed in vehicles, furniture, and other matters that have been itemed in the following estimate, which is submitted as applicable to an original capital of £1000 sterling, or (sinking fractions) $4866:\n\n| Item                                      | Cost   |\n|-------------------------------------------|--------|\n| One front and one back lot                | $225   |\n| House, with shed attached                 | 1000   |\n| Barn and stables                          | 400    |\n| Carriage-house, &c.                       | 80     |\n| Clearing 50 acres of land and fencing     | 400    |\n| Four cows                                 | 120    |\n| Two spring pigs                           | 4      |\n| Yoke of oxen                              | 100    |\n| Horse                                     | 80     |\n| Harness, &c.                              | 30     |\n| Ox-cart and horse-cart                    | 120    |\n| Waggon and sleigh                         | 100    |\n| Hire of man for a year                    | 120    |\n| \" supernumerary labour                    | 50     |\n| \" servant-girl for a year                 | 40     |\n| Implements, tools, &c.                    | 250    |\n| 20 acres of standing hay                  | 40     |\n| Provisions for house                      | 500    |\n| Furniture (plain and useful only)         | 400    |\n| Sundry expenses                           | 100    |\n\nTotal: $4159\n\nLeaving a reserve fund of $707\n\n$4866\nThe amount placed against each item is believed to be (at least in Eastern Canada) fully as high as would be actually required; and it may be explained, that one thoroughly acquainted with the modes and other circumstances peculiar to the country would probably effect a saving in nearly every item.\n\nIn conclusion, it is earnestly requested of the Government and People of Canada, that they would give a due and unbiassed consideration to, at least, the principles here enunciated, and therefrom determine the policy and practicability of adopting them as the basis of some scheme that shall safely, and with the least impediment, work out the destiny of this fine country—not a mere cursory consideration, as if to pass off the humour of a day, but one conscientiously directed to ascertain the right course, and to pursue that vigorously through all obstacles to its perfect accomplishment. To the question of the policy of such a scheme belongs necessarily the idea of its perfect adaptibility of the existing circumstances of the country to its object; to that of its practicability must appertain the consideration of the means at command for fully effecting it: thus necessitating a thorough knowledge of the principles upon the operation of which alone, as a sound foundation, a system of colonisation can be successfully effectuated.\n\nThis subject—the colonisation of the country—is our main question of political economy, which, amidst party distractions, has been suffered to be treated only in experiments with apparently no basis of principles: no legislator (out of the Government) has evinced as much interest in it as to make it his study and business; the Press only occasionally refers to it, according as accident or extraneous circumstances stimulate it; the people,\nhaving no opportunity whatever to exert its really powerful influence in this important matter, wait long enough for an invitation of their co-operation to learn that truly \"what is everybody's business becomes (practically) nobody's;\" and the Government, with the Departments appropriate to this business, perform their duty certainly, and probably to the utmost extent, *as far as they believe*, of the general desire; but, lacking the countenance and support—the stimulus—of a public opinion hereon, they perhaps naturally refrain from presenting any comprehensive measure of reform, which the more comprehensive it might be, the more its liability to be made a weapon with which to assail them—an observation applicable at all times, whatever \"party\" is in opposition or power.\n\nIt is therefore incumbent on all who really feel interested in this subject to avail themselves of every opportunity to encourage, by their various influences, any efforts in the right direction the Government or Parliament may be induced to make; and that all may be brought to comprehend their vital policy in this matter, let each apply the main question to himself, according to the class of the community to which he belongs; whether, for instance, if even he be an agriculturist, a considerable increase of the population would not favour and expedite the permanent establishment of other classes who would make for him a *home* market—one superior to that to which otherwise he must submit; or, if a manufacturer, whether a large augmentation of the number of his customers at home would not enable him to place his plant on such a footing, by means of the most approved machinery and the employment of the most skilful artizans, as to compete successfully with the foreigner; or, if a merchant or forwarder, whether a\nsparse or an abundant population in his own country, would furnish him with the greater amount of business; or, particularly, if a publisher, he can ever hope to obtain his peculiar pabulum of support without, in these times, a very extensive reading public, upon which wholly depends the establishment of a Canadian literature; and let all consider that, especially with our assumptions of greatness in national affairs that must now be sustained, an increase of population by mere nativity, aided by such small amounts of colonisation from immigration as scarcely to be evidenced but in decennial censuses, is very much too slow a process to achieve the desired consummation.\n\nIt may be retorted: \"This reason is all supererogatory. We have long desired to settle as fast as possible the vacant territories of our country; to which end, could we do more than has been done to attract emigration to our shores?\" Yes, more could be done—much more—by removing difficulties and affording sufficient facilities for a general and permanent colonisation.—Surely it cannot be, as might be feared, that our influential men have greater personal stakes in the Western States than in Canada, since indeed they have endeavoured to \"attract emigration\" to Canada, avowedly as the best means of reaching the foreign country; whereas, if they had adopted measures to encourage colonisation in Canada, the success of this would have secured emigration, probably from a western as well as an eastern quarter of the world. What, supposing no merchantable value were made of the vast quantities of timber now erroneously understood to be a permanent obstacle to settlement; and were Canada able to make the sacrifice (only here assumed for the sake of argument) of offering for the acceptance by every emigrant of a\nlot of land, on which there was a clearance of 10 acres ready for cropping—what, it is asked, must be the certain results, but an immense amount of immigration to remain with us, and to increase the national wealth by an incalculably large amount, and so indirectly repay in a short time all the sacrifice she would have made. But Canada cannot do this, especially at present, nor, for other reasons already given, is it wise or necessary to attempt such a sacrifice; yet still it would be highly judicious, that she should do all in her power in the direction of such a policy as shall obtain for her the accomplishment of any portion of so glorious a result as all ardently hope for. Let her in all prudence and foresight view her vast forests as a means of future greatness rather than as an opportunity to supply an unfruitful expenditure, and in so doing arrest the evil that, besides diminishing our immigration, may possibly proceed so far as to decrease even our increase of population from nativity.\n\nAlthough, for our own self-government, our laws and constitution have been made to assimilate as nearly as practicable to those of Great Britain, yet we present, in the working of them, all the contrast that might reasonably be expected to exist between an old and a new country. Here, generally, Conservatism (using this term in its well-known political sense) is an injudicious principle, because we have no old-established institutions (excepting monarchy) that could possibly be affected with danger, while effecting our political reforms; no \"landed interest\" that is not in its influential phase anti-national—no aristocracy—no army—no navy—no church that can pretend to an exclusive alliance with the state: there, the thorough incorporation of such institutions with the whole machinery of the constitution renders Conservatism indispensably necessary, not for the purpose\nof a permanent retention of such portions of the political machine as have become unsuited to their intended purposes, but as a natural counterpoise to the equally necessary principle of Radicalism, which otherwise would anarchically destroy instead of repair the complicated system called the constitution. There, also, all great measures of reform have long to be vehemently agitated and urged from without the Government arena in order to obtain their achievement; while here, owing to a vast amount of heterogeneousness in a very sparse and diffused population, the necessary pressure to achieve any large measure of national reform or progress might reasonably be expected to proceed from within the Government and Parliamentary circles. But may it not be hoped, in regard to the important subject here very sincerely though feebly brought before the public, that, affecting neither party, race, class, nor creed injuriously, all will aid in such a general expression as will encourage the Government and Legislature to initiate a wise, prompt, and permanent action. As to whether this action would lead to the adoption of his views, the Author really feels but little anxiety, compared with his earnest hope for some action necessarily leading to the adoption of a system based on sound principles of political economy, and particularly on principles applicable to the present circumstances of Canada. That which he most especially hopes, in regard to his attempt at a system, is that it may be spared a profitless criticism of its language or style that would leave its matter uninvestigated. He hopes for a full and candid examination of the whole subject, feeling convinced that this would be productive of incalculable benefit to Canada, a country he has made his home; in regard to which therefore, notwithstanding his own trials in it, he is in duty bound\nto add his humble mite (be it only the excitement of enquiry) towards rendering it more prosperous to all who now are or may become its citizens—a duty rendered the more incumbent by the fact that his own offspring must naturally have their due share in this object of his hopes.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_18729.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 74, "total-input-tokens": 113916, "total-output-tokens": 28388, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 3094, 3], [3094, 5577, 4], [5577, 5999, 5], [5999, 5999, 6], [5999, 6407, 7], [6407, 6407, 8], [6407, 7839, 9], [7839, 9800, 10], [9800, 11506, 11], [11506, 11640, 12], [11640, 13060, 13], [13060, 14890, 14], [14890, 16790, 15], [16790, 18667, 16], [18667, 20473, 17], [20473, 22767, 18], [22767, 24578, 19], [24578, 26433, 20], [26433, 28306, 21], [28306, 30175, 22], [30175, 32015, 23], [32015, 33905, 24], [33905, 35786, 25], [35786, 37674, 26], [37674, 39749, 27], [39749, 41580, 28], [41580, 43423, 29], [43423, 46306, 30], [46306, 48083, 31], [48083, 49633, 32], [49633, 51408, 33], [51408, 52884, 34], [52884, 54488, 35], [54488, 55520, 36], [55520, 56743, 37], [56743, 58620, 38], [58620, 60857, 39], [60857, 62670, 40], [62670, 64535, 41], [64535, 66356, 42], [66356, 68242, 43], [68242, 70093, 44], [70093, 72644, 45], [72644, 75077, 46], [75077, 76929, 47], [76929, 78771, 48], [78771, 80556, 49], [80556, 82436, 50], [82436, 84286, 51], [84286, 86098, 52], [86098, 87941, 53], [87941, 91504, 54], [91504, 93238, 55], [93238, 95119, 56], [95119, 97011, 57], [97011, 99036, 58], [99036, 100868, 59], [100868, 102728, 60], [102728, 104544, 61], [104544, 106350, 62], [106350, 108207, 63], [108207, 110122, 64], [110122, 111877, 65], [111877, 113771, 66], [113771, 116045, 67], [116045, 117832, 68], [117832, 119641, 69], [119641, 121440, 70], [121440, 123331, 71], [123331, 125199, 72], [125199, 125479, 73], [125479, 125479, 74]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]