[{"id": "8f6bc07eba60016524626708a9b3d31bc45f10c7", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X 34X 38X 42X 46X 50X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol \\(\\rightarrow\\) (meaning \"CONTINUED\"), or the symbol \\(\\nabla\\) (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n\\[\n\\begin{array}{ccc}\n1 & 2 & 3 \\\\\n4 & 5 & 6 \\\\\n\\end{array}\n\\]\nA PRAIRIE TRAGEDY:\n\nThe Fate of Thomas Simpson,\nThe Arctic Explorer.\n\nRead before the Historical and Scientific Society of Manitoba.\n(Transaction No. 26.)\n\nBY\n\nAlex. McArthur,\nEx-President.\n\nWINNIPEG.\n\nG. C. Mortimore, Publisher,\n\n1887.\nThe\n\nDecember paper.\n\naltogether brilliant that it\n\nverdigris which\n\nwhich here\n\nabout\n\ntwilight unbraced day-spring night-horse\nA TRAGEDY OF THE PLAINS.\n\nTHE FATE OF THOMAS SIMPSON,\nTHE ARCTIC EXPLORER.\n\nAt a meeting of the Historical Society, on the evening of 23rd December, 1886, Mr. Alex. McArthur read the following interesting paper on the above subject.\n\nCHAPTER I.\n\nThe story I have undertaken to tell you to-night, although not altogether of a pleasant character, is deeply interesting. It is a tale of brilliant achievement ending in sadness and neglect. I have long felt that it was due to the memory of Thomas Simpson that the circumstances under which he met his death should be re-considered and a verdict rendered in accordance with the truth. I know of no task which comes so appropriately within the scope of this society. A resident of Fort Garry, it was from here he set out on the explorations which he so successfully conducted in the Arctic Seas, and it was from here he set out on that other journey which ended so soon and so tragically—and it is here his remains found rest.\n\nLet me take you for a moment to the scene of that tragedy. It is about three days journey to the south of us, on the wide plains now forming the eastern part of Dakota, and the time is day-set—that long twilight which near the summer solstice lingers longest of all on the unbroken horizon of the prairie and almost merges in the equally long day-spring. A party of five travelers are arranging their camp for the night. All the accessories of prairie travel surround them. Their horses are grazing near by, and a cart for the outfit occupies the cen-\ntre of the camp. All are armed with guns and pistols, for the Sioux are on the warpath. But within themselves are elements more dangerous than the tomahawk of the savages; for but two of the five ever leave that spot again; for three it was their last camping ground.\n\nOf what happened that fearful night but one of the two survivors has ever told us. He was with the others pitching the tent when he heard the report of a gun. On turning round he saw Simpson shoot, first John Bird and then Antonie Legros, senior. Bird fell dead; Legros had time to give his son a last embrace. According to the witness, Simpson then spoke for the first time, asking if the witness knew of any plot to rob him of his papers, to which a negative reply was given. He was told then that his life was safe, in which assurance he placed little confidence, for he took horse and fled, accompanied by Legros' son, leaving Simpson alone with the dead. Of Simpson this was the last seen alive. Next morning there happened a sequel to the tragedy, and the traveller's dead body was found lying beside the others. But before enquiring into these events it will interest you to know something of Simpson's story up to this time. To bring my paper within the limits of space and time usually accorded such productions, I must pass over many interesting incidents of a university career, as well as those more thrilling chapters of accidents and escapes attendant on Arctic exploration.\n\nCHAPTER II.\n\nThomas Simpson was born in the Highlands of Scotland, his father being parish school master in the town of Dingwall, and for a long time its chief magistrate. At an early age the lad was sent to Aberdeen University, where he carried everything before him, finishing his course by gaining the highest prize in the gift of the Senate—this not in one branch of learning, but for excellence in all. Thomas Carlyle has made us all familiar with the economy of a Scottish University, and it will not surprise any one to learn that the highest expense for any one year was under £30 sterling, or $146. Disliking the medical profession and fearing his own qualifications for the ministry, he was for some time considering what course he should pursue when fortune tempted him to try the service of the Hudson's Bay Company. His cousin, afterwards Sir George Simpson, was then governor of the company's territories, and repeated offers of a position decided the brilliant student to embark in the fur trade. In consideration of his attainments and age three of the five years of apprenticeship were remitted and he began work as secretary to the governor. With him he travelled from post to post for some time, until he settled down as accountant at Fort Garry.\n\nThe company, besides its charter, had a license to trade beyond its own territories, and the period for which the Imperial Government\ngranted that license was about expiring. In order to strengthen their hands when applying for a renewal, the authorities of the company decided to spend some money in exploring the Arctic coast, and young Simpson was asked to undertake this arduous work.\n\nFor the first time in his life he had something before him suitable to his energetic, ambitious nature. The desk and its degrading drudgery was to be left behind, and he was to enter a field on which so many of Britain's sons had won distinction. He was to find scope for those faculties which enabled him at the university to lead hundreds of his fellow students. He would now have an opportunity of measuring himself with the Parrys and Franklins of Arctic fame.\n\nWe are all so familiar with the story of Arctic research that it is needless to go over the ground again. I will tell you very briefly what our traveller set out to do and what he did.\n\nIt is just half a century ago that the plan of this exploration was settled. At that time large portions of the northern coast of our continent were unexplored. England's best sailors, the Cooks, Beecheys, Parrys, Franklins, Rosses, and many others all tried and all failed to follow the coast from the Atlantic to the Pacific. The northwest passage remained undiscovered. The Mackenzie River, you know, flows into the Arctic Ocean and divides the northern coast into about equal parts. From its mouth westward Franklin and Richardson explored the coast as far as Point Turn Again. Admiral Beechey from Belring Straits reached Point Barrow; between those two points the shore was unexplored. Simpson's first duty was to trace and define this unknown territory.\n\nIf you look again at the mouth of the McKenzie and carry the eye eastward to the mouth of the Coppermine you cover ground already in 1836 explored and laid down on the maps of that time. Exploration from the Atlantic showed a defined coast line to within seven degrees of Back's Great Fish River. It was to devolve upon Simpson to explore the intervening gap. The distance covered by the Gulf of Boothia and by Boothia Felix itself, but supposed erroneously to be open water, also remained to be explored, but this was not included in Simpson's first instructions. The important duty was laid upon him of completing the discovery of the northern coast of America. In accomplishing this it was then generally supposed he would discover the long looked for northwest passage. All that was expected of him he did. He left Fort Garry in the winter of '36-'37, and travelled on foot the whole way to Lake Athabasca, over 1200 miles. Here he found Mr. Dease, a chief factor, who was nominally the head of the expedition. The winter was passed here, and next spring the party descended the McKenzie in open boats, coasted along westwardly until they reached Franklin's furthest and entered on the work proper of the expedition. From here a successful journey was made to within a short distance of Point Barrow when further progress was barred by ice. Taking a few\nmen with him and a small oiled canvas canoe for crossing streams, he set out on foot for his westerly destination. A deep inlet running south as far as the eye could reach, again arrested his progress, but fortunately some Eskimo were met with and a woman's boat (Oomiak) borrowed, in which Simpson, taking three or four men, after a tortuous course made Point Barrow, and our traveller had joined the coast from the McKenzie to the Pacific. Returning in the short Arctic summer of six weeks, the party reached a spot on Great Bear Lake selected as winter headquarters.\n\nCHAPTER III.\n\nIn the spring of '38, the expedition again started for the coast, this time crossing overland to the Coppermine River and descending that impetuous stream to its mouth. To their intense disappointment they found the coast ice bound, and after attempts in various ways to make headway the season closed and they returned moodily to winter quarters. In the following spring, that of 1839, they were more fortunate. The sea was comparatively open, and Back's River safely reached. As in the former case it devolved upon Simpson to complete the journey, which he did on foot. The expedition returned by way of the Coppermine and Great Bear Lake to the McKenzie, and here Simpson wrote a narrative of the expedition while waiting for the freezing up of that river. On the 2nd December he left Fort Simpson with dogs and reached Fort Garry on the 1st February, a distance of 1910 miles in sixty-one days, many of which were spent in enforced delays at the company's forts on the way. Simpson travelled most of the way if not all on foot. He was deeply disappointed on his arrival here to find no letters from the company in London. He had offered to go out again to lead an expedition to complete the seven degrees of unexplored coast from Back's River east, but no reply reached him. The company had accepted his offer and wrote to that effect, but Sir George Simpson took measures which resulted in its never reaching its destination. The same mail contained other news of interest to him, but which it was his fate never to know. On the receipt of the intelligence of the success which attended his first year's work, the Royal Geographical Society awarded him its gold medal, and the British Government bestowed on him a pension of £100 sterling per annum.\n\nHis later discoveries exceeded by far those of 1837, and had he reached home they would no doubt have gained him fresh honors and renown. But his race was run; his last journey ended. Instead of honorable recognition and well merited fame his portion has been, with regard to his remains, contumely and neglect; with regard to his name, defamation, and his memory, oblivion. Let us see if we can make out how it all happened.\nCHAPTER IV.\n\nI shall have to ask you to return with me to the ghastly camp on the prairie. It is the following morning, and the sun is two hours high. A party of five are riding up from the south. With them is one of the survivors of last night's tragedy. These men have come from a larger party with whom Simpson travelled for a couple of days, leaving them to push ahead.\n\nThe evidence as to the events of this morning comes from only three of these six men, and one of these is also the sole witness as to the events of the preceding night. So that out of eight possible witnesses we have the evidence of only three. This I wish you to keep in mind, as it has an important bearing upon the view of the case which I have adopted. These witnesses were James Bruce, Robert Logan and James Flett. The first named gave his evidence before Mr. Sibley (now General Sibley) at St. Peters, on the Upper Mississippi, on the 13th July, 1840, a month after the date of the tragedy. R. Logan gave his evidence before Alex. Ross, J. P., at Red River, on the 14th October, 1840, and Flett on the 11th of the same month and year, before John Bunn, magistrate, but where the affidavit does not say.\n\nThe evidence is most contradictory, but I ask you to follow it as closely as you can, and I will be as brief as justice to the subject will permit. Bruce, who with young Legros, left the camp that night, says they lost their way, and instead of a two hours' ride they took all night reaching the main camp. He twice mentions that he reached this camp. On going back to the deserted camp five men went with him. On arriving there some one called Simpson by name, but there was no response, and he saw Simpson lying in bed on the opposite side of the cart to where he was. Then he says the report of a gun was heard, he does not say by whom, and the whistling of a ball in the air. A remark was made that Simpson must have shot himself, but again we are not told by whom. He and the rest of the party then made a circle round the cart to ascertain whether Simpson could be seen to move. Nothing was seen, however, but a dog lying beneath the cart. He and the rest then \"Continued to call on Simpson by name, and receiving no reply they fired at the said dog and drove him away.\" They then discharged their guns at the top of the cart with the intention of alarming the said Simpson if still alive. The witness then asked one of the party \"to go up with him to the cart, and the witness found that Simpson had shot himself through the head. He was quite dead.\" The bodies of all three were interred in the same grave. He further deposes that Simpson at no time showed symptoms of insanity.\n\nNow let us see what Robert Logan, jr., has to say. \"Early on the morning of the 15th, about sunrise, just as we had left our encampment, * * * two riders came after us at full speed, the one riding Simpson's horse, the other Legro's.\" Remember, the previous witness\nsaid that he rode into the camp—this one that they had broken up\nthe camp and were in motion. \"After riding about three hours they\ncame to the fatal spot. They called out to Simpson several times, but\nreceived no answer. They distinctly saw Bird's dog sitting near the\ncart by the bodies. They then moved round to another position, keep-\ning about the same distance off. All at once they heard the report of\na gun in the direction of the dog and cart, saw the smoke, and heard\nthe ball whistling over our heads. We then,\" he continues, \"all halted\nand felt confused, supposing that Mr. Simpson had fired at us.\" They\nthen moved on to another place and halted, tying their horses, and\nproposed firing in the air or over the camp. \"Gaubin fired first, Michael\nRichotte the second shot and by it the dog was wounded, then all the\nparty fired—we all fired twice but saw nothing more. Richotte then\nmounted his horse and rode swiftly by the camp to see if he could ob-\nserve Mr. Simpson.\" Some others followed. I quote the exact words:\n\"After passing the spot we all joined again, when Richotte said he saw\nSimpson lying as if dead. His body was lying stretched out with one\nleg across the other, and the butt end of his double barrelled gun be-\ntween his legs, the right hand with the glove off directed to the trigger,\nthe left hand with the glove on holding the gun near the muzzle on his\nbreast. All the head above the nose was blown off, and we found a\nwhite night cap lying ten or fifteen yards off with a hole in it, as if\nmade by a gun shot, and singed by fire and some of his hair sticking\nto it. The five guns and four pistols were at the spot. We turned\nthe body and found it warm, but no signs of life.\" They then buried\nthe bodies. So far the second witness.\n\nThe other witness, James Flett, says:\n\n\"We approached cautiously, and when 200 yards (600 feet) off\nhalloed and called him by name, and immediately we heard a shot and\nI distinctly heard the hissing of a ball, and Gaubin told me he heard\nthe same. We then made a turn round behind him and separated our-\nselves and took the horses which were standing at some distance\nsupposing he would show himself. We approached towards his left,\nand when within 200 yards (still 200 yards) we fired in the direction\nof the cart. Still not seeing him, Michael Rochette galloped on horse-\nback close behind the spot but still could not see him. We then ap-\nproached still nearer by a hollow but still could not see him. Then\nJames Bruce and another crawled along the creek and to within 20\nyards, when they called out he was dead.\"\n\nPardon me if again I ask you to note the evidence closely. I\nquote the words:\n\n\"We then approached and saw him lying with his face downward,\nnear but not on a blanket, which was spread alongside of the cart. I\ndo not know how many shots were fired, as we did not all fire to-\ngether. Do not believe any hit him. His eyes were not blown out.\nWas told one of his hands was grasping the barrel of his gun and the other, that is his right hand, down towards the trigger, but this I did not see, at least do not remember if I did.\"\n\nThis closes the evidence.\n\nCHAPTER V.\n\nI cannot pretend to divest myself entirely of a special advocacy in this case, but I have endeavored to give you all the evidence which on either side has an important bearing upon it.\n\nThomas Simpson, according to this evidence, stands charged first and directly with murder, and secondly and indirectly with suicide. Is he guilty or not guilty? We are met at the outset with this difficulty that all those interested at once accepted all the charges as true, and acted accordingly. No properly constituted authority ever investigated the charges, nor did any court ever decide upon them. It was possible to have made a thorough and exhaustive examination into all the circumstances, but this was never done. We are compelled now to come to a decision on the imperfect and contradictory statements of these witnesses and some other few facts which transpired afterwards and which I will lay before you.\n\nAs to the charge of murder, let us narrate some significant incidents which are not mentioned by the witnesses. Simpson's party, on leaving the main body, travelled very rapidly, making as much as forty-five and fifty-five miles a day. This is shown on a map he made as he went along. Then they turned on their tracks for two days. The reason alleged for this retrograde movement was that Simpson wished to return to Fort Garry, but it also transpired that there had been a dispute about the horses. Each traveller owned his own horse, and they complained that their horses were over driven. There is no chance of ever finding out the real reason for this return march, but we may be sure it was no choice of Simpson's. Simpson's diary would have explained it, but it disappeared forever, nor were the witnesses asked any questions about it. Of this we may be sure, that neither Bird nor Legros, sr., were shot without previous words. There must have been serious disagreement between Simpson and these two men. With weapons in their hands is it likely Simpson alone made use of them. It is further unlikely that young Legros would have seen his father shot without making an effort to protect or revenge him. It is utterly incredible that without a word a man of Simpson's tried courage would send these two men to eternity.\n\nTo me it is clear, too, that in the melee Simpson was seriously wounded. One of the two survivors mounted Simpson's horse and rode away with it. Would he have dared to do this if Simpson were capable of preventing him? Only two things could have prevented\nhim: the want of a loaded weapon or physical weakness. In the next place we are asked to believe that Simpson lay down and went to sleep beside his victims. If he murdered them in cold blood and in possession of his faculties, could he have done this? On the other hand, if he were bereft of his faculties, is it the act of a man suffering from a disordered brain to remain quiet in the same spot and actually go to sleep? The first attack of insanity particularly, is accompanied by perturbed but determined volition which is exercised in the direction of constant action and movement. Horses were at his side; were he insane he would have ridden after or from those who had just left him. Now, whether fatally wounded or not, he was certainly unable to prevent the abduction of his horse. The events of the next morning bear this out. He was called, but did not reply. He was dead or dying.\n\nSo far the charge of murder. Next morning he is charged with suicide. Upon what evidence? It is necessary here to tell you that some years before this, Simpson incurred the hatred of a large class of the community by punishing one of their number for repeated insolence and annoyance during business hours. The affair made a great noise. A considerable body of this man's friends espoused his cause, gathering around the fort, dancing a war dance and demanding that Simpson be delivered up to them. The governor appeased them by presents of rum and tobacco, and a promise to send the accountant away. Some of these men were in the party going across the plains. It is possible that among the shots fired so recklessly that morning one was not aimed at the cart, or over it. One took effect on the poor dumb animal watching by the body of his late master. In the promiscuous firing, who could tell whether another shot did not take effect on Simpson? The evidence as to the firing agrees only in one particular, that it was of the most senseless kind. Bruce says they all fired at the dog and drove it away. The bodies were close together; it would be strange if a shot did not strike one of them. Then Bruce says they all fired at the top of the cart. But Logan says Gaubin fired the first shot and Richotte the second, hitting the dog with it. Then all the party fired twice. Flett says nothing about single shots but that they fired in the direction of the cart, but not all together. Simpson's body lay beside the cart, and it is not likely it escaped in the fusilade.\n\nBut we are told that before this general firing began the report of a gun was heard and a ball whistling in the air, and on the strength of this we are asked to believe that Simpson shot himself. The evidence as to this single shot is the only important point in which the three witnesses agree, and we must accept it as true. A shot was fired, but by whom? Not by Simpson. He was unable to move, and if not dead in all likelihood unconscious. That shot came from beyond the camp. The circuit made by these men cut through a slight hollow just below the bank of the creek. That shot came from there. To have come from Simpson's gun we would have believed that lying on the\nground he could reach the trigger of a flint lock, and that fired in this horizontal direction and blowing off his skull it would change its course and fly over head and whistle as it went. No importance need be attached to the story of the gun being seen between Simpson's legs. Bruce, who had the greatest interest in ascertaining Simpson's fate, and who would have noticed it at once, says not a word about it. Remember I am not charging these men with any intention of telling untruths. Only one says he saw it there. But his evidence was four months old. He may have seen it and it may have been placed there, or hearing repeatedly that it was there he might easily confuse imagination with sight.\n\nThese men all went on across the country to the Mississippi; they were in company with others who had not been witnesses to the events that morning. Day after day that topic would be discussed. At least three languages were spoken in the camp—French, Indian, English. Someone speaking in French might be relating the story to a friend who knew that language indifferently. Or it might be told by an English speaking member of the party in very bad French to one who spoke only Indian and French. With every care, and with only a desire to elicit the truth, we all know how often a coroner's jury investigating a matter on the spot, and within a few minutes of the occurrence, and where the medium of communication is a language familiar to all, listen to evidence completely contradictory.\n\nThere were very apparent ways of settling whether Simpson had shot himself, but we are not told that any of these were adopted. One of the most important points we have not a shred of evidence about. What was the condition of the firearms? Simpson used a double-barrelled gun that night, firing two shots from it, and it is implied he used it next morning—firing one shot. Was the gun loaded in one barrel when the returning party found it? It is in evidence that the guns and pistols were lying on the grass, but this I attach little importance to; they were placed there after the party came up; but why did not the magistrate ask whether the other guns and pistols were loaded or unloaded. This information could have been got; for some one, before putting these weapons away in the carts, must have examined them. Again, while we are told that Simpson was shot in the head, no question was asked as to whether he was shot elsewhere.\n\nWhy were not Gaubin, who is alleged to have fired the first shot, and Richotte, who fired the second and wounded the dog, why were not these important witnesses examined? The evidence would have been decisive, but no effort was ever made to obtain it. It again occurs to one to ask why none of the party returned to Fort Garry to tell the news of the tragedy? Bird's poor limping dog bore the first tidings of disaster to the settlement at Red River. Three days travel would have taken them back, and they might be sure their trouble would be\nrewarded. It would have been possible to have the matter thoroughly sifted.\n\nCHAPTER VI.\n\nLet us now look at such evidence as may be considered somewhat clear.\n\nWhen these men came up to the camp the only sign of life was Bird's dog. Simpson was seen by no one to move. No one saw him make a sign or heard him utter a sound. It is next pretty certain that the party shouted and called Simpson by name. Can we suppose Simpson to have been asleep that he returned no answer? Is it reasonable to suppose that he would have remained inactive hearing all this noise and seeing the excited horsemen galloping round him like wild Indians? We may consider it established, too, that Simpson was dead when the party mustered up courage to examine the body. There are statements about the body being warm, and blood dry and wet visible. If this can be depended on, he must have been wounded the previous night and again the next morning. There is no evidence as to when Legros died. He fell or laid down about two minutes after he was shot. Is it possible that his death and Simpson's could have happened from any attempt on his part to take revenge on Simpson after the other two went away? Can we, in the face of all this, say that the case was one of suicide? Charity forbid! If any guiltless member of that party, on viewing Simpson's body, concluded that he was shot in the promiscuous firing, we can easily imagine his horror on reflecting that he unwittingly took part in it. More than one may have had that feeling. At any rate all their future conduct showed a desire to hush the matter up. No one returned with the news. Only one made declaration of the facts on arriving at their destination. The body was hastily buried with the other two, and some one abstracted the diary. This desire, unfortunately for Simpson's memory, jumped with the views of the company. It was inexpedient to investigate the matter. Had they been convinced that it was a case of insanity and suicide, the remains would have been sent for and an inquest held at once. Nothing would have come of it.\n\nBut if it was a case of justifiable murder so far as the first night went, and a case of murder or manslaughter next morning, the company had a delicate and serious duty to perform. They had no troops to maintain order in the settlement. Should some of those who fired so carelessly or studiously in the direction of Simpson's body that morning have been found guilty of his death, the company would have a civil outbreak on their hands. They would reason: It is all over; we cannot restore the dead to life; the evidence is conflicting; we will let the matter drop. In carrying out this policy they cared nothing\nfor the good name of their unfortunate servant; nothing was done that year, and it was only when reports reached them in the autumn of next year that wolves had dug open the grave that they went through the form of sending a coroner down for the body. This official stated that decomposition was too great to make any examination, and he therefore had no report to make.\n\nThe funeral was left to the charge of the company's carpenter, and that there might be no unpleasant revival of the subject no mark was placed over the grave. This was in accordance, I am sorry to say, with the wishes of the governor. It was no part of his plans that his relative should eclipse himself. He gave the command of the expedition to a senior officer who had no qualifications as an explorer. When the Board at home gave Simpson authority to continue his discoveries alone, the governor sent them out in a roundabout way, and in the meantime, without telling him that he had authority to go north again, called him to London. His letters and papers were retained for over three years, and when his brother at last got them, all Sir George's letters to the traveller were abstracted. Indeed, Sir George made an effort to suppress the narrative which Simpson had completed on the McKenzie. He wrote the secretary in London that he wished it reserved for himself, to be incorporated in a work he had it in contemplation to publish at some future time. The first memoir written by his brother Alexander was left in the company's office in London, and it was conveniently missing when wanted.\n\nI have performed my task imperfectly if I have not convinced you that at least a verdict of \"Not proven\" should be returned to the charges of murder and suicide. To my own mind the evidence carries the conviction which would justify me in giving the much stronger verdict of \"Not guilty.\" The contradictory nature of the evidence; the fact that no report of his death was carried back to Fort Garry; the apathy of the participants in the events; the careful procrastination of the company; the carelessness of the investigation, if such it could be called, all point to a dread of other revelations.\n\nAnd a review of all the facts strengthens this belief. If we are to find him guilty we must believe that a perfectly sane man, without a word, sent two fellow beings into eternity. That he was allowed to do this although both of them were armed, and that two others, one of them the son of one of the victims, stood by with arms also within their reach; that these two were allowed to depart in peace, and that Simpson stood by and saw his horse taken away by one of them; that he retired to rest beside the bodies of his victims; that his mind was so little disturbed by the awful events which took place that he lay there until the sun was two hours high next day; that he made not the slightest effort to escape, although there were other horses within reach; that the approach of mounted men shouting and galloping around him did not rouse him; that, ambitious and proud, he had no desire to vin-\ndicate his conduct to them. We must believe, too, that he had deliberately arranged for his own suicide by placing his gun in a suitable position, and that his arm was long enough to reach to the trigger of the old fashioned flint-lock gun. To consider him guilty we must also believe that in the wild irresponsible firing which took place that morning no shot by accident or design was low enough to extinguish such slight spark of life as was left in him. If we are to believe he was insane we must also believe that insanity occurs without any apparent symptoms, and that he alone formed an exception to the rule which tells us that early attacks impel the victim to continual action. Neither sleep nor rest is known in the first hours of brain disorder, yet he lay down and slept soundly. To find him guilty we must believe that young Legros had no motive in not returning to see his father's remains interred; that there was no motive in keeping him for ever afterwards out of sight. We cannot believe that a brave and generous man changed his nature in a moment and in the most cowardly manner shot his fellow travellers, and that in the most despicable fashion he eluded punishment by suicide.\n\nThis we cannot believe. Nothing in his character would justify us for a moment in doing so. He was generous to a fault. Every letter breathes his attachment to home and relations. He was strongly attached to his family, and with his brother supported his mother in her old age. His chief anxiety in considering the dangers ahead of him was that his mother might be left unprovided for, and in a will he made he devised to her any wealth which his services might be supposed worthy of. But she reaped but little benefit from this. The government refused to give her even the one year's pension already due her son, and the Hudson's Bay Company paid but the merest pittance as the balance due to Simpson.\n\nA word as to his appearance. He was under the average height, broad shouldered, with a frame formed for endurance. His dark brown hair clustered full around his head. There was much merriment in the expression of the eye as well as a look of great kindness. His mouth was small and determined.\n\nCHAPTER VII.\n\nThose, however, who could take care of themselves fared well. The Hudson's Bay Company, on the strength of Simpson's discoveries, got a renewal of their license. Their governor in London received a baronetcy and the local governor a knighthood. Notwithstanding all this, he to whom they were indebted for these benefits and honors received the burial of an outcast. His body was allowed to become prey for wild animals, and it was only when this reached the ears of the governor that orders were given to have his bones picked\nup on the prairie, and brought here for interment. Bigotry added its mite to the contumely of relatives and friends, and burial was refused for what the wolves had left of Thomas Simpson. A grave was dug for him away from those of the good people, and no stick or stone marks the spot. \"No man knows his sepulchre.\" Within the last few weeks I have seen the carpenter who had charge of the funeral, but he has no recollection of the spot. Some little clue has been obtained, however, and it may be that some one who was present may yet be found to point the place. The expression of fraternal affection was resented by his superstitious countrymen, and a tablet in brass erected in the church of his native place was torn down and disfigured.\n\nSeveral officers of the Hudson's Bay Company have signified their desire to contribute to a fund for the erection of a monument to Simpson, and I may say that any one so disposed may send donations to Chief Factor McFarlane, care of the Hudson's Bay Company, Winnipeg, who has consented to act as treasurer for the fund. The Royal Geographical Society will, no doubt, send a handsome contribution.\n\nNo more justly distinguished and able man is connected with the Northwest, and I am sure I am not astray in appealing to that generosity and quick perception of merit so characteristic of our young country to revise the record of Thomas Simpson's fate, the record of his life, and stamp with indelible seal our impression that here was a life for example; here a brave and noble spirit; a name and memory traduced and neglected, and to place it in that niche of fame which has so long been denied it.\n\n—Alex. McArthur.\n\nDISCUSSION.\n\nA brief discussion followed. Dr. Bryce agreed with Mr. McArthur that it would be a laudable thing to make an effort to remove any stigma from the memory of a noble and worthy man.\n\nIn answer to Prof. Hart, Mr. McArthur stated that superstitious objections had been made to the burial of Simpson's remains in the church yard, but as a compromise they were interred beside the wall on one side.\n\nMr. K. N. L. Macdonald took an opposite view of the evidence, and believed that Simpson had murdered his companions and then committed suicide, in consequence of a strange hallucination that had taken hold of his mind in crossing the prairie that one of his fellow travellers might report the results of their expedition to the company in England before him.\n\nAfter some further remarks by Judge Ardagh and others, and the passing of a unanimous vote of thanks to Mr. McArthur for his excellent paper, the meeting adjourned.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30622.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 34350, "total-output-tokens": 9048, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1462, 3], [1462, 2634, 4], [2634, 2871, 5], [2871, 3000, 6], [3000, 4525, 7], [4525, 7385, 8], [7385, 10413, 9], [10413, 13180, 10], [13180, 16120, 11], [16120, 19047, 12], [19047, 21761, 13], [21761, 24901, 14], [24901, 27877, 15], [27877, 30566, 16], [30566, 33641, 17], [33641, 36383, 18], [36383, 38978, 19], [38978, 38978, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]