[{"id": "be75ae37d48f955eae015f87cf2a8851e1c659db", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:/ Commentaires supplémentaires:\n\nDocket title page is bound in as last page in book but filmed as first page on fiche.\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nManuscript Division\nPublic Archives of Canada\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol (meaning \"CONTINUED\"), or the symbol (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nH. R. 754.\n\nA BILL\n\nFor the admission of the States of Nova Scotia, New Brunswick, Canada East, and Canada West, and for the organization of the Territories of Saskatchewan and Columbia.\n\nJuly 2, 1866.—Read twice, referred to the Committee on Foreign Affairs, and ordered to be printed.\nMr. Banks, on leave, introduced the following bill:\n\nA BILL\n\nFor the admission of the States of Nova Scotia, New Brunswick, Canada East, and Canada West, and for the organization of the Territories of Selkirk, Saskatchewan, and Columbia.\n\nBe it enacted by the Senate and House of Representatives of the United States of America in Congress assembled,\n\nThat the President of the United States is hereby authorized and directed, whenever notice shall be deposited in the Department of State that the governments of Great Britain and the provinces of New Brunswick, Nova Scotia, Prince Edward Island, Newfoundland, Canada, British Columbia, and Vancouver's Island have accepted the proposition hereinafter made by the United States, to publish by proclamation that, from the date thereof, the States of Nova Scotia, New Brunswick, Canada East, and Canada West, and the Territories of Selkirk, Saskatchewan, and Columbia, with limits and rights\nas by this act defined, are constituted and admitted as States\nand Territories of the United States of America.\n\nSEC. 2. And be it further enacted, That the following\narticles are hereby proposed, and from the date of the procla-\nmation of the President of the United States shall take effect,\nas irrevocable conditions of the admission of the States of\nNova Scotia, New Brunswick, Canada East, and Canada\nWest, and the future States of Selkirk, Saskatchewan, and\nColumbia, to wit:\n\nARTICLE I.\n\nAll public lands not sold or granted; canals, public har-\nbors, light-houses, and piers; river and lake improvements;\nrailway stocks, mortgages, and other debts due by railway\ncompanies to the provinces; custom-houses and post offices,\nshall vest in the United States; but all other public works\nand property shall belong to the State governments respec-\ntively, hereby constituted, together with all sums due from\npurchasers or lessees of lands, mines, or minerals at the time\nof the union.\n\nARTICLE II.\n\nIn consideration of the public lands, works, and prop-\nerty vested as aforesaid in the United States, the United States\nwill assume and discharge the funded debt and contingent\nliabilities of the late provinces, at rates of interest not exceed-\ning five per centum, to the amount of eighty-five million seven\nhundred thousand dollars, apportioned as follows: To Canada West, thirty-six million five hundred thousand dollars; to Canada East, twenty-nine million dollars; to Nova Scotia, eight million dollars; to New Brunswick, seven million dollars; to Newfoundland, three million two hundred thousand dollars; and to Prince Edward Island, two million dollars; and in further consideration of the transfer by said provinces to the United States of the power to levy import and export duties, the United States will make an annual grant of one million six hundred and forty-six thousand dollars in aid of local expenditures, to be apportioned as follows: To Canada West, seven hundred thousand dollars; to Canada East, five hundred and fifty thousand dollars; to Nova Scotia, one hundred and sixty-five thousand dollars; to New Brunswick, one hundred and twenty-six thousand dollars; to Newfoundland, sixty-five thousand dollars; to Prince Edward Island, forty thousand dollars.\n\nArticle III.\n\nFor all purposes of State organization and representation in the Congress of the United States, Newfoundland shall be part of Canada East, and Prince Edward Island shall be part of Nova Scotia, except that each shall always be a separate representative district, and entitled to elect at least one member of the House of Representatives, and except, also, that the municipal authorities of Newfoundland and Prince Ed-\nward Island shall receive the indemnities agreed to be paid by the United States in Article II.\n\nArticle IV.\n\nTerritorial divisions are established as follows: (1,) New Brunswick, with its present limits; (2,) Nova Scotia, with the addition of Prince Edward Island; (3,) Canada East, with the addition of Newfoundland and all territory east of longitude eighty degrees and south of Hudson's strait; (4,) Canada West, with the addition of territory south of Hudson's bay and between longitude eighty degrees and ninety degrees; (5,) Selkirk Territory, bounded east by longitude ninety degrees, south by the late boundary of the United States, west by longitude one hundred and five degrees, and north by the Arctic circle; (6,) Saskatchewan Territory, bounded east by longitude one hundred and five degrees, south by latitude forty-nine degrees, west by the Rocky mountains, and north by latitude seventy degrees; (7,) Columbia Territory, including Vancouver's Island, and Queen Charlotte's Island, and bounded east and north by the Rocky mountains, south by latitude forty-nine degrees, and west by the Pacific ocean and Russian America. But Congress reserves the right of changing the limits and subdividing the areas of the western territories at discretion.\n\nArticle V.\n\nUntil the next decennial revision, representation in the\nHouse of Representatives shall be as follows: Canada West, twelve members; Canada East, including Newfoundland, eleven members; New Brunswick, two members; Nova Scotia, including Prince Edward Island, four members.\n\nArticle VI.\n\nThe Congress of the United States shall enact, in favor of the proposed Territories of Selkirk, Saskatchewan, and Columbia, all the provisions of the act organizing the Territory of Montana, so far as they can be made applicable.\n\nArticle VII.\n\nThe United States, by the construction of new canals, or the enlargement of existing canals, and by the improvement of shoals, will so aid the navigation of the Saint Lawrence river and the great lakes that vessels of fifteen hundred tons burden shall pass from the Gulf of Saint Lawrence to Lakes Superior and Michigan: Provided, That the expenditure under this article shall not exceed fifty millions of dollars.\n\nArticle VIII.\n\nThe United States will appropriate and pay to \"The European and North American Railway Company of Maine\" the sum of two millions of dollars upon the construction of a continuous line of railroad from Bangor, in Maine, to Saint John's, in New Brunswick: Provided, That said \"The European and North American Railway Company of Maine\" shall release the government of the United States from all\nclaims held by it as assignee of the States of Maine and Massachusetts.\n\n**Article IX.**\n\nTo aid the construction of a railway from Truro, in Nova Scotia, to Riviere du Loup, in Canada East, and a railway from the city of Ottawa, by way of Sault Ste. Marie, Bayfield, and Superior, in Wisconsin, Pembina, and Fort Garry, on the Red River of the North, and the valley of the North Saskatchewan river to some point on the Pacific ocean north of latitude forty-nine degrees, the United States will grant lands along the lines of said roads to the amount of twenty sections, or twelve thousand eight hundred acres, per mile, to be selected and sold in the manner prescribed in the act to aid the construction of the Northern Pacific railroad, approved July two, eighteen hundred and sixty-two, and acts amendatory thereof; and in addition to said grants of lands, the United States will further guarantee dividends of five per centum upon the stock of the company or companies which may be authorized by Congress to undertake the construction of said railways: *Provided,* That such guarantee of stock shall not exceed the sum of thirty thousand dollars per mile, and Congress shall regulate the securities for advances on account thereof.\n\n**Article X.**\n\nThe public lands in the late provinces, as far as practi-\ncable, shall be surveyed according to the rectangular system\nof the General Land Office of the United States; and in the\nTerritories west of longitude ninety degrees, or the western\nboundary of Canada West, sections sixteen and thirty-six\nshall be granted for the encouragement of schools, and after\nthe organization of the Territories into States, five per cen-\nturn of the net proceeds of sales of public lands shall be paid\ninto their treasuries as a fund for the improvement of roads\nand rivers.\n\nArticle XI.\n\nThe United States will pay ten millions of dollars to\nthe Hudson Bay Company in full discharge of all claims\nto territory or jurisdiction in North America, whether\nfounded on the charter of the company or any treaty, law,\nor usage.\n\nArticle XII.\n\nIt shall be devolved upon the legislatures of New Brunsw-\nwick, Nova Scotia, Canada East, and Canada West, to con-\nform the tenure of office and the local institutions of said\nStates to the Constitution and laws of the United States,\nsubject to revision by Congress.\n\nSec. 3. And be it further enacted, That if Prince Ed-\nward Island and Newfoundland, or either of those provinces,\nshall decline union with the United States, and the remaining\nprovinces, with the consent of Great Britain, shall accept the\nproposition of the United States, the foregoing stipulation in favor of Prince Edward Island and Newfoundland, or either of them, will be omitted; but in all other respects the United States will give full effect to the plan of union. If Prince Edward Island, Newfoundland, Nova Scotia, and New Brunswick shall decline the proposition, but Canada, British Columbia, and Vancouver island shall, with the consent of Great Britain, accept the same, the construction of a railway from Truro to Riviere du Loup, with all stipulations relating to the maritime provinces, will form no part of the proposed plan of union, but the same will be consummated in all other respects. If Canada shall decline the proposition, then the stipulations in regard to the Saint Lawrence canals and a railway from Ottawa to Sault Ste. Marie, with the Canadian clause of debt and revenue indemnity, will be relinquished. If the plan of union shall only be accepted in regard to the northwestern territory and the Pacific provinces, the United States will aid the construction, on the terms named, of a railway from the western extremity of Lake Superior, in the State of Minnesota, by way of Pembina, Fort Garry, and the valley of the Saskatchewan, to the Pacific coast, north of latitude forty-nine degrees, besides securing all the rights and privileges of an American territory to the proposed Territories of Selkirk, Saskatchewan, and Columbia.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_63690.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 15, "total-input-tokens": 25682, "total-output-tokens": 3111, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1061, 3], [1061, 2171, 4], [2171, 2458, 5], [2458, 3399, 6], [3399, 4709, 7], [4709, 6111, 8], [6111, 7442, 9], [7442, 8738, 10], [8738, 10049, 11], [10049, 11317, 12], [11317, 12742, 13], [12742, 12742, 14], [12742, 12742, 15]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, true]}}]