[{"id": "03bd7661353ab85fcc9befbf05e39fa02bf864f9", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\n☐ Couverture de couleur\n\n☐ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\n☐ Encre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\n☐ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmées à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nTHE FORLORN HOPE;\n\nAN APPEAL TO THE CHURCH,\n\nON\n\nTHE IMPROPRIETY OF USING FERMENTED THINGS IN THE SACRAMENT.\n\nBY JAMES MILLER, GUELPH,\nAUTHOR OF \"PROTEST AGAINST SONS OF TEMPERANCE.\"\n\nPSALM cxix. 18—\"Open thou mine eyes, that I may behold wondrous things out of thy law.\"\n\nTORONTO:\nPRINTED FOR THE AUTHOR, BY J. CLELAND,\n1853.\nTHE\n\nFORLORN HOPE;\n\nAN\n\nAPPEAL TO THE CHURCH,\n\nON\n\nTHE IMPROPRIETY OF USING FERMENTED THINGS IN THE SACRAMENT.\n\nBY JAMES MILLER, GUELPH,\nAUTHOR OF \"PROTEST AGAINST SONS OF TEMPERANCE.\"\n\nPsalm cix. 18—\"Open thou mine eyes, that I may behold wondrous things out of thy law.\"\n\nTORONTO:\nPRINTED FOR THE AUTHOR, BY J. CLELAND,\n1853.\nAPPEAL.\n\nWhen the Total Abstinence Society commenced its glorious work, its most strenuous opponents were the ministers and professors of Christianity: not because they did not see that the object of the movers was good, and would, if carried out to the extent contemplated, be the means of producing a great reformation in Society, but because of their own ignorance of the spirit of the Bible, and the design of its Author; and because they confounded wine that was evil and wine that was good, making no difference between them. They set up a hue and cry because they thought the religion they professed was in danger in case this new light prevailed; and those who follow in their wake, without any principle or regard for truth, and adopt their opinions and interpretations, continued the uproar; although the new course was the only road which would lead to sobriety, which they could not gainsay or contradict.\n\nThese lights of the world being under an eclipse, could throw no light on us till the obscuring object was removed by the efforts of Temperance men; and unitedly have they toiled, and hoped almost against hope, until now they have no controversies on any of their doctrines. The Bible has been successfully cleared of the charge of encouraging the use of intoxicating beverages. But at the commencement it was not so. The ministers of religion taught that the wine and strong drinks recommended in Scripture were intoxicating. If they were, then they give the lie direct to the inscription on every page, or rather, the subject of the text is a direct contradiction of the inscribed design. Without the aid of revelation men saw it proved to them daily, that intoxicating liquors did not increase the happiness of man, but his misery. That heathen who God called by name, one hundred years before he was born, saw that it made those great men, to whom he was cup-bearer, like madmen, and refused to drink of it, although the custom was that he should drink of it before giving it to them; that their suspicions of poison might be hushed, he saw, without the aid of revelation, that it was injurious, while we, with it as a people, did not take the trouble to enquire into the nature, quality, and effects of the wines and strong drinks recommended in the Word of Life, but take it for granted that they must be intoxicating. Now it is in this way that the Bible is to the Jews a stumblingblock, and to the Greeks foolishness; for if the Bible is of God, and that it is, every page declares, the history of nations declare, in their rise and progress, their decline and fall, the coming of\nthe Messiah, the rise of Antichrist, and his fall, (which God, of his infinite mercy grant, may soon take place, to rise no more.) These, and many other things, prove, that its prophecies are true, and what better evidence can we have? He who penned the whole of it says of himself, \"I am the Lord, God, merciful and gracious, long-suffering, and abundant in goodness and truth;\" and one of his inspired servants says of him, \"the Lord is good to all, and his tender mercies are over all his works.\" Now, with all the evidence we have of the benevolence of the Author of the Bible, how can we come to the conclusion that He recommends a drink that, without the aid of revelation, we could and would reject if our natural judgments were exercised? Is it not saying that, in our fallen state, we can find a better way than God has pointed out?\n\nThe opposers of Total Abstinence from intoxicating liquors have asserted such things as the following: Intoxicating liquor is a good creature of God. It rejoices the heart of God and man. It was made by our blessed Redeemer for making the marriage party of Cana in Galilee, merry. It was prescribed by the Apostle Paul to Timothy. It was recommended to those in distress, ready to perish, and of a heavy heart. It is made use of as a figure to convey a knowledge of the Gospel of salvation. It is the emblem of the Redeemer's blood, shed for many for the remission of sins. And other things were said of it that have been proved false. I propose to say but little on the first five of these assertions, and to dwell a little longer on the two last, as they seem to me of the greatest consequence; for if fermented wine is a proper emblem of our redemption, then salvation means thraldom worse than Egyptian, and Christ's blood must pollute us more and more.\n\nI take up the first of these assertions, namely, that \"intoxicating liquor is a good creature of God,\" and will endeavor to shew that it is not. Those things that God created for the use of man he made perfect; for he pronounced everything that he had made very good; and after man's corruption by sin, those things that he had given for his bodily nourishment were made use of as emblems to confirm the doctrine they were to observe and keep in their minds: he used them to teach them the means he had decreed he would employ for their restoration to his favor—the shedding of the blood of those beasts that he gave them for food, was confirming what he taught literally, that without a substitute to suffer the penalty of death, in their stead, they would have to undergo the sufferings of death to all eternity. In the ordinances given by Moses, the lamb had to be perfect, showing that the substitute of man must be so also. It was also commanded, that nothing fermented should be eaten or be in their houses during the seven days of the Passover week. I therefore conclude, that the fermenting or the being in a diseased state of those things that were for the food of man being prohibited in God's ordinances, should make us deny on all occasions, because of this evidence from the Bible, that fermented things are good creatures of God; seeing we have as good ground for the conclusion as we have when we deny that God is the author of sin. The perfect similarity in the grape before its being pressed out to man be-\nfore he sinned, Dr. Lee, in his \"Sacred Writings rescued from Impious Perversions,\" says, speaking of the grape: \"These beautiful little bottles are divided into compartments or cells, the yeast or glutin being separated from the saccharine matter, in order to prevent fermentation, as the fruit hangs on the tree. It is because of this simple provision that grapes can be preserved either in their ripe, fresh condition, by carefully preventing them being bruised, and keeping them in cool, dry cellars, or in the form of raisins, by allowing the sun to evaporate the water.\"\n\nSome such condition were man's faculties in before he sinned, and as delicate were the partitions that separated one faculty, feeling or desire from another, that a fall was sufficient to cause them all to run into another, and prevents us now often distinguishing between our duty and inclination. The fact of the wine in the cluster being termed a blessing in the Bible, and the fermented article being forbidden in God's house, goes clearly to prove, that neither sinful man nor fermented things, are good creatures of God, according to his own word. We will see this more fully before our task is done.\n\nThe second in order of the assertions I would take up and value according to its merits, is, \"that fermented wine rejoices the heart of God and man.\" If gladness and madness mean the same thing, then I might let it go as proved indisputably; but this I must deny, because I know from observation that they are very different. Laying aside my own convictions in the matter, and taking the Bible for my guide, it tells me that wine is a mocker—strong drink is raging; it gives examples of abominable sin committed under its influence. It cruelly mocked Noah—took away his consciousness; his son saw his nakedness, and told his brothers without, thinking they would join with the Devil's best agent and him in mocking their father. But blessings were showered on their heads and on the heads of their posterity for their tenderness and affection, and curses on Ham for his conduct, which are endured by his descendants to the present time. Lot committed abominable sin under its influence. Who will tell us that his heart was gladdened, or that God rejoiced in beholding the scene? Nadab and Abihu were slain before the sanctuary for offering strange fire before the Lord, which he commanded them not. Such an instance of will-worship and its consequences may very well lead us to enquire,—Why did they do it? Surely something prevented them \"putting difference between holy and unholy, and between unclean and clean;\" something banished from their minds the severity of God's punishments on any transgression of any of his laws. They knew the command given to Moses: \"And look that thou make them after their pattern, which was shewed thee in the mount.\" They had seen the mount of God; they had heard the thunders of Sinai; they had seen the people plagued for worshipping the calves. They were honored above all the elders of Israel; their names are recorded in connexion with Moses and Aaron, in the invitation to come up unto the Lord, after them the seventy elders, \"and worship ye afar off. Then went up Moses and Aaron, Nadab and Abihu, and they saw the God of Israel; and upon the no-\nbles of the children of Israel he laid not his hand; also they saw God, and did eat and drink.\" Were they not honored more than the elders? But mark their sin, and read the law given by Moses just after the narrative: \"Do not drink wine nor strong drink, thou nor thy sons with thee, when ye go into the tabernacle of the congregation, lest ye die. It shall be a statute forever throughout your generations, and that ye may put difference between holy and unholy and between unclean and clean. And that ye may teach the children of Israel.\" \"If the statutes which the Lord hath spoken unto them by the hand of Moses.\" God rejoiced in them, and did them good, until they sinned, and in accordance with his just and righteous dispensations he punished them. Our Saviour says: \"To whom much is given, of them much shall be required.\" He says, also, \"Woe unto thee, Chorasin, woe unto thee, Bethsaida; for if the mighty works which were done in it had been done in Tyre and Sidon, they would have repented long ago in sackcloth and ashes.\" There is no sign of rejoicing in the case of Nadab and Abihu, although it is evident from their conduct, and the context, what it was that led them astray. The opinion of Jews and Christians is the same; that is, they were intoxicated when they offered strange fire. I will say no more now on this part of my task, but will go on to the next assertion, that \"the wine\" (meaning intoxicating wine) \"was made by our blessed Redeemer for the purpose of making the marriage party in Cana of Galilee merry.\" If we conclude that it was such a liquor, a pure and delicious and nourishing beverage, such as would be newly pressed out of the grape in its ripe state, which the word of God pronounces a blessing, then it could not be intoxicating: It was not similar to fermented wine, because there is nothing so hateful to God as corrupt matter; and we cannot think that Christ made a liquor for his friends which he had repeatedly forbidden. He shut heaven against drunkards; and can we think that he would make a large quantity of the liquor that intoxicates, and give it to his friends after they had well drunk? If it was intoxicating that had been provided for the feast, then the providing a large additional quantity of better wine, which, according to the taste of the present day, would mean stronger of alcohol, then, I say, the act would be worthy of a demon. But the learned amongst the teetotallers have proved that the term \"well drunk\" means filled with drink, but it does not necessarily imply—in-toxicated.\n\nThe prophet Haggai, in reproving the Jews for not rebuilding the house of God, reminds them of the scarcity of provisions amongst the people, and in doing so, assures them that it was God that withheld a plentiful supply of his bounties; and in stating the punishment they were enduring, he says: \"Ye drink, but ye are not filled with drink.\" Now, it would be a strange thing indeed if the fulness of drink in this passage meant drunk, in the sense we use the passage now-a-days.\n\nWhen the Ruler of the feast tasted the water that was made wine, he called the bridegroom, and saith unto him: \"Every man at the beginning doth set forth good wine, and when men have well drunk, then that which is worse; but thou hast kept the good wine until now.\"\nWould to God that we could get some of such wine, that our tastes might be elevated from the abominable liquor, now used and called good! From what he made at the beginning, and what he has made since, and is continuing to make, in accordance with the laws of his own framing, and by the rule of all his acts, glory to his Father and good to man, we may judge whether the water after it, by the word of his power, was made wine, was intoxicating or not.\n\nAgain, it was prescribed by the Apostle Paul to Timothy. Who can doubt that it was the pure unfermented juice of the grape that he meant, that that is pronounced, when in the cluster, a blessing? Unless there were medicinal and nourishing qualities in it, the Holy Ghost would not have called it a blessing. Who can think for an instant that it could be fermented wine, when it is well known now that all the nourishing and beneficial qualities are destroyed by that process?\n\nIn the Proverbs it is said, \"Give strong drink unto him that is ready to perish, and wine to those that be of heavy hearts: let him drink and forget his poverty, and remember his misery no more.\" Some learned men, who were influenced by veneration for the word of God, and love for the best interests of mankind, have come to our help, and proved beyond a doubt that wine, when spoken of in commendation, always means unfermented and unintoxicating; and what is meant in the Bible by strong drink, would be much better understood by us if translated sweet drink—the liquor was boiled to a syrup, and the sugar was strong in it. I take it to mean such a wine as he made who went about doing good; for otherwise the poor distressed son of affliction and poverty would not forget his condition, and his misery would be increased while breath remained in him. It must mean wine and strong drink that will restore him to hope when he is almost perishing with hunger.\n\nAfter the system is reduced by famine, newly pressed out wine or sweet drink are the most proper for gradually restoring the stomach to healthy action. Strong food would be very improper, until some strength was acquired; after that, strong food may be safely taken. Let him drink and forget his poverty; let him comfort himself with the thought that he will be restored to his wonted health and strength, by the kindness of his king: for remember this is part of the instruction given to Lemuel by his mother; every sentence shews that she desires the happiness of her son's subjects, and the restoration of the famishing ones, and because she desires it, she gives the necessary instructions. But if we think that it was such stuffs as are by us called wine and strong drink, then it would be plain that the poor man's death was contrived, and that speedily. I think all will clear the mother of the king of the imputation of compassing the death of any of her son's subjects, from the character of the instructions she gave him, which are all on the side of virtue, mercy, and good, good government.\n\nAgain, it was made use of as a figure to convey a knowledge of the gospel, the glad tidings of salvation. Isaiah 25 ch. 6 v. \"And in this\nmountain shall the Lord of hosts make unto all people a feast of fat things, a feast of wines on the lees, of fat things full of marrow, of wines on the lees well refined.\" Under this metaphor the ancient people of Israel were given a description of the salvation by a Redeemer and the sanctifying influences of the Holy Ghost, which were to be made known over the face of the whole earth, and felt by every fallen son and daughter of Adam; and unless they knew what hunger and thirst were, and the enjoyment of a good substantial meal, and a cooling, subduing and allaying beverage, they could have no idea conveyed to them of the effects of the gospel on him who had once longed for the salvation of his soul, but now enjoyed all the consolations that man can in this state of trial.\n\nEnglish grammar supports me in this conclusion. It says, a metaphor is founded on the resemblance which one object bears to another; it is a comparison expressed in an abridged form. Care should be taken that the metaphor be clear, that the resemblance be not difficult to discover. This allegory is understood then to convey to those it was preached to a full knowledge of what the world was to enjoy under the preaching of the gospel, more particularly the sanctifying influences of the Holy Spirit—a change of heart. The same thing is prophesied by Isaiah in other places, by different figures, and in the literal sense, Jeremiah prophesies the same thing—Ezekiel again and again. \"God will put a new heart and a new spirit into his people, and take away the stoney heart out of their flesh, and give them a heart of flesh;\" and what is more than all, from which we cannot but conclude that it was preached by all the prophets, from the beginning down to Christ himself, when he is speaking to Nicodemus, expresses astonishment at his ignorance of the prophesies; it is severe reproof: \"Art thou a master in Israel, and knowest not these things? Christ came to abolish death, and has brought life and immortality to light in the gospel.\"\n\nWe are told in the New Testament, that the fruits of the spirit, or the effects of the gospel, are love, joy, peace, long suffering, gentleness, goodness, faith, meekness, temperance: these are the effects of the gospel on the soul that receives it. Now, I ask, could the wine in the allegory be a proper figure of the gospel, if it was fermented, and consequently intoxicating? It could not. It must be a sobering wine to represent a sobering gospel. The workings of sin in the heart of man, and the working of a fermenting liquor, are a perfect likeness of one another. Man, in eating the forbidden fruit, is as the grape when burst in the skin; he felt that he was naked; he was stripped of the covering that would prevent him returning to the dust whence he was taken. The bursting of the covering is the first thing that takes place in the grape; decomposition then goes rapidly on, unless it is arrested by some process or other. How like the human race! We, by our inclinations, our lusts unchecked, would not stop short of eternal death. The fermented article is a perfect resemblance of fermented man. Yea! we have fallen divines; ministers of religion tell us so; the Bible tells us so; our own selves know it; and if the grace of God arrests us not in our career, our doom is sealed. If we are not refined as the\nwine in that verse was refined, we will be lost forever. I go to a little book, \"The Wine Question settled,\" and find that the refining was a filtering process, by which the glutin was taken away, and by that means the wine was rendered more liquid, lighter, sweeter, and more pleasant to drink. How like the effects of the gospel on the truly converted man! The love of sin is conquered in him; he has no longer pleasure in it—he feels the weight and the sin that more easily besets him, and flies to the cross of Christ, and lays his burden of glutin, yeast, or ferment (sin) there, which is continually striving for the mastery, and asks grace to help in every time of need. See the striving in a vessel containing a fermenting liquor; why iron hoops are made to give way, often; and the Christian, with all his striving, bursts out in passion and sin. But the process of refining is a progressive work, and so is sanctification; the wine will not be lost, neither will the sanctified man.\n\nIf we are not yet convinced that the wine was a sobering cordial that the Prophet considered a fit emblem of the Gospel, let us consider the matter a little further: let us suppose that all kinds of wine were banished from the earth, and all the effects of all the various kinds forgotten by mankind, and that we had all the graces of the Holy Spirit, and that all the consolations of the glad tidings of salvation were ours by the assurance of faith, at the same time that our bodies were subject to fatigue and depression from toil and exhaustion, and that we were informed by a divine messenger that after a certain period of time the Lord would cause to grow a tree, the fruit of which would contain a drink that would have a similar effect on our bodies that religion had had on our souls; it would refresh us at labour, quench our thirst, still the beating of our hearts, nourish our whole bodies, and induce a calm sleep that would restore the system to vigour, and enable us to renew our exertions with comfort, and make us happy in the thought of such a blessing in prospect. Would we not then count up all the items, name them over, and from each endeavour to anticipate similar comfort to our bodies, making the gospel the thing representing and the wine the thing represented? We would say, religion has calmed our fears of death and hell. Wine will calm our agitated bodies and prevent fevers and death. Religion has subdued our passions that were driving us to ruin. Wine will cool our heated blood and sober our excited nerves. Religion tells us to throw the burden of our sins on Christ by faith. Wine will be a substitute for all other beverages, and excel them in every particular. Religion tells us of another righteousness than our own, which when made over to us, gave much joy and cause for gratitude. Wine will be a gift of God, earnestly to be desired, eagerly to be sought after, never refused. I ask, are the same effects produced on the drinkers of fermented wine or any other intoxicating liquor, for it is for the alcohol that is in them that they are drunk? We are told by ministers of the gospel, that fermented wine is meant; if it is, then a command to drink abundantly is given that they who are strangers to the gospel may be made to learn the knowledge of it. We may search in vain for as great wickedness in any of the\ninfamous characters mentioned in the Bible. We have a horror in our minds at the wickedness of Jezebel, when Ahab told her that Naboth would neither sell his field to him nor exchange it for another. She asked him haughtily, \"dost thou now govern the kingdom of Israel. Arise and eat bread and let thine heart be merry, I will give thee the vineyard of Naboth the Jezreelite.\" She did so, and the end of Naboth was accomplished—men were soon found ready to sell themselves to the wicked woman; but mark the difference—Jezebel is not the one who gives the information necessary to take his life—she hires children of Belial, those furious and obstinate in wickedness, to swear that Naboth blasphemed God and the King. But this expounder perverts God's holy word, and makes it encourage abominable sin; he goes to the distiller, brewer, and trafficker in the unholy poison, and tells him that the word of God sanctions and encourages the manufacture and sale of fermented things; that the Gospel of the Son of God is likened to a feast, and one of the ingredients in it is fermented wine. And because the part of the earth our lot is cast in does not grow grapes, we are obliged to cause those things to ferment that will ferment, and so produce those liquors that have the strongest resemblance to fermented wine. He gives them leave, nay, commands them; and lest they should be doubtful in their minds, he assists them. And if the gospel is to be received for food and drink to our souls, for consolation and gladness, a very proper conclusion is, we must receive the wine, or the thing our country produces instead; for if we do not know the gospel, nor its effects on our souls, nor wine nor its effects on our bodies, then the making use of the wine in the allegory conveys to us nothing. Jezebel was a heathen, a worshipper of Baal, and better could not be expected of her, for might was right in her eyes, but now with us, might does not constitute right, but God's law is to be obeyed, and we are to shun the very appearance of evil, and this is what is preached to us by this teacher. With what darkness is he shrouded: he calls evil good, and good evil, and does not know it, and yet he seems to know it, for he says he does not drink of alcoholic liquors himself, and condemns it whenever he sees it drunk. If he occupied any other position in society he would be less dangerous, he would not be tolerated by the public, he would soon be silenced. But as he is, people are afraid to shew him the right way.\n\nAn instance in one particular, similar to this course of conduct and preaching, is when our Saviour cast a devil out of one that was blind and dumb, the Pharisees ascribed the power to Beelzebub the prince of the devils, making out that Christ was in league with the wicked one. And when it was to serve a purpose, the arch-fiend could dispose of his imps to serve that purpose. A wider difference does not exist between the power by which the devil was cast out and the opinions of the Pharisees, than there is between the effects of the Gospel on the Christian and the effects of the liquor on the drinkers; 'tis because he comes to us with \"thus saith the Lord,\" that men are afraid to attack his opinions, but it is our duty to examine the spirits whether they are of God or not, and reject them if the evidence is contrary. There is this difference: the Pharisees were open enemies, but this man is a professed friend.\nLet us suppose that one goes to the Roman Catholics of Ireland, or Lower Canada, and tells them that he has another gospel than the one they have; which he wishes to preach to them—it will instruct them in the only way of salvation—will purify their hearts and minds, and produce such a change that they will rejoice evermore. And the 6th verse of the 25th chapter of Isaiah contains a prophecy of the new gospel, the true word of life, in the figure of a feast which the Lord would make to all people on the holy mountain, the fat things full of marrow, and the wines on the lees well refined, are to shew from their strengthening and reviving effects on the body, the excellent character of the Gospel on the soul, the graces imparted and the joy produced. If they were told that the wines on the lees well refined, were well fermented, they would soon tell the missionaries of the new Gospel, \"we will not have your gospel, for it is but a short time since we were much addicted to fermented and distilled liquors, and found them very injurious, so much so that many of our nearest and dearest relations lost their properties, ruined their families, their characters and lives were sacrificed through this beverage. And if your gospel resembles that, as you say it does, why Fathers Matthew and Clinique have put us on our guard against your gospel, and have shewn us a far better one, that wherever they go is received with gladness and beloved, and very convincing it is too, for our homes are happier, and we are leading much pleasanter lives; therefore, \"we seek no change, least of all the change you would bring.\" Experienced Christians, I ask you, wherein do Christ's graces and fermented wines resemble one another?\n\nI go on to my principal object of enquiry, the propriety of using fermented things as emblems of Christ's body and blood, broken and shed for many for the remission of sins, in the sacrament. The institution of the first supper should be our guide in this matter, which took place on the same night in which the Saviour of the world was betrayed. The Paschal supper being ended, Christ took bread, of such bread as was on the table, \"gave thanks and brake it, and gave it to his disciples, and said, Take, eat, this is my body.\" We are told by Christ himself to \"search the scriptures.\" The first thing necessary to find out is, what kind of bread was it that was on the table? The answer is, that kind that was used at the Passover, then we must go farther into the remote ages of the world. Do not tell us that every thing is dark and uncertain, there we will not believe you. Say not the unmeaning rites and ceremonies of Moses' institutions should not take up our attention in this fifty-ninth century from the creation. There is nothing from the beginning of Genesis to the end of Revelation commanded more positively than the observance of the Passover, nor is any thing connected with it left in doubt, every thing is minutely described. Exodus 12, 15: \"Seven days shall ye eat unleavened bread, even the first day ye shall put away leaven out of your houses, for whosoever eateth leavened bread from the first day until the seventh day, that soul shall be cut off from Israel.\" In the fifth verse of this chapter the lamb is described, \"Your lamb shall be without blemish, a male of the first year, ye shall take it out from the sheep or the goats.\" Verse 8: \"And they shall\neat the flesh that night roast with fire, and unleavened bread, and with bitter herbs shall they eat it.\" Verse 10: \"And ye shall let nothing of it remain until the morning, and that which remaineth until the morning ye shall burn with fire.\" If we would take the trouble to enquire into the character of the sacrifices and offerings commanded in the laws of Moses and meaning of them to the Israelites at the time, as well as the sense we should take out of them now, a rich treasury of truth would be opened to our inspection. We may not be able to discover a resemblance in every one of the rites of the law to some particular truth in the Christian system, but the more we search the more will we find. The sacrifices were all to be offered of perfect animals, there was to be no sickness, lameness, nor any spot or blemish about them. The Paschal lamb, bulls, rams, goats, kids, all were to be perfect, and any of them that were to be eaten by the priests or people, should not remain over night lest they should begin to ferment, and so lose their excellence, they were all types of the Saviour, who was without blemish or spot of sin. He did not ferment, he had no lust to strive against in himself, he saw no corruption.\n\nWe should not let any passage of holy writ pass unexplained that we can have explained by other passages of the Bible, especially those commands that the breaking brought the sentence of death on the transgressors. The Paschal lamb, in its full meaning, is explained to us from every pulpit, but our preachers give us no reason for the prohibition of leaven, although the same punishment was to be inflicted on any that even had it in their houses. There must be very weighty reasons for the banishing leavened things during the seven solemn days of the Passover. Leaven must be unholy, evil, bad in some particular—one thing is certain, it did not come from God's hand in that state—it is not procured from any vegetable or animal till death has taken place and is decaying fast. We saw before that the destroyin' of any good thing is disowned of God, and as we go on with our enquiries we will see that he lays it at the devil's door. In the forbidding fallen vegetable or animal matter in his sanctuary, in his ordinances he impressed on the mind of his people the decree that man, fallen, sinful man, in his present state, had no access into the presence of his Creator. Emblems are used to impress, by different means, the one thing, that our thoughts may be kept continually in exercise, that at every turn we may be reminded of the things we are never to let slip out of our minds. Emblems of Christ and of ourselves are presented to us on almost every page of the Bible. There is nothing too hateful or disgusting to be used by the inspired writers as emblems of ourselves; this is to teach us what we are in God's estimation, vileness, corruption, vomit, as smoke to the eyes, filth, dung. I need say no more, for they are in every person's mouth, and repeated daily.\n\nIf leaven was looked on by the Almighty as an emblem of sin under the old law, we can see no reason why it should not continue to be the emblem of sin under the Gospel dispensation. All the truths they were taught by emblems, were preached to them in the natural, literal meaning; all the difference in their case and ours is, that they lived before\nour Saviour's, we live after his appearance on earth. He was their Saviour, they looked forward to the fulfilment of his work, we look back. There was equal efficacy in his merits for them as for us, but it was intimated to them that the sacrifice and oblation would cease. It did cease when Shiloh came, and the Lord's Supper is to us what the Passover was to them, a commemoration of the redemption. The bread and produce of the vine used at the last celebration of the Passover, could only be such as was lawful at the first Passover, and what was used at the last Passover was what was used at the first Lord's Supper. After our blessed Redeemer's sending those who enquired of him the way to eternal life, to Moses and the Prophets, giving his high sanction to all that they had commanded, we cannot think that he deviated from the law in the observance of the Passover. He says to the Jews \"ye tithe mint, anise and cummin, but neglect the weightier matters of the law, these ought ye to have done and not leave the others undone.\" We will see that it is not only in the Old Testament but in the New also that leaven is used as the emblem of sin. Christ bids his disciples beware of the leaven of the Pharisees, which is hypocrisy, that feeling that puffed them up and deceived them, that pride that said \"stand by thyself, come not near to me for I am holier than thou.\" The Apostle Paul in speaking of the incestuous person to the Corinthians, says, \"and ye are puffed up, your glorying is not good, know ye not that a little leaven leavens the whole lump,\" which means giving his own words, that \"Evil communications corrupt good manners. Purge out therefore the old leaven.\" In using as a figure the custom among the Jews at the time of the Passover, of cleansing their houses of all corrupt and corrupting matter, the Apostle gives additional force to the injunction to purge from their society the person who had brought this scandal on the Church of God. He shews us that they understood well that leaven and sin are synonymous terms with God when he is teaching his people. \"That ye may be a new lump as ye are unleavened,\" that is that your society may be free from any one that may bring reproach on the profession of Christ. \"As ye are unleavened, as ye are sanctified, as ye are chosen of God out of the world, therefore you are not to keep company with any that is called a brother, if he bears any of the characters that are mentioned in the 11th verse of the 5th chapter of this 1st Corinthians, \"with such an one no not to eat.\" Therefore let us keep the feast (that is Christ's new institution or continuation of the old) not with the old leaven. The kind proper for observing the old feast is the kind he here enjoins them to keep the new one with, and he adds the spirit with which their minds are to be inspired—literally no malice or wickedness was to have place in their hearts, but sincerity and truth.\n\nI contend that he is giving instructions to the Christians in all future times to observe the ordinance in the spirit and letter too of the law. The apostle is here following up the humbling command given by our Saviour, in his sermon on the mount, when he taught the multitude, saying, \"Therefore if thou bring thy gift to the altar and there remember that thy brother hath aught against thee, leave there thy gift before the altar and go thy way, first be reconciled to thy brother, and then\ncome and offer thy gift.\" Christ is addressing the one who has done the scandalous thing—Paul is speaking to those who are on their guard against the tempter. Christ is addressing the individual—Paul the Church, leaving no room for either to say this is not directed to me.\n\nAt the time that Luke wrote the Acts of the Apostles, it would seem that the early Christians observed the feast of unleavened bread, from the expression he uses on two different occasions, Acts 12th chap. 3rd v., \"Then were the days of unleavened bread,\" and chap. 20th 6th v., \"And we sailed away from Philippi after the days of unleavened bread,\" plainly intimating that they were to them the days of unleavened bread, the slaying of the lamb being done away with, and the feast no longer called the Passover as it was named by the Evangelists in their histories of Christ, while he was on the earth. Jeremiah 6th c. 16th v., \"Thus saith the Lord, stand ye in the ways and see and ask for the old paths, where is the good way, and walk therein, and ye shall find rest for your souls.\"\n\nIgnorance of the word of God often leads us to make wrong comments on passages, which if properly understood, would be of great benefit to us if explained in accordance with the spirit of the Bible. The 11th chapter of 1st Corinthians is taken by the opponents of the advocates of our unfermented wine in the Sacrament to build their opinions on, whereas if they would lay aside their prejudices and examine the passages, they would see that the Apostle is reproving them for another impropriety they were guilty of. They had met in the Church and displayed their wealth to the offence of their poorer brethren—they eat and drank abundantly, for which he reproves them sharply in these words:—\"What! have ye not houses to eat and to drink in, or despise ye the Church of God and shame them that have not? What shall I say to you—shall I praise you in this, I praise you not? He knew well that when his Lord and master instituted the Supper, that it was after he had along with his disciples eaten the Passover, and therefore a full meal was not proper. He says, \"If any man hunger, let him eat at home, that ye come not together unto condemnation,\" which shows that it was in kind, not in such a large quantity as would satisfy a hungry person, that the proper observance of the Lord's Supper consisted. In allusion to this erroneous practice he says, 20th verse, \"This is not to eat the Lord's Supper.\" And referring to this practice and the practice of the other Apostles in the 16th verse of the 10th chapter, he says, \"the cup of blessing which we bless is it not the communion of the blood of Christ, and the bread which we break is it not the communion of the body of Christ?\" He had before told them in the 5th chapter, that leaven should not be used on this sacred occasion, and here he refers to the articles he and the other apostles used, by laying a particular emphasis on the Cup of Blessing which we bless, and the bread which we break. With overwhelming force he might tell us in referring to the bread and wine we use, \"This is not to eat the Lord's Supper.\"\n\nThere are but two verses in the Bible in which Heaven is made use of as a figure to convey the knowledge of anything desirable; they are Matthew 13, 33, and Luke 13, 20: \"The kingdom of heaven is\nlike unto leaven which a woman took and hid in two measures of meal, till the whole was leavened.\" Now, it was for its penetrating power on the mass in which it was mixed, converting the whole into its own likeness, that it was made use of as a figure to show how the gospel would spread in the world: it was not to illustrate any of the doctrines of the Bible, but merely the conversion of mankind to another system. A stone cut out of the mountain without hands, overthrew the image, in Nebuchadnezzar's dream, was to show the king that his government, and others that would come after his, must give place to another that would continue forever. It taught no doctrine—no article of faith—but merely that another power would reign supreme and universally over the earth.\n\nEvery view we can get of the temperance movement leads us irresistibly to the conclusion, that the hand of God is at work in it. Drunkenness had overspread Christendom: the liquor was in every house, till some lovers of humanity commenced a movement to suppress the vice. God, by his providence, was saying to them, then, \"Come, and let us reason together.\" The Temperance Society—the moderation pledge—the allowing of wine, beer, and such like drinks—were the order of the day, but the stronger liquors were prohibited. This state of things continued but a short time, when it was found necessary to adopt total abstinence. But here the Bible was brought in to oppose its progress, and infidelity was charged on the instruments of this heaven-born work. If anything deserves well of Christians in the present day, it is this movement: \"Let us never despise the day of small things; let us examine all things, and hold fast that which is good.\" After the Bible was opened to us by those who had courage to examine the doctrines, whether they were of God or not, being convinced that they were, they were then endowed with courage to attack the practice of using fermented wine in the sacrament; and though those churches that have adopted the use of unfermented wine in the sacrament, may have done it without knowing all the reasons that the all-wise God had for forbidding ferment in the eating of the passover, yet, when they believed that intoxicating wine was not a fit emblem of the blood of Christ, and discontinued it, who knows but that He who will come to judge the quick and the dead at the last day, will accord to them the blessing Thomas missed: \"Blessed are they who have not seen, and yet have believed.\" The same thing may have been said: we know that it is acted on to this day, by the Churches of the reformation of this movement, and the promoters of it, what Gamaliel said to the council: \"Refrain from these men, and let them alone; for if this council, or this work be of men, it will come to naught.\n\nAnd now, when we see it increasing in importance till it has become one of the most influential societies in our country, in spite of all the opposition that was and is raised against it, may we not conclude that it is of God? After it has convinced all that it is benevolent in its effects—that it raises man far above the reach of that misery he was surrounded with, and had within him when he indulged in the wine cup—can we say it is of man, fallen man; the imagination of man's heart is\nonly evil, and that continually? or can we say it is of the Devil? He never devised any good thing. \"Then it came from him who is the Giver of every good and perfect gift. The steps of a good man are ordered by the Lord, and he delighteth in his way.\"\n\nThe ministers of religion have some of them been true prophets, but the greater number were false prophets, and the people have followed the councils of the majority. Just as the Jews did in the days of Jeremiah, have the people done in our day. The few have preached peace and safety in abstaining from the wine cup and falling into the ranks of total abstinence; that society, not professing to have directly in view the glory of God, the salvation of souls, nor the purging from the Lord's table the improper elements used; but the result has far exceeded their expectations; peace exists where rioting abounded. The God of love can alone give peace; and where peace exists, the glory of God is advanced. Many of the reclaimed have sat at the feet of Jesus: His word is their delight; and they have liberty, which is only enjoyed under the yoke of our blessed Redeemer. Exactly similar were the views of the Babylonians: they knew nothing of the true God. It was only the glory of their own empire they sought, and the forming into one all the nations of the earth, that science and art might be improved, and that under one head, and having one common interest, there might be universal peace, uniformity of laws, and other advantages that could not exist under a different state of things. Little did they think that the subjecting of the Jews to their yoke would be the means of preventing that people's ever degenerating into idolatry again! As little did the teetotallers contemplate the banishing fermented things from the Lord's table: indeed, they knew not that Christians were in error at all. The true prophets preached peace and safety to the people, if they would submit to the Babylonish yoke. The few ministers now preach safety and comfort in abstinence from intoxicating liquors. The false prophets told the people not to serve the king of Babylon: the many of our teachers tell us that total abstinence is not according to godliness. The king of Babylon confessed of a truth: it is, that \"Your God is a God of gods and a Lord of kings.\" The total abstinence principle now confesses that the Bible guides to sobriety, and teaches abstinence from all that is evil. The king of Babylon set up a golden image in the plain of Dura, and commanded all people, nations, and languages, to fall down and worship it. There was no argument used with equal success to the purse persuasions of the advocates of total abstinence. Money—gold—gold! consider the pocket: the saving of a penny a day will amount in a year to a pound, a half pound, a groat, and a penny. Thus it was a golden image; or one of the images held up for our worship was gold. The king of Babylon ruled over an empire consisting of all people, nations, and languages. The total abstinence society consists of members of all the various denominations known amongst us, and is as mixed a mass as that ruled over by Nebuchadnezzar—all the ans, ants, ics, ists, ers, arians and aliens that can be named amongst us. Lutherans, Moravians, Protestants, Catholics, Methodists, Baptists, Quakers, Unitarians, Presbyterians and Epis-\ncopilians, names unknown to that proud king, but known to us as his conquered nations, were known to him. The three children were cast into the burning fiery furnace, and came out unhurt. Every article in the teetotal creed was tried, so to speak, in a furnace of fire, heated by the malice of the wicked one seven times more than it was wont to be heated, and the smell of fire passed not on it; for in the midst of the fire men saw plainly that the word of God and his providence were about the work.\n\nWe may yet, in the providence of God, have to lie in the Lion's den. But those who put us in will have to take us out again, and confess, as Darius did, and \"make a decree, that men tremble and fear before the God of Daniel; for he is the living God, and steadfast forever, and his kingdom that which shall not be destroyed, and his dominion shall be even unto the end. He delivereth and rescueth, and he worketh signs and wonders in heaven and in earth, who hath delivered Daniel from the power of the 'ions.'\"\n\nThe Babylonian power only existed as long as it was necessary for the punishing of the Jews and for the convincing of them that the God of Israel was the true God. The total abstinence society will only exist as long as it is necessary to banish from the table of the Lord the emblems of corruption. The living God would never have suffered the land of Shinar to exalt itself over the land of Canaan, which is the glory of all lands, had not the land of Canaan been sunk lower in crime than all other lands, their privileges considered. The Christian Church would not have been sunk into a lower state of drunkenness than others, had not the ordinance been changed. The temperance society would not have arisen amongst us, but for this degeneracy. The ministers of religion, after the society had acquired strength and position in the community, urged all to unite themselves to it—recommended strongly all who were in danger of drinking to excess to sign the pledge. But, O! how blind they were to their own duty, and to the extent of the work that was given them to do! Was not their commission to the extent of all moral tendencies, as well as to the violation of any positive and direct law of God? \"Avoid the very appearance of evil,\" was a command to them, as well as to their flocks. Now, if the drinking of intoxicating liquors has an immoral tendency—if it leads to excess in sin—surely part of their work was to preach against it altogether. It is well known that nine-tenths of the crimes that are brought before the tribunals of our country, large and small, from the Queen's Bench to the Magistrate's Court, are caused by the drinking of intoxicating liquors. Do not the ministers of religion, in giving over to the Temperance Society (a Society distinct altogether from the Church) those who use the liquor—aye, and those who do not use it, too, when they urge them to take the pledge, give up nine-tenths of their work?\n\n\"God's threatenings are not vain words.\" Has he said, and will he not do it? Lev. 10. 9. \"Do not drink wine nor strong drink, thou nor thy sons with you, when ye go into the tabernacle of the congregation, lest ye die.\" Hab. 2. 15. \"Woe unto him that givest his neighbor drink, that putteth thy bottle to him and maketh him drunken.\" They\nhave done it since the reformation, the much boasted of reformation. Who among us has not known ministers of the gospel, of the greatest talent and purest theology, fall down before the demon, intemperance; and members of high standing in the church so debased by drunkenness as to be deprived of the privileges they once enjoyed? Isaiah 42. 25. \"Therefore he hath poured upon him the fury of his anger and the strength of battle, and it hath set him on fire round about. Yet he knew not: and it burned him; yet he laid it not to heart.\" Most fully do the words \"yet he knew not,\" describe our condition. \"And it burned him,\" the sufferings, \"yet he laid it not to heart.\" The self-blinded state of our minds as to the cause of all the misery we have endured. Is. 9. 13. \"For the people turneth not unto him that smiteth them;\" v. 16. \"For the leaders of this people cause them to err, and they that are led of them are destroyed:\" v. 17. \"For all this his anger is not turned away, but his hand is stretched out still.\" This is God's way of punishing mankind: he leaves us to the fruit of our own doings. Thus he did with David. His injury to Uriah's bed is punished by Absalom doing so to his. The reformed Churches are punished by drunkenness, because they have brought fermented things into the house of God. David sinned secretly, but was punished before the sun—before all the people. Our churches sinned within the walls of God's own house; but the drunkenness of the office-bearers is public; it is no secret. Through their sin the enemies of the Lord were made to blaspheme. Let us not say their ignorance or their overlooking the kind of elements to be used as emblems of Christ's broken body and shed blood, will be an excuse for them, and will save them from punishment. God appointed sacrifices for sins of ignorance in the old law, and our Mediator thought it necessary to plead for his crucifiers, though they were ignorant of their sin and thought they were doing God service. Those who were then saved, and those who are now saved, are saved in spite of themselves and their sins. The leavened bread in the sacrament is in spiritual food fed out to the churches of Luther, Calvin and Knox. We see it in the Arminianism and other errors that have filled all the existing denominations that have branched out from them. Leaven adds no nourishing quality to the flour, neither do man's fallen man's efforts, add to the efficacy of Christ's finished work.\n\nWhere the doctrines of free grace have been most efficiently preached, there has drunkenness rioted. In Scotland, that has laid the flattering unction to her soul, that she has continued to enjoy the purest system of religious instruction, there the greatest quantity of ardent spirits is drunk. By a statement made in the papers, the average in England drunk by each individual was four pints, in Ireland six, and in Scotland twenty pints. God gave them, at the Reformation, the stronger doctrines of the Bible, and as if there was some mysterious connexion between the alcohol and the doctrines, they have dwelt together in their strength. May we not say that some such council was held in the unseen world as was held in the days of Ahab? \"Who will persuade Ahab that he may go up and fall at Ramoth Gilead?\" Some spirit has persuaded the Christian Church that intoxicating li-\nquors are a blessing; a gift from a bountiful providence; that is, a certain universal medicine, and a beverage that could not be dispensed with, and because of this false impression of its goodness, never questioned the propriety of using it as an emblem of Christ's blood. Oh, how unlike it in every particular! If we can now see our sin in the punishment, which may God grant, and make confession of our sin and turn from it, and bring back the proper elements to the holy ordinance, who can tell but God will be merciful to us and bless the labour of our hands?\n\nIn the days of Malachi, the Jews were visited with famine because they robbed God of the tithes and offerings. \"Will a man rob God? yet ye have robbed me. But ye say wherein have we robbed thee? In tithes and offerings. Ye are cursed with a curse, for ye have robbed me, even this whole nation.\" Then he says, and let us listen to our gracious God pleading with us as he did with them—\"Bring ye all the tithes into the store house, that there may be meat in my house, and prove me now herewith, saith the Lord of Hosts. If I will not open the windows of heaven and pour you out a blessing that there shall not be room enough to receive it. And I will rebuke the devourer for your sakes, and he shall not destroy the fruit of your ground, neither shall your vine cast her fruit before the time in the field, saith the Lord of Hosts.\"\n\nIs there, on the face of the whole earth, such a contradiction as there is in this? The purest system of morals, the most exquisite sensibility, the nicest distinctions between good evil, the most exalted hope, and the best rules for our guidance in all our conduct to one another, at the same time the greatest degradation in drunkenness of all other people. The sin of Judah is written with a pen of iron; and with the point of a diamond it is graven upon the table of their hearts, and upon the horns of your altars. In the most prominent of the services of our holy religion, in the sanctuary of God, there are the emblems of sin used as emblems of the Lamb of God, in commemorating his great work of taking away the sin of the world. The wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who hold the truth in unrighteousness. The heathen changed the glory of the uncorruptible God into an image made like to corruptible man, wherefore God gave them up to uncleanness; he has done the same with us, Christians, for we have used the most corrupt and corrupting articles to represent our Saviour, and a righteous Providence has handed us over to Bacchus, and he has ruled over us and blinded our minds to the truth; and now, when from all well regulated houses fermented and distilled liquors are banished, they are yet retained in the house of God, and the ministers are the last to put forth an effort for their complete disuse. Is it not reasonable to expect that a very sore punishment will be inflicted on this generation, and the sin of the Reformed Churches visited on us, because we did not begin at the house of God to purge the abomination?\n\n\"He that despised Moses' law died without mercy, under two or three witnesses; of how much sorer punishment, suppose ye, shall\nhe be thought worthy, who hath trodden under foot the Son of God, and hath counted the blood of the covenant, wherewith he was sanctified, an unholy thing.\" We know Him who hath said, \"Vengeance belongeth unto me, I will recompense saith the Lord.\" The walls of Jericho were thrown down at the Reformation. \"The just shall live by faith\"—accomplished that, but we have got no further; we were smitten at Al, and are in confusion ever since. Protestantism has made no advance on Romanism since the days of the first Reformers; in some places they have gone back to Rome, in others to Rationalism, to Infidelity, to Socinianism, and other errors. They used dead elements in the Sacrament; emblems of discord, of separation, of schism, and they were divided on all hands. The leaven was set to work when the first of their sacraments, in both kinds, was held; a similar effect was produced on the people that was produced on the dough when mixed with leaven; it is swelled up, or puffed up, as the Apostle called it, so each of the reformers took up an opinion and maintained it. They split asunder on the question of transubstantiation, and remain split still. They had the wrong question—a question that had no relation to their wants. If they differed on the doctrines of God's omnipresence and unchangeableness, then they might argue what they did with some show of reason; but when they agreed on these doctrines they might very well take Christ's promise and rest on it, that, \"Where two or three are met together in my name, there will I be in their midst to bless them and do them good.\" Luther had a dream. He thought he was writing, and the feather of his pen was so long that it reached to Rome, and tickled the ears of the Lion, and disturbed him in his sleep. But what would have been the effect if no error had crept into Luther's own system; would not all the errors of the Church of Rome have vanished as rapidly as the errors of heathenism did in the days of the primitive christians, unless we think that God's \"hand is shortened that it cannot save, and his ear heavy that it cannot hear?\" \"Is the Spirit of the Lord straitened? are these his doings?\" He has declared that the path of the just is as the shining light that shineth more and more unto the perfect day. We have only to read the history of the ancient people of God, the promises and threatenings that were laid before them, to know that God is true, and will prosper us when we obey him. The rule is as good in the case of a nation as of an individual. Compare the success of the reformers with those of the primitives. These fifty years we have organized missionary stations in some of the heathen countries, but little has been effected. Look at India, where the inhabitants are water drinkers, and ask ourselves what success we can have there when the inhabitants know that intoxicating liquors are used by us on common and sacred occasions; when they see our missionaries, our merchants, our armies, and the British Government there use it, traffic in it, and derive revenue from it, and what is worst of all, use it as the emblem of Christ's blood, \"shed for many for the remission of sins?\" Now, we must confess that they are superior to us in this, but we will get up to them in this, and then we will have more influence to turn them from\ntheir idols. At the present time there is a very wealthy heathen in Calcutta, setting himself against the drinking customs introduced by Europeans. A heathen puts Christians to the blush; he heads a temperance movement at the time that a missionary of the Gospel, under the influence of intoxicating drink, is beating the natives with a pair of strong shoes, for not responding to the service; and the missionaries to Persia and India, Archdeacon Jeffreys among them, say of fermented wines, \"these are the wines that ruin Christian converts.\" If the missionaries to the Roman Catholics, now that they follow to some extent the practice of Total Abstinence, were to tell the people that their priests had kept from them the wine in the sacrament, contrary to the express command of Christ, at the first institution of the Supper, \"Drink ye all of it\"—if our missionaries were asked, what kind of wine do you use? the answer is, fermented wine—would they not drive them from them with such language as this, your Christ must be a very evil one, when at his Supper, provided for the nourishment of the bodies of his followers, he gives them intoxicating wine, that robs them of their senses and hastens their death, being poison. You say that he made all things—that he is God equal with the Father—that he is all goodness and love—if he is, there is a great contradiction in your statements. All love and goodness, and yet gives his followers poison at supper, an article that God never made in the fermented state; for it is the \"spirit of the power of the air, the spirit that worketh in the children of disobedience.\" Now we know that it is the Devil that worketh in the children of disobedience, therefore we conclude that it is an evil spirit that is in the air that causes God's good creatures to ferment. We know that fermented things are evil in their nature and effects; they are rotten, and the alcohol that is first thrown off is preserved for the use of man, so that it seems to be your Christ's opinion that God did not make a good enough beverage for his table, it had to pass through the devil's hands. And if your Sacrament is significant of anything, it is of damnation, not of salvation. Therefore, we reject your Gospel, your Christ, your Saviour. Our judgments, our consciences, all our faculties tell us that fermented things are evil, and though we continued long in the use of them, 'twas because we were blinded by veneration for our fathers' ways, that we would not take a lesson from the brutes, and reject the poison with horror. Is it not a base reflection on God's wisdom, his creating power and goodness, to banish from our own table, for its effects, fermented liquors of every kind, and yet use it when we meet to celebrate Christ's love in dying for fallen man? We \"strain at a gnat and swallow a camel.\" What blindness to retain it in the holy place, while we reject it in our dwellings, and at our private feasts. What, are your tables more pure and holy than mine? May not our Redeemer ask, are the influences that drop at your feasts of greater effect or moment than those that flow out of mine? Should we not hide ourselves in the dust for shame, because we have not seen how basely we reflect on him and his salvation? There cannot be a more damning affront offered to the Saviour, than providing that to commemorating his dying love to man with, and say, this leavened bread and\nfermented wine is my body and blood, or the emblem of my body and blood; for I cannot think that any person who has read the twelfth chapter of Exodus, and a great many other passages of Moses' writings, forbidding leaven to be taken into the sanctuary or temple, or to be kept in the people's houses during the Passover, on pain of death—and knowing that Moses spoke by divine command—I say that no person that believes the Bible to be the Word of God, can believe that those were leavened things at the table when Christ instituted his Supper; for if leaven was prohibited because it was the emblem of sin and the sinner, at the first Passover, it continues to be so yet. Let us not take to ourselves such a refuge of lies as this, that it is a thing indifferent, that God does not regard the kind of bread or wine in the Sacrament, if we but look through the elements up to the Saviour, who is the bread of life to a perishing world, if we feed on him by faith. Now, I say, that it is not fit, it is not solid, it is puffed up. What has puffed it up? Leaven. What is leaven? It is an extract from dead vegetable matter put in to corrupt and fill with a deadly gas the bread of life, that without it would be the fit and proper emblem of the grace of God, that is as powerful and as efficacious as it professes to be. And this corrupted bread is only a fit emblem of the counsellings of the wicked one to Eve. \"Ye shall not surely die,\" was the deceitful assertion of the devil, when tempting Eve. \"And when the woman saw that the tree was good for food and pleasant to the eyes, and a tree to be desired to make one wise, she took of the fruit thereof, and did eat, and gave also unto her husband with her, and he did eat.\" They were deceived by the wicked one, and the council resembled the well raised loaf that is puffed up with a gas that we cannot inhale the second time, for the first breath kills us. Adam and Eve desired to be as God, knowing good and evil, and that which promised them this felicity was the very thing that sunk them lower in the scale of being, and rendered them liable to death, temporal, spiritual, and eternal. They wanted to know good and evil, as the speculators that the author of \"The Wine Question Settled\" tells us of, who wanted to get all the alcohol that escaped out of the bread while baking. They constructed an apparatus that they thought would bake the bread and save the gin, but the scheme, after upwards of twenty thousand pounds had been spent upon it, failed, and left the speculators minus their money. Bread would not be puffed up unless leaven was in it. Alcohol would not be produced unless leaven was in the article it is produced from. As leaven was forbidden in the sanctuary because it was an extract from dead vegetable matter, so our works are not to be plead in the presence of God because they are the works of a corrupt, and dead-to-good nature.—Leaven was forbidden because the flour was perfect without it—so Christ's merits require no help or aid. Without our own works of merit we can be saved, but with them we cannot. Nothing good for our nourishment flows from dead, corrupting matter; from ourselves nothing comes that will be of any use in gaining us heaven. Leavened things were forbidden to teach the people of God that no human being has the privilege of going to the throne of grace in his own\nname. By sacrifices they were taught that a substitute must be found that has not undergone the evil change that they have. Then ever blessed be his name who is our substitute, in whom infinite perfections exist, who is the unleavened bread to our souls, of which, if we eat, we shall never die. But, O, this unleavened bread is not palatable, it is not good to our taste, we do not think it wholesome, and we see no reason why we should afflict ourselves by eating what we dislike. Just so, the Bible says that of it—calls it the \"bread of affliction.\" Deut. xvi. 3. \"Seven days shall ye eat unleavened bread therewith, even the bread of affliction.\" Isaiah xxx. 20. \"And though the Lord give you the bread of adversity and the water of affliction.\" Does not this teach us a truth, a truth to be deplored by us all. God's way is very loathsome to us; we do not desire the imparted righteousness of Christ, we fly to the covenant of works and persuade ourselves that by it we may live. We are all Pharisees of our own works; we boast, \"God I thank thee I am not as other men are.\" How loath we are to follow the example of the Publican—to receive our justification of free grace—to be clothed with a robe of righteousness which is not our own—to eat of the substantial feast God has provided for us—to drink of the fountain of living water, without money and without price. The whole host of heaven is astonished at our insanity, for \"hewing out to ourselves cisterns, that can hold no water.\"\n\nThe mission to the Jews cannot prosper, for the sufficient reason that fermented things are used to commemorate the dying love of the Saviour of the world—their knowing that leaven was forbidden by God himself, to commemorate their deliverance from the Egyptian bondage, and that the sentence of death was threatened for even keeping it in their houses during the seven solemn days of the Passover. Mr. Herschal, a converted Jew, now preaching in London, writes the author of the \"Wine Question Settled,\" in his (Mr. Herschal's) \"Brief sketch of the present state of the Jews,\" says, \"the word homits (or chomits) has a wider signification than is generally attached to leaven, by which it is rendered in the English Bible. Homits signifies the fermentation of corn in any shape, and applies to beer and to all spirituous liquors distilled from corn. While, therefore, there are four days of Passover week, on which business may be done, being, as it were, only half holidays, a distiller, or brewer, must suspend his business during the whole time. And I must do my brethren the justice to say, that they do not attempt to evade the strictness of the command, 'to put away all leaven,' by an ingenuous shift, but fulfil it to the very letter. I know an instance of a person in trade, who had several casks of spirits sent him, which arrived during the time of the Passover; had they come a few days sooner they would have been lodged in some place apart from the house until the feast was over; but during its continuation he did not think it right to meddle with them, and after hesitating a little what to do, he at length poured the whole out into the street.\" \"For the Passover the Jews make a wine from raisins, by pouring water on them about six days previous to the feast.\" We Protestants flatter ourselves and say, that our system is perfect, and are\nsurprised that heathens and Jews are so blind as not to see that all about our Zion is the perfection of beauty; but if we would take heed to our ways, and when we see that we prevail nothing at all, set about enquiring why we are discomfited before the enemy. Can we doubt that God will shew us plainly why he avenges the breaking of his laws, even in such small things as emblems, as he did Joshua when the Israelites were smitten at Ai? Whoso keepeth the whole law and yet offendeth in one point, is guilty of all.\n\nIn addition to the reasons already stated, why these corrupt things should not be used in the immediate presence of God, I would urge the fact of seven days being appointed for eating unleavened bread, and see what it taught the observers of this feast. As the Israelites used leavened bread almost all the rest of the year, they would find a great difference in the bulk required during this week, and would be astonished that they had such strength from such a small quantity of bread. So their dependence on the grace of God for strength to resist temptation to sin, would raise in their minds a feeling of wonder and gratitude. Paul prayed to have the thorn in the flesh removed, but was content when he was assured that God's grace would be sufficient for him. Such is the experience of every convert to Christ, after living on the leavened things of this sinful world for many days, and counting the religion of the Saviour foolishness, and regarding those who follow the narrow path that leadeth unto life, mad, and the keeping of God's commandments as striving after vanity, and seeing no beauty in him who is altogether lovely. But having his eyes anointed with the eye salve of the Gospel, he sees, and seeing believes, that the religion of Jesus is heavenly wisdom, and walking in the narrow path will prove him to be truly sober, and in the keeping of God's commandments there is exceeding great reward. Such a man can see the impropriety of using leavened things to represent the substantial wisdom of God, which enables him to glory in this, that he understandeth and knoweth God, that he is the Lord who exercises loving-kindness and righteousness in the earth. We cannot but regard these ministers and members of Christian Churches as consistent in their practice, who neither abstain from intoxicating liquors themselves, nor join in the effort to banish them from society, because they yet use them as types of Christ. So far they are consistent. They use them as beverages and as emblems, but they do not examine into the fitness of the emblems, and when they use them in the Sacrament, they cannot see a reason for abstaining from them on ordinary occasions. If one, who had long been used to the intoxicating bowl, had been so much reduced in body and mind, lost all self-respect and regard to the interests of soul and body through this poison—if such a man, on coming to himself, refrained from his old practice, because reformed, a sober man, regained what he had been robbed of by this deceiver, and become a member of a Christian Church, as soon as he had tasted the wine in the Sacrament the old appetite would be revived with renewed strength, and he would, in all probability, go back to the drink again—he would again discuss the question in his own mind, and could not fail to see, that in abstain-\ning from that cup on ordinary occasions, he would be reflecting on the usages of the Church, or on the redemption itself.\n\n\"Dust thou art, and unto dust thou shalt return,\" was the sentence pronounced on our race, and there is no possibility of escaping it. The same sentence is executed on grain of all kinds. As soon as the products of the earth are ripe, and if they are kept in accordance with the laws for their preservation, we cannot tell the ages they will exist in that form. So was it with man before he fell. But if they are in an improper state, get wet or damp, they will grow, and as soon as growth commences, they should be buried under the ground, that as the parts separate they may be taken up by the roots of plants that are growing, or the seed yet to be sown, and so become nourishment for new generations of those things which shall be food for man and beast. Now when these things are ripened they show forth the power, wisdom, and goodness of God; but when they are stript of the protection they once had—when they get into the destroyer's hand, then the sentence is put into execution, \"unto dust thou shalt return.\" We cannot, from our own experience, tell what the happiness of man was before he sinned, but we may well conclude that it was perfect. The condition of his faculties, which, from the just estimate he had of all that was brought within the range of his vision, we may infer were far superior to all the genius united of all that have descended from him. If there was as great a difference between unfallen Adam and fallen, as there is between a sober man and a drunken, and so doubly fallen man, and if there is as great a difference between good, ripe, perfect wheat, and the grains after the distiller is done with them, then we can see a good reason why he drove man out of Paradise, and why he forbade corrupt things to be brought into his presence in the sanctuary. The ordinances of his law were earntests of the restoration of man through Jesus Christ. Our righteousness, who, as man, fulfilled the law in our stead, and as God, had infinite merit that his righteousness might be made over to us, and we have enough and to spare. There was infinity of holiness in him who died and lay under the power of death for a time, that we, who had fermented—we who had lost some of the component parts of our integral state—we who had become a fraction instead of a whole number, might, when buried with him, be quickened by him who has infinity for a numerator, and so could spare without its being diminished to add to our numerator till it equalled our denominator, that so, being made perfect in holiness, we might immediately pass into glory. The man who has the righteousness of Christ imputed to him, is as the grain partially fermented, but has sufficient virtue left to reproduce—with the addition of the nourishment that it can get out of the earth—it's own kind. And the grain that has lost too much of the perfection of its nature, so that it cannot absorb those juices that are necessary to enable it to reproduce its own kind, is as the man who has sinned away his day of grace. I know nothing so profitable, so edifying, so well calculated to elevate the mind, to purify the heart, and to comfort and console us, as the figures made use of in the word of God, to explain those things that relate to our eternal peace.\nIt has long been our boast that we have the best moral law that can be devised, written by infinite wisdom, and approved of by all; that there never was any code of morals, nor can there be any, so universally perfect in its adaptation to the wants, circumstances, and character of mankind. Doubtless this is all true of it, but, if we were right in giving the meaning we did to those passages in which wine is approved of and recommended, then we make it worse than the codes of many other nations who have denied it to their people. Yes, many nations, not Christian, have forbidden their people to drink fermented wine—I believe all those in whose territory the grape grows to the greatest perfection. How vain was our boast of our Bible's perfection, when others had laws superior in every particular. We prove against it ourselves; we have toiled night and day to persuade sceptics to believe the word of God, but to no purpose, as long as we, as well as ourselves believed it encouraged the drinking of fermented or distilled liquors. We professing Christians have endeavored to jump over the stumbling-block, but they must have it removed out of the way before they advance. We do worse; we compass sea and land to make one proselyte, and after he is made, he is twofold more the child of hell than ourselves; because we liken the Gospel for its effects on our better part, to fermented wine on our inferior part; and though we overlook the emblem, and look for no teaching from it, yet the new convert cannot but go to the emblem every time he is at a loss for instruction. Archdeacon Jeffreys says, \"these are the wines that ruin Christian converts;\" and in the Sacrament we use it as the emblem of Christ's blood. When we do that a convert could draw no other inference than that it was the greatest of temporal blessings, and therefore should be used on all occasions. As we are to look to the throne of mercy at all times for grace, so we should drink abundantly of the emblem, that we may have a better acquaintance with the thing represented.\n\nThe Church will say, after it has banished fermented things from the Lord's table, and made total abstinence a term of communion, as the Psalmist said of old, after the children of Israel's journeyings in the desert, when they were set down in the land of promise—\"Thou hast led us forth by the right way, that we might go to a city of habitation.\" It would have been a vain attempt to endeavour to persuade the children of Israel to leave the land of Egypt, if they were told they must wander about the waste, howling wilderness, for forty years, and the bones of all their adults, from twenty years old and upwards, except two, should be strewed about the dry, parched land; yet a wise God knew it was necessary, for He works by means to prepare them for living a free people in their own land. It would have been a cause of anarchy, confusion, and strife, such as never existed in the Church, to commence at the Lord's table to attack the use of intoxicating wine. The Church had to unlearn all that it had been taught for at least three hundred years. It had the ignorance, the prejudice, the taste acquired, the love of the thing to combat. It had to learn from men of the world so many truths that are now established, before they would think of the question, that it would be scouted as an invention of the Devil, as blasphemy\nagainst God the Father, God the Son, and God the Holy Ghost; and\nthe gallows or stake would have been considered as too good a death\nfor the wretch who would have the audacity to whisper the thing to the\nmidnight zephyr. But, O, our God! thou hast brought us by a right\nway to a knowledge of the truth. O that men would praise the Lord\nfor his goodness and for his wonderful works unto the children of men.\nO think how this Achan in the camp has robbed Christ of his wedge of\ngold, and goodly Babylonish garments, the spoils of the Gentiles.—\nThink of the repulse that is given to all who approach God in the name\nof Christ; or, rather, we should say, think what a barrier Christ is in\nthe way of our approach to God, if we have the proper emblems of him.\nThink, why should not the land be filled with houses for the distribution\nof that for a price, which is the emblem of that salvation which is free,\nwithout money and without price, to all who will receive it? Tell us,\nwhy should not the deacon's, elders, and other officers in the Churches,\nbe distillers, brewers, and retailers of the liquid fire, when they are the\npersons who deal it out to the communicants on the high and holy day.\nThink, why, after the greatest revivals in the Church, is it that imme-\ndiately there follows another division, another parting of Christ's body?\nWhy is it that there are so many divisions, so many different denomi-\nnations of christians, when we know that the truth is one? There must\nbe something wrong in some of our doctrines, or else there would not\nbe schism instead of a closer union with Christ and one another. A\npuff of gas separates the solid, substantial dough, and a spirit is generated\nthat produces woe, sorrow, contentions, babblings, wounds without\ncause, redness of eyes, and other things of a similar character. 'Tis\nthe same gas that swells up a dead carcass, that raises our bread and\nbursts our beer bottles; and the same spirit is produced in the dead\ncarcass that is produced in the bread while raising, and thrown off\nwhile baking, that the attempt to save cost the speculators the twenty\nthousand pounds sterling which I mentioned before.\n\nSoon after the Reformation commenced, the old Arian schism re-\nvived, in the preaching of Socinus, and he was burned at the stake for\nhis doctrines. How cruel it was in those who did it, when it was their\nown teaching he followed. He preached that Christ was a mere man.\nI know they denied that in words, but they taught him as effectually\nin the emblems they used of Christ, that he was a mere man; for leavened\nthings resemble fallen man in so many of their features, that\nwhen we try to look through, we find a glass indeed; yes, a large\nglass—but that glass is a mirror which reflects our whole length more\nthan it reflects our mind and soul; and if we look closer into it, we will\nfind it reflects our destiny for time and for eternity.\n\nWe do not need examples, if time would permit, in which teaching\nof the emblems were followed rather than the literal preaching. I will\nonly mention one, although he gave up the teaching of the emblems,\nand took to the doctrines as taught literally. Dr. Chalmers, for the first\neight years of his ministry, was an unbeliever in the divinity of Christ.\nWho will attempt to give us a list of those who have fallen through\ndrunkenness—the brightest geniuses, the warmest hearts, and the best\nqualified naturally to take the lead in every good work. Tell us how many Chalmers' were lost for want of the proper emblems, and how many were saved to christianity through the laxity of discipline in the Church of Scotland. Error in doctrine, and drunkenness in life, are both taught in the emblems we use; for when we use a figure, a comparison, a type, an emblem, or a parable, we take the most effectual way of conveying our meaning. This was the plan adopted by our Saviour—\"for without a parable he spake not to the multitude;\" and we have not ceased to admire the excellent choice he made for confirming his preaching. The elements in use at the Lord's supper, amongst us, are not proper, for another reason. We are said to be united to Christ, by being made partakers of his body and blood. When we eat food it is converted into chyle. The juices that our system provides for the dissolving our food, does its work; and by vessels admirably constructed for the purpose, this chyle is carried to the lungs, and there having the power to extract the oxygen from the air we breathe, it becomes a bright red color—we then name it blood. Now, if we eat and drink those things that the juices act on and dissolve, and the vessels carry away, according to their proper functions, we are nourished and strengthened and revived. The more highly concentrated the food is, the more strength we acquire from it; and the better the liquid is for quenching thirst and carrying on any other purposes for which they are adapted to our system, the more comfort we enjoy. It is from the blood that the framework of our system is built up and renewed and sustained.\n\nThen, how can we say that fermented wine is a proper thing to drink, when we know that the alcohol that is a part of it is thrown off by the lungs—an unnatural passage for carrying off any thing that is received into the stomach? Filthy as we consider the lower passages of our bodies to be, they do not think themselves filthy enough to carry off alcohol. We know it well that alcohol is thrown off by the lungs; for we find the strong smell of it on every person's breath that comes near us, who has been drinking alcohol, unless the person's stomach and blood are so cold and diseased, that it cannot be taken up by the vessels. Much less can we say that fermented wine is a proper emblem of Christ's person, work, or the grace he imparts to those who hunger and thirst after his righteousness, after his salvation, after union and communion with him, seeing that alcohol does not unite with the blood and body, and knowing that Christ does unite with believers. Even those things that are proper emblems of Christ, in all his perfections, come far short of conveying to us the full value of his merits, the glory of his nature, and the happiness of the heavenly Canaan. Isaiah lxiv. 4,—\"For since the beginning of the world men have not heard nor perceived by the ear, neither hath the eye seen, O God; beside thee what he hath prepared for him that waiteth for him.\" We cannot conceive these things, therefore the figures and emblems fall short of the reality, but they are chosen, because of all earthly things they have the nearest resemblance to heavenly things. More than that, there was a man in Christ, whether in the body or out of the body, he could not tell.\nnot tell, how that he was caught up into Paradise, and heard unspeakable words, which it was not lawful, (or as it is in the margin) possible for a man to utter. See 2 Cor. xii. 4.\n\nIf we are not yet satisfied that we have the wrong elements in use at the Lord's table, let us do as the ancient people of God did in every perplexity, and as the Apostles did, when they wanted one to fill up the gap made by the loss of Judas—let us, by a solemn appeal to God by lot, enquire of him what evil is in us, and in his mercy he will answer us, \"the lot is cast into the lap, but the whole disposing of it is the Lord's.\" If it is found, after the answer comes, that we are contending against an evil that is as great and as ruinous to the body and soul, as sin in its greatest enormity, and that we are right in endeavouring to banish it from the face of the earth, then we will have the happiness to know that we came up to the help of the Lord against the mighty; and after this great work is completed, those who stand aloof from us now, will then \"hold their manhood cheap, because they fought not with us on this glorious day;\" and after the Church has taken on itself its whole work, it will be as fond of the lessons taught them on our platforms as it is now of the lessons learned by the Jews of Nebuchadnezzar and Darius. And this is my apology for what I have said—shew me Nebuchadnezzar's or Darius's apology, or shew me that any Jew or Christian has said to them—Ye take too much on yourselves, ye sons of Ham; and I will make humble confession that I have said what I should not have said.\n\nThe time is at hand when the inhabitants of one city shall go to another saying, \"let us go speedily,\" or as the margin has it, \"continually, to pray before the Lord, and to seek the Lord of Hosts.\" We, perhaps, see the beginning of that time in the Evangelical Alliance formed, in whose meetings delegates from almost every denomination of christians assemble. We have the Bible Society for the purpose of distributing the Bible without note or comment, and our own temperance society, on whose platforms so many victories have been gained for suffering humanity and for God, seeing that the Bible was made to recommend intoxicating liquors. But take courage ye old teetotallers; ye are foremost in the march of improvement, take it as a token for good, that you were first in the field with your world's convention in 1845 or 1846. Your example is followed by a Prince, and he takes the idea from you for gathering the specimens of the industry of all nations, under the roof of a crystal palace; he does more honour to you than that yet, for your principles are done homage to, for no intoxicating liquor is to come under the canopy of this house.\n\nIt is said that the process of distilling was discovered by the Arabs, and by them made known to others. The knowledge of this process is now possessed by all the civilized world. Now, it was prophesied of Ishmael that his hand would be against every man. In no particular can it be said of him to the same extent, as in regard of the matter of distilling, for wherever the distilled article has been taken, where it was not known before, it has cut off the inhabitants rapidly. We can hardly tell the number of tribes of North American Indians\nthat have been annihilated by the fire water. It is really astonishing that the devil has succeeded so well to blind the world to the true nature and character of alcoholic liquors. If they had thought of the prophesy respecting Ishmael and his descendants, recorded in the Bible, they might, at least, have received the instruction from his descendants, the Arabians, with fear and doubting, seeing his hand would be against every man. The world thought, perhaps, that they would have equal success against him, but, I think, we have not parried this weapon of his, but have rather bared our breast to it. I know not what deadly destroyer we were the means of sending to Arabia, but if we have sent any as deadly amongst them as they have amongst us, the prophesy is true to the letter. \"Every man's hand shall be against him.\"\n\n\"If I have given the true interpretation of the matter, then, I know, however weak and ignorant I may be, it will prevail. We have God's promise that his strength shall be perfected in our weakness, that is, when we are depending on him by faith, and raising his standard, his strong hand and his holy arm will gain him the victory. 'The sword of the Lord and of Gideon,' was the cry of Gideon and his three hundred, but we know that Gideon had no sword, neither had his followers; they had trumpets in their right hands, and lamps in their left hands, hidden by earthen pitchers; they broke the pitchers, the lamps shone, they cried 'the sword of the Lord and of Gideon'—stood still, and saw the salvation of their God. If we have the lamps and lights of God's truth, though surrounded by earthen pitchers, it is our duty to break the pitchers—that is, we ought fearlessly to speak out, and if truth is in us, if God is in the still small voice, then it will prevail, it will go on and be glorified.\n\nThe same voice is speaking to us that addressed the captivity of Judah. God grant it may be to as good purpose. The people among us are saying, as the people said then, \"The time is not come, the time that the Lord's house should be built.\" They are saying amongst us, \"it is too soon to speak out on the question of the wine in the Sacrament—agitate it amongst the people gently at the first, or we will be taken all aback; let them all become teetotallers and then there will be no danger of our breaking down.\" Then came the word of the Lord by Haggai the prophet, saying, \"Is it time for you, O ye, to dwell in ceiled houses, and this house lie waste?\"—\"Must your houses be purged before mine is of this abomination that maketh desolate? Now, therefore, thus saith the Lord, consider your ways, ye have sown much and bring in little, ye eat, but ye have not enough; ye drink, but ye are not filled with drink; ye clothe you, but there is none warm; and he that earneth wages, earneth wages to put it into a bag with holes.\" This is our condition too, we are as if our hands were tied, we are making no inroads on drinking. There is more drunk now amongst us than when the temperance society commenced its work; there are more distilleries and breweries, and there are larger quantities of the liquors made and drunk now by the community, than there was then, except in\nsome few places, and what is the reason there are no two opinions as to the merits of the question? All may w would be much better without it; it is not a necessary article. We have now no more controversies; every argument for their use has long ago been upset, then why do we not prevail? Why is it necessary to persuade men to join us, when they and we know that they are already persuaded of the propriety of joining us, and acting with us? The evangelical churches are in the same condition. They are striving, with all their energies, to convert the world, but they are doing it very slowly. Some of their ministers have united with us in the temperance movement, and they have had more souls for their hire, partly through the influence of the temperance principle, than those preachers who stand aloof; nevertheless, their hands are tied too, and they have not prospered as they had hoped. Many that belong to their congregations, of whom better might have been expected, are the greatest drawbacks to their usefulness, because they drink—perhaps moderately—of the cup that intoxicates. \"Thus saith the Lord, consider your ways, go up to the mountains and bring wood, and build the house, and I will take pleasure in it, and I will be glorified, saith the Lord.\" Go up to the mountain, go to where strength is for a supply of strength. Go to God for grace, to his law for direction, \"to the law and the testimony, for if we speak that that is not according to this word, it is because there is no light in us.\" We will find that the law forbids all kinds of ferment in the Sanctuary, and God will not permit a sinner to come into his presence. Bring wood, bring strong posts and beams, bring plates and rafters, frame them with braces and parlours, gather the people to the raising—call it not A Bee, but the whole hive of working bees—let there be no drones amongst us, and God will take pleasure in it and glorify the house of his honour. \"We looked for much, and lo! it came little, and when ye brought it home I did blow upon it. Why, saith the Lord of hosts?\" little success has attended the efforts of both the Church and temperance society? Why? \"Because of mine house which is waste, and ye run every man to his own house.\" We had no care of the house of God, if we could but get our own houses cleansed and built up, and made total houses. See how all the evils of the drinking custom would have been frowned on, and condemned by all true Christians, if they had adopted and followed up the Mosaic directions, with regard to fermented things in the Sacrament, and the Scriptures teaching that fermented things are a perfect resemblance of sin in all its stages. \"Vice is a monster of so frightful mien, that to be hated needs but to be seen.\" Drunkenness needs only to be seen to be hated. If we drink of the ensnaring cup the first time, we dislike it; repeating it, we become reconciled to the taste and effects, we by degrees get fonder and fonder of it until it ruins us. So is it with sin in general, and with every particular sin. So is it with a decaying article of food or an animal; the gases that escape from it get more and more offensive, until there is nothing of it left to be seen; but unseen it is working in the air we breathe, evils which\nwe cannot estimate; so that we can hardly carry the comparison too far. But if we had the Bible's teaching, and observed our own experience, we would be secure against the vice. If we were taught from the pulpits that in its origin, its nursing childhood, youth, manhood, old age, and death, and if could we see farther, we might say its damnation too—it resembled the Devil, the fallen angels, the lost sinner, and any other creature that will suffer the wrath of God to all eternity—\"For our God is a consuming fire.\"\n\nThere is a fearful disease brought on by the drunkard, which I conceive our Saviour had in view when he gives us the description of how the torments of the lost will affect them. \"There shall be weeping and gnashing of teeth.\" \"There shall be weeping and gnashing of teeth.\" I have never yet seen a case of delirium tremens, but those who have are at no loss to discover a part of its effects described by the words \"weeping and wailing and gnashing of teeth.\" The sufferer under the disease, yielding up his spirit at the time that he has the feeling that the bed is on fire in which he is lying, confirms what he has said as to the nature of the suffering of the lost.\n\nThe many examples related in the papers, of the drunkards taking fire and burning up, should open our eyes to see another particular in which the use of the liquor to or on the body resembles sin in its effects on the soul. Alcohol preserves fruits, it is said, and dead bodies are kept in it that they may be shipped from one country to another, that the dust may lie till the resurrection morn in the tomb of its fathers. This power to arrest for a time decomposition, is the counterpart on earth of those who are reserved unto the \"second death.\" Vinegar has the same power to preserve, and, for all I know, other results of fermentation possess it too. The temptations to sin, or the fondness for it, resembles the appetite for the liquor in this particular too, that no matter how revolting, the drunkard will have it. A man tapped the coffin in which was the dead body of an Admiral, and emptied it of the spirits on the passage home. The appetite for sin is as strong as that. The word of God says that the dead shall lie in their graves till the resurrection morn. A friend informed me of a circumstance that took place during the Reign of Terror in France. Many of the scientific had been decapitated by the guillotine. The murderers were remonstrated with. \"You will need them yet;\" and they did need them, when materials failed with which to make gunpowder. The chemists who were left were applied to, and they were sent to the graves of former generations, and there they procured new supplies of this explosive. Death, still—concentrated death—is obtained from completely decomposed vegetable or animal matter. Its being employed to destroy life in the most sudden manner, and most extensive plan, is worthy of our most solemn thoughts. It seems to have been done by the French to complete their defiance of the Almighty. They took the dust or ashes of their fathers out of their graves, and exploded it in the air, not only to kill their fellows, but, as it were, to give him a more difficult task in raising them up in that day.\n\nHaggai said—\"Who is left among you that saw this house in its\nfirst glory, and how do ye see it now, is it not in your eyes in comparison of nothing? Who among us has seen, in the page of history, the accounts given of the early christian's lives and conversations? The heathen remarked of them, \"See how these Christians love one another. Do we see anything like love amongst us? There perhaps is a little show of it in very small circles, but the earnest, heartfelt, devoted love, exhibited by the primitives so universally, is never seen. Why is this? They were united by faith to Christ, and they had the emblems of union, for they had unleavened bread and the juice of the grape unfermented, both of which would unite with the blood and nourish and sustain the body, and so be the means of conveying what the spiritual union meant. But the fermented bread we use is filled with a gas, a very injurious gas, that will not unite with the system, but must be thrown off by some unnatural passage. So with the alcohol; they must both be thrown off by the lungs, and do not nourish or sustain the system, but instead of good, do much injury, even in going off, for they excite the animal passions, and we get \"wounds without cause.\" The divisions among Christians is plainly shewn forth in gassy bread, and the strife and contention in the spirit. We may think it a small matter using leavened bread in the Sacrament; but let us remember that the Jews, too, thought it a small matter. Malachi said to them, in pleading for God,—Ye offer polluted bread upon mine altar, and ye say, wherein have we polluted thee? In that ye say the table of the Lord is contemptible. Let us, then, go to the work with boldness and strength from on high, and take encouragement from what Haggai said to the escaped of the captivity, \"And now, I pray you, consider now from this day and upward, from before a stone was laid upon a stone in the temple of the Lord, consider now from this day and upward, from the four and twentieth day of the ninth month, even from the day that the foundation of the Lord's temple was laid, consider it, is the seed yet in the barn. Yea, as yet, the vine and the fig tree, and the pomegranate, and the olive tree, hath not brought forth. From this day will I bless you.\" Remember also, and take encouragement from this prophecy, \"The glory of this latter house shall be greater than of the former, saith the Lord of hosts, and in this place will I give peace, saith the Lord of hosts.\" I don't want to make digressions, but this one excuse. \"In this place will I give peace.\" In the Lord's house, at his table, he has promised to give peace, not in human unions, such as the Peace Society,* composed of a ridiculous mixture of professing Christians, Infidels, Atheists, and every other ingredient of which society is composed, which is about as likely to succeed as the Babylonian tower was, in case another deluge came upon the earth.\n\nNo argument can be brought against the using of the same articles in the Sacrament that were used at the Passover; for if the change from any of the commands given by Moses, was calculated to lead to\n\n* They have had one failure since this was written.\nany error in doctrine or life, then we should abide by the letter, and keep before our minds all the meaning of the ordinance or whatever else is connected with it. Now, if modern Christians had observed the Sacrament, by using unfermented things, the drinkers of intoxicating liquor would not have the countenance of the Church's ordinance to encourage them in the use of them. As it is, the Temperance Society have the very stronghold of alcohol to demolish, and then its work will be done. True, it did not set out with this in view; but perhaps it is better for the Church that it did not, for it is very likely that they would have thought the task such a forlorn hope, that they would not have begun. If this work was once over, the Church and all other moral influences, would be exerted with greater effect. It would be possible, even with the imperfect race of beings we are, to banish drunkenness altogether, infinitely easier than it would be to clean our hands of murder, adultery, theft, false witness, or coveting: for if the intoxicating liquor was not made by man, it could not be drunk, for God never did make it, nor will he begin. Would to God we could clean our hands and our hearts of sin, as easy as we can of the emblems of it.\n\nAllowing, for the present, that human beings are justified in making laws, for the sake of the argument—although I deprecate their interference, and contend that in no case are they, by the Divine permission, authorised to make laws—He has given us a complete set of laws, and perfect; and when we make laws, it is saying that his are not complete, or else that man's authority is greater than his; and this is to confirm and establish what the inferior enacted. If it was prohibited by our legislatures and our laws, by the Church and its discipline, by our rulers and the ruled, we could have none of it. You may tell us it would be too high-handed a measure for any power in the state, but does any danger threaten it? The Habeas Corpus Act is suspended, martial law is proclaimed, and the power of the state is upheld. Is that said to be too high-handed a measure, or does any grumble? No: for of two evils, we say, choose the least. Take away the liberty from the people to manufacture, import or export—take it from the medicine chest and from the sacrament, and nothing but good will follow. When Zimri and Cozbi were slain by Phinehas, the son of Eleazar, the son of Aaron the priest, and the plague was stayed from the children of Israel—\"The Lord spake unto Moses, saying, Phinehas, the son of Eleazar, the son of Aaron the priest, hath turned my wrath away from the children of Israel, while he was zealous for my sake among them, that I consumed not the children of Israel in my jealousy. Wherefore, say, behold I give unto him my covenant of peace, and he shall have it and his seed after him, even the covenant of an everlasting priesthood, because he was zealous for his God, and made atonement for the children of Israel.\" Now, this act of his has been termed a rash, inexcusable deed, and no one should take it for an example in any case; but, how different was God's judgment in the matter? If the Church, or even if one minister of the Church put forth his hand, and banished from the Lord's table the emblems now used, that are so dishonoring to Christ,\nand raised his voice against it, \"no dog would move his tongue\" against him. No; for even Christ's greatest enemies discover in him an excellence—a perfection not to be found in any other, and can see plainly that these emblems cannot be emblems of a pure being. O ye protestant ministers that have thus been numbering off for the slaughter so many of the human race, in thus giving them the wrong emblems, this staff of reed—if God could hear you moaning your grievous error in this, as Ephraim did of old—\"Thou hast chastised me, and I was chastised as a bullock unaccustomed to the yoke. Turn thou me, and I shall be turned, for thou art the Lord my God.\" Or seeing that it is through your error that the people are devoted to drunkenness—if God could but hear you as he heard David, when he saw the destroying angel, say, \"I have sinned—I have done wickedly. But these sheep, what have they done?\" Let thine hand be against me and against my Father's house.\" God is as gracious now as he was then, and will stay the plague at this threshing floor of Araunah. It is written that Satan transformed himself into an angel of light. I would ask, what will you answer when brought to judgment, if you are shewn that you have done worse than the devil did, for you, the ministers of Christ, have given us the devil's picture, and told us to believe that it is the image of the Redeemer? We have taken the picture, and, as like begets like, we have become mad and furious, and have gone about seeking those whom we should love and protect, that we might destroy them.\n\nZechariah xiii. 6—\"And one shall say unto him, what are these wounds in thine hands? Then he shall answer, those with which I was wounded in the house of my friends.\" You may tell us that it is impossible to banish drunkenness from society. I say it is possible—even with man it is possible—for God does not make the liquor; and if man would not make it, neither cat nor dog, neither ape, monkey, nor fox, cute as they are, could do it.\n\nBut the time is passing as fast over our heads now as ever it did with our fathers, and we are nearer than they were to the period when \"there shall be nothing to hurt or destroy in all God's holy mountain.\" Then alcohol will not be there, for it both hurts and destroys. Our blessed Redeemer announced to the woman of Samaria that God's mountain extended to the eminence where they stood, and where any human being stood from the time that he was speaking to her to the end of time. There is no part of the earth without the human race, and wherever there is a living man there is an eminence—there is the place to worship the Father. Every man stands on an eminence, for where he is, the top of the earth is, and all others stand at an angle from the infinitesimal fraction of a degree to the three hundred and sixtieth degree in one direction. But that makes only one degree of longitude. We must take every degree, and every fraction of a degree of longitude to find out the top of the earth, the eminence now known as God's mountain. We must, then, take the commission, the letters patent granted by king Immanuel to the Apostles, \"Go ye into all the world and preach the Gospel to every creature.\" We have, then, the place to preach on, the top of the mount. We have the authority com-\nmanding, \"God with us,\" and the high commission as our passport.—We have also the promise of Him who is true to his promise, \"He who honoureth me I will honour,\" as our encouragement in the way of duty—what more do we want? We want preachers stored with Bible illustrations of the fall of man—the utter hopelessness of his condition without a refiner—without a substitute. We want them to be bold and fearless—to preach the Bible, the whole Bible, and nothing but the Bible. For we know that the least stumble, the least slip, will cause us to go back—that God cannot consistently with his own rectitude encourage any who are in error. As the general tenor of our way must be in accordance with His laws, so every particular act and opinion of ours must coincide with the perfect line of his holiness, or we will be repulsed at every onset on the enemy's camp, and thrown into the very ditch that corresponds with the nature and character of our error. Send us, O God, men after thine own heart, sons of thunder, and messengers of peace and love, sons of consolation.\n\nThere is a most important lesson to be learned by the world from leavened bread. We mix up a quantity of flour with leaven or yeast, but we do not know how much of the flour is converted into alcohol, and that destructive gas, and thrown off; consequently we do not know how much we lose or destroy, and how much of its strength we give to the four winds of heaven, for the purpose of making it lighter—we do make it lighter to our own cost. The lighter it is in proportion to the bulk, the more we like it. So we do not know how unjust we are to the bakers when we seize, perhaps all they have baked, because it does not stand weight, and confiscate it when they, by their so-called good baking, make it lighter to please us. I am making no apology for the bakers, but would suggest the idea for their benefit, as well as our own. Take a pound of flour, bake it without leaven, take another pound of flour and bake it with leaven, as they bake the round loaves, take a third pound and bake it as they do the pan loaves, bake the three fully, and give them the treatment best adapted to its own kind, then by the best way possible to find out the quantity of nourishment in each loaf, ascertain how much each has lost, you will find out that what they have gained in size they have lost in nourishment—that the size each loaf has become is the inverse proportion of the quantity of flour destroyed—that though a quantity of alcohol has evaporated, and a great bulk of gas been produced, the leavened loaves are much larger than the one that was not leavened, and though they are larger than it, yet it has most nourishment.* Then take a wider range—ascertain the quantities, if you can, of these obnoxious poisons produced, sent afloat in the atmosphere, and kept there (for there is no other place for them but pits when they can get into them) where they are inhaled by the lungs of man and animals, causing disease and suffering—find out, I say, if you can, the quantity sent off from the bakers' ovens, the\n\n* It was shewn in one of the public papers, a few weeks ago, that 16 per cent of the nourishment was lost in the raising of bread—this may be the average.\nbreweries, distilleries, and other places where they are made, and estimate the influence of the aggregate of these poisons on the lives of men and animals. Before you start on the enquiry, take one of the lower animals, and try if he can exist after once breathing the air of a brewer's vat. If it dies, you will be cautioned against under-estimating the influence of this same gas after it has escaped and adulterated the air of heaven. We know now that in the immediate vicinity of distilleries and breweries, and in thickly inhabited towns and cities, where there are the greatest number of these poison factories, there plague and pestilence take up their abode, and slay their thousands and tens of thousands, themselves being all the time covered with Jack the Giant-killer's invisible coat. We are at a loss to ascertain the means God employed for the shortening of man's days after the deluge, but I would think it explained very satisfactorily by the fact, that the polluting carcasses of the human beings who were living at the time of the deluge, the races of those immense animals now unknown, together with the innumerable multitudes of smaller animals that then peopled the earth—after their drowning, a few days was sufficient to generate carbonic acid gas, which swelled them up so that they floated on the waters, and soon after, the skin bursting, let the gas escape; it then lay on the surface of the water prepared to do its work of death, when living creatures were again placed on the earth. We know that consumption, a disease of the lungs that has hitherto defied the art of man, is more prevalent in those parts of the earth least elevated above the sea. We know that that gas sits in low places, for the water vomit it up, and the atmosphere tramples it under foot. In addition to the amount of these poisons of life, generated from the corrupting carcasses of man and animals, at the time of the deluge, we must add the quantities of the same poisons that were produced from dead, corrupting vegetation, from the largest tree to the smallest flower and blade of grass—but the task is too great for human calculators. Let us take the proportionate length of man's life in the two periods, the anti and post-deluvian. The length of his days, when he only had fermented, take at one thousand years, the length after all the world had fermented, take at one hundred and twenty, as it was the allotted period by the Ruler of all, when he announced to Noah his intention of destroying the earth by water; we may say, safely, that the atmosphere is as twelve to one hundred less pure and wholesome than it was before the deluge. Although Noah lived three hundred and fifty years after the deluge, yet few of his descendants exceeded the term of one hundred and twenty years. The strength of Noah's lungs aided him to resist the evil gases that were in the atmosphere; but new born infants could not resist, from their weakness, the deadly effects; and so the race of man was no longer so long lived. It seems that Noah himself was not fully aware of the evil that was in the atmosphere, for he planted a vineyard and drank the wine, unsuspectingly, in as large a quantity as he had been in the habit of drinking before the deluge—he had let it ferment, and it made him drunk. His son Ham finding him in a state he had never seen him before, wished his brothers to join in\nthe sport, to come and see this new thing under the sun—their father drunk.\n\nWe have the evidence of our own experience, that the atmosphere is contaminated by the gases emitted by decaying vegetable matter; for, in the vicinity of swamps, canals, mill-dams, and such like, where the water has overflowed the roots of trees, and the other things that were growing, and killed them, there fever and ague and other complaints abound, because of the quantity of corruption that is in the air; and as the swamps are drained, the country opened, and a free circulation of air-coming from the higher and drier districts, these parts become more wholesome, and there is less sickness.\n\nThe diseases and pestilences that have in former periods cut off the inhabitants of the earth, may be in a great measure accounted for by supposing that the gases producing them were generated in those dark and fearful swamps that are to be found in hot and eastern countries, where the inhabitants are pagans and idolaters—worshippers of the crocodile and other hideous monsters. Their considering these reptiles sacred, spare their abodes from the trespassings of the axe, and the fires of the brush, and log heaps, and so perpetuate the desolations of the cholera and other epidemics. After generating in these swamps other causes operating to carry them round the world, the rest of mankind would be made acquainted with the products of the abodes of their deities. If there was no other reason for extending the blessings of civilisation to the ends of the earth, this one reason, the cleaning up their swamps, should be sufficient to urge every selfish man to put his shoulder to the work.\n\nOne great discovery made lately—a cure for the cholera—goes a great way to confirm what I have said on this matter. Give the sufferer a larger proportion of oxygen gas to inhale than there is in the surrounding atmosphere, and the cure is effected. Yes; give them the living principle—give them that which God breathed into Adam's nostrils—the breath of life—and all is right. But there is a cure promised for the earth, which we can see applied occasionally on a small scale. A great fire in the woods, or in a city, immediately purifies the air; and until it is again mixed with the air from other parts, all is about right—health and comfort are enjoyed. So the Great Purifier will burn up the earth and all things that are thereon, and a new world will arise out of its remains, purified and made meet for the Master's use. He has promised to dwell in it, and be the light and life of it; and there will be no more death, neither sorrow nor crying, for \"God the Lord from every eye shall wipe off every tear.\" When the city of London was visited by the fire about two centuries ago, did it not leave the place more healthy and pure? How much more will the atmosphere be cleansed from every thing that defileth, when the whole world is subjected to the power of this element. If we ask ourselves what will burn up the earth, let us just think for a moment (and fear and tremble) of the discovery that man has made of the means of producing the most intense heat from the article we use to quench fire.\n\nIf these death-producing gases are generated in the baker's oven, in\nthe breweries and distilleries, of what suicidal madness are our kings and law-makers* our priests, and our people not guilty, when all join with a zeal worthy of a better cause in encouraging their manufacture. They must be made for our priests, that they may get the emblems they need. The people cannot do without them any more than they can do without the thing signified; and the king and lawmakers, kind souls, only tax them that a fund may be raised for paying the collection of it.\n\nThere is no product of fermentation but is poisonous to human life, whether it be in form of a solid, a liquid, or a gas. The grains from the distilleries have long ago been proved to be injurious to animals for either fattening or dairy purposes. The vinegar has also been proved to be injurious to either inside or outside of the human being. When taken internally it carries off the flesh and destroys the health, vigour, and complexion of those who use it. I knew an instance of a mother bathing herself with it, and it dried up her breasts, so that she had no nourishment for her next child. I am convinced that fermented things are evil in every form, and in every application of them to the outside and inside of mankind or animals. We can hardly stop in our comparison of the emblem with the thing it represents. Every remove we make from the path of rectitude is an additional obstacle to our return; so is it with the fermenting article. Leanness to our souls is a certain consequence of continuing in sin, so leanness of body results from our drinking vinegar, which is a fermented article. If you will drink acids, drink those that God makes, for he does make acids, and those which he makes are good. But he does not make vinegar, that comes from destruction and causes destruction; but the acids God makes are made by the building up of the materials laid in the ground, which would otherwise be injurious to living creatures; and by his own process and sole prerogative, which cannot be usurped by angels or men, he brings good out of evil. Let us take that good and use it when we require it.\n\nMethinks, when I hear people say they take a little alcohol for medicine, that they are in doubt about God's skill in providing for their cure, and would say to them, as Elijah the Tishbite said, as he was directed by God himself, to the messengers of Ahaziah, king of Israel, \"Is it because there is not a God in Israel, that ye go to enquire of Beelzebub, the God of Ekron?\" Is it not because there is not a medicine in all the things that God has provided for your use, that you make experiments with that which you know to be void of all virtue? A physician ordered a teetotal patient wine, and told him that he could not get better without it—anxious to recover, he obeyed orders, he got it, and had it placed carefully in his cupboard. The M.D. called again—the man was recovering slowly; he ordered him more wine—it was procured and placed beside the other. The doctor called again, and saw a marked improvement in the man's health—told him to persevere.\n\n*A class not found in the time of the prophets, but thought to be needed now.\n—get another bottle of the same. He did so until Esculapius pronounced him perfectly cured; and exulting in the success of his treatment and prescriptions, confidently told the man, \"if it had not been for that wine, you were a dead man.\" \"Well,\" says the other, \"if it has done me any good, (at the same time opening a door,) 'twas by keeping it in the corner of this cupboard.\" Not a cork was drawn. Comment would weaken the force of this example.\n\nSeeing that the process of decomposition is the figure used by the inspired writers in the Bible to describe sin, may we not urge the necessity of the learned taking up the subject, and explaining to us fully all the various changes undergone by vegetables and fruits, and the perfect resemblance they bear to the \"sinfulness of that estate into which man fell,\" and the constant tendency of both the type and antitype to go on in the way of death, and complete blotting out of their name and place from the face of the earth. The priests of old were the appointed instructors of the people, in every thing that concerned their welfare; and if the ministers of religion now had the knowledge necessary, and were our only guides, there would be, I doubt not, a different state of things. The priests of old were the healers of the bodily diseases of the people; they were teachers of civil law, the law of inheritance, marriage, uncleanness; their treatment of strangers or aliens, weights and measures, of garments, manslaughter, and everything pertaining to their well being for time and eternity; theft, accident, trespass, of whatever kind; vows, whether lawful or unlawful, or, as they are named in the Bible, singular vows, such as that vowed by Jephthah, for such is the perfection of the laws they had to administer, that even his case was provided for; the very meat that was clean to them, and that that was unclean. Looking at the encouragement given to the use of intoxicating liquors at the present time, may we not hope to see, after the Church takes again the proper elements, crime rapidly growing less and less every day, until all the crimes caused by alcohol, which at present amounts to nine-tenths, disappear altogether, and only one-tenth remain. And the question of the misery endured by those who sigh in secret, of which no account is kept by man, we may picture to ourselves their reduction too, and may hope to see health and happiness almost universal. We say, take away the cause and the effect will cease. If we are convinced that this is true, and that the wine used at the Sacrament gives the strongest recommendation that can be given to the drinking usages—then the using the unfermented juice of the grape at that ordinance would immediately change the recommendation from the one to the other, and be the means of at once reducing, as far as the Church is concerned, the crimes committed to the one tenth of their present number and enormity—the rule is as sure in morals as it is in mechanics, or any department of the various processes of nature. O for a nation of Nazarites, whose vows and conduct correspond, and tend to raise their minds and bodies to the highest perfection they are capable of. I do not like to leave the question of leaven while there is a lesson to be got from it. Unleavened bread is always mentioned as provided for angels\nby the Patriarchs, when they visited them. Abraham entertained three angels with cakes, made of fine flour quickly on the hearth. Lot made a feast for the two angels, and did bake unleavened bread and they did eat. Gideon said to the angel—“Depart not hence, I pray thee, until I come unto thee, and bring forth my present, or meat offering, and set it before thee;” and when he did bring it, it was a kid and unleavened cakes of an ephah of flour. It appears to me that it is not explicitly termed unleavened bread for no reason. Reciprocity was strictly observed in this matter, for we find that the angel had a cake baked on the coals ready for Elijah, when he awoke from his sleep; and the angel of the covenant, after his resurrection and before his ascension, had a fire of coals and fish laid thereon, and bread ready for the disciples, when they came to land, “and Jesus saith unto them, Come and dine.”\n\nWe can all remember reading of the manna with which the Israelites were fed in the wilderness, and know that that which fell on the ground on the five first days of the week, would only keep one day, and then it would corrupt; and that which fell on the sixth day would keep two days, and that portion of it that was kept for the purpose of letting their descendants see “the bread wherewith the Lord had fed them for forty years in the wilderness,” would keep to all generations. In commanding the people to let none of it ferment, the Lord, besides keeping in view the appointed ordinance, is teaching them that they should not, in future ages, destroy the good things he would give them for food, before eating them. The advocates of abstinence from alcoholic liquors have made good use of the fact that water was the only drink of God’s people for that forty years, and with the addition of the fact of the unleavened manna to our stock of information, we may be led to the discovery of the cause of the diseased stomachs, so prevalent amongst us, and so arrive at the knowledge of those things that will serve our bodies and promote longevity.\n\nWe say that newly baked bread is very unwholesome, no doubt because it is fermented, and contains carbonic acid gas; but if it remains exposed to the air a day or two to ripen, then it is no longer so; we say, but with unleavened bread it is different: it is as good when newly baked, and cooled enough so that its heat would not injure us, as if it stood longer, and perhaps better; thus we see that our own experience confirms every thing we have seen in the Bible. Every circumstance in the case goes to shew that God made every thing that he ordained for our use, perfect; and there is criminality and consequent punishment in causing any of these things to ferment, and be destroyed, no matter to how small an extent, before we use them.\n\nThe second chapter of Leviticus contains directions concerning the meat-offering unto the Lord, and gives certain directions to those who offer it in the ways they may bake it, and of the modes allowable, baking in the oven or in the pan; there is a positive command that they shall be unleavened cakes, or unleavened wafers of fine flour unleavened, mingled with oil, or anointed with oil; and in the eleventh verse, the prohibition of leaven is in these words—“No meat-offering which\nye shall bring unto the Lord, shall be made with leaven: for ye shall burn no leaven, nor any honey, in any offering of the Lord made by fire.\" Thus we see that it was not only in the case of the passover, but in other sacrifices too, that leaven was forbidden; and in no case but that in the thank-offering and two waive loaves of the first fruits, I find that it was lawful to bring leaven into the house of God. Leviticus vii. 12—\"If he offer it for a thanksgiving, then he shall offer with the sacrifice of thanksgiving unleavened cakes, mingled with oil, and unleavened wafers anointed with oil, and cakes mingled with oil of fine flour, fried.\" 13—\"Besides the cakes, he shall offer for his offering leavened bread, with the sacrifice of thanksgiving of his peace-offering.\" Thus we see, that even in the case of the sacrifice of thanksgiving, where leaven was lawful, that a full allowance, as full as in the case of the meat-offering made by fire, or any other case, a full allowance of unleavened cakes and unleavened wafers was to be presented to the priest, enforcing by this ordinance the doctrine which, I have no doubt, was taught to them literally, that God will not accept of their thanks, if they present them without being accompanied with another's merits.\n\nWe can see that, in the writings of the later prophets, they understood fully the meaning of those rites, and that notwithstanding our ideas of the ignorance of the ancients, as to the whole scheme of redemption or acceptance with God, they understood well both the figure and the ideas it represents, both the type and antitype: for Amos says, speaking of this ordinance, \"Come to Bethel, and transgress; at Gilgal multiply transgressions; and bring your sacrifices every morning, and your tithes after three years; and offer a sacrifice of thanksgiving with leaven, and proclaim and publish the free-offerings, for this liketh you, O ye children of Israel, saith the Lord God.\" Ezekiel says of the people, \"and they come unto thee as the people cometh, and they sit before thee as my people, and they hear thy words, but they will not do them. for with their mouth they shew much love, but their heart goeth after their covetousness; and thou art unto them as a very lovely song of one that hath a pleasant voice, and can play well on an instrument, for they hear thy words and do them not.\" These and other passages from the prophets, go to shew us that the literal meaning of the types was preached to the people, and that they neglected the substance for the shadow, which should not have been; and, by and bye, we will find out to our sad experience, that if we had kept the shadow, we would have had the substance nearer to us—if we had retained the letter of the law in the ordinance of the supper, we would have extolled an article at once a drink and a medicine, but in changing the elements, we have been guilty of a tremendous error: for we have tried to see what is impossible, an emblem of grace in what is the emblem of wrath. The two waive loaves of the first fruits leavened, goes to prove nothing in favor of leavened bread; for it was not burnt, for in no case was any leaven to be burnt in any offering made by fire—it merely, figuratively, shewed to the people, that God was gracious in accepting their services, if they presented them with the sacrifice, and pleaded the merits of Christ; for he says by his prophets, when they are\nrebuking the people, because their hearts are not purified from sin, and we sing a paraphrase on it—\n\n\"Your rites, your fasts, your prayers, I scorn,\nAnd pomp of solemn days.\"\n\nIf the permission of leaven in these two cases proves anything, it proves that God has not utterly cast off corrupted man, but that he is inviting him, in these two cases, to come to him and acknowledge his mercies. He is shewing him the duty of gratitude to himself for his bounties; and the man is very ignorant of the Bible that does not know that this feeling is inculcated in the literal terms as well as in the emblematical rites. Solomon says—\"Honour the Lord with thy substance, and with the first fruits of all thine increase; so shall thy barns be filled with plenty, and thy presses burst out with new wine.\" And Moses says—\"Thou shalt not delay to offer the first of thy ripe fruits and of thy liquors. The first born of thy sons shalt thou give unto me. Likewise shalt thou do with thine oxen and with thy sheep.\" Gratitude is commended by our Saviour in the case of the Samaritan leper who returned and with a loud voice glorified God, and for falling down on his face, at his feet, and giving him thanks; and ingratitude is reproved, for there were ten cleansed, but Christ asks \"Where are the nine?\" The Psalmist of Israel has written many passages expressive of the feeling. Habakkuk, in the spirit of true devotion, even if the blessings of temporal things are withheld, declares, \"Yet I will rejoice in the Lord, I will joy in the God of my salvation.\" God in mercy accepting of the services of fallen man through the mediator, and utterly casting off the fallen angels, should be reason sufficient to cause us to search into the ordinances of the old law, because they were rites that, if understood, would give force to truths preached now, and the rites we do not understand should be searched into, for they are all full of important lessons that would confirm those doctrines, that for want of emblems we are yet disputing with one another about.\n\nThe true worshipper of God, in the old law, had to present unleavened cakes, and after them the leaven baked, which process is emblematical of the turning to God by repentance—unbaked leaven and unrepenting man are equally forbidden. So now the christian presents himself, after pleading the merits and atonement of Christ, as a child in a fault, pushing in another to plead for him, but clinging to his coat and keeping behind as much as possible—wanting to be seen and yet afraid to shew himself boldly—knowing that his father had forbidden him, under pains and penalties, to come into his presence. So our Father, and our God, after driving us out of Paradise, declared, \"that no man shall see my face and live.\" In the atoning sacrifices there was no leaven—showing that fallen man could not atone for his sins; but in thanksgivings leaven was used, showing that fallen man can and ought to be grateful for mercies.\n\nChemists tell us that the juice of the grape, or any other of the fruits of the earth, when exposed to the action of the atmosphere, ab-\nsorbs the oxygen that is in it, and the article goes on to ferment. I would ask, is it not possible that it might be the carbonic acid gas in the air that unites with the juices exposed to its action, and causes the process to go on; for from the nature of one article that was already a product of decay, to cause a substance that had not commenced to decay to change its condition, we may, in all deference to the learned, conclude, that is the most likely theory? We know that flour, if mixed with yeast, will ferment much quicker than if it is not, and the brewers adopt this practice to gain time. We know that one rotten apple will cause a sound one to spoil much sooner if set close to it than if at a distance. Knowing this power that is in one corrupting thing to cause another to ferment that comes in contact with it, I think, from this fact, that the pure, unadulterated atmosphere, is not the active agent in causing fermentation. It may be different, but when I see another way than what is laid down in men's theories, which theories necessarily involve the Creator in contradiction, I will take the way that is consistent, especially when facts support me. Consistency is especially peculiar to the Creator, which every new discovery, in the fullest manner, brings out, as well in the system of the universe, as in morals and theology. Naturalists tell us that this carbonic acid gas is absorbed by the leaves of trees and plants, and is then converted into the substance of the tree; then if that is the case, this gas is the food of trees, and the leaves are the mouths. But on the other hand they tell us, that the roots are the mouths, and it is from the earth that they derive their substance.—They also tell us that the leaves are the lungs, but they cannot be the lungs and the mouths too. I would be very willing to grant, that the leaves are the lungs, and the roots the mouths, which convey the substance to the tree; for there would be no confusion in the theory—there would not be anything like making the one member perform two different actions—there would not be the making of one member, as the notion took it, to either eat or breathe, for then they might be both eating or both breathing at the same time. So I would say, give each a different work to do, and the one will not say to the other, \"I have no need of thee.\" But they will do their eating and breathing whether we know how it is done or not.\n\nThe learned tell us, that the trees inhale carbonic acid in the daytime, and throw it off at night. If they throw it off at night, then I cannot see that it becomes a part of the substance of the tree. Being thrown off, I think it must be with trees as with us? Whatever quantity we inhale of it, that is in the atmosphere, we throw it off too, but we do not throw off oxygen; and I think the same life principle must be the life of trees as well. We throw off the nitrogen, and they tell us that the trees throw it off too. I would not have thought of touching the theories of men in this matter, if I did not think that there is in the atmosphere a mixture of death-producing agents, from the train of thought I got into in this matter, and from the expression of the Apostle—\"The spirit of the power of the air, the spirit that worketh in the children of disobedience; for I\ncannot think that the Apostle was such a bad grammarian as to use a figure or make a comparison where there was no resemblance in the two things.\n\nIf I have proved, or if I have laid down circumstances that will lead to all the facts of the case necessary to prove, that this fermentation or decomposition, is a perfect emblem of sin—that it is as ruinous, evil, and detrimental to physical existences in the outer world, as sin, in its effect on intelligences superior to man and on man himself, in the inner recesses of the heart, and in the effects on the life, then I shall have accomplished the task I gave myself; which was, that they were co-extensive in their operations, and equally universal in their prevalence, in their respective spheres; and we will be able to take up the gauntlet thrown down by the atheist—\"Shew us anything in nature resembling the fall of man, or anything bearing any analogy to sin.\"\n\nIf any one can bring any system of laws at all approaching in their excellence to the laws of Moses, for preserving us from the evils of the corruption to which our moral and physical natures are liable, let them do so. But the many inventions of sinful man, and the suggestions of the devil, have all been exhausted, weighed in the balances, and found wanting, as a well raised loaf is. In nothing did he succeed so well in, as when he tried to get fermented wine put in the place of newly pressed out, unfermented juice of the grape, in the ordinance of the Lord's Supper. Was the changing of the viands there the occasion of the woman fleeing into the wilderness, prophesied in the twelfth chapter of Revelation? If it was, then, as we believe, the times, times and a half, are nearly fulfilled, that is to show her forth to the world clothed with the sun, and having the moon under her feet, and on her head a crown of twelve stars. A very fitting herald, and of her own sex too, one of the graces. Temperance is sent down from heaven to be the herald of her approach, and reign on the earth with Him who is the Church's husband.\n\nWhen we look at the movements in the churches of the Protestants, the temperance reformation, and the adoption of the \"Water Cure,\" in the treatment of diseases, we involuntarily exclaim, where will these things end? The first was a reformation in the faith, the second was a reformation of the life. The last is a very strange species of fanaticism to my mind, but will perhaps accomplish one thing, making cleanliness better observed. The first will add to its other excellencies the second, and we will have then a reformation of faith and life in one faith proved by works. The latter, the \"Water Cure,\" will cool down into the water washing, and to some extent, and to the same purpose, bring in the purifications and washings ordered by Moses. Then we will be gradually brought to adopt the cure of the good Samaritan, and pour in oil and wine into the wounds and bruises to which we are liable. Not the fermented wine, which would only inflame our wounds, but the new wine, pure and good, that rejoices the heart of God and man—for God sees in it the emblem of his Son's\nblood, and man sees in it the emblem of his own salvation, therefore, in it, both rejoice.\n\nThe first, (the Protestant Reformation) in the first place, and the revival of evangelical doctrines in our day, brought the doctrine, FAITH IN CHRIST. The second shews the emblem of Christ's blood, UNFERMENTED WINE. The other shows what the washing by the Spirit means, in the literal daily ablutions, answering to daily forgiveness of sins, extended to those who live by faith. I feel inclined to paint our likeness again, in another particular, to ancient Israel. The spies brought an evil report of the land, in spite of the cluster of grapes brought over the brook by the two who bore it on a staff between them. In our day, in spite of the two witnesses, temperance and science, their strong evidence of the fruitfulness of the land is not received, but the gigantic figures of the enemy are feared, though we know they quake and their hearts melt within them. I think we would have no trouble to shew that there were ten to two witnesses who cried down our going in to possess the land, some because they feared the obstacles, and others because the customs of their fathers opposed us, others because they said the Bible condemned us, but not one of them will go in, they will all lie down and die before the land is possessed, and only the two noble and good, bold and true, faithful and believing, the Caleb's and Joshuas—Total Abstinence and Science—will be let go in and receive their possessions. Yes, and those the lands of their own selecting—more favour and higher privileges than all others. Their strength will continue as Caleb's did, whose strength was as great the day he was fourscore and five years old, as it was when he was sent at forty years old to spy out the land.\n\nWe were shewn, at the commencement of the movement, all the excellency of that thing which undestroyed was a good creature of God, but other influences were set to work and prevented the truth prevailing; and now when near the land of promise, and the two spies are sent to view \"the land even Jericho,\" they are hidden by the harlot expediency, for it seems to be the highest rule, even with those ministers who have joined the temperance movement. If, as I have shewn, though feebly, the recommendation that the using of fermented wine in the Sacrament gives to it, then the Jordan has yet to be passed, and we will have the waters standing on a heap at our side while we pass over. This expediency is only a low rule to adopt, and is well named a harlot, for how is it possible that such a rule can excel the law of God, which is perfect? or, how can the ministers of religion urge on us to pledge ourselves against that which they give us as the emblem of the greatest, the best, and in fact, the only blessing worth having, which, when we have it, we have every other? Yet, low as this rule is, it will do some good—it will let us down as by a cord out of the Jericho of debauchery, and then we can escape to the ark of the covenant, wherein there is safety. Yet this expediency is a clog that drags heavily after us, it prevents us going directly up to the mark, and seeing that as God forbids sin, by using leaven as its figure, so he forbids us to use leaven, because it is as evil in its na-\nture as that of which it is the emblem. The ministers say that it is no sin to drink the liquor—even those of them who are pledged men say so. Let us give a place to every thing, and put every thing that is good in its place; and as one after another of the institutions of Moses are found necessary to the well-being of man, we will remove those things that we have given too high a place to, to that place which they were designed for. We will pull down the washings of the Pharisees to its proper place—we will set total abstinence in its own shelf, and the new wine cure, which amongst us has no place yet, will be put where Paul put it, within Timothy's reach.\n\nI could point out many of Moses' commands, which must be adopted as we go on to perfection; and as they are adopted by us we will be led to the conviction that nothing less than infinite wisdom could have devised what Moses has written. Although Moses was learned in all the wisdom of the Egyptians, and had from them all that they knew, yet he had from God himself the fact, \"that there is but one only, the living and true God\"; then, as one after another of the laws that were given by God to him, are found necessary to our well-being and adopted—which revelation is very different from the discoveries daily made in our time—no one man has all the honour of all the various discoveries in art and science, but it is divided between hundreds and thousands. How different then. But it would have been then as it is now—the honor would be divided, of making laws, if it had been left to man to discover, by his own observation, what was right and impartial justice. We know that the Israelites were in a heathenish state of ignorance at the time that the law was given, and that even Aaron made the calves for the people to worship. If Bacchus is dethroned by this movement—and he must be dethroned before any other abomination is put down—for he causes nine-tenths of all the evils in the Church and in society—and we should begin at the greatest evil, for \"Judgment must begin at the house of God,\"—then, but not till then, will Mammon be cast out, and the thousands and tens of thousands of gold now devoured by his servants, be placed at the disposal of the bride—the Lamb's wife—then will there be good housekeeping—then will the time be, when Kings will be nursing fathers and Queens nursing mothers to the Church of God, and the people give freely, not grudgingly.\n\nWe Protestants repudiate tradition. In so doing, we do well; but if we ask ourselves whence arose the practice of using fermented things in the Sacrament, we cannot tell. We have not found it in the Bible—then it is from tradition; from whom, then, did we derive it?—Not from Luther and Calvin; for it was understood by them to be proper to use fermented things. They gave themselves no concern to enquire into the matter. May it not have arisen in those days immediately after the Apostles, and may it not have been the deceiving spirit that caused all the errors that have crept into the Church of Rome.—In the Gentile christians there was anxiety, as well from their own former customs as from the abrogation of circumcision and Levitical sacrifices, to lay aside all that Moses had commanded that was cere-\nmonial; and, therefore, thinking that fermented or unfermented was immaterial, the one giving a levitical character, and the other not, to the Sacrament, they would choose the fermented; besides, that they might have nothing that the judaizing teachers could take hold of and say, this you do in common with us. Now, I think it no hard matter to account for all the errors of the Church of Rome, by this one thing. For these Gentile christians, perhaps, had been worshippers of Bacchus, and taking Bacchus' wine as the emblem of the Saviour's blood, they would, obeying the invitation of Christ, which was continually to be observed, given in the Song of Songs—\"Eat, O friends, drink, yea drink abundantly, O Beloved;\" and when elated by the effects, and discussing matters of controversy, having fallen into the error that encouraged intoxication, could not see their own error, and would not give up their own former decision as to the emblems, and through the effects of the emblem, would fall into many others; for I believe it is acknowledged on all hands, that man, when in his cups, is not famous for thinking correctly, nor is he renowned as a good follower in any cause.\n\nThe condition of Christendom, for it is the seat of the beast, is represented as in a wilderness state and drunken. Now, it is a characteristic of almost all the figures used by the inspired writers, in describing any condition or state of things in the world, that both literally and figuratively the description is true. As regards the roads, they were in as vile a state as our very worst in this new country; and in Great Britain, the most enlightened and free amongst them all, we are told it is only a short time since they commenced to make good roads through it; the great road maker, McAdams, is but a few weeks dead, and the greatest impetus road making has yet received, commenced with the temperance movement. How beautifully descriptive of this state of things are the words of the Prophet:—\"And a highway shall be there and a way,\" as if he foresaw the state of the roads and the kind of roads that literally would cover the earth; \"a highway and a way,\" the Macadamized road to the railway and the railway. In the moral, the temperance way, the way to prepare the world to the method of preparing our minds for receiving the Gospel, the Prophet's words describes both literally and figuratively the condition of things that we are now rapidly progressing to.\n\nThe drunken state of mankind in the wilderness is fully descriptive of the state of the doctrines and morals that prevailed in former ages, and even now is hardly broken into. The intoxicating wine being once introduced into Church, and taking the place of the unfermented, gave encouragement to the intoxication that followed and yet continues. The Roman Emperors, and more recently the British Kings, became as a staff to this drunken Church, and instead of being a support, only served the devil's purpose of getting between the legs and tripping it, and causing it to sink deeper into the ruts and mud holes that are natural to this wilderness. We have all seen drunken men wading and shuffling along a miry road, with a staff in the hand, sometimes flourishing it over their heads, at other times sticking it in the mud, losing hold of it, and reaching and striving for it, and with the help of stepping-\nstones recovering it again; sometimes flying in a passion at it because it tripped them, or because they saw their drunken companions tripped by it. But the Church we have not seen it as a sober man walking with the staff in his hand, yet picking his steps, and using the staff to lean on occasionally, to enable him to overleap a part where there is not room enough for his foot but there is for his staff, on which he may lean and leap over the difficulty. The Church has been left, while in its drunken state, at times, without the staff; at other times, as in the French revolution, the people seeing the staggering state of the Church turned on it, and rolled it in the mud, and pitched the staff away, so that there was nothing left. The scrambling for who will be \"King of the Castle\" is yet going on, though this drunken Church did get hold of the staff for a time through the kindness of its neighbours, who are only a trifle less intoxicated than themselves.\n\nI am confirmed in my belief that this intoxicating wine being used in the sacrament, caused the corruption of the Christian Church from the announcement of the Angel in the 14th chap. of Revelation. I will endeavour to show what Angels represent in, at least, that chapter. The first of these Angels is represented as \"flying in the midst of heaven, having the everlasting Gospel to preach unto them that dwell on the earth, and to every nation and kindred and tongue and people, saying with a loud voice,\" &c. We have to read on until we come to the 12th verse, and find the words, \"here are they that keep the commandments of God and the faith of Jesus;\" this explains what is meant by these Angels with messages—they are combinations of men for a purpose; as evidence of that I refer to the message of the first Angel who has gone on his errand, and is performing his work of translating the word of God into every language known in the world, and has in many cases written the language for people who had no knowledge of the art, and has taught them to read. A part of the work of the first Angel is to command the world to \"worship him who made heaven and earth and the sea and the fountains of waters,\" a plain allusion to the subjects discussed at the beginning of this century, and possibly not yet concluded. As far as the learned have yet investigated the construction of the earth, the Mosaic account of the creation is confirmed; these triumphs for the word of God have been achieved by combinations of men for the different purposes for which they were associated. When we see a part of a prophecy fulfilled, we cannot doubt that the whole will be completed. These Angels reveal also truths that were not known before, as in the instances where the most sincere Christians disputed the conclusions of the Geologists at the first, and afterwards prosecuted the search after truth along with them, enlarging their minds. Here I may suggest that part of the work of the third Angel is to discover to the world what the beast is. His message begins with a denunciation of any who will worship the beast; the meaning literally is, that a great movement will take place in the world, and the cause of all the injustice committed by man on his fellow will be pointed out and condemned, and that the followers of this Angel will be worthy of the commendation given to them in the 12th verse:—\"Here are they that\nkeep the commandments of God and the faith of Jesus.\" If, then, the first and third Angels represent combinations of men, the second Angel represents a combination of men, and he also reveals to the world an important truth or literally (without looking at the means employed) the human race will find out the cause of the degenerating of the Christian Church. It is possible that the temperance movement is now in the position that geology was before the student read aright the word of God, and that the startling truth has yet to be proclaimed: \"Babylon is fallen, is fallen, that great city, because she made all nations drink of the wine of the wrath of her fornication.\" I have read that many of the heathen nations were teetotalers. The Romans put their women to death for being drunk, or for drinking intoxicating liquors, I know not which; they made their slaves drink so that the sight of them might disgust their youth, and make them hate the practice. The worship of Bacchus was not the work of the virtuous among the heathen but of the vicious. Ancient Roman soldiers did not drink intoxicating liquors lest their bravery and strength might be lessened. Let the learned fill up the charge brought by this Angel against the Church, \"she made all nations,\" &c. I have only suggested the subject for the enquiry of those who are not convinced as I am. At some future time I purpose to enquire more into the meaning of this chapter of this wonderful book.\n\nAt the Reformation it may be that the beast with seven heads and ten horns was wounded to death in one of his heads, or one of the seven sacraments; and this error handed down from the ancients, being taken up by the reformers, looks very like the healing of that deadly wound, for with the Roman Catholics the changing the nature of the bread and wine into the real body and blood was the positive belief. Protestants held, on the contrary, that they were emblems of the body and blood; there was the wound, but the healing is plainly shewn in using the emblems of sinful man for the emblems of Christ; the consequences of this was shewn in the errors that spread among the Protestants at the time, and which continue as virulent. Yet, we are striving with the Papists as Luther did with their predecessors, and it is a remarkable fact that we have not settled the question of admitting members into the Christian Church yet. It would seem that our progress is arrested at the very threshold of the sanctuary in this fact. We had already learned that the just shall live by faith in Christ; then, as in the ordinance of the supper, Christ is made manifest to us by emblems, it would appear that we must find out what are proper emblems of him before we go in, that we may have our faith strengthened, and so we are yet divided on the question of who are proper subjects of baptism. Certainly not those who believe that fermented wine represents in any particular the effects of believing in Christ, and whether they are infants or adults there is no difference, if they think that God's grace is shewn in the leavened bread.\n\nAnother fact and I am done. The Socinians representing the Arians that took life in the early Christian Church revived at the reformation, I ask, was there a coincidence as to time in their origin, and the first introduction of leavened things in the sacrament. Another question\nproper to be asked is—how much had the study of heathen mythology to do with the continuation of this absurd practice in the Reformed Church to the present day? The ancient Jews were forbidden to learn any of the customs of the heathen nations round about them, least they should follow them in the worship of false gods. Moses commands them, Ex. xxiii. 13. \"And in all things that I have said unto you be circumspect, and make no mention of the name of other gods, neither let it be heard out of thy mouth.\" God is the same jealous God he was when Moses lived, and will not let us with impunity take into our schools, colleges, universities, any of the heathen studies, and bless them to our youth. \"God's law is perfect,\" and there is no need of additions, and anything that we can learn from the heathen will tend only to lead us astray; the danger is the greater when the same names are used as in the case of the wine, the articles being very different. The wine proper for the sanctuary of the Living God is wine that God made, but that that was used in Bacchus' temple was what the Devil had destroyed.\n\nWe must now adopt as a people either of these two courses. Banish ferment from the Sacrament, or go on in the course of our Fathers, and as we use the article they used, cultivate the taste for it by all the means in our power; the better we are acquainted with the emblem, the more will we desire and long for the thing it represents. But thank God the days of alcohol are numbered; he has been weighed in the balances and found wanting, and the people who have reported the matter are prepared to stand to their arms, and defend the fabric they have raised on the rock—TRUTH. The veneration we had for the customs of the fathers is giving way, and before the generation now living has gone the way of all flesh, this principal pillar of the kingdom of Satan will be by the Samson of our day carried away and placed as a beacon to warn future generations. If the Roman Antichrist was the means of intoxicating the world with his poisonous doctrines, the Protestant Antichrist has literally given his power to the first beast in making the nations he has conquered, the colonies he has formed, and the people with whom he has made commercial treaties, drunk and more drunk. And if the Roman trafficked in the bodies and souls of men in spiritual, the Saxon has given his power most effectually to the Roman in the spirituous things of his sacrament and traffic, and has been the means of devoting both the bodies and souls of men to destruction. We cannot come to a right judgment of the influence that the wine in the sacrament had on the people 300 years ago from what it has now, for the conquest of total abstinence principles has wrought a complete change in the opinions of the people. It is now considered a great curse, but even thirty years ago, yes, far less, it was thought a blessing, and one year ago at a drinking benevolent party the Chaplain asked a blessing on the creature. The English Church is seemingly on the move to Rome; many of her ministers have gone there already, and others are preparing to go as quick as they can. I think God is trying the British people most severely. He is shewing them by his providence that they have some Achan in the camp. He is pointing as with the finger of his hand to the temperance society, there is some-\nthing there you need. The Methodists commenced with the total abstinence pledge as a rule of fellowship, but they took the sacrament in the older Church; this inconsistency could not work a deliverance in the earth, for they are no better than many others. A marked revival took place in the Church of Scotland about the time that the temperance movement commenced, and this revival led to a disruption that has been the means of producing a decided change for the better in many things connected with the spread of the Gospel. If there was a necessity ten years ago for a disruption, there is an incalculably greater necessity now for separating from those who will persist in maintaining at the Lord's Table this drink of damnation and the polluted bread. To those who will persist in using them still, I would say, go and take brandy there, for it is the distilled juice of the grape, and so more expressive of the richness of the grace of God, containing more of the spirit you admire in the fermented wine. The French and other Celts name brandy \"eau de vie\"—water of life; whiskey, a corruption of \"usquebaugh.\"\n\nCall loudly, then, ye temperance men, to the Churches lying to Babylon—tell them we have found the emblems of \"Him of whom Moses in the law, and the Prophets, did write—Jesus of Nazareth, the son of Joseph.\" John i. 45. Tell them that they are really emblems and nothing else—that they do nourish and sustain the body as God's grace feeds the soul. If professing Christians, in olden times, had retained the emblems proper, the articles themselves would have confirmed the truth, that the sacrament was an emblematical ordinance, and not a sacrificial one as some assert. After they were changed, the mind that was enamoured of Christ, and knowing the nature of the new emblems, would see that the thing was a direct contradiction, and gradually step by step they would leave the truth, and take up strange fancies and call the sacrament a sacrifice, and transubstantiate it into the real body and blood, bones and nerves of the Saviour, and offer it upon the altar.\n\nIf our Churches resolve to return to the prescribed elements, they must make known to the world their intention by proclamation and confession of their error and sin, and the blind leading they have performed to their followers since they took up the occupation, for they do not seem to have been called to preach down, but to preach up drunkenness. I defy them to show anything connected with the Roman Catholic religion as directly encouraging of the vice; they do not give it to the people in the Sacrament; the Priests take the wine and it promotes their drunkenness, but from the people it is withheld. Perhaps the reason of its being at first withheld from the laity, was the encouragement it gave to the vice, and the Priests wishing to arrest it in some degree withheld the wine seemingly for that purpose; but I will not say it was. They are told, that when they get the body, they of necessity get the blood, so that the wine, in fact, owes the recommendation it gets to the Protestants. Whatever is used as the emblem of Christ's blood, is recommended as an efficacious medicine, for Christ is the Physician of souls—a quencher of thirst—for he who drinketh of the\nwater that Christ gives will never thirst. To give an idea of all the qualities of the bread and wine, we must sum up all the graces of Christ.\n\nThe most powerful appeals against drunkenness are more than completely annulled by using the liquor as the emblem of the blood of Christ. It has an infinite power and exceeds in force all the arguments of the other, as much as infinite exceeds finite. Our ministers ask, \"who hath believed our report?\" as if none, or at most very few, had believed it; but when we look at the state of society, we can see that their report of Christ in the emblems (the very opposite of their teaching by word,) is as universally believed as the most sanguine of the imps of the pit could wish. Future generations will say of us, that we have \"walked in the way of Jeroboam, the son of Nabat, and in his sin wherewith he made Israel to sin.\"\n\nIt seems to me that the translators of the Bible had not sufficient warrant for heading the paragraph, in which is related the first sin of man—\"man's shameful fall;\" for this reason I do consider the figure imperfect; there are a thousand, or perhaps ten or more thousand falls after which the individuals rise again by their own exertions unaided by others, for one after which they do not rise again; but in a man's disobedience in eating the forbidden fruit, he became as the corruption of vegetable or animal matter, for which there is no cure in the world. If the translators, or whoever did it, had headed the part with man's corruption or man's fermentation, if they could not do without a figure in the case, then they would have given no countenance to the notion, that we can by our own exertions please God. Again, if they had translated those passages properly, which they have rendered wine, we would not have been led into drunkenness.\n\nWe have now many advantages over the heathen that were converted by the Apostles; they were turned from the worship of that that was not God by the preaching, and from many of their vile practices, but it was hard for them to give up all their old customs; and things they thought innocent were taken with them, which things wrought all the evil. But we were taught to love and have loved our Bibles, and will continue to bless and praise the God who gave them to us; that Being to whom we when children, and our children now, look up to for grace, mercy, and peace. These are the advantages we now have over the heathen; we know that the Bible is perfect, as far as we are acquainted with it, and from what we have already attained to, we may conclude, that no evil is in it. If Christ's blood is the only thing that will wash us and make us white, then that which he chose as the emblem of it, must be the safest, surest, most powerful and effectual medicine to our bodies that can be found on the whole earth, and should set a going a movement for the introduction and naturalization of grapes in our country, not for the purpose of making fermented wine, but to have it as a medicine; for myself, I have not the shadow of a doubt but that it would supersede all the drugs and medicines now in use.\n\nIf the Ministers of religion who at first condemned and opposed total abstinence from intoxicating liquors, but now have joined the movement,\nhave done so that they might control it, and render it subservient to their pre-conceived opinions, if they have joined us now that they might be the better able to check its progress towards universal adoption, then are they traitors to the long established teachings of their predecessors, and are spies to search out the secret of our strength, that they might betray this cause and uproot this tree, the fruit of which is peace and joy and love. Some one has said, \"pure is the joy without alloy, whose greatest rapture is contentment.\" He must have meant total abstinence, for the joy produced by it is free from gross excitement. Some of the Ministers have adopted it, because they honestly believed the truth of the matter, but they did so in opposition to the interpretations of their early instructors. Therefore, when all are enlightened by its bright effulgence, and when instead of the Jesuitical intentions being carried out, they are led to confess their original duplicity in joining us, they will, along with the assembled multitudes, unite cordially in a grand jubilee, and erect the temple of the Christian virtues, which they have long tried ineffectually to do, because they have not had this chief corner stone which they so long despised; then, but not till then, will this organization be unnecessary, and then will it dissolve because it has got the place it ought to have in the temple of the living God; its dissolution will be the signal for the shout of a king in the kingdom below, and for joy in heaven that Babylon and its ally, alcohol, are fallen together. John at Patmos, in a vision, \"heard as it were the voice of a great multitude, and as the voice of many waters, and as the voice of mighty thunderings, saying,\" in their rejoicings over the fall of Babylon, \"Alleluia, for the Lord God omnipotent reigneth. Let us be glad and rejoice, and give honour to him, for the marriage of the Lamb is come, and his wife hath made herself ready.\" \"Blessed are they who are called unto the marriage supper of the Lamb.\" Would the practice of any known virtue, other than the one urged by the Ministers of total abstinence, prepare mankind so well for the receiving the doctrines of the Bible: I boldly say, not one, and have not a doubt but that this is the preparation the Church is to make for union with the Great Head, the Lord Jesus Christ. Temperance is the lever that will move the world on the fulcrum—firmness. Conviction the weight to lift it high enough for the gospel chariots to receive it, and carry it off to glory.\n\nIf total abstinence is the platform on which the different denominations of Christians are to unite, or if the discovering of the true and proper emblems is to be the signal of the union, then had we not much better leave the disputes we are engaged in, such as the Clergy Reserves, Rectories, State support of Religion, and things of a like nature, and take up this most vital of all questions and agree to take the law of God for our guide in the decision? If, as I anticipate, and nothing under the sun can shake my faith in the matter, then union the most complete that ever existed since the fall of Adam, will end these matters; for if we were all of one mind, then there would be an infinitely greater willingness to give to Christ, not only the seventh of the land for the extension of the knowledge of the salvation he has wrought out, but we would give the whole, aye, and ourselves too, readier than we are now,\nto give to schools, canals, or railways. The time of this union is at hand, in spite of the infidel liberalism that prevails amongst us, of letting every one set up a god of his own to worship, of setting up a system of doctrine for himself to believe, or a form of church government to suit his notions. The Church of Christ is one as the Apostle describes it—“There is one body and one spirit, one Lord, one faith, one baptism, one God and Father of all”—a description of organization not like the Churches now in existence, nor even in any one of them, for it is said, that no two members of any Church agree on all points of doctrine, and liberty is even granted by the one to the other to believe as he likes. We have nothing in the prophecies intimating that the Church of Christ in its purity shall have a name or a place, or an organization in the world, until the seven-headed beast is slain, after that it will be seen and felt, extend and become universal, and after a time of success never before equalled or approached by any, the time will be come which is spoken of by the Prophet, when one shall not say to the other—“Know thou the Lord, for all shall know him from the least to the greatest;” then will every house be a Rector’s, and the world a Clergy Reserve. Come then to our platform, hear the truths discovered by the searches of the teetotalers—hear what this daughter of heaven says of Christ, and ask yourselves are we not living in the time immediately preceding the last outpouring of the spirit on all flesh; and if we live to see this union only partially accomplished, and this discovery the ground and road to that union, our happiness will be great and lasting, having the recollection that we were the pioneers who opened the way, threw bridges across swamps and rivers and gulfs of separation, and built a wall of our own pledge, on which the silver palace of the virtues would be safe.\n\nLooking at the temperance movement as the work of the Almighty Director of events, let us ask ourselves, was it only to accomplish the one thing—the making mankind a sober race—or had he some higher object in view when he put it into the mind of those he employed at the outset of the movement? Was his object totally unconnected with the things of eternity? I must firmly believe it was intended, and is the herald of the latter-day glory of the Church—that it is as the voice of one crying in the wilderness, “Prepare ye the way of the Lord, and make his paths straight.” It has proved itself that in individual cases, and what it has done in single instances, it will accomplish for the whole. John the Baptist came neither eating nor drinking, so has this temperance movement come teaching us not to eat, but especially, not to drink as the world drank. And Jesus Christ came both eating and drinking, so the last outpouring of the spirit and increase of knowledge will teach us how and what to both eat and drink. There is only as the appearance of a man’s hand in the work as yet, but it will over-spread the sky and prove itself the hand that stretched out the heavens at the first. The Jews of old said, that John the Baptist had a devil, so hath the world said of this movement. The same people said of the Saviour of the world, “Behold a man gluttonous and a wine bibber, a friend of publicans and sinners.” So will it be with us. O may\nwe live to see the day when the vine will be planted in our land, and\nthe pure blood of the grape be pressed out for the quenching of the\nthirst of the weary sojourner. John came to make ready a people pre-\npared for the Lord. Temperance has already prepared about twenty\nmillions for receiving the Gospel, preached successfully by the emblems\nof our holy Sacrament.\n\nThe Pharisees asked of John, \"Why baptizest thou then, if thou be\nnot that I am, nor Elias, neither that Prophet?\" John answered them,\nsaying, \"I baptize with water.\" We have been as severely questioned\nas to our authority for administering the pledge as John could be for\nbaptizing. We have been asked, why take the work out of the Church's\nhands of teaching the people? Is not the Church the only appointed\ninstitution for regenerating the world? That has been granted, but\nyou are not sufficient, we have said, and proved too, to the Church's\nsatisfaction; for they now find it necessary to form Church Tem-\nperance Societies, which are organized, as it were, to divide their work\ninto two distinct parts, or rather for the purpose of, by degrees getting\nthis part incorporated with the parts they had before, that the world\nmight think that this is an addition to the Bible way of regenerating\nman—equivalent to saying, the Bible was not a perfect rule of life.\n\nTotal abstinence professes to have nothing in view but the evil cus-\ntoms of the day, and in endeavouring to abolish them, is saying with\nJohn, \"I indeed baptize you with water unto repentance, (repentance\nhas only one letter that is not in temperance,) but he that com-\neth after me is mightier than I, whose shoes I am not worthy to bear;\nhe shall baptize you with the Holy Ghost and with fire.\" And that\nsystem of truth that is to supersede this movement, and render it un-\nnecessary as a distinct organization, will do as the Saviour of the\nworld did, \"Come to this Jordan, to this John, to be baptized of\nhim.\" \"But John forbade him, saying, I have need to be baptized of\nthee, and comest thou to me?\" So will this be, when the Church of\nChrist revives and puts on its strength. It will come to be baptized\nwith the baptism of this pledge, and adopt it as a rule of life. And\nwhen expatiating with one another, the representative of Christ will\nsay, and submit too, \"Suffer it to be so now, for thus it becometh us\nto fulfil all righteousness.\" Some, if any there were, who exalted this\nmovement into a certain means of grace, and put it in the place of\nthe Gospel, will come, as the disciples of John did, and say to him—\n\"Rabbi, he that was with thee beyond Jordan,\" (O what a delightful\nthought)—beyond Jordan—beyond the time when this flood of pure\nwater—this cleanser, cooler, and refresher—this supplanter of alco-\nhol—that liquid fire that parched and burned, and made more thirsty\nthan before the drinkers—that would burn itself, and render combust-\nible that which was not so before, being saturated with it. \"He\nthat was with thee beyond Jordan, to whom thou bearest witness,\"\nand mighty is the testimony which temperance principles have given\nof the benevolence of Bible precepts, \"behold the same baptizeth and\nall men come to him.\" The answer will be the same that John gave\n—\"Ye, yourselves, bear me witness that I said I am not the Christ\nbut am sent before him. He that hath the bride is the bridegroom”—that is, he who out of a world lying in wickedness chooses a people to himself has all the praise. “But the friend of the bridegroom, which standeth and heareth him, rejoiceth greatly because of the bridegroom’s voice, this my joy, therefore, is fulfilled. He must increase, but I must decrease.”\n\nJohn called to those he was surrounded with, “Behold the Lamb of God which taketh away the sin of the world.” Day after day he repeated this testimony. John i. 37: “And the two disciples heard him speak, and they followed Jesus.” As in the case of John’s disciples, so with those of us who have longest followed total abstinence, it is not necessary to say, when the emblems of the Lamb of God are shewn in the progress of investigation, that we leave total abstinence to follow Christianity, just as it was not necessary to say, in the other case, that John’s disciples left him. The one disciple told the other “We have found the Messiah.” So will we do now. We will publish to the world the fact, that we have discovered this mine of gold that has laid hidden, covered, and heaped up with the rubbish of man’s inventions, these ages past. To total abstinence men, under God, is due the praise of removing the rubbish entirely, which partly got a shaking up and loosening at the Reformation. One beautiful vein, “bright and shining,” was then opened, and a little of the gold extracted, but it got a coat of corruption laid over it in the emblems, which total abstinence has cleared away, in shewing to the world the real character of the emblems. Yes, our Andrews will tell our Simons, and our Simons will be called Peters; and the old truth made new, will draw the Philips. The Philips will find the Nathaniel, and we will have “Israelites indeed, in whom is no guile.”\n\nIt may be, and I believe it will be, as it was with John. Some Herod, in a rash vow, may, for the gratification of some adulterous party, sacrifice the temperance principle, and my eyesight is very dim if I do not see the power now that will do it—it exists. But I say as John said—“It is not lawful for thee to have her.” It is no union, it is no marriage. The curse of God rests on the adulterer, who, by lies and false pretences, have tried to seduce to their vile purpose this daughter of heaven. The head may go for it, but remember Herod; and remember that there can be “no communion of light with darkness—that there is no concord with Christ and Belial”—“that we cannot serve God and Mammon.” Though this may come to pass, yet he who was with John beyond Jordan, still lives, and Herod will yet hear of the fame of Jesus, and say to his servants—“This is John the Baptist, he is risen from the dead, and therefore mighty works do shew forth themselves in him.” I have done.\n\n“With heavenly weapons I have fought\nThis battle of the Lord’s.”\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_47062.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 64, "total-input-tokens": 101594, "total-output-tokens": 43665, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1560, 3], [1560, 4002, 4], [4002, 4329, 5], [4329, 4329, 6], [4329, 4657, 7], [4657, 4657, 8], [4657, 7265, 9], [7265, 10591, 10], [10591, 13868, 11], [13868, 17168, 12], [17168, 20305, 13], [20305, 23658, 14], [23658, 27008, 15], [27008, 30449, 16], [30449, 33860, 17], [33860, 37218, 18], [37218, 40645, 19], [40645, 43981, 20], [43981, 47272, 21], [47272, 50626, 22], [50626, 53918, 23], [53918, 57269, 24], [57269, 60491, 25], [60491, 63818, 26], [63818, 67236, 27], [67236, 70607, 28], [70607, 73962, 29], [73962, 77311, 30], [77311, 80683, 31], [80683, 84074, 32], [84074, 87465, 33], [87465, 90795, 34], [90795, 94090, 35], [94090, 97295, 36], [97295, 100569, 37], [100569, 103869, 38], [103869, 107010, 39], [107010, 110336, 40], [110336, 113631, 41], [113631, 116867, 42], [116867, 120260, 43], [120260, 123511, 44], [123511, 126653, 45], [126653, 129989, 46], [129989, 133282, 47], [133282, 136713, 48], [136713, 139820, 49], [139820, 143137, 50], [143137, 146271, 51], [146271, 149559, 52], [149559, 152812, 53], [152812, 156178, 54], [156178, 159565, 55], [159565, 162937, 56], [162937, 166313, 57], [166313, 169576, 58], [169576, 172845, 59], [172845, 176327, 60], [176327, 179696, 61], [179696, 182990, 62], [182990, 185877, 63], [185877, 185877, 64]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]