[{"id": "9211432e1eb6e0ac16988377c74147d7c7714273", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below:\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n- [ ] Additional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|----------------|-----|-----|-----|-----|-----|-----|\n|                | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL'Institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Couverture de couleur\n- [ ] Couverture endommagée\n- [ ] Couverture restaurée et/ou pelliculée\n- [ ] Le titre de couverture manque\n- [ ] Cartes géographiques en couleur\n- [ ] Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Planches et/ou illustrations en couleur\n- [ ] Relié avec d'autres documents\n- [ ] La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- [ ] Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n- [ ] Pages de couleur\n- [ ] Pages endommagées\n- [ ] Pages restaurées et/ou pelliculées\n- [ ] Pages décolorées, tachetées ou piquées\n- [ ] Pages détachées\n- [ ] Transparence\n- [ ] Qualité de l'impression varie\n- [ ] Comprend du matériel supplémentaire\n- [ ] Seule édition disponible\n- [ ] Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol \\(\\rightarrow\\) (meaning \"CONTINUED\"), or the symbol \\(V\\) (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagram illustrate the method:\n\n\\[\n\\begin{array}{ccc}\n1 & 2 & 3 \\\\\n4 & 5 & 6 \\\\\n\\end{array}\n\\]\nI.—Le Conseil Législatif peut-il constitutionnellement refuser les subsides ?\n\nII.—Le gouvernement Joly peut-il constitutionnellement gouverner sans subsides ?\n\nIII.—Le Lieutenant-Gouverneur peut-il constitutionnellement autoriser des dépenses sans subsides ?\n\nIV.—Le gouvernement Joly peut-il constitutionnellement emprunter ?\n\nV.—Le Lieutenant-Gouverneur peut-il constitutionnellement accorder la dissolution des Chambres au gouvernement Joly ?\nI.—LE\n\nLes\n\nLes\n\nLes\n\nLes\nLE REFUS DES SUBSIDES\n\nAUTORITÉS ET PRÉCÉDENTS\n\nI.—LE CONSEIL LÉGISLATIF PEUT-IL CONSTITUTIONNELLEMENT REFUSER LES SUBSIDES ?\n\nLes journaux libéraux s'évertuent à crier qu'il n'y a pas de précédents pour justifier l'action du Conseil Législatif, refusant les subsides. Nous admettons que la Chambre des Lords n'a jamais refusé les subsides, quoiqu'elle ait à quatre reprises différentes refusé des bills partiels de subsides. On lit cependant dans Cox, page 33 : \"Pendant une dispute sous le règne de la Reine Anne, entre les Lords et les Communes, les Lords, devant qui étaient les bills des subsides, ne voulaient pas le passer tant que la difficulté ne fut pas réglée !\" C'est ce qui explique cette phrase de Hume dans le tome 7me relativement à l'année 1705 : \"Cette importante affaire étant terminée, le parlement accorda un subside de 50,000 louis sterling et s'ajourna.\" On procédait donc alors comme aujourd'hui. Il y a peu de différence, constitutionnellement parlant, entre un bill accordant à la Couronne l'argent qui est dans le coffre et un bill établissant les moyens de procurer l'argent à la Couronne par une taxe ; car il est évident que, quant même l'on voterait des millions dans un bill de subsides, la Couronne ne serait guère plus avancée, si l'on détruisait les mesures du gouvernement qui doivent procurer ces millions. Or le rejet d'un bill d'argent par la Chambre des Lords est une chose de tous les temps.\n\nPourquoi la Chambre des Lords n'a-t-elle jamais rejeté un bill de subsides en entier ? C'est parce que les gouvernements anglais ont toujours eu tellement le sens de l'honneur qu'ils ont abandonné l'arène avant de forcer les gens à en venir à cette extrémité. Est-on capable de citer un précédent, qui vous montre un ministère anglais se cramponnant au pouvoir comme s'y cramponne le gouvernement Joly ? A-t-on jamais laissé vivre en Angleterre un ministère qui a abandonné toutes ses mesures ? On regarde cela là-bas comme un déshonreur que pas un homme sérieux ne peut supporter. Ecoutez-en quelques-uns :\n\nSir Robert Peel.—\"Je n'hésite pas à\ndire que, quand même le vote nous aurait été favorable, je n'aurais pas consenti à rester au pouvoir par tolérance ou en éliminant tout simplement les difficultés parlementaires. Ce n'est pas dans l'intérêt public qu'un gouvernement reste au pouvoir, lorsqu'il ne peut pas passer en pratique les mesures qu'il croit nécessaire au bien du pays, et quand même le vote nous aurait été favorable, nous ne serions pas restés au pouvoir avec honneur.\n\n(Hansard, vol. 87, p. 1043)\n\nDisraeli: \"Il est bon que la Chambre ait une explication claire à ce sujet, parce que ce ne serait pas à l'honneur de cette chambre qu'on put dire qu'aucun corps d'hommes n'ayant pas la majorité de cette chambre put cependant la contrôler.\" (Hansard, vol. 101, p. 1704).\n\nLord Brougham constate comme suit que l'histoire d'Angleterre n'a jamais offert qu'un seul exemple d'un gouvernement se cramponnant au pouvoir:\n\nLe gouvernement ne peut fonctionner chez nous un seul instant, s'il n'a pas pour lui une majorité bien décidée dans les deux chambres. On a dernièrement essayé de se passer de cet appui et les conséquences ont été déplorables. Cette tentative eut de si grands inconvénients pour ceux qui la firent et leur causa de si grands embarras et les discrédita tellement que l'on peut hardiment en conclure que ce sera le dernier état de ce genre, comme ce fut, en effet, le premier. (Démocratie et gouvernements mixtes, page 395)\n\nOn est tellement sensible sur ce point que les gouvernements qui en sont réduits à diriger les affaires du pays avec de petites majorités s'empressent de sortir de charge.\n\nEn 1741, Sir Robert Walpole a laissé le pouvoir dans les circonstances suivantes: Une motion impliquant le retrait de la confiance de la Chambre des Communes fut proposée par M. Pulteney. Cette motion fut rejetée de trois voix en faveur du ministère. Mais Sir Ro-\nbert Walpole abandonna le pouvoir. En l'année 1782, Lord North céda à une influence semblable.\n\nDeux motions furent proposées: l'une par Sir John Ross, l'autre par Lord George Cavendish. La première déclarait qu'il était impossible à la Chambre de donner sa confiance au gouvernement; la seconde était conçue en termes presque semblables à la première. La première fut rejetée par une majorité de 10; mais Lord North crut qu'il était de son devoir, en dépit de cette majorité, de donner sa resignation.\n\nEn l'année 1804, Lord Sidmouth dut se retirer avec une majorité de 37 voix. En 1812, lors de la première formation de l'administration de Lord Liverpool, sur motion de Lord Wharncliffe, alors M. Stewart Wortey, une résolution fut adoptée par la Chambre des Communes qu'une administration plus étendue et plus efficace devait être formée. La majorité de 4 décida du sort de la première administration essayée par Lord Liverpool.\n\nSir Robert Peel, pressé par les circonstances, d'essayer à rester au pouvoir avec une faible majorité, nous raconte ainsi ses perplexités dans ses explications ministérielles à la séance du 27 mai 1841:\n\nLes conséquences naturelles et inévitables d'une tentative ayant pour but de gouverner par la minorité, furent les conséquences que je rencontrai. Presque chaque soir mes procédés étaient obstrués. Dans chaque comité des subsides, on m'opposait quelques motions qui m'empêchaient de procéder aux affaires publiques, et à la fin je fus forcé de céder. Tant que l'influence des partis existera en ce pays, il en sera ainsi. Mais je dirai ceci de toute administration qui ait jamais existé, considérant la position relative des majorités et des minorités...\ndes minorités suivant le cas, jamais gouvernement n'a rencontré moins d'obstructions que le ministère actuel. Jamais gouvernement n'a été moins exempt d'opposition factieuse et pétulante. Mais, sans appréhension, je dis ceci, que l'expérience pratique nous prouve que le Noble Lord a raison—qu'il y aura de grands maux, inévitables et absolus, dans l'administration des affaires publiques, résultant de l'inversion de la règle constitutionnelle et de la tentative ayant pour but de gouverner sans une majorité suffisante.\n\nVoilà pourquoi la Chambre des Lords n'a jamais été à la peine de nous fournir un précédent sur la manière de refuser les subsides à un gouvernement impuissant.\n\nEn revanche, les colonies nous fournissent d'excellents précédents basés sur les instructions données par le Bureau Colonial aux Gouverneurs.\n\nLe 21 août 1867, le Conseil Législatif de Victoria (Australie,) refuse les subsides.\n\nLe Gouverneur Sir J. H. T. Manners-Sutton transmet cette résolution à ses aviseurs, qui y répondent dans un memorandum en date du 22 août, demandant au Gouverneur de proroger les chambres et de convoquer immédiatement une autre session pour reprendre le bill des subsides.\n\nLe Gouverneur leur répond comme suit :\n\n22 août 1867, 2 15 P. M.\n\nRelativement à l'avis qu'on me donne de proroger la législature et de convoquer une nouvelle session immédiatement pour donner une autre occasion au Conseil Législatif de voter les subsides, je dois déclarer, sans me prononcer sur le mérite de cet avis, qu'il est prématuré. Après avoir examiné avec soin la position du gouvernement et la mi-nuit propre, je dois avertir franchement mes aviseurs qu'il est désirable, selon moi, que je me mette immédiatement en communication d'une manière constitutionnelle avec ceux qui ont rejeté le bill des subsides et qui ont ainsi refusé au gouvernement les fonds nécessaires au service public.\n\nJ. H. T. MANNERS-SUTTON.\n\nLe même jour le gouvernement lui écrit :\n\nComme Son Excellence a jugé à propos de ne pas accepter l'avis que lui ont donné ses aviseurs responsables et a exprimé l'intention de se mettre constitutionnellement en relation avec ceux qui ont rejeté le bill des subsides, ils n'ont d'autre alternative que d'offrir leur résignation à Son Excellence.\n\nJAMES McCULLOCH.\n\nLe 23 août, le gouverneur développe davantage sa pensée en se mettant en communication avec M. Fellows :\n\nBureau du Gouvernement,\nMelbourne, 23 Août 1867.\n\nEn refusant le conseil de mes aviseurs, j'ai pas agi pour faire tromper un parti sur l'autre, mais parceque mes aviseurs sont évidemment devenus incapables par le rejet du bill des subsides de conduire l'administration des affaires publiques, relativement au paiement des sommes dues légitimement, de la manière ordinaire strictement constitutionnelle et le gouverneur croit qu'il est de son devoir de demander l'avis de ceux qui ont rejeté le bill en question.\n\nJ. H. T. MANNERS-SUTTON.\n\nM. Fellows refuse de donner son avis parce qu'il sait qu'il ne peut former un gouvernement, et l'impossibilité pour toute autre combinaison de trouver la majorité dans l'Assemblée Législative prolonge la crise. Dans l'intervalle, le gouverneur annonce qu'il n'autorisera aucun paiement qui n'aura pas été voté.\n\n26 Août, 1877.\n\nLe gouverneur croit que pour éviter des complications, les chefs de Département devront s'abstenir de lui soumettre des certificats d'argent à signer. Aussi longtemps que les subsides n'auront pas la sanction du Parlement, le gouverneur croit qu'il occupera une position insoutenable ou, au moins, exceptionnelle au point de vue constitutionnel, s'il sanctionnait aucun autre nouvel engagement que les dé-\npenses que l'autorité du Parlement couvre déjà.\n\nJ. H. T. MANNERS-SUTTON.\n\nEn rendant compte de sa conduite au gouvernement anglais, le gouverneur explique pourquoi il a repris ses anciens aviseurs :\n\nMelbourne, 26 Oct. 1867.\n\nSi j'avais eu la conviction que leurs adversaires, appelés au pouvoir, eussent commandé la majorité dans l'Assemblée Législative sur les questions en dispute, j'aurais pu suivre une conduite différente ; mais il n'est pas nécessaire de discuter ce point, parceque cela n'était pas probable.\n\nJ. H. T. MANNERS-SUTTON.\n\nA Sa Grâce le Duc de Buckingham et Chandos\n\nLe gouverneur exprime la même opinion dans un mémoire à ses ministres le 8 novembre 1867 :\n\n8 Novembre 1867.\n\nLe Gouverneur rappelle à ses aviseurs que s'il avait pu arriver à la conclusion, ou même entretenir l'espoir qu'une nouvelle administration aurait fait disparaître les présents embarras, il aurait considéré comme son devoir de le faire.\n\nLe gouvernement Anglais approuve les doctrines du gouverneur :\n\nDowing Street, 31 Oct. 1867.\n\nMonsieur,\n\nJe dois vous exprimer mon approbation de la ligne de conduite que vous avez tenue.\n\nBUCKINGHAM & CHANDOS.\n\nHon. Sir J. H. T. MANNERS-SUTTON.\n\nDowing Street, 1 Janv. 1868.\n\nMonsieur,\n\nJe ne trouve aucun motif de désapprover la conduite que vous avez tenue dans les circonstances difficiles.\n\nJe ne suis pas surpris que le Conseil représentant comme il le fait un contingent aussi considérable de propriété et d'intelligence dans la colonie, ait regardé ce mode de procéder comme une tentative de coercion contre eux.\n\nBUCKINGHAM & CHANDOS.\n\nMonsieur,\n\nDans tous les cas où la loi vous donne le pouvoir d'empêcher la dépense des fonds publics, par le refus de votre mandat, ou en empêchant la signature d'un contrat, lorsque les fonds n'auront pas été votés par le Parlement, le gouvernement de Sa Majesté ne peut vous absoudre de la responsabilité de décider par vous-même si vous ne serez pas justifiable, suivant les circonstances, de vous servir de ce pouvoir afin d'empêcher une dépense d'argent qui veut paraître être inconstitutionnelle.\n\nBUCKINGHAM & CHANDOS.\n\nSi les Lords n'ont pas eu l'occasion d'exercer leurs privilèges, il n'en est pas moins reconnu universellement, en Angleterre, qu'ils ont le droit de refuser les subsides. Il n'y a qu'à ouvrir les auteurs constitutionnels pour s'en convaincre.\n\nOn lit dans Blackstone :\n\nIl suffit que les Lords aient le pouvoir reconnaître le rejeter le bill des subsides, s'ils trouvent les Communes trop imprudentes ou trop dans leurs dons. (1 Com. de Blackstone le c. 169).\n\nDe Holme dit :\n\nLes Lords doivent tout simplement accepter ou rejeter le bill des subsides seulement (Liv. i, ch. 4.)\n\nOn lit dans Cox :\n\nTous les écrivains concordent ce droite aux Lords. Il est clair que la perte de cette ré- droit de rejeter les subsides équivaudrait une vi- à ceci : Si les Lords ne pouvaient refuser les subsides, il serait superflu de leur en- voyer le bill des subsides ; et si on ne leur envoyait pas le bill des subsides, la Couronne ne serait pas obligée de les con- vocuer tous les ans, comme elle le fait aujourd'hui pour avoir des subsides. Si les Lords n'avaient pas le pouvoir de rejeter le bill des subsides, ils seraient la seule partie de la société à qui on refuserait le droit. (Page 189).\n\nLord Brougham fait voir comment suit l'absurdité de vouloir refuser aux Lords le droit de s'occuper des subsides :\nQuoique les lords n'aient jamais renoncé au droit qu'ils prétendent avoir de prendre au besoin l'initiative des Bills de subsides ou de les amender, aussi bien que la Chambre des Communes, cependant, à la pratique, ils ne l'ont jamais revendiqué, et nous pouvons, par conséquent, en conclure, que dans notre constitution, la Chambre des Communes peut seule élaborer une loi financière, et que les lords n'ont pas le droit d'y faire des changements lorsqu'on leur présente, mais qu'ils doivent l'accepter ou la rejeter dans son entier.\n\nIl semble parfaitement clair que ce droit exclusif de la Chambre des Communes ne lui est d'aucune utilité, tandis qu'il l'a considérablement gêné dans l'expédition des affaires publiques, en lui imposant la nécessité de se charger de l'examen de beaucoup de Bills qui doivent être portés à la chambre des lords, pendant que ceux-ci n'ont rien autre chose à faire ; ce qui est cause que des lois sont rejetées à la fin des sessions, puis alors reportées de nouveau à la Chambre des Communes pour être amendées par suite des objections qu'elles ont soulevées chez les lords. On reconnaît facilement que la Chambre des Communes n'a rien à gagner par ce préjudice, et qu'il est plus absurde que Blackstone le comparer aux fonctions judiciaires exercées par la Chambre Haute ; car dans ce dernier cas, la Chambre des Communes peut intervenir en rien ; l'affaire se termine et s'achève dans la Chambre des lords, tandis que l'assentiment des lords n'est pas moins nécessaire pour les articles d'un bill des subsides que pour toute autre clause d'un bill quelconque.\n\nCette revendication est née d'une excitation violente ; elle est fondée sur des exclamations romanesques et poétiques, sur des façons de voir tout à fait exagérées ; elle vient aussi de ce que l'on confond des choses qui se ressemblent avec des choses identiques, de ce qu'on substitue une idée à une autre, ou bien de ce que l'on prétend agir déraisonnablement après des pures fantaisies et des figures de rhétorique, au lieu de se décider par de solides arguments. On doit aussi remarquer que la Chambre des Communes, après avoir traité ce privilège comme s'il faisait voir comment de la dernière importance, et la sauvegarde de tous les autres, a souffert que maintes fois, on le méconnût complètement. C'est ce qui est arrivé lorsqu'elle dut abandonner l'absurde prétention qu'une interdiction à laquelle était attachée une amende, ne pouvait être de la compétence des lords, parce que c'était une question financière. (Démocratie et gouvernements mixtes, page 382.)\n\nEn Angleterre, en 1671, il a été décidé que la Chambre des Lords peut rejeter tout le bill des subsides. Le 15 mai 1689, un comité chargé par la Chambre des Communes d'étudier la question fit rapport que la Chambre des Lords peut adopter ou rejeter un bill de subsides.\n\nM. Abbott, l'Orateur de la Chambre des Communes, dit, dans une conférence officielle avec la Chambre des Lords, 12 juin 1808 :\n\nSi les Lords diffèrent d'opinion avec les Communes sur ce bill, ils ont naturellement le droit de le rejeter.\n\nLe principe de cette doctrine a été maintenu jusqu'à nos jours, et quoique la Chambre des Lords n'ait jamais eu l'occasion d'exercer ce principe dans sa plénitude, elle l'a appliqué avec succès sur différents bills monétaires et notamment en 1860 en rejetant une partie de la politique financière adoptée par la Chambre des Communes. À cette session, cette doctrine a été reconnue et commentée comme suit par Lord Palmerston à la séance de la Chambre des Communes du 5 juillet 1860 :\n\nDans cette mémorable conférence qui eut lieu entre les deux chambres du Parlement, en 1671, il fut admis par le Procureur-Général, qui reçut les remerciements de la chambre, que les Lords, tout en ne pouvant donner naissance à un bill des subsides, avaient néanmoins le pouvoir de le rejeter.\n\n........Ce n'était pas une grande concession ........Cette chambre n'a fait qu'admettre ce qu'elle ne pouvait nier ; et quand même elle l'aurait nié, elle n'aurait pu donner d'effet à son refus.\n\n........Il est clair que l'autorité dont le concours est nécessaire pour donner force de loi à une proposition doit par la nature des choses avoir le pouvoir de donner ou\nrefuser sa sanction. Vous ne pourriez retirer à la Chambre des Lords ce droit que par un bill qu'ils devraient eux-mêmes sanctionner ou bien vous tomberiez dans la révolution.\n\nM. Disraeli dans la même discussion s'est exprimé ainsi :\n\nLa seconde résolution est une admission que je crois à la fois constitutionnelle, convenable et légale, que la chambre des Lords peut rejeter les bills de subsides et personne ne peut, de ce côté-ci de la chambre, refuser convenablement à la chambre des Lords ce privilège ....... Je crois donc que cette résolution qui reconnaît positivement à la chambre des Lords le droit de rejeter des bills d'argent doit être soutenue par e parti conservateur.\n\nLe comte de Derby dans la séance de la Chambre du 7 juin 1861, a ainsi défini les pouvoirs de la Chambre des Lords :\n\nIl est vrai qu'il y a des sujets de dispute entre les deux chambres ; mais il y a certainement des points qui ne laissent aucun doute et qui ne laissent pas prise à la discussion. Quant aux points douteux ils ne peuvent être réglés que par la prudence et la discrétion de chaque chambre respectivement. Mais il n'y a rien de plus clair et de mieux établi que les deux points suivants :\n\n1o. La Chambre des Communes doit donner naissance au bill des subsides ;\n2o. D'un autre côté et c'est là la justification de votre conduite : le dernier, la Chambre des Lords a le pouvoir d'accepter ou de rejeter tout bill monétaire.\n\nLe 11 juin 1861 un comité de la chambre des Lords, parmi lesquels se trouve le comte de Carnarvon, a, dans un protêt publié dans le Journal de ce jour, affirmé que la Chambre des Lords \"pourrait rejeter en entier un bill de subsides dont une partie lui déplairait et que cette pratique serait tout à fait conforme aux privilèges indiscutables de cette chambre.\"\n\nLorsque le Conseil Législatif de Victoria, Australie, refusa le 21 août 1867, les subsides votés à une grande majorité par l'Assemblée Législative, le gouvernement impérial donne sa pleine sanction, comme pratique constitutionnelle, à un tel procédé, et la dépêche du duc de Buckingham et Chandos à Sir J. H. T. Mauclers Sutton, gouverneur de Victoria, en date du 1er janvier 1868, dit expressément :\n\n\"Je ne suis pas surpris que le Conseil représentant comme il le fait, un tel contingent de propriété et d'intelligence dans la colonie, ait trouvé qu'on ait voulu forcer à sanctionner, sans même délibération, un vote d'argent dont il mettait l'opportunité en doute.\"\n\nLa même opinion avait été exprimée précédemment par un autre ministre des colonies, Mr. Cardwell, de la manière suivante :\n\n\"26 février 1866 : Le bill en question a été soumis à la Couronne même inconvenant qu'il trouverait dans cet état de choses.... Le Conseil Législatif avait qu'on croyait maintenir ses privilèges en matière de budget et de vote de crédit.... Vous auriez dû pratiquer votre autorité lorsque vos ministres continuaient de prêter des droits, malgré la décision de la cour.\"\n\nCARDWELL.\n\nLe Canada lui-même nous fournit des preuves des mêmes faits : en 1856, le Conseil Législatif du Canada refusa sous les subsides pour les raisons énoncées dans les résolutions qui suivent :\n\nRésolu : — Que cette Chambre n'ayant pas été consultée sur le choix d'un échafaud quelconque pour fixer le siège du gouvernement de cette province d'une manière permanente et l'autre branche de la Législature ayant fixé la permanence du siège du gouvernement à Québec et ayant eu plus passé un bill de subsides pourvoyant à la construction de bâtisses publiques à Québec, cette Chambre croit de son devoir impérieux de déclarer qu'elle ne peut consentir dans le bill des subsides.\" (Session de 1856.)\n\nCette résolution fut adoptée.\nII.—LE GOUVERNEMENT PEUT-IL CONSTITUTIONELLEMENT SE PASSER DE SUBSIDES?\n\nLe public se demande, depuis l'ajournement de deux mois, ce qu'il faut penser de la situation. Nous allons lui donner les principes constitutionnels qui régissent le cas et chacun pourra tirer ses conclusions. Nos lecteurs pourront mieux juger l'action du gouvernement par les citations suivantes :\n\nMay dit page 532 :\nUn vote d'argent des Communes ne veut en loi que s'il a définitivement la sanction de la Reine et de la Chambre des Lords.\n\nC'est, cependant, la pratique de permettre aux communes avant qu'elles ne soient affranchies de la taxation par le bill d'appropriation, parce que le législatif avait sur le compte que la sanction du Parlement privilégié en matière définitivement obtenue ; mais c'est une pratique qu'on doit voir d'un œil jaloux, si lorsque vos ministres n'ont pas la confiance du Parlement, vous prélevez des droits sur la Cour.\n\nCARDWELL : \"Lorsque le bill d'appropriation ne serait pas, parce que, dans ce cas, tous les votes de la Chambre des Communes sont annulés et qu'il faut revoter tous les raisons énoncées en Angleterre la dépense d'un montant en compte est une solution qui se fait sous pour les dépenses ordinaires, sans un vote du Parlement.\n\nLa Chambre n'a pas une chose inouïe. Lorsque la Chambre siège après l'expiration de l'année fiscale, on est obligé de faire voter spécialement un montant en compte de la manière suivante :\n\nSubsides pourvoyés à la Couronne pour la dépense spécifiée, ne donnent pas le pouvoir au gouvernement de retirer du Fond Consolidé l'argent ainsi voté. Il faut une autre autorisation, savoir une résolution du comité des Voies et Moyens, et elle doit passer ensuite à l'état de bill et obtenir la sanction des deux chambres, avant que le vote des subsides n'ait eu aucun effet pratique et que le Trésorier puisse toucher aux fonds pour faire les dépenses autorisées.\n\nL'on procède de la manière suivante. Aussitôt qu'après le commencement de la session, on a fait rapport des votes en compte pour différents services, on propose une résolution en comité........... Un bill est basé sur ces résolutions, et il reçoit la sanction royale pendant la session, et alors, mais alors seulement, le Trésorier a le pouvoir de tirer sur le Fonds consolidé pour faire les dépenses autorisées par la Chambre des Communes. L'objet constitutionnel de cette procédure est que, tant que la reine et la Chambre des Lords n'ont pas sanctionné l'octroi des voies et moyens l'appropriation des fonds publics faite par la Chambre des Communes est sans effet. Ces octrois en compte sont en anticipation d'un Acte du Parlement qui devra passer dans le cours de la session. On peut les considérer comme un subside d'interim que la Chambre des Communes seule a réglé, on attendant qu'il soit confirmé à la fin de la session\". Report on Public Moneys, Commons Papers, 1857, sess. II, vol. IX, pp. 26 et 27.\n\nLa seule formule possible pour la Chambre des Communes de demander, seule, une dépense d'argent est par une adresse à la Couronne dans laquelle elle demande ce qu'elle veut, en ajoutant \"qu'elle se tient responsable pour le montant.\" C'est le seul vote de crédit que la chambre puisse donner dans les circonstances : c'est-à-dire qu'elle s'engage à le faire voter plus tard.\n\nMais, dit Todd, page 436, vol. I, ces adresses ne sont justifiables que s'il n'y a pas de raison de craindre que ces avances ne\nsoient désapprouvées par l’autre chambre du Parlement, dont le concours est nécessaire pour rendre légale aucune mesure de subsides ou d’approvisionnement.\n\nLe premier exemple du refus du souverain de recevoir ces adresses de la chambre se trouve dans Halsell’s Commons Precedents, 3e vol., page 195. Les Communes demandèrent à Georges IV, alors régent, le 22 mai 1811, de payer une somme de £54,000 à M. Palmer, pour réclamation. Voici la réponse de Georges IV envoyée aux Communes. Elle sert depuis de formule :\n\nCe doit être en tous temps mon désir de remplir les souhaits de la Chambre des Communes et je serais prêt à leur donner effet dans la présente circonstance, lorsque le Parlement aura pourvu aux moyens.\n\nLa raison de cette réponse est que la Chambre des Lords s’était déjà opposée à ce paiement et le Régent, connaissant cette opposition, a voulu faire comprendre aux Communes qu’il leur fallait l’assentiment des Lords pour autoriser une dépense.\n\nHalsell ajoute, page 196, “que la justification du Régent est qu’il savait que les Lords s’y opposaient.”\n\nTodd, page 436, 1er vol., dit :\n\n“Cette manière d’obtenir de l’argent, dans le but express d’éviter la nécessité de demander le concours de la Chambre des Lords, est inconvénante.”\n\nLa même réponse a été donnée par la Reine le 21 juin 1841, à une adresse de la Chambre des Communes la priant de payer une certaine somme à des réclamants.\n\nL’extrait suivant de Halsell’s Precedents, vol., III, p. 206, parle de lui-même. Cette autorité est supérieure même à celle de May :\n\n“Il s’est élevé une difficulté en 1784. Différents bills d’octrois pour l’armée, la marine et l’ordonnance étaient passés à la Chambre des Communes. Mais le bill d’appropriation n’était pas passé. Lors du changement d’administration aux vacances de Noël, on commença à craindre que le nouveau gouvernement voulut dissoudre les Chambres au mois de janvier. La question s’éleva de savoir, dans le cas où le Parlement serait dissous avant la passation du bill des subsides, si les officiers de Trésor Couronné, dans aucun département, seraient autorisés à payer au compte de la marine, de l’armée ou de l’ordonnance. C’était un projet coutume pendant la session de payer pour ces fins sans approbation du Parlement et elle. On faisait cela parce que c’était plus commodé et dans l’espérance qu’avant la fin de la session un acte du Parlement autoriserait ces dépenses. Mais en dissolvant le Parlement, toute résolution de la Chambre des Communes, qui n’aurait pas pris la forme de loi, cessait d’exister. Les voix de la marine et de l’ordonnance s’appuyaient comme s’ils n’avaient jamais existé ; et les officiers du Trésor et de l’office quelconque se trouvaient, sans même l’autorisation du vote des Communes, pour dépenser les montants nécessaires. Il n’y avait pas moyen de savoir si la prochaine Chambre des Communes ne voterait ces montants. Cette difficulté s’aggrava, lorsque la Chambre des Communes passa le 13 janvier 1784, la résolution suivante : ‘Aucune personne ou personne nées dans le département du Trésor de Sa Majesté ou dans l’Échiquier, ou dans la Banque d’Angleterre, qui paiera, ou fera payer aucune somme d’argent pour les services votés dans la présent session du Parlement après que le Parlement aurait été prorogé ou dissous avant la passation d’un acte d’appropriation disposant de ces subsides, sera coupable d’un crime d’état et d’un délit, d’une violation effrontée de la loi publique, dérogatoire aux privilèges fondamentaux du parlement et aura agi d’une manière subversive pour la constitution du pays.’”\n\nCet ordre eut pour effet d’empêcher le gouvernement de toucher à ce fonds à l’exception d’un montant minime, d’autant plus justifiable, qu’alors les subsides votés l’année précédente s’appliquaient l’année suivante en cas de surplus.\nLe seul cas où la Chambre a été passée. Lorsqu'elle vote des subsides à la mort de George III en 1820, les Communes votèrent un montant en bloc et l'on n'eut pas dans le cas où le temps de passer un bill ; mais avant la passe des Lords le régularisèrent comme les officiers de la marine par une résolution \" que cette partement serait une chambre, vu l'état des affaires du Parlement, concourait dans ces résolutions, de payer pourquoi aucun acte ne soit passé à la Chambre des Communes sur les questions d'argent sans le concours de l'autre chambre ne lie pas. (Hansard, vol. 41, p. 351.)\n\nLe Marquis de Lansdowne : L'on a fait observer avec beaucoup de raison que si la Chambre des Communes s'arrogeait le pouvoir de voter des sommes d'argent sans le concours de la Chambre des Lords, elle établirait un précédent préjudiciable ; car il n'y a pas de doute que les personnes qui s'attaquent à nos institutions détruiront tous les privilèges de cette Chambre s'ils prennent de l'ascendant. (Hansard, vol. 41, p. 1635).\n\nLord Cranworth, Chancelier de l'Echiquier : La Chambre se rappellera qu'il n'est pas suffisant que l'argent destiné au public soit destiné par autorité du Parlement, mais la sagesse de cette Chambre y a ajouté une autre restriction, savoir qu'aucun argent, quoique légalement destiné et approprié par cette chambre, ne peut être employé sans un Bill de Vœux et Moyens... Nous ne pouvons pas employer cet argent, quoiqu'il ait été voté en comité des subsides, sans un Bill des Vœux et Moyens, (Hansard, vol. 136, p. 1310.)\nIII—LE LIEUTENAINT-GOUVERNEUR PEUT-IL CONSTITUTIONNELLEMENT AUTORISER DES DÉPENSES SANS LE VOTE DES SUBSIDES?\n\nNous avons exposé les principes constitutionnels qui régissent un gouvernement sans subsides. Nous allons maintenant examiner un précédent qui nous fera connaître comment le gouvernement anglais entend que l'on respecte ces principes. Un gouverneur a été destitué tout simplement pour avoir permis à son gouvernement, à qui le Conseil Législatif avait refusé les subsides, de continuer à faire les dépenses nécessaires. L'énergie du Bureau Colonial, en cette circonstance, nous donne la mesure de l'importance que l'on attache, en Angleterre, à la sanction préalable de toutes dépenses publiques.\n\nLe précédent nous vient encore de Victoria, (Australie,) deux ans avant celui que nous avons cité samedi. Sir Charles Darling, le Gouverneur, après avoir pris la bonne résolution de ne pas laisser ses aviseurs faire des dépenses illégales, se laisse circonvenir et finit par permettre à ses ministres d'emprunter des fonds à une banque et de payer les employés et les contracteurs. Voici ce qu'en pense le Bureau Colonial :\n\nDowning St., 27 Nov. 1865.\n\nJe ne comprends pas clairement si le concours des auditeurs a été nécessaire pour ces paiements ; mais c'est secondaire. L'effet pratique a été de transférer l'argent public des comptes publics, desquels les banques ne pouvaient le retirer, sans le certificat de l'auditeur à un autre compte entièrement sous le contrôle du gouvernement.\n\nL'argent ainsi obtenu a été appliqué par le gouvernement exécuteur au paiement des salaires et je suppose aux autres besoins immédiats, spécifiés dans le bill d'appréciation, que le Conseil a rejeté. Je conclus que c'est par la continuation de l'extension de ce procédé que le gouvernement a continué d'administrer les affaires...\n\nJe ne puis voir en vertu de quoi vous vous êtes imaginé que vous étiez autorisé légalement à emprunter une banque des sommes d'argent au nom du public. Vous n'alléguez aucune autorité et je me perds en conjectures pour en supposer. La seule excuse de cette procédure est être un besoin public d'une urgence incontournable, qui est justifié ce que la loi ne justifie pas. Mais comme je l'ai observé, vous avez déjà déclaré que cette urgence n'existait pas. Et vous avez eu raison de le déclarer : cette urgence n'existait pas.............. C'est l'une ou l'autre branche de la législature à céder ou à entrer en compromis. Ce N'EST PAS A VOUS A DONNER LA VICTOIRE À L'UN OU À L'AUTRE PARTI PAR UN PROCÈDÉ QUI NE VOTRE COMMISSION NI LES LOIS DE LA PROVINCE NE L'AUTORISENT. Je dois remarquer que par ce procédé, le Gouverneur et son gouvernement peuvent en temps réellement aucun montant des fonds publics et en disposer débarrassés de tous les contrôles que la législature avait soigneusement institués...\n\nDe la manière dont vous avez agi jusqu'à présent, je suis d'opinion qu'en contractant des emprunts sans sanction de la loi et en payant des salaires sans la sanction de la loi, vous vous êtes éloigné des principes sur lesquels j'ai promis de vous annoncer l'intention de vous appuyer et que j'ai approuvés, savoir le principe d'une stricte adhésion à la loi. Je regrette cela profondément. Le Représentant de la Reine est justifiable de céder à un degré considérable à ses aviseurs constitutionnels en matière de politique ou même d'équité. Mais il est impérativement obligé de refuser l'autorité de la Reine à tous ces procédés illégaux par lesquels un parti politique ou un membre d'un parti politique sont tentés de recourir pour établir leur pouvoir...\npondérance sur l’autre. Je suis sûr que tous les esprits honnêtes et intelligents de la colonie s’accorderont avec moi à penser que les pouvoirs de la Couronne ne devraient être jamais employés pour autoriser ou faciliter aucun acte requis pour un acte immédiat de politique, mais défendu par la loi.\n\nCARDWELL.\n\nJanvier 26, 1866.\n\nJe fais la part des difficultés qu’éprouve le Gouverneur d’une colonie qui se trouve appelé par ses aviseurs responsables, avec le concours de l’Assemblée Législative, à adopter, dans le but de triompher d’une difficulté immédiate, des mesures qu’on peut mettre en question, mais qui, dans l’opinion de ses aviseurs légaux, sont dans les limites de la loi.\n\nJe ne puis m’empêcher de vous dire combien je différe d’avec vous lorsque vous parliez du concours du Conseil dans le bill des subdites comme une affaire de forme, de la méconnaissance de ses droits législatifs comme d’une insigne et de ses plaintes comme d’une chose frivole et sans fondement. C’est évidemment, non pas une affaire de forme, mais ESSENTIELLEMENT UNE AFFAIRE DE SUBSTANCE autant que de forme, que la décision par laquelle on vous a avisé de passer outre. Les principes en jeu me paraissent si clairs, et la ligne de conduite à suivre si évidente que je ne puis que REGRETTER que vous ayez consenti à recevoir cet avis.\n\nCARDWELL.\n\nDowning St., 26 mars 1866.\n\nQuant à une mesure comme celle d’emprunter de l’argent, d’une manière que ne justifie pas la loi, dans le but d’éviter un grand inconvénient public, je crois que je n’ai pas besoin d’examiner, au point de vue d’une société intelligente comme celle que vous avez à administrer, qu’est-ce qui pourrait justifier aucun abandon de l’esprit et de la lettre de la loi. Mais il est clair qu’aucune telle nécessité ne s’est pas fait sentir à Victoria; et prendre de l’argent pour le service public soit par les moyens que vous avez employés, soit en empruntant d’une banque, soit par aucune autre mesure que la législature de Victoria n’a pas sanctionné, N’EST PAS UNE CHOSE JUSTIFIABLE.\n\nCARDWELL.\n\nQuand au déboursement des argent publics et aux emprunts dans ce but, si vos aviseurs légaux et l’auditeur sont d’avis que c’est autorisé par la loi, il faudra naturellement agir de la manière ordinaire. Mais si l’on vous propose encore des paiements d’une manière exceptionnelle, sans ce certificat ordinaire et à même les fonds obtenus irrégulièrement, comme on en a obtenus de la banque d’Australie, vous refuserez votre consentement, parce que tous ces paiements sont illégaux.\n\nCARDWELL.\n\nLors de la nouvelle crise arrivée à Victoria le 27 novembre 1877, le gouvernement de Victoria a voulu faire renverser ces décisions du bureau colonial. Dans un mémoire adressé au Gouverneur Sir Charles Bowen, en date du 31 décembre 1877, les ministres disaient :\n\nLes aviseurs de Votre Excellence ont pris en sérieuse considération les dépêches du vicomte Cardwell à Sir Charles Darling en 1865-6, spécialement celles du 26 octobre 1865 ; 26 janvier 1866, etc. On\nsemble établir dans ces documents relativement à la dépense des argent publics, que le Gouverneur doit personnellement et indépendamment de l'avis de ses ministres et des officiers en loi de la Couronne s'assurer par lui-même quel est l'état de la loi et comment on doit l'interpréter. Aucun argent public ne peut sortir sans son warrant, et ces graves et importantes devoirs que ces décharges établissent lui imposent la responsabilité de décider seul s'il peut signer légalement ces mandats.\n\nVos aviseurs attirent votre attention sur le fait que jusqu'en 1862, c'était la coutume dans ce pays d'appliquer l'argent voté par l'Assemblée Législative sans attendre aucune autre autorité législative. On commença en 1862 à renvoyer le bill des sub-sides au Conseil ; mais on continua à agir comme ci-devant ; et les Gouverneurs signalèrent les mandats sans attendre que le Conseil eut sanctionné ces dépenses. Vos aviseurs représentent simplement qu'en revenant à cette ancienne pratique, ils éviteraient l'anarchie, que le refus des sub-sides rend inévitable. Vos aviseurs ne vous demandent pas une innovation dangereuse, suspendant les lois, ils ne désirent que revenir à l'ancienne pratique.\n\nGraham Berry,\n\nPremier.\n\nMelbourne, 31 décembre 1877.\n\nSir Charles Bowen transmet ce document à Londres. Voici la réponse du Bureau Colonial faite par le Secrétaire actuel des colonies :\n\n[Télégramme.]\n\nFévrier, 22.\n\nAu gouverneur Bowen,\n\nMemorandum du 31 décembre reçu. Votre loyer est clair. Agissez suivant l'avis de vos ministres, si vous êtes convaincu que l'action qu'ils recommandent est légale ; sinon, appuyez-vous sur la loi. Si vous n'êtes pas sûr de la loi, prenez les meilleurs avis légaux à votre disposition.\n\nHicks-Beach.\n\n[Par la malle.]\n\nDowning St, 28 Fév., 1878.\n\nJ'ai reçu le 18 votre dépêche du 31 décembre, me transmettant le memorandum de M. Berry sur le refus des sub-sides. Le principe général qui doit guider le représentant de la Reine dans ces circonstances a été clairement exposé par plusieurs de mes prédécesseurs, dans des décharges qui, comme je le vois, sont familières à vous et à vos aviseurs. En regard à cela et à la définition de vos devoirs, tels que vous les entendez dans votre dépêche du 19 septembre (18e paragraphe) je ne crois pas devoir vous donner d'autres instructions à ce sujet, si ce n'est que je désire que vous n'ayez aucun doute sur l'entier concours que je donne aux opinions de ceux qui m'ont précédé en office.\n\nM. E. Hicks-Beach.\n\nGouverneur Sir G. F. Bowen,\nG. C. M. G., etc, etc.\n\nCela prouve que la doctrine défendant à un Gouverneur de permettre un seul sou de dépenses non autorisées par la Législature, est la doctrine irrévocable du gouvernement anglais.\nIV—LE GOUVERNEMENT PEUT-IL CONSTITUTIONNELLEMENT EMPRUNTER?\n\nLe gouvernement peut-il emprunter?\nLa loi du Trésor, 31 Vict. chap. 9, sect. 2 de la clause 27 dit:\n\n2. Le Lieutenant-Gouverneur en Conseil peut, de temps en temps, dans le cas d'au- \n   nant besoin causé par un déficit dans le \n   revenu d'une manière imprévue, donner \n   ordre au Trésorier d'effectuer un emprunt \n   temporaire imputable au fonds du revenu \n   consolidé, etc., mais tel emprunt ne devra \n   pas excéder le montant de tel déficit dans \n   le dit revenu du fonds consolidé pour ren-\n   contrer les obligations qui pèsent par la loi \n   sur ce fonds et il ne DEVRA PAS ETRE APPLIQUÉ \n   AUCUNE AUTRE FIN.\n\n10. Il faut d'abord qu'il y ait déficit, ce qui n'existe pas dans le \n   présent cas.\n\n20. Cet emprunt ne peut servir qu'aux charges créées par la loi; ou \n   en l'absence du bill des subsides, il n'y a pas de charges créées par la \n   loi pour la plupart des cas.\n\nUn emprunt général, en dehors de ces conditions, est défendu com-\nme suit:\n\nEt le principe qui dépend au gouverne-\nment de solliciter des dons ou des prêts va \njusqu'à défendre à toute personne de prêter \nvolontairement de l'argent à la Couronne, ou \nà aucun département public, pour fins publi-\nques, sans la sanction du Parlement, sous \npeine de délit. (Todd vol. I, p. 454.)\n\nC'est un principe élémentaire de \ndroit constitutionnel, que nous \ntrouvons affirmé de vingt maniè-\nres différentes.\n\nLe contrôleur de l'Echiquier, \ndans le Rapport de l'enquête ins-\ntituée par la Chambre des Com-\nmunes sur les argent publics, en \n1857. (Vol. IX, Sessional Papers of \nthe House of Commons,) dit:\n\nLa Banque d'Angleterre n'a pas le droit \nde prêter un sou au gouvernement.\n\nVoici différentes autorités qu'on ne mettra pas aisément de côté:\n\nM. Fox: La pratique inaugurée d'al-\nler dans le pays inviter les gens au \nnom de Sa Majesté d'assister le gouverne-\nment par des souscriptions volontaires est \ncomplètement illégale et des plus dange-\nreuses pour la constitution ...................\n\nLe Parlement siége maintenant et pendant \nce temps le secrétaire d'état préleve de \nl'argent sur les sujets sans l'intervention \nde cette chambre, alors que la constitution \na répété tant et plus qu'aucun argent ne \ndevrait être donné au roi par le peuple an-\nglais autrement que par ses représentants \nen Parlement. (Hansard, 17 mars 1794)\n\nA propos d'un projet émis par le \ngouvernement anglais en 1794 de \nprélever des fonds sur le public, voici ce qu'on lit dans l'histoire de \nGeorges III de Massey, 4me vol. \np. 77:\n\nSheridan amena en conséquence la mo-\ntion suivante:\n\nQu'il est dangereux et inconstitutionnel \nde solliciter de l'argent du public soit com-\nme aide privée, soit comme emprunt, soit par \npleine assistance, soit comme souscription pour \ndes fins publiques, sans le concours du Par-\nlement.\n\nLe projet du gouvernement était blâ-\nnable en principe. Il était inconstitu-\ntionnel et nullement nécessaire. À la \nChambre des Communes appartient le \ndroit exclusif d'accorder des subsides pour \nle service de la Couronne; et tout appel \nimmédiat au public dans le but d'obtenir \nde l'aide pour ces services légitimes est \nune violation de ces droits et privilèges...\nLe Parlement pourrait un jour refuser les \nsubsides pour l'augmentation de l'armée, \net le lendemain un décret royal pourrait \nprélever les mêmes fonds que le Parle-\nment aurait refusés (page 77 et 78.)\n\nIl est certain que le gouvernement ne \nvoulait pas agir d'une manière inconstitu-\ntionnelle. Son but était correct; mais il prenait un mauvais moyen pour y arriver. (Page 79).\n\nVoici d'autres citations qui nous prouvent que cette doctrine, si nettement définie, est encore en force aujourd'hui:\n\n**Lord Brougham.**—Ceux qui contribuent à prélever des sommes considérables sans l'autorité du Parlement, doivent être prêts à abandonner les doctrines constitutionnelles soutenues par les meilleurs avocats constitutionnels et par les plus hautes autorités constitutionnelles.\n\nDu moment que la tolérance du Parlement, la tolérance des classes respectables et le zèle politique, pour ne pas dire le zèle de parti ou de faction, permettront impunément ces contributions, la conséquence sera la destruction de notre système parlementaire et la naissance d'un nouveau commerce dans ce pays, car ce sera un commerce, puisqu'il sera fait dans un but de profit, sous le nom de patriotisme; ce commerce sera celui d'un agitation politique constante. Et soyez convaincus, Milords que si ce commerce n'est pas découragé et contenu, vous ne manquerez pas de trouver des personnes pour le faire. Je veux que le pays soit gouverné par la Couronne et le Parlement. (Lord Brougham 22 Janvier 1846, pages 38 et 39 du Hansard.)\n\n**Lord Montague.**—Il n'y a pas un principe mieux établi que toute personne prêtant au Trésor ou à la Couronne de l'argent sans la sanction parlementaire, commet un délit contre l'État.\n\nDans la charte de la Banque d'Angleterre, une clause lui défend toute transaction de ce genre avec le gouvernement. (Lord Montague, 22 Avril 1861, p. 887 Hansard, vol. 162.)\n\nIl est bon que ceux qui prétendent au gouvernement de Québec sachent qu'ils commettent un délit et qu'ils sont exposés à perdre leur argent.\nV.—LE LIEUTENANT-GOUVERNEUR PEUT-IL CONSTITUTIONNELLEMENT ACCORDER LA DISSOLUTION DES CHAMBRES?\n\nLes libéraux, acculés au pied du mur, commencent à répandre le bruit qu'ils vont demander la dissolution des chambres. Certes, nous ne redoutons pas les élections générales; mais nous voulons qu'elles se fassent d'une manière constitutionnelle. Nous voulons que l'on constate, d'abord, si les libéraux peuvent faire dissoudre les chambres; puis, si c'est nécessaire.\n\nIl y a plusieurs choses que la constitution défend au gouvernement Joly, depuis qu'il a fait ajourner l'Assemblée Législative. D'abord, il est douteux qu'il soit capable de convoquer la Chambre plus tôt, pas même par proclamation du Lt.-Gouverneur. Voici la loi constitutionnelle à ce sujet:\n\nCet ajournement eut été contre l'usage; parcequ'il le parlement avait été ajourné au 4 avril, il aurait été au delà des pouvoirs du Roi de le rappeler plus tôt. La tentative de le faire eut été illégale. (Hatsell's Precedents of the House of Commons, vol. II, page 321.)\n\nL'on a été obligé de passer une loi spéciale en Angleterre en 1800 (40 George III, chap. 14) pour donner au souverain le pouvoir d'abroger par proclamation les délais d'un ajournement du parlement; mais c'est une question de savoir si cette loi peut s'appliquer ici.\n\nDans tous les cas, la pratique constitutionnelle pour la dissolution des chambres pendant l'ajournement est claire. Lisez Hatsell:\n\nDans tous les exemples de dissolution se fai sous les yeux, le Parlement sit-\n\ngeait actuellement ou était prorogé. Je ne connais pas une seule dissolution du Parlement pendant que l'une ou les deux chambres étaient ajournées. (Hatsell's Precedents, vol. II, page 382.)\n\nEn poussant à l'extrême cette prérogative royale, pour un cas de grande urgence, il n'y a pas de doute qu'elle devrait avoir son effet; mais il faudrait, au moins, une circonstance extraordinaire pour la justifier; et comme il n'y a qu'un exemple de ce procédé dans toute l'histoire de l'Angleterre, celui donné par le fameux Cromwell, nous pensons bien que le Lt.-Gouverneur de Québec ne voudrait pas se décerner la disgrâce de créer le second précédent de ce genre, en compagnie d'un tel personnage.\n\nDu reste, une dissolution dans les circonstances actuelles anéantirait complètement les travaux de la session. Malgré les instances de l'opposition, le gouvernement n'a pas voulu faire sanctionner les bills passés dans les deux chambres. Or il n'existe aucun moyen pour le Lt.-Gouverneur de les sanctionner pendant l'ajournement de l'Assemblée Législative. Voici la loi à ce sujet:\n\nQu'il plaise à Votre Altesse qu'il soit déclaré, par l'autorité du présent Parlement, que la loi du royaume est et a toujours été que l'assentiment et le consentement du roi de ce royaume, à aucun acte du Parlement, devrait être donné en sa présence seulement, lui étant présent dans la plus haute chambre du Parlement ou par lettres patentes sous son grand sceau reconnues et ratifiées en son absence aux Lords Spirituels et Temporels et aux Communes réunis dans la Chambre Haute, selon le statut fait dans la 34ème année du\nrègne de Henri VIII (Déclaration de la Chambre des Lords de 1553, entrée dans le journal, et préambule de la loi passée à ce sujet.)\n\nVoici ce que dit la grande autorité parlementaire Sir Edward Coke :\n\nQuand les bills ont été votés par les deux chambres, le consentement royal du Souverain ne peut être donné autrement que par commission ou en personne en présence des deux chambres (1er juin 1621.)\n\nTous les auteurs constitutionnels déclarent que les bills doivent être sanctionnés en présence des deux chambres. Il serait donc absurde d'avoir une dissolution qui détruit deux mois de session.\n\nMais il y a d'autres considérations qui militent fortement contre la démarche que ferait le gouvernement du jour.\n\nLorsque le gouvernement Joly viendra dire au Gouverneur : \"Il nous faut des élections,\" ce sera l'aveu qu'il est à bout de moyens et qu'il ne peut rétablir l'harmonie entre les deux chambres de la Législature.\n\nLe droit et le devoir du Lt-Gouverneur c'est de leur répondre immédiatement : \"Etes vous sur de régler la difficulté de cette manière ? N'existe-t-il pas d'autres moyens de ramener l'entente?\"\n\nSupposez, en effet, des élections générales ; supposez que l'immense majorité du pays se range du côté de M. Joly. Cela vous donnerait-il les subsides ? En aucune manière, si le Conseil persiste dans son refus. Et pourquoi ne persisterait-il pas comme le Conseil législatif de Victoria, à qui les élections générales ne font rien et qui a maintenu sa première attitude, à la suite d'appels au peuple réitérés ?\n\nCe n'est donc pas un moyen infréquent que celui suggéré par le gouvernement Joly.\n\nMais il y a un autre moyen. Son Honneur le Lieutenant-Gouverneur, usant du droit qu'il a de se mettre en relations constitutionnelles avec ceux qui ont refusé les subsides, n'a qu'à dire à quelqu'un du Conseil Législatif \"Etes vous capable de mettre les deux Chambres d'accord.\" \"Certainement oui, lui dira cet honorable Conseiller, si vous nous autorisez à vous fournir d'autres aviseurs qui auront la confiance des deux chambres.\" Il est certain que le choix d'un autre gouvernement qui sera soutenu par les deux chambres est chose facile. Il est juste que le Lt-Gouverneur donne au gouvernement Joly tout le temps raisonnable pour arriver lui-même à ce résultat : mais il serait injuste pour le pays qu'on le soumette au trouble d'élections générales dans le seul but de tenir M. Joly au pouvoir, lorsqu'il y a une manière si simple de rétablir l'harmonie.\n\nCette manière d'agir est justifiée par un précédent en Canada. En 1858, le ministère Brown-Dorion éprouva un refus de dissolution des chambres et voici l'analyse des raisons que donna Sir Edmund Head, Gouverneur-Général du Canada :\n\nToronto, 4 Août 1858.\n\nSon Excellence le Gouverneur Général a reçu l'opinion du Conseil Exécutive sur la dissolution du Parlement.\n\nSans aucun doute, le Gouverneur Général doit agir avec justice et impartialité envers tous les partis politiques réunis, il a aussi des devoirs à remplir envers la Reine et envers le peuple du Bas-Canada, devoir beaucoup plus grands que ceux qu'il doit à n'importe quel parti.\nIl s'agit pour Son Excellence, non pas de décider ce qui peut être juste ou avantageux pour un parti; mais d'examiner avant tout où se trouve l'avantage ou la justice pour la Province.\n\nIl n'appartient nullement au Gouverneur Général de décider si la conduite des chambres, lundi soir, est ou non en désaccord avec les usages du Parlement envers une nouvelle administration. Les deux chambres sont juges de la convenance de leurs procédés.\n\nIl y a plusieurs considérations qui demandent une sérieuse attention par rapport à la dissolution proposée.\n\nSecondement. La dernière élection n'a eu lieu que l'hiver dernier. Ce fait ne prouve rien contre une élection nouvelle; cependant les frais et les embarras qu'elle entraînerait sont trop grands pour qu'ils ne soient accrus de nouveau sans motifs péremptoires.\n\nTroisièmement. Les affaires devant le Parlement ne sont pas encore expédiées. Il est peut-être vrai que peu des choses essentielles restent à faire; néanmoins une partie des estimés et deux bills d'une importance majeure sont encore devant la chambre d'Assemblée sans compter les affaires privées.\n\nIl est du devoir de Son Excellence d'épuiser tous les moyens possibles avant de soumettre la Province une seconde fois dans la même année aux frais, aux embarras et à la démoralisation d'une élection générale.\n\nLe Gouverneur Général n'est nullement persuadé que tout moyen est refusé ou qu'il lui est impossible de former un ministère qui acheverait les affaires de la session et administrait durant la vacance avec la confiance de la majorité de la Chambre d'Assemblée.\n\nAprès pleine et mure délibération sur les ajournements qui lui ont été proposés, de vive voix ou par écrit, et avec tout le respect pour l'opinion du Conseil, Son Excellence refuse de dissoudre le Parlement pour le moment.\n\nEDMUND HEAD.\n\nA la réception de ce mémoire, le Conseil Législatif, du temps, a adressé des remerciements au Gouverneur.\n\nLes raisons alléguées pour le refus, sont exactement les mêmes qu'aujourd'hui.\n\n10. La législation n'est pas complète.\n\n20. Nous venons d'avoir des élections générales.\n\n30. Il n'est pas démontré qu'on ne peut pas trouver un autre gouvernement capable de régler la difficulté.\n\nIl y a une quatrième raison dans les circonstances actuelles.\n\n\"Les affaires du pays conduites illégalement depuis le 1er Juillet parce qu'il n'y a pas de subsides de votés et il faut, coute que coute, faire cesser immédiatement ce pénible état de choses.\"\n\nDu reste, tout cela est conforme aux autorités constitutionnelles que nous laissons parler.\n\nVoici ce que dit le comte Grey :\n\nDans une dissolution, le souverain ne doit pas être un instrument passif entre les mains de ses ministres; ce n'est pas seulement son droit, mais son devoir, d'exercer son jugement sur l'avis qui lui est donné. Et quoiqu'en refusant cet avis, il encourre une responsabilité sévère, s'il finit par être supporté par l'opinion publique, il n'y a pas un cas où cette responsabilité puisse être exercée avec plus de sécurité.\n\nQuand il n'y a pas de probabilité que le vote soit renversé par la nation ou que ce serait injurieux aux intérêts publics, il est clair que dans ce cas le souverain doit refuser la dissolution. (Grey Parl. Gov, p. 80.)\n\nLord Grey s'exprime ailleurs comme suit :\n\nDans les cas extrêmes, le pouvoir de la Couronne de refuser son consentement à ce qui est proposé par ses serviteurs, peut être employé pour le plus grand avantage de la nation ....... Si ce pouvoir suprême est exercé avec sagesse et tenu en réserve pour les grandes occasions, la Couronne peut, en général, compter sur le support de la motion en refusant de sanctionner des mesures que ses ministres pressaient\nSir Robert Peel dit encore :\n\nLes mesures essentielles étant devenues lois, je ne pense pas que nous serions justifiables, pour des considérations secondaires, dans un simple intérêt de gouvernement ou de parti, de demander la dissolution des chambres. Je suis fortement convaincu qu'aucune administration ne doit demander l'exercice de cette prérogative que si elle a de grandes raisons de croire que ces élections lui donneront les moyens d'administrer les affaires du pays avec un parti capable de faire passer ses mesures. Je ne pense pas qu'une dissolution soit justifiable dans le seul but de donner de la force à un parti. Le pouvoir de dissolution est un grand instrument entre les mains de la Couronne ; mais on l'émoindrissait en l'employant sans nécessité. (Sir Robert Peel, 29 juin 1846, page 1043, Hansard Vol. 87.)\n\nCe grand homme d'État, quoiqu'intéressé à demander la dissolution des Chambres, lors de la formation de son cabinet, écrivait dans ses mémoires :\n\nJe me rappelais sans cesse la remarque de lord Clarendon au commencement de son Histoire de la Révolution sur les mauvais effets de l'exercice intempestif de ce droit de la prérogative royale : \"Nul homme,\" dit-il, \"ne peut me montrer la source d'où ces eaux amères que nous goutons à présent ont plus probablement coulé, que ces dissolutions déraisonnables et précipitées du Parlement,\" et plus loin, \"la passion et le désordre qui troublent le Parlement ne peuvent pas être apaisés ni bannis par une dissolution qui est une mesure plus passionnée encore.\" On pouvait rappeler aussi que M. Pitt n'avait pas immédiatement dissous le Parlement à son arrivée au ministère en 1783.\n\nLa force relative des partis en ce moment était aussi une importante considération. Le nombre de ceux qui marchaient avec moi en opposition au précédent cabinet ne pouvait monter qu'à environ 150. Il semblait peu probable qu'il pût s'opérer une conversion assez soudaine et assez considérable parmi les adhérents de ce ministère, pour permettre à leurs successeurs de réunir une majorité suffisante dans la Chambre des Communes telle qu'elle était composée alors. Il y avait donc toute probabilité que l'épreuve n'aurait pas eu un heureux terme.\n\nM. Peel, en effet, ne pouvait pas être favorable à une dissolution de la Chambre des Communes, même si elle était une majorité de la Chambre des Lords. (Sir Robert Peel, vol. II, p. 408.)\n\nOn lit dans Todd :\n\nUn garantie précieuse contre l'exercice déplacé de cette prérogative de la dissolution, c'est que le souverain doit pleinement l'approuver. [Todd, vol. II, p. 408.]\n\nTodd, dans un autre endroit de son ouvrage, en parlant des plaintes faites par les chambres ou par différents membres contre le gouvernement, dit :\n\nEn général, le souverain doit recevoir ces communications sans commentaires, se contentant d'exprimer son opinion personnelle à ses ministres. Mais dans les cas extrêmes, quand il peut être jugé bon qu'il s'efforce de réconcilier des opinions divergentes et de rapprocher des partis rivaux, nous sommes justifiés par les précédents constitutionnels de réclamer pour le souverain le droit d'intervenir et avec le poids qui appartient à sa haute position de donner des avis aux hommes d'état influents quelque soient leurs relations vis-à-vis l'administration. Mais cela seulement comme dernière ressource pour rétablir l'harmonie dans le corps politique. Cette intervention n'est jamais permise pour créer un antagonisme entre les deux chambres, tel que le fit Georges III en cabalant, en 1783, la Chambre des Lords, en dissolvant le Parlement, etc. [Todd, volume II, p. 203.]\n\nSir Robert Peel s'exprime ainsi :\n\nLa dissolution est un mauvais usage de la prérogative, quand il n'y a pas de grave question politique en jeu et qu'il ne s'agit seulement que de retenir certains hommes au pouvoir. [Sir Robert Peel, Hansard Vol. 87, p. 1044.]\n\nTodd ajoute à ce propos :\n\nC'est sur ce point que la dissolution de 1834 a été blâmée. Elle n'eut lieu que pour renforcer le ministère, sans égard à aucune question politique d'importance. Il est admis que cette dissolution était un taux pas et un précédent qui prête à objection. (Todd volume II p. 406. May, Hist. Cont. vol. I, p. 126.)\nheureuse issue, et que le ministère commencerait sa carrière sous les auspices défavorables d'un vote hostile dans la chambre des Communes probablement émis par une majorité très considérable. (Mémoire de Sir Robert Peel, version française, 2e vol., pages 49-51.)\n\nJe pense que nul ministère ne doit conseiller au souverain de dissoudre le Parlement, sans une conviction morale que la dissolution le mettra à même de continuer à diriger le gouvernement du pays et lui donnera dans le Parlement une majorité décidée de partisans actifs. La perspective d'obtenir une minorité plus forte ne peut justifier une dissolution.\n\nLes dissolutions qui n'aboutissent pas sont, en général, nuisibles à l'autorité de la Couronne. Succédant rapidement l'une à l'autre, elles diminuent l'efficacité d'un puissant instrument donné à la Couronne pour sa défense.\n\nLa dissolution faite par les whigs en 1841 était, selon moi, un acte injustifiable. La dissolution actuelle le serait également, si le résultat devait vraisemblablement être le même.\n\nPour quel motif en appellerons-nous au pays ? Certainement pas pour le simple intérêt personnel de savoir si nous avons ou non raison de proposer le bill des grains. Un principe quelconque doit déterminer cet appel.—Idem page 286.\n\nVoici Hearn :\n\nQuand il n'y a pas de question politique en cause, mais que le but d'une dissolution est seulement l'avantage d'un parti, il n'y a pas de cause de dissolution. Aucun ministre ne devrait conseiller une dissolution s'il n'a pas une perspective raisonnable d'obtenir une majorité. (Hearn, page 156.)\n\nLe dernier de ces événements (le dissolution de 1856) est un exemple frappant de la violation des principes qui régissent l'exercice de cette prérogative. La cause immédiate de la dissolution était un vote de la chambre des Communes adverse au bill de réforme de Lord Derby. Rien dans le pays ne rendait essentielle dans ce temps l'application de cette mesure. Il n'y avait pas d'agitation dangereuse comme en 1832. Le parlement n'avait que deux ans d'existence et rien n'indiquait que la Chambre des Communes ne reflétait pas bien le sentiment de la nation. Les ministres déclaraient qu'ils auraient à peu près 300 partisans dans le nouveau parlement. Ils ne pouvaient donc avoir une forte conviction morale de pouvoir acquérir une majorité suffisante pour faire fonctionner le nouveau gouvernement. Du reste, au temps de la dissolution, l'état des affaires publiques était alarmant. Il faut donc regarder cette dissolution comme une mesure de parti et elle tomba sous le coup des censures exprimées par Sir Robert Peel, (page 159.)\n\nVoici l'opinion de Gladstone :\n\n\"L'honorable monsieur parle d'une dissolution comme si c'était une pratique de tous les jours. Quels sont les exemples de ces dissolutions. Le cas de 1841 est un précédent douteux................. Je demanderais à l'honorable monsieur de me montrer, par l'histoire de ce pays et par les précédents constitutionnels, où l'on trouve qu'une administration, comme l'administration du jour, doit poser la dissolution des chambres comme la condition préalable de sa résignation. (Hansard, vol. 191, p. 1711.)\n\n\"Je ne soutiens pas la doctrine que tout ministère a le droit d'en appeler au peuple avant de résigner ; au contraire, je dénie cette doctrine. Il n'y a que deux cas où un gouvernement peut demander la dissolution des chambres, 1o S'il y a une grande question politique au jeu ; 2o S'il y a une perspective raisonnable d'espérer que le vote des Communes sera renversé.......\n\nMais il n'y a rien de tel dans ce cas présent........... La seule cause de la présente dissolution est la raison de son existence ministérielle. Je ne crois pas que l'honorable monsieur en donnant cet avis pour ces raisons soit resté dans l'esprit de la constitution. (Hansard, vol. 191, p. 1714.)\n\nLord Derby dit :\n\n\"C'est le devoir du ministère en demandant la sanction de Sa Majesté de donner des raisons satisfaisantes et de prouver que c'est dans l'intérêt public. Si la Reine se convainc qu'elle ne doit pas accepter cet avis, elle est libre de refuser et ses ministres de résigner.\" (Hansard, vol. 130, p. 103.)\n\nUn gouvernement ne doit pas presser le souverain d'accorder la dissolution. Il doit le laisser libre. Voici comment Disraéli a mis cette doctrine en pratique :\nJ'ai représenté à Sa Majesté que l'avis que ses ministres lui donnaient étaient de dissoudre les chambres. Mais, en même temps, avec le concours de mes collègues j'ai exposé à Sa Majesté qu'il y a des occasions importantes où il est bon que le souverain ne soit pas embarrassé par des réclamations personnelles, quelque constitutionnelles, quelque valides, quelqu'utiles qu'elles soient. Si Sa Majesté était d'opinion que la présente difficulté serait mieux réglée ou que les intérêts du pays seraient mieux servis par la retraite du présent gouvernement, nous étions prêts à laisser immédiatement le service de Sa Majesté. (Hansard, vol. 191, p. 1705.)\n\nM. John Bright pense ce qui suit :\n\nL'honorable monsieur nous demande (par cette dissolution) de renverser les vieux usages du Parlement et il n'y a pas un membre qui diffère d'opinion avec moi à ce sujet. Il nous demande cela pour maintenir en office un ministère qui y est arrivé par des moyens qui ne me paraissent pas recommandables.\" (Hansard, vol. 191, p. 1730.)\n\nLord John Russell dit à son tour :\n\nIl y avait alors (en 1841) deux circonstances à considérer ; l'une étant qu'en dissolvant le Parlement, nous encourrions le reproche de Sir Robert Peel en 1846, que s'aurait été employer la prérogative de la Couronne pour maintenir un parti au pouvoir, ce qui n'était pas un exercice légitime de cette prérogative. En second lieu, il aurait fallu dissoudre sans les subsides pour l'armée et la marine ; et cela n'était pas convenable. (15 mars 1852, p. 1070, vol. 119.)\n\nIl dit encore :\n\nLes dissolutions avaient eu lieu sur de grandes questions, le bill des Indes en 1784, le bill de Réforme en 1831, le Libra-charge en 1841. Mais c'est une autre affaire quand la question se réduit à savoir s'il est un certain Premier Ministre ou un certain parti qui sera au pouvoir. Et quand Sir Robert Peel refusa de demander la dissolution des chambres en 1846, il déclara que cette prérogative ne devrait pas être employée dans l'intérêt d'aucun individu à la tête des affaires ou d'aucun parti alors au pouvoir. C'est ainsi, mon opinion et quand je résignai en 1852, je refusai de demander la dissolution des chambres. (28 mai 1858 p. 1076, volume 150.)\n\nNous n'avons pas besoin de pousser plus loin les citations pour établir ce point. Il est bien sûr que le gouvernement n'a aucun fait nouveau à alléguer depuis les dernières élections qu'il a lui-même conduites à son goût. Il ne peut pas même prétexter la question de l'abolition du Conseil Législatif, puisqu'il a abandonné ses idées à ce sujet, et qu'il n'a pas présenté de mesure durant cette session pour l'abolition du Conseil.\nEn second lieu sur de\n\nles Indes en\n\nle Libra-\n\nune autre\n\nil ne devrait\n\nd'aucun\n\nou d'aucun\n\naussi mou\n\nen 1852, je\n\nsolution des\n\nvolume\n\nbesoin de\n\npour\n\nbien sûr\n\nn'a aucun\n\ndepuis les\n\nil a lui\n\nIl ne\n\nla ques-\n\nConseil Lé-\n\ndonné ses\n\nil n'a pas\n\ndurant cette\n\ndu Conseil\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_25142.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 43214, "total-output-tokens": 19874, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2397, 3], [2397, 3563, 4], [3563, 4010, 5], [4010, 4036, 6], [4036, 6115, 7], [6115, 9659, 8], [9659, 13317, 9], [13317, 16731, 10], [16731, 20956, 11], [20956, 24644, 12], [24644, 28075, 13], [28075, 31889, 14], [31889, 33431, 15], [33431, 37027, 16], [37027, 40043, 17], [40043, 42759, 18], [42759, 46263, 19], [46263, 47993, 20], [47993, 51106, 21], [51106, 54222, 22], [54222, 57910, 23], [57910, 62116, 24], [62116, 66419, 25], [66419, 69059, 26], [69059, 69338, 27], [69338, 69338, 28]], "primary_language": ["None", "en", "en", "en", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]