[{"id": "fb76812a407b78da0227c8db1af552c29ed977da", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 4 | 5 | 6 |\n|---|---|---|\n|   |   |   |\nFURTHER CORRESPONDENCE\n\nWITH THE\n\nGOVERNMENT OF CANADA\n\nIN CONNECTION WITH THE\n\nAPPOINTMENT OF THE JOINT HIGH COMMISSION\n\nAND THE\n\nTREATY OF WASHINGTON.\n\n(IN CONTINUATION OF PAPER PRESENTED APRIL, 1872.)\n\nPresented to both Houses of Parliament by Command of Her Majesty.\n\nMay, 1872.\n\nLONDON:\nPRINTED BY WILLIAM CLOWES & SONS, STAMFORD STREET AND CHARING CROSS,\nFOR HER MAJESTY'S STATIONERY OFFICE.\n\n[C.—546] Price ½d.\n\n1872.\nFURTHER CORRESPONDENCE\n\nWITH THE\n\nGOVERNMENT OF CANADA\n\nIN CONNECTION WITH THE\n\nAPPOINTMENT OF THE JOINT HIGH COMMISSION AND THE TREATY OF WASHINGTON.\n\nThe Lord Lisgar to The Earl of Kimberley.\n\nGovernment House, Ottawa, April 15, 1872.\n\nMy Lord,\n\nWith reference to your Lordship's Despatch, No. 38, of March 18, 1872, I have now the honour to forward, herewith, a copy of a Minute of the Privy Council of the Dominion, from which your Lordship will perceive that the Ministers announce their intention of proposing to the Canadian Parliament the measures necessary to give effect to those clauses of the Treaty of Washington which relate to Canada.\n\nI have, &c.,\n\n(Signed) Lisgar.\n\nThe Earl of Kimberley,\n&c. &c. &c.\n\nEnclosure.\n\nCopy of a Report of a Committee of the Honourable the Privy Council, approved by His Excellency the Governor-General, on the 15th day of April, 1872.\n\nThe Committee of the Privy Council have had under their consideration the Earl of Kimberley's Despatch to your Excellency, dated the 18th ultimo, communicating the views of Her Majesty's Imperial Government on the proposition submitted in the Report of the Privy Council, transmitted in your Excellency's Despatch of 22nd January last.\n\nFrom the Despatch it appears that Her Majesty's Government are of opinion that the most convenient course will be that it should be provided in the Acts to be passed by the Dominion Parliament to give effect to the Treaty, that such Acts should only come into force upon the issue of a Proclamation by the Governor-General in Council bringing them into operation; that on their part Her Majesty's Government will engage that when the Treaty shall have taken effect by the issue of such Proclamation, they will propose to Parliament to guarantee a Canadian Loan of £2,500,000. Such Loan to be applied to the purposes indicated by the Council, namely, the construction of the railroad through British territory from Canada to the Pacific, and the improvement and enlargement of the Canadian canals; and to be raised at the same time and in equal proportions with the Canadian unguaranteed Loan for the same objects, on the understanding that Canada abandon all claims on England on account of the Fenian Raids.\n\nThe Earl of Kimberley further observes that Her Majesty's Government will enable the Canadian Government to assure the Dominion Parliament that any recommendation made by Canada to terminate the Articles of the Treaty numbered 18 to 25 inclusive, and likewise Article 30, in conformity with Article 33, will be acted on; that they have no hesitation in declaring that the greatest deference would be paid to the expression of the wishes of the Dominion, signified by Addresses from both Houses of the Dominion Parliament, and that those wishes would certainly be attended to, subject of course to the necessary reservation of Her Majesty's discretion to take into consideration, in the interests of the whole Empire, the state of Her relations with Foreign Powers at the particular juncture.\n\nThe Committee of the Privy Council feel that although Her Majesty's Government have been unable to accede to their proposition in full, it is nevertheless their duty, in the interests both of Canada and the Empire at large, to accept the modified proposition of the Earl of Kimberley, and they will accordingly be prepared to propose to the Canadian Parliament the measures necessary to give effect to those clauses of the Treaty relative to Canada.\n\n(Certified)\n\nWm. H. Lee,\nClerk, Privy Council, Canada.\n\nLONDON:\n\nPRINTED BY WILLIAM CLOWES AND SONS, STAMFORD STREET AND CHARING CROSS, FOR HER MAJESTY'S STATIONERY OFFICE.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_38280.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 14062, "total-output-tokens": 1867, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1538, 3], [1538, 2796, 4], [2796, 3221, 5], [3221, 3221, 6], [3221, 6867, 7], [6867, 6867, 8]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, true]}}]