[{"id": "ee86e6c429068dd479922664e7d972412db21054", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/Couverture de couleur\n☐ Covers damaged/Couverture endommagée\n☐ Covers restored and/or laminated/Couverture restaurée et/ou pelliculée\n☐ Cover title missing/Le titre de couverture manque\n☐ Coloured maps/Cartes géographiques en couleur\n☐ Coloured ink (i.e. other than blue or black)/Encre de couleur (i.e. autre que bleue ou noire)\n☐ Coloured plates and/or illustrations/Planches et/ou illustrations en couleur\n☐ Bound with other material/Rellé avec d'autres documents\n☐ Tight binding may cause shadows or distortion along interior margin/La reliure serrée peut causer de l'ombre ou de la distortion le long de la marge intérieure\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X ✓ 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n\n4 5 6\nMANITOBA WHEAT.\n\nITS TERRITORIAL AREA AND SUPERIOR QUALITY.\n\nVERDICT OF 100 MILLING FIRMS IN GREAT BRITAIN AND IRELAND.\n\nWINNIPEG:\nPRINTED AT THE OFFICE OF \"The Commercial,\" 4 JAMES ST. EAST.\n1885.\nMANITOBA WHEAT.\n\nITS TERRITORIAL AREA\n\nCompliments of\nJ. H. McTAVISH,\nLAND COMMISSIONER,\nWINNIPEG,\n20th March, '86.\n\nGREAT BRITAIN AND IRELAND.\n\nWINNIPEG:\nPRINTED AT THE OFFICE OF \"THE COMMERCIAL,\" 4 JAMES ST. EAST.\n1885.\nMANITOBA WHEAT.\n\nITS TERRITORIAL AREA\n\nAND\n\nSUPERIOR QUALITY.\n\nVERDICT\n\nOF ONE HUNDRED MILLING FIRMS IN GREAT BRITAIN AND IRELAND.\n\nWINNIPEG:\n\nPRINTED AT THE OFFICE OF \"THE COMMERCIAL,\" 4 JAMES ST. EAST.\n\n1885.\nMANITOBA WHEAT.\n\nITS TERRITORIAL AREA AND SUPERIOR QUALITY.\n\nVERDICT OF ONE HUNDRED MILLING FIRMS IN GREAT BRITAIN AND IRELAND.\n\nDuring the seasons, 1883-84 the Land Department of the Canadian Pacific Railway opened ten Experimental Farms on the division between Winnipeg and the Rocky Mountains—the first, Secretan, being 443 miles, and the tenth or most western, Gleichen, being 785 miles west of Winnipeg. In this distance of 342 miles, the elevations above sea level ranged from 2,284 feet at Secretan, to 2,961 feet at Gleichen, corresponding in situation to a division of the Union Pacific Railroad between Cheyenne or Denver and Great Salt Lake, at altitudes more than double, or exceeding 5,000 feet above the sea. The cultivation of these farms was, in Western phrase, \"on the sod,\" the land having been ploughed in October, 1883, instead of the spring, and without re-ploughing or \"backsetting\" in the autumn, and having been sown in April, 1884. The average results, ascertained by actually chaining the ground under the inspection of a Dominion Land Surveyor and weighing the grain, were as follows, viz.: Wheat, $21\\frac{1}{2}$ bushels per acre; oats, $44\\frac{1}{2}$; barley, $23\\frac{1}{2}$; and peas, $12\\frac{1}{2}$.\n\nThe farm at Dunmore, near the crossing of the South Saskatchewan river, in longitude $110^\\circ 30'$, and latitude $50^\\circ$, may be taken as representative of the series of experiments. Land was broken on the 24th of October, and sown on the 4th and 5th of April. Barley was harvested on the 23rd of July; oats on the 6th of August; and wheat on the 7th of August. Barley required three months and sixteen days to mature; oats, four months and one day; and wheat, four months and two days. Cutting was entirely finished on the 8th of August. Gardening was not commenced till the 23rd\nof May, yet all vegetables, including corn, fully matured. Wheat yielded 20 bushels per acre, with a weight of 63 lbs. per bushel; oats, 38½ bushels, weight, 40½ lbs.; barley, 32½ bushels, weight, 50 lbs.; and peas, 10½ bushels per acre. In connection with these results it should be considered that a large measure of the productive force of the soil was expended upon the reduction of the unrotted sod, it having been difficult to cover the seed, especially of peas, sufficiently for its full germination and growth.\n\nThe variety of wheat produced was Red Fyfe, graded as No. 1 hard, of which a considerable quantity, grown at Dunmore, was sent to The Miller, a weekly publication at London, England, and distributed by the publishers to over a hundred millers in Great Britain and Ireland, whose testimony in connexion with the names of localities and correspondents will be here-repeated in the order of their publication in The Miller of February 2, 1885.\n\nStockton-on-Tees.—R. H. Appleton.—\"A most valuable wheat for milling. I should be glad to get a large line of this wheat on reasonable terms. For gradual reduction milling it will work up splendidly giving a large percentage of well-shaped semiolin and middlings.\"\n\nCroydon.—Ashby, Son & Allen.—\"It recommends itself as of great value from a millers' or bakers' point of view in all points, a type of the perfect, for what it lacks we cannot see.\"\n\nBristol.—W. Baker & Sons.—\"The quality of the wheat is very fine.\"\n\nDublin.—P. Boland.—\"Such wheat would be very valuable for home millers (using rolls) for mixing, as it should give great strength to their flour and good produce in baking.\"\n\nBelfast.—D. & W. Carmichael.—\"More desirable wheat than samples of Hard Fyfe Canadian for the British miller could not be found. It is simply magnificent.\"\n\nDeal.—G. W. Chitty.—\"If the wheat was not quite so hard as the sample, I should like it better, but millers vary in opinion on such matters.\"\nLONDON.—T. & J. Cowan.—\"Of very fine quality, and will do good in any flour. The natural weight must be very great, 66 or 67 lbs. per bushel, if in such condition as sample.\"\n\nNEWCASTLE-ON-TYNE.—John Davidson & Sons.—\"There can be no better quality of wheat used for mixing purposes, both for strength and quality of flour produced—superior even to No. 1 Minnesota wheat of crop of 1877, used by us to our satisfaction, in every respect.\"\n\nDEVON.—R. H. Daw.—\"The quality of the wheat is very fine, and it would prove invaluable to millers in this country, where home-grown wheats frequently come to hand in damp condition in consequence of the humidity of the climate.\"\n\nREADING.—J. Deve.—\"One of the finest samples of wheat I have ever seen for mixing with English. Abundance of strength and plenty of colour.\"\n\nKENT.—T. Downing.—\"Of splendid quality and value for mixing with English wheat; but can we get a regular supply of it? I am afraid the American millers are too 'cute' to allow this quality to come here in any quantity, if they can possibly prevent it.\"\n\nREADING.—Eisdell & Soundry.—\"Finest quality we have seen for a long time. The colour is good; large proportion of gluten of a very fine quality. If such wheat can be put on our markets at a reasonable price it must meet a ready demand at 3s. to 4s. per quarter over the best Indian Red wheats.\"\n\nGREENOCK.—M. Hill.—\"The wheat is beautiful and first-class in quality. No doubt it would do for mixing in some districts, but here I would most certainly grind it alone and it would make flour of the finest quality.\"\n\nLEICESTER.—M. Hitchcock.—\"An extremely valuable wheat for milling, containing both colour and strength, and would, I should say, improve the quality of any flour now being made in this country. It agrees with sample I have received from friends in Manitoba.\"\n\nBOROUGHBRIDGE.—Lothhouse & Hammond.—\"Of magnificent quality, and would be highly valued by English millers. We should be glad to have wheat so clean and of such strength and quality offered to us.\"\nLORNE.—R. Macauley & Son.—“We consider it 3s. per quarter better than No. 1 Duluth for mixing purposes, and 5s. per quarter for special purposes. We find no difficulty in manufacturing a flour to supersede ‘Pillsbury’s Best.’”\n\nGLASGOW.—J. Marshall.—“This variety of wheat from the States we are in the habit of milling alone here without any other mixing beyond what it gets before it reaches our hands. It is seldom or never that we see a lot of wheat in bulk as fine as your sample. Could we get such quality regularly we should have no fear of any American competition in the point of quality of flour.”\n\nCOLCHESTER.—E. Marriage & Son.—“Quality magnificent, and best wheat we have seen for roller mills.”\n\nBIRMINGHAM.—J. H. Pakes.—“It is a grand sample for mixing in a blend for best flours. It is just what we want, and what we cannot buy. The value and quality of Manitoba wheat, of this grade in particular, lies in the fact that it is grown on almost virgin soil. Makers of best flour are, or should be, anxious as far as they can, to get their supplies of wheat that they depend on for strength from those parts of the Northwest of America where wheat is a new crop to the land. No. 1 Duluth is not in any way fit to compare with the sample sent, especially not in its working qualities.”\n\nNEWPORT, MONMOUTHSHIRE.—H. J. Parnell.—“If such wheat as the hard fyfe grown in the Northwest of Canada were sent to us in quantity it would be invaluable for milling purposes. I am glad to see the imports of flour declining, and I hope the day is not distant when, by the conversion of all our mills to the newest systems, we shall, as a whole, produce an article that cannot be excelled.”\n\nNORTHAM, SOUTHAMPTON—J. Appleford.—“I used this class of wheat some years ago and found it a great improvement to the flour.”\n\nUTTOXETER.—Wm. Vernon.—“I have examined the samples of No. 1 hard fyfe red wheat from Canada, sent by you, and find it a very strong, dry wheat, full of gluten, and it appears an excellent substitute for certain kinds of Russian wheat now used for mixing purposes, particularly with soft English, and some sorts of Indian wheat. In gradual reduc-\ntion mills it will be valuable, making a large percentage of semiolin and middlings. The yield in a small baking trial is good, being $1\\frac{1}{2}$ lbs. of bread to 1 lb. of flour, and very light and elastic in texture.\"\n\n**ABERDEEN.—John F. White.**—\"Certainly as beautiful wheat as ever I saw, and particularly well adapted for millers in this country. Surely some agency can be devised for getting more easy access to these hard wheats which are never seen in commerce in purity.\"\n\n**SHEFFIELD.—Joseph Wigfall & Sons.**—\"Your samples of the Canadian wheat to hand, and if the English miller could only get a good supply of such wheat at a moderate price, fine Hungarian flour would stand little chance in this country.\"\n\nOf a similar tenor was the testimony of an equal number of correspondents, whose assent to the publication of their communications had been obtained, whilst a few, although expressing their full concurrence, desired their acknowledgments to be regarded as confidential.\n\nIn repeating testimony so decisive and general the Land Commissioner of the C.P.R. Co. desires to add a few explanations and suggestions.\n\n1. A prominent object of the establishment of the experimental farms was to demonstrate that the arid district of the United States in which irrigation is necessary to agriculture is limited on the north by latitude 49°, or the Coteau du Missouri, in consequence of the reduced altitude of the Saskatchewan districts, their invigorating climate, and the transit of the moist west winds of the Pacific Ocean through the river valleys and reduced elevations of British Columbia to the districts of Alberta and Assiniboia.\n\n2. The physical law that plants attain their greatest production near the most northern limit of their successful growth, has no better demonstration than the cultivation of wheat. Most of the Atlantic and Mississippi States produce winter wheat, which may be classified as a soft wheat, and, as such, commands according to latitude, from 10 to 15 cents per bushel less than the hard or flinty spring wheat, only grown successfully on this continent in the Mississippi valley north\nof latitude 45°, the parallel of St. Paul, or on the prairies of Nebraska. The State of Iowa and the southern districts of Wisconsin and Minnesota have ceased to produce No. 1 hard spring wheat (successful only in resisting mildew or rust in July and August during the subjugation of the virgin soil) and have substituted corn or maize as the leading crop for wheat. They have passed from the wheat to the corn belt.\n\n3. Besides the superior quality of spring wheat grown in high northern situations, a marked increase in quantity is observed in the Red River Valley, and districts northwest of the Height of Land which separates the waters flowing into the Gulf of Mexico from those tributary to Hudson's Bay. In southern Minnesota a maximum production is two well formed grains in each cluster or fascicle forming the ear. In Manitoba, with similar cultivation, the rule is three grains, and on the banks of the Saskatchewan and Peace Rivers, there have been growths of four or five grains in each fascicle. To an increased value of the product in quality, fully one-sixth, must therefore be added one-third for additional production.\n\n4. Except the \"black lands\" of southern Russia and the eastern slope of the Carpathian mountains, adjacent to Austria and Hungary, and the northern districts of Minnesota and Dakota, there is no district in the world which produces wheat of the quality of No. 1 Manitoba hard, as grown in Central Canada, including in that geographical term the present Province of Manitoba and the Territories reaching west and northwest to the Rocky Mountains—future Canadian provinces of Assiniboia, Alberta, Saskatchewan and Athabasca. To this immense area of 500,000 square miles, equal to Great Britain and Ireland, Norway, Denmark, Holland, Belgium and France, the Canadian Pacific Railway constitutes a base line, resting on which the highest development of cereal and animal production is assured by all experience and analogy in the heart of the North American continent.\n\n5. In further illustration of the northern and westward progress of wheat cultivation in North America, a few statistics of the production and commercial movement of the wheat crop of the United States, as tabulated by the Department of Agriculture at Washington and specialists of the American\nPress, are submitted. By the census of 1880, the population of the United States was 50,155,783, and the increase to the close of 1884 is estimated at 6,750,000, a total of 56,905,783. The consumption per head of Great Britain and Ireland, according to the calculations of experts, is equal to $5\\frac{3}{4}$ bushels of wheat per annum; but in the United States, on account of the large consumption of corn or maize, the quantity used for bread is supposed to be $4\\frac{1}{2}$ bushels per head which, with a population of 56,905,783, will give an aggregate consumption for food of 246,591,726 bushels. Add for seed two bushels per acre upon the area sown to wheat in 1884, viz., 39,475,855 acres (not likely to be exceeded in 1885) and a further allowance of 78,951,710 bushels must be made. The amount required for food and seed is therefore 325,543,436 bushels, which, deducted from the production of 1884, namely, 512,763,900 bushels, leaves a surplus for exportation of 187,220,464 bushels. This surplus is more than supplied by the spring wheat States of the Upper Mississippi, and the winter wheat States of the Pacific coast, as will appear from the following tables:\n\n### SPRING WHEAT STATES.\n\n| States     | Acres    | Bushels   | Per Acre |\n|------------|----------|-----------|----------|\n| Minnesota  | 2,753,816| 41,307,000| 15$\\frac{3}{4}$ |\n| Dakota     | 1,540,000| 22,330,000| 15       |\n| Iowa       | 2,605,771| 31,270,000| 12       |\n| Nebraska   | 1,950,280| 28,325,000| 15       |\n| Wisconsin  | 1,434,510| 20,083,000| 14       |\n| Other States| 559,000  | 7,837,000 | 14       |\n\nTotal: 10,843,377 151,162,000\n\n### PACIFIC STATES.\n\n| States     | Acres    | Bushels   | Per Acre |\n|------------|----------|-----------|----------|\n| California | 4,545,290| 44,320,000| 9        |\n| Oregon     | 858,924  | 15,462,000| 18       |\n| Washington | 326,366  | 4,118,000 | 14       |\n\nTotal: 5,730,580 63,900,000\n\nThe average per acre of the winter wheat states, except on the Pacific coast, is 12 bushels; of the spring wheat states 14, and of California, Oregon and Washington, 14. The wheat districts of British Columbia, mostly adjacent to the\nline of the Canadian Pacific Railway, will doubtless attain and may exceed, the average of Oregon and Washington, or 16 bushels per acre.\n\nA New York journal (Railroad Gazette of Feb. 13) emphasizing the facts that Kansas, Nebraska and Dakota have increased their wheat product from 21,000,000 in 1875 to 85,000,000 in 1884, and that the increase in California, Oregon and Washington in the same period has been from 30,000,000 to 63,000,000, adds that those districts have a fifth more wheat than in 1883, two-fifths more than in 1882, and more than twice as much as in 1881. On the other hand, the leading wheat states further east, Minnesota, Iowa, Wisconsin, Illinois, Indiana, Michigan and Ohio, which even last year produced a fifth more than in 1883, had 9 per cent. less than in 1882, 18 per cent. less than in 1880, and 13 per cent. less than in 1879.\n\n6. The relations of Great Britain to the supply of bread have great significance in considering the future of Northwest British America. The demand of Great Britain and Ireland for foreign wheats during the year 1884, as compiled by a correspondent of the London Miller, is shown by the following table, which includes the importation of wheat and wheat flour, expressed in bushels, as follows:\n\n| Country          | Importation (bushels) |\n|------------------|-----------------------|\n| United States    | 76,833,720            |\n| Russia           | 24,814,272            |\n| India            | 20,987,864            |\n| Germany          | 10,181,296            |\n| Australia        | 5,014,344             |\n| Canada           | 4,580,016             |\n| Chili            | 4,312,240             |\n| Egypt            | 2,192,200             |\n| Turkey           | 2,105,736             |\n| Romania          | 754,016               |\n| France           | 427,472               |\n| Countries unspecified | 8,187,480         |\n\n160,340,656\n\nRussia, formerly called \"the granary of Europe,\" is falling in the rear of countries less favorably situated for the supply of the English market, on account of political distrac-\ntions, the inadequacy and mismanagement of railway transportation and neglect in cleansing, grading and sheltering the grain. The Russian production of wheat in 1883 was 101,101,830 bushels; in 1870 it was 225,849,000 bushels. With the demand of a large and increasing population, Russia is not likely to hold much longer the second position in the exportation of grain to Great Britain. Nor is there a probability that India will exceed her present exportation. A select committee of the British House of Commons, in a report dated 18th of July, 1884, treats a proposed extension of railways and the wheat crop of India, principally as agencies for connecting the centers of food production with the centers of population, and relieving districts exposed to famine; the extent and economy of grain raising, as in the western territories of the United States between longitudes 102° and 120°, are greatly restricted by the necessity of irrigation; the average cost of transportation from the principal wheat areas to seaports is 20 cents per bushel, and from the seaboard to London 27 cents per bushel; and the inferiority of the wheat is shown by the prices in the London market of four varieties of Indian wheat, namely, 48 5-10s. to 38 5-10s. per quarter, as compared with 54 5-7s. to 46 1-5s. for four American samples from Milwaukee.\n\n7. It will thus be seen, with the completion of the Canadian Pacific Railway, that Western Canada will advance upon the English grain market under favorable auspices. It was only in 1882 that Manitoba produced a surplus of wheat. Minnesota reached that point in eleven years from the organization of the territory in 1848, corresponding nearly to the same interval in Manitoba, 1870 to 1882. The wheat crop of 1884 in Manitoba and the Northwest Territory of Canada may be estimated at five million bushels, of which from three to four millions are available for exportation. The total exportation to Great Britain from Canada was 4,530,016 bushels in 1884, of which 1,173,648 were in the form of flour. The eastern provinces of Canada, like most of the American states, are substituting dairy or fruit husbandry, and the production of wheat east of Lake Superior will soon be exceeded by the local consumption\nof the population; a point already reached in nine-tenths of the area of wheat production in the United States. Thus will soon be transferred to Manitoba and other western provinces, the entire trans-Atlantic exportation of breadstuffs from the Dominion. The areas of Western Canada assigned by events to the highest production in quality and quantity of the chief staple of human food, have already been indicated, but may further be defined in the language of a publication compiled under the auspices of the Smithsonian Institution at Washington. \"A line,\" to repeat the language of the Climatology of the United States, edited by Mr. Loren Blodgett, \"drawn from Thunder Bay in Lake Superior, northward to the Mackenzie River at the 60th parallel, and from that point southwest to the Pacific coast to the 55th, would include an immense region adapted to the production of wheat, with only the local exception of mountains and worthless soils.\" Another American authority, Commissioner Wheelock, of the Minnesota Bureau of Statistics, computes the acreage available north of the 49th parallel as 200,000,000 acres, which he characterises as \"the seat of the greatest average wheat production on this continent, and probably in the world.\"\n\n8. The rank accorded to Manitoba in the first year of a surplus, commanding the attention of the commercial world, has been very satisfactory. A letter from Fargo, Dakota, dated February 28th, and published in the St. Paul Pioneer Press, states that the ruling price for wheat for the preceding three months had been \"between 66 and 60 cents for No. 1 hard with a downward tendency.\" The range of prices paid for the same quality of grain during the same period at Winnipeg, with no greater facilities of transportation to Atlantic or English markets than at Fargo, was from 75 to 70 cents per bushel, with 3½ cents additional when shipped by the seller directly to Thunder Bay on Lake Superior. For the wheat trade, now converging to Duluth and Port Arthur, there are two kinds of hard, three of Northern and two of Regular, and during January, 1885, the highest and lowest prices paid at Winnipeg, by Montreal purchasers, were as follows:\nNo. 1 Hard ........................................... 75 to 70 cents.\nNo. 2 \" .................................................. 70 to 65 \"\nNo. 1 Northern ......................................... 70 to 65 \"\nNo. 2 \" .................................................. 65 to 60 \"\nNo. 1 Regular ............................................ 62 to 58 \"\nNo. 2 \" .................................................. 57 to 52 \"\nNo. 3 \" .................................................. 52 to 47 \"\n\nThese prices were uniformly paid throughout the Winnipeg section of the Canadian Pacific Railway, extending to the Brandon district, 133 miles west, and its branches southward to the International boundary, with a reduction of 2 cents per bushel on the Brandon section, extending to Elkhorn station, 200 miles west of Winnipeg. This Manitoba schedule of prices, through all its grades, has been sustained at 10 cents per bushel above sales in Minnesota and Dakota, 200 miles to the south of us.\n\n9. It cannot be too forcibly urged upon the farmers of Manitoba and other districts of Central Canada, that the possession of these great natural advantages for grain raising and of this advanced position in the wheat market of the world demands, for their fullest utilization, the most careful cultivation, and foremost in the requisites of great and permanent success is the selection of seed. Red fyfe outranks all other varieties for the production of Manitoba hard. Frequent exchanges of seed to retain the flinty texture and strength essential to the best manufacture of flour should be organized, and will doubtless be facilitated by the discussions and correspondence of farmers' clubs. The quality of the grain assured, the producer may count with confidence upon every facility which the Canadian Pacific Railway, with its line supplemented by ocean and lake steamers, can afford for the cheap, rapid and secure transportation of wheat and its flour to the consumer. Rates of 25 cents per bushel from Winnipeg to Montreal, and of 10 cents by Atlantic transportation from tide-water to Liverpool, are already fixed, to be changed only in the direction of further reduction.\n\n10. In the foregoing observations prominence has been given to the climatic conditions which give to the northern interior of this continent such a remarkable precedence in the production of wheat, but the theory that the best production\nof plants is at the most northern limit of their growth is of very wide application. It is not in southern or semi-tropical latitudes that oats, barley, the potato and other culinary vegetables, and the fruits of the temperate zone, attain their highest excellence; and there is now a general testimony from those engaged in the production of animals, that the valleys of the Upper Missouri and the Saskatchewan, including the foot hills of the Rocky Mountains, by the nutritious qualities of their grasses and the health-giving influences of a cool and unmalarius climate, afford the most favorable conditions for the best development of horses, cattle and sheep. Wheat will be the pioneer of cultivation, but the indications are already numerous and significant that nowhere in the world does nature invite to a more varied and successful agriculture than in the valleys converging to Lake Winnipeg and upon the plateaux of British Columbia.\nis of\ntropical\nvegeta-\ntheir\nfrom\nalleys\nthe\nties of\nand\nfor\nwill\nalready\ndoes\nmore than\non the\n25,060,000 ACRES!\n\nCANADIAN PACIFIC RAILWAY CO.\n\nLAND DEPARTMENT.\n\nOffice in New Station Building,\nWINNIPEG.\n\nTwenty-Five Million Acres of SELECTED Wheat, Meadow and Grazing Lands\n\nThe Company offer their lands for sale within the forty-eight mile belt along the Main Line.\n\nWith or Without Cultivation Conditions.\n\nAt the option of the purchaser. Prices range from $2 per acre upwards, with conditions requiring cultivation, and without cultivation or settlement, at liberal figures, based on close personal inspection by the Company's Land Examiners.\n\nWhen the sale is made subject to cultivation, A REBATE of one-half of the purchase money will be allowed on the quantity cultivated, and will be applied on the next payment falling due.\n\nTERMS OF PAYMENT:\n\nPayments may be made in full at time of purchase, or in six annual installments. Land Grant Bonds can be had from the Bank of Montreal, or any of its Agencies, and will be accepted at 10 per cent. premium on their par value, and accrued interest.\n\nMaps showing the townships open for free entry under the Government regulations, and homesteads recently taken therein, can be seen at the office of the Company at Winnipeg.\n\nThe Land Department has Agents stationed at the principal towns along the Main Line, who will furnish particulars as to lands for sale in their Districts.\n\nLocal Land Agents are not authorized to receive, or receipt for, any monies on behalf of the Company or to bind the Company by any agreements or acts whatsoever. Parties purchasing can remit by Express from any Express office on the C.P.R. at the Company's expense, to the Land Commissioner at Winnipeg.\n\nFor further particulars, and also for Folders, Sectional Maps, Pamphlets and Guide Books, apply in person or by letter to CHARLES DRINKWATER, Secretary C.P.R. Co., Montreal; to ALEXANDER BEGG, General Immigration Agent of the Company, 88 Cannon Street, London, England; to THOMAS WASTIE, Brandon, Local Agent for the land within the Province of Manitoba; and to the undersigned, to whom all applications as to prices, rebates, and the purchase of land generally should be addressed.\n\nJ. H. McTAVISH,\nLand Commissioner,\nCanadian Pacific Railway Company, WINNIPEG.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30167.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 27, "total-input-tokens": 43624, "total-output-tokens": 8217, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1522, 3], [1522, 2629, 4], [2629, 2827, 5], [2827, 2827, 6], [2827, 3049, 7], [3049, 3049, 8], [3049, 3260, 9], [3260, 3260, 10], [3260, 5081, 11], [5081, 7034, 12], [7034, 9073, 13], [9073, 11238, 14], [11238, 13376, 15], [13376, 15675, 16], [15675, 17840, 17], [17840, 19923, 18], [19923, 22173, 19], [22173, 24357, 20], [24357, 26765, 21], [26765, 27709, 22], [27709, 27805, 23], [27805, 27805, 24], [27805, 27805, 25], [27805, 30012, 26], [30012, 30012, 27]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]