[{"id": "07d1cb4d14ddf3eb1ccd22ba5ecf5e44a45167d5", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n  Couverture de couleur\n\n- [ ] Covers damaged/\n  Couverture endommagée\n\n- [ ] Covers restored and/or laminated/\n  Couverture restaurée et/ou pelliculée\n\n- [ ] Cover title missing/\n  Le titre de couverture manque\n\n- [ ] Coloured maps/\n  Cartes géographiques en couleur\n\n- [ ] Coloured ink (i.e., other than blue or black)/\n  Encre de couleur (i.e., autre que bleue ou noire)\n\n- [ ] Coloured plates and/or illustrations/\n  Planches et/ou illustrations en couleur\n\n- [ ] Bound with other material/\n  Relié avec d'autres documents\n\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n  La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n  Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n- [ ] Additional comments:/ Wrinkled pages may film slightly out of focus.\n  Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol — (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n|   |   |   |\n|---|---|---|\n| 1 | 2 | 3 |\n\n|   |   |   |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole — signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nA VIEW OF THE STATE OF PARTIES IN THE UNITED STATES OF AMERICA;\n\nBEING AN ATTEMPT TO ACCOUNT FOR THE PRESENT ASCENDANCY OF THE ANTI-ENGLISH, OR DEMOCRATIC PARTY, IN THAT COUNTRY;\n\nIN TWO LETTERS TO A FRIEND.\n\nBY A GENTLEMAN WHO HAS RECENTLY VISITED THE UNITED STATES.\n\n\"Party is the madness of many for the gain of a few.\"\n\nTHE SECOND EDITION, WITH ADDITIONS AND CORRECTIONS.\n\nEDINBURGH:\n\nPrinted by James Ballantyne and Co.\n\nFOR JOHN BALLANTYNE AND CO. EDINBURGH;\n\nAND FOR LONGMAN, HURST, REES, ORME, AND BROWN, LONDON.\n\n1812.\nADVERTISEMENT\n\nTO THE SECOND EDITION.\n\nTHE favourable reception given to this Pamphlet has induced the Author to revise and correct it. Some inaccuracies, which the hurry of other avocations had been the cause of his overlooking in the first edition, are corrected in the present; and a few tables and anecdotes are added, which, it is conceived, may not be uninteresting to the public.\nA VIEW, &c.\n\nLETTER I.\n\nMy dear Friend,\n\nSince my return from America, you have made frequent inquiries respecting the present disposition of the American government. You have often remarked, how singular it is, that a people, with whom we are in many ways so closely connected, should testify, on all occasions, so strong an antipathy to their mother country, and so open a partiality to France. These dispositions of the American government no one, I believe, now ventures to call in question. Every act of the British government is\nviewed by America through a distorted medium, and converted, if possible, into a topic of reproach and invective; while on the other hand, the most flagrant acts of injustice on the part of France are either passed over in total silence, or studiously extenuated by those towards whom they are directed. The causes of this Anti-Anglican spirit of the American government lie deeper than is commonly imagined; and, in compliance with your desire, I shall endeavour to lay before you such information on this interesting topic, as a short residence in the United States has enabled me to acquire.\n\nCertain obvious causes of the antipathy of the Americans to England must present themselves to the most superficial observer. The animosities engendered by the revolutionary war, it may be supposed, have not altogether subsided: and the unavoidable inconveniences resulting to the commerce of America, from our naval supremacy, must likewise be, in some measure, a source of disgust and alienation.\nBut surely the Americans have less cause to cherish the animosities of the revolutionary war than we ourselves have: and the naval supremacy of our country, since it protects America in common with Britain, is unquestionably productive of greater advantage than inconvenience to the United States. The origin, therefore, of the French bias, which at present distinguishes the American government, must be sought for in other circumstances. The result of my observation on the state of parties in America was, that this bias proceeded partly from the animosities of the revolutionary war, partly from the jarring views and interests of the different sections of the Union, partly from the prejudices of certain leading statesmen; but chiefly from the excessively democratic nature of the American government, from the universal suffrage and elective magistracy, which are its distinguishing features; and the violent party contentions by which such a government must always be agitated.\n\nIt is the last of these circumstances, the nature of the American government, to which, as\nthe most powerful of the causes we are investigating, I shall first solicit your attention. In order to explain the nature of this singular government, it will be necessary, in the first place, to take a very cursory view of its history, and to notice the change of parties which, in the short space of twenty years, has already taken place in the United States. This short disquisition, while it is essential to the solution of the problem we are considering, may perhaps suggest to you some curious observations on the nature of free governments in general, and more particularly on that of the United States.\n\nIt is well known, that every citizen of the United States lives under two separate governments; namely, the government of his own individual state, and the general government of the union. It is also well known, that the general government of the union was framed by a body of delegates from the several states, who sat at Annapolis, in the year 1789, and of which Generals Washington and Hamilton, and Dr Franklin, were the most conspicuous members.\nThe constitution, or plan of government, which this august body after many months deliberation gave forth, (although the United States have now for twenty years been prospering under it beyond all expectation and example,) was established with much difficulty, and after a strenuous opposition from a powerful and numerous party, who were unfriendly to its adoption. The party, which framed and supported it, was composed of those who saw the necessity of the United States, considered as one nation, being in future provided with a national government; that is to say, with an organ or instrument, by which their intercourse with foreign states might be carried on, and by which, at the same time, such matters of internal police, as are closely connected with that intercourse, might be regulated. In furnishing the United States with this indispensable organ,\n\n* For the satisfaction of those who may never have seen this curious instrument, it is inserted in the Appendix, No. I. Some of the Americans have the assurance to allege, that, in fact, Great Britain has no constitution, because there is not in this country any such single document, recognised as the charter of the government and the palladium of public liberty.\nthe chief difficulty consisted in establishing a government, which should not only possess sufficient vigour for the purposes its founders had in view, but at the same time be armed with no prerogatives that might either seem dangerous to the liberties of the nation, encroach too far on the sovereignty of the individual states, or deviate from those forms of democratic polity to which the American people are so closely attached.\n\nThe constitution actually framed, seems, in an eminent degree, to possess all these recommendations. The powers, with which it is invested, are sufficient for the ends of its institution: its prerogatives interfere as little as possible with the authority of the state governments; and its forms are at the same time strictly conformable to the republican model. It consists of a president, in whom is vested the supreme\n\n* Though the authority of the president is supreme, in regard to the general government, it must not be supposed that he exercises the supreme authority of the United States, in the same sense in which the king exercises the supreme executive authority of this country. The president exercises only that portion of executive authority, which, by the constitution, is\nexecutive authority of the United States; and who is elected every four years, by electors chosen in each state, in such manner as the legislature thereof is pleased to direct. The legislative powers of the general government are confided to a senate, composed of thirty-two members, (two being chosen by the legislature of each state,) who hold their seats for six years; and to a house of representatives, which is renewed every two years, is elected by the people at large, and now consists of one member for every thirty-three thousand inhabitants throughout the union.*\n\nThe functions, which this government was appointed to exercise, are such as arise out of the foreign relations of the United States, together with a few matters of domestic police, which can be more advantageously managed by a national government than by the legislatures of the individual states. Foreign treaties\n\nentrusted to the general government of the union. The supreme executive authority of the United States is, in fact, divided between the president of the United States and the governors of the seventeen individual states.\n\n* See Appendix, No. II.\nand embassies, therefore, the declaration of peace and war, the regulation of foreign trade and levying of the customs, the regulation of the coin and of the law of bankruptcy, with a few other matters of general interest, are the exclusive province of the general government: while the proper legislature of each state administers all those branches of government, that relate to its own individual concerns and internal police. The judicatories of the general and state governments have their respective jurisdictions apportioned by the same rules. The courts of the United States (of which there is one in each state, and a supreme court of appeal at Washington,) take cognizance of all questions of admiralty or maritime jurisdiction, in which the United States are a party; of all questions occurring between foreigners, between a foreigner and a citizen of the United States, between states themselves, between citizens of different states,* or between a state and a citizen of another state. The courts of the individual states retain\n\n* This last-mentioned branch of jurisdiction is now taken away from the federal courts, by the eleventh amendment to the constitution of the United States.\nthe cognizance of all causes civil and criminal, originating among their own citizens, within the bounds of their own immediate jurisdiction; and generally, of all causes, of which the cognizance is not, by the constitution of the United States, expressly given to the courts of the federal government.\n\nThis government, so inoffensive in its structure, and so necessary in its operation, encountered the most bitter opposition from a large and formidable party, and was only at last established by the persevering exertions of those, who saw that its institution was indispensable, not only to the welfare, but to the very existence of the union. America, in the opinion of her wisest and most patriotic citizens, was for some years of the period which elapsed from the termination of the revolutionary contest to the establishment of the general government, on the eve of civil war and national bankruptcy; and nothing, it was evident, but the establishment of a sufficiently strong national government could avert these greatest of all calamities. The successful conclusion, to which the revolutionary\nwar had been conducted, rendered her patriots anxious that the future proceedings of the nation should be equally respectable in the eyes of the world; and that the enemies of their country should have no handle for saying, that they had gained little by the acquisition of independence; since civil discord was an evil scarcely inferior to what had been called the oppression of the mother country. Actuated by these motives, the friends of the federal constitution exerted all their energies to procure its adoption; and, after many struggles, did obtain the suffrages of a majority of the state conventions,* assembled to deliberate on its merits.\n\n* Before the Federal Constitution could go into operation, it was necessary that it should be approved of by a majority of the States. A convention was held in each State for the purpose of deliberating on its merits. Some of the States long refused to accede to the constitution. Rhode Island held out the longest, giving her consent only in the year 1790. Virginia was accounted at that time, as New York is now, the leading State in the union. The accession of that great State to the constitution was therefore deemed of the last importance, and was obtained chiefly through the exertions of Mr Madison, the present president of the United States, who is a native of Virginia, and possessed, even at that time, great influence in his own State. In obtaining the consent of the convention of Virginia, Mr Madison had to struggle against the abilities and eloquence of Mr Patrick Henry, a man of uncommon powers,\nUnder the auspices of Washington, who, after being the leader of his country in war, was summoned, by her unanimous voice, to be her first ruler in peace, the federal constitution commenced its operation on the 4th of March, 1789; and the unparalleled prosperity which, in point of population and wealth, America has enjoyed under its influence, bears ample testimony to the wisdom of its founders. * The party, who voted for and procured its adoption, received the appellation of Federalists; those who opposed it were distinguished by the name of Anti-federalists. Thus arose the two great parties, which have since divided the union. Their respective views and objects are at present very different from what they were at the time, when they first marshalled themselves in hostile array.\n\nand accounted by many the greatest orator that America has ever produced. So grateful was General Washington for this service, the most important which could at that period be rendered to America, that James Madison was ever afterwards a standing toast at the President's table. Mr Madison, therefore, at the period now spoken of, was a federalist, a friend of General Washington, and a friend to the true interests of his country. *Heu quantum mutatus ab illo!*\n\n* See note A.\nagainst each other; but the component parts of both are still nearly the same.\n\nThe party, which opposed the establishment of the apparently unexceptionable constitution, forming the general government of the United States, consisted of persons, who, though professing to have the same object in view, were actuated by various motives. The objection urged by all was, that the federal constitution was too powerful, splendid, and costly a government; and one that might prove dangerous to the liberties, as well as burdensome to the finances, of the nation. The powers, conferred on the general government, encroached too far, it was alleged, on the efficacy and importance of the state governments,* and in the same degree that they armed the former with prerogatives dangerous to the citizen, disqualified the latter from protecting his rights. The office of president was likewise represented as approaching too near to the monarchical standard. The fears that were entertained, or at least expressed, on this subject, are well described in\n\n* See note C.\nthe Federalist.* \"Here,\" it is observed, in the 67th number of that admirable work, being one of the numbers attributed to General Hamilton, \"the writers against the constitution seem to have taken pains to signalise their talent of misrepresentation.\" Calculating upon the aversion of the people to monarchy, they have endeavoured to enlist all their jealousies and apprehensions in opposition to the intended president of the United States; not merely as the embryo, but as the full-grown progeny of that detested parent. To establish the pretended affinity, they have not scrupled to draw resources even from the regions of fiction. The authorities of a magistrate, in few instances greater, in some instances less, than those of a governor of New York, have been magnified into more than royal prerogatives. He has been decorated with attributes, sup-\n\n* The Federalist is a collection of essays, that were written for the purpose of explaining and recommending the federal constitution, while it was under the consideration of the State Conventions. They were first published in the newspapers, and afterwards collected into two volumes. They were almost all the production of General Hamilton. See note B.\nNor in dignity and splendour to those of a \"King of Great Britain.\" He has been shewn \"to us with the diadem sparkling on his brow,\" \"and the imperial purple flowing in his train. \"He has been seated on a throne, surrounded \"with minions and mistresses; giving audience \"to the envoys of foreign potentates in all the \"supercilious pomp of majesty. The images \"of Asiatic despotism and voluptuousness have \"not been wanting to crown the exaggerated \"scene. We have been taught to tremble at the \"terrific visages of murdering janissaries; and \"to blush at the unveiled mysteries of a future \"seraglio.\"\n\nThe federal party naturally comprehended the greater part of those, whose property and education gave them a deep interest in the welfare of the community, and led them to perceive the necessity of a national government. The antifederal party consisted, for the most part, of persons of an opposite description. Speaking generally, one was the party of the gentry, the other of the commonalty. Many of the anti-federalists, therefore, (at least if we may place any reliance\non the assertions of their political opponents, being men of desperate fortune and abandoned character, were, in their opposition to the establishment of the federal constitution, actuated by no better motive than a wish to see realized, those very national calamities, which it was calculated to avert; and even enjoyed the prospect of civil disorders, in which men of this description know they have nothing to lose, and imagine that something may possibly be gained. It is probable, also, that a considerable part of this faction was instigated merely by the envy and dislike, which they felt to the proceedings of men, whom they were forced to regard, though unwilling to acknowledge, as their superiors; and by aversion to the establishment of a government, in whose honours and emoluments they had little chance of participating. Those members of the faction, on the contrary, whose talents and zeal had marked them for its leaders, were probably animated by the hopes of forming a strong and efficient party, which, at some future time, might put them in possession of that very government, of which they affected so\nhighly to disapprove. They proceeded on the safe calculation, that in a government purely republican, those who take the popular side, are sure in the end to prevail. By raising an outcry therefore, about liberty and the rights of the people, and expressing much alarm for the dangerous tendency of the general government, they laid in a stock of popular favour, which might afterwards be turned to their own advantage: and thus commenced that system, which has since been so fatally efficacious,—that system of delusion, misrepresentation, and falsehood,—of wilful deception on the part of the rulers, and of blind infatuation on the part of the people, which, it will appear in the sequel, are among the leading characteristics of American politics.\n\nThe government being established, its offices were of course filled by persons of that party, which had framed it and procured its establishment. The illustrious person placed at its head, selected for its principal departments, some of the most eminent of his companions in arms, together with other gentlemen, recommended by their civil qualifications, to the offices which he\nconferred on them. The celebrated Hamilton, who had been his aid-du-camp during the war, was appointed secretary to the treasury; General Knox, who had also acted a conspicuous part in the revolutionary struggle, was placed in the station of secretary at war. Mr Jefferson was appointed secretary of state, and Mr Randolph attorney-general. All these gentlemen were eminent either for their talents or services. The first Congress was composed, with very few exceptions, of the patrons and supporters of the new constitution, and the state legislatures were filled with persons of the same description.\n\nOf the four gentlemen above mentioned, as composing the President's Cabinet, he who most amply fulfilled the expectations of the country, and reared the most permanent monuments to his own fame, was the secretary to the treasury. General Hamilton, it is well known, was equally remarkable for the greatness and the versatility of his genius. He had served with much reputation in the war of the revolution, and evinced talents that, on a military theatre, would have\nraised him to the highest distinction. No sooner had he sheathed his sword, and accepted the appointment of secretary to the treasury, than he shewed, that he was no less fitted to shine as a statesman than as a soldier. And some years afterwards, when the necessities of his situation compelled him to resign the high office, which Washington had conferred on him, he betook himself to the profession of the law, and soon rose to the highest eminence at the American bar.*\n\n* The various talents and services of General Hamilton present a constellation of excellence, of which there are a few examples in the antient republics, but which can hardly occur in any settled country of modern times; having in this case been drawn into notice, by the unlooked-for contingencies, to which the war of American independence gave rise. The fame of Hamilton, in America, is second only to that of Washington: and, indeed, it is confidently believed, that the great founder of the American nation owed no small portion of his glory to the merits of his distinguished minister. It is certain, at least, that many of the most admired state-papers and speeches of Washington proceeded from the pen of Hamilton. The premature death of this great man excited general commiseration throughout America and Europe. After reaching the ranks of eminence in almost every line of human exertion, and while yet in the vigour of his days, and the midst of his usefulness, he fell a sacrifice to the rancour of a political rival: leaving to a numerous family, little more, than the honour of his illustrious name, and the benefit of his great example.\nUnder the excellent management of this statesman, the finances of the United States were soon reduced to a degree of order, that laid the foundation of the prosperity which the country has since enjoyed. The official reports drawn up by him, and presented to Congress, exhibit a luminous view of the situation, in which America then stood, with respect to her pecuniary resources; and reflect the highest honour on the financial talents, as well as the general political knowledge, of their author.\n\nDuring the first term of General Washington's administration, the success attending the operation of the new constitution, was such, as amply fulfilled the expectations, and testified the wisdom, of its founders. On the expiry of the four years, for which he had been elected president, this great man was again unanimously re-elected: and the second term of his administration was equally prosperous with the first. As he declined, at the end of eight years, to be again re-elected, Mr Adams, who had previously filled the office of vice-president, was chosen to succeed General Washington in the chief ma-\ngistracy of the Union. During the administration of this second president of the United States, the federal party gradually declined in strength; and, on the expiry of his first term of office, it was completely overthrown. Mr Jefferson, who had placed himself at the head of the opposite party, was elected president; and the adherents of this faction (which has since passed by the different names of the republican, democratic, or French party,) soon obtained a decided majority, both in Congress and in the legislatures of the individual states. The federal constitution was thus administered, for twelve years only, by those who had originally framed it, and procured its adoption. At the end of that time, viz. in the year 1800, it passed, and has ever since continued, in the hands of those, who, at the time of its establishment, were its avowed and inveterate enemies.\n\nThe means, by which so total and surprising a revolution was in so short a time effected, have an immediate reference to the object of this letter; and are the more deserving of inquiry, that they seemed to be but imperfectly\nunderstood even in America; and I have never met with any explanation of them, that was to me at all satisfactory. The overthrow of federalism has been ascribed by some, to certain obnoxious measures, adopted by the government, under the administration of Washington and Adams; and particularly to their raising a small standing army of 6000 men, and proposing to build a small navy of six ships of the line. But this is obviously insufficient to account for so great a change. No person in his senses could seriously disapprove of raising an army of 6000 men, which, in so extensive a territory as that of the United States, would be hardly perceptible. As little could it injure the government to propose to build six 74-gun ships: as such a navy is nothing more, than what might seem necessary, for maintaining the police of their own ports and harbours. Neither, could the downfall of federalism be occasioned, as some have asserted, by what has been called the misconduct of President Adams. Besides being charged with a demeanour, rather more distant and haughty, than befitted the first magistrate\nof a republic, this gentleman is accused of a capital error of administration, in having omitted to declare war against revolutionary France, at that period, when she seemed inclined to wage war with every well-regulated community, and had offered peculiar indignities to America herself. But this explanation is equally unsatisfactory with the former; for that partiality towards France, which has since unhappily been so conspicuous in the great body of the American nation, was even then become too apparent: and it seems probable, that, by declaring war against France, President Adams might have accelerated, but certainly could not have retarded, the approaching downfall of his party. Besides, the experiment was actually tried, and totally failed of success. For a short time, towards the end of President Adams's administration, America was actually at war with France; and several French frigates were taken by American ships of war. The most probable cause, to which the overthrow of the federal party has been ascribed, is the imposition of certain obnoxious taxes, particularly on distilled spirits, on\nstamps, and on carriages, which the government proposed to levy for the support of the naval and military armaments above alluded to. These taxes may certainly have had some effect in lessening the popularity of the federalists; but, after a long and attentive consideration of the subject, I have been induced to adopt the opinion, that the change of parties in America was a great movement, that arose almost entirely from the combined operation of two general causes, namely, the peculiar frame and structure of the American constitution, and the peculiar situation in which America was then placed with regard to Europe. My ideas on these points I shall now endeavour to explain as briefly as possible.\n\nEvery nation, that has a popular government, must be divided into parties, and these parties must be constantly at war with each other. In order to fight, they must have subjects of contention, and these subjects of contention must be either internal or foreign. For a considerable time, both before and after the establishment of their national government, the attention of the\nAmericans was wholly engrossed by their domestic concerns. The constitution of the government, under which they were to live, and on which their future happiness or misery so essentially depended, was a matter of sufficient importance to occupy all their attention, and furnish employment for all their intrigues. The establishment of the federal government, therefore, as has already been stated, gave rise to the first great division that took place in the country. For several years, the whole nation was split into two parties, of which one was unceasingly occupied in commending and supporting the federal constitution and the federal administration, the other, in censuring the constitution, and in reviling, and striving to undermine the party, by which it was framed and administered.\n\nSuch was the principal occupation of the American parties for several years succeeding the establishment of the federal constitution. At last the French revolution, and the stupendous events which followed it, diverted their attention from domestic concerns, and fixed it\nalmost exclusively on the great scenes that were passing on the opposite shore of the Atlantic. The dawn of the French revolution presented itself to the astonished Americans, in the light of a mighty people, bursting by a spontaneous movement the shackles of tyranny, and realizing those blissful visions, which the friends of humanity and freedom have in every age so fondly indulged. Their national vanity was flattered by the share, which their own revolution was thought to have had, in the production of the memorable event: and they rejoiced in the transporting idea, that the blessings of free and popular government, which they considered as first brought to perfection by themselves, were about to be extended to the whole human race. For several years they resigned themselves to this pleasing delusion: at last the spell was dissolved; but it maintained its influence over their minds, long enough, to produce the most important effects on the state of their parties. At first, as already observed, nearly the whole nation was borne away by the torrent; the whole democratic party certainly,\nwithout any exception. The principles, which seemed to govern the French revolutionists, at the outset of their career, were entirely conformable to the views of that faction; and were of course, no less industriously propagated by the leaders, than greedily imbibed by the party at large. The only individuals, who, at that period of philanthropy and frenzy, ventured to express any distrust or apprehension, with regard to the ultimate issue of the French revolution, were a few of the most cautious and reflecting of the federal party. These sagacious persons saw the madness in which that revolution originated; they saw the ruin in which it would terminate. It appeared to them to be highly improbable, or rather totally impossible, that a country, so differently situated as France from America, could by any means be rendered capable of the same form of government; or that, though a republican government could exist in a new under-peopled country, at a distance from the theatre of war, and which had been rocked in the cradle of freedom, it could at all exist, or at least exist for\nany length of time, in an old, fully-peopled country, inhabited by a martial race, surrounded with warlike neighbours, and incapacitated for liberty by its long subjection to tyranny. Such, in particular, were the sentiments of General Washington and of General Hamilton; and though it was too soon apparent, that the principles of these illustrious men were just, and their fears well founded, the prevalence of the opposite sentiments among the great body of the people was seriously detrimental to the interests of the federal party. The love of freedom, so congenial to the lower orders of every state, the admiration of French equality, so natural to the American populace, pervaded by far the greater part of the nation; and the prudent caution of General Washington and his wise advisers, was stigmatized, as proceeding, from a cold insensibility to the cause of freedom, and an undue partiality to the interests of England,—then, as was alleged, endeavouring to form a coalition, for the base purposes of checking the emancipation, and partitioning the territory, of France. It may be\neasily imagined, how quickly the concurrent operation of these two causes, during the progress of the French revolution, thinned the ranks of the federalists, and increased the strength of their opponents. In point of fact, there can be no doubt, that the French revolution had a material share in the overthrow of the federal party. In point of date, the two events correspond with a singular exactness. The federal party may be said to have come into power, when the federal constitution was established, in the year 1789; and its final overthrow was marked by the accession of Mr Jefferson to the presidency, in the year 1800. The French revolution began about the year 1790, and may be said to have reached its consummation about the year 1800, when Buonaparte declared himself first Consul of the French republic.\n\nSo early as the year 1797, Europe had assumed many features of the frightful picture which she now exhibits. France had made considerable progress in the destructive career she has since too successfully pursued, and Britain was approaching to the proud station, which\nI hope she will long maintain, of the last receptacle of European freedom, and the only remaining refuge of suffering humanity. It was then becoming apparent, that there would soon exist, but two independent nations in Europe; and the Americans began to be apprehensive, that it would be necessary for them, as for every other people, to take a share in the war, which these mighty rivals were waging with each other. Washington, by issuing a proclamation of neutrality, superseded, at that time, the necessity of a measure, which, in any event, must have been prejudicial to the United States: and laid the foundation of the neutral trade, from which his countrymen have since derived such incalculable benefits. But still, though the country remained at peace, every American was called on to take a side: to choose either the French or the English party. From this time, the objects of political discussion in the United States were exclusively foreign. The paltry concerns of their own administration dwindled into insignificance, when compared with the wonderful events, which almost every day\nbrought forth in Europe, and by which they foresaw that their own interests might be afterwards materially affected.\n\nThe anti-federal party being established in power, it became necessary for them to draw up a political creed; to choose a set of principles, which should be the symbol and the watchword of their party; and by the propagation of which, they might maintain themselves in the situations, in which, by dint of so much perseverance, they had at last been placed. When entrusted with the administration of its offices, they found no fault with the federal constitution, which, during their exclusion from power, had been the object of their unceasing hostility: the federalists of course, whatever were their opinions of those, by whom the government was now administered, found no fault with the government itself; so that the change of parties concurred with the aspect of affairs in Europe entirely to take away the original ground of dispute. Foreign politics became the almost exclusive object of attention; and it was necessary for the anti-federalists, with a view to the\ninterests of their party, to choose a system of foreign politics; in other words, to make a choice between France and England. Their bias towards France was but too observable before their accession to power; and the striking change in the politics and constitution of that country, produced after their accession to power, by the unprincipled ambition of Buonaparte, had no tendency to withdraw them from the unfortunate predilection. This is the remarkable feature of American politics. It was natural, that republican America should be attached to republican France; but when France ceased to be a republic, and, on the contrary, became the abode of the most cruel despotism that ever afflicted the human race, it seems incredible, that the Americans, and above all, that the democratic party among the Americans, should even then have persevered in their partiality for her, and their dislike to her illustrious rival. France is not only herself the victim of a degrading tyranny, but the cradle of a military despotism, that has overspread the continent of Europe; and, on a retrospect of the relative\nsituation, in which America, England, and France have for some years past been placed, it appears at first view almost impossible, that the Americans should have preferred the alliance of France to that of England, or should have manifested a partiality to the former country, and a dislike to the latter. France has laid prostrate the liberties of continental Europe, and openly aims at the subjugation of the world. Great Britain is the only remaining obstacle to the execution of this design; and nothing but her subjection is now wanting to crown the ambition of the Gallic tyrant. Were the Americans mere unconcerned spectators of this contest, the most sublime, perhaps, which the world has ever witnessed, the common sentiments and feelings of human nature, and more particularly the sentiments and feelings of republicans, ought to render them averse to the oppressor, and obtain their good wishes at least for the nation, which constitutes the bulwark of the civilized world. But the Americans have much stronger reasons for respecting the character, and courting the alliance of Great Britain, than can\nproceed either from the hatred of tyranny, the admiration of valour, or even the principles of republicanism. They are, at this moment, reposing under the shield of British protection; their existence, as an independent nation, is indissolubly linked to that of Great Britain. The downfall of America would follow the downfall of England, as certainly as the rising of the sun is followed by the diffusion of light. Notwithstanding these obvious reasons of attachment and friendship, the American government is hostile to Great Britain. Their personal interests, real or supposed, lead them to sacrifice the best feelings of human nature, and perhaps the true interests of their own country, on the altar of popular prejudice; and to persist in a predilection, real or feigned, for the inveterate enemy of the country, which constitutes their sole security against foreign subjugation.\n\nThis proceeds on the supposition, that a majority, or at least a great part, of the American people is inclined to be hostile to England; because the American government is composed of individuals, who are the heads of a party,\nand can retain their power only so long as that party continues to be the more powerful of the two. This Anti-Anglican tendency of the American people arises partly from sentiments originally inherent in the people, and partly from the influence of their leaders, who of course use all their endeavours to foster and propagate the sentiments, to which they owe their own elevation. I shall now attempt to explain the causes of this Anti-Anglican propensity, distinguishing, as far as possible, the sources of antipathy, which are original, from those that proceed from the influence and exertions of the democratic leaders.\n\nI. The sentiments of hostility originally inherent in the people, may be traced to the following sources:\n\n1. In the first place, the animosities of the revolutionary war have not been entirely obliterated by the lapse of thirty years. The Americans, being the successful party in that war, ought to be the least unwilling to forgive and forget the differences in which it originated;\nand with the liberal part of the community, this is accordingly the case.\n\nMany of those who acted a conspicuous part in the revolutionary war, and even carried arms on the side of America, are now marshalled under the banners of the federal party; that is, of the party which is attached to the interests of England. When these persons had done what they conceived to be their duty to their native or adopted country, and avenged the wrongs they held to be inflicted on her by the parent state, they dropped all feelings of hostility; they laid aside their resentment, when they sheathed their swords. They had candour to pardon errors, that sprung from circumstances unprecedented in politics, and could separate the mistakes of a minister from the character of a people. On the lower orders, however, these considerations can have little influence. They see but the dark side of the picture. Overlooking not only the errors of judgment, from which the colonial war arose, but the calamities to Britain herself, by which these errors were expiated, they brood over the temporary miseries it inflicted.\non America; and are unable, or unwilling to perceive those circumstances of common interest and indissoluble connexion, which ought to render America the perpetual ally of England. This sentiment of hostility is much more general in the southern, than in the middle or eastern* states; but prevails, more or less, throughout the whole extent of the union, and must not be overlooked in accounting for the ascendancy of the French or anti-federal party.\n\n2. The democratic party was, from the moment of its birth, inclined to take the side of France, merely because the federal party had taken the side of England. Those feelings of affection and respect for the English character, which have always more or less prevailed in America, were, at the close of the revolutionary war, confined almost exclusively, to the federal\n\n* In America, the States of New England, which are often in Europe called the Northern, are uniformly called the Eastern States; because they lie to the eastward of New York and New Jersey; which, with Pennsylvania and Maryland, are called the Middle States. Virginia and the Carolinas are the Southern States; Kentucky, Ohio, and Tennessee, the Western.\nparty, which was composed chiefly of the better orders of the people; and their prevalence among this party seems to have inspired the lower classes with the apprehension of a return of affection, between the United States and the mother country. It is easy to see, that the circumstances of connexion between America and England can produce their full effect, only on persons of a certain degree of refinement. The two countries have the same language; their religion, laws, customs, and manners, are very nearly the same: the constitution of America is evidently formed on the English model: and what constitutes their chief distinction from other nations, their boasted freedom, is entirely of English origin. It is only persons of education, however, who can feel the force, or admit the justice, of these circumstances of connexion. The influence of English literature (which is great in America) must evidently be confined to such persons alone. Many of the upper classes have relations and connexions in England; and many of them have travelled in Europe; where they could not fail to draw a com-\nparison between the two great nations of that hemisphere, much to the advantage of the land of their forefathers.* Sensible of the bias, the proper and virtuous bias, which these circumstances of connexion naturally produced in the federal party, and being themselves unsusceptible of the feelings, in which that bias originated, the opposite faction seems to have conceived a violent jealousy of the federalists, and to have entertained apprehensions, that their British predilections would render them less tenacious, than they ought to be, of the rights and interests of America. Washington† himself did not escape the suspicion of an undue partiality to England; and Hamilton was constantly reviled as a British agent. When a body of men, therefore, stepped forward, who not only disclaimed all connexion with, and attachment to Great Britain, but even expressed a contempt or dislike of her character, and shewed a disposition to view all her acts through an unfriendly medium, the people were gradu-\n\n* See the excellent pamphlet on the French government, by an American.\n† See Marshall's Life of Washington.\nally induced to withdraw their confidence from their original and natural rulers, and to commit their destinies to a description of men, of whose attachment to England they could have no suspicion. It has thus happened, by a singular fatality, that those very circumstances of connexion, which ought to have rendered England the constant ally of America, have been productive of alienation between the countries; and have not only deprived the American government of all partiality for, but have rendered it decidedly and systematically hostile to England. The purely republican nature of the American constitution renders the people the source of all authority: the illiterate commonalty are jealous of the English connexions and predilections of the higher classes; and think it safer to bestow their suffrages on men, who have neither English connexions nor English partialities; but who, on the contrary, profess to hate the people, and bid defiance to the government, of England. England and America ought to live in perpetual amity: they would do so, if the better classes enjoyed in America, that influence\nwhich they possess in Europe; and which it is for the interest of the people themselves, that they should enjoy. But in America every thing is at the disposal of the mob, or rather of those interested leaders, who can render the passions and prejudices of the mob subservient to their own advantage. When in such a country the flood-gates of democracy are opened, every generous feeling, and every liberal principle, must be swept away by the torrent.\n\n3. There is yet another reason why the ruling party in America find it for their interest to espouse French rather than English politics. To revile the conduct of England, and gloss over the faults of France, serves one of the purposes, which the democratic leaders have in view, much better than the opposite line of conduct would do. The Americans are a bold, active, and enterprising people, having all the vigour of Englishmen, combined with the restless enterprise of new colonists. The systems of policy, therefore, adopted by their favourite leaders, must be of a nature fitted to rouse and inflame, and keep in\nconstant agitation; a turbulent, fiery, and ferocious populace. The leaders of the democratic faction know that French, or rather Anti-English principles, possess this quality in a much higher degree than those of the opposite description. England is, as to America, a much more powerful country than France; because England, by means of her naval power, comes into immediate contact with America; and France, by the same power, is excluded from the western hemisphere. The democratic leaders, therefore, bestow the most lavish abuse upon England, and, as far as possible, endeavour to exasperate the people against her, precisely because she has the means of immediately hurting them at home; whereas France, who has inflicted on them much deeper injuries than ever they received at the hands of England, is seldom or never mentioned by them but in terms of indifference or of commendation. The injuries done by France, however, to America, consist chiefly in the confiscation of goods and shipping in the ports of the former country; and these, being injuries which are felt chiefly, if not entirely, by the\nopulent merchants, are of course extenuated and glossed over in a system of politics, that is intended for the level of the populace. While the British navy subsists, America is inaccessible to France; and the leading demagogues of that country exhaust their ingenuity in calumnies and invectives against their protector; because it gratifies the ferocious populace they delude, to insult a powerful nation that has the means of annoying them. The democratic leaders seem to be careless of the evils, which this line of conduct may eventually bring down upon their country. Provided they can retain their offices and emoluments, they are little scrupulous about the means by which they contrive to do so. As little do they seem to reflect on the gross inconsistency and absurdity of the politics they advocate. They express little or no resentment against France, because, though she has done them incalculable mischief, she is prevented by the interference of England from subduing, or altogether destroying them; and they affect to consider, as their deadly enemy, the nation that has the power of defending them, and actually does defend them against the people, that has swallowed up the\nliberties of Europe. But this power, which protects them against France, could also, they know, lay their principal towns in ashes, and blockade their shipping in their harbours; and they revile and insult the nation, possessed of this power, because, by so doing, they keep alive that agitation and ferment, which are the vital air of a democratic community.\n\n4. Connected with the subject of Britain being the present protector of America, there is another idea, which probably enters into the consideration of the violent politicians of the latter country. Their haughty spirit of independence renders them peculiarly adverse to the notion of receiving protection from a country, which they consider as having been once their oppressor, and whose yoke it is their boast to have thrown off. At the termination of the American war, there were not wanting politicians on both sides of the Atlantic, but particularly in the United States, who predicted that the greatness of Britain was on the wane; and that the disjunction of her transatlantic dominions, if not\nthe forerunner of her own downfall, was at least a blow, from which she would not speedily recover. All these predictions, however, have been totally falsified; the prosperity of Britain has never advanced with so rapid a step, as since the close of the American war; and for several years past she has been the protectress of her own revolted colonies. The United States derive as much benefit from the British navy as they could possibly have done, had they still formed an integral part of the British empire. They are unwilling, however, to acknowledge so great a favour from the country, which they formerly baffled, and which they still affect to set at defiance. The obligation, which they refuse to acknowledge, they cannot avoid feeling; and hence arises a strange mixture of sentiment, which induces them to hate their protector, and to revile their best ally.\n\nIt appears, then, that the ascendancy of the democratic party in America, is in a great measure owing to its having embraced the political principles most consonant to the sentiments and feelings of a rude and fierce democracy, exerci-\nsing supreme authority, and uncontrolled by any of those checks, which in governments less democratic, are found to be so useful in moderating the zeal, and correcting the errors of the populace. The principles of this party are infinitely less agreeable to truth, to justice, and to sound policy, than those of the federalists; but they have been adopted, and are still cultivated, because they are more congenial to the animosities engendered by the revolutionary war, because they are in opposition to the principles advocated by the federalists, and because they afford more abundant food and exercise to the turbulence and fury of a contentious populace.\n\nII. In a popular government, every party contains two separate descriptions of people, those who lead, and those who are led. The leaders are at first determined, by principle, by interest, or by accident, to choose the party which they prefer; and the reaction of their influence on that party is more or less perceptible, in proportion to the greater or less degree of activity, which they display in promoting its interests.\nIt has already been explained, that the leaders of the democratic party in America have obtained possession of the government, by choosing that set of principles, which is most acceptable to the ruder and less refined part of the community: and it is proper to add, that they owe their ascendancy also, in some degree, to the superiority which, in one respect, they have always manifested over their political opponents;—to their greater activity and zeal in propagating the principles, and advancing the interests, of their party.\n\nIt might have been inferred, *a priori*, from the difference between the materials of which the two parties are composed, that their conduct would be marked by the difference, which is here alluded to. The leading federalists are gentlemen of fortune, talents, and education, the natural rulers of the country. The leaders of the democratic party, on the other hand, are, for the most part, what may be called politicians of fortune; adventurers, who follow politics as a profession. With them politics are a primary, with the federalists, they are rather a\nsecondary consideration. The democrats, being in general men of inferior birth and breeding to the federalists, can more easily mix with the rabble, and practise the tribunitian arts. They affect, in their dress and manners, to regard themselves as of the plebeian order, and condescend to a familiarity of intercourse with the vulgar, from which gentlemen would revolt. They practise, in short, with greater activity and perseverance than the federalists, all the means by which the interests of their party can be advanced. These means, as being curious in themselves, and totally different from anything that is known in this country, are not unworthy of explanation.\n\nIt is in the large towns that these means are employed with the greatest activity, and attended with the most complete success; and a statement of what is done in New York will furnish a good specimen of what is done throughout the union. This city, which contains upwards of 90,000 inhabitants, is divided into ten wards, each of which has an alderman and officers of its own. This division has been made\nchiefly for the convenience of elections; which, in a country where suffrage is universal, and party spirit runs so high, could not be conducted on the same plan as in England, without being the source of tumults and bloodshed. On occasion of elections, each ward has its own poll, where the votes are given in on written tickets. The federalists and republicans* of each ward hold occasionally separate meetings, in which they discuss the state of public affairs, and the present condition of their respective parties. On great occasions, and sudden emergencies, or when any very important or obnoxious measure has been lately resorted to, either by their own government or by foreign nations, general meetings of all the federalists and all the republicans in the city are separately called by their\n\n* It is proper here to mention, that the democratic party have, for some time past, styled themselves Republicans. The federalists, not to be deficient in a popular appellation, call themselves Federal Republicans. The names, however, which the two parties give to each other, are very different from those which they arrogate to themselves. The Republicans call the Federalists, Aristocrates, Tories, Englishmen, and British agents. The Federalists retort, on their adversaries, the still more opprobrious epithets of Democrats, Frenchmen, and Jacobins.\nrespective leaders. These general meetings, which are often very numerous, are addressed in an animated harangue by some orator, who moves a string of resolutions, that have been previously concerted. The resolutions are adopted by acclamation, and published in all the newspapers. During my stay in the country, (which happened to be at the time of the embargo,) the standing topics of declamation, at the federal meetings, were the errors and misconduct of their own government in respect to the two belligerent powers, and the incalculable mischief which the country was suffering from the mal-administration of its rulers. The democratic assemblies were chiefly entertained with the abuse of England, whose atrocious conduct, it was alleged, had rendered necessary all the restraints, which the government had seen fit to impose on the commerce of their own country.\n\nOn certain great festivals, particularly on the 4th of July, the anniversary of the declaration of American independence, in addition to other rejoicings, an oration is delivered in one of the churches, to which all parties are invited. The\navowed object of this meeting is to keep alive, in\nthe minds of the people, the love of indepen-\ndence, and the memory of the great exploits by\nwhich it was achieved: but its real purpose is,\nto rake up the animosities of the revolutionary\nwar, and to perpetuate that antipathy to Eng-\nland, which the leaders of the democratic party\nfind it for their interest to cherish. It is at-\ntended accordingly by few but those in the de-\nmocratic interest.\n\nIn almost all the arts, by which a political\nparty can be benefited, the democrates or re-\npublicans are an overmatch for their adversaries.\nPrevious to elections, they exert themselves with\nindefatigable zeal to secure a majority; nor are\nthey scrupulous about the means, provided the\nend be attained. Dissimulation, misrepresen-\ntation, and falsehood,* are alternately made use of.\nThe press, which, in this country, is the guar-\ndian of freedom, in America, is the instrument\nof faction. Newspapers are there multiplied to\nan extent unknown in any other country. The\navidity for news creates a demand for them.\n\n* See Note D.\namong all classes of the community; and the general diffusion of opulence, or at least of independence, enables all ranks to gratify this inclination. In the city of New York alone, which is not more populous than that of Edinburgh, there are published eight or nine daily papers. The most violent of these engines of party are, of course, in the service of democracy. They are often conducted with a degree of intelligence and animation worthy of a better cause; and would be highly creditable to their authors, were they not disgraced by the gross and vulgar abuse, which they continually lavish on the British government and the federal party. The democratic journals, scattered over the union, propagate, to its farthest bounds, the principles and the prejudices of the faction; whose zeal for proselytism is displayed, perhaps, more remarkably in this particular, than in any other. Whenever a township, in the back settlements, appears sufficiently advanced to support a newspaper, a press is established for the dissemination of democratic tenets. Printing-presses are now at work on\nspots, where, twelve years ago, not a tree was cut down; and thus the indefatigable zeal of this industrious party, endeavours to secure the accession of tracts of country that remain to be cleared, and of citizens yet unborn.*\n\nIn so far as we have yet proceeded, the line of distinction between the American parties is accurately marked out. We observe the federalists to be the founders of that constitution to which America owes so much of her prosperity and her glory: we find their conduct, during the few years they were permitted to administer this constitution, regulated by the principles of a sound, manly, and liberal policy; and we find them at last driven from power because they were\n\n* The influence here ascribed to newspapers in America, is not inconsistent with the epithet illiterate, which in other parts of these letters is applied to the American commonalty. A man may be very illiterate who is able to read a newspaper. In fact, no people can in the least degree be fit for republican government, among whom the accomplishments of reading and writing are not pretty generally diffused; and this (which is all that the great body of any nation can ever acquire) is exactly that portion of learning which best qualifies a republican people to become the dupes of designing demagogues—the fate which, sooner or later, awaits every nation enjoying the blessings of a purely republican government.\nless dexterous than their competitors in the practice of low tribunitian arts, and because they disdained to pander to the blind passions of a mob or a faction. We observe the anti-federalists, on the other hand, to be that party who owe their name, and, in a great measure, their existence, to the opposition they gave to the establishment of the government, under which their country has enjoyed such unequalled prosperity; we find them obtaining possession of this very government, partly perhaps by means of the popularity they had acquired by originally condemning and opposing it; and we now find them retaining their power, through a skilful employment of all the means best calculated for securing the suffrages of a rabble, and through a clamorous profession of the principles and sentiments congenial to an illiterate populace, jealous of the higher classes, and ignorant of the true interests, of their country.\n\nIII. Such, my dear Sir, are the causes of democratic ascendancy which operate in every part of the Union. Other sources of the Anti-An-\nglican spirit, as connected with the predominance of the democratic party, are to be found in the jealousies and dissensions, that prevail among the different parts of the Union themselves, owing to the different circumstances in which they are placed; and of these circumstances it will here be necessary to introduce a short explanation.\n\n1. It is well known, that there is a considerable difference between the habits and pursuits of the people of the northern and southern states. Agriculture is chiefly cultivated in the latter, commerce and navigation in the former. The inhabitants of New England have a near resemblance to the Dutch: the prominent features of their character being enterprise, parsimony, and avidity of gain. The people of Virginia, and the southern states, on the other hand, are chiefly planters and landholders; a description of persons, whose ideas are naturally more aristocratical, and who have always regarded themselves as the noblesse of America. The effects of the commercial prosperity, which\nAmerica has enjoyed, since the establishment of her independence, though they have been perceptible in every quarter of the Union, have been much more conspicuous in the northern than in the southern states. The southern states, by sending their produce to Europe, have carried on a considerable foreign trade of consumption; but the merchants of the northern states have also, till the late interruption of neutral commerce, engrossed almost the whole carrying trade of Europe; and enriched themselves by an employment, in which their southern brethren have, comparatively speaking, had little participation. The northern merchants have thus acquired a degree of opulence, that has enabled them to outshine, in magnificence and splendour, the southern planters. Hence has arisen a competition and rivalship, that have destroyed the little cordiality, that once subsisted between these parts of the country. The different sections of the American Union do by no means entertain for each other those friendly sentiments, that subsist between the different provinces of the British or French\nempires. They regard each other with a mutual jealousy and dislike, bordering upon hatred. The inhabitants of the northern states, whose character is very similar to that of their English ancestors, dislike the arrogance and presumption of the southern slave-holders; and the southern planters, on the other hand, despise the plodding industry, and commercial spirit of the northern merchants. The commercial prosperity of the northern states has of late years inflamed the jealousy of the southern, who would, therefore, look with the less regret on a war with England, by which the commerce of their nation would be almost totally annihilated.\n\n2. There is yet another reason to be assigned for the aversion of the Virginians to neutral traffic. Their spirit is too proud for this species of trade. A neutral power cannot be treated with the respect, which a belligerent always exacts. In submitting to the necessary search for contraband goods, or foreign seamen, its vessels are liable to many insults and indignities,\nwhich a high-spirited nation cannot tamely endure. The Dutch might more easily pocket these affronts; being a people, whose territory was diminutive, and whose very existence depended upon commerce. The New Englanders are also tolerably fitted for the business, having a decided propensity to mercantile affairs; and inhabiting the territory which is the most fully peopled of any in the United States, and that, in which all the channels of industry are most completely filled up. But the Virginians and Carolinians, high-spirited, haughty, and fierce, lords of a territory, nearly as large as the half of Europe, of which not a tenth part is yet inhabited; from the united effect of their free government, and the practice of domestic slavery, combining, like the ancient Romans, the turbulence of republicans with the pride of nobility,—such a people cannot easily stoop to the indignities, which a neutral nation must lay its account with suffering. I have already observed, that the southern states profit much less by this neutral trade, than their northern brethren: but had they even no jealousy of that part of\nthe union, they are indignant to see the flag of their country employed as a beast of burthen, and rendered alternately the slave and the victim of contending belligerents.\n\nFor these reasons, Virginia, and the other southern states, are strongly impregnated with the anti-commercial, and, of course, Anti-Anglican spirit: and these states are now considered as the strong-hold of the anti-federal, republican, or democratic party. It deserves here to be mentioned, that the southern states have, in proportion to their population, more political weight than the northern, owing to the following circumstance. By the second section of the first article of the Constitution of the United States, it is provided, that \"representatives,\" (members of the House of Representatives,) \"and direct taxes, shall be apportioned among the several states, according to their respective numbers, which shall be determined, by adding to the whole number of free persons, including those bound to service for a term of years, and excluding Indians not taxed, three-fifths of all other persons.\" This clause was introduced,\nin order to give the southern states a representation for their slaves. There are slaves in all the states; but the proportion of those in the southern to those in the northern, is at least ten to one. The southern states, therefore, send more members to Congress, in proportion to their free population, than the northern. They have, in consequence, more political power; and the party, which they support, is the most likely to prevail.*\n\nIV. There yet remains to be considered, another subordinate circumstance, by which the ascendancy of the democratic interest in America may, in part, be accounted for. This is the vast number of foreigners, who yearly land in the United States. Of these the greater part are discontented Irish, who emigrate in swarms to a country, where the wages of labour are higher than in their own; and where they are permitted to indulge, without restraint, that hatred to the British government, which is the ruling passion of their souls. They are recei-\n\n* See Appendix, No. II. and Note E.\nved with open arms by the democratical faction, whose principles are conformable to their own; and into whose scale they throw their whole political influence. The last Irish rebellion sent to the United States a vast crowd of rebels and United Irishmen; and every passing year makes additions to the number. The residence, which is necessary to entitle a foreigner to the privileges of citizenship in America, has varied according to the different principles and interests of the two parties, by which the government has at different times been administered. At first, under the federal rule, if I am not much mistaken, the residence necessary was five years: but on its being found, that the greater part of those who applied for the benefit of this law, were in the habit of joining their political adversaries, the term was prolonged, by act of Congress, to fourteen years. When the democratic party came into power, they knew it to be their interest that naturalization should be as easy as possible; and the term of residence was accordingly brought back to its old period of five years. But it is well known, that\nthere are modes, by which persons, who have not fulfilled the statutory residence, may obtain certificates of citizenship; and that many foreigners vote at every election, who have not been five years in the United States. It is one of the chief evils, that have resulted from the independence of the American colonies, and of which the full extent was at first very far from being clearly seen, that these republican communities, sprung from our own bosom, and, speaking our own language, furnish a receptacle, in which the disaffected of all descriptions may exercise their hostility to the mother country, not only with perfect impunity, but perhaps with as much efficacy, as they could have done at home. The Irish are noted, as being the most bitter democrats in America. In the city of New York alone, there are five or six thousand of them, who all vote with the democratic party, and, as is thought by many intelligent persons, have, for several years past, turned the political scale of that city in favour of the anti-federalists.\nV. There yet remains to be mentioned a source of democratic ascendancy, which will probably have already occurred to every reader, but which it is necessary to introduce in a view of American parties. I allude to the circumstance of the democrats having, for several years past, been the prevailing party in the United States. Many repair to the standard of a successful party, merely because it is successful; and the longer, therefore, that a party remains in power, the more difficult is it to be overthrown. The democrats having, at present, the command of the powerful machine of government, secure the allegiance of a numerous tribe of expectants and office-hunters; and, having a preponderance in almost all the legislatures, are frequently able, by means of legislative interferences, materially to promote the interests of their party. Of this legislative dexterity, many curious instances might be given: the author will content himself with one. In the case of two adjoining counties, each of which elects one member to the legislature, and in which the democrats on the whole have a majority, but one\nof which has a federal majority, the legislature of the state has been known to pass a law incorporating the counties into one, and ordering them henceforth to elect two members by a general ticket.* In this manner they obtained two democratic members, in place of a democrat and a federalist.\n\nThe democratic party, therefore, in the United States, may be said to be composed of all those persons, who cherish the animosities of the revolutionary war; of all those who oppose the federal party from a spirit of opposition, and in consequence of being impregnated with\n\n* General tickets are a contrivance, which, like the slave representation of the southern states, is favourable to the influence of the prevailing party, but unfavourable to the fair representation of the people. If a certain number of members is to be returned for a town divided into wards, or a district divided into sections, it makes a great difference whether the members are chosen for the whole town or the whole district, by a general ticket, or whether each ward and each section chooses its own member. In the former case, the members returned are all either democrats or federalists, according as one or other party prevails throughout the town or the district; in the latter, each subdivision sends the member chosen by the majority in that subdivision. The latter is certainly the fair mode of election, but the former is that which, for obvious reasons, will always be preferred by the ruling party.\nthe anti-commercial and Anti-Anglican spirit, which is so strong in the southern parts of the union; of all those who are actuated by a blind hatred to England, and by the hopes of preferment through the favour of a prevailing party; and it comprehends, in the last place, the discontented outcasts of all descriptions from our own dominions, who of course throw their whole weight into the scale of the Anti-English faction. The numbers, which, from its own nature, must necessarily repair to the standard of such a party, together with its superior activity, vigour, and energy, have for several years past given it an ascendancy over its political rivals.\n\nI flatter myself, my dear Sir, that you have now a tolerably correct idea of the chief sources, from which the manifest hostility of the present American government to Great Britain proceeds. It arises from causes that are almost wholly internal, and very little connected with the merit or demerit of the conduct of Britain towards the United States. The persons administering the American government manifest an aversion to-\nwards this country,* and treat its government with all the insolence which they dare to exhibit, because these sentiments and that behaviour are the tenure by which they hold their offices. The American rulers are the heads and leaders of the faction, among the members of which, these principles are the watch-word and the bond of alliance: on taking power they pledge themselves to act upon these principles; and the more steadily they adhere to them, the more faithful are they accounted to their trust, and the more true to the interests of their party. You will observe, therefore, that they have a pre-determined antipathy to this country. They would have manifested dislike, and threatened hostility to Great Britain, though the affair of the Chesapeake had never occurred, and the orders in council had never existed. Most of them are adventurers in politics; men, who choose to make their fortunes in this way; and who, of course, are as much bound to support the views of their party, however erroneous, as a profession-\n\n* See Note F.\nal advocate, to plead the cause of his client, however bad. I have no doubt, that many of them secretly despise the principles they profess, and disapprove of the conduct they pursue: but they must either adhere to these principles and that practice, or abandon their party, and resign their offices and honours. The greater part of them, however, are, I suspect, by this time impressed with a thorough conviction of the rectitude of their principles. For such is the power of party spirit, that the most extravagant conduct, when viewed through its distorting medium, will appear judicious, and the most criminal measures laudable. Most, it is probable, at first joined this party from interest, and perhaps a few, from principle. But whatever were their original motives, the spirit of party, by which I mean the interest felt by every person in the success of the party, to which he has attached himself, degenerates at last, in a country like America, into a passion, which absorbs every faculty of the understanding, and every emotion of the soul.\nLETTER II.\n\nHaving now, my dear Sir, laid before you the chief circumstances, in which the hostility of the present American government to Great Britain appears to originate, I proceed to explain certain peculiarities of the American constitution; and several accidental causes, by which that hostility has been materially aided and increased.\n\nI. Of the peculiarities of the American constitution, which have contributed to the end in question, the most remarkable seems to be, the total exclusion of hereditary power and digni-\nty; and this may be considered first in reference to the executive magistrates, and secondly, in regard to the legislatures of the United States.\n\n1. Not only are all the legislative bodies of the Union filled by election, but all the chief executive functionaries are constituted in the same manner. The consequence of this peculiarity is, that when, from any cause, the government receives a bias, it gives way to that bias, more totally and absolutely, than it would do, were any mixture of hereditary aristocracy admitted into its composition. The rulers of America, both supreme and subordinate, are the creatures and instruments of a party; and the leading principle of their conduct of course is, to promote the interests of the party, of which they are the tools and the creatures. Their views, therefore, are less upright, less independent, and, in short, less patriotic, than those of hereditary magistrates might be expected to be. Having besides, less interest in the prosperity and preservation of the state, they may be supposed to feel less devotion to its service.\nThe author does not mean to assert, that exalted merit is necessarily the concomitant of hereditary rank; or to deny, that the most illustrious descent has often been disgraced, by the most egregious folly and the most abject baseness. But he certainly does mean to affirm, that, *ceteris paribus*, hereditary dignity of rank is the surest guarantee of genuine dignity of sentiment: and that he, who has the largest stake in the community will, in general, feel the most anxious concern for its welfare. A great and opulent prince can seldom have in view, any other object, than the prosperity and glory of his country. Elevated by his station, no less above the cares of private industry; than the paltry avocations of political intrigue, he surveys, with calm deliberation, as from another planet, the relations of his own with foreign states; and directs the proceedings of his ministers to that line of conduct, which seems, on the whole, most likely to promote the general interests of his dominions. The great advantage, indeed, of hereditary monarchy seems to be, that the prince, being raised far above the petty objects of pri-\nvate contention, is able to moderate and counteract the selfish views of his ministers, and to prevent the interests of his country from being sacrificed either to the prejudices of individuals, or the animosities of cabals and factions. The prince, in short, is a check on the jarring interests and selfish designs of his subjects. In the United States, there is no such magistrate, and no such check. The supreme executive ruler of that country is raised from the mass of the community, by the influence of superior talents and successful intrigue; and can never regard himself in any other light, than as head of the party, to which his elevation is owing. The eminence of his station, so far from moderating serves but to increase the violence of his party zeal; and he holds himself bound, in duty and in gratitude, to employ the power and the influence, which his party have bestowed on him, in exalting them, and depressing their political opponents.\n\nWhoever will take the trouble to reflect, for a moment, on the difference between an hereditary and elective chief magistracy, must be satis-\nfied of the very different effects, which the one and the other must produce on the governments, in which they respectively exist. An hereditary sovereign is indebted, for his honours and his wealth, to the favour of no earthly being; he owes them to God and his destiny; and is responsible for the application of these blessings, and for the exercise of the power which accompanies them, only to his Maker, his conscience, and the people at large, over whom he is appointed to reign. That people he regards with an eye of equal affection; he considers them in the light of children; and, in the ordinary case, has no peculiar predilection for any one class of his subjects. Another sentiment, arising from his hereditary dignity, has also a powerful influence on his conduct. Being, for the most part, descended of a long and illustrious line of ancestors, he is naturally desirous to emulate the fame of his forefathers, and perpetuate the honours of his race. Very different, in all these respects, is the situation of an elective chief magistrate. For his honours and emoluments, he is indebted, not to the lustre of his\ndescent, but to the favour of a faction, which has raised him to power, in opposition to the will, and in spite of the exertions, of a large body of the nation. By the very constitution of his authority, therefore, he is led to regard a great proportion of his fellow-citizens, with an eye of disgust and aversion. Instead of considering them all as a great family, for whose interest he is equally bound to provide, he separates them into the two classes of friends and enemies; and while he thinks no exertions too great for promoting the private interests of the former, he surveys the latter, not merely with cold indifference, but often with implacable hatred. If there is any part of the empire, in which his political opponents* form the majority of the people, he must necessarily consider that district as a rot-\n\n* Of this there is a remarkable instance in the New England part of the American union. The four states of New England, viz. Massachusetts, New Hampshire, Vermont, and Rhode Island, are the strong-hold of the English, or federal party; and of course, since the accession of the other party to power, they have almost uniformly been in opposition to the president and the government. The anti-commercial measures of Jefferson were thought to have been dictated, in no slight degree, by his enmity to the New England states.\nten member of the body politic; and the circumstance of hurting the interests of that member, will not be regarded as an insurmountable objection to any measure he may be advised to adopt. Neither has an elective magistrate the high motive of illustrious lineage to incite him to virtuous and patriotic conduct. He is chosen from the mass of the people; and, when the term of his office expires, returns to his native obscurity. As little is he actuated by the consideration, that his posterity can be either benefited or injured, by the character of his administration. His interest in the office he exercises, compared with that of a sovereign, is a transient and fleeting interest. It is sometimes said, that the royal authority is a trust, and not a property. I maintain that it is a property, in the strictest and most literal sense of the term. The property of a prince does not merely consist in his treasures and his dignities; it consists in the interests, the prosperity, and the glory of his people. These are the inheritance he has received from his forefathers; these are the patrimony he transmits to his descendants.\nhigher the renown of his people, when he assumes the sceptre, the richer is the inheritance he receives; and the higher he can raise that renown, during the period of his own administration, the more improved is the estate, which his posterity are to enjoy. This powerful motive of exertion is also, in a great measure, wanting to an elective magistrate. His children can hardly be affected by the success or failure of his administration. They are concerned in his personal character; but in the prosperity of his government they have no interest, distinct from that of ordinary citizens. We may therefore conclude, that pure patriotism, genuine nobleness of sentiment, and steady, undeviating attachment to the interests of his country, are seldom to be looked for in an elective magistrate. Petty, factious, and local views, will govern his conduct, and fix the character of his administration.\n\nThis, then, is one peculiarity of the American government, which may in part account for the phenomena we are considering; namely, the circumstance of the chief magistrate be-\ning an elective, and not an hereditary, officer; and it is to be observed, that this remark is applicable, not only to the general government of the United States, but also to each of the governments of the individual states; the chief magistrates, or governors of which are all, like the president of the United States, chosen in the manner of election.\n\n2. It is proper, in the next place, to observe, that by the total exclusion of hereditary dignity, America is deprived of the infinite advantages which a well-regulated aristocracy is calculated to afford. Independent of the stability which a political constitution borrows from such an establishment, and which it can draw from no other source, what may be called the legislative benefits resulting to a country, from a body of nobility regulated on the principles of moderation and wisdom, are of the highest order. Before laws are finally enacted, it is of the utmost importance that they should be subjected to the scrutiny not only of the representatives of the people, and of their supreme executive\nruler, but also of a body of men who see with different eyes from either the people or their chief magistrate, who form a balance and a barrier between both, and whose views, while they may be supposed to be equally patriotic with those of the other branches of the legislature, must necessarily be more independent than those of an elective assembly. America, however, enjoys but in a very limited degree those advantages which a division of the legislative power is calculated to afford. The only benefit she derives from this circumstance is, that laws are subjected to the consideration of two legislative councils instead of one. All the other advantages arising from the partition of legislative authority, among different bodies of men, are unknown to her constitution. The senate, both of the United States and of all the individual states, is composed of the same materials, and drawn from the same sources with the more numerous branch of the legislatures. The senators must be a little more advanced in life than the members of the lower house may be, and they hold their seats for a somewhat longer pe-\nperiod; but their qualifications are almost the same, and they are elected by very nearly the same description of persons. All the legislative bodies of America, therefore, have the same interests; and are actuated by the same views, passions, and prejudices. The upper branches of legislature, so far from being what their founders probably wished, in some measure at least to render them, a check on popular zeal and folly, serve scarcely any other purpose than that of flattering the prejudices which they ought to correct, and feeding the flames which it is their province to quench.\n\nII. Another peculiarity, worthy of notice, in the American constitution, is its federal form, by which the functions of government are divided, between the general and the state governments. In consequence of this peculiarity, those powers which, in other countries, are exercised by one government, or by one set of rulers, are in America, parcelled out and divided between two, or rather among many different sets of rulers. The operation of this partition of power\nappears to be, to heighten the defects, which\nthe rulers of America, from the causes already\nstated, would at any rate labour under; to ren-\nder them more factious, more turbulent, more\nviolent; and, when they take any bias in poli-\ntics, to subject them more completely to that\nbias. The government of the United States\n(taking the words in the sense in which they\nare understood in Europe,) means the president\nand the two houses of Congress. These de-\npositaries of power are aptly enough, in Eu-\nrope, denominated the government of the Uni-\nted States, because they are the organ, by which\nthe intercourse of the United States with foreign\nnations is carried on. But if they are called\nthe government of the United States, in the\nsame sense, in which the term government is\nused, when applied to the governments of Eu-\nrope, the words are most fallacious; because\nthese functionaries in America do not, in fact,\nexercise one-tenth part of the powers, that are\nexercised by the governments of Europe. This\ncircumstance has the double effect of lessening\ntheir interest in the community, and diminish-\ning their personal importance: thus rendering them better adapted, for what in reality they are, the tools and instruments of a faction.\n\nIt was formerly stated, that, by the constitution of the United States, the authority of the general government, comprehending the president and two houses of Congress, is confined to the management of the intercourse of the United States with foreign nations, and a very few objects of domestic concern, which can be better managed by the general, than by the state governments. The powers of peace and war, therefore, the sending and receiving ambassadors, the appointment of the officers, civil, naval, and military, of the United States, the regulation of the coin, the customs, and the law of bankruptcy, with the imposition of such taxes as are necessary to meet its own expenses, are the exclusive province of the general government. With these exceptions, all the other powers of government are exercised by the legislatures of the individual states. The seventeen state-governments of the Union all consist, like the general government, of an executive and\ntwo houses of legislature: and each of these, within its own limits, exercises a supreme, sovereign authority, independent of, and unconnected with, the general government of the Union. The internal police, therefore, of each state; the powers of taxation, as to its own peculiar ex- penses, the raising, disciplining, and officering of the militia, together with the whole body of the municipal law, both civil and criminal,—all these most important departments are, in each state, under the control of its own peculiar legislature.\n\nIn Britain, the superintending power of the legislature extends to every branch of the empire, and every department of the state. With parental care, it watches over the domestic as well as foreign concerns of the nation; and the same government, that has the power of declaring peace and war, has also the power of imposing all taxes, and of regulating the whole municipal law. The concentration of these powers furnishes an additional guarantee for the patriotism of government, and at the same time invests it with that due degree of weight and dignity, which a government ought to possess. The\ndivision of powers, on the contrary, that has taken place in America, prevents the persons who administer the general government, from ever feeling their interests, as they ought to be, completely amalgamated and identified with those of the country, whose foreign affairs they are appointed to conduct. They cannot feel the same interest in, and the same attachment to, a country, in which their authority is confronted, and their measures often condemned, by a number of independent governments, as if their own supreme power extended over every part of the empire. In the same proportion, too, that their powers are curtailed by the rival authority of the state governments, their personal dignity is impaired, and their real importance diminished. Hence probably arises much of their insolence and arrogance. It is an old and a just remark, that the less power any body of men possesses, the more eager are they to exercise, the more ostentatious to display, that portion of authority. This observation is strikingly illustrated in the case of the American rulers. Who are the men, that pass by the name of the government of the United States,\nand, for the last seven or eight years, have conducted themselves, with such glaring partiality to France, and such intolerable insolence to Britain? Are they the rulers of a great and powerful nation, exercising all the functions of legitimate sovereignty, viewing all foreign states with an equal eye, and whose sole rule of conduct is a conscientious regard to the rights and interests of their country? No. They are a set of men, delegated to exercise a few of the functions, and these not the most important functions, of sovereignty: they are raised to this dignity, such as it is, by the votes of a faction, in opposition to the will of nearly one half of the nation: they are taken, many of them, from the dregs of the people, to which, after strutting their hour on the public stage, they must again return: and the greater part of them* receive for their services, while in office, a remuneration of five or six dollars a-day. Such are the men, who style themselves the government of the United States, and who delight to insult and to bully the British monarch and the British nation. They revile and insult the nation, which\n\n*The members of Congress.\nconstitutes their only barrier against the ambition of France; and they not only overlook the innumerable wrongs they have received from this latter country, but behave to its government with all possibly courtesy; partly, perhaps, because the persons administering that government are, like themselves, sprung from the level of the populace, and animated by an equal dislike to the ancient dynasties, and legitimate sovereigns of the earth.\n\nIII. In accounting for the present disposition of the American government, it is also to be considered, that the personal character of the chief magistrate is by no means without its influence. It has often been remarked, that in Great Britain, though the king is more limited than perhaps any other prince, with whom we are acquainted, his personal influence is by no means imperceptible on the measures of government: and I think the personal influence of the president* of the United States must be held to\n\n* The patronage attached to the office of president is very considerable. For one item, there are said to be upwards of\nbe very nearly equal to that of the British sovereign. There have now been four presidents of the United States, viz. Washington, Adams, Jefferson, and Madison. The two former have been of the federal, the two latter of the anti-federal, or republican party. By the constitution of the United States, the president must be elected every four years; but the same person may be re-elected, as often as the nation chooses to bestow on him this mark of its confidence. Washington was twice unanimously called to the administration of the government, and of course was president for eight years. Adams held the office only for four years; Jefferson was president for eight years; and Madison is now in the third year of his first presidency. The personal characters of all these gentlemen are to be considered, in an estimate of American politics. Washington is, on the whole, one of\n\n1400 postmasters in the United States, who are all appointed by the president. The officers of the standing army and navy, and likewise of the civil establishment of the United States, or rather of the federal government, are all commissioned by the president. But all appointments of consequence must receive the approbation of the senate.\nthe purest and most unexceptionable characters that occurs in history; and in nothing is the excellence of his character more conspicuous than in the uniform liberality of his sentiments towards Great Britain. If an aversion to this country were excusable in any American magistrates, it surely was so in Washington; but nothing of this sort ever found admittance into his bosom. He regarded the conduct of the mother country, in the war with the colonies, as the offspring of ministerial error and popular prejudice; and, on the close of the contest, not only dismissed all feelings of hostility, but entertained for his ancient enemy, those sentiments of esteem and respect, to which her national character so well entitles her. He had too much respect for genuine freedom, not to feel the highest veneration for that country, which had furnished the model of the free government, he has succeeded in bestowing on his own. This natural predilection for the land of his forefathers, was so perceptible throughout the whole course of his administration, that even the spotless purity and transcendent renown of his cha-\nracter, did not prevent the tongue of calumny from attributing to him, an undue partiality towards England; and the man, who conducted the armies of America, in the war with England, was stigmatized as a British agent. Similar accusations were made against his great co-adjutor Hamilton; who entertained for the British character the same respect, and viewed the conduct of the mother country in the war, with the same liberality of sentiment. These illustrious men justly thought, that though the ties of dependence no longer existed, the identity of language, laws, religion, government, manners, and interests, rendered England the natural ally of America; and formed a connexion between them, which, without violence to the intentions of Providence, and injury to the interests of both nations, could not be afterwards dissolved. Mr Adams professed, and intended to tread in the steps of Washington: but his personal influence was much less than that of his great predecessor; and, during his administration, the federal party gradually declined in strength. On the accession of Jefferson, in 1800, to the presidential\ndignity, new sentiments were adopted, and new principles governed the American cabinet. This gentleman had always been suspected of an antipathy to England; and, from the period of his election to the office of president, this antipathy became gradually more and more apparent; till at last he was admitted, on all hands, to be, in disposition as in office, the most conspicuous of the Anti-Anglican faction.*\n\n* Hostility to England may, in fact, be regarded as the ladder by which Mr Jefferson mounted to power. It is not surprising, therefore, that it should have formed the prominent feature of his administration. Scarcely was he seated in the presidential chair, when he refused to ratify the excellent treaty negotiated by Mr Monroe in London; and thereby opened the unfortunate breach between the countries, which so many circumstances have conspired to widen. The next subject to which he directed his attention, was the searching of American vessels for British seamen, and those impressments of American seamen, which, in spite of all precautions, sometimes happen by mistake. This was, for some time, the leading subject of negotiation between the governments; and a fruitful source of invective against Great Britain, of which ample use was made in all the debates of Congress, and all the harangues of democratic orators throughout the United States. At last, when these topics were becoming hackneyed, the affair of the Chesapeake and the Orders in Council came opportunely to supply their place; and all other grounds of complaint were for some time absorbed in the discussion of these enormous wrongs. One of these grounds of complaint is now removed; but those\nThis propensity of Mr Jefferson has been accounted for on various hypotheses. He resided in France, for several years, as minister of the United States, and returned to his own country, at the commencement of the revolution. It is certain that, at this period, he carried back to America, very strong prepossessions in favour of France; a decided partiality for French manners and French liberty. The French partialities, which he then entertained, are therefore, sufficiently well accounted for.—But how shall we explain his adherence to these partialities, when the course of events in France has proved, in so lamentable a manner, the fallacy of his expectations, as to the establishment of a republic there? Are those who think that the removal of the other would restore harmony to the two governments, supposing the Orders in Council to be now revoked, the American government would devise some new pretence for opening a negotiation with the British cabinet, and irritating the minds of their own people. If no new encounters between ships of war came to their aid, they would return to the seamen and the searching of ships; their demands would rise in proportion to the willingness shown by the British government to yield to them; and they would never rest until every maritime right, to which Britain owes her existence, and America her own safety, was prostrate at the feet of the French usurper.\nblishment of a free government in that country; and when the French, instead of being, like the Americans, the citizens of a republic, are become the slaves of the most cruel tyranny, that ever afflicted the human race? This pernicious adherence to French politics and French partialities, can, I think, be explained on only one supposition, that the party which entertained these monstrous principles, was, for the reasons I have endeavoured to state in the foregoing letter, destined to be the prevailing one in the country; and that Mr Jefferson's public virtue was insufficient to contend with his private ambition. He saw, that the sweets of power and emolument would be the reward of his adherence to this line of politics; and his zeal, seconded by his abilities, soon, accordingly, placed him at the head of the Anti-Anglican faction. When raised to the summit of his ambition, gratitude naturally attached him still closer to the line of policy, which had procured his elevation; and his antipathy to England, thenceforward, bore the appearance, rather of a passion.\n\nSee Note H.\nMr. Madison was originally a federalist, and a co-adjutor of Hamilton, in the composition of the distinguished work, which bears the name of that party. But he has been gradually seduced into other courses by the operation probably of the same motives, which swayed the mind of Mr Jefferson; and, from his recent conduct, it seems likely, that he is determined, not to be inferior to his predecessor, in what constituted the most prominent feature of that gentleman's public character.\n\nIV. The last reason, that here occurs to be assigned, for the violence of the present ruling party in America, is the strength of the opposite party. The French, or democratic party, though, at present, predominant in all, or at least the greater number of the states, is by no means so powerful, as to be able, altogether to despise the efforts of its antagonists. On the contrary, the federal party exercises a steady and powerful opposition, which it requires all the efforts of the democrats to counteract; and which has the effect of rendering their attachment to the\nprinciples they profess, still more bigoted than it would otherwise be. It may seem, at first view, that the circumstance here alluded to ought rather to have the opposite effect; and that, in proportion as the party in opposition are likely to overthrow the party in power, ought the latter to be moderate in their conduct. The reverse of this, however, in reality, is the case. Every relaxation of the line of policy, hitherto pursued by the democrats, is regarded by the federalists as a victory, to be imputed to their own exertions, and a reluctant testimony, borne by their enemies themselves, to the soundness of their political principles. Every such deviation would probably be regarded in the same light by the people at large, and would therefore, in all likelihood, be rather hurtful than beneficial to their party. In consequence of the nearly equal balance maintained between the two factions, and the frequency of the elections, at which the equality of that balance is displayed, the party in power lives in constant dread of being deprived of their power, and of course are stimulated to the most strenuous and incessant em-\nployment of all the means, by which alone, in their opinion, their ascendancy can be maintained. As the storms and tempests of a northern region but bind its inhabitants the more closely to their rocks and mountains; so the political shocks and dangers to which this party is continually exposed, have no other effect, than that of making them cling the closer to their darling prejudices. Besides, they know, that the more rigidly they adhere to their own principles, or, in other words, the more directly they shock and thwart the principles and sentiments of their opponents, the more they will hurt the feelings of these opponents; and this is a consideration which, in a country, where party spirit runs so high as in America, is by no means without its influence.\n\nSuch appears to me to be a fair and tolerably full account of the causes of that antipathy of the American government to this country, of which we have, of late years, had so many convincing proofs. The considerations stated in this and the preceding letter, are, in my estimation, amply sufficient to account for this bias\nof the American government, without having recourse to the supposition of French bribery, which is employed by some in the solution of the problem. This account of the matter I am inclined wholly to disregard: not only, because direct bribery, according to the remark of Mr Hume, is much less frequent among public men, than the vulgar are apt to imagine; but because, from the peculiar nature of the American constitution, the bribery of its public functionaries may be pronounced to be nearly, if not wholly impossible, and beyond the means of the great Napoleon himself. In the United States, no one individual has so much influence as to render the bribing him of much consequence; and of course, if bribery is made use of at all, it must be practised among so great a number of persons, and conducted on so systematic a plan, as would evince a profligacy of sentiment and deprivation of principle, which we cannot suppose to exist in any numerous body of men whatever. The sweets of power and emolument are sufficient bribes to induce\nthe rulers of America to persevere in the line of conduct, they for some years past have followed; and I conscientiously believe, that these are all the bribes they receive.\n\nFrom whatever causes the Anti-Anglican spirit of the American government may be thought to proceed, none will deny that it has lately manifested itself in conduct towards this country, which is sufficient to justify the most hostile feelings, on the part of the British government. In mitigation, however, of these feelings, I here beg leave to state two observations, which appear to flow as corollaries from the doctrine, which it has been the humble aim of these letters to unfold, and which may therefore, in part, have been anticipated by the preceding observations.\n\nThe first is, that the Anti-Anglican spirit of the American government seems to proceed in a very great degree, if not entirely, from causes that are internal, operating within the United States, and having no reference to the conduct\n\n* Renewal of the Non-intercourse, affair of the Little Belt, and equipment of French privateers in American ports,\nor character of the British government, or British nation. With the exception of one or two, the numerous causes, above stated, are all of this description. The mutual rivalry and hatred of the two factions, the superior adaptation of French politics to the views and dispositions of a turbulent democracy, the English connections and partialities of the federalists, the jealousies that subsist between the different sections of the Union, the peculiarities of the American constitution, and personal characters of the leading men,—all these are internal causes, or at least causes, whose operation is independent of the conduct or character of Great Britain. Indeed, of all the causes above enumerated, there are only three, that have any reference to Great Britain. These are the animosities left by the revolutionary war, the efforts of discontented emigrants from this country, and the naval pre-eminence of Great Britain. The first of these causes has undoubtedly some influence in America, but an influence that is always diminishing. As to the second; it is better, that united Irishmen, and other discontented emigrants, should discharge\ntheir venom on the other side of the Atlantic, than in the bosom of their own country; and as to the third, it seems entitled to even less regard, than either of the other two. The power and pre-eminence of our country, particularly in a naval point of view, excite the envy and malignity of the democratic party in America; and it therefore serves the purposes of the leaders of that faction, to manifest hostility towards us. But this power and pre-eminence ought only to induce us to regard, with calm indignation and silent contempt, the puny hostility it engenders.\n\nI repeat, therefore, that the antipathy of the American government to this country arises from causes, that are almost wholly internal, that cannot be understood without some knowledge of the domestic circumstances of the United States, and that have no reference to this country, farther than as the present situation of this country, in respect to France, happens to suit the views of their selfish demagogues, and the purposes of their paltry politics. The antipathy in question proceeds from the struggles and\nconvulsions of a turbulent and ferocious democracy, from the contentions incident to a people who are ruled by universal suffrage and elective magistracy, from the animosities of conflicting parties, who hate each other, much more, than any of them hates us, and whose expression of hatred to us is, in fact, the expression of hatred and hostility to each other. Any direct injuries, therefore, that may proceed from this hostility, are scarcely more to be regarded, than a blow, which we accidentally receive from a madman in his ravings, or from a person, who is labouring under a fit of the epilepsy.\n\nThe second observation, that here occurs to be made, is, that the very violence of the present government of America, is a convincing proof of its weakness. It has already been stated, that the constant terror in which the republican party is kept, by the pressure of federal influence and activity, adds much to its bitterness and its zeal. Were it more firmly established than it in reality is, it would pursue its course with more calmness, moderation, and dignity:\nit would act more from patriotic and disinterested views; it would act less from mere pique, malice, and resentment. The very violence, therefore, of the republican party in America is a satisfactory proof of its weakness; and, from this and various other considerations, it is evident, that the hostility of the American government is less to be regarded, than that of any other government on the face of the earth. The violence of the French party in the United States is, in fact, the best evidence of the strength of the English party; the best evidence, that there still exists in that country, a powerful and enlightened party, attached, from sound views and liberal sentiments, to the land of their forefathers, uninfluenced by blind passions and sordid interests, and possessed of sufficient weight, to prevent an interested faction, from carrying into practice their destructive principles, or executing their audacious threats.\n\nOf the various causes, that have been assigned, for the remarkable bias, lately manifested by the American government, you will easily perceive, that I consider the institution of universal\nsuffrage, as one of the most deserving of notice; or rather, that almost all the causes, that have been assigned, presuppose the existence of, and owe their efficiency to, this institution. This, it appears to me, is almost the *origo mali*; this is the circumstance, that gives life and vigour, and energy, to all the causes I have attempted to explain. And hence, my dear Friend, may chiefly be accounted for, what always seems to persons on this side of the Atlantic, so incomprehensible a paradox, that the Americans, a nation of freemen, should entertain so strong a predilection for France, which is a land of tyranny, and so strong a dislike to England, which is a land of freedom: not to mention, that England is the only country, which now preserves the remains of the civilized world, and America herself, from the overwhelming domination of France. Whoever reflects, for a moment, on the composition of the republican party in America, and on the uniform tendency of universal suffrage, to which it owes its existence, will cease to wonder at this seemingly unnatural propensity. The republican party, in\nthe United States, consists of a populace, who are governed by their passions, and of leaders, who are ruled by their interests; the passions of the populace are violent and headstrong, and the interest of the rulers is to flatter these passions. The policy, adopted by such a party, must necessarily be a coarse, illiberal, and headstrong policy. It must be a policy suited to the profanum vulgus; to the views and capacities of a rude, illiterate, and ferocious populace. Such exactly is the policy of the republican faction in America. Those sentiments of respect and admiration, which the bare mention of the English name ought, at the present moment, to excite in the heart, not only of every American, but of every human being, whose heart is rightly constituted, the federalists alone are susceptible of. That highly estimable body glory in their descent from a land of freemen. They entertain and express for England, the consideration to which she is so well entitled, not only from her being, at present, the bulwark of the civilized world, and the asylum of oppressed humanity; but, in a more peculiar degree, from her having so\nlong been the nurse of true religion, of genuine liberty, of sound literature; and as having furnished the model of that free government, and of those equal laws, which constitute the proudest distinction of the American commonwealth.*\n\nVery different are the views and sentiments of the republican party. They are formed of materials too gross to be gratified with the idea of their English extraction. They can see little difference between a nation that is ruled by a king, and one that is governed by an emperor: a great part of them probably do not know, that the government of England is better than that of France, or that the views of France are more hostile than those of England to the peace and the welfare of mankind. With sullen and brutish resentment they treasure up the miseries and animosities of the revolutionary war; they vilify England, because the federalists express respect and esteem for her character; they pass over the injuries they receive from France, because, if they were at war with that country, they have scarcely any means of coming into\ncontact with her, in consequence of the protection they receive from her rival; they are encouraged and supported in their Anti-Anglican measures, by the exhortations and example of discontented Irish, and other foreigners; their zeal is inflamed and exasperated by the unremitting efforts of their leaders, and by the vigorous opposition of the federal party; and thus it happens, that, in a republican country, the republican and ruling party is hostile to this land of freedom, and attached to a nation of slaves.\n\nAfter the most mature and deliberate consideration I have been able to give to the subject, I am come to be satisfied, that, in spite of this apparent hostility, the American government* has not, and never had, any serious intention or wish to go to war with this country. It suits their purposes to threaten a war with England; but they must know how greatly they would overshoot the mark, were they to attempt to put these threats in execution. None will be inclined to controvert this doctrine, who considers, for a moment, the dreadful and inevitable\n\n* See note K.\ncalamities, which a war with Great Britain would inflict on America. The annihilation of her commerce and navy, the destruction of her seaports, the dismemberment of her union, and a bloody civil war,* are the bitter fruits which, in all likelihood, she would reap in this ruinous undertaking. There is another consequence, likely to result to America, from a war with this country, which we would consider as an advantage, but which would be regarded by her present rulers, in a very different point of view,—I mean a change of administration. The first effect of a war would be the destruction of American commerce; the destruction of commerce necessarily involves the destruction of the revenue, for the revenue of the United States arises almost entirely from the customs: in order to carry on the war, therefore, as well as the ordinary business of government, loans must be resorted to, and direct taxes imposed.† But direct taxes would be felt as an\n\n* See note L.\n† The federal constitution contains a general clause empowering Congress to lay and collect taxes, duties, and imposts; but it is understood, that in practice, this clause is to be\nintolerable burthen by the people of America; they would speedily remove the present administration, in order to restore peace and commerce to their country; and thus the American rulers would fall the first victims to what has been believed by many, to be their favourite measure. Unless, therefore, we suppose the government of America to be destitute not only of all principle and patriotism, but even of common understanding, and common regard to their own interest, we cannot suppose them to be serious in their wish for a British war.\n\nThat there is, however, a number of persons in America, who are sincerely desirous of a war with this country, there can, unfortunately, be no doubt. To this class belong all the united\n\nconstrued as extending to little more than the customs, and that the imposition of direct and internal taxes forms no part of the proper business of Congress. If the general government of America have any concern for the preservation of their own authority, or the continuance of their own party in power, they will be cautious of acting on the strict letter of this clause of the constitution. The attempt to impose taxes was the cause of the separation of America from England; and the attempt to impose taxes was also one cause of the downfall of the federal party. It is likely that the same effects should again result from the same causes.\nIrishmen, and other discontented foreigners. Such is the blind hatred of these persons to the British government, that they would gladly see America at war with it, for the sake of the little injury, which might result to England, however destructive such war might prove to the interests of their adopted country. There is also a description of persons in America, both natives and foreigners, who are desirous of war, for the very reason, that it would probably give rise to some intestine convulsion. Having nothing to lose, they entertain no apprehensions from any confusion that a war would occasion; and even perhaps anticipate plunder in the general wreck, that might overspread the country. Though the number of persons of this description ought, from the circumstances in which she is placed, to be smaller in America, than in any other country whatever, I have reason to believe that, even there, their number is not inconsiderable. It is to be hoped, however, that the influence of the wise and good will always be sufficient to frustrate the nefarious schemes of such desperadoes.\nOf all the effects, that would result to America from a British war, the only one, that would be advantageous to Great Britain, is a change in the American administration. All the others would constitute evils, which would be hardly less prejudicial to this country, than to that which they immediately affected. Whatever retards the prosperity of America, must hurt the prosperity of England; because America must, for many years, form a great and increasing outlet for the manufactures of the mother country. It cannot be disputed, that a separation of the Union, with the wars and disasters which would probably accompany it, would check the growth of the American states; and whatever partial benefits might arise to this country, from the alliance of any one of the confederacies, into which the Union might be divided, it seems undeniable, that the very act of disunion would be a positive evil to Britain. Neither is it to be overlooked, that the miseries of a British war, and those of the civil war, which would probably follow, would be most severely felt by that portion of the American people, which is friendly to the Bri-\ntish nation. The federalists compose a most numerous and respectable body, who have opposed, with all their influence, the baneful policy, which their government has been lately pursuing. A regard for their interest ought to serve as one motive, at least, to induce the British government to abstain from hostilities with America; because it is on them, that the evils of these hostilities would fall with the heaviest pressure. They are, generally speaking, the people of property, of education, of family; and it is persons of this description, who suffer most severely in civil broils. America is the only free nation, besides our own, now remaining in the world. She has hitherto advanced in the career of improvement with unexampled rapidity; and if her progress is not prematurely checked, she seems destined to arrive at a height of greatness to which no nation has hitherto attained, and which will reflect immortal honour on her British origin.* The unnatural dis-\n\n* \"To the admirers of the fulness and majesty of the English language, it may be consolatory to reflect, that while French arms, and the French tongue, are pervading every\nmemberment of such a country, with its concomitant evils of civil wars and sanguinary revolutions, would present a spectacle which it would be shocking to humanity to behold, and disgraceful for any country, without the most urgent necessity, to have contributed to produce.\n\nSuch of the Americans, as really and anxiously wish for a war with this country, would be well pleased to see it begun, provided the odium of it could be thrown on the British government. They are afraid to strike the first blow; but if England could be provoked to do\n\nsection of Europe,—there is, on the other side of the Atlantic, a nation capable of preserving and transmitting it to future generations. Supposing the French to supersede all others in Europe, yet, a century hence, the English will be spoken by the greatest numbers.\"—Inchiquin's Letters, p. 105. A work published at New York, in 1810.\n\n\"Like the vast wastes, that were kept as a frontier by the ancient Gauls, the Atlantic ocean forms a perpetual natural protection of America from the invasions of Europe; a barrier sufficient in itself at present, while the only power that could become an invader is unable to keep the sea, which is ruled by a power unable to invade. At no distant day, the stationary strength of Europe may be counterpoised by the increased strength of America; and the current of irruption, which for so many thousand years has proceeded from east to west, having reached the limits of its action, may recoil, and trace back its steps from the populous and mighty West, to the reduced and prostrate East.\"—Ibid. p. 162.\nso, they would enter on the war with alacrity, knowing, that during its progress they would be able to mortify, and perhaps to take still more substantial revenge, on their political opponents. They would also cherish the expectation, that, by the operation of hostilities, the breach between the countries would be irreparably widened, and, at the same time, so much discredit thrown on the English party, that it would never afterwards be able to give them any serious annoyance. The democratic party, however, powerful as it is, is not yet strong enough to undertake the tremendous responsibility, of being the aggressors in a war with England.\n\nIf ever the Americans do declare war against Great Britain, it will probably be at a time, when their internal dissensions have arrived at such a height, and when the jealousies and quarrels, between the northern and southern sections of the Union, have so nearly approached to open hostilities, that each party is only waiting for a pretence to declare war against the other. In such a case, the proclamation of\nwar against Britain will be the signal of civil contention: it will be the consummation and the issue of those political disputes, which have hitherto nourished and been nourished, by the sentiment of hatred to England: and the same measure, that has already introduced one revolution in America, may probably be the precursor of another. When this period arrives, (and I hope and trust it is yet far, very distant,) it will be for the wisdom of the British government, to adopt such measures, as the exigency of the case may require; and, while they watch the natural, though premature dissolution of the American empire, to direct their own amity, and their own hostility, in such a manner, as may best promote the aggrandisement of that fragment of the Union, which embraces the alliance of England. At present, it is evidently the policy of England to practise the utmost forbearance towards America: to conciliate her favour by every means short of an abandonment of the maritime rights of Britain; to disregard the self-interested and unsteady proceedings of the narrow-minded rulers of a\nfactious republic; and, so long as war is not actually declared, to cultivate the spirit, and preserve the appearances, of peace and amity. By persevering in this line of conduct, we shall teach the people of America, that we are more attentive to their interests, than their own government are; and may possibly contribute, in no inconsiderable degree, to the rise of the federal, and depression of the French party. The policy here recommended, however ungrateful it may be to our passions and prejudices, is certainly that, which our interests dictate: and it affords me very sincere pleasure to observe, that this is actually the policy, which his Majesty's ministers seem at present determined to pursue.\nPOSTSCRIPT.\n\nIn the foregoing pages, the author has purpose-\nly abstained from any discussion of the points,\nimmediately in dispute, between the British and\nAmerican governments; because these have\nbeen discussed, with much greater ability than\nhe can pretend to, by persons, whose travels\nhave never extended beyond the limits of Eu-\nrope; and the author's sole object was, to lay\nbefore the public such information, as only a\npersonal acquaintance with the United States\ncould afford the means of acquiring. His ob-\nject has been to show, that there exists in the\nAmerican government, a pre-determined hostility towards this country, independent of any measures which the British government may pursue; and if, by laying open those peculiar circumstances, in the situation of America, which may be said, in a manner, to compel her involuntarily to dislike England, and of course to be partial to France, he shall, in any degree, be successful in removing the prejudices so generally entertained on this subject, or lessening the desire for war, which seems to be fast gaining ground, his purposes will be fully accomplished, and his labour amply rewarded.\n\nThe affair of the Chesapeake has been settled, in a manner equally creditable to the candour and liberality of the British government; and the affair of the Little Belt, it is to be hoped, will be brought to an equally satisfactory termination. The Orders in Council (the grand source of dispute between the countries,) are a field too extensive to be entered on at present; but the author may be permitted, in one word, to observe, that the whole conduct of the British government, in relation to these Orders,\nseems to have been strictly conformable, not only to the principles of sound policy, but to the laws of nations, as necessarily modified by the unprecedented circumstances of modern times.* A neutral trade is a trade, that, (however it may be fortified and regulated by treaties) certainly owes its original existence to the toleration of belligerents; a trade suffered to proceed in time of war, because it mitigates the calamities of war, and is subservient, not only to the profit of the neutral trader, but to the accommodation of both belligerents. The convenience of the belligerents is, however, the primary object of this species of traffic; the profit of the trader is only a secondary consideration. Neutral trade, therefore, can only be carried on, under such regulations, as the belligerents choose to impose; and if the belligerents find, that it is not essential to their accommodation; or if, for the sake of annoying each other, or from any other motive whatever, they wish to suspend it, it follows, from the very definition of neutral trade, that they have a right to do so. The whole body of\n\n* See note M.\nFrench Decrees and British Orders in Council, taken as a system, may be regarded as a sort of tacit agreement, between France and England, that neutral trade shall no longer be carried on. The British government was at first justified in issuing the Orders in Council, by the conduct of the French government in issuing their Decrees; and until satisfactory evidence is produced, that the Decrees are really and bona fide rescinded, the Orders ought certainly to be continued in force. It would even seem, that, under the very peculiar circumstances of modern times, a broader view of the right of the British government to issue these Orders may be taken, than what results from the principle of retaliation; and that, though the French Decrees had never existed, the British Cabinet would have had a good right to issue the Orders in Council, on finding, that the Americans carried on, in fact, the whole trade of France, (the whole at least that France was unable to carry on for herself,) and deprived England of almost all the advantages, which, in regard to the annoyance of her enemy, she was entitled\nto derive from her naval supremacy. In all former wars, the naval power of the contending parties has been pretty equally balanced, and the rules, prescribed for the regulation of neutrals, have been promulgated by the joint authority of all the belligerents. In this war, however, there is but one belligerent, that appears on the ocean: the powers and prerogatives, that used to be divided among several, have been absorbed, by the resources and valour of the nation, that rules the seas. By the laws, therefore, of nature and nations, as well as by the principles of common sense, this predominant power must have a right to enact laws for the regulation of its own element, and to confine the trade of neutrals, within such bounds, as its own rights and interests require to be drawn.\n\nThe diminution of neutral trade, necessarily occasioned by this just exercise of the maritime rights of Britain, is at present made use of by the American rulers, as a convenient handle to inflame the populace against England; and they even seem to be holding out the extraordinary proposal of vindicating, what they call their\nneutral rights, by force of arms.* This scheme, if seriously entertained, will be no less abortive in execution, than it is absurd in theory. An armed neutral is a contradiction in terms. When a nation arms for the purpose of asserting neutral rights, it ceases to be a neutral; and America may rest assured, that the cause of neutrality will never be promoted, by her assuming the character of a belligerent. At present, she has it in her power to enjoy the whole of that large and valuable branch of trade, which she has hitherto been accustomed to carry on with the British dominions. If she goes to war for the purpose of asserting her neutral rights, she will lose the trade of Britain, without recovering that of France. Her commerce will be swept from the ocean; and, at the end of the war, neutral rights will be found in exactly the same situation, in which they stood at the beginning.\n\nThe preceding Letters were in the press, before the arrival of the last accounts from America, announcing, that the hostile resolutions of\n\n* See note N.\nthe Committee of Foreign Relations had been passed, by a large majority, in the House of Representatives. This intelligence has been considered as bearing a very warlike aspect; but the fact is, that there is scarcely any thing in it, to induce an opinion, that war is more likely, at present, than it has been for a considerable time past. The resolutions are little more violent, than have resounded through the United States, on the meeting, not only of the House of Representatives, but of every legislative body, for the last three or four years; and the threat of war is now clamorously renewed; partly with the view of intimidating the British Cabinet; but chiefly for the purpose of impressing on the people of the United States, and particularly on the democratic party, a deep sense of the vigour and energy of the government; and thereby securing the re-election of Mr Madison to the office of president.* The member, who brings up the Report to the House, explicitly admits, that America is not yet in such a situation, as would justify her\n\n* See Appendix, No. III.\nputting herself in the attitude of war; and he might have added, that many years must elapse, before this attitude can be safely assumed by her.*\n\nThe two chief inducements to a war with this country, held out by Mr Porter, in regard to the means of annoyance, possessed by America, are, that she would be able to harass the British trade, particularly in the West Indies; and also, that she would be able to conquer Canada. The first of these temptations to war is too ridiculous to require any comment; and as to the second, even admitting that America has the means of subduing Canada, it is certain that she would suffer a much greater misfortune, in the acquisition of this province, than Great Britain would sustain, from the loss of it. The Canadians are by no means a people well calculated to form a constituent member of a republican confederation: and besides, the territory of the United States being at present too extensive, the addition of the immense province of Ca-\n\n* See note O.\nnada would only increase the already imminent danger of disunion. The conquest of Canada, in 1763, was one of the immediate causes of the revolution of 1775. As soon as they were relieved from the pressure of an enemy on their frontier, the colonists began to quarrel with the mother country; and should the United States be now relieved from the salutary neighbourhood of a foreign power, they would speedily begin to quarrel among themselves. The unwieldy mass, when no longer cemented by any external influence, would fall asunder by its own weight; and the conquest of Canada would thus have been the immediate forerunner of two of the most remarkable events, in the history of the western world.\n\nIn another point of view, the acquisition of Canada would be an incalculable mischief to the United States. It would open a door by which the French would get access to America; and would, of course, be the forerunner of all the evils that have uniformly followed in the track of French usurpation. The partiality borne by the Canadians to France is well known. Ca-\nnada was originally a French province; it was conquered from France; and its inhabitants are not yet divested of the feelings and resentments of a conquered people. The honour of living under a free government, and the blessing of a representative constitution, have not entirely reconciled them to the British dominion. That devoted and insurmountable attachment to his own country and his own countrymen, which forms almost the only good characteristic of the French nation, and adheres to the native and the descendant of France, in all situations and under all vicissitudes of fortune, is a prominent feature in the Canadian character. The inhabitants of Canada have a strong affection for the land of their forefathers; they exult in the successes of France, and are dazzled by the military renown of her present ruler. So prevalent is this sentiment, that a traveller meets with a Napoleon in almost every French family in Canada. The necessity of guarding a people animated by such sentiments, against all intercourse with Frenchmen, is felt and acted on by the British government; and no Frenchman is, on any account, permit-\nted to enter the province of Canada. Is it not obvious, that if Canada were taken possession of by the Americans, the case would be totally altered; and that the impassable barrier which at present protects that province, not only against French invasion, but against French intrigue, would be totally removed? The instant that Canada fell into the hands of the Americans, France would consider it as her own prize: the ruthless usurper would hail the event as the first step towards the extension of his dominion over the new world; and would smile at the infatuation of a people who were so essentially serving him at the expense of their own ruin. French emissaries would be immediately dispatched to Canada; a French squadron, carrying a French army, might possibly find its way across the Atlantic; and the Canadians, who dislike the Americans still more than the British, would flock to those favourite banners, which, after being invisible for 40 years, were again floating in the western hemisphere. Canada, in short if conquered by the Americans, would speedily fall into the hands of the French; and\neven admitting that the Americans were able again to wrest it from their perfidious allies, the result would be, that they had embarked in one bloody contest to conquer, and in another bloody contest to reconquer a province, of which the possession, in any circumstances, would be rather hurtful than beneficial to their interests; and of which the possession at present by the British government, is the only means of preventing the French from getting a footing on the continent of America, and repeating in the new world, that scene of usurpation, devastation, and bloodshed, which is not yet concluded in the old. Those Americans who are serious in wishing for a war with Britain, and thirst for the conquest of Canada, seem little to consider what a curse the triumph of their arms in this mad undertaking, would necessarily prove, not only to themselves but to the world at large. The immense importance of Canada, in this point of view, even to the interests of Britain, must be obvious to every one who bestows a moment's consideration on the subject. It ought, in fact, to be regarded as one of the most precious jewels of the British crown.\nThe only particular, in which the intelligence, last received from America, is more alarming, than what has preceded it, is the very large majority, by which the hostile resolutions have been carried through the House of Representatives. This, however, is satisfactorily enough accounted for by the report, now prevalent, that the minority in Congress have resorted to the desperate expedient of supporting, instead of opposing, all the measures of government; in the hope, that their violence may plunge the country into some difficulty, that may produce a change of administration. After a long and severe struggle, finding all their efforts to resist the baneful policy pursued by the government, only attended by fresh disappointments and defeats, the federalists, it is said, have determined to try the experiment, of giving, for a time, full scope to the violence of the government, and thus affording the people an opportunity of feeling the evils, which they are unable or unwilling to foresee, must infallibly result from the policy of their present rulers. If this account is true, some great event may be\nconsidered as at hand. A change of the American administration would be one of the most fortunate events, that could happen, both for America and England. But if this consequence failed to result from the concurrence of the federalists in the hostile measures of government, there is much danger, that a declaration of war would be followed by a dismemberment of the Union.\n\n15th April, 1812.\nWe have been given a mission to transform the world through our collective consciousness.\n\nSo let us share our visions and dreams.\n\nSo let us share our hopes and aspirations.\n\nSo let us share our possibilities and potentialities.\n\nSo let us share our hearts and souls.\nAPPENDIX, No. I.\n\nCONSTITUTION OF THE UNITED STATES.\n\n[To prevent this pamphlet from swelling to too great a bulk, a few of the less important articles of the constitution are omitted.]\n\nWe, the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquillity, provide for the common defence, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this constitution for the United States of America.\n\nARTICLE I.\n\nSection 1.—All legislative powers herein granted shall be vested in a Congress of the United States, which shall consist of a senate and house of representatives.\n\nSect. 2.—The house of representatives shall be composed of members chosen every second year by the people of the several states; and the electors in each\nstate shall have the qualifications requisite for electors of the most numerous branch of the state legislature.\n\nNo person shall be a representative who shall not have attained to the age of twenty-five years, and been seven years a citizen of the United States; and who shall not, when elected, be an inhabitant of that state in which he shall be chosen.\n\nRepresentatives, and direct taxes, shall be apportioned among the several states which may be included within this union, according to their respective numbers, which shall be determined by adding to the whole number of free persons, including those bound to service for a term of years, and excluding Indians not taxed, three-fifths of all other persons. The actual enumeration shall be made within three years after the first meeting of the Congress of the United States, and within every subsequent term of ten years, in such a manner as they shall by law direct. The number of representatives shall not exceed one for every thirty thousand, but each state shall have at least one representative; and until such enumeration shall be made, the state of New Hampshire shall be entitled to choose three, Massachusetts eight, &c.\n\nThe house of representatives shall choose their speaker, and other officers, and shall have the sole power of impeachment.\n\nSect. 3.—The Senate of the United States shall be composed of two senators from each state, chosen by the legislature thereof, for six years; and each senator shall have one vote.\n\nNo person shall be a senator who shall not have attained to the age of thirty years, and been nine years a citizen of the United States; and who shall not, when elect-\ned, be an inhabitant of the state for which he shall be chosen.\n\nThe vice-president of the United States shall be president of the senate, but shall have no vote unless they shall be equally divided.\n\nThe senate shall have the sole power to try all impeachments. When sitting for that purpose, they shall be on oath or affirmation. When the president of the United States is tried, the chief justice shall preside; and no person shall be convicted without the concurrence of two-thirds of the members present.\n\nSect. 4.—The times, place, and manner of holding election for senators and representatives shall be prescribed in each state by the legislature thereof; but the Congress may at any time, by law, make or alter such regulations, except as to the place of choosing senators.\n\nSect. 5.—Each house shall be the judge of the elections, returns, and qualifications of its own members, and a majority of each shall constitute a quorum to do business.\n\nSect. 6.—The senators and representatives shall receive a compensation for their services to be ascertained by law, and paid out of the treasury of the United States.\n\nNo senator or representative shall, during the time for which he was elected, be appointed to any civil office under the authority of the United States, which shall have been created, or the emoluments whereof shall have been increased during such time; and no person holding any office under the United States shall be a member of either house during his continuance in office.\n\nSect. 7.—All bills for raising revenue shall originate\nin the house of representatives; but the senate may propose or concur with amendments, as on other bills.\n\nEvery bill which shall have passed in the house of representatives and the senate, shall, before it becomes a law, be presented to the president of the United States; and if he approve, he shall sign it, but if not, he shall return it, with his objections, to that house in which it originated, who shall enter the objections at large on their journal, and proceed to reconsider it. If, after such reconsideration, two-thirds of that house shall agree to pass the bill; it shall be sent, together with the objections, to the other house, by which it shall also be reconsidered; and, if approved by two-thirds of that house, it shall become a law. But in all such cases, the votes of both houses shall be determined by yeas and nays, and the names of the persons voting for and against the bill shall be entered on the journal of each house respectively. If any bill shall not be returned by the president within ten days, Sundays excepted, after it shall have been presented to him, the same shall be a law, in like manner as if he had signed it, unless the Congress, by their adjournment, prevent its return, in which case it shall not be a law.\n\nSect. 8.—The Congress shall have power to lay and collect taxes, duties, imposts, and excises; to pay the debts, and provide for the common defence and general welfare of the United States; but all duties, imposts, and excises, shall be uniform throughout the United States;\n\nTo borrow money on the credit of the United States;\n\nTo regulate commerce with foreign nations, and among the several states, and with the Indian tribes;\n\nTo establish the uniform rule of naturalization, and uni-\nform laws on the subject of bankruptcies throughout the United States;\nTo coin money, regulate the value thereof and of foreign coin; and fix the standard of weights and measures, &c.\n\nNo title of nobility shall be granted by the United States; and no person holding any office of profit or trust under them, shall, without the consent of Congress, accept of any present, emolument, office, or title, of any kind whatever, from any king, prince, or foreign state.\n\nARTICLE II.\n\nSect. 1.—The executive power shall be vested in a president of the United States of America; he shall hold his office during the term of four years, and, together with the vice-president, chosen for the same term, be elected as follows:\n\nEach state shall appoint, in such manner as the legislature thereof may direct, a number of electors, equal to the whole number of senators and representatives to which the state may be entitled in the Congress; but no senator or representative, or person holding an office of trust or profit under the United States, shall be appointed elector.\n\nThe electors shall meet in their respective states, and vote, by ballot, for two persons, of whom one at least shall not be an inhabitant of the same state with themselves. And they shall make a list of all persons voted for, and the number of votes for each; which list they shall sign, certify, and transmit, sealed, to the seat of government of the United States, directed to the president of the senate. The president of the senate shall, in the presence of the senate, and house of representa-\ntives, open all the certificates, and the votes shall then be counted.\n\nThe person having the greatest number of votes shall be the president, if such a number be a majority of electors appointed; and if there be more than one who have such majority, and have an equal number of votes, then the house of representatives shall immediately choose, by ballot, one of them for president; and if no person have a majority, then, from the five highest on the list, the said house shall, in the like manner, choose the president. In every case, after the choice of the president, the person having the greatest number of votes of the electors, shall be the vice-president:* but if there should remain two or more who have equal votes, the senate shall choose from them, by ballot, the vice-president.\n\nThe president shall, at stated times, receive for his services a compensation, which shall neither be increased nor diminished during that period for which he shall have been elected, and he shall not receive within that period any other emolument from the United States, or any of them.†\n\nSect. 2.—The president shall be commander in chief of the army and navy of the United States, and of the militia of the several states, when called into the actual service of the United States; he may require the opinion, in writing, of the principal officer in each of the executive departments, upon any subject relating to the duties of their respective offices; and he shall have power to\n\n* This is now altered. The electors vote for president and vice-president separately.\n† The president's salary is at present 25,000 dollars per annum, about £6000 sterling.\ngrant reprieves and pardons for offences against the United States, except in cases of impeachment.\n\nHe shall have power, by and with the advice and consent of the senate, to make treaties, provided two-thirds of the senators present concur; and he shall nominate, and, by and with the advice and consent of the senate, shall appoint ambassadors, other public ministers and consuls, judges of the supreme court, and all other officers of the United States, whose appointments are not herein otherwise provided for, and which shall be established by law.\n\nSect. 3.—The president shall, from time to time, give to the Congress information of the state of the Union, and recommend to their consideration such measures as he shall judge necessary and expedient: he may, on extraordinary occasions, convene both houses, or either of them, and in case of disagreement between them, with respect to the time of adjournment, he may adjourn them to such time as he shall think proper; he shall receive ambassadors and other public ministers; he shall take care that the laws be faithfully executed, and shall commission all the officers of the United States.\n\nSect. 4.—The president, vice-president, and all civil officers of the United States, shall be removed from office on impeachment for and conviction of treason, bribery, or other high crimes and misdemeanors.\n\nARTICLE III.\n\nSect. 1.—The judicial power of the United States shall be vested in one supreme court, and in such inferior courts as the Congress may, from time to time, ordain and establish: The judges, both of the supreme and inferior courts, shall hold their offices during good\nbehaviour, and shall, at stated times, receive for their services a compensation, which shall not be diminished during their continuance in office.\n\nSect. 2.—The judicial power shall extend to all cases in law and equity, arising under this constitution, the laws of the United States, and treaties made, or which shall be made, under their authority; to all cases affecting ambassadors, other public ministers and consuls; to all cases of admiralty and maritime jurisdiction; to disputes, to which the United States shall be a party; to disputes between two or more states; between a state and citizens of another state; between citizens of the same state, claiming lands under grants of different states; and between a state, or the citizens thereof, and foreign states, citizens, or subjects.\n\nThe trials of all crimes, except in cases of impeachment, shall be by jury, and such trials shall be held in the state where the said crimes shall have been committed; but when not committed within any of the United States, the trials shall be at such place or places as the Congress may by law have directed.\n\nSect. 3.—Treason against the United States shall consist only in levying war against them, or in adhering to their enemies, giving them aid and comfort. No person shall be convicted of treason, unless on the testimony of two witnesses to the same overt act; or on confession in open court.\n\nThe Congress shall have power to declare the punishment of treason; but no attainder of treason shall work corruption of blood, or forfeiture, except during the life of the person attainted.\n\n* This is now altered. See Amendments to the Constitution.\nARTICLE IV.\n\nSect. 1.—Full faith and credit shall be given in each state to the public acts, records, and judicial proceedings of every other state. And the Congress may, by general laws, prescribe the manner in which such acts, records, and proceedings shall be proved, and the effect thereof.\n\nSect. 2.—The citizens of each state shall be entitled to all privileges and immunities of citizens in each of the several states.\n\nSect. 3.—New states may be admitted by the Congress into this union, but no new state shall be formed or erected within the jurisdiction of any other state; nor any state be formed by the junction of two or more states, or parts of states, without the consent of the legislatures of the states concerned, as well as of the Congress.\n\nSect. 4.—The United States shall guarantee to every state in this union, a republican form of government, and shall protect each of them against invasion; and on application of the legislature, or of the executive power, when the legislature cannot be convened, against domestic violence.\n\nARTICLE V.\n\nThe Congress, whenever two-thirds of both houses shall deem it necessary, shall propose amendments to this constitution, or on the application of the legislatures of two-thirds of the several states, shall call a convention for proposing amendments, which, in either case, shall be valid to all intents and purposes, as part of this constitution, when ratified by the legislatures of three-fourths of the several states, or by conventions of\nthree-fourths thereof, as the one or the other mode of ratification may be proposed by the Congress.\n\nARTICLE VI.\n\nAll debts contracted, and engagements entered into, before the adoption of this constitution, shall be as valid against the United States under this constitution, as under the confederation.\n\nThis constitution and the laws of the United States, which shall be made in pursuance thereof, and all treaties made, or which shall be made, under the authority of the United States, shall be the supreme law of the land, and the judges in every state shall be bound thereby, anything in the constitution, or law of any state, to the contrary notwithstanding.\n\nThe senators and representatives before mentioned, and the members of the several state legislatures, and all executive and judicial officers, both of the United States and of the several states, shall be bound, by oath or affirmation, to support this constitution; but no religious test shall ever be required as a qualification to any office or public trust under the United States.\n\nARTICLE VII.\n\nThe ratification of the convention of nine states shall be sufficient for the establishment of this constitution, between the states so ratifying the same.\n\nDone in the convention, by the unanimous consent of the states present, the 17th day of September, in the year of our Lord 1787, and of the independence of the United States of America the twelfth. In\nwitness whereof, we have hereunto subscribed our names.\n\nGeorge Washington, President, and Deputy of Virginia.\nJohn Langdon.\nNicholas Gilman, &c.\n\nAMENDMENTS TO THE FEDERAL CONSTITUTION.\n\nARTICLE I.\nCongress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof, or abridging the freedom of speech, or of the press, or the right of the people peaceably to assemble, and to petition the government for a redress of grievances.\n\nARTICLE II.\nA well-regulated militia being necessary to the security of a free state, the right of the people to keep and bear arms shall not be infringed.\n\nARTICLE III.\nNo soldier shall in time of peace be quartered in any house, without the consent of the owner, nor in time of war, but in a manner prescribed by law.\nARTICLE IV.\n\nThe right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no warrants shall issue but upon probable cause, supported by oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\n\nARTICLE V.\n\nNo person shall be held to answer for a capital, or otherwise infamous, crime, unless on a presentment or indictment of the grand jury, except in cases arising in the land or naval forces, or in the militia when in actual service in time of war or public danger; nor shall any person be subject, for the same offence, to be twice put in jeopardy of life or limb; nor shall be compelled, in any criminal case, to be witness against himself; nor be deprived of life, liberty, or property, without due process of law; nor shall private property be taken for public use without just compensation.\n\nARTICLE VI.\n\nIn all criminal prosecutions, the accused shall enjoy the right to a speedy and public trial; by an impartial jury of the state and district wherein the crime shall have been committed, which district shall have been previously ascertained by law, and to be informed of the nature and cause of the accusation, to be confronted with the witnesses against him; to have compulsory process for obtaining witnesses in his favour, and to have the assistance of counsel for his defence.\nARTICLE VII.\n\nIn suits at common law, when the value in controversy shall exceed twenty dollars, the right of trial by jury shall be preserved; and no fact tried by a jury shall be otherwise re-examined in any court of the United States than according to the rules of the common law.\n\nARTICLE VIII.\n\nExcessive bail shall not be required, nor excessive fines imposed, nor cruel nor unusual punishments inflicted.\n\nARTICLE IX.\n\nThe enumeration in the constitution of certain rights, shall not be construed to deny or disparage others retained by the people.\n\nARTICLE X.\n\nThe powers not delegated to the United States by the constitution, nor prohibited by it to the states, are reserved to the states respectively, or to the people.\n\nARTICLE XI.\n\nThe judicial power of the United States shall not be construed to extend to any suit in law or equity, commenced or prosecuted against one of the United States by citizens of another state, or by citizens or subjects of any foreign state.\n## UNITED STATES OF AMERICA.\n\n### Constitution Appointments and Duration of the State and United States' Authorities.\n\n| General Government | No. of Members | Election by | Representatives | General Remarks |\n|--------------------|---------------|------------|----------------|----------------|\n|                    |               |            |                |                |\n\n| No. of Senators | Election by | President | Senators | General Remarks |\n|-----------------|------------|-----------|----------|----------------|\n|                 |            |           |          |                |\n\n| No. of Voters | Election by | Population of each state | Persons | General Remarks |\n|---------------|------------|--------------------------|---------|----------------|\n|               |            |                          |         |                |\n\nThe legislature of each state.\n\n| Years to serve | Assembly | Election by | Years to serve | General Remarks |\n|---------------|----------|------------|---------------|----------------|\n|               |          |            |               |                |\n\n| Governors | Election by | Years to serve | General Remarks |\n|-----------|-------------|----------------|----------------|\n|           |             |                |                |\n\n| Date of Formation | Assembly | Election by | Years to serve | General Remarks |\n|-------------------|----------|------------|---------------|----------------|\n|                   |          |            |               |                |\n\n### STATE GOVERNMENTS.\n\n| States | Date of Formation | Assembly | Election by | Years to serve | General Remarks |\n|--------|-------------------|----------|------------|---------------|----------------|\n| New Hampshire | 1792 | Citizens paying taxes | 1 | | |\n| Massachusetts | 1780 | Citizens paying taxes | 1 | | |\n| Rhode Island | 1763 | Citizens | 1 | | |\n| Connecticut | 1782 | Citizens | 1 | | |\n| Vermont | 1786 | Citizens | 1 | | |\n| New Jersey | 1776 | Legislature | 1 | | |\n| Pennsylvania | 1790 | Citizens paying taxes | 1 | | |\n| Delaware | 1776 | Legislature | 1 | | |\n| Maryland | 1776 | Legislature | 1 | | |\n| Virginia | 1782 | Citizens | 1 | | |\n| Ohio | 1799 | Citizens | 1 | | |\n| Kentucky | 1796 | Citizens paying taxes | 1 | | |\n| Tennessee | 1776 | Legislature | 1 | | |\n| North Carolina | 1776 | Legislature | 1 | | |\n| South Carolina | 1790 | Legislature | 1 | | |\n| Georgia | 1789 | Legislature | 1 | | |\nREMARKS ON THE FOREGOING TABLE.\n\nBy the constitution of the United States, it was provided that there should be sent to the House of Representatives, not less than one member for every thirty thousand inhabitants throughout the union. It was found, however, that an adherence to this rule would render the House of Representatives too numerous, and the number of inhabitants sending one member to Congress has therefore been raised from thirty to thirty-three thousand. Such, however, has been the increase of population, that, in spite of the increase of the number of persons sending one member to Congress, the whole number of the House of Representatives has risen, since the establishment of the constitution, from about 120 to 181 members. At the next census, the numbers of the house will be still farther increased, although the number of persons for whom each member is returned will also be still further increased.\nAPPENDIX.—No. III.\n\nPOPULATION OF THE UNITED STATES,\n\nAccording to the Census taken in the Years 1790, 1800, and 1810.\n\n| States          | 1790   | 1800   | 1810   |\n|-----------------|--------|--------|--------|\n| Virginia        | 747,610| 886,149| 965,079|\n| New York        | 340,120| 586,050| 959,290|\n| Pennsylvania    | 434,373| 602,545| 810,163|\n| Massachusetts   | 378,787| 422,845| 472,040|\n| Maine           | 96,540 | 475,327| 151,719|\n| North Carolina  | 399,751| 478,105| 568,626|\n| South Carolina  | 249,075| 345,591| 414,935|\n| Kentucky        | 73,677 | 230,959| 406,511|\n| Maryland        | 319,728| 349,692| 390,646|\n| Connecticut     | 237,946| 251,002| 261,942|\n| Tennessee       | 105,602| 261,727|        |\n| Georgia         | 82,548 | 162,686| 295,439|\n| New Jersey      | 184,169| 211,149| 245,563|\n| Ohio            |        |        | 290,760|\n| Vermont         | 85,536 | 154,465| 217,913|\n| New Hampshire   | 141,885| 183,858| 214,414|\n| Rhode Island    | 68,825 | 69,122 | 76,991 |\n| Delaware        | 59,096 | 64,373 | 79,674 |\n\nTERRITORIAL GOVERNMENTS.\n\n| Orleans        |        |        | 76,556 |\n| Mississippi    |        |        | 40,358 |\n| Indiana        |        |        | 94,590 |\n| Columbia       |        |        | 94,029 |\n| Louisiana      |        |        | 20,845 |\n| Illinois       |        |        | 13,982 |\n| Michigan       |        |        | 4,769  |\n\nTotal, 5,303,661 Total, 7,238,421\nREMARKS ON THE FOREGOING TABLE.\n\nThe foregoing Table may suggest some curious observations on the rapidity with which population increases in America. It will be observed, that though the population of all the states has increased much between the years 1790 and 1810, the southern states have advanced faster than the northern, and the western states fastest of all. The increase of Kentucky in particular, would be almost incredible, were it not attested by unexceptionable documents. Dr Adam Smith, about the year 1776, stated, that the population of the United States doubled in 25 years. On reference to the foregoing Table, it will be found, that in the twenty years elapsing between 1790 and 1810, the population of Kentucky has nearly sextupled. In 1790, it was 73,677, and 1810, it was 406,511. It is fair to observe, however, that this unprecedented increase of Kentucky is to be ascribed not only to the rapid reproduction always occasioned by abundance of land, and unrestrained freedom, but also to the numerous and frequent emigrations which have taken place from the older and more fully peopled states, into that fertile and growing region. This, while it swells the population of Kentucky, lessens proportionably that of the other states.\n\nThe great towns have advanced with no less rapidity than the country at large. In the year 1756, New York had 10,881 inhabitants. In 1800, it had 60,489; and in 1810, it had 99,914, a number equal to the whole population of the state in 1756.\n\nIt will be observed, that in the foregoing Table, Virginia is placed at the head of the Union; her popula-\ntion having all along entitled her to that pre-eminence. New York, however, has been hastening to overtake her competitor; and it is understood, that in the course of next year, the population of New York will exceed that of Virginia. She will send, therefore, more members to Congress, and will henceforth be regarded as the leading state in the union.—(See App. No. II.) This circumstance, while it will increase the ill-will which the Virginians have always borne to the northern parts of the union, will favour the elevation of Mr De Witt Clinton to the presidential dignity. It is understood, that Mr Madison will be re-elected at the next election; but on the expiry of his second four years, it is thought likely, that the eastern and middle states will assert the right which their increasing population and wealth bestow on them to give a president to the United States. Of the four Presidents America has hitherto had, three have been Virginians, and one has been a native of New England. In the course of four or five years New York will, in every point of view, be well entitled to nominate a president of the United States; and Mr De Witt Clinton is already designated for that important office. This gentleman is nephew to the present vice-president of the United States; of a family that has great influence in the state of New York, and has always been attached to the republican party. Whatever, therefore, may be the sentiments of Mr Clinton with regard to Great Britain, it is likely, that in the exercise of the chief magistracy of the union, he would shew more regard to the interests of commerce than has been manifested by the Virginian oligarchy, that has so long swayed the councils of America.\nNOTES.\n\nNote A, Page 15.\n\nThis praise here bestowed on the federal constitution, is not inconsistent with the bad effects ascribed in a subsequent part of these Letters to the universal suffrage and total want of hereditary aristocracy, which are its distinguishing features. However great these defects may be considered in an abstract view, it is certain that no government, which could by any possibility have been established in the United States, would have been free from them. No government could have been established in that country, which was not founded on the basis of elective magistracy, and the almost universal diffusion of the elective franchise. It is understood that General Hamilton, who was a friend in the abstract to monarchical government, actually proposed a government founded upon that model in the convention of 1787; but the proposal was rejected, because the majority of the convention were satisfied that America did not possess the requisite materials either for a monarchy or for an aristocracy, which is the necessary attendant of a monarchy. Whatever may be the defects of the American constitution, it is undeniable that its purely republican form has contributed materially to the rapid growth of the American States. The effects imputed, in a subsequent part of these Letters, to its democratical nature, in favouring the introduction\nof an illiberal policy into the councils of America, and of excluding from these councils the leaders of that highly estimable body to which it owes its existence, are such as its founders probably did not foresee; and if they had foreseen, they could not possibly have prevented.\n\nDoctor Mason of New York, in the eloquent funeral oration which he delivered on the death of General Hamilton, thus characterizes the qualities which that great man desiderated in the federal constitution: \"Not such indeed as Hamilton wished, but such as he could obtain; and as the states would ratify, is the federal constitution. His ideas of a government, which should elevate the character, preserve the unity, and perpetuate the liberties of America, went beyond the provisions of that instrument. Accustomed to view men as they are, and to judge of what they will be from what they have ever been, he distrusted any political order which admits the baneful charity of supposing them to be what they ought to be. He knew how averse they are from even wholesome restraint; how obsequious to flattery; how easily deceived by misrepresentation; how partial, how vehement, how capricious. He knew that vanity, the love of distinction, is inseparable from man; that if it be not turned into a channel useful to the government, it will force a channel for itself; and if cut off from other egress, will issue in the most corrupt of all aristocracies,—the aristocracy of money. A system which he would have entirely approved, would probably keep in their places those little men who aspire to be great; would withdraw much fuel from the passions of the multitude; would diminish the materials which the worthless employ for their own aggrandizement; would crown peace at home with respectability abroad; but would never infringe the liberty of an honest man. Convinced that the natural tendency of things is to an encroachment by the States on the union; that their encroachments will be formidable as they augment their wealth and population; and consequently that the vigour of the general government will be impaired, in a very near proportion\n\nThe...\n\"with the increase of its difficulties; he anticipated the day\n\"when it should perish in the conflict of local interest and of\n\"local pride. The divine mercy grant that his prediction may\n\"not be verified!\n\n\"But whatever fears he entertained for the ultimate safety\n\"of the federal constitution, it is, in every respect, so prefer-\n\"able to the old confederation, and its rejection would have\n\"been so extremely hazardous, that he exerted all his talents\n\"influence in its support. In the papers signed Publius,\n\"(the Federalist, see note B,) which compress the experience\n\"of ages, and pour original light on the science of government,\n\"his genius has left a manual for the future statesman. And\n\"they will be read with deeper interest when it is considered\n\"that, eloquent and powerful as they are, they were written\n\"under the pressure of business, amidst the conversation of\n\"friends, and the interrogatories of clients.\n\n\"His voice co-operated with his pen. In the convention of\n\"this State, which met to deliberate on the federal constitution,\n\"he was always heard with awe, perhaps with conviction,\n\"though not always with success. But when the crisis arri-\n\"ved—when a vote was to determine whether New York was\n\"to retain or relinquish her place in the union; and preceding\n\"occurrences made it probable that she would choose the worst\n\"part of the alternative, Hamilton arose in redoubled strength:\n\"he argued, he remonstrated, he entreated, he warned, he\n\"painted, till apathy itself was moved, and the most relentless\n\"of human things, a pre-concerted majority, was staggered and\n\"broken. Truth was again victorious, and New York enrolled\n\"herself under the federal standard.\"\n\nNote B, Page 17.\n\nThe following quotation from the Edinburgh Review contains\na just eulogium on the Federalist:—\"The best account of this\nconstitution is to be found in a publication called the Fed-\neralist, written principally by the late General Hamilton,—a\nwork little known in Europe, but which exhibits an extent\n\"and precision of information, a profundity of research, and\n\"an acuteness of understanding, which would have done bo-\n\"nour to the most illustrious statesmen of antient or modern\n\"times.\"—Edinburgh Review, No. XXIV. Art. 13.\n\nNote C, Page 16.\n\nThe question regarding the efficacy and importance of the\nstate governments is one of the most curious and difficult con-\nnected with the internal politics of America. By one set of po-\nliticians the value of these sovereignties seems to have been as\nmuch over-rated as by another it has been decried. Those Ame-\nricans, who, during the time that the federal constitution was un-\nder the consideration of the states, affected to regard every power\nand privilege proposed to be transferred from the state sovereign-\nties to the general government, as an encroachment on public li-\nberty, certainly propagated erroneous doctrines. The federal\nconstitution could not be invested with powers sufficient to ena-\nble it to serve the purposes of a national government, but by\nstripping the state legislatures of a certain number of their func-\ntions. While they were divested however of all those functions\nthat are subservient to the administration of the foreign affairs of\nthe nation, they were left in undisturbed possession of all such\nprerogatives as are essential to the management of their own\ninternal concerns,—to the protection of the liberty, lives, and\nproperty of their citizens. The state governments, therefore,\nwere only deprived of those powers which could be better ex-\nercised by a general government than by themselves; and such\na transference of authority could be reprobated by none, but\nthose who were willing to sacrifice the interests of their coun-\ntry to their own present popularity.\n\nThose reasoners again seem to be equally in the wrong, who\nconsider the state governments as still possessed of too much\nstrength and efficacy, and as being little better than seminaries\nof sedition, which sooner or later will be the means of severing\nthe union. They would, therefore, abolish the state sovereign-\nties, and incorporate the whole American people into one na-\ntion and one name. This plan, however, seems to originate either in erroneous views of the subject, or ignorance of the local circumstances of the country. It well deserves consideration, whether in so extensive a continental nation as the United States, the union of all the powers of sovereignty in one central government, could terminate in anything else than despotism. After the lapse of a certain period at least, this would infallibly be the result. It would seem, therefore, that it is only in consequence of the salutary check formed by the state sovereignties on the general government, that the existence of a republican constitution, in so extensive a territory as that of America, can be rendered at all possible. In regard to the compatibility of a free government with a widely extended territory, America seems to derive the same advantages from the three circumstances of her remote situation, her thin population, and her federal constitution, which Great Britain enjoys from the single circumstance of her insular situation.\n\nThe author is humbly of opinion, that there is no inconsistency between what is here stated respecting the advantages of the federal form of the American government, and what is advanced in the second letter with regard to the inconveniencies of its federal form. He believes that the federal form of the American government, by which the functions of government are divided between the general and state sovereignties, is, in all the circumstances of the case, a wise and even a necessary arrangement; and from this wise and necessary arrangement, he also believes, and is not without hopes has induced his readers to believe, that the inconveniencies detailed in the second letter do actually result.\n\nNote Q, Page 54.\n\nDuring the first year of the embargo, the distresses occasioned by this commercial suicide were gradually undermining the democratic party in the northern parts of the union, and paving the way for the restoration of the federalists to power. The democrates were aware of this danger, and at the first elec-\ntion that occurred, after the imposition of the embargo, gave out among the electors, that the commercial restrictions under which the country then laboured were speedily to be removed. Nothing could be farther from the intentions of government; but the circulation of this report was, for the time, materially serviceable to their party.\n\nNote E, Page 63.\n\nIn the remarks on No. III. of the Appendix, the reader will find explained the ascendancy which Virginia has hitherto always maintained in the union, but which is henceforth likely to be the attribute of New York. The expansive power of the free and industrious population of the northern and middle states, is at last exerting its due influence; and the southern states will no longer enjoy that predominance which they have hitherto had, partly in consequence of the representation in Congress which the constitution permits them to have for their slaves.\n\nNote F, Page 69.\n\nAs a specimen of the language held by the democratic orators on the subject of Great Britain, the reader may take the following extract of a speech made by Mr Williams of North Carolina, in the debate that took place in the House of Representatives on the 21st of January, 1812, on the question respecting the increase of the naval establishment of the United States.\n\nMr Williams said, \"a navy was unnecessary. The existence of the nation depended no more on a naval establishment than on a system of air-balloon. We were born as a nation without a navy; we were triumphantly brought through the revolution without a navy; and had since risen to grandeur and acquired an unparalleled amount of mercantile tonnage and prosperity, without one; and he therefore inferred that we could now do without. A navy was unsafe; it had always deceived the best hopes of the best people on earth, who had depended on a navy for its protection and sup-\nport. When his learned colleague, (Mr Cheves,) than whom\nno man was better read, had alluded to the naval powers of\nVenice, Genoa, and Holland, he had forgotten Switzerland,\nwho had no navy, and who maintained her liberties and in-\ndependence for 200 years after Venice was destroyed. Na-\nvies had preserved no nation, England excepted; and it was\nimpossible that she could exist much longer. But,\" he said,\nthe naval force which this nation could raise, would not only\nbe unnecessary and unsafe, but inadequate to the purposes\nfor which it was wanted. Would you, sir, leave the land\nwhere you are omnipotent against your enemy, and launch\nforth into the ocean to seek disgrace and discomfiture? Great\nBritain had lying up in ordinary vessels enough to subdue the\nnavies of the whole world, or little force included. It gave\nhim pain to extol the resources of the enemy; but he could\nnot conceal the truth. He wished it were otherwise. He\nfelt for the sufferings which she had inflicted on his country.\nThey inspired him with a passion which he could too little\nconceal. Sir, I feel a deadly hate against Great Britain.\nYes, sir, if the red artillery of Heaven were in my hands, I'd\nsoon drive the fast-anchored isle from her moorings!\"\n\nIn another part of the same philippic, in allusion to England,\nthis orator observes, \"She is contending for the liberties of the\nworld! He would as soon have expected to hear that the de-\nvil had espoused the cause of Christianity! So far from fight-\ning for the liberties of the world, the standard of freedom had\nnever been raised in any country without her attempting to\npull it down. If it was not foreign to his purpose, he could\ntrace her footsteps wherever she moved, marked by blood\nand desolation,—all the miseries of war and revengeful mas-\nsacre have travelled in her train, into every region inhabited\nby man. For whose fell cupidity were so many human be-\ncatombs sacrificed in India? For whose more fell ambition\ndid she wage war on infancy and innocence in the west? For\nwhom does the savage yell now wake the sleep of the cradle?\nEngland! Indisputably, to extend and secure the blessings\nof liberty to the world!\"\nNote H, Page 93.\n\nAn anecdote, which was current at the time of the author's residence in America, may serve to illustrate this feature of Mr Jefferson's character. A noble and reverend English gentleman, at that time on a tour through the United States, was invited to dine at the president's table. On his entrance into the drawing-room; as soon as the customary salutations were over, Mr Jefferson thus addressed him: \"In the name of wonder, sir, what can your government mean by the outrages it is continually committing upon the American flag?\" Mr —— was at first not a little astonished, but immediately recollecting himself, answered: \"Mr Jefferson, in the first place I am a clergyman, and never discuss politics. In the second place, I am an Englishman, and cannot be well-pleased to hear my country spoken of with disrespect. In the third place, I am in your house, and have a right to be treated with civility.\" The president dropped the subject.\n\nNote I, Page 105.\n\nThe reader has already had a specimen of democratic eloquence in the speech of Mr Williams, (see Note F.) He will not now be displeased to have a specimen of federal doctrine in the following extract from the speech of Mr Randolph, on the report of the committee of foreign relations, delivered in the House of Representatives, on the 16th December, 1811.\n\n\"The gentleman from Maryland had expressed surprise at his (Mr Randolph's) manner of speaking of our origin from an English stock. Could that gentleman repose his head upon his pillow without returning thanks to God that he was descended from English parentage? Whence but from that origin came all the blessings of life, so far as political privileges are concerned? To what is it owing that we are at this moment deliberating under the forms of a free representative government? Suppose we had been colonies of any other European nation, compare our condition with that of the Spa-\nnish, Portuguese, or French settlements in America. To what was our superiority owing? To our Anglo-Saxon race.\n\nSuppose we had descended from those nations,—from the last especially, which stood self-condemned, on her own confession, as incapable of free government—hugging her chains, glorying in her shame, priding herself in the slave's last poor distinction, the splendour of her tyrant master.\"\n\nNote K. Page 106.\n\nThe term American Government is here used in its ordinary acceptation, as signifying the president and the two houses of Congress; and in this sense the author is satisfied that the doctrine advanced in the text is true, that the American government has no serious intention of going to war with this country. In a more restricted sense of the term however, and understanding the American government to mean the president and his confidential advisers, the proposition may be advanced with still greater confidence. It is now perfectly understood that Mr Madison, and at least two of the heads of departments, are decidedly adverse to the measure of war. These persons, however violent may be their party zeal, must survey the political horizon with rather a more calm and dispassionate eye, than the democratic majority of Congress; and must of course perceive the madness of such an undertaking. While it was proposed, therefore, by the violent partisans of war, that 25,000 men should be raised in contemplation of that measure, the president was clearly of opinion that only 10,000 should be voted,—a number sufficient for the ordinary service of government, but inadequate to the invasion of Canada.\n\nNote L. Page 107.\n\nIt may be thought incumbent on the author to state some special reasons in support of the opinion here hazarded, that a war with Great Britain would be apt to produce a civil war in America. Several reasons concur to shew the soundness of this opinion. In the first place, party spirit prevails in Ameri-\nca to a degree altogether unknown in Europe. Persons of opposite political sentiments are seldom known to mix in the ordinary intercourse of society; and quarrels and duels are the frequent issue of political altercations and disputes. It is impossible to conceive the indignation which would be excited in the minds of the federalists by the ruling party resorting to a principle so totally abhorrent to federal principles, and so ruinous to the country, as a war with England. In the second place, though the anti-federal party prevails in nearly all the states of the union, it is much stronger in the southern than in the northern states; and the country may therefore be considered as divided into two sections, of which one is hostile, and the other friendly, to England. A war with England might probably have the effect of tearing these sections asunder; and a civil war would probably be either the forerunner or the consequence of such a disjunction. Thirdly, the first effect of a war with Great Britain, would probably be the infliction of some dreadful calamity on the United States, which could not fail to excite commotions among the irritable populace of that country. The bombardment of their towns for instance, would inflame them with a degree of fury, which would be productive of very different effects, according to the different objects on which it might wreak itself; but which, in any event, would be the cause of some intestine convulsion. It is not improbable, that, like the populace of Holland on a similar occasion, they might at last upbraid their rulers as the sole authors of the calamities they were suffering; and inflict on them a severe and exemplary punishment for taking those very measures which they themselves had all along encouraged and enabled them to pursue. But it is at least equally probable, that their fury, taking an opposite direction, would vent itself on the federalists, who would be classed indiscriminately under the appellation of tories, and perhaps of traitors. To all these considerations may be added, that, during the author's residence in the country, it was matter of common remark and apprehension, that a war with England would probably be followed by some internal commotion.\nNote M. Page 118.\n\nMr. Shelby, an able, enlightened, and moderate member of Congress, (though not a federalist,) in a speech delivered on the 3d of January last, thus points out the true cause to which the present commercial embarrassments of the United States ought to be referred:—“Sir, I fear we have not been sufficiently attentive to the progress of events which have passed before our eyes,—events which have effected a radical change in the aspect of the civilized world. We have attributed the injuries and indignities which we have experienced to causes distinct from the true ones,—we have supposed, that to the abstract and individual injustice of the men who are the rulers of Great Britain and France, was to be traced all our evils; when, in fact, that injustice was the inevitable result of existing circumstances, and when the true sources lay much deeper. The present state of the European world is the primary cause from which those principles, that have so seriously affected our commerce, have received their origin. And to me it appears vain, to expect that our neutral rights will be respected, until the causes which have subverted every vulnerable principle, once a rule of conduct between nations, shall no longer exist. We may make arrangements with France for the revocation of her decrees, and with England for the revocation of her Orders in Council; but there will be no permanent security; we must participate in the evils (in some shape) which have fallen on the community of civilized man.”\n\nNote N. Page 121.\n\nThe following quotation from Mr. Shelby’s speech, places, in a striking point of view, the small importance of the object for which the Americans propose going to war with this country, as well as the immense importance of the trade which they would necessarily sacrifice by that war. “Sir, the nominal repeal of the Orders in Council is not your object, It is the substance.”\ntial commercial benefit, which you conceive will follow that\nact, that forms the essence of the controversy. The unmolested\ncommerce to France and her dependencies; is the boon for\nwhich you are going to war. This is the real object, disguise\nit as you will. And it is not the commerce which we formerly\nenjoyed (as gentlemen would seem to suppose) which is in\ncontroversy. Your export commerce to France now consists\nof our own products only, as appears by the letter of the\nFrench minister on your table. I say our own products, be-\ncause I suppose the privilege which has been graciously ex-\ntended to us of exporting other articles in certain cases, un-\nder French licences, will scarcely be insisted on as being any\nthing else but an indignity. The municipal regulations which\nhave been substituted for the Berlin decree, so far as respects\nthe practical effect, have destroyed by far the most profitable\nand important branch of our trade to the French empire,—\nwhich consisted in the product and manufactures of other\ncountries. Our merchants were in the habit of exporting to\nthe West Indies our flour, beef, pork, live stock, lumber, &c.,\nfor which they received, in return, the products of those\nislands. The surplus beyond the consumption of this coun-\ntry was exported to the continent of Europe, for which we\nreceived in return, French wines, brandies, silks, German\nlinens, and bills on London. Of so much more importance was\nthis export trade to us than that of our own products, that in\n1807, before the British Orders in Council existed, the do-\nmestic exports to France (including Belgium) amounted to\nabout two millions seven hundred thousand dollars only, while\nthe amount of exports to the same country, of foreign manu-\nfactures and products (chiefly colonial) was nearly ten mil-\nlions. In the same year the whole of our domestic exports\nto every part of the world, amounted to about forty-eight\nmillions and a half, of which the amount I have stated was\nexported to France, and about twenty-eight millions to Great\nBritain, and her possessions and dependencies in the four\nquarters of the globe. Since that time she has acquired the\nFrench West Indies, the Isles of France and Bourbon in the\nIndian Ocean, the Cape of Good Hope, the Dutch possessions in Asia and America. To these countries in 1807, while under their former dependence, the exports of domestic products from the United States amounted to upwards of four millions of dollars; so that estimating our exports to Great Britain, and her present possessions and dependencies, as they stood in 1807, the amount would be about thirty-two millions, above two-thirds of the whole amount of our domestic exports to every part of the world. Thus, while we are about engaging in a war for commerce, we abandon the greatest, absolutely—and content for the lesser. We relinquish our commerce with Great Britain and her possessions at the threshold, (for during hostilities I presume we shall have none,) and go to war for what we can get—of the commerce of France, Italy, Holland, Hamburg, and the Hanse Towns. I leave Spain and Portugal, and their American provinces, out of the question, as the fate of those countries hangs in suspense.\n\nBut this is not all. We may expect to see, and the day is not distant, when the dominions of France shall not afford us a market for a single article, but all commerce with her shall either be interdicted by her own government, or abandoned by our merchants as unworthy their pursuit. Ever since the date of the Berlin Decree, and the prostration of the Prussian monarchy, those who gave themselves the trouble to think—and could think—saw that a great and radical change in the state of Europe was intended by the imperial conqueror, who wields the destinies of the continent. Whatever the ultimate object might be, it was early perceivable—that that mutual dependence which exists between commercial states, so far as it respected the French empire, was about to be dissolved, and that it was to be dependent no longer upon foreign nations for any supplies. To this, every regulation (tax-territorial or municipal,) adopted by its government, has kept a steady eye. They are now staring you full in the face. You see your trade in the colonial products, formerly the most profitable branch of our foreign commerce, totally annihilated. The consumption of your tobacco, a great staple of the\nmiddle states, reduced to one fifteenth of the whole quantity consumed in France—and that monopolized by the French government, which pays your merchants what its rapacity dictates. You see your cotton, once the great and profitable staple of the south, subjected to such enormous impost as ties almost amount to a prohibition—for the avowed purpose of encouraging the culture of that article in Italy and the south of France; your flour and provisions find no market there, because she has a surplus of her own production! The other articles in which we are permitted to trade, are so inconsiderable in value, that they form no serious item in the account. Besides all this, you see your merchants, after having submitted to the injustice of French regulations, and the rapacity of French officers, compelled to invest the little proceeds of their cargoes in French silks, wools, and brandies, in regulated proportions. Sir, this detail ought to convince us, that a commerce thus shackled and limited, is not worthy the crusade which is meditated; and that the prospect as to its future value is still more gloomy. I believe, were the Orders in Council repealed to-morrow, our commerce to France would not be worth two millions, and circumscribed as it already is, as long as the anti-commercial system continues, we may expect that it will daily diminish.\"\n\nNote O. Page 123.\n\nThe following remarks by the same eloquent statesman, who is quoted in the last two notes, place in a still clearer light, if anything were wanting to do so, the folly of the proposal on the part of some of the Americans to go to war with this country:\n\n\"I have said that I did not believe that the number of men requisite for the conquest of the British provinces can be raised. Much reliance has been placed on volunteers, and I have heard of many myself who are ready to march to Canada, but it happens they are all volunteer officers, and who wish to aggrandise themselves by the enterprise. There are no volunteer privates. It cannot be seriously supposed that\nour farmers' sons will leave their own homes, where competency and ease reward their industry, to march to Canada to make conquest of those frozen regions. The same remarks are applicable to the army of regulars proposed to be raised. You will have officers enough; but where are the privates to be got? The honourable member from Pennsylvania, (Mr Findley,) gave us yesterday, a clear and practical demonstration that our own country did not furnish the materials for an army. We have a surplus of land and a deficiency of labour. Every person who will labour can obtain a competency, in the enjoyment of which he is a free man—subject to the control, and under the dominion of no mortal being. Will any but the most corrupt, profligate, idle, or inconsiderate, exchange this state of independence for the ranks of an army, where he loses every thing valuable to man; where he becomes a part of a great machine, and must move and act as others please; where he exposes his back to the lash for acts which, in any other state, would be perfectly innocent? I answer no! Our country is not the place where the materials for an army intended for such purposes abound; and I thank God it is so. It is the most conclusive evidence of the happy state of society, and the prosperity of our people, (which I hope may long continue.) Were there any thing wanting to prove the difficulty of obtaining men for such an army, that portion of our history to which I before had reference, would clearly establish the fact. The twelve additional regiments which were directed to be raised in 1798, were not half filled up when the army was disbanded, though eighteen months had elapsed from the passing of the law. I hesitate not to predict, that the 25,000 men proposed to be raised by this bill will not be raised in three years.\"\n\nTHE END.\n\nEDINBURGH:\nPrinted by James Ballantyne & Co.\nNEW BOOKS,\n\nAND\n\nREPUBLICATIONS OF STANDARD WORKS,\n\nPUBLISHED AND SOLD BY\n\nJOHN BALLANTYNE AND COMPANY, EDINBURGH;\n\nAND\n\nLONGMAN, HURST, REES, AND CO, LONDON.\n\n1. THE LADY of the LAKE, a Poem, in six Cantos, by WALTER SCOTT, Esq. embellished with a Portrait of the Author, engraved by Heath. Printed in Quarto, in the best manner, by Ballantyne, price 2l. 2s. A few Copies are taken off on Royal Paper, price Four Guineas. Demy 8vo Copies, 12s. in boards. Royal, One Guinea.\n\n2. The VISION of DON RODERICK, a Poem; by WALTER SCOTT, Esq. Demy Quarto Copies, 15s. boards; Royal (of which only 60 are printed,) 1l. 10s.; Demy Octavo, with several Additional Pieces, 9s.; Royal Copies, 12s.\n\n3. THE LAY of the LAST MINSTREL, by WALTER SCOTT, Esq. Quarto Copies (with the Addition of BALLADS and LYRICAL PIECES) 4l. 2s. Octavo, 10s. 6d. in boards.\n\n4. THE PORTICAL WORKS of WALTER SCOTT, Esq. complete in Eight Volumes 8vo.—Containing Minstrelsy of the Scottish Border; Sir Tristram, a Metrical Romance of the 13th Century; The Lay of the Last Minstrel; Marmion, a Tale of Flodden Field; The Lady of the Lake; The Vision of Don Roderick, with Ballads and Lyrical Pieces; several of the latter are to be found in no other collected Edition of Mr Scott's Poetical Works. Price 5l. 2s. in boards.\n\n5. ENGLISH MINSTRELSY, being a Selection of Fugitive Poetry from the best English Authors, with some Original Pieces hitherto unpublished. In Two Volumes small 8vo, price 14s. boards.\n\n6. A VIEW of the ANCIENT and PRESENT STATE of the ZETLAND ISLANDS; including their general History from the earliest Times, an Account of their Agriculture, Fisheries, Commerce, and the State of Society and Manners. By ARTHUR EDMONDSTON,\nNEW BOOKS AND REPUBLICATIONS.\n\nM. D. In Two Volumes, 8vo, illustrated with a Map of the Islands, price 18s. in boards.\n\n7. An HISTORICAL and CRITICAL ESSAY, on the LIFE and CHARACTER of PETRARCH. To which are added a few of his Sonnets, translated into English; with Portraits, &c., in One Volume Post 8vo, printed in the finest manner, price 10s. 6d. boards.\n\n8. A CRITICISM on GRAY'S ELEGY, written in a Country Church-yard, being a Continuation of Dr Johnson's Criticism on the Poems of Gray. The Second Edition, with Additions, price 5s. 6d. boards.\n\n9. BRITISH GEORGICS, a Poem, by JAMES GRAHAME, Author of the \"Sabbath,\" \"Birds of Scotland,\" &c. 4to, price 1l. 11s. 6d. in boards.\n\n10. HUME'S HISTORY of ENGLAND, with SMOLLETT'S CONTINUATION, in Sixteen Volumes. Beautifully printed by Bulmer, Bensley, Ballantyne, &c., in Demy 8vo, and embellished with upwards of 140 Engravings, Portraits, &c., from original Designs, price 11l. 4s. in boards. A few Copies are printed on Royal Paper, in the finest manner, price 19l.\n\n11. ELEMENTS of GEOMETRY, GEOMETRICAL ANALYSIS, and PLANE TRIGONOMETRY, by JOHN LESLIE, Professor of Mathematics in the University of Edinburgh. In One Volume Demy 8vo, price 12s. boards. The Second Edition, enlarged and improved.\n\n12. The LIFE of LORD HERBERT of CHERBURY, handsomely printed in Demy 8vo, from the Strawberry-Hill Edition, with an original prefatory Memoir, and characteristic Portrait, painted by Stoddart, and engraved by Pye, price 10s. 6d. in boards.\n\n13. The EDINBURGH ANNUAL REGISTER, for 1808, containing the History of Europe for that Period. To which is added, a copious Appendix of State Papers—Chronicle of Remarkable Events during the Year—History of the Physical Sciences—of the Fine Arts—the Drama—View of the Changes in the Administration of Justice in Scotland—general View of Literature—of the living Poets of Great Britain—Poetry—a correct List of new Publications—State of the Public Funds—Births, Deaths, Marriages, and Promotions, &c., in Two Volumes, Demy 8vo, price 24s. boards.\n\n14. The EDINBURGH ANNUAL REGISTER, for 1809. CONTENTS:—History of Europe—Appendix of State Papers, and other public Documents—Chronicle of Remarkable Events—Lists of Births, Marriages, and Deaths; Promotions, &c.—Public Financial Accounts\nNEW BOOKS AND REPUBLICATIONS.\n\nof Great Britain and Ireland—The Drama—State of the University of Oxford—Review of Science—Accounts of the Useful Arts, Meteorology, &c.—List of Books—Original Account of an Attempt to rescue La Fayette from the Tyrant’s Clutches—Observations on Bonaparte’s Military Tactics—Account of the Bell-Rock Light-house—Original Letters of Sherriff, David Hume, and Joseph Spence—Account of the present State of Criticism—The Inferno of Altissima, & Vision—Original Poetry, including the Vision of Don Roderick, by Mr Walter Scott; and the Bridal of Ferrandiz, by Miss Gatty—List of Books published, and General Index. In Two Volumes, price 24s. bds.\n\n* The VOLUMES for 1816, will be published speedily.\n\n15. The WORKS of DANIEL DE FOE, in Twelve Volumes Foolscap 8vo, handsomely printed and hot-pressed, price 3l. 12s. boards.\n\nAlso, by the same Author,\n\n16. The MEMOIRS of a CAVALIER, Two Vols. 12s. bds.\n17. HISTORY of COLONEL JACK, Two Vols. 12s. bds.\n18. ADVENTURES of CAPTAIN SINGLETON, Two Vols. 12s. boards.\n\n19. NEW VOYAGE ROUND THE WORLD, Two Vols. 12s. boards.\n\n20. HISTORY of the PLAGUE in LONDON, 6s. bds.\n21. THOMSON’S SEASONS, and POEMS; with a Life of the Author. Beautifully printed in Foolscap 8vo, price 6s. boards.\n22. FERGUSON’S ASTRONOMY, explained upon Sir Isaac Newton’s Principles, with Notes and Supplementary Chapters, adapted to the present State of the Science. By DAVID BREWSTER, LL.D., F.R.S. and F.A.S.E. In Two Volumes 8vo, and one 4to Volume of Plates, price 36s.\n\n23. The FAMILY LEGEND, a Tragedy, by JOANNA BAILLIE, the second edition, price 3s. 6d. sewed.\n24. HOGARTH’S WORKS Complete, with 90 Plates, and an Account of his Life, in Two Volumes Royal 8vo, price 3l. 12s. boards.\n25. POEMS, by ANNA SEWARD, with Extracts from her Literary Correspondence, and a Biographical Memoir by WALTER SCOTT, Esq. Beautifully printed in Three Volumes 8vo. Price 31s. 6d. boards.\n\n26. An HISTORICAL ACCOUNT of the ANCIENT CULDEES, by JOHN JAMIESON, D.D., F.R.S.E., &c. Author of an “Etymological Dictionary of the Scottish Language,” &c. In One Volume Quarto, with Engravings, price 1l. 11s. 6d. boards.\n\n27. SECRET HISTORY of the COURT of JAMES the FIRST;\nNEW BOOKS AND REPUBLICATIONS.\n\ncontaining Osborne's Traditional Memoirs—Sir Anthony Weldon's Court and Character of King James—Aulicus Coquinariae—Sir Edward Peyton's Divine Catastrophe of the House of Stuart, &c., with Notes and Introductory Remarks; and an Appendix, containing the Court and Kitchin of Joan Cromwell. Handsomely printed in Two Volumes 8vo, with curious fac simile Engravings, price 21s. boards.\n\nA few Copies on Royal Paper, price Two Guineas.\n\n28. SERMONS by Dr CRAIG, late Minister of St Andrew's Church, Glasgow; the Third Edition, with Additions. In Two Volumes 8vo, price 15s. boards.\n\n29. An ESSAY on the LIFE and CHARACTER of JESUS CHRIST, by Dr GRAIG. The Third Edition, price 7s. 6d. boards.\n\n30. The WORKS of JOSEPH BUTLER, late Bishop of Durham, in Two Volumes, with a Portrait, price 15s. boards.\n\n31. The CASTLE of OTRANTO, with an Introductory CRITICAL DISSERTATION: Splendidly printed in Quarto, with an Emblematical Engraving, price 46s. boards.\n\n32. A VINDICATION of the Character of the late Right Hon. William Pitt, from the Calumnies of the Edinburgh Review, price 1s. 6d. sewed.\n\n33. OBSERVATIONS suggested by the Strictures of the Edinburgh Review upon Oxford, by Henry Home Drummond, Esq. price 2s. sewed.\n\n34. ILLUSTRATIONS of the LADY of the LAKE, beautifully engraved by Warren, Heath, A. Smith, Engleheart, &c. from Paintings by George Cook; Demy Copies, 1s. stitched; Royal Quarto, Proof, 9s.\n\n35. The SHIPWRECK, by FALCONER; with an Account of the Author's Life: Printed by Ballantyne, in Foolscap 8vo, and Hand-pressed, price 5s. boards.\n\n36. The CHASE, RURAL GAMES, and FIELD SPORTS, by SOMERVILLE; to which is prefixed, a Biographical Memoir of the Author: Printed uniformly with the \"SEASONS\" and \"SHIPWRECK,\" in Foolscap 8vo, price 6s. boards.\n\n37. ESSAYS in a SERIES of LETTERS, on the following Subjects:—On a Man's writing Memoirs of himself—on Decision of Character—on the Application of the Epithet Romantic—on some of the Causes by which Evangelical Religion has been rendered less acceptable to persons of cultivated taste. By JOHN FOSTER. The Fourth Edition, in one thick Volume Demy Octavo, price 10s. 6d. boards.\nNEW BOOKS AND REPUBLICATIONS.\n\n38. The ISLE of PALMS and other POEMS, by JOHN WILSON, Esq. Mag. Coll. Oxford, in One Demy 8vo. Volume, printed in the most beautiful manner by Ballantyne, price 12s. boards.\n\n39. CATALONIA, a Poem, illustrative of the present State of affairs in the Peninsula, 8vo, price 2s. 6d. sewed.\n\n40. BYRON'S NARRATIVE; with a Life of the Hon. JOHN BYRON, the Author, and a review of the testimonies regarding the existence of a Race of Giants in Patagonia. In one Volume small 8vo, 6s. boards.\n\n41. TALES of the EAST, collated with the original or early Translations, and now first arranged in an uniform Edition, with an introductory dissertation, by HENRY WEBER, Esq. In Three Volumes Super-royal 8vo, double Columns. Printed with a new Type cast for the Work, in the most elegant manner, by Ballantyne, and Hot-pressed, price 3l. 18s. in boards.\n\nCONTENTS:\n\nDISSERTATION. ARABIAN NIGHTS. Introductory Tale—Fable of the Ox, the Ass, and the Labourer—The Merchant and Genie—The History of the first Old Man and the Bitch—The Story of the second Old Man and the two black Dogs—of the Fisherman—of the Grecian King and the Physician Douban—of the Husband and Parrot—of the Visier that was punished—of the young King of the Black Isles—of the three Calendars, Sons of Kings, and the five Ladies of Bagdad—of the first Calendar—of the second Calendar—of the Envious Man, and of him that was envied—of the third Calendar—of Zobeide—of Amine—Story of Sindbad the Sailor—The first Voyage—second Voyage—third Voyage—fourth Voyage—fifth Voyage—sixth Voyage—seventh and last Voyage—Story of the three Apples—of the Lady that was murdered, and the young Man her Husband—of Noureddin Ali, and Bedreddin Hassan—Story of the little Hunchback—Story told by the Christian Merchant—by the Sultan of Casgar's Purveyor—by the Jewish Physician—by the Tailor—by the Barber—Story of the Barber's eldest Brother—of the Barber's second Brother—of the Barber's third Brother—of the Barber's fourth Brother—of the Barber's fifth Brother—of the Barber's sixth Brother—History of Aboulhassan, Ali Ebn Bevar, and Schemselnihar, Favourite of the Caliph Haroun Alraschid—Story of the Amours of Camaralzaman and Badour—of the two Princes Amgrad and Assad—of Prince Amgrad, and a Lady of the City of Magicians—of Noureddin and the Fair Persian—of Beder, Prince of Persia, and Gishaure, Princess of Samarcand—History of Ganem, Son of Abou Ayoub—of Zeyn Alasnam, and the King of the Genii—of Codadad and...\nNEW BOOKS AND REPUBLICATIONS.\n\nhis Brothers—History of the Princess of Deryabar—Story of the Sleeper Awakened—of Aladdin, or, the Wonderful Lamp—Adventures of the Caliph Haroun Alraschid—Story of the Blind-Man Baba Abidalla—of Sidi Nouman—of Cogia Hassan Alhabbal—of Ali Baba and the Forty Thieves destroyed by a Slave—of the Enchanted Horse—of the Prince Ahmed, and the Fairy Parl Barou—of the two Sisters who envied their younger Sister.\n\nNEW ARABIAN NIGHTS. The Robber Caliph; or the Adventures of Haroun Alraschid with the Princess of Persia, and the beautiful Zutul—The Power of Destiny; being the History of the Journey of Giafar to Damas, containing the Adventures of Chebib and his Family—History of Halechalbe, and the Unknown Lady—Story of Xailoun, the Idiot—the Adventures of Sinoustepha and the Princess Ilseilisone—History of Alibengiad, Sultan of Herak, and of the false Birds of Paradise—of Shukarib and his two Visiers—of the Family of the Schebandad of Surat—The Lover, of the Stars; or, Cabil-Hasen's Story—History of Captain Tranchemont and his brave Companions—Dobil Hasen's Story—The Dream of Valid-Hasen—Story of Bohetzad and his Ten Visiers—of Kaskas, the Obstinate Man—of Illage Mahomet and his Sons, or the Imprudent Man—of Abosaber, or the Patient Man—of Bhazad, or the Impatient Man—of Ravia, or the Resigned—of Bhazmant, or the Confident Man—of Baharkan, the Intemperate—of Abaltamant, or the Prudent Man—of Sultan Hebraim and his Son, or the Predestined—of Selimshah and his Family—of the King of Harami and his Slave—of Habib and Dorathil-Goase, or the Arabian Knight—of Illabousatrous, of King Schalgose, and of Camaralzaman—of the Lady of the beautiful Tresses—History of Maugraby, or the Magician—of Halaiaddin, Prince of Persia—of Yamalladdin, Prince of Great Katay—of Baha-Idin, Prince of Cinigae—of Badvildian, Prince of Tartary—of Shahaiddin, Prince of Damas—of the Amours of Maugraby, with Auheta-il-Kaouakib, Daughter of the King of Egypt—of the Birth of Maugraby.\n\nTHE PERSIAN TALES. Introductory Tale—History of Aboulcassem of Basra—of King Ruzvanschad and of the Princess Cheheristaney—Story of the young King of Thibet and of the Princess of the Naimans—of the Visier Caverscha—of Coulofe and the Beautiful Dilara—of Prince Calaf and the Princess of China—History of Prince Fadlallah, Son of Bin-Ortoc, King of Moussel—of King Bedreddin Lolo, and his Visier Atalmule—of Atalmule, surnamed the Sorrowful Visier, and the Princess Zelica Beghume—of the Prince Seyfel Mulouk—of Malek and the Princess Schirine—of King Hormouz, surnamed the King without\nNEW BOOKS AND REPUBLICATIONS.\n\nSorrow—of Avicenna—of the Fair Arouya—The Adventures of Aboul-\nsouris, surnamed the Great Voyager—First Voyage—Second Voyage\n—History of the two Brothers Genies, Adis and Dahi—Story of Na-\nsiruddin, King of Mousel—of Abderrahmane, a Merchant of Bagdad;\nand the Fair Zeineb—of Repaina.\n\nPERSIAN TALES OF IMATULLA OF DELHI. The Translator's Pre-\nface to the Reader—The Author Imatulla to the Reader—The Bear Da-\nnesh; or, Garden of Knowledge—History of the Parrot—of Commal-\ndeva—Story of the first Companion—of the second Companion—of\nthe third Companion—of Roshana—of the Mouse and the Prince of\nGilan—of the young Merchant of Tatta—of Altafash, Viceroy of Cha-\nrist—of the Contending Brothers.\n\nORIENTAL TALES. History of Hudjadge and Moradbak—Story of\nEbouti Sina—of Dakianos and of the Seven Sleepers—of the Birth\nof Mahomet—of Abdul Motallab, the Sage—of Yaarab, the Judge\n—of Zemindari, the Soldier—of Aboutaleb, the Doctor of Law—of\nNaour, King of Casmire—of Naerdan and Guzulbec—of the Dervise\nAbounadar—of the Griffin—of Nourgehan and Damake, or the Four\nTalismans—of Jahia and Meimroune—of a Dervise—of the Merchant\nof Bagdad—of the Basket—of Gulsoum, and of the King of the Genies\n—of the Porter of Bagdad—of the Robber of Seistan—of the Black\nBull—of the Fisherman.\n\nHISTORY OF NOURJAHAD.\n\nADDITIONAL TALES FROM THE ARABIAN NIGHTS. History of\nNaama and Naam—of Aladdin Aboulshamat—of Abou Mohammed\nAlkélan—of Ali Mohammed the Jeweller, or the False Caliph.\n\nMOGUL TALES. Introductory Tale—History of Karabag—of Can-\nzade, Princess of Ormus—of Aboul-Assam, the Blind Man of Chitor—\nof Caran-Can, Sultan of Ormus—of the Prince of Viespour—of Zem-\nAlzam, Prince of Kaigar, and of Zendehboud Prince of Samarcan—\nof Kaitife and Margeon—of Megnoun and Leileh—of Massoud the Son\nof Soffar—of Abderam—of the Sultana Goul-Saba—of the Princess\nZarat-Alridh—of Oguz and the five Sultanas.\n\nTURKISH TALES. Preface—History of the Sultana of Persia and\nthe Visiers—of the Chec Chahabeddin—of the Son of the King of\nDelhi—of Saddiq, Master of the Horse—of the Adopted Son—of the\nTailor and his Wife—of Solomon's Birds—of the old King of Ethiopia\nand his three Sons—of King Togrul-Bey and his Children—of Prince\nMalikmair—of the two Owls—of the Santon Barsia—of a Sophy of\nBagdad—of King Qoutbeddin and the beautiful Ghulroukh—of the\nKing And—of the Brahman and the young Pyquny—of Sultan Aqshid.\nNEW BOOKS AND REPUBLICATIONS.\n\n—of the Prince of Carizme and the Princess of Georgia—of the three Princes obtained from Heaven—of a King, a Sophi, and a Chirurgeon.\n\nTARTARIAN TALES. Introductory Tale of Schem-Eddin—History of the Sultana Dugme—of Cheref-Eldin, Son of the King of Ormuz, and Gul-bindy, Princess of Tuluphan—Story of Sinadab, the Son of Sutan the Physician—History of Badour the Peaceful, King of Coor—of the three Crump Twin-brothers of Damascus—of Ouszin-Ochantey, Prince of China—of Gulguli-Chemame, Princess of Teflis—of Boulanan-Sanghier, Prince of Achem—of Satche-Cara, Princess of Borneo—of the Blue Centaur—of Bizag-el-Asna—of Alcouz, Taher, and the Miller—of Faruk—Adventures of the old Calendar—of the young Calendar—Return of the Physician Abubeker—History of Zebd-El-caton—Adventures of the Arab Aben-Ayar—of the Physician Abubeker.\n\nCHINESE TALES. History of Malekalsen, King of Georgia—of the Sultan Tongluck—of the Mandarin Fum-Hoam—of the Indian Moutebank and his Dog—of Massouma—Adventures of the Injan Absenderpud—History of the beautiful Al-Racouf—of Jezdad—of Houschenk and Gulbaz—of Dugme, Queen of Persia—of the beautiful Hengu—Adventures of the Ape Morog—of the Sultana Aliushank—History of Magmu, Midwife of Africcan—Adventures of Mogireddin, King of Agra, and of Rouz-Behart, Princess of Pegu—of the Physician Banou-Rassid—History of the Visier Houssan-Ben—of Kolaq, the Wild Man—Adventures of Dardok, told by her Slave Iloul—History of Corcui and his four Sons—of Ala-Bedlin—of the Dervise Assirkam—of Ab-Dul-Maal—History of Prince Kader-Bilak—of Alqamat.\n\nTALES OF THE GENII. Life of Horam the Son of Asmar—History of the Merchant Abudah, or the Talisman of Oromanes—The Merchant Abudah's Adventure in the Valley of Bocchim—The second Adventure of the Merchant Abudah in the Groves of Shadaski—The Merchant Abudah's third Adventure in the Kingdom of Tagi—fourth Adventure among the Sages of Rema—The Dervise Alfouran—Hassan Assar; or the History of the Caliph of Bagdad—Kelaun and Guzzaret—The Adventures of Urad; or the Fair Wanderer—The Enchanters; or Misanar, Sultan of the East—History of Massoud—of the Princess of Cassimir—Saduk and Kalasrade—Mirgip the Persian; or Fincl the Dervise of the Groves.\n\nTHE HISTORY OF ABDALLA, THE SON OF HANIF. Introductory Tale—Adventures of Almoraidin—History of the Indian Lady who was rescued from the Funeral Pile—Adventures of the Indian Maid carried off by Faquirs—The first Tale of Loulou—History of the King without a Nose—of the Persian Lady, and her Voyage to the Mysterious Island\nNEW BOOKS AND REPUBLICATIONS:\n\n—of Ajoub of Schiraz—Resurrection of the Queen Feramak and Giant her Husband—Second Tale of Loulou—History of the Prince Tanguit; and of the Princess with the Nose of a foot long—The third Tale of Loulou—The Adventures of the Pilot’s Father—The History of the Giant Hardeku and the beautiful Nour; and the Adventures of the Genie Ferdoum and the Princess Cheroudah—The Story of the Santon who married a young Wife—The History of the first of the afflicted Young Santons—of the second of the afflicted Young Santons—of the third of the Young Santons—The Adventures of the Old Santon with the Queen of the Mountains—The History of the Queen Aischah, and of the King Kerker—of Dahn Bosamco, Prince of Macasar—of Ibrahim, Sultan of Guncalam; and of the Princess Kouguitay—The Adventures of the Sage Rem-Corium, Prince of the Long Valley—The History of Dilsenguin, the Restorer of Magic; and of the Princess Perifirime, Foundress of the Fairies—of Zineddin and the beautiful Nahla—The Travels of Perifirime, and her Retreat in the Inaccessible Peninsula—The History of the Arabian with black Whiskers—of Mouslem and the faithful Rasime—The Tale of the Portagueze Imam—The History of the Princess Zeineb and King Leopard—of the Pilot and Mentor—The Fishery of Ambergrase in the isle of Chivambara—The Adventures of the young Warrior—The Overthrow of the Enchantments of Nerken—The Adventures of the Young Egyptian—of the naked Man, or the History of Eliamanzor and the Princece Sidi—The Voyage of the Arab with black Whiskers to the Luminous Isle, or the Transparent World—The Adventures of Abdalla in the Submarine Isle—The History of Loucheine and the three Hump-backed Princes—The Arrival of Abdalla in the Isle of Borico—The Dream of Abdalla—The Adventures of Abdalla at the Mountain of Borico—The Tale of Charmed—The Departure of Abdalla from the Isle of Borico—A New System of the World—The History of Selim and Zaphi—The fourth Tale of Loulou—The End of the Adventures of Abdalla.—Besides a number of minor Tales, Fables, and Stories, incidental to, and included in, the larger Histories throughout the work.\n\n4s. THE GENIUS of the THAMES, PALMYRA, and other Poems; by THOMAS LOVE PEACOCK; second edition, 7s. in boards.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_60816.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 191, "total-input-tokens": 298798, "total-output-tokens": 54110, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1583, 3], [1583, 4022, 4], [4022, 4022, 5], [4022, 4550, 6], [4550, 4550, 7], [4550, 4937, 8], [4937, 4937, 9], [4937, 5472, 10], [5472, 6467, 11], [6467, 7545, 12], [7545, 8609, 13], [8609, 9839, 14], [9839, 11062, 15], [11062, 12200, 16], [12200, 13399, 17], [13399, 14504, 18], [14504, 16071, 19], [16071, 17341, 20], [17341, 18400, 21], [18400, 19612, 22], [19612, 20690, 23], [20690, 21814, 24], [21814, 22946, 25], [22946, 24017, 26], [24017, 25644, 27], [25644, 26752, 28], [26752, 27857, 29], [27857, 28962, 30], [28962, 30078, 31], [30078, 31165, 32], [31165, 32231, 33], [32231, 33335, 34], [33335, 34428, 35], [34428, 35521, 36], [35521, 36610, 37], [36610, 37709, 38], [37709, 38800, 39], [38800, 39907, 40], [39907, 41020, 41], [41020, 42135, 42], [42135, 43145, 43], [43145, 44249, 44], [44249, 45428, 45], [45428, 46532, 46], [46532, 47647, 47], [47647, 48761, 48], [48761, 49833, 49], [49833, 50943, 50], [50943, 52135, 51], [52135, 53198, 52], [53198, 54306, 53], [54306, 55395, 54], [55395, 56486, 55], [56486, 57564, 56], [57564, 57564, 57], [57564, 58922, 58], [58922, 60035, 59], [60035, 61114, 60], [61114, 62205, 61], [62205, 63622, 62], [63622, 64682, 63], [64682, 65711, 64], [65711, 66801, 65], [66801, 67824, 66], [67824, 68944, 67], [68944, 70052, 68], [70052, 71077, 69], [71077, 72198, 70], [72198, 73239, 71], [73239, 74352, 72], [74352, 75837, 73], [75837, 76924, 74], [76924, 77970, 75], [77970, 79023, 76], [79023, 79553, 77], [79553, 80634, 78], [80634, 81771, 79], [81771, 82872, 80], [82872, 83997, 81], [83997, 85343, 82], [85343, 86475, 83], [86475, 87550, 84], [87550, 88612, 85], [88612, 89727, 86], [89727, 90784, 87], [90784, 91888, 88], [91888, 92992, 89], [92992, 94125, 90], [94125, 95273, 91], [95273, 96437, 92], [96437, 97511, 93], [97511, 98732, 94], [98732, 99852, 95], [99852, 100975, 96], [100975, 102654, 97], [102654, 102654, 98], [102654, 102654, 99], [102654, 102654, 100], [102654, 102654, 101], [102654, 104063, 102], [104063, 105152, 103], [105152, 106212, 104], [106212, 107354, 105], [107354, 108449, 106], [108449, 109489, 107], [109489, 110588, 108], [110588, 111735, 109], [111735, 112821, 110], [112821, 113895, 111], [113895, 115024, 112], [115024, 116140, 113], [116140, 117280, 114], [117280, 118354, 115], [118354, 119442, 116], [119442, 120595, 117], [120595, 121970, 118], [121970, 123063, 119], [123063, 124199, 120], [124199, 125346, 121], [125346, 126936, 122], [126936, 127998, 123], [127998, 129093, 124], [129093, 129803, 125], [129803, 130369, 126], [130369, 131474, 127], [131474, 132600, 128], [132600, 133709, 129], [133709, 134827, 130], [134827, 135878, 131], [135878, 136957, 132], [136957, 137955, 133], [137955, 139023, 134], [139023, 140157, 135], [140157, 141267, 136], [141267, 142418, 137], [142418, 143534, 138], [143534, 143927, 139], [143927, 143927, 140], [143927, 143927, 141], [143927, 143927, 142], [143927, 144196, 143], [144196, 145044, 144], [145044, 146705, 145], [146705, 148263, 146], [148263, 150007, 147], [150007, 151569, 148], [151569, 153221, 149], [153221, 154862, 150], [154862, 156512, 151], [156512, 158017, 152], [158017, 159443, 153], [159443, 160236, 154], [160236, 161681, 155], [161681, 162665, 156], [162665, 162665, 157], [162665, 162665, 158], [162665, 165148, 159], [165148, 166074, 160], [166074, 167518, 161], [167518, 169126, 162], [169126, 170846, 163], [170846, 170846, 164], [170846, 170846, 165], [170846, 172219, 166], [172219, 174355, 167], [174355, 176363, 168], [176363, 178491, 169], [178491, 180566, 170], [180566, 182441, 171], [182441, 184609, 172], [184609, 186528, 173], [186528, 188479, 174], [188479, 190724, 175], [190724, 192645, 176], [192645, 194860, 177], [194860, 197054, 178], [197054, 199099, 179], [199099, 200972, 180], [200972, 202685, 181], [202685, 204971, 182], [204971, 207175, 183], [207175, 209351, 184], [209351, 211848, 185], [211848, 214440, 186], [214440, 216863, 187], [216863, 219436, 188], [219436, 221689, 189], [221689, 221689, 190], [221689, 221689, 191]], "primary_language": ["None", "en", "en", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]