[{"id": "df543befcdb822f0eb38aa4871caee98fd42a985", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☑ Covers damaged/\nCouverture endommagée\n\n☑ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X |     |     |     |\n\nL’Institut a microfilmé le meilleur exemplaire qu’il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n☐ Coloured pages/\nPages de couleur\n\n☑ Pages damaged/\nPages endommagées\n\n☐ Pages restored and/or laminated/\nPages restaurées et/ou pelliculées\n\n☑ Pages discoloured, stained or foxed/\nPages décolorées, tachetées ou piquées\n\n☐ Pages detached/\nPages détachées\n\n☑ Showthrough/\nTransparence\n\n☐ Quality of print varies/\nQualité inégale de l'impression\n\n☐ Includes supplementary material/\nComprend du matériel supplémentaire\n\n☐ Only edition available/\nSeule édition disponible\n\n☐ Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\nLes pages totalement ou partiellement obscurcies par un feuillet d'errate, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nBibliothèque nationale du Québec\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nBibliothèque nationale du Québec\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nComment on achète les Terres des Compagnies de Chemin de Fer.\n\nRÈGLEMENT CONCERNANT LES TERRES DU CHEMIN DE FER CANADIEN DU PACIFIQUE\n\nLa Compagnie du Chemin de Fer Canadien du Pacifique offre en vente, au Manitoba et dans le Nord-Ouest Canadien, un certain nombre de lots de terres d'une fertilité incommensurable et supérieurement appropriées aux fins agricoles. Ces terres, qui sont toutes situées à une distance de vingt-quatre milles de chaque côté de la ligne principale du chemin de fer, sont mises en vente à des prix variant de $2.50 par acre en montant.\n\nDes informations complètes sur les prix des terres peuvent être obtenues du Commissaire des Terres, à Winnipeg, Manitoba.\n\n(Ces règlements sont substitués aux anciens réglements, et annulent ceux en vigueur jusqu'à ce jour.)\n\nCONDITIONS DE PAIEMENT\n\nSi le paiement est fait au comptant au moment de l'acquisition du terrain, il sera accordé un contrat de vente du terrain à l'acquéreur ; toutefois l'acheteur pourra ne payer qu'un dixième comptant, et la balance en neuf ans, par paiements échelonnés, avec intérêt de six par cent par an, payable à chaque échéance de fin d'année, en même temps que le versement annuel.\n\nCONDITIONS GÉNÉRALES\n\nToutes les ventes de terres sont sujettes aux conditions générales suivantes :\n\n1. Toutes les améliorations faites sur le terrain acquis y seront maintenues jusqu'au parfait paiement de ce terrain.\n\n2. L'acquéreur d'une terre devra payer toutes les taxes et impôts légaux établis sur cette terre et sur les améliorations qui y auront été faites.\n\n3. La Compagnie, sous l'empire de ce règlement, réserve de la vente tous les terrains miniers et houillers, ainsi que les terrains contenant de grandes quantités de bois, des carrières de pierre, d'ardoise et de marbre, ou contenant des pouvoirs d'eau, et des étendues de terres pour emplacements de villes ou constructions de chemins de fer.\n\n4. On disposera, à des conditions très avantageuses, des terrains miniers et houillers, des terres à bois, des carrières et des terrains contenant des pouvoirs d'eau, en faveur des personnes donnant des preuves indiscutables de leur intention et de leur capacité de les utiliser.\n\nLe Commissaire des Terres de la Compagnie du Chemin de Fer Canadien du Pacifique a adopté un tarif très réduit sur tout le parcours de son réseau, en faveur des colons, pour le transport de leurs personnes et de leurs effets mobiliers.\n\nPour plus amples renseignements adressez-vous à\n\nL. A. HAMILTON,\nCommissaire des Terres de la Compagnie du Chemin de Fer Canadien du Pacifique\nWinnipeg, Manitoba.\n\nTERRES DU MANITOBA MERIDIONAL\n\nLa concession des terres de la Compagnie du Chemin de Fer Manitoba Sud-Ouest est actuellement en vente et offre des chances exceptionnelles. Cette concession se compose d'un total de 1,000,000 d'acres de terres les plus fertiles de l'Amérique, parfaitement appropriées à la culture des grains et à la culture mixte dans une zone de 21 milles de largeur, située immédiatement au nord de la ligne internationale des États-Unis et du 18e rang en allant vers l'ouest. La partie de cette concession située entre le rang 18 et la limite Ouest du Manitoba est fort bien colonisée, les homesteads (octrois gratuits), ayant été occupés depuis longtemps. Les écoles, les églises, les écoles et l'organisation municipale. La facilité du sol a été durablement établie par les récoltes splendides qui ont été faites d'année en année dans ce beau district.\n\nLa contrée est abondamment pavoisée d'eau fournie par de nombreux lacs et cours d'eau au nombre desquels nous citerons principalement le lac Rock, le lac Pelican, le lac Whitewater, la rivière Souris et sa branche sud, la rivière Red, le lac Waskesiu et le lac Wapusk. Le bois de construction est abondant dans le lac et les Tortues. Le bois s'y trouve en grande abondance et les bois de construction se manufacturent à l'usine Deloraine et Wakopa et peuvent s'acheter à des prix très raisonnables. Dans ces deux dernières localités y a aussi deux moulins à blé en opération.\n\nLes conditions d'achat des terres du Manitoba Sud-Ouest sont les mêmes que celles de la Compagnie du Chemin de Fer Canadien du Pacifique.\nUN NOUVEAU CHAMP DE COLONISATION\n\nLA VALLEE DE LA SASKATCHEWAN\n\nBRANCHE NORD\n\nDISTRICTS D'ALBERTA ET DE SASKATCHEWAN\n\nTERRITOIRES DE L'OUEST.\n\nBIBLIOTHEQUE SAINT-SULPICE\n\nINFORMATIONS PREPARÉES PAR LE REV. PERE A. LACOMBE, O.M.I.\n\nMISS. DU NORD-OUEST.\nMap of part of MANITOBA and the NORTH WEST TERRITORIES OF CANADA SHEWING THE LINES OF LAND GRANT OF THE CANADIAN PACIFIC RAILWAY.\n\nNOTE:\nThe Company's lands in part consist of the odd numbered sections in the belt (twenty-four miles) on each side of the main line, from Winnipeg to the Rocky Mountains, and in Southern Manitoba, extending from the Red River to the Missouri Coteau.\n\nWinnipeg, Jan. 1st, 1890.\n\nLand Commissioner.\nL'OUEST CANADIEN.\n\nPRÉAMBULE\n\nLes lignes suivantes sont principalement destinées pour la considération des Canadiens-français de la province de Québec, qui, à cause de difficultés locales et la gêne dans laquelle se trouvent leurs familles, veulent se déplacer et chercher ailleurs de meilleures conditions, que celles qu'ils trouvent, dans les lieux qui les ont vu naître. Depuis plusieurs années, on fait des efforts très louables et très appréciés pour faire connaître la belle province de Manitoba, et cela avec un grand succès. Aujourd'hui c'est le tour d'une autre contrée de notre Dominion, la belle et fertile Vallée de la Saskatchewan.\n\nCHERS COMPATRIOTES\n\nC'est à vous que je m'adresse aujourd'hui, non pas pour vous prêcher une propagande anti-patriotique, mais au contraire, pour conserver à notre commune patrie des milliers de ses enfants, qui, tous les ans, à cause de leur malaise, s'en vont chercher à l'étranger un bien-être qu'ils prétendent ne pouvoir trouver, dans leur pays. Nous ne venons pas chercher à dépeupler et démembrez vos paroisses, en vous conseillant d'abandonner une place où vous êtes contents et heureux. Bien loin de là, je regarderais comme un crime de donner un semblable conseil, afin d'éloigner ces familles de leurs clochers. C'est aux familles embarrassées, pour établir leurs enfants, dont la terre ou le bien paternel n'est plus suffisant, pour satisfaire tous les membres, c'est à cette classe d'habitants et cultivateurs, que j'entreprends de donner certaines explications, en vue d'un nouveau champ de colonisation, au-delà de Manitoba. C'est la belle et immense vallée de la Saskatchewan, qui forme une grande partie de cette fameuse et fertile ceinture (fertile belt) si vantée par les touristes et voyageurs, qui ont parcouru cette contrée. Les anciens pionniers, missionnaires ou autres colons de cette région, ne cessent de corroborer les rapports favorables déjà publiés.\n\nIl va sans dire, je dois le dire de suite, que si je prends la liberté de publier ces déclarations, c'est non seulement pour satisfaire un besoin patriotique, mais surtout pour obéir aux désirs et aux suggestions de notre évêque, Mgr Grandin et de nos amis, déjà établis, dans la Saskatchewan. Je ne suis donc aujourd'hui que l'écho de notre vénérable évêque, qui, lui aussi, a tant à cœur, d'offrir la bienvenue à nos compatriotes, qui sont dans la nécessité d'émigrer.\n\nLa plupart des brochures, qui ont été jusqu'ici publiées, sur\nles districts d'Alberta et de la Saskatchewan, généralement sont en anglais et n'encouragent par conséquent que ceux qui parlent cette langue. Voilà pourquoi, que de concert avec la puissante compagnie du chemin de fer du Pacifique Canadien, nous avons cru opportun de publier en français ces explications pour nos nationaux, pour attirer leur attention sur ce nouveau champ de colonisation. Depuis la formation de la province de Manitoba, de puissantes sociétés de colonisation ont été organisées pour diriger plusieurs courants de colons d'Europe et d'Ontario, vers la nouvelle province. Ce mouvement a obtenu un grand succès à l'avantage de nos amis de langue anglaise. De la même manière, parmi nos nationaux, des hommes dévoués et dans des vues de patriotisme, ont fait de grands efforts, pour faire connaître Manitoba et y attirer des États-Unis et de la province de Québec un bon contingent de nos compatriotes. Par ce mouvement si louable, des paroisses ont été formées et organisées, dans la province sour, et on peut dire que ces nouveaux établissements canadiens-français, ont été et sont un succès. Pour nous, les missionnaires du Nord-Ouest, nous pensons que le temps est venu de faire pour notre contrée ce qu'on a fait pour Manitoba. Les nouveaux embranchements de chemins de fer et les dispositions si bienveillantes de la compagnie du Pacifique nous engagent à parler et à agir.\n\nNous élevons notre voix et nous vous répétons, dans toute la sincérité de notre âme : \"Vous, qui avez une nombreuse famille et dont la propriété est trop étroite, pour suffire à l'établissement de vos enfants, vous, qui jetez les yeux du côté des États-Unis, pour y chercher fortune, vous, enfin, qui êtes forcés d'émigrer, à cause de malheureuses circonstances................ nous vous disons : allez dans la vallée de la Saskatchewan et vous y trouverez l'espace et le bon terrain, que vous désirez. Oui, nous, les vieux missionnaires de cette contrée, nous croyons qu'il est de notre devoir, comme Canadiens, de vous révéler les secrets des richesses de ce pays, que nous habitons et que nous cultivons depuis nombre d'années.\"\n\nDIVISION DE LA VALLÉE DE LA SASKATCHEWAN.\n\nLa partie de la Saskatchewan, propre à la colonisation et à l'agriculture avec l'élevage des animaux, s'étend de l'ouest à l'est, sur une longueur de plus de 500 milles, avec une largeur moyenne d'au moins 50 milles, ce qui donne une étendue de plusieurs milliers d'arpents de terre riche et qui n'attend que l'action de la charrue avec l'énergie du colon. Cette contrée est arrosée par la majestueuse rivière Saskatchewan, (on devrait prononcer et écrire : Kisiskâtechewan, courant rapide) qui, après\navoir pris sa source, dans les Montagnes Rocheuses, coule de l'ouest à l'est, et va se jeter dans le lac Winnipeg, s'étant déjà réunie à sa sœur, la branche sud.\n\nDISTRICT D'ALBERTA.\n\nUne grande partie de cette vallée à l'ouest se trouve dans le district d'Alberta. C'est dans cette importante section du pays que nous rencontrons les établissements si intéressants de St. Albert, Edmonton, Duhamel, Victoria, le fort Saskatchewan, Lourdes, le lac Ste. Anne, le lac Labiche, etc. En visitant ces nouveaux centres de colonisation, on pourra bientôt se convaincre de la fertilité du sol et des avantages qu'on y trouve.\n\nST. ALBERT.\n\nAgréablement situé sur une petite rivière appelée Eturgeon, à neuf milles au nord d'Edmonton et de la rivière Saskatchewan, branche nord, c'est le siège épiscopal de l'Evêque Catholique. Cette mission, fondée il y a plus de 25 ans, d'abord dans l'intérêt de la population métisse et des Sauvages chrétiens, a aujourd'hui beaucoup changé d'aspect depuis l'érection de l'Evêché et l'arrivée des premiers colons blancs. Elle ressemble à une de nos paroisses de la province de Québec, par son église, son couvent, ses écoles et ses deux rangées de maisons, qui vont en s'éloignant de chaque côté de la cathédrale, le long de la charmante vallée de la petite rivière qui, après 20 milles, se réunit à la grande rivière. Malgré les habitations des blancs et des Métis, que d'arpents de belles terres, encore inoccupées et qui attendent ceux qui voudraient s'en emparer, pour en tirer leurs riches produits. La paroisse et ses habitants se trouvant en grande partie sur la rive nord, un beau pont, construit aux frais du gouvernement, donne passage sur le chemin, qui conduit à Edmonton. Mais ce qui doit réjouir grandement tout colon canadien-français, c'est qu'il trouvera à St. Albert et dans d'autres établissements les bonnes et aimables Sœurs de Charité, les Sœurs Grises. Venez voir à St. Albert, leur couvent, leurs écoles, l'hôpital et l'orphelinat. En voyant ces merveilles de la charité, on oublie qu'on est loin de son vieux clocher et de ses amis de là-bas. Il n'y a plus de sauvagerie ni barbarie ; on est chez soi.\n\nEDMONTON.\n\nAncien fort de traite de la puissante compagnie de la Baie d'Hudson, anciennement l'emporium du marché des fourrures, aujourd'hui est érigé en ville et se dessine avantageusement sur les bords de la Saskatchewan. C'est là qu'aboutit le terminus\nde la navigation. L'emplacement, à l'instar de St. Albert, est des plus pittoresques, quand on considère ces prairies, ces îles de bois et à vos pieds les eaux du Courant rapide. La ville nasante a déjà ses églises, ses écoles, etc. Nous y avons notre église avec un prêtre résidant. Les excellentes sœurs, \"Fidèles Compagnes de Jésus\" y ont un couvent prospère, où l'instruction supérieure de concert avec l'école primaire, est donnée aux enfants des deux langues.\n\nDUHAMEL.\n\nCette colonie et paroisse se trouve à 40 milles, au sud-est d'Edmonton, sur la rivière Bataille. C'est dans cette riche vallée que se sont établis, sur les deux bords de la rivière, plusieurs Métis canadiens-français, ayant à leur tête leur excellent pasteur, qui leur est tout dévoué. Avec leurs prairies, leurs champs, leurs troupeaux de chevaux et de bestiaux, et leur chasse aux différents gibiers, ils sont heureux et bons chrétiens, comme leurs frères de St. Albert. Contents de peu, ils ne sont pas enclins à entreprendre de grands travaux, pour améliorer leur position. Leur caractère doux et affable leur gagne facilement, non seulement l'affection de leurs missionnaires, mais aussi des étrangers. Qu'on ne craigne donc pas de venir habiter auprès de nos Métis et dans leur pays. Ils seront vos amis et vos aides dans une foule de circonstances. Que de beaux et bons terrains encore inoccupés dans ce bassin de la rivière Bataille ! Elle va déboucher dans le Saskatchewan à Battleford.\n\nLOURDES ET LE FORT SASKATCHEWAN.\n\nCes deux villages sont à 12 milles en bas d'Edmonton, sur les deux rives de la Saskatchewan. Le premier est une petite colonie composée principalement de Canadiens-français, qui attendent impatiemment d'autres compatriotes pour leur faire partager les avantages de leur établissement. Les messieurs Lamoureux, les premiers colons de cette place, y prospèrent par leur énergie, leur esprit d'entreprise et leur persévérance. \"Vous qui n'avez pas de terres à vous dans nos vieilles paroisses, venez ici et vous choisirez,\" vous disent-ils.\n\nLAC LABICHE.\n\nCette contrée au nord d'Edmonton et de St. Albert, est habitée aujourd'hui presqu'exclusivement par des Métis et des Sauvages chrétiens. Les constructions de la mission, ses larges champs de culture et la vue de ce beau lac, avec ses excellents poissons-blancs, vous disent assez que là aussi il y a une chance de succès pour de nouveaux colons.\nPour ne pas rendre trop long ce mémoire, je passe sous silence quelques autres établissements moins importants pour le moment, mais que l'avenir changera en peu de temps.\n\nLe fort Saskatchewan est la place centrale où se trouve stationnée la garnison de la police montée, qui a charge de tout le district d'Edmonton et des environs.\n\nDISTRICT DE SASKATCHEWAN.\n\nLa partie est de la vallée de la Saskatchewan se trouve dans le district appelé officiellement Saskatchewan. Nous y voyons comme nouveaux établissements de colonisation et de villes naissantes, Battleford, Prince Albert, Batoche, Saint-Laurent, Saint-Louis de Langevin, le lac Canard, Taché de Fish Creek, Saint-Eugène de Carlton, etc. Dans toute cette immense région, le terrain offre la même qualité de sol et le climat la même température. C'est dans cette contrée auprès de Batoche, le lac Canard, Carlton, le lac Lagrenouille, qu'ont eu lieu les événements de la fameuse rébellion, dont on s'occupe fort peu à l'heure qu'il est. Aujourd'hui je ne dirai rien de ces centres de colonisation, où nos frères des autres nationalités se dirigent en grand nombre. Ils savent apprécier les avantages de cette contrée. Qu'il suffise de dire pour le présent que Prince Albert et Battleford seront bientôt des villes importantes, étant entourées par de magnifiques champs, où l'agriculture fait son œuvre.\n\nCLIMAT.\n\nPour nous, anciens habitants de ce pays, il nous semble que la température n'est pas plus sévère chez nous que dans la province de Québec, quoique le thermomètre descende plus bas, en décembre et janvier. C'est un froid sec, comme on dit, et il n'a pas l'incommodité et les dangers d'une température humide. Il y a généralement beaucoup moins de neige; c'est à peu près comme à Manitoba. La neige commence à tomber, pour rester, à la fin de novembre et se prépare à disparaître au commencement d'avril. On sème vers le milieu d'avril et la moisson se fait à la fin d'août, pour se continuer en septembre. C'est très rare qu'on y souffre des grandes sécheresses et de tempêtes, pour endommager les champs et les habitations. Le sol est le même qu'à Manitoba, c'est-à-dire, riche et facile à labourer. Le pays est entresemé d'îles ou bouquets de bois, au milieu de larges espaces de prairies. On n'y est pas incommodé par des terrains rocheux, qui sont la désolation des cultivateurs. Vous pouvez presque partout labourer de suite sans être obligé d'arracher les souches et enlever les pierres. L'herbe de nos beaux pâturages est haute et épaisse. Le foin naturel abonde dans les bas-fonds.\nRESSOURCES.\n\nDepuis plus de 40 ans, la compagnie de la baie d'Hudson, les missionnaires et les premiers colons ont cultivé en différentes sections de cette contrée et y ont récolté le blé, l'avoine, l'orge, les pois et les légumes de toutes sortes. Tous ces essais ont presque toujours été couronnés de succès comme on pourra le voir, par le tableau, à la fin de cet écrit.\n\nLe bois de chauffage suffit en moyenne pour les besoins ; je parle pour la proximité ; car à distance il y en a en assez grande quantité. Dans le haut de la rivière Saskatchewan, au-delà d'Edmonton, auprès des Montagnes Rocheuses, il y a de grandes épinetières. C'est de là qu'on descend des radeaux de billots, pour être sciés à l'usage des colons. Cela vous explique que nous avons déjà des moulins à scie et même pour moudre le grain à farine. Dans la vallée en bas d'Edmonton jusqu'au lac Winnipeg il y a le liard, le tremble, le bouleau et l'épinette.\n\nLE CHARBON.\n\nLe charbon de bonne qualité pour le combustible et l'usage des usines, abonde le long de la rivière. Il est déjà exploité à Edmonton, par milliers de tonnes, où il se vend $3 la tonne. Une multitude de petits cours d'eau limpide viennent se jeter, dans la grande rivière et offrent aux colons leurs luxuriantes vallées et leurs bas-fonds, où on peut couper le foin en abondance.\n\nCHEMINS DE FER. MOYENS DE TRANSPORT.\n\nJusqu'ici ce qui a été le grand obstacle à l'immigration dans la Saskatchewan, c'était les distances. On était effrayé de traverser ces grandes prairies, au-delà de Manitoba, ce qui demandait plusieurs semaines de marche pénible et coûteuse. Mais aujourd'hui voilà qu'il n'y a plus de distances. Le mot loin cesse d'être français. Vous avez entendu parler du grand Pacifique Canadien, qui, après avoir traversé la province de Manitoba, coupe le sud d'Alberta en deux, pour s'élancer ensuite à travers les Montagnes Rocheuses. Deux embranchements ouvrent aujourd'hui la vallée de la Saskatchewan à la colonisation. Une de ces lignes part de Régina et se rend à Prince Albert. L'autre tronçon, en construction à présent, part de Calgary pour arriver à Edmonton. Ainsi, comme on peut le comprendre, il est facile de pénétrer dans ce champ de colonisation, à l'est et à l'ouest.\n\nJe conclus ces quelques détails en disant, pour donner confiance et encouragement à ceux qui voudront tirer avantage de cet exposé, que partout il y a des prêtres, des écoles et des méde-\neins. Partout les sauvages sont paisibles et amis des blancs, enfin disons qu’une amicale harmonie règne entre les différentes nationalités.\n\nLE SUD D’ALBERTA.\n\nPlus tard je pourrai vous parler du Sud d’Alberta, où je vous montrerai les jeunes cités de Calgary, de Lethbridge, de McLeod, Pincher Creek, Medicine Hat, Moose Jaw et surtout notre capitale Regina. Calgary et MacLeod sont les centres des fameux Ranches, où se fait en grand l’élevage des animaux, bêtes à cornes, moutons et chevaux. Déjà on compte ces bêtes par milliers. Ils remplacent aujourd’hui nos immenses troupeaux de buffalos, qui ont été détruits.\n\nDans ces localités que je viens d’indiquer, nous avons un contingent de nos compatriotes, qui ont réussi et sont satisfaits de leur position.\n\nChers compatriotes, en terminant, je répète ce que je vous ai dit au commencement de ce mémoire : “Vous, qui voulez quand même laisser votre paroisse, parce que vous n’avez pas assez de place, pour y grouper votre famille auprès de vous, tournez vos regards et vos aspirations vers Manitoba et le Nord-Ouest et j’ai tout lieu de croire que vous n’aurez pas raison de le regretter. Avec un certain capital, de l’énergie, du courage et de la persévérance, on formera bientôt une colonie importante, qui sera un agréable pendant de la Province de Québec, et cela sans susciter la jalousie des autres nationalités, puisqu’il y a de la place pour tous.”\n\nAPPEL AU CLERGÉ.\n\nNous prenons la liberté de demander à messieurs les curés, eux, qui voient avec tant de peine leurs bons paroissiens s’éloigner d’eux pour l’étranger, de vouloir donner conseil à ces familles et les diriger vers Manitoba ou le Nord-Ouest, où elles continueront à être chez elles et à jouir des consolations de la patrie. On ne s’exile pas tant qu’on est à l’ombre du même drapeau et qu’on est protégé par les mêmes lois. De plus, ces zélés pasteurs et sincères patriotes rendront un grand service à notre nationalité et à notre jeune église du Nord-Ouest.\n\nPuisque le sort est jeté et que le pauvre Indien est destiné à céder ses grandes terres, qu’il ne peut cultiver, à son frère, l’homme blanc, plus laborieux et plus industriels, pour nous, sans abandonner nos chères missions sauvages, qui nous ont coûté tant de peines et de travail, sans cesser de plaider la cause de nos enfants adoptifs, les premiers occupants de ce pays, il nous faut aujourd’hui accepter les circonstances de la position\net aider le mouvement de colonisation. Le missionnaire comme prêtre et citoyen doit être toujours et partout l'homme de son temps.\n\nJ'ai l'honneur de me dire,\nChers compatriotes,\nVotre très dévoué serviteur,\n\nA. LACOMBE, Prêtre, O. M. I.\n\nCONTINUATION—AUTRES INFORMATIONS IMPORTANTES.\n\n[De La Minerve, de Montréal, le 4 octobre 1890.]\n\nLE VOISINAGE D'EDMONTON.\n\nProfitant du passage en cette ville d'un homme pour qui le Nord-Ouest n'a plus de secret, nous avons pris sur cette région d'Edmonton qu'on considère comme la Terre Promise, des renseignements qui ne seront pas, croyons-nous, sans quelque intérêt pour le lecteur. C'est sur ce point des Territoires qu'on trouve les fermes les plus anciennes, mais c'est d'une dizaine d'années seulement que date le développement qui y caractérise l'agriculture. Or, depuis cette époque il ne s'y est jamais produit, de quelque cause que ce soit, une seule disette complète; la sécheresse de 1889 est la scule dont on ait mémoire, ce qui n'a pas empêché la récolte d'être assez bonne.\n\nLa grêle n'a jamais fait que des dommages fort circonscrits : trente-cinq arpents de grain en tout ont été de ce chef détruits cette année, mais pas un seul ne l'a été l'an passé.\n\nL'avoine n'a jamais eu à souffrir de la gelée ; quant au blé s'il a été éprouvé en 1884 et 1887 il n'a pas éprouvé le moindre dommage en 1882, 83, 85, 86, 88, 89 et 90.\n\nLa neige varie de six pouces à deux pieds et demi. Parfois le froid est rigoureux mais de ce côté les blizzards ne sont pas connus du tout et les ouragans ne le sont guère, de sorte que les habitants peuvent travailler ou voyager à l'aise tout l'hiver.\n\nLe rendement des terres varie tellement suivant les saisons et les modes de culture qu'on n'en saurait donner de moyenne exacte. Moins que vingt minots de blé et quarante minots d'avoine à l'arpent est une bien pauvre récolte. Il arrive toutefois que le blé rende 40 minots et l'avoine 110 minots. Le foin est abondant depuis des années.\nLe prix des chevaux varie de $50 à $200 ; celui des vaches de $30 à $75 ; celui des moutons de $5 à $25.\n\nLe défrichement dans la prairie coûte de $4 à $6 et naturellement un peu plus dans les terrains où il y a des taillis.\n\nUne lieuse coûte $205 ; un semoir de $115 à $135. La construction du chemin de fer l'an prochain aura pour effet de réduire ces prix respectivement de $25 et de $15.\n\nJusqu'à ce jour la vente des produits a été reine au marché local et les prix ont beaucoup varié ; on ne peut dire ce qu'ils seront l'an prochain quand le chemin de fer aura été complété. Le blé s'est vendu de 80 cents à $2,50 ; l'avoine de 30c. à $1,50 ; le bois brut de $15 à $20 le mille pieds ; le bardeau $4 le mille. La fourniture des traverses de chemin de fer promet de l'ouvrage aux colons tout l'hiver.\n\nLes semaines se font du 1er au 25 avril, mais généralement dans la première semaine du mois. C'est par exception qu'il arrive que le vent souffle en tempête, à quelque époque de l'année que ce soit.\n\n---\n\nL'ELEVAGE DES MOUTONS.\n\nAlberta est par excellence le pays du mouton de l'Amérique du Nord. Il y a sur le plateau et les terres de prairies ondulantes qui se trouvent à l'est et au nord-est de Calgary, un pays capable d'héberger dix millions de moutons — un pays d'herbes succulentes et épaisses tel que le requiert le développement du mouton — ceci en sus de limites destinées aux ranches de bestiaux plus considérables.\n\nPour l'homme qui veut se dévouer à cette industrie dans Alberta, avec un capital de trois ou cinq mille piastres (on peut aussi se livrer à cette exploitation avec un moindre capital et réussir) et qui donnera tous ses soins à ses troupeaux, qui usera de son jugement pour faire donner au mouton la laine et la chair qui commandent les plus hauts prix du marché, une fortune est assurée, et cela, avant peu d'années.\n\nLe premier troupeau considérable de moutons a été importé de Montana en 1884 ; pendant les années qui ont suivi il en a été amené d'autres plus nombreux et on estime qu'il y a aujourd'hui plus de quarante mille moutons dans le district. Les pertes durant l'hiver ont été très légères, elles n'ont pas excédé deux pour cent.\n\nQuant à la race de moutons la plus profitable, les opinions varient, toutes les espèces payent bien quand elles sont bien soignées. Pour les troupeaux considérables, mérinos avec mérinos vont bien. Les mérinos Leicester ont le plus de valeur peut-être, tant pour la chair que pour la laine. D'autres pen-\nsent que le Shropshire et les Oxford Downs se croisent mieux et on est aussi d’opinion que ce sont les Cotswold ; ça se peut, mais donnez à la race le soin nécessaire et ça paiera dans Alberta.\n\nTout s’annonce bien ici pour l’élevage du mouton, et les individus aussi bien que les compagnies qui y placerait des capitaux feraient fortune. Il n’est pas nécessaire, pour l’exploitation de cette industrie, de discuter le meilleur mode d’aider le suint, mais il suffit d’ajouter que la nature s’est montrée prodigue envers Alberta en lui donnant tous les éléments nécessaires pour en faire l’un des plus grands pays du monde pour la laine et le mouton.\n\n*L’Elevage des Moutons dans le Sud d’Alberta.*\n\nCette partie du Nord-Ouest offre aujourd’hui ce que les colonies de l’Australie offraient il y a 30 ans, c’est-à-dire, des milliers d’acres de riches terres à pâturages, bien approvisionnées d’eau et propres, sous tous les rapports, à l’élevage des moutons et à la production de belle laine, une contrée favorisée d’un climat ayant la chaleur suffisante pendant les deux tiers de l’année, pour tenir en circulation le suint du mouton et contribuer à la finesse du fibre lainieux, avec des hivers assez doux et des printemps hâtifs. Voilà les avantages qu’offre Alberta, pour l’élevage des moutons.\n\nN. B.—Le Révérend Messire J. Bte Morin a été choisi par Mgr Grandin pour être le prêtre colonisateur du diocèse de St-Albert.\n\n**ARPENTAGE**\n\n[De la brochure du Rév. Georges Dugas, sur l’émigration à Manitoba et dans l’Ouest Canadien.]\n\nD.—Comment sont arpentées les terres à Manitoba ?\n\nR.—On n’a pas suivi, à Manitoba et dans le Nord-Ouest, le même système d’arpentage que dans la province de Québec. Tout le pays est divisé en townships de trente-six milles carrés. Chaque township contient trente-six sections de six cent quarante acres, et chaque section est subdivisée en quatre quarts de section de cent soixante acres. Un chemin public passe entre chaque section. Nous donnons ci-dessous un diagramme des townships.\n\nBIBLIOTHEQUE\nSAINT-SULPICE\nCe système d'arpentage a ses avantages et ses inconvénients. Les Canadiens-Français, habitués au système suivi dans la province de Québec, n'aiment pas celui de la province de Manitoba, tandis que les gens d'Ontario le préfèrent à tout autre. Les avantages de ce système sont ceux-ci : le fermier a moins long de clôture à faire, et dans un pays où le bois est rare, c'est un point à considérer ; ensuite, le fermier a moins loin à charroyer ses récoltes, c'est par cela même une grande économie de temps. S'il bâtit sa maison au milieu de sa ferme, il n'aura que sept arpents pour atteindre le bout de son champ. Les colons établis à Manitoba, depuis quelques années, se font à ce mode d'arpentage et ne s'en plaignent pas.\n\nDans les anciennes paroisses qui avaient été établies par les Métis, le long des rivières, les terres sont arpentées d'après le mode suivi dans la province de Québec.\nRÈGLEMENTS DES ÉTABLISSEMENTS GRATUITS\n\nToutes les Sections numérotées, exception faite des numéros 36 et 38, sont affectées aux établissements gratuits.\n\nL'INSCRIPTION\n\nLa demande ou l'inscription peut être faite personnellement au bureau local des terres où est situé l'établissement que l'on veut prendre, ou bien, si on le préfère, on peut en s'adressant au Ministre de l'Intérieur, à Ottawa, ou au Commissaire des terres fédérales, à Winnipeg, obtenir l'autorisation de faire faire son inscription par l'entremise d'une personne résidant dans le voisinage du bureau des terres.\n\nOBLIGATIONS À REMPLIR\n\nSous la présente loi les obligations à l'égard des établissements gratuits peuvent être remplies suivant l'une ou l'autre des trois méthodes suivantes, savoir :\n\n1o. Trois ans de culture et de résidence, période durant laquelle le colon ne peut être absent plus de six mois dans aucune des trois années sans forfaiture à son inscription.\n\n2o. Résidence pendant trois années dans un rayon de deux milles de son établissement d'un quart de section et construire sur le terrain une maison habitable dans laquelle il aura résidé pendant les trois mois précédant immédiatement sa demande pour obtention de lettres-patentes. Dans la première année à compter de la date de l'inscription, dix acres devront être préparées et labourées ; quinze acres additionnelles dans la deuxième année et quinze autres acres durant la troisième année ; dix acres devront être ensemencées la deuxième année et vingt-cinq la troisième année.\n\n3o. Le colon peut résider n'importe où pendant les deux premières années. Dans la première année, il doit labourer et préparer pour la semence cinq acres de terrain ; dans la deuxième année ensemencer ces cinq acres et labourer et préparer pour la semence dix autres acres et bâtir une maison habitable. L'inscription est forfaiture s'il ne commence pas à résider à l'expiration des deux années suivant la date de l'inscription. Après quoi le colon doit résider sur son établissement et le cultiver durant au moins six mois dans chacune des trois années.\n\nDEMANDE DE LETTRES-PATENTES\n\nPeut être faite en s'adressant à l'agent local, à aucun des inspecteurs d'établissements gratuits (homestead) ou au bureau d'informations à la Station de Moosomin ou de Qu'Appelle.\n\nAvant de demander ses lettres-patentes, le colon doit donner avis par écrit six mois d'avance au Commissaire des Terres fédérales.\n\nLES BUREAUX D'INFORMATIONS sont situés à Winnipeg et à la station de Qu'Appelle. Les immigrants nouvellement arrivés recevront à l'un ou l'autre de ces bureaux les informations dont ils ont besoin à l'égard des terres ouvertes à l'inscription, et les officiers en charge leur donneront gratuitement l'assistance nécessaire pour leur faciliter le choix du terrain qui leur convient.\n\nToutes communications ayant rapport aux terres sous le contrôle du gouvernement fédéral, situées entre la frontière Est de Manitoba et les Côtes du Pacifique, devront être adressées au Secrétaire du Ministère de l'Intérieur, à Ottawa, ou au Commissaire des Terres Fédérales, à Winnipeg.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30655.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 40, "total-input-tokens": 66262, "total-output-tokens": 11549, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2741, 3], [2741, 5160, 4], [5160, 5160, 5], [5160, 5160, 6], [5160, 9331, 7], [9331, 9331, 8], [9331, 9331, 9], [9331, 9331, 10], [9331, 9331, 11], [9331, 9331, 12], [9331, 9331, 13], [9331, 9331, 14], [9331, 9583, 15], [9583, 9583, 16], [9583, 9583, 17], [9583, 9583, 18], [9583, 9583, 19], [9583, 9583, 20], [9583, 10012, 21], [10012, 10012, 22], [10012, 12474, 23], [12474, 15149, 24], [15149, 15149, 25], [15149, 17561, 26], [17561, 19968, 27], [19968, 22528, 28], [22528, 22528, 29], [22528, 24956, 30], [24956, 27387, 31], [27387, 29361, 32], [29361, 31844, 33], [31844, 31844, 34], [31844, 33894, 35], [33894, 34787, 36], [34787, 37882, 37], [37882, 37882, 38], [37882, 37882, 39], [37882, 37882, 40]], "primary_language": ["None", "en", "en", "en", "None", "fr", "fr", "fr", "None", "None", "en", "fr", "None", "None", "fr", "fr", "None", "None", "None", "None", "en", "None", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false], "is_diagram": [true, false, false, true, false, true, false, true, true, true, true, true, false, false, false, true, true, true, true, true, true, true, false, false, true, false, false, false, true, false, false, false, false, true, false, true, false, true, false, true]}}]