[{"id": "71852c3ad16485961c53264847e1ea3ceb085da8", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nL'institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/\n- [ ] Pages damaged/\n- [ ] Pages restored and/or laminated/\n- [ ] Pages discoloured, stained or foxed/\n- [ ] Pages detached/\n- [ ] Showthrough/\n- [ ] Quality of print varies/\n- [ ] Includes supplementary material/\n- [ ] Only edition available/\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nThe following items have been microfilmed at a reduced scale. Maps, charts, graphs, pictures, and plans which are separate from the text are shown below at the appropriate place in the text.\n\nMaps, charts, graphs, pictures, and plans which are separate from the text are shown below at the appropriate place in the text.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nCHARTER AND BY-LAWS\n\nOF THE\n\nTemperance Colonization Society,\n\n(LIMITED.)\n\nToronto:\n\nPRINTED BY HUNTER, ROSE & CO.\nCHARTER\n\nOF\n\nThe Temperance Colonization Society,\n\n(LIMITED.)\n\nCANADA\n\nVICTORIA, BY THE GRACE OF GOD, OF THE UNITED KINGDOM OF GREAT BRITAIN AND IRELAND, QUEEN, DEFENDER OF THE FAITH, &c., &c., &c.\n\nTo all to whom these Presents shall come, or whom the same may in any wise concern, GREETING:\n\nWHEREAS, in and by a certain Act of the Parliament of Canada, known as \"The Canada Joint Stock Companies' Act, 1877,\" it is amongst other things in effect enacted, that the Governor in Council may, by Letters Patent, under the Great Seal, grant a Charter to any number of persons, not less than five, who shall petition therefor, constituting such persons and others who may become Shareholders in the Company thereby created, a Body Corporate and Politic, for any purposes or objects to which the Legislative Authority of the Parliament of Canada extends, except the construction and working of Railways, or the business of Banking, or the issue of paper money, or Insurance, upon the applicants therefor establishing to the satisfaction of the Secretary of State, or of such other officer as may be charged by the Governor in Council, to report\nthereon, due compliance with the several conditions and terms in and by the said Act set forth and thereby made conditions precedent to the granting of such Charter.\n\nAnd Whereas, George Maclean Rose, Publisher; William Pemberton Page, Editor of the Canadian Farmer; Arthur Farley, Merchant; John N. Lake, Land Agent; Joseph Alpheus Livingston, Manufacturer and Importer; David Millar, Merchant; Henry O'Hara, Insurance Agent; Daniel Rose, Publisher; Joseph B. King, Grand Secretary Independent Order of Oddfellows; J. Herbert Bartlett, Manager of the Toronto Bridge Company; Joseph Wild, Doctor of Divinity; J. Watson Hughes, Commission Merchant; John Potts, Doctor of Divinity; William J. Hunter, Doctor of Divinity; Arthur Worth, Accountant; Joseph Lucas, Assistant Inspector Canada Permanent Loan and Savings Company; Charles Mariott, Commercial Traveller; William Reford, Commission Merchant; George Patterson, Merchant; Frederick Weir Harcourt, Solicitor; John Hurst, Insurance Agent; Robert Houghan, Gentleman; Berry Moore, Merchant; Thomas McCracken, Lumber Merchant; Henry E. Caston, Barrister; David S. Keith, Merchant; Thomas B. Rolph, Barrister, all of the City of Toronto in the County of York in the Province of Ontario, in our Dominion of Canada; William Clark, Farmer, and Lawrence C. Lee, Farmer, both of the City of Hamilton, in the County of Wentworth, in the said Province; George Cox, Gentleman, of the City of London, in the County of Middlesex, in the said Province; George Jackson, Land Owner, of Donsview, in the said County of York; David D. Hay, Division Court Clerk, of Listowell, in the County of Perth, in the said Province; Robert Barber, Merchant, of Georgetown, in the County of Halton, in the said Province; Thomas Webster, Grand Scribe of the Sons of Temperance, of Brantford, in the County of Brant, in the said Province; George Douglas, Doctor of Divinity, of the City of Montreal, in the District of Montreal, in the Province of Quebec, in our said Dominion; and Charles Turver, Clergyman, of Davenport, in the said County of York, have petitioned for a Charter under the said Act, constituting them and such others as may become Shareholders in the Company thereby created, a body corporate and politic, under the name of\nTHE TEMPERANCE COLONIZATION SOCIETY,\n\nfor the purpose hereinafter mentioned, and have established to\nthe satisfaction of the Secretary of State for Canada (no other\nofficer having been charged by the Governor in Council to report\nthereon), due compliance with the several conditions and terms\nabove referred to.\n\nAnd Whereas, among other things it is in the notice of this\nApplication and in the said petition averred, and it has been\nestablished, That the amount of the Capital Stock of the\nintended Company is Two Million Dollars, divided into Twenty\nThousand shares of One Hundred Dollars each.\n\nThat the aggregate of the Capital Stock taken is one\nmillion and fourteen thousand four hundred dollars, and the\naggregate paid in thereon is one hundred and two thousand\ndollars, such aggregate has been paid in to the credit of the said\nArthur Farley, John N. Lake and Joseph Alpheus Livingston\nas Trustees for the said Company, in the office of the Molsons'\nBank in the City of Toronto, being a chartered Bank in Canada,\nand is now standing to such credit.\n\nNow KNOW YE, that by and with the advice of our Privy\nCouncil for Canada, and under the Authority of the hereinbefore\nin part recited Act, and of any other power and authority what-\nsoever in Us vested in this behalf, We Do by these Our Letters\nPatent constitute the said George Maclean Rose, William\nPemberton Page, Arthur Farley, John N. Lake, Joseph\nAlpheus Livingston, David Millar, Henry O'Hara, Daniel Rose,\nJoseph B. King, J. Herbert Bartlett, Joseph Wild, J. Watson\nHughes, John Potts, William J. Hunter, Arthur Worth, Joseph\nLucas, Charles Mariott, William Reford, George Patterson,\nFrederick Weir Harcourt, John C. Hurst, Robert Houghton,\nBarry Moore, Thomas McCracken, Henry E. Caxton, David S.\nKeith, Thomas B. Rolph, William Clark, Lawrence C. Lee,\nGeorge Cox, George Jackson, David D. Hay, Robert Barber,\nJohn R. Barber, Thomas Webster, George Douglas and Charles\nTurner, and all others who may become shareholders in the said\nCompany, a body corporate and politic, by the name of\n\nTHE TEMPERANCE COLONIZATION SOCIETY,\nwith all the rights and powers given by the said Act, and for\nthe purposes of\n(a) Acquiring a tract or tracts of land in the North-West Territories of Canada, with a view of colonizing and settling the same.\n\n(b) With power to contract with the purchasers and settlers of the lands that intoxicating liquors or alcoholic beverages shall not be manufactured or sold in the settlement.\n\n(c) To purchase, take, lease, exchange or otherwise acquire any real and personal property and any rights or privileges necessary or convenient for the Company in any part of Canada.\n\n(d) To develop the resources of the lands acquired by building, planting, clearing, cultivating, or otherwise dealing with the same.\n\n(e) To aid, encourage and promote immigration into the property of the Company, and to colonize the same and for the purposes aforesaid to lend and grant any money.\n\n(f) To aid by way of bonus or otherwise in the construction and maintenance of a line or lines of steamboats or barges from and through the lands of the Company to some point or place on or near and in connection with an existing or established line of railway, and to make, provide, and carry on, use and work tramways, telegraph lines, canals, reservoirs, aqueducts, roads, streets and other works which may be deemed expedient in promoting the objects of the company.\n\n(g) To buy, manufacture and sell all kinds of goods, chattels and effects required for the company, or by any person who may settle on the property of the company.\n\n(h) And for such purposes to have all necessary powers for borrowing and investing moneys, selling and disposing of real and personal property, and such other powers as are necessary and incident thereto throughout the Dominion of Canada.\n\nThe Capital Stock of the said Company shall be Two Million Dollars, divided into Twenty Thousand shares of One Hundred dollars each, subject to the increase of such Capital Stock under the provisions of the said Act. That the said George Maclean Rose, William Pemberton Page, Arthur Farley, John N. Lake, and Joseph Alpheus Livingston, are to be the first or Provisional Directors of the said Company.\n\nProvided always that nothing in these Presents expressed or contained, shall be taken to authorize the construction or working of Railways, the business of Banking, or the issue of paper money, or of Insurance by the said Company.\n\nIn Testimony Whereof we have caused these our Letters to be made Patent and the Great Seal of Canada to be hereto affixed.\nTEMPERANCE COLONIZATION SOCIETY.\n\nWITNESS: Our Right Trusty and Well-beloved Councillor, Sir John Douglass Lutherland Campbell, (commonly called the Marquis of Lorne), Knight of our Most Ancient and Most Noble Order of the Thistle, Knight Grand Cross of our Most Distinguished Order of Saint Michael and Saint George, Governor-General of Canada, and Vice-Admiral of the same.\n\nAt our Government House, in the City of Ottawa, this Fourteenth day of March, in the year of our Lord One Thousand Eighteen Hundred and Eighty Two and in the Forty-fifth year of Our Reign.\n\nBy Command.\n\n(Signed), J. J. MOUSSEAU,\n\nSecretary of State.\nBY-LAWS\n\nof\n\nThe Temperance Colonization Society,\n\n(LIMITED.)\n\n(Adopted at Meeting of Shareholders, 5th July, 1882.)\n\nTHE SOCIETY AND ITS OBJECTS.\n\nThe Society is established for the purpose of advancing the cause of Temperance, by colonizing tracts of land in the Dominion of Canada, where liquor cannot be manufactured, sold or imported, and for other purposes specified in the Charter granted it under the Great Seal of the Dominion of Canada.\n\nBOOKS.\n\n1. The Society shall pursuant to \"The Canada Joint Stock Companies Act, 1877,\" keep at their chief place of business, which shall be in the City of Toronto, and Province of Ontario, a book called \"The Register of Transfers\" and a book called \"The Reference Book,\" open during business hours of every day, except Sundays and holidays, to inspection of shareholders and creditors.\n\nCAPITAL STOCK.\n\n2. The Capital Stock of the Society shall consist of Twenty Thousand Shares, of One Hundred Dollars each.\n\n3. The Directors shall have power to determine the conditions and terms on which the same or any portion thereof, shall be issued and payable, and may, subject to the confirmation of the Shareholders, determine the premium to be paid on unissued stock, and all premiums received shall be added to; and form part of the funds of the Society.\n4. All persons taking shares in the Society shall sign a covenant to observe the Rules of the Society, and all persons accepting transfers of stock, shall thereby become subject to all the Rules and By-laws of the Society.\n\n5. No shares whereof the whole amount has not been paid in, shall be transferable without the consent of the Directors, nor shall any share be transferable until all previous calls thereon have been fully paid, and no transfer of shares shall be valid unless made in the books of the Society.\n\n6. Any Shareholder may, subject to the conditions of the preceding By-law, transfer his share or shares by causing an entry of such transfer to be made in the books of the Society in such manner as the Directors may appoint, and upon acceptance thereof, the Transferee shall be entitled to all the privileges of the original Shareholder.\n\n7. The Society shall have a preferential lien on the shares of every Shareholder, and also on all the moneys in the possession of the Society belonging, or due to any Shareholder whether for deposits or otherwise, for any debt due to the Society, and such moneys may be applied to the account of such Shareholder in payment of his debt, in such manner as the Directors deem fit.\n\n8. Calls upon the subscribed stock of the Society shall be made by notices demanding payment of same, sent through the post in registered letters, addressed to the members at their place of abode, as appearing on the books of the Society, and shall be payable by each member within sixty days after the day of putting into the post the notice addressed to him or her. No call shall exceed ten per cent. of the subscribed capital.\n\n9. The Directors shall have power to declare forfeited all shares, and the money paid thereon, upon which any call shall have remained unpaid for four months after the same shall have become due and payable, and such forfeited stock shall be the property of the Society, and may be disposed of by the Directors for the benefit of the Society.\n\n10. Certificates of stock shall be issued for paid-up shares, or be granted for payments of any call or instalment upon the stock; such certificates are to be under seal of the Society and signatures of the President, or in his absence the Vice-President,\nor other person duly appointed by the Board of Directors, and of the Manager, or other person appointed by said Board to take his place.\n\nGENERAL MEETINGS.\n\n11. An annual general meeting of the shareholders shall be held at the offices of the Society, or such place as the Directors may appoint, on the second Wednesday in March in each year, for the purpose of electing Directors, and for all general purposes relating to the management of the Society, and at each of the said annual general meetings shall be submitted a full and clear printed statement of the affairs of the Society for the year ending on the thirty-first day of December then last past. Such meeting shall be called by notice of time and place of holding same, printed in two leading newspapers published in the City of Toronto aforesaid, twenty-five days previous thereto.\n\n12. A special meeting of the Shareholders, for any special business, may be called by the Directors, upon the Shareholders being notified of such meeting and of such business by circular mailed twenty-five days before the day appointed for same, in registered letters, addressed to them individually at their place of abode, as appearing on the books of the Society. And any such meeting, and the annual general meeting, may be adjourned from time to time, and at such adjourned meeting such business may be transacted as might have been transacted at the meeting from which the adjournment took place. And one-fourth part in value of the shareholders of the Society shall at all times have the right to call a special meeting thereof for the transaction of any business specified in such notice as they may issue to that effect, mailed as above to each Shareholder.\n\n13. At all general or special meetings of the Society, each Shareholder shall be entitled to give one vote for each share then held by him; such votes may be given in person or by proxy—the holder of any such proxy being himself a Shareholder. No Shareholder shall be entitled either in person or by proxy to vote at any meeting unless he shall have paid all calls upon all the shares held by him. The majority of votes shall determine all questions submitted to the meeting for consideration, and in case of an equality of votes, the chairman\npresiding shall have the casting vote, and at any such meeting the President, or in his absence the Vice-President, or in their absence, such person as the meeting may appoint, shall be chairman.\n\nDIRECTORS.\n\n14. The affairs of the Society shall be under the control and management of a Board of fifteen Directors, seven of whom shall form a quorum of said Board for the transaction of business. No person shall be qualified to act as Director unless he is in known sympathy with the temperance movement, and also in favor of the abolition of the liquor traffic, owns one hundred shares, absolutely in his own right, and is not in arrear in respect of any call thereon. The Directors shall choose from among themselves a President, a Vice-President, and a Manager. The President, and in his absence, the Vice-President, or in his absence, such person as the Board may appoint, shall be chairman of the Board meetings, and in case of any equality of votes, the Chairman shall have a casting vote.\n\n15. The election of Directors shall be by ballot, and shall take place at the annual general meeting, or if not then held, at any special meeting.\n\n16. The Board shall have power to make any By-laws and Regulations for the guidance of the Society, its officers, agents and shareholders, not inconsistent with the Letters Patent of the Society, or contrary to law.\n\n17. The President and Directors shall be paid for their services such sums as may be voted at the annual or any general meeting, and shall be indemnified out of the funds of the Society against all costs, charges and expenses which he or they or any of them may incur in or about or in relation to the affairs of the Society, unless such costs, charges or expenses be occasioned by his or their or some of their own wilful neglect or default, and the Board may pay the same and all expenses incurred in promoting the formation of the Society.\n\n18. The Directors may, if they think fit, receive from any member willing to advance the same, all or any part of the amounts due on the shares held by such member beyond the sums then actually called for, and upon the moneys so paid in advance, or upon so much thereof as shall from time to time\nexceed the amount of the calls then made upon the shares in respect of which such advance shall be made, the Society may pay interest at such rate, not exceeding eight per cent per annum, as the member paying such sum in advance and the Directors shall agree upon.\n\n19. The Directors shall, at a special meeting of the Board called for that purpose, or at any other meeting, if all the remaining Directors be present, have power to fill up any vacancy that may arise in their own body, or in any office of the Society, and may, by vote of four-fifths of the Directors present, at a special meeting of the Board called for that purpose, remove any Director from office, and fill up the vacancy so created.\n\n20. The Board may appoint such officers and agents, with such duties and powers as the business of the Society may require, and at such remuneration as the Board may determine.\n\n21. The Board may make and carry out all arrangements with any chartered Bank doing business in Canada, or any Banking Company in Great Britain or Ireland, for conducting such financial matters as they deem necessary.\n\n22. The Board may make all necessary arrangements to obtain such lands as they may deem desirable for the uses of the Society or for investment, and in doing so shall have all the necessary powers to buy and sell lands and determine the times and modes of paying for the same, and may make such purchases when they deem it in the interests of the Society to do so.\n\n23. No contract shall be valid or binding on the Society unless it is made by the Board of Directors, and has the seal of the Society and the signatures of the President and Manager attached thereto.\n\nAPPLICATION OF FUNDS.\n\n24. All moneys which belong to the Society shall, after providing for expenses, existing and accruing liabilities, and the capital account, be appropriated in their discretion by the Directors in paying such dividend as they deem advisable on the stock held by each Shareholder, and the Directors may in their discretion, out of the profits of the Society, ex-\npend such sums as they think fit in helping settlers and promoting the general improvement of the settlement.\n\nPRESIDENT.\n\n25. The President shall sign and authenticate by the Seal of the Society all deeds, notes, cheques and bills of exchange, and instruments requiring seal and drafts on the bank, and in case of his absence through illness or unavoidable cause, the Vice-President, or, in case of his absence through illness or unavoidable cause, such person as the Board shall appoint shall fulfill all the said duties of the President. The President to be ex-officio member of all committees, and also have general oversight of all the affairs of the Society.\n\nMANAGER.\n\n26. The Manager, under direction of the Board, shall have the custody and care of the Books, Papers, Securities and other office property of the Society, and shall (or in his absence, such person as the Board shall appoint) sign all deeds, notes, cheques, bills of exchange, receipts and instruments under the seal of the Society. He shall deposit, or cause to be deposited, from time to time, with the Bankers of the Society, all such sums of money as he may have in hand, and shall draw out such moneys by cheque countersigned by the President, or in his absence by some one appointed by the Board for this purpose. He shall keep a correct record of the meetings of the Board, and shall see that all necessary books and records of the Society are regularly and properly kept. He shall call all meetings of the Society and Directors, and prepare all statements and sign all circulars and notices save where otherwise provided; and also shall be ex-officio member of all committees.\n\n27. The Manager, or other person appointed to any office in anywise concerning receipt of money, shall give security in such form, and for such amount as the Board may determine for faithful performance of his duties.\n\nAUDITORS.\n\n28. Two or more Auditors shall be appointed at the first annual meeting, and afterwards annually by the Shareholders, to\nexamine and audit the books and accounts and all documents having reference financially or otherwise to the business of the Society, and they shall submit a full and certified statement of the affairs of the Society up to the thirty-first day of December in each year, as soon after date as same can be prepared, to the Directors, and to the Shareholders at the annual general meeting. The Auditors shall be paid such sum as the Shareholders at the annual general meeting shall determine.\n\n29. Any Officer shall be removed from his office only at a meeting of Directors specially called for that purpose, but may be at any time suspended from office by the Board until such meeting.\n\n30. The Board shall from time to time inspect the books, accounts, properties, and securities of the Society, and may appoint one or more competent persons to transact such or any other special business for the Society, and grant such person or persons such remuneration as they think reasonable.\n\nCONSTRUCTION OF BY-LAWS.\n\n31. In case of any dispute as to the practical application of these by-laws, the construction put upon them by the Board shall be final and conclusive.\n\nAMENDMENTS.\n\n32. No part of these By-Laws shall be repealed or altered, unless a proposition to that effect in writing be sent to the Secretary at least thirty days previous to the calling of a meeting to take action thereon, when, if two-thirds of the members present vote in favor of the same, it shall be adopted; provided, however, it shall be in the power of a general meeting of the Society or of the Board of Directors to suspend any article of these By-Laws by a two-thirds vote of the members present, excepting this article; but such suspensions shall in no case go beyond the meeting in which it is suspended.\nORDER OF BUSINESS.\n\nThe following shall be the order of business in the Board meetings:\n\n1. Reading minutes of preceding meeting.\n2. Receiving and acting on reports of Manager and Special Committees.\n3. Receiving and acting on reports of Standing Committees.\n4. Receiving applications for transfers.\n5. New business.\n6. Notices of motions.\nEXTRACTS\n\nFROM\n\n\"The Canada Joint Stock Companies Act, 1877.\"\n\n36. The Company shall cause a book or books to be kept by the Secretary or by some other officer especially charged with that duty wherein shall be kept recorded:\n\ni. A copy of the Letters Patent incorporating the Company, and of any supplementary Letters Patent and of all By-Laws thereof;\n\nii. The names, alphabetically arranged, of all persons who are or have been Shareholders;\n\niii. The address and calling of every such person while such Shareholders;\n\niv. The number of Shares of Stock held by each Shareholder;\n\nv. The amount paid in and remaining unpaid respectively on the Stock of each Shareholder;\n\nvi. The names, addresses, and calling of all persons who are or have been Directors of the Company, with the several dates at which each became or ceased to be such Director;\n\nvii. A book called the Register of Transfers shall be provided and in such book shall be entered the particulars of every transfer of shares in the Capital of the Company.\n\n37. Such books shall, during reasonable business hours of every day, except Sundays and Holidays, be kept open for the inspection of Shareholders and Creditors of the Company and their personal representatives, at the office or chief place of business of the Company, and every such Shareholder, Creditor, or Representative may make extracts therefrom.\n38. Every Company neglecting to keep such book or books as aforesaid shall forfeit its corporate rights.\n\n40. Every Director, Officer, or Servant of the Company who knowingly makes or assists to make any untrue entry in any such book, or who refuses or wilfully neglects to make any proper entry therein, or to exhibit the same or to allow the same to be inspected, and extracts to be taken therefrom, is guilty of a misdemeanour.\n\n42. No transfer of shares whereof the whole amount has not been paid in shall be made without the consent of the Directors, and whenever any transfer of shares not fully paid in, has been made with such consent to a person having apparently insufficient means to fully pay up such shares, the Directors jointly and severally shall be liable to the creditors of the Company, in the same manner and to the same extent as the transferring shareholder, but for such transfer, would have been; but if any Director present when any such transfer is allowed, do forthwith, or if any Director then absent, do within twenty four hours after he shall have become aware thereof and able so to do, enter on the minute-book of the Board of Directors his protest against the same, and within eight days thereafter publish such protest in at least one newspaper published at, or as near as may be possible to the office or chief place of business of the Company, such Director may thereby and not otherwise exonerate himself from such liability.\n\n69. The Directors of the Company shall be jointly and severally liable to the clerks, labourers, servants and apprentices thereof for all debts not exceeding six months wages due for service performed for the Company while they are such Directors respectively; but no Director shall be liable to an action therefor, unless the Company has been sued therefor within one year from the time when he ceased to be such Director, nor yet before an execution against the Company has been returned, unsatisfied in whole or in part; and the amount due on such execution shall be the amount recoverable with costs, against the Directors.\n78. The Company shall paint or affix, and shall keep painted or affixed its name, with the word \"Limited\" after the name on the outside of every office or place in which the business of the Company is carried on in a conspicuous position in letters easily legible, and shall have its name with the said word after it engraved in legible characters on its seal, and shall have its name with the said word after it mentioned in legible characters in all notices, advertisements and other official publications of the Company, and in all bills of exchange, promissory notes, endorsements, cheques and orders for money or goods purporting to be signed by or on behalf of such Company, and in all bills of parcels, invoices and receipts of the Company.\n\n79. If the Compan. does not paint or affix and keep painted or affixed its name with the word \"Limited\" after it in manner directed by this Act, it shall be liable to a penalty of twenty dollars, for not so painting or affixing its name, and to a penalty of twenty dollars per day, for every day during which such name is not so kept painted or affixed, and every Director and Manager of the Company who shall knowingly and wilfully authorize or permit such default shall be liable to the like penalties, and if any Director, Manager or Officer of such Company, or any person on its behalf uses or authorizes the use of any seal purporting to be a seal of the Company, whereon its name with the word \"Limited\" after it, is not so engraven as aforesaid, or issues or authorizes the issue of any notice, advertisement or other official publication of such Company, or signs or authorizes to be signed on behalf of such Company, any bill of exchange, promissory note, endorsement, cheque, order for money or goods, or issues, or authorizes to be issued any bills of parcels, invoices or receipt of the Company, wherein its name with the said word after it is not mentioned in manner aforesaid, he shall be liable to a penalty of Two Hundred Dollars, and shall further be personally liable to the holder of any such bill of exchange, promissory note, cheque or order for money or goods, for the amount thereof, unless the same is duly paid by the Company.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30695.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 25, "total-input-tokens": 43156, "total-output-tokens": 8003, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2037, 3], [2037, 4478, 4], [4478, 4478, 5], [4478, 4593, 6], [4593, 4593, 7], [4593, 5734, 8], [5734, 7995, 9], [7995, 10165, 10], [10165, 12591, 11], [12591, 13218, 12], [13218, 13218, 13], [13218, 14518, 14], [14518, 16786, 15], [16786, 19044, 16], [19044, 21247, 17], [21247, 23301, 18], [23301, 25312, 19], [25312, 27094, 20], [27094, 27434, 21], [27434, 28810, 22], [28810, 30902, 23], [30902, 33103, 24], [33103, 33103, 25]], "primary_language": ["en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]