[{"id": "0e743b6e03b571cf92c324f116143afae5508d7e", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nTWELFTH EDITION\nOF\nA LECTURE\nON\nAMERICAN HISTORY\nANTERIOR TO\nCOLUMBUS.\n\nBoston:\nDutton and Wentworth's Print.\n1844.\nDISCOVERY\nOF\nNEW-ENGLAND\nBY THE NORTHMEN\nFIVE HUNDRED YEARS BEFORE COLUMBUS,\nWITH AN INTRODUCTION\nON THE\nANTIQUITIES OF AMERICA AND ON THE FIRST INHABITANTS OF CENTRAL AMERICA.\nWITH IMPORTANT ADDITIONS.\n\nA LECTURE,\nDELIVERED IN NEW YORK, WASHINGTON, BOSTON, AND OTHER CITIES:\nALSO IN SOME OF THE\nFIRST LITERARY INSTITUTIONS OF THE UNION.\n\nBY A. DAVIS,\nFORMERLY CHAPLAIN OF THE SENATE, ETC. NEW YORK.\n\nTWELFTH EDITION.\n\nBoston:\nDUTTON AND WENTWORTH'S PRINT.\nNos. 10 and 12 Exchange Street.\n\n1844.\nTO THE PUBLIC.\n\nThe generous patronage received for the delivery of the following Lecture leads to its publication. Though faint the ray of knowledge it may impart, yet I trust it will be seen, and its benefits rewarded, while exhibited in a different medium.\n\nThe circulation of eleven editions, shows that this hope of success has not been disappointed.\n\nTogether with original matter, the Lecture is a compilation from various important works. Facts have been obtained from the first libraries in Boston, Worcester, Philadelphia, Washington and Georgetown.\n\nThe continued encouragement received from sources like the following, from the distinguished Ornithologist, the pride and glory of both continents, encourages me in issuing another edition:\n\nBUFFALO, New York, Aug. 1st, 1844.\n\nI have read the \"Antiquities of Central America and the Discovery of New England by the Northmen five hundred years before Columbus,\" by A. Davis, Esq., with extreme pleasure and satisfaction; and I feel much indebted to that learned gentleman for all that he has said on this most interesting subject, in his memorable Lecture, above mentioned, and I trust that it will be as highly appreciated by all who may peruse it as by myself.\n\nI take this opportunity to offer to Mr. Davis my sincere thanks for his goodness to me, and have great pleasure in subscribing myself his friend and respectful humble servant,\n\nJOHN J. AUDUBON.\n\nTo A. Davis, formerly Chaplain of the Senate, &c. N. Y.\nINTRODUCTION.\n\nANTIQUITIES OF AMERICA.\n\nWhile the beauties of the visible creation fade on the eye—while all nature reposes under the mantle of night, it is pleasant to leave the haunts of business for the lecture-room, and to survey remote periods under the light of history.\n\nThe active mind of man instinctively surveys the dark regions of the past, and would gladly break the unfathomable silence of the nations of the dead, and raise the veil where their beauty and glory have slept for ages. This strong desire to learn something of those who lived when time was young, leads the antiquary, too often, to adopt groundless theories. But if there are counterfeit antiquities, there are those, also, that are genuine. The present is an age peculiar for developing the latter.\n\nThat America was peopled by those in advance of the savage state, long before any authentic accounts are given of settlements, is manifest from nameless monuments of antiquity, found in various parts.\n\nIt will be recollected that the avaricious Spaniards discovered and conquered Mexico on the North, and Peru and Chili on the South of Central America, in the first place. But, at length, the solitude of the latter was broken; and there was discovered the \"El Dorado,\" about which the whole Spanish nation had so long been dreaming.\n\nThe appearance of these ruins shows that a nation once existed there, highly skilled in the mechanic arts, and in a state of civilization far beyond any thing that we have been led to believe of the aborigines, previous to the time of Columbus.\n\nThe Antiquities of America were left in succession by nations more or less enlightened. Central America was probably the source whence the rays of light diverged in all directions. Such is now becoming the Herculaneum of the Western World.\n\nThe first knowledge of the Ruins of Central America was derived from accounts given by straggling hunters. In 1787, the Spanish government sent out Del Rio to survey the ruins. Waldeck, in 1822, published an account of Rio's discoveries.\n\nCapt. Dupaix was sent on a mission to Central America, in 1805. Lord Kingsborough gave an account of Dupaix's discoveries. William H. Prescott, Esq., of Boston, has the work of Lord K. It is as splendid as it is expensive; and it presents very beautiful and striking views of buildings and likenesses of the inhabitants.\nWaldeck visited the South in 1832. Among the hieroglyphics he thinks he has deciphered an account of the reign of eleven queens.\n\nThe late Gov. Galindo, of Peten, in Central America, has corresponded with the late Lieut. Gov. Winthrop, Boston, relative to the antiquities of that region. For the great discoveries made, he has received a premium from one of the literary societies of Europe.\n\nHe, in speaking of one of the cities in the vicinity of Palenque, says that a gigantic Massica, or bread-fruit tree, grows on one of the altars encircling it with its powerful roots. The most remarkable trees growing over the ruins, are, the Mahogany, Cedar, Chocolate, &c. One of the squares of the city is surrounded with six handsome obelisks, the highest of which is more than six yards high. They all bear, in basso relievo, gigantic figures. One temple has eighty such figures.\n\nThe temple of Copan was 653 feet by 524 feet in dimensions. It must have been as large as St. Peter's Church in Rome. Let us gaze on this mighty structure, for our instruction. It stands as a landmark on the broad field of time—it reminds us of the remote origin of a great empire. Centuries must have rolled away—dynasties must have succeeded each other, before orders of architecture were introduced; and a long time must have elapsed before an empire would become so luxurious as to erect the stupendous temple of Copan.\n\nAmong the vast pile of ruins, is found an architrave of black granite, finely cut. Six granite columns are seen, each of a single piece, seventeen feet high and three feet in diameter.\n\nThe Mayon architecture in Yucatan is said to be superior to that of Palenque. It is wrought in stone, and finished with great elegance.\n\nGen. Santa Anna says, that the antiquities of Central America are worthy of being placed in parallel with the pyramids of Egypt.\n\nPalenque, which lies 240 miles from Tobasco, lat. 17° N., is among the most remarkable cities of the South. Pulenque is a Castilian word, and means \"lists for fighting.\"\n\nThis city has emphatically been called the Thebes of America. In surveying its ruins, the traveller is led to believe that it was founded at as early a period as the renowned cities of Egypt.\n\nHow immense this city! It is supposed to have been sixty miles in circumference, and that it contained a population of nearly three millions.\n\nPalenque, lying about one thousand miles from Mexico, and being elevated five thousand feet above the ocean, enjoyed a climate almost unequalled for its pleasantness. The natural beauty of the scenery was unrivalled, the soil rich and fertile beyond any other portion of the globe.\n\nOne of the principal structures revealed to the eye of the antiquarian, is the Teoculi, or temple. Its style of architecture resembles the Gothic. It is rude, massive, and durable. Though resembling the Egyptian edifices, also, yet this and the other buildings are peculiar, and are different from all others hitherto known.\n\nThe entrance to this temple is on the east side, by a portico more than one hundred feet in length, and nine broad. The rectangular pillars of the portico have their architraves adorned with stucco work\nof shields and other devices. The temple stands on an elevation of sixty feet. Among the ruins, different objects of worship have been found; and, in particular, an idol of pure gold, about six inches long. Amid this wilderness of ruins are now to be seen fourteen large stone buildings, with many of their apartments in good condition.\n\nThe antiquity of this city is manifest, not only from its nameless hieroglyphics and other objects, but from the age of some of the trees growing over buildings where once the hum of industry and the voice of merriment were heard. The concentric circles of some of these trees were counted, which showed that they were more than 900 years of age.\n\nSimilar beautiful and majestic ruins to those named above, are found along the coast of California. Humboldt visited a splendid building, 800 miles from Mexico, that forty years since was seven stories high. The Spaniards have demolished it mostly, to get materials for building dwellings and sugar-houses. Have not the vandals of the New World made desolation more desolate?\n\nMr. Stephens's new work on \"Central America,\" confirms the statements of other travellers, while it heightens our wonder by the graphic description of the ruins of the desolate cities, especially of those found in Copan and Palenque. There, he says, \"architecture, sculpture, painting, and all the arts that embellish life, had flourished in an overgrown forest.\"\n\nAmong the specimens of the arts, he found massive obelisks, bearing on their sides sculptured images and medallion tablets—large altars ornamented with hieroglyphics, giving a record of those who reared them—splendid temples adorned with human figures, executed in stucco and bas-relief—walls built of hewn stone. The specimens of sculpture equalled any thing he saw in Egypt.\n\nIn his second work he says, \"These ruins are skeletons rising from their graves, wrapped in their shrouds, claiming no affinity with the works of any known people.\" Long will these works of art stand alone in majesty and beauty,\n\n\"And gorgeous as the sun at midsummer.\"\n\nThe Chevalier Frederichal, attache of the Austrian legation, lately spent nine months at the South. He found, in a place hitherto untrod by modern travellers, a majestic group of pillars. There were ten rows, and in each row there were forty-eight columns. With his daguerreotype apparatus, he took a great number of excellent impressions. From these, when magnified, he has made drawings, which show the original, by their richness, elegance and finish, to be the work of a highly cultivated people. It is natural that we should linger around these inanimate objects. They remind us of splendid cities that, like Troy, once \"were.\" But, above all, they tell us of the illustrious of other days. What are ruins to us, but as they remind us of the enterprise and wisdom of those who reared them? What were Carthage without the recollection of ill-fated Dido, or the daring deeds of Hannibal? And what will Mount Vernon be centuries hence, but as it will remind our posterity of the valor, patriotism and virtues of the Father of our Republic?\nThe monumental history of Central America tells us that this is not a new world. And we wake with astonishment, that there was once the seat of a great empire, before David reigned over the twelve tribes of Israel, or Octavius waved his sceptre over the civilized world!\n\nBut, alas! the founders of cities as magnificent as those that adorned the banks of the Nile, have vanished like the generations before the flood.\n\n\"Every house is builded by some man;\" but who erected the splendid temples of Palenque, none can tell, save \"He who made all things.\" Unnumbered centuries have passed away since the noonday of Palencian glory. There the wing of endless night broods over all that was once beautiful and grand—\n\n\"Where senates once the weal of nations planned,\nHissoth the gliding snake, through heavy weeds\nThat clasp the mouldering columns.\"\n\nI have seen an original representation, in stucco, of the following Palencian head, in the possession of Professor Dod, Princeton College:\n\nShade of Spurzheim, tell, if thou canst, what qualities such a formed head as this, implies.\n\nThis helmet is said to resemble those described by Homer.\n\nOh! that some mighty genius like that of Belzoni, would arise and remove, from this city of the world called new, the veil that conceals its origin.\n\nIt is supposed that this city was destroyed by some internal convulsion, or, like those of the South of Europe, was overwhelmed by the barbarians of the North.\n\nPossibly, famine or pestilence might have desolated that fair region.\nIt is not singular that it should have been concealed from view for ages, when we recollect that cities of the Eastern continent have, in like manner, remained in oblivion till of late. We allude to the ruins of Paestum, in Campania, of Italy, and those of Petra of Idumea, in Asia. A new forest hid for centuries—the former from the degenerate sons of Rome, while the splendid structures of Petra were known only to Bedouins for over a thousand years. Who does not delight to read about the roses of Paestum! Yet they still unfold their inimitable petals amid the ruins of palaces, and beside dilapidated temples.\n\nDo we admire the boundless forests, the lofty mountains, and the majestic rivers of our hemisphere? The vast wilderness of ruins, once enlivened by intelligent beings, should demand a higher claim to our admiration.\n\nThe antiquities of America stretch from the great lakes of the North and West, to Central America and the Southern parts of Peru on the South; from the Alleghany mountains on the East, to the Rocky mountains on the West; and even from the Pacific to the Atlantic ocean.\n\nThe Mexicans hold the next place on the scale of civilization to the Central Americans.\n\nThe Toltecs probably came into Anahauc, or the vale of Mexico, the beginning of the seventh century. They flourished four centuries and suddenly disappeared. They were an enlightened and amiable people. Though pagans, they did not, like the Aztecs, who took possession of the country in 1325, offer up human sacrifices.\n\nAlthough the Aztecs, or Mexicans, excelled in astronomy, architecture, the fine arts, agriculture, legislation, jurisprudence, and the display of many of those social virtues that dignify humanity, yet their theology cast a dark shade over all the attractions their history otherwise displays.\n\nThey believed in one Supreme God, in thirteen subordinate deities, and in over two hundred inferior ones. The god who received most devotion was Mars, their god of war. On his altar human victims bled. To this Moloch of the West twenty thousand victims at least were offered annually! The Aztecs were cannibals. Such is man where he sees not the attributes of God in the \"things that are made.\" Yes, all nature is but the reflection of the True God. The modest violet, fresh from the sleep of winter, tells him that there is a God, and that He is great and good. (See Rom. 1:20.) No light but the bright beams of the \"Sun of Righteousness\" can dissipate the darkness with which man has enshrouded his moral nature.\n\nRemarkable was the progress of the Mexicans in the science of Astronomy. Their year was divided into eighteen months of twenty days each, and five unlucky days. As the year is composed of nearly six hours more than three hundred sixty-five days, there still remained an excess, which they provided for by intercalation. At the expiration of fifty-two years, the end of a cycle, they interposed twelve and a half days, the number which had fallen in arrear. Time was marked on their calendar stones with as much accuracy as is evinced by the modern improvements of astronomy into two minutes and nine seconds.\nin the year. I have seen in the Museum of Mexican Antiquities, belonging to the Philosophical Society, Philadelphia, a beautiful representation of the large calendar stone to be seen in the city of Mexico.\n\nHow magnificent must have been that temple in Mexico, at whose altars five thousand priests officiated. But the city of Tezcuco, on the opposite shore of the lake, was still the seat of a higher advance in civilization than was displayed in Mexico. It was the capital of a splendid kingdom of the same name. It was the Athens of the Western World. The king erected a magnificent pile of buildings. It extended from east to west 1234 yards, and from north to south 978. Innumerable were the attractions that met the eye on wandering through the courts of this majestic structure.\n\nAs walls incrusted with alabasters and richly tinted stucco, tapestries of variegated feather work, gardens with baths, and sparkling fountains overshadowed by groves of cypress and cedar.\n\nMuch has been learned in relation to Mexican history, but much must remain forever concealed, as the first Archbishop of Mexico caused a mountainous pile to be made of the MSS. of that country and ordered them to be burnt in the market place. Such was the loss effected by the Omar of the West.\n\nWe know less of the antiquities of South America than of those further north. Those that have been recorded show a people far advanced in civilization.\n\nThe antiquities of North America are quite different from those further south,—consisting of Fortifications, Mounds, Pottery, Metallic Instruments, &c. They must have been left by intelligent nations at an early period. This is evident from the remark of the late President Harrison. He observes, that it would take the trees growing where a forest was cut down fifty years since, five hundred years to equal in height the surrounding woods, and that a forest of the largest trees at the mouth of the Great Miami, consisting of fifteen acres, covers the ruins left by former races.\n\nFirst Inhabitants of America.—We will not say, as the Athenians said of their nation, that the first inhabitants of America were created when the sun was first lit up in the sky; but we must presume they early reached this continent from the old world.\n\nThe learned Dr. Clarke says, that the continents were once united; but that, by the force of winds and waves, the isthmuses were broken up and formed into islands along the coasts. Easy, however, is the transition from the East to the West, by the way of Bering's straits, when we consider that they are only thirteen leagues wide.\n\nAdverse winds also might have driven the frail vessels of the ancients to the region lying on the gulf of Mexico, and elsewhere.\n\nBut, as tropical animals found in America could not have crossed over by Bering's straits, when frozen, they must have come by land that once extended from Asia or Africa to America, in the torrid zone. Should it be asked why certain animals, as the horse and the cow, not found originally on this continent, did not cross by this continuous range of lands, we answer, because the original continent was divided,\nas possibly in the days of Peleg, (Gen. 10, 25,) before such animals had an opportunity to migrate.\n\nI am inclined to believe that the land that united the now two continents, was the Atlantis spoken of by Plato, Homer, and Hesiod. Plato saw an account of this land which disappeared, in the hieroglyphics of Egypt. I saw 'n the Jesuit's College, Georgetown, an important article on this subject. It was stated that there were the remains of a sunken tract of land once lying between Brazil and Africa—that such are seen also in the islands of Cape Verd and Ascension, and others—and in the numerous sandbanks observed by Bauche in particular, who sounded that part of the Atlantic with great accuracy.\n\nI think from the plains of Shinar, men and animals diverged in all directions. As it is said in Gen. 11, 8, \"So the Lord scattered them from thence upon the face of all the earth.\"\n\nAs the Europeans on coming here found no animals peculiar to the Eastern Continent, I think only a part of the various species preserved by Noah migrated West. Those left behind ever remained different from those found in the New World by the Spaniards. If this idea is new to others, I hope it may be considered more reasonable than the infidel opinion, that men and animals were distinct creations here from those of Asia.\n\nThink you they would have transported venomous serpents from the old to the new world?\n\nOgilby, Cosmographer to the English sovereign, 1671, thinks that men and animals came, immediately after the flood, from Armenia to Tartary; and from the latter place to this continent, by a continuous range of land extending from Asia to America by Bhering's straits.\n\nI think with Georgii Hornii, who published his views, 1629, in a Latin book, that this migration to this continent took place immediately after the confusion of tongues at Babel.\n\nBy this primitive people, the cities of the South rose probably simultaneously with those that adorned the banks of the Nile.\n\nThe traces of an extinct race of men about nine feet in length, are to be found in various parts, as in Ohio, Kentucky, Pennsylvania, Rhode Island, and New York.\n\nAnd is it strange it should have been said in the Sacred volume—\"And there were giants in those days?\"\n\nThe lights of science and revelation commingle, forming one broad stream of light, that is not lost but amid the radiance that encircles the throne of the Eternal.\n\nThe eyes of mankind, from the time of Pythagoras, have been turned to the West, in the anticipation that here new discoveries were to be made; and hither were the adventurous at length led.\n\nIt is possible that the Northmen, as well as those of earlier times, had heard of a Western world.\n\nSeneca, Diodorus Siculus, and Aristotle, speak of regions beyond the Atlantic. Plato says he saw an account in the hieroglyphics of Egypt, of a large tract of land, Atlantis, that once lay West of the straits of Gibraltar.\nIt is thought Virgil alludes, in the following lines, to places West. In speaking of Augustus, he says that—\n\n\"He shall his power to India extend,\nBeyond the annual circle, and beyond\nThe sun's long progress, where great Atlas bears,\nLaden with golden stars, the glittering spheres.\"\n\nFirst known Discoverers of America.—It is thought Bjarne was accidentally driven by fierce winds on the coast of Newfoundland, before Lief sailed to the West.\n\nThe discovery of America by the Northermen, excites a vast deal of curiosity. And is it not a laudable curiosity that leads one to ascertain what white men first trod regions in which the modest wild flower wasted its sweetness on the desert air?\n\nAs Geography is one of the eyes of History, it would be well, at this time, to direct the attention to the map of North America, and to those of Massachusetts and Rhode Island in particular.\n\nThe Royal Society of Northern Antiquarians in Copenhagen, have lately published an important work. While the contents of this massive work are invaluable, its mechanical execution reflects great honor on the Society that published it.\n\nThis work is called, as translated from the Latin, \"American Antiquities, or Northern Writings of Things in America before the time of Columbus.\"\n\nThe determination was formed some years since, by the Royal Society of Antiquarians in Copenhagen, to publish the authorities on which these accounts rest, in the original documents, accompanied with full commentaries and illustrations. The text is in the Icelandic tongue.\n\nThe inquiry is often made, \"Who were the Northmen?\" They were the descendants of the Scandinavians, who, it is thought, sprung from the Thracians mentioned by Homer—a nation now extinct. The Danes, the Swedes, the Norwegians, and the Icelanders, all come under the name of Northmen or Norsemen. Their literature has been compared, in extent, to the literary remains of Greece and Latium. This opens a new fountain of research, where the scholar may often\n\n\"Return and linger, linger and return.\"\n\nThis great work contains two Icelandic documents, now for the first time published accurately, in a complete form, purporting to be histories written by or for persons who discovered and visited the North American coast early in the eleventh century, confirmed and illustrated by extracts from no less than fifteen other original manuscripts, in which the facts set forth in these histories are either mentioned or alluded to. The Royal Society has already collected two thousand Sagas, or works of Scandinavian or Icelandic history.\n\nIn this work, in particular, is found Adam of Bremen's account of the discovery of America, communicated to him in the eleventh century, by Sweyn Estrithson, king of Denmark.\n\n1. Are these documents genuine?\n2. If so, why have they not been heard of before?\n\nThe work, itself, contains evidences of the antiquity and authenticity\nof the manuscripts, from which the publication has been made, sufficient to raise them above any just suspicion.\n\nThese documents, as Professor Rafn says, have been known to Icelandic scholars; but these have been so few, comparatively, and the means of these few so limited, that they have not been able to give them suitable examination, much less to be at the expense of publishing them.\n\nHow long did the ancient classics, for instance, lay concealed in the monasteries of Europe, for the want of some one to exhibit them to public view? These Icelandic documents may have been hid, in like manner, in the libraries of priests. And we may say that the Society of Antiquarians, in Copenhagen, in bringing these documents to light, resembles the conduct of the poet laureate, Petrarch, in the fourteenth century, who, at his own expense, had the valuable manuscripts of antiquity dragged from the dust of the cloisters, transcribed, and exhibited to the world.\n\nWho does not admire the lovely scenery, where the beautiful and sublime are blended, displayed in the succession of Falls at Trenton? Yet these were concealed for ages, till a master-spirit revealed them to an admiring world. And does not the raven wing of night hide the works of art, also, till disclosed in a similar way? The learned of Iceland, though, like the generality of poets, poor; yet they were not disposed, like Milton, to sell their manuscripts for a paltry sum.\n\nIt is well known the Norwegians have long claimed the honor of discovering and colonizing America before the time of Columbus.\n\nInstead of this discovery being a new-fangled theory, as some say, there have been several works published in Europe, upwards of a century, which speak of these facts. Wormius speaks of this discovery, in a Latin translation, published at the University of Oxford, in or about 1716. In Adam of Bremen's account, published 1629, he uses the following striking language: \"Non fabulosa opinione, sed certa relatione Danorum;\" that is, in a free translation, \"This is not a fabulous opinion, but a true narrative, given by the Danes themselves.\" Dr. Franklin, in a letter to a distinguished antiquary formerly of Switzerland, says, positively, that the Danes came into New-England before the time of Columbus. Dr. Mather published an account, also, of this discovery, in 1772.\n\nThe celebrated Dr. Henderson, who travelled in Iceland, says that the fact of this early discovery was well known to the Icelanders—that it was authenticated by Northern historians. It is a remarkable fact, that Iceland, where these documents relating to the early discovery were preserved, were the Athens of the North, during the Dark Ages.\n\nDuring the Middle Ages, the icelanders were the most intelligent people in the North. Even now, as Henderson says, youth can repeat passages from Latin and Greek authors, who have never been but a few miles from the place of their birth. Truly, the hardy Icelanders were our librarians and historians.\n\nIceland appears to have been a medium of communication between Norway and Greenland,—a stepping-stone, as it were, from one continent to another.\nIceland, thought by some to be the \"Ultima Thule\" of Virgil, was discovered by the Norwegians in 861. The oppression of king Harold Harfuga drove them there for an asylum.\n\nBut the restless spirit of the Northmen would not allow them to be idle. They made incursions in every direction, and discovered Greenland in 984.\n\nIn 986, a colony was begun by Eric the Red. This was at length destroyed. By the exertions of the Danish Society, the ruins of this settlement have been discovered. It was located on the West, near Cape Farwell. It is seen in the remains of churches and buildings.\n\nLeif, the son of Eric, commenced a voyage of discovery, in the year 1000. His crew consisted of thirty-five men. Leif was the first to introduce missionaries into Greenland.\n\nAfter sailing for some time south-west, they made land. They anchored and went ashore. This place was destitute of grass, and was covered with a slaty rock, which they called Helluland. This is supposed to be Labrador. Fishermen and travellers of the present day give a like description of that barren region.\n\nFrom thence they sailed southwardly; and, after holding on for some time, they again made land and went ashore. This country was level, had a low coast, presenting, here and there, bluffs of white sand, and was thickly covered with wood. This they named Markland or Woodland. This is thought to be Nova Scotia.\n\nLeaving Markland, they sailed south-westerly, with a fair wind, two days before seeing land again, when they passed down a promontory, probably the east side of Cape Cod, stretching east and north; and then turning west between an island, (Martha's Vineyard) and the main land, they entered a bay (Narragansett Bay) through which a river (Taunton River) flowed, when they came to anchor and went ashore. Resolving to spend the winter here, they called the place Leifsbuthir, or place of booths. Here, finding grapes very plenty, they called the place Vinland or Wineland the good. This land, to those coming from the remote North, appeared as nature in the \"world's first spring.\"\n\nEarly in the season they returned to Greenland. Leif's return became the principal subject of conversation.\n\nThe next adventurer was Thorwold, his brother. And you will observe that he and the other navigators gave the same account of places they visited. Were not this the case, who could believe any of their reports?\n\nThorwold, thinking the country had not been sufficiently explored, set sail in 1002, and proceeded to Leifsbuthir, where he lived till 1004.\n\nIn the spring of 1004, he sailed from Leifsbuthir. After passing along the shore of the promontory, east and north, they sailed round a sharp point of land, called Kjarlanes. This must have been Cape Cod. Kjarlanes implies Keel-cape. For Cape Cod, at the extremity, is in shape of the keel of ancient vessels, which curved inward.\n\nThese Northmen were peaceable men. They were not like Phaeton, who gladly would have seized the reins of the chariot of the sun to set the world on fire. It must not be denied, however, that the second great navigator, Thorwold, assailed the natives without cause; but in using\nthe sword he perished by the sword. On receiving a mortal wound, he requested that, after his death, crosses might be placed at either end of his grave.\n\nThe Catholic ministers, in giving an account of their first missionary labors in this country, speak of the custom of the natives in wearing crosses. Such must have been introduced by the Northmen Christians.\n\nI mentioned this circumstance, lately, to the librarian of the American Antiquarian Society, Worcester; and he said that a cross had been sent to that institution by a gentleman of Ohio. I saw this emblem of the Christian faith. It must have been hid from the light of heaven for centuries. This silver cross is about two and a half inches long. It was found on the breast of a female skeleton, one which was dug from a mound at Columbus, over which a forest of trees had grown. On this cross the capital letters I. S. are perfectly visible. And what can these letters imply, but the initials of the sacred name, JESUS SALVATOR?\n\nWho can doubt, then, that the \"Sun of Righteousness\" cast his bright beams on the land west of the dread Atlantic, long before the time of Columbus?\n\nIn 1006, Thorfin or Thorfin commanded one of the three ships that came from Iceland to Greenland. He was of royal lineage.\n\nIn the spring of 1007, Thorfin, with three ships and one hundred and sixty men, besides cattle and all necessary materials for establishing a colony, set sail for Vinland.\n\nThey sailed to Helluland or Labrador; from thence to Markland or Nova Scotia; and from thence to Kjarlanes, or Cape Cod. Sailing south by the east side of the promontory which terminated at Kjarlanes, they passed along beaches or trackless deserts of sand. How descriptive of this bleak and sterile coast!\n\nThose who have sailed from Boston to Narragansett Bay, are ready to say that I am not drawing an ideal picture.\n\nContinuing their course they arrived at an island. They called it Shaumey. This is supposed to be Martha's Vineyard. Nine men went away in one of the ships and never returned. It is said they were driven on the coast of Ireland, where they were seized as slaves.\n\nIn the spring, Thorfin and one hundred and fifty others went to the main land. They called the place Hop, the residence afterwards of king Philip. Here they found large numbers of skrellings or natives. Thorfin carried on a traffic with them, by exchanging bits of colored cloth for furs. In consequence of their frequent attacks, in 1009 they returned to Greenland. Then, it will be recollected, the Northmen had not the use of fire-arms with which to defend themselves against the assaults of the savages. These lords of the wilds had a rude kind of engine, by which they hurled large stones against their foes; and it is possible that the white man would never have driven the red man from the Atlantic to the Rocky Mountains, but for the invention of gunpowder.\n\nI cannot forbear to speak of the valor of one of this crew of the Northmen, a female. When all the rest were disposed to flee before the savage foe, she exclaimed: \"If I only had a weapon, I ween I could fight better than any of you.\" Ah! when we consider the pa-\ntriotism of the females at the siege of Carthage, who cut their locks to make ropes for engines of war; and when we recollect the courage of Isabella of Castile, who, at the conquest of Grenada, though in ill health, led on her veterans to conquest and glory, have we not reason to suppose that this Scandinavian was sincere in her declaration? Truly, valor and benevolence are but parallel streams in the female heart. We would not applaud courage, however, unless under the control of a higher and holier principle.\n\nThorfin married Gudrida, the widow of Thorstein, third son of Eric. She accompanied her husband to Vinland. Snorre, their son, was the first white child born in America. From him descended the distinguished associate of Professor Rafn, Finn Magnusen. The late great sculptor, Thorwaldsen, of Denmark, was of this family. Bishop Thulack Rudolfson was a descendant of Thorfin's, and it is supposed that he wrote or compiled these documents.\n\nA distinguished geologist from Denmark has lately found the remains of an Icelandic city in Brazil. He discovered Runic inscriptions on flag-stones. Above all, he found a statue of the Northman god of thunder, Thor, with his attributes, the magic girdle and hammer.\n\nThorfin, the most distinguished of these, returned to Iceland, where he ended his days, living in great splendor.\n\nThe editor of the American Antiquities, Professor Rafn, and his associate, Professor Finn Magnusen, think that Vinland was situated in the east part of Rhode-Island, and in the south part of Massachusetts, on or about Narragansett Bay and Taunton River.\n\nThe points in the Icelandic documents alluding to the locality of Vinland, may be reckoned the Geography, Natural History, Astronomical Phenomena, and Vestiges of Residence of Northmen in that place. All of these, in the opinion of the editor of the American Antiquities, point to the head of Narragansett Bay or Mt. Hope Bay, as the locality of Hop, the central part of Vinland.\n\nAs the Royal Society have held correspondence with several learned societies in this country for some years, they are well qualified to form a judgment on this subject. Dr. Webb, now of Boston, formerly Secretary of the Rhode-Island Historical Society, and J. R. Bartlett, Esq., of New York, have been very efficient agents in aiding the Royal Society in presenting this great work to the world.\n\nThe following letter, from the late General Holstein, Professor in the \"Albany Female Academy,\" will show the care taken to acquire information relative to American Antiquities:\n\n\"In proof of the great exertions made by the Northern Antiquarian Society, in Copenhagen, to acquire a knowledge of Scandinavian antiquities in America, I hereby state that, several years since, a letter of inquiry, sealed with the seal of the Society, was sent to a professional gentleman of Geneva, in this State, a translation of which I made from the Danish tongue.\"\n\nThe Geography of Vinland.—Concerning the situation of Helluland there can be no doubt, as it was the first land south-west of Greenland. Where else could this have been, unless the coast of Labrador?\nMarkland was situated south-west from Helluland, three days' sail, or three hundred and sixty English miles. This is supposed to be Nova Scotia.\n\nThe distance of Nova Scotia and New Brunswick agrees with the account the Icelanders gave of Markland.\n\nVinland was situated two days' sail, or about two hundred and forty English miles to the south-west of Markland; and if Markland has been properly located, must be sought in or near the south part of Massachusetts.\n\nIn the Icelandic documents, it is said that Hop the residence of Thorfin, was situated on an elevation of land, near a river which flowed south, through a bay, into the ocean. From this the land stretched east; and, turning north, formed a promontory, which terminated in a point or cape, which they call Kjartanes. The east side of the promontory was bound by long, narrow beaches, or sand-hills. To those who, like myself, have often viewed the Atlantic from these sand-hills, this account appears peculiarly striking.\n\n**The Natural History of Vinland.**—Vinland was remarkable for its vines, maple trees, maize, and a great variety of wild animals. The waters abounded with fish, and were occasionally visited with whales. Birds were numerous. The eider duck was seen about the islands in large numbers.\n\nAs to vines, they are said to be numerous even now; and this is more particularly true of the country around Narragansett Bay. And was not an island called Martha's Vineyard, on account of the multiplicity of vines growing there?\n\nThe celebrated Bishop Berkley, who attempted to establish a theological seminary in Rhode-Island, says, in his letter to his friends in Europe, that vines were as plenty on the island as in Italy. Gosnald, who visited the Elizabeth Isles in 1602, says, that vines were in great profusion there.\n\nIn the documents it is said that, in that region, are the red, sugar and bird's-eye maple. The Northmen cut down the trees; and, after they were dry, they loaded their ships with the timber. It is supposed that the bird's-eye variety was made an article of commerce.\n\nAs to Indian corn or maize, it seems our pilgrim fathers found some in what is now called Truro, near the end of the Cape. It was buried in the earth to preserve it.\n\nIt is needless to remind the reader of the multiplicity of fish that still abound in the waters of this region. The sportsman may, at this day, tell his friends, in the language of Capt Smith, of Jamestown, who described this quarter, \"of the pleasure to be derived from angling, and crossing the sweet air, from isle to isle, over the silent streams of a calm sea.\"\n\nAs to whales, I have occasionally seen them spouting around the sandy shores of the Cape.\n\nIn regard to the eider duck, in the Latin translation it is called \"anas mollissima,\" a duck with the finest of feathers. The real eider duck of Iceland, is, at this day, frequently seen around Martha's Vine-\nyard. Wild fowl must have been numerous there, as an island is still called Egg Island, from the quantity of eggs they deposited.*\n\nThorfin describes the Soil and Climate.—The winters of Vinland are said to be remarkably mild, but little snow falling, and cattle subsisting out of doors, through the winter.\n\nThis account does not agree with the description of New-England winters at this time. Still, however, it has been the practice of the farmers on Nantucket and Martha's Vineyard, to let their sheep and cattle lie out during the winter. But the cold winters of New-England, compared with those of Greenland, are as the mildness of spring. They speak, however, of a snowy winter.\n\nBut there have been great changes in the face of the earth and in the climate, in different ages. Change is the law of nature. Has not one of the bright cluster been blotted out from the map of heaven? Such changes also take place on the face of the earth.\n\nThe Dead Sea was, in early times, sixty miles long. It is now only thirty. And even old Ontario and Erie have receded from their former bounds, leaving to the present generation a rich tract of land, several miles wide, and a beautiful ridge-road. Who does not admire the everlasting rocks, rising in stern grandeur, on either side of the Mohawk, at the Little Falls? Yet, the lovely vale above must once have been the bed of a vast lake. This is manifest from the fact, that there are \"pot-holes\" found at an elevation of sixty feet above the river, at these falls.\n\nThese circular excavations were made ages since, by the circumvolution of stones, driven by the rapid descent of the waters. You can see a demonstration of this fact, by looking at the high falls of Black River or Trenton.\n\nAnd what a mighty labor was that, for the waters of this lake to have found their way, gradually, through the high and continuous wall of granite, where now the Mohawk murmurs as it rolls along its new channel.\n\nGeological facts prove that it was much warmer, formerly, in the North, than it is now.\n\nLarge forests once flourished in Lapland.\n\nIt is not to be disputed that, in former ages, Iceland produced timber in abundance. Large trees are occasionally found there in the marshes and valleys, to a considerable depth in the ground. Segments of the fossil-trees have lately been exported, in proof of the alleged fact.\n\nIt is asserted in the ancient Icelandic records, that when Ingulf, the Norwegian, first landed in Iceland, 879, he found so thick a cluster of birch trees that he penetrated them with difficulty.\n\nHenderson, in his Travels in Iceland, says, that the climate has deteriorated there, from the fact that it was once shaded with forests.\n\nWhen the first Norwegian colony settled in Greenland, about 1000 years ago, they found no difficulty from ice in approaching the coast, and a regular correspondence was supported by their people for many years.\n\n* Mr. Audubon, whose letter to me is on the second page, says he has seen in Labrador, twenty-seven nests of the eider duck within a very small compass.\nAstronomical Phenomena.—The learned Editor and his associate deduce from the astronomical data, lat. $41^\\circ 24' 10''$, which is the latitude of Narragansett Bay, and Mount Hope. There, at the Winter Solstice, December 22, the day is nine hours.\n\nThat the Northmen were capable of taking latitudes, is evident from the circumstance, that, at that period, they speak of eclipses, which have lately been calculated by Sir David Brewster and the distinguished Norwegian astronomer, Hanstein, and found correct.\n\nThe reading, however, that leads to the above calculation, has been disputed. The whole controversy turns on the meaning of two words. From what we can understand, we presume the Editor is correct in his exposition.\n\nBut suppose we were to reject all history on account of some apparent or real discrepancy in narrative? In such a case, some future reader might declare that the history of the American Revolution was neither credible nor authentic; for it is said that the distinguished battle of the 17th June, 1775, was fought on Bunker's Hill, instead of Breed's. Who does not know that Bunker's Hill, rising back of Breed's, is more elevated than the latter, on which the monument is rising? (Yes, and by the patriotism of the ladies of 1840, now towers to the stars.)\n\nLittle can be said of the vestiges of the residence of the Northmen in this country.—There is a large rock at the junction of Smith's creek with Taunton river, with a singular inscription on it. It was evidently made with an iron instrument. Passing over the particular remarks of the Editor, on these letters, I would give his supposition as to their meaning.\n\nThorfinn, with one hundred and fifty-one men, took possession of the country.\n\nProfessor Rafn has deciphered an inscription on the Paradisic rock of Iceland, which, he says, proves beyond doubt the European origin of the inscription on this in Massachusetts.\n\nJohn R. Bartlett, Esq. copied the inscription. He found the characters permanently imbedded in the rock called Gneiss.\n\nThere are similar inscriptions on rocks in the vicinity of Mount Hope Bay.\n\nThe people in the north of Europe were fond of making inscriptions on rocks on the borders of lakes and rivers; for such are found in Norway, Sweden, and Scotland. They are called \"Runes.\"\n\nOne of these inscriptions, found on a rock in Sweden, has been deciphered by Professor Finn Magnusen. The inscription relates to a battle fought about A.D. 680, between the kings of Norway and Sweden. Accounts of this battle were given by authentic historians.\n\nIn a work just issued in Denmark, it is proved that there are several other inscriptions found in the neighborhood of Taunton, like the one above. Also, that the old stone building at Newport, R.I. was erected by the Northmen; for it is exactly like the stone houses of Norway, built as baptisteries. The oldest people of Rhode Island know nothing of the origin of that curiously built edifice.\nThe light of evidence constantly flowing in from every quarter, confirms fully the fact, that the men of the North crossed the Atlantic before the day of Columbus. Objections to the theory are now few, and, like angels' visits, \"far between.\"\n\nThe Northmen originally used sixteen of these Runic characters.\n\nWere the Northmen capable of making discoveries, and of recording them? The rude children of our forests could not perform a work so mighty.\n\nThe Roman historian, Tacitus, spoke of the invasion of the people of the North before the Christian era. He says of the Cimbri, that they were not a small tribe, but mighty in fame; that the vestiges of their ancient glory still remained in their fortifications; that no other nation had so often given them cause to dread their arms—not the Carthaginians, or Spaniards, or Gauls.\n\nIn later times, the Northmen made incursions upon Germany, France, England, the Orkney, Faroe, and Shetland Isles.\n\nThe French were in such fear of the Northmen, that they inserted in their Liturgy, \"A furore Normanorum, libera nos, O Domine.\"*\n\nIn the ninth and tenth centuries, the Danes or Northmen invaded England, and seated one of their favorite princes, Canute, on the throne of Alfred.\n\nThey were a daring people—the sea was their home—the mountain wave was the scene of their sport—far and wide did they wander, without compass to guide.\n\nTheir vessels were built of timber that is now eagerly sought by the first maritime nation of the earth.\n\nA people, some of whose leaders boasted of never having slept by a cottage fire, became the dread of Christendom. They ruled the waters from the Arctic ocean to the Azores—they passed between the pillars of Hercules—they ravaged the coasts of Spain and France—sacked the cities of Tuscany—drove the Saracens from Sicily. They desolated the classic fields of Greece—penetrated the walls of Constantinople. Yes, in rescuing the Holy Sepulchre, they led the van of the chivalry of Europe. Mark their valor and their success; for one hundred Northmen knights, with one aid or squire each, drove ten thousand Saracens from Sicily.\n\nScott gives a beautiful description of this remarkable people, in speaking of the Western Isles:\n\n\"Thither came in times afar,\nStern Lochlin's sons of roving war:\nThe Northmen, trained to spoil and blood,\nSkilled to prepare the raven's food;\nKings of the main, their leaders brave—\nTheir barks, the dragons of the wave.\"\n\nIn describing king Harold's ship, it is said:\n\n\"And dragons' heads adorn the prow of gold.\"\n\nSeest thou the tiny fleet of some school-boy, launched on an isolated\n\n* From the rage of the Northmen, good Lord deliver us.\nsheet of water? And such were the greatest armaments of the famous nations of antiquity, compared with those of the Northmen.\n\nThe present illustrious queen of England is a direct descendant of the Northmen. It will be recollected that Rollo, the Norman, invaded France in 912, and enthroned himself in the North. In 1066, William of Normandy conquered England. These sovereigns were Northmen; and from their family, the pride and glory of Great Britain descended.\n\nAt the beginning of the eleventh century, the Danes and Norwegians were converted to Christianity, and thereby received a new impulse, that led them to extend the blessings of the Gospel. And who but this people could ever have established missions in Greenland?\n\nWhat shall we say of the ability of the Northmen to record incidents of their voyage?\n\nIn the year 1000, on their conversion to Christianity, they adopted the Roman alphabet. This was their Augustan age. The thirst of the Icelanders for learning, is seen in the conduct of Ulfjot, their supreme legislator, who, in 925, undertook a voyage to Norway, in his sixtieth year, to acquire a more perfect knowledge of the legal customs and institutions of the parent country.\n\nIn Iceland, the learned were called Skalds and Sagamen.\n\nThe former were poets and historians. Skalds denote \"smoothers or polishers of language.\"\n\nThe Sagamen recited in prose, with greater detail, what the Skalds had recited in verse.\n\nBy the recitations of the Skalds, the real and traditionary history of the country was transmitted from generation to generation.\n\nMemory is, perhaps, the most improveable faculty of our nature. Deprived of books, it depends upon its own resources. Its strength is seen in the following instance: An Icelandic Skald sang sixty different lays in one evening, before king Harold Sigurdson; and, being asked if he knew any more, declared that these were only the half of what he could sing.\n\nTheir traditionary histories were written down and preserved.\n\nAs poetry is among the antiquities of all nations, the events it records have ever been preserved by the recitations of Skalds, Minstrels or Bards.\n\nAnd whom does the conqueror of Wales cut off from the land? Does not Edward the First, of England, destroy the Minstrels of Wales, lest they should, by their recitations, awaken that spirit of liberty in the breasts of the vanquished, which would lead them to throw off the yoke of the British monarch?\n\nThese Skalds were distinguished men—the companions of kings. They sometimes were kings, as in the instance of Regnar Lodbrok.\n\nThe Sagamen made their recitations in public and private, at convenient opportunities.\n\nIf Augustus delighted to have Virgil and Horace on either hand, so the Scandinavian monarchs rejoiced to have Skalds and Sagamen in their presence.\n\nAt solemn feasts, the services of these men were required.\n\nSæmund, in 1056, collected the different poems relating to the my-\nthology and history of the North. The collection was called the \"Poetic Edda.\" He was a man of learning, having been educated at the Universities of Germany and France.\n\nHe performed for the ancient poems the same office which is said to have been done by the ancient Greek rhapsodist who first collected and arranged the songs of his predecessors, and reduced them to one continuous poem, called Homer's Iliad.\n\nSnorra Sturlson, judge of Iceland, was the most distinguished scholar of his day. His principal work was the Prosaic Edda. It treats, in particular, of Scandinavian mythology. He lived in 1178. His bath still attracts the attention of the traveller. The aqueduct of it is five hundred feet long, and is composed of hewn stone finely united by cement. The reservoir is similarly constructed, and will contain thirty persons. The water was supplied from one of their warm springs.\n\nThe general characteristics of the Icelandic tongue are copiousness, energy, and flexibility, to an extent that rivals every modern language, and which enables it to enter into successful competition with the Greek and Latin.\n\nWere not the Icelanders, then, capable of recording the events incident to a voyage of discovery?\n\nThe internal evidences found in these documents are in favor of their authenticity.\n\nBesides, there are in existence a series of works from the time when these voyages purport to have been made, down to the present time, which have been preserved, and which make mention of these discoveries.\n\nDistinguished men, who have had superior opportunities of ascertaining the merits of this question, have come to the conclusion that the descendants of the Scandinavians were the discoverers of America, prior to the time of Columbus. Among these, are Dr. Forster, Mr. Wheaton, our Minister at the Court of Berlin, and Baron Von Humboldt, also of the above city.\n\nIn a work sent from Denmark, are the following important remarks:\n\n\"Alexander Von Humboldt, who, of all modern travellers, has thrown the greatest light on the physical circumstances, first discovery, and earliest history of America, has admitted that the Scandinavian Northmen were the true, original discoverers of the New World. He has also remarked, that the information which the public as yet possesses of that remarkable epoch in the Middle Ages, is extremely scanty; and he has expressed a wish that the Northern Literati would collect and publish all the accounts relating to that subject.\"\n\nThe Society of Northern Antiquarians has complied with his request, in publishing to the world the great work before mentioned.\n\nBesides Adam of Bremen's account of the discovery of America, this great work speaks of Bishop Eric's voyage to Vinland, in 1121. Although Thorfinn's men were driven away at first by the natives, yet, it is reasonable to suppose, that they at length returned and formed colonies in this quarter, together with others who visited America, as named in the Icelandic MSS.\n\nIf voyages were made, from time to time, to different parts of America, by the Northmen, is it not reasonable to suppose that some parts\nof our country were inhabited by them for a long time, and that Bishop Eric visited Vinland to perform Episcopal duties, and that the Northmen left evidences of their arts, in the antiquities I will briefly name?\n\nHow fond is man to linger around mouldering ruins—to fix the eye on the mutilated column overgrown with ivy! But are there not antiquities as worthy as those of art? I mean those of our own species.\n\nI shall make a remark on a human skeleton I saw, not long since, at Fall River, in the vicinity of Narragansett Bay.\n\nI had an extensive view of the region around Mount Hope, lying on the west of Mount Hope Bay. How accurately is the scenery portrayed in the Icelandic documents!\n\nA skeleton was dug up, a few years since, in that place. It had a breast-plate or medal hanging from its neck, thirteen inches long, and six in width at the top, and five at the bottom. It had, also, an ornament of fillet-work around its body, four and a half inches wide. These ornaments are made of brass, or, as Dr. Webb says, of bronze. A knowledge of the uses of this artificial metal implies a considerable advance in the arts.\n\nI witnessed, lately, an object of interest in the State of New York. Not long since, a large oak tree, cut down in Lyons, was taken to Newark; and, on sawing it, there was found, near the centre, the marks of an axe. On counting the concentric circles, it was discovered that four hundred and sixty had been formed since the cutting was made.\n\nBut the most striking circumstance is, that this large cavity, now visible, was made by an edged tool. The rude stone axes of the present race of Indians could never have made clefs so smooth as those I saw in the block in the hotel at Newark.\n\nOn further examination, I presume this skeleton, whose head is different from that of the natives, was a Northman; and that the cuttings in this tree were made by axes wielded by the descendants of the Northmen. For I find that the Icelandic MSS. speak of breast-plates worn by the Northmen; and as to their axes, it is stated that the natives tried them on wood, and afterwards on stone; but the instruments used by the former to cut down maple trees, could not withstand the use made of them, by the latter, upon stone. If it be asked what has become of the Northmen, and where are their descendants? we answer: Like the mighty master-builders of the splendid cities of Central America, and of the fortifications, mounds, &c. of the United States, they have passed into oblivion. Nations seem to vanish in a day:—like the 300,000 inhabitants of Moscow, who left the city instantly on the approach of the mad Corsican.\n\nThere have been discovered beyond lat. 60°, in Greenland, upwards of 500 people, resembling those in the north of Europe, probably descendants of the Northmen.\n\nAn important inquiry arises: Was Columbus aware of the discoveries of the Northmen? From a letter preserved by his son, it appears he visited Iceland in 1477. It is thought by the Danes that he there obtained a knowledge of the discovery of Vinland. Allowing this to be the case, it is singular he should never have given any intimation of such knowledge.\nInstead of walking through Spain, leading his son by the hand, would he not at once have rushed into the presence of the sovereigns, and acquired patronage, wealth and honor, by telling them that the obscure Icelanders had discovered the region he wished to unfold?\n\nHis greatest enemies never accused him of having reached the New World by information received from Iceland.\n\nBut, as Columbus was rather artful, he might, from particular motives, have concealed this knowledge from the observation of mankind.\n\nAfter all, let not the circumstance of this prior discovery, cause, in our view, the laurels given to Columbus to wither on his brow. Let us ever honor him for his perseverance and his virtues.\n\nLet not Leif and his associate Northmen deprive him of what the voice of nations has awarded, the merit of having given, not to Ferdinand and Isabella only, but to successive generations, a New World.\n\nIceland, though but a speck on the bosom of the Northern ocean, is not unworthy of our notice. Though dark to the superficial observer, yet it shines with a lustre brighter than the flame rising from its volcano.—It is the light of knowledge. That obscure island is remarkable for the attention paid to learning. Even many among the common class pursue the higher branches of study. Their long nights are enlivened by the custom of every member of the family gathering around the bright lamp, while one reads for the amusement and instruction of all.\n\nThe sources of happiness are not, like those of mighty rivers, hid from the view of most people. They are accessible to all. The Icelanders, living in a remote island, and cut off from privileges that milder climates present, are naturally led to look for happiness in the pursuit of knowledge.\n\nIf the celebrated Pliny could say his books were sovereign consolers of sorrow, cannot the Icelander also declare that, when mountain-waves lash the shores, he can find pleasure in the pursuit of those studies that mend the heart and enlighten the mind? Ah, yes! fondness for books will create an artificial summer in the depths of the most gloomy season.\n\nThe sunny Italy may boast of the beauteous tints that flush her skies; but, after all, her effeminate inhabitants may be destitute of that happiness enjoyed by those who live where winter reigns uncontrolled most of the year.\n\nThe benevolence of Deity is seen in the contentedness felt by those who live in the higher latitudes, where, as a writer said of countries north of the Alps, Nature seems to have acted the part of a stepmother.\n\nWhat a contrast between the condition of the Icelanders and that of their forefathers! They were the worshippers of the god Wodin. And what were his attributes? He was styled the Father of Carnage! His greatest favorites were such as destroyed most of their fellow-creatures in the field of battle.\n\nBut the Prince of Peace has broken the sceptre of the Father of Carnage.\n\nThe benign influence of His Gospel is seen in all the departments of Government. Observe its effects as seen in the difference between the feelings of Lodbrok, a Northman king and Skald, and those evinced by one who was so successful of late in settling our border difficulties.\nLodbrok, in his death-song, says: \"Eight earls graced my Dwina's mouths. The crimson sweat of death poured on the sullen sea.\" Yes, he exulted in seeing his laurels dyed in the blood of his fellow-creatures.\n\nBut \"peace-makers\" in Europe and America gaze in rapture on those of the great PACIFICATOR, while verdant under the sun of peace.\n\nLet me ask, what would have been the consequences, had Scott \"let slip the dogs of war?\" Cities in flames, desolated fields, the wail of the widow, and the orphan's cry!\n\nWho would not award to such a hero, rather than to Augustus Cæsar, a place among the stars? (See Georgica, B. I., 34.)\n\nSuch is the influence of Christianity, where the Northmen found those who heard the Great Spirit in the thunder.\n\nThis, as Cicero said of Rome, is the glory of all lands.\n\n\"Wisdom and knowledge are the stability of our times.\" All classes become sensible that knowledge is the guardian of property. In every place they eagerly seek after that wisdom which, as Isocrates says, is the only imperishable treasure. Who can stay the progress of knowledge? You might as well think of erecting a tower whence you could grasp the Pleiades, as to attempt to oppose the march of mind. To swell the tide of improvement, it is pleasing to reflect that men of the first talents are engaged; and that, through the medium of those lectures, which, if they are not the fountains of knowledge, are important guides to them.\n\nA word in praise of the Scandinavians. Like the patriarch, they went in search of a region, they knew not where. We praise them for their courage, we applaud them for their zeal, we respect them for their motives; for they were anxious to enlarge the boundaries of knowledge. They reached the wished-for land,\n\n\"Where now the western sun\nO'er fields and floods, o'er every living soul,\nDiffuseth glad repose.\"\n\nThe Scandinavians have opened to view a broad region, where smiling Hope invites successive generations from the Old World.\n\nSuch men as a Cæsar or a Tamerlane conquer but to devastate countries. Discoverers add new regions of fertility and beauty to those already known. And are not the hardy adventurers, ploughing the briny wave, more attractive than the troops of Alexander marching to conquer the world, with plumes waving in the gentle breeze, with arms glittering in the sunbeams? Who can tell the benefits the former confer on mankind?\n\n\"To count them all demands a thousand tongues,\nA throat of brass, and adamantine lungs.\"\nAPPENDIX.\n\nMr. Stephens does not agree with the majority of travellers as to the antiquity of the cities in Central America. He is, as Mr. Schoolcraft observed to me, in the minority on that subject.\n\nIn one place, however, he seems to confess their great antiquity: for he says that Cortez passed within 20 or 30 miles of them, and that some of them were unknown and their memory lost.\n\nI have seen some of the remarkable antiquities Mr. Norman brought from Yucatan, as Penates, Hieroglyphics on fine lime-stone, pieces of the lintels made of the Zoporte wood. He kindly gave me a specimen of this wood, which is hard, fine and heavy, and as lasting as time. Beautiful were the architecture and paintings he saw. The latter was in fresco, and as fresh, apparently, as if recently executed.\n\nMr. N. thinks the cities of the South are of very remote origin.\n\nThe wooden beams Mr. Stephens saw, like those in the Cave Temples of Hindostan, which are several thousand years old, and the old oak bridge, built near Rome, 500 years before Christ, have been preserved probably for an equal period.\n\nIn relation to the Northmen, it appears to be generally admitted, that they were the first known discoverers of the Western Continent.\n\nThe late Noah Webster, Esq., told me he examined the subject forty years since, and came to the above conclusion.\n\nW. H. Prescott, LL.D., advances the same opinion in his late splendid work on Mexico.\n\nRev. Mr. Hawks, now of St. Louis, has written a valuable little work on \"Lost Green-land,\" in which he speaks of 17 Bishops who successively presided in that country. The colony suddenly disappeared in or near 1611. The present colony was established in 1721.\n\nCapt. Williams, of Boston, a Dane, tells me he saw the governor of Greenland, an old schoolmate of his, who showed him a book published in Greenland, giving an account of these discoveries. It had a map of Cape Cod and Boston Harbor. Capt. W. has examined the mound at St. Louis, and says it resembles those in Denmark. He thinks the fortifications West were erected by the Northmen.\n\nIt is not unreasonable to suppose that such fortifications as those on Rock River, Wisconsin, were the strong holds of valiant chiefs of the North, in olden times—that on this continent bold knights once sallied forth as from Feudal castles, with lance and spear, in defense of \"injured lady love.\" I have a piece of fine burnt brick from the ruins of this fortification at Astralnd, Wis.\n\nMr. Schoolcraft is going to publish an article on a stone found in a mound in Western Virginia, that has a Celtic inscription on it. This, as he observed, proves that Europeans visited this country before Columbus.\n\nAs to the red men, clouds of obscurity conceal their origin. Mr. Schoolcraft, late Indian Agent, thinks they are of Asiatic origin. Many suppose they are the descendants of the Israelites. Vague are their own traditions as to their origin. Some Indians say they came from the East; some from the West; some from the North, and some from the South. Some think they came from beneath the earth—others suppose they came from the skies.\n\nWhile the nations of the earth are reposing in the shade of the Olive Branch, this auspicious time of peace enables all classes to engage in those studies that tend to soften the mind and refine the life.\n\nThe study of Antiquities is becoming prominent in both continents. Even the crowned heads of Europe are paying great attention to antiquarian researches. As the Czar—the King of Prussia—Her Majesty of England—the Danes—the French, and others of that quarter of the globe are doing much to unfold the history of remote periods.\n\nAnd that spirit of inquiry which awoke perhaps in the East, folds not its wings in apathy on crossing the Atlantic; for here its developments astonish both hemispheres. Who can limit the vigilant eye of the antiquarian in its future discoveries?\nRECOMMENDATIONS.\n\nFrom Major-General Jesup, U. S. A.\n\nI have attended the lecture of Rev. Mr. Davis, on the Discovery of America by the Northmen, with much pleasure and profit: and I respectfully recommend him to the patronage of teachers, and of the public generally.\n\nTHOMAS S. JESUP.\n\nWASHINGTON CITY, MARCH 23, 1840.\n\nFrom the President and Professors of Columbian College, D. C.\n\nThe Undersigned cordially join in the recommendation above given.\n\nS. CHAPIN.\nWM. RUGGLES.\n\nCOLLEGE HILL, D. C. MARCH 25, 1840.\n\nJ. C. B. CHAPLIN.\n\nPhiladelphia, Dec. 7, 1839.\n\nSir,—I attended, a few days since, your Lectures in this city, \"On the Discovery by the Northmen,\" and derived very great pleasure from the same.\n\nBeing, by birth, a Northman, and having, for some years, studied many of the old Icelandic documents concerning this interesting subject, I hesitate not to say that your lecture is compiled with much care and labor, and can not but be interesting and instructive to all persons.\n\nYour obedient servant,\n\nC. D. ARFWEDSON, U. S. Consul at Stockholm.\n\nFrom Mrs. Willard, of Troy.\n\nMr. Davis has delivered an interesting and instructive Lecture relating to the history of our country, to members of the Troy Female Seminary.\n\nFrom the Boston Daily Advertiser, Oct. 16.\n\nThe Lectures now being delivered in this city, by the Rev. A. Davis, on \"The Discovery of the American Continent by the Northmen,\" and on \"The Ruins of Central America,\" are exceedingly interesting. I had the pleasure, last evening, of being an auditor of the first Lecture, and was, in common with many others, highly gratified. I trust that Mr. Davis may meet with that success which he deserves. He has evidently bestowed great labor and investigation upon this interesting subject, of which he has made himself perfectly master. Those who attend Mr. Davis' Lectures, will find themselves well repaid for the time they may spend, by the instruction and pleasure which they can not fail to receive.\n\nC.\n\nFrom Professor Dean, and John Van Buren, Esq.\n\nI have read with much pleasure, the Rev. Mr. Davis' printed Lecture on the subject of the Ruins and the Discoveries of the Northmen on this Continent. The subject itself is possessed of much interest, and in the Lecture much research is evidenced, and the whole treated in a very attractive manner.\n\nALBANY, MARCH 31, 1842.\n\nAMOS DEAN.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_24494.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 33, "total-input-tokens": 52204, "total-output-tokens": 16970, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 880, 3], [880, 1986, 4], [1986, 2102, 5], [2102, 2102, 6], [2102, 2598, 7], [2598, 4073, 8], [4073, 6435, 9], [6435, 9610, 10], [9610, 12729, 11], [12729, 14250, 12], [14250, 17384, 13], [17384, 20523, 14], [20523, 23446, 15], [23446, 26351, 16], [26351, 29489, 17], [29489, 32629, 18], [32629, 35785, 19], [35785, 38910, 20], [38910, 41815, 21], [41815, 44876, 22], [44876, 47827, 23], [47827, 50482, 24], [50482, 53416, 25], [53416, 56529, 26], [56529, 59686, 27], [59686, 62892, 28], [62892, 65376, 29], [65376, 69273, 30], [69273, 69273, 31], [69273, 71637, 32], [71637, 71637, 33]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]