[{"id": "8a0048345924311aca24b1b13390cf793ea8962f", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n|   |   |   |\n|---|---|---|\n| 1 | 2 | 3 |\n\n|   |   |   |\n|---|---|---|\n| 1 | 2 | 3 |\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nAN AUTOBIOGRAPHICAL SKETCH OF THE SERVICES OF THE LATE CAPTAIN ANDREW BULGER OF THE Royal Newfoundland Fencible Regiment.\n\nBANGALORE:\nPRINTED AT THE REGIMENTAL PRESS 2ND BATTALION 10TH REGIMENT.\n1865.\nIn October 1804—being then not quite fifteen years of age—I was appointed to an Ensigncy in the Royal Newfoundland Regiment, commanded by Lieutenant-Colonel The Honourable W. T. Molesworth; and in July 1806, I succeeded to a Lieutenancy.\n\nI had served between seven and eight years with my Regiment in our North American provinces, when the government of the United States, in June 1812, declared war against Great Britain. At that period our troops in Upper Canada scarcely amounted to a thousand men; and we had a frontier of almost as many miles to guard. I was present, with a detachment of my Regiment, at the firing of the first shot against our new enemy. Having afterwards been detached to the Western frontier of the province, upon its invasion by the American Force of upwards of three thousand men, I shared in the operations and services consequent thereon, and in which our troops at no time exceeded three hundred of the Forty-first and Royal Newfoundland Regiments, with about six hundred of the Upper Canadian Militia, and five hundred Indians, under their celebrated chief Tecumthé. I was present, also, at the final defeat and surrender of the invading force, as well as at the capture of the enemy's Fort, with thirty-three pieces of ordnance, at Detroit, on the 16th of August 1812, as reported in a despatch of which the following is a copy.\nFrom the Commander of the Forces, Lieutenant-General Sir George Prevost, to the Right Honourable Earl Bathurst, dated Head Quarters, Montreal, 1st September 1812.\n\n\"Since I had the honor of transmitting to your Lordship my letters Nos. 5 and 6, in charge of my Aide-de-Camp, Captain Coore, I have received from Major-General Brock a despatch, of which the enclosed is a copy, containing the particulars of Brigadier-General Hull's invasion of Upper Canada, which has terminated most gloriously to His Majesty's arms in that officer's defeat and surrender, as a prisoner of war, with the whole of the North Western army, together with the Fort of Detroit, and thirty-three pieces of ordnance. I forward this despatch express, in the expectation of its reaching Captain Coore, previous to his leaving Canada, which, with the colours of the Fort, and those of the 4th United States Regiment, I trust that Officer will have the honor of delivering to your Lordship.\"\n\nI have received a medal and clasp for Detroit. Upon the dispersion of the enemy's force in the west, the services of a portion of our troops were transferred to the vicinity of Lake Ontario; in which quarter it was supposed that the next attack would be made. I proceeded with the troops upon that occasion, and, during the remainder of the autumn of 1812, was employed in command of a detachment, at times in an armed vessel acting against the enemy, and at other times in a gun-boat, assisting to protect an exposed line of settlements near the lake-shore. While employed upon these services, we had been twice under fire: besides encountering no small risk, in the violent storms, which frequently swept over the lake, especially during the month of November.\n\nEarly in December 1812, upon the formation of winter-roads, I was sent (with others) a distance of more than two hundred miles to the Niagara frontier; and, during the ensuing five months, served with the flank-companies of my Regiment upon the duty of guarding one of the weakest points upon our side of the river Niagara: upon the opposite bank of which the Americans were in strong force. For upwards of three months of the winter, we were posted in old, dilapidated farm-buildings, near the river-side, and within eight hundred yards of two heavy batteries of the enemy: from which, however, we experienced but little actual an-\nnoyance until towards the spring: when their fire having rendered our quarters untenable, we were ordered into huts, scarcely half-finished, in an adjacent ravine.\n\nThe Americans having, on the 20th May, received reinforcements in boats from the west, it was then expected that a descent upon our shore would be attempted: in which event, our orders were, to meet the enemy at the water's edge, while troops from other parts of the line would hasten to our support. We passed the nights of the 20th and 21st May, under arms, in our old stand, on the bank of the river; but, instead of crossing to our shore, the Americans, at day-break on the 22nd, having embarked a large force in boats, dropped silently down the stream. We waited anxiously for orders: upon the receipt of which, in the evening of the 25th May, we marched (in heavy rain) nearly the whole of that night and part of the next day—a distance of about twenty-eight miles—and, on the following morning, the 27th, shared in the action near Fort George, in which, not quite a thousand men of different corps, under the command of Brigadier-General Vincent, were opposed to an American force of fully ten thousand men, supported by a fleet of armed vessels carrying upwards of eighty guns.\n\nOf the conduct of the troops engaged upon that occasion, The Commander of the Forces was pleased to record his approval in a General Order, of which the following is a copy.\n\nGeneral Order.\n\nHead Quarters, Kingston.\n3rd June 1813.\n\nThe Commander of the Forces has received from Brigadier-General Vincent a report, announcing that the enemy having cannonaded from his batteries and ships, the whole of the 24th and 25th of May, the troops and works at Fort George, and very materially destroyed and injured the defences of that post, on the 27th, at day-break, made a general attack upon that position, and under cover of their fleet, which kept up a tremendous and most destructive fire, effected the landing of a body of troops, tenfold\nas numerous as the detachment allotted for the defence of that portion of the Niagara frontier. Regardless of the immense superiority of the enemy, his advance was gallantly and obstinately disputed: a judicious position was occupied by Lieutenant-Colonel Myers, and when that zealous and meritorious officer was obliged to quit the field, having received three wounds, he was ably replaced by Lieutenant-Colonel Harvey, and the unequal contest continued with unshaken gallantry and determination.\n\nBrigadier-General Vincent, considering further perseverance against an overwhelming force, a fruitless sacrifice of invaluable lives, having gained by their intrepid resistance the means of dismantling the fort, and destroying the stores, he directed the troops to fall back on Queenston, which was done with perfect order.\n\nBrigadier-General Vincent reports that the movements were ably covered by the companies of the Glengarry Light Infantry, strengthened by a detachment of the Royal Newfoundland Fencibles, and Militia, and these troops were gallantly sustained by a division of the 8th (or King's) Regiment, commanded by Major Ogilvie.\n\nBy His Excellency's command\n\n(Signed) Edward Baynes\nAdjutant General.\n\nOur troops, when ordered to retire, had sustained a severe loss, but, in the course of the next day, we received reinforcements, which raised our strength to about one thousand three hundred men. We reached Burlington Heights on the 30th May, and on the 1st June, it became known that the Americans were advancing from Niagara in three bodies—their main division of three thousand five hundred men, by the centre road—a corps of one thousand five hundred riflemen by the mountain on our right—and a considerable force in boats by the lake on our left. In the evening of the 5th of June, the main division of the enemy encamped within seven miles of our position: and, upon the following morning, shortly before daylight, our troops attacked them in their camp. The affair occupied little more than half an hour, and was attended with complete success. The Americans abandoned their ground, and in the utmost\nconfusion, fled to a wood at a short distance from the scene of action. Four pieces of cannon, with their tumbrils, horses, &c. were taken, and, amongst the prisoners, were two American generals. Our troops stood prepared, in case the enemy should again advance; but, ere two hours had elapsed, their entire force had commenced a rapid retreat, after burning and destroying a quantity of baggage and provisions, carriages, blankets, arms, &c.\n\nIn the afternoon of the same day, I was ordered to proceed, in command of an escort, for the purpose of conducting American officers—prisoners of war—to Kingston. We were embarked in batteaux, and had to row two hundred miles round Lake Ontario, while the enemy's vessels were continually cruising thereon.\n\nAt this time, Commodore Sir James Yeo, who had recently assumed command of our vessels upon the lake, was on the point of sailing from Kingston, with two ships, two brigs, and two schooners, intending to offer battle to the American fleet, of two ships, a brig and eleven schooners; the armament of which was known to consist of one hundred and seventeen guns, chiefly long twenty-four and thirty-two pounders. Our vessels carried ninety-seven guns, nearly all of which were carronades, thirty-two twenty-four and eighteen pounders. Seamen for our squadron had been sent from England, and, in place of marines, the Commodore was permitted to embark six subaltern officers and two hundred men from the troops.\n\nI was the senior of the military officers appointed to the squadron, in which we continued to serve upwards of four months. In that time nothing of a decisive nature occurred between the two fleets: sometimes, in light and favourable winds, being enabled to choose a distance suited to their long guns, the Americans endeavoured to cripple our vessels, but, on the other hand, whenever the wind favoured our Commodore's intention of closing with his antagonist Commodore Chauncey, the American vessels hastened to gain a harbour. Our squadron chased them repeatedly, for hours together: but it was not thought advisable, after\ndark, to follow them in shore. We, however, caused them a loss of two fine vessels, carrying nine guns each, which upset in a heavy gale at night, when their whole fleet was flying before our squadron: and upon another occasion, also at night, we overtook the rear of their fleet, and captured two heavily-armed schooners. After these losses, the Americans became more than ever cautious; and, upon their ceasing to appear upon the lake, our squadron proceeded to convey supplies to the centre division of the army, returning immediately afterwards to Kingston, for the purpose of watching the movements of the enemy in the vicinity of that place.\n\nAt this juncture, the Americans, having assembled a body of troops, stated at twelve thousand men, upon the eastern shore of Lake Ontario, it was supposed to be their intention to make an attack upon Kingston; but, on the 1st November, information having been received of their having commenced to descend the St. Lawrence in all sorts of river-craft for the purpose of attacking Montreal, in Lower Canada; a division of gun-boats, manned from the squadron—partly by its acting marines, with whom I proceeded—under the command of Captain Mulcaster, of the Royal Navy, hastened in pursuit of the enemy, overtook them on the following day, the 2nd of November, at a place where they appeared to have stopped for cooking purposes, cannonaded them for several hours, and, accompanying them down the river, continued to harass them to such a degree, that—as acknowledged in American newspapers—their troops, becoming discouraged, deserted the expedition by hundreds. And, upon the 11th of the same month, when the enemy, with from four to five thousand men, ventured to land upon our shore, they were met and signally defeated at \"Chrysler's Farm,\" by a corps of eight hundred British troops, commanded by Lieutenant-Colonel Morrison of the 89th Regiment, aided and supported by the flotilla of gun-boats under Captain Mulcaster. For this affair, of which the result was an entire break up and dispersion of the American invading expedition,\nthe approbation of His Royal Highness the Prince Regent was directed to be conveyed to the officers, seamen and soldiers engaged upon this occasion. I have received a clasp for this action.\n\nAfter the close of the campaign of 1813, our vessels, having been laid up for the winter, and it being considered essential to their security that a military guard should be posted in the naval arsenal at Point Frederick, I received a mark of the confidence of both Sir James Yeo and Major-General Vincent, in being appointed to command the detachment ordered for that particular service, and which consisted of one hundred and fifty men with six officers.\n\nI was, at that time, the senior service lieutenant of my Regiment, and upon many occasions during the war, had commanded a company in the absence of its captain. The Regiment, however, from losses incurred in the campaign of 1812 and 1813, having become reduced to less than two hundred effective men, but little expectation could be entertained of my promotion taking place in it; and, as several lieutenants from other regiments, many years junior to me, had received promotion on condition of raising men for the New Brunswick Fencibles—a new corps then in the course of formation—I was induced to address a memorial to the Commander of the Forces, soliciting the grant of a similar favour; and, as I still continued to serve under the orders of Commodore Sir James Yeo, that officer was pleased to forward my application, with a testimonial of which the following is a copy.\n\nKingston, 1st January 1814.\n\nI have received the enclosed from Lieutenant Bulger, who has evinced a zeal highly creditable to himself and beneficial to the good discipline of his men; and as he is the only officer of the corps embarked, who has made himself conspicuous, I feel the greater pleasure in complying with his wishes in forwarding his memorial to your Excellency.\n\n(Signed) James Lucas Yeo\nCommodore and Commander-in-Chief.\n\nHis Excellency Sir George Provost, Bart.\nThe reply of the Commander of the Forces was as follows.\n\nHead Quarters, Quebec\n7th January 1814.\n\nI shall consider favourably the claims of Lieutenant Bulger, of the Royal Newfoundland Fencibles, to promotion, supported by your recommendation of that officer, whenever an opportunity offers. The companies in the New Brunswick Fencibles are filled. Promotion in his corps may be expected, and, as one of the senior service lieutenants, he will not be passed over.\n\n(Signed) George Prevost\nCommander of the Forces.\n\nCommodore Sir James Lucas Yeo.\n&c. &c. &c.\n\nTowards the end of January 1814, an expedition was ordered to be despatched from Kingston, by a new route, of nearly six hundred miles, to the relief of Michilimackinac, then our only hold on the western lakes, and upon which an attack was expected to be made early in the ensuing spring. The relieving force consisted of ten officers and two hundred picked men, exclusive of twenty artillery-men, with a lieutenant and twenty seamen of the Royal Navy. The Commander of the Forces had selected Lieutenant-Colonel M'Donnell, of the Glengarry Light Infantry (previously of the 8th or King's Regiment) to command the expedition, and I was appointed to serve therein as adjutant to that officer.\n\nA small party of workmen, including boat-builders, having been sent in advance, we commenced our route in the beginning of February, in severe wintry weather, proceeded two hundred and fifty miles into a wilderness; erected huts in a grove of pine; assisted in opening a road through the woods for the conveyance of supplies; and, with timber cut down and prepared upon the spot, aided in the construction of twenty-nine large boats; embarked on the 22nd of April, having previously loaded the flotilla with provisions and stores; descended the Nottawasaga River—the ice in the upper part of which being still firm, we opened a channel\nthrough it—encamped on the night of the 24th of April, in a most dismal spot, upon the north-eastern shore of Lake Huron; and, on the following morning, entered upon the attempt to cross that lake, covered, as it was, as far as the eye could reach, by fields of ice: through which, in almost constant and at times terrific storms, we succeeded, with the loss of only one boat, in effecting a passage a distance of nearly three hundred miles, arriving at Michilimackinac on the 18th of May.\n\nThe expedition had occupied upwards of one hundred days, including our passage over the lake; in respect to which, it may be permitted to refer to the following extract of a communication from the Commander of the Forces, dated 10th July 1814, addressed to His Majesty's Secretary of State.\n\n\"The difficulties experienced in conducting open and deeply laden batteaux across so great an extent of water as Lake Huron, covered by immense fields of ice and agitated by violent gales of wind, could only have been surmounted by the zeal, perseverance and abilities of the officer commanding this expedition. For nineteen days it was nearly one continued struggle with the elements, during which time, the dangers, hardships and privations to which the men were exposed, were sufficient to discourage the boldest amongst them, and at times threatened the total destruction of the flotilla.\"\n\nThe Fort of Michilimackinac stood upon an island, in circumference scarcely exceeding nine miles, and containing no settled inhabitants, with the exception of a few Canadians engaged in the fur trade. Its importance however, as a military possession, during the war, will appear from the following extract of a report from Sir George Prevost to Earl Bathurst, dated 10th July 1814.\n\n\"I deem it my duty to state, for your Lordship's consideration, that the Island and Fort of Michilimackinac is of the first importance, as tending to promote our Indian connexion and secure them in our interest; its geographical position is admirable; its influence extends and is felt amongst the Indian tribes to New Orleans and the Pacific Ocean; vast tracts of country look to it for protection and supplies; and it gives security to\nthe great trading establishments of the North-west and Hudson's Bay Companies, by supporting the Indians on the Mississippi, the only barrier which interposes between them and the enemy.\"\n\nWith the command at Michilimackinac, Lieutenant-Colonel M'Douall had been invested with authority throughout the Indian country; and, (having received the appointment of Fort Adjutant) I continued to assist the Lieutenant-Colonel in his various duties, including such as related to the management of the native tribes.\n\nThe garrison, after our arrival, worked hard in strengthening the defences of the Fort; and, as the enemy might arrive in the night, the ordinary guards were augmented at sun-down, to one third of the garrison, in addition to parties of Indians, who were stationed on the look-out, at various points. We had been joined by upwards of four hundred warriors, of different tribes, some of whom had come from a remote distance beyond the lakes. On the 5th of June a grand war-council was held in the open air: the Indians, from six to eight deep, were seated on the ground upon three sides of a square; while the Head Chiefs, one after the other, standing in front of their respective bands, delivered speeches of a highly satisfactory nature, and to which, Lieutenant-Colonel M'Douall replied, in an address, of which the concluding part was in the following words.\n\n\"My Children,\n\n\"I am delighted with what your great Chief, the 'Red Head' has told me, that in your wars with the 'Big Knives,' you have been equally distinguished by your bravery in the field and by your mercy to the vanquished—that in no one instance have their helpless women and children sustained an injury. Let me exhort you to a continuance of this praiseworthy conduct, which is the more meritorious on your part, considering the provocation the enemy have given you.\n\n\"My Children.\n\n\"Happy are those warriors who rush into the fight and have justice on their side. You go forth to combat for the\ntombs of your forefathers and for those lands which ought now to afford shelter and sustenance to your wives and to your children. May the Great Spirit give you strength and courage in so good a cause and crown you with victory in the day of battle.\"\n\nWe had failed in obtaining any tidings of the Americans until early in the month of June; and were then informed that they had been on the point of sailing from Detroit, upon their intended expedition against Michilimackinac, but, in consequence of intelligence of our arrival on the island, they had postponed their departure, for the purpose of obtaining an additional force. This information was not unwelcome; insomuch as some little time was required to finish a blockhouse, which had been commenced upon an important point.\n\nAt length, on the 28th of July, our long-expected visitors made their appearance, with six vessels of war, each having a gun-boat in tow. At this period, for seven successive nights, as well as during the day, the garrison was held in constant readiness for action.\n\nThe enemy's flotilla, after hovering round the island until the 4th of August, on the morning of that day, anchored within a few yards of the shore, on the north side of the island, and, after sweeping the landing place by a heavy fire, disembarked a force amounting to upwards of a thousand men with six guns.\n\nIt was not considered advisable to attempt to oppose the landing of the enemy: but, leaving a portion of the garrison in the Fort, Lieutenant-Colonel M'Douall, with the remainder of his force (to which I was attached), proceeded to occupy a position, at a convenient distance from the place of landing, intending to engage the enemy's troops when they should have advanced beyond the support of their fleet. Our force consisted of one hundred and seventy men, besides artillery, with two guns and three hundred Indian warriors.\n\nShortly after landing, the enemy's troops, preceded by their guns, having passed through a strip of wood, advanced directly towards us; and before many minutes had elapsed, the fire of their artillery was concentrated\nupon our position. We occupied commanding ground; and, in front, were, in some degree, covered by a natural breastwork. At first, the fire of our guns was reserved; but, a few rounds, in the nick of time, sufficed to cause a hasty retreat of the Americans to the wood, through which they had previously passed; and, after nearly half an hour's firing, their artillery, also, drew off.\n\nThe enemy, then, having changed their ground, attempted to pass through a part of the wood, which extended beyond our left. This movement necessitated a change in the disposition of our force: but, the Americans had not proceeded far into the wood, when they were attacked, both in front and on their right, by a band of our Monononie and other Indians. These warriors were, in a great measure, hidden by the trees, but \"the war-whoop\"—their battle cry—resounded through the wood: and, at an opportune moment—when the advance of the enemy had been arrested—Lieutenant-Colonel M'Douall, with a part of his remaining force, including a fresh body of Indians, made a rapid movement against the enemy's left, the effect of which was both instantaneous and decisive. Apprehending (as they afterwards acknowledged) that they were about to be surrounded) the American troops fell back in complete disorder, leaving their killed (including their second in command) as also many of their wounded, on the field—and, upon being closely pressed, continued to retreat to their shipping, under the guns of which, they lost no time in re-embarking.\n\nThe Commander of the Forces, in a report to the Secretary of State, dated Montreal, 20th September 1814, was pleased to notice the successful defence of our posts in the following terms.\n\nExtract.\n\n\"I have the honor to transmit to your Lordship, a copy of a letter I have received from Lieutenant-Colonel M'Douall, by which it appears that the attack upon his post, which in my despatch No. 186, of the 14th of August, I mentioned as having taken place on the 24th or 25th of July, was not made by the enemy until the 4th of August, and termin-\nated in the manner which Lieutenant-Colonel M'Douall had confidently anticipated. The gallantry, skill and conduct, manifested by Lieutenant-Colonel M'Douall and his small garrison in defending his post against such superior numbers, will not, I am certain, escape your Lordship's observation, or fail to procure for that officer the approbation of His Royal Highness, the Prince Regent.\"\n\nThe day after the failure of the enemy's attack, three of the largest of their vessels proceeded down the lake, while the other three continued to blockade the island. At that time, our stores contained not more than between two or three weeks' provisions for the troops; and there appeared but too much reason to fear that our expected supplies from Canada, would be intercepted. In this state of things, it was determined to diminish the ration of all classes in the garrison, as also to discontinue the issue of provisions to the Indians, who, in consequence, had no alternative but to retire to their homes. Some of the chief men had earnestly desired to remain with us; and it having been decided to accede to their wishes, the few horses that happened to be on the island, were killed and salted for their support. The rest of the bands departed, in a sorrowful mood, and all engaged to return whenever required.\n\nAs time passed on, our situation became a most anxious one; and, at length, towards the end of the month, we saw ourselves on the verge of starvation. On the 30th of August, two of the blockading vessels—war schooners of the American Navy—were reported to have anchored in the boat channel—one in the lower, and the other in the upper passage, near the island of Saint Joseph's; and, their exact position having, under cover of the night, been ascertained by Lieutenant Worsley of the Royal Navy, upon the report of that officer, it was resolved to attempt their capture. Accordingly, in the afternoon of the 1st of September—in the short space of an hour—four boats were equipped and manned, one by the naval officer alluded to, with a small party of seamen, and the other by volunteers, from the troops, placed under my command. We rowed with muffled oars, a circuit of nearly forty miles at night, keeping out\nof sight during the day; and, having carried both the enemy's vessels, by boarding—one on the night of the 3rd, and the other at dawn of day on the 6th of September 1814—had the satisfaction of conveying our prizes to Michilimackinac.\n\nI have received the Naval war medal and one clasp for these captures.\n\nThe captured vessels afforded immediate assistance in provisions; and, having been taken into His Majesty's Service, were despatched to the lower part of the lake, whence they returned, in due time, fully laden with supplies: by means of which, the garrison was again placed in a state of security, and we were enabled to fulfil the engagements of His Majesty's government, in supplying the Indian tribes, who had assisted us in the war, with those articles of clothing and ammunition, without which, they would inevitably have perished during the then approaching winter.\n\nFrom Lieutenant-General Sir George Prevost, Bart. Governor in Chief and Commander of the Forces in Canada, to the Right Honourable Earl Bathurst, dated Cornwall, Upper Canada, 7th October 1814.\n\n\"I have the honor to transmit to your Lordship, the highly gratifying intelligence, which I have this moment received from Lieutenant-Colonel M'Douall, commanding at Mackinac, of the capture in the neighbourhood of Saint Joseph's, in the most gallant manner, by boarding, of the two American schooners, which had been left on Lake Huron, for the purpose of blockading Mackinac, and cutting off all supplies from that island, and our other possessions on Lake Huron and Lake Superior.\n\n\"These captures are of the highest importance to His Majesty's possessions on Lake Huron and on the Mississippi, as the vessels are admirably adapted for the navigation of that Lake, and Lake Michigan, and for conveying the supplies so much required. As Lieutenant Worsley appears to have been most ably supported by the detachment of the Royal Newfoundland Regiment, commanded by Lieutenant Bulger, I beg leave to recommend that officer, as well as Lieutenant Worsley of the Royal Navy, to the gracious consideration of His Royal Highness the Prince Regent.\"\nThe despatch of the Governor in Chief, of which the foregoing is an extract, was published in the London Gazette of the 19th November 1814: and in another letter, of which the following is a copy, I was recommended to His Royal Highness the Commander-in-Chief for promotion.\n\nCornwall, Upper Canada\n7th October 1814.\n\nI have the honor to submit, enclosed, for the favourable consideration of His Royal Highness the Commander-in-Chief, a letter which I have just received from Lieutenant-Colonel M'Donnell commanding at Michilimackinac covering an application for promotion, for Lieutenant Bulger, of the Royal Newfoundland Fencibles.\n\nLieutenant Bulger having been nine years a Lieutenant, and having recently distinguished himself in assisting in the capture of two of the enemy's armed schooners on Lake Huron, I beg leave to recommend that officer for a company in the New Brunswick Fencibles, or any other corps serving in British North America.\n\n(Signed) George Prevost,\nCommander of the Forces.\n\nMajor-General Torrens\nHorse Guards.\n\nThe Americans, during the summer of 1814, had erected a fort upon the upper Mississippi; their object being to obtain a control over the western Indians, with a view to detach those tribes from our service, and, thereby, open a way into our valuable fur-trading settlements in the North West. The enemy's fort had been completed and was in part armed, but it had received only a portion of its intended garrison, when it was besieged by a force (which had been sent against it by Lieutenant-Colonel M'Donnell) consisting of Canadians and Indians, under Major William M'Kay, an enterprising officer of the Lower Canada Militia: to whom, in a few days, the American garrison surrendered upon the condition of being allowed to return to St. Louis,\nA detachment of a provincial corps (the Michigan Fencibles) had been despatched to occupy the captured fort, until a regular force could be sent to garrison it: but, the Americans soon shewed a determination to make every effort to retake it: and, in the fall of the year, as no regular troops could, as yet, be spared for so distant a service, Lieutenant-Colonel M'Douall expressed a desire that I should proceed to the Mississippi, to take command of the fort, and to endeavour to organise the Indians to co-operate in its defence.\n\nExtract from Garrison Orders.\nMichilimackinac, 17th October 1814.\n\nLieutenant Bulger, of the Royal Newfoundland Regiment, is appointed to the command of Fort M'Kay, at the Prairie du Chien, with the rank of Captain. This command of course invests Captain Bulger with the exclusive direction of all operations on the Mississippi.\n\n(Signed) Rt. M'Douall,\nLieutenant-Colonel Commanding.\n\nExtract from Garrison Orders.\nMichilimackinac, 23rd February 1815.\n\nHis Excellency the Commander of the Forces, and Governor in Chief, has been pleased to sanction and confirm the appointment of Captain Bulger, commanding at Fort M'Kay and on the Mississippi, as also his local rank and half the command money allowed for Michilimackinac.\n\n(Signed) Rt. M'Douall, Lieutenant-Colonel Commanding at Michilimackinac.\n\nWith the exception of a small settlement of Canadians, situated on the western shore of Lake Michigan, the route from Michilimackinac to the Mississippi—a distance of more than five hundred miles—was known to be a complete wilderness: to proceed through which, I left the former station, with five deeply-laden boats, on the 29th October 1814. Snow had commenced to fall previous to our departure; and the weather, at night, had become cold. Our tents—the best that could be obtained at\nMichilimackinac—were too old and thin to be of much use; and in little more than a fortnight, the winter had regularly set in. The toils and hardships of the remainder of the voyage were most severe: in many places, in the ascent of the Fox River, owing to the coldness of the water, in which the boatmen frequently had to work in surmounting rapids and other impediments, their labours were of an exceedingly trying nature.\n\nAs we advanced, the cold continued to increase in severity; and we were, ultimately, obliged to open a passage, a distance of at least one hundred and fifty miles, through the ice, which had completely overspread the Wisconsin River. We had accomplished little more than half the voyage, when, in a most desolate spot, a group of Indian families appeared on the bank of the river, and, upon enquiry, were found to consist of women and children, with a few aged men; who, in journeying to the winter hunting-ground of their people, had been two days without food. Our own means, at this time, were not over abundant; but it was impossible to resist the supplications of starving women and children; and with our assistance, they were enabled to continue their journey. The consequence, however, was that, while working for our lives in the ice, we, ourselves, fell short of provisions, and, in the end, had nothing whatever to eat from the morning of the 29th November until we reached Fort M'Kay, after dark, on the 30th of that month—the day upon which I completed my twenty-fifth year.\n\nI assumed the duties of my appointed charge under circumstances of far greater difficulty than had been expected; especially in regard to the Indians; to whom—owing to a deficiency of boat-transport—it had been found impossible to convey more than a portion of their accustomed winter supplies: in consequence of which, a feeling of irritation pervaded the whole of the tribes. A serious difficulty also presented itself in the want of any certain means of subsistence. When I arrived, the garrison of Fort M'Kay were dependant upon a precarious and scanty allowance\nof bread, with a ration of wild meat, when the hunters were able to supply it. Altogether, my position at the outset, was far from being an encouraging one. Upon that point, I may refer to the following extract of a letter addressed to me, from Michilimackinac, by Lieutenant-Colonel M'Douall.\n\n\"I cannot refrain from expressing how much I have felt at the sufferings you endured on the voyage, and the very arduous and trying circumstances in which you have been placed since your arrival. It does you but strict justice to say that you have conducted yourself with equal prudence, firmness and ability, and, what is no small praise, have proved yourself fully equal to the difficulties which you were called upon to encounter. All your measures meet with my unqualified approval.\"\n\nDuring upwards of three months of the winter, my duties were as unceasing as they were arduous; and, for some time, I may say, I laboured almost without hope. I was obliged to visit many parts of the interior of the Indian country—a wild, inhospitable region—in which, with the exception of a few adventurous fur-traders, a white man had not previously been seen. Accompanied by a provincial officer, acting as interpreter, and four Canadian hunters, I travelled fully seven hundred miles, partly in a winter vehicle on the ice, occasionally on foot and upon snow-shoes, and upon horseback over prairies after the snows had begun to melt. Upon these journeys (one of which occupied above twenty days) we experienced frequent and severe privations. At night, we often slept before a fire in the open air, with arms prepared for defence—two hunters keeping watch—the country on our route being infested by evil disposed bands—outcasts from various tribes.\n\nThe only white inhabitants of the territory, in which our post was situated, were Canadians, about two hundred in number: nearly one half of whom were hunters and voyageurs; the remainder being settled upon land at the Prairie du Chien. These latter were in great distress; having, previous to my arrival, been plundered of their cattle, as also of a considerable portion of their grain crops, by the Indians; and, having\nfor years, lived uncontrolled—there being neither magistrate nor minister of religion in the country—they had become almost as intractable as the Indians themselves. I was enabled, however, to establish order and security in the settlement—as will appear from the following copy of an address on the part of its inhabitants—and I succeeded eventually in forming them, with many of the hunters, into a most useful corps of volunteers, for service against the enemy.\n\nFort M'Kay, 15th January 1815.\n\nCopy.\n\nSir,\n\nWe, the inhabitants of the Prairie du Chien, not knowing how to express the sentiments with which we are imbued, humbly request you will accept our acknowledgments and thanks, for the protection afforded by you to His Britannic Majesty's subjects. Your conduct and activity, in rendering justice in a savage territory, heretofore exposed to so many misfortunes, leads us to hope that we shall in future live peaceably under your government; and permit us at the same time to express our zeal, courage and loyalty towards our sovereign.\n\nOn behalf of the inhabitants of the Prairie du Chien.\n\n(Signed) Joseph Rolette.\nFrançois Bouthillier.\n\nCaptain Bulger\nCommanding Fort M'Kay.\n\n&c. &c. &c.\n\nIn the course of the winter, information had been received of the intention of the Americans to ascend the Mississippi, from St. Louis, with a large force early in May; and, in the first week of April—agreeably to arrangements which I had been enabled to make with those tribes whose services were of the most importance—upwards of six hundred warriors, with their war-chiefs (a few of whom appeared with English medals) arrived at the Prairie du Chien. All were equipped for war,\nwanting only ammunition, an ample store of which I had succeeded in procuring for their use. The gunpowder had been drawn upon hand-sleds, over snow and ice, a distance of more than four hundred miles; and, having obtained lead from a mine in the vicinity of our Post, we had been enabled to make an abundance both of ball and shot. In addition to the bands already assembled, five hundred of the Saukks and Ottogamies, had engaged to join us at the shortest notice. My own force, at this time, consisted of fifty men (red coats) of the Michigan Fencibles, with one hundred and thirty Mississippi Volunteers and upwards of forty Canadian voyageurs, with a small party of artillery-men and soldiers of the line (trained as gunners) in charge of two three-pounder brass guns for field and boat service.\n\nHaving, in a recent despatch—of which the following is a copy—received instructions to make an important communication to the Indians, I lost no time in carrying those instructions into effect, in a full assembly of the Chiefs and principal warriors of the several bands.\n\nMichilimackinac, 26th February 1815.\n\n\"The most interesting intelligence from Europe was the breaking up of the congress at Ghent and consequent failure of the negotiations for peace with the Americans: the principal cause was the question relating to the Indians. This article having for its object the future security and welfare of the Indian nations, was demanded and persisted in as the sine qua non of negotiation. The American Commissioners had no instructions relative to those demands, and the treaty accordingly broke off.\"\n\n\"I send you a newspaper, giving all the particulars of the late negotiation. You will announce this intelligence to the Indians in grand council, with all the eclat and effect which you can give it, and which, its singular importance to them is so calculated to inspire. I enclose a speech which you may add to, in any way you think will make it more impressive. In fact, the ensuing summer will require no small dexterity and judgment in successfully managing them, amidst so many difficulties. Leave no means untried to excite their enthusiasm and perseverance, were it only\nfor the next campaign, which, if we bring to a successful close (of which I have most sanguine hopes) all will be well and the game our own. Let no endeavours be wanting, and whatever may be the result, let us at least have the proud consolation of knowing that we deserved success.\"\n\n(Signed) Rt. M'Donnell,\nLieutenant-Colonel Commanding.\n\nCaptain Breuer,\nCommanding on the Mississippi.\n\nEvery effort had been made during the winter, to procure provisions for the spring operations: a stock of wild meat had been collected and stored in an ice-house; and, upon the opening of the rivers, we received a considerable quantity of Indian corn from a distant settlement. But these supplies were altogether too limited to render it advisable that we should wait to be attacked, and, after a consultation with the Indian Chiefs, it was decided to carry the war to the vicinity of Saint Louis, where, it was known that cattle in abundance could be procured. We should thus be enabled, in some measure, to reserve our own means, and by threatening Saint Louis, keep the Americans at home to defend that place.\n\nI had already despatched strong war-parties down the Mississippi, to an appointed rendezvous; and was on the point of proceeding, with our main force, to the same quarter; when, on the 16th of April—by a communication from Governor Clark, the American officer in command at St. Louis, addressed \"to the British Officer on the Mississippi\"—I was apprized of the re-establishment of peace between Great Britain and the American States. This unexpected announcement being accompanied by a printed copy of the treaty of peace, as published by the American authorities at Washington, I considered it my duty to lose no time in acting upon it, so far as to recall the war-parties in advance; and, before many days had elapsed, an official intimation of the peace reached me, by express, from Michilimackinac.\nIntelligence of the peace having spread throughout the country, in a few days the number of Indians assembled at the Prairie du Chien had immensely increased, and included nearly all the head chiefs of tribes. The treaty contained a provision in respect to the Indians generally; but, the conditions assured to them were not such as the western tribes had desired and expected to obtain. An extreme degree of excitement arose upon the occasion. The chiefs expressed a determination not to abide by the treaty; and there even appeared reason to apprehend that acts of hostility would be directed against ourselves. During nearly a fortnight—while the garrison remained under arms in the fort, distant nearly a quarter of a mile—I passed a portion of each day in the council-house—accompanied by an interpreter for each tribe—holding conferences with the chiefs and principal men; all of whom were eventually brought to view the treaty favourably, and, when the proper time arrived, after I had received my final instructions, I had the satisfaction of witnessing the ratification of the treaty, with the usual Indian ceremonies, by the chief men of all the tribes, assembled in a general council.\n\nUpon the termination of my service on the Mississippi, having, in consequence of the state of my health, which had suffered severely during the preceding winter, received permission to return to the head-quarters of the army at Quebec, I proceeded thither travelling in boats and bark-canoes, a distance of at least one thousand four hundred miles. Upon arriving at Quebec, in the middle of July 1815, I had the mortification of learning that the recommendations of the preceding autumn in my favour, had not been successful. I found also, that every service lieutenant, who had been senior to me in the Canada army, at the beginning of the American war, as also many of those who had been junior to me, had obtained promotion to the rank of captain.\n\nLieutenant-General Sir Gordon Drummond, who had succeeded Sir George Prevost in the command of the forces in Canada, was pleased\nto submit my claims to His Royal Highness the Commander-in-Chief in a letter of which the following is a copy.\n\nQuebec, 9th August 1815.\n\nSir,\n\nI have the honor to enclose the memorial of Lieutenant Andrew Bulger, of the Royal Newfoundland Fencibles, for promotion.\n\nThis officer during the last twelve months has been successfully employed under Lieutenant-Colonel M'Douall, in the arduous and insulated command of our remotest possessions in the Indian countries, and was selected by that officer for the command of Fort M'Kay, on the Mississippi, during a period of embarrassing difficulty, and acquitted himself with the greatest zeal and judgment. He was present at the repulse of the enemy in their attack of Michilimackinac, on the 4th August 1814. He commanded a detachment of the Royal Newfoundland Regiment, of fifty rank and file, and bore a prominent and conspicuous part in the gallant and judicious attack and capture, by boarding, of the enemy's two schooners, Tigress and Scorpion, on Lake Huron, whereby the intention of intercepting our supplies and starving the garrison of Michilimackinac into a surrender, was frustrated, and the security of that, then, most important post, fully secured and maintained.\n\nLieutenant Bulger was particularly mentioned on the occasion by Lieutenant-Colonel M'Douall, and in the despatch of Sir George Prevost, and he was recommended for a company in the New Brunswick Fencibles, or in any regiment in British North America; which recommendation I beg leave to renew, by requesting you will be pleased to submit his memorial to the most favourable consideration of the Commander-in-Chief.\n\nI have &c.\n\n(Signed) Gordon Drummond\nLieutenant-General Commanding.\n\nMajor-General\nSir Henry Torrens K. C. B.\n&c. &c. &c.\n\nTestimonial of Lieutenant Bulger's military services from the officer under whose immediate command he served, for a considerable period previous to the termination of the war.\n\" Lieutenant-Colonel M'Douall in transmitting and strongly recommending the enclosed memorial, performs this most pleasing duty with the thorough conviction that in the annals of the British army, but few instances have occurred of a subaltern officer approaching his illustrious Commander-in-Chief with such genuine claims to his patronage and protection.\n\n\" Lieutenant-Colonel M'Douall has been an attentive observer of Lieutenant Bulger's professional career during the war, and considers the enclosed memorial as a correct and modest statement of his services.\n\n\" What passed under my own eye merits my warmest approbation, particularly his conduct during our perilous voyage through the ice for the relief of this island, and in the repulse of the enemy therefrom on the 4th of August. No language of mine could do justice to his merit on the capture of the enemy's schooners, of such signal consequence to this garrison, by relieving us from a blockade which threatened us with famine.\n\n\" I selected Lieutenant Bulger, as an experienced officer, in preference to others of higher rank, to command at Fort M'Kay, on the Upper Mississippi, from my high opinion of his professional talent. Merely to state that I was not disappointed would not suffice; for though placed in the most embarrassing situation, and environed with difficulties, his zeal, fortitude, and exertions, surmounted them all, and the good effects of his able management proved highly beneficial to the public interest.\n\n\" In depicting this officer's long and meritorious services, justice to him and to my own feelings, causes me to dip my pencil in vivid colours. I am, however, not satisfied with my representations. I therefore with confidence submit them to the favourable consideration of His Royal Highness the Commander-in-Chief, before whom claims like his never pleaded in vain.\"\n\n(Signed) Rt. M'Douall\nLieutenant-Colonel Commanding\nMichilimackinac and Dependancies.\n\nMichilimackinac,\nJuly 6th 1815.\n\nHorse Guards,\n2nd November 1815.\n\n\" Major-General Sir Henry Torrens presents his compliments to Lieute-\nnant Bulger, and has enclosed the copy of a communication, which the Commander-in-Chief directed to be made to Sir Gordon Drummond in reply to the Lieutenant-General's recommendation of him.\"\n\nHorse Guards,\n29th September 1815.\n\nSir,\n\nHaving submitted to the Commander-in-Chief, your despatch of the 9th ult. (in duplicate) with its enclosures, I am directed to assure you, that His Royal Highness will be glad to give all the attention that the military arrangements may admit to the claims of Lieutenant Bulger of the Royal Newfoundland Fencibles, and his name is accordingly noted on a list of candidates for special consideration.\n\nI have &c.\n(Signed) H. Torrens\n\nLieutenant-General.\nSir Gordon Drummond K. C. B.\n&c. &c. &c.\n\nFrom Major-General Sir Henry Torrens to Lieutenant Bulger.\n\nHorse Guards,\n29th March 1816.\n\nSir,\n\nI have laid your letter of the 27th instant before the Commander-in-Chief, and I am directed to express His Royal Highness's regret, that under present circumstances, he has not the means of recommending you for promotion.\n\nI am &c.\n(Signed) H. Torrens.\n\nLieutenant Bulger,\nRoyal Newfoundland Fencibles.\n\nOn the 24th June 1815, the regiment to which I belonged and in which I continued to be the senior lieutenant, having been disbanded, I was placed upon the half-pay list as a lieutenant.\n\nIn May 1817, having applied to be restored to full pay, I received a communication, of which the following is a copy.\nHorse Guards,\n12th May 1817.\n\nSir,\n\nHaving laid before the Commander-in-Chief your memorial of the 2nd instant, with its enclosures, I am directed to acquaint you, that all His Royal Highness can promise to do, is, to bring you into employment on full pay on an opportunity offering, and for which your name is noted.\n\nI am &c.\n(Signed) H. Torrens.\n\nLieutenant Bulger,\nHalf-pay\nLate Royal Newfoundland Fencibles.\n\nI was not, however, favoured with an appointment: and, my health having continued to suffer from the injury it had sustained during my service in the direction of the Indians, I was induced, at length, to make application to His Majesty's Secretary of State for the Colonies, with a view to obtain remuneration for such services, in respect to which the following communications, from Lieutenant-Colonel M'Douall and Lieutenant-General Sir Gordon Drummond, were submitted to Earl Bathurst.\n\nStranraer,\n23rd December 1819.\n\nMy Lord,\n\nLieutenant Andrew Bulger, on the half-pay of the late Royal Newfoundland Regiment, having a few days ago, stated to me his intention of making application to your Lordship for a remuneration for civil services performed by him in the Indian Department, while commanding at Fort M'Kay on the Mississippi; and having required from me, as his commanding officer, a testimonial of the said services, I feel it my duty to accede to his request, in justice to the merit of a very deserving officer.\n\nLieutenant Bulger in February 1814 joined an expedition under my command, destined for the relief of Michilimackinac. In the previous part of the war, he had been repeatedly engaged with the enemy, with great credit to himself. I reaped much assistance from his zeal and experience in the building and equipment of our flotilla. In our subsequent\ndangerous voyage through the ice across Lake Huron, but particularly during the operations which defeated the combined attack of the American forces on Michilimackinac, upon the 4th August.\n\nThe failure of this attack induced the enemy who knew of the extreme scarcity of provisions in the garrison, to look wholly for success in a rigid blockade, and which must infallibly have succeeded but for the capture of both vessels by boarding. I had entrusted to Lieutenant Bulger the command of the military part of the expedition, consisting of three subalterns and fifty men, and it is impossible that I can ever forget the conspicuous gallantry and good conduct which he displayed upon the occasion. He was wounded in the act of boarding, besides receiving a severe contusion on the breast. The consequences of this exploit were most important, as it secured Michilimackinac, and the prizes restored to us the uninterrupted navigation of Lake Huron.\n\nThe capture of the American fort on the Mississippi, (since Fort M'Kay) by the detachment I had sent against it, was equally fortunate for us, tending to confirm the wavering loyalty of the numerous warlike tribes of that country, by whose zealous co-operation alone, the north western frontier of Upper Canada could be protected. The enemy were making great efforts to recover the fort, and cut us off from allies they had found so formidable. In this emergency I cast my eyes on Lieutenant Bulger to meet the difficulties of this arduous command, and to assume the direction and management of the Indians, being aware that if good order, confidence and zeal for the common cause could be infused into them, it would be effected by this active and intelligent young officer. Though depressed by sickness in consequence of his recent wound, he embarked for his station, five hundred miles distant, in an open boat, and in severe weather. The local rank of captain was conferred, as well as a full control over the Indian Department, into which he introduced economy and arrangement, instead of the most profuse expenditure. But were I here to state the hardships and distresses which Lieutenant Bulger underwent in the discharge of his various duties, his journeys in the depth of winter to procure food and ammunition for his numerous Indians, and to organise them for the campaign which was so soon expected, together with the extreme danger to which himself and garrison were exposed on the peace being announced to them, I should not only encroach too much on your Lordship's time, but I am satisfied\nthe recital would not be comprehended in this country. Suffice it to say that the nature of his command called for the continual exercise of that firmness and ability which enabled him to surmount every obstacle, and to perform what was expected from him to the entire satisfaction of Lieutenant-General Sir Gordon Drummond.\n\nI have &c.\n\n(Signed) Rt. M'Douall,\nLieutenant-Colonel.\n\nThe Right Honorable\nThe Earl of Bathurst.\n\nNaples,\n28th March 1820.\n\nMy Lord,\n\nI have just been informed by Lieutenant Bulger on the half-pay of the late Newfoundland Fencible Regiment, of his intention to make application to your Lordship for compensation for various services performed by him, in the Indian Department, while serving under the orders of Lieutenant-Colonel M'Douall at Michilimackinac during the late war.\n\nIt is but justice in me to bear testimony to the zeal and exertions of Lieutenant Bulger during the above period, viz. from the commencement of the year 1814, when he joined Lieutenant-Colonel M'Douall, to the conclusion of the war. Independant of the conduct and services performed by him in his military capacity, his active exertions in the management and direction of the Indians at Fort M'Kay, on the Mississippi, amidst privations and hardships unknown upon regular service; in allaying their discontents; in organizing and preparing them to encounter the enemy, and in removing from their minds at the peace, impressions which might have proved detrimental to our interest in a future war, fully entitle him to the favourable consideration of His Majesty's Government.\n\nLieutenant Bulger was wounded, and received a severe contusion in the act of boarding two of the enemy's schooners on Lake Huron, for the capture of which vessels, the naval officer (Lieutenant Worsley) commanding\nwas promoted to the rank of commander after the war.\n\nI have the honor to be,\nyour Lordship's\nmost obedient humble servant\n(Signed) Gordon Drummond.\n\nThe Earl Bathurst.\n&c. &c. &c.\n\nThe result of my application was, that, besides allowing me a present compensation of five hundred pounds, the Lords of the Treasury were pleased to desire His Majesty's Secretary at War, to take the necessary measures for granting to me a military allowance equal to the half-pay of a captain.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_48336.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 37, "total-input-tokens": 63582, "total-output-tokens": 14279, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 944, 3], [944, 3399, 4], [3399, 3399, 5], [3399, 3600, 6], [3600, 3600, 7], [3600, 4963, 8], [4963, 7324, 9], [7324, 9314, 10], [9314, 11435, 11], [11435, 13524, 12], [13524, 15610, 13], [15610, 17616, 14], [17616, 19505, 15], [19505, 21704, 16], [21704, 23682, 17], [23682, 25791, 18], [25791, 27857, 19], [27857, 30080, 20], [30080, 32201, 21], [32201, 33985, 22], [33985, 35806, 23], [35806, 37888, 24], [37888, 40049, 25], [40049, 41733, 26], [41733, 43920, 27], [43920, 45826, 28], [45826, 47904, 29], [47904, 49846, 30], [49846, 51934, 31], [51934, 53372, 32], [53372, 55160, 33], [55160, 57714, 34], [57714, 59512, 35], [59512, 59989, 36], [59989, 59989, 37]], "primary_language": ["None", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]