[{"id": "1d75ddce767413d0cabdd7f750f80681422beb19", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nGENERAL\n\nBY-LAWS,\n\nRULES AND REGULATIONS,\n\nOF THE\n\nBROCKVILLE AND OTTAWA\n\nRAILWAY COMPANY,\n\nADOPTED BY THE\n\nBOARD OF DIRECTORS,\n\nNOVEMBER 29, 1853\n\nBROCKVILLE:\n\nD. WYLIE, PRINTER, RECORDER OFFICE.\n\n1854.\nGENERAL BY-LAWS, RULES, &c.\n\nThe Directors of THE BROCKVILLE AND OTTAWA RAILWAY COMPANY, in pursuance of the powers in them vested by the Railway Clauses Consolidation Act, and the special Act, do hereby make and enact the following By-Laws, Rules, Orders, and Regulations; that is to say:\n\nOF ANNUAL GENERAL MEETINGS.\n\nI.\n\nAnnual General Meetings shall be called to order by the President or Vice President of the Board of Directors for the time being, and shall then proceed to the nomination of a Chairman and Secretary, and in case of a difference of opinion, the nomination shall be decided by the votes of the Shareholders present,—each Shareholder having only one vote; and in case of a tie, the President or Vice President calling the meeting to order, shall have a second or casting vote.\n\nII.\n\nThe Meeting shall then in like manner nominate two Scrutineers to receive votes, and the Scrutineers shall forthwith open a Ballot for the choosing of Directors. This Ballot shall be kept open from twelve o'clock noon, until three o'clock P.M., as soon after which hour as possible, the Scrutineers shall deliver to the Secretary of the Company for the time being, a Report, in writing, of the names of the qualified proprietors having the greatest number of votes for the Directorship, and in case of there being a tie of votes given for any person, so as that to the extent of the number of Directors to be elected, there shall not be a majority of votes given, a new Ballot shall be opened by the same Scrutineers, for the Election of Directors, to supply the defect arising from such tie of votes.\nIII.\n\nImmediately after the Nomination of the Chairman and Secretary of the Meeting, and of the Scrutineers, the Directors shall submit a general statement of the affairs of the Company, and give to the Meeting such further information as they may deem useful to the interests of the Company as may be required of them by the Meeting.\n\nIV.\n\nEvery motion shall be submitted to the Chairman in writing, and on being seconded may, by common consent, be decided by a show of hands; but in case any Proprietor shall dissent from that mode of decision, the votes shall be taken, and the motion decided agreeably to the 11th clause of the special Act incorporating The Brockville and Ottawa Railway Company.\n\nV.\n\nAs soon as convenient after the Election of Directors shall be declared, the Secretary of the Company for the time being shall call a meeting of them.\n\nOF DIRECTORS.\n\nVI.\n\nMonthly meetings of the Board shall be held on the last legal day of each month, at the hour of Ten o'clock A. M., at the Company's office, for the transaction of business; and Adjourned Meetings may be held at such times as a quorum of Directors may order.\n\nVII.\n\nThe President shall have power to call Special Meetings of the Directors when necessary, at such time as he shall appoint, and it shall be his duty to call such Special Meetings when any three of the Directors shall request him in writing so to do, stating the object of such Meeting.\n\nVIII.\n\nIn the absence of the President and Vice President, a quorum of Directors may appoint one of themselves as Chairman, to preside at the meeting for which he shall be appointed Chairman, and as such Chairman shall, for the purpose of such Meeting, be invested with the powers and authority of the President. The President, Vice President, or Director so\npresiding, shall vote as a Director, and, in case of an equality of votes, he shall have a casting vote.\n\nIX.\n\nNo business shall be transacted or entered upon at any meeting of the Board of Directors until the minutes of the preceding meeting shall have been read, approved, and signed by the President, Vice President, or presiding Director for the time being, and the Secretary.\n\nX.\n\nThe following shall be the order of business:\n\nReading Minutes.\nReading Communications.\nReferring Communications.\nNotices of Motion.\nReports of Committees.\nConsideration of Reports of Committees.\nMotions.\n\nXI.\n\nEach Member of the Board who wishes to speak shall address the Chairman, standing; and every Motion shall be submitted to the Chairman in writing.\n\nXII.\n\nNo conveyances or sale of property of the Company, and no payment of money whatsoever, shall be made until specifically authorized by a resolution of the Board of Directors, entered upon the Minutes; and all Deeds, Notes, Bonds, Contracts, Debentures, and Instruments to be made, or entered into by or on behalf of the Company, shall be signed, and, when necessary, be sealed with the Corporate Seal, by the President, or Vice President, on behalf of the Company, and shall be countersigned by the Secretary.\n\nOF COMMITTEES.\n\nXIII.\n\nThe President, or, in his absence, the Vice President, or managing Director, and two Members of the Board, in rotation, to be named from time\nto time by the Board, shall constitute an Executive Committee, which shall have authority to direct the Secretary and other Officers of the Company in all matters necessary for the interests of the Company, in the intervals between the meetings of the Board,—subject to the approval of the Board, at their next Meeting.\n\nXIV.\n\nStanding Committees shall be appointed as follows: 1. A Committee of Finance; 2. A Committee of Works; and such others as may be determined on from time to time by the Board of Directors. Such Standing Committees to consist of five members, to be appointed from time to time by the Board. Three Members shall form a Quorum. The duty of such Standing Committees shall be to carry out the Resolutions of the Board—to consider matters referred to them, and to report thereon from time to time. The Chairman of each Committee shall have a casting vote only.\n\nXV.\n\nSpecial Committees may from time to time be appointed by the Board for the consideration of such special matters as shall be referred to them respectively by the Resolution of the Board appointing such Committee, which Resolution may also regulate the number of Members which shall form a quorum of such Committee, and they shall, with all convenient despatch, report in writing to the Board the result of their deliberations upon such special matters.\n\nXVI.\n\nThe President shall be ex officio a member of all Committees. Such Committees shall appoint one of themselves to preside as Chairman.\n\nOF PRESIDENT AND VICE PRESIDENT.\n\nXVII.\n\nThe President, or, in his absence, the Vice President, shall have the general supervision of the affairs of the Company; he shall sign all documents, cheques, and instruments, and shall cause the Resolutions of the Board of Directors to be duly carried out; he shall take charge of the bonds given by the Officers of the Company, and deposit the same with the Bankers of the Company, and report all matters affecting the interests of the Company to the Board of Directors.\nOF THE OFFICERS.\n\nXVIII.\n\nThe Officers of the Company shall consist of a Treasurer, Secretary, Supervising Engineer, and such number of Clerks and Subordinate Officers as may from time to time be deemed necessary by the Board of Directors; provided that the Offices of Treasurer and Secretary may be united, if deemed desirable, by the Board of Directors; and such Officers shall and may from time to time be appointed by Resolution of the said Board, and the several appointments heretofore made by Resolution, are hereby confirmed and ratified.\n\nXIX.\n\nThe Treasurer shall give security by bond or bonds to the satisfaction of the Directors, to such an amount and with such sureties as to the Directors may seem fit, for the faithful discharge of the trust and duties of his Office, which bonds shall be placed in the custody of the President of the Company. He shall receive all calls, assessments, incomes, monies, and securities for money due, owing, or belonging to the Company, and shall deposit the same to the credit of, and in the name of the Company, in such Bank or Banks as the Directors from time to time, by a Resolution made and entered upon the Minutes of the Board, shall appoint. He shall give receipts in such form as shall, from time to time, be approved or prescribed by the Directors, for all monies and securities, for money received by him on behalf of the Company, and he shall in like manner take receipts from all persons to whom he shall deliver any cheques, when countersigned by him, as required by the By-Laws of the Company. He shall keep a regular set of Books, containing the accounts of the Company, and of all its funds which may pass through or come into his hands; and whenever required by the Directors, he shall furnish a detailed statement of all such accounts; and he shall make and deliver, for the use of the Board, a complete settlement and balance of the Books and Accounts of the Company, made up to the thirty-first day of December and the thirtieth day of June, respectively, inclusive, in each year; or at any other time that the Board may require the same. He shall countersign all cheques which shall have been previously signed by the President, or, in his absence by the Vice President.\n\nXX.\n\nTwo of the Directors shall be appointed, whose duty it shall be to examine and audit the whole accounts of the Company generally, at least once in the six months, in accordance with a resolution of the Board of Directors.\ndirecting the same to be prepared and issued, and shall cause due entries thereof to be made in the books previous to issuing the same.\n\nXXI.\n\nThe Secretary shall give security to the satisfaction of the Board of Directors; he shall take charge of all deeds or contracts made by or with the Company, depositing the same with the Bankers or such other person as may be appointed by the Board of Directors. He shall in a proper book or books, enter and keep a true and perfect account of the names, places of abode, professions or occupation of the several proprietors of shares in the capital stock of the said Company, and of the several Corporations which shall from time to time become original proprietors of, or entitled to any shares of the said capital stock. He shall keep a registry of the transfer of all shares which shall be made in the books of the Company in accordance with the By-Laws of the Company. He shall countersign and enregister all certificates of stock which shall be issued from the Company's Office, after the same have been signed by the President. He shall, when required, sign certificates of the forfeitures of all shares which shall be, in due course of Law, declared forfeited. He shall receive and submit to the Board of Directors all tenders for contracts. Whenever calls shall be made, he shall cause the same to be duly advertised as required by the Board and the Acts of Incorporation. He shall attend at all the meetings of the Board and of Committees, and keep the entries and minutes of their proceedings. He shall carry on or enter all the correspondence of the Company. He shall receive and lay before the Board of Directors all applications for demands upon the funds of the Company. He shall lay before the Board at its monthly meetings all communications received by him subsequent to each preceding meeting; and he shall, in like manner, submit a statement of all matters passing in his Office during the month. He shall prepare the drafts of all reports of Committees when required so to do by the Respective Chairmen of such Committees. He shall prepare all cheques, when the amounts for which the same shall be prepared shall have been approved by the Board of Directors, and shall present them to the President for his signature, testifying the same to have been approved. He shall deliver the same to the several parties entitled to receive the same after they shall have been countersigned by the Treasurer and entered in the books of the Company. He shall transmit to the Treasurer, for entry, all estimates and accounts after the same shall have been approved and ordered to be paid. He shall summon all meetings of Committees, whenever requested to do so by the Chairman of a standing Committee, or the mover of a special Committee, or by any two Members of either of such Committees. He shall convey the instructions of the Board to all of the Officers of the Company; and generally he shall discharge all such other duties as shall be imposed on him, from time to time, by resolution of the Board; provided that in case of the absence or illness of the Secretary, his duties shall be performed.\nby a Secretary pro tem., to be appointed by resolution of the Board of Directors.\n\nXXII.\n\nBooks for the Registry of Transfers of Shares shall be kept by the Secretary at his Office and in such other custody and place as may be from time to time directed by the Board, and shall be closed twice in each year, from the first day of January until the first day of February, and from the first day of July until the first day of August. New certificates for such stock so transferred may be issued by the Secretary if required, upon the delivery and cancelling of the former certificates.\n\nXXIII.\n\nThe Scrip or Certificates of ownership of Shares shall be in the form following, viz:—\n\nNo.\n\nTHE BROCKVILLE AND OTTAWA RAILWAY COMPANY.\n\nWe Certify that ———— [are or is] the [holder or holders] of one Share, No. —— of the amount of £5 in the Capital Stock of the Brockville and Ottawa Railway Company, upon which Share there has been paid the sum of —— Pounds —— Shillings, Currency; the said Share being transferrable at the Office of the Secretary of the Company, in manner and form prescribed by the Acts of Incorporation and the By Laws of the Company.\n\nDated this ———— day of ————, 185\n\nPresident.\n\nCountersigned and Entered,\n\nSecretary and Treasurer.\n\nBONDS.\n\nXXIV.\n\nThe Bonds of the Company to be issued to the Contractors as agreed shall be in the form approved by the President in accordance with the Act.\nlution of the Board passed on the twenty-eighth day of October last, and the same shall, as often as required, be signed by the President and countersigned by the Treasurer of the Company, and shall have the Corporate Seal of the Company affixed thereto, and the coupons for interest thereto attached shall be signed by the Treasurer, and the same shall be engraved on plates in sums of £100 Sterling with interest at the rate of £6 per cent. per annum, payable half-yearly on the first days of January and July in each year.\n\nXXV.\n\nAll payments to be made out of the Funds of the Company shall be made by cheques upon the Bankers of the Company, in such form and manner as by resolution of the Board of Directors, duly entered in the minutes shall from time to time be provided. Such cheques shall be payable to the order of the party or parties entitled to receive the amount to be specified in such cheques respectively, or his, her, or their duly authorized agent; and such cheques shall be signed by the President, or, in his absence, by the Vice President, or in the absence of both of them, then by the Chairman of the Board of Directors for the time being, and countersigned by the Treasurer; and unless so signed and countersigned, the same shall not be payable or be paid by the Bankers of the Company. And no cheques shall be issued out of the Office of the Secretary unless nor until the purpose and the amount for which the same shall have been prepared shall have been approved by resolution of the Board of Directors, duly entered on the minutes of the Board; and the Treasurer shall place before the Directors at their monthly meetings, the Bank Book in which the cheques and deposits of the Company shall have been duly entered, and an abstract of the cash receipts and disbursements of the month.\n\nXXVI.\n\nThe Seal of the Company shall be kept in the custody of the Secretary.\n\nXXVII.\n\nThe Salaries of the Officers of the Company shall be determined from time to time by resolution of the Board of Directors, and the Salaries heretofore fixed by resolution of the Board are hereby confirmed and ratified until otherwise provided.\n\nXXVIII.\n\nThese By-Laws may be altered or cancelled from time to time at the pleasure of the Board of Directors; provided that not less than two weeks'\nnotice shall be given in writing, at a meeting of the Board, of any resolution to amend the same.\n\nIN TESTIMONY WHEREOF the said Directors have caused these By-Laws, Rules, Orders and Regulations, adopted, made and enacted as aforesaid, the twenty-ninth day of November, in the year of our Lord one thousand eight hundred and fifty-three, to be signed by the President the day and year aforesaid.\n\nGEORGE CRAWFORD, President,\nBrockville & Ottawa Railway Company.\n\nDAVID WYLIE, PRINTER, BROCKVILLE, C.W.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_43331.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 26468, "total-output-tokens": 4564, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 944, 3], [944, 2050, 4], [2050, 2254, 5], [2254, 2254, 6], [2254, 3860, 7], [3860, 5648, 8], [5648, 7074, 9], [7074, 9070, 10], [9070, 11539, 11], [11539, 14692, 12], [14692, 16101, 13], [16101, 18400, 14], [18400, 18903, 15], [18903, 18903, 16]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, true]}}]