[{"id": "1efda4cadddbf77acb26a6f9079761628686f9de", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:/ Various pagings. Wrinkled pages may film slightly out of focus.\n\nThis item is filmed at the reduction ratio checked below/\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 4 | 5 | 6 |\n|---|---|---|\n|   |   |   |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nA SYSTEM\nOF THE\nCREATION OF OUR GLOBE,\nOF THE\nPLANETS,\nAND THE\nSUN OF OUR SYSTEM,\n\nFOUNDED ON THE FIRST CHAPTER OF GENESIS, ON THE GEOLOGY\nOF THE EARTH, AND ON THE MODERN DISCOVERIES IN\nTHAT SCIENCE, AND THE KNOWN OPERATIONS\nOF THE LAW OF NATURE,\n\nAs evinced by the discoveries of\n\nLAVOISIER,\nAND OTHERS IN PNEUMATIC CHEMISTRY.\n\nFOURTH EDITION REVISED AND ENLARGED.\n\nBy Henry Taylor.\n\nTORONTO:\nPRINTED BY W. J. COATES, KING-STREET.\n\nMAY 171971\nMEMORANDUM FOR THE READER.\n\nThe reader will find the new matter of the Second, Third, and present Editions in the Appendix No. 2, at the end of the Work.\nPREFACE.\n\nIn my endeavours to reconcile the present Geological appearances of our Earth, with the Mosaic account of Creation, the only certain means that appeared to me, were, the adoption of that construction of the first verse of Genesis, which I have stated in a part of this Work, and it will be seen by an extract from the Quarterly Review of April last, inserted below, that this construction has been confirmed and sanctioned by the writings of Professor Buckland, Doctors Pusey and Chalmers, Bishop Gleig, and other eminent Divines. These authorities have removed the diffidence I had long felt to publish a different construction from what has, hitherto, prevailed.\n\nThe original manuscript of this work was composed between the years 1819 & 1825. The writings of the above reverend gentlemen were published, I believe, several years afterwards, and none of them have been perused by me, until a few days since, when I met with the Review of the Bridgewater Treatise of Doctor Buckland.\n\nIn the summer of 1829, I presented a prospectus of the work to Archdeacon Mountain, and to the Bishop of Quebec. The former kindly complimented me on it, and the latter recommended my publishing it in London, for which I was soon to embark. I arrived there in October of same year, and presented the prospectus to the Lord Bishop of London, from whom I received a note by which he was pleased to commend the design of the work. I subsequently presented the prospectus to several of the principal Booksellers, who, on learning that the size of the work would be that of a pamphlet,\ninformed me, that the cost of advertising was so great, that no pamphlet would pay it, and my circumstances preventing me from incurring that expense, I gave up the intention of publishing.\n\nIn the meantime, a reverend gentleman of the name of Fairholme was publishing a theological work connected with geology, and I enclosed to him a copy of the prospectus, and in a letter I received from him, dated Oct. 14th, 1833, he says, \"with regard to the Creation of our earth or of the sun, and other members of the Solar System I have neither found in the work of any writer, nor can I conceive the smallest grounds on which to form a consistent theory, nor indeed do I conceive that it belongs to the science of geology at all. Scripture has given us no insight into it. The existing laws of nature are equally silent, and yet these laws must have existed from the beginning.\" He then assumes, \"that the granite mass has been formed before the existence of organized beings, as their remains are never found in it,\" an opinion which, I think, the reader will find answered in note 2nd of this work; and the assertion that neither scripture nor the laws of nature give any insight into the Creation, appears to me so futile, that I have inserted the above extract, solely to prove, that the construction I had put on the 1st verse of Genesis, had not at the date of that letter, been yet made by any other writer.\n\nBy the following extract from the Bridgewater Treatise of the Rev. Doctor Buckland, published long since the date of Mr. Fairholme's letter, it will be seen that construction has been sanctioned and confirmed by the authorities mentioned above.\n\nAnd having presented my prospectus to the persons above named, and also to the Royal Institution in Albemarle-street, London, in 1833, I consider it a duty\nto myself to claim the originating of that construction, by which the general appearance of gradual deposition in the geology of the earth, (whose diameter must, according to the modern geologists, have existed millions of years) will, as well as this supposed age, be now reconciled and satisfactorily explained by the Mosaic account.\n\nExtract from the Review of the Bridgewater Treatise.\n\n\"If there are any lovers of science yet ignorant of the extent and fertility of the field which Geology has laid open—of the intensity and variety of interest by which those who explore it are repaid—here is a work to astonish and delight them. If there are any persons yet deterred from the study of this fascinating science, by the once prevalent notion, that the facts, or theories if you will, that it teaches, tend to weaken the belief in revealed religion, by their apparent inconsistency with the scriptural globe,—here, in the work of a dignitary of the church, writing ex cathedra, from the head quarters of orthodoxy, they will find the amplest assurances that their impression is not merely erroneous, but the very reverse of the truth: for that, while its discoveries are not in any degree at variance with the correct interpretation of the Mosaic narrative, there exists no science which can produce more powerful evidence in support of natural religion—none which will be found a more potent auxiliary to revelation, by exalting our conviction, of the power, and wisdom and goodness of the Creator.\n\n\"Several hypotheses have been proposed, with a view of reconciling the phenomena of geology, with the brief account of creation which we find in the Book of Genesis and others. It has been plausibly stated, that the Six Days of Creation must, each of them, understood to imply not as now, a single revolution of the Globe, but some other cyclic period of unknown extent. Dr. Buckland, however, prefers that explanation which is supported by the high authority of Dr. Pusey, the Regius Professor of Hebrew in Oxford, and has the sanction of Dr. Chalmers, Bishop Gleig, and other eminent contemporary divines,—namely, that the phrase employed in the first words of Genesis, 'In the beginning God created the Heaven and the earth,' may refer to an epoch antecedent to the 'first day,' subsequently spoken of in the fifth verse, and that during this indefi-\nnite interval, comprising, perhaps, millions and millions of years, all the physical operations disclosed by geology were going on. Many of the Fathers quoted by Professor Pusey, appear to have thus interpreted the commencement of the sacred history, understanding from it that a considerable interval took place between the original creation of the universe, related in the first verse, and that series of events of which an account is given in the third and following verses.\n\n\"'Accordingly,' says Professor Pusey, 'in some old editions of the English Bible, where there are no divisions into verses, you actually find a break at the end of what is now the second verse; and in Luther's Bible (Wittenburg, 1557) you have in addition the figure I placed against the third verse, as being the beginning of the account of the creation on the first day. This is just the sort of confirmation which one wished for, because, though one would shrink from the impiety of bending the language of God's Book to any other than its obvious meaning, we cannot help fearing lest we might be unconsciously influenced by the floating opinions of our own day, and therefore turn the more anxiously to those who explained Holy Scripture before these theories existed.'—Note, p. 25.\n\n\"Thus all difficulty arising from the immense antiquity of the Globe attested by Geology is at once removed. The circumstances related in the succeeding verses must be understood as referring to those immediate changes by which the surface of the earth was prepared for the reception of man.—Just as the facts disclosed by astronomy, without detracting ought from the credit of the inspired historian, prove that the sun, and moon, and planetary bodies must have existed previous to the 'fourth day,' on which he first mentions them as 'made,' or appointed to serve the office of 'signs and seasons, and days and years'; so Geology in no degree contradicts the real meaning of the text, by proclaiming the fact that the air, the earth, and the waters, were peopled by living creatures for innumerable ages before that epoch in the world's history—which the sacred historian alone contemplates.\"\n\nUnder the sanction of this confirmation of the construction I had put on the first verse of Genesis, in my original manuscript, formed between 1819 and 1825, (and which is now greatly enlarged by the addition of the notes containing an account of the late geological\ndiscoveries, and observations upon them,) I now present this work to the public of Upper Canada, and conclude this preface with the sublime description of Eternal Wisdom given us in the 8th chapter of Proverbs; and which, I trust, will justly apply to the great additional light which the modern discoveries in pneumatic science are enabled to confer on the cosmogony of the creation.\n\n\"The Lord possessed me in the beginning of his way, before his works of old.—v. 22.\n\n\"I was set up from everlasting, from the beginning, or even the earth was.—v. 23. (Say before the Combustion of the Gasses, as shown in this work.)\n\n\"When there were no depths, I was brought forth; when there were no fountains abounding with water.—v. 24. (At the Combustion of the Gasses, as shown in this work.)\n\n\"When he prepared the heavens, I was there; when he set a compass upon the face of the depth;\"—v. 27. (Say after the Combustion of the Gasses, as shown in this work.)\n\nHENRY TAYLOR.\n\nToronto, Nov. 22, 1836.\nAN ATTEMPT TO FORM A SYSTEM\nOF THE\nCREATION OF OUR GLOBE, &c.\n\nIn the year of our Lord 1819, I returned to the land of my birth, the Canadas, after an absence of nigh forty years in England and Nova Scotia, during which, I had undergone great misfortunes in an extensive line of mercantile business.\n\nThe pleasing sensations I felt on this return to my native country, may have been experienced by many; the intensity with which I felt them, may have been occasioned by so long an absence; and having now, as it were, fallen into the calm and pure resort of nature, the woods of Lower Canada, I was never more happy than in the study of her works. From early youth I had been fond of the science of chemistry; and now, some books of geology fell into my hands: with them I frequently compared the appearances I met with in my walks, which, being in unison with these books, gradually confirmed me in the opinion, that our earth was originally formed in a fluid, and was deposited from it.\n\nIn the treatise on chemistry by Professor Chap- tal, I found an account of the chaotic system of creation of the ancients; by which it is supposed\nthat the chaotic mixture, being formed, the various substances were attracted to each other, by the laws of mutual affinity, and precipitated.\n\nOn frequent reflection, however, on this theory, and contrasting it with the general state of the depositions of the earth in strata and laminae, it appeared to me to be totally insufficient to account for these appearances: had a chaotic mixture been formed by the Creator, containing in solution all the various geological bodies, and had nothing more been required for their formation, but the operation of their affinities and attractions, these must have taken place immediately, and they would be found deposited in homogenous, and exclusive masses, according to their various affinities and gravities: but the formations are generally found in alternate layers and laminae of frequently mixed substances, and bear the certain marks, not only of being deposited from a fluid, but also, of a gradual and mixed deposition, at periods probably of immense distance from each other. This reflection led me to conceive that these depositions were gradually produced by some permanent and continually operating cause.\n\nIn the above mentioned work of Chaptal, I had found and been much struck with the beautiful and interesting theory he has given of the formation of the various primitive earths and many salts, metals and mineral substances, by the processes of vegetation, which are found on the decomposition of those vegetables by analysis and combustion: I was also aware, that vast tracts of the earth are formed by vegetable, animal and marine depositions, and being one day occupied in reading attentively\nthe account of the creation in the first chapter of Genesis, the waters there in mentioned forced themselves strongly on my attention and repeated consideration, until at last, the idea grew upon me, that the geological bodies of the earth were, somehow or other, produced in these waters.\n\nThat the earth was formed in a fluid, I now felt thoroughly convinced of; that a great part of it, consisted of vegetable and animal depositions, even almost to the tops of the highest mountains, as stated by the geologists, seemed to me a proof, that these marine vegetables and animals must have previously existed in waters which produced these depositions; and, as no inundation or deluge is sufficient to account for these universal appearances of the formations in the earth; therefore, the waters or oceans mentioned in the first of Genesis appeared to me the only, and the truest sources, by which we can account for them.\n\nDuring my reading and reflections on this subject, and previous to my determining to form a Theory of the Creation, Archdeacon Paley's Evidences of Natural Religion fell into my hands, in which the atheistical doctrines of chance, and also, the notions of Buffon, of the earth's formation by a fragment knocked off by a Comet from the sun, is related, and commented on by the Archdeacon.\n\nI shall therefore, previously to advancing anything more on the system of Creation I had gradually formed in my own mind, beg leave to make some observations on those doctrines of chance formation, and thus endeavour to clear the way for a system, I trust, more consistent with reason, and with our religion.\n\"Amongst inanimate substances (says Paley in page 63 of his Theology of Nature or Evidences of Natural Religion,) a clod, a pebble, a liquid drop, might be, (but never was a watch a telescope, or organised body of any kind, answering a valuable purpose by a complicated mechanism,) the effect of chance: in no assignable instance hath such a thing existed without intention, some where.\"\n\nNow, it appears to me very singular, that Paley, after having so clearly exposed the absurdity of this theory of chance, should have thus conceded the possibility of a clod, a pebble, or a liquid drop, being the product of it: a clod is a piece or part of the earth; a pebble is a fragment of some rock rounded by the waters; a liquid drop is a part of those waters. The same cause then, that produced the earth and seas, produced also the clod, pebble, and drop.\n\nBut, can there be any doubt that the earth itself contains marks of design and intelligence? That all its vegetables and animals contain marks of design, He has proved: now we cannot refuse the same evidence of design in the formation of the earth and seas, if it were solely as a matrix or habitation for these plants and animals; and, among the evidences of design which these last exhibit, I beg leave to mention one which I believe, has escaped the observation of the Archdeacon: it is the amazing varieties exhibited in every species of these plants and animals. Had they been solely the offspring of a \"blind conatus,\" there would, probably, have been but one species of each of them. But their vast varieties shew a master and designing hand to have\ndirected their formation. But the evidence of design which the earth exhibits, is not confined to its own formation; this evidence is much more strong when we find and consider it as a part of a system of planets revolving in known periods round a central sun, whose light and heat are evidently the intended sustainers of the life and enjoyments of the plants and inhabitants existing on this family of planets.\n\nIt is also stated in page 92 of the above work, that Buffon considers the planets to have been \"shivered off the sun by some stroke of a comet.\" Paley adds, \"that he never could see the difference between the antiquated 'System of Atoms,' and Buffon's 'Organic Molecules';\" and that \"this philosopher having made a planet, by knocking off from the sun a piece of melted glass, in consequence of the stroke of a comet, and having set it in motion by the same stroke, both round its own axis and the sun, finds his next difficulty to be, how to bring plants and animals upon it,\" &c.\n\nNow, as to the solid parts of the earth; allowing glass to be composed of a variety of materials, yet, I believe no part of the interior of the earth is discovered to be vitreous, except in the vicinity of volcanic mountains, or where these have previously existed. How then has this glass, of which Buffon supposes the earth to have been formed; how has it been metamorphosed into the vast variety of mineral products which geology discovers to us? The internal substance of the earth down to its centre, is supposed to be granite or bodies of greater density; and neither granite, nor the more\nexternal formations bear any resemblance to vitreous or volcanic matter.\n\nBut, if even the solid parts of our earth, will not support such a theory, how are we to account by it for our waters? Is it in the midst of the molten glass of a burning sun, we are to look for them? Water, even in a state of vapour, could not exist there, but must have been driven off to immense distances, or else decomposed by the sun's fire: Water, however, is said to constitute three-fourths of the Earth's surface, and the total inability of this theory or supposition, to account for its production, appears to me decisive against its foundation in reality. (Vide 1st & 2nd paragraph of Note 4th.)\n\nI shall now notice the opinions on Chance or Atheism, as causes to account for the productions of nature in our globe.\n\nThe Organic Molecules of Buffon are thus stated by Paley, in page 427 of the above Work, Evidences of Natural Religion, namely: \"we are to suppose the universe replenished with particles endowed with life, but without organization of their own, and endowed, also, with a tendency to marshal themselves into organized forms.\"\n\nIt appears to me almost impossible that the author of this doctrine, if it be Buffon, could rest satisfied with this cause of Creation; because, although it should be allowed that these particles of life could infuse themselves into organized bodies, we naturally enquire, how came these particles themselves into the universe? This is the secret, undiscoverable without allowing an \"unknown...\"\ncause.\" If Buffon would account for the existence of these particles by chance, I say, that from the time of their finding their way into these Molecules, or organized forms, there is so much, and so constantly exhibited in every one of these forms, what we call, in plain language, intelligence and design to produce good and wise ends; that the term Chance, in the sense in which it would be employed by these Atheistical writers, completely comprehends intelligence and design; for these are found inseparable from these organized forms; therefore, the Doctrine of Chance, instead of confuting, proves the existence of an Unknown Creating Cause.\n\nWere the term Chance to be understood merely in the common acceptation of the term, as existing, for instance, in many of the events of life, it will still always be considered as too absurd and impotent to account for the productions of Nature, because it is not in the nature of the human mind to rest satisfied with what, I trust, may be fairly called a Buffonery system of Creation.\n\nNow, therefore, to finish with this, and with the notion of the planets being knocked off from the Sun; to account for their Creation thereby, without an Intelligent Creator, I must say, I feel it to be a daring thing of this or any writer, to have attempted the overthrow of the established opinions of all Christian nations, as set forth in the Scriptures handed down to us from the people whom it appears to me, were chosen by the design of Heaven to preserve mankind in the faith and worship of one Creator, and which are, I believe, supported in\ntheir principal facts by the immortal Newton, in his system of the Universe, and certainly believed by him.\n\nPrevious to thus presuming to overthrow this sacred religion, it appears to me, this author should have formed a system less replete with absurdity, but fortunately too much so, to produce extensively any evil effects. Christians, in general, are fixed in their notions of the true cause of all they see, taste, and feel around them, and of their own existence. The Jewish Nation was taught by a religion which, from the days of Adam, had been followed by mankind,—a belief in one Almighty Creator of all things. This belief had nearly, however, disappeared from the earth in succeeding ages. Men, enervated by the effects of those hot climates, and sunk in consequent sensuality, were tempted to throw off the wholesome restraints of a pure religion, and gradually fell into an idolatry, whose ministers, probably, permitted these sensual habits, to confirm their own power over these people. The Jews, alone, had preserved the worship of one Almighty Creator, until their prosperity, after the deliverance from Egyptian bondage, sunk them into the same idolatrous practices as their forefathers.\n\nAnd here I beg leave to observe, that this repeated defection of the Jews, and of the rest of mankind, from the worship of one God, appears to me a strong proof that Deism alone, in its purest state, is not sufficient to prevent mankind from falling into idolatrous worship. But, the Saviour promised in the Scriptures by the inspired writers,\narose at length to astonish mankind, and to bring them back for ever from that idolatry to a religion which alone is worthy of the highest degree of intelligence to which the mind of man can arrive; a religion which, while it allows him the most extended use of that intelligence in the contemplation of the works of Creation, teaches him, also, to be contented with the limits which appear to be fixed to it; and being convinced of the existence of an Almighty Protector, to feel the glowing pleasure of the adoration of Him to be among his purest and most comforting sensations.\n\nThese cheering feelings of the heart and mind, cold and joyless Atheism is void of, and thereby its errors are proved; because, the almost universal feeling of these emotions, and their cultivation by nations who have at all risen above idolatrous worship, is a proof that these emotions came from the hands of Nature and Reason, and they appear to form the links of a chain which connects this with a future state of existence.\n\nThe supporters of the Doctrine of Chance, however, disdaining to be contented with the Scriptural account of Creation, have formed various wild and futile notions to account for it, in order, no doubt, to seek for distinction by opposing the generally received doctrines; but finding, as I trust to have shewn, the total impotence of Chance, of appetencies, principles of order, possible combinations of material forms, and of laws of nature, &c. &c., to satisfy the inquisitive mind of man, they have been obliged to conclude with tell-\ning us, \"that neither they nor we know any thing about the matter.\" (Vide page 7 of Paley's Theology.)\n\nBut, at that very point, where they have thus found themselves stopt in the extension of their enquiries, is seen \"the God whom we worship.\" There, when this proud, but false philosophy finds its ignorance begin to darken it, we have the clear and powerful light of this true religion to illuminate us, and to teach us to rest satisfied with the impenetrable veil which its author has pleased to fix between Himself and His creatures in this stage of existence.\n\nOf a kin to these doctrines of chance-Creation is the idea of the Materiality of the Human Soul; and previous to dismissing this part of the subject, I beg leave of the reader to offer some observations on this Doctrine of Materiality.\n\nThe Materialist supposes, that all the powers of the mind of man result from his Organization alone. It follows, then, as a natural consequence, that when this organization is destroyed, the mind is destroyed along with it. Materialism, then, necessarily leads to a disbelief in a future state.\n\nNow, in no parts of Nature do we find faculties bestowed which are not generally productive of certain purposes to these parts; therefore, if man were destined solely for existence on this earth; if his thoughts were solely the effects of the organization of his frame; is it not probable his thoughts would have been confined to the actual sphere of his destined existence? Would he not have been\nunable to form those high imaginations and hopes of eternal happiness in more perfect regions?\n\nFor, if we may reason from the vast body of evidence of her works, Nature does nothing, nor bestows nothing, in vain; she never appears to act with deception; therefore would not have given to man of all ages and nations those hopes of future happiness merely to disappoint them. \"I am positive I have a soul,\" says Laurence Sterne, \"nor shall all the books with which Materialists have pestered the world, ever convince me to the contrary.\"\n\nThe vast powers of intellect and of science, by which man has been enabled to observe and to trace so exactly, the astonishing systems of the heavenly bodies; those high passions and thoughts of future bliss which he is thereby led to hope for, in some such regions, partake too much of the nature of Spirit to suffer us to think they are solely produced by a more perfect organization than is bestowed on the horse, the mule, or the ass.\n\nIt, moreover, has been proved by the anatomy of the brain of the Ourang Outang, an animal approaching nearer to the human species than any other, that its brain exactly resembles that of the human species; and it is said, \"it is surprising this resemblance is productive of so few advantages; the tongue, and all the organs of the voice are similar, and yet the animal is dumb; the brain is formed in the same manner; and yet the Creature wants reason; an evident proof, [as Buffon finely observes,] that no arrangement of matter will give mind, and that the body, how nicely soever formed,\nis formed to very limited ends, when there is not infused a soul to direct its operations;\"—and I am the more happy in using this quotation, as it shews that Buffon has indeed the redeeming quality of not acceding to, but of disproving, the degrading Doctrine of Immateriality. We feel indeed less surprised at the invention of such a doctrine, when we are informed who are its abetters or authors. Persons, who, in the practice of their art, having been long habituated to dissections of the human body, have thereby become more apt to form their notions from their eyes than from the reflections of their minds, have sought to make the world believe, that the superiority of the mind of man over other animals, arose merely from a more perfect organization of the brain; and such an assertion reminds us of the Alchemists who sought for the Philosophers' Stone in some of the most loathsome objects in nature. Had the Materialists watched and studied the operations of their own hearts and minds, in the hours of calm contemplation; had they allowed these parts of their frames to exert a due influence over their opinions, they would, probably, have felt the force of the great poet's assertion, \"'Tis the Divinity which stirs within us.\"\n\nThey may, indeed, have carried their anatomical science and skill to that exact point where body meets spirit; they may have discovered the precious matrix in which this \"immortal spirit\" is destined at present to reside; but, they would not thus have presumed to degrade its nature and its future destiny.\n\nIn fine, this material doctrine of the mind may\nwell be said to savour too much of the shop, and no well cultivated mind can, I think, for a moment assent to so degrading a doctrine;—and I shall conclude this subject with an observation I have made on the separate existence of mind from body, even in this world. When two persons converse together, the ideas of their minds pass from the organs of speech, through the air intervening between the two persons: in this passage, therefore, mind exists separate from the body from whence it came. It is conveyed, indeed, by the vibrations of the particles of air it passes through, but it certainly has, during that period, an existence separate from the body and organs it proceeded from. Mind, therefore, can exist separate from its matrix, and does not seem to be entirely dependent on it for that existence.\n\nI now resume the narration of the course of thought which has led me to form the present attempt at a theory of the Creation of our system, and, by analogy, of the other systems of the heavenly bodies.\n\nBeing, as before stated, convinced the earth had been originally formed in water the enquiry, then, naturally suggested itself, what waters we had any historical account of which could produce this effect? The chaotic liquor of the ancients, I trust to have proved, is incompetent to account for the general geological appearances, and therefore fails. The waters of the Deluge can only account for certain changes in the earth's surface, which they may have occasioned, and which, no doubt, give proofs\nof the reality of that Deluge. But, the proof of formation in a fluid reach far below the possible effects of an inundation which lasted only one year. The vast masses of marine depositions must have required numerous ages to accumulate, and even the granite mass gives proofs of formation in a fluid, by the crystals and heterogeneous substances it consists of; and this stupendous mass, which is supposed to form the whole interior of the globe, must have required a correspondent time for that formation.\n\nThe only waters, therefore, with which History furnishes us to account for these phenomena, are certainly the waters of Genesis. I then proceeded to enquire if the scriptural account of these waters would warrant the conclusion that the earth was formed in them by the deposition of the strata and other rocks which the latest discoveries in the science of geology have pronounced it to consist of.\n\nAfter a long and mature consideration I conceived, that the 1st verse of Genesis, \"In the beginning God created the Heavens and the Earth,\" will not only warrant the above conclusion; but, perhaps, also a like formation of all the planets and suns of other systems; by the highly natural causes and effects of those laws, which the latest discoveries of Geology and Pneumatic Chemistry have found to exist.\n\nI further considered, that if the scriptural account of Creation could thus be reconciled to those discoveries;—if the Geology of the whole earth could thus be brought in proof of the reality and neces-\nsary existence of those waters; the doubts of the Unbeliever might yield to it, and the authority of scripture acquire new forces.\n\n\"In the beginning God created the heavens and the earth.\" Now, the term beginning points to no specific point of time; and I have therefore conceived it may have been ages previous to the time of the separation of the earth from the waters mentioned in the ensuing verses; and, that during these ages, the earth was gradually formed in these waters, as will be hereafter stated.\n\nBy the famous discoveries of Black, Priestly, Lavosier, and other chemists and philosophers, a new world has been disclosed to us. The constituent part of three-fourths of the globe, water, which was formerly considered as an element of Creation, has, by these discoveries, been proved to consist of two separate bodies, oxygen and hydrogen. Our atmosphere itself, the common air, is no longer to be considered as one of these elements: it is composed of the oxygen and of the azotic gasses; but neither oxygen nor hydrogen, nor azote, have ever been obtained separate, in a liquid state. They have yet been found only in the form of gasses, that is, combined with light and caloric. By the combustion of hydrogen or inflammable gas in oxygen gas, the caloric and light of the latter escapes, and water is formed, in a quantity exactly corresponding with the weight of the gasses employed in the combustion; and the same water may again be decomposed, and returned into the state of the gasses it was composed of. If, therefore, this be incontrovertibly proved—and I believe all philoso-\nphical chemists are now agreed upon the fact—it follows, that the waters of the Universe recorded in Genesis, must have been formed by the combustion of these gasses; it follows, that if any part of these waters are composed of them, every part must; and, therefore, that the Deity, having first called these gasses into existence, did, either by the power of electricity, the blaze of comets, or some other means, ignite the hydrogen gas, which, by its combustion in the oxygen gas, of which the empyreal atmosphere may have been composed, produced the Universal waters of Genesis.\n\nThese waters must have been thus first produced in a state of vapour, which, condensing into a liquid form, would, by laws of attraction, be formed into aqueous globes, forming the matrices of our earth and planets of our system. The vast body of heat and light disengaged from this immense combustion, may have formed the Sun of our system, which, by the laws of its gravity and attraction, assumed its place in the centre of it, as we shall attempt to show in the Theory of the Sun's formation. (See the third and fourth paragraph of Note 4.)\n\nThese seas or aqueous globes, being brought into a state of revolution in their orbits round their central sun, (see Note 16) we have now to enquire in what way, and by what laws, the Creator produced, from these waters, all the solid parts of our earth?\n\nTo form the ground-work of our reasoning on this subject, we shall advert to, and consider attentively, the accounts of the Geologists of the\nmarine strata and productions found in the bowels of the earth, and the experiments and opinions of some eminent Chemists upon the nature and products of the processes of vegetation.\n\n\"The levels,\" says Cuvier, one of the most eminent Geologists of the present day, \"on which marine productions are now found, are far above the level of the ocean, and at heights to which the sea could not reach by the action of any known cause. Every part of the earth, every continent, and every island, exhibits the same phenomenon. The traces of revolution become more apparent, when we ascend a little higher, and approach nearer to the great chain of mountains. Beds of shells are still found here but not of the same species as those in less elevated regions. When we ascend to greater elevations, and advance to the summits of the highest mountains, remains of marine animals grow more rare, and, at length, disappear entirely; but the crystallization, and many other characters of these rocks, shew them to have been formed in a fluid, &c. &c.\n\n\"It is impossible, therefore, to deny, that the waters of the sea have formerly, and for a great length of time, covered these masses of matter which now constitute our highest mountains; and further, that for a long time, these waters did not support any living thing.\"\n\nThus we have the evidence of Geology, that every part of the earth contains marine remains, and that even the summits of the highest mountains, where these marine depositions cease to be found, give yet evidence of formation by fluidity.\nThat these marine remains are not found in these summits may, I think, be satisfactorily accounted for. Many remains are found in the same forms as when they contained the living animals; but, on taking them up, they crumble into impalpable powder.\n\nThe summits, therefore, of these mountains, have probably contained these marine remains in previous ages; but being contiguous to the earth's surface, have, by the joint action of the air and rains, lost their organization, been converted into their component substances, and been incorporated with other mineral, metallic, or earthy bodies. Thus, all marble, lime stone, and chalk are found to consist of precisely the same materials as every marine shell; all are formed of lime and carbonic acid; and, it is therefore evident, that when the masses of shells shall be so far acted upon by the moisture of the earth, rains, internal fires and mineral solvents; as to lose their forms, and be converted into powder; that these agents, acting on and percolating through them in various degrees, will reduce them into beds of chalk, or lime stone, or marble, and, I think it not improbable, the chalk and lime stone formations of the earth have been, in the course of ages formed in this manner. Again, \"where the tree falls there it lay,\" says the Proverbs. Any person who has seen and noticed the aboriginal forests of the earth, will have observed these trees in various stages of decay—many of them reduced to a state of dust or earth; and these causes, in the course of time form hills and hillocks. In accounting for the origin of peat earth and mosses of black soil in Britain, a late writer has,\ntherefore, very properly, I think, assigned their origin to arise from the gradual falling and decay of trees in ancient times, which, falling in marshy or swampy places, have decayed and acquired their black colour. In a great many parts of America, it is well known large tracts of land are found in this state, being covered by masses of black earth of various degrees of consistence, from 2 to 5 feet deep. The subsoil frequently clay. In an article lately published in one of the English papers, there is an account, confirming the opinion, that part of the coast of Australia, in the South Seas, has been entirely formed by the manure of birds called the Pettrel, found there in such astonishing quantities, that flocks of them are seen to cover a vast extent of the atmosphere for days together.\n\nThese facts, therefore, offer corroborating testimony, that large tracts of the earth can, and have been formed, by the depositions of vegetables and animals. (See Note 1.)\n\nIn a Geological work lately published in England, we have the following account of the order of succession of the different layers of rocks which compose the crust of the earth:\n\n**Instances where found.**\n\nA. Vegetable soil.\n\nB. Sand, Clay, Gravel, with bones of some species as now exist.\n\nMouth of the Thames and other rivers.\nC. Deep beds of Gravel, large loose blocks of Sand, all containing bones of animals belonging to species now extinct.\n\nSurface of many parts of England, and especially the east and south-western parts.\n\nTERTIARY STRATA.\n\nD. Sand, Clay, Pebbles, beds of Sand, white Sand-stone, many sea Shells, bones of extinct species of animals.\n\nHampstead Heath, Bagshot Heath, coast of Suffolk & Norfolk, the stone of which Windsor Castle is built.\n\nE. Alternations of Lime Stone, containing fresh water Shells, Clays of different qualities, and Lime Stones containing Marine shells.\n\nIsle of Wight in England.\n\nF. Thick beds of Clay, many Sea Shells, beds of Lime Stone, remains of extinct species of plants and fruits, land and amphibious animals.\n\nMany places round London, and a great part of Essex and north-east of Kent, Isle of Sheppy.\n\nSECONDARY STRATA.\n\nG. Chalk with Flints do. without do.\n\nDover Cliffs, Brighton, Hertfordshire, Hamborough Head, in Yorkshire, England.\nH. a. Chalk Marle. Many parts of s. coast\nb. Green Sand Many parts of Kent\nc. Thick beds of Clay. The Wolds of Kent,\nd. Yellow Sand with Neighbourhood of\nbeds of Iron. Hastings, in the isle\nof Purbeck.\n\nIn an account of the Geological appearances from the Lands' End in England towards the vicinity of London, the following facts are stated:\n\nThe principal groups of secondary rocks, from the primary strata to the Chalk group, form the upper or more recent members of the division.\n\nThe Chalk group, the Oolite group, the Red Marle group, the Coal group, the mountain Lime Stone group, the old Red Sand Stone group, the Graiawacke group, are of the following thicknesses:\n\nMountain Lime Stone group, 900 feet thick.\nOld Red Sand Stone group, 1500 feet thick.\nCoal group, 1700 feet thick.\nRed Marle group contains mines of salt and marbles, alabaster and magnesia, with marine skeletons: its thickness is 2100 feet.\n\nThe Oolite group contains about twelve alternations of subordinate beds, or systems of beds, consisting of Lime Stones of different qualities, and of Clays: their united thickness being about 2600 feet, of which 1100 are formed of two beds of Clay of 5 and 600 feet each. The whole group contains a vast abundance of animal remains, almost exclusively marine.\nThe Chalk group is separated from the Oolite group by several beds of Sands, Clays, and Sand Stones, and, including them, is 1900 feet thick. It extends from Flamborough Head, in Yorkshire, to Weymouth. The whole group abounds in organic remains of the same classes as Winford in the Oolite group.\n\nThus it appears, that both the tertiary and secondary formations of the Earth, contain vast masses of the remains of marine productions, many of them belonging to species now extinct. Many of these latter are said to have been of enormous sizes.\n\nThe Chalk and Lime Stone formations, as I have above stated, may have been formed of the disintegration of marine shells, which had been deposited perhaps for ages previous to these which yet preserve their organic forms, as we daily find many of them in a state of disintegration, and their chemical analysis is precisely the same with Chalk and Lime Stone. (See 4th paragraph of Note 2.) produced by the decomposition of marine vegetables, as they reach far too much below the surface of the earth to suppose them to be formed by those of a terrestrial species.\n\nNow, then, to refer to the words of Cuvier, \"the levels on which marine productions are now formed, are far above the level of the ocean, and at heights to which the sea could not reach by the action of any known cause.\"\nTo what cause can we then ascribe this phenomenon, but to the substantial, plain, and simple one, the original formation of the earth? All its geological appearance give evidence of formation in a fluid. Of no waters have we any record sufficient to account for these facts, save the waters recorded in Genesis. These, therefore, forcibly press themselves on our attention, \"and appear to me perfectly competent to clear up all these phenomena of Creation.\n\nBut water alone, that is, holding no extraneous substances in solution, either partial or complete, deposits nothing. All its depositions are found to proceed from extraneous bodies. The petrifying power of certain waters, of which such fabulous opinions have formerly existed, is solely owing to the deposition of earths or salts it had previously dissolved, completely or partially.\n\nWe shall, therefore, proceed to state our humble conceptions of those laws of nature, which the Creator may have chosen for the gradual formation of our earth in the waters of Genesis, on the ground work mentioned above, regarding the 1st verse of the 1st chapter of that book.\n\nGenesis, 1st chap. 1 verse.—\"In the beginning God created the heavens and the earth.\"\n\nI wish first to premise, that, as I consider this scriptural account of Creation, to be the only one by which we can, naturally and reasonably, account for the geological phenomena of our earth; so, the only thing in which I differ from the, hitherto, received opinions of that Creation is, in the construction which, (from a desire to account for these\nphenomena, and to reconcile them with the scrip-\ntural account,) I have put upon the meaning of this\n1st verse of Genesis.\n\nAs before observed, I had in the course of these\nstudies of nature, been led by them, and by read-\ning and reflection, gradually to come to such a con-\nstruction of that verse as the following: that the\nterm, \"The beginning,\" pointing to no specific time,\nso it may refer to numerous ages previous to the\nseparation of the waters from the waters men-\ntioned in the 6th, 7th, and 9th verses; and I moreover\nconsider, that every man hath a perfect right to\nform such a construction of the Word of God as\nhis understanding, after mature reflection on His\nworks, and a diligent study of them, may, by that\nunderstanding be led to, and more especially when\nhis design is good, when he conceives he is, there-\nby, not only adding weight and authority to these\nscriptures, by bringing the evidence of the geology\nof every part of the globe to their confirmation,\nbut, perhaps, silencing thereby the infidelity of the\nsceptic, and (as he may hope) exhibiting, in a stronger\nlight, the Power, Wisdom, and Glory of his Creator.\n\nIn the 2nd verse of Genesis it is said, \"And the\nEarth was without form, and void, and darkness\nwas upon the face of the deep, and the Spirit of\nGod moved upon the face of the Waters.\"\n\nBy this verse, it would appear, the Earth was\ncompletely covered by the Waters: otherwise, the\nSpirit would have been recorded as having also\nmoved upon the land; and the 9th verse is con-\nfirmative of this circumstance, for it says, \"And\nGod said, let the Waters under the Heavens be\ngathered together unto one place, and let the Dry Land appear; and it was so.\" This event, then, I consider to have happened many ages after the time of the 1st verse; which verse, I further consider, to point exactly to that period to which the Psalmist David, in the 102nd Psalm, 25th verse, refers: \"Thou Lord in the beginning hast laid the foundations of the Earth;\" and I consider this foundation to have been the formation of the aqueous globes of our theory.\n\nWe now proceed to our statement.\n\nThe seas, or globes of water, mentioned above to have been formed by those gasses which the modern discoveries in pneumatic chemistry prove water to be formed of, and being destined by the Creator to produce habitable Earth or Land, we shall conceive these aqueous globes to have been endowed by Him for that purpose, with amazing prolific powers of life, both of the vegetable and animal nature.\n\nThe remains of many of those marine animals, whose skeletons have been discovered in the earth, of a species never known to have inhabited our seas, are of gigantic stature and dimensions, as compared to those of any existing species.\n\nThe marine Shells, the Chalks, and Lime Stone formations, which I consider to have been produced, as above observed, by the gradual disintegration of these shells in the course of sufficient ages: the vast Coal formations, also, prove the amazing masses of animal and vegetable life, which we shall now suppose, according to our theory, to have existed in those Waters of Genesis; and for proofs of\nwhich we accordingly refer our readers to the geological statements in the preceding pages.\n\nTo account further for the primary earths, Lime, Silex or Sand, Sand Stones, Flints, Gravels, Clays or Alluminous Earths, Terra Ponderosa, Magnesian Earths, Salt Formations, Metals, Mineral Substances of all kinds, and the Rocks and other Substances composed of them and of the Primary Earths, we shall now proceed to a statement of those experiments, opinions, and theories, which have been performed and maintained by several eminent chemical philosophers on this important head.\n\nIn the treatise on Chemistry by Professor Chap- tal, mentioned in pages 1st and 2nd, the following facts are stated to have resulted from the analysis made by him of certain vegetables:\n\n\"The herb Patience affords sulphur: vegetables, in their analysis, likewise present us with certain metals, as Iron, Gold, and Manganese. The Iron forms nearly one-twelfth of the ashes of hard-wood. It may be extracted by the magnet; but it is seldom in a naked state, but is combined with the acids of vegetation. The Iron is not imbibed from the Earth, but is FORMED BY THE VEGETATIVE PROCESS. Lime, constantly enough, forms seven-tenths of the fixed residue of vegetable incineration, usually combined with the carbonic acid. Next to Lime, Alumine is the most abundant earth in vegetables; and next, Magnesia.—Silicious earth likewise exists, but less abundantly; least common of all is Barytes or Terra Ponderosa.\"\nAs an evident and sufficient proof that all the products of vegetables are produced by the water, and perhaps the air, necessary for their growth, I extract also the following observation of Professor Chaptal: \"It appears proved by Van Helmont, that vegetables can live and grow with only air and water. He planted a willow weighing 59 lbs., watered it with distilled water five years. It increased to 169 lbs.: the earth it was grown in lost only two ounces.\" If one vegetable be thus proved to acquire its growth from water and air, the strong probability is, that, as Chaptal says, \"all others do,\" and by the uniformity of the laws of Nature, we may conclude this law applies generally to the vegetative process. (See Note 15.)\n\nThus, although Sir Humphrey Davy supposes, but does not assert, the fact, that these earths are taken up by the vegetation from the soils around them; yet, as he does in another part of his writings admit, that all substances, before entering the tubes of vegetables in nutrition, must be reduced to a state of complete solution in a liquid before that absorption can take place; and as it is well known that argillaceous earth, or allumine, silex or sand, and magnesia, are almost insoluble in water, and that lime is only soluble in very small quantities; I have therefore concluded, that such a perfect and sufficient solution, as Davy admits to be necessary, is impracticable, and, therefore, that the assertion, grounded on the forementioned experiments by Chaptal and Van Helmont, namely, that these Earths, Metals, and Minerals, are really and entirely the products of the vegetative process, is\nmuch more probable; and I am the more confirmed in this probability by the following facts and reasoning upon them:\n\n1st. As oxygen, we know, exists in a solid state, in all the oxyds, so it is not impossible, that the bases of these oxyds, the metals, and several of the primary earths, may be formed by the vegetative process, as the French Geologist, Chaptal, asserts, \"to replace the constant waste that takes place of the crust of the earth, by the rains, streams, and rivers.\"\n\nOne hundred pounds of Lead is, I believe, found, by calcination or oxydation, to augment in weight to one hundred and ten pounds, thus absorbing ten pounds of solid oxygen from the oxygenous gas of the atmosphere, which can be recovered by deoxydation. Pit Coal contains a great quantity of Hydrogen, most probably in a solid state: Pot-ash has yielded to Sir Humphrey Davy a metallic button; and is, therefore, an oxyd, and also contains oxygen in a solid state.\n\n2nd. The Schisti, or Slate Mountains, are said also to be formed by the decomposition of vegetables, and the Coal formations, also, to consist of the residue of vegetables, probably charred by a close heat, and must, therefore, be formed of the carbo and constituent Gasses of those vegetables. If such dense substances can be thus, in part, compounded of a gaseous substance, there is an equal probability, that the gazes separated by the vegetative processes from the air and water necessary to their nutrition, may compose the Primary Earths, Salts, Minerals, and Metallic substances\nobtained from them by decomposition or incineration; and I think it not improbable that future experiments may prove, that all the primitive earths, metals, and mineral substances, are composed of the primary elements, as we are now philosophically bound to consider them, Oxygen, Hydrogen, Azote, combined in proportions innumerable as these products themselves, and from which variety of proportion they receive their distinctive characteristics. (See Note 9.)\n\n3rd. As an important and additional proof, that the process of vegetation certainly generates and produces one of the most abundant and most dense primary earths in nature, namely, Silex, Siliceous Earth, or, as I shall call it, the Sandy principle, I extract the following from the Elements of the Science of Botany, by the celebrated and indefatigable Linnæus.\n\n\"In many parts of the East Indies, there has long been a medicine in high repute, called 'Tabasheer,' obtained from a substance found in the hollow stem of the Bamboo. It has undergone a chemical examination, and proved to be an earthly substance, principally of a flinty nature; this substance is also found in the Bamboo in England. In the hot house of Dr. Pitcairn, in Islington, subsequently to this time, there was found, in one of the joints of a Bamboo, which grew there, a solid pebble, about the size of a pea. The pebble was of an irregular form, of a dark brown or black internally: it was reddish brown, of a close dull texture, much like some martial siliceous stones. In one corner were shining particles, which appeared\nto be chrystals, but too minute to be distinguished by the microscope. This substance was so hard as to cut glass. The cuticle, or exterior covering of straw, has also a portion of matter in its composition, from which, when burnt, it makes an exquisitely fine powder for giving the last polish to marble, a use to which it has been employed time immemorial, without the principle being philosophically known. In the great heat in the East Indies, it is not uncommon for large tracts of reeds to be set on fire on their motion by the wind, which I conjecture must arise from the flinty substance of their leaves rubbing against each other. These facts cannot avoid presenting to the mind at one view the boundless Laws of Nature, while a simple vegetable is secreting the most volatile and evanescent perfumes, it also secretes a substance, which, is an ingredient in the primeval mountains of the globe.\"\n\nThese facts, which have produced the assent of this Prince of Botanists, to the formation of a first rate primary earth, by the process of vegetation, are, I think, sufficient proofs, in conjunction with those above stated, that all the primary earths, the metals, and mineral substances, and, of course, all the rocks compounded of them, have been originally formed by the process of vegetation, and animalization. (See Note 1, 2, 3, and 14.)\n\nVast tracts of the interior of the earth have, as above, been shewn to consist of the remains of marine animals.\n\nThe Chalk and Lime Stone formations I trust to have shewn, have also resulted from the same re-\nmains; and also, that the Coal formations have been produced by the residue of marine vegetables and a charring heat, as well as the Schisti or Slate Mountains: as, therefore, the proofs narrated in the foregoing pages, and the Notes referring to them, are, I trust, convincing, that every part of the earth has been formed in a Fluid; that many parts are visibly the remains of vegetable and animal decomposition, and that most of the geological bodies are resolvable into the elements of vegetable and animal life; we now arrive at the conclusion, THAT THE PROCESSES OF VEGETATION, AND OF ANIMALIZATION, WERE THE MACHINERY CHOSEN BY THE FIRST CAUSE FOR GRADUALLY PRODUCING, IN THE COURSE OF SUFFICIENT AGES, IN THE WATERS OF GENESIS, THE VARIOUS GENERATIONS OF VEGETABLE AND ANIMAL LIFE, WHICH, BY THEIR GROWTH, DECAY; THEIR DEATH, DECOMPOSITION; AND DEPOSITIONS HAVE PRODUCED ALL THE GEOLOGICAL BODIES OF WHICH OUR EARTH IS COMPOSED. These Bodies, as they were depositing, have been attracted towards the centre of the aqueous globe by the great and universal law of attraction; and since the separation, have, by the effects of internal fires, convulsions, or the electric power, acquired their present appearances.\n\nThus, the Law of Gravity or Attraction would necessarily occasion a vast pressure towards the centre of the aqueous globes of all the particles of the geological bodies. The vegetable and animal remains of which they were formed, as stated above, would pass through various stages of fermentation. Heats, inflammable and other gasses,\nwould be thereby generated; and these internal fires must have been in operation, pending many of the ages required for the formation of the entire diameter of the Earth in the Waters of Genesis. Hence must have arisen, long before the separation of these waters, not only internal changes in the forms and original composition of the congregated masses of the geological bodies, but also numerous commotions in the interior parts, which have produced probably many of the mountains, and must certainly have produced those depressions on the surface of the earth, which served to form the beds of the original oceans or seas, formed at the time of the separation of the waters.\n\nThe electric agency, also, has probably had great influence in these internal changes, both previous to and since the time of the separation; and on the subject of the internal and external changes in and on the Earth, I refer the reader to the attentive perusal of the Notes, but more especially Notes 7, 10, 13, and 14.\n\nAnd as it is very remarkable, that no mention is made in the 1st of Genesis of the creation of any of the Marine Plants of the Ocean, I will conclude this part of the subject with an observation on that remarkable circumstance—namely—that it appears to me indicative of the possible truth of the theory I have presumed to offer, that the first verse of Genesis refers to a preparatory process of the Creation, totally distinct in its time and nature from the separation of the waters and the primeval appearance of the dry land as recorded in the ensuing verses, which took place in the six days.\nBecause the creation of the vast body of the marine plants required for the purpose of nutriment for the marine animals of those waters, who, by their death, decay, and depositions formed part of the machinery of the Creator for producing the earth, the creation of those plants, having taken place at the beginning, as in the first verse, being the preparatory process of the creation, by which the Dry Land was, in subsequent ages, to be produced, no need was that mention should be made of their creation at the period of the separation, when the land animals and vegetables were brought into being; for and because these marine plants were included in the record of the first verse, \"In the beginning,\" &c. (See Notes 7, 10 & 13.)\n\nIn the preceding System of the Creation which I have ventured to form, and to which I was determined, as observed above, on reading the ideas stated by Archdeacon Paley to have been promulgated to the world by Buffon and other philosophers, I have made some remarks on the assertion, or supposition of Buffon, that the globe we inhabit was formed by the stroke of a Comet knocking off from the Sun, as stated by Paley, a piece of molten glass, I trust to have shewn the great improbability and absurdity of this. Such a supposition would lead us to believe, that the creation of our planetary system was not the gift of an all bountiful Creator, but merely the effect of Chance; and if I have proceeded to any severe reflections on its irreligious tendency, I trust I am warranted therein by the opinions given by Paley, of this doctrine being founded on Atheistical principles; that is, if I\nunderstand it, denying the agency of a Supreme Ruler of the Universe in the Works of Nature.\n\nAn opinion, so contrary to all our natural feelings of religion, it appeared to me, the duty of every man to refute whose understanding should dictate to him the errors of such a system—and I hope to have shewn, that as it is completely unsatisfactory to the mind of man, in the highest state of its acquirements—so, it never can be productive of general or extensive assent; and in the following compendium of my Theory of the Sun's Formation, I shall re-advert to the above supposition of Buffon.\n\nTHEORY OF THE SUN'S FORMATION.\n\nI now proceed, with due humility, to present to the reader a compendium of the ideas above stated, on the Sun's Formation, at the time the primordial waters of Genesis were created, according to the construction I have put on the 1st verse of the 1st chap. of Genesis, by the combustion of hydrogen or oxygen, or other combustible gasses, created by the first cause, as stated in page 24 of this work. I have presumed that those gasses were ignited by the electric fluid, by the blaze of comets, or other igneous bodies, and that the extrication of the light and heat, formed by the combustion of these gasses, (in order to produce the formation of the aqueous\ngloves, destined thereafter, to originate the Earth, and the other Planets of our system,) that this light and heat formed the body of our sun, which formed the centre of the System, by the laws of His gravity and attraction.\n\nIf I recollect aright, heat and light have not, as yet, been discovered to have weight; but our means of ascertaining this by experience, in the usual way, is very dubious. The bulk of a grain of heat or light may, perhaps, be sufficient to fill a house; therefore, we could, perhaps, not ascertain the fact; but heat and light are certainly sensible bodies, and therefore must have weight. Heat expands and increases the dimensions of the hardest bodies in an astonishing manner. Light is said to travel from the Sun at the rate of twelve millions of miles a minute, and also penetrates the most dense substances. Although, therefore, the weight of these subtle agents be infinitely less than any other bodies we know of, they are, probably, subject to the same laws of attraction and gravity.\n\nWe may, therefore, conceive that the heat and light extricated from the combustion of these ærial substances, in the formation of the primordial waters, would unite and ascend, by the laws of their gravity and attraction, or by an original impulse of the Creator,* to their position in the regions of\n\n* As Light is known to exist in two separate states, namely, latent and active; and as we are told in the 2nd verse of Genesis, Darkness was on the face of the deep, it is probable the Light evolved in the combustion of the gasses was diffused through the regions of space in its latent form, and was not elicited into its active and visible state until the time of the 3rd verse; and it is remarkable, that the first operation of Deity at\nspace, and form there the body of our Sun, and that\nthe aqueous globes, as they were formed, and were\nprojected by the projectile force, became subject to\nits attractive influences. (Vide Note 16.)\n\nWhether this attraction be effected by an inhe-\nrent power of the Sun, or, that it may be owing\nin part, to the influence of the vast stream of æri-\nform substance, passing towards him, to supply\nhim with fuel, I shall presently consider. I shall,\nhowever, previously make some remarks in addi-\ntion to those offered above, on the idea of Buffon,\nof molten glass having formed our earth and the\nplanets of our system.\n\nIt is, I consider, impossible to conceive, that\nglass could exist in the stupendous heat of the sun's\nfire, without decomposition, that is, without return-\ning to its elementary principles.\n\nGlass is formed in our planet of siliceous earth\nand pot-ash. The former we have before proved,\non the authority of Linnæus, to be composed by\nthe vegetative process; its parts are, therefore,\nformed of the gasses which the vegetable extracts\nfrom the water and air it imbibes for its nutrition.\nThe latter, pot-ash, has also yielded to Sir H. Davy\na metallic button. It is, therefore, an oxyd, and\nmust contain much oxygen. Siliceous earth and\npot-ash, the component parts of glass, are then,\nmostly composed of æriform substance.\n\nWe know that the diamond, which is, probably,\nmuch more dense than siliceous earth in other\n\nthe time of the separation was the evolution of Light in its ac-\ntive and visible state, and the collection of it into one vast fo-\ncus, the Sun of our system, as by the 4th verse.\nforms, has been volatilized in part by burning lenses, or by streams of oxygen gas in a state of ignition. What can these heats be in comparison to the sun's fire? perhaps as an atom to a world.\n\nI trust, therefore, it is more consistent with the sacred documents we have had handed down to us by our religion, with the operations of nature we are enabled to examine, with the admirable simplicity and order of the laws, by which the first cause has directed the operations of that nature, to believe, that having first formed the principles, which in the present state of our knowledge, we must call elementary, He proceeded by the combination of these principles, by combustion, to form the waters which were destined thereafter to produce our Earth and Planets.\n\nIt is, indeed possible, that these elements, Oxygen, Hydrogen, and Azote, may be compounded of other final elements, of much greater energy than themselves, but the rules of science forbid us to consider that as the fact until we have found it by experiment. We have, therefore, only to carry our knowledge of these principles into our reflections on the construction of our system, and with humility, praise and adoration, to conceive, that as most, or all, the geological bodies we have analyzed, are found to consist of these principles, they may have been these with which, the First Cause, with amazing skill and effect, has operated the wonderful system of Creation He hath bestowed on us.\n\nIn the contemplation of this Creation, and of therecent discoveries in pneumatic chemistry I trust to have\nshewn the possibility, that our Sun may have been formed, at the time of the formation of the primordial waters of Genesis; and as before stated, I have considered the other planets of our system, and their moons, to have been formed in the same manner at the time when, by the creative mandate, the combustion of the gasses took place, and which, I consider, to be meant and recorded by the 1st verse of 1st chap. of Genesis. So I likewise conceive that our Sun, was formed at the same time, by the vast body of heat and light disengaged by the stupendous combustion, and that having found his position in the regions of infinite space, according to the laws of his nature, he exerted his attractive influences on the planets of our system, of which he became the centre.\n\nWe have now to consider by what laws the vast waste of the heat and light of the sun is replenished; and, as our conceptions thereon, will be found in some degree at variance with the hitherto received ideas of the nature of the spaces between the sun and planets, and the regions of infinite space, and bear also considerably on the nature of the sun's influence on those planets, we shall first make some observations on the\n\n**ATTRACTION OF MATTER.**\n\nIt is said by philosophers, that all bodies are attracted to the earth's centre: all bodies thrown into the air from the earth descend to the earth's surface when the propelling force is spent, and the body is arrested by the atmosphere through which\nit passes. It is said by Paley, page 449 of his Natural Theology, that \"One principle of gravitation causes a stone to drop towards the earth, and the moon to whirl round it. One law of attraction carries all the different planets round the sun.\"—This, he says, philosophers demonstrate; and at p. 388 he adds, \"Calculations were made some years ago of the mean density of the Earth, by comparing the force of its attraction with the force of the attraction of a rock of granite, the bulk of which could be ascertained, and the upshot of the calculation was, that the Earth, upon an average through its whole sphere, was twice the density of granite, or about five times that of water.\"\n\nNow, respecting the principle of Attraction, I have to remark, that in Chemistry we know with certainty, that particles of matter have a mutual and elective attraction called Affinity. When an acid is united with a metal into a neutral salt by this attraction, it may be separated from it by any substance with which the acid or its particles have a greater affinity. Thus, if iron, or its oxyds, be dissolved in sulphuric acid, it forms green vitriol, commonly called copperas; but by adding an alkali to the solution, the iron precipitates, and a neutral salt is formed of the sulphuric acid and that alkali.\n\nIn a lake or pond in the isle of Anglesea, in England or Wales, the water holds blue vitriol or copperas in solution, which is a salt composed of copper and the sulphuric acid.\n\nWhen iron hoops are thrown into the pond or lake, they become covered with copper scales;\nwhich is scraped off, and found to be the purest copper in nature. This decomposition of the blue vitriol takes place because the particles of iron have a greater affinity or elective attraction for the sulphuric acid than the copper has.\n\nThe Load Stone is well known to attract iron, even in a cold state. Pieces of iron, rubbed with the Load Stone, become also magnetic: two pieces of wood, or cordage and wood, and probably many other substances, by friction to a great degree, take fire; that is to say, they become raised to that degree of temperature by that friction, that their particles attract the oxygen from the azotic gas, and from the light and heat with which they are combined in our atmosphere. Certain stones also, as flints, being struck against iron or steel, heat the particles of the steel so as to calcine them; that is, they bring these particles to the temperature at which they also decompose the oxygen gas of the atmosphere, and disengages a latent light and heat.\n\nThus the attraction of Matter is certainly proved by Chemistry.\n\nBut how is the attraction of large and solid bodies proved in the usual temperature of the atmosphere, as in the case of the block of granite mentioned by Paley? One rock of granite, placed alongside another, will evince no attraction. It is said, indeed, that some islands, having much iron ore, have attracted a vessel from her course, which, if it be the fact, may perhaps also prove the attraction of matter of a certain description, but I know no other way by which the attraction or density of the rock of granite could be proved, but by\nbreaking it by some other body, and ascertaining\nthe weight of the stroke, thus, if a hundred weight\nof granite required a stroke of a certain number of\npounds to break it, and a rock of some other spe-\ncies required only a force of half that number, its\nattraction or density might be said to be half that\nof the granite; thus far, then, attraction would be\nproved by Chemistry and Geology also.\n\nBut, that the Creator originally fixed some such\nlaw as attraction for the cohesion of the particles\nof matter, appears highly reasonable, else, how\nshould the Earth and Planets, travelling at such\nan immense rate in their orbits, be retained in their\npresent forms, notwithstanding the power of such\nvelocity of motion?\n\nA ball of snow, when impelled by the force of the\narm, if it be not rendered sufficiently dense by\ncompression, separates into innumerable parts, and\nit must have been the same with the Earth and the\nPlanets but for some law of attraction or cohesion,\nto resist the attrition of their rapid motion through\nthe heavens.\n\nThis attraction, then, of the particles of matter,\nseems to be indispensable to their existence as\nspheres, but the attraction of these for each other,\nthough generally agreed to by the philosophers,\nappears more dubious and uncertain.\n\nThis doubt is supported by their immense dis-\ntances; which may, indeed, be founded on a crude\nidea, and the doubt may perhaps be dissipated on\nfurther consideration.\n\nThe Moon is observed in its approach to occasion\nhigh risings or tides of the waters of the earth,\nwhich recede on its retiring. This, it seems to me, is an almost incontrovertible proof that the atmosphere (for storms are often generated at the same approach of the Moon) and waters of the earth and seas are attracted by the Moon. If the Moon have this power, we may reasonably conclude that other planets have this power also, governed by certain laws of distance and dimension.\n\nNow, as to the manner in which the Sun exerts its attractive influence on the Earth and the other Planets.\n\nThis attraction of the Sun is said, by the philosophers, to be the cause why the Earth and Planets, having been, originally, projected in a right line, do not move in that right line, but in their respective orbits round the Sun.\n\nAs to the opinions of these philosophers of the nature of the Sun's substance, I am not aware, except as above stated by Paley, that Buffon supposes it to consist of molten glass. I trust to have shewn in the foregoing pages the improbability of this, and that it is more probable to be a body of light and heat. His density, in that case, cannot be equal, bulk for bulk, to the density of the Planets, which are with reason considered to be inhabited, and must probably be formed of solid matter.—But as to the nature of the Sun's substance, I confess, I cannot conceive it possible that a body of such inconceivable heat, should consist of anything else than gaseous substance. We know of nothing here below that can produce light and heat with more intensity, than the decomposition of oxygen gas. Why should we not reason by\nanalogy that the light and heat of the Sun are produced by the same means? All the other means we have of producing heat by burning glasses, or by friction, are derived from the Sun, and nothing is more remarkable in nature, in her general principles than uniformity of means. The principle of gravity is said to be the same in an apple falling to the ground, as in the motions of the heavenly bodies.\n\nIs it not then impossible to conceive, that in the Sun's heat, solid or liquid substances, could exist undecomposed. The diamond is volatilized into vapours, and if I recollect aright, the perfect metals also, by the galvanic power. It has, indeed, been supposed by some, that the Sun may be habitable, that the heat of the particles of light is owing to their friction or attrition, in their passage to the Planets. By such a supposition, we should be forced to conclude, that the planets farthest off from the Sun were the most warm, which I imagine is totally contrary to probability, to the opinions of the greatest philosophers, and to the evidence of our own senses in the Planet we inhabit.\n\nNow, but for the idea which has, hitherto, been adopted, that the regions of infinite space, or at least the spaces in which our Sun and Planets move, are in a state of vacuum; but for this idea, I should say, that the Sun is a mass of burning æriform substance, such as hydrogen gas, or some mixture thereof, which has the power of decomposing oxygen gas, and of throwing off its light and heat. The union of the bases of these gasses, oxygen and hydrogen, would form water, in the\nstate of vapour, which would either be directly decomposed again, by the Sun's fire, or otherwise be driven off into the heavens, and probably be in future decomposed, as happens in our atmosphere, by the electric fluid, or be otherwise condensed into aqueous globes, for the future formation of other heavenly bodies. (See Note 12.)\n\nI shall now offer some observations on the above idea of the philosophers, on the existence of a vacuum in the spaces through which the planets move.\n\nIf we consider the projectile force to have been ab origine given to the Planets by the Creator, we may suppose, that this force was greater than what would have been required to produce their motions round the Sun, if a vacuum had existed, as thus; allowing the spaces between the Planets and the Sun, to be filled with an æriform substance, of vast tenuity, (and indeed that such immense spaces should consist of vacuum is nearly incredible) yet it would still be possible, that this æriform substance should not impede the motions of the planets; because, on the above supposition the projectile force would have been made so much greater than would have been required for moving these planets through a vacuum only, as the resistance of this æriform substance should render necessary to overcome that resistance by the projectile force.\n\nAgain, the force of the attraction of the Sun, allowing its substance to be æriform, and that such immense streams of gasses were continually pouring into it, as would be required to support its combustion, we shall find the force of this attraction\n(hitherto so called) must be greatly increased; for, in addition to its own proper attraction, as a body of heat, light and æriform vapour, we shall perhaps find reason to conclude that this attraction must be greatly augmented by the vast streams of æriform substance, continually passing towards the centre of the Sun, for supplying its combustion and repairing the vast waste of its light and heat.\n\nA small fire in a stove is sufficient to draw to it a strong current of air to support its combustion.\n\nThe power of currents of air on the earth and seas is well known to upset ships, trees, and houses.\n\nThe power of steam, also, will come under the same comparison; and according to its quantity, will raise almost any weight.\n\nWhat, then, must be the effect and power of such inconceivable streams of gazeous substance, rushing through the heavens, as must be required to supply fuel for the Sun? And it appears to me, the power of the Sun to attract the Planets, at such immense distances, is hereby the more satisfactorily accounted for, as they are to be supposed solid spheres, while, as I have presumed, by my Theory of the Sun, his substance must be æriform, and of course, of much less density, bulk for bulk, than the Planets. If, then, we should adopt the idea that the heavenly bodies do not float in a vacuum, but should accede to the probability, that the intervening spaces are filled up with an æriform fluid for the purpose of supplying fuel to the Sun's fire, I humbly conceive we shall have found a satisfactory way of accounting for the influence of the Moon on our seas and atmosphere. If the fact be\ncertain, that the waters rise as the Moon approaches the earth, and recede as she retires from it, may not this phenomenon arise from the pressure exerted on the æriform matter above mentioned by the Moon, on its approach to the Earth, which pressure, at length reaching our atmosphere, presses on it also, and thereby on the Waters of the Ocean, causing them to rise and fall proportionably, and to occasion the Neap and daily Tides?\n\nShould we not, also, have, by the same theory, a plain and simple way of accounting for the great principle of attraction in the heavenly bodies? that, by a power similar to that which propels bodies forward on the earth and seas, or atmosphere, namely, the wind; so the heavenly bodies are propelled from their right line, and driven round their central Sun by this mighty current of æriform gasses in their courses towards the Sun?\n\nAllowing the projectile force—(by which I understand Sir Isaac Newton to have meant the primary projectile force directly given to the heavenly bodies by their Creator)—allowing that force, and the attractive force of the Sun, to be the causes of the nearly circular motions of the Planets, still it appears to me clear, that this projectile force must be something very different from the species of impelling force which Paley, in his Natural Theology, speaks of in p. 390 of that work. \"If it were possible,\" he says, \"to fire off a cannon ball with the velocity of five miles a second, and the resistance of the air could be taken away, the cannon ball would for ever wheel round the Earth, instead of falling down on it.\" Now, if the ball were fired\noff in a direction due north, it is evident, that in the course of the circle it would form, it must return by the south pole, to the place it was fired from, to north; and therefore, in every revolution, it would return in an exactly opposite direction to where it was fired off from; the force, therefore, by which it returns, could not be the force of firing off, because it returns in a line directly opposite to that force. (See Note 8.)\n\nI therefore conceive the projectile force, impressed by the first cause on the heavenly bodies, is of an entirely different nature from the projectile force of a cannon ball.\n\nMay it not rather be something in the nature of the force of the current of gasses I have mentioned, as forcing the Planets into their rotatory motion round the Sun?\n\nMay not the projectile force, partake of the nature of electricity?\n\nReferring to what we have said above as to the means by which the waste of the Sun's light and heat is replenished, we shall now make some observations on a very important sentence as to this subject, contained in Paley's Evidences of Natural Religion, page 392.\n\nOn the subject of the cause of the attraction of the Planets by the Sun, he there says: \"Nor shall we find less difficulty in conceiving a conflux of particles incessantly flowing to a centre, and carrying down all bodies along with it; that centre being itself in rapid motion through absolute space; for, by what source is the stream fed, or what becomes of the accumulation?\"\nThe principal objection of Paley, then, to the idea of a fluid or æriform substance existing in the spaces between the Sun and the Planets, and between each of themselves, is contained in his question, \"By what source is the stream fed, or what becomes of the accumulation?\"\n\nIf we allow, however, that the Sun is a body in a state of constant combustion, and that its ignition is supported in the same manner as terrestrial fires, (and without allowing this, we cannot, accordin'g to our knowledge of combustion, conceive how the fire of the sun is continued,) we shall meet with no difficulty in finding \"by what source the stream is fed.\"\n\nThe spaces between the Sun and Planets, and also the regions of infinite space, if they be allowed to contain æriform fluids, (whether these be oxygen and hydrogen gasses, or a mixture of these, or of other inflammable gasses,) these inconceivable extents of space would certainly contain sufficient fuel to supply, not only our Sun, but probably all the Suns of the other systems that may exist.\n\nIt is, I think, proved above, that resisting medii may be contained in the planetary spaces, without retarding the planetary motions. Hydrogen gas, being thirteen times lighter than atmospheric air, and being very combustible, that is, easily uniting with oxygen, and thus setting free its latent heat and light, may therefore be supposed to form a great portion of these æriform medii, (See Note 12.) In fact, as we know of no such thing as a vacuum in any part of Nature around us, it seems difficult to conceive that the vast spaces between the heav-\nonly bodies are in that state, and this has no doubt suggested to the ancients the idea of the \"abhorrence of Nature of a vacuum.\"\n\nBy what means, then, a sufficient quantity of this æriform fluid can be found is, I trust, evident, and the question of the Archdeacon, \"By what source is the stream fed,\" is answered. And the end to which the stream is applied, namely, the support of the Sun's waste by combustion, will also answer the other question, \"What becomes of the accumulation?\" I answer, it is consumed by the Sun's fire.\n\nIf the medii then of the planetary and infinite spaces may be supposed to consist of hydrogen, oxygen, or other inflammable gasses, or a mixture of these, the hydrogen and the oxygen gasses, being drawn into the Sun, would be immediately decomposed, giving out their latent light and heat, and water would be formed in the state of vapour, which would either be also decomposed by the Sun's fire, or driven off into the heavens by its own clasticity, and there condensed into globes of water, destined thereafter, to form new Planets or Worlds, like those of our own system, and evincing the unceasing tendency of nature, in obedience to laws by which it is endowed by the Creator, to give life and enjoyment to countless myriads of beings; in which novel subject I shall treat in the sequel. (See Note 17.)\n\nIf the fact be founded, that the attraction of a Planet is formed by the attraction of its parts, and that therefore the power of its attraction is in proportion to the density of the Planet; then, if\nwe allow the Sun to be a body of æriform matter in combustion, its attraction must be much less, in proportion to its bulk, than the attraction of each of the solid Planets; and although its greater bulk may compensate for its inferior density; but, the current of æriform fluids which, to use Paley's words, \"would be powerful enough to carry bodies down with great force towards a centre,\" will it not also account, in whole or in a part, for the attraction the Sun exerts on the Planets? As to these fluids being, as he says in another place, \"powerless with respect to the motions which result from the projectile impulse;\" I trust I have explained before, that the resisting force of these æriform fluids may have been counteracted by an additional power having been given to the projectile force to overcome that resistance; whereby it has happened, that, as he says again in page 393, \"that resistance has had no sensible effect on the Moon's motion for two thousand five hundred years,\" and, I may add further, that these fluids never can have any such effect; and I trust to explain this more fully hereafter.\n\nWe now recur to Paley's observation in page 388 of his Theology of Nature, that \"by a comparative calculation with the force of attraction of a rock of granite, the Earth was said to have twice the density of that rock, or about five times that of water.\"\n\nHas the mode of ascertaining the force of this attraction of the Earth been grounded on the supposed force of the attraction of the Sun on the Earth and Planets? Has the Earth's attraction\nin the above experiment been come at by calculating its proportionate bulk to that of the Sun, and assigning it therefrom its proportionate attraction? If so, and it should be conceded that the theory I have ventured to propose of the Sun’s power of attraction, being created or increased by the streams of æriform fluid passing towards his centre, to supply him with fuel; if this theory be correctly founded in nature, it is evident the above experiment in the attraction of the Earth, cannot be correct in its results. The force of attraction of a body is composed of the united attraction of its parts; but, if the Sun’s density have hitherto been considered by philosophers to be according to his powers of attraction, and it should be agreed to that the streams of æriform fluid have a great influence in producing that attraction, the density of the Sun must, in this case, be much less than it has hitherto been estimated at, and of course the density of the Earth also if it have been grounded on this supposed density of the Sun.\n\nI now conclude the theory of the Sun’s formation by some observations on the following extract from Paley’s work, p. 380. Speaking of the intervening spaces between the Planets, he says, “that the intervals between them are made devoid of any inert mater, either fluid or solid, because such an intervening substance would, by its resistance, destroy those very motions which attraction is employed to preserve.”\n\nI have before endeavoured to shew, that there may be such æriform substances existing in these spaces, which would indeed resist these motions\nof the Planets, but that this resistance is sufficient only to diminish the velocity of these motions. To explain this more fully,—May not the Moon have been originally projected by the Creating Cause to move in its orbit or course at the rate of three thousand miles an hour? and, supposing the resistance of the medii or æriform fluids of my theory to be equal to one thousand miles per hour, this resistance would only diminish the rate of the Moon's motion to two thousand miles per hour, which is about the actual rate she is said to travel in her course. (See Note 5.)\n\nIn fine, the theory of the Sun's being replenished with fuel by means of æriform fluids, is supported by another observation of Paley's. In page 350 of the above work, he says, \"The light and heat of the Sun follow the same laws, and, to us, appear nowise different from the light of a candle and the heat of a coal fire.\" Why, then, may not this heat and light of the Sun be supplied in the same manner as that of the candle and coal fire?\n\nIn our Planet, this heat is now known to be produced by the decomposition of oxygen gas by those combustible bodies, and the consequent extrication of its latent light and heat; but if the light and heat of the Sun be generated by the same laws, and, as there is probably some physical cause for the attraction of the Planets by the Sun, as it is possible his great magnitude would not require less than the spaces between him and the Planets, and between each of them, to supply the æriform fluid for his combustion; and as this amazing current must have a great physical influence on the motion\nof those planets round their central Sun, and may therefore throw additional light on the great principle of his attraction: I, therefore, humbly submit the foregoing Theory of the Sun's Formation and the means of supplying the waste of his combustion, to the scrutiny of a candid and enlightened world; and being sensible of my incompetence, in respect of that profound degree of scientific knowledge, required in the attempt I have made to reconcile and explain the account of the Creation, handed down to us by our religion, with the great discoveries in the science of geology, chemistry, and pneumatics; I have only to hope, I may, at all events, have exalted the utility of these sciences, by shewing their tendency and power to diminish or quiet the doubts of scepticism, and to open greater sources of our admiration of the Goodness, Power, Wisdom, and Glory of the Great First Cause.\n\n(See concluding Note.)\n\nHaving thus concluded my attempt on the system of Creation of our Earth and Planets, and of the formation of their Central Sun; with the means which I conceive may have been adopted by the Creator, to supply the vast waste of his combustion, we now proceed to the last part of our prospectus, namely, the Dissolution of our Globe, with the possible changes, which the present state of our knowledge would lead us to presume, would be the result of that\n\nDISSOLUTION OF OUR EARTH.\n\nBy the authority of scripture, we are informed that the Globe we inhabit is doomed to dissolution\nby the element of fire. We cannot, indeed, presume to say that the nature of this conflagration shall be the same, and be governed by the same laws, as those which take place at present, but judging from the hitherto immutable nature of those laws, we shall proceed to consider the principal changes which, according to them, would take place at this general conflagration. There are, indeed, many parts in the external and internal phenomena of the earth, which subject it continually to change and decomposition. The probable effects also, of its continual motion in the heavens, and the possible contact of other heavenly bodies, perhaps igneous, appear to confirm the destiny recorded in the scriptures.\n\nThe late discoveries, however, in pneumatic chemistry, have proved to us, that what had hitherto been considered as destruction by fire, is only a change or decomposition of the various combustible bodies, into the elements of which they are composed. A great proportion of the vegetable world, is found to be reduced by combustion, into elastic vapour, called gasses; and, it is not improbable, at least, if we assent to the facts stated by, and the opinion of Professor Chaptal, which I have before stated, on the productions of the vegetative process; and also, the still higher authority of Professor Linnæus, quoted above, whereby many of the primary earths and metals are proved to be the products of vegetation. I say, therefore, if we assent to these facts, it is not impossible, that the various earths and metals, and their combina-\ntions, may hereafter be found to consist of compounds of the bases of the gasses of oxygen, hydrogen, azote.\n\nIn the foregoing system of Creation, I have stated that lead is found to gain an accession of weight by oxydation of nearly ten pounds in one hundred pounds, by the absorption of oxygen from the atmosphere. This oxygen, must therefore, exist in the oxyd in a solid state. Pit Coal and Pot-ash, are found also to contain oxygen and hydrogen in the same state, and the Schisti or Slate Mountains are also said to have been composed by the decomposition of vegetables, which are primarily composed of these gasses, and these Schisti therefore, probably in part consist of solid oxygen, &c. In fine, from these facts, and many others stated in the foregoing pages we have in the theory of Creation come to the conclusion, that the processes of vegetation and of animalization, were the machinery chosen by the First Cause, for the gradual production of all the geological bodies of which our earth is composed.\n\nNow the marine vegetables of the waters or oceans of Genesis, can have imbibed their nourishment from these waters only, and must have had the power conferred on their natures, to decompose these waters, and to recompose by the process of vegetation (as we find to be the case in terrestrial vegetables,) a vast variety of new productions, all of which, however dense, must have possessed the constituent elements of water, oxygen and hydrogen, for their final elements.\n\nThe depositions then, of the marine vegetable\nworld, having formed a certain, and very great proportion of the geological bodies of the earth; the remainder of them we have conceived to have been formed by the depositions of the marine animals. The habitations or shells of these, we have shewn in various parts of the foregoing theory to compose a considerable portion of the earth, and the vast generations of these animals, after their decay and decomposition have, no doubt, according to their affinities and gravities by their depositions, formed or entered into, the structure of the remaining geological products.\n\nIn the course of our theory, we have endeavoured to shew, that the vast Chalk and Lime-stone formations of the earth, may also have been the result of the decomposition or disintegration of these marine shells. On this subject, we have to add one observation, bearing considerably on our present object, namely, the final elements of the geological bodies. It is, that Chalk and Lime-stone, being carbonates of lime, must also, therefore, consist of a great proportion of oxygen in a solid state, their carbonic acid being compounded of oxygen and carbo. Lime itself, also has, if I mistake not, afforded Sir H. Davy a metallic button; it is therefore an oxyd, and contains oxygen in the same solid state.\n\nThe marine animals, again, of the waters of Genesis, whether they derived their nutrition directly from those waters, or from the plants contained in them, or both, must finally have been composed of the constituent elements of water, the only mode of nutrition of those plants. But it is\npossible, and even probable, that the marine animals had the power of decomposing the imbibed air of the atmosphere, by which they would obtain another elementary principle, Azote. This is an aeriform substance, which is always found to be produced by the remains of terrestrial, and, no doubt, marine animals also.\n\nThus we are led to suppose the final elements of all geological bodies, and of the marine plants and animals of the ocean, and of the vegetable and animal productions of the earth to have been ab origine, OXYGEN, HYDROGEN, AZOTE, HEAT, and, perhaps, LIGHT AND ELECTRICITY; and that the immense variety of proportions of these constitutes the distinctive characters of those bodies.\n\nNow, in the event of the dissolution of the Globe by fire, the consequence would be, (as combustion is now known to be nothing but the extrication of light and heat, or caloric, by the decomposition of the oxygen gas of the atmosphere, and the subsequent absorption of its oxygen by the combustible body,) that the elements of all combustible bodies would enter into new combinations. The waters of the oceans, if not directly decomposed by this vast combustion, but, merely evaporated into vapour, would probably collect together, be finally condensed into water, be attracted together into vast bodies, and form Oceanic Globes, which must obey the laws of gravitation and motion, and would thus form the matrices of future planets.\n\nOn the contrary, should the watery vapours of our earth and ocean be drawn into the conflagration\nat this dissolution, and be decomposed by the intensity of its heat and the contact of the combustible bodies, which is indeed probable, these vapours would thereby be resolved into their primary elements, oxygen and hydrogen, in the state of gasses. A great proportion, also, of the vegetable and animal creation would immediately be decomposed into these gasses and the azotic gas.\n\nThe earthy, mineral, and metallic substances of the globe, many of which we have shewn in the foregoing pages of our theory to contain an abundant quantity of these gasses in a solid state, would be partly decomposed into these primary elements, and the remaining more indestructible parts, if not decomposed by the heat of the conflagration, would be resolved by it into vapours, for we have found, as before stated, that even by the comparatively small degrees of heat which the art of man has discovered, the diamond, and some of the perfect metals, have been resolved into such vapours; and, allowing even that these metallic, earthy, or mineral vapours, should not be decomposed into their final elements even by the heat of the conflagration, they must, after the combustion, be collected into vast bodies, mix with the other gasses resulting from the decompositions above stated, and, probably, by the agency of chemical affinity, find their decomposition effected by these gasses; or, otherwise, their decomposition into the primary elements of oxygen, hydrogen, and azote, may be finally effected by the electric fluid.\n\nThus, although it may be the design of Providence to put a final period to the present state of existence\nof our globe; yet, as the primary elements of which we have conceived it to be composed, are indestructible in the present state at least of our knowledge, these elements must unite to form the materials of a new state of existence; unless, indeed, counteracted by the divine ordinances, by which these very elements themselves should be annihilated.\n\nNow, that this globe is destined to dissolution is, I have already mentioned, probable, from many facts in its external and internal phenomena.\n\nIts pit Coal, sulphureous and nitrous combinations and the inflammable and other gasses it produces, and the tendency of these to produce earthquakes and volcanoes, may not operate sufficiently deep in the earth to produce its total dissolution. This is indeed more likely to arise, from its various motions in the heavens, and the possible contact of igneous bodies, as Comets &c., and it may form a part of the design of the Creator, that the heavenly bodies should thus be subject to continued changes; yet, would it not appear consistent with the unceasing evidences we have of His benevolence, to suppose, these changes are not to destroy the final elements of His creation; but to produce higher and better states of existence by their instrumentality?\n\nAssuming therefore, that the conflagration we are considering, has finally decomposed and resolved by combustion, and the power of mutual affinity, or by the electric fluid, all parts of the earth and oceans, into the primary elements Oxygen, Hydrogen and Azote, or other elements, we have now\nto consider how these would recombine to form other heavenly bodies. These primary elements, having been drawn together by the laws of affinity or attraction, would probably be soon ignited, and brought into combustion by the electric fluid, or the light and heat of the general conflagration. The hydrogen gas, would then unite with the oxygen of the oxygen gas, whose light and heat or caloric would be set free, and the formation of watery vapours would ensue. These condensing in the course of time, (for it is probable the light and heat of the conflagration would, by laws of its gravity, find its way to the higher regions of infinite space and form the Sun of the newly created system) while these newly formed vapours, condensing in the course of time, would form oceanic globes, which, also, in obedience to the same laws of gravity and attraction, would be attracted or driven, according to our theory, round their central Sun; and being endowed by the powerful and benevolent ordination of the first cause, with the most abundant prolific and plastic powers for the generation of plants and animals; these would, exactly in the same way (by which, as we have stated in our Theory of Creation,) the waters of Genesis produced our Earth, so the plants and animals of these new aqueous planets, would be continually tending, in the course of sufficient ages, by their vast accumulation, their death, decomposition and depositions, according to their affinities and gravitics, they would be thus continually tending to form the solid parts of their globes, which, by the laws of gravity, would be attracted more or less near the centre, and these depositions would\nthus accumulate, until the land should finally appear on the surface of these waters.\n\nWe must then, suppose the same benevolence and power of the Creator would be exerted to bring plants and animals on this part of its creation, endowing them with life and enjoyments of such degrees of eminence in the scale of being, as His providence might be pleased to direct.\n\nThus, we have cause to believe, from our evidences of the benevolence of the Deity, that the globe we inhabit, if destined to combustion, may be, thereby, changed into another, and more perfect state of existence, and its inhabitants be gifted with greater blessings, and we shall now venture to draw a conclusion from the foregoing observations on the dissolution and reproduction of the globe; namely, that although we are told in Scripture that this dissolution will take place, and the inhabitants then on earth will perish, yet as we have stated, that \"it would be more consistent with the unceasing evidences we have of the benevolence of the Creator, to suppose these changes are not to destroy the final elements of his Creation,\" and, as we have accordingly supposed these elements will only assume a new state of being, we therefore now draw our conclusion, that, as the final elements of the corporeal substance of man, could only then in common, with those of other elements, assume a new state of combination; so we conceive that the benevolent Creator (having in the present life given to him those high powers of intellect, and those hopes of a better state of existence,) has also arranged some plan, by which the elements of these\nbodies, and by a parity of reasoning, the elements of those who shall have died previous to the conflagration; some plan, I say, by which the elements of these bodies shall be re-united to the souls of which they formed the matrices on Earth, and that with them, they shall be endowed with a better and more perfect state of existence, as foretold and promised in the scriptures.\n\nThe elements of those human bodies, must otherwise be left to the disposal of a chance combination, and might thereby, enter into the reproduction of inanimate substance. We cannot conceive this to be part of the design of the source of truth and benevolence; and we therefore believe, that this very indestructibility of the laws of nature, and her eternal tendency to form (as we have attempted to shew above) new combinations of matter offer a proof, also, of the distinct destined existence, and of the immortality of the soul of man. (See Note 6.)\n\nHaving now finished these considerations on the Creation, Dissolution, and Reproduction of our Globe, in a new state, I shall only mention, that, reasoning from analogy, we may conceive the other systems of the heavenly bodies, to have been formed by the same laws of nature, instituted by the Omnipotent for that purpose. But we are told by a great poet, \"Presume not God to scan,\" and as I agree with that idea, inasmuch as that we ought not to venture so to do, beyond the data and facts, which He has placed in our view, so I have limited these observations to our system; humbly conceiving I have in some measure shewn, that the geology of our globe, and our latest discoveries in\npneumatics, will warrant the conclusion I have drawn from the foregoing facts and experiments.\n\nIn the theory of the Sun I observed, that the water formed by the combustion of the hydrogen gas, in supplying him with fuel, might, perhaps, be condensed into globes of water, destined hereafter to form new worlds or planets, like those of our own system, by the means we have detailed in the theory of Creation.\n\nI have now only to add, that we may well conceive this possible, from the incessant proofs of power, wisdom, and benevolence, we are permitted to discover in the operations of the Creator; that, in fact the recent discoveries of our astronomers, of Planets never before observed by the vigilance of those of former ages may be a proof that new formations of heavenly bodies are always taking place; and, that as we cannot presume to limit the attributes and power of a first cause, so the reproductive and plastic powers with which He hath endowed the laws of nature, may be found in continual operation for the production of other systems of heavenly bodies, and that the Almighty attributes and energies may be thus continually giving life and enjoyment, in a scale nearly infinite, and advancing, perhaps, incessantly in displays of His Goodness, Power, Wisdom, and Glory. (See the latter part of Note 17.)\nAPPENDIX.\n\nThe following Notes and Illustrations are recommended to the reader's attention as illustrative of the Theory of Creation, and particularly as containing observations on the late discoveries in Geology.\n\nNote 1. It may, perhaps, be thought by some, that allowing the processes of vegetation and animalization in the waters of Genesis, to have produced, by their decomposition, all the materials of the Geological productions, yet, that the quantity of deposition required to form the Earth, would be more, than they can conceive, could be produced by the vegetables and animals of these seas or waters; but, one single fact, which I shall mention from an ingenious publication, on the animals and monsters of our oceans, will, perhaps, satisfy their doubts on this head. It is stated in that publication, \"that the offspring of one single herring, being suffered to remain unmolested in the sea, for twenty years alone, would produce more than sufficient to form in bulk, ten such globes as we inhabit;\" and if, according to the system I have offered, it be conceded that the design of the waters of Genesis, was to form and produce the Earth by\nthese depositions, we may reasonably presume, that vegetable and animal life, were abundantly prolific to produce that end.\n\nNote 2. I here insert some observations on the composition of the granite mass, which is supposed by some geologists, to form the internal parts of the Earth or frame work of the globe.\n\nThis mass is composed of the assemblage, sometimes in thick, sometimes in very thin laminae of various kinds of mineral substance, such as quartz, mica, jasper, &c. all of which substances, again, are composed of the various primary earths, lime, magnesia, silex, alumine, barytes or terra ponderosa. The granite mass, then, is ultimately compounded of these primary earths, most of which, we have shewn to be produced by the decomposition of vegetables and animals; and that this mass has been, originally formed in, and deposited from a fluid, appears to me proved by the crystals of quartz, minute scales of mica, and its appearance of so fine a granular structure, and more especially, the visible layers and laminae dispersed throughout that texture. I have counted above twenty layers of a white substance, in a fragment of granite a foot square.\n\nNow, had the granite mass not been formed by the gradual decay, decomposition, and deposition of marine vegetables and animals, as we have stated in the theory of Creation; had its materials been formed at once in the waters of Genesis, the various substances composing it, (the mass) would have united according to their mutual affinities, and been\nprecipitated according to the laws of their gravity, in vast homogenous masses; but, the visible depositions of part of it, in layers and laminae, seems to confirm the opinion of their having been deposited in the course, perhaps, of numerous ages, from the decomposition and depositions of vegetable and animal life.\n\nThus, the granite mass gives, also, evident proofs of formation in fluidity, and although, from its more ancient formation, no instances of visible vegetable or animal remains may be found in its interior; yet, as we know that water of itself deposits nothing, but what it has held in previous solution, either partial or complete, and, as we know of no other source, from which the substance of this solution could be derived in the waters of Genesis, but from vegetable or animal decomposition, and as we have seen, by the foregoing theory and data, that vegetable and animal decomposition affords the materials of which the granite mass is composed. I trust, we are warranted in the conclusion, that having been deposited, and lain many ages previous to the deposition of the secondary and tertiary strata, and that, in a state of moisture, all its vegetable and animal organization has been destroyed from that cause, and those of compression, internal heats, and the electric fires of the Earth; and that this granite mass, has been produced by the same means, which appear to have been chosen by the Creator, for the construction of the more external parts of the globe, namely, the generation, decay, death, decomposition, and deposition of the vegetables and animals of the waters of Genesis.\nAccordingly we find in the review of the third edition of Lyell's principles of geology, it is stated, that \"the experiments of Watt prove that a rock need not be perfectly melted, in order that a rearrangement of its component particles should take place, and a more crystalline structure ensue. We may easily suppose, therefore, [says Mr. Lyell,] that all traces of shells and other organic remains may be destroyed, and that new chemical combinations may arise, and according to these views, gneiss and mica schists, may be nothing more than micaceous and argillaceous stones altered by heat, and certainly, in their mode of stratification and lamination they correspond most exactly. Granular quartz, may have been derived from siliceous sandstone, compact quartz from the same. Clay slate may be altered shale, and shale appears to be clay, subjected to great pressure.—Granular marble has probably originated in the form of ordinary lime-stone, having in many instances been replete with shells and corals now obliterated, while calcareous sands and marls have been changed into impure crystalline lime-stones.\"\n\nI have, chiefly, made the above extract from Mr. Lyell's work, in answer to the objection stated in the preface of my theory, made by Mr. Fairholme, regarding the granite mass; and I trust, it will prove, that although, this granite mass contains at present no organic remains; yet, it may have contained them originally, and that they may have been destroyed by the heats, fires and consequent change or fusion, the mass has undergone from those or, perhaps, from electricity. In fine, I must\nhere repeat, I find no cause, after the perusal of the latest works on geology, to vary from the theory of Creation, I now venture to present. On the contrary, I find several of the German geologists have adopted the same opinion, namely, \"that vegetable and animal life have been the cause of the production of the solid portion of the Earth.\"\n\nI therefore, must adhere to the opinion I have stated, in the 11th Note, that the discoveries of the marine organic remains, will be satisfactorily explained by this theory, and the necessity of supposing the Earth more ancient, that is, since the separation, than by the Mosaic account precluded; and I now conclude this note with an observation from Sharon Turner's Sacred History of the World. \"Therefore, [he says,] it appears to me most probable, that whenever the right theory of the fabrication of our Earth, and the era and succession of its organized beings shall be discovered, it will be found to be compatible with the Mosaic cosmogony, in its most natural signification.\"\n\nHappy should I be, if the theory I am now presenting to the world, should in its estimation be found to approximate to this description.\n\nThe late discoveries in geology of Baron Cuvier, Lyell, and Buckland and others, as they comprise not more than one mile of the depth of the Earth, (being no more than an eighth part of its diameter) do not in the least invalidate the theory I have formed, which comprises the entire of that diameter. I, however, repeat and extend here, the observations I have made already in these Notes.\n\nFirst, that Baron Cuvier in his computation of\nthe distance of time, namely, 5 or 6,000 years, (at which he places the date of his revolution as the result,) does not state by what comparison or scale he arrived at his decision; and it is difficult to conceive any scale he could have had, except a known quantity or depth of deposition from rivers or lakes in a given time. If this, however, be the source on which he has founded his computation, I cannot but consider it a very insufficient one. The power of deposition of lakes or rives could no more be compared to the quantum of that power possessed by the waters of a deluge, or the primeval oceans, than the currents of those rivers or lakes could be to the almost inconceivable force of the waters of a deluge overwhelming a great part of the earth.\n\nI should therefore humbly suggest the query, that the period at which these fossil deposits of the bones of terrestrial animals may not ascend higher than the time of the Deluge of Noah, and the circumstance of no human bones being found in the particular place of these discoveries, has been owing to those parts not being then inhabited by our species.\n\nOr, secondly, allowing him to be correct as to the period of 5 or 6000 years, at which he dates his revolution, and which, as he says, \"has buried and caused to disappear the countries formerly inhabited by man, and the species of animals now most known; that, contrariwise, it has left the bottom of the former sea dry, and has formed on it the countries now inhabited.\" I would ask, is not this period, which agrees very nearly with the time of the separation of the Mosaic ac-\ncount; equally well accounted for by that separation, and, therefore, instead of the countries formerly inhabited \"by man having been then buried and caused to disappear,\" shall we not rather say, that the Earth was then separated from the seas in which it had, according to our Theory of Creation, been formed, and that soon after this period of the separation, Man was created.\n\nThis Theory will also equally account for the present appearance of those marine deposits and organic remains now found at the greatest depths of the Earth to which mankind have yet penetrated. All these marine exuviae and organic remains, and the strata under which they are deposited, are satisfactorily accounted for by the construction of the 1st verse of Genesis we have formed as the basis of the theory of the foregoing treatise; and which construction has since been sanctioned by the eminent Geologists and writers already specified.\n\nI have only to add some observations on the Review of Lyell's Principles of Geology, of April 1835, on the subject of the antiquity of Mount Etna. \"It is thus,\" it is said, \"that volcanic formations confirm the evidence afforded by the sedimentary strata of the immense antiquity and lengthened duration of even the most recent geological æras.\" But is it not probable that the eruptions of Etna were much more frequent long after the time of its first eruption than what they have been since? Is it not probable the causes which produced that first eruption have since been greatly diminished by the numerous flowings of lava; according to the force\nof the cause, so must have been the number and frequency of those eruptions, and their frequency at first cannot be estimated by the eruptions which have happened in our times. The age of this mountain may, therefore, may be very far less than a computation formed on the frequency or deposits of its late eruptions would make it. The eruptions, also, may have begun long before it emerged from the waters of Genesis, and these sub-aqueous eruptions been deposited before the separation of those waters.\n\nNote 3. It remains now to offer some observations on the Salt formations of the Earth.\n\nThese formations offer strong evidence of our theory of the waters of Genesis. This salt, occasionally called common salt, sea salt, or marine salt, is entirely a creature of the ocean: no terrestrial vegetable that I know of has ever produced it, except when growing nigh the salt water.\n\nThese vast formations, found in various parts of the Earth, must have unquestionably originated from saline waters; and one way, in which the separation of the salt from the water which held it in solution, may be accounted for is, that parts of these seas have been swallowed up by earthquakes or volcanoes, and their water exsiccated by internal fires; or, that these parts of the seas have, by some revolution, been separated, and not being replenished by any rivers, have been gradually dried up by the Sun.\n\nBut, I should suppose the quantity of salt produced by these accidental causes, would not, nearly,\namount to the vast salt formations of our Earth. Some intentional operation of Providence for their production is most likely to have been the cause of the production of an article so indispensable for the use of man; and, I therefore conceive, it is more probable these formations have derived their origin from vast depositions of the marine plants of the waters of Genesis. These must have contained this salt in abundance, as do the marine plants of our seas; and the other products of their decomposition have united, according to their affinities, to form other Geological bodies.\n\nNote 4. It seems, indeed, almost impossible (supposing for a moment the idea of Buffon were founded as to the origin of our Earth,) to conjecture, by what means its waters could have been subsequently obtained. A body of molten glass would, necessarily, assume a spherical form in the heavens; and it seems not probable or possible that such vast cavities as the beds of the seas or oceans could have been formed on it by its motions.\n\nAgain, vitreous substances do not contain the elements that produce earthquakes and volcanoes. Hydrogen or inflammable gas is probably required for that effect, which is not contained in glass; therefore, the vast cavities of the ocean could not arise from internal commotions; but, even allowing them to have been produced by some unknown cause, how is the origin of the waters to be come at? Water is, I believe, sometimes generated in our atmosphere by the combustion of hydrogen; but this is as a mere drop in the ocean compared to the\ngeneral cause that produce our rains. In fact, it could not, consistently with the safety of the productions of the Earth, or even that of their embryos at the time of their formation, have been made a general law for the purpose of producing the waters of the oceans.\n\nOn the other hand, the system of the formation of the earth, from waters generated by combustion, appears to be a more natural and satisfactory solution of the phenomena of creation.\n\nThe waters formed and endowed, as we must conceive, according to the design of the Creator, with the most prolific powers of generating plants and animals, produced gradually sufficient deposits to form the Earth.\n\nI have stated in Note 1, that a single herring, unmolested for twenty years, would, as it has been computed, produce ten of our Globes; and, allowing it to produce only one Globe, what must the depositions of all the vegetables and animals of the waters of Genesis amount to? In fact, on a consideration of the probable powers of deposition of these waters, and of the small proportion the known parts of the land bears to our oceans, we might be inclined to conjecture that there may be vast tracts of land on the Globe yet undiscovered.\n\nNote 5. It may be observed further respecting this resistance of the teriform medii of our Theory, that, as our system itself, and I believe also the fixed stars, are allowed by Astronomers to have some progressive motion, and which must be owing to the principle of attraction towards some\nIn fact, it\n\nof the pro-\n\ntheir embryos\n\nbeen made a\n\nthe wa-\n\nformation\n\ncombustion,\n\nrectory solu-\n\nwe must\n\nthe Cre-\n\ngenerating\n\nsufficient\n\nherring,\n\nit has been\n\nand, allow-\n\nmust the\n\ninals of the\n\non a consi-\n\nposition of\n\nthe known\n\nmight be\n\ntracts\n\nrespecting\n\nTheory,\n\nalso the\n\nto have\n\nmust be ow-\n\nwards some\n\ncentre; therefore, the resisting aeriform medii must move the same way also in their courses towards the Sun, having thus two motions; they must be thus attracted towards the same centre as our system is said to be; the resistance they give to the Earth and Planets in their rectilinear motion, though it may thereby diminish the velocity of that motion, yet it cannot \"destroy it,\" these aeriform medii being themselves under the influence of the same attraction towards an unknown centre. (See Note 8 in confirmation of this.)\n\nThis idea of a general motion of our system, and of the fixed Stars, will be found in the work I have so often quoted, Paley's Natural Theology. He states, if I rightly remember, \"that the fixed Stars have certainly small motions,\" and considers them to be attracted to a centre; and if this be really founded in fact, it certainly offers one of the grandest ideas of the Deity the mind of Man can conceive, namely, that if all the Systems of the Heavenly Bodies thus move round one common unknown centre, may we not conceive that centre to be the Empyrean Throne of God mentioned in the 4th chapter of Revelations? from whence He beholds continually the immense operations of His hands, performing their revolutions round Him?\n\nThe above idea of universal attraction also offers another very important one, of the cause of the Projectile Force or rectilinical motion of the Planets of our system, namely, that this universal attraction to a common centre IS that cause?\n\nSince writing this Note I have seen the substance of its last paragraph confirmed by the elo-\nquent discourses of Dr. Chalmers, lately published, on the Christian Revelation in connection with the Modern Astronomy.\n\nNote 6. The reasoning in this work, in page 47, is grounded on the idea, that the entire substance of man, including the soul, is not destined to perish with the material substances of the globe. On that idea I have supposed, that the corporeal parts of his frame, may be, by some arrangement of Deity, reunited with the soul or intelligent part; but should the future state of existence be one altogether spiritual, the constituent elements of the body, may then, perhaps, enter into indiscriminate combinations with other matter; all I wish to infer from the reasoning offered on this subject, is that the intelligent spirit or soul of man is indestructible.\n\nNote 7. I wish, now, to call the reader's attention to the ingenious and profound researches of Mr. Cuvier in geology. It appears that as the result of these researches, he comes to the conclusion, \"that if any thing be proved by the geology of the Earth, it is, that a great revolution took place on it from 5 to 6,000 years ago,\" antecedent too, to the existence of man on those parts at least, of the Earth, for he is said to have proved, that no vestige or organic remains of the human species has ever been discovered, among the remains of the other animals found among the strata or deposits he treats of.\n\nThe period at which he states, this revolution to have taken place, agrees very nearly with the\nscriptural account of Creation. We know, therefore, that man then existed, in some parts of the Earth, though he had not spread over much of its surface. We have, in concurrence of the opinion of this great revolution, Plato's account of his Atalanta, supposed to be the extent now covered by the Atlantic ocean, which, according to Plato's opinion, was formerly dry land.\n\nThat it is possible such revolutions may have taken place since the Creation, is not to be doubted. The oceans may, in the course of time, have worn away those boundaries that had prevented their overflowing extensive tracts of the Earth, or the power of earthquakes, or volcanic fire may have produced a disruption and carried away the barriers of the ocean. It is, however, to be observed, that it is singular this opinion of Cuvier's is not supported by any account in the scriptures. Had such a great convulsion taken place soon after the Creation, is it not probable some oral tradition would have reached the time of Moses, or other scriptural writers, just as we have handed down to us the account of the deluge of Noah?\n\nIt were to be wished, therefore, this eminent Geologist had turned his attention to the waters of Genesis; as, I cannot but think, he would have therein found a more plain and easy solution of the phenomena he has so ably developed. The one mile of strata containing the remains on which he treats would, probably, have been deposited by these waters in a very limited period, previous to the separation of those waters of Genesis, which would satisfactorily account for the non-appearance\nof any organic remains of the human species in these strata, because, it had not at that period been yet created, and it would equally well account for those fossil and organic remains of the marine animals he had found in those strata, and the vast period of time, namely, millions of years, he and the other late geologists conceive these strata have required for formation, would be also accounted for.\n\nIn fine, there is good and powerful reason to believe the account of Creation must have been delivered to Moses by divine inspiration. It is not likely, that he of his own ideas, or even from any traditionary account could, in those times, have possessed that extension of thought, that would have enabled him to frame such a system, or to form the conception that the Earth was produced in a globe of water.\n\nThat it has been so formed, has not been discovered by science until the present day, nigh 6,000 years after its separation from those waters; and as I have said in the body of this work, we have no historical account of any but the waters of Genesis, to which we can refer the phenomena of the Earth, so I trust to have proved, that the best discoveries in geology and pneumatics are calculated to shew the real and necessary existence of those waters, and to add new forces to the authenticity and authority of the holy scriptures.\n\nIt is, moreover, to be observed, that Cuvier gives us no scale, by which he has decided on the time of this revolution to have been 5 or 6,000 years; and it is very difficult to conceive what data he could have. The time taken by rivers or lakes to\nform deposits of a known thickness would avail him nothing, as their power of deposition could not be compared to that of a deluge. May it not, therefore, be possible that the revolution he refers to, may have been that of the deluge of Noah in parts of the Earth not inhabited by the human species.\n\nNote 8. It is said, indeed, by philosophers, that a body once put in motion, if all resistance to it were taken away, that the body would continue to move in its course forever; that is a case, however, which never can be proved by actual experiment, and it must rest solely on the opinion or arguments of those philosophers.\n\nIf, however, the above supposition of perpetual motion of bodies moving in a vacuum be founded in nature, and that the heavenly bodies are made to move in a vacuum, to obtain the object of perpetual motion; we may, in addition to what we have observed in Note 5, on the subject of universal attraction to an unknown centre, remark, that this universal attraction, (supposing our theory of the regions of space being filled with æriform medii to be correct) may be the cause which prevents the diminution of the projectile force in the courses of those heavenly bodies through those æriform medii.\n\nNote 9. It is true, that only some of the earths and none of the metals have yet been decomposed, and are therefore considered as simple substances. Carbo, however, which would appear to be the\nchiefly solidifying principle of the vegetative process, is well known to be susceptible of receiving the gaseous state by combination with oxygen into carbonic acid gas. If any method should ever be discovered of separating the oxygen from this carbonic acid gas, the carbon would be found again in its solid state. Chlorine gas also, when united with hydrogen by congelation, is found by a late discovery to assume the solid state, in the shape of crystals more than one inch long. This modern experiment is of great importance, as it proves that two gaseous bodies can, by their combination, form a solid one.\n\nAs I have often repeated, also, in the body of this work, and in these Notes, all the metallic oxyds and several of the earths and alkalies must contain a great quantity of oxygen in a solid state.\n\nThe most dense nature of bodies, therefore, is no proof that they may not be composed of æriform substance, and a vast and most important field of discovery is, probably, yet reserved for pneumatic chemistry, namely, the separation of the gasses from the calorific, and the light which retains them in that form, and the obtaining their bases in the solid state. As a proof of the vast importance of such a discovery, we now suggest, that the nutritive parts of the vegetable and animal kingdom must be composed (if our theory in the foregoing work be well founded,) of the solid bases of those gasses; the discovery, therefore, of obtaining these bases separate from their heat and light, may possibly offer a mode of forming nutritive matter not yet known to mankind.\nNote 10. Thus, by our construction of the 1st verse of Genesis, it would appear that the present actual state of the geological bodies, their frequent crystallization and their gradual depositions in strata and laminae, can be reconciled to the scriptural account. That crystallization and these strata and laminae must, according to the evidence of our senses, have required numerous ages for their formation and deposition. By the supposition that the time of the 1st verse was antecedent to the six days of the separation, the time required for these depositions is obtained, and they are satisfactorily accounted for; and also their having the appearance of gradual deposition which they present to us. As it would appear, therefore, by our theory, that the Creator has formed the Earth by these natural laws we find everywhere established, we shall now with humility suggest, that the true meaning of the 4th commandment is, that in six days the Lord prepared the Earth.\n\nNote 11. Having just now obtained a sight of the late publication of Lord Brougham of last year, 1835, I here subjoin an extract from it, describing the late discoveries of Fossil remains by Cuvier, Buckland, and other Geologists, to which I add some observations bearing on the relation of these facts to our theory of creation. In page 33 of his work, Lord Brougham observes, \"the discoveries already made in this branch of science, (Geology) are truly wonderful, and they proceed on the strictest rules of induction. It is shewn, that animals formerly existed on the globe, being unknown varieties of\nspecies still known; but it also appears that species existed, and even genera wholly unknown, for the last five thousand years. These peopled the Earth as it was, not only before the general Deluge, but before some convulsion, long prior to that event, had overwhelmed the countries then dry, and raised others from the bottom of the sea. In these curious enquiries, we are conversant, not merely with the world before the Flood, but with a world which, before the Flood, was covered with water; and which in far earlier ages, had been the habitation of birds and beasts and reptiles. We are carried as it were, several worlds back, and we reach a period, when all was water and slime, and mud, and the waste without either man or plants, gave resting place to enormous beasts like Lions and Elephants, and River Horses, while the water was tenanted by Lizards, the size of a whale, sixty or seventy feet long, and by others, with huge eyes, having shields of solid bone to protect them, and glaring from a neck ten feet in length; and the air was darkened by flying reptiles, covered with scales, opening like the jaws of the crocodile, and expanding wings, armed at the tips with the claws of the Leopard. No less strange, and yet no less proceeding from induction, are the discoveries made respecting the former state of the earth; the manner in which these animals, whether of known or unknown tribes, occupied it; and the period when, or at least the way in which they ceased to exist.—Professor Buckland has demonstrated the identity with the Hyenas, of the animal's habits that cracked the bones which fill some of the caves, in order to\ncome at the marrow; but he has also satisfactorily shewn, that it inhabited the neighbourhood, and must have been suddenly exterminated by drowning. His researches have been conducted by experiments with living animals, as well as by observations on the fossil remains.\"\n\nI have now to observe; it is to be regretted that the geographical position of these discoveries is not mentioned by his Lordship. If they had been found in the vicinity of the countries inhabited before the Flood, by Noah or his ancestors, it is singular that no written or oral tradition is given (at least that I am aware of) by Noah or his descendants, of this convulsion before the Flood. \"We reach a period, says his Lordship, when all was water and slime and mud, and the waste, without either man or plants gave resting place to enormous beasts &c.\" If this period of time therefore, is to be supposed as having been between the Creation and the Flood, it must probably have taken place in a part of the world very remote from the country inhabited by Adam or his descendants, before the Flood, and if there were as is stated \"no plants\" growing in these resting places for these \"enormous beasts like Lions and Elephants and river Horses,\" whence did these animals get their subsistence? If no subsistence were prepared for them in these resting places in the land, is it not probable these \"enormous beasts\" may have been marine or amphibious? I must therefore, say, that the circumstance of their being no tradition handed down to us by Noah or his descendants, of so great an event as this convulsion, coupled with the fact, admitted by the Geologists\nwho have narrated these discoveries, that \"no plants\" are found to have existed in these \"resting places for the nutriment of these enormous beasts;\" (for allowing them to have been animals of prey, the animals they devoured must have had means of sustenance from the productions of the earth,) therefore, these two circumstances, of no tradition of this convulsion and \"no plants,\" would seem to warrant the opinion that these skeletons or organic remains, were those of marine animals which had been deposited at their death more or less below the present surface of the earth from the waters of Genesis, according to the Theory of Creation before the time of the separation of the waters, as recorded in the first chapter and 9th verse of Genesis, when God said, \"let the waters under the Heavens be gathered together into one place, and let the dry land appear; and it was so.\"\n\nAs to the flying serpents, by the account itself they appear to have been marine inhabitants of the waters; and for the same reason that applies to the \"enormous beasts\" that \"no plants\" have been found in those resting places; so the \"birds\" mentioned in the above account must probably, have been marine or aquatic also, and have existed as above before the separation of waters at the 6 days of the creation.\n\nThere are, therefore, three facts taken from the statements and discoveries of Dr. Buckland and the other modern Geologists, which come in support of the idea mentioned above, that the \"organic remains were those of marine animals which had been deposited at their death more or less below\nthe present surface of the Earth from the waters of Genesis, before the time of the separation of the waters, as there recorded.\n\nThe first fact is, that we have no tradition from Noah or his descendants of this great convulsion of Nature, which is said by these Geologists to have taken place before the Flood.\n\nThe second fact is, that by the accounts of these Geologists, no organic remains of the body of man have been found with those of other animals.\n\nThe third fact is, that no remains of any plants have been found among those other remains.\n\nOn the first fact we shall observe, that it is remarkable the time stated by Cuvier that this \"convulsion\" took place, agrees very nearly with the time of the separation of the land from the waters recorded in Genesis, namely, between 5 and 6000 years ago. The effects of this convulsion we may suppose to have been general over the greatest part of the Earth; therefore, had it taken place since the Creation, is it not equally probable so great an event would have been handed down to us by tradition, as that of the universal Deluge has been? On this fact I have further to observe, that if we consider this convulsion to have taken place previous to or rather at the time of the separation of the waters, we shall probably find it much more easily accounted for, and because the 9th verse of 1st chap. of Genesis says, \"And God said, Let the Waters under the Heavens be gathered together unto one place, and let the Dry Land appear; and it was so.\"\n\nNow, the effects even of the Deluge in the time\nof Noah are, I believe, generally allowed to have made great changes on the face of the Earth. The effects even of common inundations which have taken place and been recorded in history, have also had the same visible effects. Is it not therefore probable that the effects of the mighty rush of waters from, over, and all round the Earth at the time of the separation, must have had a corresponding effect, and produced the convulsion described by the Geologists? and is not this effect the more likely, from the circumstance that the land must, at this period, have been in a soft and humid state, probably through its entire diameter?\n\nOn the second fact I observe, that the circumstance of no organic remains of the human species being discovered among the other fossil remains, will be completely accounted for by supposing, as above said, that the \"convulsion took place at the time of the separation of the waters of Genesis,\" since Man was not as yet created.\n\nThe third fact, \"that no remains of plants have been found,\" appears to me almost confirmative of the above suppositions; that these organic remains were produced before the separation, and deposited from the waters of Genesis; since, had this convulsion have happened since that separation, and these organic remains been in existence on the land, there must have been plants grown for their nourishment; and moreover, it is stated by Dr. Buckland, in his account of these remains, (as may be seen in the Quarterly Review of April, 1836,) that the far greater part of the organic or fossil remains of the secondary formations are marine.\nThe remains of terrestrial quadrupeds or other terrestrial species have of course been formed since the separation. I cannot, therefore, but be of opinion, that the geological facts described by the modern Geologists, at least as respects marine remains, will be more satisfactorily explained by the theory we have endeavoured to establish in the foregoing treatise. That the necessity of supposing that the Earth, since the separation, is more ancient than is stated by the Mosaic account, will be thus avoided, and that this Mosaic account can be thus maintained in its integrity; and I am glad to observe that Dr. Buckland has acceded to the construction of the 1st verse of Genesis, adopted by Dr. Pusey and others, as will be seen by the extract on the preface to this work.\n\nTo conclude, whether this great convulsion of nature were really one that took place since the creation, and produced the overflow of an extent of country formerly inhabited by the animals above described, and which has since then become dry land again; whether, I say, such a convulsion has taken place since the creation or not, it does not at all affect the validity of the Theory of Creation which is now offered to the world; for this theory refers alone to the primeval formation of the entire circumference and diameter of the earth, and is therefore antecedent to any partial convulsion that may have, since that formation, taken place.\n\nI now conclude this Note with a few observations in support of the formation of the Geological bodies in the primeval oceans, drawn from the depositions\nof matter and consequent formations of land which must be continually taking place in our present seas.\n\nIn the space of two or three miles in the harbor of Halifax, N.S., I have seen thousands of cart loads of kelp or sea weed collected from the shore in a season, and it is probably thrown up in the same quantities all along the sea coast of America.\n\nIn Scotland, great quantities are burnt to extract its saline matter; as also in Spain and Portugal. What must be the quantity, therefore, that annually decay and is deposited at the bottom of the ocean. In addition to this are the immense formations of coral beds; the still more immense depositions of shells, and the remains of the different animals of the seas. These depositions are probably conglomerated by the sand and earthy particles brought down by the rivers and abraded from coasts by the tides and storms. These masses must be continually augmenting, and in due course of time will probably greatly augment the proportion of land. The waters of our oceans and seas (for a vast quantity is constantly consumed in the nourishment of the marine plants) must, on the other hand, be continually diminishing; and although, if I recollect aright, Dr. Paley states in his Evidences of Natural religion, that all the evaporations return by the rains; I think it is easy to prove that not to be the case, for an immense proportion of the rains is consumed in the nourishment of terrestrial vegetables & by animal life: a large proportion of vapour is also desolved by the air, and probably decomposed by the electric fluid into its gasses. This continual increase of land and\ndiminution of the waters of the Earth, must it not, in the course of sufficient ages, greatly alter its specific gravity? What effect this may have on the Earth's relative attraction with the other heavenly bodies, I leave to astronomers to determine. But it is, I conceive, possible, that a change in the degree of its attraction may be the means by which the dissolution foretold in the scriptures may be ultimately brought to pass; and it may be also possible, that the design of a Benevolent Creator, in making the proportion of water so much greater than the land, has been, to retard this dissolution for numerous ages.\n\nIf, therefore, our present seas do continually tend to the formation of land by the decay and deposition of their productions; if the natural effects of the laws of nature have led me to form a just conception that the Creator may have chosen the means stated in the foregoing theory by which to form our Earth, we are certain those means were made competent to that end, and that it is therefore probable, vegetable and animal life were diffused in far greater abundance in these primeval waters than in our present oceans.\n\nThe processes of vegetation and of animalization, therefore, we have assumed from the facts and geological appearances stated in the foregoing work to have been the means or machinery employed by the Creator in the \"beginning\" to produce the land of our Earth, and by analogy the land in the other planets of our system. They have probably been thus produced and continued for a long period, in a soft and humid state, and numerous\nchanges and decompositions have since taken place in them by the effects of the internal heats and fires they have generated. To these causes, perhaps, may be imputed the earthquakes, volcanoes, and disruptions which have produced such inequalities in the surface, and to these internal fires I conceive may also be ascribed, these rocks having no appearance of stratification, they have probably lost the stratified state by the effects of those fires, or by the power of the electric fluid.\n\nNote 12. It may, perhaps, be objected to this idea of hydrogen, or other inflammable gasses, existing in the regions between the planets, to serve as fuel for the Sun's waste of light and heat, that such inflammable gasses, would, by taking fire from the electric fluid, endanger the safety of these planets.\n\nIt is, however, I believe allowed, that electricity pervades through all nature, and a vast quantity of hydrogen gas must be constantly exhaling in the decomposition of vegetables and animals; yet, no such effect is produced. In fact, lightning is never produced that I am aware of, in our atmosphere, but from clouds. Moisture seems therefore, indispensable for that end, and the hydrogen gas being thirteen times lighter than common air, must ascend far above the atmosphere.\n\nNote 13. By the experiments of celebrated chemists, and more particularly by the authority of Linnæus, we trust to have proved a considerable number of the primary earths and metals to be\nformed by the vegetative process of terrestrial vegetables. But, conceiving, according to the theory in the foregoing treatise, that it was the design of the Creator to produce the geological bodies by the instrumentality of the processes of vegetable and animal life, decay, death, and deposition, we may conceive also, that the marine vegetables of the universal waters of Genesis were endowed with much more various and abundant powers for the production of the geological bodies than we have even found in the terrestrial vegetables. This superior power of production would be necessary to produce the design intended, and the same remark will apply to the marine animals of those waters. (See the last paragraph of Note 4.)\n\nNote 14. The substances Iodine, Brome, and above all, Silicon, lately discovered, will probably ere long throw much light on the productive powers of marine substances by combustion. Iodine, at the heat of 212 becomes a violet-coloured gas. It forms an active acid by uniting to hydrogen. Brome is a dense liquid, and forms an orange-coloured gas by a gentle heat.\n\nSilicon is procured from Silica, or the earth of flints, by the action of potassium: it appears as a dark faun-coloured powder, which is inflammable, and which produces Silica or the \"sandy principle,\" by combustion. This Silica has been in a part of this Work proved the offspring of the vegetative process. It decomposes water and acids. And here, therefore, we have some insight into the means by which Nature has produced all the sands of the Earth and the rocks composed of siliceous matter.\nSodium, also, a metal lately discovered by Sir H. Davy, is obtained from Soda, the basis of common sea salt. This is, therefore, entirely a marine production. The Sodium is stated by Sir Humphrey to be so very combustible, that when thrown upon water it swims on its surface, hisses violently, and dissolves; and that Silica, or earth of flints, probably contains two proportions of oxygen and one of Silicon.\n\nAs a further proof of the production of siliceous earth, by the process of vegetation, we insert the following extract from Sir Humphrey Davy's admirable lectures on agricultural chemistry, in page 54, he says on the epidermis of plants, \"in the reeds, grasses, canes, and the plants having hollow stalks, it is of great use and is exceeding strong, and in the microscope seems composed of a kind of glassy net work, which is principally siliceous earth, and in the rattan the epidermis contains a sufficient quantity of flint to give light when struck by steel, or two pieces rubbed together produce sparks.\" It is known, also, that the silicified seeds of the chara, a plant which grows at the bottom of lakes, abound in the flints of Aurillac in France.\n\nThus it appears that the latest discoveries of the celebrated chemist Sir Humphrey Davy, confirm the existence of the siliceous earth in vegetables. In fine, having had an opportunity of perusing the best and most modern works on the geology of our Earth, I must here state that they serve to confirm my opinion stated in the theory of this work, that the processes of vegetation and animalization in the waters of Genesis, or universal ocean, are the\nmost highly, natural, and reasonable means, by which we can account for the original formation of the geological bodies; and that these having at that origin been deposited in horizontal strata, have in part, since been subjected to innumerable convulsions, elevations, and disruptions by the effects of internal fires, or the electric power, and consequently to great chemical changes in their component parts is beyond a doubt, and which the present appearance of almost every part of the crust of the Earth confirms. It is, therefore, probable, that a vast number of the rocks, metallic and mineral geological bodies may be combinations of the principles of vegetable and animal life deposited, as stated in our theory, which combinations have been effected by the internal fires or heats of the internal parts of the Earth, and the joint action of chemical affinities. In fine, the vegetable and animal kingdoms are already discovered by analysis to be reducible to the elementary principles oxygen, hydrogen, carbon, azote, and perhaps heat and electricity; and I think it probable, the mineral kingdom will, ere long, exhibit the same result. For who would have believed fifty years since, that from silica or the earth of flints, a combustible substance would be procured? producing silica or the sandy principle by its combustion, and consequent union with oxygen? and in fact, all the primary earths are now found to be oxyds containing oxygen as a component principle in a solid state.\n\nNote 15. It is true that Sir H. Davy states in page 12 of his lectures on agricultural chemistry,\nthat the result of Van Helmont's experiment was shewn to be fallacious; but that the true use of water was unknown till 1785, when Mr. Cavendish made the discovery, that it was a compound of two elastic gasses, inflammable gas or hydrogen, and vital gas or oxygen.\n\nNow, although Van Helmont was ignorant of this discovery, the fact he proved is still maintained, that water is the great source of nourishment of plants. In vain would any of the modern discoveries be brought forth to invalidate this great fact, since the vegetation of every part of the Earth demonstrates it. In the thickest and largest forests, in the aboriginal woods of the Earth, no sensible diminution of the soil is observable, though under the operation of so vast a vegetation; whence then can the products of it be obtained but from the surrounding elements water and air?\n\nIn fact, Sir Humphrey allows in page 211 of same work, that \"when pure water only is absorbed by the roots of plants, the fluid, in passing into the leaves, will probably have greater power to absorb carbonic acid from the atmosphere, when the water is saturated with carbonic acid gas, some of this substance may be given off by the leaves, but a part of it likewise is always decomposed, which has been proved by the experiments of M. Sennebier.\"\n\nNow, Carbo appears to be the great solidifying principle of vegetables. The other principles are found to be oxygen, hydrogen, and azote, all of which are obtainable by the vegetative process from water and the atmosphere. Accordingly in\npage 259 of the same work, Sir Humphrey states, \"It is evident, from the analysis of woody fibre, by M. M. Gray Lussac and Thenard, (which shows that it consists principally of the elements of water and carbon, the carbon being in larger quantities than in the other vegetable compounds) that any process, &c.\" Again he says, in page 211, \"Many plants that grow upon rocks or soils, containing no carbonic matter, can only be supposed to acquire their charcoal from the carbonic acid gas of the atmosphere; and the leaf may be considered at the same time as an organ of absorption, and an organ in which the sap may undergo different chemical changes.\"\n\nI shall here extract from the same work part of page 281, relating to the formation of the principles of vegetables by the vegetative process. M. Schrauder and Mr. Braconnot, from a series of distinct investigations, have arrived at the same conclusions. They state, \"that different seed sown in fine sand, sulphur, and metallic oxydes, and supplied only with atmospheric air and water, produced healthy plants, which, by analysis, yielded various earthy and saline matters, which either were not contained in the seeds, or the material in which they grew, or which were contained in much smaller quantities in the seed; and hence they conclude they must have been formed from air or water, in consequence of the agencies of the living organs of the plant.\" These experiments are therefore confirmative of that stated in the work performed by Van Helmont on the willow.\n\nIn page 282 Sir Humphrey gives an experiment\nhe made with oats to ascertain whether any siliceous earth would be formed in the process of vegetation, but he adds, \"the oats grew very feebly, and began to be yellow before any flowers formed, that the entire plants were burnt and their ashes compared with those from an equal number of grains of oats, less siliceous earth was given by the plants than by the grains, but their ashes yielded much more carbonate of lime. That there was less siliceous earth, I attribute to the circumstance of the husk of the oat being thrown off in germination, and this is the part which most abounds in silica.\"\n\nThus it appears by his own experiment, some silica was actually obtained by the vegetative process from the air and the water; and had the growth of the oats in his experiment come to perfection, the quantity would probably have been much greater. Moreover, in page 162, he allows that plants consume very small portions of earth; whence then can the trees of woods and forests derive their growth but from water and air?\n\nNote 16. The ratio of motion of the aqueous globes in their orbits, would no doubt have been infinitely less than their present ratio in their annual rotation. This ratio of velocity must have been precisely adapted to their density. Thus when first formed of water only, their ratio would have been at the lowest number. As they increased that density, by the gradual formation of earthy, metallic, and mineral substance, the ratio of motion would increase, until the entire formations of solid matter, existing at the time of the separation being.\ncompleted, these planets would then assume the ratio of rotation they now annually perform round the Sun.\n\nThe same increasing ratio may be inferred concerning the diurnal motion of the Earth and Planets.\n\nNote 17. I have here to observe, the opinion I had formed and stated, in the Theory of the Sun's Formation, of an æriform fluid or medium existing in the regions of space, has now been confirmed by the discovery of Enckes's Comet.\n\nIt appears the Newtonians had asserted, \"that either there was no such fluid, or that it was so thin and rarefied, that no phenomenon yet examined by philosophers was capable of betraying its effects.\" Vide p.151, Whewell's Bridgewater Treatise,1833, and same page it is said, \"But the facts which have led astronomers to the conviction that such a resisting medium really exists are certain circumstances occurring in the motion of a body revolving round the Sun, which is now usually called Enckes's Comet.\"\n\nIt appears this body was first seen in 1786, and that the effect of the resistance of the ethereal medium, from its first discovery, (in that year to the present time, say 1833) has been to diminish the time of revolution by about two days; and the Comet is ten days in advance of the place which it would have reached, if there had been no resistance. (See page 154 of Whewell's Bridgewater Treatise.)\n\nIt will be seen in my Theory of the Sun, that it\nwas on the idea I had formed of the existence of the æriform fluids, oxygen and hydrogen, in the regions of space, I had founded the mode by which I conceived the Sun's waste was replenished; and I have certainly reason to congratulate myself on the idea of the resisting medium being now confirmed by this singular discovery of Encke's Comet.\n\nThe Nebular hypothesis also appears to me to confirm or support both the theory of the combustion of the gasses which I have ventured to propose as the origin of our Earth and Planets, and also the cause and formation of new heavenly bodies by the products of the combustion of the gasses for the replenishment of the Sun's waste of light and heat, as stated in page 57 of this work.\n\nThis Nebular hypothesis is thus introduced by Mr. Whewell in his Bridgewater Treatise of 1833, page 143:\n\n\"La Place conjectures, that in the original condition of the solar system, the Sun revolved upon his axis, surrounded by an atmosphere, which, in virtue of an excessive heat, extended far beyond the orbits of all the Planets, the Planets as yet having no existence. The heat gradually diminished, and as the solar atmosphere contracted by cooling, the rapidity of its rotation increased by the laws of rotatory motion, and an exterior zone of vapour was detached from the rest, the central attraction being no longer able to overcome the increased centrifugal force. This zone of vapour might in some cases retain its form as we see it in Saturn's ring, but more usually the ring of vapour would break into several masses, and then would generally co-\nalesce into one mass, which would revolve about the Sun. Such portions of the solar atmosphere abandoned successively at different periods would form 'Planets in the state of vapour.'\n\nNow, it does not appear that La Place has given any clue to find how or of what this solar atmosphere and vapours were formed. He does, indeed, support the idea, that Planets may be formed by vapour and subsequent condensation, which is precisely the way the oceanic globes of our theory are conceived to have been produced;—And without infringing on the humility we wish to preserve, we may say we have presented to his consideration a real and competent cause for the production of the atmosphere and vapours of his ingenious hypothesis.\n\nThe combustion of the gasses, of which we all now know water to be formed, as stated in p. 24 of this work, and the extrication of their heat and light, will they not only account for this solar atmosphere, but also the means by which the Great First Cause produced the Sun himself?\n\nCONCLUSION.\n\nIn the contemplation of the wonderful discoveries in pneumatic chemistry, of the gaseous bodies, and peculiarly so of the component principles of water, I have conceived the formation of the waters of Genesis to have been produced from these elementary principles, by the creating cause at \"the beginning;\" but have, in the foregoing treatise abstained,\nfor reasons stated at the end of page 70, from carrying my speculations onward to the other systems of the heavenly bodies, further than reasoning from analogy, that they may have been formed by the same laws. In this Note, however, in conclusion of this work, I purpose to offer some observations on this subject, as a comment on the 6th and 7th verses of 1st of Genesis. \"And God said let there be a firmament in the midst of the waters, and let it divide the waters from the waters; and God made the firmament and divided the waters which were under the firmament from the waters which were above the firmament, and it was so.\"\n\nThese verses lead us to believe, that a Universal Ocean of waters existed over the heavens, and covering every part of them. If, therefore, our theory of the primary formation of our earth and planets in globes of water, be founded in the laws of nature, may we not conceive, that the planets of the other systems of the universe have also been, or will be, formed in this universal ocean by the same laws? If the appearance in the geology of the earth have led us to believe that at the time of the separation, when the solid parts of it had been duly formed, they were, in obedience to the divine command, (probably by the instrumentality of the law of their superior gravity,) were then separated from this universal ocean, attracting such parts of it as were within the sphere of the attraction of these solid parts, for the formation of their seas and oceans; and that these planets, then receiving from the Creator their projectile force, became immediately subject to their motions round their\ncentral Sun, may we not, by analogy, also, conceive, that the planets of the other systems have been, or will be formed by the same laws? The Suns of these systems or Stars, as they are commonly called, must indeed, have existed from the \"beginning\" of the 1st verse, at the time of the Creation of the waters of the Universal Ocean, by the combustion of the elementary gasses of their composition. Very few of the Planets of these systems have, I believe, been yet discovered. This may be owing to their immense distance; but may it not also arise from their not being yet duly formed, and evolved from the waters of this Universal Ocean? and does not the almost annual discovery of new heavenly bodies warrant the supposition?\n\nWith deep humility, therefore, I venture to call the attention of philosophical divines and others, to the more extensive and profound contemplation of the Universal Ocean recorded in the 6th and 7th verses of the 9th chap. of Genesis. The late discoveries in Geology and Pneumatics, in application to this subject, appeal strongly to this contemplation. The unity of the laws of Providence, would almost, compel us to believe, that all the Planetary systems have, or will be formed in the same manner; and carrying with us the highest degrees of our knowledge of these laws into the contemplation of the works of the Creator, we may, perhaps, find that it will afford to us an insight into His Power, Wisdom, and Glory, far more stupendous than mankind have yet conceived.\n### TABLE OF GEOLOGICAL FORMATIONS IN THE ORDER OF THEIR SUPERPOSITION, BY M. AL. DE HUMBOLDT.\n\n| Alluvial deposits. | Tertiary formations. |\n|-------------------|---------------------|\n| Limestone formation, with millstone (meulieres). | |\n| Sandstone and sand of Fontainebleau. | |\n| Gypsum with bones. Siliceous Limestone. | |\n| Coarse Limestone. (Clay of London.) | |\n| Tertiary sandstone, with lignites (brown coal). | |\n| Plastic clay. Molasse. Nagelfluhe. | |\n\n| Chalk, { white, soft [tuffeau] chloritic. | Ananchites. |\n| Green Sand. | |\n| Wead clay. Secondary limestone with lignites. | |\n| Ferruginous sand. | |\n\n| Ammonites Limestone of Jura. Planulites. | Slaty beds with fish and crustacea. Coral rag. Dive clay. Oolites and Caer Limestone. Marly or calcareous lias, with *gryphaea arcuata*. |\n| Quadersandstein, or white sand stone, sometimes above the lias. | |\n| Muschelkalk. Ammonites nodosus. | |\n| Marls with fibrous gypsum Arenaculous layers. | Saliferous variegated sandstone. |\n| Product. aculeat. Magnesian Limestone. Zechstein. Coppery slate | Alpine limestone. |\n\n| Quartziferous porphyry. | Co-ordinate formations of porphyry, red sand stone, and coal. |\n\n**Transition formations.**\n\nSlates with Lydian stone, greywacke, diorites, euphotides Limestone with orthoceratites, trilobites, and evomphalites.\n\n**Primitive Formations.**\n\nClayey slates [Thonschiefer] Mica slates Gneiss Granites\nINDEX.\n\nPREFACE; containing an Extract from the Review of Dr. Buckland's Bridgewater Treatise, 1836, 3 to 7\nSome account of the Author .................. 9\nInsufficiency of the Chaotic system of the ancients to account for the Geological appearances of the Earth ........................................... 10\nFormation of the Earth's salts & Metals by the Vegetative Process............................ ib.\nOur Earth formed in a Fluid..................... 11\nObservation on the supposition or Theory of Buffon, of formation of the Earth and Planets.. 12\nOn the opinions of Chance, or Atheism, to account for the Productions of our Globe........ 14\nObservations on the Doctrine of the Materiality of the Soul........................................ 18\nThe Ourang Outang............................... 19\nInstance of the separate existence of mind from body in this World.............................. 21\nThe construction of the first verse of Genesis on which this work is founded............... 22 & 23\nDiscoveries of Black, Priestly and Lavoisier... 23\nComponent Principles of all Water, Oxygen & Hydrogen ........................................... 24\nThe Combustion of the Gasses at the Beginning produced the universal waters of Genesis.... ib.\nThe aqueous Globes formed by laws of attraction. ib.\nAccount of Marine Productions by Baron Cuvier 25\nEvery part of the Earth gives evidences of formation in a fluid................................. ib.\nCause assigned for non-appear of Marine Remains in the summits .................. 26\nCause of formation of Peat Earth and Morasses .. 27\nOrder and succession of Rock and Organic Re-\nmains composing crust of the Earth .... 27 & 30\nAlso from the Lands End to the vicinity of London. 30\nCause assigned for Lime Stone & Coal formations. 30\nCause of Marine Productions being found above\nthe level of the sea to be sought in the original\nformations in the waters of Genesis .......... 31\nObservations on the construction of the meaning\nof 1st verse of Genesis of this work ........... ib.\nThe aqueous Globes endowed probably with ama-\nzing prolific powers of life .................. 33\nResults of the Analysis of vegetables by Chaptal .. 34\nOxygen exists in a solid state in all the oxyds .. 36\nThe Earths Metals and Minerals found in vege-\ntables are products of the vegetable process ... ib.\nThe variety in the proportions of the primary ele-\nments probably the cause of the distinctive cha-\nracter of Metals and Minerals ................ 37\nSiliceous Earth proved by Professor Linnæus to\nbe the result of the vegetative process ........ 37\nThe conclusion arrived at that the Geological bo-\ndies have been formed in the waters of Genesis. 39\nCause of the depressions of the Earth forming\nthe beds of the original Oceans .............. 40\nCause of the Creation of Marine Plants not being\nmentioned in Genesis ......................... ib.\nTheory of the Sun’s formation .................. 42\nRemarks on Buffon’s Theory of the Earth and\nPlants ........................................... ib.\nHeat and Light .................................. 43\nFormation of the other Planets of our system and\ntheir moons drawn from analogy ............. 46\nAttraction of Matter ........................................... 48\nObservations on the hitherto received idea of a vacuum .................................................. 51\nAn idea on the cause of the projectile force .... 52\nCopper in Isle of Anglesea, Load Stone, &c. ib.\nAttraction of the sun ............................................. 50\nAnswer to Archdeacon Paley's question on the stream of particles flowing towards the sun ... 55\nFormation of watery vapours by the Sun ........ 57\nHow the motions of the Heavenly bodies may not be destroyed by the existence of æriform fluid in space .................................................. 58\nThe existence of æriform fluids in the regions of space may throw great light on the Sun's attraction .................................................. 61\nDissolution of our Earth as announced by scripture .................................................. ib.\nThe discoveries of Pneumatic Chemistry as applied thereto ........................................... 62\nMarine Animals of the waters of Genesis ........ 64\nProbably final Elements of the Geological Bodies. 65\nDecomposition of the Earthy Mineral and Metallic substances by Heat Chemical Affinity or Electricity .................................................. ib.\nThe Dissolution of the Globe considered from its existing Phenomena .................................. 67\nRecombination of the separated Elements to form New Heavenly Bodies ......................... 68\nThe Immortality of the Soul of Man drawn as a conclusion from the Indestructibility of the Laws of Nature .................................................. 70\nThe other systems supposed by Analogy to have been formed by the same Laws as our system ib.\nAn idea of the formation of new Planets by the combustion of the Gasses serving as Fuel to the Sun 71\nINDEX TO THE NOTES.\n\nNote 1. The Offspring of a single Herring undisturbed competent to produce ten of our Globes........................................... 74\n\nNote 2. On the Granite Mass—Formed like the secondary and Tertiary Strata by the deposition of Vegetable and Animal Matter............. ib.\n\nAll traces of Shells and Organic Remains may be destroyed by Heat in Rocks proved by Watt and Lyall.................................................. 76\n\nRev. Mr. Fairholme's opinions on the Granite Mass answered.................................................... ib.\n\nOpinion of the Reverend Sharon Turner on the Mosaic Cosmogony and observations of the Author....................................................... 77\n\nObservations on Cuvier's last Revolution on the Globe extended.................................................. ib.\n\nOn the supposed Antiquity of Mount Etna .. 77 & 79\n\nNote 3. Salt Formations.................................................. 80\n\nNote 4. Further remarks on Buffon's system.. 81\n\nObservations in support of the Theory of Creation of this work.................................................. 82\n\nDeduction from the probable powers of deposition of the Waters of Genesis that more Land yet remains to be discovered on the Globe........... ib.\n\nNote 5. On the power of resistance of the aeriform Medii of our Theory................................. ib.\n\nAttraction of all the Heavenly Bodies to one common Centre.................................................. 83\n\nAn idea of the cause of the Projectile Force..... ib.\n\nNote 6. The Indestructibility of the soul explained.............................................................. 84\n\nNote 7. Observations on Cuvier's last Revolution ib.\nThe late Discoveries in Geology ascribing millions of years, as the age of the World, accounted for by the Theory of this Work........... 87\n\nNote 8. Cause assigned as a preventative of diminution of the Projectile Force........... ib.\n\nNote 9. Two Gaseous Bodies rendered solid by Congelation.......................... 88\n\nA vast and important Field of Discovery pointed out in Pneumatic Chemistry........... ib.\n\nNote 10. The present state of Geology reconciled to the Scriptural account of Creation.... 89\n\nNote 11. Extract from the late work of Lord Brougham on the new discoveries in Geology ib.\n\nObservations thereon.......................... 91\n\nThree facts deduced therefrom, maintaining the integrity of the Mosiac account........... 92 to 96\n\nSome observations in support of the formation of the Geological Bodies in the primeval Oceans drawn from the depositions and formations now taking place in our Seas.................. ib.\n\nCause assigned for the constant diminution of water in our Oceans.......................... ib.\n\nPossible design of the Deity in making the proportion of water on the Earth so much greater than the Land.......................... 97\n\nMany rocks have lost their original stratified state by internal fires and electricity........... 98\n\nNote 12. Reasons shewn why Hydrogen Gas may exist in the Regions of Space without Ignition.................................. ib.\n\nNote 13. The Marine Vegetables of the universal waters were endowed with more abundant powers of production than the Vegetables of our Earth.......................... 99\n\nNote 14. Iodine, Brome, Silicon and Sodium.. ib.\nExtract from Sir H. Davy's Lectures on the existence of Silica in Vegetables .......... 100\nNote 15. Experiments of Schrader and Braconnot, proving that the earthy and saline matters of vegetables are formed from air and water .... 103\nExperiment of Sir H. Davy proving the formation of silica in vegetables ............. 104\nNote 16. Ratio of motion of the Aqueous Globes according to their increasing density ....... ib.\nNote 17. Enckes's Comet from Whewell's Bridgewater Treatise support the Theory of æriform medii of this work ............... 105\nThe Nebular Hypothesis from do ............. 106\nSupports the formation of Planets in a state of vapour, on which our Theory of their formation in this work is founded ............... 107\nThe products of the Combustion of the Gasses to form the Planets proposed as a cause of his solar atmosphere, and as the cause of the Sun's formation at the beginning ............... ib.\nCONCLUSION ........................................ ib.\nComment on the 6th and 7th verses of Genesis .......... 108\n\nMem.—The 21st and 22nd lines in page 30 transposed.\nIn page 54, for \"Neap and Daily Tides,\" read \"Spring, Neap, and Daily Tides.\"\nA GLOSSARY OF TERMS IN THIS WORK.\n\nGeology, the Science of the various substances forming the interior and the crust of the Earth.\n\nPneumatic Chemistry or Pneumatics, the Science of aeriform bodies.\n\nCaloric, matter of heat prevailing all bodies.\n\nCarbonic Acid, the acid of charcoal formed by burning it in open air. It escapes in an aeriform state.\n\nOxygen Gas, a constituent element of our atmosphere, supporting combustion and life in the highest degree. It is, also, a constituent element of water. (Vide page of 23 this work.)\n\nHydrogen, a constituent element of all water, it is called also inflammable air or gas, and is the same that is now used for lighting cities and inflating balloons.\n\nAzote and Azotic Gas, a constituent principle of our atmosphere, destructive to combustion and to animal life. (Vide page 23.)\n\nTertiary Strata, in Geology the strata or formation of the Earth as far as man has penetrated, are divided into three, the Primary being the lowest—Secondary being next—Tertiary being the uppermost.\n\nSulphuric Acid, common Oil of Vitriol.\n\nVacuum, a space void of matter of any kind, now known not to exist. (Vide page 52 to 61, and Note 17.)\n\nAeriform Fluids, gasses or fluids resembling common air.\n\nPlanets, the heavenly bodies composing our system and revolving round our Sun.\n\nAttraction, that power in matter by which it continually tends to gravitate towards other bodies, according to the laws of its density and distance.\n\nSilex, siliceous or sandy principle.\n\nAlumine, pure earth or clay.\n\nLaminae, the appearance of many rocks in the Earth resembling the leaves of a book. [Earth.\n\nFossil Remains, of animals or vegetables found in the\nINTRODUCTION.\n\nTO THE THIRD EDITION.\n\nSince the publication of the second edition of this work, I have found that the celebrated Hutton, as is stated by Keith, was of opinion, that all the geological bodies of the earth, had been formed by \"marine exuviae or remains.\" It is satisfactory to have this part of the theory of the earth, which, previous to my seeing this opinion, I had formed and presented to the world, sanctioned by so great an authority.\n\nBut Hutton's Theory of the Earth, being adverse to the Mosaic account of the creation, he drew upon himself much obloquy from the supporters of it; and it is to be lamented that a due consideration of the first verse of Genesis had not occurred to him; as, most probably, his sagacious mind would have discovered, how completely the explanation we have in our theory given of that verse, will give the length of time which, in the opinion of many geologists, the various formations of the globe require.\n\nMany of the modern geologists, however, who had published their works previous to the Rev. Dr. Buckland's Bridgewater Treatise, in which the above construction of the first verse of Genesis is assumed, or who, having not yet sufficiently contemplated that construction, so as to adopt it themselves, and, probably, not willing to come into collision with the sacred writings; these geologists, I say, have now abandoned\nthe practice of forming any theory of the earth at all, and limit themselves to the collection of geological facts. Now, it appears to me, that if, on a due consideration of the facts which botany, chemistry, pneumatics and geology present us with, it be conceived, that by a just combination of these facts, we can by fair induction and analogy, gain an insight into the most mysterious operations of Nature, and the laws which its omnipotent Creator may have established for these operations; there is then no just cause why such a combination of these scientific facts should not be attempted; there is no just reason why the human mind should be fettered in the profoundly interesting science of Cosmogony more than in any other. There is not, perhaps, in the vast range of Nature's works, one which excites in the mind a greater degree of mysterious wonder, than the inspection of the rocky formations of the earth. The perfect order in the movement of the heavenly bodies, their surprising distances and magnitudes, it is true, are of a more grand and sublime description; but the rocky formations belong to our own domain, and however some may call in question the vast distances and magnitudes of the heavenly bodies, yet, of the enormous depths, breadths, and lengths of the formations of our earth, we have the direct evidences of sight and touch.\n\nWhat are the agencies by which the Creator has formed these mysterious productions, is therefore the silent question which every close observer of nature asks himself. And, accordingly, numerous theories, not only of the crust of the earth, but of the earth itself, have long since been offered to mankind. Many of these, however, being founded only on the imaginative\nconceptions of ingenious men, have not maintained their ground. None of them, I believe, but Hutton, as before mentioned, and a few of the German geologists have offered any tangible mode of formation which the Deity may have chosen, for the production of the entire body of the geological formations of the earth.\n\nIn the first paragraph of the preface to the first edition of this work, I have stated that my object in forming my construction of the first verse of Genesis, was, to be enabled to reconcile the Mosaic account of creation with the time said by the modern geologists to be required for these formations—having done this, my next wish was to inquire what physical laws the Creator had chosen to produce them. By physical laws they are undoubtedly formed, as far as we have access to examine them; and we have the powerful sanction of every part of nature, to conclude by analogy that the entire diameter of the globe is equally so. By the 6th, 7th, and 9th verses of the 1st of Genesis, we find the earth was covered by the waters until the time of the separation. We have therefore just right to conclude it was formed in those waters of Genesis, and, accordingly, as stated by one of the best modern geologists—\"Every part of the earth, every continent and every island exhibits the phenomenon of marine productions.\"\n\nOur theory is founded on these scriptural and geological facts; and we have a confirmation of the competent powers of the vegetable and animal deposits and labours of the marine animals of the ocean to produce these formations of the earth, in the known and established fact, of an extent of land more than equal to one-eighth of the diameter of the earth, being formed\nby a few species of marine insects, for the Coral Islands and reefs of the Indian Sea and Pacific Ocean are 1,500 miles long by 60 or 70 broad.\n\nIn the course of my journeys through this province, to offer my works for sale, I am happy to state, that a great majority of the people appeared to be duly impressed with a belief in the sacred scriptures; indeed I have met with some who seemed to think the Mosaic account of creation required no support. These were, however, generally persons unacquainted with the authenticated geological facts. It is unquestionable that many of the formations have been produced by gradual deposition from the waters; and must have required a period for that deposition immensely greater than that since the creation, being near 6,000 years.\n\nSome modern geologists claim indeed millions of years for these formations of the crust of the earth; and, we trust, we can thoroughly satisfy these claims by the construction of the 1st verse of Genesis, now sanctioned by the eminent writers mentioned in the preface to the first edition.\n\nWe trust also to have presented a palpable clue to the discovery of the mode in which it may have pleased the Deity to have constructed the solid machinery of our globe. The vastness of this machinery is indeed calculated to strike the mind with awful wonder, but it is his work, and, as such, a fair subject for the study and discussion of his creatures, as the more it is examined the more profoundly will be exhibited his bounty and his wisdom. We trust to have shewn, in note 5th, that the theory of the existence of animal life, previous to the secondary formations, is tenable, and, that the\nincandescence of the earth, as supposed by Dr. Buck-\nland, does not overthrow it; and, therefore, that we\nhave a right to say with a great modern geologist—\n\"That the causes at present in operation must have\nbeen producing the same effects in all preceding ages.\"\n\nWe conclude, therefore, that attempts to form a\nsystem of the creation, when based upon authenticated\nscientific facts, are allowable, and the more so, that\nin the present enlightened state of the world, these\nsystems can be duly examined and their merits deter-\nmined.\n\nWe have, in this edition, at the close of the theory\nof the sun's formation, given some account of Sir\nRichard Phillips' Theory of the Cause of the Motions\nof the Heavenly Bodies. This theory offers an addi-\ntional sanction to those stated, in the 17th note, in\nfavour of our theory of the existence of gaseous media\nin the regions of space. But we are by no means pre-\npared to join Sir Richard in his opinions against the\nNewtonian theory of gravitation and attraction. We\nconceive that these great laws of Nature may still\nexist, and that they may be reconcilable to, and be\nassisted by the gaseous media; and as we have shown\nin note 6.h of second edition, Sir Isaac Newton himself\nsuggests \"the existence of an etherial and gaseous\nmedium pervading all space;\" and, perhaps, the exist-\nence of this gaseous medium, would serve to show the\nphysical cause of these principles of attraction and\ngravity, and, thereby account for their effects.\n\nWe have also inserted extracts from Sir John Her-\nschell's Astronomy of last year, also sanctioning our\nidea of the supply of the sun's waste by gaseous mat-\nter; and it is with the greater satisfaction we give this\nextract from Sir John's work, that the late Doctor Herschell was of opinion that the sun might be habitable. Sir John has now declared his opinion, that \"the sun's zodiacal light is part of that medium which resists the motion of comets, and is loaded with the materials of the tails of millions of them which may be slowly subsiding into the sun.\" These materials must, of course, be gaseous; now the combustion of gaseous matter is nothing but the union of the base of the gas with that of oxygen gas, without which no combustion takes place, and the consequent extrication of the light and heat of this oxygen gas, by which we conclude, as per our theory, the waste of the sun's light and heat is replenished.\n\nAccordingly, Sir John, in another part of his work, states his opinion that there is \"an enormous heat in the sun.\" Dr. Herschell, his late father, says, that the sun's luminous atmosphere is only 2,500 miles from the sun's surface. That these admitted facts can be reconciled with his opinion of the sun being opaque and habitable, when under the influence of such enormous quantities of light and heat, appears to me totally contrary to all possibility.\n\nIn addition to these sanctions of the existence of an aeriform medium in the regions of infinite space, we have the great satisfaction to refer the reader to our extract from Dr. Graham's Elements of Chemistry of last year, where he will find that, from recent experiments of one of the most celebrated opticians and philosophers of the present day, Sir David Brewster, he concludes that the \"sun's atmosphere must contain gaseous matter.\"\n\nSeveral explanatory additions are made in the body\nof this edition, to which we ask leave to refer the reader, particularly to the Elucidation of the theory of the Formation of the Earth.\n\nWe now present the third edition of this work to the public of United Canada, trusting that the system of Creation we have attempted to form, will receive a considerable degree of sanction from the scientific authorities, discoveries, and observations we have now enlarged it with; and that it may be found to meet the approbation of scientific men of the present, and also serve as an instructive book for the rising generation.\n\nTHE AUTHOR.\n\nMONTREAL, 1842.\n\nN. B.—The reader will find the extra matter of this Fourth Edition in the Appendix No. 2, which contains a powerful support of our Theory of the Sun, by extracts from M. Arago's work on Comets, and Doctor Lardner's Lectures.\n\nTORONTO, APRIL, 1845.\nAPPENDIX No. 2.\n\nPage 9. read—The reader will have received some idea of the purpose of the Science of Geology, from the prefaces to the former editions of this work; and in order to exhibit to the Canadian public the practical utility of this science, we extract from a late Geological work of some merit, namely Elements of Geology for Popular use, by Charles A. Lee, M.D., of New York, his statement of this utility. In the first paragraph of his preface he says:—\"No department of the natural sciences possesses greater interest or leads to more important practical results than that of Geology. Of late years, it has attracted almost universal attention, not only from the fascinating wonders it discloses, but also from its obvious and extensive application to the economical purposes of life. Of such importance has it been regarded, that many of our State Legislatures, as well as the General Government, have authorized geological surveys to be made, in order that the natural resources of the country may be brought to light and fully developed. * * * * * *\n\nAlready have these surveys contributed millions in value to the productive industry of the land, and every year their importance is more and more demonstrated and acknowledged.\"\n\nMany of the influential men in the honourable Legislature of this Province, have honoured me with their subscriptions to my work, and I am happy to observe\nthat a liberal sum has since been appropriated by it, for a geological survey of the Province, which, I have no doubt, if performed with diligence and zeal, may discover great sources of industry and wealth for it.\n\nI now proceed to give an account of the theory which the late discoveries of this and other sciences have suggested to me of the geological formation of our globe, and of the system of creation I had gradually formed.\n\nPage 10, after line 17, read—\"and this, too, without coincidence with the laws of gravity,\"\n\nPage 14, line 14, read—Buffon's theory has also been completely refuted by the undoubted astronomical fact, that if the planets were struck off from the sun, they must, in every revolution have returned to the sun again.\n\nPage 21, line 6, read—When two persons converse together, the ideas of their minds pass from the organs of speech, through the air intervening between the two persons; in this passage, therefore, an emanation of mind exists separate from the body from whence it came. It is conveyed, indeed, by the vibrations of the particles of air it passes through, but it certainly has, during that period, an existence separate from the body and organs it proceeded from. An emanation of mind, therefore, can exist separate from its matrix, and in a form of matter entirely different from what it emanated from. Is it then not possible to conceive, that mind itself could be endowed with existence in the teriform state, as well as in the solid?\nPage 22, after line 11, read—To show that it is not without good cause, we, in this work, attempt to vindicate the Mosaic account of creation; and, by our explanation of the first verse of Genesis to account for the immense period of time required by the modern geologists; we extract the following note from a late work on geology: \"Although the world is not eternal, it is, nevertheless, very ancient, and, in calculating all the time that was required for the formation of the numerous beds which the globe presents to us, for the life and reproduction of all the animals and vegetables whose remains it contains, according to the time employed for the actual formations whose duration we know, we are forced to admit that the world is at least 300,000 years old.\"—Boubee's Geol. Populaire, p. 7, Paris, 1833.\n\nPage 23, line 11, read—By this explanation we shall be able to account for any length of time which the formation of the globe may have required.\n\nPage 24, line 12, read—That the oceanic waters must have been formed by combustion is proved by the fact that these elementary gases, oxygen and hydrogen, may be kept together for any length of time, and form no water without combustion.\n\nPage 25, line 28, read—This last sentence is the only one from which our theory differs, and we refer the reader to note 2 of first edition, in support of that theory, also, to note 5 of second edition.\n\nPage 26, line 25, read—This idea I have seen confirmed by Mr. John Wesley, in his \"Survey of the\nWisdom of God in the Creation.\" He says, in vol. 2, p. 256, \"Chalk is no more than the ruins of sea shells, and lime stones consist of the same bodies cemented together by stony matter.\"\n\nPage 30, line 7, read—The above groups make 10,700 feet.\n\nPage 37, line 10, read—This idea is sanctioned by Dr. Thomson in his Atomic Chemistry, entitled \"An attempt to establish the first principles of Chemistry.\" In page 35, vol. 1, he says, \"I am of opinion we are not at present acquainted with any truly simple bodies. All our simple bodies are most probably compounds, and many of them may be afterwards decomposed, and reduced to more simple principles, by the future labours of chemists.\"\n\nPage 40, line 14, read—These internal fires of the earth, though at first sight they appear to us the effects of accidental causes, will probably be found to be an instance of the designing wisdom of the Author of Nature. The depositions from the ocean, which, by our theory, have formed the earth, must have been originally deposited in a soft state. By the continued pressure of the subsequent geological particles towards the centre, they would no doubt acquire a degree of solidity, but perhaps the operation of these fires was required, to give them sufficient hardness to resist the powerful action of the rapid motions of the earth. These fires are, at the present day, considered by the first geologists to be occasioned by water coming into contact with the metallic basis of the primary earths, by which the water is decomposed and combustion\nensues; and in this case an absorption of oxygen by these bases must take place and their bulk be greatly increased, and this may have been designed by the Creator for enlarging the bulk of the earth.\n\nPage 42, line 13, read—I have, since the printing of the second edition of this work, had opportunities of reading the most modern geological publications, and finding therein no cause whatever, to vary from the theory of the earth I had formed, I now proceed in this third edition to the\n\nELUCIDATION OF THAT THEORY.\n\nThe Mosaic account, by the 1st, 2nd, 6th, and 7th verses of the first chapter of Genesis, shows us that our earth was first created in the waters or universal ocean; and by the 9th and 10th verses, we learn that \"the waters under the Heavens were gathered together, and the land made to appear.\"\n\nWe have shown that this part of the scriptural account of creation is confirmed by the concurrent observations of the best and most modern geologists. Indubitable proofs in every part of the crust of the earth, show it to have been \"formed in a fluid;\" and I trust the following elucidation of our theory will tend to show that such has been the case through its entire diameter.\n\nBy this theory, we account for the formation of the entire diameter and circumference of the earth, by the continued depositions which have taken place in the oceanic waters of Genesis from the \"beginning,\" as per 1st verse; which depositions have been formed by the vegetable and animal kingdoms, and by the con-\nstant labours of various species of the animals of that universal ocean, as shown at full length in the foregoing pages of this work.\n\nIn Lee's Elements of Geology, (New York, 1840) page 271, it is said—\"The Pacific Ocean abounds in coral to the 30th degree of latitude on each side of the equator; so also do the Arabian and Persian Gulfs. On the east coast of New Holland is a reef, 350 miles in length, and between that country and New Guinea, there is a chain of coral 700 miles long. The Maldives, in the India Ocean, are coral reefs extending 480 geographical miles north and south. These are circular islets, the largest being 50 miles in diameter, the centre of each being a lagune from fifteen to twenty fathoms deep; and on the outside of each island at the distance of two or three miles, there is a coral reef, immediately outside of which the water is generally more than 150 fathoms deep.\"\n\nThe following cut will serve to illustrate the general shape and formation of these islands:\n\nThese vegetable and animal depositions of the Ocean of Genesis, then, were first attracted to a centre by the universal law of gravitation, and there formed the nucleus or centre of the earth.* This nucleus\n\n* It may be proper to explain how the primitive races of the vegetable tribes may have been supported before the nucleus was formed. There are many aquatic plants which take no root in the earth at all; but grow and float in the water. There is a species of the Fig-tree in the Edinburgh Botanic Garden, which\nbeing continually augmented in bulk by the unceasing depositions of the ocean, until a great depth of vegetable and animal remains were accumulated, internal heats and fires would be thereby generated, which would last until the combustible matter deposited was consumed. The fires would then cease, until another sufficient depth of fresh depositions took place. The fermentation of these would again produce heat, fire and incandescence, until again the combustible matter last deposited was consumed. The remains after these combustions would, of course, be incombustible, and would consist of all the primary earths, sands, clay, lime, magnesia, &c., and of the calces or oxyds of the various metallic and mineral substances contained in the original depositions of matter above stated.\n\nThese alternate depositions from the ocean, must have continued to generate these periodic fires, pending the whole time required for the formation of the diameter of the earth, that is until the separation of the \"dry land\" from the \"waters\" took place as mentioned Genesis first chap. and 9th verse. The depth or thickness of the depositions required to produce each of\n\nhas grown for twelve years, suspended in the air and moistened with water; we have therefore a right to conclude, that if some species of land plants have this power, many of the first created marine plants of the ocean of Genesis would have it also. In fact, many marine plants of the present seas grow on the rocks, and must consequently derive their nourishment from the water. But it is possible that until the nucleus was formed, the primitive marine animals may have found their nourishment in the waters, for the microscope shows us that every drop of water contains myriads of the insect tribes. We know also that the gills of fish decompose water, by which they would obtain two of the elements of all vegetables—Oxygen and Hydrogen.\nthese periodic fires, it is impossible to form any certain idea of. It may have required many miles of depth of deposits, as they would contain carbonic, sulphureous, oily, gaseous, earthy, saline and metallic matter mixed; but it is well known that it requires but a small depth of vegetable matter alone, being moist, and heated by fermentation, to produce ignition. A common haystack is often fired by the spontaneous ignition of its hydrogen.\n\nThus, according to this theory, we see that the internal fires of our earth at the present day, at least as far as they have been occasioned by the above original causes, cannot extend to near the centre of the earth; because the periodic fires above stated, would consume all the inflammable matter, at certain periods after it was deposited: each periodic fire would consume the combustible matter deposited from the ocean since the previous fire; and after each conflagration, the parts of the earth then formed must have remained in the state of incombustible calces.\n\nThis theory will perhaps also account for that singular phenomenon in geology, of entire genera of marine animals disappearing at different depths in the earth. The incandescence had destroyed these genera, and it was not until the (then) surface of the earth was cooled sufficiently by the waters of the ocean of Genesis, between the times of the periodic fires, that fresh genera of animals could approach it. They then approached it, and, as they terminated the time of their existence, their remains went, with the other depositions, to augment the growth of the earth's bulk, and so on continually, until the separation of the land from the waters.\nThe reader will here observe, that although by the above causes of the primitive fires having ceased to exist, and the residue of them being matter in a calcified or oxydized form, except indeed, the matter of the last depositions of the ocean of Genesis, (which may be one of the causes of the present volcanic fires) that therefore, no central fire arising from these primary causes can exist; yet, we do not mean to deny, that subsequent causes of fire may have, and are perhaps even now taking place.\n\nThe electric fluid, as is proved by late discoveries of Sir H. Davy, on the primary earths, of which the oxydated matter of the above conflagrations would mainly consist, is capable of decomposing these primary earths, and water also. It is possible, therefore, combustion might be generated, even in the oxyds to which the original deposits were reduced. Thus, in the opinion of many Geologists, there is a central fire in the earth.\n\nMr. Lee, in his Elements of Geology, page 53, says, \"From the result of all the observations hitherto made, we may safely conclude that the temperature of the earth increases as we descend, at the rate of one degree for every eight fathoms, consequently at a depth short of a hundred miles, the materials of the globe are in a state of incandescence.\"\n\nNow, though I agree that from the cause above assigned, the (electric fluid) internal fires might possibly be regenerated from the oxydated remains of the primordial fires, yet I should conceive these subsequent fires are more likely to be partial than general. I conceive that the intention of the Deity was, by the means of the primordial fires, to prepare and harden the geolo-\ngical bodies, to produce chemical decompositions and re-combinations, of numerous useful substances, to increase the cohesion of these geological bodies, to enable them to sustain their rapid and powerful motions in the heavens, to elevate the mountains, to diversify the earth's surface, and give mankind the use of their mineral products; and I do not conceive these ends would be obtained, were the whole interior of the earth in a state of fusion from a hundred miles below the surface. The increasing heat of the earth as we proceed downwards, can be equally well accounted for by supposing the present fires to be occasioned by the more recent depositions of combustible matter from the oceanic waters of Genesis, which are still in a state of combustion.\n\nAnd there is one corroborative circumstance of this stated by Archdeacon Paley, in page 388 of his Theology of Nature, namely, that \"by a comparative calculation with the force of attraction of a rock of granite, the earth was said to have twice the density of that rock or about five times that of water,\" which could not be the case if the earth were nearly all liquid fire; for, deducting the 100 miles of crust from the diameter of the earth near 8000, would leave an ocean of fire 7800 miles deep; an idea so contrary to the ordinary course and wisdom of nature, appears to me preposterous.\n\nI shall now make a few observations on the time that may have been required, according to our theory of depositions from the oceanic waters, to form the whole diameter of the earth.\n\nWe have shown in note 1st, the power of geometrical progression in two generations of herrings, and that in twenty years of generation, a mass of matter\ncould be produced, equal to ten of our globes, that is, allowing these generations to be undisturbed. Now that must have been the case in the oceanic waters of Genesis. In our seas, immense numbers are annually abstracted from the ocean by the fisheries. Not so in the primeval ocean: there was no abstraction of matter there whatever. The labours of the Zoophytes and other marine animals we infer, according to the opinion of the modern geologists, have been also \"going on in all former ages as at present,\" and would be another immense source of geological formation.\n\nIt has been stated by some geologists, that the sedimentary rocks have taken a million of years in their formation. This is no doubt grounded on the supposition that past volcanic action and convulsion have been the same as at present. I trust, however, to have shown in our theory, that volcanic and convulsive forces must have been immensely greater and more frequent in the primeval ages; and I believe that a million of years ago, if the globe were then in being, there was detritus enough, arising from that volcanic action, to produce a million times the masses of rock, that any \"causes now in operation\" could do, and am more confirmed in this opinion from the vast difference that must have then existed in the tenacity of the formations, compared with their present state.\n\nWhatever length of period however might have been actually employed, we trust we can give it by our explanation of the 1st verse of Genesis; but we are not of opinion that the laws for the formation of the globe, required any such immense periods of time as is supposed by some geologists. Their comparative scale of formation, drawn from the present actual for-\nmations, is totally inadequate. How, for instance, could the power of deposition of lakes or rivers of the present state of the world, be compared with the mighty force of the oceans of the globe at the time of the separation of the waters of Genesis, rushing over the newly formed earth, with inconceivable impetuosity?\n\nI trust that by the above elucidation, the reader will completely comprehend our theory of the formation of the solid parts of our earth, by the powerful and vital agencies, which we humbly conceive the Deity may have employed to effect this wonderful purpose.\n\nWe wish now to make some observations on a most singular production, which we have fallen in with since the publication of the second edition of this work; this is Mr. Mantell's \"Wonders of Geology.\" In page 400, volume 1st, under the head of Geological Mutation, he says, \"I will embody these inductions in a more impressive form, by employing the metaphor of an Arabic writer, and imagining some higher intelligence from another sphere, to describe the physical mutations of which he may be supposed to have taken cognizance from the period when the forests of Portland were flourishing, to the present time. 'Countless ages ere man was created,' he might say, 'I visited these regions of the earth, and beheld a beautiful country of vast extent, diversified by hill and dale with its rivulets, streams and mighty rivers, flowing through fertile plains; and palms, ferns and forests of coniferous trees clothed its surface; and I saw monsters of the reptile tribes, so huge, that nothing among existing races can compare with them, basking on the banks of the rivers and roaming through its forests, while in\nits sens were sporting thousands of crocodiles and turtles, winged reptiles of strange forms shared with birds the dominion of the air, and the waters teemed with fishes, shells and crustacea; and after a lapse of many ages, I again revisited the earth, and the country, with its innumerable dragon forms, and its tropical fruits, all had disappeared, and the ocean had usurped their place, and the waters teemed with nautili, ammonites, and the cephalopeda of races now extinct, and innumerable fishes and marine reptiles; and thousands of centuries rolled by, and I returned, and lo! the ocean was gone, and the dry land had again appeared, and it was covered with groves and forests, but they were wholly different in character from those of the vanished country of the Iguanodon.\"\n\nThis very poetical effusion appears indeed every way worthy to be associated with the Arabian Tales. Countless ages, thousands of centuries, and other epochs stated in these \"wonders,\" are tolerably latitudinary periods, even for fairy tales. It is remarkable too, that although the author writes so highly of Doctor Buckland, as a great geologist, he has never mentioned the explanation of the 1st verse of Genesis, which the Doctor has adopted in his Bridgewater Treatise, purposely to account for these great periods of geological mutation. At the same time, Mr. Mantell affects to say, that geology rightly understood, does not confute the scriptures, or at least the purest piety. He at the same time would entirely set aside, as by the above extract, the account given by Moses, that the earth, since the separation of the waters in Genesis, has existed only 5,800 years. Now, if this important part of the Bible is not founded on fact, what arguments would\nmankind have for disbelieving the remainder? But, fortunately even these \"wonders of geology,\" cannot effect this. For first, I verily believe that the carboniferous formations offer sufficient evidence that they were produced before the separation in the universal ocean of Genesis; I believe that these immense club mosses, these arborescent ferns* so immensely larger than any of the present day, were marine; for I can never believe that any difference of climate could make such immense difference in the size of the plants. In examining coal, that is, not including Lignites or brown coal, in any part of the earth, we find no traces of woody fibre, which, had it been formed of terrestrial trees, would probably have been apparent. Coal appears more likely to have been formed of some soft pulpy matter such as sea-weed, and to have acquired its present appearance by great heat and pressure, and decomposition. This opinion of the marine formation of coal is supported by Mr. Maletrenck.\n\nIn Sullivan's View of Nature, letter 38, page 109, Mr. Maletrenck, in treating on the origin of coal, says—\"But this is a subject which we must examine more closely. Vegetables, as I have said, have been considered as the cause of the formation of pit coal. A few forests, however, buried in the earth, are not sufficient to form the masses of coals which exist in its bowels. A greater cause, more proportioned to the magnitude of the effect, is required, and we find it only\n\n* Lee, in his Elementary Geology, page 67, says, \"in treating on the coal formations, vegetables also which are now mere herbs, then attained the size of large trees, as for example, ferns, which though they now attain the height of a few feet at the most, then grew as large as our tallest trees.\"\nin that prodigious quantity of vegetable matter which grows in the seas, and is increased by the immense masses which are carried down by the rivers; these masses are agitated and broken down by the waves, and afterwards covered by argillaceous or calcareous earth, and are decomposed. Nor is it more difficult to conceive how these masses of marine and other vegetables may form the greater part of the coal, than that shells should form the greater part of the globe. The direct proof in support of this theory are the presence of aquatic and marine substances. The soils which contain coal are generally of schistus and grit; and as the formation of pyrites, as well as that of coal, comes from the decomposition of vegetable and animal substances, (for sulphur has been proved to exist naturally in vegetables and animals) all pit coal is more or less pyritous, so that we may consider pit coal as a mixture of pyrites, schistus and bitumen.\"\n\nMr. Maletrenck thus supports our idea of the origin of coal in the secondary formations. I have to add as a further support of this theory, that all coal contains ammonia or its elements. Now terrestrial trees or vegetables will not account for this ingredient of coal. We know, moreover, that the remains of immense masses of animals must have been deposited in the oceans. The remains of whales, sharks, salmon, and all other fish, many species of which I believe are seldom found in the earth fossilized, must have been deposited somewhere in the ocean, and it appears probable that coal has derived its ammonia from these sources. At all events terrestrial vegetables alone will not account for it, for they do not afford one of its elements, azote.\nBut whether time and further observations will prove these opinions correct or not, still the story of the \"beautiful country of the Iguanodon\" can be accounted for, without overthrowing the narration of Moses. Volcanic action, as I have shown above, must have been immensely more active before the separation, and pending the subaqueous formation of the earth in the ocean of Genesis, than at present. It is possible therefore, that some mountainous countries, may have been elevated above the surface of the waters long previous to the separation of the \"dry land of Genesis,\" and these mountaneous countries may have been tenanted by these reptile tribes, and covered by these immense palms, coniferous ferns, club mosses, fine rivers, lakes, &c., for many ages previous to the separation, when the great bulk of the land was made to \"appear,\" and thus the Mosaic account will be yet maintained in its integrity, notwithstanding the existence of the beautiful country of the \"Iguanodon.\"\n\nPage 42, line 15, read—As the great discoveries in Pneumatic Chemistry, made during the last 50 or 60 years, may not be known to many of my readers, I here subjoin a short account of them. About the beginning of that period, Mr. Black, of Edinburgh, first discovered that the change of lime-stone into lime, by burning, was nothing more than the extrication of its carbonic acid gas from the lime-stone by the heat employed. This discovery excited the attention of chemical philosophers to aeriform bodies; and Mr. Black's name will be venerable as long as science is cultivated. A few years afterwards, Mr. Cavendish discovered the highly important fact, that water was composed of the bases of the two gases, oxygen and\nhydrogen, which was further proved by the experiments of Dr. Priestly, and the exact composition of water was finally confirmed by the accurate analysis of Lavoisier and other French chemists, who, having decomposed the water into its elementary gases, reproduced it by the ignition of the same gases; and finding by repeated experiments, the weight of the water always equal to the gases produced, and vice versa that the gases employed to form the water, always produced an equal weight of it. Subsequent chemists have verified these results, and it is now universally allowed, that all water consists of one part of hydrogen, and eight parts of oxygen by weight.\n\nOur atmosphere has been found to be composed of eighty parts of mephitic or azotic gas, and of twenty parts of oxygen gas. These three gases, oxygen, hydrogen, and azote, which may be called primary, have since been discovered by chemists in almost every part of the vegetable, animal and mineral kingdoms, in which also a great variety of compound gases are discovered every year.\n\nPage 51, line 17, read—This idea of no heat in the sun, arose in part from the existence of ice and snow on high mountains in the torrid zone, which is now thoroughly explained from terrestrial causes, by Lambin, De Lui, Bougan, and De Saussure.\n\nPage 51, line 23, read—\"A fact well known,\" says De Saussure, \"and which proves strongly to my mind that the action of the solar rays, (considered in themselves, and independent of all exterior causes of cold,) is as great on the tops of mountains as in the level country, is, that the force of a lens is the same at all\nheights. I am therefore convinced with Bougan,\" continues he, \"that the principal reason of the cold which reigns on the tops of mountains is, that they are always surrounded and covered by an air that is invariably cold, and that that air is cold because it cannot be greatly heated, neither by the rays of the sun, in consequence of the transparency of this air, nor by the surface of the earth, on account of its distance from that surface.\"\n\nPage 61, line 19, read—Having now presented to the public the theory of the sun's formation, arising, as I conceive, naturally, from the stupendous quantity of light and heat which must have evolved from the combustion of the gases required for the formation of the ocean of Genesis, and having therein given my ideas on the manner in which the waste of the sun's light and heat may be replenished, I purpose now to make a few observations on the opinion stated by Dr. Herschell as to the opaqueness of the sun, and also of the spots which are found on or adjacent to, his surface.\n\nSharon Turner, in his Sacred History, page 46, vol. 1st, says—\"Of the actual substance of the sun, so little satisfactory to our judgment has been discovered, that all which is mentioned concerning it, can rank no higher than conjectures more or less plausible. Dr. Herschell thought his body to be opaque with an upper stratum of black luminous clouds. Black spots of varying magnitude and form are continually appearing upon it and receding;\" and in a Note from La Place, page 20, it is said—\"Dr. Herschell has inferred that what he deems the sun's luminous atmosphere, is 2,500 miles from its surface.\"\nThe preface to Sharon Turner's Work is dated 1832. The first edition of mine was published in 1836;—his observations as to the substance of the sun could not, therefore, include it; and I shall now make one final observation in support of the probability of my system, namely, that it is, I conceive, highly probable, the Deity, would convert the stupendous quantity of heat and light which must have been extricated from the combustion of the gases of which the oceanic waters are formed, to some great purpose. The fabric of the sun thereby, was it not the most prominent and necessary one he could have applied it to?\n\nNow, respecting Dr. Herschell's opinion as to the opaqueness of the sun, as I am well aware of the exalted talents of that philosopher, and equally conscious of my own want of scientific knowledge to cope with them, I must leave the decision on the validity of my theory of the sun to men of scientific acquirements, should it meet their eye; and in that case, I beg to submit to them, should they agree to that validity two questions:—\n\n1st. The luminous atmosphere of Doctor Herschell being, as he says, 2,500 miles from the sun, will it not be accounted for by the vast bodies of hydrogen and oxygen gases I have supposed, by their combustion, to serve as elementary fuel for the sun? Also—the spots on the sun's surface, or as some say, adjacent thereto, may they not be accounted for by the above said cause, from the denser volume of aqueous vapour which must be produced by this vast combustion of hydrogen? The combustible gases would probably be ignited at the distance mentioned, (2,500 miles from the sun) and no doubt they would prove luminous enough.\n2nd. If, as it has been lately suggested, our atmospheric heat is produced by the sun's rays operating on a calorific medium, can we allow this heat to be produced by any other means than by abstraction from that medium?\n\nHeat is undoubtedly a material substance, and whencesoever it is abstracted by the sun's rays, and carried off, must not a corresponding degree of cold be produced? and must not the whole extent of the space between the earth and the sun become continually more and more refrigerated, unless some means are found for replenishing this waste of heat? and this we humbly conceive, our theory of the sun will do.\n\nI wish here to reply to a suggestion on our theory, by a person of some scientific acquirements. This was an idea that the gases (which in the above theory we conceive to be employed in supplying the waste of the sun's light and heat) might be ignited before arriving at the sun's atmosphere, and thereby endanger the planets. This person, however, observed, that as Sir Humphrey Davy's safety lamp precludes any bad effects in mines, nature may have prepared some contrivance to ensure safety in the regions of space. The observation was judicious; for if the science of feeble man can counteract the evil on earth, how much more easily can the power do so who rules the heavens! In fact it is not difficult to conceive an effective mode which may be employed by nature to ensure the safety required. Neither oxygen gas, nor hydrogen gas, are inflammable per se, that is when not in contact with each other; and it is easy to conceive that each species of gas may come from opposite points of the regions of space. Oxygen may come from the parts of the\nheavens above the sun; hydrogen from those parts which are below it—and thus, both streams never meet, till they enter their centre of attraction, the atmosphere or body of the sun; by which means no ignition whatever could take place, until they arrived there. Moreover, there is hardly a doubt, the tails of comets consist of inflammable gaseous matter; and these bodies traverse the regions of space perhaps in all directions, without injury to the planetary bodies.\n\nI now present to the reader a short outline of Sir Richard Phillips' Theory of the cause of the motions of the heavenly bodies, taken from a work called \"Wonders of the Heavens,\" Lecture 2nd, page 30, printed for Richard Phillips, London. I make this extract as presenting a singular sanction of our theory, of the existence of a gaseous medium in the regions of space; but do not agree with him in rejecting the Newtonian principle of gravity and attraction, and refer our readers to our observations thereon in the introduction to this edition.\n\n\"About 100 years passed from the discovery of the theory of gravitation, without any remarkable addition to it, till the year 1818, when Sir Richard Phillips, in some essays on the proximate causes of the phenomena of the universe, impeached the entire theory founded on the simultaneous existence of universal gravitation, projectile force, and an alleged vacuum in space.\n\nThis writer has shown that Hook's Law of Gravity, which Newton so fortunately applied, is not a universal law, but a law created locally by the transfer of motion through any medium, such as the medium of space, and that the motions of nature, necessarily propagated according to that law, are, in truth, the cause of all the\nphenomena which heretofore had been ascribed to the occult and unintelligible principles of attraction and gravitation. Hence, as the law called the law of gravity, which Newton applied to the problems of his Principia, is proved not to be universal, and not an innate property, but an accident of matter, so there no longer exists any occasion for the projectile force with which Newton endowed the planets to prevent their falling into the sun; nor was it any longer necessary to extinguish the medium, which it may be supposed is co-existent with space, for the purpose of conferring perpetuity on the projectile force.\n\nHe considered all matter as the possible parent of motion, and motion as power, and then proceeded to show, that all bodies on the earth are the parents of its motions, and that its motions are competent to produce all the phenomena which we witness on earth; that weight or gravity is the mere effect of motion, or a tendency to move by the transferred impetus of the earth's motions; in fine, that twofold motions are powers of aggregation in all planets; and that these motions, or that of the sun, propagated through the medium of space, diverge as the square of the distance, and act with the same precision through an elastic medium, as a lever of iron. He showed also, that the fall of bodies to the earth, ascribed to terrestrial gravitation, is a necessary result of the twofold motions of the earth, and that all the phenomena heretofore explained, by a principle which, considered as universal, led to many false analogies, are mere results of motions, or accidents of matter, altogether local and mechanical.\n\nThe philosophy of material phenomena promulgated by Sir Richard Phillips, teaches that the universe con-\nsists of extension of matter under various expansive gaseous, fluid, and fixed forms of body, proceeding in relative density from the rarest and most extended fluid media, to the most condensed aggregate of fixed atoms.\n\n\"In fine,\" says Sir Richard Phillips, \"motions of matter, subject to regular mechanic laws, acting absolutely or subordinately, generally or locally, on aggregates or atoms, and producing various densities, and different degrees of locomotion, and affinity, in atoms of matter, of different constituent forms, are the proximate causes of all the phenomena; and as one series of phenomena depends on another, so all existing phenomena are, in regard to others, physically fit, compatible and harmonious; and as matter cannot originate its own motion, so in considering motion as the proximate cause of all phenomena, we arrive through the ascending series, at the necessary and sublime First Cause of all motion and all phenomena.\"* Page 35.\n\nThe next sanction of our theory of the existence of gaseous matter in the sun's atmosphere, we take from Sir John Herschell's Astronomy of last year, page 407, chapter 12.\n\n\"We shall conclude this chapter by the mention of a phenomenon which seems to indicate the existence of some slight degree of nebulosity about the sun itself, and even to place it in the list of nebulous stars. It is called the Zodiacal light; and may be seen any very clear evening soon after sunset, about the month of April or May, or, at the opposite season of the year, before sunrise, as a cone or lenticular shaped light,\n\n* It being thought by some that Sir Richard Phillips' Theory was of Atheistical tendency, I have extracted the foregoing paragraph to show the reverse.\nextending from the horizon, obliquely upwards, and following generally the course of the ecliptic, or rather that of the sun's equator. The apparent angular distance of its orbit from the sun varies according to circumstances from $40^\\circ$ to $90^\\circ$, and the breadth of its base perpendicular to its axis from $8^\\circ$ to $30^\\circ$. It is extremely faint and ill defined, at least, in this climate, though better seen in tropical regions.\n\nIt cannot be mistaken for any atmospherical meteor or Aurora Borealis. It is manifestly in the nature of a thin lenticularly formed atmosphere, surrounding the sun, and extending at least beyond the orbit of Mercury and even of Venus, and may be conjectured to be no other than the denser part of that medium, which, as we have reason to believe, resists the motion of comets, loaded perhaps with the actual materials of the tails of millions of them, of which they have been stripped in their successive perihelion passages, and which may be slowly subsiding into the sun.\"\n\nIt appears hereby that Sir John completely sanctions the existence of gaseous matter in the sun's atmosphere. And for what other purposes could it be there, but for the supply of the waste of its light and heat by the combustion of this gaseous matter? And Sir John may well say, as he does in the above most admirable treatise on Astronomy, \"that there is an enormous degree of heat in the sun.\"\n\nThe last extract we shall here make, as sanctioning our theory of supply of the waste of the sun's heat and light, is from a work published in 1841, called \"Graham's Elements of Chemistry.\" \"It has always been observed that there is a black line or lines among the rays received from the sun through the prism on the\nThese black lines philosophers had not been able to account for. But the atmosphere of the sun has now received an entirely chemical character from late experiments of the celebrated Sir David Brewster, who found that on passing a ray of light from a common lamp through a medium of nitrous oxyd gas, it formed a thousand black lines on the spectrum. He, Sir David, thence infers (in accounting for the black lines when rays are received from the sun) that gaseous matter exists in the sun’s atmosphere, by which medium the black lines are produced on the spectrum.” Doctor Graham adds, “that we may thus be able hereafter to explain how the light of the suns of other systems is formed and maintained.”\n\nHe thus evidently considers that the mode of supplying the waste of our own sun’s light and heat is explained by means of this gaseous atmosphere, and thereby supports our theory of the combustion of that matter for producing that supply.*\n\nOn a review of these concurrent testimonies, we, with humility, conceive therefore that our theory of the original formation of our sun, by the light and heat evolved by the combustion of the gases for the formation of the universal ocean of Genesis; and of the mode of supplying the waste of the sun’s light and heat may be considered as nearly established.\n\nPage 100, after line 24, read—In Evans’ Agriculture, printed at Montreal, it is said, page 51, “The ashes of stalks of wheat gathered a month before the\n\n* The above extract is taken from memory, but the substance will be found in Graham’s Elements.\nflowering, and having some of the radical leaves withered, contained 12 parts of Silica and 65 of Alkaline salts in 100 parts. At the period of wheat flowering, and when most of the leaves were withered, the ashes contained 32 parts of Silica and only 54 of Alkaline salts.\" Thus, at one period the straw contains 12 parts, and at another 32 parts Silica, and this, just at the time the plant is coming to its full growth. Now, if this Silica had been taken up from the soil by the roots of the plant, it would be absorbed by them in the same quantity at all times, and equally diffused through the straw; but if, as by our theory the vital functions of the vegetable form the earths just as they require them, the above most singular fact will be thereby accounted for.*\n\nPage 108, line 13, read—Sharon Turner, page 30, \"Sacred History of the World,\" and other writers, consider the firmament to refer, and to mean solely, the atmosphere. Now this extends only forty-five miles above the earth. But, a column of vapour of a given breadth of 45 miles high, does not probably exceed a column of equal breadth of water the 40th part of a mile deep, in respect to the relative quantities of water each column would contain.† Our oceans are generally said to be 4 miles deep, and the 6th verse says,\n\n* It is also to be observed, in confirmation of our theory, that, as it generally happens the rains are more abundant in the early parts of the seasons, more Silica would be dissolved by them, than at the time of flowering, whereas the above experiment proves that nigh three times more Silica is formed in the plants at this period.\n\n† Water turned to vapour by boiling exceeds the bulk of the water 1696 times.\n\"Let there be a firmament in the midst of the waters,\" which, even in our oceans, would be two miles deep. But the 9th verse will make it clear that the word \"firmament\" cannot refer to our atmosphere. \"And God made the firmament, and divided the waters which were under the firmament from the waters which were above the firmament, and it was so.\" Thus, it is evident, that, in either sense of the word, an ocean of waters is here stated to exist above the atmosphere. And as it is very remarkable that no part of the first chapter of Genesis gives any direct account of the formation of our atmosphere, we may, perhaps, conclude, that it was formed in the \"beginning\" when \"God created the heavens and the earth\" as per 1st verse; and this is more probable, as we know one ingredient of our atmosphere then existed, namely, oxygen, used in the combustion, for the formation of the oceanic waters of Genesis, and that air would, probably, be required for the animals thereof, during the formation of our earth in those waters.\n\nPage 109, from foot of page, read as follows;—\n\nNOTES TO SECOND EDITION.\n\nNote 1. In corroboration of our Notes to 1st edition numbers 14 and 15, on the powers of the vegetative functions to produce the primary earths, we have now to add a statement from Sharon Turner. In his \"Sacred History of the World,\" vol. 1st, page 93, he says, \"Vegetables have even some relation with the Mineral Kingdom; for they do not only form the carbon they contain, but some have been found to have copper particles,\" (and in a note it is said) \"That copper exists\nin a great number of vegetables, was announced in 1817. Mr. Targean found five milligrammes of copper in a kilogramme of grey quinquina, eight in Martinico coffee, and nearly eight in wheat.\" (Bull. Univ. page 139.) He continues, \"And several vegetables secrete flint and likewise sulphur, as in our common corn,\" (and in a note it is said) \"Sulphur exists in combination with different bases in wheat, barley, rye, oats, maize, millet, and rice.\" (Lindsay's Nat. Bot. p. 393.) Mr. Turner continues, \"We may add iron and gold also, for both of these have been found in vegetables.\"\n\nAnd in page 393, in a note it is said, \"The energy and even creative agency of the living principle of plants appears in its power of converting material particles into other substances. Experiments on vegetables seem to prove that the solid matter which entered into their composition in the more advanced period of their growth, must, in part at least, have been produced by some action of the vital powers and could not have been obtained ab. extra.\"—Bul. Physic, page 307, and Dr. Thompson's Ch.\n\nNote 2. Since publishing the first edition of this work, I have found that Doctor Thompson, in his Chemistry, says, \"We are certain that no particle of light weighs more than the million millionth part of a grain.\"—Chemistry, vol. 1st, p. 300.\n\nNote 3. Doctor Chalmers, in his Natural Theology published in 1836, page 250, says, \"We shall advert once more to the Mosaic account of the creation; more especially as the reconciliation of this history with the indefinite antiquity of the globe, seems not impossible,\nand that, without the infliction of any violence on the literalities of the record.\" He then narrates the two first verses of 1st of Genesis, and adds, \"Now let it be supposed that the work of the first day in the Mosaic account, begins with the \"Spirit of God moving on the face of the waters.\" The detailed history of creation, in the 1st chapter of Genesis, begins with the middle of the second verse, and what proceeds might be understood as an introductory sentence, by which we are most appositely told that God created all things at first, and that afterwards, at what interval of time is not specified, the earth lapsed into a chaos; from the darkness and disorder of which the present system of economy was made to arise. By this hypothesis, neither the 1st verse nor the first half of the second, forms any part of the narration of the first day's operation, the whole forming a preparatory sentence disclosing to us the initial act of creation, at some remote and undefined period; and the chaotic state of the world at the commencement of those successive acts of creative power, by which out of rude and undigested materials the present harmony of nature was ushered into being. Between the initial act and the details of Genesis, the world, for aught we know, might have been the theatre of many revolutions, the traces of which Geology may yet investigate, and to which, in fact, she has constantly appealed, as the vestiges of so many successive continents which have now passed away. The speculation has offered a vain triumph to infidelity, seeing first, that the historical evidence of scripture is quite untouched by this pretended discovery of science, and that even should it turn out to be a substantial discovery, they do not come into collision\nwith the narrative of Moses. Should, in particular, the explanation we now offer be sustained, this would permit an indefinite scope to the conjectures of Geology, and without undue liberty to the 1st chapter of Genesis.\n\nThus, Doctor Chalmers has confirmed, in the year 1839, the explanation of the 1st verse of Genesis, we had, as stated above, formed in 1825. But, with his idea of the earth lapsing into a chaos we do not at all agree; on the contrary, there is strong reason to believe, that from \"the beginning\" the undeviating design was carrying on, of the formation of the solid parts of the earth in the waters of Genesis, as stated in our theory; and this, the 9th verse shews; for the earth, having been duly formed by the continued depositions of the waters, was separated from them as appears by that verse.\n\nNote 4. In further confirmation of the construction we have put upon the 1st verse of Genesis, it will be found, that the Rev. Dr. Adam Clarke, in his commentaries on the scriptures, says, in commenting on this verse \"that the true translation of it from the Hebrew is 'In the beginning God created the elements or substance' to form the Heavens and the Earth.\"\n\nYet, it is to be observed that a great part of mankind have, perhaps, received the erroneous idea from their infancy, \"that the world was made out of nothing.\" Now, Doctor Chalmers, in a late publication of his, on Astronomy, says, \"that no part of the scriptures asserts that the world was made out of nothing.\" Modern science has proved that most of the liquids and solids of the vegetable and animal kingdom are formed, in great part, of gaseous bodies; and the very clays and other substances considered by Davy's theory, in part, or in whole, as bases of the earth.\n\nBut these are only compositions which refer to the surface.\n\nNote 5. Mr. Bridgewater, from the researches he has gone over, concludes, which are now presented to the world, of animals living in the seas.\n\nForm and shape, generally, the races of animals are stupendous, and the immensity of the sea.\n\nMr. Buckland, in his works, gives the extent of the remains of the poles of the sea. The inhabitants of the sea, in these remains, notwithstanding, are forcible.\nclays and sands we walk on, which were formerly considered mere earths, have been proved by Sir H. Davy's experiments in Galvanism, to consist, in great part, of Oxygen, which must be combined with the bases of these earths in a solid state.\n\nBut for the origin of the elementary gases, of whose composition or origin we are yet ignorant, we must refer to a creating cause.\n\nNote 5. In the Edinbargh Review of Buckland's Bridgewater Treatise, the following extract appears from that work. \"It is marvellous that mankind have gone on for so many centuries in ignorance of the fact, which is now fully proved, that no small part of the present surface of the earth is derived from the remains of animals that constituted the population of ancient seas. Many extensive plains and massive mountains form as it were the great charnel house of preceding generations, in which the petrified exuviae of extinct races of vegetables and animals are piled up, into stupendous monuments of life and death, during almost immeasurable periods of past time.\"\n\nMr. Ehrenberg, an eminent naturalist has since Dr. Buckland's Treatise, discovered by the microscope, the existence of fossil animalculæ, or infusorial organic remains, which form extensiva strata of tripoly or poleschiefer (polishing slate at Franzenbad in Bohemia. The animals belong to the genius Bacularia, and inhabit siliceous shells, the accumulation of which form the strata of polishing slate. The size of one of these animalculæ is the 3,000th part of an inch. Yet notwithstanding the conviction which Dr. Buckland so forcibly expresses, of the vast profusion of vegetable\nand animal life which must have existed in the ancient seas, and which could be no other than the waters or Ocean of Genesis, to which the Doctor agrees, by the extract from the Bridgewater Treatise, (See page 5 of our preface to first edition), yet, notwithstanding this, he gives an opinion, in another part of that treatise, that animal life did not exist, previous to the formation of those strata of the earth where their remains are first found; namely, the transition or secondary formations. In Note 2nd, to our first edition, p. 102, we have given Mr. Lyall's opinion \"that all traces of shells and other organic remains, may be destroyed in rocks, by a heat not amounting to fusion.\" If our system of the formation of the solid parts of our globe, by the primeval deposition of vegetable and animal remains, be approved; it will perhaps, shew that internal heats and fires generated by the gases and metals of these remains, were much more frequent in those early periods of the world, than at present. It is therefore, no proof that vegetable and animal life did not exist prior to the transition formations and during the primary, to say, that their organic remains are not found there: an immensely less heat than that which must have been occasioned by the subterranean fires of the earth, previous to the separation of Genesis, would be sufficient to destroy all traces of organic remains, and to produce a crystalline structure, and new chemical combinations, as we find them at the present day. This objection, then, to the pre-existence of animal and vegetable life because no present remains are found in the primary strata, is not, in my opinion, tenable. A great argument of the modern geologists is, \"that the causes at present in operation, must have\nbeen producing the same effects in all preceding ages.\" Therefore, by a parity of reasoning, conceiving the design of the Creator to have been, to produce the whole circumference and diameter of our globe, by the instrumentality of those natural causes and laws which we now see, every where in operation; we infer that the races of vegetable and animal life were continually employed for that end, since the formation of the primeval Ocean of Genesis, as stated in our system; and that these races were competent thereto, the present formation of a large tract of the earth by even a few species of marine insects, evidently proves; and it also proves, that the Deity could not have chosen, from among the laws of nature he had created, so energetic an agent of production, since even electricity, though much more sudden and violent in its effects, has not the continuity of the agencies of life. The coral insect alone, has produced, as shewn in this work, an extent of land equal in length to one eighth of the diameter of our globe, and still continues its operation; and it is even the opinion of some geologists, that another continent will, in time, be formed, in these seas by means of these insects.\n\nDoctor Buckland allows that some geologists are of opinion that fossil remains may have existed in the primary formations, and all traces of them may have been obliterated by the internal fires; but he appears himself to think, (and gives a quotation, I believe, from another writer,) that the incandescence of the earth was, during the primary formations so great, that no animals could have existed in the ocean.\n\nNow, if our theory be well founded, that the same mighty energy of formation which has produced so\nlarge a part of the crust of the earth, (namely, the labours of the marine animals during life, and their depositions and those of the marine vegetables after death;) if we allow that these same most powerful causes may have produced all the formations of the earth through its entire diameter, the incandescence during the primary formations, will not render this theory untenable. By this theory, we account for the productions of the internal fires, by the ignition of the inflammable gases, and the metallic bases resulting from the decompositions of the vegetable and animal remains that had been deposited in the oceanic waters, and attracted to a centre by the laws of gravity and pressure.\n\nWhen a sufficient thickness of mass of these remains was thus accumulated, these internal fires would then be generated by the ignition of the inflammable matter of their remains, and during the existence of these volcanic fires an incandescence might have been produced over a great part of the earth, which, for a time, would destroy the animals of the ocean near it; but, as these fires could last only until the inflammable matter that generated them was consumed; when that took place, the (then) crust of the earth would be cooled down by the waters of the ocean, and further depositions of remains would take place, until again collected in sufficient thickness to reproduce internal fires and incandescence; when the same refrigeration must, in time, have taken place, all the fuel of these fires being again consumed.\n\nIn fact, this incandescence may, perhaps, account for a geological phenomenon stated by geologists, that entire genera of marine animals appear to have existed.\nat certain depths and have disappeared in subsequent strata, when other genera and species have succeeded them. May this not have happened by the sudden destruction of these genera by the incandescence, and the re-production or re-appearance of other genera when the refrigeration as above described, had taken place?\n\nBut further, if Doctor Buckland assents to the entire account of creation, contained in the first chapter of Genesis, which he may well do after agreeing that its first verse will account for all the wonders lately discovered by geology; in this case it will be seen that in our concluding note, page 108 and 109, we have shown that by the 7th verse, the waters of Genesis existed above the firmament, even allowing this word to mean the atmosphere, as thought by some writers.\n\nIn this universal ocean, by our theory, we conceive the earth and planets to have been formed; and we know from the 9th verse, the earth and its oceans were separated from these waters at the six days of the Mosaic account. This universal ocean must, therefore, be of, perhaps, illimitable extent, and it is not possible that the incandescence of one, or even all the planets, could have more than casually, and for a time, (as we have attempted to explain) prevented the depositions and construction of the primary formations by the vegetable and animal kingdoms of this universal ocean. Heat always tends to an equilibrium, water is a great conductor or at least an absorber of heat, and the waters of this universal ocean would be continually flowing over the earth, then freezing in it, until the equilibrium and consequent refrigeration was effected.\nNote 6. In Good's Book of Nature, page 61, it is said, \"To show,\" says Sir Isaac Newton, on gravity, \"that I do not take gravity to be an essential property of matter, I have added one question concerning its cause, choosing to propose it by way of question, because I am not yet satisfied about it, for want of experiments.\" In this question he suggests \"the existence of an etherial and elastic medium pervading all space,\" and supports his supposition by strong argument, and consequently, much apparent confidence, deduced from the mediums or gases as they are now called, of light and heat and magnetism, respecting all which, from their extreme subtilty, we can only reason concerning their properties. This elastic medium he conceives to be much rarer within the dense bodies of the sun, the stars, the planets and comets, than in the more empty celestial spaces between them; and to grow more and more dense as it recedes from the celestial bodies to still greater distance, by which means all of them, in his opinion, are forced towards each other by the excess of an elastic pressure. It is possible, undoubtedly, to account for the effects of gravitation by an etherial medium thus constituted, provided, (as it is also necessary to suppose, that the corpuscles of such a medium, are repelled by bodies of common matter, with a force decreasing like other repulsive forces, simply as the distances increase. Its density under these circumstances, would be everywhere such as to produce the semblance of attraction. The hypothesis, in connexion with the existence of a repulsive force in common matter, has a great advantage in point of simplicity, and may perhaps hereafter be capable of proof. But at present it can only be regarded,\nand was at first only offered as an hypothesis.\"*—(Good's Book of Nature.)\n\nIt is with great satisfaction I am enabled to present the reader of this second edition of my work, with the theory of the means by which the waste of the sun's light and heat may be replenished. The opinion of this great man is \"a host within itself,\" and is the more grateful to me, as this part of my theory (the possible existence of gaseous bodies in the regions of infinite space, was the part I was most doubtful of,) and I now trust our theory, having this sanction, may be submitted to the knowledge and judgment of scientific men with greater probability of their approving it.\n\nNote 7. In the Montreal Herald of 13th September, 1838, the following notice appeared:—\"Encke's comet begins to be talked of. This comet which completes its revolution in 1200 days, will be visible in the ensuing autumn. It will be in its perihelion or part of its orbit nearest the sun on the 15th December; about the same period it will be nearest the earth. It is (says M. Arago) a vast nebulosity, 64,000 times larger in volume than the earth; yet, such is the tenuity of its substance, that in 1795, Sir Wm. Herschell was able to discover through its mass, a star of the 20th magnitude. It must be an embryo planet, not yet reduced from vapour to a liquid globose volume, afterwards to be converted into an ocean and earth, and organic formation.\"\n\n* There must certainly be some mode existing to restore the vast waste of heat and light emitted continually by the sun, and perhaps our theory of supplying this waste may furnish the proof above required of Sir Isaac Newton's hypothesis.\nHere then, is a complete confirmation (as far as the opinion and judgment of Mr. Arago will go with men of science,) of the theory of the possible formation of our ocean, earth, and organic formations which we have in this work ventured to present to the world. Mr. Arago is one of the leading astronomers of the present day.\n\nNote 8. In Sharon Turner's \"Sacred History,\" vol. 1st, page 169, in a note, it is said, \"Linnæus has only three kinds of Marine plants, fuci centenae and ulves. But Lamoreux, has shewn, that they have several natural families; he proves that the hydrophytes have a more complicated anatomy than has been known. He divides them into six families. Lamoreux has remarked, that the basin of the Atlantic to 40 degrees north has a marked vegetation; so has the West Sea of the Indics, comprising the Gulf of Mexico, likewise the vast coast of South America, the Indian Ocean and its gulfs, and the shores of New Holland. The Mediterranean has also a vegetation peculiar to itself, and extending to the Black Sea.\"—Bull. Univers. 1800, page 102.\n\nNote 9. The Right Hon. and Rev. Francis Henry Earl of Bridgewater, died in the month of February, 1829, and by his last Will and Testament he directed certain Trustees to invest in the Public Funds the sum of eight thousand pounds sterling, to be held at the disposal of the President of the Royal Society of London, to be paid to the person or persons nominated by him. The Testator further directed, that the person or persons nominated by the said President, should be\nappointed to write, print, and publish 1000 copies of a work on the Wisdom and Goodness of God, as manifested in the Creation. There were eight Treatises on various subjects. The Reverend Doctor Buckland was appointed to write the Bridgewater Treatise on Geology.\n\nNOTE TO THIRD EDITION.\n\nNote. I have perceived in Dr. Thomson's \"Organic Chemistry,\" some account of the experiment of Von Helmont, (see p. 43) wherein it is stated, that a certain author has stated an opinion that the distilled water used in it contained sufficient earthy matter to account for the increase of the willow. This, I venture to say, is incorrect, for, in the first place, there is no earthy matter that is volatile at the heat of the boiling point of water; neither if the earth were reduced to a saline form by acids, would they be volatile or evaporate at that heat; moreover, the quantity of water used in the five years could not have been more than 456 gallons, that is one quart per day. Now, it is not conceivable that distilled water could contain more than \\( \\frac{1}{2} \\) of an ounce of earth per gallon, which makes 7 lbs. The willow, however, gained 110 lbs. in the five years, making 103 lbs. produced from the water and atmosphere by the process of vegetation in the five years.\nI am happy to be able to present the reader of the Fourth Edition of this work with two important extracts from late scientific publications. The one is from the celebrated Arago, the French Astronomer, and the other from Lardner's Popular Lectures in the American States.\n\nI now present the following extract from Arago's Scientific Notices on Comets, in support of our theory of the sun:\n\n\"If the comet of Buffon, in striking the sun, had detached from it solid fragments, if the planets of our system had originally been such fragments, they would in a similar manner have grazed the surface of the sun at each revolution. All the world knows how far that it is from the truth. Did not our naturalist also believe the matter which composes the planets sprung from the solar globe, all ready formed into distinct masses? He imagined, as I have said, that the comet had spouted forth a real torrent of fluid matter in which the impulsions which the various parts received from each other, and their mutual attractions, rendered every assimilation with the movements of solid bodies impossible. The system of Buffon affords explicitly as a result that the solar matter—at least, the exterior of it—is in a state of liquefication; then, I should hasten to declare that the most scrupulous modern observations have not confirmed that idea.\n\n\"The rapid changes of form which the obscure and luminous solar spots incessantly experience, the immense spaces that those changes spread over in very short times, have already led to the very probable supposition, for some years, that similar phenomena would occur in a gaseous medium. At present ex-\nperformed quite of another nature, experiments on luminous polarization made at Paris observatory incontestibly establish this result; and if the exterior and incandescent part of the sun is a gas, the system of Buffon is erroneous in its most essential outset, and is no longer tenable.\"\n\nObservations on the above Extract.\n\nI have shown in the body of the work, that the Theory of Buffon is not tenable. Mr. Arago now confirms the fact. In page 27, line 22, of this Appendix, I have proposed a query on the subject of the spots on the sun, namely whether they might not be accounted for by the combustion of oxygen and hydrogen gases serving (according to our theory) as fuel for the sun's fire, and it is with great satisfaction I am now enabled to add to this fourth edition of my work, the sanction given to this idea, and to our theory of the sun by the above extract from the work above named of the celebrated Astronomer Arago. He states, that phenomena, similar to the spots on the sun might arise in a gaseous medium, and allows the probability that the exterior and incandescent parts of the sun may be a gas which is precisely consistent with our theory of the sun's formation, and the means employed by nature to supply the waste of his heat and light. In fine, it would appear by the experiment on the polarization of light stated above that the original idea of the great Newton, that the sun is a body of fire or flame, will still hold good, and that although he had not the advantage of the modern discoveries in pneumatic science to direct him, it shows that on this occasion as on that of the combustibility of the diamond, the genius of the immor-\ntal philosopher had formed a just idea of the nature of the sun. I am happy to be able to add a further explanation of this discovery of Arago's, from Dr. Lardner's very popular lectures in New York. In page 17, he says, on the subject of Light of the Sun:\n\n\"In optics a beam of light is proved to be susceptible of a peculiar modification, called Polarization. Light may undergo certain changes, which shall polarize it, imparting to two of the sides of the ray opposite to each other, a certain proportion which the other two do not possess. The question arises what are these properties?\n\n\"They are various; one, however, is so simple and so nearly connected with the demonstration to which I call your attention, that I shall mention it. If a ray of light fall upon a reflecting surface with either of these two sides which are represented by the red sides of this wand, it will be reflected at an angle equal to that by which it approached the surface. But, if it strike the surface upon the other opposite sides—the blue—it will not be reflected at all; so that two of its faces are capable of reflection, while the other two are not. This is one of the qualities by which polarized light is characterised. In a ray which is not polarized, reflection takes place under all circumstances, but with polarized light only under certain conditions. Thus, we see that light may exist in two distinct states. Now this is the truth which has been contributed to this demonstration by the discoveries of modern optics.\n\nLet us turn to another branch of physics.\n\nThe science of heat has received more attention within a few years past than any other branch of\nFourier, a French philosopher, has done much in this department of knowledge. One of the conclusions he establishes is this: \"There are three states in which material bodies exist; the solid, liquid, and gaseous.\" Fourier proved that when a solid body became incandescent, the light which it emits is polarized, that the light emitted by an incandescent liquid (as molten iron) is likewise polarized, and that the light of incandescent gases is unpolarized. These facts are true, whatever may be the nature of the materials. Here is a distinction established by this great natural philosopher, between the light emitted by incandescent solids and liquids, and that emitted by gases. This is the contribution from the Science of Heat.\n\nNow, Mr. Arago has, with most beautiful sagacity, availed himself of these two facts constituted by the sciences of Light and Heat to determine the nature of the sun's atmosphere. This may easily be done; for since it is established that the light from incandescent solids and liquids is polarized, while that from heated gases is not polarized, all that need be done to determine this point, is to try the experiment, whether the sun's light be polarized or not. Arago, by applying the usual tests, found that it is not polarized.\n\nThe conclusion, as inevitable as it is important, is that the surface of the sun is covered, not by a solid or liquid, but by an atmosphere of flame. Here is one of the most beautified inferences ever drawn from the whole range of physics, and it is established by the aid of science, with all the CERTITUDE OF A MATHEMATICAL DEMONSTRATION.\n\nArago has proved therefore that the sun's atmosphere is an OCEAN OF FLAME.\nThus, by the above extract from Arago's treatise on Comets, and from Dr. Lardner's lectures, it appears that our theory of the sun's formation is powerfully sanctioned and confirmed; and, I conceive I have great cause to congratulate myself on this circumstance. This theory of the sun is based on the undoubted fact that the gases of oxygen and hydrogen, of which the Ocean of Genesis was formed, must have been brought into a state of combustion before they could produce the Ocean of Genesis, and on the no less indubitable fact that a most stupendous quantity of heat and light must have been evolved from that combustion; and I then reasoned, that a sun being indispensably required to warm and light the planets of the systems, the Deity could not have applied this heat and light to a more needful purpose.\n\nMany of my subscribers to the several Editions of my theory, and also many men of science, have done me the honour to approve of the same; but I have reason to believe that a few other persons, considering themselves, no doubt, of too superior acquirements to approve of anything that had not been previously taught in the schools of science, have rather sneered at this, which I with humility had presented to the world. However, as the justly celebrated Franklin's suggestions of the identity of Lightning and Electricity were at first laughed at by the Royal Society of London, I need not be surprised that the same may have happened to my suggestions on the nature of the sun and his combustion. But now that the gaseous theory is verified by so great authorities as Mr. Arago and the Paris Observatory, as shown by Doctor Lardner, I cannot but feel content and gratified. By the extract\nfrom Arago, it appears that the spots on the sun might exist and be accounted for and explained by a gaseous medium,—this being the case, there is no longer any necessity for receiving that very improbable idea, that the sun's body is cold and opaque, and I therefore trust our theory will be found by scientific men to be more satisfactory, and correctly founded in nature. In fact, it appears by Doctor Lardner's observations on this discovery of Arago of the non polarization of the light of the sun, that it is mathematically proven by him that the sun's surface is an 'OCEAN OF FLAME;' and I conceive we are hereby justified in reasoning by analogy, that the case is the same with the suns or stars of all the systems.\n\nConceiving then that that part of our theory relating to the sun's substance and nature has been thus (to me indeed unexpectedly) demonstrated by that very high branch of science, the polarization of Light, and conceiving also that it is unquestionable, that great as the sun's bulk is, the unceasing emanation of his heat and light would, in time, exhaust his substance, and therefore the waste must necessarily be supplied with extraneous combustible matter: so I trust that that part of our theory which relates to the supply of that waste, will also be rendered more highly probable by the above discovery.\n\nOne would, indeed, have imagined that by a priori reasoning on this waste of the sun's light and heat, philosophers might of old have inferred that it must be supported ab extra, but now that the gaseous nature of the sun's incandescence is verified, as shown above, and as Sir John Herschell has shown in his late admired work on Astronomy, that the gaseous tails of\nnumerous comets are deposited in the sun's vicinity. There can hardly be a doubt that the gaseous fuel for the sun's fire must either be produced thereby, or as by the theory of any work, from currents of the gases rushing through the regions of space for that purpose. It is indeed probable that both these sources of gaseous supply may be employed in nature; but the latter theory will also account for the tides by physical pressure, and for the great principle of attraction of the heavenly bodies, namely, the impetus of motion generated by a gaseous medium rushing through the regions of space; and I have accordingly adopted that theory in my System of the Creation.\n\nNOTE TO FOURTH EDITION.\n\nIn further corroboration of the formation of coal from marine plants and trees grown in the oceans, we observe that, in contemplating these immense masses of marine vegetable matter, we have a right to ask of those who argue terrestrial formation, what has become of those masses of marine vegetation after the termination of their vegetable life? Undoubtedly there can be no other satisfactory account given of this than that they have, like all other dead vegetable matter, suffered decomposition, and by means of the superincumbent pressure of other deposits of the oceans, and volcanic heats, have been changed and converted into seams of coal, as we now find them.\n\nThere they lay, containing a considerable quantity of ammonia, received from their contact with the animal deposits of the oceans, and which ammonia cannot be accounted for by the theory of formation from\nterrestrial vegetables, for these yield very little or no ammonia.\n\nIn proof of the diversity of marine production, I extract the following account of that immense sea plant the \"Fucus Giganticus\" from the celebrated Professor Liebig's familiar Letters on Chemistry.—Letter 11, page 34.\n\n\"We well know that marine plants cannot derive a supply of humus for their nourishment through their roots. Look at the great sea-tang, the Fucus Giganticus: this plant, according to Cook reaches a height of 360 feet and a single specimen, with its immense ramifications, nourishes thousands of marine animals; yet its root is a small body, no larger than the fist. What nourishment can this draw from a naked rock, upon the surface of which there is no perceptible change? It is quite obvious that these plants require only a hold—a fastening to prevent a change of place as a counterpoise to their specific gravity, which is less than that of the medium in which they float. That medium provides the necessary nourishment, and presents it to the surface of every part of the plant. Seawater contains not only carbonic acid and ammonia, but the alkaline and earthy phosphates and carbonates required by these plants for their growth, and which we always find as constant constituents of their ashes.\"\n\nAs some supposed astronomical causes are being produced in support of an idea that the dry land has existed several hundred thousand years, which is contrary to the interpretation of the Mosaic account, as explained in our system, and founded on the idea that\nthe coal seams have each taken thousands of years for formation from terrestrial vegetables, which idea is purely gratuitous; we have to call the attention of the reader to the note confirming our arguments for the marine formation of coal.\n\nADDITIONS\n\nTO THE GLOSSARY OF TERMS.\n\nAppetencies, a supposed aptness of matter to assume certain forms.\nAffinity, that particular attraction which Chemists observe different bodies have for each other.\nChaotic Mixture, a solution of all the solid substances of the Globe, supposed by the ancients to have existed.\nGalvanic Power, a species of electricity.\nGeology, the science of the various substances forming the interior and the crust of the earth.\nMatrix, the womb of material or spiritual substance.\nOrbits, the paths of the moons round their planets, and of the planets round their sun.\nSilicon, the metallic basis of siliceous earth or sand.\nSodium, a metal lately discovered by Sir H. Davy, to be the basis of soda, produced by marine plants.\nterms.\n\nAssume certain\n\nObservists observe\n\nSubstances of\n\nhave existed.\n\nforming the\n\nsubstance.\n\nplanets, and of\n\nsand.\n\nDavy, to be\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_34334.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 186, "total-input-tokens": 319984, "total-output-tokens": 64539, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 945, 3], [945, 3472, 4], [3472, 3472, 5], [3472, 3916, 6], [3916, 4070, 7], [4070, 5648, 8], [5648, 7461, 9], [7461, 9820, 10], [9820, 12250, 11], [12250, 13243, 12], [13243, 13243, 13], [13243, 14380, 14], [14380, 16037, 15], [16037, 17658, 16], [17658, 19269, 17], [19269, 20862, 18], [20862, 22387, 19], [22387, 23976, 20], [23976, 25528, 21], [25528, 27078, 22], [27078, 28576, 23], [28576, 30146, 24], [30146, 31745, 25], [31745, 33264, 26], [33264, 34784, 27], [34784, 36384, 28], [36384, 37912, 29], [37912, 39460, 30], [39460, 41113, 31], [41113, 42421, 32], [42421, 43388, 33], [43388, 44665, 34], [44665, 45997, 35], [45997, 47561, 36], [47561, 49175, 37], [49175, 50709, 38], [50709, 52191, 39], [52191, 53827, 40], [53827, 55363, 41], [55363, 56926, 42], [56926, 58488, 43], [58488, 60044, 44], [60044, 61643, 45], [61643, 63272, 46], [63272, 64559, 47], [64559, 66324, 48], [66324, 67940, 49], [67940, 69510, 50], [69510, 70990, 51], [70990, 72558, 52], [72558, 74162, 53], [74162, 75706, 54], [75706, 77258, 55], [77258, 78843, 56], [78843, 80421, 57], [80421, 82047, 58], [82047, 83673, 59], [83673, 85172, 60], [85172, 86767, 61], [86767, 88310, 62], [88310, 89876, 63], [89876, 91474, 64], [91474, 93089, 65], [93089, 94586, 66], [94586, 96138, 67], [96138, 97674, 68], [97674, 99246, 69], [99246, 100779, 70], [100779, 102400, 71], [102400, 103951, 72], [103951, 105624, 73], [105624, 107239, 74], [107239, 108860, 75], [108860, 110181, 76], [110181, 110181, 77], [110181, 111338, 78], [111338, 112854, 79], [112854, 114474, 80], [114474, 116087, 81], [116087, 117696, 82], [117696, 119294, 83], [119294, 120870, 84], [120870, 122365, 85], [122365, 123929, 86], [123929, 125429, 87], [125429, 127350, 88], [127350, 128843, 89], [128843, 130436, 90], [130436, 132037, 91], [132037, 133457, 92], [133457, 135040, 93], [135040, 136621, 94], [136621, 138267, 95], [138267, 139903, 96], [139903, 139903, 97], [139903, 139903, 98], [139903, 139903, 99], [139903, 141489, 100], [141489, 143043, 101], [143043, 144650, 102], [144650, 146230, 103], [146230, 147865, 104], [147865, 149450, 105], [149450, 150921, 106], [150921, 152514, 107], [152514, 154135, 108], [154135, 155730, 109], [155730, 157270, 110], [157270, 158840, 111], [158840, 160415, 112], [160415, 161817, 113], [161817, 163405, 114], [163405, 164782, 115], [164782, 166415, 116], [166415, 167919, 117], [167919, 167919, 118], [167919, 169333, 119], [169333, 169333, 120], [169333, 170786, 121], [170786, 172521, 122], [172521, 174360, 123], [174360, 176093, 124], [176093, 177719, 125], [177719, 178893, 126], [178893, 180568, 127], [180568, 180568, 128], [180568, 181949, 129], [181949, 183677, 130], [183677, 185383, 131], [185383, 187049, 132], [187049, 188748, 133], [188748, 190411, 134], [190411, 191258, 135], [191258, 191258, 136], [191258, 192662, 137], [192662, 194147, 138], [194147, 195648, 139], [195648, 197187, 140], [197187, 198700, 141], [198700, 200217, 142], [200217, 202125, 143], [202125, 203800, 144], [203800, 205476, 145], [205476, 207172, 146], [207172, 208892, 147], [208892, 210587, 148], [210587, 212337, 149], [212337, 214111, 150], [214111, 215813, 151], [215813, 217527, 152], [217527, 219145, 153], [219145, 220780, 154], [220780, 222466, 155], [222466, 224153, 156], [224153, 225873, 157], [225873, 227624, 158], [227624, 229342, 159], [229342, 231081, 160], [231081, 232637, 161], [232637, 234347, 162], [234347, 235924, 163], [235924, 237523, 164], [237523, 239293, 165], [239293, 241513, 166], [241513, 243141, 167], [243141, 244915, 168], [244915, 246641, 169], [246641, 248329, 170], [248329, 249983, 171], [249983, 251729, 172], [251729, 253387, 173], [253387, 254927, 174], [254927, 256202, 175], [256202, 257844, 176], [257844, 259512, 177], [259512, 261169, 178], [261169, 262854, 179], [262854, 264561, 180], [264561, 266266, 181], [266266, 267842, 182], [267842, 269393, 183], [269393, 270387, 184], [270387, 270522, 185], [270522, 270522, 186]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]