[{"id": "8ceab818deb0cc12b7de1288b19e5fa5ad22c3a9", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole ▽ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nLETTRES D'UN ÉMIGRANT\n\nOU\n\nVOYAGE AU CANADA\n\nPAR\n\nG. VEKEMAN\n\nBRUXELLES\nIMPRIMERIE ANTOINE LOGÉ\n10, Montagne-aux-Herbes-Potagères, 10\n\n1883\nLETTRÉS D'UN ÉMIGRANT\n\nOU\n\nVOYAGE AU CANADA\n\nPAR\n\nG. VEKEMAN\n\nSUIVIES D'UN APPENDICE SUR LE MANITOBA.\n\n---\n\nBRUXELLES\nIMPRIMERIE ANTOINE LOGÉ\n10, Montagne-aux-Herbes-Potagères, 10\n\n1883\nPRÉFACE.\n\nQuelques amis me donnent le conseil de publier sous forme de brochure mes lettres adressées du Canada au Lion Belge, de Bruxelles. Je me décide aisément à suivre ce conseil, malgré le peu de valeur littéraire desdites lettres qui n'ont, je le reconnais très humblement, d'autre mérite que leur sincérité et l'exactitude scrupuleuse des détails.\n\nJe n'y ajouterai pas grand'chose. Je n'y changerai rien.\n\nJe décris ce que j'ai vu, je dis sans détours ce que je pense; me croira et fera comme moi qui voudra. Je me mets de bon cœur à la disposition de ceux qui désirent émigrer, je ne pousserai jamais à l'émigration.\n\nÀ partir de ce jour, jusqu'au 10 mars prochain, on pourra me voir tous les jours depuis 8 heures du matin jusqu'à 6 heures du soir, rue d'Assaut, 12, à Bruxelles.\nJe dirai à mes futurs visiteurs, afin de leur épargner un voyage inutile : Ceux dont j'approuverais le départ pour le Canada, ce sont les cultivateurs ayant une nombreuse famille et possédant pour le moins un capital de 3,000 francs, dont ils auront besoin pour leur installation, comme ils le verront plus loin dans mes lettres.\n\nQuant aux célibataires, je ne leur conseille pas de partir s'ils ne peuvent disposer d'une somme de 500 à 600 francs, et s'il ne se sentent pas les forces, le courage et les aptitudes nécessaires pour s'engager comme ouvriers chez l'un ou l'autre fermier.\n\nOn ne doit donc, dans aucun cas, compter sur des avances de ma part : cela n'entre pas dans mes intentions et n'est pas d'ailleurs dans mes moyens.\n\nBruxelles, 12 février 1883.\n\nG. Vekeman.\nLETTRES D'UN ÉMIGRANT.\n\nI\n\nLévis, (Québec,) 4 septembre 1882.\n\nMon cher directeur,\n\nJe viens d'arriver à Québec, et, selon ma promesse, je vous envoie une relation succincte de mon voyage.\n\nComme je vous l'ai dit en partant, j'ai l'espoir de former au Canada une colonie belge; mais, n'étant l'agent d'aucune compagnie ni d'aucun gouvernement, je ne dirai jamais à mes compatriotes : Quittez votre pays pour aller vous établir dans telle ou telle contrée. Je vous ferai connaître la vérité, au sujet de la Terre promise, et si je trouve qu'on ne gagne pas au change, je dirai franchement, surtout aux cultivateurs : Restez où vous êtes ; ne quittez pas le certain pour l'incertain.\n\nQuoi qu'il arrive, mon voyage ne sera pas sans utilité pour vos lecteurs et tout particulièrement pour les campagnards.\n\nJe me suis embarqué à Anvers avec ma famille, le 19 août passé, à bord du Wakefield, espèce de steamer-omnibus qui charge un peu de tout ; des émigrants et\ndes touristes, des oignons et des peaux de vaches; ce qui fait que les vagues ne sont pas seules à donner le mal de mer aux passagers.\n\nUn de mes amis m'avait recommandé une dame allemande qui allait retrouver son mari quelque part au fin fond de la province d'Ontario; elle avait avec elle quatre petits enfants dont l'un n'a pas six ans; j'en ai quatre aussi, ce qui me mettait déjà à la tête d'un petit bataillon. Inutile de vous dire que je n'étais pas tout à fait à la noce quand tout ce monde a payé son tribut au père Neptune, ayant moi-même un compte à régler avec ce bonhomme, qui se plaît à rançonner cruellement les explorateurs novices de son empire.\n\nNous apercevions au loin le phare de Grimsby, lorsque tout à coup le vent se mit à souffler avec violence. Quelques bateaux à voiles, qui naviguaient à une petite distance, furent ballotés avec une violence telle, que l'un d'eux sombra. Je ne saurais dire si l'équipage, que nous avons vu un instant se débattre, a pu être sauvé; car une pluie très fine et cette espèce de poussière humide que le vent détache des vagues, nous empêchaient de suivre jusqu'à la fin les épisodes de ce drame émouvant. Nous avons vu trois bateaux de sauvetage, parmi lesquels un porte-fanal, tout rouge, le Buls, qui volaient au secours des naufragés.\n\nUn tel spectacle n'est pas fait pour donner du cœur à des femmes et des enfants qui n'ont jamais vu la mer. Cependant le Wakefield tenait bon, nous ne fûmes pas trop cahotés et les matelots se montraient si calmes et si tranquilles que nous partagâmes bientôt leur confiance.\n\nEnfin, voilà Grimsby-Docks; on jette l'ancre, le steamer s'arrête... et le mal de mer aussi. C'est un\nphénomène vraiment curieux : dès que le navire est amarré, dès que le roulis cesse, les plus malades sont guéris et ce sont souvent ceux qui ont le plus souffert qui se montrent les plus gais et les mieux disposés à faire honneur aux repas.\n\nDe Grimsby à Liverpool le voyage se fait en chemin de fer. Sauf ma famille, il n'y avait pas de Belges dans le train : des Allemands, rien que des Allemands. On me dit souvent que l'élément allemand ne dominera jamais en Amérique. Ceci est l'opinion des avant. Moi, pauvre campagnard, je me permets de croire le contraire. Les Allemands ont pour eux la patience; lorsqu'ils ont étudié, mûri un projet, ils le réalisent. S'ils doivent attendre un demi siècle, ils attendent et voilà tout. Mais la chose se fait. Les Prussiens de 1815 avaient dit : « Nous battrons les Français, » et ils les ont battus d'une façon formidable en 1870. Je suis convaincu que l'Allemagne veut jouer un grand rôle en Amérique : ses fils connaissent trop bien la géographie de ce pays, et leurs compatriotes s'y groupent d'une façon trop régulière. L'année passée il en est parti — chiffre officiel — au delà de 800,000. Cette année on en comptera un million.\n\nOn ne doit pas s'imaginer que tous les Allemands sont des affamés que la misère chasse de leur pays, ou des ignorants qui n'auront jamais une influence morale sur les populations de leur nouvelle patrie... Je fais la connaissance des voyageurs de mon compartiment : Joseph R... est architecte; Adolphe B... est serrurier. Ces braves jeunes gens ont reçu une éducation soignée : ils se montrent si prévenants, je dirais presque si paternels, pour nos petits enfants, que nous voudrions voyager jusqu'à la fin en leur société. Malheureusement nous devons nous\nquitter à Liverpool. Parmi les autres voyageurs se trouvent un professeur de musique, un tailleur, un peintre et deux cultivateurs. Tous ont le gousset bien fourni. La jeune dame et les quatre enfants qui m'ont été recommandés, portent avec eux le produit de la liquidation d'un magasin d'horlogerie. Tout ce monde pourra donc s'établir convenablement; chacun a son but, sa destination bien fixée; on quitte le vieux pays pour la nouvelle patrie. Ceux qui vivront dans une cinquantaine d'années verront si l'élément allemand sera sans influence et sans autorité en Amérique.\n\nEn quittant Grimsby, le chemin de fer traverse les plus belles campagnes du monde. De nombreux troupeaux, ayant de l'herbe jusqu'au ventre, se promènent dans d'immenses prairies. Les fermes, qu'on appelle ici cottages, ont l'air de petits châteaux. Seulement, elles sont clairsemées. On voit ici le système anglais : le campagnard est riche à millions ou il creve de faim. Les labours se font mécaniquement. Nous voyons des navets semés en lignes et ressemblant de loin à des parcs de choux; ils sont superbes et beaucoup plus avancés qu'en Belgique. Pour les blés, c'est le contraire : Tout le froment est encore debout, et c'est à peine si l'on voit par ci par là une moissonneuse fonctionnant dans un champ de seigle ou d'orge.\n\nMais les terres deviennent plus arides, les prairies font place aux rochers : nous voici en plein pays industriel. J'obtiens un succès colossal en donnant à mes compagnons de voyage quelques renseignements au sujet des charbonnages : il n'est pas étonnant que les Allemands s'instruisent, ils écoutent volontiers.\n\nNous traversons Sheffield et Manchester, où d'innombrables usines remplissent l'air d'une fumée si compacte,\nqu'on devine les villes plutôt que de les voir, et nous arrivons enfin à Liverpool où doit commencer la seconde étape de notre long voyage.\n\nComme je vous écris, non dans l'intention de vous entretenir de ma chétive personne, mais afin de rendre service aux émigrants belges, dont le nombre va augmenter d'année en année, je remettrai à une prochaine lettre le récit de mon voyage et je profiterai du temps et du papier qui me restent, pour commencer ma série des conseils utiles.\n\nL'émigrant doit serrer dans des coffres très solides, les objets dont il n'a pas besoin pendant le voyage. Pour s'en convaincre, il suffit de voir comment les colis sont descendus à fond de cale. On en attache de quatre à huit à la fois à une chaîne, on les enlève en l'air, la chaîne se tend, les faibles, écrasés par les forts, éclatent et perdent leur contenu. Donc, inutile d'emballer des objets fragiles.\n\nPour les objets dont on a besoin en route, on doit les serrer dans une petite valise bien solide et munie d'une excellente serrure. On ne doit pas les quitter un seul instant.\n\nJe conseille surtout aux voyageurs de se munir d'une bouteille de sirop de groseille, de quelques pommes bien sèches, d'un pot de confitures pas trop sucrées et d'un bon morceau de jambon.\n\nAdieu.... Je vais partir pour Sherbrooke, à 60 lieues de Québec, où je compte m'établir. En tout cas, c'est de là que j'espère vous adresser ma seconde lettre.\n\nVotre tout dévoué,\n\nJean Lacharrue.\nDE LIVERPOOL A QUÉBEC:\n\nSherbrooke, 19 septembre 1882.\n\nMon cher Directeur,\n\nNous sommes arrivés à Liverpool gais et bien portants, désireux de monter à bord du Polynesian et de voir enfin de près ce grand Océan Atlantique, qui sépare l'ancien monde du nouveau.\n\nSeulement, il ne s'agissait pas de courir, mais de partir à point, c'est-à-dire au jour fixé. Or, nous étions arrivés le lundi 21 août, et nous ne devions partir de Liverpool que le jeudi 24. Nous avions tout le temps, comme vous voyez, de visiter la ville.\n\nD'abord, nous nous rendîmes à l'Hôtel Mildenstein, situé Lydia Ann street, à deux pas de la gare, ce qui n'empêche pas les « vigilantiers » de nous réclamer deux shillings par voiture. « Das ist nicht billig…. » (Cela n'est pas bon marché) s'écrie Mme Boller, notre compagne de voyage, et nous trouvons qu'elle n'a pas tort.\nDevant la porte de l'hôtel, des marchandes couvertes de haillons nous offrent des oranges gâtées ; une vieille femme, affublée d'un châle des Indes qui a coûté autrefois des centaines de francs et qui aujourd'hui n'est plus qu'une loque repoussante, veut absolument nous faire acheter une énorme bague avec une pierre précieuse grosse comme un œuf de pigeon. Elle jure en anglais, en français et en allemand que ce joyau vaut plus de cent francs et qu'elle veut nous le donner pour cinq..... parce qu'elle aime les étrangers. Nous la prions en flamand de s'en aller au diable, qui doit être pour le moins son cousin. Cinq ou six gamins déguenillés s'accrochent à nos jambes et se mettent à cirer nos bottines : il faut plus d'un coup de pied pour chasser cette marmaille, à la grande joie d'un gavroche crasseux, qui crie les dernières nouvelles de la guerre en nous fourrant sous le nez une chose qui ressemble très bien à un mouchoir sale et qu'il a la prétention de faire passer pour un journal. Tout ce monde est nu pieds... à moins qu'on ne regarde pour une chaussure une couche épaisse de boue et de poussière.\n\nL'Hôtel Mildenstein est encombré. Une vingtaine de familles danoises, norvégiennes et suédoises viennent de l'envahir. Deux femmes se promènent au milieu de la cour portant, dans d'énormes paniers en forme de berceau, leurs derniers nés qui crient de la belle façon. Il y a là au moins une vingtaine de femmes qui vont rejoindre leurs maris dans le nouveau pays. Comme elles ont chacune en moyenne une bonne demi douzaine d'enfants, pas n'est besoin de dire que ce petit monde fait un tapage étourdissant.\n\nNous installons le mieux possible nos effets, et nous\nnous apprêtons à partir pour faire un tour en ville, lorsque deux braves Allemands, nos compagnons de voyage à bord du Wakefield, se jettent dans nos bras. Ils avaient appris, Dieu sait comment, que nous étions à l'hôtel Mildenstein, et ils ne voulaient pas nous laisser partir sans nous souhaiter un bon voyage. Quant à eux, ils devaient partir le mercredi à bord du City of Rome, de l'Inman Line.\n\nLes Allemands semblent créés pour l'émigration. Pendant que nous courions après nos bagages dans la gare de Liverpool, et que nous perdions la tête parce qu'un tas de choses manquaient à l'appel, les hommes du Nord débouclaient paisiblement leurs valises, en tiraient des provisions énormes de pain, de saucisson et de cornichons, distribuaient tout cela aux femmes et aux enfants, sans se presser le moins du monde ; puis, tout en mangeant eux-mêmes une croute sur le pouce, ils retrouvaient leur bien, le classaient et le préparaient pour le grand voyage.\n\nNos deux compagnons semblaient connaître la ville comme s'ils l'eussent habitée pendant plusieurs années. Cependant ils y venaient pour la première fois ainsi que nous. Ils s'orientaient parfaitement et parcouraient sans hésitation les innombrables rues du plus grand port de mer européen.\n\nLiverpool a une population de plus de 600,000 âmes, et jamais je n'ai vu de ville plus animée. À certaines places, par exemple près des docks, il n'est pas rare de voir cinq ou six voitures du tramway et autant d'omnibus roulant sur un espace de moins de cent mètres. Les docks eux-mêmes sont une merveille ; ils sont construits en bois et s'abaissent ou s'élèvent avec\nla marée. Leur étendue est immense, et l'on peut les comparer sans exagération à une ville flottante.\n\nJe ne ferai pas la description de Liverpool ; cela me mènerait trop loin. Quelques lignes seulement, afin qu'on ne me prenne pas pour un indifférent :\n\nLes musées de Liverpool sont d'une richesse inouïe, surtout le musée d'histoire naturelle. Ceux de Paris et de Bruxelles ne sont rien à côté de ces superbes collections. J'ai remarqué tout particulièrement un gorille de dimensions si colossales et auquel le préparateur a fait prendre une pose si menaçante, qu'on ne saurait songer sans frayeur à la position critique du voyageur attaqué par cet habitant terrible des forêts tropicales.\n\nLes musées sont entourés d'un si grand nombre de monuments remarquables, que cet endroit de la ville pourrait bien s'appeler le musée des monuments : Statues équestres de la reine Victoria et du prince Albert, monument de Wellington, Palais de justice, squares, hôtels, fontaines gigantesques... en un mot, de quoi orner pour le moins une douzaine de villes.\n\nLiverpool est la cité des grandes réclames commerciales. Sur les ponts, les passerelles et les salles-abris des docks, sur toutes les voitures des tramways, sur les omnibus, sur tous les murs où il y a des places à louer, partout où il est possible de coller une réclame, on lit en lettres colossales le nom qui finit, malgré vous, par vous rester continuellement devant les yeux : Lewis. Nous n'avons pas encore fait cent pas sans avoir reçu plusieurs cartes sur lesquelles nous lisons :\n\nLewis's in Ranelagh st. — Sells the best articles at the most reasonable prices.\n\nLa maison Lewis possède assez de statues et de man-\nnequins pour faire la concurrence au musée Castan. Le premier jour nous y avons vu, devant une vitrine haute comme un second étage, au milieu de vêtements pour dames et d'ombrelles perfectionnées, ARABI-PACHA, le grand rebelle. Le lendemain, toute la famille royale et le troisième jour une collection de bébés, frais et roses, qui ne se portent si bien que parce que leurs mamans les ont fait habiller chez Lewis.\n\nDans cette maison immense, on peut se procurer tout ce qui est nécessaire, utile ou agréable. Vêtements, chaussures, articles de ménage, de chasse, de pêche, etc., etc., des et cætera jusqu'à demain matin. Tout se fabrique le plus possible dans la maison même. Les ouvriers cordonniers, au nombre de deux cents, occupent de vastes ateliers dans une galerie couverte où tout le monde a accès. Tout s'y fait à la machine : on coupe pour le moins vingt semelles, pendant qu'un de nos ouvriers en tracerait une seule. Bref, je vous dirai ce que me crirent vingt commissionnaires munis de placards immenses, et je répéterai ce que je lis sur les innombrables cartes et circulaires qui me sont offertes : « Allez chez Lewis, et vous serez émerveillé!... »\n\nJ'en ai assez, je suis ébloui, étourdi, assommé. Je me sauve dans un bar pour m'y payer un verre de pale-ale. Mais il est écrit que Lewis me poursuivra partout... Je prends une allumette pour allumer ma pipe, et... sur cette étroite bande de bois, je lis encore : « Ailez chez Lewis!... »\n\nNous visitons quelques chapelles catholiques où nous rencontrons des émigrants allemands qui prient dévotement. Qu'ils ont bien raison! Celui qui quitte son pays pour chercher au loin une meilleure position doit comp-\nter sur son courage, sur son travail et tout particulièrement sur la bénédiction d'en haut. Tous les calculs, toutes les prévisions de la raison humaine ne sont qu'erreur et mensonge, quand la Providence ne s'en mêle pas. J'en fais l'expérience aujourd'hui. J'avais étudié, mûri mon plan pendant des mois et des années ; cependant rien de ce que j'avais entrevu n'arrive. À moins d'avoir ici des amis qui vous préparent la voie, l'imprévu joue un grand rôle dans la vie des émigrants : il faut être sur les lieux pour savoir ce qui est bon ou mauvais. De loin on juge mal. Je me suis confié, avec toute ma famille, à la divine Providence ; avant de quitter la Belgique, j'ai prié et des amis sincères sont venus prier avec moi au pied des autels, ce dont je les remercie encore aujourd'hui. Eh bien!... je suis très heureux maintenant d'avoir agi de la sorte... Je suis arrivé dans une partie du pays dont je n'avais jamais entendu parler, dans une ville dont j'ignorais jusqu'au nom, et cependant j'y ai rencontré des coeurs dévoués, j'ai trouvé, à une petite distance, de belles fermes où j'espère établir avant peu quelques-uns de mes compatriotes, et, un peu plus loin, des terres immenses dont l'inépuisable fécondité promet d'abord l'aisance et ensuite la fortune aux colons honnêtes, courageux et persévérants qui viendront les cultiver.\n\nDans une prochaine lettre je raconterai la traversée qui n'a pas été tout à fait ce qu'on appelle un voyage de plaisir.\n\nAvant de terminer celle-ci, j'ajouterai quelques bons conseils pour les émigrants.\n\nNe quittez pas Anvers sans vous être procuré chez un changeur un peu de monnaie anglaise, afin que vous ne\nsoyez pas forcés de recourir à l'obligance des cabare-\ntiers anglais parmi lesquels il s'en trouve qui vous\ndonnent de 15 à 16 francs pour un louis de 20 francs.\nQuant à votre magot, échangez-le contre des dollars\naméricains, qui ont également cours au Canada ou\ncontre de l'or anglais ou américain.\n\nD'ailleurs, si le bon Dieu me prête vie et santé, je\nretournerai pour quelques semaines en Belgique vers le\nmois de janvier ou de février, afin d'y donner des confé-\nrences sur l'émigration dans toutes les localités flamandes\net wallonnes où l'on voudra bien mettre une salle à ma\ndisposition.\n\nJe tâcherai également de répondre aux lettres que\nm'adresseront ceux qui auront l'intention de me suivre\nau Canada ou de se diriger vers l'une ou l'autre province\ndes États-Unis.\n\nJe fais en ce moment des voyages d'exploration dont\nje rendrai compte dans ce journal..... J'ai visité les can-\ntons de l'Est, les bords du lac Mégantic, le canton de\nBrompton, les nouvelles cités de Nantes et de Channay,\net je suis revenu émerveillé.\n\nCe voyage fera le sujet d'une de mes lettres. Je pars\ndemain pour Montréal et Ottawa.\n\nDès maintenant je puis dire en toute vérité : Ah ! que\ncertains cultivateurs belges ont tort de s'échiner pour un\nsalaire dérisoire, tandis qu'ici il suffit de posséder quel-\nques centaines de francs, deux bons bras, du zèle et de\nl'ordre pour conquérir en peu d'années, sinon la for-\ntune, du moins une honnête aisance que connaissent de\nnos jours bien peu de fermiers belges.\n\nAgréez, mon cher Directeur,.....\n\nJean Lacharrue.\nIII\n\nDE LIVERPOOL A QUÉBEC.\n\nSherbrooke, 29 septembre 1882.\n\nLe Polynesian est à l'ancre, au milieu de la rade. De petits vapeurs vont et viennent avec rapidité du gigantesque steamer à la terre ferme : ils sont occupés à compléter la charge de l'énorme maison flottante que nous allons habiter pendant douze jours.\n\nDouze jours ! cela me paraissait bien long, et cependant j'ai rencontré ici grand nombre d'émigrants qui, embarqués sur des navires à voiles, ont mis jadis soixante jours et plus pour faire la traversée....\n\nNous voici à bord, nous nous installons le mieux possible, nous disons adieu, de loin, en agitant nos mouchoirs, à nos amis Allemands qui ne partiront que demain ; l'ancre est levée, un coup de sifflet strident retentit et, à la grâce de Dieu !....\n\nIl est 5 1/2 heures du soir. Le temps est magnifique, tous les passagers sont gais et bien portants. On rit, on chante ; les gourdes circulent, les pipes s'allument... et\nles marins rient dans leur barbe en songeant à la triste mine que feront dans quelques heures tous ces hommes dont la joie bruyante semble détourner le mal de mer et la tempête.\n\nPeu à peu l'immense cité disparaît dans la brume. Déjà on ne distingue plus que le faîte des plus grands édifices, que dorent les derniers rayons du soleil couchant. Au haut d'une tour carrée j'aperçois toujours l'appareil qui annonce aux marins l'état de la mer : il nous promet une tempête, ce que je me garde bien d'annoncer à ma petite famille.\n\nUne bande innombrable de mouettes suivent le navire à une très grande distance. À huit heures du soir, j'en compte encore une vingtaine qui voltigent à l'arrière.\n\nNous sommes à bord sept cents et quelques passagers. Ceux de la première classe ont de très belles cabines, et les voyageurs qui occupent les secondes et les intermédiaires n'ont pas à se plaindre. Mais ceux qui occupent l'entre-pont !... Pour les femmes et les petits enfants, des lits cloisonnés, où l'air et l'espace manquent ; pour les hommes, des hamacs assez commodes, mais tellement serrés les uns contre les autres, que les dortoirs ont l'air d'immenses séchoirs où sont étendus des draps de lits de toile grise dont on a oublié de chasser les dormeurs. Il est vrai que les passagers de troisième classe payent pour leur voyage une somme si minime, qu'on ne sait comment les propriétaires des navires s'y retrouvent. (1)\n\nEn effet, d'Anvers à Québec on paye, par adulte, le modique prix de 120 francs, moitié de cette somme pour\n\n(1) Depuis mon retour en Europe j'ai pu obtenir des directeurs de l'Allan-Line la promesse formelle que le « logement » des émigrants sera désormais beaucoup plus confortable. L'air et l'espace ne leur manqueront plus.\nles enfants de 1 à 12 ans, et rien pour les nourrissons.\n\nEt pour cela on obtient :\n1° Le voyage en bateau à vapeur d'Anvers à Grimsby ;\nen route, quatre repas ;\n2° Le voyage en chemin de fer de Grimsby-Docks à Liverpool, et un repas ;\n3° Séjour de 2 1/2 jours à Liverpool, logement et 7 repas ;\n4° Traversée de Liverpool à Québec, en 10, 11 ou 12 jours et 30, 33 ou 36 repas.\n\nArrivé à Québec, le colon est transporté gratuitement avec tous ses bagages à la gare qu'il désigne; mais cette partie du voyage se fait aux frais du gouvernement canadien.\n\nOn le voit, la Compagnie Allan ne s'enrichira pas au détriment des voyageurs de 3ème classe. J'ajouterai qu'elle exige de tous ses employés beaucoup d'urbanité à l'égard des passagers, et je dois dire que cette recommandation est rigoureusement suivie. Les matelots surtout m'ont étonné; je n'ai pas retrouvé en eux les loups de mer sauvages et rageurs mis en scène par les romanciers; ils sont polis, toujours prêts à rendre service, surtout aux petits enfants, dont les jeux et les cris joyeux semblent les amuser beaucoup.\n\nJe me permettrai cependant de signaler une lacune regrettable : aucun employé du Polynesian ne parle le français ou le flamand. Seuls deux stewards connaissent quelques mots allemands. Presque tous les jours j'ai dû servir d'interprète à de pauvres diables que je ne comprenais moi-même qu'à moitié. Donc un bon interprète, s. v. p. messieurs de l'Allan-Line; cet employé ne vous coûtera pas cher, puisqu'il pourra s'occuper d'autre chose que de\nses traductions orales, et il rendra de grands services à tout le monde.\n\nLes passagers de seconde classe, des cabines intermédiaires et de l'entre pont, font trois repas par jour. Pour les deux premiers, la table est une excellente cuisine bourgeoise. Les derniers reçoivent le matin du thé et du pain frais avec du beurre à discrétion; à midi, de la soupe, du bœuf ou du lard et des pommes de terre en robe de chambre. Vers 6 heures du soir, du pain frais, du beurre et du thé. On le voit, les mets offerts aux colons ne sont pas très recherchés, mais ils sont sains et abondants, et, après tout, meilleurs que ceux dont doivent se contenter nos ouvriers et grand nombre de petits fermiers.\n\nQuant aux passagers des premières cabines, on leur offre tout ce qui peut charmer les palais les plus difficiles, depuis les poulets de froment jusqu'aux conserves les plus fines. Ils ont à leur service des cuisiniers qui eussent été capables de plaire à M. Gambetta et d'éclipser l'illustre Trompette, et des pâtissiers dont les pièces montées mériteraient une place dans nos expositions nationales. Cependant, je n'envie pas leur sort : il y a au salon un piano, que certaines dames changent souvent pour leurs compagnons de voyage en instrument de torture.\n\nSomme toute, avec un peu de bonne volonté, du courage et quelques petites douceurs dans sa malle, on s'en tire parfaitement et le temps ne paraît pas trop long.\n\nJe pourrais maintenant, comme beaucoup d'écrivains qui éditent leurs mémoires sans quitter le coin de feu, raconter des histoires terribles, décrire des tempêtes, exagérer les dangers et les fatigues d'une traversée... Je\nme contenterai de copier quelques notes prises au jour le jour et qui ne seront pas, j'espère, sans intérêt pour vos lecteurs, parmi lesquels j'ai le bonheur de compter beaucoup d'amis.\n\nVendredi, 25 août. — Nous nous trouvons entre l'Ecosse et l'Irlande. Le temps est assez beau, mais le vent contraire; nous naviguons sans un pouce de voiles. Vers 10 1/2 heures, on jette l'ancre à Londonderry, au nord de l'Irlande. Nous nous trouvons au milieu d'un bassin magnifique, dont les bords, abruptes d'un côté, sont, de l'autre, couverts d'habitations coquettes, entourées de jolis jardins dont, malheureusement, la rigueur du climat exclut les arbres fruitiers et les plus belles fleurs.\n\nD'innombrables mouettes voltigent autour du steamer ou jouent à la surface de l'eau qui est, qu'on me permette l'expression classique, calme et unie comme un miroir. De petits groupes se forment sur le pont. On cause, on rit, on fume, on chante. Les Allemands surtout se distinguent; ils sont peu nombreux, car la plupart des voyageurs viennent de l'Ecosse, de la Suède, de la Norvège et du Danemark. Il n'y a qu'une seule famille belge, la mienne. Seulement, comme notre ami Matthys nous a fait, à mon fils et à moi, d'énormes toques en Astrakan et des paletots qui balaien le pont, on nous prend pour des Russes, et notre langage flamand passe pour le patois des fidèles sujet du Czar.\n\nUn jeune Prussien obtient un grand succès. Sa voix est belle, il chante juste, s'accompagne sur une guitare pas trop criarde et semble sentir parfaitement ce qu'il exprime. Je traduis sa romance :\n\nVoici le mois de mai; les arbres se couvrent de bourgeons;\nQu'il reste chez lui celui qui veut vivre au milieu des soucis;\nMais, comme les nuées voyagent dans la plaine azurée,\nMon cœur aspire après les grandes plaines du monde.\n\nCher père, bonne mère, que Dieu vous protège!\nQui sait si là-bas, au loin, le bonheur ne m'attend pas?\nIl y a tant de sentiers sur lesquels je ne mis jamais les pieds,\nIl y a tant de vin que je ne goûtai jamais.\n\nEn avant donc, gaiment en avant, à la joyeuse clarté du soleil,\nEn avant! par monts et par vaux.\nLes sources jaillissent, les arbres murmurent mélodieusement,\nEt mon cœur, comme l'allouette, bondit dans ma poitrine.\nEt mêle son chant à l'hymne de la nature.\n\nEt le soir, à l'entrée de la ville, je frappe à la première porte,\nHolà! patron, servez-moi de bon vin.\nEt vous, gai médiévier, accordez votre violon:\nJe veux chanter...\n\nEt si je ne rencontre pas d'auberge, quand tombe la nuit,\nJe dors sous la voûte du ciel; les étoiles me gardent,\nSecoués par le vent, les arbres me bercent doucement et m'endorment,\nEt le souffle caressant du zéphir m'éveille à l'aube.\n\nAh! se promener à travers les bois où l'air est libre et pur!\nJe sens là le souffle du Créateur qui pénètre dans ma poitrine;\nMon cœur jubile et chante, tout entier à la joie...\nAh! que vous êtes beau, ô grand monde du bon Dieu?...\n\nLe chanteur s'arrête. On applaudit à tout rompre.\nMême les passagers de 1re classe franchissent les barrières\nqui les défendent contre les invasions de leurs compa-\ngnons de voyage moins fortunés, et viennent prier le\nbarde tudesque de chanter encore. Il s'exécute de bonne\ngrâce et chante les gloires de l'armée qui battit si bien les\ntroupes de Napoléon III. Heureusement, il n'y a que deux\nFrançais à bord du Polynesian, et ils sont assez bons\nenfants pour ne pas se fâcher.\n\nMais, que signifie ce coup de sifflet? Un petit bateau\nà vapeur aborde, s'amarre à côté de son gigantesque\nconfrère et débarque une soixantaine d'Irlandais. On\nparvient à grand'peine à caser les nouveaux arrivés; l'ancre est levée, le Polynesian fait demi-tour et nous voguons vers l'Océan.\n\n*Samedi, 26 août.* — Je constate de grand matin le retour d'un hôte à qui personne ne souhaite la bienvenue : le mal de mer. Ils n'en meurent pas tous, il n'en meurt même personne, mais tous en sont frappés... Je me trompe, un Anglais, fort comme un hercule, se promène sur le pont où je me traîne péniblement. Il se moque de ceux qui payent leur tribut à Neptune, déclare que la force du caractère seule suffit pour préserver des atteintes de ce mal désagréable au suprême degré, et rit au nez à ceux qui se plaignent. Tout à coup, il jette son cigare, court au bastingage et... paie comme les autres, capital et intérêts largement comptés. On ne le plaint pas, cela va sans dire, et les plus malades trouvent la force de l'accabler de lazzis.\n\nLe vent est toujours contraire, quoique moins violent. Nous ne voyons plus que le ciel et l'eau, c'est-à-dire fort peu de chose, car cette immensité qui frappe le voyageur, d'après ceux qui n'ont pas voyagé, n'est pas visible à l'œil nu. L'horizon est au contraire très limité; on durait que le navire occupe le centre, le point le plus élevé d'une immense boule, sur laquelle s'abaisse, sous forme d'un globe à melons, la voûte azurée ou tachetée par les nuages. C'est en pleine mer qu'on comprend bien la forme sphérique de la terre. Quand un navire se montre au loin, on en voit les mâts longtemps avant de voir la coque.\n\nPas un oiseau, pas la moindre barque à l'horizon! Beaucoup de passagers se réunissent dans l'espace vide devant les cabines intermédiaires. Un *domine protestant,*\nqui se fait accompagner par trois violonistes convaincus mais mauvais musiciens, chante des cantiques, et les protestants présents font chorus. La séance se termine par un air de danse, ce qui amuse beaucoup les chanteurs, mais nous édifie médiocrement.\n\nLe soir, le vent devient violent et quelques vagues passent sur le pont. L'une d'elles me trempe des pieds à la tête. Deux voyageurs rient de ma mésaventure et sont sur le point de la raconter à leurs amis, lorsqu'une seconde vague, cinq fois plus forte que... la miennne, leur procure une douche gratuite qui leur fait perdre l'équilibre. En moins de cinq minutes le pont est désert.\n\nÀ l'entrepont la chaleur est étouffante, et le roulis si violent que beaucoup de passagers sont forcés de sortir de leur lit. Les femmes se lamentent et les enfants pleurent.\n\nDans les male steerages, dortoirs des hommes, les hamacs sont changés en escarpolettes. Je veux écrire à la lumière d'une lanterne gigantesque, mais le tangage est si fort que je juge utile de me glisser dans mes draps.\n\nLes vagues battent les hublots avec une violence inouïe, mais le navire est solide, la machine à vapeur marche avec sa régularité habituelle. Je dis mes prières du soir et je m'endors et invoquant l'Etoile de la mer.\n\nDimanche 27 août. — Quelle nuit!... Un de mes voisins a crié au secours sans se reposer un instant. Un autre voulait absolument s'en aller. Où?... il ne me l'a pas dit. À l'aube, le pont se remplit de malades, qui s'abritent le mieux possible contre le vent.\n\nLe règlement du navire prie tous les passagers de s'habiller le plus proprement possible le dimanche et les\njours de fête. Ce n’est pas aujourd’hui qu’il sera fait selon ce désir. Il est impossible de dire combien le mal de mer vous enlève votre force et votre énergie. Pour ma part, je n’ai pas le courage de me traîner jusqu’à la cabine où se trouvent ma femme et mes enfants, ou, plutôt, les forces me manquent. Je me lève, je veux marcher, mais je titube comme un homme ivre. J’ai beau m’accrocher à tout ce que je rencontre, je me vois forcé de retourner à mon lit.\n\nLundi 28 août.—Le temps est meilleur, mais le vent est toujours contraire. Je grimpe sur le pont, ce qui me coûte des peines inouïes. Les promeneurs sont rares, car il y a encore beaucoup de malades, puis, le vent venant de la mer glaciale, il fait froid comme en plein hiver.\n\nMardi 29 août.—Le navire va toujours bon train, malgré le vent contraire. Le nombre des malades diminue sensiblement. Moi, qui n’ai rien pris depuis samedi, je sens l’appétit qui revient. Vers midi, je me porte tout à fait bien, le mal de mer m’a quitté pour ne plus revenir. Il en est de même pour tous les membres de ma famille; j’ajouterai que les plus jeunes de mes enfants ont été simplement indisposés, mais jamais sérieusement malades. J’en dirai autant des innombrables mioches de toute nationalité, qui jouaient et mangeaient gaiement pendant que leurs parents criaient miséricorde.\n\nLe mal de mer est un vilain mal, mais, heureusement, on n’en meurt pas. Puis, il ne dure pas longtemps : pour les uns quelques heures, pour d’autres un ou deux jours, rarement trois. Il y a des exceptions : quelques voyageurs ne sont pas malades, d’autres le sont pendant toute la traversée. Après tout, je puis dire que c’est un mal... qui\nfait du bien. Ne riez pas, lecteur. Je compare le mal de mer à un remède très violent ; il extirpe, jusqu'au dernier atome, tout ce qu'on a de mauvais dans le corps, et lorsqu'il vous quitte, il cède la place au plus dévorant des appétits. Pour ma part, je me sentais de force à dévorer un dragon, y compris son cheval, les éperons et la bretelle de sa carabine.\n\nUn oiseau, gros comme un pigeon, rase la surface de l'eau. Je songe à la colombe de l'arche et je veux connaître l'heure à laquelle ce brave messager m'apparaît. Il est 1 1/2 heure.\n\n— 11 1/2 heures, me dit un passager.\n\n— Pardon, monsieur, ma montre a plutôt le défaut de retarder que d'avancer.\n\n— C'est possible, reprend mon interlocuteur, mais nous ne sommes pas ici à Bruxelles. Voyez...\n\nEt il déroule une carte sur laquelle il m'indique le point où nous nous trouvons. Dans deux jours nous serons en vue de New-Foundland (Terre-Neuve), et nous apercevrons probablement des montagnes de glace.\n\nEn voilà assez pour aujourd'hui. J'ai beaucoup voyagé cette semaine, comme j'espère vous le raconter plus tard, chers lecteurs, et je suis très fatigué. Au Canada comme en Belgique, le sommeil réclame ses droits, et je vais prendre un peu de repos.\n\nEncore un mot.\n\nJ'ai visité des contrées admirables et je plains de bon cœur les fermiers belges qui peinent du matin au soir sans être pour cela plus riches à la fin de l'année qu'au commencement.\n\nAgréz, mon cher directeur, mes salutations très sincères.\n\nJean Lacharrue.\nSherbrooke, 6 octobre 1882.\n\nJe tâcherai de terminer, dans la présente lettre, le récit de mon voyage de Liverpool à Québec. Voilà d'ailleurs assez longtemps que nous sommes en route, vos lecteurs pourraient trouver le voyage trop fatigant. J'ai d'ailleurs tant de choses à vous dire au sujet de mes excursions dans les différentes provinces du Canada! Mais, comme on ne saurait brider le cheval par la queue, ni commencer une maison par le toit, nous allons achever de passer l'Océan le plus rapidement possible. Comme dans ma dernière lettre, je copie, par ordre de date, les feuillets de mon carnet.\n\nMercredi, 30 août. — Temps couvert mais doux, et vent favorable, enfin. Nous naviguons toutes voiles déhors, et le Polynesian fend l'onde comme une flèche. Tout à coup un brouillard épais entoure le navire; on ne voit pas à cinquante pas. Cela dure environ trente minutes, puis le soleil apparaît, brillant d'un éclat extraordinaire, et dissipe le brouillard. Ce phénomène se renouvelle d'heure en heure jusque vers midi.\n\nVers dix heures un petit oiseau, ressemblant assez bien au pinson, vient se percher sur un rouleau de cordes, à l'avant du navire. La pauvre petite bête est toute frileuse;\nc'est sans doute le vent qui l'empêche de retourner à terre.\n\nUn domine protestant fait de la propagande. Il vient me dire qu'il connaît un « petit morceau de français » et m'invite à chanter des cantiques avec d'autres fidèles déjà réunis à l'entre pont. Je refuse, naturellement, mais je vais écouter les choristes improvisés. Les sempiternels violonistes sont là et jouent plus faux que jamais.\n\nLe soir, les chants reprennent. Puis, un sermon... à deux; quand un domine est fatigué, un autre prend la parole. Après cela... un air de danse et, en avant deux! Les pieuses miss tourbillonnent gaiement jusqu'à une heure très avancée. C'est très édifiant!...\n\nJeudi, 31 août. — Temps couvert et vent contraire. Nous n'avançons pas très vite, mais il n'y a presque pas de tangage; il vaut mieux avoir le vent en face que de côté; car, dans ce dernier cas, il faut avoir le pied marin pour s'aventurer sur le pont ou même pour aller, à l'intérieur du navire, d'un endroit à un autre. On a beau se soutenir à droite et à gauche, on avance à peu près comme un bébé qui risque ses premiers pas.\n\nDeux mouettes voltigent dans les eaux du Polynesian; encore un peu de patience, et nous verrons les côtes de Terre-Neuve, d'un côté, et celles du Labrador, de l'autre. Après quoi nous aurons encore environ 700 milles à parcourir pour arriver à Québec.\n\nVers trois heures, plus de vingt petits oiseaux, parmi lesquels une bécassine, viennent se reposer sur le pont et becqueter les miettes qu'on leur jette.\n\nTout à coup le cri : Une baleine! une baleine! attire tout le monde vers l'avant. En effet, une baleine passait lentement à quelques encablures du navire. Elle n'était\npas très grande et laissait voir à peine une partie de son dos ; elle ne daigna pas même faire « jouer les eaux. » Plus tard nous en vîmes encore trois, aussi petites et aussi modestes que la première.\n\nQuelques minutes après, un autre cri retentit, plus agréable, celui-là : Terre ! terre !\n\nEn effet, au loin se dessinait une ligne d'un bleu noirâtre, aux arêtes aiguës, immobiles. Nous constatons que nos yeux ne nous trompent pas. Ce n'est pas une nuée, ce n'est pas le mirage, c'est bien la terre ferme. À mesure que nous avançons, les contours deviennent plus nets ; nous apercevons bientôt très distinctement un cap qui s'avance assez loin dans la mer. Sur un rocher s'élève un petit fort ; nous approchons toujours. Une petite colonne de fumée couronne le fort et un coup de canon retentit. On nous salue. Le Polynesian répond de son mieux à cette politesse, en faisant fonctionner le sifflet de sa puissante machine. Trois hommes sortent du fort, arborent un drapeau rouge : notre steamer s'empressa d'en faire autant. Les hommes montent dans une petite embarcation et se dirigent de notre côté. Le steamer ralentit sa marche, jette une corde au bateau qui se range, faible coquille de noix, à côté du colosse. Un pilote monte à bord et ses deux compagnons s'en vont, après avoir embarqué une tonne de lard, quelques sacs de biscuits, une demi-douzaine de fines bouteilles et pas mal d'autres bonnes choses dont la nomenclature serait trop longue, comme disent les notaires.\n\nVers quatre heures, nous voyons flotter, à une assez grande distance, d'immenses montagnes de glace. Si nous tournions à droite, nous serions bientôt au Groen-\nland; comme nous n'avons nulle envie de faire la concurrence à Nordenskiold, nous sommes bien heureux de savoir que nous allons tourner à gauche et entrer dans le golfe Saint-Laurent. Au bout de quelques heures, c'est-à-dire au commencement de la nuit, nous nous apercevons très bien que nous voguons vers le Sud. Il fait moins froid. La mer est aussi beaucoup plus calme. Notre voyage n'est plus qu'une promenade. Tout le monde est gai et le steward chargé de la vente des petites bouteilles de pale-ale a beaucoup de besogne. Quoique la bière anglaise ne vaille pas notre bon uitzet et pas même le faro de Bruxelles, j'en achète une demi-douzaine de bouteilles que nous vidons en famille à la santé de nos amis du « vieux pays » et, après avoir causé bien longtemps, le dos appuyé contre les revêtements de la machine qui nous abritent et nous chauffent, nous allons demander à un sommeil réparateur des forces pour les fatigues et les émotions du lendemain. Inutile de dire que nous n'oubliions pas de remercier le bon Dieu et la Sainte Vierge qui nous ont si bien protégés pendant la traversée.\n\nVendredi 1er septembre. — Nous sommes sur le pont au lever de l'aurore. Le ciel est bleu, le vent à peine sensible et le golfe n'a pas une ride. Les petits oiseaux nous reviennent plus nombreux que la veille; ils semblent nous souhaiter la bienvenue. Hélas! leur joie n'est pas de longue durée. Quatre éperviers fondent sur eux et les assassinent. Les brigands! Ils dévorent leur proie sous nos yeux, à cinq pas de nous. Jamais je n'ai vu chose pareille en Belgique, où les éperviers se cachent, sachant bien qu'il leur en cuirait s'ils se mettaient à portée de fusil d'un campagnard, surtout depuis que les sociétés\ncolombophiles ont mis leur tête à prix. Nous crions, nous lançons aux voraces bandits tout ce qui nous tombe sous la main; un Irlandais en atteint même un avec sa pipe sacrifiée dans un moment d'indignation, mais rien n'effraie ces gaillards qui ont sans doute jeûné pendant plusieurs jours. Ils achèvent paisiblement leur repas sanglant et s'en vont tout à l'aise. Savent ils peut-être qu'à bord des navires l'usage des armes à feu est rigoureusement interdit?....\n\nVoici maintenant l'île d'Anticosti. Pendant que nous l'examinons avec nos longues vues, le navire traverse une armée innombrable de marsouins. Il y en a des milliers et des milliers qui, tout étonnés de sentir la plaine liquide tout-à-coup troublée par l'hélice du steamer, font des bonds prodigieux, et se livrent au milieu des vagues à une espèce de handicap qui nous amuse beaucoup.\n\nLe soir, nous sommes en plein fleuve Saint Laurent. Quel magnifique cours d'eau! Consultez la carte, et vous verrez que Québec est déjà fort avant dans les terres. Eh bien! Montréal, bâti comme Québec sur le Saint-Laurent, est situé à soixante lieues plus loin, et près de cette ville le fleuve a encore deux milles de large!...\n\nÀ Rémouski, un petit vapeur vient prendre la malle et quelques voyageurs. L'énorme tas de sacs remplis de lettres et de journaux prouve que les relations entre l'ancien et le nouveau monde sont très suivies.\n\nSamedi 2 septembre. — Le soleil du Canada nous souhaite la bienvenue. Le temps est superbe, l'air est tiède, et nous admirons le superbe panorama qui se déroule sous nos yeux. Le long de la rive sont bâties des centaines, des milliers de petites cabanes blanches toutes habitées par des pêcheurs. Le Saint-Laurent\npourrait s'appeler une fabrique à poissons. Plus on en prend, plus il en vient. On fait des milliers de tonnes d'huile avec la graisse des marsouins, des loups de mer et des baleines qu'on va pêcher au large. Il y a même des cultivateurs qui fument leurs champs de pommes de terre avec des poissons. Cela peut paraître invraisemblable, mais c'est ainsi.\n\nVoici, au surplus, quelques détails que je trouve dans la brochure d'un explorateur français, M. Paul de Cazes :\n\n« Chacun sait que les pêcheries canadiennes sont des plus considérables et des plus productives qui soient au monde.\n\n» La longueur des côtes maritimes des provinces de Québec, du Nouveau-Brunswick et de la Nouvelle-Écosse, sans tenir compte des anfractuosités du rivage, est évaluée à 2,879 milles ou 4,632 kilomètres, et le privilège exclusif de la pêche sur ces côtes, sauf les concessions établies par les traités, s'exerce pour les pêcheurs canadiens sur environ 9,947 milles carrés.\n\n» On apprécie, en outre, la superficie collective de la partie canadienne des grands lacs Supérieur, Michigan, Huron, Érié et Ontario à au moins 121,931 milles carrés.\n\n» Il y a encore, dans le Nord-Ouest, les lacs Winnipeg, Manitoba, Winnépegosis (1) qui représentent collectivement une superficie de 12,336 milles carrés.\n\n(1) M. de Cazes ne cite pas le lac Saint-Jean, le Mégantic et d'autres lacs qui ne paraissent pas dignes de mention dans ces pays des grands lacs, mais que j'ai admirés à cause de leur étendue et de leur utilité. Les cultivateurs vont y prendre leur provision de poissons comme dans un réservoir qui ne s'épuise pas.\n» Comme on le voit, le champ est suffisamment vaste pour permettre aux pêcheurs canadiens de retirer de beaux bénéfices d'une industrie à laquelle se livrent, à l'exclusion de presque tous autres, les habitants des côtes qui, au nombre d'au moins 200,000, vivent uniquement du produit de leur pêche. »\n\nLes pêcheurs canadiens sont généralement loin d'être riches; ceux du Labrador sont même, en ce moment, dans la misère. Et cela n'est pas étonnant. Comme les fabricants belges, les pêcheurs canadiens ne sauraient se débarrasser dans de bonnes conditions de leurs marchandises qui, présentées en trop grande quantité, ne tentent pas assez l'acheteur. Le hareng du Labrador est délicieux, mais on en prend trop; quant aux huitres, pour quelques centins (sous) on s'en procure un régal pour toute une famille. J'ai acheté du saumon à cinquante centimes la livre!... Les pêcheurs de ce pays, en pêchant trop, pêchent contre les règles de l'économie. Ils devraient apprendre un second métier et s'occuper davantage du premier de tous les métiers, je veux dire de l'agriculture. Seulement, cela ne changera pas encore de sitôt: le Canadien est généralement têtu et routinier. Ce que son père a fait, il le fait aussi. Vouloir changer ses habitudes, c'est entreprendre une chose bien difficile.\n\nPour en finir avec la pêche canadienne, je vous dirai que ce pays a exporté en 1881 :\n\n| Produit     | Exportation en piastres |\n|-------------|-------------------------|\n| Morue et merlan | 3,476,844                |\n| Maquereau   | 801,586                  |\n| Hareng      | 429,722                  |\n| Saumon      | 470,502                  |\n\n(1) Une piastre vaut fr. 3-25 de notre monnaie.\nLa pêche de l'alose, des huitres et du homard a produit des sommes énormes. On a exporté du homard en conserves pour une somme de 1,347,901 piastres. L'huile du loup marin, de la baleine et du marsouin est aussi une grande source de revenus pour les pêcheurs des côtes.\n\nMais, laissons là, pour le moment, les pêcheurs et les poissons et poursuivons notre voyage, ou plutôt, arrivons à Québec, car il n'y a plus rien de bien remarquable à mentionner. Nous abordons vers sept heures du matin à Lévis, petite ville bâtie en face de Québec, sur la rive droite du fleuve. On débarque les colis; une nuée de propriétaires ou d'employés d'hôtel s'apprêtent à faire leur cour aux voyageurs; tout le monde se rassemble sur le pont, chacun se montre heureux de mettre pied à terre et de quitter enfin la maison flottante où l'on s'est trouvé trop à l'étroit. Les bébés surtout battent des mains et Fiñé, ma petite fille, me demande si, dans le nouveau pays, nous aurons un grand jardin. Cela ne sera pas bien difficile : ici on appelle petite exploitation une ferme de 100 acres ou 40 hectares et quelques ares.\n\nEnfin nous voici sur la terre ferme! Mais tout n'est pas fini, comme vous verrez dans ma prochaine lettre.\n\nUn bon conseil — comme toujours — avant de finir.\n\nCeux qui veulent émigrer doivent surtout se procurer de bons coffres, munis d'excellentes charnières et de solides serrures; ils doivent aussi emballer soigneusement leurs objets fragiles et en emporter le moins possible. Je crois l'avoir déjà dit : pour descendre les colis à fond de cale et pour les remonter, on en attache cinq ou six ensemble à la chaîne d'une grue mue par la vapeur. Cette machine marche avec une rapidité brutale : en moins\nd'une heure, on monte ou on descend un bon millier de coffres et de caisses. Malheur aux faibles!...\n\nNous jouissons ici d'un temps superbe. Presque toutes les nuits, nous avons une petite gelée blanche; le jour, la chaleur est assez forte. On en profite pour sécher et rentrer les derniers fourrages. Par ci, par là, on commence les défrichements, qui se font ordinairement en hiver. La saison des neiges est ici le temps de la plus grande activité; c'est alors que se transportent le bois et les céréales.\n\nNous parlerons de tout cela prochainement. En attendant, je suis plus content que jamais d'être venu ici.\n\nVotre tout dévoué,\nJEAN LACHARRUE.\nSherbrooke, le 13 octobre 1882.\n\nMon cher Directeur,\n\nJe vous l'ai déjà dit, mon but n'est pas de produire une œuvre littéraire, mais bien d'être utile à mes compatriotes, surtout aux cultivateurs, mes confrères, qui ont plus ou moins l'idée de suivre mon exemple et de venir chercher, dans l'une ou l'autre contrée du Nouveau-Monde, au Canada ou ailleurs, une existence plus paisible et un travail plus productif.\n\nDonc, les bons conseils avant tout.\n\nJ'ai déjà parlé, en racontant les incidents de mon départ, de la nécessité pour les colons d'enfermer leurs bagages dans des caisses solides et s'ouvrant cependant avec facilité pour les visites de la douane. Permettez-moi de revenir sur ce sujet, qui est de la plus grande importance.\n\nL'émigrant part de chez lui. Je suppose qu'il habite le village et qu'il a une ou deux lieues à faire pour arriver à la gare la plus proche. Ses colis sont chargés sur la charrette d'un voisin complaisant et vont au chemin de fer\npar toutes sortes de chemins. Première épreuve. La mise en wagon ne se fait pas toujours avec tous les soins voulus. Seconde épreuve. Faut-il transborder d'un fourgon dans l'autre, nouvelle épreuve. Voilà les colis à Anvers. Ceux qui ont visité nos gares connaissent la prudence, la modération et la patience proverbiales de messieurs les ouvriers chargeurs. On dirait vraiment que les caisses et les paquets les ont mortellement offensés, et qu'ils éprouvent le besoin irrésistible de les traiter en vaincus.\n\nJ'ai vu chez M. Berns, agent d'émigration à Anvers, de nombreux colis parmi lesquels une partie des miens, qui se trouvaient dans un état pitoyable. Ce digne monsieur faisait de son mieux pour réparer les dégâts; un de ses employés clouait les caisses disjointes, refaisait les paquets, ajoutait ici une corde, là un morceau d'emballage, tout en critiquant les gens qui ne prennent pas mieux leurs mesures. À Anvers, on descend les colis à fond de cale; ils sont remontés à Grimsby, puis dirigés en chemin de fer vers Liverpool. Là, on les met à bord de petits bateaux à vapeur qui les conduisent au grand steamer. On le voit, je n'ai pas tort de dire et de répéter : Faites-vous des coffres bien solides et emballez soigneusement vos objets.\n\nJe recommande tout spécialement aux cultivateurs de se procurer du bon linge en grande quantité, des chemises de laine ou de demi-laine, des bas et des chaussettes, le plus de vêtements possible et quelques outils de menuisier. À ceux qui veulent s'occuper ici de jardinage — et ce travail rapporte gros — je dirai de ne pas oublier des semences.\n\nÀ Québec, les bagages de plus de 700 voyageurs\nfurent déposés pêle-mêle dans un immense hangar en planche. L'ancien magasin et la station avaient été détruits peu de temps avant par un incendie. Il me fallut plus d'une heure pour retrouver mon butin (c'est ainsi qu'on appelle ici les bagages) et celui de la dame allemande qui m'était recommandée. En manches de chemise, le front ruisselant de sueur, j'avais plutôt l'air d'un fort des halles que d'un modeste colon.\n\nUn jeune Canadien français vint nous offrir du lait, du bon lait non baptisé à 15 centimes le litre. J'en achetai pour ma petite famille qui avait été privée de cette douceur pendant le voyage, et je courus m'enquérir d'un hôtel.\n\nPour cela, je n'avais que l'embarras du choix ; dix, douze patrons ou garçons d'hôtels s'empressaient autour des voyageurs, chacun d'eux prétendant diriger le seul établissement où l'on soit véritablement bien.\n\nPour dire la vérité, le meilleur ne vaut pas nos hôtels de troisième ordre. Qu'on y fasse un repas, soit ; mais le colon doit éviter d'y loger. Il peut partir le même jour, s'il connaît sa destination ; de cette manière ses colis sont mis immédiatement en chemin de fer, ce qui est un grand avantage, comme on verra plus loin.\n\nAprès avoir fait mon choix, je retournai rejoindre mes deux familles, que je trouvai tout en pleurs. Pendant mon absence on avait enlevé tous nos bagages pour les transporter dans un autre hangar. Il pleuvait à verse, la pluie passait à grands flots à travers la toiture inachevée, et tout mon butin, femmes, enfants, coffres et paquets, était trempé comme une soupe.\n\nIl fallait recommencer la corvée, c'est-à-dire les manœuvres de force, doublées cette fois-ci d'une chasse\nà courir à travers les ballots pour réunir une seconde fois mes coffres vagabonds. Les deux dames me suivaient, la mienne traînant après elle ses objets les plus précieux, Mme Boller pleurant comme une Madeleine. De temps en temps nous repassons devant le groupe humide des enfants qui demandent de s'en aller le plus tôt possible.\n\nVous voyez bien qu'avec tous ces embarras à la fois sur les bras, je n'étais pas à la noce.\n\nEnfin, la victoire est complète ou à peu près. Il ne manque plus que les chapeaux d'été de ma femme et de mes filles. Mme Boller réclame encore un bassin en fer blanc, mais, pour la première fois depuis le jour du départ, je ne trouve pas une parole de consolation.\n\nJ'ai raconté cette scène à un personnage haut placé. Il a ri de bon cœur, supposant peut-être que j'exagérais légèrement. Cependant je n'avais pas tout dit. Promesse m'a été faite de remédier à ce triste état de choses ; j'espère que je n'aurai plus, à mon prochain voyage, à renouveler pareille plainte.\n\nQue les colons, à leur arrivée à Québec, s'informent de l'adresse de M. Marquette. Ce monsieur est d'ailleurs chargé de donner gratuitement aux voyageurs tous les renseignements désirables, et il le fait avec beaucoup de politesse et d'empressement. Mais il s'agit de savoir qu'on peut le rencontrer à Québec; voilà pourquoi je consigne la chose dans ma lettre.\n\nC'est à Lévis que débarquent les voyageurs. Québec est de l'autre côté de la rade. C'est une ville très belle, vue de loin ; sa citadelle bâtie sur un rocher, et les collines verdoyantes qui l'entourent charment les yeux. Mais les rues sont d'une malpropreté repoussante. La couche\népaisse de boue qui les couvre engendrerait certainement toutes sortes de maladies, si le climat le plus sain du monde n'empêchait la contagion. Est-ce pour prouver l'excellence du climat que les édiles de Québec tolèrent cet état de choses? Alors c'est bien, mais ils devraient le dire.\n\nJe fus admirablement reçu au ministère d'agriculture. L'honorable M. Le Sage, assistant commissaire, (comme qui dirait sous-ministre) était absent; mais il avait chargé de le remplacer un gentleman dont je ne saurais jamais dire assez de bien, le digne M. E. Gagnon. Doué d'une mémoire prodigieuse, connaissant à fond son pays, il me donna, avec une politesse exquise, tous les renseignements désirables. Il voyait en moi non le pauvre émigrant qui vient demander à gagner, par le travail de ses mains, le pain de ses enfants, mais l'ami qui a droit à la protection d'un gouvernement vraiment paternel. Qui que vous soyez, savant ou ignorant, riche ou pauvre, émigrant belge, ne craignez pas, si vous avez l'intention de vous fixer au Canada, ne craignez pas, dis-je, d'aller demander une audience au ministère d'agriculture à Québec. Vous en sortirez bien convaincu du désir sincère qui anime tous les représentants du gouvernement canadien de protéger efficacement tous ceux qui viennent ici pour gagner honnêtement leur vie.\n\nM. E. Gagnon répondit avec beaucoup de patience à mes nombreuses questions. Sans vouloir peser le moins du monde sur mes décisions, il me dit cependant qu'il n'est pas bon pour les Belges de s'aventurer dans les terres nouvelles, et qu'il vaut mieux pour eux acheter une petite ferme avec des terres en partie défrichées. Pour le reste, il me conseilla de voir par moi-même, de juger et de comparer avant de me fixer définitivement.\nLe lendemain je partis pour Sherbrooke, avec ma petite famille.\n\nPourquoi pour Sherbrooke?\n\nJe ne saurais le dire, j'hésitais entre cinq ou six localités; j'ai choisi Sherbrooke, parce que... eh bien! oui, je répondrai comme les petits enfants:\n\nParce que!\n\nEt je suis heureux d'avoir pris ce parti. J'ai rencontré à Sherbrooke des hommes de bien, dont les conseils m'ont été de la plus grande utilité, non pas pour moi-même — les amis de Jean Lacharrue savent qu'il se tire toujours assez facilement d'affaire — mais pour l'œuvre de la colonisation à laquelle je veux me dévouer.\n\nIci encore, quelque lecteur peu au courant de mes intentions, pourrait se permettre un mot peu agréable:\n\n— Spéculation?...\n\nEst-ce pour moi qu'on dirait cela?\n\nCeux qui me connaissent bien, hausseraient les épaules en entendant ce reproche.\n\nEst-ce pour les hommes bienveillants que j'ai rencontrés ici? La position qu'ils occupent et les services immenses qu'ils ont rendus à leurs concitoyens, aussi bien qu'aux émigrants qui ont demandé leur appui, les mettent à l'abri de tout soupçon.\n\nBéni, cent fois béni soit Dieu qui m'a conduit ici! Je prouverai dans mes prochaines lettres que c'est aux environs de Sherbrooke, ou plutôt dans les cantons de l'Est, que les émigrants belges doivent s'établir.\n\nJe travaille en ce moment à une brochure flamande dont je fais moi-même la composition, car je suis quelque peu typographe. J'ai appris ce métier dans ma jeunesse, espérant qu'il me serait peut-être utile plus tard, sachant\nbien que mon père n'aurait jamais assez de fortune pour faire des cultivateurs de tous ses fils. Ici ce n'est pas la même chose, car l'espace est loin de manquer. L'autre soir, j'ai reçu la visite d'un ami dont le grand-père était arrivé au Canada avec douze fils, qu'il a établis jusqu'au dernier, leur laissant à chacun une ferme bâtie sur environ cent hectares de bonnes terres. Ce n'est pas dans notre pays que pareille chose serait possible.\n\n— Mais les terres ne valent rien, m'objectera-t-on, et c'est pour cela qu'on les vend à vil prix.\n\nErreur! On les donne presque gratuitement, cela est vrai; il y en a tant! Mais elles sont tout aussi bonnes, sinon meilleures que les nôtres, et surtout elles ne sont pas épuisées.\n\n— Les produits de la terre n'ont pas de valeur, dira-t-on aussi.\n\n— Encore une fois, erreur! Les animaux de boucherie et le beurre se vendent bon marché, j'en conviens, mais que coûtent-ils au cultivateur qui trouve à sa disposition les plus beaux pâturages du monde?... J'ai acheté hier un quart de farine, (c'est-à-dire environ 80 kil.), que j'ai payé fr. 32-80. Est-ce tout à fait pour rien? Je soutiens que le fermier canadien est dix fois mieux payé de ses peines que le cultivateur belge.\n\nJe disais donc que je travaille à une brochure flamande. J'espère en faire le vade mecum des émigrants. J'y recommande la province de Québec et tout spécialement les cantons de l'Est, parce que l'élément canadien français y domine; parce que la religion catholique y est professée — et bien pratiquée — par 1,170,718 habitants sur 1,359,027; parce que les moeurs et les coutumes sont à peu près les mêmes que chez nous, et pour mille et un\nautres motifs qu'on trouvera exposés tout au long dans mon petit ouvrage.\n\nJe pourrai aussi disposer de quelques milliers de brochures françaises, écrites pas un homme dont l'indépendance de caractère, la probité, la sincérité et la haute compétence me sont parfaitement connues, et j'espère envoyer le tout en Belgique vers le mois de décembre. Puis, si le bon Dieu me prête vie et santé, je ferai, en janvier ou en février un voyage dans mon pays natal, je donnerai à ceux qui s'adresseront à moi tous les conseils désirables, et je serai, pour ceux qui voudront me suivre, un bon compagnon de voyage.\n\nOn m'écrit qu'il fait très mauvais en Belgique, et qu'il a déjà neigé dans les forêts ardennaises. Ici il fait chaud comme en plein été.\n\nVotre tout dévoué,\n\nJEAN LACHARRUE.\nSherbrooke, 18 octobre 1882.\n\nMon cher Directeur,\n\nJ'avais eu à peine, à mon arrivée à Sherbrooke, le temps de déclarer mes caisses et de déballer mes bagages, lorsqu'un habitant de cette ville, le digne M. Chicoyne, vint me proposer de visiter avec lui le village de Chanay, de l'autre côté du Mégantic.\n\nInutile de vous dire que j'acceptai avec enthousiasme.\n\nSi vous le voulez, nous allons refaire ensemble ce beau voyage, le plus agréable que j'aie fait de ma vie. Seulement, vous me permettrez de vagabonder un peu, car nous rencontrerons des choses intéressantes qui nous attireront de temps en temps loin du chemin frayé, pour nous conduire dans les bois ou dans les pâturages qui entourent les fermes disséminées dans les terres immenses des cantons de l'Est. Nous causerons aussi de nos affaires, ce qui nous empêchera peut-être d'aller très vite, mais nos entretiens auront leur utilité. Puis, la moisson est rentrée, les semaines sont faites, nous avons le temps.\n\nComme toujours je vous rappelle que c'est un paysan qui vous écrit, et non un littérateur. Je travaille toute\nla journée, je n'ai pas le temps de vous fabriquer des phrases en grande tenue. Cela ne nous empêchera pas de nous comprendre parfaitement.\n\nSi vous rencontrez par-ci par-là, dans ma lettre, une phrase trop savante, ne me la reprochez pas : c'est que je l'ai empruntée à mon aimable cicerone ou copiée dans une charmante brochure qu'il m'a donnée.\n\nDepuis quinze ans au moins, M. Chicoyne s'occupe de colonisation. Il en est aujourd'hui à sa quatrième colonie. Les trois premières prospèrent et la quatrième, celle de Channay, vaudra pour le moins ses aînées. M. Chicoyne est avocat, ce qui ne l'empêche pas d'être un colonisateur hors ligne, un défricheur modèle et — je plains ceux qui doivent parcourir les bois avec lui — un marcheur infatigable. La compagnie qui lui a confié le soin de ses intérêts a eu la main heureuse. Ne croyez pas pour cela que ce brave monsieur surmène les hommes qui travaillent sous ses ordres; au contraire, il est plutôt l'ami, le père, que le maître de ses ouvriers et de ses employés. Mais il sait qu'il n'y a pour voir que l'œil du maître, et rien n'échappe à son active surveillance.\n\nVoici comment il a fondé la colonie des Channay et les « Moulin Nantais. »\n\nD'origine française comme tous les Canadiens qui parlent notre langue, M. Chicoyne voulut, l'an dernier, revoir la patrie de ses ancêtres. En allant déposer ses hommages aux pieds de Notre-Dame de Lourdes, il rencontra plusieurs membres influents et distingués du parti catholique qui, de la Bretagne, allaient en pèlerinage au sanctuaire vénéré.\n\nAprès avoir parlé de choses et d'autres, on parla aussi du Canada, des cantons de l'Est en particulier, de leur\navenir, de leurs immenses ressources encore inexplorées,\ndes œuvres de colonisation déjà commencées ou pro-\njetées.... et dès ce moment la création de la Compagnie\nde Colonisation et de Crédit des Cantons de l'Est fut\ndécidée.\n\nM. l'abbé Eugène Peigné, missionnaire de l'Immaculée\nConception, à Nantes, fut le principal et le courageux\npropagateur de cette entreprise d'outre-mer. Ce vénérable\nprêtre est connu de toute la France catholique, pour ses\nbonnes œuvres et son activité à faire le bien. Il sut\nconvaincre un groupe d'amis influents qui devinrent ses\ncollaborateurs avec toute la générosité française et la\npersévérance bretonne.\n\nUne souscription provisoire de 177 actions de 500 fr.\nfut faite pour acheter le terrain nécessaire à une première\nopération, et pour faire face aux frais d'organisation. Dès\nle mois de novembre 1880, la principale partie du canton\nde Woburn, près du lac Mégantic, était acquise en vue\nd'y faire un premier essai de colonisation. Le site du\nfutur village de Channay fut choisi sur les bords d'une\npetite rivière appelée Saint-Joseph, en l'honneur du\npatron de la Compagnie.\n\nLe nom du village fut donné en souvenir de Channay,\ncommune de l'ancien Anjou, qui fut le berceau de la\nfamille de M. Chicoyne.\n\nC'est là que le 8 décembre, à l'ombre des arbres\nséculaires, dans une humble cabane bâtie en troncs\nd'arbres, une première messe fut célébrée par le Rév.\nPère Jérôme, sous-prieur de la Trappe de Melleray,\ncherchant en ce moment dans les profondeurs de la\nforêt des cantons de l'Est un refuge pour lui et ses frères\nmenacés par la tyrannie du gouvernement républicain\nfrançais.\nLe Rév. Père Jérôme a choisi, depuis, le site d'une fondation près de la Patrie — une des anciennes colonies de M. Chicoyne — à quelque distance de Channay, sur un beau domaine de 800 acres, tout couvert de forêts, et que je visiterai, s'il plaît à Dieu, avant le commencement de l'hiver. Déjà des travaux considérables y ont été faits. D'autres religieux de la Trappe de Melleray sont venus rejoindre leur sous-prieur. Leur monastère porte le nom de Bethléem.\n\nSi l'on pouvait approuver une chose mauvaise, j'appellerais de tous mes vœux de nouvelles persécutions religieuses, dans l'espoir qu'elles nous amèneraient un grand nombre de ces bons Pères dont la présence dans ce pays est considérée par tous les habitants comme un bienfait inappréhensible.\n\nEn 1881, on fit à Channay un défrichement considérable, et on y fit ériger une petite scierie mue par une chute de la rivière Saint-Joseph, pour aider aux premières constructions.\n\nLa Compagnie de colonisation des cantons de l'Est possède dans le canton de Woburn 13,716 acres (1) de terres boisées. Je souligne le mot boisées, parce que beaucoup d'Européens n'aiment pas ces terres, dont le défrichement leur paraît trop difficile et trop coûteux. Je dirai plus loin quel parti on peut tirer de ces bois.\n\nWoburn se trouve au sud du lac Mégantic et sur la frontière des États-Unis.\n\nAu nord de ce lac, le long du chemin de fer International, la Compagnie a acheté un lot de 37 acres, et elle y a érigé une machine à vapeur pour manufacturer le\n\n(1) L'acre vaut 40 acres 47 centiares.\nbois coupé dans la forêt de Woburn en vue du défrichement. Cet établissement porte le nom de Moulins Nantais et fonctionne d'une manière admirable.\n\nLes bois sont flottés par la rivière Arnold et le lac Mégantic jusqu'à l'usine, qu'un embranchement du chemin de fer reliera bientôt à la voie principale.\n\nDès que les bois seront enlevés des terrains de la colonie, et au fur et à mesure qu'ils se déboiseront, ces terrains seront mis en culture ou vendus à des colons. Ces derniers ont un immense avantage à se placer sous le patronage de la Compagnie, à cause du travail rémunérateur que leur procure la coupe du bois pendant l'hiver.\n\nVous trouvez que nous n'avançons pas?...\n\nC'est vrai — c'est correct, comme on dit ici — mais le train n'est pas encore en marche; ne peut-t-on pas causer un peu en attendant le moment du départ?... Ce que je viens d'écrire ne sera pas perdu, j'espère.\n\nLa cloche sonne, la machine mugit, siffle, nous quittons la gare de Sherbrooke.\n\nJ'ai parlé de la cloche... Sur chaque machine de chemin de fer il y en a une, de taille respectable, qu'on sonne à pleine volée en entrant dans les gares et en les quittant. Pour se faire écraser ici, on doit le vouloir absolument, à moins qu'on ne soit sourd comme un pot. (Ne pourriez-vous pas me dire pourquoi les pots sont plus sourds que les casseroles?)\n\nLes wagons américains appelés ici chars sont bien longs. Moi qui suis un peu myope, je n'en vois pas la fin. Ils me rappellent les installations de tirs à la cible dans mon pays.\n\nAprès tout, ils sont très commodes. On y trouve tou-\njours de l'eau fraîche. Un jeune homme, chargé du balayage, vend des fruits, des biscuits, des friandises et une espèce de limonade. N'oublions pas deux meubles qu'on ne trouve pas chez nous dans les wagons, les water-closets et les poêles.\n\nNous traversons plusieurs beaux villages, entre autres Kookshire, où je voudrais voir s'établir quelques fermiers belges. Il y a encore de la place. On peut s'y occuper de jardinage et conduire à Sherbrooke des légumes qui se vendent toujours très bien et à des prix très élevés.\n\nIl fait nuit quand nous arrivons aux Moulins Nantais. Là m'attend un spectacle bien curieux. Une usine anglaise, qui débite chaque jour en planches et en madriers des milliers de troncs d'arbres, fait jour et nuit, sur une grande place en face des ateliers, d'immenses feux pour se débarrasser des croûtes et des planches défectueuses!...\n\nOn ne pourrait s'imaginer la quantité de bois qui se détruit ainsi. Cela me faisait mal au cœur, moi qui n'ai jamais brûlé inutilement un morceau de bois gros comme la main, mais je devais en voir bien d'autres avant la fin de mon voyage.\n\nAux Moulins Nantais on ne brûle pas les déchets ; on s'en sert pour combler les ornières, hausser les routes et les améliorer.\n\nDans les deux établissements, on coupe sur une longueur voulue le bois de chauffage que messieurs les voisins veulent bien accepter... pour rien.\n\nEt dire que la Belgique est si éloignée!\n\nL'hôtel où je suis descendu est un hôtel anglais et protestant. On ne s'y moque pas de ceux qui se signent et prient avant de prendre leurs repas.\nUn ouvrier ajusteur partage ma chambre, mais non mon lit, qui est à peine assez solide pour porter un seul homme. Les Anglais sont de braves gens, mais leur sommiers et leurs oreillers!...\n\nAvant de se coucher, mon compagnon de chambre s'agenouilla et dit dévotement ses prières. Le lendemain je racontai la chose à M. Chicoyne : il m'assura que jamais un vrai Canadien ne néglige ce devoir. Bonne leçon pour beaucoup de catholiques belges!\n\nJe passai très agréablement une partie de la journée aux Moulins Nantais. On y découpe un arbre plus vite et plus facilement qu'une ménagère ne découpe un pain. Et comme ces ouvriers canadiens sont adroits! Tenez, la chaîne sans fin emmène un tronc qui sort tout ruisselant du lac. Deux hommes, armés de crocs, le manient comme s'il s'agissait d'un fétu de paille. Une, deux, trois... ça y est! L'arbre a marché le long de la scie qui lui a enlevé une large tranche, à seule fin de le dresser, et de lui apprendre à vivre. Il retourne en arrière, on l'avance d'un cran, une, deux, trois... ! voilà une belle planche qu'on enlève, qu'on dresse en coupant les bords, et ainsi de suite. En moins de cinq minutes, l'arbre le plus gros est débité en planches ou en madriers.\n\nSur le lac, un jeune homme de quinze à seize ans fait la pêche aux troncs ou aux billots, pour me servir du mot technique. Son agilité et sa vigueur m'étonnent. À chaque moment je crois qu'il va prendre un bain, car les troncs sur lesquels il court menacent de se dérober sous ses pieds; mais jamais il ne perd l'équilibre, le billot qu'il doit conduire à la chaîne sans fin lui sert de bateau : ce jeune Canadien rendrait des points à Blondin.\nA l'usine, pas un cri, pas un mot déplacé, surtout pas un blasphème. Quelle différence avec beaucoup d'ateliers belges! Je témoigne mon admiration à mon cicéronne, qui me montre un passage d'un rapport imprimé en 1632 par les soins d'une compagnie de colonisation française. Il mérite bien l'honneur d'une citation :\n\n« Nous avons appris, et nous regardons comme une règle certaine que, pour former une bonne colonie, il faut commencer par la religion. Elle est dans un État ce qu'est le cœur dans la composition du corps humain, la partie première et vivifiante. C'est sur la religion que les fondateurs de grandes républiques ont assis ces édifices qui ne subsisteraient plus s'ils avaient eu un autre fondement. Ainsi nous protestons qu'elle sera toujours précieusement traitée, et qu'en toutes rencontres nous la ferons présider à la Nouvelle-France. »\n\nEn 1643, les fondateurs de la colonie de Montréal adressèrent une supplique au Pape Urbain VIII, pour lui demander de bénir leur œuvre. Cette insigne faveur, qui leur fut accordée, ne contribua pas peu aux brillants succès qui couronneront leurs efforts.\n\nLa Compagnie de colonisation des cantons de l'Est a suivi cet exemple. Dans le récent voyage que Mgr Racine, le vénérable évêque d'Ét-Sherbrooke, fit à Rome, il sollicita et obtint une bénédiction spéciale de S. S. Léon XIII pour la Compagnie, pour ses entreprises et tous ceux qui s'y emploieront. Un document constatant cette faveur insigne est respectueusement conservé dans les archives.\n\nTout cela fera peut-être sourire de pitié les libres-penseurs Belges; il est vrai que je n'écris pas pour ces messieurs-là. Ils ont trop d'esprit pour me comprendre, et je ne me soucie guère d'entrer en relation avec eux.\nMais je sais une chose, c'est que je me fie plus volontiers aux braves Canadiens qui croient en Dieu et qui prient, à ces hommes robustes et courageux qui n'entreprennent rien sans implorer le secours d'en Haut, qu'à ces messieurs les beaux parleurs européens qui sont tout contents d'eux-mêmes lorsqu'ils ont trouvé une insulte nouvelle à lancer aux charrues croyant en Dieu. J'ai parcouru les forêts canadiennes, j'ai dormi sous la tente des défricheurs, dans la cabane en écorce d'arbres des chasseurs d'ours, j'ai reçu l'hospitalité dans d'humbles fermes, bâties en troncs à peine dégrossis, et jamais je n'ai ressenti la moindre inquiétude. Mes hôtes partageaient de bon cœur leur frugal repas avec l'explorateur européen; ils lui cédaient généreusement leur meilleur lit et la place la plus commode au coin du feu; ils priaient Dieu avant d'accorder à leurs membres fatigués un repos bien mérité; j'étais tranquille, je me trouvais au milieu d'amis sincères.\n\nAh! puisse le Canada conserver toujours ses mœurs simples et honnêtes, sa foi robuste et son caractère généreux! Puisse-t-il ignorer à jamais ces prétendus bienfaits de la civilisation, qui, si le bon Dieu ne s'en mêle pas, auront fait bientôt de la Belgique le pays le plus pauvre et le plus malheureux du monde!\n\nPardonnez-moi tous ces détails, mon cher directeur, je m'efforcerais de voyager plus vite dans ma prochaine lettre.\n\nVotre tout dévoué,\nJEAN LACHARRUE.\nVII\n\nSherbrooke, le 25 octobre 1882.\n\nMon cher directeur,\n\nJ'ai reçu, il y a huit ou dix jours, une lettre du pays. L'ami qui m'écrivait m'apprenait que les premières neiges avaient fait leur apparition dans les Ardennes belges, qu'à Bruxelles il faisait bien froid, qu'il pleuvait trop, que tout le monde était enrhumé, bref qu'on prévoyait le moment où Bruxelles ne serait plus habitable que pour les amphibiens. Mon ami est poète, ce qui me fait supposer qu'il exagère légèrement; cependant je suis persuadé qu'en ce moment il fait plus beau ici qu'en Belgique. Les gais rayons du soleil pénètrent dans mon petit cabinet de travail où le feu est éteint : je puis, pour le moment, me passer de ses services. Cette nuit, il faisait un clair de lune magnifique; on y voyait comme en plein jour. J'ai fait comme Calino, je me suis levé, et j'ai passé plus de deux heures dans ma cour, m'amusant à mettre en ordre ma provision de bois pour l'hiver. Le froid ne m'a pas incommodé le moins du monde.\nVous me répondez que tout cela est bel et bien, mais que notre voyage d'un bout à l'autre du lac Mégantic menace de se prolonger indéfiniment....\n\nA vos ordres, mon cher Directeur, nous partons.\n\n— A pied, me demandez-vous maintenant?\n\nC'est vrai... J'ai oublié de vous dire qu'un minuscule bateau à vapeur nous attend. Nous passons sur un pont de troncs excessivement mobile, nous grimpons à bord, nous partons, traînant à la remorque une chaloupe remplie d'outils et de vivres pour la colonie de Channay. Cinq ou six ouvriers défricheurs nous accompagnent. L'un d'eux est chargé de faire sauter des blocs de rochers qui obstruent la Rivière Arnold, et il se met bravement à fumer, assis sur un petit baril de poudre bouché d'un côté à l'aide d'une poignée de paille. Il est tout étonné lorsque je le prie de fumer ailleurs, mais il l'exécute de bonne grâce en riant de mon excès de prudence.\n\nCe brave Canadien est un rude gaillard dans toute la force du terme; il a été marin pendant plusieurs années, il a pêché la baleine et chassé l'ours. N'allez pas croire cependant que j'ai eu affaire à un M. de Crac quelconque. Le bon garçon ne se vante pas d'avoir fait preuve d'un courage extraordinaire en tuant chaque hiver une bonne douzaine d'ours, au temps où cet intéressant quadrupède, que le fusilier Pitou appelait un insecte incommode, était plus abondant dans le pays. Jamais il n'a pu en abattre un seul à coups de fusil; l'ours évite soigneusement de se trouver nez à nez avec l'homme, et c'est à l'aide de pièges qu'on le prend. On dresse les embûches le soir, et le lendemain on va décrocher maître Martin pendu, trépassé et gelé. Donc pas de grands dangers à courir, peu de frais et, comme salaire, une belle fourrure que les balles\nn'ont pas endommagée et qui vaut de 50 à 70 francs ; de plus une chair succulente dont pas une once ne se perd et que l'on vend ici de 60 à 75 centimes la livre, alors que le bœuf toute première qualité ne vaut que 50 à 60 centimes.\n\nJ'entends ici par centimes la centième partie d'un franc. Les centins Canadiens sont la centième partie d'une piastre, et la piastre ou dollar vaut fr. 5,25.\n\nNous avançons toujours... Vous ne sentez, ni roulis ni tangage?... C'est bien commode, n'est-ce pas, de voyager ainsi, sans quitter sa chaise?\n\nVoici la baie des sables ; le lac n'est pas bien large, l'air est pur, nous voyons parfaitement les deux bords, couverts d'arbres qu'aucune ne toucha jamais la serpette de l'élagueur et dont le branchage touffu intercepte la clarté du jour. Par ci par là une large éclaircie et, au milieu, la cabane en troncs d'arbres d'un défricheur. Honneur à ces vaillants travailleurs, à ces conquérants pacifiques! Savent-ils bien le grand service qu'ils rendent à leur patrie et à l'humanité, en ajoutant aux terres déjà si étendues du Canada de nouvelles terres à cultiver? Un philosophe a dit : « Celui qui fait croître deux brins d'herbe là où un seul était produit, est un bienfaiteur public. » Que de mérites n'ont pas ces braves défricheurs qui, le plus souvent sans autre fortune que leurs deux bras, leur courage et leur confiance en Dieu, procurent à l'agriculture et à l'industrie de nouvelles ressources! C'est de tout cœur que je souhaite à ces hommes modestes, mais éminemment utiles, paix, bonheur et prospérité.\n\nLe petit bateau marche toujours avec rapidité. Du rivage, un homme assis près d'un feu de branches nous crie le bonjour. « C'est l'ermite! » me disent mes compagnons de voyage.\nEn effet, je vois une petite cabane, adossée contre un rocher à pic, assez grande pour y loger un homme qui se contente du strict nécessaire comme espace et comme meubles. C'est là que vit seul, toujours seul, entre le grand lac et la grande forêt, un philosophe chrétien, quelque peu misanthrope, qui préfère les truites du Mégantic et les lièvres du bois à la société de ses semblables.\n\nNous arrivons à Lourdes, c'est-à-dire au petit coin de terre acheté par la Compagnie de colonisation des cantons de l'Est, en vue d'y faire plus tard un débarcadère et d'y établir des hangars pour ses bois.\n\nTrois ouvriers de la Compagnie nous attendent ; ils font la cuisine à la façon des sauvages. Sur deux poteaux plantés en terre, un bâton est attaché horizontalement. À ce bâton est suspendue une énorme marmite en fonte et sous cette marmite flambe un feu, mais un feu comme on n'en fait que dans les pays où le bois ne coûte rien.\n\nNous nous mettons à table — une table bien solide, ma foi, avec des troncs d'arbres pour montants — et nous faisons honneur au festin. Du thé, du pain frais, des haricots cuits à l'étouffée, du lard et des tartines au sirop d'érable forment le menu. L'air frais a aiguisé notre appétit, et le cuisinier est tout joyeux de nous voir manger de si bon cœur.\n\nEt maintenant en route pour Channay, à travers bois, le fusil sur l'épaule et l'œil au guet. Nous entrons dans le domaine des ours... qui ont capitulé sans se défendre. Si j'étais romancier, c'est en ce moment que je vous en ferais voir de toutes les couleurs ! Vous assisteriez à des luttes héroïques, et c'est le bras en écharpe et précédé de quatre hommes portant sur un brancard improvisé un\nours tué par votre serviteur, que nous ferions notre entrée triomphale à Channay. Mais tranquillisez-vous ; nous comptons si peu rencontrer de grands fauves, que notre fusil est chargé avec du petit plomb, et que notre ambition se borne à souhaiter d'arriver au campement avec une demi-douzaine de perdreaux. Je me hâte d'avouer que j'arrive bredouille dans toute la force du terme. En fait de gibier, je n'avais vu qu'un écureuil si gai et si heureux de vivre, que c'eût été un crime de lui envoyer une charge de plomb.\n\nMais si je n'ai pas abattu de gibier, un chasseur que nous rencontrâmes au milieu de la forêt avait été plus heureux que nous. Il portait un superbe chevreuil, qu'il était allé « prendre » pour un deses clients. Le vendredi, il devait en livrer un autre à un restaurant de Montréal. Après cela, il ne lui en resterait plus que cinq.\n\n— Vous les tenez donc renfermés dans une étable ? lui demandai-je tout ahuri.\n\n— Pardon, monsieur, répondit simplement le chasseur, mais je les vois tous les soirs à l'abreuvoir et je n'ai pas de concurrent ici.\n\nCela ne me parut pas très poétique.\n\nIl faisait noir lorsque nous arrivâmes à Channay Les défricheurs nous avaient précédés; ils chantaient sous la tente en attendant le souper que le cuisinier, dont les « fourneaux » étaient déjà en pleine activité, préparait tout en prenant sa part du concert improvisé.\n\nQuelques campagnards qui nous avaient prêté leurs chevaux et leurs voitures pour transporter nos bagages à Channay, ainsi que des colons établis dans le voisinage, vinrent fumer leur pipe autour du feu.\n\nLeur conversation m'intéressa vivement. L'un d'eux\navait accompagné le matin, jusqu'au delà de la frontière, une famille canadienne que le luxe avait ruinée et qui allait cacher aux États-Unis sa honte et sa misère.\n\n« — Le luxe, s'écria-t-il, voilà la grande cause de l'appauvrissement de certaines familles canadiennes; voilà le chancre qui dévore souvent les ressources de la classe agricole. Si l'on additionnait le montant de toutes les dépenses inutiles, on trouverait une somme suffisante pour créer une aisance à la moitié des Canadiens émigrés aux États-Unis. Le luxe en est arrivé à ne plus ruiner seulement les prodigues, mais à s'imposer en quelque sorte à des gens économiques. On convient de ses effets désastreux, mais on est entraîné; on n'a pas la force de se mettre au-dessus des préjugés; on vide sa bourse, malgré soi, en gémissant. On se prive même du nécessaire pour suivre le mouvement général. Que de gens sont aujourd'hui dans la misère pour n'avoir pas économisé, lorsqu'ils en avaient l'occasion! Que de pauvres Canadiens pleurent en ce moment, loin de leur pays, une honnête aisance qu'ils ont perdue par leur faute! »\n\nC'était parler comme un livre, et je n'en perdis pas un mot.\n\nMais je vois qu'il est temps de terminer ma lettre. Je reprendrai mon récit la semaine prochaine\n\nVotre tout dévoué,\n\nJEAN LACHARRUE.\nVIII\n\nSherbrooke, 10 novembre 1882.\n\nMon cher Directeur,\n\nLe retour annuel de la fête de Saint-Hubert m'a fait penser aux chasseurs belges qui l'ont pris pour patron. J'ai pensé au pénible métier qu'ils font et je me suis souvenu que chaque lièvre qu'ils réussissent à tuer leur revient, — en moyenne, — à la modique somme de 875 francs 39 centimes. Cela résulte d'une savante statistique.\n\nIci ce n'est pas tout à fait la même chose : la chasse est libre, de même que la pêche, et l'on prend du gibier et du poisson sans beaucoup de peine. On ne croirait rien aux récits des chasseurs et des pêcheurs, si l'on ne voyait au marché vendre du saumon à raison de 50 centimes la livre, des truites au même prix et des lièvres... frémissez, Nemrods belges, des lièvres à raison de 75 centimes à 1 franc les deux!... La poule au pot du bon roi Henri IV ferait rire les Canadiens qui achètent de beaux poulets plumés et vidés, prêts à passer au feu, moyennant la somme minime de fr. 1-50 à 2-50 la couple. J'ai\nacheté, samedi dernier, une bonne grosse poule, toute jeune; elle me coûtait 48 centimes la livre!\n\nOn me dira, peut-être, qu'à ce compte le campagnard ne gagne rien à élever des poulets. Et si ces poulets ne lui coûtent que la peine de les voir courir?\n\nMais nous voilà loin du village de Channay et de nos bons défricheurs. Il est difficile de parler chasse sans vagabonder un peu. Retournons à notre feu et à nos compagnons de bivouac.\n\nOn se montre très heureux d'apprendre que j'ai l'intention de me fixer au Canada, de devenir défricheur et de faire tout ce qui est en mon pouvoir afin d'engager beaucoup de cultivateurs belges à venir. On promet de faire le plus charmant accueil à mes compatriotes, de leur donner un rude coup de main pour la première installation, en même temps que de bons conseils. Ceux qui me parlent ainsi ne sont pas des spéculateurs intéressés, mais bien d'honnêtes campagnards qui ont passé par toutes les phases de la vie du colon. Presque tous ont bien réussi; mais ils n'ont pas boudé à la besogne, ils n'ont pas gaspillé leurs ressources. Ils savent que les Belges sont d'habiles cultivateurs, des fermiers sobres; économiques et ennemis du luxe; ils leur prédissent beaucoup de succès.\n\nL'obscurité la plus compacte couvre la terre, mais la flamme de notre feu de bivouac trace autour de nous un grand cercle lumineux sur lequel se découpent nos silhouettes. Et je me mets à songer à mes amis du pays qui seraient tout surpris de me voir ici dans cette clairière obstruée par des troncs d'arbres roulés là pour être brûlés, au pied d'une colline boisée où, il y a un an à peine, rodaient les fauves, maîtres incontestés de\nces vastes domaines; s'ils me voyaient, dis-je, entouré de ces hommes barbus coiffés de grands chapeaux mous dont les bords leur couvrent à moitié la figure, dont le plus timide a sur la conscience le meurtre d'au moins une demi-douzaine d'ours. S'ils me voyaient ici, pensais-je, mes amis s'imaginerait que je suis en très mauvaise société. Eh bien! ils se tromperaient bien! Je confierais sans crainte à ces compagnons à l'aspect sauvage ma bourse et ma vie, bien persuadé que ni l'une ni l'autre ne courraient le moindre danger. Dans ces figures ornées d'une barbe inculte brillent des yeux honnêtes, qui vous regardent en face; ces habitants des bois sont les hommes les plus honnêtes du monde, ces rudes bûcherons qui barreraient le chemin à un ours pour lui demander sa fourrure et sa vie, qui manieraient sans trembler le fusil et la hache, s'il prenait envie à un conquérant de passer la frontière, ces défricheurs intrépides sont des chrétiens. Malgré leur air quelque peu rébarbatif, ils sont doux comme des agneaux; on peut compter sans crainte sur leur bonne foi et leur dévouement.\n\nVoilà que l'infatigable cuisinier vient de terminer les préparatifs du souper. Debout, les amis, et à table!... Chaque fumeur secoue sur l'ongle de son pouce la cendre de sa pipe; on s'approche d'une table fabriquée à la hâte avec des planches fournies par la scierie de la colonie naissante; ceux qui n'ont pas pris part à la causerie autour du feu sortent en rampant de la tente qui sert en même temps de magasin, de salon et de chambre à coucher; on dit une courte prière, et les mâchoires se mettent à fonctionner avec une vigueur et une célérité remarquable. On n'a pas besoin de me presser: je mange comme un loup. L'air et l'exercice sont des apéritifs\nqui valent cent fois mieux que toutes les drogues du monde.\n\nTout à coup, la lune apparaît dans tout son éclat, au milieu de sa cour nombreuse et brillante d’étoiles. Quel admirable spectacle ! La ligne ondulée de collines couvertes d’arbres séculaires s’étend au loin, s’abaissant, s’élevant, formant des vallées, montant jusqu’aux nues, empruntant de l’astre de la nuit une teinte argentée qui charme la vue et porte l’âme à la rêverie. La petite rivière de Saint-Joseph, qui coule à nos pieds, livre de continuels combats aux blocs de rochers qui obstruent son lit, et ses flots forment des cascatelles écumantes dont le murmure s’entend au loin. Je suis tellement ravi à l’aspect de cette belle nature si riche et si grandiose, que j’oublie de boire et de manger. M. Chicoyne me rappelle à la réalité en m’offrant un verre de vin de Channay.\n\n— Du vin ! mais je croyais qu’on n’en récoltait pas dans ce pays.\n\n— Au contraire, nous en avons en abondance.\n\nJe bois ; c’est de l’eau claire, glacée ; c’est de l’eau du Saint-Joseph. On rit de bon cœur, je ris comme les autres ; et, faute de mieux, c’est de l’eau que je bois à la santé de mes amis du vieux pays, à celle des amis de ma nouvelle patrie, au bonheur et à la prospérité de ma chère Belgique, à l’avenir de la libre et hospitalière contrée dont les habitants accueillent si bien l’émigrant belge.\n\nJean Lacharrue.\nIX\n\nSherbrooke, le 17 novembre 1882.\n\nMon cher directeur,\n\nMaintenant vous vous demandez sans doute : « Où le pauvre Jean aura-t-il passé la nuit?... On ne peut pas se tenir pendant une dizaine d'heures autour d'un feu de bivouac. »\n\nLe logement est ce qui doit inquiéter le moins les voyageurs au Canada. Vous êtes fatigué, la nuit tombe, et vous voyez, an bord de la route, la cabane du pêcheur ou la demeure plus confortable du fermier. Frappez sans crainte, et il vous sera ouvert. Demandez l'hospitalité, et elle vous sera accordée de la façon la plus cordiale.\n\nJe voulus d'abord m'étendre sous la tente des bûcherons, sur les branches de sapin amassées à la hâte par mes compagnons de voyage. Ces robustes gaillards n'avaient pas le moins du monde l'air d'être vaincus par le sommeil, et je m'attendais à d'intéressants récits. Mais M. Chicoyne me fit observer qu'il ferait assez froid avant la fin de la nuit, et il me conduisit à l'hôtel.\n\nL'obscurité complète m'empêchait de voir, à cent\nmètres du campement, une cabane en troncs d'arbres,\nbâtie sur la rive gauche du Saint-Joseph, à quelques pas\nd'une autre cabane tout aussi rustique, celle dans laquelle\na été célébrée la première messe, lors de la fondation de\nChannay.\n\nPrécédés par un défricheur qui porte un fanal, nous\nlongeons la rivière. Le chemin est étroit, et à tout\nmoment je trébuche contre des quartiers de roches. Nous\narrivons cependant sans accident.\n\nVoici l'hôtel... Quelques troncs d'arbres ont fait les\nfrais de cette bâtisse primitive. L'architecte a oublié de\nmettre une serrure à la porte que ferme un simple loquet.\nCependant cette maison est habitée, pour le moment, par\nune dame et sa petite fille ; le chef de la famille a fait une\nentreprise du côté de Québec et il ne reviendra que dans\nquelques jours. En attendant, sa femme et son enfant\nsont là seules, au milieu des grands bois ; ce qui ne les\nempêche pas de vivre et de dormir en paix. Ils ont la\nconscience tranquille et l'esprit aussi ; ils savent que ce\nn'est pas dans les forêts canadiennes qu'on rencontre\ndes voleurs et des malfaiteurs.\n\nLa plus grande propreté règne dans la maison. Les\nvases en cuivre et en fer blanc reluisent comme de l'or,\nce qui rend plus délicieux encore le bol de lait que\nl'hôtesse nous offre avec un empressement prouvant que\nnous sommes les bienvenus.\n\nUn colon, établi un peu plus loin, dans la « noire forêt, »\nvient allumer sa pipe en passant.\n\nIl est ravi de rencontrer un Belge, un homme du vieux\npays. Je vante l'hospitalité canadienne et j'apprends,\noutre beaucoup d'autres détails, ce qui suit :\n\nDans ce pays, il y a beaucoup de marchands ambulants\net même le métier est excellent. Dans plusieurs bourgades éparées, il n'y a pas de stores (c'est ainsi qu'on appelle ici les magasins). Le « marchand » est donc toujours le bienvenu.\n\nLorsqu'il arrive le soir dans une ferme, il dételle son cheval, le met au pacage et « déclare » qu'il logera à la ferme.\n\n— C'est bien, répond le fermier; vous souperez avec nous?\n\n— Ma foi, oui.\n\n— Très bien, voici une bonne place.\n\nPas plus de cérémonies que cela. On n'ajoute rien au menu, on ne fait ni plus ni moins de frais, mais tout est offert de bon cœur. Pour rien au monde on ne refuserait l'hospitalité au voyageur qui arrive le soir dans une ferme canadienne.\n\nLe matin, on sert le déjeuner, on donne un coup de main pour atteler le cheval et « bon voyage! »\n\nAh! J'oublie... Le marchand a toujours un petit cadeau à offrir aux enfants. Mais, en ouvrant ses valises, il montre, sans en avoir l'air, les articles les plus nouveaux de son magasin portatif, et jamais il ne quitte la ferme sans gagner au moins son écu. Dans toute une semaine, il ne dépense pas cinq liards pour son entretien et celui de son cheval.\n\nJe parle un peu de tout avec mon compatriote.\n\nJe suis étonné d'apprendre qu'il y a au Canada, comme dans tous les pays du monde, des gens qui ont — comme on dit — de la peine à joindre les deux bouts. Il y a tant d'argent à gagner ici, et l'on peut y vivre d'une manière si économique!\n\nÀ quoi donc faut-il attribuer la gène, je dirais presque\nla misère qui règne dans un si grand nombre de familles?\n\nQuoiqu'il soit au fond un très brave homme, le Canadien n'est pas parfait.\n\nJ'ai déjà dit qu'il n'est pas trop bon cultivateur. Il convertit très bien la forêt en terre plus ou moins labouvable, mais il n'améliore pas assez. Il ne connaît pas la culture soignée, l'art d'utiliser les plus petits coins de terre et de faire produire.\n\nCependant ce n'est pas à ce défaut, à ce manque de clairvoyance, qu'il faut attribuer le mauvais état des finances de beaucoup de campagnards.\n\nCe qui dévore surtout les ressources de la classe agricole, c'est le luxe. Je crois en l'avoir déjà parlé.\n\nLes fils de fermiers veulent avoir de beaux vêtements, un cheval de luxe, une belle voiture, un splendide traîneau. Les demoiselles connaissent et suivent les modes de Paris, et passent volontiers leur temps à tapoter sur un piano. Ce n'est pas ainsi qu'une ferme prospère.\n\nIl arrive souvent que les folles dépenses amènent la misère. On commence par hypothéquer la ferme, et l'on finit par la vendre. Les vieux parents, usés par les travaux et même par le chagrin, ne peuvent plus compter que sur le zèle et l'activité de leurs enfants. Mais ceux-ci sont trop fiers pour se mettre au travail, surtout pour entrer au service d'autres fermiers, et ils s'expatrient, abandonnant à leur triste sort un père et une mère dont la faiblesse est la première cause de tant d'infortunes.\n\nIl y encore l'usure.\n\nLorsqu'un campagnard a besoin d'une somme d'argent pour améliorer sa ferme ou augmenter ses cultures, il la trouve facilement. Mais lorsqu'il a perdu tout crédit\npar des dépenses inutiles, il est forcé de recourir à des usuriers, qui achèvent sa ruine.\n\nCe ne sont pas seulement les fermiers qui sacrifient au luxe, à la folle envie de briller; beaucoup d'ouvriers imitent cette manie. Ils ont des salons ornés avec un luxe au dessus de leur condition, et leurs femmes ont l'air de grandes dames qui craignent de salir leurs petites mains en se livrant à d'autres travaux que la fabrication de la pâtisserie. C'est à peine si elles daignent « cuisiner » un peu et s'occuper du linge et des vêtements. C'est le mari qui coupe le bois, puisse l'eau, peine du matin au soir et se prive même du nécessaire pour payer les robes et les chapeaux de madame son épouse. Je suis loin d'être partisan du système arabe qui impose aux femmes les corvées les plus pénibles; mais dans les familles canadiennes, et surtout dans les familles ouvrières, je voudrais voir les femmes plus actives. Elles y gagneraient sous tous les rapports. Les fermières et les ménagères belges peu fortunées jouissent d'une meilleure santé, elles sont beaucoup plus robustes que les Canadiennes, mais aussi elles travaillent davantage.\n\nL'ivrognerie cause infiniment moins de ravages au Canada qu'en Europe; cependant, l'eau de feu fait ici quelques victimes. C'est cependant une chose prouvée depuis longtemps : le fermier qui s'adonne à la boisson est un homme perdu.\n\nOn le voit, le diable pénètre un peu partout, et ceux de mes compatriotes qui viendront à mon exemple s'établir dans les campagnes canadiennes ne doivent pas s'imaginer qu'ils seront ici tout à fait à l'abri de la tentation, et qu'ils n'auront jamais de mauvais exemples sous les yeux.\nJe leur dis tout cela afin qu'ils se mettent bien sur leurs gardes et qu'ils soient prémunis contre tous les entrainements. Avec du zèle et de la persévérance, on a la certitude de réussir ici ; cependant, les dépenses inutiles et le manque de calcul ruinent — dans tous les pays du monde — les meilleurs établissements.\n\nDix heures sonnent à l'antique concou ; il est temps de songer au repos. La journée a été rude ; j'ai à peine le temps de dire une courte prière et de me déshabiller. Le doux murmure de la rivière frappe toujours mon oreille, mais bientôt je me sens partir pour le pays des rêves. Pendant quelques instants, il me semble qu'un tourbillon m'emporte à travers des arbres séculaires, serrés les uns contre les autres ; puis, tout à coup, je me retrouve au pays, au milieu de mes amis qui me serrent les mains, me recommandant de leur écrire souvent... Le navire quitte la rive, les amis agitent leurs mouchoirs, je les salue de loin, puis...\n\nJe dors comme un homme qui n'a que cela à faire, jusqu'à six heures du matin.\n\nOù est mon compagnon de voyage ?\n\nJe le trouve au milieu de ses hommes qui ont préparé un immense bûcher auquel je dois mettre le feu.\n\nJamais ! brûler de si beau bois, une provision pour tout un hiver, ce serait un véritable crime !\n\nIl n'y a rien à dire, je dois m'exécuter. « Si vous ne brûliez pas ce bois, me dit-on, où le mettriez-vous ? Celui qu'on coupera ensuite sera utilisé, mais, en ce moment, il s'agit de faire de la place. »\n\nC'est ainsi que se commencent tous les défrichements. On coupe d'abord le menu bois, puis quelques grands arbres sur lesquels on place du bois à peu près sec, et\nle feu balaye la place où doit s'élever la cabane en troncs du défricheur.\n\nTout en soupirant, je frotte une allumette sur la manche de ma veste, je l'approche de quelques copeaux bien secs; bientôt la flamme pétille, les branches s'enflamment, les troncs prennent feu, une immense colonne de fumée monte en tourbillonnant vers le ciel... et je m'aperçois que le brasier grille ma barbe et menace de me roussir de la plante des pieds au sommet de la tête.\n\nÀ présent, il s'agit de donner un coup de main pour la construction d'une maison qu'on va élever sur un autre coin de la clairière, et qui doit être sous toit avant la tombée de la nuit.\n\n— Impossible!\n\n— Impossible?... C'est vous qui dites cela, M. directeur?\n\n— Non...\n\n— Alors, c'est vous, lecteur? Eh bien! Venez donc voir et ne me traitez pas comme certains farceurs traitaient autrefois les « napoléonistes », lorsque ces braves vieux de la vieille racontaient leurs exploits. Moi je ne raconte pas ici ce que j'ai fait, mais bien ce que j'ai vu; et je n'avais pas mes yeux en poche, je vous le garantis.\n\nLes troncs sont équarris et coupés sur la même longueur. Les bouts sont taillés en « queue d'aronde », afin qu'ils puissent s'enchâsser les uns dans les autres. On en place quatre, et voilà un peu moins d'un pied de maçonnerie achevée. Puis quatre autres, et ainsi de suite. À midi, quand le cuisinier nous appelle pour la soupe, la charpente du toit est en place. Le soir, la maison est achevée, sauf quelques détails. On achète les\nportes toutes faites, de même que les chassés. Le plancher sort tout raboté de l'usine.\n\nLe lendemain, promenade dans la forêt séculaire. Oh! que c'est beau! Je voudrais cependant y voir plus de petits oiseaux et... moins d'éperviers. Avis aux chasseurs.\n\nDe temps en temps un écureuil a l'air de vouloir me frôler le nez avec le panache qui orne la chute de ses reins. Le petit effronté! Croit-il que mon fusil n'est pas chargé, ou s'imagine-t-il que je l'épargnerai toujours malgré son insolence?\n\nJ'espère toujours rencontrer un ours; car, oubliant la fameuse fable dont on cite si volontiers la morale, j'ai promis une belle fourrure à un de mes amis. Pas plus d'ours que sur la main.\n\nQuand j'étais tout petit, on m'appelait le chasseur d'ours. Pourquoi?... C'est une histoire bien émouvante que je raconterai peut-être un jour.\n\nEt me voilà dans la forêt aux ours, dans ce fameux beerenbosch, dont j'ai parlé si souvent dans ma jeunesse. Seulement, l'ours n'est pas l'ami de l'homme, et il s'obstine surtout à ne pas honorer de sa confiance ces méchants bûcherons dont la hache est toujours affilée, dont la main ne tremble pas et dont le cœur ne connaît pas la crainte.\n\nIl y a deux ans à peine, de nombreux ours rôdaient encore dans le canton de Woburn. Aujourd'hui, maitre Martin a décampé : sans avoir le moins du monde envie de faire pénitence, il paraît qu'il aime la vie d'ermite. Cependant, je ne désespère pas de me trouver un jour face à face avec un de ces Canadiens rebelles à toute idée de civilisation. L'un de nous y laissera sa peau, et j'espère bien que ce ne sera pas moi.\nVoici maintenant la rivière Arnold. D'où vient ce nom? Il y a longtemps, en 1717, si j'ai bonne mémoire, le général américain Arnold passa la frontière canadienne à la tête d'une armée assez nombreuse. Il campa sur les bords de la rivière qui a gardé son nom. La disette éprouva cruellement ses soldats, qui se virent réduits à faire de la soupe avec... des tiges de bottes.\n\nAutrefois, cette petite rivière était bien souvent barrée par les travaux des castors. J'ai trouvé, par ci par là, des traces de ces animaux si actifs et si industriels; mais il paraît que ces fabricants non brevetés de digues et d'écluses ont suivi les ours dans leur retraite.\n\nJamais le temps ne m'a paru si court qu'pendant les cinq jours que j'ai passés au milieu des bois, en compagnie des défricheurs.\n\nMais il fallait bien songer au retour... comme je dois songer en ce moment à terminer ma lettre. C'est ce que je fais, en vous priant, mon cher directeur, de me croire toujours\n\nVotre tout dévoué,\nJean Lacharrue.\nSherbrooke, le 25 novembre 1882.\n\nMon cher directeur,\n\nAprès avoir visité Channay et ses environs, la rivière Arnold, où je trouve à chaque pas les traces du castor que le bûcheron a chassé du pays, et les belles terres qui s'étendent à l'Est du Mégantic, il est temps de songer au retour. Le désir de revoir ma famille qui m'attend à Sherbrooke, et la fatigue que m'occasionnent ces longues courses à travers la forêt, me font saluer avec joie le grand lac dont les eaux bleuâtres semblent boire avidement les derniers rayons du soleil couchant.\n\nIl a été convenu que nous allumerions un grand feu au bas de la berge, à l'endroit où se fera plus tard le débarcadère de Lourdes. À ce signal, le petit bateau à vapeur, à l'ancre dans une baie un peu plus loin, près d'une scierie mécanique, devait venir nous prendre et nous conduire aux Moulins Nantais, où nous passerions la nuit.\n\nPendant que M. Chicoyne explore les environs, songeant peut-être, colonisateur infatigable, à de nouveaux établissements, je me mets bravement à l'œuvre. Je me\nrappelle les aventures de Robinson, de Selkirk, de Guénolé, qui, eux aussi, allumaient des bûchers pour attirer l'attention des navires qu'ils apercevaient ou croyaient apercevoir au loin.\n\nMais entre eux et moi il y a une énorme différence. Ces malheureux avaient la mort dans l'âme, ils sentaient que leur vie dépendait de ce qui allait se passer dans quelques instants. Si le navire les apercevait, s'il venait à leur secours, ils étaient sauvés. Si le contraire arrivait, il fallait se résigner à recommencer une vie de misères, de dangers, d'inquiétudes continuelles. Je n'éprouve pas ces émotions-là. On nous verra ou on ne nous verra pas, mais cela m'est à peu près indifférent. Si le vapeur vient nous prendre, il nous conduira aux Moulins, où s'arrête le train qui nous ramènera demain à Sherbrooke ; s'il ne vient pas, nous traverserons un coin de la forêt, nous irons raconter notre mésaventure à l'un ou l'autre fermier, et nous arriverons aux Moulins par un autre chemin.\n\nQuelques troncs d'arbres sont là, entassés, couverts de petit bois bien sec. Il y aurait là une bonne provision d'hiver pour une famille belge ; ici, c'est un obstacle ; ce bois barre la route et gêne les défricheurs. Que le feu le détruise !\n\nLa flamme s'élève, une immense colonne de fumée passe au-dessus des arbres voisins, on doit nous voir d'un bout à l'autre du lac.\n\nMais, pas plus de bateau à vapeur que sur la main.\n\nAu commencement, l'attente ne me déplaît pas trop. Ce grand feu m'amuse ; je l'alimente sans cesse et la flamme monte, monte, atteignant la cime des arbres voisins. Mon compagnon de voyage ne s'ennuie pas plus\nque moi : il trace des plans et l'on dirait qu'il ne doit jamais quitter ces lieux.\n\nMais l'heure avance et nous ne pouvons attendre plus longtemps. Nous jetons un dernier regard investigator sur l'immense nappe d'eau et nous allons entrer dans les bois pour nous diriger vers un petit hameau où nous trouverons l'hospitalité, lorsque j'aperçois la chaloupe que nous avons traînée à la remorque jusqu'à Lourdes, et qui est encore là, se balançant mollement, faisant de temps en temps des bonds et des sauts, comme si elle voulait rompre la chaîne qui l'attache au rivage.\n\nSi nous faisions le trajet en chaloupe ?\n\nNous sommes — ou nous prétendons être — de très bons rameurs ; la force et le courage ne nous manquent pas, la distance qui nous sépare de la baie où s'abrite le vapeur n'est pas bien longue...\n\nPartons.\n\nEt nous voilà en plein lac, ramant de toutes nos forces, suant bientôt à grosses gouttes, mais n'avançant guère.\n\nQuand nous étions sur la rive, une brise légère agitait à peine les feuilles des arbres ; ici, le vent était d'une violence telle, qu'à un certain moment nous reculions au lieu d'avancer. La lutte devint bientôt impossible. La chaloupe dansait sur les vagues qui, à plusieurs reprises, passaient par-dessus bord.\n\nJe ne suis pas poirton, mais je m'aime pas d'exposer inutilement ma vie ; je proposai donc de retourner à Lourdes.\n\nMa proposition fut aussitôt adoptée.\n\nSeulement, le retour était plus facile à proposer qu'à effectuer. Lorsque les vagues s'amusent, elles ne lâchent pas facilement leurs jouets, et il paraît qu'en ce moment\nle Mégantic était d'une humeur folâtre : il nous fallut plus d'une heure d'efforts inouïs pour atteindre la rive, à au moins vingt-cinq minutes du point de départ.\n\nUn cèdre déraciné par les vents, tenant encore par ses racines à la rive, pendant que ses branches à demi submergées semblaient autant de bras qui se tendaient vers nous, arrêta la chaloupe, que nous attachâmes fortement à l'arbre sauveteur.\n\nJe fus très heureux en me retrouvant sur la terre ferme. Seulement alors je me rappelai ce que m'avait raconté, quatre jours avant, un des passagers du steamboat : le lac a souvent des tempêtes terribles, et sa profondeur égale celle de la mer. Lorsque j'ajouterai que je nage à peu près comme une pierre à aiguiseur, on comprendra sans peine mon contentement de me retrouver à terre.\n\nNous gravissons une côte assez raide, mais toute couverte d'arbres aux troncs épais, droits comme des flèches, victimes couronnées de verdure qui, cet hiver peut-être, tomberont sous la hache du défricheur et traverseront le lac sur l'épaisse couche de glace qu'y étendra le froid hiver. Le cèdre, le pin, l'érable à sucre, l'épinette et le merisier confondent leurs cimes, interceptent les derniers rayons du soleil, et font régner sous les voûtes et les arcades qu'ils forment une obscurité presque complète.\n\nMais nous sommes arrivés à un large sentier ou plutôt à un chemin d'hiver par lequel les défricheurs conduiront, sur leurs solides traîneaux, les billots destinés à la scierie mécanique.\n\nVoici la ferme du brave M. Dubois. Nous soufflons un instant, nous allumons notre pipe, nous nous entretenons pendant quelques instants avec la belle-fille de notre hôte,\net nous partons pour Piopolis dans la petite voiture du père Dubois, que traîne un cheval rapide comme le vent. La route est pittoresque, mais pas mal raboteuse ; nous sommes cahotés d'une façon effroyable, car on ne ralentit pas, même pour une descente rapide, l'allure du cheval.\n\nNous arrivons à Piopolis.\n\nLe digne curé, M. Cousineau, nous offre l'hospitalité la plus cordiale. Nous faisons grand honneur au succulent gigot de mouton qu'un appétit aiguisé par une longue marche nous fait trouver délicieux ; nous promettons de revenir un autre jour, afin de parler longuement de ce qui m'intéresse le plus, de la colonisation, et nous entreprenons la dernière étape qui nous sépare des Moulins-Nantais.\n\nPiopolis — la ville de Pie — est un modeste village où s'établirent, après la guerre franco-prussienne, grand nombre de zouaves pontificaux.\n\nLorsque l'armée garibaldienne s'approcha de Rome en 1867, on apprit ici que deux Canadiens avaient été blessés au combat de Monte-Rotondo.\n\nQue les typographes ne me fassent pas dire Montreton-Dos, car cela pourrait déplaire aux partisans du grand Garibaldi, le sauveur !... de la France. Vous connaissez la fameuse romance :\n\nC'est moi qui suis Garibaldi,\nTrrrremblez, ennemis de la France!...\n\nEn quelques jours plus de 15,000 Canadiens se firent inscrire sur les registres d'enrôlement pour l'armée pontificale. Malheureusement, à cette époque, l'organisation n'était guère complète, et l'argent manquait. On ne put envoyer à Rome que 500 hommes, qu'on rappela deux ans après pour les remplacer par 500 autres volon-\ntaires. Les frais de voyage, plus de 1,000 francs par soldat, furent couverts par une souscription que je puis bien appeler nationale, car pas un Canadien ne refusa son obole pour une œuvre si généreuse.\n\nAprès la prise de Rome, plusieurs zouaves fondèrent ici une bourgade qu'ils appelèrent Piopolis.\n\nJ'ai revu, depuis, le révérend curé de cette paroisse. Il m'a dit que de bonnes terres y sont encore à vendre à un prix excessivement bas, et qu'il verrait avec plaisir l'arrivée de quelques familles belges.\n\nÀ mon retour à Sherbrooke, je trouvai un gros paquet de lettres. L'une d'elles venait d'un grand et puissant ami de la colonisation belge, à qui je devais déjà des renseignements précieux.\n\nCe digne monsieur me citait un long passage d'une lettre adressée à l'honorable ministre de l'agriculture, en réponse à certaines questions que lui posait l'héritier d'un des grands noms de la France, dans le but de se renseigner sur la possibilité de trouver dans la province de Québec un établissement à sa convenance. Comme cette lettre résume d'une façon toute pratique les points principaux sur lesquels une famille, habituée à l'aisance, doit chercher à se renseigner, je crois qu'un extrait ne sera pas déplacé ici.\n\n« Il y a dans différentes parties de la province nombre de belles propriétés rurales qui pourraient être achetées à des prix variant de 250 à 300 francs l'arpent ou tiers d'hectare.\n\n» Je ne connais rien d'aussi sûr et d'aussi convenable à un gentilhomme français ou belge, que l'acquisition de quelques-unes de nos « seigneuries » avec moulins à farine et pouvoirs d'eau. Rien n'empêcherait d'y joindre\nun domaine exploitable d'une certaine étendue, qui formerait un revenu suffisant pour les besoins d'une famille habituée à l'aisance.\n\n» Pour préciser davantage, je crois qu'avec une somme de 100,000 francs, ou 20,000 piastres de notre monnaie, l'on peut acquérir 300 arpents d'excellentes terres, avec maison d'habitation, bâtiments de ferme convenables, ainsi que le bétail et l'outillage nécessaire à l'exploitation. Au reste, voici les détails :\n\n» 300 arpents à 50 piastres l'arpent 15,000 piastres\n» 20 vaches, à 30 piastres 600 »\n» 6 chevaux dont 2 de luxe 800 »\n» 20 beaux moutons à 10 piastres 200 »\n» Porcs et basse-cour 100 »\n» Matériel d'exploitation 1,000 »\n» Frais d'installation et changements 500 »\n\nEn tout 18,200 piastres\n\n» Les 1,800 piastres qui restent pour atteindre les 20,000 pourraient bien être absorbées par le prix d'achat, que j'ai fixé au minimum de 50 piastres de l'arpent. J'ai discuté chacun de ces chiffres avec l'honorable M. Dionne qui, en sa qualité de grand propriétaire rural, connaît à fond toutes les questions; il les approuve.\n\n» Un domaine de cette étendue, convenablement exploité, devrait donner un revenu régulier de 4 à 5 pour cent au moins. M. Dionne m'affirme que les terres de Sainte-Anne lui donnent le double. En général, les cultivateurs canadiens, qui font valoir eux-mêmes leurs fermes, arrivent facilement à se faire un revenu dépassant huit pour cent.\n\n» L'élevage des bestiaux, soit en vue de l'exportation,\nsoit en vue de la propagation des races améliorées, est devenu depuis quelques années une source de gros profits pour un grand nombre de nos cultivateurs. D'autres s'adonnent de préférence à la production du lait, pour alimenter les fabriques de beurre et de fromage qui s'établissent de tous côtés. On calcule que les bonnes vaches laitières rapportent annuellement à leurs propriétaires de 25 à 40 piastres par tête, selon qu'elles sont plus ou moins bien nourries.\n\nLa culture de la betterave à sucre, qui commence à s'introduire dans la province, offre encore une exploitation très profitable et surtout très propre à rendre aux terres épuisées leur fertilité première...\n\nCette lettre porte une signature qui impose le respect. C'est celle de l'honorable M. Le Sage, assistant-commissaire, dont la sincérité et la grande compétence ne sauraient être mises en doute.\n\nJe dirai même que, sans doute dans la crainte d'induire en erreur, il exagère le prix de revient des terres, des animaux et des objets nécessaires à une grande exploitation.\n\nIl est vrai qu'il s'agit ici d'un domaine seigneurial avec habitations grandioses, mais il ne faut pas toujours dépenser de si fortes sommes pour l'acquisition du fond. J'ai vu, en effet, des vaches qui se vendaient 30 piastres et des moutons qui en valaient 10. Mais ce sont alors des animaux qui figurerait dignement dans une exposition.\n\nLe cultivateur vend volontiers à des prix moins élevés : son bétail lui coûte si peu !\n\nJe finis... Il neige depuis deux jours, mais il ne fait pas bien froid. J'appelle de tous mes vœux une bonne\ncouche de neige et une forte gelée, afin de voir sortir les traîneaux et... d'en profiter.\n\nMa prochaine vous parlera d'autres contrées.\n\nVotre tout dévoué,\n\nJEAN LACHARRUE.\nSherbrooke, le 30 novembre 1882.\n\nMon cher directeur,\n\nLa neige a fait son entrée ou plutôt sa descente triomphale au Canada.\n\nSon apparition a été saluée par un grand cri de joie poussé par les défricheurs, qui pourront bientôt charroyer leur bois sur les chemins d'hiver, et par les cultivateurs qui tenaient leurs trameaux tout prêts pour commencer à transporter les céréales.\n\nL'une des fenêtres de mon petit cabinet de travail donne sur une rue en pente, qu'une vingtaine de petits garçons ont transformée en montagne russe. Leurs joyeuses clamours attirent continuellement mon attention.\n\nIls montent jusqu'au sommet de la côte, trainant en chantant leur petit radeau. Il s'en trouve parmi eux qui donnent la main à un petit frère ou à une petite sœur, auxquels ils céderont une place sur leur minuscule « voiture d'hiver. »\n\nLes voici arrivés. Ils se rangent en file, les plus grands\net les plus adroits en tête, les plus jeunes et les plus faibles à la suite...\n\nUne, deux, trois!...\n\nL'avalanche mignonne descend comme un tourbillon. La joie, bien plus que le froid, rougit les figures épanouies. La bande passe sous ma fenêtre avec la rapidité de l'éclair; j'ai à peine eu le temps de constater que mon fils est parmi les concurrents de ce steeple-chase d'un nouveau genre. Sa jeune sœur s'accroche au collet de son paletot fourré; elle n'est pas la moins joyeuse ni la moins bruyante. Tous les deux se comportent comme de vrais Canadiens.\n\nJe dois vous dire que le froid ne m'incomMODE nullement; la neige, fine et sèche, ne gêne pas les piétons, et il n'y a pas de vent. À l'intérieur des maisons, il fait même trop chaud; un poêle brûle dans une place à côté de mon bureau, et j'ai été forcé d'éteindre mon feu.\n\nComme je vous l'ai dit dans mon avant-dernière lettre, je viens de visiter Ottawa et une partie des régions qui s'étendent autour des grands lacs.\n\nCe que j'ai vu de terres propres à la culture, où pourraient s'établir des colons, est incalculable. Cela n'étonnera personne, lorsque le dirai qu'une seule province canadienne, le Manitoba, situé au nord-ouest, est, à elle seule, plus grande que la France.\n\nOttawa est une belle ville, qui s'est développée avec une rapidité inouïe. Quoiqu'elle ne compte que 28,000 habitants, elle est beaucoup plus étendue que ne le serait une ville belge de 80 à 100,000 âmes. Ici la population ne se trouve pas si resserrée que dans la vieille Europe. Chaque citoyen a sa maison pour lui tout seul, et cette maison est toujours composée de plusieurs pièces.\nDepuis l'entrée de la ville jusqu'aux superbes bâtiments du Parlement, Ottawa est bâtie sur un terrain très uni. Les rues sont droites et larges. À partir du Parlement, les choses changent; la descente serait raide comme une échelle, si l'on n'avait construit un chemin creusé dans le roc ou pour mieux dire suspendu aux flancs de la montagne. Quelle splendide promenade! Des arbres de toute essence forment au-dessus de votre tête une voûte que les rayons du soleil ne sauraient pénétrer, et à vos pieds s'étend l'immense nappe de l'Ottawa, dont les rives sont couvertes d'une quantité suffisante de bois de construction pour alimenter tous les marchés européens.\n\nAu loin d'immenses cascades, blanches d'écume, captivent non attention. Des hommes, debout au milieu de grands radeaux de bois, passent ces rapides; je crois rêver en voyant à l'œuvre ces intrépides Canadiens qu'aucun danger n'effraie, qu'aucune crainte n'arrête.\n\nL'hôtel où je descends est un des plus grands que j'aie jamais vus, et, sans contredit, le plus complet. On y trouve tout ce qui peut donner quelque agrément aux voyageurs : salle de billards, magasin de tabac et de cigares, cantine séparée du reste de l'établissement, postes et télégraphes, ascenseur, etc. J'y rencontre un ami de Québec qui revient d'un voyage au Manitoba. Je lui offre de prendre avec moi, en attendant le dîner, un verre de brandy, et il me fournit des renseignements dont j'espère profiter plus tard.\n\nIl a passé quelques jours à Winnipeg.\n\nCette dernière ville n'existait pas encore en 1870. Il y avait, à l'endroit où elle s'élève aujourd'hui, une espèce de forteresse autour de laquelle venaient camper parfois\ndes tribus nomades. Aujourd'hui, Winnipeg est une belle et grande cité, où les terrains à bâtir se vendent aussi cher que dans les plus grandes de nos villes européennes.\n\nMon ami a passé quelques jours en pleine campagne, chez des colons anglais. Il dit que jamais il ne vit de plus belles cultures.\n\nLe climat du Nord-Ouest est très sain. Cependant il y a quelquefois des tempêtes et des giboulées, qui viennent contrarier les fermiers.\n\nMême lorsque les prairies sont couvertes de neige, on y voit pâturer les bêtes à cornes et les chevaux indigènes. Ces animaux écartent la neige avec leurs pieds, et l'herbe est tellement bonne et abondante que non seulement le bétail parvient à se nourrir, mais il s'engraisse. Le sol est si riche que les premières années il ne supporte pas d'engrais.\n\nToutes les céréales viennent et mûrissent en grande abondance au Manitoba, mais c'est surtout le blé qui y donne de superbes récoltes. Il pèse ordinairement de 62 à 66 livres par boisseau, et le rendement moyen est de 25 boisseaux par acre ou 40 acres 47 centiares.\n\nCe qui frappe surtout le voyageur, au Canada, c'est le bien-être des ouvriers. Le « pauv' peuple » n'existe pas ici. Tout le monde travaille et tout le monde gagne largement de quoi vivre. Quelquefois on verra un estropié ou un vieillard, abandonné par sa famille, demander l'aumône ; mais cela arrive bien rarement. On ne voit pas ici, surtout parmi les familles canadiennes, des enfants coupables refuser à leurs vieux parents le pain et les soins auxquels ils ont droit. La charité publique ouvre d'ailleurs un asile à tous ceux qui sont réellement\nmalheureux, et ces asiles sont généreusement soutenus par toute la population, quels que soient son origine et son culte.\n\nA ce propos, je dois vous citer un fait bien touchant. Lundi dernier, les Dames de Sherbrooke ont ouvert, dans une immense salle, le « Bazar de la Charité » au profit de l'hôpital de cette ville.\n\nD'un côté de la salle, on remarque un nombre infini d'objets qui forment le prix d'une tombola très curieusement organisée. De l'autre est dressée une table où, chaque soir, apparaissent les mets les plus succulents, depuis le plat national : la soupe aux huîtres, jusqu'à la dinde fricassée. Les visiteurs peuvent se restaurer et faire une bonne œuvre, car les bénéfices que rapportent ces agapes fraternelles sont encore pour les pauvres. Le service se fait par des dames auxquelles les personnaires des bonnes Sœurs doivent la plus grande reconnaissance, car elles s'acquittent de leurs fonctions avec une politesse exquise et un zèle infatigable. Chaque soir, Mgr l'Evêque préside au repas, entouré de son clergé qui ne refuse jamais son concours aux œuvres charitables.\n\nQuand on se lève de table, on est entouré par une troupe joyeuse de gentilles demoiselles qui présentent la liste des objets à tirer au sort. Autant de listes, autant de sollicitueuses souriantes, empressées et tenaces. Je ne conseillerais pas aux égoïstes et aux avares de visiter le Bazar de la Charité. De bon cœur ou en maugréant, il faut donner. Je me hâte de dire qu'on donne de bon cœur, avec joie ; c'est pour les pauvres, c'est pour le bon Dieu !\n\nIl faut bien ajouter qu'ici la charité n'impose pas de bien grands sacrifices ; les pauvres et les malheureux\nsont peu nombreux et les piastres arrivent facilement dans la caisse des indigents. En donnant aux Canadiens des ressources abondantes, la Providence leur a aussi accordé un cœur généreux et compatisant.\n\nSi vous rencontrez Louise Michel, faites-lui bien des compliments de ma part. Elle devrait venir nous donner des conférences; on lui offrirait sa statue en neige glacée.\n\nJe finis, car un bruit de grelots m'annonce qu'un ami, qui doit me procurer le plaisir d'une promenade en traîneau, m'attend à la porte. Le voilà qui entre. Pendant qu'il allume sa pipe, je vous présente, ainsi qu'à tous vos lecteurs, mes salutations les plus sincères.\n\nJean Lacharrue.\nSherbrooke, le 14 décembre 1882.\n\nMon cher Directeur,\n\nJe vous ai dit au cours de ma dernière lettre que j'ai fait la connaissance de la neige canadienne. Je m'avançais trop : je ne possédais encore que la théorie. Aujourd'hui, je connais la pratique. J'ai vu la neige chez elle, dans son domaine, en pleine campagne, dans les ravins et les chemins creux, au milieu des plaines immenses où le vent la ramasse en tas de cinq à trente pieds de profondeur.\n\nNe craignez pas que je vous envoie un chapitre des mémoires de M. le baron de Munckhausen, alias de Crac... Je n'ai pas marché sous la neige, mais bien dans la neige. J'ai même failli y laisser mon paletot... avec son contenu.\n\nLe 8 décembre dernier, deuxième anniversaire de la première messe célébrée à Channay, sur la frontière des États-Unis, les membres de la Colonie florissante devaient se réunir dans la demeure de M. Bécigneul, pour assister au service divin célébré par le R. P. Jérôme, trappiste\nde Bethléem. M. Chicoyne, directeur de la Colonie française, et le Rév. abbé Cousineau, curé de la paroisse et missionnaire pour tout le canton, voulaient bien m'envoyer une invitation. La même faveur fut accordée à M. le notaire Noël, qui a sa place marquée dans toutes les réunions de ce genre, car il est l'ami et le protecteur désintéressé des émigrants, quelle que soit leur nationalité.\n\nJ'ai parlé longuement de Channay dans ma lettre du 18 octobre dernier. J'avais visité ce village naissant au commencement de septembre. On y voyait alors quelques rares cabanes. Aujourd'hui il y a bien des changements. Sous l'habile direction de M. Chicoyne, que seconde si vaillamment M. Bécigneul, Channay a changé d'aspect. De belles maisons, un hôtel et un beau magasin y ont été construits. Une vaste grange, des écuries et des étables superbes, prouvent que la laiterie et la fromagerie pourront fonctionner au printemps prochain.\n\nNous quittâmes Sherbrooke le mercredi 6 décembre. La neige couvrait la terre, et à chaque instant sa couche protectrice devenait plus épaisse.\n\nÀ Scotstown, le R. P. Jérôme vint nous rejoindre. Son couvent de Bethléem, au village de La Patrie, est situé à environ huit milles de la gare. Il avait fait ce trajet en raquettes ou souliers à neige, qui permettent de passer sur le tapis blanc sans s'y enfoncer.\n\nIl était convenu que le R. P. Jérôme et moi nous descendrions à la Baie des Sables, où nous attendait le train de M. le curé de Piopolis. MM. Chicoyne et Noël devaient passer la nuit aux moulins Nantais, et nous rejoindre le lendemain à Piopolis.\n\nLe conducteur du train nous joua une belle farce : il\ndépassa la Baie des Sables et nous conduisit tout bonne-\nment aux Moulins.\n\nCe fut la première contrariété d'un voyage qui devait\nnous en procurer bien d'autres.\n\nInutile de dire qu'une nuit de décembre aux bords\nd'un grand lac n'est pas bien chaude. Lorsque nous\nfrappâmes à la porte de M. Chartier, chef-comptable des\nMoulins, ma barbe avait l'air d'un énorme glaçon, et nous\nressemblions à quatre prisonniers en route pour la Sibé-\nrie. Nos bonnets en peau de loutre et nos capotes four-\nrées disparaissant sous une couche de neige durcie par\nle vent.\n\nSingulier phénomène : le froid ne m'incommodait\nnullement. Lorsque j'eus dégelé ma barbe et séché mes\nvêtements, je me sentis gai et dispos. Cependant j'étais\nparti avec inquiétude ; depuis huit jours l'excès de fatigue\nme faisait beaucoup souffrir, et j'avais hésité longtemps\navant d'entreprendre le voyage.\n\nLe froid sec et l'air vif des hivers canadiens fortifient\nles voyageurs au lieu de les incommoder.\n\nM. Chartier et sa bonne dame nous offrirent l'hos-\npitalité avec un empressement qui en doublait le mérite.\n\nAprès avoir réparé nos forces par un bon repas\npréparé à la hâte, après la pipe traditionnelle et la cau-\nserie au coin du feu, nous payâmes le tribut à Morphée.\nComme on dort bien quand le vent souffle dans les\narbres et semble vouloir changer leurs branches en lyre\néolienne !\n\nQuant le R. P. Jérôme, qui avait trouvé un asile chez\nnotre ami M. Legendre, vint nous rejoindre de grand\nmatin, M. Chicoyne avait déjà fait une tournée aux\nMoulins... Il avait oublié de se coucher. La vérification\ndes comptes et l'établissement d'un inventaire l'avaient si bien occupé, qu'il fut tout surpris lorsque cinq heures sonnèrent. Pour les comptes du sommeil, c'était une nuit à porter aux « profits et pertes. »\n\nEn route!\n\nNous avons onze milles à parcourir pour arriver à Piopolis, où le Rév. M. Cousineau pourra prendre des mesures extraordinaires afin d'apaiser quatre estomacs affamés. Je connais en Belgique beaucoup de gens qui sont forcés de visiter chaque jour au moins une demi-douzaine de cantines pour se donner de l'appétit. Qu'ils viennent donc passer quelques semaines ici, et ils mangeront comme des ogres.\n\nLa couche de neige s'est considérablement épaissie pendant la nuit. Bientôt la charge devient trop lourde pour la petite pouliche qui nous traîne ; il faut gravir à pied les nombreuses côtes que nous rencontrons, et cela n'est pas toujours chose facile. Parfois nous enfonçons dans la neige jusqu'aux genoux.\n\nCela ne m'empêche pas d'admirer le spectacle merveilleux qui s'offre à mes yeux, lorsque nous traversons une partie de la forêt vierge où la hache du défricheur n'a pas encore tracé des éclaircies. Les sapins séculaires, couverts d'une toison blanche, semblent grelotter de froid ; parfois un érable gigantesque secoue ses branches chargées de neige et provoque une avalanche qui fait craquer les jeunes arbres d'alentour. Plus loin, dans une clairière, les souches couvertes d'un immense bourrelet de neige ont l'air d'énormes champignons. Des troncs calcinés s'élèvent au milieu des champs où passa le feu l'an dernier, et l'hermine qui les couvre les fait ressembler à des géants chargés de veiller sur ces vastes solitudes,\nNous arrivons.\n\nM. le curé, persuadé que nous avions traversé le lac pour arriver plus vite à Channay, était parti depuis quelques heures. Fort heureusement, sa vaillante cuisinière était à son poste. Nous pûmes nous restaurer complètement, pendant que notre cheval trouvait bonne litière et ratelier bien fourni.\n\nLe voyage s'acheva sans accidents ; mais le vent du nord nous envoyait parfois une neige fine et glacée qui s'attachait à notre barbe et nous transformait en « Papas l'Hiver » du plus beau modèle.\n\nL'obscurité était complète, lorsque nous arrivâmes à Channay.\n\nNous étions superbes ! Tout blancs, tout glacés.... extérieurement, bien entendu, mais plus gais que jamais.\n\nLe souper nous fut servi à la Campe, c'est-à-dire, dans la cabane en troncs d'arbres des défricheurs. Jamais les plats traditionnels, la soupe aux pois et les fèves au lard ne parurent plus succulents; après cela une bonne galette au sirop d'érable, une tasse de thé bien chaud et, pour terminer la soirée, la gaie veillée dans le salon-magasin-cuisine-dortoir provisoire du bon M. Bécigneul.\n\nC'est dans cette place que sera célébrée le lendemain, Fête de l'Immaculée Conception, le Saint Sacrifice de la messe. Tout en causant, nous séchons nos fourrures qui doivent, pendant la nuit, nous servir de matelas, de couvertures et d'oreillers. C'est M. Noël qui est chargé de faire nos lits. Il s'en tire admirablement. Vers minuit je m'endors, les pieds au feu, la tête sur une peau d'ours, chaudement couvert d'une couple de peaux de bisons.\n\nCinq heures sonnent. On frappe à la porte; ce sont des colons qui viennent se confesser. Ils profitent de la\nprésence du R. P. trappiste et du prêtre missionnaire pour fêter chrétiennement l'anniversaire de la fondation de leur colonie.\n\nBientôt la vaste salle se remplit d'hommes et de femmes qui, comme les chrétiens des premiers siècles, ont traversé les forêts et parcouru des chemins à peine tracé pour venir adorer le Dieu de miséricorde.\n\nL'autel est dressé. Il est bien modeste, mais la foi des assistants supplée à l'absence des riches ornements et des sculptures dorées.\n\nLe service divin commence.\n\nTous ces bons chrétiens agenouillés pieusement, les mains jointes, le front incliné, ces intrépides défricheurs, ces hommes qu'aucune crainte, qu'aucune fatigue n'arrête, ces conquérants pacifiques dont chaque coup de hache est un service rendu à la civilisation et au pays, s'humilient devant le Roi des Rois descendu, à la voix du prêtre, sur cet autel rustique, dans cette humble demeure : voilà certes le spectacle le plus touchant que j'aie jamais eu sous les yeux.\n\nTous les assistants s'approchèrent de la sainte Table, et je fus vraiment édifié à la vue de la piété sincère de ces vaillants habitants de la forêt.\n\nAvec de pareils éléments, la colonie de Channay doit prospérer. C'est ce que je souhaite de tout cœur à son fondateur, M. Chicoyne, au digne prêtre qui se donne tant de peine pour procurer aux colons les bienfaits de la religion, c'est ce que je souhaite surtout aux habitants du village naissant.\n\nLe R. P. Jérôme, dans une courte mais très éloquente improvisation, félicita les braves chrétiens qui venaient, comme les bergers de Bethléem, adorer le Sauveur des-\ncendu dans l'humble demeure d'un colon; il parla surtout de la Vierge Immaculée, qui protège d'une façon toute spéciale les humbles et les petits; il exhorte tous les assistants au zèle et à la persévérance dans la foi.\n\nMais l'heure s'avance, les chemins sont mauvais; il faut songer au retour. Nous devons passer la nuit aux Moulins-Nantais, et reprendre le train pour Sherbrooke à six heures du matin.\n\nNotre petit cheval aura moins de mal qu'au départ — nous le croyons au moins — car M. le curé de Piopolis nous offre, au R. P. Jérôme et à moi, une place dans son traîneau. Au moment où deux vigoureux chevaux, impatients de revoir leur écurie, nous emportent au grand trot, le vent du nord souffle avec violence, la neige nous aveugle, et un bûcheron, sortant de la forêt, nous crie que nous rencontreron de nombreux obstacles.\n\nCette prédiction sinistre n'effraie nullement notre vail-ant conducteur. Sa paroisse est grande comme une province belge, et il est sans cesse contraint de parcourir les plus longues distances par tous les temps et par tous les chemins:\n\nÀ certains moments, les chevaux ont de la neige jusqu'au poitrail, le traîneau penche tantôt d'un côté, tantôt de l'autre, mais nous avançons toujours, nous abritant le mieux possible contre le vent glacé.\n\nTout à coup nous nous trouvons devant une barrière infranchissable. Cinq ou six arbres, déracinés par la tempête, nous barrent le chemin. Pendant que je me demande comment nous allons nous tirer de ce mauvais pas, le rév. M. Cousineau est déjà dans la forêt, la hache à la main, pour nous y tracer un chemin. Mais il n'a pas besoin de se donner cette peine. Un jeune Canadien,\nM. Hubert, nous a vus de loin; il accourt et, en moins de dix minutes, il a abattu six arbres d'une grosseur de 18 à 25 centimètres. J'oublie la neige et le vent à la vue de ce prodige. J'ai à peine le temps de regarder l'arbre condamné et le voilà à terre. Il faut avoir vu à l'œuvre un défricher canadien pour se faire une idée de son agilité, de sa force et de son adresse.\n\nVoilà donc l'obstacle tourné. Nous reprenons notre course accélérée; il s'agit de regagner le temps perdu, car M. le curé doit célébrer sa messe à Piopolis et ses paroissiens l'attendent.\n\nCependant la route devient de plus en plus mauvaise, et nos chevaux sont tout essoufflés lorsque nous arrivons à la cure. Ce n'est pas sans inquiétude que je songe à la dernière étape que nous aurons à parcourir.\n\nAprès la messe, MM. Chicoyne et Noël viennent nous rejoindre. Nous restaurons nos forces, nous prenons un peu de repos... et la neige tombe toujours.\n\nMaintenant, lecteurs compatisants et lectrices sensibles, préparez vos mouchoirs.\n\nIci commence l'histoire lamentable de ma première mésaventure au Canada.\n\nMM. Chicoyne et Noël prirent les devants. Fauvez, la petite pouliche, secouant gaiment sa crinière, n'avait pas l'air de se douter qu'elle allait bientôt être soumise à une rude épreuve.\n\nM. le curé, retenu à Piopolis par les devoirs de son ministère, pria un de ses paroissiens, M. Dubois, de nous conduire jusqu'au lac. Nous pouvions partir un peu plus tard, car notre cheval, très vigoureux et bon trotteur, aurait bientôt rejoint nos précurseurs.\nC'était un vrai temps de chien. La neige « poudrait » d'une façon désespérée et s'amassait en bancs épais.\n\nL'obscurité commençait à descendre, lorsque nous vîmes au loin MM. Chicoyne et Noël qui paraissaient s'amuser énormément. C'est du moins ce que je n'imagine pas, car il me semblait qu'ils dansaient. Je riais de bon cœur, mais ma gâterie fut de courte durée. Lorsque nous eûmes rejoint nos compagnons de voyage, il nous fallut descendre du traîneau et danser comme eux. Nous avions de la neige jusqu'à la poitrine, et tout ce que nos pauvres chevaux pouvaient faire, c'était de traîner les véhicules vides.\n\nJe me suis déjà trouvé à des divertissements qui étaient plus de mon goût que cet exercice-là. Descendre dans la neige, c'est assez commode. Mais en sortir, s'enfoncer de nouveau, et parcourir ainsi au moins un quart de mille, ce n'est pas gai du tout!...\n\nEnfin, nous atteignons la terre ferme, le banc est traversé. En voiture! Je me secoue de mon mieux, j'allume ma pipe, je suis le premier à rire de mon désappointement, lorsque tout à coup le traîneau s'arrête. La danse recommence, mais d'une façon plus sérieuse. Notre cheval s'enfonce dans la neige; seule sa tête se voit encore et nous sommes autour de lui aussi « plantés » que la pauvre bête, et nous demandant ce qui nous reste à faire. C'est la première fois que pareille chose m'arrive, et je propose tout bonnement de passer la nuit à la belle — je pourrais dire à la laide — étoile.\n\nMais les Canadiens ne se « démontent » pas si facilement. M. Dubois se met à tasser la neige. Le R. P. Jérôme imite son exemple, et je me mets bravement de la\npartie, sans trop comprendre à quoi peut servir cette gymnastique forcée. Bientôt le cheval est dégagé.\n\nM. Dubois enjambe la clôture d'une propriété, sonde le terrain et revient nous dire que là il y a moins de neige. Nous démolissons une partie de la barrière, nous soulevons le traîneau et, en effet, nous avançons, difficilement, c'est vrai, mais nous avançons.\n\nJ'abrège...\n\nAvant d'arriver aux Moulins, la même scène se renouvela encore cinq ou six fois. J'ai fait à quatre pattes au moins une bonne demi lieue. Lorsque je pus enfin m'asseoir au coin du feu, à l'Hôtel Canadien de Nantes, j'étais à bout de forces. Mais un bon grog au brandy me restaure complètement, la sempiternelle tasse de thé me remit en bonne humeur, et je me déclarai prêt à recommencer.\n\nM. Noël trouva que la chose était loin d'être nécessaire, et il me conseilla charitablement d'achever la nuit, déjà passablement avancée, dans mon lit.\n\nC'est ce que je fis et je vous prie de croire, cher lecteur, qu'il ne fallut pas me bercer pour m'endormir.\n\nEt maintenant que je me retrouve dans mon petit cabinet de travail, bien chauffé, je ne donnerais ni pour or ni pour argent le plaisir que m'a causé mon voyage à Channay.\n\nJ'ai vu ce village, à peine fondé, en septembre dernier, alors que les arbres étaient encore couverts de feuillage et que la première moisson se dorait au soleil ; je l'ai revu en plein hiver, alors que les humbles toits disparaissaient sous la neige, et aujourd'hui comme autrefois c'est dans toute la sincérité de mon âme que je dis :\n\nHeureux habitants de ce paisible village, j'envie votre\nbonheur! Vous ne connaissez pas les plaisirs trompeurs des prétendus centres de civilisation et de progrès, mais vous vivez dans l'abondance, vous jouissez d'une liberté entière, dont vous n'abusez jamais; vous aimez, vous travaillez, vous priez; tous les trésors de la terre n'ajouteraient rien à votre bonheur.\n\nL'an prochain, s'il plaît à Dieu, j'irai fêter avec vous l'anniversaire de la première messe célébrée dans votre paroisse. À cette époque, vous aurez une église et un curé. Mais j'espère y rencontrer, comme vendredi dernier, le Rév. Père Jérôme et le digne M. Cousineau, vos pasteurs bien-aimés. Puissent-ils être de longues années encore les premiers invités à cette fête religieuse, éminemment fraternelle et patriotique, car ils méritent, avec M. Chicoyne, le titre glorieux de fondateurs du beau village de Channay. À cette époque aussi j'espère voir le nombre des maisons pour le moins déculpé, et l'Hôtel Saint-Joseph trop petit pour loger les hôtes qui ne manqueront pas d'accourir pour réclamer leur part de la fête.\n\nAgréez, mon cher directeur, l'assurance de mon dévouement très sincère.\n\nJean Lacharrue.\n\nP.-S. — Un ami m'écrit qu'on me reproche en Belgique de prêcher l'émigration au Canada. C'est singulier, on me reproche toujours toutes sortes de choses quand je n'y suis pas!...\n\nVous ferez en tout cas de mes correspondances ce qu'il vous plaira. Jamais je n'ai dit, jamais je ne dirai à qui que ce soit— sauf à quelques rares amis— : allez ici ou là, faites ceci ou cela. C'est surtout lorsque je confie mes lettres à un journal, que je m'impose la plus grande\nréserve. Je suis venu m'établir au Canada, parce qu'il me plaisait d'y venir : je n'ai nulle envie de pousser qui que ce soit à imiter mon exemple. Si je n'étais pas content ici, je retournerais au pays, toujours sans prier mes compatriotes, fixés dans cette contrée, de partir avec moi.\n\nJe tiens trop à ma liberté personnelle pour songer jamais à porter la moindre atteinte à la liberté des autres.\n\nJe suis persuadé que le Canada est le plus beau pays du monde. D'autres trouvent que je me trompe. La belle affaire!... Le monde serait bien triste si nous étions tous du même avis.\n\nJ. L.\nMon cher directeur,\n\nNous voici donc en pleine... période des fêtes. Pendant l'été, le Canadien n'a pas le temps de s'amuser beaucoup, car, généralement, les bras manquent pour les travaux de la campagne. Mais comme on se rattrape bien en hiver ! Ce n'est pas quelques heures, ce n'est pas un jour ce n'est pas même une semaine qu'on consacre aux visites entre parents et amis, aux fêtes et réjouissances ; c'est une bonne partie de la saison.\n\nSurtout depuis la Noël jusqu'aux Rois, on s'en donne à cœur joie.\n\nComme cela se faisait autrefois dans notre pays, enfants et petits enfants se rassemblent volontiers dans la demeure du grand-père, qui a parfois le plaisir de voir autour de lui un nombre considérable de descendants, et la corvée — bien agréable — de loger et de nourrir tout ce monde pendant plusieurs jours.\n\nMais cela n'effraie personne ici. On achète une vache ou un bœuf et un porc, on les expose au froid et, quand ils sont bien gelés, on les met dans un hangar, sous une\ncouche de neige, et les provisions ne manquent pas pendant tout l'hiver.\n\nN'étant pas encore grand-père, je n'ai pu imiter cet exemple ; mais j'ai dans mon garde-manger une centaine de livres de bœuf, parfaitement gelé, que j'ai pu acheter à raison de vingt centimes — quatre cents canadiens — la livre. Si vous voulez m'honorer d'une visite, à toute heure du jour ou de la nuit, on est capable de vous recevoir amicalement et confortablement. Pour les vendredis, j'ai une bonne provision de saumon et d'anguilles : cela vaut ici dix cents, c'est-à-dire cinquante centimes la livre.\n\nDepuis que je vous ai annoncé l'arrivée de la première neige, le tapis blanc sans s'épaissir beaucoup, a été entretenu parfaitement.\n\nMa petite famille et moi, nous souffrons beaucoup moins du froid que lorsque nous étions en Belgique ; la différence est même assez grande. Ce qui m'incomMODE le plus, ce sont les grands feux qu'entretiennent chez eux mes amis Canadiens. Sous prétexte de vous chauffer, ils vous grillent. Ils ont des poêles énormes dans lesquels ils fourrent des bûches colossales.\n\nJe crois vous avoir déjà dit que le vrai Canadien ne va au café que lorsqu'il est en voyage. Cela ne l'empêche pas de s'amuser ; au contraire. On se réunit tantôt chez un ami, tantôt chez un autre, et l'on passe des soirées d'autant plus gaies qu'on ne s'y occupe jamais de politique.\n\nTenez, c'est aujourd'hui même mon tour de recevoir une douzaine de bons amis. Si le cœur vous en dit, vous serez le bienvenu et je vous ferai faire la connaissance de gais compagnons, qui ne vous laisseront pas le temps de vous ennuyer.\nMais je bats la campagne, j'oublie de vous parler de nos fêtes et des grandes réunions de famille.\n\nÀ Brompton, à deux lieues d'ici, un brave travailleur, M. Théodore Chevalier, voyait le jour de l'an à sa table huit enfants, quatre gendres et brus, et vingt-huit petits-enfants. En tout, une famille de quarante personnes... munies de billets de logement. M. Chevalier n'est âgé que de 56 ans, et sa respectable épouse de 60 ans.\n\nLe jour du nouvel an a été, aussi bien que la Noël, joyeusement fêté à Sherbrooke. Tout s'est passé convenablement, nous pouvons dire honorablement. La prospérité dont ils jouissent, pour la plupart, permet aux habitants de ce pays de faire quelques sacrifices pour se réjouir avec leurs amis et leur faire bonne et cordiale réception.\n\nChose rare pour un étranger : parmi ces milliers de personnes se livrant à la joie que procurent toujours les visites du jour de l'an, aucune n'a mérité d'être « rappelée à l'ordre » par ces messieurs de la police qui pouvaient ainsi, en compagnie de leur famille, faire leurs visites traditionnelles.\n\nLes choses ne se passent pas ainsi au vieux pays, surtout à Paris, à Bruxelles et dans les autres prétendus centres de civilisation et de progrès, où les violons, les amigos et autres asiles ouverts aux disciples de Bacchus, sont toujours trop petits les jours de fête.\n\nLes visites à l'évêché, au séminaire, chez les bonnes Sœurs et chez les Frères, ont été plus nombreuses que jamais. C'était un spectacle vraiment touchant, que la réunion de tous ces groupes d'habitants de Sherbrooke dans les salons de notre vénérable évêque. Ce n'était pas ici un simple hommage, bien mérité sans doute, rendu\nau pasteur bien aimé par ses ouailles dévouées; c'était une manifestation chrétienne, une imposante profession de foi. Monseigneur eut une parole affectueuse pour chacun de ses visiteurs et il leur donna des étranges bien précieuses : ses bons souhaits que le Seigneur exaucera, nous n'en doutons nullement, et sa sainte bénédiction que tous reçurent avec joie et reconnaissance.\n\nLe temps était magnifique et, n'eût été la blanche couche chère aux poètes, on pouvait très bien se croire en plein printemps, tellement le soleil était brillant et le ciel d'un azur sans tache. Aussi la circulation fut-elle joyeuse et animée, jusqu'à une heure assez avancée.\n\nOui, on s'est parfaitement bien amusé ici, le jour de Noël et le jour du nouvel an, et on s'amusera encore parfaitement bien le jour des Rois, mais on le fera honnêtement, sans se préparer, par des excès ou des désordres, des chagrins ou des remords pour le lendemain.\n\nJ'ai fait, le jour de l'an, pour le moins une cinquantaine de visites. Ce qui m'a frappé le plus, c'était, après l'accueil cordial que je trouvais partout, cette espèce de tranquillité d'esprit, de confiance en l'avenir, qui règne dans toutes les familles.\n\nLa population du Canada ne connaît pas, en général, les soucis de la politique dont on est toujours préoccupé dans notre pays, ni les soucis causés par la triple crise qui éprouve en ce moment la vieille Europe. Je l'ai déjà dit bien souvent et je veux le répéter en terminant cette lettre : tous ceux qui veulent travailler courageusement et se conduire honnêtement trouveront au Canada paix, bonheur et abondance. Il y a peut-être, il y a sans doute des exceptions, mais je n'en ai pas encore rencontré.\n« Dans quelques jours, le 20 de ce mois, je m'embarquerai à Halifax, sur le bateau à vapeur qui m'a amené ici : le Polinesian. Quelle coïncidence ! Seulement, je ne voyagerai pas tout à fait de la même façon. Le voyageur d'entrepont aura une cabine. — Mon coupon est déjà prêt — et le cœur du père de famille ne battra pas d'inquiétude au sujet du « pain quotidien. » Ce pain m'est assuré aujourd'hui et... quelque chose avec. Voilà pourquoi je pars heureux et content. — A bientôt!...\n\nVotre tout dévoué\n\nJEAN LACHARRUE.\nLE GRAND OCCIDENT CANADIEN.\n\nLe but de cette brochure étant de donner aux émigrants les meilleurs renseignements possibles au sujet de la possibilité de s'établir avantageusement au Canada, je crois utile d'ajouter à mes lettres quelques extraits d'une brochure écrite par un partisan de la colonisation.\n\nIl y a treize ans Sa Grandeur Mgr Taché, dont le nom et les œuvres sont impérissables, écrivait dans son Esquisse du Nord-Ouest :\n\n« La largeur de ce pays, de l'ouest à l'est, est, en chiffres ronds, de 1200 milles anglais, et sa longueur, du sud au nord, est de 1500 milles, donnant l'immense superficie de 1,800,000 milles carrés. Si l'on compare cette immensité de terrain à l'exiguïté de celui qu'occupent quelques-unes des plus puissantes nations du monde, on est frappé du contraste, et l'on se demande tout naturellement si ces vastes solitudes doivent toujours rester dans l'état où la Providence les a tenues jusqu'à ce jour. Isolé dans ces déserts sans bornes, on se prend souvent\nà écouter si le bruit et l'agitation du monde d'outre-mer, si l'agitation plus fébrile, si l'ambition plus hardie de la grande république voisine, si la création de la puissance du Canada ne produiront pas ici un écho puissant. Nos belles et grandes rivières, nos lacs immenses ne porteront-ils jamais que le léger canot d'écorce du sauvage ou la barge aux lourdes rames du commerçant de fourrures? Les ressources agricoles de ce pays, ses richesses minérales, les trésors que renferment ses forêts ou ses eaux sont-ils destinés à n'être jamais connus ni appréciés à leur juste valeur? »\n\nLorsque le vénérable apôtre de la Rivière-Rouge demandait ce qu'allait devenir un pays aussi vaste, aussi productif, l'avenir devait bientôt lui répondre. En effet, dès l'année suivante, le Canada décidait de s'annexer les territoires du Nord-Ouest dont nos hommes d'État avaient pu entrevoir les inépuisables ressources. Aujourd'hui, c'est-à-dire après dix années seulement, le grand Occident Canadien est connu partout; et le bruit de cette découverte d'un monde ignoré trop longtemps a eu de l'écho jusqu'au delà des mers. La mère-patrie, qui avait abandonné des possessions, dont elle ne connaissait pas la valeur, au contrôle égoïste d'une compagnie de négociants, sait aujourd'hui les apprécier. Et un de ses premiers hommes d'État, l'illustre Disraéli, a prononcé à ce sujet un discours qui eut du retentissement.\n\nNos voisins, qui ne semblaient pas même soupçonner l'étendue des richesses que nous possédions là-bas, se sont émus des révélations de la publicité. Ils ont compris qu'ils étaient menacés de la concurrence, sur les marchés étrangers, d'un rival qui deviendra puissant, et nous voyons déjà les principaux centres du commerce :\nNew-York, Chicago, Milwaukee, Saint-Paul, s'inquiéter à bon droit de la révolution économique qui se prépare.\n\nOn estime qu'il se trouve dans les « solitudes sans bornes » dont parlait avec enthousiasme lord Beaconsfield, à peu près 200,000,000 d'acres de terre arable. La culture d'une partie seulement de ce territoire nous permettrait donc de lutter avec les États-Unis pour le commerce des grains. Calculons, en effet, ce que rapporteraient, par exemple, 5,000,000 d'acres de blé, avec un rendement de 25 minots par acre, et cela nous donnera une idée de l'avenir de ce pays, au point de vue agricole.\n\nDurant le cours de l'été dernier, plusieurs délégués des différents points du Royaume-Uni ont visité le Canada, et tous furent émerveillés des ressources immenses de son « Far-West. »\n\nM. de Lalonde, chargé par la Société Centrale d'agriculture de la Seine-Inférieure d'étudier les conditions agricoles du Canada, disait dernièrement en présence d'une assemblée d'élite :\n\n« J'avoue que, comme agriculteur, le Far-West a été un spectacle merveilleux pour moi. Quelle prodigieuse fertilité et quelle immense étendue!\n\nJe ne vous parlerai ni de Winnipeg qui avait 900 habitants il y a 14 ans, et qui en possède maintenant 9,000, ni d'Emerson, la nouvelle ville frontière, qui vit en un an ses terres centupler de valeur; mais dans le désert que j'ai parcouru et que le chemin de fer sillonnera demain, que de richesses agricoles enfouies vont s'offrir aux colons, que de villes vont s'élever comme par enchantement sur ces rivières, aux bords de ces lacs encore sans noms! Est-ce que mon imagination va trop loin? Les Mennonites sont là pour me répondre et pour me dire ce que peuvent l'association et le travail. »\n« Venus de Russie, il y a quatre ans à peine, presque sans argent, ils ont maintenant de magnifiques récoltes, de gros villages reliés par des ponts et des routes. Ils sont riches, tous ! Leurs terres ont plus que déculpé de valeur. Et quand vous leur demandez comment ils se trouvent à Manitoba, ils vous répondent tous par cette phrase bien rare : Nous sommes contents de notre sort et du gouvernement. »\n\nLA PROVINCE DU MANITOBA.\n\nDéjà une partie de ces vastes territoires est organisée en Province sous le nom de Manitoba.\n\nCette Province étant presque à égale distance de l'Atlantique et du Pacifique, de l'Est à l'Ouest, de l'Océan Arctique et du golfe du Mexique, du Nord au Sud, elle occupe le milieu du continent.\n\nElle est sous la même latitude que la Belgique et qu'une partie de la Prusse et de l'Autriche.\n\nLe Manitoba et les territoires environnants, à l'Est des Montagnes Rocheuses, ressemblent sous beaucoup de rapports à l'Allemagne et à la Russie.\n\nLe Manitoba est sur la ligne du chemin de fer qui relie l'Océan Atlantique à l'Océan pacifique. Et cela non seulement parce que c'est le chemin le plus court, mais aussi parce que c'est le seul endroit où il soit possible de franchir les Montagnes Rocheuses. Les hauteurs que l'on a à franchir dans ces endroits sont de moitié moins élevées que celles qui s'élèvent entre Chicago et San Francisco, et qui ont été franchies par le Union and Central Pacific Railway.\n\nLe chemin de fer du Pacifique Canadien, au lieu de\npasser comme les lignes rivales des États Unis au milieu du grand désert américain, à l'avantage de traverser les contrées connues sous le nom de Zone Fertile, (Fertile Belt.)\n\nDe plus, le Manitoba est le centre de la navigation intérieure dans l'Amérique du Nord.\n\nWinnipeg, capitale de cette province, est bâtie sur une langue de terre au confluent de l'Assiniboine et de la Rivière-Rouge. La première est navigable sur une longueur de plus de six cents milles, (mille kilomètres). La Rivière-Rouge, qui prend sa source dans l'État du Minnesota, est déjà navigable sur un parcours de 440 milles, (734 kilomètres,) à partir de Moorehead avant d'atteindre la ville de Winnipeg; de là, elle poursuit son cours jusqu'au lac Winnipeg, lequel est d'environ 300 milles, (500 kilomètres,) de long. Elle reçoit aussi les eaux de la Saskatchewan, rivière navigable depuis quelques milles de son embouchure jusqu'au pied des Montagnes Rocheuses. Pour les besoins du moment, on a établi un ligne de tramways pour parcourir la courte distance qui sépare la partie navigable de cette grande rivière et le lac Winnipeg. Ce système de communication par voies d'eau est un des caractères physiques les plus remarquables de l'intérieur du continent de l'Amérique du Nord. La longueur totale des rivières est d'environ dix mille milles, (16,600 kilomètres,) dont trois ou quatre mille milles sont navigables pour les bateaux à vapeur.\n\nLors de sa visite au Manitoba, en 1877, l'ex-gouverneur-général, Lord Dufferin, dans un discours prononcé à Winnipeg, s'exprima ainsi sur les conditions de ce pays que nous venons de mentionner brièvement :\n« Si l'on considère sa position géographique et ce qui la distingue des autres pays, la province du Manitoba peut être regardée comme la clef de voûte de cette arche puissante composée des provinces du Canada et s'étendant de l'Atlantique au Pacifique. C'est ici que le Canada, surgissant de ses forêts, découvrit pour la première fois ces immenses prairies de ce Nord-Ouest inexploré et apprit, par une révélation inattendue, que ses territoires historiques du Canada, ses côtes maritimes du Nouveau-Brunswick, du Saint-Laurent; ses champs de blé et ses pâturages à eux seuls plus étendus qu'une demi-douzaine de Royaumes d'Europe n'étaient que les vestibules de ce vaste pays dont on n'avait pas eu d'idée jusqu'alors, et dont les dimensions incommensurables confondent les calculs des ingénieurs et de explorateurs.\n\nA dater de ce jour, ne considérant son passé que comme le prélude de ses futures destinées, il prit un nouvel essor, puisa ses inspirations à une source plus élevée et cessa de se considérer comme un endroit propre seulement à l'établissement des colons le long d'une rivière; mais il s'aperçut qu'il constituait à lui seul la moitié d'un continent, grâce à l'étendue de ses possessions, à la richesse de ses ressources et à la vigueur de ses forces matérielles, il se sentit l'égal de toute autre nation du globe. »\n\nEn parlant ainsi, Lord Dufferin n'exagéra rien. Au contraire, il s'est abstenu de donner libre cours aux pensées qui se pressaient en foule dans son esprit.\n\nCLIMAT.\n\nLe climat de Manitoba est décidément chaud en été et froid en hiver.\nBien des colons, partis d'autres points du Canada, préfèrent beaucoup le climat de cette province et le trouvent plus agréable. Il est sans aucun doute un des plus salubres du globe.\n\nLa pulmonie, la consommation et les autres maladies des poumons n'y sont pas natives. Les fièvres de toute sorte sont presque inconnues.\n\nL'épaisseur moyenne de la neige dans les prairies ne dépasse pas dix-huit pouces; les chevaux du pays sont souvent laissés en liberté tout l'hiver. Avec leurs pieds ils enlèvent la neige qui recouvre l'herbe et trouvent facilement leur nourriture. On cite même des cas où les bêtes à cornes ont été laissées en pâturage tout l'hiver.\n\nLa neige disparaît et le labour commence du premier à la fin d'avril, dix à quinze jours plus de bonne heure que dans la région de l'Ottawa. La débâcle sur la Rivière-Rouge se fait de dix à quinze jours plus tôt que sur la rivière Ottawa. Les longues et chaudes journées d'été amènent si rapidement toute la végétation à maturité que les moissons se font au mois d'août. Les jours sont chauds et les nuits fraîches. Les mois d'été sont : une partie du mois de mai, juin, juillet, août et une partie de septembre. L'automne commence vers le 20 de septembre et dure jusqu'au mois de novembre, époque où les froids réguliers commencent et l'hiver proprement dit se continue jusqu'à la fin de mars.\n\nEn un mot le climat est plutôt ce qu'on pourrait appeler continental et sec au lieu d'être humide comme dans les pays côtiers, et nous donne une idée de ce qu'en Europe on appelle le « ciel d'Italie, » avec, cependant assez de pluie au printemps et à l'été, pour les besoins de la végétation. Le Manitoba est exposé aux gelées du printemps,\nmais cet inconvénient lui est commun avec la plus grande partie de l'Amérique du Nord, comprenant toutes les autres provinces du Canada et le Nord des États-Unis. D'ailleurs de telles gelées se font sentir même dans les pays anciens de l'Europe. En France elles ont parfois causé de graves dommages aux vignes.\n\nDu reste ces gelées du printemps n'ont pas encore nu aux récoltes de froment dans le Manitoba.\n\nDES PRODUCTIONS.\n\nOn peut dire que le Manitoba est surtout propice à la culture du blé. Blodgett, l'écrivain américain bien connu, dit que « le bassin du Winnipeg produit proportionnellement plus de blé que tout autre partie du continent américain, et peut-être du monde entier. » Le climat et le sol dont il sera parlé spécialement ci-après, sont tous deux extraordinairement favorables à la culture de cette céréale importante. Ce blé pèse ordinairement de 62 à 66 livres par boisseau. La moyenne du rendement est de 25 boisseaux par acre, mais les rendements plus considérables sont très communs. On cite un grand nombre de cas où plus de 40 boisseaux ont été récoltés sur un seul acre. Le blé du Manitoba est plus pesant que celui des autres parties du continent ; il obtient aussi un meilleur prix sur le marché en raison de sa nature dure et cassante qui le rend plus propre aux nouveaux procédés de mouture.\n\nL'avoine, l'orge et en général toutes les céréales viennent en abondance et sont de la meilleure qualité. Certaines espèces de blé-d'Inde et de maïs parviennent à maturité, mais le pays n'est pas très favorable à cette\nsorte de grain. À la dernière Exposition Inter-Provinciale à Ottawa, on a pu cependant admirer de magnifiques échantillons de maïs récoltés au Manitoba.\n\nLes patates et autres plantes de ce genre viennent en grande abondance. La patate surtout y atteint des dimensions presque incroyables et elle ne se recommande pas moins par ses qualités que par sa grosseur.\n\nTous les légumes viennent bien; et les tomates et les melons mûrissent en plein air. Et ceci peut être noté comme un fait climatérique important, car tout en faisant voir la chaleur des étés de ce pays, il montre en même temps sa supériorité, au point de vue de l'horticulture, sur le climat de l'Angleterre où ces fruits ne parviennent pas à maturité sans le secours de serres.\n\nLe houblon croît à l'état sauvage en grande abondance.\n\nLe pays se trouve dans des conditions extrêmement favorables à la culture du lin, et cette plante, avec les manufactures qu'elle nécessite, deviendra prochainement une industrie importante pour le Nord-Ouest. Les Mennonites ont déjà commencé à la cultiver en grande quantité et ils en exportent la graine sur une grande échelle.\n\nOn y trouve en abondance toute sorte de petits fruits, tels que groseilles, fraises, framboises, etc. Jusqu'à présent la pomme y est très peu cultivée et l'épreuve n'est pas suffisante pour déterminer d'une manière définitive si le pays est favorable à la culture de ce fruit. On la cultive cependant avec avantage dans le Minnesota où mûrit aussi le raisin, et tout porte à croire que le climat du Manitoba est aussi propice que celui de cet État.\n\nLes arbres croissent le long des rivières et des cours d'eau. Ils pousseraient rapidement dans les prairies\nsans les incendies qui y passent périodiquement. Les principales espèces de bois sont : le chêne, le trèce, le tilleul, le peuplier, l'orme et l'épinette. Il y a assez de bois pour les besoins actuels de la province et à mesure que la population augmentera on pourra facilement faire venir du charbon de terre (qu'on a déjà commencé à extraire à la rivière Souris), soit par eau ou par chemin de fer, des districts situés à l'Ouest du territoire. On peut aussi se servir de la houille. À l'exemple des populations des steppes de la Russie et de la Lombardie, les Mennonites se servent de paille pressée comme combustible. Les arbres croissent très rapidement, et dans les endroits colonisés les jeunes sont protégés contre le feu des prairies.\n\nIl est très facile d'élever des animaux dans les prairies, et ils deviennent parfaitement gras à l'aide du pâturage seul. Ce climat sec est favorable à l'élevage des moutons, et jusqu'à présent on ne connaît aucune espèce de maladie parmi cette classe d'animaux. On dit de plus que la chair des animaux des prairies est préférable à celle des animaux élevés dans des étables, dans l'Est ou dans la mère-patrie.\n\nLes herbes cultivées telles que le trèfle, le mil, etc., viennent très bien, mais on les cultive très peu, vu la grande abondance du foin naturel.\n\nLe gibier de toute sorte est en abondance, surtout le gibier à plume. Les poules de prairies, les canards et les oies s'y voient en quantités innombrables.\n\nLes lacs et les rivières fournissent abondamment des poissons de plusieurs espèces. Le poisson blanc, surtout, est un produit de grande valeur au Nord-Ouest. Le cat fish devient très gros est très estimé comme aliment.\nLE SOL.\n\nLa richesse de cette terre noire et profonde du Manitoba est ce qui attire principalement l'attention des agriculteurs. Elle semble être formée d'un terrain argileux ou d'alluvion reposant sur un fond d'argile compacte que certains écrivains appellent lacustre.\n\nLa profondeur de cette couche de terre noire varie entre un et quatre pieds. Dans des excavations pratiquées sur le bord de certaines rivières on a même trouvé qu'elle atteignait douze à quatorze pieds. Des analyses chimiques de ce terrain ont été faites en Allemagne et en Écosse et ces procédés scientifiques ont établi (ce qui a été universellement reconnu,) que le sol du Manitoba est un des plus riches du monde et le plus propice à la culture du blé. Les analyses qui ont eu lieu à Berlin et à Edimbourg ont démontré que la terre était principalement riche en nitrogène et en chaux. On ne se sert d'aucun engrais, et pendant plusieurs années consécutives on a récolté du blé sur le même terrain sans qu'il se donnât aucun signe d'épuisement. Il est réservé à l'avenir de décider si plus tard il faudra fumer les terres; mais cette précaution est certainement inutile, pour les premières années de l'ensemencement des prairies.\n\nCette grande richesse incontestable du sol des prairies s'explique par le fait que les déchets des oiseaux et des animaux, les cendres provenant des incendies et la décomposition des végétaux se sont accumulés sur ces terrains depuis les âges les plus reculés et ont été recueillis par un sol à base argileuse. C'est cette grande richesse accumulée dans le sein de la terre qui doit surtout attirer les cultivateurs qui, en Europe, sont\nobligés de recourir à des procédés ruineux pour faire produire quelque chose à des terrains épuisés.\n\nDES AVANTAGES OFFERTS AUX ÉMIGRANTS.\n\nUn habitant d'Europe qui part pour l'Ouest du Canada laisse un pays vieux et encombré pour un pays entièrement nouveau, sortant à peine de l'état sauvage et très peu peuplé.\n\nL'émigrant doit, en conséquence, être décidé à mener la vie dure et pénible d'un pionnier. Si toutefois cette vie est périlleuse, elle est loin d'être malsaine. Sa condition est aussi adoucie par le fait qu'il travaille à son propre établissement, qu'il est le seul propriétaire de son domaine qui contient peut-être le sol le plus riche et le plus généreux du monde. Ceux qui ne sont pas prêts à se soumettre à tout ce qu'il y a d'accidenté et de pénible dans la vie d'un pionnier feront mieux de ne pas aller s'établir sur les terres incultes du Far West ; mais ceux qui ont assez de patience et qui sont bien décidés à se soumettre à toutes les exigences d'un pays nouveau, et possèdent des moyens suffisants pour leur permettre de vivre pendant un an, peuvent compter sur un succès plus complet et plus sûr que dans toute autre carrière. Un colon qui se trouve dans ces conditions et qui est complètement établi peut être certain que jusqu'à la fin de ses jours il vivra dans l'abondance et l'indépendance.\n\nManitoba et le Far West, contrairement aux anciens pays que les émigrants du vieux monde laisseraient derrière eux, sont en général des pays sans arbres. On y rencontre, cependant, des forêts de peu d'étendue et de très beaux bois le long des rivières. Les arbres que l'on\nplante et que l'on protège contre les feux des prairies croissent avec une grande rapidité. On dit même qu'un colon possédant cent acres de terre peut avoir de très beaux arbres en moins de temps qu'il ne lui en faudrait pour défricher la même étendue. C'est un fait constant que, dans l'Illinois et autres États de l'Ouest, des colons établis depuis quelques années, sur des prairies de ce genre, ont maintenant une réserve de bois assez considérable sur leur propriété.\n\nAvec de légers changements provenant des circonstances, la culture que le colon aura à faire est la même, en ce sens qu'il récoltera les mêmes grains et les mêmes plantes et élèvera les mêmes animaux, sans être obligé d'avoir recours à ces méthodes compliquées et à ces engrais dispendieux auxquels on a recours pour obtenir un rendement satisfaisant de terrains épuisés des vieux pays.\n\nLe colon retrouvera aussi au Manitoba sa langue, sa religion et tous les moyens de faire instruire ses enfants, depuis l'école commune jusqu'au collège.\n\nOn peut s'établir dans le Manitoba avec un très petit capital. Il faut néanmoins posséder assez pour construire une maison en billots bruts, suivant la coutume du pays, pour acheter une paire de bœufs et une charrue, les graines pour les semences et des provisions pour un an ou jusqu'à la prochaine récolte. Avec de la patience et de l'énergie dans les commencements, un colon en débutant ainsi peut en peu de temps acquérir une position aisée et indépendante.\n\nD'un autre côté, un colon peut venir dans le Manitoba avec de grands capitaux pour les placer dans de grandes opérations agricoles, soit la récolte du grain ou l'élevage\ndes bestiaux, qui ne peuvent manquer d'être très profitables.\n\nAvec une somme de 2,000 à 3,000 frs, un cultivateur peut se procurer une habitation confortable bien que sur une petite échelle.\n\nAvec quelques modifications provenant des circonstances, cette somme serait divisée comme suit :\n\n| Article                        | Coût en francs |\n|--------------------------------|---------------|\n| Une paire de bœufs             | 600           |\n| Un chariot                     | 400           |\n| Une charrue et une herse       | 125           |\n| Des traits, haches, pelles, etc.| 150           |\n| Poêle, lits, etc., etc.        | 300           |\n| Maison et étable              | 750           |\n| Provisions                    | 575           |\n\n3000 francs.\n\nSans doute qu'un capital de 5000 francs permettrait au colon de s'organiser sur une plus grande échelle et de se donner plus de confort; mais aussi, beaucoup ont commencé avec moins et sont aujourd'hui fort à leur aise.\n\nPar exemple le chariot de la Rivière-Rouge ne coûte que 50 frs, et un seul bœuf sur une petite ferme peut faire tout l'ouvrage après que le premier labour a été fait sur la prairie.\n\nLes plus pauvres familles parmi les Mennonites allemands, qui sont venus du sud de la Russie s'établir au Manitoba, ont commencé avec beaucoup moins de 3000 francs; ils sont aujourd'hui dans une condition très prospère et récoltent d'abondantes moissons de grains, sans compter le lin qu'ils cultivent en abondance et dont\nils exportent la graine. Ils sont aussi bien pourvus d'animaux dont ils font un commerce très lucratif sur les marchés de Winnipeg. La seule question est de savoir si des familles sauraient se priver comme l'ont fait ces économistes pionniers, et si elles consentiraient à endurer ce que les Mennonites ont enduré avant d'obtenir le succès qu'ils ont aujourd'hui.\n\nL'équipement d'une famille pauvre de Mennonites composée de cinq personnes consistait en une paire de bœufs, une vache, une charrue, un chariot et un poêle pour cuire les aliments ; le tout coûtait 1350 francs ; les provisions de bouche pour une famille pendant un an coûtaient 465 francs ; ces provisions consistaient exclusivement en farine, en lard et en haricots. Ils ne dépenseront pas un sou pour les maisons dans lesquelles ils vécurent d'abord, ces maisons étaient faites de branchages placés obliquement sur des poteaux et recouverts de terre. Ce fait est rapporté ici seulement pour montrer avec quels petits commencements une famille peut parvenir à l'aisance ; car les maisons construites en billots bruts coûtent si peu de chose qu'il est probable qu'aucun colon ne voudra se loger comme les Mennonites. Tout homme est prêt à combattre avec énergie pour son indépendance, mais dans cette circonstance, ses travaux, ses peines sont adoucis par la conscience qu'il a que chaque pas qu'il fait est un acheminement vers ce but. Disons aussi que pendant plusieurs années à venir il y aura des chemins de fer en construction, où les plus pauvres colons pourront travailler une partie du temps, et recevoir des gages élevés, ce qui leur permettra de surmonter les premières difficultés qui accompagnent l'établissement des colons.\nIl y a un autre conseil d'une très grande importance que nous devons donner aux émigrants, c'est d'être bien attentifs à adopter les méthodes dont la sagesse et les avantages ont été démontrés par l'expérience, et non pas de perdre leur temps à vouloir implanter dans un jeune pays les coutumes et les usages de leur patrie. Par exemple, pour ce qui regarde le labour des prairies, la méthode suivie dans le Manitoba est bien différente de celle des autres pays. Les prairies sont couvertes d'un gazon très dur qu'il faut détruire pour rendre le terrain propre à la culture. L'expérience a prouvé que la meilleure manière est de ne labourer qu'à une profondeur de deux pouces et de retourner un sillon de 12 à 14 pouces de large.\n\nTout labour fait avant la mi-juin doit être semé en avoine, en lin ou en pommes de terre. Le colon pourra ainsi s'assurer d'une récolte et préparer en même temps sa terre pour les récoltes suivantes. En conséquence, l'immigrant doit, autant que possible, arriver au printemps pour opérer ce labour en temps opportun. Après la mi-juin l'immigrant devra renoncer à la récolte de l'année, mais pourra employer le reste de la saison à faire ses constructions, préparer ses instruments et ses plans d'opération pour la campagne suivante. De fait, les mois de juillet et septembre sont très propres pour arriver au pays, faire le choix des terres et adopter les démarches nécessaires à une installation.\n\nCet automne; on a récolté 40 ou 50 minots d'avoine sur une terre labourée au printemps de la même année. Un colon pourra parfaitement récolter quelque chose sur une terre labourée en mai ou pendant un autre mois. Lorsque le gazon est bien détruit, la terre devient molle\net friable. Les gelées d'hiver semblent avoir pour effet de pulvériser la terre et de suppléer grandement aux travaux de l'homme.\n\nIl est arrivé quelquefois que des colons des vieux pays, habitués au labour profond, ont essayé ce système au Manitoba, au mépris des conseils de leurs devanciers. Ces hommes ont appris à devenir plus sages, par les désappointements cruels qu'ils ont éprouvés. Cela leur a servi de leçon, mais elle coûte si cher qu'il vaut mieux s'en dispenser.\n\nAvant que les prairies n'aient été labourées, le gazon est très dur et très difficile à briser, mais les années suivantes le labour devient très facile, vu la friabilité du sol et on emploie alors avec avantage les charrues à plusieurs socs.\n\nEn conséquence des difficultés que présente le premier labour, il est plus avantageux au colon de se servir de bœufs que de chevaux, surtout si l'on considère que les chevaux soumis à un ouvrage fatiguant sont exposés à devenir malades, s'ils ne sont pas habitués à la nourriture et au climat du pays. Un correspondant, engagé depuis longtemps dans de grandes opérations agricoles, donne ainsi le résultat de ses expériences : « J'ai examiné la somme d'ouvrage faite par les charrues de différentes grandeurs, et voici le résultat que j'ai obtenu après des examens nombreux et attentifs. Premièrement, la charrue de douze pouces trace un sillon de $11 \\frac{1}{2}$ pouces environ, dix sillons mesurant de 9 pieds 6 pouces à 9 pieds 8 pouces. La charrue de 14 pouces creuse un sillon de 13 pouces en moyenne, et la charrue de 16 pouces, un sillon d'environ 15 pouces. Comme nos sillons ont exactement deux milles de\nlongueur, d'après mes calculs, trois charrues de 12 pouces, laboureront 5 acres 147 perches, ou chaque charrue, 2 acres moins 4 1/2 perches par jour. Six chevaux ou deux charrues de 14 pouces, laboureront 4 acres et 52 perches par jour. Deux charrues de 16 pouces, avec trois chevaux chacune, feraient 5 acres par jour, laissant en faveur de la charrue de douze pouces, une différence de 5/8 d'acre. Les trois charrues de 12 pouces exigent un homme de plus, mais son salaire est plus que compensé par les 5/8 d'acre labouré. » On doit remarquer cependant que des chevaux nouvellement importés dans le Manitoba ne sont pas en état de résister pendant deux mois à un travail aussi fatiguant que celui dont parle le correspondant dans la lettre que nous venons de citer. C'est pour cette raison qu'il est plus avantageux de se servir de bœufs qui ne sont pas exposés aux mêmes inconvénients. Le même correspondant ajoute qu'une paire de bœufs peut labourer un acre et demi par jour, et cela tous les jours, tout en ne nécessitant que très peu de dépense pour leur nourriture. Les gages d'un homme pour les conduire sont d'environ trente piastres, ou 450 francs par mois sans pension.\n\nRENSEIGNEMENTS GÉNÉRAUX\n\nPOLITIQUE\n\nL'émigrant, avant de partir, ne se préoccupe pas seulement des avantages matériels que pourrait lui offrir le pays où il ira se fixer. Il aime à se renseigner aussi sur les institutions politiques et religieuses de la société au milieu de laquelle il devra vivre.\nC'est pour satisfaire à ce désir légitime que nous allons donner, au point de vue dont il s'agit, des renseignements précis sur la situation au Manitoba. Les institutions dont cette province est dotée serviront plus ou moins de modèles pour l'organisation des autres provinces du Grand Occident Canadien.\n\nLes institutions politiques du Manitoba sont à peu près les mêmes que celles des autres provinces ; on y jouit du gouvernement responsable dans toute sa plénitude. Il y a vingt-quatre circonscriptions électorales qui élisent autant de membres à l'Assemblée Législative, et l'exécutif se compose d'un lieutenant-gouverneur, d'un secrétaire, d'un trésorier, d'un procureur-général, d'un commissaire des travaux publics et d'un ministre de l'agriculture, qui remplit d'ordinaire les fonctions de président du Conseil.\n\nLa constitution consacre l'usage de la langue française dans la législature et devant les tribunaux, qui sont présidés par trois magistrats dont l'un, l'honorable M. Joseph Dubuc, est un canadien-français.\n\nEnfin, le Manitoba envoie quatre députés au parlement fédéral, outre deux sénateurs.\n\nRELIGION.\n\nLes missionnaires de l'Evangile avaient déjà parcouru depuis longtemps les plaines et les forêts de l'ouest, lorsque le pays fut annexé au Canada, en 1870. Il n'est donc pas étonnant que l'organisation paroissiale soit à peu près complète au Manitoba, et que l'œuvre des missions soit également bien conduite. Sa Grandeur Mgr. Taché ne néglige rien dans l'intérêt spirituel de ceux que la Providence a confiés à sa garde vigilante,\net il a su grouper autour de lui de fervents disciples qui s'inspirent du dévouement tout apostolique de leur vénérable pasteur. Les familles de toutes dénominations pourront pratiquer leur religion en toute liberté et instruire leurs enfants dans les saines notions du christianisme. Le gouvernement canadien accorde protection égale à tous les croyants, sans distinction de secte, et ni les impies, ni les fanatiques n'ont de place sous son drapeau.\n\nÉDUCATION.\n\nLe système scolaire est calqué sur celui de la province de Québec, c'est-à-dire que les catholiques ont le contrôle absolu, la direction complète de leur enseignement, et que les protestants possèdent les mêmes droits, les mêmes privilèges. Il y a un conseil général qui s'occupe des intérêts généraux de l'éducation, sans avoir le droit, cependant, de rien changer dans les principes bien définis de la loi, ni de modifier les règlements des deux conseils particuliers — catholique et protestant — dont il se compose. En un mot, les chrétiens sont protégés dans ce qu'ils ont de plus cher — l'éducation de leurs enfants d'après la morale et les préceptes de l'Eglise. Toutes les écoles sont subventionnées par le gouvernement, et l'on se hâte d'en établir partout où se trouve un groupe assez nombreux pour les maintenir; car les parents ont à payer, dans ce but, une légère taxe annuelle. Deux surintendants sont chargés de veiller au fonctionnement du système, qui est, du reste, fort bien organisé.\n\nÀ Saint-Boniface il existe, comme nous l'avons déjà dit, un excellent collège classique, fondé il y a plusieurs années déjà et affilié à l'Université de Manitoba, ainsi\nqu'un pensionnat pour les jeunes filles. Il y a aussi des couvents à Winnipeg et à Saint-Norbert.\n\nAu point de vue de l'éducation, les chrétiens de Manitoba sont donc plus favorisés que ceux des États-Unis, où l'État ne reconnaît et ne subventionne que les écoles communes.\n\n**Système postal.**\n\nLe système postal vient d'être réorganisé dans tout le Nord-Ouest, où l'on compte maintenant près de 130 bureaux de poste.\n\n**Service militaire.**\n\nLe service militaire est si peu important qu'il n'ajoute aucun fardeau à la population. Un système volontaire pourvoit seul à la sécurité du pays.\n\n**Élevage des animaux.**\n\nTous ceux qui ont pu admirer les immenses prairies qui se déroulent à perte de vue dans les territoires de l'Ouest s'accordent à dire que c'est le pays où l'élevage des animaux peut se faire avec le plus de succès et le moins de frais. De bonne heure, au printemps, les troupeaux quittent l'étable pour se répandre dans la plaine où croissent, en grande variété, les hautes et grasses herbes. (Il en a été exposé, à Ottawa, près de 20 échantillons.) Et durant la belle saison, c'est-à-dire du 15 juillet au 15 septembre, le cultivateur coupe le foin dont il a besoin pour l'hiver, sans avoir rien à débourser.\n\nÀ l'automne, les animaux sont dans la meilleure condition possible, et la saine température de la froide saison favorise aussi leur développement.\nJusqu'ici l'on a trop négligé ce genre d'industrie, qui assure un bénéfice considérable. Des milliers d'animaux — chevaux, bestiaux, (1) moutons, cochons — sont expédiés chaque année des États voisins de la république, et il faut que le commerce soit bien lucratif pour qu'il y ait profit à envoyer de nombreux troupeaux, du Montana par exemple. Un Canadien Français, M. J. Demers, qui habite ce territoire américain, en a amené plus de 1,500 au Manitoba, et il y trouvait son compte.\n\nÀ ce propos, les directeurs de la Société d'agriculture provinciale disaient dans l'un de leurs rapports :\n\n« Il serait fort à désirer que l'on s'occupât davantage de l'élève des bêtes à cornes, cochons, moutons, vu que les besoins des nouveaux colons, les parties d'explorateurs, d'arpenteurs et autres, au service du gouvernement, la police du Nord-Ouest, devront rendre le marché local très profitable durant plusieurs années. »\n\n« Les prairies, dit Mgr Taché, ont de quoi nourrir un nombre infini de bestiaux, non seulement à cause de leur étendue, mais aussi par la nature même et la richesse de leurs produits, qui valent les meilleurs prés de trèfle.\n\n» Les animaux de boucherie s'engraissent dans les prairies naturelles sans aucun secours; et quand l'animal est dans les conditions de santé, il atteint assez rapidement un état qui le rend digne des meilleurs marchés. »\n\nLe vicomte Milton et le Dr W. Chealde, qui ont traversé les Montagnes Rocheuses, disent aussi dans leur ouvrage, publié en 1866 :\n\n« Nous avons lâché nos chevaux, au début de l'hiver, à la Belle Prairie (2). Bien qu'ils eussent été fort maigres\n\n(1) Le bœuf domestique a été importé en 1823, et le mouton — qui n'a jamais été attaqué par aucune maladie — en 1833.\n(2) Belle Prairie est située près de la rivière aux Coquilles, à l'ouest.\nquand la neige avait commencé à tomber, ils étaient devenus de vraies boules de graisse. La pâture est si nourrissante, que même en hiver, où ils ont à chercher leur nourriture sous la neige, les animaux engraisent rapidement, pourvu qu'ils trouvent des bois où s'abriter contre les rigueurs de la température.\n\n« Les vaches laitières et les bœufs de trait, près de la Rivière-Rouge, sont dans une condition presque aussi belle que celle du bétail nourri dans les étables et amené à l'exposition de Baker Street. »\n\nLe gouvernement affirme des terres à foin de 40 acres, ainsi que des pâturages, pour faciliter, sans doute, l'élève des animaux — exploitation qui deviendra bientôt une des plus importantes.\n\n*Qui a foin, a pain* dit le proverbe. Ce n'est pas seulement du pain, mais aussi de la viande, du lait, de la laine et du travail.\n\nLe rendement du foin est de 3, 4 et 5 tonnes l'acre.\n\n**bois**\n\nIl est indéniable que le bois est relativement rare au Nord-Ouest. Mais cet inconvénient — compensé par mille autres avantages — tout malheureux qu'il puisse être, ne saurait devenir un obstacle à la colonisation. Jusqu'ici l'on n'en a que peu souffert, et le chemin du Pacifique — avec ses embranchements — devra rapprocher bientôt le Manitoba de la grande légion boisée qui se développe à l'est. On sait, en effet, que les vallées de la rivière la Pluie, de la rivière Winnipeg, et le territoire compris entre le lac des Bois et la Rivière-Rouge, en renferment d'immenses quantités de différentes espèces.\nD'autre part, les rivières Rouge, Assiniboine, la Seine, au Rat et autres sont également bordées de deux lisières de bois, et ça et là dans la prairie se dressent aussi de jolis bosquets.\n\nÀ l'ouest, de grands cours d'eau traversent la forêt dont Mgr Taché estime la superficie totale à environ 480,000 milles carrés, de même qu'il évalue à 60,000 milles carrés l'étendue des prairies, et au même chiffre, ou à peu près le prolongement du vaste désert américain au-delà de notre frontière, c'est-à-dire du 49ème parallèle.\n\nLes principales essences de bois que l'on trouve au Manitoba, à Keewatin et à l'ouest, sont l'érable, la plaine, le pin rouge et blanc, le cèdre, le chêne, l'orme, le frêne, l'épinette, le bouleau, le tremble, le liard, le tilleul, le sapin, le cyprès, etc.\n\nLe bois de construction est importé, en grande partie, des États voisins ; on l'expédie en radeaux, par la rivière de la Rivière Rouge, et il est scié dans la province. Il y a de grandes scieries à Winnipeg et ailleurs.\n\nIl paraît que le gouvernement américain a ordonné l'exploration de treize townships, couverts de pins, sur les tributaires du lac à la Pluie. On en profitera donc.\n\nUne certaine quantité de bois de chauffage vient de la même source, outre ce que fournit le pays.\n\nCHARBON\n\nIl est constaté depuis longtemps que le Nord-Ouest recèle de riches mines de houille, dont l'analyse a établi la valeur et la supériorité. Nous n'avons pas besoin de disséquer sur le rôle que joue aujourd'hui le charbon dans le domaine de l'industrie.\n« Les terrains houillers que traversent les différentes branches de la Saskatchewan sont une grande source de richesse, dit Mgr Taché, et favoriseront la colonisation de cette vallée, où la nature a multiplié des sites d'une beauté qui défie ce qu'il y a de plus remarquable au monde en ce genre. » Plus loin il ajoute : « Les mines de charbon que renferme le district de la Saskatchewan lui assurent une importance incontestable. L'immense dépôt houiller se montre à découvert aux falaises du grand fleuve. »\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_30697.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 144, "total-input-tokens": 244100, "total-output-tokens": 58675, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 880, 3], [880, 3321, 4], [3321, 3461, 5], [3461, 3647, 6], [3647, 3647, 7], [3647, 4437, 8], [4437, 5215, 9], [5215, 6175, 10], [6175, 7851, 11], [7851, 9589, 12], [9589, 11321, 13], [11321, 12778, 14], [12778, 12778, 15], [12778, 13625, 16], [13625, 15304, 17], [15304, 16924, 18], [16924, 18601, 19], [18601, 20276, 20], [20276, 21934, 21], [21934, 23479, 22], [23479, 23479, 23], [23479, 24425, 24], [24425, 26175, 25], [26175, 27700, 26], [27700, 29339, 27], [29339, 31036, 28], [31036, 32895, 29], [32895, 34563, 30], [34563, 36187, 31], [36187, 37863, 32], [37863, 39352, 33], [39352, 40552, 34], [40552, 42219, 35], [42219, 43864, 36], [43864, 45581, 37], [45581, 47288, 38], [47288, 48889, 39], [48889, 50576, 40], [50576, 52286, 41], [52286, 52937, 42], [52937, 52937, 43], [52937, 53907, 44], [53907, 55557, 45], [55557, 57226, 46], [57226, 58870, 47], [58870, 60621, 48], [60621, 62132, 49], [62132, 63797, 50], [63797, 64576, 51], [64576, 65662, 52], [65662, 67320, 53], [67320, 68941, 54], [68941, 70482, 55], [70482, 72048, 56], [72048, 73615, 57], [73615, 75273, 58], [75273, 77002, 59], [77002, 78435, 60], [78435, 78435, 61], [78435, 79431, 62], [79431, 81176, 63], [81176, 82908, 64], [82908, 84590, 65], [84590, 86222, 66], [86222, 87515, 67], [87515, 88519, 68], [88519, 90180, 69], [90180, 91936, 70], [91936, 93313, 71], [93313, 94311, 72], [94311, 95952, 73], [95952, 97409, 74], [97409, 99017, 75], [99017, 100678, 76], [100678, 102322, 77], [102322, 103825, 78], [103825, 105422, 79], [105422, 106421, 80], [106421, 106421, 81], [106421, 107464, 82], [107464, 109087, 83], [109087, 110660, 84], [110660, 112325, 85], [112325, 113895, 86], [113895, 115525, 87], [115525, 116992, 88], [116992, 118577, 89], [118577, 118751, 90], [118751, 118751, 91], [118751, 119642, 92], [119642, 121271, 93], [121271, 122939, 94], [122939, 122939, 95], [122939, 122939, 96], [122939, 122939, 97], [122939, 124552, 98], [124552, 126215, 99], [126215, 126878, 100], [126878, 127840, 101], [127840, 129484, 102], [129484, 131055, 103], [131055, 132714, 104], [132714, 134352, 105], [134352, 135941, 106], [135941, 137598, 107], [137598, 139138, 108], [139138, 140762, 109], [140762, 142359, 110], [142359, 143952, 111], [143952, 144543, 112], [144543, 145534, 113], [145534, 147142, 114], [147142, 148813, 115], [148813, 150506, 116], [150506, 151028, 117], [151028, 151028, 118], [151028, 152025, 119], [152025, 153762, 120], [153762, 155483, 121], [155483, 156967, 122], [156967, 158593, 123], [158593, 160167, 124], [160167, 161861, 125], [161861, 163404, 126], [163404, 165091, 127], [165091, 166772, 128], [166772, 168415, 129], [168415, 170015, 130], [170015, 171663, 131], [171663, 173155, 132], [173155, 174857, 133], [174857, 176558, 134], [176558, 178194, 135], [178194, 179676, 136], [179676, 181234, 137], [181234, 182872, 138], [182872, 184248, 139], [184248, 186053, 140], [186053, 187565, 141], [187565, 189094, 142], [189094, 189604, 143], [189604, 189604, 144]], "primary_language": ["None", "en", "en", "en", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "None", "None", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]