[{"id": "a7cfb3590af1bbfd626a22a6f54767154ef34dac", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/Couverture de couleur\n- [ ] Covers damaged/Couverture endommagée\n- [ ] Covers restored and/or laminated/Couverture restaurée et/ou pelliculée\n- [ ] Cover title missing/Le titre de couverture manque\n- [ ] Coloured maps/Cartes géographiques en couleur\n- [ ] Coloured ink (i.e. other than blue or black)/Encre de couleur (i.e. autre que bleue ou noire)\n- [ ] Coloured plates and/or illustrations/Planches et/ou illustrations en couleur\n- [ ] Bound with other material/Rélié avec d'autres documents\n- [ ] Tight binding may cause shadows or distortion along interior margin/La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n- [ ] Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X |     | 24X | 28X | 32X |\n\nL'Institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de filmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/Pages de couleur\n- [ ] Pages damaged/Pages endommagées\n- [ ] Pages restored and/or laminated/Pages restaurées et/ou pelliculées\n- [ ] Pages discoloured, stained or foxed/Pages décolorées, tachetées ou piquées\n- [ ] Pages detached/Pages détachées\n- [ ] Showthrough/Transparence\n- [ ] Quality of print varies/Qualité inégale de l'impression\n- [ ] Includes supplementary material/Comprend du matériel supplémentaire\n- [ ] Only edition available/Seule édition disponible\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/Les pages totalement ou partiellement obscurcies par un feuillet d'errata, une pelure, etc., ont été filmées à nouveau de façon à obtenir la meilleure image possible.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"A SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nHISTOIRE\n\nDE\n\nMONTFERRAND\n\nL'ATHLETE CANADIEN\n\nPAR\n\nBENJAMIN SULTE\n\nDEUXIÈME ÉDITION.\n\nPrix de la Brochure, 15 Cts.\n\nMONTRÉAL\n\nIMPRIMÉ ET PUBLIÉ PAR CAMYRÉ & CIE,\n\n897 RUE CRAIG.\n\n1884\nFumez le meilleur Cigare\n\n5 Cents L.A.C. 5 Cents\n\nDemandez le fameux Cigare\n\n10 Cts. LE NAPOLEON 10 Cts.\n\nManufacturés par\n\nCARDINAL & PRENEVEAU\n\n1632, Rue Notre-Dame - - - Montréal.\n\nJOSEPH GIROUX,\n\n820, Rue Ste-CATHERINE\n\nMARCHAND DE\n\nPEINTURE, FERRONNERIE ET VAISSELLE\n\nAUSSI:\n\nCONTRACTEUR DE TOUTE SORTE DE PEINTURES.\n\nM. GIROUX n'ayant à son service que des peintres bien choisis, se charge d'ouvrages tels que Décorations, Imitations, Enseignes, Vitrage et Blanchissage à des prix très réduits et tout ordre exécuté promptement.\nHISTOIRE\n\nDE\n\nMONTFERRAND\n\nL'ATHLETE CANADIEN\n\nPAR\n\nBENJAMIN SULTE\n\nDEUXIÈME ÉDITION.\n\nMONTRÉAL\n\nIMPRIMÉ ET PUBLIÉ PAR J.-B. CAMYRÉ ET CIE.\n\n1884\nMAGNIFIQUE PORTRAIT\n\nDE\n\nJOS. MONTFERRAND\n\n(Chromo-Lithographie de 21 x 27)\n\nPublié par Camiré et Braseau.\n\nA VENDRE PAR TOUTE LA VILLE.\n\nPrix, $1.00. 6 Copies, $5.00.\n\nExpédié franc de port dans toute la Puissance et aux États-Unis.\n\nENREGISTRÉ conformément à l'Acte du Parlement du Canada, en l'année 1884, par J. B. Camyré.\nMONTFERRAND\n\nAprès la signature de la capitulation de Montréal, le 8 septembre 1760, les troupes françaises furent embarquées pour retourner dans leur patrie, mais les soldats qui optèrent en faveur de la colonie eurent la permission d'y demeurer.¹ L'un de ces derniers, Joseph Montferrand, se fixa à Montréal et ouvrit une salle d'escrime qui fut bientôt très fréquentée. La taille imposante, la force herculéenne, l'adresse de ce maître d'armes le mirent en réputation. La légende rapporte que, célébrant le premier jour de l'année, en nombreuse compagnie, à l'hôtel des Trois-Rois, il s'éleva une querelle entre lui et plusieurs convives. Les épées sortirent du fourreau. On était encore si près de la guerre de Sept Ans que la rapière et le fleuret étaient bien portés. Les militaires anglais voulurent contraindre Montferrand à se tenir tranquille. Ils les chargea avec fureur et fit maison nette.\n\nSon fils se nommait aussi Joseph et paraît être né en 1754. En 1783, il s'engagea à la compagnie du Nord-Ouest pour ces rudes voyages dont les historiens ont si souvent parlé. Très fort et très brave, il se fit remarquer dans maints combats — et l'on sait si la lutte était chaude.\n\n¹ Jean Sulte, mon bisaïeul, était de ce nombre,\nentre les compagnies qui se disputaient la traite des fourrures de l'ouest ! Conducteur des flottilles chargées de marchandises pour les pays d'en haut ; ensuite guide ou traiteur de pelleteries, il sut amasser une petite fortune qui lui permit de finir ses jours dans l'aisance. Il avait la renommée de ne reculer devant aucune provocation et de n'avoir jamais été vaincu. Les Français et les Canadiens de Montréal se montraient fiers de lui comme de son père. Dans ces temps agités, la valeur musculaire jointe à la bravoure étaient généralement prisées. Montferrand mourut à Montréal au commencement de notre siècle. Sa femme se nommait Marie-Louise Couvrette.\n\nElle descendait d'une famille des plus vigoureuses et très connue, les Ethier, de l'Assomption. Un fier-à-bras qui venait un jour de maltraiter un enfant, tomba aux mains de Marie-Louise et reçut une dégelée dont il porta longtemps les marques, notamment à la tête et au cou. Il avait bel et bien perdu connaissance sous les claques de cette femme robuste et pas commode du tout !\n\nDe ce couple de géants naquit, à Montréal, le 26 octobre 1802,¹ un fils qui reçut au baptême le nom de Joseph. C'est notre héros. Son parrain s'appelait Fabre ; de là le nom de Montferrand dit Fabre qu'on lui donne dans certains actes officiels.\n\n¹ Rue des Allemands, dans une maison qui a été brûlée au grand feu de 1852, et remplacée par celle qui porte actuellement le n° 167.\nUne grande douceur de caractère le fit d’abord remarquer parmi les autres enfants. Eloigné des dissipations de son âge, il manifestait de la piété, une profonde modestie, et personne n’eut deviné en lui l’homme de combat qui devait répandre son nom sur tous les points de l’Amérique du nord.\n\nLe révérend M. Sauvage, du séminaire Saint-Sulpice, qui lui fit faire sa première communion, le citait comme exemple à ses condisciples. Sa sœur Hélène lui enseigna le cathéchisme ; elle sut lui inspirer une foi vive, une grande confiance en Dieu et une profonde vénération pour la sainte Vierge.\n\nDès l’enfance il connut la force dont il était doué, et, comme il avait en tout un grand sens de la justice et de l’équité, on ne le vit jamais maltraiter ses camarades. D’instinct, il protégeait les petits écoliers contre les grands et se faisait leur tuteur. Il pouvait prendre pour devise, comme les Salaberry : “Force à superbe ; merci à faible.”\n\nUn jour qu’il transportait à lui seul une pièce de bois énorme, sa mère lui dit :\n— Tu es fort, mais n’en sois point glorieux, ton père était plus fort que toi.\n\nÀ seize ans, une circonstance fortuite le rendit tout à coup célèbre dans le quartier. Il travaillait à une excavation, devant la maison de son père. Un nommé Michel Duranleau, fameux bully traversant la rue en\ncompagnie de deux autres fiers-à-bras, très connus dans les élections, mit le pied sur la tête de l'enfant qui se trouvait au niveau du sol. Cette insolence ne piut pas à Montferrand qui, poussé comme par un ressort, sortit de terre et alla tomber au milieu des trois hommes. Durandeau, qui n'avait pas encore \"rencontré son maître,\" fut rossé, avec ses compagnons. Tous trois étaient de la campagne. Les gens du quartier Saint-Laurent considérèrent cette victoire comme un item à leur crédit.\n\n***\n\nCe qui étonnait le plus dans cet adolescent, c'était la vivacité et la souplesse de ses allures. Il ne portait pas sur le sol. On l'a vu plus d'une fois s'enlever et marquer du talon de sa botte, le plafond des salles (basses comme celles de toutes les demeures de cette époque) où il s'amusait avec ses camarades. Bondir à pieds joints par dessus une table ou une barrière était pour lui un jeu quotidien.\n\nSon caractère était très doux. Ayant conscience de sa force surhumaine et du milieu dans lequel il vivait, il était toujours sur ses gardes et réglait son humeur d'après la justice et le droit. Loyal et honnête, il s'était acquis la réputation d'un gentleman. La famille Montferrand, très rangée, économe et bien notée dans le faubourg Saint-Laurent, élevait ses fils avec tout le soin désirable. Notre héros se ressentit toujours de la sollicitude de ses parents envers lui.\nL'art de la boxe est une institution anglaise. L'armée et la marine britannique ont transporté ce goût sur tous les points du globe. À la fin du siècle dernier et jusque vers 1845, aucun pays ne fut plus anglais que le Canada à cet égard. Notre peuple est l'un des plus vigoureux qui se puisse voir. Lorsque les soldats ou les matelots cherchaient querelle aux habitants — ce qui arrivait continuellement — ils trouvaient à qui parler. On se montrait fier, de part et d'autre, des victoires ainsi remportées.\n\nLes élections se faisaient alors par la violence. Durant des semaines et des mois, les rencontres étaient journalières. Un défi n'attendait pas l'autre. Notre génération n'a pas connu ces temps de trouble, aussi pouvons-nous difficilement nous en faire une idée. Le règne pacifique de la loi nous a habitués au mépris des actes disgracieux qui ne choquaient personne il y a soixante ans.\n\nLa rue des Allemands, lieu de naissance de Montferrand est en plein milieu du quartier Saint-Laurent où se réunissaient avant 1840 tous les hommes forts de passage à Montréal. Les tavernes y abondaient. Le mélange des nationalités s'ajoutait à la physionomie déjà étrange de ce quartier. Tout voyageur un peu solide tenait à s'y faire connaître, mais on ne se battait bien que sur la grève, au pied de la place Jacques-Cartier. Connu au faubourg Saint-Laurent c'était avoir une réputation qui\ns'étendait par tout le Canada. Les habitués de ces tavernes passaient alternativement de la buvette à la salle de boxe, car l'établissement n'eut pas été complet en ce temps-là sans le noble exercice que les Anglais nomment *the manly art*. Plus d'une partie commencée avec les gants rembourrés se terminait, quelques jours après, en présence de la foule convoquée par la rumeur publique, par une rencontre sérieuse à coup de poing.\n\nLes *sportsmen* et les *gentlemen* les plus huppés de la ville ; les officiers des troupes ; les dames mêmes, patronnaient ces joutes, ces tournois, ces exhibitions de la force physique. Les rencontres se faisaient suivant les règles. On n'y voyait, dès lors, rien de répugnant. Plus d'une taloche savante a été, dans ce temps, l'objet de commentaires passionnés et l'auteur du coup s'est attiré les louanges et les félicitations de milliers de spectateurs enthousiastes.\n\nLa légende qui s'est formée sur notre athlète est fausse en plusieurs endroits. On dit qu'il ignorait l'art de la boxe. Il le connaissait aussi bien que les plus adroits jouteurs. Elevé dans le faubourg Saint-Laurent, à deux pas du *Fort Tuyau*, du *Coin Flambant* et de dix salles de gymnase, il les fréquentait habituellement, mais évitait les querelles si communes dans ces réunions. Son éloignement pour les boissons fortes le laissait maître de lui-même et lorsque les têtes s'échauffaient il savait se retirer.\nQuand son adversaire le serrait de trop près, il levait la jambe et le couchait par terre sans lui faire de mal.\n\n***\n\nDeux boxeurs anglais renommés luttaient un jour, en 1818, sur le Champ de Mars de Montréal, en présence de la foule et d'une partie des troupes de la garnison. On rapporte que le vainqueur fut proclamé champion du Canada et que le meilleur homme du pays fut appelé séance tenante à lui disputer ce titre. Le sang de Montferrand ne fit qu'un tour : il ne voulait pas laisser la palme à un Anglais ! Selon la coutume du temps, il s'élança dans le cercle et chanta le coq : cela signifiait qu'il relevait le défi. Les gens du quartier Saint-Laurent battirent des mains — ils connaissaient l'enfant qui allait se mesurer contre le boxeur anglais. Leur espoir ne fut point trompé. Montferrand ne porta qu'un seul coup de poing, mais si parfaitement appliqué que son adversaire se déclara incapable de lui résister.\n\nSes bras, sur le vainqueur, dans sa gloire troublé,\nFrappent comme un fléau sur la gerbe de blé.\n\nLe lendemain toute la ville prononçait le nom de Jos. Montferrand. Il avait conquis la faveur populaire ; les sportsmen lui pressaient la main et se le présentaient l'un à l'autre. La candeur avec laquelle il recevait les éloges le faisait encore plus remarquer. Sa bonne figure plaisait aux amateurs du grand jeu.\nMais lui, dans son humble condition, ne cherchait qu'à gagner sa vie et à aider sa famille. Ses instincts étaient du côté du travail. Il exerça, pour commencer, l'état de charretier de grosses voitures ; on l'employait surtout à la manœuvre des articles lourds et difficiles à remuer. Il expédiait avec prestesse la besogne d'un déménagement, on peut le croire !\n\n***\n\nSa conduite à l'égard du mulâtre qu'il avait battu à Kingston révèle son bon cœur. C'était en 1819 ou 1820. Ce mulâtre, professeur de boxe, était le favori de la garnison. Sa renommée s'étendait jusqu'aux États-Unis. Les voyageurs canadiens lui parlèrent de Montferrand.\n\n— Je lui offrirai la partie, dit le professeur, à condition qu'il ne fera point usage de ses pieds.\n\n— J'accepte, répondit Montferrand.\n\nAu jour fixé, toute la ville voulut voir le combat. Dès les premières passes, le mulâtre s'emporta et piqua de la tête. Montferrand le menaça de ses pieds s'il rompait les conditions du cartel. Quelques instants plus tard, le mulâtre abaissa les mains et se darda de nouveau la tête en avant. Le Canadien leva le pied et lui fracassa la mâchoire en quatre morceaux.\n\nIl existe plusieurs versions de ce combat contre un mulâtre ; en voici une autre : C'était dans l'hiver de 1820-\n\n---\n\n1 M. Lamontagne, neveu de Montferrand, n'en croit aucune. Cependant tout le monde en parle.\n21. Montferrand était du nombre des voituriers qui transportaient des marchandises en Haut-Canada en compagnie de Charles et Joseph Perreault. À Kingston, il rencontrèrent un mulâtre célèbre par ses prouesses au pugilat et se querellèrent. Montferrand barra le chemin au mulâtre pour le punir de son audace, mais un coup de poing qui le lança à dix pieds, lui apprit ce que valait son adversaire. Il y eut cinq reprises en règle et ce n'est qu'à la cinquième que Montferrand porta le coup de pied qui lui donna la victoire.\n\nDix ans plus tard, tous deux se rencontrèrent à Montréal, au marché Molson, aujourd'hui marché Papineau. Le mulâtre n'était pas reconnaissable. Sa maigreur et sa figure affreusement endommagée en faisaient un spectre repoussant.\n\n— J'ai toujours dépéri, depuis notre combat, dit-il à Montferrand.\n\nCelui-ci lui prit la main, le consola de son mieux et lui donna dix piastres. Bientôt après, en présence de M. François Laviolette, il lui remit vingt autres piastres; puis il obtint de le faire entrer à l'hôpital, où il ne tarda pas à mourir.\n\nTroisième combat contre un homme de couleur : — Ce mulâtre était tambour-major dans une troupe de musiciens ambulants ; la rencontre eut lieu, par faveur spéciale, sur le Champ de Mars de Montréal, alors fermé à la foule. Au premier coup, Montferrand tomba sur une main, mais se releva aussitôt. À la seconde passe il porta\nau mulâtre un coup dans le côté gauche qui l'abattit et causa sa mort la même journée. La manière dont avait été arrangée cette malheureuse rencontre fut la sauvegarde de Montferrand : on avait compromis tant de personnes dans l'affaire que tout en resta là.\n\nJ'ai encore des histoires de mulâtres — mais je vous en fais grâce pour le moment.\n\n***\n\nSon père et sa mère décédèrent de 1820 à 1822. L'année suivante, il entra au service de la compagnie du Nord-Ouest sous les ordres de M. Fisher. Dès les premiers jours, un métis, du nom d'Armstrong le provoqua en duel au pistolet, à vingt pas. Montferrand voulut abréger la distance, mais son adversaire s'y refusa.\n\n— Eh ! bien puisque tu ne veux pas te battre, tu n'en sentiras pas moins la poudre !\n\nCe disant, il lui mit le pistolet sous le nez et tira en l'air. Puis appliquant sa large main sur l'épaule du pauvre diable, il ajouta :\n\n— À présent, tu vas la danser !\n\nArmstrong s'excusa, à genoux, dit-on. Ce métis était contremaître d'un chantier, ou servait dans la compagnie de la baie d'Hudson. Son amusement consistait à aller d'un campement à un autre, insulter les hommes et les appeler en combat singulier. À cause de sa force et de sa méchanceté on le craignait beaucoup. Montferrand le guérit de ses louables habitudes.\nA l'âge de vingt-cinq ans, il laissa la compagnie pour entrer au service de Joseph Moore qui exploitait des coupes de bois sur la rivière du Nord, où il fut conducteur en chef pendant deux ans; alors il passa chez Bowman et McGill marchands de bois. Ce fut son premier voyage en haut de l'Ottawa.\n\nLe commerce de bois prenait des proportions énormes à cette époque. On tirait de l'Ottawa des \"cages\" qui descendaient le fleuve et faisaient la fortune des entrepreneurs. Les \"voyageurs\" touchaient de gros gages. Les bons hommes étaient recherchés. Leur rendez-vous à Montréal, se continuait durant tout l'été. Ceux qui avaient fait plusieurs campagnes et qui s'étaient distingués par des actions d'éclat jouissaient d'une notoriété que la jeunesse enviait. L'adresse, le courage et les muscles étaient en grand honneur. Nombre de Canadiens se trouvaient riches sous ce rapport — et ils exploitaient leur fonds avec tout l'entrain que notre race met dans les choses qui lui plaisent.\n\nUn jour qu'il était porteur de plusieurs milliers de piastres destinées à la paie de ses gens, il fut attaqué, au lac des Sables, par cinq hommes qui voulaient le dévaliser. Malgré leurs bâtons, il assomma trois d'entre eux et s'empara des deux autres pour les livrer à la justice.\n\nIl mettait de l'ordre partout : dans la bande, souvent indisciplinée, qu'il commandait ; dans les affaires de ses patrons et jusque dans les écritures des commis, tant sa mémoire était fidèle.\nLe lac des Sables est en haut de la rivière du Lièvre, à trente lieues de Buckingham. Ces terrains avaient été concédés à Philemon Wright vers 1799. En 1818, M. Fisher en acheta une partie pour établir une ferme, qui devint bientôt prospère sous sa direction. En 1830, l'arpenteur Bouchette constate que M. Bowman y possédait des cultures en bon état, ainsi que des moulins. La compagnie de la Baie d'Hudson y avait dès lors un poste de traite.\n\nUn parti, mêlé d'Ecossais, d'Irlandais et d'Américains, logeait temporairement chez un Canadien de Buckingham, qui recevait des voyageurs lorsque les hôtelleries étaient pleines. On improvisa une sauterie. Les filles du canton ne demandaient pas mieux. Le plaisir allait bon train, lorsque le fils de la maison voulut prendre part à la danse. Les shiners le repoussèrent avec des moqueries en disant qu'un Canadien était de trop en ce moment. Cette insulte courut le village comme une traînée de poudre. Montferrand en eut connaissance et il partit seul pour régler l'affaire. Entrant dans le bal sans se faire annoncer, il étendit la main sur le violon et le broya. Ensuite, s'adressant à la société :\n\n— Tout le monde dehors !\n\nVous comprenez le reste :\nSur cet ordre un peu leste\nChacun s'en fut coucher.\nTrois qualités physiques faisaient de Montferrand un homme redoutable : les bras longs et forts, la jambe qu'il maniait comme un fouet, et la souplesse incroyable de tout son corps. Ajoutons à cela un sang-froid qui rendait son courage effrayant.\n\nLe plus souvent, il se battait à la négligence, mais dans les cas de légitime défense, il déployait tous ses moyens. C'était alors un lutteur homérique. Rien ne l'arrêtait et tout pliait devant son audace. Il semblait avoir un souverain mépris du nombre de ses adversaires, peut-être d'après ce calcul qui consiste à frapper un grand coup sur deux ou trois hommes et à terrifier ainsi toute la bande.\n\nSon frère Louis, plus jeune et un peu moins fort que lui, l'accompagna dans bien des courses. C'était aussi un homme d'ordre. Tous deux, après avoir beaucoup travaillé, rudoyé leurs corps et couru des dangers sans nombre, ont laissé une jolie fortune à leur famille. On raconte de Louis qu'il buchait cinq cordes de bois, durant une courte journée d'hiver et les cordait avant l'arrivée de la nuit. Ses bourgeois lui donnaient toujours double salaire. Lui et son frère mesuraient six pieds trois pouces et trois quarts de hauteur.\n\nLouis ne possédait pas l'agilité de Joseph. À la bataille il était maladroit. Quelques uns pensaient qu'il valait son frère, tant sa force et sa bravoure était incontestables.\nUn nommé Berlinguet annonçait depuis quelques temps qu'il battrait les Montferrand à la première rencontre. Les cages de l'Ottawa étant arrêtées à l'Abord-à-Plouffe et Berlinguet sachant que Joseph avait pris les devants pour se rendre à Montréal, s'adressa à Louis, l'injuria et finit par le souffleter. À la grande surprise des assistants, Louis ne tira point vengeance de l'insulte. Mais un homme du nom de Marsolais, de Montréal, très vaillant lui-même, sauta dans une voiture et alla conter l'affaire à Joseph. On voit d'ici le poil du grand frère ! En deux temps, il fut à l'Abord-à-Plouffe — mais Berlinguet avait disparu. Bientôt après, rendez-vous fut pris à Montréal, par l'entremise de témoins. Berlinguet refusa de s'y rendre. Joseph alla le chercher. Sur le terrain, il s'avoua incapable de soutenir son défi.\n\n— Il n'y a donc pas un homme sur la terre pour faire face aux Montferrands ! s'écria Joseph.\n\n— Je le crois bien, vous ne craignez ni Dieu ni diable, répondit Berlinguet.\n\n— Je crains Dieu ; quant au diable, habillez-le en homme ou amenez-le moi dans son costume naturel et je l'étranglerai !\n\n***\n\nDe père en fils, les Montferrands sont charitables. Lorsqu'un pauvre charretier perdait son cheval, les deux frères, Joseph et Louis, allaient par les maisons quêter l'argent nécessaire pour lui acheter une autre bête. Les\nJOS. MONTFERRAND\n\nveuves et les enfants tombés dans la misère trouvaient en eux des protecteurs d’autant plus écoutés qu’ils étaient du peuple, connaissaient toute la ville et étaient estimés dans tous les rangs de la société.\n\nLouis est mort du choléra, à Montréal, en 1832, âgé de vingt-cinq ans. Il n’était pas marié.\n\n***\n\nVers 1828, à Montréal, un major du nom de Jones, appartenant à l’armée, passait pour être un pugiliste invincible. Il affichait un profond mépris des Canadiens. Un jour, dans une buvette de la Place d’Armes, il vit entrer Montferrand et se moqua de lui. Dix minutes après les deux hommes se mesuraient dans la cour de l’établissement. À chaque coup appliqué d’une main sûre, Montferrand lui disait :\n\n— Insulterez-vous encore les Canadiens !\n\nLe major capitula, tout grand boxeur qu’il était.\n\n***\n\nEn 1828, à Québec, Montferrand pensionnait à l’Hôtel de Québec, tenu par un nommé Beaulieu. Les frères McDonell, commis de Bowman et McGill, donnaient un bal aux voyageurs. Les officiers d’un navire anglais s’avisèrent de troubler la fête. Ils cherchaient à se mesurer contre les plus vaillants et menaçaient de tout briser dans l’hôtel. C’était la mode du temps. Les McDonell appelèrent au secours ; Montferrand descendit de sa chambre. Il tenta\nd'abord de faire sentir sa force aux intrus, mais ceux-ci s'armèrent de garçettes — alors le véritable bal commença ! Montferrand ne manqua pas un seul officier : il les laissa tous aux mains des médecins. La chose fit grand bruit par la ville. Les *sportsmen* accoururent le lendemain ; ils venaient des navires en rade et principalement de la garnison. Montferrand ne pouvait suffire à répondre aux éloges dont on l'accablait et aux attentions que lui témoignaient ces visiteurs enthousiasmés.\n\n— Nous avons parmi nous, dit un capitaine, le champion de la marine anglaise : il est de votre force et serait heureux de voir ce que peut faire contre lui un Canadien.\n\nLe mot n'était pas lâché que Montferrand avait dit : \"j'accepte !\" Son patriotisme n'hésitait jamais, quoiqu'il aimât médiocrement la bataille pour elle-même.\n\nLe rendez-vous était sur le quai de la Reine. Un trait qui peint bien les mœurs du temps, c'est que, outre la population accourue en foule, il y avait beaucoup de dames — et les soldats de la garnison formaient la chaîne pour contenir les deux mille spectateurs de cette scène. De nombreux paris étaient engagés. Montferrand ignorait cette circonstance. Le champion anglais était un colosse de six pieds quatre pouces de haut. Son torse et ses bras nus étaient couverts de poils. Son apparence en imposait aux plus braves — si bien que Montferrand se crut perdu. Une faiblesse générale s'empara de ses membres. Il ne savait comment se tourner. Tout à coup, la musique du régiment se fit entendre. Elle eut un effet\nmagique sur notre héros. Il entra dans le cercle et se mit en garde. L'Anglais porta un coup habile, qu'il croyait irrésistible, mais qui fut paré. On applaudit. Aussitôt la confiance des parieurs se tourna du côté de Montferrand. Celui-ci redoutait maintenant plus la science que la vigueur de son adversaire, et comptait le fatiguer, grâce à l'inépuisable force dont il se sentait lui-même possesseur. À la douzième reprise, l'étranger donna des signes de faiblesses, et à partir de ce moment les chances paraissaient en faveur du Canadien. À la seizième reprise, une feinte habile permit au marin anglais de frapper à la tête, près de l'oreille, endroit sensible à l'excès, mais au début de la dix-septième reprise Montferrand para des deux bras à la fois et détacha deux coups de poing qui atteignirent son adversaire en pleines côtes le mettant hors de combat.\n\nLe capitaine, suivi de nombre de personnages, amateurs de ces jeux barbares, donna force poignées de mains à Montferrand et déposa devant lui deux mille piastres, formant la part de bénéfice du vainqueur.\n\n— Je veux bien, dit Montferrand, garder le titre de champion des cinq parties du monde que vous me décernez ; quant à l'argent, donnez-le au pauvre diable que j'ai brossé, il en aura plus besoin que moi pour se faire raccommoder la carcasse. Je ne me bats ni pour or ni pour argent.\n\n— Alors, venez avec moi, je vous ferai voyager autour du monde et vous traiterai en bon ami. Pour commencer, allons dîner.\n— J'irai dîner avec vous à bord, mais nous n'irons pas plus loin ensemble. Si vous saviez comme je ne suis pas attaché à l'argent, et combien il m'en coûterait de partir de mon pays !\n\nÀ ceux qui lui offraient un jour mille piastres, la veille d'une élection, il fit cette réponse :\n\n— Si c'est pour mon parti, pas d'argent. Si c'est contre mon parti, tout l'or de la terre ne m'achèterait pas.\n\n***\n\nBill Collins avait la réputation d'être l'un des plus adroits boxeurs de Montréal et le plus souple de tous ceux qui se servaient du pied et du poing. Sa coutume était de parcourir le faubourg Saint-Laurent, la menace à la bouche, désignant d'avance ses victimes. Il chantait le coq à tout propos. Un ami de Montferrand, appelé Étienne Lavictoire, tenait une auberge ; il se concerta avec Édouard Perreault et Louis Picard, deux autres familiers de Montferrand et ils invitérent celui-ci à rencontrer Collins chez eux pour une lutte courtoise. Montferrand vit, en entrant, un grand feu qui flambait dans la cheminée, et à l'autre extrémité de la pièce, une buvette. On servit une ronde. Collins, caché sous le comptoir, se montra soudain et brisa le verre dans lequel Montferrand buvait. Ce fut un éclair. Montferrand se pencha par-dessus le comptoir, saisit Collins aux deux flancs et le lança dans la cheminée, où il eut grillé jusqu'aux os sans l'aide que lui portèrent les assistants. Il ne demanda pas\nson reste. Cela mit fin aux fanfaronnades de plusieurs fiers-à-bras qui imitaient Collins.\n\nPourtant, les amis de Collins intervinrent et une rencontre sur la grève fut décidée. C'était en 1830. À la première passe, Montferrand appliqua un vigoureux coup de poing sur l'oreille de Collins — et on crut le malheureux assommé pour jamais. Il se rétablit cependant. En 1832, le choléra lui valut la chance d'être compté un instant pour mort. Avant que de parvenir à la Pointe à Callières, (aujourd'hui place de la Douane) où l'on jettait, dans une fosse commune creusée à cet effet, les cholériques que l'on ramassait sur la route, ce grand tapageur sauta à bas de la voiture et fit un pied-de-nez au charreter, qui resta tout stupéfait de voir Bill se sauver sans même lui payer sa promenade. Le cahotage du véhicule avait dégrisé mon homme: On le vit encore faire les cent coups durant quelques années. C'était un métis.\n\n* * *\n\nParvenu au plein développement de sa croissance, Montferrand était très bien proportionné et d'un port imposant. Ses bras, longs et nerveux, descendaient jusqu'aux genoux les doigts étendus, avantage précieux qui lui permettait de tenir un antagoniste à distance. D'ailleurs, ses bras étaient pour la force et la vigueur, hors de comparaison avec ceux d'aucun homme.\n\nUn jour il hâla par la chaîne une chaloupe qui flottait derrière un bâtiment et l'embarqua. Il fallut cinq hommes pour la remettre à l'eau.\nUn champ de combat, vaste et curieux à étudier, c'était la vallée de l'Ottawa, de 1806 à 1850. Montferrand l'a parcouru en dominateur et son histoire est intimement liée à cette région du pays. De Montréal à Hull, distance de plus de quarante lieues, les habitations étaient clair-semées. Le commerce de bois attirait des Canadiens et des Irlandais, ces derniers, orangistes pour la plupart et ennemis jurés de tous ceux qui parlaient français ou appartaient à la religion catholique. Sur cette longue ligne de communication, point de loi, dans les premiers temps, nulle police, aucun recours à la justice des tribunaux. Le droit du plus fort prévalait partout. Aussi choisissait-on les voyageurs parmi les plus robustes ; le chef de chaque escouade ou bande était de préférence un maître homme qui avait fait ses preuves. Montferrand se voyait, à vingt ans, tout désigné pour de telles fonctions. Guide, de cage contremaître de chantier, il déployait, à part ses qualités d'athlète, un jugement sain, un esprit pratique et une entente des affaires de sa profession qui le rendaient précieux à ses \"bourgeois.\" L'estime dont il jouissait le faisait autant rechercher que ses prouesses lui attiraient d'offres de gros salaires. En peu d'années il devint le protecteur attitré des Canadiens de l'Ottawa. Si une bande de ses compatriotes subissait une défaite, c'était à lui de prendre la revanche. Il a parfois combiné\n\n1 Le premier radeau de bois flotté descendit l'Ottawa en 1806.\n2 Plusieurs anciens résidents de Bytown m'assurent que la rivalité était beaucoup plus nationale que religieuse et que les Irlandais catholiques se joignaient assez fréquemment aux orangistes contre nous.\ndes plans pour surprendre les orangistes, qui feraient honneur à un général d'armée. Les meilleurs chefs canadiens se plaçaient d'un commun accord, avec leurs hommes, sous ses ordres, dans ces occasions. Le va-et-vient des travailleurs engagés par les diverses maisons de commerce qui opéraient dans ces territoires, nécessitait une stratégie et des calculs multiples afin d'éviter le danger des surprises. Le parti le plus faible était traité sans merci dans ces engagements féroces où succombaient toujours quelques hommes. Les orangistes prenaient le nom de shinners, que personne ne peut nous expliquer. Nos gens prononçaient \"chêneurs\" ou \"chaîneurs\" — chêneurs à cause des guet-apens qu'ils dressaient aux abords du pont de chêne, de Hull à Bytown, dit-on ; et chaîneurs parceque la plupart de ces massacreurs avaient été employés par les arpenteurs du gouvernement. Les anciens résidents d'Ottawa ne tarissent pas dans le récit des horreurs commises par les chaîneurs. Il y aurait une longue étude à faire sur ce sujet. Brûler une maison, emplumer hommes et femmes, briser les meubles, disperser les funérailles, troubler le service divin, bâtonner les passants, tout cela entrait dans le programme des shinners. Chacun de ces méfaits provoquait des représailles. La guerre subsistait en permanence. Le Bytown canadien frémît encore au souvenir de ces jours d'oppression.\n\nMartin Hennessay, contremaître d'une compagnie de\nmarchands de bois, rivale de Bowman que Montferrand représentait dans le haut de l'Ottawa (dans le voisinage de Pembroke) avait composé une chanson pour célébrer ses exploits. Chaque fort-à-bras qu'il démolissait ajoutait un couplet à cette kyrielle déjà longue. N'ayant jamais vu Montferrand, il lui prit fantaisie de rimer à son sujet une strophe finale, à peu près dans ces termes :\n\nEt Montferrand, au pied léger,\nAura de mes nouvelles.\nIl ne pourra pas s'en sauver :\nJe le cherche et l'appelé !\n\nA quelque temps de là, Montferrand eut occasion d'entrer dans une cambuse ou chantier tenu par un Irlandais, près du village de Buckingham, et se trouva en présence d'une vingtaine de shiners, parmi lesquels Hennessay, qui se fit connaître.\n\nUne autre version rapporte que M. Bowman avait fait cadeau à Montferrand d'un chapeau de castor et que en le voyant passer avec cette coiffure, on l'interpellait amicalement sous prétexte de \"mouiller\" l'article. Ces hommes avaient déjà bu passablement. Après quelques nouvelles rondes, la plupart se trouvaient gris. Hennessay avait l'ivresse désagréable. Se levant tout à coup il enfonça le chapeau de Montferrand sur les yeux de celui-ci, en disant quelques mots de provocation. Montferrand, toujours sur la réserve, ne s'était pas laissé griser ; d'ailleurs, buvant à de rares intervalles, une fois par mois à peine, et avec mesure, il résistait admirablement à l'effet de la boisson.\n— Pourquoi donc te présentes-tu aujourd'hui que je suis seul ? dit Montferrand. Quand mes hommes sont avec moi, on te voit passer au large.\n\n— Je ne me sens pas en sûreté parmi les tiens.\n\n— Moi, c'est différent, j'accepte ton défi au milieu de tes gens. Tu veux m'intimider ! Ta chanson insulte les Canadiens : c'est à la canadienne que je vais t'étriller. En garde !\n\nSur ces paroles, quelques hommes fermèrent la porte et se tinrent tout auprès pour empêcher les combattants de sortir.\n\n— Tu veux donc mourir ici, maître fourbe, demanda Montferrand. C'est un piège que tu m'a tendu !\n\nMais Hennessay frappait déjà. Dans cette chambre remplie de monde et toute basse, il fallait mesurer ses mouvements. Lorsque Montferrand inclinait à gauche ou à droite ou rompait, les hommes de Hennessay le repoussaient à coups de pied, avec tant de vigueur qu'il en gardait les traces douloureuses le reste de sa vie. C'est alors que, voyant la situation se compliquer, il déclara qu'il allait se servir de ses pieds et mettre à mort toute la bande. La porte s'ouvrit. On était à la dixième reprise. Hennessay désirait reprendre haleine. Montferrand se plaça dans une espace libre et chanta le couplet le plus agressif de la chanson de son adversaire. Ceci ranima Hennessay, mais à la quinzième reprise il faiblissait visiblement. Montferrand chanta alors :\nUn Canadien n'est pas léger\nSachez-en la nouvelle,\nTu ne pourras pas t'en sauver:\nJe viens quand on m'appelle!\n\nEt s'adressant à toute la bande:\n— Le meilleur d'entre vous, à présent!\nHennessay réclama le droit de répondre encore une fois. Montferrand para deux ou trois attaques puis tout à coup abaissant son poing sur la figure du téméraire il l'écrasa comme une pomme cuite. Hennessay ne provoqua plus les Canadiens après cela. Il fut tué d'un coup de pistolet dans une bagarre, plusieurs années ensuite.\n\nBytown dut son nom au colonel By qui, à la tête d'un détachement des ingénieurs des troupes, construisit le canal Rideau, terminé vers 1830. Quelques maisonnettes, placées aux Chaudières, d'autres à l'entrée du canal et d'autres encore près la chûte du Rideau, furent les commencements de la ville. Le commerce de bois, la navigation du canal et la traite des fourrures l'alimentèrent à partir de 1830. Les forestiers répandus dès lors à de grandes distances dans le haut de l'Ottawa, faisaient de Bytown leur quartier-général. Les bateaux-à-vapeur remontaient jusque là.\n\nPour se rendre de Hull à Bytown il faut traverser un pont construit autrefois de cordes, plus tard de chêne,\nensuite de fer, maintenant de fer et de bois. À cause du gouffre de la Chaudière, la navigation est interrompue en cet endroit. Ce fut le théâtre des meilleurs coups de Montferrand. Le droit de passage ne s'obtenait bien souvent qu'en livrant bataille. J'écris en ce moment, les yeux fixés sur ce paysage, où circule toute une population paisible, et j'ai peine à me figurer les combats dont je parle, tant les choses paraissent changées.\n\nOn raconte qu'un jour, en 1829, plus de cent cinquante shiners s'étaient mis en embuscade, du côté de Hull, à l'extrémité du pont, qui est suspendu sur la décharge de la cataracte. Montferrand, qui avait conçu des soupçons, demanda à une femme dont l'échoppe se trouvait, comme à présent à la tête du pont, côté de Bytown, s'il y avait du monde dans le voisinage, et sur sa réponse négative, il partit seul pour traverser. A peine rendu au milieu du trajet, l'ennemi se précipita au devant de lui. Il voulut fuir, mais la femme avait refermé la porte du pont. Les shiners brandissaient des gourdins et proféraient des menaces en s'excitant les uns les autres, Montferrand fit quelques enjambées rapides pour se rapprocher des agresseurs ; ceux-ci s'arrêtèrent un instant, mais l'un d'eux plus exposé, tomba aux mains du Canadien, qui le saisit par les pieds et s'en fit une massue avec laquelle il coucha par terre le premier rang ; puis ramassant ces malheureux\n\n---\n\n1 Hull, établi en 1800, était un fort village.\n1 Je dois presque tout ce récit à M. Bastien, sergent de ville à Montréal, l'un des témoins de la scène.\ncomme des poupées, il les lança, à droite et à gauche, dans les bouillons blancs de la rivière. Au moment de l'attaque, Montferrand avait invoqué la sainte Vierge et fait le signe de la croix. L'un des shiners culbutés se releva sur un genoux et au moment où la formidable poigne du géant allait lui faire subir le sort des autres, il décrivit sur sa personne avec un air suppliant, le signe de la croix. \"Passe derrière,\" lui dit Montferrand, qui, sans tarder, bondit de nouveau en avant et recommença à abattre des hommes. La bande plia et se mit à courir, mais en même temps, Montferrand se sentit atteint derrière la tête par un coup de pierre ou de bâton.\\(^1\\) Il se retourna et rabattant son poing sur la poitrine du traître (l'homme au signe de croix) il l'étendit raide à ses pieds, puis, le saisissant par le milieu du corp, le lança dans le gouffre. La scène était horrible. Le sang coulait du parapet dans la rivière. Une foule de gens, rassemblés sur le rivage de Hull, regardaient détaler les shiners qui s'enfuyaient par la route d'Aylmer. Montferrand venait de passer le pont comme il passait partout : en vainqueur.\n\n\\*\\*\n\nL'anecdote que je vais raconter paraît se rapporter à 1830.\n\nPeu de temps après la bataille du pont de Hull, Montferrand arrimait une cage de bois en grume au pied\n\n\\(^1\\) Le fils de Montferrand porte, depuis sa naissance, sur le derrière de la tête, une marque semblable à celle qu'avait son père après cet accident.\ndes glissoires de la Chaudière. Un jeune homme natif de l'Epiphanie, âgé de vingt-deux ans, lui demanda de l'ouvrage.\n\n— J'ai tout mon monde, lui dit Montferrand, mais voici un billet qui vous recommande à mon ami Cardinal. Vous feriez bien de mettre dans votre poche le bouquet, que vous portez au chapeau, car malgré votre stature et votre force, les chaîneurs ne vous laisseront point passer.\n\n— Je me moque d'eux, répondit le jeune homme.\n\nLes anciens de Bytown assurent que l'on peut compter par douzaine les victimes des deux nationalités qui ont fait le saut du pont de Hull. À tour de rôle les partis s'adonnaient à ce genre de vengeance.\n\n— Monsieur Jos, s'écria l'un des cageurs de Montferrand, voyez donc la coiffure du jeune homme de tout à l'heure!\n\nEn effet, le chapeau descendait le courant. Plus loin dans les remous, se débattait l'infortuné Canadien.\n\nSauter dans une embarcation et pousser vers le lieu du péril fut l'affaire d'un instant. Mais en saisissant le canot, le jeune homme le fit chavirer. Montferrand et lui se débattirent au fond de la rivière pour reparaitre à vingt pieds de là. Cet endroit est des plus dangereux. Chaque année des imprudents s'y noyent, à la vue des promeneurs qui visitent le parlement. Après une lutte assez prolongée, passant de tourniquet en tourniquet, Montferrand saisit un cable qu'on lui jetta et atteignit terre emportant le jeune homme évanoui.\n— Que le bon Dieu soit béni ! s’écria-t-il, celui-ci est le onzième que je tire de la rivière.\n\n***\n\nJ’ai été plus embarrassé dans ce travail par l’incertitude des dates et l’abondance des faits que par l’esprit du doute. Montferrand est entré dans l’imagination populaire. Ses exploits ne souffrent point contradiction. Reste à savoir où, quand et de quelle façon telle ou telle chose qui le concerne a eu lieu. Et puis, comme le dit un proverbe : on ne prête qu’aux riches — et que ne lui a-t-on pas prêté ! Son père et son grand-père, personnages célèbres en leur temps se sont en quelque sorte fondus dans sa légende — si bien que jamais à présent on ne parle de ces deux athlètes — tout est mis au compte du Montferrand que nous avons connu.\n\nLa beauté de sa figure, l’aimable expression de ses traits, la grâce de toute sa personne, la jovialité de sa conversation en faisaient l’un des hommes les plus captivants et les plus polis de l’époque, mais il parlait toujours avec hauteur et mépris de ceux qui tentaient de se faire une renommée par des bravades. “Bon à rien” “cabochon,” “morveux,” “serre-le-grain,” “puissante de bois,” “enfant de quatre sous” — telles étaient les expressions qu’il employait pour les désigner. J’en passe, et des plus énergiques !\n\nAvec ses grands yeux bleus, ses cheveux blonds foncés, son teint clair, ses joues rosées, quand il entrait\ndans un bal, on ne voyait plus que lui. D'abord incomparable, un peu poseur comme tous les beaux garçons, il enlevait les suffrages. À table, gaieté et politesse, à la mode des anciens seigneurs. Il n'y a qu'une voix parmi ses contemporains pour chanter ses louanges et exprimer leur admiration à son égard.\n\nPoussant de rire à voir couler sa vie\nComme le vin d'un tonneau défoncé,\n\nle voilà bien fidèlement décrit par le chansonnier.\n\nAmour ! tu perdis Troie. Amour ! tu fis le malheur de Samson. Amour ! si l'on instruisait ton procès, tu serais... plus chéri que jamais ! Je te consacre trois exclamations.\n\nMontferrand ne stationnait nulle part sans faire acte de galanterie. À la ville comme au village, ses soirées appartaient aux dames. Avec sa jovialité, l'entrain de ses manières, la politesse qui était innée en lui — et sa réputation d'homme invincible... et irrésistible, disons le mot, il attirait tous les regards, captivait les cœurs et régnait par droit de conquête dans les cercles qu'il fréquentait. Mille jalouses étaient le résultat de cette conduite, mais l'Adonis, à la fois hercule et bon vivant, n'en tenait pas compte. De tous temps, la beauté s'est plu à soumettre les hommes forts. Il s'en suivait que les rivaux de Montferrand étaient souvent des types peu ordinaires — et s'il a soutenu des combats contre quelques-uns de ses propres amis ou compatriotes, c'est dans cette\nsituation qu'il faut en rechercher la cause. De là aussi ces attaques nocturnes, ces surprises qui tiennent du roman et dont sa carrière fut remplie. De là également le prestige de sa renommée, car notre peuple fait toujours la mesure très large à celui qui fascine le beau sexe et qui s'expose au danger en son honneur.\n\n\"Battu ou battant,\" dit M. Montpetit, Jos. Montferrand n'en restait pas moins le type du batailleur agile, fier, vaillant, galant, et partant, invincible et invaincu. On trouvait toujours quelque part, dans le coin du cœur, une excuse pour ses défauts ou ses faiblesses. Homme de plaisir et de joie, avait-il une défaillance ? on prétendait que, la veille, il s'était oublié au milieu de ses amis.\"\n\n***\n\nJ'emprunte encore à M. Montpetit la substance de l'anecdote suivante : Un jour que Montferrand avait invité plusieurs de ses hommes à se désaltérer dans un petit hôtel bien tenu, il fut étonné en entrant de voir que les figures de la maison n'étaient plus les mêmes. L'ancien propriétaire avait changé de résidence.\n\n— Pardonnez-moi, madame, dit-il à une jolie femme qui tenait le comptoir. Autrefois, on me connaissait ici. En ce moment, je n'ai pas de monnaie, et je me retire.\n\n— Restez, monsieur, avec vos amis ; sans savoir qui vous êtes je vous crois homme d'honneur. Faites-vous servir.\n\nOn profita de la permission. Montferrand entama\nune causette avec la nouvelle maîtresse du logis. Avant de partir, il la remercia de son obligeance, puis se plaçant au milieu de la salle, il s'enleva d'un vigoureux coup de jarret, marqua les clous de sa botte sur le plafond, et avec une grâce parfaite :\n\n— Voici, madame, ma carte de visite : vous pourrez la montrer à vos clients : je me nomme Montferrand.\n\nLa \"signature\" du colosse a fait une partie de la fortune de la belle hôtelière. On venait la voir de dix lieues à la ronde.\n\nQuand il signe,\nSon talon\nEgratigne\nLe plafond.\n\nAux élections de 1832, à Montréal, les troupes firent parler la poudre. C'était du nouveau. Néanmoins il y eut plus d'un engagement au bout du bras. Le grand Voyer tua un tory d'un coup de poing; sur la place du marché au soin (carré Victoria à présent). Une poussée formidable s'organisa contre lui. Montferrand se tenait près de Voyer, qu'il appelait familièrement son papa. À l'approche de cette vague humaine, il lança un coup de poing qui renversa trois hommes. La bande, toute décontenancée recula. On la poursuivit et elle ne reparut plus de la journée.\n\nL'adresse avec laquelle il choisissait, dans une foule, l'individu ou le groupe qu'il s'agissait de frapper pour jeter l'épouvante parmi le reste, a été observée dans tous ses\ngrands combats. Jamais il ne perdait son temps. Pas un geste inutile. C'est de lui qu'on peut dire : \"tous les coups portaient.\"\n\nCes troubles de 1832 sont de l'histoire. Trois Canadiens furent tués (21 mai) par le feu des soldats ; plusieurs blessés. M. Joseph Roy, magistrat, eut le courage de lancer un mandat d'arrestation contre le colonel Mackintosh et le capitaine Temple — mais le jury ne voulut pas sévir, et M. Roy perdit sa commission de juge de paix.\n\n***\n\nSandy Dubois, hôtelier de la place Jacques-Cartier, arrêta un jour Montferrand qui passait dans la calèche de Toutou Marsolais, et le fit entrer chez lui, sous prétexte de boire le coup de l'étrier, car Montferrand partait au devant des cages de l'Ottawa. Les deux frères Tommy et Jimmy Ling les suivirent et devinrent bientôt incommodes, surtout Jimmy, le plus renommé des deux. Montferrand, impatienté et pressé de partir, attrapa Jimmy par les flancs, le souleva avec une telle vigueur que la tête et les épaules du bully enfoncèrent deux planches du plafond, et le laissant retomber comme une masse inerte, il sortit souhaitant bonne santé au reste de la compagnie. Sur le trottoir, voyant qu'on le regardait, il s'enleva des deux pieds et retomba mollement assis dans la frèle calèche sans la fatiguer ni trop l'ébranler.\n\n— Touche, Toutou ! Au revoir Dubois ! En route pour l'Abord-à-Plouffe !\nVers 1842 ou 1843, il y avait bénédiction d'une cloche à Buckingham ; Mgr Bourget officiait avec trois ou quatre prêtres de Montréal. Les chêneurs, au nombre d'une centaine, voulaient empêcher la cérémonie et menacèrent de tuer l'évêque. Montferrand les dispersa. Après la cérémonie, les chêneurs revinrent et parlèrent d'incendier l'église. On se battit. Montferrand assomma dans le conflit plusieurs de ces fanatiques.\n\nSes contemporains les plus renommés n'ont pas laissé de profonds souvenirs après eux. La génération actuelle ne les connaît pas. C'étaient : Joseph Clermont, Louis Montferrand, Joseph Colas, Taillefer, Senécal, Brulé, Petrus Labelle, Lapane, Claude Giguère, Peter McLeod, Castérat, Rodolphe Des Rivières, Garçonnette Giroux, Grenache, Vital Poitevin, Letendre, Gourdeau, Cardinal, Monarque, Tourangeau, Duhême, Joseph Gobeil, Vigneau, Leduc, Ouellet, Morin, Deschamps, Masson, Rouillard, Malo, et d'autres que les anciens mentionnent au cours de leurs récits. Seul Jos. Montferrand les remplace dans la mémoire du peuple. Il symbolise son époque — on ne saurait contester qu'il en fut le type le plus extraordinaire.\n\nRaconter ses luttes, c'est nommer les hommes notoires de son temps dans l'art des combats. Ainsi, il a battu Sans-Pitié, les Gagnons, le grand Baptiste Dubois, Alex. Crépeau, et jamais il n'a eu le dessous.\nJ'ai plus d'une fois entendu dire : \"Un tel a battu Montferrand,\" mais en allant aux informations j'ai toujours appris autre chose. Par exemple M. Jeanveau, qui demeure encore à Montréal, vient de me faire savoir que ni son père ni son frère ni lui-même n'ont eu chicane avec Montferrand. Néanmoins, on dit pourtant qu'ils se sont battus. L'origine de ce conte fut une contestation au sujet d'une paire de rames, que Montferrand préféra payer à Jeanveau, afin de satisfaire les parties intéressées.\n\nÀ Québec, on dit que Montferrand a été battu dans cette ville par un nègre. À Sorel même chose. À Montréal, à Kingston, à Ottawa toujours le nègre reparait. Au fond, il y a pour toute vérité, les affaires du mulâtre de Kingston et du nègre de Montréal racontées ci-dessus.\n\n***\n\nUn maître de boxe nommé O'Rourke tenait un hôtel, rue Saint-Pierre, à Montréal. On le disait de première force dans son art. Il avait battu Reed, fameux pugiliste américain, et depuis lors il portait le titre de champion. Reed amena Montferrand chez O'Rourke et les pria de prendre les gants en sa présence. La table du dîner était dressée pour une cinquantaine de convives. Les combattants se placèrent dans un espace libre et le jeu commença. O'Rourke vit de suite que la tâche dépassait ses moyens ; il s'emporta, jeta les gants et frappa à poings nus. Montferrand méprisait les batailles sans motifs ; il enleva son adversaire à bras tendus et le lança sur la table avec une telle puissance que tout le service fut balayé.\nO'Rourke se ramassa péniblement de dessous un monceau de faïences brisées et vint, clopin-clopant, faire des excuses à celui qui l'avait si bien roulé. De plus, il paya une ronde aux personnes attirées par le bruit de la lutte.\n\nCes exploits volaient de bouche en bouche et, comme s'exprime une vieille chronique, la réputation de Montferrand était insurpassable.\n\n***\n\nUn régiment s'exerçait sur la Place d'Armes, à Montréal, et venait de former la ligne. Montferrand passait. Les soldats se le désignèrent les uns aux autres ; en un instant la discipline fut oubliée. Le colonel, ne comprenant rien à cette attitude insolite sous les armes, lançait des ordres que les majors répétaient — mais c'était comme s'ils chantaient tous trois. L'adjudant, placé à l'un des points de base de la ligne, étendit son épée vers un certain endroit : à ce signal les officiers supérieurs pivotèrent sur leurs montures et virent Montferrand qui achevait de parcourir là place. Le colonel (un sport) se retourna et sourit à ses hommes ; les majors se déridèrent. Les soldats comprurent que leur distraction était pardonnée. On avait vu passer Montferrand : dès lors tout s'expliquait et s'excusait !\n\n***\n\nEn 1838-39, la prison de Montréal regorgeait de détenus politiques qui se plaignaient, non sans motif, d'être mal nourris. Deux fois par semaine, Jos Mont-\nferrand et son bon ami François Laviolette, boucher, allaient de porte en porte, même chez les Anglais réputés ardents bureaucrats, et demandait la charité pour les prisonniers. Il va de soi que pas un Canadien ne les renvoyait les mains vides. La plupart des Anglais donnaient par admiration pour l'excellent caractère et les prouesses de Montferrand.\n\nCar il eut ce beau privilège d'être aimé de tous ceux qui le connurent. Ses anciens compagnons ; ceux pour qui il travailla ; les hôteliers qui l'hébergèrent — tous m'ont parlé de lui avec respect et affection. La postérité se tromperait grandement si elle faisait de lui un hercule mal dégrossi, avide de luttes et rude envers les autres comme il l'était parfois pour lui-même. Je tiens à faire ressortir son mérite, maintenant qu'il n'est plus et que son nom semble destiné à prendre place dans nos annales historiques.\n\nC'était un nageur accompli. Il dut à cette faculté la chance de sauver sa vie dans une circonstance remarquable.\n\nLes Irlandais ne le cherchaient plus qu'en bande et pour le tuer, après l'affaire du pont de Hull. Ses patrons lui recommandaient de ne point se risquer à Bytown sans être accompagné. Un jour, se trouvant seul au bord du Rideau, il fut surpris par une troupe qui le cerna et il dut traverser la rivière à la nage. Sur la grève opposée, une autre bande, armée de fusils, dit-on, le\nguettait. Alors, prenant le fil de l'eau, il se laissa emporter vers la chute. Au moment de sauter il adressa une fervente prière au ciel. Deux heures plus tard, Bytown savait que Montferrand était englouti dans l'Ottawa — mais il changeait tranquillement d'habits chez un hôtelier du nom d'Agapit Lespérance et racontait son aventure. La couche d'écume qui flotte au pied du Rideau avait dérobé le plongeur aux yeux de ses ennemis. Le temps que ceux-ci prirent à descendre la côte, il l'employa à se dérober sous les replis de la cataracte. Le Rideau tombait encore, il y a quinze ans, de manière à laisser plusieurs vides sous ses voiles admirables. M. Louis-Joseph Papineau m'a conté que, vers 1810, il avait pu se glisser sans se mouiller derrière une grande partie de la chute. En 1613, Samuel de Champlain disait \"cette chute tombe d'une telle impétuosité qu'elle fait une arcade ayant de largeur près de quatre cents pas. Les Sauvages passent dessous par plaisir, sans se mouiller que du poudrin que fait la dite eau.\"\n\nBytown se peuplait mais la guerre de race n'en était pas moins vive. Un boxeur écossais, dit-on, avait pris rendez-vous pour se mesurer contre Julien Sans-Pitié, l'un des Canadiens les plus renommés, de Montréal au fort Coulonge, et qui se vantait de n'avoir de rival digne de lui que dans la personne de Montferrand. Or ce dernier avait dit, en parlant de Sans-Pitié : \"c'est un enfant qui bavarde contre son maître.\" Sans-Pitié crut devoir\nfaire prier Montferrand de lui servir de témoin dans son duel. Montferrand était stationné à cinq lieues de Bytown; il accepta et fit le trajet à pied, portant dans ses bras une loupe d'érable de vingt livres, présent qu'il fit à son beau-frère pour s'en faire un maillet de tailleur pierre. L'Ecossais ne parut point, on ne sait pour quelle raison. Montferrand, fatigué et assez peu content, alla se mettre au lit, dans l'hôtel d'Agapit-Lesprances, son logis ordinaire. On ne dit pas pourquoi Sans-Pitié monta à la chambre de Montferrand et frappa celui-ci pendant son sommeil. Il s'ensuivit, une bataille en règle, dans la cour de l'hôtel. A la cinquième reprise, Sans-Pitié plia. C'était un homme de plus de six pieds, vigoureux, fier de ses exploits. Il disait qu'il ne craignait de Montferrand que son pied : ce fut le poing qui l'abattit.\n\nMontferrand religieux fervent — cela étonne tout d'abord. On se figure ce redoutable athlète ne craignant ni Dieu ni diable, selon l'expression populaire. Cependant tel n'était point le cas. Chaque fois qu'il s'est trouvé dans quelque péril, il a invoqué la sainte Vierge pour qu'elle lui donnât du courage et ce qui est plus remarquable, il avouait cela à ses camarades, très peu enclins à la dévotion, la plupart mêmes assez libres-penseurs.\n\nM. Bastien, son compagnon de voyage, dit que jamais Montferrand n'a laissé coucher ses hommes pendant le mois de mai, sans leur faire dire en commun le chapelet,\n\n1 Montferrand était pieds nus et en caleçon.\net que toujours, quand sa cage était ancrée à proximité d’une église, il emmenait ses hommes à la messe le dimanche, ne laissant sur la cage que le cuisinier.\n\nSes camarades, qui étaient fiers de lui, le réprimandaient quelques fois d’avoir refusé la bataille. À cela il répondait :\n\n— J’ai promis à ma mère et à la sainte Vierge de n’agir que si je voyais une chose mauvaise, un tort, une insulte imméritée, ou le fort opprimant le faible.\n\nEn effet, on ne peut lui reprocher de s’être engagé dans des luttes pour le plaisir de manifester sa force ou sa vaillance. Il y avait un fonds de chevalerie dans son cœur et dans son imagination. Au moyen-âge il eut porté à lance et la hache d’arme avec éclat, pour Dieu, sa dame et son roi.\n\n***\n\nÀ partir de 1840, il n’alla plus dans les forêts au-dessus de Bytown. Il guidait les radeaux de bois flotté, depuis cette ville jusqu’à Québec. Un jour, près de la rivière du Nord, il laissa échapper quelques paroles assez vives contre l’un de ses hommes appelé ordinairement le grand Baptiste Dubois. Rendu à l’Abord-à-Plouffe, Dubois songea à se venger.\n\n— Monsieur Joe, dit-il, j’aimerais à prendre une leçon de boxe selon les principes.\n\n— C’est bon, mais il ne faudra pas te fâcher.\n\n— Soyez certain que je ferai attention.\n\nDubois était par la taille et la force l’égal de Mont-\nferrand ; il a raconté à M. J. B. Lamontagne que son intention était de frapper un bon coup, afin de donner à réfléchir à Montferrand. Le coup fut tel (en pleine poitrine) que Montferrand culbuta et faillit perdre connaissance. Il se remit et marcha sur son adversaire. Dubois, étonné de cette prompte résurrection, n'eût que le temps de lui dire :\n\n— Pas avec les pieds !\n\n— Tiens-toi bien, grand Baptiste !\n\nEt dépliant son bras droit, il attira l'attention de Dubois sur la garde de gauche, mais aussitôt le poing gauche de Montferrand s'abima sur l'oreille droite du grand Baptiste, qui n'entendit plus jamais rien de ce côté de la tête. Quand on le releva, il balbutiait :\n\n— Ça vaut un coup de pied de cheval !\n\nLorsque Dubois eut amassé cinq cents piastres, il alla finir ses jours chez les Sœurs de la Longue-Pointe, disant toujours aux gens qui lui parlaient de sa santé :\n\n— Mon oreille droite est sourde. C'est une claque de Montferrand. Il ne fendait pas la peau, mais il assommait. Il frappait comme un pied de cheval.\n\n***\n\nM. Etienne Crépeau, qui vit encore, raconte que son père avait battu le célèbre Letendre, de Sorel, qui conçut l'idée d'accomplir une action d'éclat pour rétablir sa réputation compromise. Un dimanche, vers 1843, Montferrand était resté seul sur sa cage, devant Sorel, tandis que ses hommes étaient à la messe. Letendre l'aperçut et\ns'approcha à pas de loup. Montferrand vaquait à la cam-\nbuse. Letendre le surprit par derrière et lui serra la gorge\nà l'étouffer. Néanmoins, par un effort suprême il se\ndégagea. En se relevant, ses pieds glissèrent entre deux\nplançons et il ne put les retirer à temps pour se retourner\nsur son adversaire qui s'était aussi relevé. Letendre en\nprofita pour le renverser de nouveau, mais il redoutait\ntellement d'être saisi par les terribles pinces de Mont-\nferrand, qu'il se retira comme un fuyard.\n\nQuelques semaines après, une personne qui passait\npar la rue des Allemands, à Montréal, avertit Montfer-\nrand que Letendre était dans le port, racontant sa\nvictoire.\n\n— Je vais lui porter mon approbation !\n\nEt toute la journée on vit Montferrand monter la\ngarde le long des grèves et des quais, demandant Leten-\ndre aux échos d'alentours. On m'assure que les parents\nde Letendre arrangèrent l'affaire.\n\n***\n\nGilmore, établi à Montréal en 1847, avait conquis\nla palme de champion de la boxe dans toute l'Amérique.\nIl était d'une taille colossale. Ses leçons étaient très re-\ncherchées. Il attendait son maître, disait-il souvent. Ce\nmaître ne venait pas, et Gilmore grandissait aux yeux de\nses admirateurs. Un jour qu'il jouait aux quilles, on lui\nannonça que Montferrand se tenait près de lui. De suite,\net fort poliment, il offrit les gants à l'athlète. Son déplai-\nsir fut immense lorsqu'il eut tâté l'adversaire qu'il croyait\npouvoir vaincre avec facilité. À l'instar de O'Rourke, il commit la faute de ce monter la tête. Dès lors, arrachant ses gants, il transforma le combat. Montferrand répugnait à ce genre de querelle et se contenta de parer quelques coups, mais enfin impatienté il empoigna Gilmore et lui faisant traverser la chambre il l'envoya par dessus les deux allées du jeu de quilles. Puis, vif comme un écu-reuil, il franchit l'obstacle à son tour et releva son adversaire, qui lui tendit la main et se reconnut dompté.\n\n* * *\n\nAu grand feu de 1852, les quatre coins des rues Mignonne et Sanguinet étaient en flammes ; la rue Sanguinet, vis-à-vis chez Montferrand, se trouvait tellement encombrée de peuple occupé au sauvetage qu'il n'y avait pas moyen de sortir d'un côté ou de l'autre. Les personnes étaient menacées de périr avec les meubles accumulés dans cette espace étroite. Pour ouvrir un passage sur la rue Saint-Denis, M. David Meunier, aujourd'hui hôtelier de la rue Saint-Dominique, ordonna à son fils Pierre d'abattre à coups de hache la clôture du jardin de Coopers mais les gens de Coopers tirèrent sur le jeune homme un coup de fusil. Montferrand intervint. Comme on le menaçait, il lança ses deux pieds dans la clôture et pratiqua une brèche qui fut bientôt agrandie. Les témoins de ce tour de force disent que la clôture avait dix pieds de haut et était appuyée de poteaux de cinq pouces carrés. Coopers n'eut pas le temps de se reconnaître, car en faisant sa trouée Montferrand avait mis la main au collet de\nce propriétaire exigeant et l'avait contraint à demander pardon.\n\n***\n\nMontferrand ne croyait pas subir si tôt le poids de l'âge. À cinquante-quatre ans, date toujours critique pour les hommes fortement constitués, il s'aperçut que la nature reprenait sur lui son empire. Néanmoins, seul il le comprenait et son extérieur ne dénonçait aucunement ce qui se passait dans son être. Il agit en conséquence et se prépara à couler une belle vieillesse, qui fut moins longue qu'il ne le croyait.\n\nHomme d'ordre, même au milieu de ses extravagances de voyageur, il avait su amasser une jolie fortune pour ses vieux jours. Son fils la possède aujourd'hui et s'en montre digne.\n\nSon portrait, toujours mal gravé, l'a enlaidi sottement. On dirait une espèce de monstre. Les hommes de la génération actuelle n'ont vu que sa décadence, son air bonhomme, parfois un peu renfrogné sous l'influence des rhumatismes — et c'est ainsi qu'on le conçoit maintenant. Je me rappelle l'avoir rencontré par les rues, vers 1860, lorsqu'il demeurait dans sa propriété, coin des rues Sanguinet et Mignonne, faisant sa promenade quotidienne au marché Bonsecours, mis avec soin, la tête haute, la figure riante, droit, imposant comme le juge Monk, ayant un mot pour tout le monde — enfin jouissant de la vie. À pied, il dépassait la foule et sa belle figure rayonnait sous les regards qui le suivaient. Sa première visite était pour\nles bouchers, qui l'acclamaient et badinaient avec lui. Ensuite il parcourait les rangs des voitures des cultivateurs, agaçant les femmes, goguenardant les hommes, et salué sur toute la ligne par de joyeux bonjours. Il allait souvent en voiture. Ses chevaux étaient superbes.\n\nQuand il redressait sa taille et qu'il s'animait en parlant, c'était encore le beau garçon de 1830, sans forfante-rie, sans ostentation, tout de cœur et de généreux mouvements. \"Oh ! disait-il parfois, plus je réfléchis plus je m'aperçois que j'ai été un grand misérable ; je m'en repens ; puisse Dieu me pardonner les misères d'une vie que j'ai trouvée si longtemps inutile et souvent nuisible !\" Il semble qu'il regrettait d'être né à une époque de trouble et qu'il la comparait avec notre temps où les lois sont obéies et respectées. Son humilité le faisait s'accuser de fautes que l'histoire ne lui reprochera pas assurément. Il déplorait en quelque sorte d'avoir acquis une renommée issue de la violence et de la force brutale.¹\n\nMarié en 1862 avec Mlle Esther Bertrand, qui avait été élevée chez un de ses oncles, M. Abraham Boyer, de Beauharnois, il en eut un fils (enfant posthume), maintenant âgé de dix-neuf ans, bien instruit, grand (six pieds trois pouces) et doué de deux bras qui rappellent la vigueur de ceux de son père. Il a été élevé par M. J.-Bte Lamontagne, son cousin et tuteur, avec un soin tout paternel, et s'est marié le 29 avril 1884, avec Mlle Fournier,\n\n¹ Dans ce passage, j'emprunte à M. A. N. Montpetit.\nMontferrand mourut en 1864, dans sa maison, n° 212 rue Sanguinet. Sa femme le suivit de près.¹\n\nSi l'histoire de Montferrand n'était pas écrite, la légende de cet homme extraordinaire ne subsisterait pas moins dans l'imagination du peuple. Il a vécu à une époque où le pugilat était en honneur, et de plus il prit une part active à ces petites guerres de races si fréquentes parmi nous avant 1840. Sa renommée dépassa de son vivant toutes celles de ses rivaux. Les plus solides gaillards illustrés dans vingt combats s'éclipsaient devant lui. De Gaspé aux Montagnes Rocheuses et à la Californie, le nom de Montferrand résume trente années de luttes et de passes d'armes qui rappellent les exploits des chevaliers de la Table Ronde. C'est désormais une mémoire indestructible que la sienne. Il personnifie un monde déjà disparu, des mœurs d'un autre âge, des coutumes dont l'étude nous surprend.\n\nN'est-il pas vrai que, peu après 1815, la vallée de l'Ottawa fut en quelque sorte conquise par les Irlandais et les Ecossais, nouvellement arrivés d'Europe et que les Canadiens n'étaient pas en nombre suffisant pour résister à ce flot envahissant qui augmentait d'année en année ? Pourtant, nous avons tenu bon dans ces territoires, nous nous y sommes implantés. Comment ? Par la vaillance ! Et qui a été plus redoutable que Montferrand ? Per-\n\n¹ Inutile de dire que dans cet écrit j'ai fait de mon mieux à l'aide de renseignements parfois diffus et peu faciles à vérifier. La critique a le champ libre. Je donne ce que je sais.\nsonne. Quel est celui de nos compatriotes qui a soutenu nos droits dans ces lieux avec plus de persistance et de succès ? Aucun. Il a symbolisé la force dans un règne de force. La terreur n'avait ni prise ni influence sur lui.\n\nAvant que de mettre la charrue dans les terres qui bordent cette belle rivière, les Canadiens ont dû les conquérir au bout du bras. Montferrand... personnifié ces combattants d'une époque déjà presque oubliée mais très historique, très honorable pour nous.\n\nAu lac des Sables, voilà soixante ans, il prêchait la colonisation. Je me demande si M. le curé Labelle connaît ce précurseur de ses œuvres. Il faut, disait Montferrand, que les Canadiens s'emparent de ces belles terres : autrement l'Anglais nous écrasera ; dans les villes nous ne pouvons plus commander ; notre valeur est à la campagne. Durant les dernières années de sa vie, il parlait sans cesse de ce sujet et encourageait la jeunesse à défricher le sol.\n\nMon plan primitif était de livrer à la presse une série de notes sur les premières années de la ville d'Ottawa. On n'habite pas une localité dix-huit ans sans recueillir bien des choses de son passé. Examen fait, je détache Montferrand de ce cadre pour le faire paraître seul. Il appartient autant et plus à Montréal qu'à Ottawa, et comme il est connu de tout le monde, je suis persuadé qu'il sera partout bien reçu.\n\nFIN\n\n321927\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_49608.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 55, "total-input-tokens": 85458, "total-output-tokens": 22281, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2792, 3], [2792, 5276, 4], [5276, 5461, 5], [5461, 5996, 6], [5996, 6142, 7], [6142, 6469, 8], [6469, 7704, 9], [7704, 9131, 10], [9131, 10447, 11], [10447, 11831, 12], [11831, 13223, 13], [13223, 14647, 14], [14647, 15990, 15], [15990, 17346, 16], [17346, 18738, 17], [18738, 20023, 18], [20023, 21483, 19], [21483, 22737, 20], [22737, 24095, 21], [24095, 25441, 22], [25441, 26714, 23], [26714, 28256, 24], [28256, 29736, 25], [29736, 31144, 26], [31144, 32580, 27], [32580, 34266, 28], [34266, 35696, 29], [35696, 37128, 30], [37128, 38475, 31], [38475, 39667, 32], [39667, 41228, 33], [41228, 42686, 34], [42686, 44093, 35], [44093, 45469, 36], [45469, 46871, 37], [46871, 48241, 38], [48241, 49516, 39], [49516, 50885, 40], [50885, 52232, 41], [52232, 53738, 42], [53738, 55085, 43], [55085, 56457, 44], [56457, 57926, 45], [57926, 59425, 46], [59425, 60751, 47], [60751, 62122, 48], [62122, 63551, 49], [63551, 65068, 50], [65068, 66471, 51], [66471, 67982, 52], [67982, 69507, 53], [69507, 70884, 54], [70884, 70884, 55]], "primary_language": ["en", "en", "en", "en", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]