[{"id": "160275e21d0429bf9e1e2a1e6947749e3232918c", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- Coloured covers/\n- Covers damaged/\n- Covers restored and/or laminated/\n- Cover title missing/\n- Coloured maps/\n- Coloured ink (i.e. other than blue or black)/\n- Coloured plates and/or illustrations/\n- Bound with other material/\n- Tight binding may cause shadows or distortion along interior margin/\n- Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol $\\rightarrow$ (meaning \"CONTINUED\"), or the symbol $\\nabla$ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole $\\rightarrow$ signifie \"À SUIVRE\", le symbole $\\nabla$ signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nPLEASE READ AND CIRCULATE.\n\nTHE LABOR AND MONEY QUESTIONS:\n\nA New Catechism on Political Economy.\n\nBY WILLIAM BROWN.\n\nMontreal:\nJOHN LOVELL, PRINTER AND PUBLISHER.\n\nRouse's Point, N.Y.:\nJOHN LOVELL & SONS, PRINTERS AND PUBLISHERS, LAKE SHORE PRESS.\n\n1874.\nA.\n\nQ. How much money did you have in your pocket?\n\nA. I had $100.\n\nQ. Did you spend any of it?\n\nA. No, I didn't.\n\nQ. What did you do with the rest?\n\nA. I put it in my bank account.\n\nQ. How much money did you have in your bank account?\n\nA. I had $500.\n\nQ. Did you deposit any more money?\n\nA. Yes, I deposited another $200.\n\nQ. How much money do you have now?\n\nA. I have $700.\n\nQ. How much money did you spend yesterday?\n\nA. I spent $100 on groceries.\n\nQ. How much money do you have left?\n\nA. I have $600 left.\n\nQ. How much money did you save last month?\n\nA. I saved $300.\n\nQ. How much money did you spend last week?\n\nA. I spent $50 on gas.\n\nQ. How much money do you have left after all these expenses?\n\nA. I have $550 left.\n\nQ. How much money did you invest last year?\n\nA. I invested $1000.\n\nQ. How much money do you have left after all these investments?\n\nA. I have $450 left.\n\nQ. How much money did you borrow from your friend?\n\nA. I borrowed $200 from my friend.\nQuestion. What is money?\nAnswer. Gold, silver, and copper coin.\n\nQ. What is the use of these coins?\nA. To exchange the products of man's industry.\n\nQ. In this sense, what is money?\nA. A medium of exchange.\n\nQ. Has it any other use than that of a medium of exchange?\nA. No other use.\n\nQ. Can the precious metals, as money, be put to any other use?\nA. They cannot be put to any other use.\n\nQ. Is not money, when \"invested\" as it is termed, put to some other use than a medium of exchange?\nA. No. It is simply spent, and can only be used in exchange by being spent.\n\nQ. What is really meant when one says he has invested a thousand dollars?\nA. He may hold obligations for the repayment of a thousand dollars, but as to the money itself, commerce can only use it by spending it.\n\nQ. In the same way as I have bought my hat?\nA. Yes—exactly in the same way.\n\nQ. What if he lends his thousand dollars?\nA. Then the borrower spends it.\n\nQ. Is money then in all its uses, simply narrowed down to a medium of exchange?\nA. It is.\n\nQ. Has money a path peculiarly its own?\nA. Yes.\nQ. Where?\nA. In the region of exchange.\n\nQ. But suppose I lend the money?\nA. That is outside of commerce or exchange, and the laws of commerce (or of nature) regulating exchanges of values have nothing to say about loans of money.\n\nQ. You say money can only be used as a medium of exchange—how then do profits arise?\nA. In the exchange.\n\nQ. Will you please explain?\nA. Profits have their existence in exchanges of services, and nowhere else.\n\nQ. Is there any natural definition of profits?\nA. Yes.\n\nQ. What is it?\nA. Labor saved.\n\nQ. Why is \"labor saved\" a correct natural definition of profits?\nA. Because if there were no saving of labor—that is, if every one could make everything needed cheaper than it could be bought—there would be no exchange. There is a natural equivalent in the case, namely, a certain amount of labor exchanged for the same amount of labor. Nature cannot afford more profit to the merchant for his labor than to the working man for his labor.\n\nQ. Are profits confined to the mercantile class?\nA. No—whenever labor, in any form, is exchanged, there is or ought to be \"profit.\" There ought not to be profit unless labor is given. If you seek profit for anything else than personal service given to another, you seek that which is not yours and cannot be yours.\n\nQ. Ought there to be anything besides labor embraced in the profits?\nA. Certainly not—the labor bestowed must embrace \"cost\" and \"profit.\" Profit is not some arbitrary and uncertain element, but is a component part of labor and an essential principle in exchange. It lies at the root of all exchange, and the hope of its acquisition would, under a natural system, inspire every laborer in his toil.\n\nQ. Is there such a thing as interest on money, as well as profit, known to the laws of exchange?\nA. It is an element unknown to true commerce or to the natural laws regulating exchange. \"Interest\" is said to be a profit on the loan of money, and you must not be surprised when I tell you that the laws of exchange have no profit for the loan of money. Nature must ever set her face as a flint against the claims of men to be paid for the use of money, and the necessity of this we shall see as we advance with our subject.\nQ. If I buy goods with a sum of money and sell them at a profit, have I not made a profit out of my money?\n\nA. No—you may imagine what you like about it, but you have not made a profit out of money.\n\nQ. Whence have I got my profit?\n\nA. Out of your labor, not out of the money.\n\nQ. Will you please explain?\n\nA. The money you gave came to you in return for some service or labor rendered to another. The money held your labor in trust. When you bought goods you in reality exchanged your labor for the labor of another, and the money only came between you as an instrument of exchange. Your money could not act in a way contrary to its nature or capacity.\n\nQ. Would it be correct to say that I had made a profit out of my goods?\n\nA. It would not. It would be correct to say that you had made a profit out of your labor, seeing labor is the foundation of all value, that the goods are but the produce of labor, and that it is the labor which gives the value. Let any one try to analyse the phrase \"profit out of your goods,\" and he will see how meaningless it really is. We may have been trained to think in that way; but we must alter our ways of thinking if we wish to understand the subject; for nature founds her laws, not on what we may think, but on what is true and real and equitable. And I must tell you that you will not be a true merchant, neither will you prove a good political economist, till you look squarely at the whole subject from a labor point of view.\n\nQ. Then is the use of money, as a medium of exchange, gratuitous to our race?\n\nA. Undoubtedly it is.\n\nQ. Do you allege that there is no profit in the circulation of the precious metals?\n\nA. I do. There is a general and very great advantage to the race in that circulation, but no individual profits in any act of exchange on account of that circulation.\n\nQ. Does not this view upset some important modern ideas in commerce?\n\nA. That cannot be helped—truth is always best.\n\nQ. Then is there no profit, commercially speaking, on the circulation of the currency?\n\nA. None whatever. It is not on the circulation of gold or silver about the town, or throughout the country, that a profit is made, but in exchanges of service between man and man.\n\nQ. If a profit is made, in some way or other, out of circulation, who pays it?\nA. Of course nothing but labor can pay it.\n\nQ. Is it oppressive to labor?\n\nA. It must, in the very nature of the case, be oppressive to labor.\n\nQ. Were there no other currency but gold and silver, could a profit be made out of circulation?\n\nA. No.\n\nQ. Why not?\n\nA. Because gold and silver constitute a currency for which value in labor must be given ere it can be got, and on account of this circumstance, nobody could secure a profit on circulation.\n\nQ. In what does the superiority of money, as a medium of exchange, consist?\n\nA. The superiority of coined money consists in its power of holding, in a concrete and secure form and in a manner transferable with the utmost facility, the labor of our race. Hence appears the danger to the public interests of tampering, even in the slightest degree, with a balance so delicate and accurate.\n\nQ. Is it a true statement which we hear set forth by the paper economists that gold and silver are difficult to transport?\n\nA. It is not true.\n\nQ. If gold and silver could be hired like houses and lands, would they prove the perfect media of exchange that they are?\n\nA. They would not.\n\nQ. How can a profit be made out of the circulation?\n\nA. By driving out the true currency from circulation and substituting a false one, fabricated out of some inexpensive material.\n\nQ. Does paper currency accomplish this?\n\nA. Yes.\n\nQ. Who pays the profit made out of the circulation of this paper currency?\n\nA. The laboring man.\n\nQ. Do the merchants not pay it?\n\nA. No.\n\nQ. How do you prove that?\n\nA. It is proved in one way, and to a certain extent, by the difference between cash and credit prices, the discount always following the goods into consumption; or that discount proving, as the case may be, a virtual representation of the loss to the working people who have manufactured the goods. It is further proved by the fact that a paper currency must ever be an unrequited loan from the laboring population to the issuers of the paper. And it is yet further proved by the fact that it would be impossible for the merchants to pay out of their labor, the enormous sums gained by lending paper on interest, seeing the labor of the man who sells\nthe article must ever be trifling compared with the toil of the man who makes it.\n\nQ. Do the manufacturers not pay it?\nA. No—they deduct it from the wages of labor.\n\nQ. Can you prove that?\nA. Yes—the manufacturers could and would give more to their men under a cash than under a credit or paper system.\n\nQ. Under this term \"profit on circulation\" do you include bank discounts?\nA. For the sake of argument, I may. The discounting of mercantile paper is the means, generally speaking, by which the paper circulation is spread through the community. It is more correct, however, as a matter both of phraseology and of fact, to include profits on circulation under the more comprehensive term of profits through discounting.\n\nQ. Do the bank discounts, as well as all other bank profits, come out of the wages of industry?\nA. They do. It is impossible they can come from any other source. You cannot for a moment imagine that those who spend the day exchanging bits of paper, can reap any profit from such acts apart from labor. You cannot surely allow yourself to be deceived with the idea, that your exchanging the promise of some one to pay you, written on a piece of paper, with the promise of a bank printed on a piece of paper, to pay somebody else, or with an inscription in a book full of names and figures, can have any connection with the industry of the world other than to drain it of its just rewards. If you, as a merchant, enter into negotiations to float this paper continually, year out and year in, and allow, on one side, a full rate of profit for so doing, do you think you can get the means anywhere except from the toil of working men?\n\nQ. Is no equivalent given to industry?\nA. None whatever. What equivalent can there be in a promise to pay industry its wages? Here we must lay hold of two facts. First,—Industry works for its wages; and second,—paper profits by working on the wages withheld, in securing to itself the labor of others through a promise to pay the money earned, and yet always withheld through the paper system.\n\nQ. What if the issuers have the ability to pay?\nA. That does not alter the case so long as industry is unpaid, and so long as, by this false system, it is made to pay.\n\nQ. If all the currency of a nation is lent on interest, what will be the effects on labor?\nA. All industry will suffer to the extent of losing at least one half of its gains. This will be only the direct pecuniary loss. Demoralization of industry in all its engagements, will speedily follow.\nQ. What makes you think so?\nA. Because labor pays for everything; and there being a profit made out of the loan of the currency as well as a profit on the exchange of the currency, of course labor must pay both. The element of what is known as interest is introduced, always and everywhere oppressive and ruinous to labor.\n\nQ. What about a pure specie currency, were it all issued in the same way from banks?\nA. Industry cannot pay for interest, whether on real money or sham money. In the case you suppose, the banks would get interest on real money, from whatever quarter they gathered it in—by the paper system they get interest on the people's industry without money at all.\n\nQ. Do you gather from this, that a paper system by which the money of the people is taken out of their hands and concentrated in bank vaults to be used for purposes which are foreign to true commerce, and by which a paper currency is made to circulate in its stead, must be more oppressive to industry than a specie currency, so gathered in and then returned to circulation with interest?\nA. Yes—a paper lending system must be more ruinous to the people than a gold lending system—that is, if the gold had been faithfully earned by those who lent it out on interest. But a paper lending system is, in its worst feature, the same as if industry gave all the gold and silver it had earned into the hands of bankers, and then borrowed it back again, paying interest on its own money. Only, the paper currency system is more dangerous and riskful to the whole community.\n\nQ. What is credit?\nA. For the purposes of this discussion, we may define it from a mercantile point of view, as the ability to borrow money.\n\nQ. From a labor point of view, what is it?\nA. Economists and paper men delight to give it grand names, but, with reference to labor, the true definition of the credit system is, obligations to labor never fulfilled. It boasts of being the friend and supporter of labor, whilst the truth is, labor is the real creditor, and the credit system is in debt to labor all the time. Without labor it could not live a single day, and yet it flatters the mercantile community into the belief that it sustains and benefits industry. Labor is being constantly drained for the benefit of the paper men, and therefore labor is the true creditor; and yet the merchants are so far deceived as to believe that industry is the real debtor and the paper men the true creditors. The very reverse is the case. We have therefore a system so thoroughly subversive of what is just, that the true creditors are made to pay, and the real debtors\nlive all the time in wealth and luxury off the toil of the working men. To the merchant and speculator, credit may have its bright side,—it has nothing but a dark one for the poor sons of toil, for those who render true and genuine service to their fellows.\n\nQ. Is the ability to borrow these promises to pay money, or to have a credit in a bank ledger, a blessing to industry?\n\nA. It is not.\n\nQ. Is national credit, in its mercantile sense, a blessing?\n\nA. It is a national scourge, because it is the great means by which the national industry is oppressed.\n\nQ. Is it a mean and degrading thing for merchants and others to be constantly living upon credit?\n\nA. It is. Merchants in general know well how humbling a system this paper one has become to them. Do I not speak the truth when I say, that a constant sense of the presence and obligations of debt leads many noble natures into acts and petty meannesses from which they would otherwise instinctively shrink.*\n\nQ. Does the paper circulation give any advantage to industry?\n\nA. No—the very reverse.\n\nQ. How so?\n\nA. Because it withholds the wages of labor (the true money) and trades upon the wages withheld, and thus makes the working men pay for the loan of their own money.\n\nQ. Through what channels is this done?\n\nA. By reducing wages or the prices of produce, or advancing prices of goods; these being the only avenues through which industry can be directly made to suffer.\n\nQ. Should a currency ever be employed, for which value has not been given by industry, or rather which can be fabricated without labor?\n\nA. It never should.\n\nQ. What will be the result of issuing and lending such a currency?\n\nA. Everything will become disorganised; industry will be oppressed; the most extensive gambling will prevail; the few will become wealthy; the working people will sink lower and lower; and vice and pauperism will abound. I point in evidence to England, where this master system of iniquity has had its principal seat. \"Whether there is a country on the face of the globe where the rich are so rich and the poor so poor as in Britain and Ireland? and how much\n\n* \"The natural influence of debt would appear to be to blunt the edge of the moral perceptions, and to demoralize a people.\" See an admirable article on \"Debt,\" in its moral aspects, by the Rev. E. B. Willson, in the Religious Magazine. (Boston) Aug., 1873.\nis this owing to the monopoly of land, and how much to the monopoly of money or usury?\" James Harvey, in his \"Queries,\" 1872.\n\nQ. Can a nation be truly great which exhibits these features?\n\nA. No—It may be great in the art of killing men made after the image of God,—great in the splendor of its princely abodes,—great in its show and dazzle,—great in its armies and fleets—but a nation which thus oppresses its people never can be truly great.\n\nQ. Does not the government of a professedly Christian nation incur a serious responsibility in thus taking away the people's money?\n\nA. I do not think it could commit a greater crime against its people, or do more injury to industry and true commerce. The working millions will become practically a nation of slaves, with far more vice and crime than have ever been seen in slaveholding countries.\n\nQ. Do you consider the extent of a nation's commerce, the magnitude of a nation's debt, the promptitude with which the yearly interest is paid, the amount of annual taxation, the firmness of what is called \"national credit,\" or the growth of foreign commerce, infallible guides as to prosperity?\n\nA. Tell me faithfully the condition of its working men, and I will tell you what I think about that nation. Let me look into the homes of those who till its soil, who work at its forges and looms; let me examine into the revenue and condition of the people who produce the wealth, and I will give you my estimate of the nation's prosperity. All the things included in your question may flourish, and indeed will flourish, under the paper system, alongside of the deepest degradation of the producers of the wealth.\n\nQ. Do you think it would prove a blessing to the world, were Great Britain to lose her supremacy in manufactures and commerce?\n\nA. Perhaps it would. It would no doubt be good for the world to have a better distribution of these things. Perhaps there is a vast amount of human energy practically lost by this too great concentration.\n\nQ. Why do I give, say, three shillings, or five or seven shillings, silver, as the wages of my day laborer?\n\nA. Because three or five or seven shillings is the average product, as the case may be, of a day's labor at the mines.\n\nQ. Is this really the law which determines the value of our coins?\n\nA. As far as the law can operate, I think it is. I can perceive no other. If every man at the mines earned a hundred dollars a day, and continued so to earn, it is not likely your laborer would take five shillings. Of course value is a relative term; yet I think the cost of production at the mines determines how much silver will be given for so many nails; just as the cost of production of the nails determines how many of these will be given for so much silver.\nGreat fluctuations, however, may occur, and indeed do occur, under the paper system without contravening this law.\n\nQ. Is there no reference here to the quantity of money in existence?\n\nA. That is a question perhaps difficult to determine. I am inclined to think that the quantity of money will keep pace with the increase of population, so that the cost of production at the mines is probably the thing to be taken into consideration. In common phrase, what a man \"gets\" for his labor determines how much money he is able to give for the labor of others. It is also apparent, I think, that the present cost of production will influence the value of what has been produced in past generations. These, however, are but questions of price, and have not much bearing on the great problems of political economy. The supply, the distribution, and the prices of the precious metals, would, in the absence of paper, work in perfect harmony for the good of all.\n\nQ. What do you make, then, of fluctuations in money wages?\n\nA. They must be temporary, or merely local, or brought into play by man's interference with the currency, or with the true laws regulating values. It is patent to all that the fluctuations, in these days, are not caused by changes in the supply of money. I go further, and say, that fluctuations, as now understood, could not occur with money—it would be a physical impossibility.\n\nQ. If all labor is paid one dollar a day this year and two dollars a day next year, have the real returns of labor doubled?\n\nA. No, there is no real change. It is but a nominal increase, an increase of money price, but not of value. The two dollars would go no further than the one. Few merchants take the trouble to understand the distinction between price and value. Value is the amount of human labor embodied in every product of industry, known and realised only in the act of exchange—price is a variable circumstance having reference to the quantity of money for which anything, at a given moment, will exchange, and constantly acted upon by variations in demand and supply.\n\nQ. If labor ceased to work to the extent of five hours each day, what would be the result?\n\nA. Other things being equal, industry would suffer to the extent of losing one half of its earnings.\n\nQ. Suffer because things had doubled in price?\n\nA. No—suffer because one half the commodities only were produced. There would here be a material lessening of value.\n\nQ. Are you opposed to the shortening of the hours of labor?\n\nA. No—I must not be understood as opposed in principle to a shortening of the hours of labor. I think a relaxation in that\ndirection would prove a blessed thing for working men and their families. It will come in its own way under a cash system. Under the paper system it cannot be given; or, if given, it would issue in no profit to working men. The reason of this is embraced in my reply to your previous question.\n\nQ. Are the working men astray, then, in their present movements as to time and hours of work?\n\nA. I do not see that much good, if any, can come to them in that way. The present afflictions of labor are to be sought in the lending of paper currency on interest. Other causes of distress, in presence of this predominant evil, are hardly worth mentioning. The first and principal duty is to enlighten the public mind on this great question. The present labor movements are, however, a very hopeful sign. The farmers of America are beginning to feel the pressure in all its bitterness, though they have not yet struck at the right or principal cause.\n\nQ. Can there be any general rise or fall, in the modern commercial sense, in the value of labor?\n\nA. No, not in the modern sense. But here let me not be misunderstood. The skill that increases production virtually lessens labor, and in that sense, labor, by its own skill, gradually rises in value.\n\nQ. Can there be any general rise or fall in prices?\n\nA. Yes.\n\nQ. Who are most interested in the authenticity and purity of the currency?\n\nA. The laboring population.\n\nQ. Why so?\n\nA. Because there is no value without labor; and God has given the precious metals to the working men with which to exchange the products of their labor.\n\nQ. Do you think it is a philosophical statement to say that demand is the source of value?\n\nA. I hardly think it is. Our wants (for our demands are but our wants) confer no value on what we produce; our labor alone can confer value. Demand and supply will divert or distribute the produce of our labor into particular channels, and these elements will cause prices to slide in either direction along the scale. We demand air just as we demand food, but this demand confers no value on air. If we had to manufacture the air, even though the supply were practically unlimited, the labor would confer a value on it. And though there is enough food for all, just as there is enough air, it is the labor which gives value to the food, just as the absence of labor renders the air valueless. If our food could be picked up everywhere without labor at all, the\ndemand for the food would give no value to it. Gold is a product of labor, and there is a universal demand for it, but it is the labor in production which is the source of its value. It may become cheaper or dearer, but that will not affect the matter. A gradual cessation of demand will cause a gradual cessation of production. When there is no demand at all, production will cease. An increased demand will cause increased production. These are the legitimate effects of demand and supply. Value is eliminated in the act of exchange—there is a contest between two parties to get an equivalent for each other's labor, or for the amount of vital force expended, and this is the law which must ever prevail in the settlement of that value of which labor is the source. The case of a fanciful and extravagant person paying an exorbitant price for some curious article on which he doats, proves only that he pays a great deal more than real value, for there are cases in which a person may either give or receive less or more than value. Probably the great and sudden fluctuations witnessed under the modern system have led to the notion that demand is the source of value. It is in reality a monetary error all through. The fallacy of the thing may also be seen in this way.—Value is, strictly speaking, the relation which subsists between two articles with regard to the amount of human labor contained in each. Valere, to be worth, expresses the idea. Two individuals engaged in barter have each an amount of supply and demand to offer. Wherever there is demand there is at the same moment and on the same side, a certain amount of supply. Each party brings with him his own demand and his own supply. My demand for your ox is not the source of the value of the animal, neither is your demand for my gold the source of the value of the money. If it be held that demand is the source of value, it is equally proper to hold that supply is the source of value. The Saturday Review (London) in a recent issue speaks of \"the grand philosophical doctrine\" of demand being in all cases the cause of value, \"which means simply, that people always buy a thing because, for some reason or other, they want it.\" A poor sort of doctrine, were it true, to be dubbed with such a high sounding phrase; and a doctrine, moreover, which evidently proceeds on the false assumption that demand may be the source of the value of a piece of machinery, but not of the value of the gold for which that machinery is exchanged. Demand and supply are the source of exchange, but never the cause of value. And though it is true that value is a certain relation which one article of industry bears to another, yet it is also true that it is a relation which deals with the amount of force, combined with skill, expended in the production of that article. A surface reasoner may be led astray by the notion that fluctuations in demand and supply exhibit re-\nsults inconsistent with what I have now stated, but a close observer will not fail to perceive that these fluctuations tend rather to confirm the principle set forth—that, at any and every moment, human labor is the only true source of value. Indeed it cannot possibly be otherwise, for all exchange is but labor exchanged for labor. Again, if demand be the source of value, it would be impossible for any one ever to sell anything at a loss, for he would always get full value, whereas we know that commodities are frequently sold below their value or cost of production.\n\nQ. Who should own the currency?\nA. Those who have given full value for it.\n\nQ. Where is its natural place?\nA. In the hands of industry, and among the products of industry.\n\nQ. Is it not in its natural place when it is fastened up in bags and moved about from one bank to another, or when hid away in bank vaults?\nA. It is not.\n\nQ. Should any man, rich or poor, receive money from his fellows, or from the public exchequer, without giving value?\nA. If full value or service is not given, the laws of justice and equity are violated. Any system of contracts by which vast sums are transferred from one to another without service or true labor being given as a full equivalent, must prove subversive of the true principles of commerce. Any property you acquire, except by labor gift, or inheritance, is not yours and never can be yours. Human contracts may set nature's laws at defiance, but they will not render them void; and nature always finds some way to vindicate her violated authority, and sometimes the penalty exacted is terrible indeed, if men would but open their eyes. Property unlawfully earned, or unlawfully protected, lies at the mercy of every element in nature.\n\nQ: Do you believe these laws apply everywhere just the same as in buying a coat or a walking cane?\nA. I believe they apply rigidly in every case. Commerce has laws; and these laws provide that the good of the part shall be the good of the whole, that the good of one shall be the good of all. There is no law in commerce which provides that the gain of one must necessarily be the loss of many. The modern mercantile system, however, subverts this wholesome law.\n\nQ. The further we remove from these laws, do we enter the further upon the field of gambling?\nA. There can be no doubt of it.\n\nQ. Is money, then, the property of labor?\nA. Yes.\nQ. What of the money in bank vaults?\nA. If I get a quantity of money into my coffers from working men on the strength of promises to pay money, I surely cannot call it mine. The money in bank vaults must have been produced by labor and must belong to labor.\n\nQ. What interest have the mercantile classes in the authenticity of the currency?\nA. The interest of those who act as agents, coming between the producer and consumer.\n\nQ. Are producers, merchants, and consumers, all under the same monetary laws?\nA. They are.\n\nQ. Would it be proper to call the mercantile interests secondary to those of industry?\nA. I think it would.\n\nQ. What is the duty and interest of the merchants?\nA. To see that labor or industry is fully protected in the matter of the currency.\n\nQ. Have the merchants done their duty in this respect?\nA. They have signally failed to do so.\n\nQ. Will the mercantile classes suffer also, if the money of industry is taken away and paper placed in its hands?\nA. Of course they will. Bankruptcy, debt, and all sorts of troubles will creep in. Do you think you can destroy the foundation without bringing down what rests on it?\n\nQ. What arguments are generally used by the class as an apology for paper currency?\nA. One notable argument is, that there is not enough money in the world.\n\nQ. How do they get over the alleged difficulty?\nA. By issuing promises to pay that which they say has no existence!\n\nQ. Does this cure the alleged evil?\nA. It cannot but make matters worse.\n\nQ. Is it good reasoning?\nA. It is rickety logic and bad practice combined.\n\nQ. Is this one of the strongholds of the paper men?\nA. Quite a famous stronghold. Such an argument, and the structure reared upon it, are alike a mockery to common sense, worthy of being put upon a par with what is related in Hindoo Cosmogony about an elephant, a tortoise, and a cloud.\n\nQ. Have they faith in such absurdities?\nA. They deem their system quite infallible.\n\nQ. Does the paper really keep the money in circulation which they say is deficient in quantity?\nA. No—it drives out of circulation the very money about which they profess such solicitude.\n\nQ. Whither do they drive it?\n\nA. Into dark vaults or out of the country altogether. What may be left is employed in spurious commerce, not in genuine commerce.\n\nQ. Does this untoward result distress the paper men?\n\nA. I rather think not. Whatever becomes of the people's money, modern governments seem determined that the reign of paper must not be interfered with.\n\nQ. Is the keeping of the currency, or money, in bank vaults, opposed to nature's design in giving a medium of exchange to the world?\n\nA. It is entirely opposed to that design.\n\nQ. What do they do with the money?\n\nA. It is employed in purposes of speculation, or to square bank balances, and such like; and of course a little must be kept in hand for an occasional call or to keep up appearances. There is a balancing between these paper banks at the Clearing House, and the handing from one to the other of a few bags of the people's gold; and this is the sort of work which is now-a-days dignified with the name of commerce! Such work has no real affinity with commerce; and it is just the legitimate laws of commerce threatening at times to exercise their full power which bring it periodically to the verge of ruin.\n\nQ. Is any phrase employed which tends to conceal such wrong doing?\n\nA. Yes.\n\nQ. What is it?\n\nA. \"Convertibility\" and the \"specie basis\" are favorite phrases. They are thought to be fine arguments in the mouth of the statesman, and as used by the merchants themselves. I regret to say that with many good men they appear to be at once the measure of their faith and their reason. \"We can get a little gold from the bank when we need it,\" they say, \"and therefore the system must be all right.\" Such reasoning has there a fit termination; and perhaps all would be well if responsibility ended there too, and were there no cry of distress continually ascending from the victims of such wrong.\n\nQ. Is the people's money thus surreptitiously taken out of their hands?\n\nA. It is.\n\nQ. Is it also taken out of the hands of commerce?\n\nA. It is.\n\nQ. Are those purposes to which it is applied, really commerce?\nA. Such purposes are altogether unworthy of the name of commerce.\n\nQ. Do these economists actually allow that nature has given us the precious metals for the world's exchanges, and yet allege that nature has failed in the supply?\n\nA. That is what they say.\n\nQ. What has deceived them?\n\nA. Probably the enormous and unnecessary increase and expansion of price and payments caused by the paper itself—at all events this confirms them in the deception.\n\nQ. Is it as absurd as to say that nature has not given us a sufficiency of air?\n\nA. It is even more absurd—for it may with truth be alleged that a certain quantity of air is requisite, but it never can be demonstrated that any particular or absolute quantity of money is requisite.\n\nQ. Can you harmonize these statements of the paper men?\n\nA. Impossible. The whole thing is a stupendous fraud upon industry, and tends to the ruin both of the mercantile and industrial classes.\n\nQ. What is paper currency?\n\nA. It is a currency of debt.\n\nQ. Does it really rest upon the so-called \"specie basis?\"\n\nA. Not at all. The currency and the enormous mass of discounted paper, rest upon labor, and upon the facility with which the resources of labor can be used for augmenting the accumulations gathered in by the paper system.\n\nQ. Does it preserve intact the value of commodities?\n\nA. No—it discharges natural value from commodities and substitutes fictitious value in the shape of a debt price.\n\nQ. Are all the commodities of commerce full of this fictitious value?\n\nA. They are all surcharged with it.\n\nQ. Can it ever be paid?\n\nA. It never can.\n\nQ. I presume you mean that in addition to the true or gold price, there is imposed a paper or debt price?\n\nA. That is what I mean. The one has labor, and therefore value; the other has neither.\n\nQ. Does Providence design such a currency for the world?\n\nA. Most certainly not.\n\nQ. What is the secret of its success?\n\nA. Its power of suspending payments.\n\nQ. Continuously, or only occasionally?\n\nA. Continuously.\n\nQ. How does it get this power?\nA. Through popular ignorance, indifference, a misplaced faith, and the absurdities propagated by many writers of note, taken upon trust, and assiduously repeated as occasion offers by careless writers in the public press. People have been so carefully educated all their lives to believe in the system that they take it as true without giving it a thought, and yet the arguments set forth to uphold it are perhaps the silliest that have ever imposed upon the world. A vast system which has hardly a single redeeming element of truth, must, like all superstitions, exercise a degrading influence on the mind. The universal espionage exercised by the paper men, and the dread of giving offence, are darker features which I will simply mention. Those who hang by this paper system are under the necessity of bolstering it up one way or another. Neither must we forget how sensitive is the human mind at the advance of principles, though in the form of axiomatic truths, which threaten to interfere with long cherished sources of accumulation and power.\n\nQ. If the paper system derives its success from a continual suspension of payment, is the condition not one of continual bankruptcy?\n\nA. Of course it is; and in the time of a great crisis the failure to pay only reveals what has been existing all through.\n\nQ. Is there nothing to be said of the good faith or ability to pay involved in the promise?\n\nA. No. The whole system is one of promises, and industry has nothing to say about them so long as it is drained of its earnings by this paper system.\n\nQ. Is the credit system not to be viewed as one of confidence and trust between man and man?\n\nA. No—it is not in that light that the economist must view it. We must look at it as the labor question. It may be all very pleasing to the paper men to contemplate it as a question of trust and confidence (though to them it is really far more one of security for advances made) but in that respect it is a question of no importance at all to industry or true commerce.\n\nQ. Does the fact of a bank being very wealthy confer value on its notes?\n\nA. No—all the coin in Christendom does not confer the value of a single cent on a dollar bill. People may take the wealth as security that the bill may, in some way or other, be eventually redeemed, and so far a certain amount of confidence may be inspired. The strain on labor will not be lessened in the slightest degree. All sorts of bank issues, so long as they float, are but promises to pay money, and all exercise the like pressure on industry.\n\nQ. Am I in reality paid in any respect more effectually by the \"promise\" of a wealthy man than by the \"promise\" of a poor man?\nA. Evidently not. So far the two promises are at par.\n\nQ. If modern paper banking be a system of continual suspension of payment, in what respect does it differ from the \"suspension of payment\" by an ordinary trader?\n\nA. It does not differ so far as suspension of payment is concerned—it differs in this respect, that it is infinitely more mischievous. Paper banking lives and thrives by that suspension of payment which it is so forward to condemn in the person of some unfortunate merchant who happens to go to the wall. What a system of tyranny for the merchants to support!\n\nQ. Does paper pay for a purchase or sale?\n\nA. No, never.\n\nQ. Why not?\n\nA. Because it is only a promise to pay and not payment. It cannot pay for a purchase and be at the same time an evidence of debt. It may transfer goods like any counterfeit, but it cannot pay any more than a counterfeit can. Nature has an unceasing conflict with the commercial world on this point. We may say we have paid with bank bills, or we may imagine we have paid; but it is just because we have not paid that nature exercises her authority at times with such vehemence as to threaten to shake the entire social fabric to pieces. The great laws are founded on what is real, not on what is imaginary, and much less on what is deceptive.\n\nQ. What is required to complete the exchange?\n\nA. Money.\n\nQ. Is there enough money in the world?\n\nA. Yes.\n\nQ. Is the supply ample?\n\nA. There is plenty of the precious metals in the world to perform, many times over, all the necessary exchanges of the human family.\n\nQ. What of the enormous daily payments of the city of London?\n\nA. These are in reality the transactions of many cities and of many lands, multiplied in many ways, and gathered into one centre, and a large proportion the fruit of gambling transactions. And the paper system not only unnecessarily repeats transactions, but forces up prices far beyond the natural limits. There is plenty of gold and silver in the world to settle all that is really good in these transactions, and there is vigor enough in the cash system to decentralise the whole.\n\nQ. What do you call the natural limits?\n\nA. The limits fixed, regulated, restrained, by the great law of value for value—that is, value in labor resting in the money as well as in the thing exchanged.\n\nQ. Is any particular quantity of money requisite for commerce?\nA. No—price will regulate itself according to the quantity of money.\n\nQ. Can you place this economic truth before us in a very simple way?\n\nA. I think I can. If there were ten hats in the world and ten dollars with which to buy these hats, each hat would be worth a dollar—if there were twenty hats and ten dollars, each hat would be worth half a dollar, or each dollar worth two hats.\n\nQ. Can we ever unravel the labor question by looking at it as one of so much money given for so much service?\n\nA. O no—you will not understand it in that way.\n\nQ. Has paper currency caused a false estimate of the amount of the world's exchanges?\n\nA. It has. By the system of paper repetition and accommodation, speculation, and concentration of payment, so called, in one or two leading localities, the transactions of commerce are needlessly multiplied ten times over.\n\nQ. Has nature designed that the exchanges of hundreds or thousands of cities and towns should be thus multiplied and concentrated for payment in some distant locality?\n\nA. Most certainly not.\n\nQ. What is the result?\n\nA. One obvious result is that it drains towards these centres an amount of wealth and luxury for which they have never toiled. It is the interest of these great centres to have cities, towns, and corporations go into debt, so that bonds may be manipulated and enormous profits made. But labor has to pay it all.\n\nQ. Is all this the fruit of the paper or no money system?\n\nA. It is.\n\nQ. Does the whole system thus become more perilous?\n\nA. There is a \"must be\" in the case. There is a reign of law terrible to contemplate. The things we pervert are our appointed judges. The arrangements of Providence are all equitable. The end of this system is inevitable, and one thing we may be sure of, it will not die a peaceful death.\n\nQ. Is there a tendency in this system to foster cities into an unnatural condition of growth?\n\nA. The tendency is to foster large cities at the expense of the country. Population is gathered into a few great centres to the manifest disadvantage of our best interests. So far, the cities of the nations must fall if ever a better condition of things is to come round.\n\nQ. Why should paper drive away our gold?\n\nA. In obedience to a natural law—the worthless or cheaper currency always driving out the more valuable.\nQ. Has the paper currency of the United States, in these later years, acted prejudicially on their foreign trade?\nA. It has.\nQ. In what manner?\nA. By increasing prices to such an extent that it is far more profitable to import than to export, and thus the natural equivalence of foreign commerce is destroyed. The general effects are obvious, even under the existence of legal tenders. Do not suppose that men's proclamations of bits of paper as legal tenders destroy God's monetary laws. No thoughtful person can fail to perceive the deep injury which has been inflicted on the commerce and industry of the United States through the destruction of their money and the spread of paper banks over the land, a fact which conveys a terrible rebuke to those who would endeavor to instil into the minds of the people the idea that nature has not intended gold and silver to be our media of exchange. What an era of prosperity will dawn on that nation when it suppresses this paper banking! Other things being equal, the nation using a paper currency by the loan method would never be able to compete with the nation using a metallic or value currency free of loans. In destroying their currency, the United States have destroyed their mercantile marine. Here, where other nations could directly compete, they have been all but ruined.\n\nQ. Can you in few words, state the reason at the bottom of this?\nA. That which operates detrimentally in the end is, that the industry of the nation with the paper gets only half paid for its labor. A healthy competition is therefore impossible.\n\nQ. Does not the case of California controvert these ideas?\nA. No more than would the case of a few New Yorkers in the city of New York, or of a few people in the city of London, who might choose to deal exclusively in gold.\n\nQ. Is not the phrase \"natural equivalence of foreign commerce,\" just used, a vague expression?\nA. Far from it. The relative value of the industry of the nations must ever be the true factor.\n\nQ. Is it quite certain that by this paper system the working men are lending their means, or their labor, to the banks without any return? I repeat the question because it seems to be one of transcendant importance to industry.\nA. It is beyond all doubt that such must be the case. If a working man, instead of getting his wages as due, takes a promise to pay him his wages, it needs no demonstration to shew that he is lending his means. The thing is quite plain. He has not got his money—his money is due—the other is trading upon it. It is\nupon the industry of the working man that the whole system is built.\n\nQ. In this case, who pays for the loan?\n\nA. The working man, by this paper lending, both lends his means and pays at the same time the interest on the loan, for there is no value without labor and nothing but labor pays for interest. Let us try and grasp this subject. The terrible nature of the pressure now exercised upon industry may to some extent be seen when we consider that if a hard currency were all lent on interest to industry, working people would lose only one half of their earnings; but that, by this paper system they not only pay interest, but pay it on THEIR OWN earnings, and are thus constantly crushed down by a sort of compound pressure. The paper men thus fatten at once off the capital and daily toil of industry. There cannot be a doubt that by far the greater part of the accumulating wealth of the world is the unrequited daily toil of working men. I speak deliberately when I say that it is not possible to conceive of any system by which society could be more thoroughly demoralized or industry more effectually crushed. It is the most dreadful form of oppression which has ever been inflicted on the sons of toil, just as, from the plausible character of its arguments, it is the most dangerous. Both the capital and interest are taken out of the hand of industry; and, alas! for labor, when it is thus compelled to furnish the means of its own destruction. With these facts before us can we wonder at that which has been so long an enigma—the producers of the world's wealth doomed to a state of constant poverty.\n\nQ. But are not the paper notes secured by government?\n\nA. That is a matter, even were it true, of little or no concern to the working men, so long as they have to pay for all this waste and drain on their resources.\n\nQ. If these things be true, must not this system be one of great wickedness and deception?\n\nA. It must. And perhaps the most marvellous thing about it is the extent to which it has deceived the nations. To speak plainly, it is a system of \"wicked devices to destroy the poor with lying words;\" and it has stamped its mark as deeply in the \"forehead\" of intelligence as in the \"right hand\" of labor. James v. 4, is true of this system to the letter. Rev. xiii. 16, 17.\n\nQ. Can this be the reason why it has been so often shaken almost to pieces?\n\nA. No doubt it is. Though the \"deadly wound\" has been often healed, the end must come.\n\nQ. Is it right to make the real estate of a nation represent or become security for its currency?\n\nA. It is wrong to do so. Money stands on its own right and\nneeds no security. And the security of paper, when really put to the test, has generally proved fallacious. In fact, nothing can ever supply the place of gold and silver. For these, a substitute never can be found. If we drive away our gold, neither houses nor lands can ever supply its place.\n\nQ. But may not a working man, for example, go to the Bank of England, and draw out 10 gold sovereigns for his two five pound notes?\n\nA. He may, but he would be nothing the better for it.\n\nQ. Why not?\n\nA. Because, under the paper system, an occasional exchange like this would not bring him back his lost wages, seeing the gold would go no further than the paper in payment.\n\nQ. What are bank dividends?\n\nA. The sweat and toil of poor working men. This is the only true definition.\n\nQ. Are not bills of exchange necessary to commerce?\n\nA. They are entirely unnecessary.\n\nQ. What are the usual pleas for bills of exchange?\n\nA. That they are more economical than to transmit money—that there is less risk—that they are more convenient, and so forth.\n\nQ. Is there any truth in these statements?\n\nA. Not the shadow of truth.\n\nQ. Is there more risk of non-payment with bills of exchange than with specie?\n\nA. Aye, a hundred times more.\n\nQ. Has the loss by dishonored bills been great?\n\nA. Hundreds of millions have been thus lost.\n\nQ. But is there not less risk of loss in sending paper than in sending money?\n\nA. That is as pointless a question as to ask if there would be any risk of my being drowned in the sea, if I never embarked on it.\n\nQ. Would not the labor of paying money be greater?\n\nA. The labor would be so trifling that commerce would not even reckon it.\n\nQ. Which is the most costly way?\n\nA. The bills are far more costly than the money—shall I say, several hundred times more costly.\n\nQ. Would the freight be heavy?\n\nA. About three hundred thousand dollars in standard gold coin can be stowed in a box a foot square.\n\nQ. In the city where you dwell, what does it, on the average, cost the merchants to settle for this sum in London by the bill system?\n\nA. At least six thousand dollars.\nQ. Suppose all the merchants could get the money to send, what would it cost?\nA. A twenty dollar gold piece should be ample remuneration.\n\nQ. Have you calculated what the bill system costs?\nA. It is beyond calculation. The cost is enormous. The money lost to labor in this way would soon provide a comfortable dwelling for every working man in America. We have, in recent years, seen what a few individuals have reaped, in enormous fortunes, out of the system.\n\nQ. Who gets the benefit from the bills?\nA. The paper men.\n\nQ. Who pays?\nA. The working men.\n\nQ. Are bills of exchange a necessary part of the paper system?\nA. They are necessary to a full paper system and the complement thereof, so as to keep money entirely out of trade, or to banish it from the great highways of commerce, except in so far as its transmission may benefit speculation or the banking system.\n\nQ. Is there a needless market created by bills of exchange?\nA. Yes.\n\nQ. What is it?\nA. The bill market.\n\nQ. Is it a troublesome market?\nA. Very often it is both a troublesome and dangerous market.\n\nQ. Does the bill system powerfully aid the paper system in throwing the currency of the people into the hands of money gamblers?\nA. It does. And the paper system is the means by which not only the people's money is gambled away, but also the people's food.\n\nQ. Is there a needless class brought into existence by it?\nA. Yes.\n\nQ. Who are they?\nA. The bill brokers.\n\nQ. Must they be paid?\nA. Of course they must. There is a vast army of non-producers continually hanging on the skirts of this great system.\n\nQ. Who pays them?\nA. The working men; or, in other words, all who render genuine service to society.\n\nQ. Do these bills of exchange propagate commercial panics?\nA. They do to a very dangerous extent.\n\nQ. Is there a natural par of exchange?\nA. Yes—the equivalence or relative value of the coinages of the different nations is the natural par of exchange.\nQ. Does an unnatural par of exchange now prevail?\nA. Yes—to the natural par there is added by the paper system an unnatural one, based on the preponderating influence of debt, and therefore unjust to labor in every true settlement of value.\n\nQ. What if rates of exchange are at par, or below par in particular localities?\nA. That of course does not affect the merits of the question.\n\nQ. Is it safe to draw any vital comparison between the cost of bills of exchange and the cost of transmission of the money, as if the former cost could never exceed, when bills are at a premium, the cost of transmission?\nA. It would not be safe to draw such a comparison.\n\nQ. Why not? Is not this one of the strongest reasons put forth for the bills?\nA. Because, between some of the leading centres, and in view of the additional opportunities presented for further gain (by providing, for example, a vast mass of additional paper for discount) it is quite possible that the bills, so far as the matter of transmission only is concerned, may occasionally be cheaper, the labor involved being no more than a stroke of the pen.\n\nQ. Suppose now, that by this system, the money were really paid on presentation or maturity of the bill of exchange, would it be cheaper or less troublesome than sending money?\nA. A in Glasgow owes B in London £100. He sends off the money by express or rail, and it is done with. By the bill system, he counts the money and takes it to C in Glasgow to whom D in London owes £100. C has also to count over the money. He writes out a bill on D, and hands it to A, who writes a letter and sends the bill to London. D has, again, to count over £100 and to send it by messenger to B: To finish the roundabout transaction, B has also to count over the £100 to see that he has got paid in full. B and C have each got paid, but certainly not by a method less troublesome than dealing directly with those who have bought from them. And if we reckon the trouble connected with the constant negotiation of these bills, the advantage at any rate will not, as a matter of \"trouble,\" be on the side of the bills of exchange.\n\nQ. But are you not aware of the argument sometimes set forth by the merchants—that they could not be troubled with counting money?\nA. I am aware of it. Perhaps you can find an answer to such objectors, I cannot. It is the argument, if argument it can be called, of a paper man who has dealt all his life in paper, who sees nothing but paper, who is determined to know nothing but paper, and who is utterly careless as to the effects of paper even on his own profession.\nQ. Under a money system, would we ever hear such a statement?\nA. No, never.\n\nQ. Suppose that I send a hundred dollar bank note from New York to Chicago, is not that cheaper than sending gold?\nA. Please observe now. Do you not perceive that you are really asking me whether it is cheaper to send the money, or a promise to pay the money? The fact is that you are asking me whether it is cheaper or better to send the money, or not to send the money, to pay the money or not to pay the money! Of course the system provides you with a so-called means of payment in the shape of a hundred dollar bill or a \"promise to pay\" a hundred dollars; but, so far as you are a working man, it does so entirely at your expense and wholly to your own loss; and does so, moreover, by the destruction of the very first principle of barter, that the thing bought must be paid for.\n\nQ. But are not most of these arguments in favor of the bill system very trifling?\nA. I think such arguments in favor of the bill system very trifling indeed.\n\nQ. What are in reality the facts of the case which ought to concern us?\nA. The real facts of the case are—that the bill system is but an extension of the paper system, and that money is not paid—that nobody knows better than the merchants themselves that the system would not even let them get the money to transmit if they wished—that the money of commerce is swept entirely out of its hands, and that enormous fortunes are made out of foreign bills—that a complicated and intricate system is made to take the place of that which is simple in the extreme—that the natural supply of the precious metals to particular nations is destroyed—that labor has to pay enormous sums for all these complicated transactions—and that merchants themselves have at times to lose very heavily out of legitimate profits when exchange is unfavorable, and are compelled to submit to the degradation of seeing the very money which nature has provided for their use taken out of their hands.\n\nQ. Suppose now that the paper men alter their tactics and say that money is not needed at all, and that bills of exchange are best?\nA. I would be willing, then, to meet them on the question of cost. But the paper men would first have to be consistent with their own principles. In the first place, they would require to arrest the gold at the very mine—in the second place, they would have to cease transmitting gold for their own profit or convenience—in the third place, they would have to cease taking such a useless and worthless article out of the people's hands—in the fourth place,\nthey would have to cease promising to pay it—in the fifth place, they would have to show why they, the paper men, should be entitled to receive anything from labor for the circulation of bits of paper—and in the last place, they would have to accomplish an impossibility, namely, to root out of the human mind the conviction of the value and superiority of the precious metals, a conviction which the paper men themselves are among the first to shew has full possession of their own minds when a panic is running its course.\n\nQ. Do you come, then, to the conclusion that nothing can ever be so cheap and advantageous to industry as settling foreign transactions with money?\n\nA. That is the inevitable conclusion. Schemes to rid us of our money may seem very plausible, but they will ever turn out very costly. The destruction of the money which God has given us for our exchanges will issue in a sort of spurious barter far more hurtful to real industry than the ancient system, for by that system a person might enjoy some of the luxuries of life, but by \"the no money system\" working men have the hardest struggle to obtain even the necessaries of life. I say working men—for I always feel that political economy, like Saint Paul of old, has a very short method with those who do not work—it simply puts them beyond its pale.\n\nQ. Is there such a thing as a balance of trade?\n\nA. By the laws of nature there is no such thing. True exchange leaves no \"balance\" as popularly understood.\n\nQ. What about the oft repeated quotations of fluctuations in the money market, so called?\n\nA. There is really little or no money in that market nowadays, its fluctuations being contingent upon a consideration foreign to the subject.\n\nQ. What is that consideration?\n\nA. Indebtedness.\n\nQ. Under a cash system, would we have what is now popularly known as a \"money market?\"\n\nA. No.\n\nQ. Do you hold that under that system, fluctuations could never occur to injure any one's business?\n\nA. That is what I hold.\n\nQ. Is the supply of currency, under the paper system, contingent upon discounts?\n\nA. Yes—the world's supply of its currency may be said to be almost entirely dependant on that contingency. The truth is, our peace, happiness and prosperity, and even our liberties, are at the mercy of a few individuals closeted in bank parlors.\n\nQ. Does the supply sometimes cease?\nA. In seasons of \"panics\" it does to a great extent.\n\nQ. Can there ever be a glut of money?\n\nA. No.\n\nQ. Can there ever be an \"inflation\" of money?\n\nA. No.\n\nQ. Can there ever be a scarcity of money?\n\nA. No.\n\nQ. These things occur with paper, with promises to pay money, do they not?\n\nA. Yes—it is quite natural that they should.\n\nQ. Under a cash system, where would money always be found?\n\nA. Where there were goods to exchange.\n\nQ. Would a cash or money system cause steady prices?\n\nA. Yes.\n\nQ. Would it cause a steady demand for and supply of goods?\n\nA. Yes.\n\nQ. Does the credit or paper system cause the reverse of all these?\n\nA. Yes—and steadiness in these things is very desirable. The more fluctuations, the more speculation and gambling.\n\nQ. Are merchants, in the apprehensions they sometimes express as to the operation of the cash system, actuated by idle fears?\n\nA. They are frightened by the merest bugbear.\n\nQ. Are they really afraid of the cash system?\n\nA. They are bound by the paper system hand and foot; it rules them as with a rod of iron; and they dare hardly peep or mutter. And yet the cash system is their best friend.\n\nQ. What do you say about capital?\n\nA. That word confuses many minds. Paper men have endless disquisitions about it. I say this much, that the system of paper, with its faithful ally, debt, has given birth to the modern idea and views of capital—the men who, by this paper system, are able to accumulate the largest returns from labor, being called Capitalists.\n\nQ. Shall we ever arrive at any truthful conclusion by placing capital on one side and labor on the other, and viewing them as antagonistic forces?\n\nA. You never will.\n\nQ. Do we take the correct view, then, when we say that capital is the produce and property of labor?\n\nA. Of course you do.\n\nQ. What is the true relation of money capital to labor?\n\nA. That of a medium of exchange.\n\nQ. Is there no other relation?\n\nA. None whatever.\nQ. What is the true relation of all other capital, so called, to labor?\nA. That of an aid to industry.\nQ. Is it simply then a question of labor for labor?\nA. Nothing more than a question of labor for labor; or what is perhaps a better phrase, service for service.\nQ. Whether, then, are the tools (capital), the money, or the labor, the source of value and of profit?\nA. Industry alone is the source of value and of profit—other things are but aids to industry.\nQ. Is there any distinction, so far as the laws of political economy are concerned, between producers and consumers?\nA. There is no radical distinction. In the view of political economy, every producer is a consumer, and every consumer a producer. It is something like supply and demand: they co-exist in the same person. The farmer who consumes the tea of China or the coffee of Brazil is consuming the produce of his own labor as much as when he consumes the potatoes or corn raised on his own ground.\nQ. Should those who labor own all the produce of labor?\nA. Except to a prejudiced mind, the mere statement of such a truth will carry conviction with it.\nQ. With this truth before us, can we conceive of a more subtle or effective method of ruining industry than to take away the money in which it is paid and for which it labors, and to circulate paper promises to pay money, thus causing industry to lose its money, and to pay interest on the paper?\nA. I do not suppose we can. It reveals its paternity. The subtle enemy of our race has taken this sure method of suppressing education and intelligence among the toiling masses. I rejoice in the thought that such a system is destined to perish amidst the loathing and contempt of all good men; and blessed will be the day, not only for the masses in civilized lands but also for the millions yet in heathen darkness, when this long reign of oppression comes to an end.\nQ. What should be the profit of capital, so called?\nA. Suppose we submit this general rule that the man with the money must not make more out of the man with the labor, than the man with the labor makes out of the man with the money.\nQ. If I employ forty thousand dollars in legitimate business, should I make more than is made by one of my employees?\nA. For the sake of argument, let us say that you should make much more.\nQ. Why so?\nA. Will it satisfy you if I say that you are virtually employing\nfar more labor, or giving more service, your forty thousand dollars being so much concreted labor?\n\nQ. My mind is not satisfied yet on this point. Should I get more reward or profit simply because I employ forty thousand gold dollars?\n\nA. Your question awakens subtle thoughts and must be faced. I think we cannot but come to the conclusion that nature does not provide any reward for us simply because we employ so much gold, for gold is a completed product of labor, and can only be used in the exchange of human services. And I think we are on the right track if our thoughts lead us to the conclusion that we cannot get a reward or profit except for the labor we bestow, whatever we may do with our forty thousand dollars, or with the goods bought with the money. It does seem as if we were forced to the conclusion that money only preserves, in a secure form, our labor or the fruits of our labor, but never increases the value of that labor. For, were it otherwise, we would have to believe that the world is paid for something else than human service, which would be absurd. But this question may come up again before we get through with our discussion.\n\nQ. Is there any law in nature, or in the principles of exchange, which provides a man with a profit because he has \"employed,\" as it is termed, the labor of another man?\n\nA. I can find none. The law is obvious which provides him a profit because he exchanges his own labor with the labor of another, not because he \"employs\" another.\n\nQ. Would it be correct to speak of the profits of the laboring man as well as of the profits of capital?\n\nA. All is but the profit of labor. If money at interest doubles itself in about twelve years, and if labor which made all this money does not do the same, there is something seriously wrong.\n\nQ. Is it a natural law that money should double itself every ten or twelve years?\n\nA. It is not. The notion about money doubling itself is perfectly absurd. It is all a question of human labor; and, in a general way and as affecting humanity at large, of the increasing happiness and comfort brought to our race by that labor. The mere money, being a completed product of labor, never in itself increases in value. Viewed as a piece of money, it is emphatically labor at rest; viewed as a medium of exchange, it is labor in intense activity and yet an activity for which nobody can either pay or receive. The Government which, by law, imposes a profit on the loan of money, and hence a profit on the circulation of money, is destroying the very nature of money itself, and thwarting the bene-\nficient designs manifest in providing industry with such a medium of exchange.\n\nQ. Is it the case that any increase or decrease in the exchangeable power of money, must come from causes outside of itself?\n\nA. Yes, that is the case; or by the addition of more money.\n\nQ. Under a money system, would these changes come slowly round?\n\nA. Very gradually indeed, so much so that nobody would be injured by fluctuations.\n\nQ. Is capital lent on interest, an unnatural employment?\n\nA. Yes.\n\nQ. Has it built up large factories wherein two or three men generally reap as much as several hundreds?\n\nA. Yes, the extensive modern systems of wages and rents are but natural outgrowths of the vast accumulations of the paper or no money system. The idea of mere money bringing in a certain return every year has permeated all society, has been all but universally accepted as in accordance with nature's laws, and has corrupted every form of industrial and mercantile life.\n\nQ. Under the cash system would the machinery, or those who toiled at the machinery, get the largest returns?\n\nA. The paper and interest system throws the reward and the property itself into few hands. Under the cash system the working men would come to own the machinery. Whatever men may think about it, you must observe that the laws of political economy make no distinction between the toiler and the tools he holds in his hands, as if there were one reward for the toiler and another for his tools. And though men will reap a richer reward in proportion as their tools advance in finish and fitness, yet, observe, it is but one reward to all who toil, and can never afford to be divided with those who do not toil. Therefore, if the tools or the machinery have fallen into the hands of others than the workmen themselves, it will be to the loss and suffering of labor. If, as I anticipate, there is no known law which provides a profit for you and a separate profit for your plough, you may depend upon it that nature is a generous overseer when she refuses to provide a profit to the man into whose hands your plough may have fallen, unless it be for the produce of his own toil.\n\nQ. Then, has nature no way of remunerating the tools, the machinery, or the products of industry?\n\nA. Yes, a sure and certain way. She awards to you, through the price obtained for the further products of your industry, a return commensurate with your labor, your skill and the fitness of your machinery to produce something better and quicker than can be produced by any of your fellow workmen. And this law is as\ngood for one working singly, as for a multitude in co-partnership. Still, it is a reward for you, not for your machinery.\n\nQ. Is this the only way I can benefit from my machinery?\n\nA. Yes, the only way. With the same amount of labor, you must by your skill produce something in excess of or better than your fellows, and nature has her larger reward for you.\n\nQ. Are we on a false foundation, then, when we say that commerce has two rewards, one for the machinery and the other for the workmen?\n\nA. I think we are. Nature proceeds on the assumption that the workman produces with his own hands and with his own tools, the varied products of industry.\n\nQ. If, then, machinery is rewarded simply as machinery, will it be oppressive to labor?\n\nA. It will.\n\nQ. May not the reward be divided, in some fair proportion, between the working men and the machinery?\n\nA. Under the modern system, by which the machinery, as property, has been divorced from the working men, it is not and cannot be so divided. The reward which would otherwise fall to the working men falls into the hands of the capitalists, and industry itself has to content itself with a bare pittance. Hence, all our advances in mechanical science have failed appreciably to effect for the better the condition of labor.\n\nQ. Have you anything further to say of these laws which you have now set forth, and which are so different to what we have been taught?\n\nA. I have this to say—that they command my profound respect, on the ground that they are so perfectly equitable, and that they provide the only true incentive to man to march forward in the path of discovery. They provide also that genius shall not lie at the mercy of the mere monied man; but that those who toil, and invent, and bless their fellows by their discoveries, shall receive a legitimate and commensurate reward. What I have just set forth is worthy of our closest investigation; because I hold that these laws secure that the property, the machinery, shall remain where it is produced, in the possession of the men of industry and skill, and shall not fall into the hands of mere money gatherers.\n\nQ. Must we regard money, not only as a medium of exchange, but as containing, within itself, the labor exchanged?\n\nA. You will fall into error if you do not so regard it. It is because it contains, in such small bulk, the labor of our race, that it is such an admirable medium of exchange. The economists, in their intense desire for paper, have actually gone so far as to repudiate gold on the ground of laboriousness in moving it, perhaps on\nthe whole the most absurd of all the absurdities put in circulation by the paper school.\n\nQ. Had the employers always employed their own means and paid their men in money, instead of putting them off with promises, would we have seen a different state of things?\n\nA. We would undoubtedly have seen a far happier state of things.\n\nQ. Would it be correct to say that without money we could not raise our produce or manufacture our goods?\n\nA. It would be incorrect to say so. What would be correct to say in such a connection is, that without money we could not so readily exchange our produce or our goods. Of course when the industrial classes come to lose both their money and the fruits of their toil, mere money, or rather what passes as money, comes to have the appearance of being the instrument by which all industry is set in motion and sustained. It is only shallow thinkers, however, who are led so far astray by such appearances as to consider them evidences of the natural condition of things.\n\nQ. Do you think the men who toil with their hands should get less than those who toil with their brains?\n\nA. Some think they should.\n\nQ. What do you think?\n\nA. I think that the man who toils all day without a murmur under the scorching sun, providing perhaps the very food which sustains life, should get more than those who are paid large sums for the most trifling services.\n\nQ. What is the rule under modern governments and in modern society?\n\nA. Generally the most trifling duties are overpaid and important services of industry underpaid. Some people even do not hesitate to give and others to accept very large annual sums out of the public revenue, for no duties at all, the money of course, being taken out of the hand of toil. Let us not forget that the public exchequer can only be filled or replenished by the laboring man.\n\nQ. If things were left to nature's laws, would the true workers get more?\n\nA. Aye, far more.\n\nQ. By what law?\n\nA. By the great reciprocal law of value for value.\n\nQ. How do we corrupt that law?\n\nA. By fabricating a currency without labor, or by corrupting or destroying the true medium of exchange. The immediate result is of course to destroy the law of value for value, and thus to degrade labor.\n\nQ. What about the great landed estates of Britain?\nA. I would leave all to nature's own wise and beneficent laws. These laws would soon impose on overgrown estates, whether in land or money, a proper sub-division.\n\nQ. What do you say of an idea of the brain by which some great undertaking is accomplished for the good of society or of commerce?\n\nA. I must just put it in the same category with my idea about going to do a day's work. We do not, as a general thing, pay men with ideas. If the idea is to build a railway bridge, for example, the man with the brains must give his labor in money to the men with strength of frame in return for their labor; so that we perceive the law of service for service to be a universal law. Ideas of the brain, if they prove a blessing to mankind, do not find their chief satisfaction in a money price, and sometimes the best ideas can neither be priced nor paid. Here we are just touching on the borders of speculation; and as I wish to avoid such, I will merely state, on this point, that the ideas of the brain will find their healthy and natural remuneration, economically considered, in the value of the products which are, in the hands of industry, the fruits of these ideas. Reason as we may, these questions always bring us up in direct contact with the working man.\n\nQ. By the paper system what do working men pay?\n\nA. They pay profits to employers, and interest to paper lenders all out of the same wages.\n\nQ. What! is it not a money lending system?\n\nA. No, it is a paper lending system. It would present very different features were it a money lending system.\n\nQ. Under a cash system what would industry gain?\n\nA. It would cease to pay the vast sums taken from it as interest (or in other words, these sums would go to industry); it would no doubt obtain a full share in those gains now accumulated by employers, and it would benefit immensely in cheapened goods and increased production, by a proper and healthy distribution of labor. Time only will show what blessings will be brought to our race by the cash system.\n\nQ. What do you mean by a proper distribution of labor?\n\nA. I mean the natural laws of demand and supply, as regards that distribution, in full operation, unprejudiced by the demoralizing presence of a currency without value and fabricated without labor.\n\nQ. Will the present system of days wages disappear?\n\nA. It will no doubt undergo a great change for the better. The destruction of the paper and interest system must issue in the reorganisation of society. Time, in its progress, must unfold many things to us which are now unknown.\nQ. Does political economy teach you any fundamental truth in this connection?\n\nA. Political economy, it has been observed, might almost be defined as the science of moving things. I have been taught by this science that all men are free—that all have equal rights—that every man must receive the full produce of his own toil—that no man shall receive of the toil of others without rendering a full equivalent—and that he who applies the most effective force in moving things, whether it be by simple strength of arm, or backed by skill and intelligence, will certainly reap the largest rewards—also, that the closer labor can be equalised in its value, utility, and rewards, the better will it be for humanity. It may be a homely thought, but I think it will be found that we are all paid simply for moving things. But over and above all this, I am free to confess that these questions have gained an ascendancy in my mind, not because they embrace mere elements of material advancement, but because their proper solution will satisfy some of the deepest yearnings of the human heart, and prove a secure guarantee for the true progress and brotherhood of man. I cannot believe that life is a race whose rewards are ever to be reserved for the chosen few. Literature with its honors, travel with its pleasure, society with its refinement, home with its joys, are destined to become the true inheritance of working men.\n\nQ. Has paper currency stimulated commerce?\n\nA. It has, in a most unhealthy way.\n\nQ. Can there be too much commerce?\n\nA. Of course there can.\n\nQ. How is that?\n\nA. Because industry produces wealth, commerce only transfers it. Unnecessary transfers, therefore, only serve to increase charges to the producer and consumer.\n\nQ. What is the healthy limit of commerce?\n\nA. To convey, as expeditiously as possible, the products of industry from the producer to the consumer—to avoid speculation—and to have as few transactions as possible over the same article.\n\nQ. If a large quantity of grain is produced from a farm, and if it gets into the hands of half a dozen speculators before reaching the consumers, and if each of these speculators makes a profit out of it, who is it that is really supporting the half dozen?\n\nA. The producer and consumer between them. It is better, perhaps, to view everything from the point of production, for consumption extinguishes the value which production brings forth, and all speculative purchases accordingly become a tax on the producers,\nor in other words on labor. I think it will be found that interest and all sorts of taxes are virtually taken out of labor, either by a reduction of wages, or an enhancement of what would otherwise be the true price of all articles manufactured, or by a reduction in price of all agricultural produce raised. But in whatever way it is done, whether by enhancement of price to the purchaser, by reduction of wages, or by reduction of price to the producer, it must be a virtual reduction of the just returns of labor.\n\nQ. Is the mere multiplication of merchants, then, an evil?\n\nA. It seems so. Better to have plenty at work in the first instance. We cannot have too many workers, but we may have too many merchants.\n\nQ. As to enhancement or reduction of price, can you trace any distinction in the way the pressure is exercised on industry?\n\nA. I think we can perceive a certain distinction. In the case of articles manufactured by hired labor, the wages will be reduced; in the case of agricultural produce raised by the farmers (that is, by their own toil) the prices of their produce will be reduced. If the farmers generally hire in labor, then the laborers will suffer in their wages. But it is also obvious that the farmers who toil (as is generally the case in America) as well as their few hired men, will both suffer, the farmers in the reduction of the price of their produce, and the hired men in the reduction of their wages. The implements of husbandry required by the farmers may also be improperly advanced in price, in many instances even far beyond the true cost of production, so that the farmers, as is now the case throughout the West, lose heavily both on their outgoings and incomings, and between the two it is barely possible for them to live.\n\nQ. Am I right in stating that I perceive, in the discussion of these questions, we must get to the foundation of things?\n\nA. Yes—if you begin to ramble through the garrets, you may as well go off to the clouds at once. We are in contact with mighty problems affecting the weal and the destiny of our race, and which require for their elucidation not only intense conviction, but the exercise of the most calm and deliberate judgment. You must leave the din and the clamour of the street, and come and stand \"on the sand of the sea,\" if you wish to feel the ennobling influence of faith in great principles. Momentous questions affecting human happiness are best understood on that solitary seashore. If we are to learn we must aim at being simply and severely true. And if there are any questions of more than ordinary interest to the human family which require to be thoroughly thought out, the present questions are of the number. We are as yet only on the threshold of truth.\nQ. Has the credit or paper system actually lessened production?\nA. There cannot be a doubt on that point.\n\nQ. In what way?\nA. By reducing at once the rewards, the condition, and the effective force of labor, and by attracting too many to mercantile life.\n\nQ. Does money keep labor at work, or does labor keep money at work?\nA. I think I will leave that question to your own meditation.\n\nQ. Does money, by any natural law, support labor?\nA. That I will also leave to your own reflection. You may have to make your way through what are termed \"economical paradoxes.\"\n\nQ. Are articles of merchandise the produce of money?\nA. No.\n\nQ. Of what are they the produce?\nA. Of labor.\n\nQ. Is money itself the produce of labor?\nA. It is.\n\nQ. Are you sure of this?\nA. Articles of trade can be no more the produce of money than labor can be the produce of the coat on your back. Any reflecting man should be able to perceive at once whether labor is the produce of money, or money the produce of labor. A thoughtless person may readily fall into the error of supposing that in buying a suit of clothes, they are the produce of the money he pays for them. If such were the case, it would also be proper to suppose that in exchanging a horse for a cow, the cow is the produce of the horse, and the horse the produce of the cow.\n\nQ. Is this another popular fallacy which requires to be corrected?\nA. It is. I have but recently risen from the perusal of an article, bearing the name of one eminent in the world of letters, replete with fallacies on this point.\n\nQ. Does money remunerate labor?\nA. No more than labor remunerates money.\n\nQ. Must we regard money, from the moment it is coined, as unproductive labor?\nA. You have put a most interesting question. I will only throw out a few hints as a clue to further thought on both sides. Any one who has given much attention to these subjects must be conscious of economic difficulties arising in his mind when he speaks of profit from the mere employment of money. Properly speaking, we may regard money as labor at rest, at least so far as production\nis concerned. So far as exchange is concerned, it is labor in great activity in an indirect way because of the amount of labor saved or released in barter by money being provided for us as a medium of exchange. Suppose, now, that I have a gold dollar lying all day in my drawer, and that I exchange that dollar in the evening for a spade which another party began to manufacture in the morning and finished as the day closed. It is evident that the man's labor has been productive labor, and that the spade will be employed in reproductive labor; and it is equally evident that the money has been unproductive, and that, wherever it may go, it will remain unproductive, and will only be employed as a medium of exchange.\n\nNow, I think it is very important that we should see this clearly. So far as my money is concerned, I pass it on unimproved by labor and therefore not increased in value by labor, and the next who gets it takes it and passes it forward on exactly the same terms. It follows from this that though value rests in money, it is produced by labor, and not by money. If I take the spade and sell it forthwith for its true value, it is evident that I will simply become the owner of another gold dollar. For commerce cannot bestow remuneration on us because we hold an article in our hands but because the article has increased in value by our own labor bestowed on it, or increased in price by something outside bearing on the value of the article, and which is tantamount, so far as increase of price is concerned, to human labor spent on it. Hence it is apparent that the mere ownership or circulation of money can never yield any legitimate profits, and that such can only properly be obtained by labor and in proportion to the amount of labor. The fund which nature provides for the remuneration of healthy industry and of a sound commerce is practically inexhaustible, but a fund of remuneration for the mere circulation of money nowhere exists. And where, I would ask, with these facts before us, are we to look for such a thing as interest of money?\n\nQ. It follows, then, does it not, that the man who gives the piece of money should not get any profit, but only the man who has toiled all day in making the spade?\n\nA. I think that follows. You cannot shew any reason why the man who took a gold dollar in the morning and gave away the same in the evening, should get a profit; but it is easily seen why the man who worked all day in making the spade should have his profit. So far as the phrase \"the employment of money\" embraces human service, so far can commerce allow a profit and no further. If profit is made simply because of the circulation of money, nature cannot give it and industry must be oppressed. The merchant must give his service, and it must be a genuine personal service, else he cannot be paid.\nQ. But is the spade in the evening not just worth the dollar in the morning?\n\nA. Yes—and the man who took the dollar from the mine got his profit in the same way as the man who made the spade or the shoes.\n\nQ. Are we not reaching towards a most important truth?\n\nA. I think we are. Money is a completed product of labor, and the profit in every act of exchange is on the side of the labor, not on the side of the money. The labor of our race cannot yield an unlimited amount of profit—it has a natural limit. Merchants are not under any different law from producers or consumers. They are not paid simply because they buy and sell, but because they give service like all working men. They are just laborers like the rest of mankind. There is no law known which will pay a merchant because he has bought an article, but because he has done some sort of service to the community in buying and selling that article. Under the present system the great profits are on the side of the mere manipulators of money, (or rather of pieces of paper promising to pay money); but a time must come when the profits shall all lie where they ought, on the side of labor and of labor alone. Nature echoes the words of the wise man, \"in all labor there is profit;\" and the world has yet to learn what a superabundance of generosity there is in the great law of increase, if men will but cease their actions upon their fellow men.\n\nQ. Is it not, then, very plain that if I owned ten gold dollars and hired ten men for a day's work at a dollar each, it would be altogether wrong were I to have twenty dollars at the close of the day?\n\nA. Yes, you would have just ten dollars worth of labor in the evening. If you had given service in superintendence or in any other way through the day, the fruits of the toil of these ten men would be worth so much in addition and no more. Were it otherwise, industry or commerce would have a legitimate profit to give to every speculator—a profit simply because he had bought and sold irrespective of service or labor rendered to our fellow men. For, one of the great principles involved in all labor and exchange is, that in serving ourselves we must serve others also. True commerce, as a mighty ministry for human wants does not consist in mere buying and selling.\n\nQ. Is it within my power to put an arbitrary value on my service in superintendence or in any other way?\n\nA. The paper system enables you to put an arbitrary value on your services—nature's system of value for value would for ever debar you from doing so. A thousand proofs of this arbitrary value meet you on every hand—large sums given for services of the most trifling nature.\nQ. Do not these thoughts lead us to reflect on the wisdom of God in giving to the world the precious metals as the media of exchange?\n\nA. They do. Let us think, moreover, how wisely it has been ordained that these metals shall have very nearly the same value over all the world, and that alterations in that value proceed so slowly and so silently that nature can never come in conflict with her own system, the cash system. In short, the circulation of the precious metals secures to labor (what that miserable substitute, a paper currency, can never do) the produce of its own toil. Nor only so, but it further secures that men shall not reap simply because they circulate money, and that those who win must work. Governments in their issues of paper, have destroyed this great safeguard of labor.\n\nQ. Should the merchant who sells a commodity get as much as the working man who makes it?\n\nA. That is a question which must float to the surface some day. We may venture to say at present that nature can only pay the merchant on the same principle as the laborer is paid, that is, in proportion to the amount of service rendered—for personal labor and for nothing else. Destroy this law and you bring degradation on labor—confirm this law and you give labor its dignity.\n\nQ. Have these questions a special interest to the merchant?\n\nA. Yes, an interest far beyond that of dollars and cents. They take him out of the weary circle of mere plodding for money into a delightful region of thought and reflection. Surely every honorable merchant ought to know the correct principles on which all mercantile and industrial pursuits should be conducted.\n\nQ. Is there such a thing as a standard of value?\n\nA. If you refer to the popular sense of the term, there is no such thing.\n\nQ. Does commerce require what is understood by a standard of value?\n\nA. No.\n\nQ. Is gold not a standard of value?\n\nA. No.\n\nQ. Does it not measure the value of all products?\n\nA. It does not, in itself, measure the value of a single product.\n\nQ. Is it an article in which the prices of products are expressed?\n\nA. Yes.\n\nQ. What is gold?\n\nA. A medium of exchange.\n\nQ. Is it nothing more?\nA. Following upon its use as a great medium of exchange, it necessarily becomes an article in which prices are expressed.\n\nQ. What do you mean by the phrase \"prices are expressed?\"\n\nA. Simply how much the article in question is worth in gold.\n\nQ. Does it not thereby become a standard of value?\n\nA. No. Value is relative and always points to exchange. By a standard of value, the popular mind understands something which has an arbitrary power of determining values. But gold is a product of human labor like anything else, and everything which is produced by labor has, to a certain extent, the power of determining the value of every other product of labor. Gold, therefore, has no more of that power than corn or cotton, or iron.\n\nQ. Is it possible for any product of labor to come upon the market and exercise the arbitrary power said by the economists to belong to gold as a standard of value?\n\nA. It is impossible. There is no arbitrary measure of value. Human labor, through its innumerable hands and through its millions of exchanges, is continually measuring itself, and thus keeping value at its true level. It is ordained that the produce of your toil must ever submit to the infallible arithmetic of countless numbers of your fellow workmen.\n\nQ. Is it correct to speak of commodities as having intrinsic value?\n\nA. As an economic term it is incorrect. It is a common expression, but it leads to error, especially in relation to the so-called standard of value. Commodities have value in exchange but no intrinsic value.\n\nQ. Is it a correct illustration to compare, as is sometimes done, the yard measure, in its unalterable length, with gold?\n\nA. It is a false comparison.\n\nQ. Why so?\n\nA. Because gold is a commodity of value, and acts not only as a medium of exchange, but is itself exchanged as a commodity of value; whereas the yard measure is not exchangeable, but only measures. The yard measures length, but gold does not measure value.\n\nQ. Is there anything absolutely essential in a medium of exchange?\n\nA. The one essential requisite is, that it be a commodity of value. Even the paper currency, on its face, acknowledges this necessity.\n\nQ. Why should this be essential?\n\nA. Because the principle involved in all exchange is value for\nvalue. Exchange does not consist in promising to buy a thing or in promising to pay for a thing, but in an actual transfer of value for value.\n\nQ. What is silver?\nA. Another medium of exchange.\n\nQ. Is silver different from gold?\nA. Different in its nature and in its value, but the same in its work of exchanging the products of industry.\n\nQ. From a money point of view, is silver less valuable than gold?\nA. Yes.\n\nQ. From a labor point of view, is it less valuable?\nA. No—a day's production of gold is just worth a day's production of silver. So that you see there is no measure of labor except labor itself.\n\nQ. What is the evident design of nature in providing us with silver?\nA. To give us a second medium of exchange.\n\nQ. If this be the design, is it wrong to degrade it, or to banish it out of circulation?\nA. It must be wrong to do either.\n\nQ. Do Britain and America degrade their silver?\nA. They do.\n\nQ. For what reason?\nA. To accommodate the paper system, a fact at which you will arrive if you will patiently trace the matter.\n\nQ. How much is it degraded?\nA. At the present relative values of silver and gold, it is degraded 4 per cent.\n\nQ. Are not silver coins legal tender at their face value?\nA. Yes, to a certain amount.\n\nQ. What, again, is the result of that process?\nA. They are in reality overvalued, so far as legal tender applies, to the extent they are depreciated.\n\nQ. Does not all this manipulation seem very absurd?\nA. It is absurd—and yet the paper system calls for it to be done. In fact, a so called standard of value and a depreciation of our silver coin, are a sort of necessity of that system.\n\nQ. Does the legal rating fix the exchangeable values of silver and gold?\nA. No, these values must ever be determined by natural laws.\n\nQ. What should be done with the two metals?\nA. Coin them in different denominations, and then let both alone.\n\nQ. How would this suit the credit system?\nA. It is not likely to be done whilst the credit system lasts.\nQ. Is this manipulation of silver by government detrimental to commerce?\nA. It is always prejudicial, sometimes seriously so, both to foreign and domestic commerce. It would take too much space here to explain how this comes round. So long as silver will buy goods, the nations which thus manipulate it are doing a dangerous and hurtful thing.\n\nQ. Why has nature given us the two metals?\nA. That is an interesting question, yet to be more particularly solved. Probably gold is designed for foreign commerce, and silver for domestic. I think I can see how this must necessarily be brought about. We will understand it better when paper disappears.\n\nQ. Would your proposition to coin in different denominations conflict with any true monetary principles?\nA. No, it would not conflict with a true currency, it might with a false one. It might conflict with promises to pay money, but not with money; with a credit or never paying system, but not with a cash or paying system.*\n\nQ. Is silver unable to perform its duties?\nA. In an age not at all remote, it was the principal money of commerce.\n\nQ. Can you have a gold dollar and a silver dollar of a value which will never vary?\nA. No.\n\nQ. Why not?\nA. Because they are different products, and their relative values must vary according to the labor required to produce them.\n\nQ. Must not the fact of silver and gold performing the same functions as media of exchange, keep their relative values almost unchanged?\nA. At first blush, one would think so. But reflection will show that if double the quantity of silver is produced by the same labor as formerly expended, the value of silver will depreciate. A day's production of silver will just be worth a day's production of gold,\n\n---\n\n*The Christian Union (N.Y.) appears to approve of the demonetizing of silver on the ground that my proposition would cause gold and silver \"to fluctuate with the market values of the metals\"!! Not a very alarming circumstance, one would think. I daresay every school boy knows experimentally that his coins \"fluctuate\" according to their market values. Has not the Christian Union yet learned that this is a law in nature which all the artifice of man never can repeal. I differ so thoroughly from the Christian Union on the point as to hold that it would be a most unfortunate thing indeed were the values of gold and silver not to fluctuate agreeably to their market values.\nbut a larger quantity than formerly, will have to be given in exchange for gold. Thus you see nature, in providing these noble metals, makes no provision for old contracts or debts.\n\nQ. Should these facts prevent either being used?\nA. Certainly not.\n\nQ. Has paper currency prevented us seeing the natural operation of these laws with regard to gold and silver?\nA. It has. The power, the natural fluctuations, the effectiveness of money—in short, all its work of beneficence to our race, have been obscured by this paper system.\n\nQ. What do you say of the double and single standard?\nA. They are equally illusory. In proof, I appeal to nature, to history, to logic, to experience, to political economy itself.\n\nQ. What has been the origin of the false ideas about the standard of value?\nA. Doubtless the notion of the paper being redeemed with gold.\n\nQ. What are your comparative ideas of a redeemable and irredeemable currency?\nA. Of two evils I would choose the least; and on this ground I think I would prefer a currency which proclaims on its own face that it is irredeemable.\n\nQ. Why should you do so?\nA. Because there is a sort of honesty about the paper which tells you that it cannot or will not be paid.\n\nQ. Where does the annual taxation of Great Britain come from?\nA. There is a pleasing sort of fancy that the bulk of it comes out of the pockets of the wealthy classes. These classes pay the taxes in so far as the money passes through their hands. The question is not, who pay the taxes, but who produce them? If the British landholder could cast a slice from his fields every year into the treasury, or the house owner a portion of his buildings, or the manufacturer a few pieces of his machinery, it might be said that these classes directly and virtually paid the taxes. The taxes are not paid, however, through a depletion of wealth, but in money earned, or in currency which passes as money; and it is a question of production, not of depletion or distribution. These taxes, being paid annually and regularly, must, in the shape of money or currency, form part of the annual produce of the working classes. Taxes may be paid through rental, but they cannot be paid by rental. A house tax will be paid out of the labor which produces the rental. Wealthy men may pay thousands of pounds in taxes, but they cannot get the money with which to pay these taxes except out of the daily toil of those who plough, and dig, and sow, and reap, and spin, and build. If you tax a luxury, and if the wealthy man who uses the luxury be the party who with his own\nhands works for it and produces it, then you may say you have succeeded in taxing a wealthy man. The truth is, under our modern system, you may as well try to tax a stone as to tax a wealthy man. You do not tax the man, neither do you tax the wealth—it is daily toil alone which can yield you your taxes. We do not tax our machinery, but those who work our machinery. We do not tax our ships, but those who sail our ships. We do not tax our farms, but those who work our farms. We do not tax our goods, but those who manufacture our goods. It is not the accumulated wealth of Britain, but the daily toil of its people which is taxed—not the labor of the few who hire the many, but the labor of the many who are hired by the few.\n\nQ. Then we cannot tax commodities?\n\nA. Certainly not—you can only tax human beings in their toil. The tax laid on a commodity is just so much deducted from the earnings of the men who produced it. It is only effective and needful labor which can be taxed.\n\nQ. If a loom produces a hundred yards of cloth, and if half a dozen yards are taken as taxes, who pays the tax? Is it the cloth, the loom, the proprietor of the loom, or the man who works it?\n\nA. The man who works the loom.\n\nQ. How so? Are not the six yards taken?\n\nA. Yes, the six yards are taken and sold, but if they were not taken, the worker would have so much more for his wages. The only other person who could pay the tax is the proprietor of the machinery; but machinery or \"capital\" yields a full return to the owners; and all taxes, as well as interest, come out of the daily toil of the people.\n\nQ. Can it really be the case that none of the revenue of Great Britain comes out of the machinery, or, in other words, out of the pockets of the capitalists who own the machinery?\n\nA. The machinery is but the tools in the hands of the working men. If you hire a man to work for you and put a spade or a plough in his hands, and then tax the product of his industry, it is plain that the burden will fall on the working man, not on the person who but gave away a few pieces of money at the end of the week. We can only get to the root of this problem by viewing all fiscal burdens as falling eventually on the laboring population. It matters not how costly or complicated the machinery may be—it is out of the hands of the working millions that the tax must come. Taxes raised to pay interest on national or civic loans are an interminable source of oppression to working men.\n\nQ. Suppose all the revenue of Britain were raised by a tax on some imported article, say coffee, and that only the wealthy classes used the coffee, who would pay the taxes?\nA. I think it is unquestionable that all the revenue would, in such a case, be virtually paid by those who raised the coffee. You can no more tax a luxury without taxing the labor which produces the luxury, than you can tax a necessary without taxing the labor which produces the necessary. All these taxes, as well as interest of money, will bear most heavily on those who really do the most valuable work for society, such as those who toil at the plough, or in the mine, or in sowing and reaping the grain.\n\nQ. Go to now. Do you think the labors of Hodge at his plough worthy of being compared with those of the learned gentleman at the bar who speaks for hours together till he is hoarse? or with those of the great statesman who takes up the best part of half a day in unfolding some wonderful \"scheme\" of finance by which the industry of the people may be more effectually diverted into certain channels? or even with the patient endurance of the two or three hundred gentlemen who sit through the ordeal at a cost to the working men of perhaps only ten dollars a day each?\n\nA. Perhaps we would wrong Hodge by comparing his labors with such things. The truth is, the system has naturally attached fictitious values to a multitude of services. I would also lay it down as a principle that the cost of sustaining every business either hurtful or useless to society, must fall as a tax on the working population.\n\nQ. If interest or taxes of any kind are raised on the security of my property, or of the property of a city or of a nation, is it the property which pays?\n\nA. By no means. The interest is one thing and the security another. It is the daily toil of yourself or of the people which must pay.\n\nQ. What is the true cost, to a city, of its public loan?\n\nA. The true cost is the difference in amount between what is actually received and what is actually paid, and any calculations outside of this fact must prove fallacious and deceptive. Moreover, that cost must be set down as a loss to the labor of the city.\n\nQ. Would calculations as to the rate of interest paid not give the true cost?\n\nA. No, nothing but labor can pay for the loan; and it is plain that the cost can only be calculated as against those who really pay it. The rate of interest may be higher or lower, and be thus easier or harder to bear; but the difference between the gross amount received and the gross amount paid, principal and interest together, is the loss to the labor of the city, and is the only true and intelligible \"cost.\"\n\nQ. Must we look at these public loans, in their more important issues, as questions of money given or of labor spent?\nA. Of course we must regard them as questions of labor given, and it makes little difference whether that labor is given in one or ten or twenty years. The real loss to labor is just the same though the city bonds should have twenty years to run. The money annually paid is but indicative of the pressure beneath, and we must look for that pressure in the proper quarter.\n\nQ. What is your opinion of the transaction, when these bonds are sold to money speculators, as is generally the case, at a high rate of discount?\n\nA. I can hardly find language fitted to express my sense of the shameful character of such a transaction.\n\nQ. Is a tax on the consumer virtually a tax on the producer?\n\nA. Yes.\n\nQ. If a country circulates ten millions of dollars in currency, and has under discount two hundred millions, which of the sums must be taken as indicative of the pressure on labor?\n\nA. The two hundred millions, that being the amount on which interest is paid. But there is always a vast sum lent otherwise than through the banks, which must also be taken into consideration.\n\nQ. What about church \"investments\" of money?\n\nA. They are wrong. The error is that the church does not spend the money. It is something like the paper currency which never pays—the church, in these investments, never spends.\n\nQ. How is that an error?\n\nA. Because the church thus locks up her wealth and fetters her own progress.\n\nQ. What does the church get?\n\nA. Nothing but the interest.\n\nQ. But would not the money, if spent, be dissipated and lost?\n\nA. If faithfully spent, it never would.\n\nQ. What would it yield, if spent?\n\nA. It would, in obedience to natural laws, result in bringing increasing treasures to the church, and thus be the means of propagating the gospel throughout the world. Everything good would go forward at a vastly increased rate. In this view of the case, the labor question does indeed become the greatest question of the day.\n\nQ. You think, then, that large sums accumulated at interest by the church, or \"investments,\" are not a blessing?\n\nA. I believe them to be the very reverse—that, in proportion to their magnitude, will their influence be found to be withering.\n\nQ. Do these things seriously arrest the progress of christianity?\n\nA. They do.\n\nQ. Does the whole system now under discussion present obstacles to the conversion of the heathen world to christianity?\nA. Yes, all but insuperable barriers.\n\nQ. What is the support of the church?\n\nA. The industry of her people, in repeated and spontaneous offerings. This is the only true economic way in which the church can accomplish her great work.\n\nQ. Should what is given by the people be spent or hoarded?\n\nA. Spent. Where is the use in the church heaping together treasure. If hoarded, and only the interest spent, a crime is committed against nature itself and God's plain command violated. I believe this debt, endowment, and fund system in the church to be a most impoverishing system, spiritually and materially. Its pernicious influence may be traced in every direction. An endowment, if hoarded at interest, is about as bad a thing as the church can touch.\n\nQ. Has this paper system, using the term in its broad sense, drawn working men to the church?\n\nA. Alas! no, it has driven them away. It has emptied our churches of the working men. Little do the church and the pulpit know what they have lost in consenting to a system which has so greatly debased the working classes. How solemn is the rebuke conveyed to the minister as he casts his eye over his congregation and looks in vain for the working men. Precarious is the condition and uncertain is the success of the ministry under such a system.\n\nQ. Is it right to build a church on borrowed money?\n\nA. I do not think it is.\n\nQ. Why so?\n\nA. Because the congregation which deliberately puts itself in a position of debt manifests that it is heedless of the divine warnings, and of the troublesome experience always associated with church debts. There are also substantial economic reasons which I have not space to set forth here. One of the worst results is that it drives poor people out of the church.\n\nQ. How does that appear?\n\nA. Because if a congregation pays for the church it erects there is no claim for interest to be met—whereas, if they build on borrowed money, there is always the claim for interest coming round.\n\nQ. Is a congregation not in the same position when it builds the church on borrowed money as if it paid rent for a church?\n\nA. Borrowing on interest, it is plain, can never leave the congregation in the same position as paying rent. Nobody would advocate such a thing as hiring all our churches and paying rent. Our churches must be paid for, so that all, rich and poor, may enter without the burden of either rent or interest.\n\nQ. What should people do?\nA. Build the church they can pay for, and pay for the church they build.\n\nQ. Have you anything further to add?\n\nA. I would add that by borrowing to build the church, you do one of two bad things—you either tempt the people to go beyond their means, or you furnish an excuse for those who have ample means to shut up their pockets, generally the latter.\n\nQ. Did you ever hear it said that it was a good thing for a church to be in debt on the ground that it fostered the habit of giving?\n\nA. Yes—that is about as reasonable as to say that it is a good thing to get fastened in a quagmire because you are compelled to exert yourself to get out of it. On such a principle, it is quite to the point to conclude that it would be as injurious to get out of debt as out of the quagmire. What a foolish idea it is to suppose that because there may be some virtue in struggling to get out of debt, there must be something good in the debt itself. Why pay the debt at all if it be such a good thing? But aside from all this, what are we to think of the morality involved in such a principle of giving?\n\nQ. Can commerce pay for the use of money?\n\nA. No.\n\nQ. For what does it pay?\n\nA. For the money, not for its use.\n\nQ. On what do you ground this statement?\n\nA. On the ground before expressed, that no man can pay for that use. The service of labor we pay for—the service of money is a free contribution to man, and must ever remain unpaid.\n\nQ. Is it the office of government to provide a currency for the people?\n\nA. It is not. That office belongs to industry alone. It is the office of government to protect us in the matter of currency, but not to provide it.\n\nQ. Should governments coin free of charge?\n\nA. No—the expense of coinage should be paid by the owners of the bullion. They should do so for three reasons—because labor is given, because the metal is increased in value when in the shape of coin, and because coins are needful to commerce.\n\nQ. Will the coins be of more value when seigniorage is imposed than when the mint is free?\n\nA. No—the imposition of a seigniorage will not affect the current value of the coin. The truth is, the British mint is really not free. The labor has to be paid for somehow—the people pay for it through their taxes. Even if the English sovereigns were coined by some generous individual wholly free of charge, they would\nfloat alongside of the 25 franc piece, the half eagle, the Napoleon, at equivalent values, that is, according to the quantity and quality of the gold, although the latter coins are issued subject to mintage charges. If the British Government issued its sovereigns one year free, and the next year with a seigniorage, how could commerce ever distinguish the one from the other?\n\nQ. Then, if this be so, would it not be impossible, by the imposition of a seigniorage, to make the sovereign, weighing in round numbers 113 grains, equal to the proposed new sovereign weighing 112 grains?\n\nA. It would be impossible. The purchasing power of the one would be greater than that of the other.\n\nQ. To use the illustration enforced before the Royal Commissioners on International Coinage, is it correct to say, as was there said, that a foreign government which had contracted for a term of years to pay £1000 sterling per annum, fulfilled its obligations by the remittance to England from time to time of a bar of standard gold of that amount, or which would yield, when coined, 1000 sovereigns?\n\nA. It is incorrect.\n\nQ. Why so?\n\nA. Because the mint, or in other words the government, would be put to the expense of coining the bar into sovereigns, or say 2d on each coin.\n\nQ. But, by the present mint laws, can the person not take the bar of gold to the Bank of England or the mint, and get in return 1000 sovereigns of full weight?\n\nA. Yes—because of an accidental circumstance he can do that—because of the mint choosing to convert his bullion into coin without any direct expense to him. But suppose the foreigner had contracted to furnish you with 1000 caps, and that they came to you with a message like this, \"I have sent you the 1000 caps, but they want the peaks—however, there is a good fellow on Tower Hill who will put the peaks all right without charge either to you or me.\" Would the foreigner be fulfilling his contract? Or, suppose the good man on Tower Hill begins to look into the matter, and says, \"I will no longer do this work free, you must pay me for these peaks\"—would this excuse the foreigner from furnishing a complete cap?\n\nQ. Do you agree then, on this point, with the decision of the Royal Commissioners of 1868—that if the sovereign were reduced from 113,001 to 112,008 grains, compensation would have to be made to all parties holding contracts based on the old sovereigns, but paid in the new?\n\nA. Notwithstanding the ability with which the eminent men on\nthe other side reasoned the matter, I think we must admit that the Commissioners were right.\n\nQ. Would you consider you were paid in full were your foreign correspondent to transmit you, in settlement, a bar of standard gold of full weight, even though the mint coined the bullion for you free of charge?\n\nA. No. I could not use the bar as I could the current coin of the realm. I would practically have to wait twenty days till I got my coin—either that, or discount the bar for current coin.\n\nQ. Do you agree with what was several times advanced before the Commissioners—that the charge of 1½d per ounce by the Bank of England for the immediate delivery of coin in exchange for bullion, is practically a charge for mintage?\n\nA. No—neither in theory nor in fact is it a mint charge. It is a charge for the loan of money—for interest on the time occupied in coining the gold—it is the same as discounting a note. The mint does not charge the owner of the bullion for coining; and by no effort of the imagination can we convert this advancing of ready money by the bank in exchange for bullion into a charge on the part of the mint.\n\nQ. Have you given any thought to the question of what is best as a monetary unit?\n\nA. I have given it but little thought. I am not much acquainted with the details of this interesting question of international coinage. It has occurred to me, however, that were we to search for some natural standard to which to refer monetary values, the average price of a day's labor might be taken, an average which, however difficult to find in these days, would not be hard to discover under a natural or money system. A great deal could be said in favor of this as a monetary unit.\n\nQ. What ought we to understand by the phrase \"the price of money?\"\n\nA. The goods or labor for which money will exchange.\n\nQ. Will we go astray if our minds run off in some endeavour to connect the term with interest of money, or indeed with anything else than price of goods or labor?\n\nA. You will get into inextricable confusion, and you will never be able to reason correctly on the subject at all. The so-called \"interest\" of money and the price of goods or of service have no true relation to each other; and hence the fallacy of the reasoning in the articles we so frequently see in the newspapers in opposition to usury laws. The \"cost of money\" can never really mean anything else than the labor spent in producing it, or the labor embraced in the article exchanged for it; and I would warn you\nto be upon your guard just at this point if you wish faithfully to investigate the subject.\n\nQ. Can commerce pay for the loan of money?\nA. No.\n\nQ. Has it no fund for such a purpose?\nA. None. It has a fund of profit in exchange of services, but no fund for loans.* To take \"interest\" as it is called out of money is against nature.\n\nQ. Then is use gratuitous?\nA. Use is gratuitous.\n\nQ. Suppose an ambitious young man sees some adventure which promises large returns, and that some capitalist advances him money, and that he forthwith makes a fortune—is not to lend to produce, in such a case?\n\nA. There is no more true production in such a case than were I to waylay a man with a bag of gold and forcibly take it into my possession. All that you can say is, that the young man, through the aid of the money lender, has succeeded in making a large sum out of the labors of other people.\n\nQ. In hiring, do I pay for use?\nA. I think it must be laid down as a general principle that we pay for human labor whether we hire or buy. Use is ever personal to yourself, and you have no data on which to estimate such a thing as value in connection with it. There cannot be two different principles at work in the settlement of the value of human labor. Accumulated wealth, of whatsoever nature, is put to a perverted use when it is employed so as to afflict labor, and that it is so employed under our modern system, there cannot be a doubt. The whole question is of first importance and requires careful consideration.†\n\nQ. Does the intervention of machinery alter any of the economic laws under consideration?\nA. Of course not. Human labor, and that alone, will be paid for to the end of time.\n\n* This truth, the importance of which cannot be overestimated, I have endeavoured to set forth with some fulness in my recent work on the Labor Question, Sec. II.\n\n† Further reflection would doubtless lead me to modify the views I have expressed on rent in my book on Labor. The question of Labor must be taken as a whole and thought out as a whole; for there can be no doubt that all its elements and forces will eventually be found to work together in perfect harmony. The question of Rent, in itself and on its own merits, has not received from me that critical investigation which I hope at some future date to bestow upon it.\nQ. In renting a machine which it has cost me a month to make, how much ought I to receive?\n\nA. Evidently a true equivalent would just give you in all a month's labor of some other person. Would you not be conscious of trespassing upon someone's labor were you to get more?\n\nQ. But if payment is withheld for a period?\n\nA. Labor has no fund out of which it can possibly pay you on the ground of payment being withheld. Could you tell me where it could be found?\n\nQ. But, could I not rent out the machine again at the end of the month?\n\nA. No. You could only do so by setting aside that first principle in all service, equity. The machine in reality would be no longer yours.\n\nQ. Suppose I own a farm sufficient to sustain myself and family, can that farm afford rent?\n\nA. It is quite plain that the farm cannot afford both rent and sustenance.\n\nQ. Then there are difficulties connected with the rent question?\n\nA. Undoubtedly there are. Rent, as a general thing, can only be paid under a general system of hiring day's labor. You will find it a difficult task to sustain your family and pay rent besides out of your own labor.\n\nQ. Will the co-operative principle put things right?\n\nA. I would not like to say. I see no objection to it. It seems feasible. Any system which gives the most returns to those who work hardest and best cannot be far astray. You know that everyone considers himself a born economist, and that the science has no secrets for him. But you know also that men trained to think have found it all but impossible to be wholly consistent in their expositions of political economy. It is sometimes the part both of modesty and prudence to suspend judgment. I am content to believe that time is destined to unfold to us all the mysteries of a science whose arrangements for the protection and rewards of industry must be entirely equitable.\n\nQ. In the consideration of these questions, do you make no allowance for intelligence?\n\nA. I make every allowance for intelligence. The skilful worker is the best worker and will gain most. But there is now which will take from my labor to pay for your intelligence. Intelligence to come under economic rules, must be combined with your own labor. An idea is worth nothing unless there is the skill of the workman to put it to practice. Every piece of work will acquire value in proportion to the skill with which it is executed. Others must receive the full value of their labor however skilful it may be.\nHere there is a law which enhances the value of your own labor, but does not diminish in the least the value of the labor of others. If a working man has, through deficient education or other cause, become so ignorant as not to understand his work, but must have some superior intelligence to direct him, political economy cannot afford to bend its laws to this circumstance. Intelligence is an abstract thing for which commerce cannot pay till it is embodied in some commodity or service rendered. Whilst on this subject I would say that the old apprenticeship system turned out more skilful mechanics, and really more independent, than the modern system with its minute subdivisions of labor. I am glad to see that a writer, himself a working man, has taken up this subject in a recent issue of the Boston periodical \"Old and New.\"\n\nQ. Can commerce pay for the lapse of time?\nA. Impossible. We pay for labor, the amount of labor, the effective force of labor, but not for time.\n\nQ. In paying so much a year to my clerk, am I not paying for his time?\nA. No, you pay for nothing but his services. Time is ever on the wing and cannot be paid for. It is as impossible for the laws of exchange to give recompense for time, as to give recompense for the risks and accidents of life. Commerce cannot pay for the time consumed in any mercantile adventure in any other way than the blacksmith is paid for making a horse's shoe.\n\nQ. Has labor anything to give because money is withheld, or \"abstinence\" practised by the lenders?\nA. No. The economists labor hard to make a great deal out of this \"abstinence.\" Labor cannot pay you because you abstain from using your money, it can only pay you when you use or exchange your money.*\n\nQ. Is it right to make a future generation pay for the labor of the present?\nA. It is not. That generation on the same principle might hand it forward to the next, and so on indefinitely. You may say the next generation gets a share in the benefit, and so it does. But all generations of men reap a certain benefit from all the work going before. I may plant a tree which will give fruit and shade for a hundred years to come. Is that a reason why the planting should not be paid for, or why some one a hundred years hence should pay for it? Every generation will have its work to perform for its own happiness and that of succeeding generations, and it is indeed a poor\n\n* \"No one can naturally receive more for his abstinence than the thing he abstains from using or consuming; but always less according to the time in which his abstinence and the nature of his surplus.\" J. K. Ingalls in a well written article in Brittan's Journal.\nand heartless policy which deliberately leaves our heirs with only an incumbrance of debt and mortgage. We have no moral right at all to impose burdens of unpaid debts on a succeeding generation—our duty lies all the other way. The language of a truly great people is \"What can we do for posterity?\" not \"What has posterity ever done for us?\" It is a mistake to suppose that we owe nothing to posterity.\n\nQ. Is it right that the toiling millions in Great Britain and her Colonies, or elsewhere, should have their wages taken from them to pay the interest on the national debt?\n\nA. It is not right. The working men have virtually paid the debt many times over. They must have done so if interest comes out of labor. I state distinctly that there is not the slightest moral obligation on working men to pay the interest on the national debt. To cause them to do so, is cruelty and oppression.\n\nQ. Is money unproductive?\n\nA. Yes, wholly unproductive, so far as it is possible for one to pay for anything it does for our race.\n\nQ. How do you show that?\n\nA. Because it is not a machine, and gives birth to no product, and can only be used as a medium of exchange.\n\nQ. Is it this consideration which leads you to the conclusion that industry can afford no hire for money?\n\nA. It is.\n\nQ. Would not this fact, under a cash system, render money \"stagnant?\"\n\nA. The very reverse. Profits would be wholly in exchange, and people would not invest in mere money. The money would be kept moving. The credit men cry out against the hoarding of money; but it is the credit system which causes money to be virtually hoarded, and to become at the same time an instrument of oppression to labor; for, investing money at interest is a species of hoarding which tells with disastrous and paralyzing effect on every form of industry.\n\nQ. Has every product of industry its present value, and that only?\n\nA. Yes; you may have ideas about past or prospective values, but the true value of everything under the sun is discovered in the act of exchange alone.\n\nQ. Could we have a better system than the present one of hiring men at day's wages?\n\nA. Your question opens up a subject which cannot now be well understood, and which will only be solved when the cash system is in full operation; or, what is perhaps more explicit, when the galls in a newspaper and credit systems shall have passed away. There can be no\ndoubt that the present wages system is the fruit of the paper and interest system; for those who borrow large sums for business must of course create a demand for hired labor, seeing they could not pay the interest out of their own labor. Just in the same way as those who make large accumulations of property through the toil of others, must, if that property is to bring them in any return, necessarily rent it out to others. And thus also is created a demand for a class of mere tenant occupants.\n\nQ. Suppose a person sells a block of land payable by instalments but wants the instalments up before due, and that the buyer gives his notes, which the other discounts, who will pay the discount?\n\nA. Were such transactions only occasional, the seller would lose the discount.\n\nQ. Well, would it not be an advantage to industry thus to have the money before due?\n\nA. That might be within the category of things possible, if money produced labor.\n\nQ. I admit money does not produce labor—what is the loss, if any to industry, on the transaction?\n\nA. The loss is just the amount of the discount (or interest) on the notes, and for the simple reason that neither your own labor nor the labor of any other person, has anything to give for interest of money. Therefore the seller, unless he could cause the loss to fall on another, would receive the money value of his land, less the money discount. In other words, industry would, in a money point of view, be so much short of its just earnings.\n\nQ. Suppose all lands were rented, and that the proprietors received promissory notes for the rents six or twelve months before due, and that all these notes were discounted, what would follow?\n\nA. We would then have a sort of agricultural credit system; money would be generally lent on interest; the rents and values of lands would be improperly advanced; and the burden would eventually fall upon the tillers of the soil. Were all the farmers and manufacturers in the country, instead of selling for cash, to sell their products at 3 or 6 months, and discount the notes for even a metallic currency, they would then be paying interest on money. In addition to rent of lands and factories, they would be paying interest (or rent of money as we will call it for argument sake) an article which, unlike the farm or the machinery, produces nothing, and can only be used as a medium of exchange. The \"credit system\" here comes into view, the source of the supply of the discounted paper. Were they all to sell for cash there would be no interest paid. The labor in the form of the various products is completed and exchanged. But the labor, in the form of money, is not forthcoming, or, if forthcoming, it passes into the hand of\nlabor mutilated by so much taken from it as interest. If labor, in the shape of products of industry, exchanges value say to the amount of a thousand dollars, and if its profits or earnings on this be ten per cent.; and if, instead of getting the thousand dollars, it gets them subject to a deduction of ten per cent. for interest, it is plain that it loses that amount of profit which others claim and obtain through discounting the currency, and that the condition of labor, under such a system in full operation, must be that of a constant and precarious struggle for existence. All the currency of the country being discounted, this must necessarily be the condition of labor under our present mercantile arrangements. For every product of labor and for every day's hire, labor gets only one half its just money rewards. For, be it noted, it is profits or savings of labor which, secured to us by exchange, lift us gradually above the condition of the savage. It is also apparent, from what I have now stated, that the merchants who trade in whole or in part on borrowed money, must of necessity add to the legitimate value of the goods to pay the interest; and that manufacturers, in similar circumstances, must either do the same, or decrease the legitimate wages of the hired men, for the interest cannot come out-of anything but labor. And thus, either in a direct or somewhat round about way, the pressure falls in the end upon the producers, or on those who toil.\n\nQ. But is the pressure not just ten per cent.?\n\nA. Be it observed, this pressure with its consequent degradation is not a thing of which any correct monetary measurement can be taken. Under the paper system, the working men are drained of their capital and pay all the interest—the barest subsistence is allotted to them as their share. Profit, luxury, accumulation, wealth, all fall into the hands of the paper men.\n\nQ. But is not the legitimate value of the goods just the value at which, under the credit system, all goods are sold?\n\nA. No. All the currency of the country being discounted before it goes into circulation, and all labor being paid in that discounted currency, and both merchants and lenders reaping a profit from the \"employment\" of that currency, all labor must necessarily be oppressed, whether in the act of production or in the purchase of products. The cash system in full operation would therefore, as one of its first blessings, double the present pecuniary rewards of all labor. And that would be but the beginning of good things to the sons of toil.\n\nQ. Does not the fact of some of the capital, say buildings machinery, and so forth, being owned by the merchants or manufacturers, lessen this strain on labor?\n\nA. No—the full pressure is there and must be there, so long as\nlabor is paid in a currency, and especially a paper currency, all discounted before it goes into circulation. And this will be the case even where the bulk of working men are paid their wages in small coin, so long as there is a predominant paper system above them regulating all values and practically reducing every just return of labor. The great laws regulating exchange provide for a cash system, not for a credit system; and as the credit system issues in causing a full rate of profit (or rather an extravagant rate, as witness some of the London banks paying twenty per cent.) to be deducted from the currency—for it is just a shaving of the currency—of course labor somewhere must pay both.\n\nQ. Now, can industry afford a higher price for its own products when they are sold at 3 or 6 months time than when they are sold for cash?\n\nA. No—industry cannot afford to give ten dollars for an article which is only worth eight on the ground of not paying for it till a certain time has elapsed.\n\nQ. If most of the world's products are thus sold, what will be the loss to industry?\n\nA. The loss to industry, in money, will be the enhanced price put upon the goods; or, from another point of view, the amount of bank discounts will represent the loss. All exchange is but simple barter; and it is a self-evident truth, if I give the products of my three months labor to you, and receive in return the produce of your labor for three months, and ten or twenty days besides, that you must lose to a serious extent. This is the true state of the case, not affected at all by the intervention of money. And it makes no difference whether the loss is concealed under the form of a discount on notes, an advanced price for goods, or diminished wages. This will show us whether the credit system is the friend to industry it is so often represented to be.\n\nQ. Is industry really under any necessity of adopting such a system as this?\n\nA. Not at all. It is a modern scheme by which industry is robbed. Merchants have actually come to believe that there is some sort of necessity that all the products of industry, when sold, must be subjected to this illegitimate tax on industry—that the credit system some way or other is an indispensible part of business.\n\nQ. Does not the fact of the low prices of the cereals on this Continent, especially in the Western States, contradict your theories?\n\nA. That fact goes to confirm them. One would just anticipate such a condition of things with regard to the products raised by our farmers for sale. The wide gulf between the prices obtained by the western farmers for their products, and the prices they have\nto pay for manufactured articles, tells more forcibly than any words of mine the extent to which paper and lending on interest have disorganized and ruined the great staple industries of the country. The pressure has gone as low as it can when it has reached the grain. Our farmers being themselves generally the tillers of the soil, the system oppresses them by reducing, to them, the prices of the produce they raise for sale. The railroad corporations, by this bond and debt system, or through these railroads not being paid for, actually become oppressors of the farmers in these Western States, the rates of freight and other charges being raised to an extent out of all proportion with the cost of production of the corn. In England the pressure falls, not upon the farmers, but upon a large and patient class of agricultural laborers beneath them; and hence the wretched condition of their laboring population. We thus perceive that interest goes down through all the ramifications of trade and speculation, and falls at last with crushing severity upon the persons who actually toil. For, as there is no value without labor, the results of this interest system must be sought in the condition of the laboring population. Thus we perceive also, why so many of our farmer's sons on this Continent, disheartened with the poor rewards of their long hours of weary labor, crowd towards our cities in the hope of finding there an easier and less toilsome road to independence. Were the present system supplanted by the cash system, the farmers of America would have their incomes more than doubled. And there is no antagonism between what I now set forth and what I have previously stated as to the enhancement of prices. For, as interest can be paid out of nothing but labor, it must be secured either by the enhancement of prices to the consumer or by the reduction of rewards to the producer. And, thus, in either case, it becomes virtually a reduction of the wages of industry. And so we are ever brought back, as if by some occult, but inevitable law to the same position, namely—that our labor can afford nothing for interest of money, that we are paid only for exchanges of services, and that money effects these exchanges gratuitously.\n\nQ. Is this subject one of paramount importance to Trades Unions and the Farmers' Granges?\n\nA. It is. I commend these views to the careful consideration of intelligent working men in every trade.\n\nQ. The Chicago \"Advance,\" in reviewing your book on the Labor Question, uses the following argument against you. \"If A can employ his money in various ways so as to bring him in a return of twenty cent. per annum, then there is no injustice in his asking ten per cent. of B, if B wishes him to forego such use of it and to loan the money to him.\" What have you to say to this argument?\nA. Such an argument, however honestly set forth, is only calculated to mislead. It is a poor attempt to defend the credit system, and is, moreover, an incorrect statement of that system. For the credit system is not the borrowing of money at ten per cent. whose legitimate profit is twenty per cent., but it is the borrowing by discounting of the whole currency at the ordinary rate of profit, and the adding that profit to the prices of goods or the deducting it from the wages of labor. The reviewer would have us believe in an absurdity. By some strange process of reasoning, he appears to have got the idea into his mind that money not lent will bring in twenty per cent. but that when lent it will bring in only ten per cent., for his argument amounts to nothing if it has not this meaning. The law will never be discovered which will bring round such a state of things. Such reasoning does not even touch the subject, and only serves to mask the truth before thoughtless minds. Even granting that he takes an exceptional case in his endeavor to overthrow the general laws I have set forth bearing on money and labor, we may reasonably question the soundness of an argument which proceeds on the supposition of people who are earning twenty per cent. giving away their money for ten. The \"Advance\" views the subject from a purely mercantile standpoint, as if money produced and sustained labor. If the legitimate returns of labor (represented by A) are twenty per cent. per annum, these returns cannot afford to be halved; if the legitimate returns of labor (represented by B) are ten per cent. these returns cannot afford to be given away to A. Does the \"Advance\" really approve of such a state of society as he sets forth—of one half of the returns of labor earned by the B's being employed to pension off the other half, represented by the A's?\n\nQ. Is it important, in the discussion of these subjects, that we use correct language?\n\nA. It is of the utmost importance. Not only must the language itself be correct, but it must be used in a proper connection. I have heard language, in connection with monetary science, made to express the most absurd ideas.\n\nQ. Through thoughtlessness?\n\nA. Yes, pretty much through thoughtlessness. The smattering of knowledge obtained on \"the street\" only helps to darken these great questions instead of clearing them up. We must all sit down patiently to learn, and accustom ourselves to weigh, with the nicest accuracy, every statement put forth. Questions may be put to you, and you may even put them to yourself, which will puzzle you for the moment; but if you have the true principles in hand, you will not fail to come out right. The truth is, the whole subject must be thought out anew.\nQ. Can we have a cash system alongside of a paper currency?\nA. Of course you cannot.\n\nQ. Under a cash system, would we ever want for money?\nA. No, loafers only would. All industrious people would have plenty money. But under the modern system, thousands and tens of thousands of industrious men are driven from pillar to post in their endeavors to get money.\n\nQ. Many people, especially the merchants, have the notion that industry and \"business\" could not get along unless money were lent. What do you think of it?\nA. It is just as absurd as to suppose that tillage could not be conducted unless all ploughs and spades were lent.\n\nQ. Suppose all ploughs and spades, and other implements of husbandry, fell into the hands of capitalists, and were then hired out to workers, would there be any increase of production?\nA. No, it is evident there would be rather a decrease. A certain amount of labor, or of the fruits of labor, would then also pass away from the toilers under the name of \"rent.\"\n\nQ. Has the machinery or the capital, by this system, fallen into the hands of others than the toilers themselves?\nA. It has.\n\nQ. What is industry paying for in having all this paper placed in its hands?\nA. In reality, so long as the system lasts, industry is parting with its hard earned gains for a myth, a shadow, a promise never fulfilled, a fallacy, a nonentity, call it which you like.\n\nQ. But does not all this suit the mercantile classes very well?\nA. It may suit merchants who are heedless of the suffering entailed upon their fellow men; and yet statistics have proved that this dreadful system destroys the whole class once in every fifteen or twenty years. It is thus ruinous to genuine and honorable commerce as well as to industry.\n\nQ. Will a different class of merchants arise?\nA. In a future age the world will have a class of merchants worthy of the name—men who will aid and protect the labor by which they live and thrive.\n\nQ. Do bank ledger inscriptions, or deposits operated on by cheques, react prejudicially on industry the same as bank notes?\nA. Whenever these deposits or loans are the fruit of discounts, or are lent on interest, they do so operate, under the paper system.\n\nQ. Are prices influenced by the sum total of currency in the bank, or by the sum total out of it?\nA. By the whole currency, but not, under our modern system, by gold money.\n\nQ. Do the working men of Great Britain alone support the system as it exists in that country?\nA. No, not alone. Wherever British goods are sold, or British capital employed, or from whatever region of the world the products of the soil are gathered for British use, there will the pressure more or less be felt.\n\nQ. Are loans, and interest, and discounts, all outside of commerce?\n\nA. Yes.\n\nQ. Have you anything in the way of proof, additional to what has been stated?\n\nA. Perhaps the reason which would be considered most conclusive by thoughtful men is, that there are no natural laws bearing upon loans and interest of money. We may see the matter also in this way—Labor is all that any man has got to sell. Whatever be the commodity, it is virtually an exchange of labor. We will call it service so as to embrace all mankind. A man either sells his labor or service direct from the strength of his arm, or as embodied in some article which he has made, or in some service rendered, or it is simply exchanged with money which he has earned. So that everybody just sells his day's service for what it is worth. We all live by our day's labor, and we are all under the same laws of labor. If, then, the laboring man who can support himself and family by his day's labor borrows say 400 dollars at interest, he must, it is plain, either work extra hours or reduce his family in the scale of comforts to pay this interest. In selling his labor he gets an equivalent, but in paying interest of money he can get it from no source but his labor, and by an unnatural tax or strain on that labor. Money itself is but a product of labor, and if there is such a thing as \"interest\" to be found in money, then \"interest\" would also be found in day's labor; and it would be proper and natural that every workman should be paid not only for his labor, but also interest on his labor.\n\nQ. But may I not pay interest out of my accumulated wealth?\n\nA. Of course there is no physical obstacle to your doing so, but under the modern mercantile system it is never so paid—it all descends upon labor. A system which would take interest out of accumulated wealth could not possibly exist—it would eat itself up. It would, moreover, be just as much opposed to nature as to take interest out of day's labor.\n\nQ. You say we can only have profits on exchanges of service—do I not confer service when I lend money on interest?\n\nA. Words may be made to mean almost anything, but it is plain that you do not confer service in either the true commercial or industrial sense of the term. Any other sort of service does not call for our attention. As you can do nothing with money except use it as a medium of exchange, you cannot pay for the loan of it without reducing your own or some other person's labor, and you surely\nmust admit that you cannot get the interest unless out of your own labor or out of the labor of some other person.\n\nQ. Have you any other argument to advance?\n\nA. I will state one which I consider calculated to strike even the most thoughtless mind. If a few dollars had been lent on interest at the beginning of the world and allowed to accumulate, they would long since have devoured all the industry of our race.* Therefore money at interest is destructive to man—as an instrument of exchange, it is a blessing. In the one case it tends to enslave labor; in the other it tends to aid and enrich labor. Who can deny that legislation is bound, instead of fostering such a thing, to suppress it at all hazards. This is the vice which has ever sapped the foundations of national strength and brought in ruin and decay.\n\nQ. Would these few dollars, if left unrestricted, eventually devour, as it were, all the money and industry of the land?\n\nA. They would.\n\nQ. How is it that this has not actually come to pass, seeing that such vast sums have been lent on interest for so long a time?\n\nA. Because a merciful Providence has given counteracting forces, such as commercial panics and redistribution of wealth, which may be regarded as both warnings and correctives. Labor may be said to thrive by a constant process of consumption; but interest of money thrives by a constant process of accumulation.\n\nQ. Notwithstanding this, how far has labor been reduced?\n\nA. It is unquestionable that in general it has been kept to about the bare living point. A few skilled mechanics may, by the closest watching, effect a little saving, and become in turn and by means of savings banks the oppressors of their fellows. But the great mass of the laboring population is doomed, by the modern system, to a state of slavery, with no happy prospects before either the toilers or their offspring. Children of both sexes, in their tender years, are taken from their homes to begin the life long struggle. Let us consider the utter hopelessness with which the toil of millions is conducted from youth to age, and from father to son, without even the remotest prospect of ever owning a spot they can call their home. What share have they in the beautiful world which God has made for the enjoyment and happiness of his creatures? They have, in common with the beasts of the field, the one aim of satisfying their hunger, and that is about all.\n\nQ. Is this the normal condition of labor?\n\nA. I do not think it is. I believe the grandest state of society is yet to come, when men will work, and enjoy life in that health and\n\n* See Mr. Harvey's \"Queries,\" before quoted, for some important reflections on this point.\nhappiness which a sovereign law has decreed must ever follow the occupations of peaceful industry. I believe the acquisition of property through honest industry is essential to the progress and elevation of our race—the acquisition of that moderate competence which brings with it dignity and independence, not of that unwieldy fortune which too often results only in the degradation of its possessor.\n\nQ. Would the cash or nature's system, prevent the people's currency becoming accumulated in few hands?\n\nA. It would. There could not then be accumulations of mere money. You may easily perceive what sort of despotism may arise when one man becomes virtually the owner of millions of our currency. It would also prevent railroad and other monopolies.\n\nQ. Will it be a sad thing should the interesting races now being brought into commercial relations with us learn, more than they now know, our modern system of finance and currency?\n\nA. A worse calamity could hardly befall these nations. I trust the intelligence of the Japanese and other eastern nations will prevent them accepting such a mass of rubbish at our hands.\n\nQ. Is industry in a sad state?\n\nA. I do not know anything more depressing to the heart of a true philanthropist than to contemplate the degraded condition of labor, with all the suffering, crime and immorality which are the natural results of that degradation. The anxious family cares of those constantly hovering on the verge of poverty can only be known to the toilers themselves. To me there are no thoughts on the subject so unexpressibly sad as those connected with the early toils and sorrows of little children, and here, perhaps, our modern heathenism projects its darkest shadow. Their childish voices are constantly calling upon us to deliver them from their cruel bondage, but philanthropy folds her hands or puts forth only abortive efforts, and the church rests in ease and indifference. If it be true that God regards the tears of those that are oppressed, a judgment great and heavy must fall on society on account of the wrongs done to patient and defenseless industry; and the church, as not the least guilty party, need not hope to escape in the day of trial. These questions in a practical form, will yet shake her to the foundations, and it needs no prophetic eye to see where this judgment must eventually and justly fall.\n\nQ. What do you think will be the condition of the industrial and commercial world of the future?\n\nA. I think it will be marked by four great features—a real, (not nominal merely) cheapening of products, a decrease of profits in the hands of the few, a general distribution of wealth, and an advance in general prosperity. The true dignity of labor, aided as it doubtless will be by forces at present unknown, is one of those full bless-\nings reserved for the coming ages. I doubt not industry and commerce will yet consecrate their great resources to spread the principles of truth and righteousness over all the earth.\n\nQ. With your principles in practical operation, would there be plenty for all?\n\nA. To show how thoroughly industry is ruined by our present system, I may state that Mr. Hoyle in his work \"our National Resources and how they are wasted,\" calculates on data beyond all question that, with our present resources, 1½ hours daily labor of every one able to work \"would suffice to supply us in abundance with all the comforts of life.\"\n\nQ. Could great industrial enterprises be carried on under the principles you set forth?\n\nA. With regard to the present system, surely the economists of the future will regard it as one of the most incomprehensible things how industrial enterprises were ever carried on, a few individuals accumulating the wealth, and the bulk of the workers living and dying in a state bordering on poverty.\n\nQ. What then, is the great problem which the world has yet to solve?\n\nA. How every man shall receive to the full the produce of his own labor. Every man's labor, economically considered, has a certain value, and no more. The problem will be solved ere long. We shall get to the light.\n\nQ. Is there really such a thing as natural price or value?\n\nA. I have no doubt there is. Cost of production as a general rule, must ever be the natural price. Free exchange must, in the end, secure the natural measure of the value of free labor.\n\nQ. What will the legitimate labors of one's lifetime yield him?\n\nA. There will be different opinions according to our different modes of thought. I should say that they will yield him a comfortable maintenance all through life. Others may think that they ought to yield him a surplus of a hundred thousand dollars, or even, it may be, of a million of dollars.\n\nQ. Do you think any man, from his own labor, competent to earn, resent, a surplus of a hundred thousand dollars?\n\nA. I do not. He must get it out of the labor of others.\n\nQ. But do you not lay it down as a principle that when we exchange our products, we do necessarily gain from the labor of others?\n\nA. Yes, and that is the very reason why I say that such a profit must be out of unrequited labor, for there cannot be any true reciprocity in it, seeing the laws of exchange provide a profit for all. The gain of course comes out of hired labor; or, in other words, hired labor is not properly requited; or it may be the case that it is not possible, under a universal system of paper and credit, properly to\nrequite hired labor. Just as, on the other hand, we perceive that large profits are the portion of the successful few, secured to them, to a certain extent, by means of those laws of demand and supply which, legitimate enough in their own nature, are so seriously interfered with and perverted by the modern system.\n\nQ. Can we lay down any rule as to how much the products of industry should yield?\n\nA. Recognizing, as I now do, the essential distinction between paying wages direct for days labor, and paying in the form of hire for the use of the products of labor—how, in the one case what is paid is for human labor, and in the other for that which must ever be gratuitous—it is probable that a more critical investigation into the subject will lead the economists of the future to lay down this principle—that, under ordinary circumstances, and as a general rule, no product of our handiwork can receive more in return than the value of the labor actually embodied in the product, and this irrespective of all considerations as to time, or periods of payment, or engagements of rent.—Again, if nature has decreed that, with regard to the products of industry, we can only reap a profit by exchanges of service through exchanges of these products, it seems to follow that a general system of hiring at days wages by which working men never come to own the products of their industry, must issue in the loss of all profits to the laboring population. By thus getting hold of first principles, we begin to perceive how great a destiny is in store for the world of industry, and how great the change for the better which must eventually pass over the face of society when these principles come to be better understood. In fact, as regards the laws of labor—laws having an immediate and vital interest to all classes—we have been like children blindfolded or groping in the dark.\n\nQ. Suppose I own, in a city, a piece of property which has become very valuable through the approach of wharves and warehouses?\n\nA. So far as mere increase of value is concerned, it is evident that it is not your labor, but the labor of many hands through a course of years which has conferred value on your property. Let us therefore take, just for what it is worth, the pleasurable statement so often set forth about people by their own industry earning such and such a fortune.\n\nQ. Have you been aided, in your investigations, by a previous literature on the subject?\n\nA. Not much. In the name of the God of truth, I call upon young men to bestir themselves, and to aid not only in giving to mankind a pure literature on monetary and industrial science, but in helping forward our deliverance from by far the most cruel bondage which the world has ever seen. These are not the times, amidst the mutterings of the coming storm, for young men to float like swimmers in a sea of confusion, but the time to stand firm, to maintain the right, to help forward the cause of liberty, and to bring the world back to the golden age of peace and plenty.\nlike driftwood on the rising tide. Neither may they, in conducting their worldly affairs, put these solemn questions aside as matters in which they have no responsibility or concern. I invite them to a most interesting field of thought—to noble enquiries, compared with which the petty questions and barren disquisitions of the day sink into utter insignificance.\n\nQ. On what is the Bank of England founded?\nA. On the subversion of the principal truths in political economy.\n\nQ. Do you consider it dangerous to the liberties of the people of England?\nA. My answer to such a question must be gathered from what I have previously stated.\n\nQ. What do you say of christian men who have the management or direction of banking institutions?\nA. I am not called upon to judge my brother—nevertheless I would say that I consider they stand on perilous and slippery ground, and that such work is no fitting work for them.\n\nQ. To take a recent example—do you consider the subscription of 140 millions of pounds sterling to the French loan an evidence of national prosperity?\nA. As much an evidence of prosperity as the gathering of the vultures around the still quivering carcase.\n\nQ. What is the duty of christian men with regard to this system?\nA. So to guide their affairs that they may be entangled as little as possible with it. There can be no doubt that a state of constant indebtedness must act as a barrier to that entire consecration of life and service which God requires at our hands.\n\nQ. Is the church involved in it?\nA. It once opposed it—now it is its best friend.\n\nQ. Which has been the most guilty church in this respect—Protestant or Roman Catholic?\nA. Protestant.\n\nQ. What does ancient literature say of lending money on interest?\nA. Saints and sages with one voice pronounce its condemnation.\n\nQ. Is the Bible opposed to it?\nA. Yes—both in spirit and letter. Let me add, in passing, that the germs of all true political economy are to be found in the Holy Scriptures.\n\nQ. Is this stupendous system of evil foretold in Scripture?\nA. The rise and fall of this, and of some other kindred systems, are there traced as with a sunbeam. It is a system of evil unique in itself, diverse from all kingdoms, which has devoured the industry of the whole earth, and literally broken society in pieces.\n\nQ. Will war terminate with the overthrow of the present commercial system?\nA. I think the period of wars will then necessarily come to an end.\nQ. Where is the responsibility of all this condition of things to be laid?\nA. I lay the responsibility principally at the door of the church.\n\nQ. Will the church yet come in conflict with this system?\nA. Yes—the church will sooner or later arise from her degradation and chains.\n\nQ. Is it of more consequence that the church should address herself to this conflict than that she should prosecute the evangelisation of the heathen?\nA. I believe it is of far more consequence that the church should in the first place, devote herself to the overthrow of this system. What can be thought of the church offering with one hand the gospel to the heathen, and with the other supporting a system whose foul and putrid stream is corrupting every land. Can we wonder that infidelity flourishes?\n\nQ. With reference to money, what is usury?\nA. The interest or increase of money.\n\nQ. Is the idea of its being an exorbitant rate of interest a correct idea?\nA. It is incorrect. A modern idea has crept in at variance with the true meaning of the term as employed in Scripture, a change which, I think, may be traced back to the time when interest began to be legalised.\n\nQ. Does not the Bible, in one instance, permit the lending on interest?\nA. Yes; because of the unrestrained covetousness of the heart, the Jews were permitted to take usury of strangers, just as they were permitted to sell unwholesome flesh to aliens. But the command is, that they take no interest from either brother, stranger, or sojourner. The case of divorce, as interpreted by the Saviour himself, is parallel. These things are not sanctioned because they are permitted. The one written for the hardness of the heart, the other for its covetousness.\n\nQ. What about Luke xix. 23?\nA. It teaches nothing about the question.\n\nQ. What of Romans xiii. 8?\nA. I question if that passage has special reference to money obligations. It is the credit system, associated as it is with interest and paper currency, that we have to dread.\n\nQ. What is the intention of these Scripture usury laws?\nA. The evident intention is to protect labor and thus to secure from poverty, and to promote the peace, comfort, order, and progress of society. Modern sacred criticism has generally justified money lending by setting forth that these usury laws forbid only lending on interest to the poor, a species of criticism which overlooks the most important fact in the whole matter, namely, that\nit is the labor of the working men which sustains and enriches the entire community. If it be a good thing, or profitable to the people in general, to have money lent on interest to the rich, it must also be a good thing to have money lent on interest to the poor men. For if this lending helps a rich man in his labor, it must surely also help a poor man in his labor.\n\nQ. What do you think of Deuteronomy xxiii. 19?\n\nA. The more I reflect on the passage, the more do I see that it embodies the greatest truths in political economy. Industry and commerce will yet accept of these principles in all their integrity. On no other foundation will society ever be able to rear a lasting and comely structure.\n\nQ. How is it that the Scripture commentators have generally erred in their expositions of the usury laws?\n\nA. By not looking narrowly into the nature of money, and from a confusion of ideas as to the principles of exchange, the nature of profits, and the requirements of labor.\n\nQ. Are the ministers of religion bound to understand this question?\n\nA. I do not know of any question which has such strong claims on their consideration. I think the time is at hand when they will not be able to put this question aside. There are imperishable truths in the Old Testament which have been long passed over as a dead letter. I confess that, to me, one of the most painful things in connection with a monetary panic is the repetition from the pulpit of certain stale platitudes about the love of money, commercial honor, the bank of heaven, and so forth—a sort of absolution for the men of commerce in the pews beneath, and all of which can be conveniently folded up in their pocket books and carried into the next speculation without much danger of either disturbing their consciences or interfering with their plans.\n\nQ. Has the introduction of labor saving machinery lessened labor or added to its gains?\n\nA. No, not at all. The very children are now drafted into the factories. This interest and paper system sweeps away everything it can get from industry, even the machinery which is calculated to benefit labor not being permitted to confer such benefit.\n\nQ. Where does usury or interest most thrive?\n\nA. Where industry and exchange are most active. This deceives many into the belief that it helps industry.\n\nQ. Would the practical recognition of the doctrines set forth in our discussion prove a benefit to labor?\n\nA. It would make such a revolution for the better that the world would hardly know itself. My hope is that all teachers of youth may investigate these doctrines for themselves, so that colleges and schools may communicate sound instruction on the subject.\nQ. Have we seen the worst of this system?\nA. I question if we have. It may yet have further unfoldings. What mind is competent to fathom this mysterious system of iniquity? We are struck with awe as we contemplate so vast a conspiracy against all that is good—in its endless ramifications throughout society—in the barriers it has reared against the progress of the gospel—in its destruction of the very framework of society, elevating the few, crushing the many—in its power to tax, with a severity which is never for a moment relaxed, every form of industry, and every product of toil—and in its insidious overthrow of every principle of righteousness and truth. The commercial world stands on the edge of a volcano. The unhappy world of labor is giving portentous signs of awakening and discontent, and there are mustering forces at work which must terminate in such a conflict as the world has never yet seen. Will it be contrary to the ordinary dealings of God's providence should the downtrodden millions be made the instruments by which the magnificent fruits of their industry are swept from the hands of their possessors like the chaff of the summer thrashing floor.\n\nQ. Has the system operated prejudicially on the great interests of our race?\nA. In degrading to a low condition such a large proportion of the human family it has indeed proved most disastrous to the race. The great interests of religion, education, public virtue and sobriety have all suffered. Millions of human beings have become sunk in coarseness, degradation, and practical infidelity; and even the wealthy classes, with all their glitter and splendor, are fostering a spurious civilization, in many of its effects more blighting to society than even those flowing from the sad condition of the sons of toil. In the midst of a world teeming with plenty, the great majority of men pass through life in a constant struggle for existence. And, to sum up the whole, the modern mercantile system, in its ceaseless toil of mind and body, is wearing down humanity at a rapid rate, a fate which is not confined to the oppressed, but which is shared in to a large extent by the oppressors themselves.\n\nQ. You do not mean to allege that there is intentional oppression?\nA. God forbid. I bring no railing accusation against my fellow men, however heavy the indictment I frame against a system, the one half of whose oppressions to our race never can be told. Great systems of evil have crept upon the world unawares—they could hardly accomplish their mission of wickedness did they come amongst us \"with observation.\" We are all responsible, however, for our acts and for our belief.\n\nQ. Will the system pass away?\nA. Yes, it will pass away.\nNEW PUBLICATIONS.\n\nRecently published, by the same Author, The Labor Question: or Thoughts on Paper Currency and Lending on Interest, as affecting the Prosperity of Labor, Commerce, and Manufactures.\n\nPhiladelphia: J. B. Lippincott & Co. London: Sampson, Low, Marston & Co. Montreal: John Lovell. Rouse's Point, N. Y.: John Lovell & Sons. Price one dollar.\n\nOPINIONS OF THE PRESS:\n\n\"The topics are considered with great thoroughness and independence of thought....This work ought to be attentively considered.\" —N. Y. Tablet.\n\n\"This work seems to us to come right to the core of the vexed labor question, and solves many difficult problems.\" —Dubuque Daily Times.\n\n\"This work deserves careful reading, and to be appreciated it must not only be read but studied......We regret that we have so little space to devote to it, but will draw from its pages hereafter: and in the meantime we commend it especially to the young men of the country in whatever vocation of life they may be engaged.\" —Memphis Avalanche.\n\n\"Ch. 10 qui traite des prêts à intérêts, est admirablement raisonné—une critique admirable. Nous aurions désiré un plus long article au ch. 15 qui traite des emprunts ecclésiastiques. Nous recommandons l'étude de ce court chapitre comme suggérant des profondes pensées\"—L'Aurore, Montreal.\n\n\"An able treatise\"—N. Y. Home Journal.\n\n\"He has read much and thought much; and besides all considerations of natural reason by which to sustain his position, he draws largely from the Scriptures for argument.....he utters much truth deserving of earnest consideration.\" —Boston Christian Register.\n\nThose who desire to circulate the above work can have it in limp covers, by the dozen copies, at reduced rates, by addressing Mr. Lovell either at Montreal or at Rouse's Point, N. Y.\n\nCopies of the Catechism will be furnished by the hundred or thousand at the rate of 5 dollars per 100 (which includes Canadian postage on 100 copies.) These for the present can only be had from Mr. Lovell. The Author will be glad if friendly readers will aid him in the circulation of this Catechism, and parties who may prefer to address him with their orders may do so to the care of Mr. Lovell as above. Any sums sent to him direct will be applied to further the circulation of these productions in accordance with the wishes of the donors.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_13607.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 76, "total-input-tokens": 125746, "total-output-tokens": 40672, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 840, 3], [840, 3360, 4], [3360, 3616, 5], [3616, 4582, 6], [4582, 5649, 7], [5649, 7859, 8], [7859, 10152, 9], [10152, 12329, 10], [12329, 14841, 11], [14841, 17451, 12], [17451, 19830, 13], [19830, 22585, 14], [22585, 25208, 15], [25208, 27639, 16], [27639, 30567, 17], [30567, 32961, 18], [32961, 34996, 19], [34996, 37176, 20], [37176, 39208, 21], [39208, 41879, 22], [41879, 44252, 23], [44252, 46568, 24], [46568, 49106, 25], [49106, 51732, 26], [51732, 53824, 27], [53824, 55754, 28], [55754, 58348, 29], [58348, 60932, 30], [60932, 63290, 31], [63290, 65225, 32], [65225, 67610, 33], [67610, 70198, 34], [70198, 72759, 35], [72759, 75331, 36], [75331, 77623, 37], [77623, 80178, 38], [80178, 82668, 39], [82668, 85416, 40], [85416, 87499, 41], [87499, 90338, 42], [90338, 93002, 43], [93002, 95159, 44], [95159, 97416, 45], [97416, 99391, 46], [99391, 101799, 47], [101799, 104364, 48], [104364, 107009, 49], [107009, 109648, 50], [109648, 112022, 51], [112022, 114454, 52], [114454, 116809, 53], [116809, 119289, 54], [119289, 121797, 55], [121797, 124114, 56], [124114, 126579, 57], [126579, 129239, 58], [129239, 131628, 59], [131628, 134348, 60], [134348, 137127, 61], [137127, 139773, 62], [139773, 142602, 63], [142602, 145341, 64], [145341, 147805, 65], [147805, 150507, 66], [150507, 153200, 67], [153200, 156008, 68], [156008, 158619, 69], [158619, 161646, 70], [161646, 164089, 71], [164089, 166521, 72], [166521, 169200, 73], [169200, 171914, 74], [171914, 174244, 75], [174244, 174244, 76]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]