[{"id": "6cd4b1e61bb3e6958feddb711b0382df17d48587", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☑ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 12X 16X 20X 24X 26X 28X 30X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —— (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nNORTHERN RAILWAY OF CANADA.\n\n\"THE BARRIE SWITCH.\"\n\nREPLY BY THE DIRECTORS\n\nA \"BRIEF STATEMENT\" CIRCULATED IN THE LEGISLATURE.\n\nTORONTO.\n1862.\nMEMORANDUM\n\nBY\n\nThe Directors of the Northern Railway of Canada\n\nIN REPLY TO\n\n\"A BRIEF STATEMENT RELATIVE TO THE BARRIE SWITCH.\"\n\nA pamphlet entitled \"The Barrie Switch,\" having been circulated in the legislature, professing to give the history and correspondence connected with that question, but omitting some of the most important transactions and documentary records relating to it: the directors of the Northern Railway feel it their duty to submit a more perfect and accurate narrative of the whole matter: observing, that throughout this vexatious controversy, they have been guided alone by a desire to fulfil the duties attaching to their position as trustees, under, and responsible to, the law.\n\nThe construction of the Northern Railway was commenced in 1850, and the company was entitled to government assistance in the form of guarantee.\n\nThe inhabitants of the town of Barrie had been amongst the most active originators of the railway, and we find their interests protected by the 1st clause in the original charter, which directs that the railway shall be constructed from Toronto \"to some place on the southerly shore of lake Huron, and touching at the town of Barrie, or at some point or place on the shore of lake Simcoe, and in as direct a line as may be convenient.\"\n\nThe present \"Barrie station\" is on the water's edge of lake Simcoe, and within seventy-five yards of the town of Barrie, and therefore complies with the stipulations of the act above quoted.\nBefore any surveys or explorations had been made, it was proposed to carry the railway to Penetanguishene, the only possible route to which would have been through the heart of the town of Barrie.\n\nSubsequently, however, Collingwood was adopted by the railway commissioners as the northern terminus, and it thus became unnecessary to pass through the town of Barrie. By the Guarantee Act, 14 & 15 Vic., ch. 73, sec. 18, it was enacted that \"No railway company shall be entitled to the benefit of the said guarantee, until the said board (of railway commissioners) shall have examined and approved of the line selected,\" * * * \"and the line and mode of construction so approved, shall not be altered or deviated from, on pain of forfeiting the right of the company to the said guarantee.\" Under those powers the railway commissioners themselves determined the location of the line in the neighbourhood of Barrie, and they, not the directors, fixed the line and station where they are.\n\nFinding that the line was to be carried to Collingwood instead of to Penetanguishene, the inhabitants of Barrie commenced an agitation for the construction of a branch line which should have its terminus in the heart of the town.\n\nThe engineers of the company, unanimously, and at all times, represented to the directors that such a branch would be utterly valueless both to the town and to the company, but their opinions were rejected, and the directors (of whom Mr. Angus Morrison was one) yielding to a continued and persistent pressure, at length agreed to construct the branch, conditionally however upon the approval of the railway commissioners being first obtained; and also upon the town of Barrie providing all necessary lands free of cost to the company.\n\nAt the very time, however, that the directors thus conditionally assented to a branch line, the capital of the company and the provincial guarantee were fully pledged and exhausted, and there were no funds from which the cost of its construction could be met; the scheme had not then (and has never yet) been approved by the railway commissioners: the right of way and lands have never yet been provided by\nthe town of Barrie: and on the only occasion that the subject was brought to the notice of the shareholders, a resolution was adopted declaring that \"it was inexpedient to construct any branch line at present,\" and that no such work was to be undertaken without the express sanction of the stockholders, which has never since been given.\n\nYet the directors (of whom Mr. Angus Morrison was one) proceeded to advertise for tenders for the construction of the branch, and on the 28th of June, 1856, the committee appointed for the purpose (and of which Mr. Angus Morrison was a member) recommended the acceptance of Mr. Albert McGaffey's tender.\n\nIt has been alleged that a contract was entered into with that person, but no record authorising it is to be found on the directors' minutes; no instrument of that character has ever been seen by the company's officers; and at the date that it is declared to have been made the company's means were utterly exhausted, and it was in fact bankrupt.\n\nAs far as reliance may be placed on rumour, (for the amount of McGaffey's accepted tender is nowhere mentioned in the books of the company!) McGaffey was to receive £6000 in bonds for the work, but as the issue of such bonds would have been illegal and fraudulent, and as McGaffey's status was not such as could provide credit, the works were not proceeded with.\n\nNo further steps of any sort were taken in the matter for nearly a year, when in reply to enquiries from the council of Barrie, the directors, on the 27th of March, 1856, announced that \"the financial position of the company precluded the possibility of proceeding with the work, or of designating a time when it could be entered upon.\"\n\nAlthough the town of Barrie had authorised the issue of municipal loan fund debentures to the amount of £3000, for the purpose of providing the right of way under the condition before referred to, the lands had not been secured, nor had the moneys been disbursed at that time.\n\nIn the pamphlet to which reference has been made, it is stated that the town of Barrie \"raised the sum of £3000\" and duly procured the land and water frontage and right of\n\"way required by the company, and the conveyance from\n\"the proprietors thereof was accepted by the company as\n\"being complete in every respect for the purposes of the said\n\"road.\"\n\nThe directors challenge the truth of this statement—they\npositively and unhesitatingly deny that the right of way\nrequired for the branch had ever been secured: they assert\nthat (with two or at most three unimportant exceptions) no\nlands whatever have been purchased from, and no convey-\nances made by, the original owners, with whom the titles still\nrest; but on the contrary that the £3000 above named has\nbeen applied, not to the purchase of this right of way, but\n(as testified to on oath by the treasurer of the Barrie cor-\nporation) to the erection of a town hall and market place in\nBarrie, by which act as well as by the withdrawal of certain\nsums lodged in the Court of Chancery for land purchase, it\nwas understood and conceded at the time, that the scheme\nof constructing the branch line had been mutually aban-\ndoned.\n\nIf the directors are right in this statement (and they chal-\nlenge a disproof of it) then it is clear that as the town of\nBarrie has failed in the performance of the condition prece-\ndent upon which alone the company undertook to construct\nthe branch, it will be difficult to establish any cause of dam-\nage against the company.\n\nFrom the date above-named, (27th March, 1856) to the\n6th December, 1859, no further steps seem to have been\ntaken towards promoting the construction of the branch,\nbut (so far as any record in the possession of the company\nis concerned) there seems to have been, for the space of\nnearly four years, a tacit abandonment of the scheme.\n\nDuring that period the financial difficulties by which\n(from 1853-54) the company had been embarrassed, con-\ntinued to increase; the line fell into utter dilapidation, and\nwas declared by the government inspector of railways, to\nbe unsafe for public use; the wages of the employees were\nlargely in arrear; the revenues were unequal to the working\nexpenses; and the continued operation of the road became\nimpossible in the absence of legislative measures of relief.\n\nTo\n\nand on\n\ntieal a\n\nTho\n\nfollows\n\nThe\n\nprovincial\n\nof the\n\nallowing\n\nprivate\n\nfirst an\n\nthat £\n\nshould\n\ndealing\n\nshould\n\nthat on\n\nshould\n\nfull and\n\nthe econ\n\nIt is\n\nnew ear\n\nrailway\n\ndefined.\n\nhave been\n\nYet a\n\nbeen st\n\nSo far\n\nhave ne\n\nthe Ban\n\nmessage\n\nits non-\n\nthe act.\n\nof Mr.\n\nrecogni\n\n1859, (c\n\nhis claim\n\nI had\n\ncouncil,\nTo effect such relief the act 22 Vic., ch. 89, was passed, and on the 11th May, 1859, an order of council gave practical application to that law.\n\nThe object and provisions of the said act may be stated as follows:\n\nThe government being itself unprepared to make further provincial investments in the line, agreed that on condition of the raising of sufficient new capital, the then first lien of the province should recede into the third rank for security, allowing (in consideration of the increased investment of private capital) a priority for security and interest to the first and second classes of bonds. The act further provided that £50,000 of the new issue of first preference bonds should be appropriated to the liquidation of the then existing debts of the company; that all debts and claims should be proved before the 31st of December, 1859; and that on that date the said amount of bonds (or their proceeds) should be divided pro rata amongst the proved creditors, in full and final settlement and extinction of every liability of the company.\n\nIt is quite clear that in the absence of such provisions no new capital could have been raised with which to restore the railway, for unless the debts of the company had been so defined, limited and liquidated, the new investment would have been utterly insecure.\n\nYet all reference to the provisions of this act seem to have been studiously omitted from the pamphlet under revision.\n\nSo far as the information of the directors extends, they have no knowledge that any claim for the construction of the Barrie branch was made or recognised during the passage of the measure; nor was any demand for damages for its non-construction submitted within the period limited by the act. On the contrary they have the written testimony of Mr. Angus Morrison himself that no such claims were recognised, for in his published letter of the 6th December, 1859, (eight months after the passage of the act,) in reviving his claim for the construction of the branch he says: \"If I had been disposed to clog the relief bill, or the order of council, with a condition that the company's agreement to\nbuild the branch should be carried out, most assuredly such would have been the case; but believing that such a condition would have had the effect of delaying an immediate settlement with the English bondholders, I withdrew the application which was in the hands of the Government at the time.\" Thus, on Mr. Morrison's own statement, there is no escape from the conclusion, either that the claim for the branch was then abandoned in order to secure the passage of the bill, the raising of the new capital, and the restoration of the road; or, the claim was omitted from the act with the deliberate object of misleading the bondholders to make new investments for the suppressed purpose of the branch.\n\nWhilst the directors reject the latter inference, as unworthy of the writer of the letter, they cannot refrain from observing that if a compulsory construction of the branch would have been fatal (as it undoubtedly would) to the objects of the bill, it would illustrate a most grave breach of faith now to enforce such a condition upon those who, relying upon the plain interpretation of the act, have invested £250,000 sterling under the security it affords.\n\nThus, the act made no provision whatever for the construction of the branch, and inasmuch as no claim for compensation for its non-construction was made, or proved within the period allotted by the law, the directors, under advice of counsel, subsequently declined to entertain the question, in regard to which they had no legal power, and no funds which could legally be so applied.\n\nIn consequence of such refusal, appeal was made during the session of 1860, for such an amendment to the act of 1859, as would enforce the payment of the claim; but the bill was subsequently withdrawn under an agreement to refer the dispute to the arbitration of Mr. Thomas Galt, Q. C. (See Appendix A.)\n\nOf the reference to that gentleman, and of his award, no mention is made in the pamphlet recently circulated by Mr. Morrison; the directors however think it only necessary to state that the effect of that award was to declare that \"it would be contrary to the provisions of the legislature, and\na breach of trust on the part of the directors to expend any moneys in fulfilment of any such obligation” as that alleged by the town of Barrie. (See Appendix B.)\n\nThe directors had a right to expect that such a judgment would relieve them from any further coercion in regard to the claim.\n\nMuch to their surprise, however, the bill withdrawn in 1860, was re-introduced by Mr. Morrison during the session of 1861, to which renewed opposition was offered by the company, resulting as before in the withdrawal of the measure, and the re-submission of the whole case to arbitration; for the directors, weary of parliamentary warfare, and of the disturbing influence of a local hostility, conceived it to the interest of the company to succumb to a limited exaction, however unjust, rather than to involve the whole issue of the bonds (£534,000 sterling) in the discredit of a ceaseless and mischievous agitation. The previous arbitration having resulted in the legal acquaintance of the company, the only terms for peace now open to the directors were to consent to a reference apart from and independent of the law, and it was upon an agreement to that effect that the case finally went to the Hon. Mr. Harrison.\n\nThe directors gave exact and faithful effect to the conditions of that agreement, and the case was duly heard by Mr. Harrison, who on the 31st of January, 1862, made and published his award.\n\nThe pamphlet referred to professes to publish that award, but the whole preamble (containing the important paragraphs upon which the subsequent proceedings were based) has been omitted.\n\nIn that preamble Mr. Harrison thus expresses himself:\n\n“That reference being had to the agreement in the said memorandum of agreement by which this award is to be made, as though the several acts of parliament therein referred to had not been passed, I award, adjudge and find, that the said claim of the said corporation of the town of Barrie, to have the said agreement performed, is still subsisting, and if not performed, their right to compensation in lieu thereof ought to be awarded.”\nThe directors, in accordance with their universal practice, submitted the award to their counsel, who, in conjunction with the Hon. J. H. Cameron, Q. C., advised that, in their opinion, the award was defective, as being indefinite in its language, and seeming to afford the company an option either to construct the branch, or to pay £5,000 damages for its non-construction; and accordingly, that the judgment of the Court of Queen's Bench ought to be obtained in regard to it.\n\nThe award was subsequently sustained by the court, which, however, gave no judgment as to the legality of the reference, a question not raised or argued before it.\n\nImmediately, thereupon, notice was served upon the directors by certain bondholders, (\"Dunn and others,\") acting independently, and without the cognizance of the company, not to make any payments to the Town of Barrie, pending proceedings in Chancery, instituted by them against the company, in protection of their individual vested rights; and upon the special ground that the directors had improperly and illegally consented to a reference ignoring the law by which those rights had been secured and were protected.\n\nNo one need be surprised that these bondholders should adopt any course protective of their personal interests: for it is certain that (the £50,000 appropriated for liquidating the debts of the company having been disbursed as directed by the act) any moneys now paid to the town of Barrie must represent a deduction of like amount from the interest payable on their bonds.\n\nFor these proceedings in Chancery however the directors are wholly irresponsible; and they have taken no part in them, excepting, by their counsel, submitting themselves silently to the judgment of the court; the effect of which judgment has been the issue of an injunction restraining the company from paying and the town of Barrie from receiving any moneys under the award of Mr. Harrison.\n\nAs all mention of this injunction, and of the judgment of Vice-Chancellor Spragge, has been omitted from the pamphlet circulated in the legislature by Mr. Morrison, the directors invite any party interested to bring it to their attention.\n\nThe vice-chancellor declares the award to be untenable, and directs the money to be paid into the branch, pending the decision of \"a person of proper cognizance.\" (Mr. Morrison, for the purpose of Mr. Morrison, Barrie.)\n\n\"to say,\"\n\n\"it is sure,\"\n\n\"my judgment.\"\n\nThe company,\n\n\"The proceedings,\"\n\n\"injunctive,\"\n\n\"from payment,\"\n\n\"pality,\"\n\n\"way said,\"\n\n\"ings of,\"\n\n\"receiving,\"\n\n\"and from,\"\n\n\"way or,\"\n\n\"to, or,\"\n\n\"ing the.\"\n\nYet, remarks Mr. Morrison (aequus), viz., on the point of \"all costs,\"\n\n\"the town,\"\n\n\"line,\"\n\n\"notice of,\"\n\n\"establish such,\"\n\n\"local party.\"\n\nSo extraordinary a contempt of the law was immediately felt whose opinion\ninvite a careful perusal of the latter most important document. (See Appendix C.)\n\nThe Vice-Chancellor, after reviewing the whole case, there declares that the claim of the town of Barrie is illegal and untenable, and that were the directors to appropriate any of the moneys of the company either to the construction of the branch, or to the payment of the award, they would be guilty of \"a plain breach of trust,\" of which the court would take cognizance; and, (referring to the bills introduced by Mr. Morrison during the sessions of 1861 and '62, for the purpose of establishing and enforcing the claim of the town of Barrie,) the Vice-Chancellor significantly adds, \"I have only to say, that if the bills had become law, the passing of which it is suggested were stayed by the agreement to arbitrate, my judgment would have been the same as it is.\"\n\nThe conclusion of the judgment is in the following words: \"The plaintiffs\" (Dunn and others) \"are entitled to an injunction restraining the railway company and its directors from paying the amount of the award in favour of the municipality of the town of Barrie, or any part thereof; or in any way satisfying the claim of the municipality out of the earnings of the railway; and restraining the municipality from receiving such payment or satisfaction out of such earnings, and from enforcing such payment by levying upon the railway or any rolling stock thereof, or anything else necessary to, or ordinarily used in, the working, repairing, or managing the same.\"\n\nYet, regardless of such judgment and injunction, Mr. Morrison (acting as \"solicitor for the town of Barrie,\") has since viz., on the 30th December last, urged the directors to \"pay all costs of suits, disbursements and liabilities incurred by the town of Barrie; and to build and construct the branch line,\" threatening in the event of their refusal to \"give notice of the bill\" (now before the legislature) and to publish such notice \"in the London Times, England, and the local papers forthwith.\"\n\nSo extraordinary a demand, indicating as it did an entire contempt for the orders and powers of the Court of Chancery, was immediately referred by the directors to their counsel, whose opinion was given as follows:\nTORONTO, Feb'y. 7th, 1863.\n\n\"I beg to acknowledge the receipt of your letter of the 27th January, containing a reference of the correspondence which has taken place between the board of directors and Mr. Angus Morrison, respecting the Barrie switch, and requiring my opinion as to the proposals of Mr. Morrison, and the power of the directors (in view of the existing injunction in Chancery) to comply with them, assuming (which has not yet been discussed) that such proposals were otherwise open to acceptance.\" In reply I beg to state that in my opinion the earnings of the company have been specifically appropriated by the Legislature, and that the directors have no power to apply them in any other manner than that pointed out by the act of parliament. If the company are possessed of any other means than those arising from \"the earnings\" they might, if they thought it for the interest of the company so to do, enter into an arrangement for the construction of the proposed switch; but if they are not, they cannot enter into any arrangement, without, in my opinion, violating the provisions of the act, and subjecting themselves to an application to the court of Chancery at the suit of the bondholders. It is true that on referring to the injunction issued by the court of Chancery (a copy of which I this day received from Mr. Boulton) I find that it points only to the payment of Mr. Harrison's award, but I entertain no doubt that it would be extended to the appropriation of any of the earnings of the company in contravention of the terms of the act, and I am of opinion that the construction of the switch proposed by Mr. Morrison would be such a contravention.\n\nSincerely yours,\n\nTHOMAS GALT.\n\nThe directors having thereupon declined to accede to the demands of Mr. Morrison, his threat has been fulfilled by the extensive advertisement of the following notice:\n\nNOTICE\n\nIs hereby given, that the town of Barrie, judgment creditors, bond and stockholders of the Northern Railway of Canada, will make application at the next session of the legislature for certain amendments to the charters of the said company, as follows:\n\n1. To prevent the presidents, directors, managers, and officers, owning or running steamboats in connection with the railway.\n\n2. That the company shall be liable to pay all moneys due to creditors, and the amount of the representation of the town of Barrie.\n\n3. That the company shall be liable to pay all moneys due to creditors, and the amount of the representation of the town of Barrie.\n\n4. That the company shall be liable to pay all moneys due to creditors, and the amount of the representation of the town of Barrie.\n\nToronto, Feb'y. 7th, 1863.\n\nThe above notice is given as it is understood, but the directors observe that the facts do not justify creditors in believing there are any defects in the proceedings.\n\nSuch is the case.\n\nThe directors have considered the features, advantages, and propriety, which would result from excessive legislation, and by observation, experience, and amendment, have determined upon the wisest course. The question involving the charter of the company has, by the unanimous consent of one member of each county, been referred to the county of Barrie, for the purpose of use and the best possible partial efficiency.\n2. To increase the number of the Canadian directors, so that the government lien of $3,000,000, \"the people's money,\" may be, in common with other interests, fairly represented at the board meetings.\n\n3. To explain the meaning of the 2nd section of the act passed in 1859, entitled an act relating to the said railway; and the 4th section of the Executive Council order, passed under the authority of said act.\n\n4. To remove doubts, if any, as to liability of the company to pay out of the earnings of the road a judgment debt of £5,000, justly due the town of Barrie, or in lieu thereof, to compel the company to build a branch line into the town of Barrie, in accordance with the plans adopted under board, dated 27th January, 1853.\n\nMORRISON & SAMPSON,\n\nSolicitors.\n\nToronto, 20th January, 1863.\n\nThe animus and intention of the above notice, calculated as it is to depress the credit of the company, are self-evident; but the directors would fail in their duty did they omit to observe that even the title of it involves statements which the facts do not warrant; for, happily, there are no \"judgment creditors\" of the company in Barrie or elsewhere, nor are there any \"bondholders\" in that town who have authorized the proceedings of Messrs. Morrison and Sampson.\n\nSuch is a brief and accurate narrative of the whole case. The directors abstain from any general discussion of its features, lest they might be betrayed into expressions of severity, which from the first it has been their study, even under excessive provocation, to avoid. They content themselves by observing that the act of 1859, which it is now sought to amend, has fulfilled all its objects, and has entirely justified the wisdom of the legislature in passing it; for without involving the province in the contribution of a single dollar, it has, by the security it afforded to a new capital of upwards of one million dollars (and expended almost wholly in the county of Simcoe) enabled the company to liquidate all its debts, and to restore the railway (previously unsafe for public use and ordered to close its traffic) to a condition of substantial efficiency second to none upon the continent: whilst it\nhas so promoted the development of its trade, that without any the slightest increase in its tariff, the railway, which before was worked at a loss, now contributes annually, by the payment of interest on the first bonds, to the revenues of the province.\n\nSuch results would seem to imply not only successful legislation, but faithful management; and apart from considerations of public faith and vested rights should suffice to indicate that any revision of the act of parliament under which they have been achieved would be as inexpedient as unnecessary, and would be fraught with danger to every interest connected with the railway.\n\nBy order of the board,\n\nJ. BEVERLEY ROBINSON,\nPresident.\n\nFRED. CUMBERLAND,\nV. P. & Managing Director.\n\nToronto, 6th April, 1863.\n\nAPPENDIX A.\n\nTo THOMAS GALT, Esq., Q. C.—In the matter of reference between the municipality of Barrie and the Northern Railway Company of Canada.\n\nThe municipality of Barrie claims compensation from the railway company to the amount of £11909 3s., for an alleged breach of engagement on the part of the railway company, to construct a branch line from the present Barrie station to Mr. McWatt's wharf.\n\nOn consideration of the statement of the claim as presented by Messrs. Morrison & Sampson, the undersigned on behalf of the said railway company begs leave to submit:\n\n1. That the act 22 Vic., ch. 89, and the order of the Governor in Council founded thereon, and dated 11th of May, 1862.\n\n2. That the said act does not contemplate the alleged breach of engagement, or authorize the railway company to make any compensation.\n\n3. That the said act does not constitute sufficient proof of the alleged breach of engagement, and that it was not made with the intention of breaching any agreement.\n\n1. That the said act does not constitute sufficient proof of the alleged breach of engagement, and that it was not made with the intention of breaching any agreement.\n\nBy the authority of the Council.\n\nCouncillors.\n\nThe same will be paid by the bondholders of the said parties, other than those whose payments are already made.\n\nAnd whereas the said act does not extend to any other than those who have not executed their bonds, and cannot be made liable to any amount exceeding £50,000.\nMay, 1859, is a bar to any such claim against the company.\n\n2. That if the directors of the late company entered into the alleged engagement it was without the knowledge, consent or authority of the shareholders, without the sanction of the railway commissioners, in excess of their legal powers, and is accordingly void.\n\n3. That even if such engagement were made under sufficient powers, and were otherwise binding upon this company, it was conditional in its nature, and has been voided by breach and non-performance on the part of the municipality.\n\n1. The transactions relied upon by plaintiffs as cause of damage, occurred between the end of January, 1853, and March, 1856. Subsequently to that period (viz., in 1859) and consequent upon the bankruptcy of the company and the dilapidation and unsafety of its works, an act of Parliament (22 Vic., ch. 89) was passed, by which \"the railway with all the appurtenances and appliances thereof, whether consisting of real or personal property, its rolling stock and plant, and all the corporate rights and privileges of the company, were transferred to and vested in the Crown.\"\n\nBy the same act power was given to the Governor in Council to sell the said properties and franchises, or if the same were not sold to revest them in the company or in its bondholders, or in both, conditionally, however, upon such parties undertaking to raise new capital and to do certain other things therein recited.\n\nThereupon the said properties and franchises being then absolutely vested in the Crown, the Governor in Council by an order dated 11th May, 1859, did conditionally revest the said properties and franchises in a new company composed of both the shareholders and bondholders of that whose properties had been previously seized by the Crown.\n\nAnd that order (which has since been embodied in full in an act 23 Vic.) provided and required amongst other things that a new issue of first preferential bonds, not exceeding in the whole £250,000 sterling, should be made; and that of that issue bonds to the amount of £50,000 sterling, should be withheld from sale until 31st of\nDecember, 1859, \"when the same should either be delivered to the present creditors of the company or sold for their benefit.\" And it further directed that the balance of the said issue not so appropriated to the creditors of the company should be applied under governmental supervision to the repair and restoration of the railroad and its appurtenances.\n\nAnd the said order further required and provided that the revenues of the railroad should, after paying the annual working expenses thereof, be carried to the credit of the several classes of securities, according to their respective ranks.\n\nNow the words of the order and of the subsequent enactment are specific, to the effect that bonds to the amount of £50,000 sterling should be set apart for the benefit of the then \"present creditors of the company,\" and should be delivered to them on the 31st December, 1859, in final and complete liquidation of their claims. Nor did that limitation in regard to the amount, or in the time within which proof should be established, involve any injustice; because government and parliament were dealing with a bankrupt estate upon which the province had a first and indisputable lien; on the contrary, it represented a generous provision for the creditors, for whose behoof that amount of new capital was to be raised, and who had no resources as against the company, all of whose properties were actually forfeited to the Crown.\n\nAgain, if that limitation as to amount had not been specifically enacted, or in other words, if the liabilities of the company had been undefined, it would have been impossible to raise new capital, the new issue would have had no value, and the creditors would have had no relief: and it is worthy of note, that in view of the necessity of that limitation, and in order to give a value to the new issue, the government itself, as well as the bondholders, forfeited or postponed claims for arrears of interest amounting to nearly £120,000 sterling.\n\nIt is clear then that it was one of the ruling purposes of the act and order to void all other claims than those provided for by it, until December, 1859, when the claims of the creditors until then unfunded could be executed.\n\nAnd this legally and practically a limitation of liability, and it is equally true that it cannot be avoided.\n\nI submit that for damages, the order and request for a claim, in pursuance of distribution to the company, of the capital of the company hypothecated for restoration, stand plainly raised from the authority from which they arise.\n\n2. I shall engage Barrio to the knowledge of the commissioners, and engagements made upon until\n\nI shall and I will it my duty to founded, could be interest an\nfor by the issue of £50,000, to be distributed on the 31st December, 1859, to the then \"present creditors\"; and as the claim of the present municipality of Barrie was not made until long subsequent to that date, it must, on that ground, be excluded from participation in the benefits of that issue.\n\nAnd inasmuch as the revenues of the company are specifically appropriated to other purposes than the liquidation of liabilities accrued prior to the date of the said act and order it is equally clear that the claim of the municipality of Barrie cannot be established or legally paid as a charge upon them.\n\nI submit therefore that if the plaintiffs ever had any claim for damage (which I deny) it has been voided by the act and order above recited.\n\nShould the arbitrator adjudge otherwise I respectfully request him to denote from what funds of the company such a claim can be legally paid, having regard to the facts that in pursuance with the provisions of the act in that behalf the distribution of the £50,000 allotted to the creditors of the company has already been made, and that the whole balance of the capital has, in further compliance with the law, been hypothecated under contract for the purposes of repair and restoration of works, and that the revenues of the company stand pledged by law to payment of interest on the capital raised for the purposes of the act, and other classes of security from which such revenues cannot legally be diverted.\n\n2. I submit that if the directors entered into the alleged engagement to construct a branch railway into the town of Barrie they did so in excess of their legal powers, without the knowledge, assent, or authority of the shareholders of the company, and without the sanction of the railway commissioners required by law; and accordingly that such an engagement is void, and the claim of the municipality thereupon untenable.\n\nI shall not presume to discuss an objection so purely legal, and I will venture to say so palpably just. But I think it my duty to urge the protection of the law against claims founded, as I believe this to be, upon a breach of it. Nothing could be more dangerous, nothing more disastrous to the interest and credit of railway property, than that unlimited\npowers (and such as this claim attributes) should be granted to or exercised by a board of directors; and this axiom is strongly illustrated by the fact that when the alleged engagement first came to the knowledge of the shareholders of this company in general meeting (although it had already been voided by non-performance of conditions and abandonment on the part of the municipality) an unanimous stock vote was carried strongly condemnatory of the proposed branch, and instructing the then directors not to engage in this or any other extension of the company's line without the previous consent and authority of the proprietors in general meeting.\n\nNor can the municipality plead ignorance of those requirements of the law which limit the powers of directors, for it has from the first been guided by the same high authority by whom this claim is promoted, an authority that unites legislative experience to legal practice.\n\nI submit, therefore, that if in entering into the engagement relied upon as the basis of this claim the directors exceeded their legal powers, the municipality cannot recover any damages against the company.\n\n3. But I proceed to show that even if such an engagement to construct this branch line were made by the directors under sufficient legal powers, it was conditional in its character, and has been voided by breach and non-performance on the part of the municipality.\n\nThe plaintiffs aver that a resolution of the board adopted 27th January, 1853, (marked A.) is evidence that the directors then intended to build the main line through to the town of Barrie, but after mature consideration, with the view of saving £10,542, the company agreed, at the suggestion of their chief engineer (F. W. Cumberland) to lay down a branch line for the service of that town.\n\nThe premise and the deduction are equally false. The facts are these:—The original proposition was to establish the terminus of the main line at Penetanguishene, and that was impossible without passing round the head of Kempenfeldt Bay and through the town of Barrie. Subsequently, and under the direction of the Government, Collingwood\nwas adopted as the northern terminus, and it then became not only unnecessary to go into Barrie, but such a location would have involved a useless extension of length by excessive curvature, a profligate waste of money, and an example of engineering wilfully and ridiculously bad. It was then that an effort was made to induce the directors to carry the main line into the town of Barrie at an extra cost of £10,542, but this the directors declined to do, the railway commissioners having refused their sanction and having declared that no government aid would be given to the company if such a line were adopted.\n\nBut the directors, acting under local pressure, did, by that resolution of 27th January, and as I submit in excess of their powers, agree to the construction of a branch line conditionally upon the municipality of Barrie providing all right of way, terminus, and borrowing land, free of cost to the company.\n\nBy a subsequent resolution, (8th April, 1853,) the municipality was informed, that before the company could take any steps in the matter, the branch line must first be sanctioned by the railway commissioners, and which, to this day, has never been obtained.\n\nAgain, on the 28th July, 1853, the municipality still urging the company to proceed with the branch, the directors declared, by resolution, that upon none other than the conditions already named would the company act, adding that the board would \"render every facility under the powers of the act, and which may be given consistent with a full and complete indemnity to the company from all costs and charges, legal or otherwise, in regard to the matter, it being understood that the inhabitants agree, and are prepared to meet the same.\"\n\nIt was not, however, until the 27th March, 1854, that the by-law was passed, enabling the municipality to raise the money requisite to the purchase of the right of way, in compliance with the conditions.\n\nOn 5th October, 1854, the municipality was again reminded (in answer to renewed appeals) that the right of way must be secured, and the deeds delivered to the secretary, before active measures could be taken.\nOn the 18th January, 1855, and on the suggestions of the municipality that a shore, instead of inland line, would cheapen the right of way, the board made the concession, and directed the adoption of the former.\n\nNevertheless, on the 25th January, the municipality prayed the board to receive the sum of £3000, to be raised under by-laws, and thereupon to relieve the municipality from further liability, in regard to right of way. The board being incompetent to estimate the value, and fearing that £3000 might be insufficient for the purchase of right of way, very wisely declined the proposition, and by resolution reiterated the original condition.\n\nLegal difficulties, in regard to forcible entry upon lands, having then been discovered by the municipality, and the solicitor of the company having reported his opinion that under its existing powers the company could not construct the branch line, the municipality prayed to be allowed the use of the company's name, in an application to parliament for such an amendment as should provide the necessary powers, which request was granted by resolution, (12th February, 1855,) \"it being clearly understood and agreed that all costs and charges, legal or otherwise, should be met by the municipality.\"\n\nOn the 22nd February, 1855, a petition was received from the municipality of Innisfil, as well also as from the private owners of the land required, praying that the branch line should not be constructed. On the same day, the board received sundry documents from the municipality, purporting to be bonds, (see plaintiff's exhibit H,) providing for the valuation and purchase of the right of way, by future arbitration.\n\nOn the 19th May, 1855, the amendment to the charter was passed, and on the 28th May, advertisements (see plaintiff's exhibit E) were issued inviting tenders for the construction of the branch line. And on the 21st June, 1855, the tenders were referred to a committee, (composed of the President, Mr. Angus Morrison, and Mr. Drummond,) who accepted that of one Albert McGaffey, conditionally upon the company requiring him to proceed with the works.\nSuch acceptance, conditional as it was, was never reported to the board, and no contract has ever been authorised or entered into with said McGaffey.\n\nOn the 19th July, 1855, the municipality remitted for deposit in the Court of Chancery, the sum of $978.50, being on account of disputed right of way not included in the bond for arbitration.\n\nOn the 30th August, 1855, (little more than five weeks after the deposit,) the municipality applied for a return of part of the money, and subsequently for the remainder; and on the 6th April, 1855, and two subsequent dates, the whole amount was returned, and the company holds the acquittance of the municipality for the same.\n\nUp to that time, and to the present day, as far as this company is informed, and as the bill of claim proves, the right of way has only been secured and paid upon one lot, for which the sum of £75 has been disbursed.\n\nShortly afterwards, however, (namely, in the winter of 1855-1856,) the municipality of Barrie proposed to divert the £3000 raised for the purposes of right of way, to the erection of a town hall and market; and accordingly, in the summer of 1856, the handsome building which now adorns the town of Barrie, was completed with that money.\n\nTrue, it was pretended at the time, and is still urged, that for the £3000 thus appropriated, bonds of the municipality (not municipal loan fund bonds, as were the others,) were deposited in exchange. But however that may be, (and it is a matter with which the company has nothing to do,) it is certain that to this moment no further progress has been made in providing the right of way in compliance with the conditions aforenamed, than the one payment of £75 to the proprietor of one lot in the proposed location.\n\nIt is idle to urge that a bond providing for a future valuation by arbitration (such as plaintiff's exhibit II., see appendix D.) is a fulfilment of the condition by which the municipality was to provide all right of way before the company would move in the construction. The company had already declined to accept the sum of £3000 in liquidation of that condition: and if the company proceeded (under the question-\nable protection of a bond of arbitration) to enter upon possession and construct the line, what security had they that £3000 would suffice for payment, and if not, what security that the municipality would make good the deficiency, especially as a new by-law sanctioned by a vote of the people for a further issue of bonds would then become necessary.\n\nHad the right of way been fully secured, and \"the deeds deposited with the secretary,\" as required by the directors' resolutions, some basis might have been found for a claim for reimbursement, but as this has never been done, and as the money with which it was intended to be done, was devoted to other and better purposes, and as up to the time when that fund was so diverted and used the directors had never repudiated their engagement, (although it must be admitted that in the lapse of time, for which the municipality alone was responsible, the capital of the company had been exhausted) no part of that claim can now be established against the company. Indeed it was not until the 21st July, 1860, when the town hall was already built, that the engagement of the directors was condemned and repudiated by the shareholders in general meeting, so that the voluntary abandonment of the branch by the municipality was an act precedent to its abandonment by the company.\n\nAnd if at the time the £3000 was so diverted and when the damage, if any, must already have arisen, the municipality felt aggrieved, and in any way entitled to compensation, it is strange that until 1860 no mention of a claim was made.\n\nFrom this it would appear that the municipality was quite satisfied with the course of events by which they had secured a serviceable town hall instead of a useless branch, until the new capital of the company seemed to afford an opportunity for relieving the town of the cost of that structure.\n\nIt is scarcely necessary to add that inasmuch as a mere partial compliance with the condition for right of way is no fulfilment of the original engagement, the items for the isolated lot purchased, and for the interest thereon, cannot be charged against the company, whilst the resolutions of the directors clearly required the municipality to provide for all costs and charges legal or otherwise necessary to the full purpose.\nWith reference to the items for interest paid on debentures issued by the government £800 0s. Od. and interest now due thereon 480 0s. Od. it may be sufficient to observe that the municipality has expended the amount to its own benefit, and that the interest represents a debt upon the Barrie town hall for which this company is in no way responsible.\n\nThe last item in the account, viz., the liability of the municipality for the right of way which has not been bought (£3000 0s. Od.) if it is of no other value, at least suffices to prove that the right of way has not been yet secured or its value determined, and accordingly that by their own shewing the engagement on the part of the municipality not having been fulfilled, any claim whatever for damages for the non-construction of the branch by the company is utterly untenable.\n\nThe resolutions of the directors referred to herein are to be found recorded in the minute book of the board already (under notice from the plaintiffs) produced before the arbitrator: and the undersigned is prepared to establish by evidence the case as no presented if required so to do.\n\nWhilst the company will accord to the judgment of the arbitrator the most respectful consideration and fullest deference, it is the duty of the undersigned, in protection of the interests entrusted to him, to urge that this reference has not been made on the part of the company with a view to compromising the claim of the municipality, but for the purpose of ascertaining its legal validity.\n\nFRED. CUMBERLAND,\nManaging Director,\nNorthern Railway of Canada.\n\nToronto, January 30th, 1861.\nAPPENDIX B.\n\nAWARD OF THOS. GALT, ESQ., Q. C.,\n\nIn the matter of the claim of the municipality of Barrie against the Northern Railway Company, for the construction of a Switch by the said Company into the town of Barrie.\n\nA reference having been made to me in the following terms, on the matters in dispute between the said parties:\n\nQUEBEC, 12th May, 1860.\n\nAfter a consultation in reference to the bill now before the House of Assembly between the undersigned, it was mutually agreed on behalf of the corporation of Barrie and the Northern Railway Company of Canada, to refer all matters in dispute between the parties in relation to the construction or compensation of the Barrie switch, to the opinion of Thomas Galt, Esq., Q. C., with a view to their guidance to an adjustment, but without prejudice to the rights or ultimate action of either of the parties.\n\n(Signed) A. MORRISON,\nFor Municipality of Barrie.\n\n(Signed) FRED. CUMBERLAND,\nManaging Director, N. R. C.\n\nHaving carefully read and considered the agreements and papers submitted for my perusal and opinion, I have arrived at the following conclusion:\n\nThe negotiations between parties on the subject matter of this reference appear to have commenced in the year (1853) one thousand eight hundred and fifty-three, when a resolution of the board of directors was passed on the twenty-seventh day of January, to the effect, \"that provided suitable land and water frontage for a terminus, with right of way thereto from the main track, can be had free of cost in the town of Barrie, a branch line, as suggested by the engineer, shall be laid down for the service of the town, and that\nthe chief engineer be instructed to survey the locality, and report what will be required for the service of the road at that point.\"\n\nOn the twenty-seventh day of March, one thousand eight hundred and fifty-four (1854) a by-law was passed by the municipality to raise the sum of three thousand pounds, to be applied to the purchase of the right of way.\n\nOn the thirtieth day of January, one thousand eight hundred and fifty-five, plans of location of proposed switch were prepared by the company.\n\nOn the twelfth day of February, one thousand eight hundred and fifty-five, Mr. Gamble, as legal adviser of the company, reported that in his opinion the existing powers of the company were not sufficient to enable them to compel dissentient landowners to submit their claims to arbitration, and that further legislation was necessary.\n\nOn the nineteenth day of May, one thousand eight hundred and fifty-five, an act was passed granting the requisite power to the company.\n\nPreviously to the passing of the last-mentioned act, the municipality procured an agreement to submit to arbitration to be executed by nearly all the owners of the right of way required.\n\nIt appears from the other papers submitted to me that both parties were acting in good faith to one another, and that the non-construction of the switch arose from the inability of the company to procure the necessary funds; the resources of the company having become exhausted and its affairs in a desperate condition.\n\nOn the fourth day of May, one thousand eight hundred and fifty-nine, an act entitled \"An act relating to the Northern Railway Company of Canada,\" was passed, whereby the railway, with all its rights and appurtenances, were vested in the Crown for the purposes therein mentioned.\n\nOn the eleventh day of May, one thousand eight hundred and fifty-nine, an order in council was passed respecting the said company, which was subsequently ratified by statute passed nineteenth day of May, one thousand eight hundred and sixty, by the provisions of which, amongst other things,\nthe railway, its rights and appurtenances were re-vested in the company, on the conditions therein mentioned, and by the twelfth section, it is enacted, \"That subject to the conditions hereby recommended, the future earnings of the railway shall be distributed as follows:\n\nFirst.—In the payment of working, repairing and managing the said railway.\n\nSecond.—In payment of the interest as and from the day of the date thereof on the first preference bonds.\n\nThird.—In payment of the interest as and from the day of the date thereof, on so much of the second preference bonds as are entitled to priority hereby granted.\n\nFourth.—In payment of the interest on the provincial lien of four hundred and seventy-five thousand pounds sterling.\n\nFifth.—In payment of interest on the arrears of interest due to the province.\n\nSixth.—In payment of the interest on such portion of the mortgage bonds as may not be entitled to the priority hereby granted, and on the arrears of the interest accrued and due on the present bonded debt of the company up to the date of the second preferential bonds, and\n\nSeventh.—In dividends on the share capital of the company.\n\nI am of opinion that the effect of the two last mentioned statutes is to create a company, which, although under the same name is essentially a new one, and that the earnings of the company must be applied in the order above stated.\n\nIt must be borne in mind that the share capital mentioned in the seventh clause represents what was formerly the old company, and that any obligation of the old company either as regards the municipality of the town of Barrie, if of any validity, which I strongly doubt, could be enforced only as against their interest, and therefore that until all the other charges are satisfied, it would be contrary to the provisions of the legislature and a breach of trust on the part of the directors of the present company to expend any money in fulfilment of any obligation of the former company.\n\nToronto, 6th April, 1861.\n\nTHOMAS GALT.\nAPPENDIX C.\n\nJudgment of the Court of Chancery delivered by the Hon.\nMr. Vice-Chancellor Spragge.\n\nDUNN, ET AL., V. BARRIE AND THE NORTHERN RAILWAY COMPANY.\n\nAt the close of the argument yesterday, I intimated my opinion that the true and only question necessary to be decided upon this application was, whether the claim of the town of Barrie can be proved against the Northern Railway Company, or its payment be enforced against this company consistently with the rights of the plaintiffs as first or second preference bondholders, under the statutes of 1859 and 1860 in relation to the railway, and I desired to examine the statutes carefully before giving my decision.\n\nIt is contended on behalf of the town of Barrie that their claim is of a nature covered by clause 8 of the act of 1859, and I think that for the purposes of their application that point may be assumed in their favour. Assuming this to be the case, and that a liability as between the company and the municipality exists now, and existed before 1859, the question becomes one of priority between the municipality and the plaintiffs, the plaintiffs' position being that the statutes give them precedence, in respect of bonds held by them, issued under the statute, over those having debts or obligations against the company.\n\nThe statutes authorised the issue of bonds by the company, called respectively first and second preference bonds; the first to the extent of £250,000 sterling. Of these, bonds to the extent of £50,000 were directed to be appropriated for the payment of the then creditors of the company; this appropriation was made by an Order in Council under the act directing the proceeds of the first preference bonds to be applied, first, in the repair and improvement of the railway and stock, and for the payment of the debts and obligations of the company. The Order in Council, which under the statutes has the force of law, provided as to the first preference bonds, that such bonds when issued be the first charge both as to security and interest on the said railway.\nSecond preference bonds were authorised to be issued to the amount of the then bond or debenture debt, £243,739 14s. 6d., stg., and a further sum of £50,000, stg.,—the latter on account of a debt of the Province, and to be held by the Receiver-General. As to the former, the words of the Order in Council, \"and to which priority is hereby given,\" this, however may mean in this connection only priority over the bonds for £50,000 sterling.\n\nThe application of the earnings of the railway arc, so far as material, directed to be as follows: First,—To the payment of the expenses of working, repairing and managing the said railway. Second,—In payment of the interest as and from the day of the date thereof, on the first preference bonds. Third,—In payment of the interest as and from the day of the date thereof, on so much of the second preference bonds as are entitled to priority hereby granted. Then follows the payment of interest on other sums in their order. The last purpose to which the earnings of the railway are made applicable is the dividends on the share capital of the company. No provision is made for payment out of the earnings of the road of debts or obligations or of interest thereupon, except those of classes specified, to which the one in question does not belong.\n\nIt is manifest from the appropriation of the first preference bonds to the extent of £50,000, stg., that it was intended to deal justly with those having debts and obligations against the company, (other than the holders of bonds or debentures.) And it is evident from the appropriation of a particular sum, as well as from the appropriation of the earnings in dividends on the share capital of the company, it was supposed that the appropriation would be sufficient to discharge those debts and obligations. How the amount was arrived at does not appear beyond this, that Mr. Cumberland, who was then vice-president of the company, says in his evidence that an estimate was prepared by the company of its liabilities.\n\nBy the word railway as used in the clause giving the first preference bonds a first charge, and as used in the clause appropriating the earnings of the railway, I considered the\nword in its fullest sense as comprehending in the act \"all the appurtenances and appliances, whether consisting of real or personal property, its rolling stock and plant,\" the purchasers then of these preference bonds would see their position and rights defined, and I should say guaranteed by this statute; they would purchase upon the faith of their position being what the statutes represented it to be, and it was necessary that their position and rights should be defined in order to the giving of a proper market value to the bonds. It was competent to the legislature, no doubt, though it has not done it, to give priority to bondholders, without making any provision for the payment of the pre-existing debts of the company; just as the legislature has given priority to new bondholders over the old ones. I think the only question can be, whether these new bondholders have, under the statutes, such a claim upon the railway and its earnings, as to postpone the claim of the town of Barrie until after payment of interest on their bonds.\n\nIt appears that the railway company has no funds out of which to pay this claim except the earnings of the road; and further that there has been no surplus in the net earnings of the road since the issue of the bonds, over and above the accruing interest thereon; it follows that if the company pay this claim it must be out of the earnings of the road. These earnings are a trust fund applicable only to the purposes specified in the act and in the order therein prescribed. For the company to appropriate them otherwise, would be a plain breach of trust, which this court would restrain by injunction. I really see no room to doubt that this company cannot at present, at least pay this claim to the town of Barrie, for they have no funds, except such as it would be a breach of trust so to apply.\n\nBut it is said there is no reason why the municipality should be restrained from enforcing payment of the sum awarded by writ of execution. If they can find anything not pledged to the bondholders, or not necessary to the performance of the trust to which I have referred, (I mean the working of the road so as to make earnings, which earnings are a trust fund,) I suppose they may, or at least these bond-\nholders have no interest and therefore no right to prevent them.\n\nIt is suggested that cordwood, by which I suppose fuel for locomotive engines, shops and the like is intended, may be seized. I should say certainly not; for it falls within the very first charge to which the earnings of the road are applicable, taking precedence, and necessarily so, of the payment of interest on the preference bonds.\n\nIt would, in an indirect way, force the application of the earnings of the road to the payment of this claim in preference to the interest on the bonds. In the view of a court of equity the fuel purchased is, and is impressed with the same trust as the money, the earnings of the road wherewith it is purchased; it is not the absolute property of the company, and cannot be sold to satisfy the debt of the company.\n\nThe same remarks will apply to rolling stock, and everything else purchased out of the earnings of the railway, and used in its working, repairs and management, and they like, purchases before the passing of the acts stand expressly charged with the first preference bonds; and as to all incumbrances, holders of second preference bonds and others, I am satisfied that no creditor of the company can levy upon execution, or do any act the effect of which would be to destroy or impair these securities.\n\nA large portion of the bill is devoted to impeaching the submission to arbitration by the directors of the company; and evidence has been taken, and argument addressed to me upon the subject.\n\nIf the effect of the award made upon that submission were to make this town of Barrie a creditor with prior rights to the bondholders upon the railway and its earnings, the submission and award would properly come in question, but it is a question between the debtor and the railway company, and at the most a subsequent incumbrance, which cannot, of course, be adjudicated upon at the instance of the prior incumbrance. I have only to say that if the bill had become law, the passing of which it is suggested was stayed by the agreement to arbitrate, my judgment would have been the same as it is, for it only declared what I have assumed, that the\nsame company was continued as existed before the act of 1859. Mr. Eccles concluded that the provision in the act giving the preference bondholders a right to vote in the same proportions as shareholders made them members of the company. I incline against this contention; but if it were correct it is immaterial unless they being members of the company would affect his right to file this bill. I am clear that it would not.\n\nIn my judgment, the plaintiffs are entitled to an injunction restraining the railway company and its directors from paying the amount of the award in favour of the municipality of the town of Barrie or any part thereof, or in any other way satisfying the claim of the municipality out of the earnings of the railway; and restraining the municipality from receiving such payment or satisfaction out of such earnings, and for enforcing such payment by levying upon the railway, or any other rolling stock thereof, or anything else necessary to or ordinarily used in the working, repairing, or managing of the same.\n\nAPPENDIX D.\n\nCopy of Bond for Arbitration relied upon as conveyance and title to Right of Way.\n\nKnow all men by these presents, that we George Lount of the town of Barrie, in the county of Simcoe, Esquire, John McWatt, John Strathy, Henry Baldwin Hopkins, Henry Fraser, James Brewer, Robert Simpson, Edward Marks, William Graham, Sidney Moorehouse Sanford, Amos Arksey, Thomas Summersett, David Movion, John Ross, James Dunlop, Charles Partridge, William Maine, Walter Raikes, by Archibald Pass, his attorney, respectively of Barrie aforesaid, are held and firmly bound unto the municipality of the town of Barrie, and to their certain attorney, successors and assigns in the penal sum of ten thousand pounds of lawful money of Canada. For which payment well and truly to be\nmade we bind ourselves and each of us, our and each of our heirs, executors, administrators, and assigns and every of them firmly by these presents sealed with our seals, and dated the fifth day of February, in the year of our Lord one thousand eight hundred and fifty-five.\n\nWhereas the said municipality of the town of Barrie with the view of benefit to the said town of Barrie did contract and agree to and with the Ontario, Simcoe, and Huron Union Railroad Company, that if the said company would agree to extend their line from the present station in the township of Innisfil to McWatt's wharf, situate in the town of Barrie, they the said municipality would purchase at their expense for the said railroad company the right of way therefor.\n\nAnd whereas the said municipality of the town of Barrie did, in and by a certain by-law made and passed on the ——day of March, A.D., 1854, according to the provisions and requirements of the 16 Vic., ch. 21, raise the sum of three thousand pounds for the purpose of purchasing the right of way aforesaid.\n\nAnd whereas the company being about to commence the said extension of their said line into the town of Barrie, have called upon the said municipality to procure such right of way as aforesaid.\n\nAnd whereas, at the request of the said municipality, the several parties above bounden, have respectively, by certain deeds in writing, bearing even date with this obligation, agreed to sell, and convey unto the said company such quantity of land and right of way over and through their respective parcels or blocks of land as may be required for the said company, in accordance with the plan adopted by the said company on the twenty-fifth day of January, A.D. 1855, which said plan is marked A, and signed by the receive of the said municipality and the chief engineer of the said company, and annexed to these presents.\n\nAnd whereas the said municipality are desirous to agree with the several above bounden parties, touching the compensation to be paid to each of them respectively by the said municipality, for such portion of the said respective parcels of land and said right of way, as the said railroad company shall require, and for the payment thereof, doth hereby sustain and agree to pay the same, and any proceeds thereof.\n\nAnd whereas the said parties, respectively, agree to refer the said compensation to Edward Alexander, Esq., of the town of Barrie, as the value of the said compensation, and for the receipt thereof, sustained and agreed to by the said municipality, in respect of the said compensation arising from the sale of the said parcels of land and right of way therefor, and for the payment thereof, of different portions of the said parcels of Barrie, and for the receipt thereof, the same.\n\nNow therefore, whereas the said parties, above bounden, have respectively, by certain deeds in writing, bearing even date with this obligation, agreed to sell, and convey unto the said company such quantity of land and right of way over and through their respective parcels or blocks of land as may be required for the said company, in accordance with the plan adopted by the said company on the twenty-fifth day of January, A.D. 1855, which said plan is marked A, and signed by the receive of the said municipality and the chief engineer of the said company, and annexed to these presents.\n\nAnd whereas the said municipality are desirous to agree with the several above bounden parties, touching the compensation to be paid to each of them respectively by the said municipality, for such portion of the said respective parcels of land and said right of way, as the said railroad company shall require, and for the payment thereof, doth hereby sustain and agree to pay the same, and any proceeds thereof.\nparcels of land and right of way respectively assigned to the said company as may be required for the purposes of the said railroad, and other works, and for any damages that the said several above bounden parties may respectively sustain in respect of such railroad or works arising out of any proceedings of the said company in respect thereof.\n\nAnd whereas the several above bounden parties respectively, and the said municipality have mutually agreed to refer the same respectively to the arbitration and award of Edward Samuel Lally and Robert Ross, respectively, of the town of Barrie, Esquires, to ascertain what, if any, is the value of the said respective portions of land so to be taken for the right of way, as aforesaid, or of the damages, if any, sustained by the several above bounden parties respectively, in respect of any such railroad or other works therefor, or arising from any proceedings of the said company in respect therefor, with power to the above named arbitrators, in case of difference, to refer to John Alexander, of the said town of Barrie, Esquire, to act as umpire in the final decision of the same.\n\nNow the condition of this obligation is such, that if the above bounden parties, and each of them, their and each of their heirs, executors, administrators, and every of them, do and shall well and truly abide by and fulfil the award, order and arbitration of the above named Edmund Samuel Lally and Robert Ross, and the decision, if requisite, of the said John Alexander, as such umpire as aforesaid; and of the several above bounden parties respectively in the event of any sum of money being awarded as aforesaid to them, or either of them, as the value of the said respective portions of land and right of way, or of the said damages, if any, by them, or either of them sustained in respect of the said railroad, or the works thereof, or arising out of any proceedings of the said company in respect thereof, do and shall on payment to them, or either of them, by the said municipality, of such sum of money, if any so awarded as aforesaid, at the request of the said municipality, execute and deliver to the said Ontario, Simcoe and Huron Railroad Company a good and sufficient deed of confirmation of the said land and\nright of way, (or of such portion thereof as may by the said company, on behalf of the municipality, be regarded and taken for the purposes aforesaid,) together with a release to the said company and to the said municipality from all claims or demands in respect of the award and decision or value thereof, or of any damages sustained or to be sustained in respect of the said railroad extension, or of the works thereof, or arising out of any proceedings of the said company in respect thereof, then the above obligation to be void or else to be and remain in full force and virtue. Provided always, and it is hereby declared, that nothing herein contained shall render each of the several above bounden parties liable, otherwise than for his own individual acts, neglect or default, and that no greater sum shall be recovered under this bond or covenant against the several parties thereto, than as follows, that is to say:\n\nAgainst George Lount, in the whole .......... £250\nAgainst John McWatt, \" .......... 250\nAgainst James R. Gowan, \" .......... 250\nAgainst John Strathy, \" .......... 250\nAgainst Henry Hopkins, \" .......... 250\nAgainst Henry Fraser, \" .......... 250\n\nAnd against each other of the several above bounden parties, the said sum of two hundred and fifty pounds.\n\nSigned, sealed and delivered in the presence of\n\n(Signed,) (Signed,)\nD. MORROW, witness to JNO. ROSS' Signature.\nGEORGE LOUNT, witness to the Signatures of\nGEO. LOUNT.\nJNO. McNATH, JNO. STRATHY.\nH. B. HOPKINS, HENRY FRASER.\nJAMES BREWER, ROBT. SIMPSON.\nEDWARD MARKS.\nWILLIAM GRAHAM, S. M. SANFORD.\nAMOS ARKSEY, THOS. SUMMERSETT.\nDAVID MORROW, JAS. DUNLOP.\nCHS. PARTRIDGE, WM. MANN.\nWALTER RAIKES, by his Attorney.\n\nGEORGE LOUNT.\nJOHN McNATH.\nJ. R. GOWAN.\nJOHN STRATHY.\nH. B. HOPKINS.\nHENRY FRASER.\nJAMES BREWER.\nROBERT SIMPSON.\nEDWARD MARKS.\nWILLIAM GRAHAM.\nS. M. SANFORD.\nAMOS ARKSEY.\nTHOS. SUMMERSETT.\nDAVID MORROW.\nJNO. ROSS.\nJAMES DUNLOP.\nCHARLES PARTRIDGE.\nWILLIAM MANN.\nWALTER RAIKES, by a pass.\nAPPENDIX E.\n\nExtract from Board Minutes, January 21st, 1863.\n\nLetter from Mr. Morrison, dated January 16, and managing director's reply, dated January 17, were read. Ordered,\n\nThat the managing director be authorised to invite the bondholders, who are plaintiffs in the suit of Dunn et al. v. Barrie, to attend a consultation with this board on the subject of the notice published by Mr. Morrison of an intended application to parliament for an amendment to the company's charters.\n\nExtract from Board Minutes, February 7th, 1863.\n\nThe board meeting was called \"special,\" at the Hon. J. H. Cameron's office, to meet the plaintiffs in re Dunn v. Barrie, for the purpose of consultation with reference to that suit, and to the notice of Mr. Angus Morrison, of an application to the legislature for an amendment to the acts relating to the Northern Railway of Canada.\n\nPresent: F. W. Cumberland, Lewis Moffatt, T. D. Harris, T. Galt, Q. C., Standing Counsel, The Hon. J. H. Cameron, M.P., Robert Cassels, Esq., for the Bank of Upper Canada, and G. D'Arcy Boulton, Esq., (acting under power of attorney,) for themselves and other bondholders in the case of Dunn et al. v. Barrie. The managing director having referred at length to the correspondence recently had between Mr. Morrison and the directors in relation to \"the Barrie Switch,\" read the opinion of counsel, T. Galt, Q. C., thereon, as follows:\n\n\"I beg to acknowledge the receipt of your letter of 27th January, containing a reference of the correspondence which has taken place between the board of directors and Mr. Angus Morrison respecting 'the Barrie Switch,' and requiring my opinion as to the proposals of Mr. Morrison and the power of the directors (in view of the existing injunction in Chancery) to comply with them, assuming\n\"(which has not yet been discussed) that such proposals \"were otherwise open to acceptance.\" In reply, I beg to state that in my opinion the earnings of the company have been specifically appropriated by the legislature, and that the directors have no power to apply them in any other manner than that pointed out by the act of parliament. If the company are possessed of any other means than those arising from \"the earnings,\" they might, if they thought it for the interest of the company so to do, enter into an arrangement for the construction of the proposed switch, but if they are not, they cannot enter into any arrangement without, in my opinion, violating the provisions of the act, and subjecting themselves to an application to the Court of Chancery, at the suit of the bondholders. It is true, that on referring to the injunction issued by the Court of Chancery, (a copy of which I this day received from Mr. Boulton,) I find that it points only to the payment of Mr. Harrison's award; but I entertain no doubt that it would be extended to the appropriation of any of the earnings of the company, in contravention of the terms of the act, and I am of opinion that the construction of the switch proposed by Mr. Morrison would be such a contravention.\n\nSincerely yours,\n\n(Signed,) THOMAS GALT.\n\nThe board explained that in view of the correspondence, opinion, and parliamentary notice referred to, they conceived it their duty to consult the bondholders (plaintiffs in the case) as to the course now to be taken in the interest of the proprietary at large; they submitted that in view of the injunction they were powerless to effect any compromise or adjustment with the town of Barrie; that they had suggested to Mr. Morrison that it was with the plaintiffs, and not the company, with whom a settlement must be sought; that they would not oppose any compromise or adjustment that the plaintiffs, in their own interest as bondholders, might agree to and effect, but that in the event of no such adjustment being possible, it seemed to be their duty to oppose the proposed legislation which was aimed at the\n\nExtract\n\nThat in 1859 has affairs of way, complete performs management community and\n\nThat the proposed apply the laws all believing the company, to every in\n\nThis meet\norganization and working of the company, as established by the act of 1859, and which act had been fully successful in restoring the company to credit and public confidence.\n\nAfter full discussion, the board was informed that the plaintiffs were unanimous in their determination to maintain their rights at equity; that they adhered to their proceedings in Chancery in protection of those rights; that they would be no parties to any compromise which would interfere with or weaken them; and that they had no fear that parliament would disturb by ex post facto legislation, the securities of the bondholders as established and pledged by the act of 1859; that, accordingly, they were prepared to oppose the legislation to be sought by Mr. Morrison, and had a right to expect the directors to co-operate actively in that opposition. The bondholders having withdrawn, it was thereupon, ordered,\n\nThat all proper measures be taken in opposition to any legislation intended to disturb or alter the provisions of the laws affecting this company, as now established.\n\nExtract from minutes of the Annual General Meeting, February 11th, 1863.\n\nThat in the opinion of this meeting, the Relief Act of 1859 has approved itself as a successful adjustment of the affairs of this company in the public interest; that the railway has, under the provisions of that act, been restored to complete efficiency and substantial credit; that it now fully performs all its functions as a public work, and that its management possesses the confidence of the commercial community and the public at large.\n\nThat this meeting views with unmeasured regret a proposed application to parliament for the purpose of altering the laws affecting this railway and protecting its securities, believing that any disturbance of the organization of the company, as now established, would result disadvantageously to every interest connected with it.\n\nThis meeting, however, approves of the efforts made by\nthe directors from time to time to adjust the difficulties relating to the Barrie branch, and would not object to such an alteration in the law, as would authorise the construction of the switch on the original condition, viz: that the title to the right of way and station lands, &c., should first be completed and transferred to the company by the town of Barrie.\n\nThat petitions from the propriety consistent with this resolution be accordingly prepared, signed, and transmitted to both branches of the legislature, praying them to refuse their sanction to any other interference by further legislation, or in any way to disturb the securities and adjustment established by the Act of 1859.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_50419.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 43, "total-input-tokens": 61582, "total-output-tokens": 19208, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1538, 3], [1538, 3979, 4], [3979, 4121, 5], [4121, 5601, 6], [5601, 7761, 7], [7761, 9905, 8], [9905, 12378, 9], [12378, 14521, 10], [14521, 16670, 11], [16670, 18753, 12], [18753, 21567, 13], [21567, 23802, 14], [23802, 27104, 15], [27104, 29286, 16], [29286, 31539, 17], [31539, 33662, 18], [33662, 36371, 19], [36371, 38617, 20], [38617, 40753, 21], [40753, 42890, 22], [42890, 45015, 23], [45015, 47177, 24], [47177, 49466, 25], [49466, 51082, 26], [51082, 52729, 27], [52729, 54782, 28], [54782, 56797, 29], [56797, 58858, 30], [58858, 61047, 31], [61047, 63303, 32], [63303, 65470, 33], [65470, 67285, 34], [67285, 71061, 35], [71061, 73321, 36], [73321, 75307, 37], [75307, 77098, 38], [77098, 79387, 39], [79387, 81354, 40], [81354, 82048, 41], [82048, 82048, 42], [82048, 82048, 43]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true]}}]