[{"id": "e3e2ea3c63d50a6bc20f59b27dfca87814b8f81e", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:\n\nThis item is filmed at the reduction ratio checked below/\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X |     |     |     |\n\nL'institut a microfilmé le meilleur exemplaire qu'il lui a été possible de se procurer. Les détails de cet exemplaire qui sont peut-être uniques du point de vue bibliographique, qui peuvent modifier une image reproduite, ou qui peuvent exiger une modification dans la méthode normale de flmage sont indiqués ci-dessous.\n\n- [ ] Coloured pages/\n- [ ] Pages damaged/\n- [ ] Pages restored and/or laminated/\n- [ ] Pages discoloured, stained or foxed/\n- [ ] Pages detached/\n- [ ] Showthrough/\n- [ ] Quality of print varies/\n- [ ] Includes supplementary material/\n- [ ] Only edition available/\n- [ ] Pages wholly or partially obscured by errata slips, tissues, etc., have been refilmed to ensure the best possible image/\n\nThis document is filmed au taux de réduction indiqué ci-dessous.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nLibrary of the Public Archives of Canada\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —— (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nNARRATIVE\n\nOF THE\n\nCanadian Red River Exploring Expedition of 1857,\n\nAND OF THE\n\nAssinniboine and Saskatchewan Exploring Expedition of 1858.\n\nBy HENRY YOULE HIND, M.A., F.R.G.S., Professor of Chemistry and Geology in Trinity College, Toronto; in charge of the Assinniboine and Saskatchewan Expedition.\n\nPp. 900; with 20 whole-page Chromoxylographs, 76 Woodcuts, 3 Maps (topographical and geological), 4 Plans, and a Sheet of Profiles of the Country explored. 2 vols. 8vo.\n\nPrice Two Guineas in Britain—$12 in Canada.\n\nOPINIONS OF THE PRESS.\n\nBRITISH.\n1. The Morning Chronicle.\n2. The Morning Post.\n3. The Star.\n4. The Globe.\n5. The Guardian.\n6. John Bull.\n7. The Economist.\n8. The Critic.\n9. Oriental Budget.\n10. The Spectator.\n\nAMERICAN.\nAmerican Journal of Science.\n\nCANADIAN.\n1. The Canadian Naturalist and Geologist.\n2. The Canadian Journal of Industry, Science and Art.\n\nEXTRACT FROM BRITISH REVIEWS.\n\nTHE MORNING CHRONICLE—December 26, 1860.\n\n\"This is a noble work. Noble not only in the complete and beautiful manner in which it has been got up, but also in the genius which underlies every page, and the great breadth of thought which the labor devoted to minute details necessary to the subject is unable to stifle or conceal. The idea of a great highroad across the continent of North America, uniting the Pacific and Atlantic Oceans, is no new one to this generation; nor, as far as the United States are concerned, is it likely long to remain a mere theory.\"\n\n\"We pause here to render tribute to the descriptive powers of the writer, evidence of which abounds in these pages. A fair specimen of it is furnished by the following extract. The party has passed through the beautiful Lac La Croix, which extends fifteen miles in length, between 'high precipitous rocks, often clothed with dense groves of pine, rising above the mass of light green aspen foliage which prevails,' and has entered the Nameaukan River. Arrived at Battlesnake Portage, 'where the river descends by a beautiful cascade of 12.14 feet'—the party camp for the night. Mr. Hind, being on this occasion wakeful, describes the dawn of morning in the wilderness.\"\n\"We have spent some time on this portion of these volumes, because upon the particular routes of which it treats depends the solution of the great problem, whether we are to have a regular interoceanic communication entirely north of the boundary line or not. At present it is accepted as a fact that any such can only be a summer route; but if we can obtain that, the increase of colonization and of traffic, coupled with the ever advancing progress of engineering science, may in time do the rest. Mr. Hind, however, has done nothing by halves. In 1858 he was instructed to explore the basin of the Saskatchewan and of the Assiniboine, a tributary of the Red River, and we have the details, and the results of this journey are given also in these volumes, bringing our acquaintance with the new route to the foot of the Rocky Mountains.\n\n\"For the results of this splendid exploring journey we must leave the reader to consult these volumes. Professor Hind does not merely bring the results of his own observations to bear on the main question, but he quotes those of all the most celebrated travellers over the same ground, even where their conclusions diametrically contradict his own. Hence we have a work complete in every sense. The pro and the con, are placed fairly before the reader, and he is enabled to judge for himself, as far as any unprofessional reader can judge, of the difficulties which stand in the way of establishing a great highway on British ground across this vast continent. We have said little about the scenery and geological features of the territory explored. These are described in a manner alone sufficient to rivet the attention. Both in a scientific and a literary point of view the book is admirable, and for illustrations we have only to say, in the words of the publishers' advertisement, that it contains '20 whole-page chromoxylographs, 76 wood-cuts, 3 maps (topographical and geological), 4 plans, and a sheet of profiles of the country explored.' Of its kind we have seen no work that can approach it.\"\n\nTHE MORNING POST—January 7, 1861.\n\n\"The narrative of Mr. Hind will be read not less for the interesting nature of the subject matter than for the highly useful and instructive information it affords. To the general reader, it will prove attractive for its varied and pleasing descriptions of places and scenes in the distant West, for the record of the many vicissitudes which attend explorers in unknown and uncivilised lands, and as bringing him into the presence of those whom he may have hitherto met only in the pages of Cooper—the North American Indians in their pure and untutored state. To the emigrant, proposing to seek his fortune in the backwoods of the West, it is invaluable for its clear elucidation of the resources of those interminable tracts, and the conditions under which their resources may be best developed. But it is to the Government, both Canadian and British, that the information contained in these volumes is most valuable. It points out the means how the intrinsic riches of the country explored may not merely be turned to the best account, but how a vast tract of land, remarkable for its fertility, extending from Canada on the east almost to the shores of the Pacific on the west, may be made a chain of communication from one side of the continent to the other. This being the case, the field thrown open for enterprise is incalculable. Through this channel may be drained, not merely the products of its own mineral and agricultural resources, but also the increasing wealth of British Columbia, and the newly-exposed treasures of China, if that be possible, for it is evident that the discovery of the continent will be followed by the discovery of the interior. The naturalist will find plenty to interest him.\"\n\n\"The narrative of Mr. Hind will be read not less for the interesting nature of the subject matter than for the highly useful and instructive information it affords. To the general reader, it will prove attractive for its varied and pleasing descriptions of places and scenes in the distant West, for the record of the many vicissitudes which attend explorers in unknown and uncivilised lands, and as bringing him into the presence of those whom he may have hitherto met only in the pages of Cooper—the North American Indians in their pure and untutored state. To the emigrant, proposing to seek his fortune in the backwoods of the West, it is invaluable for its clear elucidation of the resources of those interminable tracts, and the conditions under which their resources may be best developed. But it is to the Government, both Canadian and British, that the information contained in these volumes is most valuable. It points out the means how the intrinsic riches of the country explored may not merely be turned to the best account, but how a vast tract of land, remarkable for its fertility, extending from Canada on the east almost to the shores of the Pacific on the west, may be made a chain of communication from one side of the continent to the other. This being the case, the field thrown open for enterprise is incalculable. Through this channel may be drained, not merely the products of its own mineral and agricultural resources, but also the increasing wealth of British Columbia, and the newly-exposed treasures of China, if that be possible, for it is evident that the discovery of the continent will be followed by the discovery of the interior. The naturalist will find plenty to interest him.\"\nof China and Japan. How far these results may ultimately be attained it is impossible to predict. For the present it is sufficient to examine the circumstances under which the exploring expedition was carried out, the discoveries which were made, and the consequences which may naturally be anticipated therefrom.\n\n\"The expeditions of Mr. Hind have established the existence of a broad belt of country, extending from the Canadian settlements to the Rocky Mountains, remarkable for its fertility, and watered by two large rivers and their tributaries. Through such a district a route would not only be practicable, but, as Mr. Hind clearly points out, would possess the advantage of being fed by an agricultural population from one end to the other. The further communication with British Columbia, through a defile in the Rocky Mountains, Captain Palliser has shown to be by no means difficult. Here, at length, is the solution of a much-vexed problem. Not only the possibility, but, regarded from a commercial point of view, the advisability, of establishing a road from the east to the west coasts of North America, lying entirely within British territory, is clearly demonstrated. That the cost of such an enterprise would be repaid; that, considered merely in the light of a business speculation, it would eventually succeed, there can be little doubt when the resources of British Columbia, the contiguity of this colony to the great Asiatic marts, and the certainty of the road-side, as it may be termed, being rapidly peopled by agricultural settlers, are taken into account. Whether the task will be carried out time will tell; its practicability is, however, clearly established. Conducted though these expeditions were with a view to practical results, replete as the published accounts necessarily are with details interesting only to the few, Mr Hind has still interspersed his narrative with lively descriptions of personal adventures, and glowing pictures of the scenes through which he passed.\n\n\"The portions of Mr. Hind's narrative which will be read with most interest by the general reader are those which relate to the customs and occupations of the various Indian tribes with which he came in contact.\n\n\"The geological researches of Mr. Hind in the districts he visited were conducted with that care and attended with those happy results which might have been expected from his intimate acquaintance with that science, he being professor of geology in the University of Trinity College, Toronto. Interesting as this course of investigation must be to the mineralogist, and important to the government by whose instructions it was instituted, it likewise possesses features of attraction for the general reader.\"\n\nTHE SUN—December 17, 1860.\n\n\"The discovery of gold in British Columbia roused the Canadian Government, and induced them to send out an exploring expedition to the Far West, a country until then only known by the backwoods men and Hudson's Bay Company's employers. It was necessary to establish a road and open an overland communication between the two extremities of our vast American possessions; and the success of the explorations, as far as Mr. Hind's narrative takes us, augurs well for the ultimate success of Canadian enterprise, which stands in strange contrast with the imbecility of the Australian Government, who, do what they will, are always left behind by private individuals.\"\n\"As geologist and naturalist to the first exploration of the Red River, Mr. Hind had ample opportunity for making general and minute investigations regarding the fertility of the soil, and, by scientific experiments, to ascertain the probably mean temperature of the various seasons. The reader must bear in mind that the country which Mr. Hind has explored, although not altogether unknown to the white man, the territory of the aboriginal Indian (India so called, because Columbus thought when he discovered America that he had reached the Asiatic continent, and had opened a short road to India), being, nevertheless, part and parcel of the British possessions. In both expeditions, the latter of which he conducted as chief, he met with a natural opposition from the natives to a too close inspection of the country and its resources, they knowing by experience that the European colonist carries out Caesar's terse despatch of *Veni, vidi, visi*. So much has been already written about, and so many speeches composed for the American, that the following extract may seem superfluous, but we beg to remind the reader that this is a genuine translation of what the savage (as our friends at Exeter Hall would call him) gave as his reason for refusing to let Mr. Hind and his friends pass by a particular route.\n\n\"The country explored during the two expeditions extends from the 90th to the 105th deg. west longitude, and from the 48th to the 53rd deg. north latitude. To those who wish to form a correct opinion of the far back settlements, of the trials which the early settlers underwent, and what prospects are now open to the immigrant, we recommend the perusal of Mr. Hind's narrative. We cannot afford space for the many extracts which we could give to exemplify the character of the inhabitants and their social condition, to which Mr. Hind devotes the greater part of the second volume. The establishment of the first colony on the Red River will be read with pride by our persevering brethren north of the Tweed, who after all beat the Anglo Saxon for energy and perseverance under difficulties.\n\n\"The work is illustrated with many woodcuts, and likewise several engravings of remarkable localities, which are executed with great skill and judgment.\"\n\nTHE GLOBE—January 3, 1861.\n\n\"It may be granted, we think, that Mr. Hind has shewn that energy, skill, and capital will make his plans practicable. He has vividly shown the advantages of the route, both to the traveller and to those seeking a home short of the Pacifico. His geological details are ample, his statistics appear clear, and he is alive to the rights, the wants, and the capabilities of the native denizens of the soil. Brilliant-coloured engravings, and well-designed and numerous wood-cuts, give their illustrative aid to the letter-press. Great as these recommendations are—and there are others which we have not named—Mr. Hind's manner of telling his story stands before them all. His sense of the rich beauty or wild grandeur of the scenes which he describes, and his happy adaptation of words to impressions, the serious and reflective tone of his mind, make these volumes as delightful to read as they are instructive to reflect on.\"\n\nTHE GUARDIAN—January 23, 1861.\n\n\"Professor Hind's work, interesting and important as in many respects it is, is not one which affords much material for the reviewer. In spite of its gay binding and coloured engravings, it partakes far more of the...\"\ncharacter of a special geographical treatise than of a book of travels. There are no amusing details of personal adventure, no telling bits for quotation, and in their stead we have a body of valuable but somewhat monotonous details respecting the soil and vegetation of Rupert's Land. In truth, however, such criticism as this is high praise. Mr. Hind had his work to do, and he has done it, as all work is best done, without putting the door too forward. Every reader must know the dissatisfaction of going to a book for information about the subject of which it professes to treat, and finding instead a great deal of information respecting the author. There are some departments of literature which are none the worse for the absence of the autobiographical element. It is always as well, however, to guard the reader beforehand against that fertile source of disgust—disappointment at not finding what he had no right to expect.\n\n\"Those of our readers who take an interest in the progress of British America are already partly acquainted with the contents of these volumes. A Blue-book published in 1859 (of which we gave some account at the time) contained a very full report of the Red River Expedition, by Mr. Hind himself, as well as some fragmentary notices of the Assiniboine and Saskatchewan Expedition. Both these Expeditions were organised by the Canadian Government. The primary object of the first was to examine the country between Lake Superior and Lake Winnipeg, with the view of ascertaining the possibility of opening a communication between Canada and the Red River—or, as it seems to be the fashion now to call it, Selkirk Settlement, but Mr. Hind included in his report a very complete account of the state and prospects of the settlement itself. The design of the second expedition was to complete the exploration of the western side of the Red River valley, and to form some estimate of the capabilities and resources of the country between Lake Winnipeg and the south branch of the Saskatchewan. The general result of the investigations, taken in conjunction with those of Captain Pulliser, was to establish the existence of a belt of fertile land extending from the base of the Rocky Mountains to the Lake of the Woods, and continued thence along the north bank of Rainy River as far as Rainy Lake, only 200 miles to the west of Lake Superior.\"\n\nJOHN BULI.—January 19, 1861.\n\n\"The expeditions here chronicled were undertaken by authority of the Canadian Government, with the view of ascertaining the practicability of establishing an emigrant route between Lake Superior and Selkirk Settlement, and exploring still further west on the chance of colonization. The charge of these inquiries was given to Mr. Hind, Professor of Chemistry and Geology in the University of Trinity College, whose scientific capabilities for the work are sufficiently indicated by his academical position, and whose narrative shows him besides to be a careful and exact topographer, an adventurous traveller, and a very agreeable writer.\n\n\"The result is, that the reader has before him one of the most important contributions that have been made for many years to our commercial and political knowledge.\"\n\n* * * * *\n\n\"The glimpses given of the condition of those ancient tribes who once roved free over the prairie and forest, are full of melancholy interest.\"\n\"Professor Hind of course turned the principal part of his scientific researches towards the geology of the districts which he surveyed. At the same time he was not forgetful of the botany and the fauna of these regions, subjects on which information is so vitally necessary to the colonist. He has fulfilled his whole task in the most praiseworthy manner, and the book reflects credit on the Government which appointed him.\"\n\nTHE ECONOMIST—January 26, 1861.\n\n\"The attention of the Canadian Government has of late years been more especially drawn to the North-Western Provinces—those wide regions of marsh and forest, lake and prairie that, for the most part unexplored, unsettled, and untrodden, except by the brigades of the Hudson's Bay Company or by tribes of wandering Indians, stretch from the great chain of lakes to the foot of the Rocky Mountains—by the discovery of gold in British Columbia, and the steady if slow growth of this neighbouring colony. Close neighbours, however, as the two settlements may be called, where only the Rocky Mountains divide nominal British Columbia from nominal Canada, the unsettled tracts of land that separate the actual colonies offer no slight obstacle to that constant and frequent intercourse between them that would prove so beneficial to both if it could once be accomplished.\n\n\"The volumes now under our notice form one among many proofs of a sincere desire on the part of Canada to open up commercial and friendly relations with its sister colony, and at the same time to ascertain the value and suitability for permanent settlement of the country lying between the Western shores of Lake Superior and the Rocky Mountains on the one hand, and on the other, between the boundary line of the United States and the head of Lake Winnipeg in about lat. 54°.\"\n\n* * * * *\n\n\"Mr. Hind gives a vivid account of this second 'run,' at which he was present; indeed his whole contribution to our former knowledge of the Red Indian and his ways his highly interesting and valuable.\"\n\n* * * * *\n\n\"There are many other subjects connected with British North America on which much fresh light is thrown by Mr. Hind's painstaking and thorough investigations. We have not space to enter upon them here, but must refer our readers to the work itself, as one which, (although, from the large amount of scientific matter it contains, and the minuteness of its explorations, it is not adapted to attain general popularity,) will repay the attentive reader with much agreeable as well as solid and valuable information.\"\n\nTHE CRITIC—December 22, 1860.\n\n\"It would be difficult to overrate the geographical importance of Mr. Hind's 'Narrative' of the Canadian Exploring Expeditions 1857-8. An amount of information is here collected respecting a portion of the North American continent, hitherto but little known, such as cannot but have the most important effect in developing the commercial importance of that part of the world. It being thought desirable to ascertain whether an emigrant route were practicable between Lake Superior and Selkirk Settlement, and to explore the capabilities and resources of the...\"\nscientific\n\nAt\n\nof these\n\nto the\n\nworthy\n\nwhich\n\nyears been\n\nthese wide\n\nmost part\n\nof the\n\nfrom\n\n—by the\n\ngrowth of\n\ntwo set-\n\nnomi-\n\nof land\n\nconstant\n\nbeneficial\n\nproofs\n\nsocial and\n\nto ascer-\n\ncountry\n\nRocky\n\nboundary\n\nlat.\n\nwhich he\n\nknowledge of\n\n\"the\n\nNorth\n\ninstak-\n\nthem\n\nwhich,\n\nand\n\ngeneral\n\nas well\n\nMr.\n\n1857-8.\n\nof the\n\ncannot\n\nimport-\n\ncertain\n\nand\n\nof the\nvalley of the Red River and the Saskatchewan, these expeditions were organised, and the results are fully narrated in the two handsome volumes before us. Whilst the contents of these volumes are of a nature best calculated to arrest the attention of the geographer, the geologist and the commercial settler, there is also so much in them that will be interesting to the general reader, that we cannot resist the temptation of quoting a few passages. The reader is probably already familiar with the manner in which these expeditions are conducted—the river navigation, the portages, and so on. Here, however, is a natural and charming picture of life in the wilderness, which brings it home to us in all its rugged but picturesque beauty.\"\n\n\"These volumes are plentifully furnished with maps, engravings and illustrations in chromoxylograph, and altogether possess a high value and interest as contributions to geographical science.\n\n\"Mr. Hind's narrative tells of the wilderness, and Herr Kohl's of the city.\"\n\nORIENTAL BUDGET—January, 1860.\n\n\"Mr. Hind was appointed, in 1857, by the Canadian Legislature, as geologist to an exploring expedition from Lake Superior to the Selkirk Settlement on the Red River; and again, in 1858, \"in command\" of another expedition from the Selkirk Settlement to the Assinniboine and Saskatchewan Rivers; having in view the discovery of a route from Lake Superior to the Pacific Ocean, and a route entirely through British territory. If Mr. Hind had felt himself bound to make an exact report of everything that occurred from his leaving his bed on the morning of his starting, he could not more conscientiously have performed his duty than in sending the draft of these volumes to the Canadian Government. He was despatched as a geologist, and he has faithfully fulfilled his mission as such, in a properly cold and stony way. He exhibits rare qualities of labor, and the prosy exactitude of a diary, in registering, step by step, the vegetable products and the adaptation of the soil.\n\n\"He did his duty discreetly and earnestly. He has now afforded the world an opportunity of obtaining in London, what they might have had a difficulty in procuring from the archives of Toronto.\"\n\nTHE SPECTATOR—December 22, 1860.\n\nTHE FAR WEST OF BRITISH AMERICA.\n\n\"Four main divisions constitute the magnificent range of British territory north of the American Union. On the West, between the Rocky Mountains and the Pacific, lies our youngest colony, British Columbia, whose gold wealth will ensure her a marvellously rapid progress. On the East, extending through the basin of the St. Lawrence from Lake Superior to the Atlantic, are Canada and its sister provinces, comprising together a population which exceeds by one million that of the thirteen United States during the Revolutionary war. Between these two extremes spreads a glorious wilderness, the southern portion of which is known as Rupert's Land, and the northern as the special domain of the Hudson's Bay Company, which also extends its operations over the southern portion of this great central region. A direct overland communication between Canada and British Columbia, and through them from ocean to ocean, would be of immense advantage to both colonies as well as to the mother country; and whilst Governor Douglas is stre-\nnuously working out the portion of this project which it pertains to him to accomplish, the Government and Parliament of Canada have not been remiss on their side. It was by their orders, and at their cost, that the Expeditions which form the subject of these volumes, ascertained two grand facts. These are, the practicability of establishing, first, an emigrant route between Lake Superior and Selkirk settlement on Red River, and next, a new colony for the reception of the emigrants, in a highly fertile belt of land with a favorable climate, which stretches through eighteen degrees of longitude, from a few miles west of the Lake of the Woods to the passes of the Rocky Mountains.\n\n\"Mr. Hind states that a route, partly by land and partly by water, passing only through British territory, from Fort William to Fort Garry, by Arrow Lake and the Boundary line, might be rendered available for summer communication at a cost of only £12,000. By this route, an emigrant might reach Selkirk Settlement in twenty-two days from Liverpool. At present, the journey may be accomplished either in summer or winter via St. Paul's, Minnesota, in thirty-seven days. But Rupert's Land will not long be left dependent on such imperfect inlets of population as these. It is probable that Canada will begin to stretch out her long iron arm towards the new colony in the spring of next year.\n\n\"It is then demonstrated that her Majesty's subjects at home and abroad are invited by the bounty of nature and by the most favorable social circumstances to link the Eastern and Western hemispheres together with a chain of British dependencies, extending across the whole breadth of the North American continent, and thus to build up a new empire in the West, where peace, plenty and civilization shall dwell under the safeguard of British institutions. This is the main conclusion established by the two exploring expeditions narrated by Mr. Hind, and in dwelling upon it we have been compelled to forego the pleasure of noticing a multitude of interesting details. For these, and for a fuller development of the main argument, we refer to the volumes themselves, with our best thanks to the author for the careful and able manner in which he has presented their valuable contents.\"\n\nTHE ATHENÆUM—December 22, 1860.\n\n\"In July, 1857, an expedition was organized by the Canadian Government to examine the country between Lake Superior and the Red River of the North; and in 1858 another expedition, under the same auspices, was equipped for the purpose of exploring the vast Assiniboine and Saskatchewan Districts; which are bisected by the 50th parallel of north latitude, and extend from Lake Winnipeg to the Rocky Mountains. The former expedition was commanded by Mr. Gladman, the latter by Mr. Hind. Both had the advantage of the services of able scientific men; and their historian, although the severities of science have trammeled his pen, nevertheless tells his story in a manner to command approbation. True we look in vain for such pages of thrilling excitement as abound in Mr. Paul Kane's 'Wanderings of an Artist among the North American Indians,' but there are many passages of deep interest in Mr. Hind's volumes; while the records of his scientific labours and those of his brother officers are of great value.\n\n\"The main object of the two expeditions in which Mr. Hind was engaged was, to ascertain whether a route is practicable through British North America from the Great Lakes to the Pacific. The idea is not new. The Journal of the Geographical Society for 1852, contains a lucid\nand admirable paper, by Capt. Synge, R. E., proposing a route which would afford a rapid communication with the Pacific and the East, via British North America; and other enterprising explorers, among whom Capt. Palliser holds a prominent position, have pointed out the great importance of establishing a similar line of route. But no explorations previous to those described in the present volumes have given us such accurate data for determining the best line of route through British North America to Columbia; and the great feature in Mr. Hind's narrative is, the discovery of what he calls a Fertile Belt of land north of the great American Desert.\n\n\"Mr. Hind prophecies, and very reasonably, that before long a great nation will subdue and render fruitful this vast district, which may be designated as the basin of Lake Winnipeg. Its fertility is amazing.\"\n\n* * * * *\n\nThe 'great Fertile Belt,' besides being thus agriculturally rich, possesses vast stores of lignite coal, iron, and salt; and the prairies teem with buffaloes, which are entrapped in enormous numbers by the Indians, who wantonly kill hundreds merely for the sake of their tongues.\n\n\"Unhappily, there is a dark side to this picture of prosperity. The insect plagues of Egypt are, it seems, reproduced in Assinniboine; and it not unfrequently happens that plenty and luxuriance are turned, in a few hours, into scarcity and utter desolation. The destructive agent is the grasshopper—countless millions of which insect suddenly appear in the summer.\n\n\"As a matter of course, the scientific results of the two expeditions occupy a large portion of Mr. Hind's volumes. The geology of the country explored is described in great detail, and a profusion of clear maps and excellent chromoxylographs and woodcuts assist greatly in making us better acquainted with one of the most interesting parts of our vast possessions in North America. Altogether, these volumes are creditable to Mr. Hind and his brother explorers.\"\n\nTHE GLASGOW DAILY HERALD—December 26, 1860.\n\n\"In these volumes we have an interesting and valuable account of that immense region lying to the north of Canada and the United States, stretching east and west from the Atlantic to the Pacific, which is still the home of the Red man and the buffalo, and in which civilisation has only planted a small number of outposts—the most extensive being the settlement established by Lord Selkirk in 1812, which has now grown into a colony numbering nearly 10,000 people. Hitherto these territories, containing immense tracts of pasture, woodland, and prairie of vast fertility, rivers and lakes of great magnitude, and natural scenes and objects of matchless beauty, have been practically under the sway of the Hudson's Bay Company, and ate only known to the industrial world by the production of furs or 'peltries.' But the day is evidently not far distant when these fertile lands will become the home of enterprising communities of civilised men, and, sooner or later, a great inland line of communication between the seaboard of the Atlantic and the Pacific will pass through these vast regions, the solitude of which is now only broken by the presence of wandering tribes of Indians, or widely-scattered families of half-breeds, who labour as hunters or trappers in the service of the Hudson's Bay Company. For the valuable information now before us, we are indebted to the enlightened zeal of the Canadian Government, by which the expeditions of 1857 and 1858 were organised; and although vast tracks were actually explored and surveyed\nin these years, the news from these interesting territories is brought down to the beginning of the present year 1860.\n\n\"We have marked several passages for quotation from this deeply-interesting narrative. Mr. Hind's exploring party, with his Indian and half-breed assistants, is en route, have camped for the night, and thus they are aroused by\n\n\"MORNING IN THE WILDERNESS.\n\n* * * * * * *\n\nTHE MORNING STAR AND DIAL.\n\nFIRST NOTICE.\n\n\"The unoccupied territories of British North America are less known to the majority of Englishmen than even the icy bound regions of the North Pole. For a period of nearly two centuries they have constituted the domain of a fur trading company—the last of those monopolies which belong to an age when English monarchs did not scruple to step beyond the limits of their prerogative, and bestow upon their creatures and sycophants the inheritance of the nation. But there is a time when even monopolies are appointed to die, and chartered corporations must succumb to the great interests of civilisation. Almost simultaneously with the development of British Columbia as a colony, a select committee of the House of Commons instituted an enquiry into the resources and condition of that vast territory which stretches from the Canadian boundary to the Rocky Mountains, and made us acquainted with the fact that it possesses agricultural capabilities which render it fit for colonisation upon a very extended scale. It is true that there were those who held a contrary theory, and who contemptuously ridiculed the predictions of far-seeing and practical men. But subsequent experience has given an aspect of sober reality to what were regarded as the day dreams of visionaries, and has proved indisputably that the means of communication may one day be opened up between the two extremities of British North America. When once the tide of immigration is permitted to flow into these remote regions, the Anglo-Saxon race will, no doubt, give to the world another evidence of its power to convert the desert into a garden, and to make nature, even in its most savage state, subservient to the comfort and prosperity of man. To the Canadian Government would seem to belong the duty of taking the initiative in this great work. They have as yet failed to perform their whole duty in the matter; but we must give them credit for having so far yielded to public opinion as to send out two expeditions to explore the country. Mr Hind, who was attached as geologist to the first expedition, and was appointed to the command of the second, has embodied the results of the labours of himself and his colleagues in two exhaustive volumes, which may be perused with profit, as well as with unflagging interest by all classes of our fellow countrymen.\n\n\"Mr. Hind gives a minute and graphic narration of his journey, interesting, perhaps, more to the naturalist and to the geologist than to the general public.\"\n\nAMERICAN JOURNAL OF SCIENCE AND ART.\n\nReview of a Narrative of the American Expedition to N.W. British America, to observe the total Solar Eclipse of July 18th, 1860; written by Wm. Ferrel, and communicated by Capt. C. H. Davis, U. S. N., Superintendent of the Nautical Almanac.\n\n\"The party was furnished with Professor Hind's Report, and the ac-\ncompanying maps, of the Assinniboine and Saskatchewan exploring expedition, which were of great advantage in enabling it to determine its rate of progress, the distance and locality of good boat harbors, &c., by a reference to the map in which the principal bays, islands, capes, harbors, dangerous boulders, &c., are to be accurately delineated, as well as described in the report. They were especially useful in determining the point on the river of the southern limit of total darkness of the eclipse.\"\n\nTHE CANADIAN NATURALIST AND GEOLOGIST,\nMontreal, February, 1861.\n\nThese explorations were undertaken for the purpose of ascertaining the practicability of establishing an emigrant route between Lake Superior and Selkirk settlement and of acquiring some knowledge of the natural capabilities and resources of the Valleys of the Red River and the Saskatchewan.\n\nIn pursuance of these objects the author has given in these volumes a minute, clear and most readable account of the districts through which his course lay. The work is really a credit to the Province. The two volumes are profusely illustrated with beautiful and artistic views of interesting localities. This book should be in all our public libraries and be carefully studied by those who interest themselves in the prosperity and extension of the Province to the westward. Distances, topography, natural productions, geological structure and climatal conditions of these regions are carefully noted. Intending emigrants will find the work invaluable.\n\nTHE CANADIAN JOURNAL OF INDUSTRY, SCIENCE AND ART,\nToronto, March, 1861.\n\n\"In the year 1858 there was issued from the press of the Provincial Government, a Canadian Blue Book, 'printed by order of the Legislative Assembly,' and embodying the 'report on the exploration of the country between Lake Superior and the Red River Settlement.' In 1859, a second Blue Book printed by the same authority, reported the result of another exploratory expedition, to survey the valleys of the Assinniboine and Saskatchewan rivers. Both reports were illustrated with maps, sections, and wood-cuts of geological and other objects of interest; and attracted fully as much attention as the most interesting of blue books usually do. A review in our own pages, directed the attention of our readers to some of the most attractive of their varied contents, and the Canadian press generally published notices and extracts from them, but it is an old saying that Parliament can print blue books, but it is beyond its power to make people read them; and we doubt if the 'Red River' and 'Assinniboine' Blue Books furnished any very notable exception to this popular dictum. Extracts and digests in the periodical press sufficed to gratify popular enquiry: a few copies were bound and placed on the shelves of both public and private libraries, both here and at home, and the remainder, it is to be feared, experienced the usual fate of Blue Books, however valuable. But the enterprising leader of those expeditions wisely conceived that the subject treated of in his two reports merited a wider and more enduring interest; and the two handsome and copiously illustrated volumes, now issued from the London press, suffice to show what good editing and liberal publishing zeal can effect. A soldier returned from a rough campaign, tattered, travel-\nstained, and way-worn, does not differ more marvellously from the hero set forth by the most fashionable of army tailors for a review or presentation at Court, than does the Blue Book of our Canadian Parliamentary press from these gay volumes, with their chromoxylographs, wood-cuts, maps, and sections. The very wood-cuts which had already figured in the first issue are scarcely recognisable in their new and greatly improved aspect, under the combined effects of good paper and London printing.\n\n\"From the attention which those expeditions have already excited in the Province, and the extent of our former notice of them, it is scarcely necessary that we should now do more than call attention to this revised edition of the reports. They have been augmented by information derived from various sources; new maps and plans greatly add to their practical value, and the whole work is reproduced in a highly creditable permanent form. To the topographer it supplies much valuable material; the ethnologist will find in it many references full of interest to him; while to the future historian of the extending provinces and colonies of British North America it will be indispensable as a book of reference. In this latter department, the history of British America, like that of our great Indian Empire, is intimately interwoven with that of one of the great trading companies of the remarkable people whom the first Napoleon sneeringly designated a nation of shopkeepers. That they do now constitute a nation dependent for their enduring greatness on their world-wide trading relations and commercial enterprise is indisputable: and among the powerful trading corporations by which their territorial influence and wealth have been extended, an important place must be given to that company, which deriving its name from the great Arctic Bay that bears the name of the bold explorer Henry Hudson, has extended its forts and trading-posts from the Gulf of the St. Lawrence to Vancouver's Island and the shores of the Pacific and Arctic Oceans. Professor Hind gives this condensed sketch of the great Fur Company's history.\n\n\"This is a remarkable chapter in British Colonial history. The capital, property, and investments, of the company were set down by one of their own officials in 1866 at the immense sum of one million two hundred and sixty-five thousand and sixty-seven pounds sterling; and its influence over the destinies alike of natives and settlers throughout the vast area extending from the Atlantic to the Pacific shores, is all-predominant and unchecked.\n\n\"The history of the Selkirk colony of Red River curiously illustrates the relations alike of Indians and European settlers to the all-powerful trading company.\"\n\n\"These extracts and notices may suffice to illustrate the interest which attaches to the volumes in question. Many other subjects of equal value are discussed. The routes of travel, future lines of road, character and resources of the country, statistics of population, and the industry, trading, and missionary enterprise, of the various districts explored, are all treated of in detail. Indian customs, superstitions, and general characteristics, as well as the history of the curious mixed population growing up within the Company's territories, supply materials for another series of chapters; while a third is devoted to the geological and palaeontological characteristics of the country explored. Numerous illustrations add to the minuteness and value of those details; and combine to form a work which ought to find a place in every public library in Canada.\"\n\nD. W.\nThe hero\npresen-\nimentary\nwood-cuts,\nfigured in\ngreatly im-\nLondon\n\nexcited in\nscarcely\nrevised\nde-\nto their\ncreditable\nmaterial\ninterest to\nand colo-\nbook of re-\nAmerica, like\nthat of\nwhom the\nThat\ngreatness\nin-\nwhich\nimportant\nfrom the\nHud-\nof the St.\nArch-\nthe great\n\nThe cap-\nby one\ntwo\nand\nthroughout\nis all-\n\nillustrates\npowerful\n\nwhich\nequal\ncharacter\nindustry,\nare\ngeneral\npopulation\nfor an-\ntical and\nnumerous il-\nand com-\nlibrary\nD. W.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_46825.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 21, "total-input-tokens": 32652, "total-output-tokens": 10229, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1780, 3], [1780, 2890, 4], [2890, 2890, 5], [2890, 5032, 6], [5032, 10545, 7], [10545, 13971, 8], [13971, 17440, 9], [17440, 20806, 10], [20806, 23946, 11], [23946, 24318, 12], [24318, 24318, 13], [24318, 27632, 14], [27632, 31214, 15], [31214, 34784, 16], [34784, 38062, 17], [38062, 41408, 18], [41408, 45016, 19], [45016, 45462, 20], [45462, 45462, 21]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]