[{"id": "d7426d697e168725a30460fde619c72cb57faba1", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\nCouverture de couleur\n\n☐ Covers damaged/\nCouverture endommagée\n\n☐ Covers restored and/or laminated/\nCouverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\nLe titre de couverture manque\n\n☐ Coloured maps/\nCartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\nEncre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\nPlanches et/ou illustrations en couleur\n\n☐ Bound with other material/\nRelié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\nLa reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\nIl se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —— (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —— signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLas cartas, planchas, tableaux, etc., pueden ser filmados a diferentes tasas de reducción. Los documentos demasiado grandes para ser reproducidos en una sola exposición se filmarán comenzando en la esquina superior izquierda, de izquierda a derecha y de arriba hacia abajo, tantos cuadros como sean necesarios. Los siguientes diagramas ilustran el método.\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\nA DRAMA IN FOUR ACTS,\n\nENTITLED:\n\n\"Against the World,\"\n\nOR.\n\nLIFE IN LONDON.\n\nWRITTEN BY\n\nHEINRICH B. TELGMANN.\nDramatis Personæ.\n\nHERBERT WALSTON..........................A poor Office Clerk.\nJOHN HARKING..............................A Cotton Manufacturer.\nJAMES HAYWOOD, alias LORD AINSLEY. {A noted Counterfeiter, Forger\n                                      and Bank Robber.\nSHARP.....................................{A Detective, on Haywood's\n                                      track.\nPARSNIPS, alias CURBY WINKELS.......{An old Jail Bird, employed\n                                      by Haywood.\nSIR JOSEPH FITZGERALD...................{A Friend of the Family, and\n                                      in love with Ophelia.\nADAM JONES...............................{A Servant in the Harking\n                                      Mansion.\nCRUMPET...................................An Ornament to Society.\nPOLICEMAN.................................One of the Bravest.\nPAULINE BRADDON..........................John Harking's Ward.\nHELEN ARMSBY..............................Pauline's Companion.\nOPHELIA HARKING..........................In love with Sir Joseph.\n\nMOB, FIREMEN, POLICEMEN, etc.\n\nCOSTUMES—MODERN.\n\nSTAGE DIRECTIONS, AND GENERAL MAKE-UP.\n\nR means right when facing audience; L, left; C, centre, etc.\n\nHERBERT WALSTON—Young man. JOHN HARKING—Tall, about sixty. JAMES HAYWOOD—Tall, middle-aged. SHARP—Middle-aged. PARSNIPS—Short, about sixty. SIR JOSEPH—Small, about sixty. ADAM JONES—Old or young. CRUMPET—Short; make-up, a bum. POLICEMAN—Tall, middle-aged. PAULINE—Young lady. HELEN—Young lady. OPHELIA—Spinster of forty-five.\nAgainst the World\n\nACT I.\n\nScene I.\n\nExterior of Harking Mansion. House R of stage. Part of summer house L. Two rustic hedges, one under window of house, one near S. H. Iron fence back of stage. Fancy gate C, with lamps on each post. Mr. Harking and James Haywood seated on benches near S. H. Harking with cane, Haywood with cigar.\n\nHARKING. Yes! I am proud of my home and its surroundings, and with good reason, for I have toiled hard enough for them. My father was a poor man, and died leaving me, with a fair education, to provide for my mother, brother and sister. The blow was too heavy for my poor mother, and in a few years she was lying by his side. My only brother died several years later, so that my sister, Ophelia, is my only living relative.\n\nHAYWOOD. But Miss Braddon—is she not your niece?\n\nHARK. Oh, no! She was my partner's only child. He died fifteen years ago, leaving in my charge his immense fortune for Pauline, and making me her guardian.\n\nHAY. With such a charming ward you should be happy, Mr. Harking.\n\nHARK. Far from it. I have not yet told you the worst. Two years after I was married my wife died, leaving me with a little son a year old. Then my sister Ophelia came to live with me and to take care of the little motherless fellow. But—but—(rubbing eyes with handkerchief)—before he was two years old he disappeared—was stolen from the house.\n\nHAY. What! Stolen from the house! And you have never heard of him since?\n\nHARK. No. Never to this day, though large rewards were offered and detectives employed to search everywhere.\n\nHAY. Why do you believe he was stolen?\n\nHARK. Because I have good reasons for believing it. Five years before my son disappeared three of the most desperate scoundrels in the country were convicted on my sole evidence and sentenced to prison for five years. And one of them swore to be revenged on me when his term had expired.\nHAY. And did he keep his word?\n\nHARK. A fortnight before my son's disappearance I received a warning, and the crime of robbing me of my child I lay at that scoundrel's door.\n\nHAY. Your son may yet be living. Do you ever expect to find him?\n\nHARK. No. I have given up all hope. (Covers face with hands.) I shall never see my boy again.\n\nHAY. Mr. Harking, I feel for you; but who knows—some day, when least expected, your son may turn up again.\n\nHARK. No, I feel that I shall never see him again. (Wipes his eyes.)\n\nHAY. Though you have been unfortunate, Mr. Harking, still, with such a home, your sister and charming ward, you should be happy.\n\nHARK. I have tried to be, but I shall never be happy till I have my son in my arms again, (drops head) and that may be never. (Wipes eyes and then suddenly looks up.) It is time that I was at the office. You will excuse me. (Haywood nods.) Make yourself at home, and entertain the ladies in my absence. (Goes to gate, stops, and looks back at Haywood.) What a handsome husband he would make for Pauline. A lord and a millionaire.\n\n[Exit through the gate.]\n\nHAY. (Puffing cigar.) What a devilish romantic story that would make! I'm a hard crust, but by heavens, it nearly brought tears to my eyes. Tears! Gad, it's such a long time since I have shed tears, I'd hardly know how to begin. (Puffing.) How easily I have settled myself into this man's confidence. A lord—a millionaire—ha, ha, ha! Let me see—(takes out pocket-book and counts money)—three pounds, six shillings. Never mind, I shall win Miss Pauline's affections, and then, if I am not a lord, I shall be worth at least several hundred thousand pounds.\n\nEnter Parsnips at gate, stops and listens while Haywood is speaking.\n\nBut what if I fail? Pshaw! There is no such word as fail—at least not for me. I have always been successful, and why should I fail in this game?\n\nPARSNIPS, advancing taps him on the shoulder and whispers.\n\nPARS. But every dog ha' is day! (Haywood jumps up.) Eh, Mr. Haywood?\n\nHAY. Parsnips! Gad, I didn't know I was speaking so loud. (Aside.) What does he want here?\n\nPARS. You didn't speak so very loud, Mr. Haywood, but I knewed your thoughts pretty well.\n\nHAY. Why, I'm delighted to see you—(alarmed)—but not in this place. What brings you here?\nPARS. (Surprised.) What brought I here? Why, to 'elp an old friend—to 'elp you in your game, Mr. Haywood. I allus sticks close to a friend, ha, ha!\n\nHAY. I do not understand you. What do you mean by my game?\n\nPARS. (Looking into H's eyes.) Do you think I be blind? Why, the two hundred thousand pounds locked in Mr. Harking's safe—that be your game, Mr. Haywood. Yer goin' to bust the safe and make away with the money, but you can't do it alone. Come, now, I'll gi' you my help for ten thousand pounds or you shant get one farthing of it.\n\nHAY. Parsnips, I am sorry you have made such a mistake. My intentions with this family are strictly honorable. I have taken a fancy to Mr. Harking's ward and I intend to win her.\n\nPARS. So yer intentions be strictly honorably. You have taken a fancy to the young lady and intend to win 'er. Ha! Ha! Mester Haywood, ya be a cool un. Ya ha taken a fancy to the young lady's money. (Whispers.) But, Nellie, your wife in Manchester. (Hay starts.) What will ya do wi' er?\n\nHAY. (Low.) I have deserted her, speak of her no more. You have guessed it. This young lady is rich, and I intend to win her for her fortune. But her fortune does not consist of hard cash in her guardian's safe as you suppose. If it did I should have had it ere this. It consists of property. I cannot see how you can assist me in that.\n\nPARS. But suppose, Mr. Haywood, there be another young man in the field in Miss Pauline's favor.\n\nHAY. (Starts.) That's serious. I didn't think of that before. Well, we should have to get rid of him.\n\nPARS. (With a smile.) There's where the work comes in for I, Mr. Haywood.\n\nHAY. But I can hardly think that there is another suitor. I have been here just a week and so far have not seen one; however, we shall have to keep our eyes open. (Listens.) Some one is coming—quick, this way. [Hurriedly exits, L. E.]\n\nEnter PAULINE, 2nd R. E., with bunch of flowers, followed by HELEN with letter in hand, which she is holding behind her.\n\nPAULINE. Oh, Helen, you are such a tease. How can I guess what you have for me?\n\nHELEN. (Looking slyly at her.) You can't guess! (Paul shakes head.) Can't guess what Ben would bring from Mr. Harking's office?\n\nPAUL. (Smiling.) Why, of course, a note from Herbert.\n\nHEL. You've guessed it. (Gives note; Pauline starts to open it) Pauline, do you love Mr. Walston?\n\nPAUL. Why, Helen, of course I do.\nHel. (Slyly.) Then don't let Lord Ainsley steal your heart from him.\n\nPaul. Never.\n\nHel. I saw him casting sheep's eyes at you, no, I mean wolves' eyes. (Paul looks astonished.) He may be a lord but he has wicked eyes.\n\nPaul. (Kisses Helen.) I shall take your warning. I will never forsake Herbert. (Opens note.) I must see what he says.\n\nHel. (Going to gate.) Sweet things, I suppose. (Looks left while Pauline is reading note.)\n\nPaul. (Reads.) \"My darling; meet me on the lawn at noon. We shall have at least half an hour together.\" (To Helen.) Why, he has forgotten to sign his name. (Helen comes quickly down from gate.)\n\nHel. Well, he can answer for himself. He is coming up the walk now.\n\nPaul. What, so soon! (Goes to gate and looks down left.) Yes, it is he. (Returns.) Helen, Mr. Harking must not find us together.\n\nHel. He shall not, for I will watch (smiling) while you and Herbert are talking sweet things together.\n\n[Goest to door 2nd, R. E. Exit laughing.]\n\nPaul. (Looking after her.) The dear girl, how she loves me. (Goes to set on bench near S. H. Reads note again to herself, then puts it into her bosom.) Only half an hour. (Arranging flowers.) Poor Herbert, how hard it is he should have to steal in here like a thief to be a few minutes with me, and how hard he works, all for me, while he is ignorant of the fact that I am an heiress.\n\nEnter Herbert C. Looks around. Sees Pauline, who goes to him.\n\nHerbert. (Going to her.) Ah, here you are, my darling! (Kisses her.) Did you receive my note?\n\nPaul. Yes. But why did you not sign your name or initials to it?\n\nHerbert. (Starts.) Did I not give any signature? I must have forgotten, I was in such a hurry. (They go L. to stage in front of S. H.)\n\nPaul. (Puts flowers on his coat.) Now tell me what brought you here so early?\n\nHerbert. Something very important.\n\nPaul. But not serious, I hope?\n\nHerbert. Perhaps! It is concerning this lord who is the guest of your guardian.\n\nEnter Parsnips from back of S. H., goes R., watches them.\n\nPaul. What! Lord Ainsley? (Parsnips comes closer and starts suddenly L.)\nPARS. Ah! I ha' found him at last! It be him! [Exit.\n\nHERB. Yes, Lord Ainsley. (Takes her hands.) Now, Pauline, you know you have promised to be mine.\n\nPAUL. Surely you are not jealous of Lord Ainsley?\n\nHERB. No, not jealous of him tho' he be a lord and I only an office-clerk. But you know that our engagement is a secret.\n\nEnter Parsnips and Haywood.\n\nPAUL. But what has that to do with Lord Ainsley?\n\nPARS. Ya see, Mr. Haywood, yer chance of winning that lady be mighty poor. 'Er 'art be set on that 'ere chap. We may as well give up the job.\n\nHAY. (Through teeth.) I'll see him dead first!\n\nPARS. There be na use. I knows the chap too well.\n\nHAY. I have started this game and I will come out victor. (To Parsnips.) Leave this place at once. We must not be seen together. Return in half an hour and tell me all you know about this young man.\n\n(Parsnips nods and exits.) L. E. Haywood stands back and listens.\n\nPAUL. Surely Mr. Harking cannot mean such a thing.\n\nHERB. But it is a fact. He does. I will tell you what I heard. The door which leads into the private office was open and I could not help overhearing the conversation. An old friend of his called this morning, and in the course of their conversation the subject turned to your guest, Lord Ainsley, and, Pauline, these are the exact words Mr. Harking uttered: \"Yes, he is a fine person and has a very large fortune.\" (Haywood smiles.) He has taken quite a fancy to my ward, and my greatest joy would be to see him carry her off as his wife.\" (Pauline frowns.) Imagine my dismay at hearing such words. I immediately wrote that note to you, and in my haste forgot to sign it.\n\nPAUL. I can easily imagine what pain it must have caused you, but I assure you, Herbert, Mr. Harking only imagines all this. I shall never encourage Lord Ainsley. I have given you my heart and nothing on earth shall separate us but death.\n\nHERB. (Kissing her.) My little darling!\n\nHAY. (With a scowl.) Well, if nothing else will separate them then it shall be death. Yes, death to him. [Exit through gate.\n\nHERB. (Takes her hand.) Pauline, I will trust you, though at present the prospects of making you my wife are very poor.\n\nPAUL. Herbert, do not let such gloomy thoughts enter your mind. We are both young. You are ambitious, and I know you will succeed.\n\nHERB. (Earnestly) But after what happened this morning in the office it is hard to retain hopes for the future. (Passionately.) Oh! Pauline, I would rather lose my life than your love.\nPAUL. And, Herbert, I could never bear even the thought of losing you.\n\nEnter Mr. Harking at gate. Letters and papers in hand.\n\nHARK. I must look into this rascality. (Sees Herbert and Pauline together.) Ah, I have not been misinformed. He is with her now.\n\nPAUL. Oh! There's Mr. Harking. (Herbert jumps aside.) Good morning; what is the matter, you look so cross.\n\nHERBERT. (Aside.) He is angry because he has found us together. I dread the consequence.\n\nHARK. (To Pauline.) Yes, my dear, I have good reason for appearing cross. (They go toward house.) Come, I will explain it all after lunch.\n\n[Exit Pauline, 2 R. E.]\n\nHARK. (Turning swiftly to Herbert.) And you will oblige me very much by appearing here in half an hour. [Exit, 2 R. E.]\n\nHERBERT. (Nods assent.) What have I done, after all his kindness to me, and after all the care I have taken to please him? (Suddenly.) He is angry because he has found me in company with his ward, and because I have dared to love her. (Drops head.) All my hopes are gone. (Goes to gate.)\n\nEnter Sir Joseph, who runs against him. Exit Herbert.\n\nSIR J. (With broom under his arm.) Well, I should sigh if that isn't a walking lamp-post. (Looks around.) Well, I'm here at last. That's the third person I've run into today, besides entering the wrong house. I don't know why it is, but I have been terribly absent-minded lately. I guess I have Ophelia on the brain—that delightful creature! and that accounts for it. (He suddenly looks around.) She's not here per agreement. Perhaps I have come too early. (Goes to bench near S. H.) I will rest my weary limbs till she appears. I shall put my umbrella on the bench so that I won't forget it. (Lays broom on the bench and sits down.) Why the devil isn't she here per agreement? Now she knows I love her, and she has taken advantage of me. But I won't have it. When she comes I will appear indifferent, cool, snappish. In fact, I'll not take much notice of her. (Listens.) Ah! that's Ophelia now.\n\nEnter Ophelia, 2nd R. E.\n\nI'll let no woman pull my nose.\n\nOPHELIA. Oh! there he is. He has evidently been waiting for me. (Sighs loudly. Sir J. starts.)\n\nSIR J. That's her. (Clasps hand on heart.) It's no use, my heart rebels against it. (Rises, looks at her and smiles. Miss Harking,—(bows)—Ophelia, if I dare—I am here once more to walk in your beautiful gardens.\n\nOPHELIA. (Smiles.) Yes, once more to talk of flowers, animals, of all nature. But, Sir Joseph, you are a little late in coming.\nSir J. Miss Harking—Ophelia, if I dare—I am getting very absent-minded. Do you know, I was in such a hurry to get here that I made the terrible mistake of going into the wrong house, and got kicked out again for my trouble.\n\nOph. Oh! Wasn't that funny? (Laughs heartily.)\n\nSir J. What? The kicking?\n\nOph. No, the mistake.\n\nSir J. But that wasn't all. They actually called me a street sweeper. Luckily for me I had my umbrella with me and I—\n\nOph. But where is the umbrella, Joseph?\n\nSir J. (Points to broom.) There it—O-o-h-h! (Picks up broom.) That accounts for it. Instead of taking my umbrella from behind the door I took a broom and carried it all the way through the public thoroughfare. I have disgraced myself.\n\nOph. It's all right, Joseph dear, I have a little silk sun shade that will do till you get home.\n\nSir J. Miss Harking, Ophelia, you are an angel without feathers—wings—wings—I mean.\n\nOph. Oh! Joseph, you flatter.\n\nSir J. Nay, my be-beloved, talking about angels—feathers, wings and other animals, you look so charming this morning. No flattery. You do put me in mind of my mother so much—she was such a nice old lady.\n\nOph. (Suddenly jumps up with a look of contempt. Walks quickly to 2nd R. E.) Old lady, indeed! (Exit quickly, 2nd R. E.)\n\nSir J. (Jumps up, follows, stares after her, then returns.) Well, I should sigh. Went without any notice or leaving her address. (Goes to seat and examines it, sits down, then rises and shakes head.) There was no pin on the seat. Then what under my wig could it have been? How fast she went. She might have said good-bye. (Drops into bench near S. H.)\n\nEnter Old Ben with note in hand humming.\n\nSir J. Shut up! How dare you sing when I am so unhappy?\n\nOld Ben. (Gives Sir J. note.) 'Ere, mistress sent I wi' this to you.\n\nSir J. Oh! this will explain all. (Reads.) \"Sir Joseph Fitzarmstrong, you have insulted me, and I will not forgive you until you ask pardon on your bended knees. Ophelia.\" No! Never! (Paces up and down.) Ben, do I look like a man who would commit suicide?\n\nO. Ben. (Surprised.) You do look kind o' dangerous.\n\nSir J. (Walks to gate.) Well, tell Miss Harking I am going down to the river to drown myself (aside) in tears, sitting on the bank thinking of cruel, cruel Ophelia. (Exit C.\nO. BEN. Well, he be gone daft! [Exit Ben, 2nd R. E.\n\nEnter Haywood. Looks around cautiously.\n\nHAY. Now the coast is clear, and I can lay my plans before Parsnips without being interrupted. (Looks around.) I suppose he will be here soon. (Sits on bench near S. H. smoking.)\n\nEnter Parsnips at back of S. H. looking around.\n\nPARS. Ah! it be all right Mr. Haywood! No one around, and if anyone comes I slips out that way. (Points to 1st L. E.)\n\nHAY. (Rising.) Good! Now, I have found out that this young man's name is Herbert Walston, and he is her accepted suitor, (Parsnips nods,) and I have also found out that Mr. Harking, her guardian, knows nothing of this, and if he were to find out he would soon put an end to it all. I therefore wrote a note to Mr. Harking, supposed to come from a friend, and this note he received before he left the office. But now tell me what you know of this young man.\n\nPARS. Did Mester Harking tell ya the story of his lost boy?\n\nHAY. Yes, he told me of the disappearance of his son, whom he believes to have been stolen.\n\nPARS. Well, the man as is called Walston be the same as was stolen from this 'ere 'ouse twenty-five years ago—Mester Harking's son.\n\nHAY. Mr. Harking's son! How do you know this?\n\nPARS. How does I know it? (Goes close to Haywood, and softly.) Because it were I who stole him—yes—stole him from the house to 'ave revenge on his father.\n\nHAY. Then you are one of the three who served five years on his evidence?\n\nPARS. Exactly so. I were one; but I were well paid for it. Ha, ha, ha!\n\nHAY. Then you knew where this young man was?\n\nPARS. I kept track o' him until two years ago, when I lost sight of him, and ha' never seen 'im till to-day.\n\nHAY. Perhaps you are mistaken in the man?\n\nPARS. Mistaken! I could swear it were 'im!\n\nHAY. Mr. Harking will separate them; but that does not end all with them. Miss Pauline's love for this young man is so strong that it will be hard to make her believe anything against him.\n\nPARS. And what be your idea?\n\nHAY. That she will have to hate him before I can have the ghost of a chance.\nPARS. What! Ruin the young man's character?\n\nHAY. Precisely. We must make a complete wreck of him—drive him to desperation; if necessary, to suicide. Remember, there's a big thing in it.\n\nPARS. Yes, there's a big stake in it—a young man's reputation, and perhaps his life.\n\nHAY. Bah! It's plain as day the scamp is after the same game as we—her fortune. Then why shouldn't we throw him over and have it ourselves?\n\nPARS. (Scratches head.) I guess you are right. We may as well have it as 'e.\n\nHAY. (Suddenly.) I have an idea.\n\nPARS. What be it?\n\nHAY. (Looks around, then softly.) You must make an accusation against him.\n\nPARS. (Nods.) Ah!\n\nHAY. Accuse him of being the means of sending your son to prison for a deed which he himself committed. In fact, denounce him as a robber and a thief. He will then never dare to show his face to Miss Pauline again until he can prove that what you have said is false.\n\nPARS. But that 'e never can!\n\nHAY. What you must do now is to keep your eye continually upon him, and when you see him in company with Miss Pauline, then will be your time to step forward.\n\nPARS. (Gives his hand.) I'll do it. (Aside.) I'll do anything again a man that stands between me and a fortune. (To H.) We ha' begun the dirty work together, Mester Haywood, and we'll end it together.\n\nHAY. (Shakes hands.) Spoken like a man! (Turns and listens.) We must part. I hear footsteps. (Pushes PARS. out 1st L. E.) Conceal yourself! (Lights cigar and goes toward door.) While Parsnips is setting the trap I shall dwell in luxury. [Exit, 2nd R. E.]\n\nEnter HERBERT at gate as HAYWOOD exit into house.\n\nHERB. There goes his lordship, and perhaps Pauline's future husband, for his chances are better than mine. He has her guardian at his side. But Pauline is a brave girl; she will remain true to me. (Drops into bench near S. H.)\n\nEnter HARKING through door of house, looks at HERBERT.\n\nHARK. Oh! You are here! (HERBERT rises and bows.)\n\nHERB. Yes. You know punctuality is one of my good qualities.\nHARK. (Coldly.) Mr. Walston, as my clerk you have always done your duty. When you came to me for employment I gave it to you without any reference as to your character or ability. I always favored you above the other clerks, and I have taken you to my house several times; and now you repay me by taking advantage of my kindness and visiting my ward, Miss Braddon, without my knowledge or consent.\n\nHERB. I knew you would not allow it.\n\nHARK. I am this young lady's guardian. I am responsible for all her acts. I know well how dishonorable your intentions are, so leave this place at once. Never show your face here or at my office again. (Points to gate.) Go!\n\nHERB. (Starts back.) Mr. Harking, you wrong me. My intentions are perfectly honorable. I love Pauline and she loves me. (Pauline at door.)\n\nHARK. Do not talk to me of love. If she loves you it is because you have blinded her with false pretensions of love.\n\nPAUL. (At door.) This cannot be true.\n\nHERB. You are mistaken: my love for her is holy and true and I will not have my honor trampled on like this.\n\nHARK. Honor! A young man who spends his evenings in the gambling den and saloon to speak of honor!\n\nPAULINE comes forward and takes HARKING by the arm.\n\nPAUL. This cannot be true, Mr. Harking, you have been misinformed. (To Herbert.) Speak, Herbert, say it is not true.\n\nHARK. (Takes PAULINE from HERBERT.) Come away from him! (Takes out letter.) It is true. (Enter Haywood at 1st R. E.) Our honor is at stake; hear this letter.\n\nHAY. (Aside.) Ah! Just in time to see the poison taken!\n\nHARK. (Reads.) \"My esteemed friend: As one who takes a great interest in your family, I wish to give you warning against that which may turn out a great scandal in your household if not checked in time. A young man in your employ is paying no little attention to your ward, Miss Braddon, a fact of which I am certain you know nothing and therefore I warn you. If his object were honorable I would not take this liberty, but a person of his character can have no honorable motive. He is known to spend his nights in saloons and gambling dens, and his company is of the worst type. Such a character should not be allowed in the company of your ward. Trusting you will benefit by this warning.—I remain, A true friend.\"\n\nHERB. (Fiercely.) Every word is a wicked lie; you surely do not believe it?\n\nHARK. Yes. I believe every word. It is an honest letter. (Points to gate.) Go!\nPAUL. (To Harking.) Do not be too hasty. Look into the matter first. I am sure it is false.\n\nHERBERT. I will go, Mr. Harking, and you shall never see me again until I can prove that the contents of that letter are abominable lies.\n\nEnter Parsnips through gate. All start back and look at him. Parsnips goes up to Harking.\n\nPARSNIPS. (To Harking.) Please give me a penny or a crust o' bread. (Suddenly sees Herbert and starts back.) What? Herbert Walston! (All look surprised.) Oh, I have found thee at last! (Herbert starts back.)\n\nHARKING. Sir! Who are you?\n\nPARSNIPS. A poor honest man—Curby Winkles be my name—I ha' a lad—an honest lad who never stole a farthing in all his life, but 'e be in prison—sent there for stealing a lot of money, but 'e be innocent. 'E ha' never done it. (Looks fiercely at Herbert.) There stands the man as did it; 'e be a robber, a thief, a gambler!\n\nPAULINE falls into Harking's arms.\n\nPAUL. Oh! My heart!\n\nHERBERT starts back and looks fiercely at Parsnips.\n\nHAY. (With smile.) The poison is swallowed.\n\nAll form tableau.\n\nCURTAIN.\nACT II.\n\nSCENE I.\n\nLibrary in Harking Mansion. Books, table, etc. Easy chair R. of table, etc. Harking in easy chair, reading paper.\n\nHARKING. (Drops paper and puts hand to head.) Yes, in thirty days the news may go from month to month that John Harking, the richest and oldest cotton manufacturer in London, is bankrupt. (Suddenly.) It must be averted; but how? I have used all Pauline's fortune, and have not a pound left. True, this mansion and its parks are mine, but to sell them would mean ruin at once. There's but one way out of it. Pauline must marry Lord Ainsley, and at once. He, surely, with his millions, can help me. He is crazed with her beauty, and, if only encouraged by her, would soon propose. But that miserable scoundrel, Walston—she will persist in believing that he is innocent. If I had means I would give him a good sum to leave the country. (Hears footsteps.) Ah, his lordship! I must appear cheerful.\n\nEnter Haywood, D. C. Harking writing at table.\n\nYou have been enjoying a walk?\n\nHAY. Yes, I have had a very pleasant walk in your beautiful parks—(aside)—planning a way to complete the ruin of Walston.\n\nHARK. (Still writing.) Yes, they are considered the finest in the neighborhood.\n\nHAY. (Aside.) He seems to be in an unusually good mood to-day. I have not yet proposed to the fair angel, for prudence whispers, first consult her guardian.\n\nHARK. (Rising.) You will excuse me, Lord Ainsley, for a short time; business calls me.\n\nHAY. (Detaining him.) Pardon me for detaining you, Mr. Harking, but will you allow me to trespass on your valuable time for a few minutes?\n\nHARK. (Returning.) Oh, certainly. I'll give you half an hour if you wish.\n\nHAY. Thanks. The subject will not take that long, but it is of a very tender nature.\n\nHARK. (Aside.) I have an idea what it is. (Aloud.) Proceed.\n\nHAY. It concerns your ward. (HARK. smiles.) I love her—nay, adore her—\n\nHARK. (Aside.) Just what I expected.\nHay. —and with your permission would make her my happy wife.\n\nHark. (Affected.) This is rather unexpected.\n\nHay. Do not, I pray you, refuse me.\n\nHark. (After hesitation.) Well, as her guardian, I give you my consent. (Shakes hands.) I am sure you will make a good, kind husband. Go and tell Pauline that you have my consent and blessing.\n\nHay. Ah, there's where the difficulty comes in—I have consulted you first.\n\nHark. You were very thoughtful. Now, do not let your bashfulness get the better of you.\n\nHay. (Sally.) I will not; but—but I am afraid she does not love me. I must leave soon for my estates, and to go without Pauline would kill me.\n\nHark. Don't lose heart. \"Faint heart never won fair lady.\" Perhaps she loves you more than she cares to show. It is hard to read these women.\n\nHay. True, but if a lady loves one above all others she cannot help showing it, though she may try to conceal it.\n\nHark. But Pauline's nature is different. You must try to win her love. I will do all in my power to help you.\n\nHay. Thanks; I shall try; but I would never marry her if she did not love me, for my one great pleasure would be to make her happy.\n\nHark (Aside.) To-night Pauline consents to become his wife. She must, or I lose all and become a beggar. (To Hay.) Well, I must be off; meanwhile, do you press the suit.\n\nHay. I will. (H. exit, D.C., smiling.) Ha, ha, ha! Everything is in my favor but the fair angel herself. She believes nothing against that Walston, but she shall; by heavens, she shall. If we could only get the fellow into prison, that would finish all. (Muses, and suddenly.) I have it! But I must see Parsnips—he is the tool for this work. Yes, if nothing else will do, my prison plan shall have the effect. (Leans back and smiles.)\n\nEnter Parsnips, D. C., looks about, taps Haywood on shoulder. The latter starts.\n\nHay. The devil! What do you mean by coming in here! Do you know the consequences of our being seen together?\n\nPars. Do ya think I be fool nough to come in here if I thought we would be caught?\n\nHay. You risk too much. Did the bar-room brawl succeed?\n\nPars. It did. And here's a paper wi' the whole thing in it.\n\nHay. (Smiles.) Superb. (Takes paper.)\nPars. I tells you, govner, it worked like a charm. I went to Skittle's saloon, took two or three of ma friends long, got full o' rum and porter, raised the wind wi' everything, got run in the coupe, was charged this morning afore the magistrate, giv' my name as 'Erbert Walston, paid ma fine and 'ere I be. (Haywood reading paper.) What do ya think of t, Mester Haywood?\n\nHay. Just the thing, but I am afraid this may not have much effect on the fair angel either. I shall not trouble her till I know she has given up all thoughts of this fellow. This is a big job and needs caution—£200,000 is not so easily secured—I have a plan which if carried out would send him to prison, perhaps for life.\n\nPars. Prison! Mester Haywood. The game's gotten dangerous. The next thing praps'll be murder.\n\nHay. Calm yourself. It is not dangerous, but requires caution.\n\nPars. Everything needs caution; but what's your plan now?\n\nHay. (Whispers.) What does caught in the act of firing a building mean?\n\nPars. Ah! that be a matter o' twenty years in prison.\n\nHay. Well, listen attentively. You must fire the factory and Walston must be caught in the building.\n\nPars. But sposin, Mester Haywood, they catch I instead o' im!\n\nHay. If you carry out my instructions you will not be caught.\n\nPars. Well, go on wi' your plans.\n\nHay. I have written a letter supposed to come from Curby Winkles—youself—to warn Mr. Harking that his factory is to be fired by Walston at eight o'clock to-night. Of course he will at once secure a detective to catch him in the act.\n\nPars. But how'll ya get young Walston there?\n\nHay. Easily. I have also written a letter, supposed to come from Pauline, with a request to meet her in the office of the factory at eight o'clock sharp.\n\nPars. Ha! that be a mighty good plan if it works.\n\nHay. He will come, of course; be caught; and once in prison Pauline's fortune is mine. (Takes key from pocket.) Here's a key that will open the office door; be sure to leave it open; and remember it must be done to-night.\n\nHay. Aye! A mighty shaky job, but I'll do it. (Rises.)\n\nHay. You must fire the building a few minutes before and take care to conceal yourself.\n\nPars. That I will, and remember the ten thousand pounds, Mester Haywood. (Starts L.)\nHAY. I will keep my word. (Parsnips nods and exits; Haywood sits down and reads paper.) He'll do it. Ten thousand pounds is too great a temptation for him to refuse.\n\nEnter HELEN quickly, 1st R. E., looking around.\n\nHEL. (Excited.) Oh, where can Pauline be? I've a note for her, from Mr. Walston, and I cannot find her. (Sees Haywood. Aside.) Oh, that horrid man here! (Goes to 1st L. E.)\n\nHAY. (Aside.) Ah! Pauline's companion. I must try to gain her friendship; she may be of service to me. (Aloud.) Ahem! Excuse me, Miss Armsby, did you wish to speak with me? (HELEN turns and looks scornfully at him.)\n\nHEL. No, indeed! I am looking for Pauline.\n\nHAY. Oh, well, you will find her in the park with Ophelia. (HELEN starts to go.) One moment, Helen. (HELEN turns.) Why do you always treat me so snappishly? Have I done anything to offend you?\n\nHEL. No, (biting teeth) but I don't like you, so there.\n\n[Exit hurriedly.]\n\nHAY. (Looking after her.) Indeed! Don't like me; well I guess that settles it. Nothing to be gained from her. (Sits down again to read paper.) Ha, ha! I did not think Parsnips would work the \"bar-room brawl\" so well.\n\nEnter PAULINE and OPHELIA, D. C., followed by HELEN.\n\nOPH. (Looks round, then to PAULINE.) My brother is not here. (Sees Haywood) Oh, good afternoon Lord Ainsley. (Haywood rises and bows; PAULINE same business.) We just stepped in to see if Mr. Harking were here. (OPHELIA goes to him.)\n\nHAY. Indeed! He left but a few minutes ago. (HELEN drags PAULINE aside and whispers.)\n\nHEL. Take this quick; it's from Mr. Walston. (PAULINE takes it quickly. Haywood and OPHELIA business of speaking together.)\n\nPAUL. A note from Herbert. (Tears open quickly and reads aside.) \"My own Pauline:—I must leave this country to seek my fortune elsewhere. I sail for America to-morrow. Remain true to me; we shall meet again. Good-bye.—Yours only, Herbert.\"\n\nPAULINE puts note in bosom.\n\nPAUL. To America! Oh, we may never see each other again.\n\nHands to her heart. HELEN consoles her.\n\nOPH. Oh, no, Lord Ainsley, nothing but the fashion columns are of interest to the ladies.\n\nHAY. Indeed! (Aside.) I shall read the account of the \"bar-room brawl\" to them and note the effect on Pauline. (Aloud.) But I think\nthere is something in this paper that will interest both you and Miss Pauline. (Looks slyly at Pauline.)\n\nOph. Interest us both! (Pauline turns to listen.) I do not understand.\n\nHay. (Opens paper.) Listen, I will read it to you. (Pauline and Helen come closer.) (Reads.) \"Last evening Skittle's saloon was the scene of a great commotion. Some half-dozen young men, in a boisterous state of intoxication, behaved in a most disgraceful manner. Among them was a young man, wild with liquor, who, after breaking furniture and severely wounding two young men, made an assault upon the bar tender, which might have ended fatally had not the police been called in time.\"\n\nOph. Oh, horrible! Pray do not read any more.\n\nHay. Please permit me to finish. (Ophelia nods assent.) \"They experienced no little difficulty in taking the young man to the nearest station. This morning they were arraigned before the magistrate. All were fined ten shillings or fourteen days in gaol, while the most dangerous one, who gave his name as Herbert Walston—\n\nPauline starts.\n\nPaul. Herbert in a bar-room brawl! This is terrible. (Covers face with hands.)\n\nOph. Gracious, Herbert Walston, who was once a respectable clerk in my brother's office! He has fallen very low indeed.\n\nHay. (Glancing at Pauline.) Shall I proceed?\n\nOph. Yes, you may.\n\nPaul. (Rises suddenly.) No, not another word till I have left the room. (Goes D. C. followed by Helen.) (Aside.) He has become reckless because everything is against him. [Exeunt.\n\nOph. You must excuse Pauline, Lord Ainsley, her nerves are too weak to stand such a shocking story.\n\nHay. (Rises.) Oh, I am, indeed, sorry for having read it in her presence.\n\nOph. But you may finish it now.\n\nHay. (Lays paper on table.) Oh, it merely mentions that he was fined five pounds or thirty days. (Takes Oph.'s arm, and they go toward D. C. slowly.)\n\nOph. Only thirty days?\n\nHay. He paid his fine and was allowed to go.\n\nOph. He should have been sent to jail.\n\nHay. Indeed, madam, he should. [Exeunt.\n\nEnter Harking, D. C., throws hat on table, sinks into chair with a sigh.\nHARK. Everything is at its worst. I must hasten this marriage. It is the only hope I have of saving my factory. (Rings bell.)\n\nEnter ADAM JONES, 2nd R. E., and stands in C.\n\nA. J. Hi'm 'ere.\n\nHARK. Has the mail arrived yet? Oh, yes. (Looks on table.) Here it is. You may go. (Exit JONES, 2nd R.E.) If Pauline realizes my distress she will not hesitate. (Opens several letters.) Bill for silks and laces, £900, for Miss Ophelia. (Shakes head.) Extravagance. (Opens another.)\n\nStage darkens. Enter A. J., 2nd R. E., with lamps. Places them on table, then exit, same E.\n\nIf Lord Ainsley hears of my misfortune all will be lost. (Looks at another letter.) Such vile writing! (Reads.) \"Mester Harkin: Your factory is goin' to be put on fire to-night at eight o'clock.\" (Speaks excitedly.) What is this? (Serves lamp higher.) \"Your factory is going to be put on fire to-night at eight o'clock by the young man as is called Walston. Watch for 'im. I'll spot 'im if I can. CURT WINKLES.\" (Drops letter and rubs eyes.) Is this a terrible dream or a dreadful reality? My factory destroyed by fire!—the only hope I have left, and the insurance policy run out three days ago. (Winks.) My God! It must be averted. (Suddenly.) The villain! He shall have prison for his trouble. (Puts letter in pocket.) I will keep this for evidence against him. We must secure him before he fires the building. Ha, ha! I'll show him how to have revenge—the black-hearted scoundrel.\n\nEnter OPHELIA on Sir Joseph's arm. PAULINE with HAYWOOD, and HELEN, D. C.\n\nSIR J. (Entering.) Oh, we shall have a glorious time—shooting, rowing, driving, bathing— (Sir. HARK.) Oh, good evening, Mr. Harking. (Looks closer.) But you do not smile. Are you not well?\n\nOPH. (To HARK.) What, dear, are you ill?\n\nHARK. No, I am not ill. (Tries to smile.)\n\nOPH. Ah, I see, you have read the dreadful news in the paper.\n\nHARK. No, I have not.\n\nOPH. What! Have you not read how your late clerk, Walston, was arrested in a drunken brawl, was taken before a magistrate, but—(in disgust)—got off with a fine!\n\nHARK. It's just as I expected. But to-morrow will find him in prison.\n\nALL. In prison!\n\nHARK. Yes, in prison. (Takes letter from pocket and gives to OPHELIA.) Read this.\n\nHAY. (Aside.) Ha, ha, ha! Magnificent! Pauline is mine.\nOrn. (Reads.) \"Mester Harkin.\" Gracious, what a lot of gibberish! \"Mester Harkin: Your factory is going to be put on fire tonight at eight o'clock by the young man as is called Walston. Watch for 'im. I'll spot 'im if I can. Curby Winkles.\" (Excited.) You must get the police at once.\n\nPaul. (Aside.) Oh, Herbert, I must now blot you from my heart forever! (Drops into chair and covers face.)\n\nHark. (Puts letter into pocket.) I will engage a detective at once, who will shadow him to the factory and surprise him before he can do any harm. (Puts on hat and goes to D. in C.) Hay. looks at Paul.\n\nHay. But, Mr. Harking, do not be too severe.\n\nHark. (At D. in C.) The scoundrel! He shall be punished to the full extent of the law. [Exit hurriedly. Hay. smiles.]\n\nTABLEAU.\n\nSCENE II.\n\nStreet in London. Lights down. Enter Policeman, R., with big strides, swinging club and looking over a bill he has in his right hand. Stops in C. of stage.\n\nPoliceman. (Reading bill.) \"Five pounds reward. The above reward will be given for any information that will lead to the conviction of the thief or thieves who stole a black satchel, containing valuable articles, from the office of John Hampton.\" (Looks R. and L.) My heyes! If the hindividual who stole that satchel would honly take a walk on my beat, I'd 'ave five pounds to-morrow. (Looking L.) Hey! What's that I see? A boy with a satchel! (Excited.) Hi shouldn't wonder but hit's the thief.\n\n[Exit, L., with big strides, swinging club.\n\nEnter Crumpet, R., black satchel on arm, hands in pockets. General appearance to denote a bum.\n\nCrumpet. Hi—hi'm the honly one that's left hof all the family—yes—the Crumpets—hic—I've a wife an' three children to s-sport, but I tell you they're ruinin' me. (Looks at boots and clothes.) See what they 'ave brot me to—a wanderin' minstrel, a thing hof rags and patches. \"His marriage a failure?\" Well, I guess so. (Strikes attitude.) I, Josephius Crumpet, were once han ornament to society. I got married. (Strikes breast.) Behold the consequence! Yes, my family his too extravagant. They're livin' 'igh—igh—hin the fifth story hof a tenement 'ouse. 'Twere only two weeks ago when I gave ma wife a shillin', an'—an' would you believe it, she's spent hevery farthing of it a-ready. (Walks L. a few steps.) Hi'm afraid I'll 'ave to do what I've been a-thinkin' on—sell ma corpse to a professor hof anatomy. Hit ought to bring in 'alf a crown, an' that would keep ma family in bread for a fortnight an' buy 'alf a pint o' rum. (Looks at satchel.) I wish th' lady as owns this satchel would 'urry an' come for\nit. She said, \"Ere, old man, hold this satchel a few minutes till I return, han' I'll give you a crown.\" (Makes face.) Hi—hi've been holdin' hol it two blessed hours. (Examines satchel.) Now hit it wasn't that the satchel isn't worth 'alf o' that I'd been an' sold hit long ago instead o' waitin' 'ere. (Looks L.) Ah! the bobby as run me in t'other day.\n\nEnter Policeman, with big strides. Stops suddenly, looking at satchel.\n\nPoliceman. My heyes! Hit it isn't the satchel Hi'm after. (Takes CRUMPET by arm.) Ha, ha! I've got you at last, and the second offence.\n\nCrumpet. No, no, I'm not drunk this time. Hi'm as sober as a judge. Hi'm only a-waitin' 'ere.\n\nPol. Waiting, hey? (To Aud.) My heyes! Hit's not every thief 'll wait for a police officer to come along and arrest 'im. (Takes him by coat collar.) You stole that satchel. Come along.\n\nCrum. Hi—hi'm only a-holdin' hol it for a lady as is gone into a store around the corner.\n\nPol. Pretty good excuse, but hit won't work with a police officer. Hi knows you—come along, you're wanted. (Takes CRUMPET by coat collar with one hand and satchel with the other. He finds satchel empty.) Empty, eh? Well, we'll soon find out what you've done with the contents.\n\nCrum. Mr. Officer, hi—hi'm innocent—hi'll pay for the drinks hit you let me go. (Policeman pulls him out, L.) Hi'm the father of one wife and husband hit three chillern. (Exeunt, L.)\n\nEnter Herbert, slowly, eyes sunk-in, wretched appearance, stops in C.\n\nHerb. What have I done to be punished like this? Why am I haunted from morning till night by that tramp Winkles? (Hands head) Oh, miserable wretch that I am! I am driven to desperation. This morning I left my couch with a little hope left in my heart, but on seeing the morning paper I find that, not content with driving me out of employment, I am publicly slandered in the daily press. My God! Why am I cursed like this? Why am I doomed to become such a wreck? (Mysteriously.) Why all this misery, when with one plunge into the river this cursed life is over? Yes, it will come to that. (Takes note from pocket.) But this from Pauline—my angel! (Kisses it.) I had given up all hope of ever seeing her again. What has she to say,—that we must meet in the factory? (Suddenly, dropping note.) Ah! She has seen the papers, and would know the truth. (Softly.) Brave Pauline! She alone trusts me through all my misfortunes; but—but to-night we part, perhaps forever. On the morrow I shall sail for America; take my invention with me, and then, perhaps, win fame and fortune. (Looks L.) It is not far from eight now, and if I fail to appear she may believe all. [Exit, L., quickly.\n\nEnter Parsnips, R.\nPars. (Looking L.) Ah, there he goes; but I'll be there afore him. (Sees note, picks up.) This is mighty lucky. He's lost the note Mester Haywood sent him. (Puts it into pocket.) This is the last job I'll do for Haywood; and as soon as I gets the ten thousand pounds I ha' no more to do wi' him. 'E thinks 'e be mighty sharp, an' 'as a soft 'un in 'I; but 'e'll find out his mistake if he don't come out in the correct funds. 'E is as mean as he be a fine gentleman, and I'll ha' to look out for myself.\n\n[Exit, L. E.]\n\nSCENE III.\n\nThe factory—part interior and exterior—rows of other buildings. A distant chorus is heard as curtain rises. After chorus enter Parsnips at 1st L. E. Looks carefully around; then goes to office and unlocks door; enters; lights a taper and glances around.\n\nPars. (In loud whisper.) It be nigh eight o'clock and Walston will soon be here, but I ha' got the lead o' 'im by three minutes, so I must to work. In thirty minutes this fine building will be ashes an' Mester Walston safe in the cells. Ha, ha! An' 'e be Mester Harking's son! (Fiercely.) Ah, Mester Harking, this is fine pay for the five years I put in prison twenty-five years ago. (Opens door R. of office.) An' now for the deed that punishes both father an' son!\n\n[Exit, R.]\n\nClock strikes eight. At last stroke Parsnips re-appears with taper burning; looks hastily around.\n\nPars. I ha' done it. I ha' done ma blackest deed; but it is ma last 'un. (Listens and looks about; blows out taper suddenly.) Footsteps! (Herbert enters 1st L. E., slowly. Parsnips looks through window of office.) Mester Walston! 'E must not see 'I! (Herbert walks across shop and looks at office.)\n\nHere. Everything looks dark; it has just struck eight. I will try the door. (As he opens the door Parsnips slips behind and slips out as Herbert enters.)\n\nPars. (Outside.) It's in the trap. I hear some one comin'. (Looks 1st L. E.) Harking wi' a detective. (Goes to 2nd L. E.) Hi'm off to gie the halarm of fire.\n\n[Exit 2nd L. E.]\n\nHere. (Looking around; tries door, which opens.) Pauline! Pauline! She's not here yet, but the door was open. Perhaps she has gone to some other room. Why did she choose this place for meeting? Because (sadly) she feared we would be seen together. Well, this is our last meeting. Why I am treated thus I cannot dream, but I will find out some day if I am not driven to suicide before that. (In anguish.) Oh, God! It is hard to bear! Why does she not come? Every minute seems like an hour. What a strange smell—as if rags were burning! It seems to be getting stronger. (Suddenly.) Can it be fire? (Goes to door in R., opens.) The smell is stronger—it comes from this quarter—I will see. (As he disappears Harking and Sharp enter 1st L. E. hastily on tip toes; stop and look at office; then walk over and listen.)\nHARK. (Trying door which opens.) Ah, the door is open! (They enter and look around.) I didn't hear or see anything, yet the door was open.\n\nSHARP. Is this the only part of the factory?\n\nHARK. Certainly not! (Goes to door at back.) Come this way; it leads to all the rooms.\n\nSHARP. Very well, but first (goes to door L.) we must lock this door. (Locks it and takes key.) Then if he is in the building we will cage him.\n\n[Exit door at back.]\n\nDoor in R. suddenly opens and HERBERT rushes in.\n\nHERB. My God! The factory is on fire; and Pauline not here. (Rushes at door and finds it locked; starts back.) Locked! Fool that I was! I see it all now. That note from Pauline was a forgery. (Searches pockets.) I've lost it. (Wildly.) Another plot against me. My God! When will it all end? (Again tries door.) It is locked fast! (Rushes to door at R.; whiff of black smoke enters; closes quickly; then wildly.) Locked in, and the building on fire! I will escape. (Rushes at door; tries hard to open it; enter HARK. and SHARP from door at back; they see HERBERT.)\n\nHARK. Ah, Herbert Walston, you are caught at last! Mr. Sharp, arrest that man. (Mr. H. at door R.; opens it and disappears.)\n\nSHARP. (Advancing with handcuffs towards HERBERT.) You are my prisoner; you cannot escape, for the door's locked. (Puts hand on HERBERT's shoulder. H. pushes him back.)\n\nHERB. Stand back! For what cause am I to be arrested?\n\nSHARP. For attempting to fire this building.\n\nHERB. (Fiercely.) It is a lie! (HARK. rushes in door at R.)\n\nHARK. Too late! Too late! The factory is on fire. (Handcuffs head.)\n\nHERB. Yes, on fire, but not by my hands.\n\nHARK. (Fiercely.) How dare you deny it, you miserable scoundrel, when you are caught in the act? You have done your worst, but you shall suffer for it. (Enter PARSNIPS, L. E., goes to office and says.) There is no escape for you; the prison shall be your home for the next twenty years.\n\nPARS. I ha' given the halarm—the brigade will soon be 'ere. (Be heard in distance) PARS. rattles door.)\n\nHERB. Mr. Harking, I swear I am innocent. Some invisible fiend has done this and lured me into the trap. What for, I do not know. (PARS. bursts through door panting.)\n\nPARS. So—so, ya ha' caught the scoundrel!\n\nHERB. (Starts back.) Curby Winkles again!\nPars. So they ha' caught ya at last, an' now they'll put ya alongside o' ma boy that's servin' for deeds o' youn.\n\nHerb. The man that has slandered me everywhere! You miserable wretch. (Rushes at Pars., but is held by Sharp.) What is your object in bringing me to this? (Harking wildly about; flames creeping up the windows; heavy smoke through the doors; bells ringing and shouts of people.)\n\nPars. Mester detective, do yer duty; put the cuffs o' 'im. The court'll clear it all up. (Cries of fire, shouts, etc.)\n\nHerb. (Sharp advances; H. thrusts him off.) To prison! Never! Stand back and let me speak. For reasons I know not, I am being crushed, driven to ruin. I have been posted as a gambler, drunkard, robber, and what not; and now this plot has been carried out to complete my ruin and send me to prison! (Wildly.) But, rather than that (rushes to door R) I will perish in the flames! (Disappears through smoke and flame; Sharp rushes after him but is driven back by the flames; Harking covers face with hands.\n\nHark. My God! I am a ruined man! (Staggers and falls, but is caught by Sharp, who brings him out to C., followed by Parsnips. Crowd of people—terrible din—firemen putting up ladders and streaming water. Four policemen keep back crowd. Bells, loud noise. Haywood enters through crowd, goes to Harking and friends. No. 1 Fireman brings water to revive Harking.\n\n* Herbert Walston appears at upper window, near 2nd R.E., opens it, then wildly.\n\nHerb. I must escape from this hell without being seen. (Disappears again. Pars. speaks to Fireman No. 1 and points to building. Fireman rushes to door of office and calls.)\n\nFireman No. 1. A man in the burning building! (Fireman No. 2 rushes to door and both disappear through the flames. Crowd hushed. Herbert appears again at first upper window, near 1st R.E. Wild appearance. Coat half burned, flames all round him. Tears window open and makes sudden leap to the ground.)\n\nHerb. (Looking wildly around.) Thank God, no one has seen me escape. To-morrow I sail for America. [Exit quickly, 1st R.E.]\n\nFireman staggers out.\n\nFireman No. 2. He must perish—he cannot be saved!\n\nHay. (Tapping Pars. on shoulder.) Have they captured Walston?\n\nPars. Worse than that. 'E's in the building. (Haywood smiles feebly and looks at the burning building.)\n\nHay. Ah! My plans have turned out even better than I had hoped. Pauline's fortune is mine!\n\nHarking surrounded by crowd, L. of stage. Police and Sharp giving water. Firemen working. Crowd shouting. Police swinging lances, keeping crowd back. Haywood stands near entrance, 1st L.E., smiling. Pars. near him, looking at burning building with frightened face.\n\nTABLEAU—CURTAIN.\nACT III.\n\nTWO YEARS HAVE ELAPSED.\n\nSCENE I.\n\nWell furnished parlor in Harking Mansion. Table at L. of stage. Lounge, easy chair, etc., on R. of stage. HARK. discovered near L. of table.\n\nHARK. The dreaded time has come at last when I must be turned out on the street and become a beggar. But how can I break the news to Pauline and Ophelia? How? My God! I cannot do it. How shall I tell Pauline that I have lost all her fortune? I should have told her two years ago, and not depended on Lord Ainsley, her husband, for assistance. But what can keep him away? He promised to be away no longer than a few weeks, and now it is three months. Oh, if he would only return before the sheriff comes to take possession of my home! (Drop head in despair.)\n\nEnter PAULINE, D. C., comes to R. of table.\n\nPAUL. Mr. Harking, you sent for me. (HARK. nods.) You have bad news to tell me.\n\nHARK. Yes, Pauline, my child, bad news indeed.\n\nPAUL. (Suddenly.) Of my husband?\n\nHARK. No, not of Lord Ainsley.\n\nPAUL. (Goes to HARK. and entreats.) Something terrible is troubling you; tell me all, I can bear it.\n\nHARK. (Suddenly looking up.) Pauline, the sheriff comes today to take possession of this mansion; to turn us out of house and home, (PAUL starts,) and I cannot prevent it.\n\nPAUL. But my fortune; will that not save you?\n\nHARK. Alas! How can I expect your forgiveness? (PAULINE surprised.) I have lost all your fortune in speculations.\n\nPAUL. (After a moment's silence.) Then there is no means of preventing our being turned out in the street.\n\nHARK. (Drops head.) None, except your husband, Lord Ainsley; and I fear he will not return in time.\n\nPAUL. Why did you not ask his assistance before he went away?\nHARK. (In anguish.) Because I dared not tell him I had lost his wife's fortune.\n\nPAUL. (Sally.) This is, indeed, a great misfortune; but you must meet this fate with more fortitude.\n\nHARK. (Looking up.) Ah! Yes, you are right, Pauline. I must try to bear it, though it will shorten my years.\n\nEnter Ophelia with letter, followed by Helen.\n\nOPH. A letter from Lord Ainsley. (HARK. rises quickly.) A letter at last! (Gives to PAULINE.)\n\nPAUL. (Opens letter.) This is the first since he went away. (Reads aloud.) \"My own Dear Wife: Illness prevented me from writing sooner, but do not be alarmed, it was nothing serious. Nearly all my estates are settled. I expect to be back on Xmas eve or the day following.\"\n\nMR HARK. suddenly drops back in chair. PAULINE puts hand to forehead. HELEN goes to her.\n\nOPH. (Astonished, looks first at HARKING, then at PAULINE.) How strangely you act! How can that letter affect you so? What does it mean?\n\nPAUL. (Sally.) It means that if my husband does not return today, this Christmas eve will find us all homeless.\n\nOPH. (Bewildered.) Homeless! Brother, what does this mean?\n\nHARK. I am bankrupt. Everything I once possessed is lost, even Pauline's fortune. Ophelia, the sheriff comes today to take possession of this mansion.\n\nOPH. (Wildly.) The sheriff, to take possession of our home! (Shrieks, drops onto lounge.)\n\nPAUL. Dear aunt, take it more calmly. My husband may yet return in time to prevent all.\n\nHEL. (Goes to HARK.) Dear Mr. Harking, perhaps I could help. I have saved up all my pocket money—(HARK. shakes head)—nearly five hundred pounds.\n\nHARK. (Looking up.) My dear child, you are very kind, but that would never save our home.\n\nHEL. If it is not enough to save our home, it will at least help to afford us shelter for a while. (PAUL takes her hand.)\n\nPAUL. You are indeed a friend. (Kisses her.)\n\n[Oph., HEL. and PAUL rise and go out R. E. Exeunt.]\n\nEnter Adam Jones with card on tray.\n\nJONES. Please, sir, hit's a gentleman as called.\nHARK. (Reading card.) Donald Greenwich, New York City, U.S.A. (To A. J.) Show him in. (Exit A. J., D. C.) Donald Greenwich. He is a stranger to me.\n\nEnter A. J., C., showing in H. Walston disguised with false beard.\n\nHERB. (Advancing to HARK.) Mr. Harking, I presume, of Harking & Co.\n\nHARK. (Rising.) Yes, sir, but I don't remember having met you before.\n\nHERB. No; we have never met before. I am the junior partner in the firm of Salvyn & Co., New York.\n\nHARK. (Surprised.) What! Salvyn & Co., props. of the greatest American cotton plantation?\n\nHERB. Yes. I am spending a few months holidays, and not having any friends in London, and knowing you to be the oldest customer of our firm, I have taken the liberty of calling on you and trespassing on your valuable time.\n\nHARK. (Takes HERBERT's hand.) Mr. Greenwich, you are heartily welcome; make yourself entirely at home.\n\nHERB. Thank you. We Americans know well how to do that.\n\nHARK. (Aside in dismay.) He cannot be my guest. I must tell him how I am situated.\n\nHERB. Cotton has taken a great fall throughout England, I believe. But then I suppose it will not affect you much.\n\nHARK. There you are mistaken. It has been a great blow to me. I might have been able to stand it, but two years ago my factory was burned to the ground. It was fired by a beggarly fellow whom I had dismissed from my employment three months before.\n\nHERB. Is that possible.\n\nHARK. But he received just punishment for the deed, for he perished in the flames of the burning building.\n\nHERB. What! perished in the flames?\n\nHARK. Yes, he was burned so that not even his bones were found.\n\nHERB. (Aside.) Then to all the world I am dead. (To HARK.) Mr. Harking, have you no means of saving your home?\n\nHARK. (In despair.) None, the sheriff comes today to take possession of this property. (HERBERT starts.) My God! What shall I do?\n\nHERB. (Aside.) I have wealth now; I will return good for evil for Pauline's sake.\n\nEnter ADAM JONES, D.C.\n\nADAM J. Please, sir, the sheriff. (HARK. starts.)\nHARK. (Trembling.) Sh-show him into the library. (Exit ADAM J., D. C. HARK. rises.) He has come to take possession.\n\nHERB. (Goes to D. C.) Mr. Harking, stay where you are. I will see the sheriff. Perhaps I can save you. [Exit, D. C.\n\nHARK. (Amazed.) What influence can he have, an utter stranger in London?\n\nEnter OPH., PAUL and HERB., 2nd R. E,\n\nOPH. The sheriff has come. He is in the library now. (Shrinks.)\n\nPAUL. (Goes to HARK.) Why do you not go to him?\n\nHARK. Because another has gone to see him. (Takes PAULINE's hands.) My dear child, I feel that we will be saved. (All astonished.)\n\nPAUL. Saved! By whom?\n\nHARK. By a stranger.\n\nALL. (Surprised!) A stranger!\n\nHARK. Yes, a gentleman from New York. He came but a few minutes before the sheriff arrived, on a friendly visit. He is the junior partner in the firm of Salwyn & Co., proprietors of the great American cotton plantation.\n\nOPH. His name?\n\nHARK. His name is— (HARK. suddenly looks D. C.) Here he comes. (All look D. C. HERB. enters with paper in hand and goes to HARK.)\n\nHERB. (Handing paper.) Mr. Harking, take this. Your home is your own again. HARK. takes paper, bewildered.)\n\nHARK. Mr. Greenwich, what does this mean?\n\nHERB. Oh, simply that I have arranged matters with the sheriff, and you are once more the owner of this mansion.\n\nHARK. But you are a stranger to me, a stranger in London. Why do you perform such an act?\n\nHERB. You are a fellow-being in need of assistance, and I assure you it was a pleasure for me to save you from ruin. (HARK. appears overcome.)\n\nHARK. May heaven bless you for your generous and noble act.\n\nHERB. Mr. Harking, say no more about it. It is only a little American kindness, which is a common occurrence in \"the land of liberty.\" When a man, through misfortune, falls, a hand is always ready to help him. (HARK. overcome.)\n\nOPH. (To PAUL) What an ingenious man!\n\nPAUL. And what a noble country he comes from! (HERB. turns, sees PAUL and starts.)\nHERB. (Aside.) Pauline! How changed she is, how changed!\n\n(HARK. advances to HERB.)\n\nHARK. My noble friend, you have done a most generous deed in saving my home. You have saved my life, and I hope that the day is not far distant when I shall be able to repay you for this kindness.\n\nHERB. I beg of you, do not think of it any longer. (HARK. takes his hand.)\n\nHEL. (Aside.) He is no stranger. I have heard that voice before.\n\nHARK. (Suddenly, looking to the ladies.) Pardon my oversight. (To OPH.) Ophelia, this is Mr. Greenwich, of New York. (OPH. bows.) (To PAUL.) Lady Ainsley. (HERB. starts, bows, showing great emotion.) (To HEL.) And Miss Helen Arnasby.\n\nHERB. (Aside.) Pauline the wife of another!\n\nHARK. (To HERB.) It was Lord Ainsley on whom I was depending for help. He went away several months ago to settle his estates in Ireland, and, not having written all this time, you see it placed me in a very critical position, but you shall be doubly repaid when he returns.\n\nHERB. (Makes gesture. Aside.) Lord Ainsley away, and not here to save their home? There must be something wrong.\n\nOPH. (Comes forward and takes HERB.'s hand.) Kind sir, we can never sufficiently thank you for saving our home. Indeed, we can never forget it. You must be our guest while you remain in London.\n\nHERB. Thank you. I feel highly honored.\n\nHARK. Honored! My dear sir, it is we who feel honored and proud to have so noble a personage in our midst.\n\nSHARP suddenly appears, D. C., stops and looks at HERB. Their eyes meet. Chord.\n\nHERB. (Aside.) Sharp, the detective!\n\nSHARP. Excuse me for coming upon you so abruptly. I have a fashion of coming in without ceremony.\n\nHARK. You detectives are privileged, therefore you are quite excusable.\n\nSHARP. (Aside, looking slyly at HERB.) That face is familiar to me. I have seen him before. (To HARK.) I hope I have not interrupted you, Mr. Harking.\n\nHARK. Oh, no. I have just received a visitor from America. (To HERB.) Mr. Greenwich, allow me to introduce Mr. Sharp, the cleverest detective in London.\n\nSHARP. (To HARK.) Thanks. (To HERBERT.) I beg your pardon but what is the name?\nHERB. (Gives card.) Donald Greenwich, New York City. I am spending a few months holidays, and am at present the guest of Mr. Harking, an old customer of our firm.\n\nHARK. Yes, for a great many years.\n\nSHARP. (Aside.) That face! I would give much to see it without that beard. (To HARK.) Mr. Harking, I wish to ask you a few questions. A most daring robbery was committed last night at Dalton & Co.'s. The night clerk was struck senseless, and sixty thousand (£60,000) pounds taken from the safe. This morning the clerk had recovered consciousness but could not tell who struck him. He states that he saw a suspicious looking character walk past the office two or three times that evening, but did not suspect anything. He described him as clearly as he could, and from the description, I am positive it is a person I have seen before, and you have also seen him.\n\nHARK. Indeed! I shall be glad to assist you in capturing the scoundrel.\n\nSHARP. Well, the person to whom I refer is the one who two years ago warned you of the burning of your factory.\n\nHARK. Curly Winkles? I have not heard anything of him since.\n\nSHARP. He is a character I could not easily forget. I am positive if I find that man, I shall have no difficulty in clearing all. I am sure he had a hand in the robbery.\n\nHARK. I will do all I can for you. Such a criminal deserves to suffer the full penalty of the law.\n\nSHARP. Yes, and he shall as soon as I can lay my hands on him. I was in hopes that you could give me some information of his whereabouts. (He goes to D.C.) As you cannot I shall no longer trespass on your valuable time. (Aside looking at HERB.) But that face! Donald Greenwich, New York City, I shall watch his movements. (As he goes out Sir Joseph enters and runs against him.) Oh, you needn't apologize, old man.\n\n[Exit SHARP.]\n\nSIR JOS. (Looking after SHARP through eyeglass.) Well, I should sigh. Hem! old man eh? Not by a jug full. (Sees ladies.) Ah, the ladies. (Shakes hands, etc.)\n\nHERB. (Aside.) Thank heaven, he did not recognize me!\n\nOPH. (Brings SIR JOS. to HERB.) Mr. Greenwich, allow me to introduce you to an old friend of our family, Sir Joseph Fitzarmburgh. (Both shake.)\n\nSIR JOS. Delighted I'm sure. What part of the world do you come from? (Still holding H's. hand.)\n\nHERB. From New York City. (SIR JOS. suddenly drops his hand and steps back several paces looking horrified.)\n\nOPH. Why, Sir Joseph! What's the matter?\nSir Jos. He's an American! Pardon me, Mr. Green Switch, but I don't care to come in contact with a Yankee.\n\nHerb. How is that?\n\nSir J. Why, I've been told that every ninety-nine out of a hundred Yankees are cowboys, sharpers and absconding bank-cashiers. (A laugh.)\n\nHerb. Well, I'm not one of the ninety-nine, I belong to the hundredth.\n\nHark. (Advancing.) Yes, Mr. Greenwich belongs to a firm in America that I have been doing business with for a great many years.\n\nSir Jos. (Taking Herb's hand again.) And you are an honest Yankee? (H. nods.) Well, I should think. (Looks comically at him.)\n\nOph. (To Herb.) You must view our beautiful park, Mr. Greenwich. We have the prettiest in London. (Herb takes her arm. They go towards D.C., followed by Paul with Hark and Hel. with Sir J.)\n\nSir J. (Aside to Hark.) Herb! Mr. Harking, is your Yankee friend going to stay very long in London?\n\nHark. A few months. Why do you ask?\n\nSir J. (Sadly.) Miss Ophelia has taken quite a shine to him.\n\n[All laugh and exit, D.C.]\n\nHaywood. (Appears R. of D.C. and looks in.) No one here? Well, this is a devilish warm reception for a man that has been away from his wife over three months. (Smiles slyly.) Wife! Ha, ha! That title will do till I have entire possession of her property. (Lays hat and coat on chair and takes seat. Lights cigarette and takes a few puffs.) That was the neatest robbery I ever accomplished. It took me a long time to study it out, but now I can take it easy, for there is not the slightest clew for any detective to work on. (Puffs again and puts satchel on table.) Sixty thousand in hard cash! I never had such a snap before. Now that I have lots of dust to show, it will not be hard to amalgamate her fortune with mine, and once in my possession—adieu, dear Pauline, adieu, wild London, for then I shall sail at once for America, the land of the free, where I can lead an honest life and not be molested by detectives. (Looks around.) My next act must be to get rid of Parsnips. He'll never get ten thousand pounds from me; yet when he's shut up I'll feel safer.\n\nParsnips appears, D.C. Looks right and left. Business of seeing Haywood, etc. Goes to Hay. and taps him on shoulder. Hay. starts.\n\nPars. Ah! I've found thee at last, Mester Haywood. (Looks angrily at him.)\n\nHay. Parsnips! What do you mean by coming in here? I gave you credit for more sense, but I see you are a fool.\n\nPars. Yes, I be a fool for waiting so long for ma money. But ha' a care, I waits no longer.\nHAY. I've told you the reason a dozen times.\n\nPARS. Na dust! (Shakes fist in HAY.'s face.) Mester Haywood, ya canna banter I wi' such garbush. See 'ere, ma foine gentleman, I wants ma money reat away. Give I the ten thousand pounds thee has promised, and I go ma way and say no more about it.\n\nHAY. Now, Parsnips, be reasonable. I am willing to give you that amount, and perhaps more, as soon as I can get Miss Pauline's property. At present I could not scrape together more than a few thousand, but if you will take that, and say no more about it, you shall have it.\n\nPARS. No! (With face close to HAY.'s) Ten thousand pounds, and not a ha'penny less! Do ya understand, Mester Haywood?\n\nHAY. But what can I do when I haven't got it?\n\nPARS. Ya lie! Ya have got it, and more too.\n\nHAY. (Aside.) Ah, he has heard of the robbery and suspects me. (To PARS.) Well, since you know better, pray tell me where it is.\n\nPARS. Mester Haywood, thee canna put a scum over ma eyes. Remember, ya were seen committin' that robbery last night.\n\nHAY. (Jumps fiercely.) What do you mean?\n\nPARS. (Fiercely.) I mean that thee has sixty thousand pounds in hard cash, the result o' last night's work—(sees satchel and snatches it)—an' 'ere it be.\n\nHAY. (Makes a rush at him, grabs satchel, wrenches it from him and puts it on table again.) Fool! (Looks up and down at PARS., who glares fiercely.) Would you trifle with me? (With a sneer.) So you have been watching my movements.\n\nPARS. Yes, an' why? Because ya keep out o' ma way to beat I out of ma money. But, Mester Haywood, I wants ten thousand pounds before this day be over, do ya understand?\n\nHAY. I did not intend to beat you out of your money, I was only trying to lower the amount. But since you know all, I suppose I must give you the full amount.\n\nPARS. (With a hiss.) Yes, every penny on't, Mester Haywood.\n\nHAY. (Looking around.) I cannot give you the money here, because we may be interrupted at any moment. I will meet you to-night, after dark, some place where no one will see us; we must be cautious. Where shall it be?\n\nPARS. It be small matter to I where it be so long as thee be square to a penny with the money.\n\nHAY. Well, meet me at our old rendezvous, Connell's slip; it is the safest place after dark. Be there at eight sharp and I will have the money. Now, away, before you are seen. (PARS. goes C.)\nPARKS. Aye, Mester Haywood, at eight sharp, and you be there wi' the money.\n\nHAY. Thank heaven, he's gone! Ten thousand pounds, indeed! He shall not have it, and yet if I do not give it, he will inform upon me. I would like to rid myself of that fellow forever. (Suddenly.) I see him at Connell's slip, the old dock, to-night—no person near but ourselves—a good chance to get rid of him. (Takes out revolver, holds it and shakes his head.) No, that would make too much noise and attract attention. (Puts it back; then suddenly.) Ah! my loaded stick, the instrument that did last night's work so well, and makes no noise. I will get him near the edge of the dock, one stroke of the stick, and throw him senseless into the river—no noise—only a little splash and all is over. (HERBERT enters D.C.; stops; looks at Haywood and seems surprised.) Yes, to-night I will do it, \"darkness covers crime.\" (HERBERT horrified steps behind screen.) To send him to the bottom of the river means safety for me; therefore, as I value my life, I will do it. (Rises.) Tomorrow I shall be free of that fool, and ten thousand pounds more in my pocket. Ha! Ha! (Looks around.) No one here yet?\n\n[Exit C., with satchel in hand.]\n\nHERBERT comes from behind the screen and goes C. looking after Haywood.\n\nHERB. What a mysterious fellow that! What does he mean by \"darkness covers crime?\" That is Pauline's husband—the man she must love, honor and obey. He looks like a villain. I fear Pauline has done much worse than if she had married the poor office clerk. (With feeling.) I am sure she cannot be happy. (Sits by table.) Perhaps I misjudge him; he may be honorable—but those words \"darkness covers crime\"—would an honorable man mutter such words? No. He is contemplating some horrible crime. (Suddenly.) He is Pauline's husband, I will watch his movements and perhaps avert some dreadful crime. I will follow him to-night. Though Pauline belongs to another I will still protect her, for my love is as strong as ever. A little jealousy may be at the bottom of it; yet, if he be an honorable man, I shall be content.\n\nEnter HELEN, D.C.\n\nHEL. Excuse me Mr. Greenwich, but I should like a few minutes conversation with you.\n\nHERB. Indeed! Well, I am at your service.\n\nHEL. Have you ever been in England before? (Herb. starts. Helen looks at him closely.)\n\nHERB. (Aside.) Can she penetrate my disguise? (Aloud.) Why do you ask?\n\nHEL. Because your voice seems quite familiar to me though I cannot recognize your features.\n\nHERB. (Aside.) Helen was always a friend to me. I will disclose myself to her. (Aloud.) Yes, I have been in England before, and the\nname I bear is only an assumed one. Miss Armsby, we are old friends.\n\n(HEL. surprised.)\n\nHEL. But your right name?\n\nHERB. (Pulling off beard.) Herbert Walston.\n\nHEL. (Starts.) What I suspected. But it was supposed you had perished in the burning factory.\n\nHERB. That is because I escaped without being seen. But Pauline—is she happy?\n\nHEL. Far from it.\n\nHERB. Not happy, and the wife of Lord Ainsley?\n\nHEL. But she does not love him.\n\nHERB. Why, then, did she marry him?\n\nHEL. Because she thought you were dead. Lord Ainsley made advances to her; Mr. Harking got into financial difficulties, and to save him she married Lord Ainsley. Mr. Walston, do not reproach her.\n\nHERB. Reproach her? Never! (Softly.) Brave Pauline! She married a man she did not love to save her guardian from ruin.\n\nHEL. But, Mr. Walston, had she known that you were living she would never have married Lord Ainsley.\n\nHERB. I believe you, Helen. But why was her husband not here to save Mr. Harking's home?\n\nHEL. He went away three months ago to settle his Irish estates. Mr. Harking could never take courage to ask his assistance. The thing kept going on till finally his property was confiscated while Lord Ainsley was abroad. Pauline received her first letter from him, since his absence, to-day, in which he says he will return this evening or tomorrow.\n\nHERB. Well, he has returned.\n\nHEL. Returned!\n\nHERB. Yes, he left this room but a short time ago.\n\nHEL. Did he speak to you?\n\nHERB. No, I was concealed behind that screen.\n\nHEL. Concealed!\n\nHERB. Yes. As I entered that door—(pointing D. C)—he was standing, seemingly in deep meditation, for he did not notice me. He muttered something that startled me so I slipped behind the screen; but I heard no more.\n\nHEL. And the words he muttered?\nHERB. Were, \"Darkness covers crime.\"\n\nHEL. \"Darkness covers crime\"?\n\nHERB. Yes, those are the very words. (With caution.) Helen, I believe Lord Ainsley is a scoundrel.\n\nHEL. That is what I have always thought, but how will you find it out?\n\nHERB. To-night I will follow him and— (Suddenly hearing a noise) Some one is coming. Not a word!\n\nEnter HARKING, D.C. See HERB. and HEL.\n\nHARK. Ah! Helen is trying to entertain you.\n\nHEL. Yes, Mr. Harking, I think Americans are so easy to entertain, too.\n\nHERB. At least, Miss Armsby has a very agreeable way of entertaining a person.\n\nHARK. Do you think so? (Looks D.C.) Ah, I see Ophelia and Pauline are returning, and—as I live, Lord Ainsley is with them.\n\nEnter OPHELIA, SIR JOSEPH, HAYWOOD, and PAULINE on HAY's arm.\n\nPAUL. See, Mr. Harking, my husband has returned.\n\nHARK. (Takes his hand.) Rejoiced to see you back again. Is all your business settled?\n\nHAY. Not quite all. (HERB. eyes HAY. closely.)\n\nOPH. And must you leave us again?\n\nHAY. I must, but only for a short time. (To PAUL.) And when I return I shall live with my little wife forever. (PAUL. smiles.)\n\nHERB. (Aside.) I can see the villain in his every movement.\n\nHARK. (To HERB.) Mr. Greenwich, allow me to introduce you to Lord Ainsley. (HAY. advances.) (To HAY.) This is Mr. Donald Greenwich, of New York.\n\nHAY. (Takes HERB.'s hand.) Pleased to meet you. (Aside with fright.) Where have I seen that fellow before.\n\nHERB. (To HAY.) Have you ever been in America?\n\nHAY. No, I have not. Did you have a pleasant passage across the Atlantic?\n\nHERB. Yes, very, considering the time of the year.\n\nHARK. (To HAY.) Have you heard of the great robbery that was committed last night?\n\nHAY. Great robbery! No, I have not. Where did it take place?\n\nHARK. At Dalton & Co.'s. The night clerk was struck senseless and sixty thousand pounds taken from the safe.\nHAY. Indeed! It's terrible that such a thing should occur right in the heart of the city when there are so many policemen and detectives. Well, I hope the parties concerned will soon be brought to justice.\n\nHARK. Yes, they are on the track of the right man. (HAY. starts.) Mr. Sharp was in this morning for some information from me. He has a description from the injured clerk, and believes it to be that of the man who warned me of the burning of my factory—Curby Winkles.\n\nHAY. (Aside.) What Parsnips? By heaven! if he is caught all will be lost.\n\nSIR JOS. (To Oph.) Well I should sigh! \"Crime increases and still the world turns round.\"\n\nHERB. (Aside.) If that man, Curby Winkles, is caught I will thank God on my bended knees.\n\nCHANGE OF SCENE.\n\nSCENE II.\n\nStreet in London. Lights down. Enter CRUMPET, R., staggering heavily.\n\nCRUMPET. (Trying to walk straight.) Sta-sta-steady, Crumpet—sta-steady—hic—now don't an' against—hic—against that lady. Sta-sta-steady, old boy—hic—steady. (He falls against scenery. Business of getting up and bowing.) Beg pardon, mum—hic—beg pardon. Hit's hawful—hic—hawful slippery, mum. (Tries to walk on again.) Sta-steady, Crumpet—hic—yo—you'll soon be near a—hic—a lamp post. (Tries to sing.)\n\nEnter POLICEMAN, L. Sees CRUMPET, stops, and turns dark lantern on his face.\n\nPOLICEMAN. My heyes! Crumpet drunk again, an' only hout o' jail t'other day. (Looks carefully at CRUMPET again with dark lantern.) Hi wonder if 'e's drunk enough to take away without henny violence. (Same business with lantern.) Hi'll watch 'im a while.\n\nCRUM. (Trying to balance and looking at dark lantern.) Sta-sta-steady—hic—steady, Crumpet. We—we're—hic—we're near a lamp—hic—lamp post. (He staggers up to POLICEMAN, leans against him as if he were a lamp post.)\n\nPOL. My heyes! Did you never see the brass! (CRUM takes out of his pocket an old clay pipe with half stem, puts into his mouth upside down, then fumbles for matches. He tries to light match against his pants, but fails, then suddenly rubs match against POLICEMAN's leg, who, with a howl of pain, steps away. CRUM rolls over on his back.) 'E takes me for a lamp post!\n\nCRUM. (Making great spirits to rise and yelling.) P-o-l-i-e-e! P-o-l-i-e-e! (Runs into POLICEMAN's arms.)\nPol. (Takes him by shoulder.) 'Ere, what's the matter?\n\nCrum. (Sputtering wildly about.) Hi—hi—hic—hi 'ave heave na neck. Hi wants ten thousand pounds damage. Hi—hi'm goin'—goin' to sue the corporation. Hiif a peaceful an' sober—hic—an' honorable citizen can't—hic—can't walk the—the public thoroughfare without—hic—without 'avin' an old lamp post—hic—lamp post a-chin on 'is neck— (Gives sudden jump and yell.) Hill—hic—hill see the whole government. Where's—hic—where's a bobby—con—connect me wr' a bobby.\n\nPol. (To Awt.) 'E's blind drunk. (Take Crum by collar of coat and spins him around)\n\nCrum. (Throwing arms wildly.) Le—lego o' ma coat! P-o-l-i-c-e! P-o-l-i-c-e!!\n\nPol. (Goes L., pulling Crum by collar with his heels dragging on the ground.) My heyes! This is child's work. (Exit L., dragging Crum out with one hand like a mail bag and swinging club with the other.)\n\nEnter Parsnips, R.\n\nPars. If Mester Haywood don't come out wi' the ten thousand pounds, then the law shall 'ave 'im, an' if 'e means violence (displays revolver) h'm prepared for 'm.\n\n(Exit L.)\n\nEnter Hay, R., hurriedly, looking nervous, stops.\n\nHay. What makes me so nervous to-night? I imagine everybody is watching me. Pshaw! Absurd fancies. If it is my first murder it never will be found out. (Looks at watch.) It is but a few minutes to the time when I must strike that fool out of existence. (Goes L.) Ha! Ha! He shall spend his Xmas (points down) down below.\n\n(Exit L.)\n\nEnter Herbert R., looking L., stops at C.\n\nHerb. Ah, there he goes. How nervous he looks. I must not get too close or he may see me. Whatever his object may be, I shall soon find out, (goes L.) and, if it is crime, I shall avert it for Pauline's sake.\n\n(Exit L.)\n\nEnter Sharp R.; quickly walks near L. E.; then stops.\n\nSharp. I must keep my eye on that fellow, Donald Greenwich. New York City. Ha! Ha! It's no more Donald Greenwich than my name is—(Give any local name.) But, I'll know who he is before morning or retire from the profession.\n\n(Exit L.)\n\nCHANGE OF SCENE.\nSCENE III.\n\nThe river Thames; an old wharf with a deserted looking wooden shed on R.; stage dark. London seen across the river, illuminated in the distance. As scene changes, several male voices heard singing in chorus. Parsnips enters with caution and listens to the singing as it dies away in the distance.\n\nPars. Ah! only the navy lads goin' to their lodgin's—they be appy light-earted lads. (Peering around.) 'E be not 'ere yet. (Looking down river; then suddenly.) Well, as soon as I gets the ten thousand pounds I'll turn honest man, ha' na more to do wi' such light-liver'd folk as Mester Haywood. (Enter Hay. L. with caution. Pars. sees him.) Ah! there 'e be now. (Pars. goes to end of wharf near river and sits on cathead.)\n\nHay. (Peering around.) Ah! I see you are here.\n\nPars. Yes, I be, and we're all alone, Mester Haywood.\n\nHay. Indeed! I'm pleased to see that you had sense enough to come alone.\n\nParsnips rises from post and advances.\n\nPars. Then let us ta work, Mester Haywood.\n\nHay. (Aside.) He must not suspect my intentions. (Aloud.) Parsnips, you have always been a good and faithful servant of mine, you have always carried out my plans as I wished, but you have overstepped the mark by watching my movements last night. Parsnips, you have run yourself into a trap and I must help you out of it.\n\nPars. (Surprised.) What do you mean?\n\nHay. (Quickly.) I mean that the detectives are after you; they have searched your lodgings, and are looking for you everywhere. To come to the point, you are suspected of having committed that robbery last night. That's what you get for your sneaking.\n\nPars. (Enraged.) Suspect I, eh? That don't make I the robber, Mester Haywood.\n\nHay. Certainly not. Therefore, you will let them capture you, and turn Queen's evidence, eh?\n\nPars. Give I the money, Mester Haywood, an' I'll go away to America or any other country where no English law can get I.\n\nHay. You cannot leave London without being seen, they are looking for you in every corner.\n\nPars. (Extending hand.) Give I the ten thousand pounds, Mester Haywood, an' I'll show thee.\n\nHay. (Aside with nervousness.) I am wasting time and words. (Aloud.) You cannot escape them.\nPars. (Firing up.) They'll take ma dead body first, I'll not split on thee.\n\nHay. Yes, that's what you say now, but you will change your mind when once in their hands.\n\nPars. (Aside.) 'E be meddlin' wi' I. (To Hay.) Mester Haywood, hev' ya got the money for I? (Hay. hesitates.) Hev' ya?\n\nHay. (Aside.) Now is the time (To Pars.) No! (Pars. staggers back.) I came here to warn you of your danger.\n\nPars. (In a fury.) Danger? There be no danger for I, it be only as need fear danger. An' after all your promises, after polin' in this place to gie I the money, ya dare come wi' out it? Mester Haywood, ya ha' no thoughts o' givin' I the money.\n\nHay. (Suddenly with fire.) No! I do not intend to give you a farthing of it.\n\nThey both near the edge of the wharf.\n\nPars. (Enraged.) Ya mean it, Mester Haywood? Ya be a villain and a coward.\n\nHay. (Coolly.) Granted. And what are you?\n\nPars. A fool to be led by the nose by a mean cowardly scoundrel. (Shakes fist in Hay.'s face.) Why did ya bring I here?\n\nHay. (Slips heavy stick from sleeve and holds it behind his back. Both near the edge of the wharf.) To defend society against robbers, thieves, etc. Ha, ha! To save you the disgrace of a life's imprisonment.\n\nPars. (Fiercely.) What? Ya ha' come to murder I? (Draws revolver and points at Hay.) Never! (Hay. suddenly raises stick and strikes revolver into the river. Pars. bounds forward, dropping his hat, while Hay. knocks him on the head.)\n\nHay. Take that, you fool! (Pars. raises hand to head and falls backward. Hay. gives him a heavy push, which sends him rolling into the river. With a splash he disappears.) Down! Down! Down to the bottom, out of my sight, out of my way forever! (Suddenly looks up.) He is gone, and I am safe once more. (Listens, then hastily.) Someone is coming, I must escape.\n\n(Exit, R.)\n\nEnter Herb. quickly, L., looks around, goes over to the wharf and picks up Pars.'s hat. Starts surprised.\n\nHerb. (Excited.) Some one's hat! I am too late. (Looks around.) I saw him standing here, looking into the river. (Looks into water.) What is that? It looks like a man's head. (Suddenly.) Perhaps he has murdered some one and thrown the body into the river. (Stops and looks more closely, then leaps up and pulls off coat and hat.) It is a man's head. If there is any life in him I will save him. (Plunges in.)\n\nEnter Sharp suddenly, L., rushes to edge of wharf.\nSHARP. Hello! What are you doing there?\n\nHERE. (Coming towards wharf with PARS.) A man in the river! Quick! Help me out! There may be life in him yet. (SHARP drags PARS. out, then helps HERE. out. They lay PARS. on wharf. SHARP starts as he recognizes HERE.)\n\nSHARP. Mr. Greenwich, what brought you to this out-of-the-way place?\n\nHERE. (Points to PARS.) To save this man's life. (Stoops down and feels PARS.'s heart.) His heart beats. Come, we must save him.\n\nSHARP. (Goes to PARS. and lights dark lantern.) Who is it? (Looking closely.) His face is covered with blood; he has been struck. Do you know him?\n\nHERE. (Looks close, then starts up in surprise.) N-no, I do not. (SHARP takes out kerchief and wipes off blood. HERE. turns to audience and speaks low and wildly.) My God! The man that ruined me, the man that wrecked my honor! Would to heaven I had left him to his doom.\n\nSHARP. (Suddenly jumping up.) Ah! Curby Winkles, as I live!\n\nHERE. (Aside, with passion.) My prayers have been answered; his life is in my hands. The world thinks me dead, but to-morrow I shall rise from my grave to establish my innocence and honor.\n\nCURTAIN.\nACT IV.\n\nSCENE I.\n\nDrawing-room in Haversham Mansion. Table L. and R. of stage, with chair on each side. Decanter of wine on R. table. Enter Joves, D. C., stands stiffly in center of room.\n\nADAM J. Hi'm here, sir. (Silence.) Did you ring, sir? (Says business.) Hi am here, sir. Looks around.) No one 'ere? Hill swear hi'ard the bell. Looks at table and sniffs lips.) Wine! Well, now, that's real nice. Looks around, then goes to table smiling.) Hit's master's best. I wonder what it smells like. (Pulls out stopper and sniffs.) Hem! Smells real good. Hi don't think there's heavy arm in tasting hit. Hi—hill just take a little swig. (Takes deep draught, then sniffs.) Tastes better'n hit smells; wisht hi knew where master keeps it. Takes another, looks at bottle.) Oh, Lord! Hi've drunk most all of it. Hem! E'll never miss hit heavy ow. (Commences drinking again.) Sir J. heard laughing outside. Adam set down decanter a moment. Oh, Lord! Sir Joseph a-comin' (staggered)—and that damned stuff gone to my head. Ei—ef he sees hi'll tell master, sure, unless I'll hide. (Crawls under table on R., head protruding.) Hi'll stay 'ere till 'e goes hout again.\n\nEnter Sir J., D. C.\n\nSIR J. (Rubbing his hands.) Well, I should sigh! This is the oldest Christmas day I have experienced in the last sixty—forty years. Who would think I was only forty? Do you know, some women are wonderful at guessing ages. Now it was only the other day that I asked Ophelia to guess my age, and she guessed it within a year—thirty-nine. (Looks at decanter and sniffs.) Hem! That looks nice.\n\nADAM J. Oh, Lord! That's just what hi said. Hi hopes 'e didn't hear me.\n\nSIR J. (Lifts up bottle and looks at it.) Ho, ho! Champagne! Of course Ophelia put it there for me. What an angel she is!\n\nADAM J. What a angel she is!\n\nSIR J. (Pours wine into glass.) Well, here goes to Sir Joseph. May you live long in prosperity, and die an old man.\n\nADAM J. Han ole game cock.\n\nSIR J. (Looks around.) I thought I heard some one say, \"An old game cock.\" (Pours out more wine.) Not bad stuff for a Christmas day.\nADAM J. Danged good stuff.\n\nSIR J. (Looks around.) The same voice again. (Pours out remainder of wine. Bells ring violently.)\n\nADAM J. Oh, my! There's the bell, an' if hi don't answer hi'll get my discharge. (Bell rings again.)\n\nSIR J. (Annoyed.) Gracious! What's the matter with the bell? (Takes up goblet smiling. Bell rings again more violently.) \"Last but not least\"—here's to Ophelia.\n\nADAM J. And 'ere's to the door. (While SIR J. drinks A. J. runs with table on his back to R. of D. C.; then crawls from under and leaves it standing and exits hurriedly.)\n\nSIR J. (Tries to set goblet on table but lets it fall on floor and falls over it. Jumps to sitting position and looks for table.) Great spirits! What's become of the table. (Sees it at D. C.) There it is. Well, I should sigh! How did it get there? I swear it stood here. I believe I am drunk. That's powerful stuff. Well, here's a pretty mess; here I am beastly drunk and expect Ophelia in every moment. Guess I'll go away till I'm sober. (Staggers to D. C. and meets OPH.: both start.)\n\nOPH. Good mor— Why, what does this mean, Sir Joseph? The table near the door. (Looks at decanter.) Mercy, he has emptied the bottle of champagne!\n\nSIR J. (Excited.) Miss Harking—Ophelia—I, I don't know what to say. I believe your house is haunted. I never moved that table. (Moves away from it.)\n\nOPH. Oh, Sir Joseph! You are not afraid of spirits, are you?\n\nSIR J. Ah! a-some spirits are very strong, especially the spirits in that wine. Do take me away from here. I—I assure you I did not move that table.\n\nOPH. (Ashamed.) Oh, dear! He has drunk too much of that wine, and it has gone to his head. My brother must not see him this way. (To SIR J.) Come, dear, come with me; strong coffee will rectify your brain. (SIR J. goes, still looking frightened at table.)\n\nSIR J. Th that table has legs. [Exeunt, D.C.\n\nEnter Haywood with greatcoat and furs. Takes them off.\n\nHAY. Hem! No one about? (Looks at watch.) Eleven o'clock. I wonder if her ladyship is up and about yet. For work like this discretion is necessary. I must be careful how I work it.\n\nEnter Helen, D.C., book in hand.\n\nOH! Good morning. (HEL stops.) Where is Pauline?\n\nHEL. (Coldly.) In her room. (Turns to D.C.)\n\nHAY. Please tell her I wish to see her a few minutes. (Exit HEL, D.C.) To gain my point I must soften her heart a little. I learned\nlong ago that she doesn't harbor the least spark of love for me. But I don't want her love. No, it's her money I want.\n\nEnter Pauline, D.C., slowly. Hay advances.\n\nMy darling, you don't look well this morning. Are you ill?\n\nPaul. Oh, no! But I had a terrible dream last night. I cannot bear to think of it.\n\nHay. Is that all, my dear? You do not believe in dreams?\n\nPaul. Oh, no! but this was so terrible.\n\nHay. If it will relieve your mind, relate it to me.\n\nPaul. I am sure it will annoy you.\n\nHay. I think I can stand it.\n\nPaul. It is now two years since Herbert Walston perished in the flames of Mr. Harking's factory.\n\nHay. But what has Herbert Walston to do with your dream?\n\nPaul. It was a clear moonlight night. I was out for a little stroll; I wandered to the ruins of the factory and stood where the office had been. Suddenly I heard a familiar voice. (Covers face.) I can hear it now.\n\nHay. You must remember it was only a dream; but what did the voice say?\n\nPaul. The voice said: \"Pauline, I was innocent. I had a terrible death, but I was innocent.\" I looked and there stood the haggard form of Herbert Walston. Oh, that face, the pleading look, I shall never forget it!\n\nHay. Is that all he said?\n\nPaul. No, he again said: \"He is the fault of my horrible death and he will suffer ten thousand deaths.\"\n\nHay. (Frowning.) Who was the fault of his death?\n\nPaul. It is only a dream, but I cannot tell you.\n\nHay. Come, a dream can do no harm.\n\nPaul. He said: \"Your husband, Lord Ainsley.\" (Hay covers face.) Of course, it was only a dream, but it terrified me so.\n\nHay. Of course it would. (Aside.) Confound it; I'm sorry I listened to that dream. It'll haunt me the rest of my days. (Aside.) Come, my dear, throw off the thoughts of that vision, and think that this is Christmas day, the day that all should be happy.\n\nPaul. I will try.\n\nHay. Now that's sensible, I must leave you again, but for a short time only.\nPaul. What! so soon again?\n\nHay. Yes, I have a few more estates to dispose of. When all is settled I shall return and remain forever with my little wife. (Kisses her.) In the meantime, do throw off all thought of Herbert Walston. You have often heard of what a bad character he was, besides he is dead now and all your mourning will not resurrect him.\n\nPaul. I will try. I know it is foolish to think so much about one that is dead.\n\nHay. Sensibly spoken. As for your dream, it was certainly a very nasty one, but don't think of it any longer. (Kisses her.)\n\nPaul. (Aside.) How he loves me! And I—shall I ever learn to love him? (Drops head.)\n\nHay. Come, let me see you smile before I go. (She tries to smile.) (Aside.) What a cold smile! (Aloud.) Pauline, you have lived a long time with Mr. Harking.\n\nPaul. Yes, my father and mother died while I was quite young, and Mr. Harking was appointed my guardian.\n\nHay. Well, you were more fortunate than I, for when my father died I was left sole guardian of myself, with several millions of property to take care of.\n\nPaul. You were very fortunate, I should think.\n\nHay. Oh, no. The property became a great burden to me, so I determined to sell it as I live in London. Now the only burden your guardian had was yourself.\n\nPaul. (Aside.) Must I tell him that my guardian lost it all in speculation? No, I cannot. (Aloud.) Mr. Harking sold the property long ago. The money was less trouble to manage than the property.\n\nEnter Harking, D.C.\n\nHay. Indeed! That was very wise of him.\n\nHark. Wise of whom?\n\nHay. Oh, Pauline was just telling me how wise you were in turning her property into cash.\n\nHark. Yes, I did so that she might draw interest instead of rent. But I will now take the opportunity of telling you what I should have told you long ago. I came into financial difficulties and lost all her fortune.\n\nPaul. That was, of course, before we were married. (Hay, greatly astonished.)\n\nHark. But (takes her hand) she has forgiven me, and I hope some day to make returns.\n\nEnter Hel., Oph. and Sir J. Hark. and Paul. go to them.\nHAY. (Aside.) The devil! There's some mistake. Heavens! Can it be that I have been fooling around here the last two years and married a woman that isn't worth a sixpence? No, I'll not be fooled this way. Mr. Harking's safe is in the library. At midnight I will go there, and if there is money in it I will have it. It's my only chance. (HAY. goes to group.)\n\nSIR J. (Shaking HAY.'s hand.) A merry Christmas! Do you know I can not make these ladies believe that this house is haunted, but mark my words, it won't be long before you'll see some one's spirit.\n\nHAY. (Laughs.) I'm afraid other spirits have taken possession of you. (To all.) I must leave you for a short time, but I will see you all after lunch.\n\nHEL. (Aside.) He must be detained. (Whispers to PAULINE.) Pauline, do not let him go. (PAUL. surprised, then to HAY.)\n\nPAUL. You must remain for lunch.\n\nHAY. I have an appointment that I cannot break.\n\nEnter HERB., D. C.; looks at HAY.\n\nHEL. Thank heaven, just in time.\n\nHERB. Good morning: merry Christmas to all. (HAY. moves D. C.) Lord Ainsley, you are not going out?\n\nHAY. But I must.\n\nPAUL. Yes, do remain, it is my wish. I hope that as your wife I can have a little influence.\n\nHERB. (Aside.) His wife! how those words pierce my heart. She will soon know all.\n\nHAY. (To PAUL.) My dear, \"business before pleasure,\" you know. (He moves to D. C. HERB. blocks passage.)\n\nHERB. You shall not go.\n\nHAY. Mr. Greenwich, a joke is very well in its place, but I hope you will let me pass.\n\nHERB. No, you shall remain in this room.\n\nPAUL. (Coming forward.) Perhaps, Mr. Greenwich, it is very important business, and demands his instant attention. Do not joke.\n\nHERB. Excuse me, but this is no joke. I will not allow him to leave the room.\n\nHAY. Are you mad? If you do not let me pass at once I shall have to force you in presence of the ladies.\n\nOPH. (To SIR J.) Oh, dear! Do you think they will quarrel?\n\nSIR J. (Frightened.) I—I hope not.\n\nHAY. (Aside.) I cannot imagine what the fellow means.\nSir J. (To Oph.) Perhaps they have been drinking some of that powerful champagne.\n\nHark. Mr. Greenwich, you look serious. I thought you were joking. What do you mean?\n\nHere. I mean to denounce Lord Ainsley.\n\nAll. Denounce Lord Ainsley!\n\nHere. He is not Lord Ainsley, and does not own property in Ireland. He is a black-hearted villain—a noted counterfeiter, a bank robber, a housebreaker, a forger, and (looks at Paul.) a bigamist. (Paul overcome, supported by Here.)\n\nHay. (Looking at Here coolly.) Well, you are, indeed, highly complimentary. Have you any more to say? Ladies and gentlemen, as American, as he claims to be, has evidently mistaken me for some criminal. To Here.) Mr. Greenwich, I assure you, you have made a great mistake.\n\nHark. Yes. I'm afraid you have. Lord Ainsley is well known.\n\nHere. No, there is no mistake. He has deceived you all. Mr. Harking, that man is none other than Jas. Haywood, the noted counterfeiter, who has filled the law for the last fifteen years. (All start.)\n\nHay. This is too much. (Rushes at Here.)\n\nHere. Stand back. (Points revolver.) Knowing I had a desperate character to deal with I came prepared.\n\nPaul. Oh, Helen! I fear this is all true. (Leans her head on Helen's shoulder.)\n\nHil. Yes, Patline, it is too true. You have been deceived. You have been outraged. Come away from his presence, you look ill.\n\nHay. (To go to 2nd R. E.) I always thought Lord Ainsley was a wicked man.\n\n(Exeunt Here and Paul.)\n\nHay. This is false and you shall answer for it. (Makes another attempt to go out.)\n\nHere. Not yet. (Stops him.) Mr. Harking, this is the man that ruined Herbert Walston's character; that planned the burning of your story; that married your ward to secure her fortune, while he had, still has, a wife living in Manchester; the man that robbed the firm of Dalton & Co., and murdered Parsnips, better known as Curby Snakes, whose body was found in the river near Connell's slip. (All surprised.)\n\nHay. (Aside.) Tracked, by heavens! (Aloud.) Who are you that accuse me of all these crimes?\n\nHere. One that has been wronged beyond all forgiveness; one whose life you wrecked, and who has been dead to the world, but (pulls head) is now resurrected. (All start. Hay hides face.) to prove his innocence and establish his honor. (Sir Jos. gets behind Oph., who runs; both tremble as if terrified.)\nHAY. Herbert Walston alive?\n\nHERB. Yes, will you now confess?\n\nHARK. (Astonished.) Herbert Walston and not Donald Macintosh?\n\nHERB. Yes, Herbert Walston. I did not perish in the flames of your factory, but escaped without being discovered; sailed for America; and there, by means of my invention, amassed a large fortune; and now I have returned, after two long years, only to find my beloved Pauline the wife of another—the wife of that miserable scoundrel.\n\nHAY. (Aside.) He has no proof that I murdered Parsnips. I can save myself yet. (Aloud.) If Parsnips is dead, where is your proof that I committed these crimes? Beware, Walston, how you trifle with me.\n\nHERB. All the proof I want is here. (Pars, suddenly appears at D.C. HAY. starts.)\n\nPARS. (To HAY.) What! Ain't ya glad to see I?\n\nHAY. I'm lost! The dead have risen to convict me.\n\nPARS. Yes, Mester Haywood, ya thought ye had finished wid me when ya flung I in the river. But I was saved, not to be a tool o' yours again, but to 'elp convict ya. (Sir J. and Oph. business off.)\n\nHAY. (Aside.) I must escape. (Aloud.) Curses on you all! I will not go to prison. (Rushes at HERB., who points revolver.)\n\nHERB. An inch further, and you are a dead man.\n\nHAY. (Puts hands behind his back and looks coolly at muzzle of revolver.) So you would shoot me if I moved an inch further?\n\nHERB. Yes, one inch. (HAY. suddenly matches revolver from HERB., who blocks the way.)\n\nHAY. Now, Walston, the tables are turned. Let me pass, or I'll blow your brains out.\n\nHERB. (With fire.) You'll step over my dead body first. (HAY. raises revolver. OPH. screams.)\n\nHAY. Then so be it. (Cocks revolver, but curtains are suddenly parted and SHARP knocks revolver from HAY.'s hand and puts his hand on HAY.'s shoulder.)\n\nSHARP. (Smiling.) Ah! James Haywood, caught at last. You are my prisoner. (Presents handcuffs.)\n\nHAY. What's this?\n\nSHARP. A Christmas box. (Puts cuffs on HAY.)\n\nHARK. Mr. Sharp, is all this true that this man has been accused of?\n\nSHARP. Yes, quite true.\nHARK. And his marriage with my ward is null and void?\n\nSHARP. Yes, James Haywood has a wife, still living, in Manchester.\n\nHARK. My God! What disgrace I have brought upon Pauline!\n\nSIR J. (Exultingly.) M-Mr. Sharp, the quicker that monster is taken from the house, the better.\n\nHERB. He will get prison for life; but it is a pity he cannot be hanged.\n\nHAY. Well, that is where we two differ, Mr. Walston. (SHARP takes HAY. to D. C.: HAY. stops and turns.)\n\nSHARP. Why do you stop?\n\nHAY. Permit me to say a few parting words.\n\nHERB. Let him speak. We shall never see him again.\n\nHAY. Don't say \"never.\" While there is life there is hope. Herbert Walston, I am a desperate man. I do not intend to remain in prison long, and when I leave its walls both you and Parsnips shall hear from me. By heavens, you shall. [SHARP leads him out, D.C.]\n\nHARK. Once imprisoned, he will not escape so easily as he thinks. (Goes to HERB.) Mr. Walston, I can never expect your forgiveness for all I have made you suffer. But, God knows, I was trying to do my best for my ward. And you, whom I treated so shamefully, have come to save me from destruction, to save my ward from the clutches of a scoundrel, and I can do nothing in return.\n\nHERB. Yes, you can.\n\nHARK. Then it shall be done.\n\nHERB. Place Pauline in my arms again.\n\nHARK. (Takes his hand.) She is yours. (Goes to 2nd R. E.) I will bring her. Your return will make her happy again. [Exit.]\n\nSIR J. (To OPH.) There, Miss Ophelia, (points to HERB.) I said we should soon see some one's spirit appear. (OPH. laughs.)\n\nHERB. (Goes to OPH. and SIR J.) A very lively spirit. (Shakes both their hands.) But I know you are all glad to see me back again.\n\nOPH. Indeed, Mr. Walston, we are all greatly indebted to you for all you have done, and you richly deserve Pauline for your wife.\n\nRe-enter HARK., 2nd R. E., leading PAUL., followed by HEL.\n\nHARK. My dear child, I have wronged you terribly, but forgive me when I return to you Herbert Walston, who saved my home and brought that scoundrel to justice.\n\nPAUL. What, Herbert? No, he is dead. I could not expect so great a joy.\n\nHERB. turns and she sees his face.\nWhat! Herbert alive? My own dear Herbert returned to me.\n\nThey rush into each other's arms.\n\nHERB. Yes, your own dear Herbert returned to life again. I have established my innocence to the world, and now it remains for you alone to believe me guiltless.\n\nPAUL. I never believed you guilty; and had I known you were living, I would never have consented to marry that monster. (They embrace.)\n\nPARSNIPS step forward.\n\nPARS. Mester Harking, I ha' still a confession t' make. One of great importance.\n\nHARK. Of great importance?\n\nPARS. Yes. Thirty-two years ago three burglars broke into the office of a certain cotton merchant to rob 'is safe. The night clerk an two bobbies takes 'em prisoners. They got five years' penal servitude. (HARK much interested.) But one of the three swore vengeance on the night clerk, and when he was released he kept 'is word.\n\nHARK. (Wildly.) By robbing him of his only son! That clerk was myself and that robber—\n\nPARS. War I. Yes, I stole your son to 'ave revenge on—\n\nHARK. Man, do you expect forgiveness for this confession wi' all these years I have led such an unhappy life? No, not till he is in my arms can I forgive you.\n\nPARS. You shall 'ave 'im, for there 'e stan's. (Points to HERB.) Herbert Walston be your own son. (Sensation. OPH. falls into Sir Jos.'s arms. PAUL surprised. HARK looks closely at HERB. They rush and embrace him.)\n\nHARK. Yes, yes, you are indeed my boy—my son! At last I am happy. Come, Pauline, my dear, to think that I find my long-lost son in your own lover. You shall be married at once.\n\nOPH. (Rushes at HARK.) My dear nephew—embraces him—we have found you at last.\n\nSIR J. (Watches OPH.) Well, I should sigh: Why did that nephew return? Here I've just made a contract with her, and she goes hugging him instead of me. (Goes to OPH. They go R. together.)\n\nHEL. (Goes to PAUL and kisses her.) You should, indeed, be happy now.\n\nPAUL. Yes, Helen dear, supremely happy.\n\nHERB. Mr. Harking my father? This is too much like a dream. I can hardly realize it.\nHERB. (Addressing Pars.) You have returned me my son; you are forgiven. Go out into the world; dismiss crime, and become an honest citizen. (Pars. goes to D.C.)\n\nHERB. Stop, my son! You shall not go empty-handed. (Takes out money.) Here is one hundred pounds. Be careful how you use it.\n\nPARS. One hundred pounds? Master Walston, I ha' been too bad. Ya ha' saved my life, ya ha' saved me from prison. Take it back. (Hands back money.) I cannot take it.\n\nHERB. You will need it all. Without you I could never have proven my innocence, so I give you a start again. Leave London, with all its horrors. Leave England. Go to America. Begin a new life, and remember, all you have done against me is forgiven.\n\nPARS. I will go to America; and when we meets again ya'll see another man.\n\n[Exit, C.]\n\nSIR J. (Choking, embraced with Oph.) Mr. Harking, I—I have long admired your charming sister, Ophelia, and—and—\n\nOPH. I have long admired Sir Joseph.\n\nSIR J. (Smiling.) So, you see, practically speaking, we have at last decided to be each other's—ahem.\n\nHARK. So you have taken advantage of this happy moment? Well, if you can make Ophelia happy the rest of her life—(joins hands)—take her, she is yours. (Oph. and Sir J. embrace.)\n\nPAUL. (To HARK.) I am so happy. This is Christmas as it ever should be.\n\nHERB. (Kisses him.) Yes, a Christmas long to be remembered.\n\nHARK. (Taking Herb. and Paul. by hands.) My dear children, I have caused you both to suffer, but it was owing to my blindness. May God spare me many years to see you living happily together.\n\nCURTAIN.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_24665.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 57, "total-input-tokens": 85880, "total-output-tokens": 31042, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1539, 3], [1539, 4075, 4], [4075, 4075, 5], [4075, 4187, 6], [4187, 4187, 7], [4187, 5722, 8], [5722, 7609, 9], [7609, 9885, 10], [9885, 12264, 11], [12264, 14342, 12], [14342, 16826, 13], [16826, 19305, 14], [19305, 21571, 15], [21571, 23648, 16], [23648, 25652, 17], [25652, 28082, 18], [28082, 29148, 19], [29148, 31078, 20], [31078, 33267, 21], [33267, 35512, 22], [35512, 37743, 23], [37743, 39827, 24], [39827, 42105, 25], [42105, 44692, 26], [44692, 47358, 27], [47358, 50168, 28], [50168, 52439, 29], [52439, 55118, 30], [55118, 56812, 31], [56812, 58799, 32], [58799, 60816, 33], [60816, 62766, 34], [62766, 64881, 35], [64881, 67302, 36], [67302, 69792, 37], [69792, 72146, 38], [72146, 74774, 39], [74774, 76543, 40], [76543, 78400, 41], [78400, 80653, 42], [80653, 82679, 43], [82679, 84861, 44], [84861, 87246, 45], [87246, 88386, 46], [88386, 90458, 47], [90458, 92820, 48], [92820, 94745, 49], [94745, 96821, 50], [96821, 98822, 51], [98822, 101170, 52], [101170, 103184, 53], [103184, 105333, 54], [105333, 107352, 55], [107352, 108912, 56], [108912, 108912, 57]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]