[{"id": "5e991a8fa79e877e05d91919fa69e4d3114d0fa2", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\n☐ Couverture de couleur\n\n☐ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\n☐ Encre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☑ Tight binding may cause shadows or distortion along interior margin/\n☐ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☐ Additional comments:/\n☐ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n| 1 | 2 | 3 |\n|---|---|---|\n|   |   |   |\n\n| 1 | 2 | 3 |\n|---|---|---|\n| 4 | 5 | 6 |\n\nL'exemplaire filmé fut reproduit grâce à la générosité de:\n\nUniversity of Saskatchewan\nSaskatoon\n\nLes images suivantes ont été reproduites avec le plus grand soin, compte tenu de la condition et de la netteté de l'exemplaire filmé, et en conformité avec les conditions du contrat de filmage.\n\nLes exemplaires originaux dont la couverture en papier est imprimée sont filmés en commençant par le premier plat et en terminant soit par la dernière page qui comporte une empreinte d'impression ou d'illustration, soit par le second plat, selon le cas. Tous les autres exemplaires originaux sont filmés en commençant par la première page qui comporte une empreinte d'impression ou d'illustration et en terminant par la dernière page qui comporte une telle empreinte.\n\nUn des symboles suivants apparaîtra sur la dernière image de chaque microfiche, selon le cas: le symbole —► signifie \"À SUIVRE\", le symbole V signifie \"FIN\".\n\nLes cartes, planches, tableaux, etc., peuvent être filmés à des taux de réduction différents. Lorsque le document est trop grand pour être reproduit en un seul cliché, il est filmé à partir de l'angle supérieur gauche, de gauche à droite, et de haut en bas, en prenant le nombre d'images nécessaire. Les diagrammes suivants illustrent la méthode.\nCONTRÉ-POISON\n\nLA CONFEDERATION\n\nC'EST LE SALUT DU BAS-CANADA\n\nIl faut se Défier des Ennemis de la Confédération\n\nMONTREAL\nTYPOGRAPHIE D'EUSEBE SENÉCAL,\nRue St. Vincent, No. 6, 8 et 10.\n\n1867\nPREFACE.\n\nDepuis le 1er juillet (1867) le Bas-Canada est régi par un nouveau mode de gouvernement. Il n'est plus le Bas-Canada, mais la \"Province de Québec;\" avec ce vieux nom français qui nous a été rendu, on nous a donné un Gouverneur français et toutes les âmes vraiment patriotiques ont tressailli d'allégresse et d'un noble orgueil, lorsque les journaux nous ont appris, que le canon de la vieille citadelle de Québec avait tonné sa grande voix pour saluer l'arrivée du premier gouverneur français depuis 1760!!!\n\nOn nous a séparés du Haut-Canada, nous nous appelons la Province de Québec, nous avons un gouverneur Canadien-français, le deuxième depuis l'établissement du pays, nous allons avoir notre propre gouvernement et nos propres chambres, où tout se fera par et pour les Canadiens-français, et en français. Il faut être renégat, ou, ce qui revient au même, annexioniste, pour ne pas se trouver ému jusqu'au larmes, pour ne pas sentir son cœur battre d'une joie indescriptible et d'une bien légitime fierté à la pensée de ces glorieux résultats du patriotisme et de l'énergie indomptable de nos hommes d'état, de nos chefs politiques qui, cent ans après la conquête du pays par l'Angleterre, ont décidé cette dernière, touchée de notre héroïsme et de notre loyauté, à nous rendre à nous mêmes, à nous restituer notre autonomie complète et à confier le dépôt sacré de nos traditions nationales à un gouvernement choisi parmi nous et composé des nôtres.\n\nÀ qui devons-nous ces immenses bienfaits? à qui la nation canadienne française reconnaissante doit-elle élever dans son cœur un monument d'éternelle gratitude? C'est ce que nous allons examiner dans les quelques notes qui suivent. Nous avons cru qu'à la veille des élections un petit travail démontrant succinctement\nl'excellence de la confédération, le caractère de ceux qui la soutiennent et la tendance et les principes ou plutôt l'absence de principes de ceux qui la combattent, serait utile au pays et notamment aux Canadiens-français pour les guider dans le choix de leurs représentants et leur faire connaître leurs véritables amis comme leurs véritables ennemis.\n\nNous le ferons sans parti pris comme sans passion. Etranger aux partis du jour, retiré de la vie publique depuis bien des années, ayant toujours suivi de près la marche des événements, nous nous croyons en état,—appuyé que nous sommes sur la boussole infaillible des grands principes religieux et sociaux qui seuls peuvent faire vivre les peuples et les conduire à l'immortalité,—d'apprécier et juger sainement les choses, comme nous pensons avoir acquis le droit de dire franchement et impartiallement la vérité à tout le monde.\n\nNous promettons la vérité et l'impartialité, et nous tiendrons notre parole ; mais cela ne veut pas dire que nous serons froid et indifférent. Nous avons au milieu de nous des lâches, des hypocrites, des traîtres, qui font bien tout leur possible pour cacher l'oreille de l'âne et endormir la surveillance des vrais patriotes. Quelquefois pourtant, ils s'échappent et percent, comme dans le guet-apens du Club St. Jean-Baptiste. Ma foi ! si nous les rencontrons, nous ne pouvons nous engager à rester maîtres de nous et, si nous avons une cravache à la main, elle pourrait bien aller malgré nous labourer leur figure flétrie et déjà entamée par le crime.\n\nAlphonse B.\n\nMontréal, 25 juillet 1867.\nCONTRE-POISON\n\nLA CONFEDERATION\n\nC'EST LE SALUT DU BAS-CANADA\n\nIL FAUT SE DEFIER DES ENNEMIS DE LA CONFEDERATION.\n\nLA CONFÉDÉRATION ÉTAIT-ELLE DEVENUE NÉCESSAIRE?\n\nGesta Dei per Francos.\n\nC'est la Foi qui a fondé le Canada, et c'est elle qui le maintient et fera sa gloire. \"Noblesse oblige\" est un proverbe aussi vrai pour les peuples que pour les individus. Les pieux fondateurs du pays n'ont pas, comme les étrangers qui vinrent après, été amenés ici par l'espoir du gain, du lucre et de la spéculation. Gagner des âmes à Dieu, conquérir un nouvel empire au Christ, tel était leur désir, telle était leur mission. Un roi très-chrétien, comme nous l'a encore prouvé la si belle histoire de l'abbé Faillon, s'associa à ces sublimes éclats du zèle catholique, et cette heureuse association de l'autorité royale avec les efforts du missionnaire ont établi et colonisé la Nouvelle-France, d'où rayonna, plus tard, le mouvement religieux qui fit sentir son influence bienfaisante jusqu'aux coins les plus reculés de l'Amérique.\n\nCes débuts, bénis de Dieu, ne se démentirent pas. La Nouvelle-France fut toujours un peuple de braves, de martyrs et de héros. Et lorsque, après un siècle et demi de luttes gigantesques avec les barbares, les colonies anglaises et l'Angleterre, le peuple de la Nouvelle-France, abandonné de la mère-patrie, épuisé d'efforts, d'hommes et de ressources, fut obligé de se rendre au vain-\nqueur, il avait déjà assez excité l'estime et l'admiration de ce dernier pour en obtenir la garantie du libre exercice de sa Foi, de ses institutions, ses lois et us et coutumes : c'était presque tomber en triomphateur.\n\nLa Providence protégeait visiblement ce petit peuple et avait les yeux fixés sur lui. L'Angleterre fit tout ce qu'elle put, de temps à autre, pour nous arracher notre langue et notre religion. Vains efforts ! Un événement imprévu, une guerre, un changement de gouverneur, une intervention épiscopale arrivait toujours à propos pour déjouer l'astuce et la perfidie à la veille de réussir.\n\nFatigués de nous voir grandir en dépit de toutes les entraves jetées sur notre voie, quelques ennemis profitèrent de nos troubles de 1837-1838 pour nous imposer, en 1840, l'Union des Canadas. C'était le coup de mort de notre nationalité, criaient ceux qui ne voient dans l'histoire que le jeu du hasard. On sait comment ils ont eu raison. En 1760, nous étions 60,000 habitants ; en 1861, nous avions atteint le chiffre de neuf cent mille âmes !!! Il faut compter avec un peuple aussi nombreux, et déjà depuis 1842 ou 1843, nos hommes d'état canadiens-français s'étaient emparés du pouvoir et l'avaient administré à notre avantage, et nous sommes devenus nombreux, puissants, riches et maîtres de nos destinées.\n\nUn peuple qui a fait, en aussi peu de temps, d'aussi grandes choses, a une mission spéciale et est certainement destiné à l'immortalité. Nous sommes tenus d'honorer ce glorieux passé par notre conduite future. Ce n'est pas là le langage d'un visionnaire, d'un utopiste. Nous ne sommes pas le premier à regarder ce noyau de Canadiens-français, qui s'est si prodigieusement conservé et développé depuis 1760, comme l'avant-garde, le boulevard, le plus sûr soldat de la civilisation chrétienne sur ce continent, menacé de dissolution par les mille sectes protestantes qui tendent à se perdre dans un indifférentisme et un rationalisme désastreux. Et il y a du miracle dans notre conservation ; tous les coups que l'on a voulu nous porter ont été mystérieusement détournés de nos têtes pour se changer quelquefois en moyens de salut pour nous.\n\nCes quelques réflexions, d'ailleurs, inspirées par la situation, nous ont semblé naturelles et nécessaires pour mieux comprendre le rôle que nous avons à jouer sous le nouveau système. Elles seront surtout propres à rassurer les timides que la moindre lutte effraye. En voyant ce que nos pères ont fait dans un passé si difficile, nous serons forcément amenés à la conclusion que sous la confédération, qui nous est si avantageuse, nous n'aurons, pour continuer leur sublime mission, qu'à le vouloir, qu'à nous entendre, qu'à imiter leur énergique persévérance.\nEt, d’abord, la confédération était-elle devenue nécessaire en 1864 ? Nous répondons, sans hésiter : oui. Un changement constitutionnel était devenu absolument nécessaire, et nous devons ajouter que, de tous les changements imaginés par nos hommes publics, la confédération était le seul qui fût propre à sauvegarder nos droits, notre nationalité et notre religion. Les uns disent : ce sont les grits du Haut-Canada qui, par leurs fanatiques exigences, ont rendu la confédération nécessaire ; d’autres disent encore : ce sont les rouges et les annexionnistes du Bas-Canada qui ont rendu la confédération nécessaire en attisant et soutenant le fanatisme haut-canadien, par l’appui capable et lâche qu’ils n’ont cessé de lui prêter depuis 1849. Il y a du vrai dans ces deux accusations. Une des principales causes qui ont nécessité un changement est évidemment le fanatisme des grits et la lâcheté des rouges et des annexionnistes : nous reviendrons sur ce sujet dans un instant.\n\nMais ce n’est pas là la seule cause ; des considérations d’un ordre beaucoup plus élevé ont rendu la confédération nécessaire. Nos hommes d’état, ceux dont s’honore le parti conservateur, tant du Bas que du Haut-Canada, avaient senti que le premier coup de canon tiré en 1860 au Fort Sumter, coup de canon qui mit en feu tous les États-Unis, était pour nous un avertissement solennel de penser à notre avenir. Jusqu’alors, en effet, nos voisins, quoique riches et fort nombreux, n’étaient nullement à craindre pour nous ; exclusivement adonnés à l’agriculture, à l’industrie et au commerce, ils n’avaient pensé qu’à s’enrichir et à s’agrandir, mais pacifiquement, et ils n’avaient ni armée ni marine militaire. Frère Jonathan aimait bien un peu, comme ce sera toujours son faible, le bien d’autrui ; mais, voyant de ce côté-ci l’Angleterre toujours prête à nous défendre, il aimait mieux tourner ailleurs ses regards pour opérer de riches et faciles conquêtes chez les Sauvages des Plaines et les Mexicains indolents. C’étaient des triomphes aisés, si vous le voulez, mais qui suffisaient alors à son orgueil encore bien modeste. Et s’il songeait parfois à nous, c’était dans le temps seulement où les rêves criminels de nos annexionnistes écevelés lui promettaient l’acquisition de nos trésors sans coup févir.\n\nLa guerre fratricide qui éclata et sévit entre le Nord et le Sud changea comme en un clin-d’œil ces dispositions bénévoles. “L’appétit vient en mangeant” ; c’est là un proverbe aussi vrai qu’il est brutal. On ne devient soldat que pour désirer la guerre, et l’on ne désire la guerre que pour faire des conquêtes. Mais le Sud soumis, et il était impossible qu’il ne le fût pas, où se porterait l’ardeur de nos belliqueux voisins ? Les américains\nont besoin du Canada ; ils nous l'ont dit bien des fois et ont même essayé de nous le prouver : ouvrez et lisez les journaux des États et vous verrez cela comme nous ; aujourd'hui, d'ailleurs, personne ne le conteste.\n\nNos hommes d'états, si perspicaces, ne manquaient pas d'être frappés de ces considérations et de cette éventualité. Mais comment nous protéger ? Il n'y avait que deux moyens : l'annexion ? Horreur ! Le mépris public est la seule réponse donnée jusqu'ici aux traîtres qui ont osé parler de cette ignominieuse alternative, et la lâcheté est étrangère au Canadien-Français. Il est de fait qu'à l'heure qu'il est il est impossible de rencontrer un honnête homme qui soit annexioniste. Il ne restait donc que l'autre alternative, que tous les gens intelligents devinaient et désiraient : La Confédération, c'est-à-dire alliance fédérale entre plusieurs peuples et union plus étroite, plus sympathique avec l'Angleterre pour mériter davantage et obtenir, en cas de danger, sa protection et son concours plus efficaces.\n\nC'est là que nos hommes publics ont senti la nécessité de la Confédération, quoique, pour des raisons d'état faciles à comprendre, il leur fut difficile de l'avouer trop ouvertement. D'autres causes, les premières mentionnées, avaient fait désirer la Confédération par presque tous nos hommes publics. On connaît l'histoire de la fameuse question de la représentation basée sur la population.\n\nLors de l'Union des Canadas, en 1840, la population du Bas était plus nombreuse que celle du Haut-Canada ; cependant, on nous imposa l'égalité représentative dans les Chambres et le Bas-Canada eut le même nombre de représentants que le Haut-Canada. C'était une injustice flagrante, mais que nous dûmes subir. Plus tard, surtout après 1850, le Haut-Canada, grâce à une immigration européenne considérable, vit le chiffre de ses habitants atteindre et dépasser le nôtre. Quelques fanatiques du Haut-Canada, guidés par George Brown, se mirent à avocasser la représentation basée sur la population afin de ruiner notre nationalité et d'anéantir notre foi en persécutant notre clergé. Qui leur prêta main forte dans le Bas-Canada ? les Rouges, que vous êtes toujours sûr de rencontrer quand il y a une bassesse ou une trahison nationale à faire. M. Joseph Doutre, homme propre à bien des choses pas toujours nettes, fut lancé le premier comme ballon d'essai. Il prononga à Beauharnois à la fin de l'année 1857 ou au commencement de l'année 1858, ce fameux discours où il accepta la représentation basée sur la population, discours qu'approuva \"Le Pays,\" alors comme aujourd'hui l'organe de l'Hon. A. A. Dorion, le chef du parti\nrouge. En 1858, le fameux ministère Brown-Dorion monta au pouvoir pour y séjourner juste 48 heures ; le mépris et l'indignation de la Chambre et du peuple le précipitèrent à bas dans la boue. Ce fameux ministère avait promis de nous donner la représentation basée sur la population : M. Dorion lui-même l'admit mainte et mainte fois depuis. (Tous ces avoués seront prouvés plus loin.)\n\nQui s'opposa toujours à la représentation basée sur la population ? L'Hon. G. E. Cartier et son parti ; sans lui, sans son alliance si bienfaisante avec le parti conservateur du Haut-Canada, il y a 9 ou 10 ans que nous aurions cette mesure, qui eut été notre coup de mort. A-t-on en effet jamais songé aux effets désastreux qu'aurait eus pour nous, Canadiens-Français, l'octroi de cette mesure dans une union législative comme celle qui existait entre le Haut et le Bas-Canada ? Toutes nos institutions eussent été à la merci des fanatiques du Haut-Canada alliés aux Rouges, aux impies et aux annexionistes du Bas-Canada ; et nous aurions été sans garantie aucune ; le principe de la représentation sur le nombre une fois admis, toute garantie devenait ridicule et illusoire parceque la majorité du lendemain aurait toujours pu défaire ce qu'avait fait la majorité de la veille par le déplacement d'une seule voix !\n\nGrâce au patriotisme, à l'énergie et à l'habileté de M. Cartier, nous avons pu échapper à ce terrible fléau. Mais comme nous disions plus haut, la lâcheté de M. Dorion et de son parti n'en a pas moins eu un très mauvais effet, celui d'encourager les fanatiques par la pensée et la certitude qu'il y avait des traîtres dans la place assiégée, c'est-à-dire dans le Bas-Canada. C'est ainsi que le parti clear grit continua à augmenter en nombre et en exigences, exigences qu'il poussa jusqu'à nous menacer de la guerre civile et de l'annexion. Heureusement pour nous, M. Cartier était là : par son habileté, il sut meseler et anéantir les grits en en décidant une portion considérable à accepter la Confédération, qui était devenue nécessaire depuis deux ou trois ans par l'attitude des États-Unis comme ci-haut expliqué.\n\nPour nous résumer en deux mots, la Confédération était devenue nécessaire dès 1864 et avant, à cause des circonstances critiques dans lesquelles nous plaçaient les changements survenus chez nos voisins depuis 1860, et la crise politique qu'avait amenée entre les deux Canadas la question de la représentation basée sur le nombre, rendit opportune la discussion d'un changement constitutionnel et tout le monde tomba d'accord sur les avantages et la nécessité d'une Confédération comme celle que nous possédons pour parer aux dangers extérieurs, qui ne dépen-\ndaient pas de nous, et que l'invasion féminienne vint aggraver, et aux dangers intérieurs qu'avaient produits et détruits les Rouges, les annexionistes et les clubistes, trois catégories de renégats confondus dans un seul et même parti acharné à la ruine du pays et que nous ferons plus loin connaître en détail.\n\nDonc, en 1864, la Confédération était devenue nécessaire, très nécessaire même.\n\nLA CONFÉDÉRATION NOUS SERA-T-ELLE AVANTAGEUSE ?\n\nL'état fédératif a présidé à l'enfance de presque tous les peuples naissants.\n\n***\n\nEn lui-même, le système fédératif est excellent ; nous le trouvons au berceau de toutes les nations. Il est commandé par la nature et quelquefois par les circonstances : ici, la nature et les circonstances nous en font une nécessité et nous le rendent très précieux. Qu'est-ce au fond que le système fédératif ou une Confédération ? C'est une alliance, une société formée entre plusieurs petits peuples, qui mettent en commun leurs intérêts généraux pour acquérir plus de force dans la défense comme dans l'attaque en se réservant à chacun d'eux le contrôle et la gouverne de leurs affaires et institutions locales et particulières. C'est, en fin de compte, la mise en pratique du principe si connu, si vrai, que \"l'union fait la force.\" L'association, dans notre siècle, comme dans tous les temps, a toujours doublé, triplé, centuplé la force des associés. On ne s'est jamais avisé de contester la vérité et la sagesse de ces principes sanctionnés par l'expérience des siècles, et qui s'appliquent aux nations tout comme aux particuliers. Par exemple, dans une société, dans une compagnie de commerce, d'industrie ou d'exploitation de mines, établie entre dix associés, chacun met le surplus de son avoir disponible ; avec ces petits capitaux réunis, on fait de grandes choses et si la société est bien conduite, elle grandit et fait la fortune de chacun qui, sans l'association, eut été impuissant à tenter d'aussi importantes entreprises et serait toujours resté dans la pauvreté ou la médiocrité.\n\nSi, donc, la Confédération n'est que la mise à exécution de ces saines maximes, nous serons bien obligés de convenir qu'elle est avantageuse pour toutes les parties concernées et notamment pour nous. Eh ! bien, tel est le cas ; voyons plutôt.\n\nComme on le sait, c'est entre le Haut-Canada, le Bas-Canada, le Nouveau-Brunswick et la Nouvelle-Ecosse qu'est formée la\nConfédération en force depuis le premier Juillet courant. La première, l'une des principales clauses de la constitution est celle qui opère le rappel de l'Union, tant demandé par les rouges, et sépare le Bas-Canada du Haut-Canada.\n\nLa Confédération porte le nom de \"Canada.\" Le Haut-Canada s'appelle la \"Province Ontario,\" le Bas la \"Province de Quebec\" et les provinces maritimes conservent leur nom respectif. Ces dispositifs sont contenus dans les clauses 5 et 6 de la constitution :\n\n5. Le Canada sera divisé en quatre provinces, dénommées :—Ontario, Québec, Nouvelle-Ecosse et Nouveau-Brunswick.\n\n6. Les parties de la province du Canada (telle qu'existant à la passation du présent acte) qui constituaient autrefois les provinces respectives du Haut et du Bas-Canada, seront censées séparées et formeront deux provinces distinctes. La partie qui constituait autrefois la province du Haut-Canada formera la province d'Ontario, et la partie qui constituait la province du Bas-Canada formera la province de Québec.\n\nSi le parti rouge n'était pas gangrené de haine, d'envie, de perfidie et de mauvaise foi, il suffirait presque de citer cette clause pour montrer les immenses avantages de la Confédération et imposer silence à tous les braillards. Cette union des Canadas tant maudite par les rouges et les annexionistes, la voilà donc brisée par la volonté et l'énergie de M. Cartier et de son parti ! Ce rappel de l'Union si longtemps et si hypocritement réclamé par les rouges et les annexionistes, le voilà donc effectué, et par nous et pour nous ! Et cependant ces gens crient à la trahison ! ils ont lancé une meute de petits avocats sans clients comme sans cervelle contre M. Cartier pour vociferer que celui-ci a vendu le pays ! Pour Dieu ! peut-il se rencontrer dans le monde aussi noire hypocrisie et le peuple indigné ne finira-t-il pas par voir que les rouges et les annexionistes ne sont que des charlatans sans cœur et sans patriotisme qui veulent le dupler et s'engraisser de ses sucurs et de ses épargnes en attendant l'heure où ils pourront le pressurer et le livrer aux États-Unis ?\n\nContinuons notre étude. La constitution ayant divisé la Confédération nouvelle en trois provinces, pour les fins fédérales seulement, établit un gouvernement général ou fédéral chargé de l'administration de toutes les affaires concernant toute la Confédération. Ce gouvernement sera mis en opération par un Gouverneur Général, un conseil privé ou ministère responsable de treize membres, un sénat et une chambre des communes ; la province de Québec aura 24 sénateurs, la province Ontario 24, et le Nouveau-Brunswick et la Nouvelle-Ecosse 24, en tout 72 sénateurs. Dans la chambre des communes, la province Ontario\naura 82 membres, la province de Québec 65, le Nouveau-Brunswick 15 et la Nouvelle-Écosse 19. Voici maintenant quelles seront les attributions de ce gouvernement, telles que tracées par l'article 91 de la constitution :\n\nVI.—Distribution des Pouvoirs Législatifs.\n\nPouvoirs du Parlement.\n\n91. Il sera loisible à la Reine, de l'avis et du consentement du Sénat et de la Chambre des Communes, de faire des lois pour la paix, l'ordre et le bon gouvernement du Canada, relativement à toutes les matières ne tombant pas dans les catégories de sujets par le présent acte exclusivement assignées aux législatures des provinces ; mais, pour plus de garantie, sans toutefois restreindre la généralité des termes ci-haut employés dans cette section, il est par le présent déclaré que (nonobstant toute disposition contraire énoncée dans le présent acte), l'autorité législative exclusive du parlement du Canada s'étend à toutes les matières tombant dans les catégories de sujets ci-dessous énumérés, savoir :\n\n1. La dette et la propriété publiques.\n2. La réglementation du trafic et du commerce.\n3. Le prélèvement de deniers par tous modes ou systèmes de taxation.\n4. L'emprunt de deniers sur le crédit public.\n5. Le service postal.\n6. Le recensement et les statistiques.\n7. La milice, le service militaire et le service naval, et la défense du pays.\n8. La fixation et le paiement des salaires et honoraires des officiers civils et autres du gouvernement du Canada.\n9. Les amarques, les bouées, les phares et l'Île de Sable.\n10. La navigation et les bâtiments ou navire (shipping).\n11. La quarantaine et l'établissement et maintien des hôpitaux de marine.\n12. Les pêcheries des côtes de la mer et l'intérieur.\n13. Les passages d'eau (ferries) entre une province et tout pays britannique ou étranger, ou entre deux provinces.\n14. Le cours monétaire et le monnayage.\n15. Les banques, l'incorporation des banques et l'émission du papier monnaie.\n16. Les caisses d'épargne.\n17. Les poids et mesures.\n18. Les lettres de change et les billets promissoires.\n19. L'intérêt de l'argent.\n20. Les offres légales.\n21. La banqueroute et la faillite.\n22. Les brevets d'invention et de découverte.\n23. Les Sauvages et les terres réservées pour les Sauvages.\n24. La naturalisation et les aubains.\n25. Le mariage et le divorce.\n26. La loi criminelle, sauf la constitution des tribunaux de juridiction criminelle, mais y compris la procédure en matière criminelle.\n27. L'établissement, le maintien, et l'administration des pénitenciers.\n28. Les catégories de sujets expressément exceptés dans l'enumération des catégories de sujets exclusivement assignés par le présent acte aux législatures des provinces.\nCette distribution des pouvoirs est parfaite et ne laisse rien à désirer ; le plus ardent patriotisme comme le zèle catholique le plus intelligent ne peuvent trouver à redire. On comprend que le \"mariage\" mentionné au No. 25 ne s'applique qu'à la réglementation du nouveau mariage que voudront contracter les protestants divorcés sous l'autorité du parlement fédéral, puisque la législation complète sur le mariage est laissée aux provinces et aux législatures locales, comme nous allons le voir dans un instant. D'ailleurs, cette partie de la constitution, comme tout le reste, a reçu l'approbation complète des hautes autorités religieuses du pays. Il est bon d'observer que les rouges, dans un petit pamphlet plein de mensonges intitulé : \"La Confédération couronnement de dix années de mauvaise administration,\" écrit pour dupérer les électeurs à la veille des élections, ne dit rien du tout contre cette partie de la constitution : il faut donc qu'elle soit bien bonne.\n\nA part le gouvernement fédéral, dont nous venons de voir tous les pouvoirs, chaque province a un gouvernement complet pour la gestion de toutes ses affaires intérieures. La province de Québec a donc un lieutenant-gouverneur canadien-français, un ministère ou conseil exécutif composé de sept membres, un conseil législatif de vingt-quatre membres et une chambre des représentants composé de 65 députés. En un mot, la province de Québec (le Bas-Canada) est complètement séparée du Haut-Canada et a une organisation gouvernementale entière pour administrer seule toutes ses affaires locales. Et nos pouvoirs sont très-étendus, et se rapportent à tout ce qui nous est précieux, cher et sacré ; les voici ; nous citons en entier la clause 92 :\n\n**Pouvoirs exclusifs des législatures provinciales.**\n\n92. Dans chaque province la législature pourra exclusivement faire des lois relatives aux matières tombant dans les catégories de sujets ci-dessous énumérées, savoir :\n\n1. L'amendement de temps à autre, nonobstant toute disposition contraire énoncée dans le présent acte, de la constitution de la province, sauf les dispositions relatives à la charge de lieutenant gouverneur ;\n2. La taxe directe dans les limites de la province, dans le but de prélever un revenu pour des objets provinciaux ;\n3. Les emprunts de deniers sur le seul crédit de la province ;\n4. La création et la tenure des charges provinciales, et la nomination et le paiement des officiers provinciaux ;\n5. L'administration et la vente des terres publiques appartenant à la province, et des bois et forêts qui s'y trouvent ;\n6. L'établissement, l'entretien et l'administration des prisons publiques et des maisons de réforme dans la province ;\n7. L'établissement, l'entretien et l'administration des hôpitaux, asiles,\ninstitutions et hospices de charité dans la province, autres que les hôpitaux de marine ;\n8. Les institutions municipales dans la province ;\n9. Les licences de boutiques, de cabarets, d'auberges, d'enceinateurs et autres licences, dans le but de prélever un revenu pour des objets provinciaux, locaux ou municipaux ;\n10. Les travaux et entreprises d'une nature locale, autres que ceux énumérés dans les catégories suivantes :\n   a. Lignes de bateaux à vapeur ou autres bâtiments, chemins de fer, canaux, télégraphes et autres travaux et entreprises reliant la province à une autre ou à d'autres provinces, ou s'étendant au-delà des limites de la province ;\n   b. Lignes de bateaux à vapeur entre la province et tout pays dépendant de l'empire britannique ou tout pays étranger ;\n   c. Les travaux qui, bien qu'entièrement situés dans la province, seront avant ou après leur exécution déclarés par le parlement du Canada être pour l'avantage général du Canada, ou pour l'avantage de deux ou d'un plus grand nombre des provinces ;\n11. L'incorporation de compagnies pour des objets provinciaux ;\n12. La célébration du mariage dans la province ;\n13. La propriété et les droits civils dans la province ;\n14. L'administration de la justice dans la province, y compris la création, le maintien et l'organisation de tribunaux de justice pour la province, ayant juridiction civile et criminelle, y compris la procédure en matières civiles dans les tribunaux ;\n15. L'infliction de peines par voie d'amende, pénalité, ou emprisonnement, dans le but de faire exécuter toute loi de la province décrétée au sujet des matières tombant dans aucune des catégories de sujets énumérés dans cette section ;\n16. Généralement toutes les matières d'une nature purement locale ou privée dans la province ;\n\nIl manque encore quelque chose : l'éducation. Mais que l'on se rassure. Le patriotisme de nos chefs a pourvu à tout. Chaque province aura le contrôle exclusif de son éducation. Il y a même plus : M. Cartier a voulu que la province de Québec, presque toute catholique, eût le bonheur et le droit de protéger tous les catholiques de chacune des autres provinces ; et pour atteindre ce but vraiment louable et religieux, il a réservé tous les droits, acquis et accordés aux minorités catholiques que les protestants des gouvernements locaux voudraient molester, un droit d'appel au ministère fédéral où toutes les influences catholiques pourront et devront toujours peser d'un poids prépondérant en faveur des co-religionnaires opprimés. Lisez cette belle clause, qui vient immédiatement après celle que nous venous de citer.\n\n*Education.*\n\n93. Dans chaque province, la législature pourra exclusivement décréter des lois relatives à l'éducation sujettes et conformes aux dispositions suivantes :\n\n(1) Rien dans ces lois ne devra préjudicier à aucun droit ou privilège\nconféré, lors de l'union, par la loi, à aucune classe particulière de personnes dans la province, relativement aux écoles séparées (denominational).\n\n(2). Tous les pouvoirs, privilèges et devoirs conférés et imposés par la loi dans le Haut-Canada, lors de l'union, aux écoles séparées et aux syndics d'écoles des sujets catholiques romains de Sa Majesté, seront et sont par le présent étendus aux écoles dissidentes des sujets protestants et catholiques romains de la Reine dans la province de Québec;\n\n(3). Dans toute province où un système d'écoles séparées ou dissidentes existera par la loi, lors de l'union, ou sera subéquemment établi par la législature de la province,—il pourra être interjeté appel au gouverneur-général en conseil de tout acte ou décision d'aucune autorité provinciale affectant aucun des droits ou privilèges de la minorité protestante ou catholique romaine des sujets de Sa Majesté relativement à l'éducation.\n\n(4). Dans le cas où il ne serait pas décrété telle loi provinciale que, de temps à autre, le gouverneur-général en conseil jugera nécessaire pour donner suite et exécution aux dispositions de la présente section,—ou dans le cas où quelque décision du gouverneur-général en conseil, sur appel interjeté en vertu de cette section, ne serait pas mise à exécution par l'autorité provinciale compétente,—alors et en tout tel cas, et en tant seulement que les circonstances de chaque cas l'exigeront, le parlement du Canada pourra décréter des lois propres à y remédier pour donner suite et exécution aux dispositions de la présente section, ainsi qu'à toute décision rendue par le gouverneur-général en conseil, sous l'autorité de cette même section.\n\nCeux qui nous ont fait l'honneur de nous lire jusqu'ici ont déjà vu quel système beau, admirable et avantageux est la Confédération pour nous, canadiens-français et catholiques. La Confédération nous réserve encore pourtant d'autres avantages: c'est que la province de Québec, le Bas-Canada, ou toute autre province en particulier, ne pourra jamais être taxé pour les dépenses du gouvernement fédéral et que ce dernier ne pourra jamais taxer nos terres pour quoique ce soit. C'est là la teneur formelle de la clause 125:\n\n125. Nulle terre ou propriété appartenant au Canada ou à aucune province en particulier ne sera sujette à la taxation.\n\nAinsi, plus d'inquiétude désormais : jamais nous n'aurions de taxe directe foncière à payer pour le gouvernement fédéral ou pour toute autre chose que ce soit, si ce n'est en ce qui concerne la taxe directe pure et simple, pour nos propres besoins locaux, dans le cas impossible où nous serions assez follement prodigues pour ne pas nous contenter des vastes ressources que nous avons à notre disposition, comme nous allons le démontrer bientôt.\n\nNous avons fait, suivant notre humble opinion, suffisamment connaître la nouvelle constitution qui nous régit. Nous l'avons fait connaître honnêtement, consciencieusement; non par nos commentaires, mais par les citations textuelles extraites de la constitution elle-même. Et, certes, en ce faisant, nous n'avons\nque rempli un devoir dicté par les règles de la plus élémentaire probité. Celui qui peut tenir une plume exerce un sacerdoce, et, s'il ment, il est digne du mépris, car il trahit sa mission en abusant d'un don précieux reçu de Dieu. Il doit la vérité à ses lecteurs, comme le prêtre à ses ouailles, et s'il faillit, il devient traître ou apostat. Il est donc bien misérable celui qui ne prend une plume que pour tromper ses compatriotes : c'est pourtant là le rôle de tous les écrivains rouges. En voulons-nous un exemple saillant, palpable ? Ayez le courage d'ouvrir et de lire avec nous ce petit pamphlet hideux récemment publié par les rouges dans l'intérêt de M. A. A. Dorion et de son parti. Nous conseillons même à nos lecteurs de le parcourir, s'ils en ont la force, afin qu'ils voient par eux-mêmes à quel degré de bassesse en doit être rendu un parti qui n'a plus pour armes que le mensonge et la calomnie. Aussi bien, ce sera pour nous un moyen de mieux connaître et de plus aimer la Confédération en voyant comment il est facile de confondre ces chiffres.\n\nDe prime abord, une chose vous frappe en lisant ce petit pamphlet de \"La Confédération couronnée de dix années de mauvaise administration :\" c'est l'absence complète de citations ! L'auteur, que nous félicitons beaucoup, dans son intérêt, d'avoir caché son nom, se contente d'affirmer sans prouver. C'est plus commode qu'honnête. Il remue mer et monde pour prouver que la Confédération nous anglicise et nous tue, et il ne cite pas une seule clause de la constitution. Ah ! bah, quand on est rouge et enfant de la libre pensée, élève de Dessaulles par-dessus le marché, on n'a pas besoin d'être si fier. Avant tout, il faut être fidèle aux traditions de l'école et du papa Voltaire : \"Mentez, mentez, il en restera toujours quelque chose.\"\n\nNous procédons par ordre. Le premier mensonge du petit pamphlet est que le ministère Taché-McDonald n'a eu recours à la Confédération que pour garder le pouvoir. Répondons catégoriquement. Nous avons assigné deux causes à la Confédération, l'une d'essence, l'autre d'opportunité ; la cause essentielle, c'était le danger nous venant des États-Unis par suite de leur grande guerre civile, qui en faisait une puissance militaire de premier ordre et pleine d'ambition et de convoitise. La preuve, elle est dans le fait de la guerre elle-même ; sur ce point, que nous avons plus haut longuement développé, il n'y a rien à ajouter comme rien à refuser dans ce que nous avons constaté. Toutefois, si un lecteur plus exigeant veut de plus amples preuves, il n'a qu'il ouvrir le \"New-York Herald\" du onze février 1865, qui contient une étude complète sur la question de l'annexion du Canada aux États-Unis. À cette époque, on s'en souvient, la question\nde la Confédération était chaudement discutée et ça Canada et aux États-Unis ; les Américains, cela va sans dire, étaient de chauds adversaires de la Confédération parce qu'ils voyaient dans cette mesure la ruine de leurs espérances sur le Canada. Le \"New-York Herald,\" principal organe du gouvernement et surtout écho fidèle de l'opinion publique aux États-Unis, fit une étude spéciale de la question de la confédération et de l'annexion pour en arriver, naturellement pour lui, à la conclusion que les Américains ne devaient pas laisser adopter la confédération ici, mais qu'au contraire ils devaient presser instantanément l'annexion, vu que le Canada, avec ses grands lacs et son beau fleuve St. Laurent, leur était absolument indispensable ; mais suivons notre bonne habitude de citer. Nous trouvons donc dans ce journal du 11 Février 1865, à la première colonne de la deuxième page, l'intéressant passage que nous traduisons :\n\n\"La question imposée à notre gouvernement.\"\n\n\"Le gouvernement américain doit s'occuper immédiatement de l'importante question de savoir s'il va se croiser les bras et laisser sans mot dire l'Angleterre ériger, dans des motifs d'hésitants ouvertement avoués, sur le continent américain une série de forteresses imprenables, construire et armer de puissants bâtiments de guerre sur les lacs américains et organiser une milice considérable sous la conduite d'officiers anglais sur les frontières des États-Unis.\"\n\n..................................................................\n\n\"Le temps est venu pour nous d'unir sans délai le Canada à la république, paisiblement, si possible, par la force, si nécessaire.\"\n\nPlus loin, on trouve encore dans le même article, que les Américains doivent se hâter d'annexer le Canada avant la passation du projet de confédération. Cet article, long de treize colonnes, est curieux à étudier. On y voit une volonté bien arrêtée chez les Américains de nous posséder, surtout parce que nous leur sommes utiles.\n\nNous disions, en second lieu, que les difficultés sectionnelles entre le Haut et le Bas-Canada avaient été pour nos hommes d'état, une occasion de hâter la mesure. De ces deux causes, il n'est rien dit dans le fameux pamphlet. Et, lecteur, savez-vous la vérité sur le sujet ? Vous croiriez, d'après ce pamphlet, que les rouges ont toujours ignoré les difficultés entre le Haut et le Bas-Canada ; vous croiriez encore qu'ils ont toujours été étrangers à ces difficultés ; vous croiriez encore que leur grand chef, leur idole, l'Hon. A. A. Dorion, a toujours été contre la confédération\net qu'il n'en a jamais reconnu la nécessité. Puisque le pamphlet, écrit pour M. Dorion, revisé par lui, avoue carrément que la seule cause de la confédération était l'amour du pouvoir chez M. Cartier et son parti, vous êtes bien obligé de le croire jusqu'à preuve du contraire, et de penser que ces bons rouges et cet excellent M. Dorion ont toujours été contre la confédération et n'en ont jamais parlé. Lisez alors, mais bien attentivement, ce que M. Dorion disait en Chambre le 6 Juillet 1858 : \"L'abrogation de l'Union, l'Union Fédérale basée sur la population ou quelque autre grand changement constitutionnel, doit, de toute nécessité, avoir lieu, et, pour ma part, je suis disposé à examiner la question de la représentation basée sur la population pour voir si elle ne pourrait pas être concédée avec des garanties pour la protection de la religion, de la langue et des lois des Bas-Canadiens. Je suis prêt pareillement à prendre en considération le projet d'une confédération lequel laisserait à chaque Province, l'administration de ses affaires locales, comme, par exemple, le pouvoir de décréter ses propres lois civiles, municipales et d'éducation, et au gouvernement général, l'administration des travaux publics, des terres publiques, du département des postes et du commerce.\"\n\nAvec le temps, les idées de M. Dorion marchèrent; en 1858, il trouvait déjà que la confédération était une bonne chose; en 1860, il l'appelait de tous ses vœux. Le 3 mai 1860, il disait encore:\n\n\"J'avertis les députés du Bas-Canada que, lorsque le temps viendra, toute la représentation du Haut-Canada s'unira et obtiendra la représentation basée sur la population avec l'aide des députés des townships de l'Est. Je regarde l'Union fédérale du Haut et du Bas-Canada comme le noyau de la grande confédération des provinces de l'Amérique du Nord, que j'appelle de mes vœux. En concluant, je dois dire que je voterai pour la résolution, parce que c'est le seul moyen qu'aient les deux provinces de sortir de leurs difficultés actuelles. Je crois que l'union de toutes les provinces viendra avec le temps.\"\n\nEst-ce clair? oui ou non? C'est le chef qui a parlé ainsi; son organe le \"Pays,\" tous ses disciples l'ont alors approuvé. Et maintenant ces gens croient que la confédération n'était pas nécessaire et n'a été proposée que comme expédient ministériel! Il y a encore quelque chose de pis; on a vu plus haut que les pouvoirs locaux ont l'administration de toutes leurs terres publiques;\nqu'on relise le numéro 5 de la clause 92. M. Dorion, lui, voulait, dans son discours de 1858, laisser l'administration des terres publiques au gouvernement fédéral; la confédération que nous avons obtenue est donc bien plus avantageuse que celle que M. Dorion appelait de tous ses vœux en 1860. Nous avouons ici ingénument que la plume nous tombe des mains en présence de tant de mauvaise foi, de tant de contradiction et de tant d'abaissement. Comment! Vous, M. Dorion; vous MM. les rouges, vous avez, depuis 1858, reconnu la nécessité d'un changement constitutionnel, vous avez, depuis 1858 et 1860, acclamé l'idée d'une confédération moins avantageuse que celle que nous a gagnée M. Cartier, et aujourd'hui, vous vous prononcez contre cette confédération, jadis objet de tous vos vœux!\n\nAu fond peut-être avons nous tort de nous indigner d'un phénomène qui n'est que naturel; tout peut s'expliquer aisément quand on a suivi de près les évolutions du parti rouge et de ses chefs. En 1858 en 1860 ils espéraient parvenir au pouvoir et voyaient les américains peu s'occuper de nous. En 1867 tout espoir d'arriver au pouvoir est pour eux perdu; mais les intrigues américaines et les invasions féniennes les ramènent à leurs projets chéris d'annexer leur pays au territoire de l'oncle Sam et ils se prononcent contre la confédération, qui est notre seul préservatif contre les dommages et les maux de l'annexion et les infamies féniennes.\n\nEt ces gens-là ont l'audace de parler d'honneur et de probité!!!\n\nAb uno disce omnes. D'après ce premier mensonge du petit pamphlet, jugez du reste, qui est de la même force.\n\nLe petit pamphlet des rouges, dit en second lieu, que la confédération ne nous a été donnée, que pour réaliser le fameux rapport de Lord Durham. Nous avons presque honte d'avoir à nous occuper de cette inéptie. Il faut être bien malhonnête ou croire le peuple bien ignorant, pour faire un tel avancé. Lord Durham venait en Canada à la suite des troubles de 1837 et 1838, étudier les moyens d'agilifier le Canada Français, afin de prévenir le retour de nouveaux troubles civils. Imbu des préjugés de race que lui inculqua en arrivant l'oligarchie anglaise, acharnée à nous tyraniser depuis 1791, il proposa à la métropole trois systèmes qui, suivant lui, devaient nous agilifier, nous anéantir et rétablir par là la paix sur des bases permanentes:\n\n1. L'Union législative du Haut et du Bas-Canada; 2. l'Union législative de toutes les Provinces de l'Amérique Britannique du Nord, ou, 3. La Confédération de ces dernières Provinces. Le projet de confédération fut mis de coté, comme inefficace à at-\nteindre le résultat désiré et l'on eut recours à l'Union législative pure et simple du Bas-Canada.\n\nVoilà toute l'histoire de ce fameux rapport. L'union fut adoptée comme le plus sûr moyen de nous réduire ; elle nous fut imposée en 1840 et ses uniques effets ont été de nous grandir et de nous permettre de nous affirmer comme nation ainsi que nous l'avons surabondamment démontré plus haut.\n\nQuelle analogie peut-il donc y avoir, entre ce rapport de Lord Durham et la Confédération de 1867, que nous avons demandée et acceptée spontanément et volontairement. C'en est assez pour nous édifier sur la bonne foi et les connaissances historiques de Messieurs les rouges.\n\nLa confédération qui nous régit fournit la plus ample protection possible à nos lois, à notre religion, à notre langue et nos intérêts matériels. Il suffit de lire les attributions conférées au gouvernement de la Province de Québec pour prouver notre assertion. Toutes ces choses précieuses et sacrées sont placées sous notre contrôle immédiat et exclusif et tout droit d'ingérence à ce sujet est formellement enlevé au gouvernement fédéral. Mais il y a plus ; non-seulement notre belle langue française sera la seule parlée dans le Parlement de la Province de Québec où nous formons la presque totalité, mais elle sera encore la langue officielle dans le Parlement Fédéral conjointement avec la langue anglaise et l'usage en sera facultatif dans les débats. C'est là la disposition formelle de la clause 133 de la Constitution :\n\n133. Dans les chambres du parlement du Canada et les chambres de la législature de Québec, l'usage de la langue française ou de la langue anglaise, dans les débats, sera facultatif ; mais dans la rédaction des archives, procès-verbaux et journaux respectifs de ces chambres, l'usage de ces deux langues sera obligatoire ; et dans toute plaidoirie ou pièce de procédure par-devant les tribunaux ou émanant des tribunaux du Canada qui seront établis sous l'autorité du présent acte, et par-devant tous les tribunaux ou émanant des tribunaux de Québec, il pourra être fait également usage, à faculté, de l'une ou de l'autre de ces langues.\n\nLes actes du parlement du Canada et de la législature de Québec devront être imprimés et publiés dans ces deux langues.\n\nLes américains eux-mêmes, dont les rouges nous vantent tant la libéralité, accordent moins aux Français de la Louisiane, que nous n'avons obtenu de l'Angleterre et des colonies anglaises confédérées avec nous. Dans le parlement local de l'État de la Louisiane, la langue française n'est en effet que facultative dans les débats, mais n'est pas langue officielle et tous les procès-verbaux, archives, registres, projets de lois et statuts ne sont écrits et imprimés qu'en anglais. Mais il existe encore une preuve bien plus éclatante de l'excellence de la Confédération pour nous,\nde la protection illimitée qu'elle donne à tous nos intérêts religieux, moraux, matériels et nationaux, dans les paroles sacrées des hauts dignitaires de l'église du Canada.\n\nQuiconque sait un peu son histoire de la nouvelle France, n'ignore pas que le clergé catholique a rendu au pays d'immenses services et que c'est à lui que nous devons d'être restés Français et catholiques, dans la plus belle acception du mot. À toutes les époques critiques de notre histoire, nous voyons toujours nos évêques pleins de dévouement et de zèle pour nos intérêts, intervenir dans la politique, pour prévenir les mesures dangereuses projetées par les ennemis de notre race et de notre religion ; et, en cela, l'épiscopat usait non-seulement d'un droit, mais remplissait un devoir. Tout le monde sait en effet, comme le Pape l'a plusieurs fois déclaré dans des encycliques demeurées célèbres, que le clergé a le droit, bien plus, le devoir d'intervenir dans toutes les questions politiques et gouvernementales qui touchent à la religion, à la morale, et aux intérêts généraux des peuples.\n\nL'Épiscopat actuel s'est montré digne de son prédécesseur ; il a suivi avec attention et anxiété, toutes les discussions sur le projet de Confédération depuis 1864, et lorsqu'en février ou mars dernier, la Confédération devint un fait accompli, tous les évêques catholiques tant du Bas-Canada, que des autres Provinces confédérées, ont approuvé la constitution, l'ont déclarée bonne et avantageuse aux intérêts des catholiques, et ont conseillé fortement à leurs diocésains de ne travailler et de ne voter dans les prochaines élections, que pour les candidats qui avaient contribué à la passation de cette mesure, ou qui déclareraient, formellement l'approuver et vouloir la soutenir en tous points.\n\nÉcoutons d'abord, Monseigneur Cook, évêque de Trois-Rivières, dans son admirable mandement du huit juin dernier (1867) dont nous extrayons les quelques lignes suivantes, où il parle particulièrement du projet de confédération.\n\nVous n'ignorez pas, N. T. C. F., quelle fut la vivacité des débats sur ce projet dans la Chambre d'Assemblée. La grande majorité des députés le regardaient comme la seule planche de salut que la Providence offrait à notre nationalité, tandis que la minorité le repoussait de toutes ses forces, sans avoir toutefois de plan bien arrêté à mettre à la place pour arracher le pays de l'impasse où il se trouvait. Un certain nombre des membres de cette minorité laissait entrevoir assez clairement que l'annexion du Canada aux États-Unis était bien la condition indispensable au salut de notre nation. Quelques-uns auraient préféré laisser les choses comme elles étaient, ou amener tout au plus quelques modifications à la constitution qui n'auraient fait que reculer pour quelque temps la crise en l'aggravant.\n\nPour tout homme, tant soit peu observateur, il était évident qu'à peu près tous reconnaissaient la nécessité d'un changement de constitution,\net que la lutte véritable était entre la confédération et l'annexion, c'est-à-dire, qu'il s'agissait de décider si le Canada allait se préparer à devenir un grand État prospère et libre, en marchant courageusement vers l'accomplissement des destinées que la Providence semblait lui réserver ; ou bien si, renonçant à la vie de peuple libre et maître chez lui, il allait pour toujours enchainer son avenir au sort d'une république qui n'a encore vécu qu'à peu près l'âge d'un homme, et qui a déjà traversé plusieurs guerres et notamment la dernière, la plus épouvantable des guerres civiles dont les annales des nations fassent mention ; guerre civile qui lui a dévoré plus d'un million de ses enfants, et creusé un abîme où se sont englouties pour des années ses richesses et sa prospérité.\n\nQuelques rouges, encore plus imbécilles que malhonnêtes, ont osé lâchement vociférer, que M. Cartier et son parti étaient traîtres à la religion et à la nationalité parce qu'ils avaient proposé et adopté la confédération ; le public intelligent ne les a pas crus. À part quelques Béotiens arriérés du rougisme, tout le monde a fait justice de ces honteuses accusations. Le saint évêque de Trois-Rivières, apprécie justement ces déclamations inspirées par la sottise et la méchanceté et venge noblement nos patriotiques hommes d'état ; jamais plus bel hommage n'a été rendu à l'intelligence et aux sentiments nationaux, de M. Cartier et de son parti :\n\nCependant, N. T. C. F., attendu que les divers moyens par lesquels on pouvait essayer de tirer notre pays des difficultés où il se trouvait, étaient matière d'opinion, et qu'il était libre à chacun de choisir celui qu'il croyait le plus avantageux, Nous n'avons pas cru qu'il fut nécessaire délever la voix en cette circonstance ; mais Nous n'en avons pas suivi avec moins de vigilance la question dans toutes ses phases, afin de sauvegarder, dans la mesure de nos forces, nos intérêts religieux, et de nous assurer qu'ils seraient pour le moins aussi efficacement protégés sous la nouvelle constitution. Voilà pourquoi nous avons dû faire parvenir nos réclamations respectueuses auprès du gouvernement impérial pour assurer aux Catholiques du Haut-Canada une égalité de protection avec les protestants du Bas-Canada sur la question de l'éducation.\n\nMais c'est avec peine que nous avons vu la violence avec laquelle quelques-uns de nos compatriotes se sont élevés contre le projet de confédération ; non qu'il ne fût permis de le discuter dans le temps ; mais il est toujours reprochable de manquer de modération. Nous eussions été heureux de voir plus de calme dans la discussion : c'eût été la voie la plus propre à faire juger sainement ce projet, qui après tout, était regardé par la majorité de nos concitoyens comme une nécessité bien grave, à la vérité, mais comme le moyen le plus praticable de sortir des circonstances difficiles où nous nous trouvions. Nous avons surtout regretté les efforts qui ont été faits pour jeter l'alarme parmi vous, lorsque l'on a cherché à vous faire croire que ce projet n'était rien moins qu'une trahison.\n\nCe sont là, des excès extrêmement regrettables, N. T. C. F., que la charité chrétienne condamne, et dont il faut se garder avec un grand soin. Nous devons toujours observer les règles de la justice envers tout le monde, et nous déclarer de semblables exagérations. Elles ne sont propres qu'à empirer la douloureuse division qui nous a déjà fait tant de mal.\nC'est à la vérité, la justice et la modération que nous aurons la consolation de voir renaitre au milieu de nous la concorde et l'union. Tel est l'enseignement de nos livres saints : \"Misericordia et veritas obviaverunt subi : justitia et pax osculetur sicut.\" \"La miséricorde et la vérité se sont rencontrées : la justice et la paix se sont embrassées.\" Ps. 84, v. 11. Non, Nous ne voyons aucune raison pour justifier une accusation aussi odieuse et aussi grave ; Nous ne connaissons rien qui puisse autoriser à croire que la confédération soit un acte de trahison. Elle a été discutée assez longtemps, examinée assez scrupuleusement par les hommes les plus dévoués et les plus éclairés de toutes les provinces pour lever tout le doute à cet égard. Cependant, il n'en est pas moins vrai que ce n'est toujours qu'avec crainte et en tremblant qu'il faut porter la main à la base sur laquelle repose un édifice tout entier, pour lui en substituer une autre ; tant le moindre défaut d'équilibre pourrait entraîner de funestes conséquences.\n\nLe vénérable prélat ne s'est pas contenté d'approuver la confédération et de louer le zèle et l'intelligence de ses auteurs ; il a encore voulu conseiller à ses diocésains de s'unir dans un même effort patriotique, pour se soumettre au nouveau régime et n'élire que des hommes disposés à l'approuver et à le faire fonctionner pour la promotion de nos meilleurs intérêts. Nous ne pouvons résister au plaisir de mettre devant les yeux du public la citation suivante qui rappelle les plus beaux temps apostoliques :\n\nAujourd'hui que ce projet a reçu la sanction du gouvernement impérial et qu'il est devenu la loi fondamentale du pays, nous devons nous rappeler que notre devoir, comme catholiques, est de mettre un terme à toute discussion sur ce sujet ; si nous avons eu parfaite liberté d'opinion dans les limites du juste et de l'honnête, tant que la confédération n'a été qu'à l'état de projet, si nous avons pu en toute sûreté de conscience être pour ou contre, la combattre avec chaleur ou la défendre avec conviction, suivant que nous l'avons cru utile ou dangereuse, il n'en est plus ainsi depuis qu'elle est passée à l'état de loi. Elle est devenue aujourd'hui une chose jugée et obligatoire ; et c'est le temps de vous rappeler ce grand principe du Catholicisme : Omnis anima potestatis sublimioribus subditas sit : non est enim potestas nisi à Deo : quae autem sunt à Deo ordinata sunt. \"Que tout le monde soit soumis aux puissances supérieures ; car il n'y a point de puissance qui ne vienne de Dieu, et c'est lui qui a établi toutes celles qui sont sur la terre.\" Rom. XII. v. 1. Quelles qu'aient été nos opinions antérieures, le bien de notre pays, et les enseignements de notre religion nous font un égal devoir de l'accepter et de nous y soumettre. Vous devez en conscience, N. T. C. F., et comme catholiques, et comme amis sincères de l'ordre, de l'union et de la paix, vous devez favoriser dans la mesure de vos forces, et par le concours de votre bonne volonté, le bon fonctionnement de la constitution qui va bientôt être inaugurée.\n\nCe devoir, vous aurez à le remplir dans les prochaines élections, en vous assurant que les hommes dont vous allez faire choix pour vous représenter dans les parlements, seront animés de cet esprit de conciliation de cette bonne volonté dont le concours est indispensable pour tirer de la nouvelle constitution tout le bien que nous devons attendre.\nSa Grandeur Monseigneur l'Évêque de Rimouski n'est pas moins explicite :\n\nLa Constitution qui fonde ainsi au Nord des États un grand et riche empire, a été. Nous le croyons sincèrement, amenée providentiellement par une suite de circonstances exceptionnelles. Les royaumes de la machine gouvernementale ne pouvaient plus fonctionner ; mille rivalités de races, de croyances religieuses, d'intérêts politiques ou sectionnels, nous menaçaient d'une anarchie complète ; lorsque plusieurs de nos hommes d'État les plus éminents ont formé le projet, pour mettre fin à ces difficultés interminables et toujours renaissantes, d'agrandir leur sphère d'action, et d'unir en un puissant État des Provinces qui, dans leur isolement, n'avaient que peu de moyens de développer leurs ressources. C'est ce projet, fruit de nuées délibérations, qui a été soumis à l'approbation des Parlements Provinciaux et à celle du Parlement Impérial, et qui est devenu dans toutes ces dispositions essentielles la loi du pays.\n\nVous allez donc choisir, N. C. F., des Représentants capables de soutenir vos intérêts et de vous faire honneur par leurs principes honnêtes, par leur éducation, par leur expérience des affaires publiques. Ils devront vous promettre de travailler franchement et cordialement à faire fonctionner le nouvel ordre de choses, et à seconder à cet effet ceux qui vont être appelés à l'inaugurer. Vous vous défieriez, s'il s'en rencontrait parmi vous, de ces esprits mécontents qui rêvent le bonheur et la prospérité dans l'annexion à un pays voisin. S'ils réussissaient dans leurs sinistres projets, ce qu'à Dieu ne plaise, ce serait, à moins d'un miracle de la Providence, le ruine de notre peuple, la perte de nos mœurs, de nos coutumes de notre langue, l'asservissement de notre nationalité. Vous exigerez donc des Candidats une déclaration, explicite et formelle de principes, l'engagement positif de soutenir la nouvelle Constitution.\n\nL'Archevêque de Québec dans un mandement publié, il y a quelques jours, disait encore, entre autres choses :\n\n\"Ainsi donc, N. T. C. E., comme l'union fédérale qui vient de s'opérer émane de l'autorité légitime, vous la regarderez comme loi, et vous obéirez à l'ordre de Dieu, en l'acceptant en toute sincérité. Il est, d'ailleurs, de votre intérêt, comme c'est pour vous un devoir de conscience, de le faire, pour qu'elle puisse contribuer à la prospérité commune, et procurer par là l'avantage des individus. Bientôt vous serez appelés à choisir ceux qui soit dans le parlement fédéral soit dans le parlement local, devront travailler à mettre en pratique la nouvelle constitution. Vous vous garderez donc de donner vos voix à des hommes disposés à la combattre ou à mettre des entraves à son fonctionnement, mais vous les donnerez à des citoyens épris et reconnus comme ayant à cœur de la faire servir au plus grand bien du pays.\n\n\"Ce qui doit nous rassurer, N. T. C. F., c'est que la nouvelle forme de gouvernement qui vient de nous être donnée, a été préparée avec soin par des hommes bien connus, eux aussi, par leur patriotisme, aussi bien que par les services qu'ils ont rendus à leur commune patrie. Si elle n'est pas sans défauts ; si elle n'est pas tout ce qu'on aurait pu désirer qu'elle fût, rappelons nous que rien n'est parfait dans ce monde, et que, dans un pays comme le nôtre, où tant d'intérêts divers sont en présence il était\nimpossible de se refuser à de mutuelles concessions, et d'arriver à un arrangement qui pût donner satisfaction à tout le monde. C'est aux hommes à qui vous allez confier le soin de vous représenter dans l'un et l'autre parlement, de s'unir fortement ensemble pour conjurer le danger, s'il existe, et pour tirer le meilleur parti possible de la situation. Vous avez donc une raison de les choisir parmi ceux qui se distinguent davantage par leur honnêteté, leur énergie et leur dévouement à la chose publique.\n\nL'éloquent évêque de St. Hyacinthe n'est pas resté en arrière de ses vénérables frères en Épiscopat. Il nous trace de main de maître, un portrait fidèle des adversaires de la Confédération, c'est-à-dire des rouges et des annexionnistes. En lisant les lignes suivantes, on croirait voir Notre-Seigneur flagellant les profanateurs du temple :\n\n................. Que la prudence vous mette en garde contre les tentances de certains esprits et de certains journaux exaltés, qui sont loin de Nous apparaître comme des guides que vous puissiez suivre sans danger! Fermez vos oreilles à l'insinuation perfide, assez souvent répétée! Plutôt l'annexion que la confédération telle qu'elle nous est donnée. Demeurez convaincus que pour ceux qui tiennent ce langage, la confédération n'est qu'un prétexte mis en avant; l'annexion est clairement l'objet de leur conviction politique, et d'une convoitise qu'ils flatteront et fomenteront depuis assez longtemps. Nous en sommes témoin!\n\nEt à notre estime, l'Annexion si jamais elle a lieu, sera la mort ou la destruction certaine de notre nationalité, qui ne vit que par nos institutions, notre langue, nos lois, et surtout notre Religion, et c'est parce que Nous sommes plein de la conviction que tous nos intérêts religieux auraient grandement à souffrir de notre Annexion aux États-Unis que Nous nous faisons un devoir de vous signaler le danger. De sorte qu'en vous parlant ainsi, Nous abordons un sujet qui intéresse plus la Religion que la politique. Et Nous demandons aux hommes sérieux et sans passions, s'il y aurait moyen d'oser affirmer le contraire?\n\nEt malgré cela, il demeure plus que certain qu'il y a parmi nous des gens qui pensent et poussent à l'annexion! Qui ignore, en effet, aujourd'hui que la société secrète, désignée sous le nom de Club de St. Jean-Baptiste, qui se formait, il y a quelque temps à Montréal, et que des zélotes coupables ont cherché à répandre dans les campagnes, avait pour but et pour fin de créer un courant annexionniste? Qui ne sait même que quelques-uns de ses membres, dans le but de favoriser et de hâter l'Annexion, ont eu le triste courage de fraterniser avec la bande méprisable des Féniens, qui, l'an dernier, ont envahi notre sol, et fait couler le sang de nos concitoyens?\n\nNous serions curieux de savoir ce que pensent de ce portrait, les ci-devant députés des comtés d'Iberville, de Bagot et de Richelieu.\n\nSa Grandeur, Monseigneur l'Évêque de Montréal, avait déjà depuis longtemps devancé ses illustres collègues, dans une lettre du 11 mars 1867, adressée à l'honorable George Étienne Cartier, et dans une circulaire à son clergé du 25 mai dernier (1867), lettre et circulaire que tout le monde connaît et qui viennent\nd'être publiées dans tous les journaux du pays. Tous les évêques du Haut-Canada et des provinces maritimes ont également approuvé la Confédération.\n\nLa lettre de l'Évêque de Montréal, mérite certainement reproduction :\n\nMontréal, le 11 mars 1867.\n\nM. LE PROCUREUR-GÉNÉRAL,\n\nJe reçois, à l'instant, la copie du British North America Bill que vous avez eu la bonté de m'adresser ; et je m'empresse de vous présenter mes sincères remerciements pour votre bienveillante attention.\n\nJe comprends vivement que ce Bill intéresse à un haut degré notre pays, qui, après toutes les phases d'administration par lesquelles il lui a fallu passer depuis un certain nombre d'années, a grand besoin de se fixer sur des bases stables et durables.\n\nIl serait superflu de vous dire que le clergé, tout en se mettant en dehors de toutes luttes de partis politiques, n'en est pas moins attaché au pays qui l'a vu naître, et qu'il aime, comme un bon enfant aime sa mère, et cet amour est d'autant plus ardent qu'il lui est inspiré par la religion.\n\nVeuillez bien croire, M. le Procureur-Général, à la haute estime avec laquelle j'ai l'honneur d'être votre très-humble et obéissant serviteur,\n\n† IG., ÉVÊQUE DE MONTRÉAL.\n\nA l'Hon. G. E. Cartier,\nProc.-Gén., etc.,\nPalais de Westminster, Londres.\n\nIl nous semble modestement que l'opinion des évêques, que nous venons de rapporter, vaut bien celle de Messieurs Lanctot et Dorion, les deux chefs du parti anti-fédéral. Nous est avis même, que le peuple préfère ses saints évêques à ces deux glorieux personnages, et surtout dans les affaires politiques ; en effet, l'hon. A. A. Dorion en fait de sublimes conceptions politiques, n'a jamais dépassé l'invention des juges à paix électifs. Pourtant, il a eu des moments d'oubli ; lorsque son parti ne l'obsédait pas, il a eu le noble courage d'appeler de tous ses vœux, une Confédération bien moins bonne que celle de M. Cartier ; mais c'était dans l'heureux temps où ses partisans, éloignés de lui, voulaient bien lui laisser démentir le spirituel Gaspard Lemage : l'on sait en effet qu'un jour, M. Dorion fatigué de n'être que la queue du parti qui l'avait choisi pour chef, s'est écrié dans un moment d'amer découragement : \"Je suis leur chef, il faut bien que je les suive.\" M. Dorion avait été créé et mis au monde pour être un excellent homme d'état de cinquième ordre et il eut été admirable, s'il eut voulu comprendre que ses partisans exploitaient sa réputation d'honnêteté professionnelle pour en faire un chef qu'ils pussent décider à se contredire aussi souvent que les besoins de la cause l'auraient exigé. Nous déplorons sin-\nvèrement son sort. Quant à M. Médéric Lanetot, il a plus de courage et n'a jamais reculé dans les grandes occasions où il s'agissait d'affirmer les beaux principes du parti : combat au poing, bris de vitres et de maisons, cour de police, amende ou emprisonnement, rien ne l'effrayait. Aussi, s'est-il fait un nom notoire et remarquable parmi la gent démagogique. Nous pouvons même prédire qu'il ira loin, si, surtout, le gouvernement veut s'en occuper. Lors de l'invasion féniennes, il put faire, grâce aux fonds secrets qu'il reçut de la confrérie féniennes, tous ses efforts et dans le club St. Jean-Baptiste et dans un journal extorqué sous de faux prétextes, pour attirer sur lui, l'attention de la police et des autorités militaires. On le dédaigna : il en conquit une rage morbide. Il espérait être emprisonné ; il le serait même sur les toits, dans l'espoir de mieux vendre sa feuille barbouillée aux épiciers peu fiers. Un jour, pourtant, il eut occasion de manifester son héroïque bravoure. La police eut à faire une descente dans sa boutique, pour coiffer un de ses employés, qui avait trop honoré Bacchus. M. Médéric Lanetot, crut que le bonheur lui arrivait et qu'on en voulait à son auguste personne. Ce fut sa journée \"des éperons,\" et pour prouver qu'il était vaillant, il alla faire une petite promenade aux États-Unis. Son employé récalcitrant ayant réglé avec M. Penton, M. Lanetot revint se livrer aux autorités qui ne l'avaient jamais réclamé. Il fut heureux d'avoir échappé à un aussi grand péril, et ses collaborateurs l'en félicitèrent bien cordialement. Pour lui, en vrai héros espagnol, il ne pardonna jamais à M. Cartier et à la police, de lui avoir fait une aussi mauvaise affaire, et il ne se considéra comme bien vengé de cet odieux attentat contre sa liberté, que lorsqu'il eut essayé de corrompre nos braves ouvriers du faubourg Québec, qui malheureusement commencent déjà à le connaître et à l'apprécier. Mais il a déjà pourvu à cette sombre éventualité, et le jour où la banqueroute le délaissera lui-même pour fondre sur ses magasins au prix coûtant, il ira offrir ses services gratis, bien entendu, à ses frères, les nobles Féniens, et leur vendra son intéressante feuille, argent comptant, afin de mieux assurer le paiement de la créance du père Marier.\n\nNous venons de faire impartialement l'historique de la confédération et de ses avantages, de même que nous avons fait connaître l'hypocrisie et la mauvaise foi de ceux qui combattaient cette mesure. On sait maintenant que penser des mensonges du petit pamphlet rouge et de ce qu'il dit au sujet du rapport de Lord Durham, de la question d'éducation et des mandements\nde nos évêques. Nous pouvons ajouter que dans la confédération les intérêts catholiques seront toujours protégés efficacement.\n\nVoyons en effet, quel sera le nombre des catholiques dans la confédération. Disons d'abord, en prenant pour base le recensement de 1861, et en comprenant de suite, comme faisant partie de la confédération, l'Ile du Prince-Edouard et Terre-Neuve, qui de fait y entreront bientôt, que le chiffre total de la population de la confédération est de 3,292,706 âmes ; sur ce total, la confédération comptera 1,465,979 catholiques, répartis comme suit, savoir :\n\nHaut-Canada ........................................... 258,141\nBas-Canada .................................................. 943,253\nNouveau-Brunswick ....................................... 85,238\nNouvelle-Écosse ........................................... 86,281\nIle du Prince-Edouard ..................................... 35,852\nTerre-Neuve .................................................. 57,214\n\nTotal ......................................................... 1,465,979\n\nCe qui fait à peu près la moitié de catholiques. Ainsi donc, si les protestants dans le Parlement Fédéral voulaient molester les catholiques, nous nous trouverions à lutter à peu près moitié contre moitié, en mettant les choses au pis. Mais il y a des circonstances qui changent complètement les chances et les tournent toutes du côté des catholiques.\n\nEn premier lieu, la population catholique est toute homogène, nullement dévorée par les divisions intestines des différentes sectes, comme l'est le protestantisme ; elle devra opérer et il sera toujours de son intérêt de marcher en un faisceau uni et compact, pour que rien ne la divise. Il n'en est pas de même du protestantisme, partagé en plusieurs dénominations dont quelques-unes se jalousent ou se détestent, et qui ne pourront jamais se réunir pour tyranniser les catholiques, parce que chacune de ces dénominations étant faible, aura besoin, dans certains cas donnés, du concours des catholiques de sa province.\n\nQuelques chiffres, puisés aux meilleures sources vont nous prouver ce fait. La confédération comptera :\n\nAnglicans .................................................... 517,542\nPresbytériens .................................................. 498,646\nWesleyens et Méthodistes .................................. 458,388\nBaptistes .......................................................... 192,530\nLuthériens ...................................................... 29,651\nCongrégationalistes .......................................... 18,104\nCroyances diverses ........................................... 78,735\nSans aucune religion ........................................ 18,860\nCeux dont les croyances ne sont pas connues ....... 17,271\nCes dénominations comparées vis-à-vis la population totale, de la Confédération, donnent le résultat géométrique suivant :\n\nLes Anglicans représentant ........................................... 15\\(\\frac{3}{4}\\) par 100\nLes Presbytériens ......................................................... 15\\(\\frac{1}{2}\\) \" \nWesleyens et Méthodistes .............................................. 14 \" \nBaptistes ........................................................................... 5\\(\\frac{3}{4}\\) \"\nLuthériens ........................................................................ 3\\(\\frac{1}{4}\\) \"\nCongréganistes .................................................................. 1\\(\\frac{1}{2}\\) \"\nCroyances diverses ............................................................ 2\\(\\frac{1}{4}\\) \"\nSans religion ....................................................................... 2\\(\\frac{1}{2}\\) \"\nCroyances non connus ....................................................... 1\\(\\frac{1}{2}\\) \"\nLes catholiques, eux, représentent vis-à-vis le tout ......................................................... 44\\(\\frac{1}{2}\\) \"\n\nNous voyons de suite quelle supériorité numérique nous possérons sur chacune des dénominations protestantes séparées.\n\nUn second avantage qui éloigne tout danger des catholiques, c'est la libéralité bien connue et presque extraordinaire des protestants des provinces maritimes. Dans ces provinces la haute éducation est presque toute entre les mains du clergé catholique et notamment des Jésuites ; la plus grande partie de leurs hommes politiques ont puisé, quoique protestants, leur éducation dans des institutions catholiques et sont conséquemment pleins de tolérance à l'égard de notre croyance. Là, les institutions catholiques sont vues du même œil que les protestantes par toute la population et par le gouvernement. Pour ne parler que de la Nouvelle-Ecosse, il y a dans cette province deux collèges catholiques, sous la direction exclusive de prêtres et de jésuites, et ces deux collèges reçoivent du gouvernement la même subvention annuelle que les collèges protestants, savoir, mille piastres par année : ce sont les collèges de Ste. Marie et de St. François-Xavier, et il en est ainsi de toutes les autres provinces. Mais, bien plus, dans chacune de ces provinces, la population catholique excède de beaucoup le nombre de chaque dénomination protestante, et dans deux d'entre elles, Terre Neuve et l'Île du Prince Edouard, l'élément catholique figure à peu près par moitié dans le chiffre total de la population.\n\nIl est donc de la dernière évidence que les catholiques dans la confédération ne peuvent être molestés, et il faut être bien peu soucieux de son honneur et de la vérité, pour prétendre que la confédération met dans le gouvernement général, nos intérêts religieux en danger, et ce, pour les deux bonnes raisons que nous venons de développer, 1o pour que le parlement fédéral n'a pas juridiction sur l'éducation et nos institutions religieuses, 2o parce\nque s'il y avait appel d'un gouvernement local au ministère fédéral, sur une question d'éducation publique, et que cet appel serait fait dans le but de molester les catholiques, (et nous maintenons que la supposition est impossible) nous verrions tous les protestants des Provinces d'en bas, s'allier à la moitié catholique pour influencer victorieusement le gouvernement fédéral. Nous pouvons conclure hardiment que sous la confédération, nos intérêts religieux et nationaux se trouvent complètement à l'abri de tout danger : la constitution nous le promet, et tous nos vénérables évêques et les honnêtes gens ont trouvé la promesse suffisante et l'ont sanctionnée par leur approbation.\n\nMais disent les rouges, et leur organe, Le Pays et le petit pamphlet la confédération nous ruine, et va nous amener la taxe directe. Nouveau mensonge que nous allons de suite mettre en poussière.\n\nFINANCES.\n\nDans le petit pamphlet rouge en question, la question financière n'est nullement touchée ; on se contente de déclamations banales, sur les prétendus gaspillages des dernières administrations, qui n'ont rien à voir dans le débat actuel.\n\nQuant à la situation financière qui est faite à la Province de Québec, sous la confédération, on n'en dit rien du tout et pour cause. M. le pamphlétaire se borne à des chiffres mensongers et imaginaires et il a la force de donner, comme dépenses annuelles de la Province de Québec, les dépenses générales annuelles des deux Canadas avant la confédération, ce qui est de la plus odieuse malhonnêteté et de la plus grande fausseté. Il tait avec soin les ressources de la Province de Québec, ne dit mot des bénéfices considérables que nous confèrent certains articles de la constitution et il évite d'en citer un seul. C'est là la mesure exacte du respect que messieurs les rouges ont pour le peuple ; au lieu de l'instruire comme ils en ont la prétention, ils emploient tout leur zèle à le tromper par des assertion fausses et que chaque articles de la constitution dément. Encore une fois, si la constitution est mauvaise et nous ruine, pourquoi ne pas citer les articles qui prouvent leurs avancées ? La raison de leur silence est bien simple ; s'ils mettaient devant le peuple les articles de la constitution se rapportant aux finances et aux ressources du Bas-Canada, ils se trouveraient dans la pénible nécessité de prouver eux-mêmes qu'ils ne sont que de fieffés menteurs.\n\nNous allons de nouveau établir leur mauvaise foi, par la constitution elle même :\n109. Toutes les terres, mines, minéraux et réserves royales appartenant aux différentes provinces du Canada, de la Nouvelle-Ecosse et du Nouveau-Brunswick lors de l'union, et toutes les sommes d'argent alors dues ou payables pour ces terres, mines, minéraux et réserves royales, appartiendront aux différentes provinces d'Ontario, Québec, la Nouvelle-Ecosse et le Nouveau-Brunswick, dans lesquelles ils sont sis et situés, ou exigibles, restant toujours soumis aux charges dont ils sont grevés, ainsi qu'à tous intérêts autres que ceux que peut y avoir la province.\n\n110. La totalité de l'actif inhérent aux portions de la dette publique assumées par chaque province, appartiendra à cette province.\n\n111. Le Canada sera responsable des dettes et obligations de chaque province existantes lors de l'union.\n\n112. Les provinces d'Ontario et Québec seront conjointement responsables envers le Canada de l'excédant (s'il en est) de la dette de la province du Canada, si, lors de l'union, elle dépasse soixante-douze millions cinq cent mille piastres, et tenues au paiement de l'intérêt de cet excédant au taux de cinq pour cent par année.\n\nLes sommes suivantes seront annuellement payées par le Canada aux diverses provinces pour le maintien de leur gouvernements et législatures :\n\n| Province          | Montant |\n|-------------------|---------|\n| Ontario           | $80,000 |\n| Québec            | 70,000  |\n| Nouvelle-Ecosse   | 60,000  |\n| Nouveau-Brunswick | 50,000  |\n\nTotal .................. $260,000\n\nEt chaque province aura droit à une subvention annuelle de quatre-vingts cents par chaque tête de la population, constatée par le recensement de mil huit cent soixante-un, et—en ce qui concerne la Nouvelle-Ecosse et le Nouveau-Brunswick—par chaque recensement décennal subséquent, jusqu'à ce que la population de chacune de ces deux provinces s'élève à quatre cent mille âmes, chiffre auquel la subvention demeurera dès lors, fixée. Ces subventions libéreront à toujours le Canada de toutes autres réclamations et elles seront payées semi-annuellement et d'avance à chaque province ; mais le gouvernement du Canada déduira de ces subventions, à l'égard de chaque province, toutes sommes d'argent exigibles comme intérêt sur la dette publique de cette province si elle excède les divers montants stipulés dans le présent acte.\n\nPour appuyer d'avantage notre prétention, citons de nouveau quelques paragraphes de l'article 92 déjà reproduit, pour faire voir nos sources de revenus :\n\nPOUVOIRS EXCLUSIFS DES LÉGISLATURES LOCALES.\n\nDans chaque Province la Législature pourra exclusivement faire des lois relatives aux matières tombant dans les catégories de sujets ci-dessous énumérés, savoir :\n\n3. Les emprunts de deniers sur le sous crédit de la province.\n\n5. L'administration et la vente des terres publiques appartenant à la province et des bois et forêts qui s'y trouvent.\n8. Les licences de boutique, de cabarets, d'auberge, d'encanteurs et autres licences dans le but de prélever un revenu pour des objets provinciaux, locaux ou municipaux.\n\n14. L'administration de la justice dans la Province, etc.\n\n15. L'infliction de punitions par voie d'amendes, pénalité, etc.\n\nOn va voir maintenant que la Confédération nous laisse en commun avec le Haut Canada, des propriétés qui nous donneront des revenus considérables dont au moins la moitié nous appartiendra pour subvenir à nos dépenses ordinaires et extraordinaires:\n\n113. L'actif énuméré dans la quatrième cédule annexée au présent acte appartenant lors de l'Union à la province du Canada, sera la propriété d'Ontario et de Québec conjointement.\n\nQUATRIÈME CÉDULE.\n\nActif devant la propriété commune d'Ontario et Québec.\n\nFonds de bâtisse du Haut-Canada.\nAsile d'aliénés.\nÉcole Normale.\nPalais de Justice dans le Aylmer,\nMoutreal,\nKamouraska,\nSociété des hommes de loi, Haut-Canada.\nCommission des chemins à barrières de Montréal.\nFonds permanent de l'université.\nInstitution royale.\nFonds consolidé d'emprunt municipal, Haut-Canada.\nFonds consolidé d'emprunt municipal, Bas-Canada.\nSociété d'Agriculture, Haut-Canada.\nOctroi législatif en faveur du Bas-Canada.\nPrêt aux incendies de Québec.\nCompte des avances, Témiscouata.\nCommission des chemins à barrières de Québec.\nEducation—Est.\nFonds de bâtisse et de jurés, Bas-Canada.\nFonds des municipalités.\nFonds du revenu de l'éducation supérieure Bas-Canada.\n\nAprès ces citations, nous pouvons bien rappeler les paroles de l'un des publicistes les plus éminents de l'Amérique du Nord, lequel n'a jamais été partisan bien ardent de la confédération:\n\n\"Pour comprendre, dit-il, toute la signification de ces dispositifs, il est important d'avoir devant les yeux, avec cet avoir, les obligations qui en sont le débit.\n\n\"La séparation de l'administration provinciale de l'administration fédérale a naturellement créé deux classes distinctes de revenus et aussi deux classes distinctes de dépenses. Ce que nous avons à constater pour le moment, ce sont, d'abord les\n\"chiffres du revenu et de la dépense de l'administration du Bas-Canada, tels que nous les fait la confédération, et à s'assurer ensuite, qu'en pratiquant l'économie, sans nuire au développement de nos ressources, de nos améliorations locales, de nos institutions et généralement, de notre prospérité, nous sommes amplement pourvus pour l'avenir et que nous n'aurons pas besoin d'avoir recours au moyen extrême de la taxe directe.\n\n\"Commençons par le chiffre de la dépense. D'après des calculs basés sur des données puissées, presque toutes, à des sources officielles et quelques unes seulement, (celles relatives à la législature et au gouvernement) sur les probabilités appuyées sur l'expérience et sur la connaissance des choses et des besoins : d'après ces calculs, nous arrivons au résultat suivant :\n\n| Dépense                                      | Montant   |\n|----------------------------------------------|-----------|\n| Administration gouvernementale et législation | $150,000  |\n| Judiciaire (administration)                  | 100,000   |\n| Pénitentiaires                                | 70,000    |\n| Écoles                                       | 160,000   |\n| Asiles d'aliénés                              | 90,000    |\n| Institutions littéraires                      | 5,900     |\n| Hopitaux et autres institutions de charité    | 21,390    |\n| Arts                                         | 3,500     |\n| Agriculture                                  | 4,000     |\n| Réparations d'édifices publics etc.           | 15,000    |\n| Colonisation (chemins)                        | 50,000    |\n| Autres chemins                               | 15,000    |\n| Bureau des mesureurs de bois                  | 35,009    |\n| Travaux publics                               | 30,000    |\n| Contingents de bureau                         | 30,000    |\n| Autres contingents                            | 32,000    |\n| Glissières                                    | 15,000    |\n| Arpentage                                     | 30,000    |\n| Terres (administration)                       | 57,000    |\n| Autres dépenses non-énumérées                 | 180,000   |\n\nTotal...........................................$1,099,790\n\nNous avons basé nos calculs en prenant les plus hauts chiffres possibles, afin d'être sûrs de ne pas éprouver de déconvenue ; nos dépenses seront certainement moindres que le total que l'on vient de donner, et dans tous les cas, ne pourront jamais l'excéder. Il nous reste à voir quelles ressources nous aurons pour rencontrer ces dépenses.—\nREVENU.\n\nD'après la clause 118 de la confédération, la Province de Québec recevra du gouvernement fédéral une allocation annuelle de........................................... $ 70,000\n\nD'après la même clause, nous avons droit à une subvention additionnelle de 80 cents par tête, payable d'avance, ce qui donne, la population du Bas-Canada étant, en 1861, de 1,111,566, le beau chiffre de ................................................................. 889,252\n\nNos revenus locaux, dont la confédération nous laisse la propriété exclusive et l'administration absolue, en vertu des clauses 92, 109, 110, 111 et 112, qui ont toutes été citées, produiront, en faisant les plus modestes estimés basés sur les revenus des dernières années, les diverses sommes suivantes:\n\nBois ................................................................. 105,000\nTerres ............................................................... 300,000\n\nObservons de suite que ce chiffre de $300,000 est bien au-dessous de la moyenne. En 1865, le revenu des terres s'est élevé à la somme de $830,992, dont au moins la moitié, savoir : $415,496, devrait représenter la valeur annuelle approximative des terres du Bas-Canada, puisqu'il y en a plus de disponibles ici que dans le Haut-Canada, et cependant nous n'avons fixé que $300,000, comme terme moyen, afin d'être certain de rester au-dessous du vrai et de n'être pas démenti dans l'avenir.\n\nAutres revenus locaux, tels que : impôts sur l'administration de la justice, licences, amendes, confiscations, s'élevant à au moins.................................. 300,000\n\nTotal du revenu.............................................. $1,664,252\nTotal de la dépense................................. 1,099,790\n\n$ 564,462\n\nC'est donc une somme de $564,462 comme excédant de nos revenus sur nos dépenses, et dont nous pourrons disposer pour les objets qui nous seront les plus nécessaires. Il est impossible d'inaugurer le nouveau système sous des circonstances plus prospères. Ces chiffres sont basés sur des données officielles et sur les articles mêmes de la constitution ; personne ne peut les démentir, et, s'il y a exagération, c'est plutôt en moins qu'en plus.\n\nIl est bien vrai qu'en vertu de l'article 112 de la constitution, qu'on vient de voir, le gouvernement fédéral ne se charge de la.\ndette des deux Canadas que jusqu'au montant de $62,500,000, et que la Province de Québec et la Province d'Ontario, tout en étant déchargées du surplus de la dette vis-à-vis leurs créanciers, seront néanmoins tenues de payer et rembourser au gouvernement central l'intérêt sur ce surplus de la dette au taux de cinq pour cent par an. La dette publique des deux Canadas était, d'après les dernières statistiques officielles, de $67,263,994 ; le surplus sera donc de $4,763,994. Nous sommes sur d'exagérer considérablement en plus, en prenant pour le Bas-Canada la moitié de ce surplus de $4,763,994, c'est-à-dire $2,381,997. Nous aurions donc, par ce partage, à payer annuellement en intérêts, sur cette dette, une somme de $119,035 ; mais n'allons pas croire que cette dernière somme entamera le surplus de nos revenus que nous avons établi plus haut, à la somme de $564,402 ; car, dans l'énumération que nous avons faite de nos ressources et de nos revenus ordinaires, nous avons mis de côté, à dessein, pour nous en occuper ici spécialement, une autre source de revenus et profits très-considérables, tirée de l'article 113, déjà cité en entier. Les statistiques les plus sûres fournies sur le sujet établissent, en effet, ainsi qu'il suit, la valeur des propriétés laissées par le gouvernement fédéral aux Provinces de Québec et d'Ontario, qui s'en partageront les revenus entre elles :\n\n| Fonds de bâtisse, H.-C. | $36,200 |\n|-------------------------|--------|\n| Ecole Normale, B.-C.    | 47,777 |\n| Palais de justice, Aylmer, Montréal, Kamouraska | 269,050 |\n| Société hommes de loi, H.-C. | 25,000 |\n| Compagnie chemins et barrières, Quebec | 42,600 |\n| \" \" \" \" \" \" Montréal | 188,000 |\n| Fonds permanent d'Université | 1,200 |\n| Institution royale | 7,990 |\n| Fonds consolidé emprunt municipale, H.-C. | 7,294,800 |\n| Intérêts | 2,429,540 |\n| Fonds consolidé emprunt municipale, B.-C. | 2,876,729 |\n| Intérêts | 655,836 |\n| Société agriculture, H.-C. | 4,000 |\n| Octroi Législatif, B.-C. | 28,494 |\n| Prêt aux incendies de Québec | 273,429 |\n| Fonds de Témiscouata | 3,000 |\n| Education est | 273,429 |\n| Fonds des Jurés | 60,000 |\n| Fonds des municipalités | 59,767 |\n| \" \" \" \" \" \" | 204,113 |\n| Fonds des revenus Education Supérieure | 239,362 |\n\n$15,029,366\nEn lisant attentivement cette nomenclature de notre avoir, nous verrons que plus de la moitié se trouve dans le Bas-Canada, et que conséquemment, notre part des revenus sera d'autant plus élevée. L'intérêt de cet actif à six pour cent par an, donnerait un revenu annuel de $903,318, dont la province de Québec, pourrait avoir au moins une bonne moitié, savoir à peu près $500,000. Mais mettons les choses au pire ; quelques-uns de ces revenus pourraient être lents à entrer ; disons même que le partage en sera injuste entre nous et le Haut-Canada et que nous n'aurons que la juste moitié. Pour faire la part de ces pertes et de ces inconvénients éventuels, supposons que cette somme de $15,026,366 ne rapportera, par impossible, qu'un intérêt de trois pour cent par an ; donc, à trois pour cent par an, nous aurons encore un intérêt de $450,880, dont au moins la moitié appartiendra à la province de Québec, savoir $225,440. Ainsi nous nous trouvons avec un revenu extraordinaire, mais sûr de $225,440, pour rencontrer la somme de $119,035, étant notre part à payer des intérêts de la moitié du surplus de notre ancienne dette, ce qui nous laisse un surcroît de $106,405, à ajouter à notre excédant de $564,462, et en additionnant ces deux dernières sommes, nous avons, savoir :\n\n| Excédant de nos revenus ordinaires sur nos dépenses ordinaires | $564,462 |\n| Excédant de notre moitié des revenus de nos propriétés communes sur les intérêts de la moitié du surplus de l'ancienne dette des deux Canadas | 106,405 |\n| **Total de l'excédant de nos recettes générales sur nos déboursés généraux** | $670,867 |\n\nEn face de ce résultat si beau, tous nos hommes bien pensant et animés d'un patriotisme réel, tous nos vénérables Prélats n'avaient-ils pas raison de s'écrier, que la confédération était notre salut matériel, religieux et national ? n'avaient-ils pas raison de s'écrier que la confédération était le résultat heureux des efforts combinés de nos hommes d'état les plus éclairés, les plus habiles et les plus désintéressés ?\n\nIci doit venir une réflexion bien naturelle. Quel est l'intérêt, le mobile des rouges dans leurs déblatérations continuelles à propos de taxes directes ou indirectes ? Qui est-ce qui les pousse à mentir sans cesse depuis 1847, à propos de taxes et d'impôts ? Jamais ils n'ont parlé au peuple de choses sérieuses, grandes, propres à l'élever. Qu'on ouvre leurs brochures, qu'on parcoure leurs journaux et l'on verra que leur grand cheval de bataille a\ntoujours été taxes et impôts. Cette manie chez eux révèle une grande malhonnêteté et une grande hypocrisie ; elle est, de plus, l'indice d'une absence lamentable de cœur et de patriotisme ; elle montre encore que le parti rouge méprise profondément le peuple et n'a toujours cherché qu'à l'exploiter et à s'en faire un marché pour atteindre le but de ses ambitions effrénées. En fin de compte ces gens-là n'ont toujours cherché qu'à préjuger le peuple contre les gouvernants et l'autorité : en criant sous et taxes. Ils croyaient le peuple descendu à leur niveau et c'est pour cela que toute leur politique a toujours roulé sur les préjugés et les intérêts matériels. Des idées religieuses, grandes et généreuses, ils n'ont jamais cherché à en répandre. Prenons par exemple, leur petit pamphlet ; qu'y trouve-t-on ? Il ne contient à proprement parler, que deux objections contre la confédération : le nouveau système d'après eux, va nous ruiner et nous conduire à la taxe directe ; en second lieu, les prétendues prodigalités des anciennes administrations vont encore nous mener à la taxe directe. C'est en vain que vous chercheriez autre chose dans ce produit de cerveaux rouges. Nous venons de faire amplement et victorieusement justice de la première objection. Nous avons démontré que la confédération laisse à la Province de Québec d'immenses ressources, que nous ne pouvons jamais être taxés pour les dépenses du gouvernement fédéral et qu'il nous est radicalement impossible d'arriver à nous taxer directement pour nos intérêts locaux. Cette objection de de la part des rouges, ne repose donc que sur un mensonge, une odieuse fausseté. Quant à la seconde objection, c'est un véritable hors d'œuvre. Nous le demandons à tout homme de bonne foi, qu'ont à faire ces stupides accusations contre les anciens gouvernements, à propos du nouveau régime sous lequel nous vivons : Si la confédération est mauvaise, citez les clauses de la constitution et montrez nous en quoi elles sont préjudiciables à nos intérêts religieux, nationaux et matériels. C'est le seul moyen honnête et convenable de combattre une mesure que l'on croit mauvaise. Cependant vous n'en faites rien et vous vous contentez de divaguer à tort et à travers sans rien citer.\n\nCroyez-vous le peuple assez ignorant, assez insensé, pour vous croire, et avez-vous la naïveté de penser qu'il vous suffit de mentir sur le compte des anciens gouvernements du Canada, comme sur le compte des Honorables G. E. Cartier et J. A. Macdonald, pour tourner la population contre un état de choses que n'ont pas amené ces deux ministres éminents, mais qu'ils ont eu la sagesse de croire acceptable, pour nous garder et nous protéger contre les Américains, les Féniens et leurs alliés du Bas-Canada c'est-à-\ndire vous, Mess. les rouges, les annexionnistes et les clubistes. D'ailleurs tous vos arguments reposent sur la contradiction et l'hypocrisie la plus pitoyable. Dans tous vos écrits, dans tous vos discours aussi vides de sens que pauvres de style, vous nous parlez sans cesse, de progrès, de libéralisme, de liberté et de bonheur du peuple ; ouvrez l'histoire des dix ou quinze dernières années du Canada et montrez nous un peuple qui a fait autant de progrès que nous ? Ouvrez encore nos comptes publics, nos budgets annuels, et dites nous où sont allés et à quoi ont servi ces emprunts, ces impôts, ou plutôt ces contributions contre lesquels vous criez tant, pour ameuter notre belle population agricole et ouvrière ?\n\nMais faisons ici quelques considérations sur l'économie politique. Vous ne savez pas, vous autres, messieurs les rouges, ce que c'est que s'endetter pour s'enrichir et développer les ressources d'un pays neuf, afin d'en augmenter la population et la fortune. Vous ignorez également la position géographique du Bas-Canada et les avantages qu'on pouvait tirer de cette position. Vous le savez peut-être, mais vous n'osez le dire au peuple, afin de lui cacher ce qu'ont pu et fait pour lui, les hommes de génie que vous vous acharnez à calomnier. Notre dette publique s'est augmentée considérablement depuis 1850, cela est incontestable ; les impôts indirects prélevés depuis 1850, ont aussi toujours été croissants, cela est encore vrai. Si pourtant, vous vouliez dire au peuple, où sont allés, cette dette et ces impôts toujours croissants, vous savez fort bien que l'on vous répondrait qu'il faut bénir les hommes qui ont su tirer parti des immenses ressources naturelles que possède le Canada. Le pays, et nous parlons surtout du Bas-Canada, était resté pauvre et faible en 1760, lors de la cession du Canada à l'Angleterre. Durant la période de temps qui s'écoula de 1760 à 1850 ou à peu près, la population canadienne-française s'accrut considérablement, mais consomma presque toutes ses forces dans la lutte qu'elle eut à soutenir, pour s'affirmer et jouir de tous les droits que lui conférait le Traité de Cession. En 1850, ou un peu avant, ou un peu après, nous avions acquis la reconnaissance de notre autonomie et de nos droits politiques et civils, de la part de nos compatriotes d'origine étrangère. Ce n'est qu'alors que nous pûmes tourner nos regards vers le développement de nos grandes ressources matérielles et le perfectionnement de nos institutions domestiques. Le regretté Sir L. H. Lafontaine comprit cela, mais ne put qu'inaugurer faiblement l'ère nouvelle. L'honorable George Étienne Cartier, héritier naturel de sa politique arriva quelque temps après et sut comprendre la nouvelle situation, les nouveaux horizons ouverts\ndevant nous et continuer, agrandir et compléter l'œuvre à peine commencée sous Lafontaine, que de regrettables nécessités politiques et une trop grande susceptibilité avaient forcé d'abandonner trop tôt la vie publique. Lors de l'Union, nous n'avions ni système d'éducation, ni chemins vicinaux, ni routes de colonisation, ni chemins de fer, ni navigation, ni canaux en un mot, tout était à créer dans le pays. Consultez les comptes publics et vous verrez à quoi ont été consacrés la dette créée et les impôts prélevés.\n\nLe Canada a donc dépensé et prêté aux municipalités, aux compagnies de chemins de fer et autres, pour améliorations publiques et dans l'intérêt général une somme de $73,909,993, somme qui naturellement ne peut représenter le chiffre de sa dette, vu que plusieurs millions lui sont annuellement et régulièrement remboursés.\n\nCes dépenses et ces prêts ont augmenté et centuplé la richesse publique et privée du pays, en donnant l'élan et un accroissement prodigieux aux intérêts de l'agriculture, du commerce et de l'industrie. En voulons-nous un exemple frappant ; qu'on consulte encore les statistiques.\n\nEn 1850, les produits de l'agriculture exportés, s'élevaient à une somme de $4,237,896 : Douze à quinze ans plus tard, après la complétion de nos voies de communications, nous exportions des mêmes produits pour une valeur de $18,236,476. Et toutes les branches de nos ressources naturelles s'accrurent dans les mêmes proportions ; citons encore par curiosité une couple d'exemples. En fait d'objets manufacturés, la valeur exportée en 1850, était de $26,708 seulement ; en 1865, elle avait monté jusqu'au chiffre énorme de $1,094,714 !\n\nEn 1850, la valeur du bois exporté était de $5,442,937 ; en 1865 elle avait atteint le montant de $14,283,207. Et pendant tout ce temps d'accroissement rapide, l'augmentation de la population canadienne française suivait au moins la même proportion. Il n'est pas besoin d'ajouter que la valeur de la propriété a suivi la même progression ascendante. Tout le monde peut voir ces chiffres comme nous, dans les mille rapports des départements du ci-devant gouvernement canadien.\n\nIl va sans dire encore, que la vente et la colonisation des terres publiques, l'ouverture de nouveaux territoires suivirent de près, sinon dépassèrent ces progrès merveilleux.\n\nLa demande augmentant suivant l'accroissement des produits et l'augmentation de la population, le prix des objets que nous avions à vendre, a, plus que triplé durant la même période. Jadis, l'avoine se vendait de douze à quinze sous par minot et\nun bon ouvrier se considérait heureux d’avoir trente sous par jour ; aujourd’hui la classe agricole et la classe ouvrière, ces deux piliers de tout état, ont vu leur travail quintuplé en valeur ; quelquefois, il a même de beaucoup dépassé cette proportion. Si le Canada s’était endetté pour des objets improductifs, comme par exemple, pour faire une guerre injuste, ou n’acquérir qu’un simple prestige moral, nous comprendrions les alarmes des rouges. Mais, qu’on ne l’oublie pas, le Canada a emprunté pour améliorer et s’enrichir, rien que pour cela. Suivant Jay Cook et tous les économistes remarquables, toute nation qui emprunte ou se taxe, afin de produire plus et d’exploiter ses ressources, naguère improductives, fait un acte de grande sagesse économique, qui doit nécessairement la conduire à la fortune. C’est précisément ce qu’a fait le Canada. Notre pays se trouvait exactement dans la position d’un agriculteur sans capitaux, mais possesseur d’immenses terrains fertiles non défrichés ; si cet homme emprunte pour défricher, égouter et améliorer ses terres, non-seulement il ne s’appauvrit pas, mais il est sûr de s’enrichir considérablement. Ses propriétés une fois améliorées et rendues productives, acquièrent une plus-value au moins égale à la somme empruntée, et les riches rendements qu’elles lui fournissent, ont bientôt payé et les intérêts et le capital emprunté, et au bout de quelques années, notre cultivateur intelligent se trouve propriétaire de beaux domaines dont la valeur s’est au moins doublée et qui lui donne des revenus plus que suffisants pour tous ses besoins. Ou, encore, prenez un de nos artisans canadien-français qui sont si remarquables par leur intelligence et leur assiduité au travail ; cet artisan a un talent plus qu’ordinaire pour la menuiserie, la sculpture ou la peinture ; il possède, en outre, le grand avantage d’une belle réputation de probité, mais il est au début de sa carrière et n’a pas d’épargnes. Si ce jeune homme emprunte de l’argent hypothèque son avenir, il pourra monter une boutique, un atelier muni de tous les instruments nécessaires à l’exploitation de son art ou métier ; il pourra faire de grandes entreprises et en peu d’années, on le citera comme un de nos Crésus. Et pourquoi ? Parce qu’il aura emprunté pour améliorer, pour agrandir la sphère de son action et pour rendre plus productives ses connaissances en mécanique.\n\nNous le répétons, la position financière du Canada est identiquement la même que celle de cet ouvrier, de ce cultivateur entreprenant et industrieux dont nous venons de parler. Le pays possède un actif en propriétés de tous genres, qui représente au moins la valeur de notre dette publique, et, ce qui est\nencore bien mieux, cet actif, ces propriétés fournissent au Canada des revenus considérables qui lui permettent de faire honneur à ses engagements, de payer toutes ses dépenses ordinaires et de consacrer une portion considérable de ces revenus annuels, à encourager par des libéralités vraiment royales, l'éducation, l'agriculture, l'industrie, le commerce, les hôpitaux et institutions de charité, les arts et métiers, en un mot, tout ce qui tend à l'agrandissement moral et matériel d'un peuple.\n\nLes preuves vaudront encore mieux que nos paroles, quelque sincères et véridiques qu'elles soient. En référant aux comptes publics, nous trouvons la classification suivante de notre actif, de nos propriétés, qui toutes, consistent en des travaux publics d'une grande richesse, d'une grande valeur et qui rapportent au pays d'immenses revenus, tout en développant considérablement la richesse privée, ou, en sommes avancées à des compagnies de chemins de fer, ou autres, ou aux municipalités, sommes qui, sans produire un intérêt considérable et direct au gouvernement, augmentent cependant d'une façon prodigieuse, les ressources du gouvernement et du pays en général, par l'essor, le développement et les progrès rapides imprimés à l'industrie, à l'agriculture et au commerce.\n\nVoici donc notre actif :\n\n| Travaux publics, savoir : |\n|---------------------------|\n| Canaux du St. Laurent....... | $7,413,425,48 |\n| Canal Welland................ | 7,386,545,53 |\n| Améliorations du canal Chambly et de la Rivière Richelieu... | 433,807,83 |\n| Canal de la Baie Burlington... | 308,328,32 |\n| Améliorations du Lac St. Pierre | 1,157,235,08 |\n| Travaux d'Ottawa............. | 1,208,368,37 |\n| Amélioration du Trent......... | 558,506,20 |\n| Havres et Phares............... | 2,564,686,70 |\n| Chemins et Ponts.............. | 1,723,697,21 |\n| Bâtisses d'Ottawa (Parlement) | 2,071,095,17 |\n| Prêts au compagnies incorporées | 142,154,52 |\n| Ouvrages et bâtisses divers.... | 1,759,755,98 |\n\nDû par les fonds de bâtisse et du havre | 26,727,606,89 |\n|------------------------------------------| 857,866,64 |\n\nComptes de chemins de faire, savoir :\n\n| Chemin de fer du Grand Tronc | $23,902,403,41 |\n| \" \" \" Great Western.. | 3,727,082,85 |\n| \" \" \" Northern........ | 3,504,526,90 |\n\n31,134,013,16\nMontant rapporté 31,134,013,16\nDû par le fonds de dépôt 890,849,34\nComptes du fonds de prêt municipal 13,255,956,10\n\n$72,866,292,13\n\nNous omettons, pour une valeur de deux ou trois millions de propriétés différentes qu'il serait trop long d'énumérer, mais que nous trouvons dans tous les comptes publics.\n\nNous devons observer pour la deuxième fois, que ce chiffre ne représente pas notre dette publique, qui ne dépasse pas comme nous l'avons dit plus haut $67,000,000, ou $68,000,000.\n\nLa vérité de notre assertion se trouve complètement établie par l'état de notre actif que l'on vient de voir.\n\nComme on l'a, en effet, aperçu, toute notre dette n'a été contractée que pour des améliorations et des travaux publics, ou pour prêter aux compagnies et aux municipalités ; et tout l'argent emprunté est pour ainsi dire retourné dans la poche des contribuables.\n\nN'est-il pas bien misérable celui qui cherche à préjuger, à aveugler le peuple au point de lui cacher les vérités précieuses que nous venons d'exposer, pour lui faire voir, dans les impôts prélevés pour subvenir aux besoins d'une dette aussi profitable, le résultat des intrigues de gouvernements corrompus, prodigues et vénaux ?\n\nIl est vraiment désolant d'avoir à lutter contre de pareils adversaires et de les compter pour compatriotes. Heureusement, le peuple a ouvert les yeux et sait à quoi s'en tenir là-dessus ; il est assez intelligent et assez honnête pour comprendre et avouer, qu'une taxe indirecte, qu'une contribution en quelque sorte volontaire, prélevée pour payer le coût d'améliorations et de travaux qui le font vivre et l'enrichissent, ne lui est ni préjudiciable, ni odieuse, ni nuisible, mais, qu'au contraire, c'est pour lui une obole donnée en échange de la prospérité et de la fortune. Il sait si bien cela, le brave peuple du Canada, qu'il a toujours continué à donner sa confiance aux hommes qui ont fait le pays grand et l'ont lancé sur la voie d'une prospérité inouïe. D'ailleurs, messieurs les rouges, n'est-il pas de la dernière inconvenance pour vous d'essayer à donner au peuple des leçons sur un sujet qu'il comprend bien mieux que vos prétendus grands hommes ; il sait bien, nous pouvons vous l'assurer, qu'il tient les cordons de la bourse publique et qu'il ne peut être taxé sans son consentement. Et cependant, voilà près de vingt ans que vous lui criez à tue-tête, qu'il se laisse écraser de taxes, et vos criaileries n'ont jamais pu l'empêcher d'avoir confiance en nos hommes d'État.\nNous aurions pu, plus facilement, réfuter ou plutôt faire voir les mensonges et l'hypocrisie des rouges ; il ne nous était pas nécessaire d'expliquer tout le mécanisme financier du pays et les causes de notre dette pour prouver que le petit pamphlet rouge ne contient pas un mot de vérité ; si nous l'avons fait, c'était pour réduire une bonne fois pour toutes, à leur juste valeur, les habilleries des rouges à propos de finances et de dette publique, et établir, par des documents irréfragables, l'ignorance crasse ou la mauvaise foi insigne de M. Dorion et de son parti.\n\nNous avions un moyen bien plus simple de les contredire et même de les vouer au mépris. Ces gens ont été quelques mois au pouvoir ; ils ont donc pu réduire la dette publique et faire cesser les impôts, eux qui ont tant crié contre la dette et les taxes. Eh bien ! le croira-t-on, loin de là, ils ont augmenté la dette publique et les impôts durant leur courte administration. Ouvrez les comptes publics de 1863, signés par le ministre des finances rouge, et vous y verrez que ces faux libéraux, ces sépulchres blanchis, ces ignobles charlatans, ont créé dans les revenus un déficit de $2,764,536, et ont, par conséquent, augmenté notre dette publique d'autant. Cela se voit à la page III des comptes officiels de 1863. Qu'on lise encore les estimés de l'année 1863, pour le service de 1864, on y verra encore comment les Rouges entendaient le progrès et l'amour du peuple : ils ont diminué les octrois de vingt pour cent sur l'éducation dans le Bas-Canada, de vingt-cinq pour cent sur la colonisation et de vingt-cinq pour cent sur les hôpitaux et les institutions de charité. Ils ne se sont pas contentés de réduire les octrois les plus favorables au peuple, ils ont voulu encore établir de nouvelles taxes qui retombaient principalement sur le pauvre peuple :\n\nPar année.\n\nPour le droit de manufacturer du tabac.......................... $100.00\nPour permission de faire usage de presses à tabac, par presse ......................................................... 20.00\nPermission de faire usage de machines à couper le tabac, chaque machine........................................... 20.00\nPermission de faire usage de moulins à tabac en poudre, chaque moulin............................................. 15.00\nPour droit de vendre du tabac en gros.............................. 20.00\n\" \" \" en détail.................................................. 5.00\nSur chaque livre de tabac haché, en torquettes ou pressé, etc., manufacturé dans le pays.................................. 0.10\nSur chaque livre de tabac moulu.................................... 0.10\n\" \" \" haché et uniquement composé de tiges.......................................................... 0.05\nSur toute autre description de tabac par livre.............. 0.10\nPour le droit de tanner le cuir, par année.................. 50.00\nPour l'usage de chacune des fosses, par année............... 1.00\nPour le droit de vendre le cuir en gros, par année......... 20.00\n\" \" \" \" en détail.......................... 5.00\nSur chaque livre de cuir de veau............................ 0.06\n\" \" \" \" à empeigne.................................. 0.05\n\" \" \" \" à semelle, cuir fendu et cuir à\nharnais.................................................. 0.04\nSur chaque livre de toute autre espèce....................... 0.05\nSur chaque livre de cuir importé, en sus des droits act.. 0.03\n\nIl faut donc que les rouges aient beaucoup pillé, beaucoup corrompu et beaucoup volé, pour nous servir de leur style élégant!\nIls ont augmenté les taxes et appauvri ce pauvre peuple qu'ils aiment d'un véritable amour de crocodile, ils ont retranché les octrois faits pour le peuple et malgré cela, leur administration prodigue ou malhonnête a atteint un déficit d'au-delà de $2,000,000.\n\nPour donner une idée de leurs principes rigides, voyons une petite colonne de ce qu'ils ont gaspillé et volé.\n\nQuelques-unes des dépenses inutiles ou injustifiables faites par le gouvernement rouge en 1862, 1863 et 1864.\n\nOctroi additionnel inutile pour les édifices d'Outaouais.$100,000\nExcès de dépense sur le chemin Matapédia.................. 50,000\nPayé de trop aux vapeurs transatlantiques.................. 392,000\nPayé pour le service des remorqueurs, offert pour rien. 16,000\nPayé pour le chemin du nord-ouest, en dehors du Canada.................................................. 50,000\nPour achat de la voix d'un membre.......................... 32,640\nPour l'exploration du chemin de fer intercolonial que le gouvernement ne voulait pas faire.......................... 10,000\nCommissions d'enquête pour persécuter les employés conservateurs et caser les affamés ou banqueroutiers rouges, tels que Dessaulles et autres...................... 100,000\n\nTotal.....................................................$750,640\n\nLes choses allant ce train, le pays courait vers sa ruine; et si les rouges n'eussent pas été balayés du théâtre, ils auraient certainement amené la banqueroute avant trois ans.\n\nOn vient de voir qu'ils ont été malhonnêtes; on va maintenant se convaincre au-delà de tout doute, qu'ils sont les plus hideux hypocrites que jamais parti politique ait produits. Dans leur petit pamphlet en question, ils posent en amis du peuple et font\nsemblant de s'apitoyer sur son sort parce qu'ils le voient d'avance écrasé sous le fardeau des taxes directes et indirectes, nécessitées par la Confédération, et ils entassent chiffres sur chiffres, mensonges sur mensonges, calomnies sur calomnies, pour le soulever contre le parti conservateur, qui a tant fait pour le bien du pays. Et pourtant, ces mêmes hommes en septembre 1863, voulaient imposer la taxe directe dans ce pays, afin de prélever assez d'argent pour satisfaire leur rapacité ou gorger leurs nécessiteux.\n\nL'hon. L. Holton, ministre des finances de l'administration McDonald-Dorion, disait en chambre à cette époque (septembre 1863), aux applaudissements de tous les rouges :\n\n\"J'incline à croire, que nous pourrions avec beaucoup d'avantages, alléger le fonds général du pays, d'un nombre considérable d'items importants, laissant aux municipalités à les fournir au moyen d'une taxe locale. Nous devons aborder la question des taxes courageusement en face, et le moyen d'y arriver, c'est de familiariser le peuple avec la taxe directe, dont je viens de parler. Si plusieurs de ces items, qui sont d'un caractère strictement local, étaient payés à l'aide d'une taxe locale imposée par les municipalités, nous aurions fait par là, un grand pas vers un système rationnel de taxes.\"\n\nLes commentaires sont inutiles, après ce que l'on vient de voir, et si d'ailleurs, nous voulions parler, l'expression nous manquerait pour flétrir du stigmate de l'infamie, le front d'airain de ces gens, qui, après avoir pillé et volé le peuple, après avoir même osé parler de taxes directes pour le mieux pressurer, viennent maintenant outrageusement courtiser les faveurs de ce même peuple, lui mentir insolemment et le menacer de taxes lourdes et directes, qui seront impossibles sous le nouvel état de choses.\n\nNous n'avons pas cru devoir encore aborder la question des Finances de la Confédération elle-même, c'est-à-dire du gouvernement fédéral. Les ressources se composeront des ressources jadis possédées par chacune des provinces, excepté celles qui sont spécialement exemptées pour l'usage propre de ces provinces, comme on l'a vu plus haut. Toutes les dettes des provinces sont mises à sa charge et le Bas-Canada se trouve enfin libéré de sa dette qui a tant fait crier les rouges, à l'exception des trois ou quatre millions dont nous avons déjà parlé. Nous ne pouvons, en aucune façon être appelés à contribuer aux dettes du gouvernement général : on sait la clause qui empêche ou prohibe toute taxation pour cette objet imposée sur nos terres. Il nous est donc inutile de toucher cette question. Mais comme nous tenons avant tout à faire un livre utile, nous allons citer les\nclauses qui établissent les ressources, le passif et l'actif du gouvernement fédéral :\n\n102. \"Tous les droits et revenus que les législatures respectives du Canada, de la Nouvelle-Écosse et du Nouveau-Brunswick, avant et à l'époque de l'union, avaient le pouvoir d'approprier,—sauf ceux réservés par le présent acte aux législatures respectives des provinces ou qui seront perçus par elles conformément aux pouvoirs spéciaux qui leur sont conférés par le présent acte,—formeront un fonds consolidé de revenu pour être approprié au service public du Canada, c'est-à-dire de la confédération ou plutôt gouvernement fédéral de la manière et soumis aux charges prévues par le présent acte.\"\n\n104. \"L'intérêt annuel des dettes publiques des différentes provinces du Canada, de la Nouvelle-Écosse et du Nouveau-Brunswick, lors de l'union, constituera la seconde charge sur le fonds consolidé de revenu du Canada, c'est-à-dire, du gouvernement fédéral.\"\n\n108. \"Les travaux et propriétés publics de chaque province, énumérés dans la troisième cédule annexée au présent acte, appartiendront au Canada, n'oublions pas que Canada veut dire ici \"Gouvernement Fédéral.\"\n\nVoici cette troisième cédule :\n\nTROISIÈME CÉDULE.\n\n\"Travaux et propriétés publiques de la province devant appartenir au Canada.\n\n\"1. Canaux avec les terrains et pouvoirs d'eau y adjacents.\n\"2. Havres publics.\n\"3. Phares et quais, et l'île de Sable\n\"4. Bateaux à vapeur, dragueurs et vaisseaux publics.\n\"5. Améliorations sur les lacs et rivières.\n\"6. Chemins de fer et actions dans les chemins de fer, hypothèques et autres dettes dues par les chemins de fer.\n\"7. Routes militaires.\n\"8. Maisons de douane, bureaux de poste, et tous autres édifices publics, sauf ceux que le gouvernement du Canada destine à l'usage des législatures et des gouvernements provinciaux.\n\"9. Propriétés transférées par le gouvernement impérial, et désignées sous le nom de propriétés de l'artillerie.\n\"10. Arsenaux, salles d'exercice militaire, uniforme, munitions de guerre, et terrains réservés pour les besoins publics et généraux.\"\n\nIII. Le Canada (savoir le gouvernement fédéral) sera responsable des dettes et obligations de chaque province existantes lors de l'Union.\"\n\nL'honorable M. Galt, dans ce langage si lucide et si magnifique qu'on lui connaît, a fait voir que la Confédération, avec ces ressources mises à sa disposition, serait en état de subvenir amplement à toutes les exigences du gouvernement fédéral. Nous en faisons les quelques citations suivantes :\n\n\"Notre dette totale, à part le fond des écoles communes qui\nne forme pas à proprement parler une partie de nos engagements, vis-à-vis des provinces d'en-bas, s'élève à $67,208,995.\n\n\"L'hon. A. A. Dorion—le chiffre de $67,263,995 auquel on porte la dette du Canada, couvre-t-il la première indemnité seigneuriale accordée au Haut et au Bas-Canada sous l'acte de 1854 ?\n\n\"L'hon. M. Galt.—Oui, ce montant couvre l'indemnité en question, et au nombre des arrangements que le gouvernement a en vue, supposant toujours que la confédération ait lieu, il se propose de soumettre à la considération de cette chambre un projet tendant à faire assumer au Bas-Canada l'indemnité seigneuriale réglée par l'acte de 1859 ; l'effet de ce projet sera de rendre inutile l'obligation de donner une indemnité équivalente au Haut-Canada, ce qui opérera une économie de près de $3,000,000.\n\n\"Il est maintenant de mon devoir de soumettre à la chambre un aperçu des ressources que les différentes provinces peuvent apporter au fonds commun, et je suis en mesure d'ajouter, que dans le but de pouvoir plus facilement vérifier l'exactitude de cet aperçu, j'ai pris pour base de mes calculs les rapports publics sur les finances de 1863. De l'étude de ces documents, il ressort que les revenus et les dépenses des différentes provinces pouvaient, cette année-là, se décomposer comme suit :\n\n\"La Nouvelle-Ecosse, avec une population de 338,857, avait des revenus de $1,185,629, et des dépenses s'élevant à $1,072,274 ;\n\"le Nouveau-Brunswick avec une population de 252,047, avait des revenus de $894,836, et des dépenses s'élevant à $884,613 ;\n\"Terre-neuve, avec une population de 130,000, avait des revenus de $480,000, et des dépenses s'élevant à $479,420 ; l'Ile du Prince Édouard, avec une population de 80,000, avait des revenus de $197,384, et des dépenses s'élevant à $171,718.\n\n\"Le revenu total de toutes ces colonies se montait à $2,763,004, et la dépense totale à $2,608,025 : l'excédant réuni sur les dépenses de 1863, étant de $154,979 ; l'on pourra remarquer, en ce qui concerne ces provinces, que leurs revenus et dépenses sont tels qu'ils étaient en position de pouvoir faire partie de la confédération, dans une situation financière nullement inférieure à celle du Canada. Si l'on prenait objection à une province, en particulier, sur le principe de sa situation financière, la première à coup sûr serait le Canada. Les provinces maritimes ont été et sont actuellement en position de faire face, au moyen de leurs taxes, à toutes leurs dépenses, et ne peuvent être considérées comme apportant aucun fardeau au peuple du Canada. Il devient inutile que je parle en cette occasion de\n\"la situation financière du Canada en 1863, mais je ne doute pas que la chambre apprendra avec un vif plaisir que le déficit, qui, malheureusement existait cette année-là, a été comblé en 1864, et que, conséquemment, nous ne nous verrons pas dans la dure nécessité d'occuper dans la confédération une position inférieure, sous ce rapport, à celle de nos soeurs colonies.\"\n\n\"L'hon. A. A. Dorion.—Le Bas-Canada devra donc assumer le fonds d'emprunt municipal, l'indemnité seigneuriale et la subvention scolaire.\"\n\n\"L'hon. M. Galt.—Je le repète, quelque soit l'opinion du gouvernement au sujet de la répartition des obligations existantes entre le Haut et le Bas-Canada, la chambre pourra en ce cas apporter toutes les modifications qu'elle jugera à propos, vu qu'il ne s'agit ici que d'un arrangement local, qui ne concerne en rien la convention passée avec les autres provinces; mais je dois insister en ce qui se rattache à la première indemnité seigneuriale, ainsi qu'au fonds d'emprunt municipal, sur le fait que ces deux items sont compris dans les soixante-sept millions auxquels, comme il a déjà été dit, se montent les obligations du Canada, et que conséquemment ils ne sauraient être imputés au Bas-Canada; il est de fait qu'en ce qui concerne le fonds d'emprunt municipal au lieu de le porter au passif, il appert que les sommes payées sous ce chapitre, doivent être, au point de vue sous lequel j'envisage actuellement la question, considérées comme actif, parce que nous sommes en ce moment occupés à examiner les sommes que le Bas-Canada reçoit comme actif; or, comme le fonds d'emprunt municipal est compris sous ce chapitre, les sommes qui sont dues à ce fonds en vertu des arrangements en existence seront payables à titre d'actif à cette section de la province; l'on ne manquera pas d'observer que dans le projet sous considération certaines sources du revenu local, provenant du domaine territorial, des terres, des mines, etc. sont réservées aux gouvernements locaux. Le Canada devra retirer une somme considérable de ces sources.\"\n\nQuelle mauvaise foi chez les rouges? N'est-il pas clair comme le jour que l'union double les forces? Plus il y aura de provinces réunies ensemble, plus les revenus seront considérables, plus les entreprises et les améliorations seront grandes, plus, conséquemment, grandira la richesse privée, seule base de la richesse publique. Ce que le Bas-Canada seul n'a pu faire, nous l'avons fait avec le Haut-Canada; et ce que les deux Canadas n'ont pu et ne pouvaient faire ensemble, la confédération le fera parce\nqu'elle aura des débouchés et des ports de mer que nous n'avions pas.\n\nNous demandons pardon au lecteur, de nous être étendu si longuement sur cette question des Finances ; les rouges ont tant fait, pour l'embrouiller, que nous avons cru devoir essayer de la traiter à fonds, pour leur ôter jusqu'à ce dernier prétexte d'argent et de taxes, avec lequel ils prétendaient soulever le peuple.\n\nLA CONFÉDÉRATION JUGÉE PAR SES ENNEMIS.\n\nUn bon thermomètre pour juger des avantages de la confédération, c'est l'étude des gens qui l'opposent depuis qu'elle est devenue fait accompli. Dans le Bas-Canada, il n'y a que deux journaux français qui la combattent. Le Pays de Montréal et le Journal de St. Hyacinthe. Nous ne parlons pas de l'Union Nationale, qui n'est pas un journal, ni de son rédacteur-en-chef, qu'on ne peut décentement introduire dans une discussion sérieuse ; ce n'est qu'un petit bonhomme sans tête et sans âme, qui ne sait que crier et vociférer, pour faire parler de lui et se vendre un prix raisonnable. Nous ne mentionnons que pour mémoire, l'Ordre de Montréal qui a naturellement droit à nos sympathies, à cause de l'infirmité de son rédacteur et de son propriétaire ; ce n'est pas leur faute, si leur feuille n'a ni esprit, ni caractère, ni couleur ; c'est un journal qui s'en va et qui cherche à faire oublier ses anciennes alliances de mauvais aloi, pour passer plus aisément dans le camp qui pourra le mieux payer, lorsque le désabonnement complet se sera opéré, affaire de quelques mois. Le Pays et le Journal de St. Hyacinthe, quoiqu'encore moins respectables, ont cependant, un caractère tranché ; c'est, si vous le voulez, un caractère sali, comme celui de leurs rédacteurs. On sait ce qu'ils veulent ; ils combattent la confédération ouvertement et avec ardeur et désirent vivement l'annexion ou la vente en bloc aux États-Unis. La nationalité canadienne française et la religion catholique sont pour eux des friperies dignes d'être jetées aux orties, comme l'ancien froc de Mr. Lusignan, dont le plus amer regret est d'avoir porté la soutane et de devoir son éducation à la générosité du Séminaire de St. Hyacinthe. Brave garçon d'ailleurs, qui a cru devoir témoigner sa reconnaissance à la maison qui l'avait nourri charitablement du pain de l'intelligence, en se faisant le délateur de ses anciens professeurs et le valet de Dessaulles. C'est là, le rédacteur du principal organe du parti rouge.\n\nIl a encore à la notoriété d'autres titres que nous voulions passer sous silence pour ménager sa modestie. C'est un bravi de la plume, un bandit du journalisme, devrions-nous ajouter s'il\nétait moins lâche. Il a été très vite dans le métier et si loin qu’un tribunal a récemment décidé que ça ne coûtait plus que cinq piastres pour flageller le petit Lusignan jusqu’au sang. De M. Lusignan, on pourra donc dire après sa mort, qu’il a passé en méritant et recevant des coups de cravache. Le Pays a encore pu baisser depuis Dessaulles qui, lui, se battait au moins avec des pistolets vides, et a vu son honneur coté à $100!!! C’est donc une buisse de 95 par cent pour le pauvre petit, sans les soufflets. Ce que c’est que le progrès compris et pratiqué par les disciples de Dessaulles !\n\nLe Pays et le Journal de St. Hyacinthe sont les continuateurs de l’Avenir, journal fondé en 1847, par une clique de jeunes voltairiens qui voulaient ruiner le catholicisme en Canada et annexer leur patrie aux États-Unis, pour être plus sûrs d’anéantir l’influence cléricale.\n\nL’Avenir, le premier organe de M. Dorion a publié les odieuses lignes qui suivent :\n\n\"Le règne des prêtres a commencé au règne des Pharaons dans les sept années de famine. Les prêtres s'emparèrent des biens du peuple et le tinrent dans l'ignorance et la misère afin de le dominer. Les prêtres, dans tous les temps, ont su tirer partie de la faiblesse inhérente à notre nature pour dominer et satisfaire leurs passions.\n\nUne république démocratique n’a pas besoin de prêtres. Les prêtres de l’antiquité n’étaient pas chrétiens à la vérité, MAIS LA RELIGION DU PRÊTRE NE FAIT RIEN DU TOUT À L’AFFAIRE. Le clergé, dans le moyen-âge, avait su amener le peuple à cet état de complète ignorance ! . . . . Le clergé est venu à bout d’effacer presque complètement toute trace de civilisation romaine.\"\n\nLe même journal qui ne voulait ni Papes, ni Prêtres a encore publié ces infamies :\n\n\"AUCUN DES DEGRÉS DE LA HIÈRARCHIE ECCLÉSIASTIQUE N’EST EXEMPT DES VICES QU’ENTRAINE L’AMOUR DU POUVOIR ET DES RICHESSES.\n\nL’histoire de la papauté pendant une suite de siècles, EST L’HISTOIRE DE TOUS LES CRIMES QUI DÉSHONORENT L’HUMANITÉ.\"\n\nNous pourrions continuer à l’infini les citations ; ces deux doivent suffire pour nous prouver que dès le début, le parti rouge était l’ennemi juré de la religion et de son clergé. Nous frémissons à la pensée que, quelques-uns de nos compatriotes, aient pu écrire, que nous devions nous dispenser de prêtres.\n\nQui n’a entendu parler du notoire Dessaulles, dont les Six Lectures sur l’annexion du Canada aux États-Unis ont fait les délices des rouges et ont été en partie reproduites et chaudement approuvées par tous leurs organes.\n\nDepuis qu’il est tombé du Conseil Législatif, dans un sinécure à la Cour de Police et qu’il a montré le niveau de son caractère,\ndans la conspiration sans nom qui l’a fait descendre là, on ne s’occupe plus de lui si ce n’est pour gémir sur cette ruine morale.\n\nMais, dans le temps, il avait la vogue dans la secte voltairienne et ses rapsodies faisaient autorité ; elles étaient d’ailleurs en conformité avec les principes du Parti. Il sera instructif de reproduire quelques lignes de ses lectures :\n\nÀ la page 14 l’auteur y dit :\n“La civilisation, cette puissance à part, dans le monde, qui a tiré l’humanité de l’état de barbarie, d’ignorance et de dépradation dans lequel le christianisme lui-même n’avait pas pu l’empêcher de tomber.”\n\nCe n’est que le commencement, on ne fait qu’y insinuer l’impuissance du catholicisme.\n\nPlus loin, il en vient à l’attaque brutale et il fait passer le rationalisme comme élément civilisateur, bien avant le christianisme qu’il essaie de flétrir, sous le nom d’ultramontanisme. Ce morceau mérite d’être cité ; il cadre parfaitement avec les deux extraits de L’avenir que l’on connaît déjà.\n\n“Enfin, messieurs, dit-il, la civilisation a trouvé dans le monde le principe de l’égalité native des hommes entre eux que le christianisme y avait implanté ; mais elle a vu bientôt l’ultramontanisme Romain refuser d’admettre les conséquences de ce principe, et consacrer théoriquement et pratiquement, l’asser- vissement de l’intelligence, et conséquemment la dépendance morale et politique de l’individu.”\n\n“Alors la civilisation a imprimé au monde un mouvement différent. Elle a protesté contre la réaction ultramontaine, et ne pouvant l’éclairer ni la faire sortir de son immobilité systéma-tique, elle l’a laissée loin derrière elle et l’a, de fait, reléguée sur le dernier plan où elle occupe aujourd’hui une position analogue à celle de ces poudreux et vénérables bouquins que l’on conserve encore, pour mémoire, sur les rayons de nos bibliothèques.”\n\nÀ la page 15, se place une insulte au clergé canadien :\n“En Canada seulement comme l’indépendance et conséquem- ment la liberté politique n’existent pas encore, la hiérarchie refuse de reconnaître le dogme de la souveraineté du peuple et lui a déclaré une guerre à mort.\n\n“Mais aussi comme il est excessivement probable que, du moment que l’heure de la liberté aura sonné, pour le pays, elle le proclamera avec force saluts et bénédictions, laissons la exhale une mauvaise humeur qui entre peut-être, qui sait, dans les vues de la Providence, et qui n’entravera pas d’un iota la mouche des événements.”\nA la page 17, il s'attaque violemment et en style vulgaire à la pauvreté qu'il calomnie et qu'il injurie, comme lui seul possède le secret de le faire :\n\n\"En Europe, messieurs et en Europe seulement, je vois trois hommes, soutenus par quelques centaines de privilégiés, tendre leur bras en avant pour faire rétrograder les générations.\n\n\"Trois hommes y luttent encore, au moyen des proscriptions, des cachots, de l'exil, de l'échafaud, des meurtres juridiques des trahisons achetées, de la séquestration intellectuelle, de l'ignorance imposée aux masses, des excommunications, anathèmes contre le principe fondamental, nécessaire, indéniable de toute organisation sociale régulière.\"\n\n\"Ces trois hommes, vous les connaissez comme moi. C'est sa majesté, l'Empereur d'Autriche, l'infâme bourreau de la Hongrie et de l'Italie ! C'est sa majesté le Czar de toutes les Russies, l'infâme bourreau de la Hongrie, de la Pologne et de la Circassie ! C'est enfin leur ami et allié, le roi de Rome, le chef visible du catholicisme.\n\n\"Voilà, messieurs, les seuls représentants du despotisme dans le monde civilisé ! Voilà la glorieuse alliance que la hiérarchie Italienne a ménagée au père commun des fidèles ! Voilà le sort qu'elle lui a fait ! Voilà le résultat de la victoire remportée sur l'évangile et sur le christianisme démocratique des premiers siècles, par la sacristie et le capuchon inquisitorial.\n\n\"Ces trois hommes ne se sont maintenus politiquement jusqu'à notre époque, qu'en prospérant la presse, qu'en dégradant le sentiment national, qu'on étouffant chez les masses humaines qu'ils oppriment, le flambeau de l'intelligence ; qu'en les séquestrant sévèrement de tout contact, moral avec les autres peuples. Ils se sont faits chacun dans les limites de leurs états respectifs, les géoliers de la civilisation.\"\n\nIl continue sur le même ton ; nous voulons citer sa dernière tirade qui finit par un appel déguisé au poignard de Mazzini et un petit soupir comprimé pour la chute ou l'assassinat du Pape :\n\n\"Eh bien, messieurs, s'écrie-t-il qu'elle est la qualification qui convient à un gouvernement qui considérerait comme son droit, la proscription de la pensée, comme une de ses plus importantes occupations, la saisie des enveloppes salies et chiffonnées des voyageurs ? Heureusement pour les peuples, ce despotisme abject et brutal ne sera pas encore longtemps possible.\"\n\nC'était à la veille des tristes événements de 1849 ; c'était dans le temps où l'illustre Pontife se préparait à donner, où il avait même commencé à accorder des institutions libérales à son\npeuple, que le courageux L. A. Dessaulles, écrivait ces lignes qui resteront son éternelle flétrissure. Peu de temps après, le Pape fuyait devant les hordes Mazziniennes, et son ministre Rossi tombait sous les coups des libres penseurs et des affidés aux sociétés secrètes.\n\nL'Avenir, se réjouit de ces horreurs et les approuva, et tout le parti rouge se rangea du côté des assassins, contre la sainte victime qui priait à Gaète pour ses bourreaux. Il y eut même, orgie des rédacteurs de l'Avenir, au restaurant Compain, pour célébrer la victoire des bourreaux auxquels le Pape n'échappa que par miracle.\n\nTirons le voile sur ces hontes et sur ces ignominies ; l'expiation a déjà commencé pour quelques-uns de ces malheureux rouges et elle arrivera infailliblement pour les autres. Ces crimes sont de ceux que la colère divine ne laisse jamais impunis.\n\nSi nous avons rappelé ce honteux passé des rouges, ce baptême sanglant qu'ils se sont eux-mêmes donné, ce n'est pas pour flageller M. Dessaulles en particulier. Pour lui, le châtiment est déjà venu et a été complet. Sa réputation et sa fortune y ont passé ; son intelligence, qui était pû quelque chose, s'est rétrécie en pervertissant son cœur, et aujourd'hui M. Dessaulles n'est plus qu'un pensionné du gouvernement, qui exhale sa haine impuissante et son désespoir de n'être plus rien, à la face de ceux qui le nourrissent et le laissent faire par pitié.\n\nIl est donc inutile de le combattre, puisqu'il suffit, que son nom soit attaché à un écrit quelconque, pour soulever la dérision et le mépris du public.\n\nIl nous a fallu exhumer de l'oubli, ces pages néfastes, pour faire connaître l'origine et les aspirations du parti rouge. Elles constituent un témoin et un accusateur irréprochables, parce qu'elles ont reçu la sanction et l'approbation de tous les rouges marquants, et qu'elles ne sont d'ailleurs que la reproduction, sous diverses formes, des idées et des principes que propageait l'Avenir.\n\nIl était naturel que M. Dessaulles, après avoir insulté à la papauté, tournât ses regards vers le clergé canadien, pour essayer de le salir de sa haine Voltairienne. Il trouve défectueux et immoral l'enseignement donné par le clergé et lui administre une leçon polie dont nous donnons un échantillon à nos lecteurs :\n\n\"Nous avons pleinement le droit de lui dire : Votre système ne nous convient plus ; il entrave notre développement intellectuel et industriel ; il n'est pas adopté à notre situation politique ni à notre avenir national : au point de vue social, il n'est pas à la hauteur de l'époque. Voilà pourquoi, nous allons par nos propres moyens en créer un autre, séculariser\nl'enseignement, afin de nous affranchir de votre tutelle morale ;\ndoter une ou plusieurs universités avec les biens des jésuites\nqui n'ont servi jusqu'à présent qu'à exciter vos convoitises et\ndont le gouvernement responsable ne s'est servi que pour faire\nde l'intrigue.\"\n\nÀ la fin de sa dernière lecture, M. Dessaulles veut les institutions démocratiques pour le Bas-Canada, vu \"qu'elles seraient\nla plus sûre sauvegarde de notre nationalité, comme le meilleur\nrefuge contre l'intolérance religieuse.\" (Lisez l'intolérance catholique.)\n\nPauvre homme !\n\nImpiété, haine du catholicisme, annexion, voilà l'essence des conquêtes demandées par les rouges. Ils n'ont pas dégénéré. Ils se sont dès leur début alliés aux fanatiques du Haut-Canada et Brown fut leur dieu.\n\nEn 1852, M. Brown disait dans le Globe, son journal :\n\n\"Le Papisme dans son essence est complètement opposé à la liberté civile.\"\n\nDans la même année, il disait encore :\n\n\"Si les prêtres papistes, inculquaient cette doctrine, leurs revenus cesserait. Les Messes, Vieux os, Vieilles guenilles et les Reliques seraient tout à la fois rejetées par les fidèles et le Papisme mourrait de sa propre pourriture.\"\n\nVoici ce que l'on lit encore sur le \"Globe\" du 18 Février 1866 :\n\n\"Dans quelques mois, on pourra voir émaner de Rome une bulle qui avec l'aide et l'assentiment de notre Gouvernement, va inonder le pays de cette population (irlandais catholiques) et nous affliger ainsi d'une plaie aussi dangereuse que les sauterelles pour la terre d'Egypte, &c., &c., &c.\"\n\nLe 7 Août 1857, Brown publiait dans son journal les paroles suivantes, que l'on dirait copiées de l'Avenir :\n\n\"Une pensée absorbe et ramène le plus chétif membre du Clergé Catholique,—c'est que, tout infime qu'il soit, lui insecte venimeux se traînant dans les crevasses et les parties en ruine de l'édifice social, il est cependant un associé de cette effroyable conspiration qui, depuis des siècles et avec des succès différents, n'a cessé de travailler à miner les institutions libres et à étouffer les progrès de l'humanité.\"\n\nCanadiens-Français, et catholiques, lisez, si vous le pouvez, sans frémir, cet article du \"Globe\" du 4 Juillet 1857!!!\n\n\"L'ignorance et la dégradation des prêtres offrent la partie la plus obscure du tableau. Sortis des derniers rangs de la pauvreté, il est notable qu'ils sont ignorants et dégradés. L'idée de leur dégradation est même si enracinée partout, que lorsqu'un enfant est indomptable et que ses parents n'ont pu réussir à lui faire entreprendre quelque carrière honnête, ils considèrent souvent alors l'état ecclésiastique comme leur dernière et unique ressource.\n\"Ce fait peut être consigné dans un dicton qui peut être rendu ainsi :\nEst-il vicieux, ignorant, glouton comme la brute,\nIl ne nous reste plus que d'en faire un prêtre.\n\nVoici maintenant ce qu'il pense des Canadiens-Français en particulier. (Globe du 10 Juin 1852) :\n\n\"Le départ de quelques canadiens-français pour les États-Unis n'aura que peu d'effet sur toute la Province ; mais, si toute cette race émigrait en corps, il en résulterait une plus grande force pour l'influence anglaise. La vérité est que les Canadiens sont un obstacle réel pour le fonctionnement des institutions Anglaises, &c.\n\nVoici un renseignement précieux à récuciller et que nous tirons d'un journal bien informé et des Rapports Parlementaires. Les Rouges voulaient mettre en pratique leurs principes sur l'éducation et restreindre la sphère des Collèges :\n\nEn 1854, il fut question en Chambre d'incorporer le Collège Masson. M. Hartman proposa la motion ci-dessous :\n\"Que la dite corporation n'aura point le pouvoir d'acquérir ou posséder aucuns immeubles, excepté ceux qui pourront être nécessaires pour l'usage du dit College.\"\n\nCette motion mettait en suspicion l'honnêteté et l'intégrité des Directeurs du Collège Masson. Elle insinuait très clairement que ceux-ci pourraient acquérir des propriétés et les employer à d'autres fins qu'aux fins de l'éducation. Malgré cela, MM. Dorion, Holton et deux ou trois de leurs suivants votèrent pour la motion, en compagnie de George Brown.\n\nEn 1856 les rouges avaient encore progressé et demandaient les Ecoles sans Dieu, ni religion. Lisons la fameuse motion Papin, appuyée de Dorion et de tous ses adeptes :\n\n\"Qu'il est désirable d'établir dans toute la province, un système général et uniforme d'éducation élémentaire gratuite et MAINTENUE ENTIÈREMENT AUX FRAIS DE L'ÉTAT, par le moyen d'un fonds spécial qui serait créé à cet effet.\n\n\"Que pour faire fonctionner ce système d'une manière JUSTE et AVANTAGEUSE il sera nécessaire que toutes les écoles ainsi établies, soient ouvertes indistinctement à tous les enfants en âge de les fréquenter, SANS QU'AUCUN D'EUX SOIT EXPOSÉ PAR LA NATURE DE L'ENSEIGNEMENT QUI Y SERA DONNÉ, À VOIR SES CROYANCES OU OPINIONS RELIGIEUSES VIOLENTÉES OU FROISSÉES EN AUCUNE MANIÈRE.\"\n\nSans la réprobation énergique de nos Évêques et de notre clergé le parti rouge, M. Dorion en tête, nous aurait déjà, de concert avec M. Brown, imposé depuis longtemps un système d'écoles communes d'où l'enseignement religieux eut été complètement banni, et nos enfants seraient devenus suisses, comme Blanchet ou impies vulgaires, comme les Fontaine du Journal de St. Hyacinthe, les Lusignan et les Dessaulles. Sûrement que nous serions bien avec des gens comme ça, pour moraliser une population et défendre la patrie !\nLe parti rouge ne se contenta pas de désirer l'annexion aux États-Unis, comme l'un des meilleurs moyens de ruiner l'influence cléricale, et noyer la nationalité canadienne françaises; voyant que les américains retardaient beaucoup à s'emparer du pays, ils eurent recours de bonne heure à la représentation basée sur la population; dès le 12 août 1852, le Pays écrivait déjà:\n\n\"LE SUFFRAGE UNIVERSEL; LA REPRÉSENTATION BASÉE SUR LA POPULATION: l'abolition de la qualification des représentants; le Conseil Législatif électif mais par tous les citoyens; tous les officiers ayant une autorité sur le peuple électifs; tel est un échantillon des réformes véritables que nous demandons.\"\n\nLe 26 août de la même année, le même Journal disait encore:\n\n\"Le principe de la représentation basée sur la population, EST JUSTE D'UNE JUSTICE ABSOLUE. Nous y tenons maintenant comme ci-devant; et nous répétons QUE LA REPRÉSENTATION N'EN EST PAS UNE, SI ELLE N'A PAS LA POPULATION POUR BASE.\"\n\nMais d'abord qu'on oublie pas que le Pays avait succédé à l'Avenir, anciant par la banqueroute et l'opinion publique. Les mêmes hommes et les mêmes principes présidaient à l'esprit et à la rédaction du Pays, la seule différence entre l'Avenir et le Pays, c'est que ce dernier fut à son début moins grossier et moins brutale à l'égard du clergé et des principes catholiques. On voulait duper le peuple et voler sa confiance à l'aide de formules moins compromettantes. Mais l'on a vu, depuis le commencement de la guerre d'Italie (1859) que le Pays n'est toujours resté que l'Avenir; il a toujours été du côté de Mazzini et de Garibaldi. Sa guerre contre le saint évêque de Montréal, à propos de l'Institut-Canadien et la reproduction, avec éloge, et approbations, dans ses colonnes, des diatribes de Dessaulles, contre le séminaire de St. Hyacinthe et ses prêtres les plus éminents, ont complété plus que suffisamment, la preuve que ce journal, n'est que le digne continuateur de l'Avenir. Revenons à la question de la représentation basée sur la population.\n\nEn 1857, l'Hon. A. A. Dorion disait:\n\n\"Si l'Union actuelle doit continuer d'exister, elle ne peut exister qu'avec la représentation basée sur la population. Je considère que c'est le seul système juste.\n\n\"Je préfère une union fédérale, mais après cela, JE PRÉFÈRERAI A L'ORDRE DE CHOSES ACTUEL LA REPRÉSENTATION BASÉE SUR LA POPULATION;—et je voterai pour cela, si après l'avoir tenté, je ne puis obtenir l'union fédérale.\"\n\nEn 1858, M. Dorion, dans son adresse aux électeurs de Montréal, s'exprimait ainsi:\n\n\"La discussion suggéra bientôt qu'au moyen de changements constitutionnels accompagnés de restrictions et de garanties suffisantes pour la\nprotection des intérêts et des institutions de chaque section de la province, ou par l'application du principe fédéral à notre système de gouvernement, il était possible de préparer une mesure qui rencontrât l'approbation du Haut et du Bas Canada, TOUT EN ADOPTANT LA POPULATION COMME BASE DE LA REPRÉSENTATION.\"\n\nL'on se rappelle que le ministère Brown-Dorion, pour se dédommager de son court passage au pouvoir, se fit donner le 4 novembre 1858, un grand banquet, à la salle publique du marché Bon-Secours, de Montréal, M. Dorion y prononça un long discours ; nous allons en donner un court extrait, qui fera voir la perfidie et les vues tortueuses de cet homme d'état. Il parle de la question de la représentation basée sur la population ; on sait qu'il avait concédé cette mesure à M. Brown et voyons les ambiguïtés malhonnêtes dont il se sert pour avouer la chose devant le Bas-Canada :\n\n\"La seule difficulté réelle qui s'élevait, était donc la question de la représentation d'après la population. Habitant le Bas-Canada, lui devant toute l'influence que je puis posséder, je n'étais pas prêt à sacrifier un des justes droits de cette section de la province. Mais depuis longtemps, je sentais toutefois, qu'il fallait en venir à un règlement de la question. Il fallait s'entendre. Les demandes du Haut-Canada devenaient de plus en plus pressantes à chaque élection et je voyais que l'opinion se faisait tellement forte que la mesure serait quelque jour emportée par l'influence du gouvernement impérial, jetée dans la balance avec la majorité Haut-Canada, de manière à être injurieuse, peut-être désastreuse pour les intérêts du Bas-Canada. Il fallait prévoir l'époque où cette mesure serait imposée. Il était du devoir des Bas-Canadiens de se prémunir contre cet état de choses. Nous avons des institutions, une langue, une religion qui nous sont chères et nous devons veiller à leur protection. Mais, d'un autre côté, sur les questions générales, il n'était pas à craindre que le Bas-Canada s'imposât au Haut-Canada, ni que le Haut-Canada s'imposât au Bas-Canada, pas plus que le District de Québec n'a à appréhender l'influence du District de Montréal et le District de Montréal celle du District de Québec. Il y avait sans doute, quelques difficultés pour arriver à une solution du problème ; il y avait certains intérêts qu'il fallait protéger, certains droits qu'il fallait consacrer par la législation ; mais après avoir donné cette protection, il n'était pas malaise d'arranger une constitution. Messieurs, la question paraît plus épineuse au premier abord qu'elle ne l'est dans le fond.\"\n\nSi nous voulons faire autant de citations pour prouver la\nmauvaise foi du parti rouge et qu'il a toujours été favorable à une mesure qui constituait notre ruine nationale et religieuse, c'est uniquement pour faire disparaître complètement les préjugés qu'il n'a cessé de répandre dans le peuple depuis des années.\n\nAu reste, M. Dorion a, lui-même, reconnu avoir toujours été prêt à accorder la représentation basée sur la population, ou, à accepter une union fédérale entre le Haut et le Bas-Canada ou une confédération pure et simple. Mais sait-on aujourd'hui, pourquoi il s'oppose à la Confédération depuis 1865 ? Écoutez bien, lecteurs, qui croyez encore que M. Dorion est la pâte des hommes honnêtes et vertueux : c'est parce que la Confédération assure le triomphe des intérêts catholiques et conservateurs du Bas-Canada sous le régime nouveau, grâce aux nombreux conservateurs des Provinces maritimes, qui en se joignant à ceux de la Province de Québec, nous mettront toujours en état de repousser les tentatives des fanatiques du Haut-Canada ; c'est en un mot, parce que sous la confédération et dans le Parlement fédéral, l'élément conservateur sera si fort qu'il pourra rester au pouvoir, tandis que les Rouges, les Radicaux, ne pourront jamais gouverner. Ouvrez le volume qui contient les débats officiels sur la Confédération et vous y verrez cet aveu maladroit du grand chef, aux pages 253, 254, et suivantes, dans la version anglaise.\n\nComprenez-vous maintenant la douleur patriotique de ce bon M. Dorion, que la Confédération va empêcher de monter au pouvoir, pour y placer sa légion d'affamés, de mauvais rhétoreurs et d'insulteurs publics ? Quel dommage pour le pays ? Est-ce possible que la Confédération, puisse nous enlever l'espoir du concours précieux des anciens collaborateurs de l'Avenir et de tous les cuistres, qui noircissent de temps à autre, les colonnes du Pays, du Journal de St. Hyacinthe, de l'Union Nationale et de l'Ordre ?\n\nM. Dorion, permettez-nous de vous le dire, vous avez fait là votre millième gaucherie. Tout le monde savait déjà que votre seule objection à une mesure que vous avez toujours appelée de tous vos vœux, n'était inspirée que par un misérable égoïsme et d'étroits préjugés. Pourquoi venir l'avouer vous-même et mettre à nu la pauvreté de votre caractère ou la malhonnêteté de ceux qui vous poussent ?\n\nNous avons surabondamment démontré que les seuls adversaires de la confédération, dans le Bas-Canada, sont les rouges et les annexionistes, et que les seuls motifs qui en font les ennemis décidés du nouveau régime sont leur haine du catholicisme et leur déloyauté ; ils sont, en effet, assez clairvoyants pour com-\nprendre que l'ordre de choses récemment introduit consolide l'em-\npire de la religion et éloigne à jamais tout danger d'annexion. Ils\nont donné, dans le petit pamphlet rouge, la mesure de ce qu'ils\npeuvent en fait de mensonges échontés ; ils prétendent, à la page\n13, que M. Dorion n'a jamais été pour la représentation basée\nsur la population, et que M. Cartier, lui, a accordé la mesure !\nOn vient de voir comment M. Dorion s'est opposé aux exigences\ndu Haut-Canada, et ce qu'il pense d'une union fédérale ou d'une\nconfédération. Quant à M. Cartier, il n'y avait qu'un rouge des\nplus menteurs, et ce n'est pas peu dire, quant on sait que le\nmensonge est la seule arme du parti, qui pût porter contre lui\nune semblable accusation.\n\nNous avons expliqué, plus haut, la composition de notre légis-\nlature locale et du parlement fédéral ; nous avons vu, par les\narticles même de la constitution, que toutes nos institutions par-\nticulières et locales sont laissées sous notre contrôle exclusif, et\nque le parlement fédéral ne pourra jamais y toucher. Les attri-\nbutions du parlement fédéral se rapportent seulement aux affaires\nqui sont d'un intérêt général à toutes les provinces de la confé-\ndération. Dès lors, il devient impossible pour quiconque sait un\npeu raisonner, que jamais tentative n'y pourra être faite pour\nléser qui que ce soit, parce que l'auteur du mal projeté devien-\ndrait lui-même victime comme les autres. Bien plus, dans la pré-\nvision d'empêtements certainement impossibles, il y a des garan-\nties au sommet du nouvel édifice politique, par l'égalité intro-\nduite dans la composition du sénat, où tous projets tendant à\nmolester quelque province particulière seraient de suite étouffés.\nD'ailleurs, M. Dorion s'est chargé lui-même de nous rassurer ; et\nc'est lui qui nous a promis que les provinces maritimes marchè-\nraient toujours avec nous lorsqu'il s'agirait de combattre les\nexigences des annexionistes d'ici et des radicaux du Haut-\nCanada.\n\nEn outre, cette prétendue représentation basée sur la popu-\nlation, adoptée à la chambre des communes du parlement fédéral,\nn'est nullement dangereuse pour nous.\n\nLa clause 51, de la constitution est admirable de sagesse et\nconstitue pour nous une protection toujours efficace.\n\n51. Immédiatement après le recensement de mil huit cent soixante-et-\n onze, et après chaque autre recensement décennal, la représentation des\nquatre provinces sera répartie de nouveau par telle autorité, de telle ma-\nnière et à dater de telle époque que pourra, de temps à autre, prescrire le\nparlement du Canada, d'après les règles suivantes ;\n(1). Québec aura le nombre fixe de soixante-et-cinq représentants ;\n(2). Il sera assigné à chacune des autres province un nombre de repré-\nsentants proportionné au chiffre de sa population (constaté par tel recen-\nsement) comme le nombre soixante-cinq le sera au chiffre de la population de Québec (ainsi constaté);\n\n(3). En supputant le nombre des représentants d'une province, il ne sera pas tenu compte d'une fraction n'excédant pas la moitié du nombre total nécessaire pour donner à la province droit à un représentant; mais toute fraction excédant la moitié de ce nombre équivaudra au nombre entier;\n\n(4). Lors de chaque nouvelle répartition, nulle réduction n'aura lieu dans le nombre des représentants d'une province, à moins qu'il ne soit constaté par le dernier recensement que le chiffre de la population totale du Canada à l'époque de la dernière répartition du nombre des représentants de la province, n'ait décru dans la proportion d'un vingtième ou plus;\n\n(5). Les nouvelles répartitions n'auront d'effet qu'à compter de l'expiration du parlement alors existent.\n\nÉcoutons sur l'importance du paragraphe deux de la clause 51, les voix autorisées des Honorables Cauchon, Galt et Brown:\n\n\"Ce dispositif de la constitution a été au début, mal compris et mal interprété. L'on se demandait pourquoi, lorsque les autres provinces pourront avancer, le Bas Canada devra rester stationnaire! Écoutons d'abord M. Galt, celui de tous les ministres, qui a le plus complètement expliqué et rendu la pensée de la convention de Québec dans son célèbre discours de Sherbrooke:\n\n\"La population devra être la base de la représentation dans la chambre basse, et pour empêcher une augmentation exorbitante du nombre des députés dans cette chambre, à mesure que la population accroîtra, il fut convenu que l'on ferait une base sur laquelle l'on computera le nombre des députés; l'on choisit le Bas-Canada. Bien que le Bas-Canada ne possédât pas la population la plus considérable, cependant la sienne était nombreuse, et croissait dans des proportions plus égales que celle des autres Provinces, n'augmentant pas aussi rapidement que celle du Haut-Canada, ni aussi lentement que celle des Provinces atlantiques. Aussi le nombre des membres de la chambre des communes, ne sera pas soumis à des variations aussi irrégulières que si l'on avait pris, pour base de la computation, la population de l'une des autres Provinces.\"\n\n\"Cependant le ministre des finances n'a pas tout dit. Ce dispositif est tout à l'avantage des provinces dans lesquelles les populations, moins nombreuses déjà, augmentent encore dans une proportion moindre. Le Globe, du reste, a parfaitement compris et parfaitement expliqué l'opération de ce paragraphe.\n\n\"Le principe de la représentation assise sur le nombre est sacré par le projet de la convention; il y est tempéré, dans ses conséquences, par ses conditions d'existence; sagement com-\n\"primé par des freins, dans son travail d'expansion et retardé\nconsidérablement dans ses progrès.\n\n\"Pour bien nous faire comprendre, donnons un exemple : sup-\nposons que la constitution dise : la chambre des communes se\ncomposera de trois députés ; comme vous ne comptez que pour\nun tiers dans l'ensemble de la population, vous y serez représen-\ntés par une voix, nous, nous aurons les deux autres, parce que\nnous sommes les deux tiers. Ici le principe de la population\nest parfaitement reconnu et parfaitement pratiqué ; mais la\nmajorité contre nous ne sera que d'une voix ; et en déplaçant\ncette seule voix, nous aurons la majorité !\n\n\"Maintenant, supposons un autre cas ; et disons que la re-\nprésentation, au lieu d'être de trois soit de trois cents députés,\ndans la chambre des communes. Notre tiers sera cent, et les\ndeux autres tiers deux cents. Les mêmes proportions seront\nparfaitement conservées avec le principe de la représentation\nbâtie sur la population, comme dans le premier cas, et cepen-\ndant, la majorité contre nous ici sera de cent ! Or l'on en con-\nviendra facilement, il est plus facile de déplacer une voix que\nd'en déplacer cent.\n\n\"Donc tout en conservant la population pour base, on peut\nconsidérablement la modifier dans sa progression et l'amoindrir\ndans ses effets : il est évident parce que nous venons de dire,\nque plus le chiffre autour duquel devra pivoter tout le système\nsera bas, le mieux ce sera pour nous et pour les provinces atlant-\niques.\n\n\"Maintenant, laissons de côté les hypothèses et opérons sur\nla réalité. Le Bas-Canada ayant une population de 1,110,664\nâmes et une représentation de 65 députés, chacun de ceux-ci\nreprésente en moyenne, 17,087 âmes. C'est la base adoptée\npar la convention, pour toutes les autres provinces, au point de\ndépart. Si ce chiffre de 17,087, devait continuer à être la\nmoyenne permanente de la population pour chaque député, et\nque la population totale du Bas-Canada se doublât, en trente\nans, de 1861 à 1891, celui-ci aurait une population de 2,221,-\n328 et une représentation de 130 députés.\n\n\"Si le Haut-Canada au bout de la même période, avait, ce qui\nest possible, une population double de la nôtre c'est-à-dire de\n4,442,656, il posséderait une représentation de 260 députés, et\nune majorité sur nous de 130.\n\n\"Mais si au contraire le chiffre de 65, de notre représenta-\ntion demeure stationnaire, à la même époque, la moyenne de la\npopulation pour chaque député, dans toute l'étendue de la con-\nfédération sera de 34,174, et le Haut-Canada aura droit à 130\ndéputés. Ainsi donc dans le premier cas, le Haut-Canada aurait sur nous une majorité de 130 voix, tandis que dans le second, cette majorité ne serait que 65 voix. Il est donc important, comme on le voit, que le chiffre de notre représentation reste ce qu’il est.\n\nNous n’avons rien à ajouter à des explications aussi satisfaisantes.\n\nLe Haut-Canada devra donc, pour voir augmenter le nombre de ses députés, accroître sa population dans une proportion d’à peu près les deux tiers plus vite que le Bas-Canada ; or, la chose est impossible. Qu’on lise bien le calcul suivant et l’on s’en convaincra ; bien plus, l’accroissement de la province de Québec deviendra nécessairement plus rapide.\n\n“ Ce qui a jusqu’ici constitué la supériorité du Haut-Canada, c’est l’émigration. Depuis douze ans, pas moins de 300,000 émigrants se sont établis en Haut-Canada, quand il en est venu à peine 4,000 en Bas-Canada. Mais aujourd’hui la force des choses va changer le courant de l’émigration.\n\n1o. D’abord, ayant la conduite de l’émigration entre les mains, nous chercherons des émigrants qui, par leur origine, seront prêts à demeurer en Bas-Canada.\n\n2o. Le Haut-Canada n’ayant plus de bonnes terres pour la colonisation, les émigrants devront en chercher en Bas-Canada. Voici la preuve de notre avancé :\n\n| Territoire | En culture |\n|------------|------------|\n| Bas-Canada | 128,659,000 arp. — 13,138,069 arp. |\n| Haut-Canada | 31,741,000 “ — 18,587,783 “ |\n\nDifférence en faveur du Bas-Canada : 96,918,000\n\nIl reste donc à coloniser en :\n\n| Bas-Canada | 115,511,000 arpents. |\n| Haut-Canada | 13,154,000 |\n\nDifférence en faveur du Bas-Canada : 102,357,000\n\nCette différence entre le territoire total des deux provinces et le territoire habité, c’est-à-dire entre 46,918,000 et 102,357,000, fait voir que notre colonisation est 6 pour cent en arrière de celle du Haut-Canada.\n\nLe même tableau nous fait voir que le Haut-Canada va être forcé de nous laisser profiter de l’émigration.\n\nSur les 13,000,000 d’arpents du Haut-Canada, il faut déduire les rivières, les montagnes, les marécages et les terres impraticables. Reste à peu près 10,000,000 d’acres et pour le Bas-Canada, à la suite d’une même déduction 106,000,000.\n\nOn comprend qu’il y a un très-mauvais choix à faire sur 10,000,000 d’arpents laissés en arrière, alors que les précédents colons ont choisi les meilleurs.\n\nL’an dernier 16,000 émigrants se sont fixés en Haut-Canada. En mettant seulement à 2 p. cent l’augmentation naturelle de la population, par année, on trouve que 30,000 personnes y atteignent tous les ans\nleur majorité. Nous supposons que sur les 11,000 émigrants, 8,000 s'établissent sur des terres et que des 30,000 âmes de population indigène, 6,000 seulement soient forcés de se fixer dans les townships si nous accordons à chacun d'eux seulement 300 arpents de terre ; ils se trouvent à prendre dans une seule année 4,200,000 arpents de terre disponibles. Le Haut-Canada n'a donc plus rien de terres que pour un an, s'il continuait à recevoir l'émigration dans la même proportion.\n\nCe résultat nous fournit un double argument :\n\n1o. En enlevant forcément l'émigration du Haut-Canada, nous lui ôtons une augmentation de 16,000 âmes par année. Nous pourrions mettre plus : car le terme moyen de l'émigration depuis 14 ans est de 24,000 par année, dont 22,000 en Haut-Canada.\n\nN'importe, en gagnant 16,000 que nous leur ôtons, nous avons une différence annuelle de 32,000 en notre faveur. Cette différence pendant 10 ans, nous donne une augmentation de 320,000 âmes. Or, la progression naturelle de notre population est près de un pour cent plus forte que celle du Haut-Canada, qui ne se rattrapait que par son immigration.\n\nEn sorte que si notre progression ne l'emportait seulement que de 1 pour cent, nous aurions une majorité annuelle de 6,000 âmes, soit en dix ans 60,000 ou, en tout, près de 400,000 âmes, c'est-à-dire que notre population l'emportera et pour toujours sur celle du Haut-Canada.\n\n2o. Ce résultat nous prouve ensuite qu'il n'y plus d'émigration possible en Haut-Canada, et que nous profiterons de toute l'immigration pour la vente de nos terres.\"\n\nARMÉE PERMANENTE.\n\nLes Rouges crient encore contre la Confédération, parce qu'elle va nous amener une armée permanente, qui va dévorer tous nos revenus et peut-être forcer ces braves gens à montrer du cœur. Nous avouons que c'est désolant pour eux. Mais, nous devons avouer que quant à nous, nous ne serions pas fâchés, que dans un temps donné, les ressources de la Confédération fussent suffisantes pour nous permettre d'organiser une bonne milice active ou un noyau de petite armée permanente, avec laquelle on pût imposer le respect aux Féniens et à leurs alliés, les rouges, les annexionistes et les clubistes.\n\nToutefois ne nous décourageons pas : les Rouges au pouvoir, et les Rouges qui veulent y arriver, forment un parti bien différent. En 1863, ils étaient au pouvoir et nous ont présenté un projet de loi sur la milice, dont la mise en pratique eût coûté $613,000, et c'est à eux que nous devons l'établissement des écoles militaires, qui nous ont donné des élèves distingués et destinés à former cette armée permanente contre laquelle on braille tant. Et ils ont fait cela, parce qu'il fallait le faire, ou descendre du pouvoir, et, comme ils aiment encore mieux empocher l'argent du peuple, que faire de l'opposition, ils se sont exécutés de bonne grâce et se sont faits belliqueux. Mettez un quêteux à cheval, il n'y a plus moyen de l'en faire descendre ;\navant de monter, il tempête contre les heureux mortels qui ne vont pas à pied ; une fois monté, il s'y cramponne et oublie les injustices de la société. C'est là l'histoire de nos rouges les plus intelligents et les plus honnêtes.\n\nLe parti rouge et annexioniste, fertile en sottises, a donné naissance au club St. Jean-Baptiste, où alla se réfugier la secte, pour faire dans l'ombre, ce que les chefs ne voulaient pas tenter au grand jour. Écoutez sur le compte du club St. Jean-Baptiste la voix éloquente de quelqu'un qui a bien connu la société des compagnons et qui a reçu les révélations d'un membre converti et repentant.\n\n**LE CLUB ST. JEAN-BAPTISTE.**\n\nAbordons maintenant le Club St. Jean-Baptiste, cette araignée du parti libéral qui pendant près d'un an a tissé ses fils dans la rue St. Jean-Baptiste en face du couvent de la Congrégation. Cela n'existe plus bien entendu, parce que le balai a passé là-dedans. Les mouches qui furent prises dans la toile sont dispersées aussi. Beaucoup s'en sont retirées avec une aile ou une antenne de moins, d'autres à demi succées, quelques-unes, (mais elles sont rares) encore intactes. De celles-là on en voit voltiger encore une ou deux, dans les rues du faubourg Québec. Je les ai toujours soupçonnées d'être de connivence avec l'araignée. Elles étaient là pour engager les autres à y venir.\n\n— Vous croirez peut-être que je ris en écrivant ces lignes—que je suis de gai et fol humeur—vous vous trompez, du tout au tout ; on ne saurait être plus triste que je le suis en rappelant ces souvenirs. Il y a là une leçon pour nous mais peu c'en est fallu que nous y trouvions une grande honte et la cause de notre ruine comme peuple religieux et moral. Car c'était une société serrée que ce club de St. Jean-Baptiste, et une des plus avinissantes encore. On y entrait en mettant le pied sur une tête de mort pour attester qu'on était prêt à tout ; un poignard était placé sur la poitrine du récipiendaire, pâle et hâtif, presque fou de terreur—cela voulait dire que la mort le frapperait à la moindre trahison des ordres de la société.—D'où viendrait cette mort ? de tous côtés et de nulle part. Le masque qui tenait le poignard ne s'expliquait qu'ainsi. Des masques, il y en avait quarante, cinquante et cent qui se tenaient autour d'une vaste salle souterraine éclairée par une faible lumière—un œil de bête sauvage dans la nuit.—C'étaient des hommes qui avaient honte de leurs actes ou de leur front. Beaucoup d'entre eux, se cachaien, parce qu'ils sentaient qu'ils\nferaient horreur au timide néophyte, qui demandait à devenir leur frère.\n\nUn serment était prêté, serment anti-religieux et anti-social, serment qui rompait les liens civils et politiques, qui foulait aux pieds les affections les plus chères pour le bénéfice, pour l'avantage d'une association, dont le but apparent \"le progrès, la nationalité\" n'était qu'un leurre, dont le but réel et indéniable était l'élevation de deux ou trois individus, au détriment de tous les autres. Ces deux ou trois Messieurs se sentaient petits et traînards. Dans leur esprit qu'ils crurent plus grand que leur condition ils rêvèrent de colossales destinées. Ils cherchèrent une échelle pour arriver au point que fixaient leurs regards. Ils en trouvèrent une dans la boue, dans l'ordure ; quelques-uns des barreaux étaient même tachés de sang. \"Prendons toujours se diront-ils, une fois là-haut, nous nous laverons les mains.\" Ils ont dressé l'échelle, ils sont montés aussi, mais arrivés au deuxième peut-être au troisième échelon, erac ! tout se rompt et les voilà Gros Jean comme devant déplorant cependant bien fort, pour le succès de leur tentative que la lune soit si haut placée.\n\nIls juraient donc, ces pauvres gens, ces moutons entêtés, ils juraient qu'aucun devoir social, aucun lien de famille, aucun sentiment d'amitié, par suite, d'honneur, ne les empêcheraient d'obéir aux ordres de la société, et ils juraient cela sur l'honneur. Ils juraient sur l'honneur, que l'occasion donnée, ils n'auraient plus de devoir à remplir, plus de reconnaissance à éprouver, plus d'affection au cœur, plus de cœur quoi ; ils juraient cela sur l'honneur.\n\nIls juraient sur l'honneur, de prendre fait et cause pour un frère en tout et partout, de le défendre par la parole et par les armes, s'il le fallait envers et contre tous ; il juraient cela sur l'honneur.\n\nUne surprise se présente un jour—M. Chapleau sollicitait les suffrages des électeurs d'un certain quartier de la ville de Montréal. Un membre du club les sollicitait en même temps. Pour la plupart des membres de cette association, l'adversaire de M. Chapleau était un étranger, un premier venu. M. Chapleau, lui, était un ami de tous les jours, un homme qui avait rendu service à plusieurs d'entr'eux, un homme d'un talent reconnu—admire de tout le monde.\n\nC'était une petite épreuve.\n\nQu'arriva-t-il ? Ces amis de dix ans, travaillèrent jour et nuit contre leur ami le plus intime et le plus dévoué. Ils travaillèrent en lui demandant pardon pour leur honte—ils travaillèrent si\nbien que M. Chapleau dut se retirer pour laisser le champ libre à son adversaire, qui certes était loin de pouvoir rendre les mêmes services que lui à la municipalité. Que voulez-vous ? il fallait bien en agir ainsi, puisqu'ils avaient juré sur l'honneur de n'avoir plus d'amis, de n'avoir que des frères. Oh ! quels frères ! quelle famille ! bon Dieu ! Il fallait les voir, dans leurs réunions de tous les soirs dans leurs salles enfumées de la rue St. Jean-Baptiste, les uns trinquant, les autres jouant aux cartes en se disputant quelques sous, tout leur pain du lendemain. En bas, on conspirait, en haut on s'énivrait, on jurait, on volait.\n\nLe cadre, du reste, valait bien le tableau.—Ce que c'était que cette maison avant que le club s'en fût emparé, je ne le dirais pas à une honnête femme.—On y vendait du vice, on n'y avait jamais vu d'honneur. Les murs gardent encore quelques traces de ces jours de dégradations.—Il y a à peine trois ans deux hommes s'y sont égorgés à coups de rasoir. Leur sang est resté sur le plancher, rien n'a pu l'effacer, et c'est sur cette tache de sang que se dressait la table de jeu, que s'agitait le tripôt, sur cette tache de sang que venaient s'abîmer le bonheur et la richesse des familles. Quelques flacons de genièvre, un misérable tapis vert suffisaient à ces ruines et à ces désespoirs. On se ruinait, donc on s'énivrait, on se mettait le désespoir au cœur, là, là...... mais ensuite pour oublier, après avoir bu et joué le pain de sa femme et de ses enfants, on allait ailleurs les déshonorer. Pour dire vrai ceux-là n'avaient pas juré sur l'honneur de faire le bonheur de leurs familles, ils ne l'avaient juré que devant Dieu.\n\nC'était donc une société secrète que ce club St. Jean Baptiste, une société secrète, parce qu'elle se recrutait dans l'ombre et dans la nuit, une société secrète, parce qu'on y prêtait un serment indiscret, une société secrète, parce qu'on y avait des secrets, des mots de passe, des signes entre frères, une société secrète, puisqu'elle sacrifiait les intérêts de la grande société humaine à ses propres intérêts, une société secrète, puisque le sang, puisque le cœur n'étaient plus comptés pour rien par ceux qui en faisaient partie et qu'il n'y avait plus, ni parents, ni amis, ni raison, ni foi, ni loi, pour celui qui entrait dans l'association. Un frère ne pouvait jamais avoir tort. Était-il été assassin, voleur, sacrilège, il fallait le protéger, le défendre contre les lois et la justice.\n\nDes principes aussi monstrueux ne pouvaient réunir d'adhérents que parmi les hommes tarés à qui il ne restait plus rien à risquer, ou à perdre. Aussi, sur les doux ou trois cents membres composant cette association, à peine en aurait-on trouvé dix qui appartinssent à la bonne société. Encore, ceux là n'y firent-ils qu'une courte apparition. Dès qu'ils sentirent que leur dignité\nde gentilhommes souffrait au contact de la tourbe ignominieuse et disparate de leurs nouveaux frères ils se retirèrent du club pour n'y plus remettre les pieds. La grande attraction s'exerçait sur les hommes de métiers, sur les aubergistes, les boutiquiers de tout genre, sur les avocats sans cause et les jeunes gens sans emploi, presque tous oiseaux de proie que l'on conviait à dépecer la grande société. Il en vint beaucoup de ceux-là, on leur promettait, voyez-vous, la protection, l'encouragement du club, et les membres étaient tenus rigoureusement à cette règle. Le club eût donc ses avocats, ses notaires, ses médecins, ses cordonniers, ses tailleurs, etc. Tous devaient faire fortune. De fait, l'encouragement fut d'abord très-libéral. Le grand nombre qui n'avait que des habits râpés, des souliers éculés se firent vêtir et chaussé ; on ne refusait pas à un frère ; mais tailleurs, bottiers, aubergistes, etc., sont encore à courir après leur argent. Après tout, un frère saura tout sacrifier pour un frère, mais en dépit de sa bonne volonté il ne saurait battre monnaie.\n\nTous ceux qui sont entrés dans cette association ont été les dupes de quelques intrigants politiques à la tête desquels figure M. Médéric Lanctot. Il en était, lui, et l'un des premiers encore ; sous ses grandes phrases philanthropiques il cachait soigneusement le germe de l'ambition qui aujourd'hui se développe et menace bientôt d'envahir tout le pays si une main ferme ne l'étouffe à temps. C'est là, dans ce bourbier infect que M. Lanctot a nourri son patriotisme, a rêvé sa grandeur future, a préaludé à la régénération de l'ouvrier, qu'il opère aujourd'hui avec un succès désespérant pour l'humanité. Il travaillait bien pour son compte, celui-là, mais il était à peu près le seul qui retirât quelque bénéfice de l'association. Tous les autres, ou à peu près, qui sont entrés là avec quelqu'argent, quelques ressources, en sont sortis gueux et misérables. Il y aurait de curieuses statistiques à établir sur le nombre de banqueroutes et de ruines dont le club a été la cause évidente, immédiate ; nous en parlerons peut-être quelque jour.\n\nLa protection mutuelle, ayant pour principale considération la nationalité canadienne française, telle a été d'abord le prétexte de cette réunion. Aux badauds et aux niais on promettait un pays de cocagne ; aux clairvoyants on ouvrait une autre perspective : la perspective du triomphe du parti rouge. La ruine de M. Cartier, le succès du rougisme, telle est la vraie, la seule raison de la formation de ce club, qui n'a été qu'une des formes du Protée libéral, et la plus hideuse de toutes peut-être. On essaiera de le nier dans certains quartiers, parce qu'on a honte de cette sentine qui pue la crapule et le vice, mais les faits sont écrasants,\nà l'encontre de ces dénégations. La majorité des membres appartenait au parti rouge, tous les chefs étaient pris dans ses rangs. Toute la presse libérale, les valets de MM. Dessaulles et Cie., les rédacteurs du Pays, de l'Union Nationale, de L'Ordre lui-même, trônaient dans les assemblées. Nous les mettons tous au défi de protester contre cette assertion. Trois membres du parlement sont descendus dans ce brouhaha, ont revêtu les insignes de l'ignominie, c'étaient trois membres rouges. J'espère que les comtés de Bagot, Richelieu et Iberville sauront leur payer, dans les élections prochaines, le tribut d'hommages qu'ils méritent pour une aussi louable action.\n\nSans doute, M. Dorion n'a jamais osé descendre jusque là, mais il y envoyait ses satellites, mais il défendait le club par ses journaux, mais il l'encourageait par tous les moyens possibles, parce qu'il voulait s'en servir comme d'une mine pour saper la popularité de M. Cartier dans le faubourg Québec. M. Dorion n'était pas du club, ce qui n'empêchait pas le club d'être à son service ; et, pendant plus d'un an, tous les mouvements du parti libéral sont partis du club. Qui a lutté contre la confédération sur tous les hustings, à toutes les fenêtres et jusque sur les toits du faubourg Québec, si ce n'est quelques forces du club composant une petite cohorte dont Lanctôt était le chef et l'inspirateur. Qui a levé le drapeau de l'indépendance, si ce n'est M. Lanctôt ? Qui a été le plus ardent avocat de l'annexion depuis quelques années, si ce n'est M. Lanctôt ? Qui a arboré le pavillon féniens lors de l'invasion menaçante de ces déguenillés ? M. Lanctôt, toujours M. Lanctôt et le Club St Jean-Baptiste. Le parti libéral s'effaçait devant ce parti naissant et le laissait agir, sauf à profiter des avantages qu'il pourrait conquérir. Il songeait aux dragées, mais se souciait fort peu des coups. Son échine doit, du reste, être fort sensible, depuis si longtemps qu'il est incessamment battu.\n\nForce est donc au parti rouge d'accepter ce petit démagogue comme un des siens, plus que cela, comme un de ses chefs, et d'assumer en même temps toutes les hontes du Club St. Jean-Baptiste. Il n'osera pas les renier, lorsque son principal organe, le Pays, tressaille d'allégresse en parlant de la lutte que Lanctôt se prépare à entreprendre contre M. Cartier. Il prévoit d'emblée (on les connaît ces prophètes-là) la défaite de M. Cartier, et, là-dessus, il entonne le chant de triomphe du parti libéral. Laissons-les chanter aujourd'hui, c'est bien le moins qu'ils aient la gaie de leurs chimériques espérances, ils ont si souvent éprouvé les amertumes de la déception. Et encore, sont-ils loin d'avoir épuisé\nleur calice de souffrance. Riez bien, mais rira mieux qui rira le dernier.\n\nVous chantez des hymnes à M. Lanctôt, vous l'appuyez de votre influence, vous le poussez, vous le lancez, quoi ! et vous direz ensuite que le club St. Jean-Baptiste, dont il était le chef, n'est pas une société secrète rouge, que vous le désavouez ; mais le bon sens du peuple saura vous juger et rendre à chacun selon ses œuvres.\n\nCe club a été une transformation soudaine de votre parti, qui a travaillé pour vous et comme vous contre la religion, contre la patrie, au profit des ennemis de nos institutions, de notre autonomie et de notre avenir. Il a été flétri, comme vous l'avez été, par la voix éloquente de notre clergé et par toutes les consciences honnêtes. Vainement Lanctôt se rattache à cette parole de la chaire qui le stigmatise, vainement, vous aussi, vous essayez de vous protéger de la croix qui domine notre petit peuple canadien. Dans ses efforts comme dans les vôtres, vous me faites l'effet d'un pendu qui s'est délié une main et qui cherche à se cramponner à la corde qui l'étrangle. Ses forces s'épuisent bientôt, on entend son râle d'agonie, les dernières convulsions agitent son corps, il se rodit, il meurt enfin ; c'est un cadavre.\n\nLe peuple, en bas, dit : \"c'est juste,\" et tout est fini.\n\nLA GRÈVE.\n\nLe club est mort—mais l'esprit qu'il a soufflé sur une partie de la population subsiste encore.—Un instant cet esprit avait animé le corps d'un monstre qui habitait dans un antre—maintenant, sous un autre nom, dans un nouvel ordre d'idées il tourmente notre pauvre corps social.—C'est l'histoire du démon chassé du lieu dont il avait pris possession et qui en ramène sept autres plus dangereux que lui pour recouvrer sa conquête. M. Lanctôt ne conduit plus discrètement les gens, à la nuit tombante, dans une ruelle obscure, dans une maison plus obscure encore, noire et enfumée, non, car cela n'a pas réussi, non, c'est en plein air, c'est au grand vent qu'il expose ses doctrines sur la grève, sur la misère du peuple, sur l'égalité absolue, qui doit exister entre tous les hommes, laissant espérer à l'ouvrier que dans une société à lui, formée par lui, les oiseaux lui tomberont tout rôtis dans la bouche et qu'il lui suffira de vouloir pour obtenir tout ce qu'il voudra.\n\nCette utopie inqualifiable a trouvé encore des dupes. Quel est de fait le sot qui n'en trouve un plus sot que lui qui l'admire. Cinquante à soixante claqueurs suivent journellement M. Lanctôt de porte en porte pour applaudir à ses balivernes. Le peuple\ns'a troupe autour de lui pour admirer une aussi prodigieuse source de sottises et le lendemain on lit dans *L'Union Nationale* que deux milles auditeurs se pressaient au coin d'une rue pour recueillir la parole éloquente du citoyen Lanctôt.—Petit Marat va !\n\nIl ne suffisait pas cependant à sa grande tâche de rénovation. Il demanda de l'aide, mais personne ici ne voulut lui prêter assistance. Alors il résolut d'implorer le secours de ses amis MM. les Américains. Ils lui envoyèrent de suite M. Woodman (homme des bois) ex-rédacteur de la *Tribune*, aventurier hardi, prêt et résolu à tout, qui vint ici, pousser au milieu de nos populations paisibles un cri de révolte contre l'Angleterre, en les appelant toutes à l'annexion sous le plus bref délai, insultant à nos célébrités en polisson politique qu'il est.\n\nAvez-vous vu cette figure ? C'était celle d'un bandit et d'un brigand.\n\nQue voulait en faire Maître Lanctôt ? Il voulait le placer à la tête d'un journal annexionniste qui devait sortir de son atelier ; cela par pur patriotisme, bien entendu, dans l'intérêt de la religion et de la nationalité.\n\nCe Woodman criait ainsi des injures contre l'Angleterre dans le seul but de se faire emprisonner. On lui disait un jour \"mais, si vous continuez on vous coiffera.\" *That is what I want*, répondit-il.\n\nNe pouvant obtenir une prison, sa suprême espérance, ici-bas, il résolut d'en finir avec l'ingrate humanité et mardi soir, 16 juillet, il se suicida lâchement dans un hôtel de New-York. On le trouvait, baignant dans son sang, mercredi matin. Une balle de *revolver* lui avait traversé le cœur !\n\nGrâce à la grève et aux associations ouvrières, Lanctôt espéra pendant quelque temps échapper à l'infamie dont allait le couvrir la chute du club St. Jean-Baptiste ; il fit donc et fait encore des efforts inouïs dans son nouveau genre d'exploitation. Il a enlevé à ses créanciers jusqu'à leur dernière espérance ; il a tiré des féniens et des américains tous les deniers qu'il a pu pour masquer son ambition effrénée, inspirer et voler la confiance des ouvriers et en arriver à les dominer pour s'en servir. Il faut qu'il conspire ; c'est chez lui un besoin de sa nature perverse. Au moyen de théories obscures, de promesses mensongères, il compte tenir les ouvriers enchâinés et les faire se consacrer à l'édition de sa fortune personnelle. Quelques-uns ont mordu à l'appas ; mais le nombre des dupes diminue chaque jour et bientôt Lanctôt, épuisé, meurtri et déshonoré sera obligé de fuir le pays ou de se cacher soigneusement pour jouir en silence\nde la plus triste réputation laborieusement acquise par dix années de conspiration, de vices et de crimes.\n\nRESUMÉ.—CONCLUSION.\n\nNous avons démontré, 1o que la race canadienne-française avait, à jouer sous la Confédération, un grand rôle, et que la Confédération était pour nous, un moyen sûr de remplir notre mission providentielle ;—2o que la Confédération était devenue nécessaire ;—3o que la Confédération nous est très avantageuse, en ce qu'elle offre et nous assure une protection, une garantie certaine pour nos intérêts religieux, nationaux et matériels ;—4o que les accusations portées contre les hommes d'état qui nous ont obtenu la confédération, n'étaient inspirées que par la jalousie, la malveillance, le mensonge, l'hypocrisie, la déloyauté et la malhonnêteté ; 5o que le parti qui s'oppose à la Confédération est composé d'impies, d'annexionnistes et d'ex-affiliés aux sociétés secrètes, qui tous forment le parti rouge et qui tous refusent d'accepter la Confédération, parce qu'elle est la sauvegarde de toutes nos institutions les plus chères.\n\nCe parti infâme a pour chef, le triste Médéric Lanctôt et l'Hon. A. A. Dorion, qui ont fini par opérer ouvertement l'union, qui déjà, existait entre eux secrètement, le Pays approuvant depuis samedi, 20 juillet, (1867) la candidature de Lanctôt et L'Union Nationale prêchant depuis la même date les vertus et les mérites du compère Dorion. Qu'ont fait ces deux pauvres siens ? M. Dorion par sa faiblesses et un certain prestige que lui donne une réputation d'honnêteté usurpée, a soutenu le parti rouge, annexionniste et voltairien ; le petit Médéric a essayé de fortifier ce mauvais parti, en y introduisant l'élément des sociétés secrètes et le communisme, par ses prédications burlesques, son féminisme, et le clubisme.\n\nLe parti conservateur, le parti canadien-français, le parti catholique marche sous la direction de l'Honorable George Etienne Cartier, depuis 13 à 15 ans. Qu'ont fait M. Cartier et son parti ?\n\nIls nous ont obtenu :\n\n1. L'abolition des réserves du clergé, dont partie des revenus a servi à bâtir nos palais de justice.\n2. L'abolition de la tenure seigneuriale, qui a affranchi le sol.\n3. L'extension du suffrage, qui a permis à tout ouvrier, à tout cultivateur honnête, d'avoir voix dans nos assemblées délibérantes.\n4. Le système municipal, qui habitue le peuple à faire ses propres affaires et à manier avantageusement la constitution.\n5. Le développement et les progrès immenses de la colonisation et de l'agriculture.\n6. Un système d'éducation commune et commerciale, propre à promouvoir les intérêts du peuple.\n7. Des canaux, des chemins de fer et une foule d'autres améliorations qui ont centuplé la richesse publique et privée.\n8. Le Codification de nos lois civiles et un Code de Procédure, dont le besoin se faisait si vivement sentir.\n9. La navigation libre et le creusement de nos rivières intérieures.\n10. La décentralisation judiciaire, qui met la justice à la portée de tout le monde.\n11. Enfin, la grande et belle confédération de l'Amérique Britannique du Nord, digne couronnement d'un aussi beau passé qui asseoir définitivement la nationalité canadienne française, créé une grande nation et donne à notre pays une base solide et durable, suivant la belle expression, de Sa Grandeur, Monseigneur l'Évêque de Montréal.\n\nPeut-on hésiter entre M. Dorion et M. Cartier, entre le parti rouge et le parti conservateur ? Tous les honnêtes gens, à quelque parti qu'ils appartiennent, répondront avec enthousiasme : donnons notre mépris à MM. Dorion et Lanctot, et nos votes à M. Cartier et à son parti.\norganisation\n\npour une élection, propre\n\naux États-Unis, et autres amé-\n\nricains, nous avons une procédure,\n\nqui est une des inté-\n\ngrantes de l'office à la\n\nchambre de commerce américaine\n\net qui remonte au passé\n\nde la Révolution française,\n\nde la République solide et\n\nde la monarchie de Monseigneur.\n\nNous avons le parti\n\nde nos amis et de nos gens, à\n\nnotre enthousiasme, et nos\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_27156.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 79, "total-input-tokens": 127828, "total-output-tokens": 55055, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1490, 3], [1490, 3931, 4], [3931, 3931, 5], [3931, 4123, 6], [4123, 4123, 7], [4123, 5905, 8], [5905, 7487, 9], [7487, 8898, 10], [8898, 11623, 11], [11623, 14360, 12], [14360, 17010, 13], [17010, 19692, 14], [19692, 22087, 15], [22087, 24804, 16], [24804, 27482, 17], [27482, 30239, 18], [30239, 33087, 19], [33087, 36174, 20], [36174, 38928, 21], [38928, 41489, 22], [41489, 43969, 23], [43969, 46581, 24], [46581, 49420, 25], [49420, 52375, 26], [52375, 55824, 27], [55824, 59263, 28], [59263, 62644, 29], [62644, 65866, 30], [65866, 68478, 31], [68478, 71136, 32], [71136, 73907, 33], [73907, 76921, 34], [76921, 79415, 35], [79415, 82295, 36], [82295, 84382, 37], [84382, 86948, 38], [86948, 89265, 39], [89265, 91533, 40], [91533, 94016, 41], [94016, 96775, 42], [96775, 99542, 43], [99542, 102105, 44], [102105, 104809, 45], [104809, 107100, 46], [107100, 109584, 47], [109584, 112327, 48], [112327, 114849, 49], [114849, 117536, 50], [117536, 120106, 51], [120106, 122714, 52], [122714, 125272, 53], [125272, 127884, 54], [127884, 130541, 55], [130541, 133003, 56], [133003, 135573, 57], [135573, 138217, 58], [138217, 140854, 59], [140854, 143615, 60], [143615, 146300, 61], [146300, 148961, 62], [148961, 151576, 63], [151576, 154383, 64], [154383, 157075, 65], [157075, 159613, 66], [159613, 162183, 67], [162183, 165119, 68], [165119, 167636, 69], [167636, 170155, 70], [170155, 173013, 71], [173013, 175793, 72], [175793, 178474, 73], [178474, 181011, 74], [181011, 183570, 75], [183570, 185995, 76], [185995, 187169, 77], [187169, 187553, 78], [187553, 187553, 79]], "primary_language": ["en", "en", "en", "en", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]