[{"id": "027bfab2d81d608f3e39e3e81b8b4036c63bbd1f", "text": "Technical and Bibliographic Notes/Notes techniques et bibliographiques\n\nThe Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n☐ Coloured covers/\n☐ Couverture de couleur\n\n☐ Covers damaged/\n☐ Couverture endommagée\n\n☐ Covers restored and/or laminated/\n☐ Couverture restaurée et/ou pelliculée\n\n☐ Cover title missing/\n☐ Le titre de couverture manque\n\n☐ Coloured maps/\n☐ Cartes géographiques en couleur\n\n☐ Coloured ink (i.e. other than blue or black)/\n☐ Encre de couleur (i.e. autre que bleue ou noire)\n\n☐ Coloured plates and/or illustrations/\n☐ Planches et/ou illustrations en couleur\n\n☐ Bound with other material/\n☐ Relié avec d'autres documents\n\n☐ Tight binding may cause shadows or distortion along interior margin/\n☐ La reliure serrée peut causer de l'ombre ou de la distorsion le long de la marge intérieure\n\n☐ Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n☐ Il se peut que certaines pages blanches ajoutées lors d'une restauration apparaissent dans le texte, mais, lorsque cela était possible, ces pages n'ont pas été filmées.\n\n☑ Additional comments:/ Various pagings.\n☐ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/\nCe document est filmé au taux de réduction indiqué ci-dessous.\n\n10X 14X 18X 22X 26X 30X\n12X 16X 20X 24X 28X 32X\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol ▽ (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nCANADIAN PACIFIC RAILWAY\n\nFrom Emory's Bar at the west end of Contract 60 to Port Moody (Burrard Inlet), British Columbia.\n\nSPECIFICATION FOR THE CONSTRUCTION OF THE WORK.\n\n1. This specification refers to the works of construction and materials required in making and building the railway as comprehended by the contract, comprising clearing, close cutting, grubbing, cross-logging, temporary and permanent fencing, excavation, draining, ditching, foundation works, waterways, public road crossings, farm road crossings, road and stream diversions, embankments, bridge, culvert and retaining wall masonry, concrete, paving, rip-rap, crib work, crib-wharfing, pile, trestle, truss and swing bridges and viaducts, log culverts, tunnels, sleepers, track bolts and spikes, taking delivery of the rails and fish-plates at ship's rail, ballasting, track-laying, points, crossings, switches, signals, turn-outs, sidings, wharf at Port Moody, station buildings, water tanks and water services, with the requisite machinery and fittings and all other works of every description, whether temporary or permanent, which may be necessary for the entire completion according to the following specification, profiles and drawings hereto attached, of that portion of the Canadian Pacific Railway above named and referred to, and more particularly shown on the plan of the same (drawings Nos. 1 and 2,) being a distance of about 55½ miles of single track with the requisite turn-outs and station sidings, and also the maintenance of all the works during their construction and until the final estimate is issued and the works formally accepted as complete by the Minister of Railways and Canals.\n\n2. The contractor is to enclose all the open or cultivated ground as delivered to him by the Minister of Railways and Canals for the purposes of this contract with a good fence, which, if he prefers, may in the first instance be temporary, and shall keep the same enclosed during the progress of the works until the termination of the contract, including the period for maintenance of the works so as effectually to preserve the adjoining land from trespass and prevent any injury whatever to any parties by reason of the want of sufficient fences to separate their lands from the works; and the contractor shall be wholly responsible for all damages to crops and all the consequences of insufficient fencing.\n3. Before the termination of the contract the Contractor shall construct a permanent fence throughout such parts of the line as indicated on the plans and profiles.\n\nCLEARING, ETC.\n\nClearing.\n\n4. Where the railway passes through wooded sections, the land must be cleared to the width of sixty-six feet on each side of the centre line, or such further width as may be required for slopes of cuttings and fences; also for a width of 300 feet on each side of the centre line at stations, for a length of 2,000 feet.\n\n5. The clearing is to be done so that all the brush, logs, and other loose material within its limits shall be burned or removed. In no case shall any of the brush or logs be cast back upon the adjacent timber lands; they must invariably be made into piles near the centre of the space to be cleared, and if not removed for fuel or otherwise used, they must be entirely consumed. All brush or trees accidentally or otherwise thrown into the adjacent woods, must be dragged out and burned or removed. The land must be left in a clean condition.\n\nClose cutting\n\n6. Where embankments are to be formed less than four feet or more than two feet in height, all the standing timber and stumps must be chopped close to the ground within the limits of the embankment, and burned.\n\nGrubbing.\n\n7. Where excavations will not exceed three feet in depth, or embankments two feet in height, all stumps must be grubbed out, and if possible burnt; those that will not burn, must be carried beyond the limits of the cuttings and embankments, where directed, and there piled. Directions will be given at the proper time, as to the extent of ground required to be cleared, close cut, and grubbed. The side ditching and off-take drains must also be grubbed.\n\nFENCING.\n\nFencing.\n\n8. The railway grounds where they adjoin occupied or pasture lands will be enclosed with a strong snake fence, made with round or split rails of Douglas fir or cedar 12 to 15 feet in length, and having a cross section of not less than 12 square inches. The lower rails will be laid on blocks so as to raise them 6 inches above the general level of the ground. They will be secured at the angles by two slanting posts set not less than one foot in the ground, and crossing each other above the top rail. These posts may be round or split, and shall have a cross section not less in dimensions than that of the rails, and they shall be of cedar or Douglas fir; they will be held in place at the top by a heavy rail or rider laid in the angle above the posts. The fence when completed shall be not less than 5 feet high above the general level of the ground as per drawing No. 11. Over ground subject to overflow a strong post and barb wire fence will be substituted and placed where the Engineer may direct.\n\nGRADING.\n\n9. Under this term is included all excavations and embankments and surface forming, whatever may be the materials, and whether the same be required for the line of Railway, or for the diversion or forming of water-courses, roads, approaches to\nbridges or level crossings, draining and off-take ditches, station grounds and all other works, contingent upon, or relating to excavations and embankments, as required by the nature of the contract or described in this specification.\n\n10. In woodland the grading will be commenced after the clearing, close cutting and grubbing required is completed to the satisfaction of the Engineer, and in cultivated sections, the Contractor will be held responsible for damages to crops.\n\n11. The red line on the profile exhibited, according to drawings No. 3 and 4, indicates the formation level, that is, the surface of the tops of embankments and the bottoms of cuttings previous to the laying and ballasting of the permanent way. The black undulating line represents the present surface of the ground, and the blue line the level of the top of rail which is 16 inches above formation level.\n\n12. The cuttings shall be formed to the cross section exhibited according to drawings Nos. 6 and 7. The width at formation level will be 22 feet, and the inclination of the slopes in earth will be one and a half horizontal to one perpendicular. In rock cuttings the slopes will be, as a rule, one horizontal to four perpendicular. In cuttings partly earth and partly rock, a berm of 6 feet shall be left on the surface of the rock. But these proportions may be varied by the Engineer to suit the nature of the materials to be excavated and insure the stability of the slopes.\n\n13. The whole of the grading shall be carefully formed to the levels given, and the roadway in cuttings shall invariably be rounded, and left at not less than six inches lower at the sides than in the centre. There shall be a side ditch at the foot of each slope throughout the whole length of the cuttings, the bottom of which shall be kept 12 inches below the roadway on the centre line, and lower if necessary, with a fall towards the ends of the cuttings so as thoroughly to drain the same. The cuttings shall be widened a little at the ends, and these ditches carried into the ditches at the sides of the embankments, so as not to injure the latter.\n\n14. In very wet cuttings, arising from springs or soakage, drains shall be formed at the foot of the slopes averaging about four feet deep, formed with a bed of three poles, two to three inches in diameter, laid breaking joint in the bottom of the trench and then filled up with coarse gravel or broken stone not larger than ordinary road metal. In level cuttings the trenches must be dug to a greater depth than four feet at the ends, so as to give sufficient flow for the water.\n\n15. Ditches shall be formed at one or both sides of the cuttings, as the inclination of the ground may require, so as to exclude from them any water draining off or flowing from the adjoining lands. They shall not be nearer than twenty feet from the top of the slopes, and shall be graded to such depths as to carry the water clear of the cutting and into the ditches at the sides of the embankments, or to the nearest water course.\n\n16. The cuttings shall, in all cases, during the progress of the work as well as afterwards, be kept perfectly dry; and whenever the slopes are wet and the\nmaterial seriously affected by springs, soaks, heavy rains or thaws, they shall be thoroughly drained by forming oblique drains up the slopes, not less than 3 feet deep, and at such intervals as the Engineer may direct; such drains to be filled with broken stone or coarse gravel as already described.\n\n17. When slips occur in the cuttings after they are properly formed, the material must be immediately removed by the Contractor, the slopes re-formed, and such precautions adopted as the Engineer may deem necessary.\n\n18. The embankments shall be formed according to drawing No.8. The materials taken from the cuttings or borrow pits to be used in forming the embankments and road approaches must be approved by the Engineer; ice or snow must be excluded. When the quantity of the cutting is more than sufficient to make the embankment of the specified width, the surplus material may be wasted; but in every case where either borrowing or wasting is resorted to, the materials must be taken and deposited as the Engineer may approve.\n\n19. In places where the natural surface of the ground upon which the embankment is to rest, is covered with vegetable matter which cannot be burned off in clearing, and which would, in the opinion of the Engineer, impair the work, the same must be removed to his entire satisfaction. In the event of the line crossing muskogs or morasses, it may be deemed by the Engineer expedient that a platform of logs shall be formed under the embankment, of such width as will extend through and to not less than 6 feet beyond the side slopes, and 16 inches deep. The logs to range from 6 inches to 15 inches in diameter, and must be laid close together laterally and also longitudinally, as may be directed.\n\n20. Where the embankment is to be formed on side hill ground covered with pasture, the ground shall be deeply ploughed before the work is commenced; and where the slope is so steep as to endanger the slipping of the embankment, benches shall be cut in such manner as the Engineer may direct. If the ground is wet or spongy through springs or soaks, it shall first be thoroughly underdrained as the Engineer may see expedient. These drains will be constructed in a similar way to that in which ordinary land drains are sometimes made. A trench will first be dug to a minimum depth of four feet, and in the bottom of this trench, four or five cedar or spruce poles about three inches in diameter will first be laid by hand, breaking joint; over the poles will then be placed not less than three feet of small broken stone, not larger than ordinary road metal or good gravel ballast, over which will be deposited such material convenient to the place as the Engineer may approve of. The Contractor must find all the material required in these drains, and do all the work described. These drains must always be made with a sufficient longitudinal fall for the easy flow of the water.\n\n21. The embankments shall be 17 feet wide at formation level, and the slopes will generally have an inclination of one and a half horizontal to one perpendicular, but in their formation, whether for the railway or approaches to bridges or level crossings,\nample allowance must in the first instance be made by the Contractor, for all subsequent settlement or shrinkage, and particularly in the top width; and for this purpose the top, besides being kept higher than the levels given, shall be formed in the first instance wider than the specified dimensions, to such extent as may be deemed necessary, according to the height of the embankment and the nature of the materials of which it is formed, so that when it is thoroughly consolidated it will stand at least the full width required.\n\n22. The embankments will be made up with the materials from the line cuttings Borrow pits. and from side ditches, except where otherwise directed, when these are insufficient, the line cuttings will be widened, or materials procured from borrowing pits. All materials placed in the embankments must be approved by the Engineer; no stumps, logs or other perishable or unsuitable material shall be used, and no material shall be supplied without his concurrence until the cuttings are completed.\n\n23. The ditches at the sides of the embankments shall be cut with slopes not steeper than one and a half feet base to one foot perpendicular height. The top of the slopes nearest the Railway shall not be less than six feet from the foot of the embankments. These ditches shall be graded so as to carry off the water to the next natural water course, and where there is so much water as to form a strong current, the ditch shall be formed as far from the embankment as the Engineer may deem necessary for the safety of the latter. Special attention is called to those long stretches of the line on low lands subject to overflow to the depth of several feet from high floods in the rivers, as shown on the profile; no side ditches will be allowed in such places, and the embankments will have to be made from the most convenient borrow pits that can be found at either end. This can only be done by train, and a temporary track will be required. In some cases where the overflow is shallow, as on part of Maria Island, borrow pits may be dug at intervals, but not nearer the embankment than 50 feet. No continuous ditch will be allowed as it would form a leading channel for the overflow and certainly prove destructive to the embankment within a very short period.\n\n24. In flat sections a berm shall be left between the roadway and ditch of such width as may be deemed expedient, but it shall in no case be less than six feet. Where drainage cannot be conveniently carried off by the side ditches, it will be necessary to excavate off-take ditches to a considerable distance beyond the limits of the Railway grounds. These off-take ditches shall be of such widths and depths as may be required and directed by the Engineer. They shall be sloped not steeper than one and a half horizontal to one perpendicular, and the materials shall be cast out so as to leave a berm of 6 feet between the deposit and the top of the slopes of the ditches. The Contractor shall also construct all other drains and ditches which the Engineer may deem necessary for the perfect drainage of the railway and works; he shall also make all necessary diversions of roads and streams as directed by the Engineer.\nTunnelling.\n\n25. The tunnelling will consist of \"Line Tunnels\" and \"Stream Tunnels\"; the former shall be formed to an exact minimum section according to drawing No. 9 and the latter to drawing No. 10. For the purpose of tendering the sectional area of \"Line Tunnels\" shall be calculated at 405 superficial feet, equal to 15 cubic yards to the lineal foot of Tunnel. The \"Stream Tunnels,\" where formed, shall be driven through the solid rock which, in some places, forms the sides of ravines, they must be formed in the manner to be pointed out in each case. Open cuttings at the ends will be excavated, to give an easy flow to the water; these open cuttings may be slightly curved, but the Tunnels proper must be perfectly straight from end to end, with the sides as smooth as practicable. The up-stream end in each Tunnel must generally be one foot lower than the bed of the stream opposite, and they must be driven with a proper inclination. Care must be taken to leave a solid pillar of rock between the Tunnel and the side of the ravine, equal (except in special cases) to not less than about double the diameter of the Tunnel. The thickness of solid rock over the Tunnel shall be similarly proportioned.\n\nCrib wharfing\n\n26. Crib wharfing will have to be resorted to at some points as noted on profile according to general drawing No. 42.\n\nRip-rap.\n\n27. Whenever the slopes of the embankments are liable to be washed by the overflow of streams, they will require to be protected by a rip-rap wall of stones carefully laid by hand to such thickness and height as may be directed by the Engineer, generally about 18 in. above high water level.\n\nRock facing.\n\n28. Special attention is called to those long stretches of embankment to be made on low lands subject to over-flow to a considerable depth. The slopes of these will require to be protected with rock facing, the stones for which will have to be quarried and brought by train or by water from a considerable distance.\n\nEmbankment at Port Moody.\n\n29. The slope of the embankment at Port Moody extends below water at high tide and will have to be protected with rip-rap of large well formed stone laid by hand.\n\nPublic roads\n\n30. At all public roadways, cattle-guards will be established and will be constructed according to drawing No. 13. The roadway between cattle-guards will be planked and the public road properly graded and gravelled as far as the limits of the Railway right-of-way. Under this heading the bridging of side ditches, fences from cattle-guards to the line fences of the Railway, also post and sign board, and everything necessary to complete the crossing, will be embraced. The fences connecting cattle-guards with right-of-way fences, will be post and board, or post and wire as per drawings.\n\nFarm crossings.\n\n31. Farm crossings will be established wherever required and directed. They will be constructed of cast iron rails, and will be provided with bridges, fences, and gates as required in the drawings.\nwill be graded, so as to form easy and convenient passages for farm traffic across the rails, and planked to the full extent of the Railway ties. The ditches will be properly bridged and gates of an approved design and with proper fastenings will be placed in the fences according to drawing No. 12.\n\n32. Roads constructed to and from any point on the line of Railway for the convenience of the Contractor, for the conveyance of material or otherwise, must be at his own risk, cost and charges.\n\n33. Wherever the line is intersected by public or private roads, the Contractor must keep open at his own cost convenient passing places, and he shall be held responsible for keeping all crossings during the progress of the works in such condition as will enable the public to use them with perfect safety, and such as will give rise to no just ground for complaint. Contractors will be held liable for any damages resulting from negligence on their part or that of their men.\n\nTruss Bridges.\n\n34. The Railway will in most cases be carried over the larger streams by wooden superstructures supported on abutments and piers, of timber framing, on pile foundations. The pile foundation will, wherever practicable, be made suitable for permanent structures.\n\n35. In some cases crib abutments and piers filled with stone may be allowed. The cribs must be constructed in the most substantial manner of tamarack or other suitable timber; outside timbers to be not less than 12 inches square, halved together at the angles, and properly secured with drift bolts of iron; the ties may be of flatted timber, dove-tailed into face timbers and bolted. The sloping faces of the cut waters to piers must be of square timber laid with one side in the line of the rake of the cut water, and be halved at angles; the faces of the cut waters will be covered with hardwood timber 8 inches thick, well fastened to the cribwork with spikes or rag-bolts. The whole of the abutments and piers to be finished in accordance with plans, and to the satisfaction of the Engineer.\n\n36. The superstructures will be of the most approved Howe or Pony Truss pattern, the former built of Douglass fir of approved quality, with cast-iron or white oak keys, cast iron prisms and wrought iron rods with up-set ends, the whole to be first-class material and workmanship. The parts that are inaccessible after the structures are erected, are to receive one good coat of paint of approved quality as soon as framed, and a second coat when the work is put together. Drawings Nos. 20, 21, 22, 23 and 24 are prepared to suit each span or bridge, and to which the Contractor must work. These bridges must be executed in a thoroughly substantial and workmanlike manner, and shall be completed in every respect, including painting.\n\nPile Bridges.\n\n37. Wherever the circumstances of the case require the adoption of bridges,\non piles, they will be erected according to the following, drawing No. 19, or special drawing. Each bent will be composed of piles, as shown in the drawings. The piles shall be of tamarac, Douglas fir or other approved timber and of sufficient size at the butt or larger end to square not less than 12 inches, and for long piles 14 inches. They must be perfectly sound and straight, sawed or hewed to these dimensions, and be of such lengths as circumstances may require. The piles must be driven by a hammer weighing 1,500 lbs. or upwards, until they reach perfectly firm ground. They will generally be tested by the hammer falling 24 feet at the last blow under which they should not yield more than two inches. Care must be taken to have them driven truly, so that the caps and braces may be properly framed and bolted to them. The spur piles must be curve-pointed, so that as they are driven they will gradually come to the proper inclination. Before being driven the piles must be sawed or chopped off square at the butt, and tapered to a blunt point at the smaller end. Should there appear to be any danger of splitting, the heads must be bound with iron hoops, and if necessary the points be properly shod. The stringers, which will be of Douglas fir or other approved timber, must be bolted together and to the corbels and caps. The stringers must be of sufficient length to reach over two spans, and break joints alternately inside and out. The bank stringers will be 12 inches by 12 inches. The whole to be covered by special ties 9 inches by 8 inches.\n\n**Trestle Bridges.**\n\n38. The structures for the passage of small streams, or for crossing dry ravines, will generally be trestle work built in accordance with the general drawings Nos. 14, 15, 16, 17, and 18. The timber used in these bents may be Douglas fir, pine, tamarac, or other suitable timber, in proportions approved by the Engineer, and of the dimensions shown on the drawings. They will be set on mud sills placed in trenches of sufficient depth to insure a foundation that will not be affected by frost or the wash of the streams, and when properly levelled as to the grade height, &c., earth and stones shall be firmly packed round them. The bents will be spanned by stringers as described above for pile bridges. In marshy or springy ground, a single or double row of piles shall be driven for each bent. The piles will average not less than 12 inches diameter, of suitable timber approved by the Engineer and driven home so as to afford a secure foundation.\n\n39. In some cases log culverts will be adopted according to the general drawings, No. 25.\n\n**Masonry.**\n\n40. The masonry shall not be started at any point before the foundation has been properly prepared, nor until it has been examined and approved by the Engineer, nor until the Contractor has provided a sufficient quantity of proper materials and plant to enable the work to be proceeded with regularly and systematically.\n\n41. The stone used in all masonry on the line of Railway must be of a durable\ncharacter, large, well proportioned, and well adapted for the construction of substantial and permanent structures; parties tendering must satisfy themselves as to where fitting material for the masonry can be most conveniently procured.\n\n42. Bridge and nearly vertical retaining wall masonry, shall generally be in regular courses of large, well-shaped stones, laid on their natural beds; the beds and vertical joints will be dressed, so as to form quarter inch joints. The vertical joints will be dressed back square 9 inches, the beds will be dressed perfectly parallel throughout. The work will be left with the \"quarry face,\" except the outside arrises, strings and coping, which will be chisel-dressed.\n\n43. The courses will not be less than 12 inches; and they will be arranged in preparing the plans to suit the nature of the quarries, courses may range up to 24 inches, and the thinnest courses invariably be placed towards the top of the work.\n\n44. Headers will be built in every course not farther apart than 6 feet; they will have a length in line of wall of not less than 24 inches, and they must run back at least three times their height, unless when the wall will not allow this proportion, in which case they will pass through from front to back. Stretchers will have a minimum length in line of wall of 30 inches, and their breadth of bed will at least be 1½ times their height. The vertical joints in each course must be arranged so as to overlap those in the course below 10 inches at least. The above dimensions are for minimum courses of 12 inches, the proportions will be the same for thicker courses.\n\n45. The quoins of abutments, piers, &c., shall be of the best and largest stones, and have chisel drafts properly tooled on the upright arris, from two to three inches wide, according to the size and character of the structure.\n\n46. Coping stones, string courses and cut-waters shall be neatly dressed in accordance with plans and directions to be furnished during the progress of the work.\n\n47. The bed stones for girders shall be the best description of sound stone, free from drys or flaws of any kind, they must be not less than 12 inches in depth for the smaller bridges, and eight feet superficial area on the bed. The larger bridges will require bed stones of proportionately greater weight; these stones shall be solidly and carefully placed in position, so that the bridge will sit fair on the middle of the stones.\n\n48. The backing will consist of flat-bedded stone, well shaped, having an area of bed equal to four superficial feet or more. Except in high piers or abutments, two thicknesses of backing stone, but not more, will be allowed in each course, and their joints must not exceed that of the face work. In special cases, where deemed necessary by the Engineer to insure stability, the backing shall be in one thickness; the beds must, if necessary, be scabbled off, so as to give a solid bearing. No pinning will be admitted. Between the backing and face stones there must be a good square joint, not exceeding one inch in width, and the face stones must be scabbled off to allow\nthis. In walls over three feet in thickness, headers will be built in front and back alternately, and great care must be taken in the arrangement of the joints so as to give perfect bond.\n\n49. Culvert Masonry shall be built of good, sound, large flat-bedded stones, laid in horizontal beds. It may be known as Random, or broken coursed work. The stones employed in this class of masonry will generally be not less in area of bed than three superficial feet, nor less in thickness than eight inches, and they must be dressed so as to give good beds with half-inch joints. In smaller structures, and in cases where stones of good size and thickness cannot be had, they may, if in other respects suitable, be admitted as thin as five inches. All stones must be laid on their natural beds.\n\n50. Headers shall be built in the wall, from front and back alternately, at least one in every five feet in line of wall, and frequently in the rise of wall. In the smallest structures headers shall not be less than twenty-four inches in length, and the minimum bed allowed for stretchers shall be twelve inches. In the larger structures all stones must be heavier in proportion. Every attention must be paid to produce a perfect bond, and to give the whole a strong, neat, workmanlike finish.\n\n51. Wing walls will generally be finished with steps, formed of sound durable stone, and not less than from 10 to 12 inches thick, and 6 feet superficial area; other walls will be covered with coping of a similar thickness, and of seven feet or upwards, superficial area. These coverings will be neatly dressed when required, and as may be directed. The walls of the box culverts will be finished with stones the full thickness of wall, and the covers will be from 10 to 15 inches thick, according to the span; they must have a bearing of at least 12 inches on each wall, and they must be fitted sufficiently close together to prevent the earth from falling through.\n\n52. The bottoms of culverts will be paved with stones set on edge, to a moderately even face, packed solid, the interstices being also well packed. The paving will be from 9 to 12 inches deep.\n\n53. Mortar shall be of hydraulic lime or cement, and common lime.\n\n54. Hydraulic lime mortar will be used unless otherwise directed in building all masonry, from the foundations up to a line two feet above the ordinary level of the stream. It will be used also in laying girder beds, coping, covering of walls generally, in lipping and in pointing. The hydraulic lime or cement must be fresh ground, of the best brand, and it must be delivered on the ground, and kept till used in good order. Before being used, satisfactory proof must be afforded the Engineer its hydraulic properties, as no inferior cement will be allowed.\n\n55. Common lime mortar must be made of the best common lime and will be employed in all masonry (except dry) where cement is not directed to be used.\n\n56. Both cement and lime must be thoroughly incorporated with approved propor-\ntions of clean large-grained sharp sand. The general proportions may be one part of lime to two parts of sand, but this may be varied according to the quality of the lime or cement. Mortar will be only made as required, and it must be prepared and used under the immediate direction and to the satisfaction of an Inspector, by the Contractor's men, failing which the Inspector may employ other men to prepare the mortar, and any expense incurred thereby shall be borne by the Contractor. Grout shall be formed by adding a sufficient quantity of water to well tempered and well proportioned mortar.\n\n57. When mortar is used, every stone must be set in a full bed and beaten solid; Grouting. the vertical joints must be flushed up solid, and every course must be perfectly level and thoroughly grouted.\n\n58. In all walls built in common lime, the exposed faces will have a four-inch lip- Lipping. ping of cement.\n\n59. All masonry must be neatly and skilfully pointed, but if done out of season, Pointing and protection in winter. or if from any other cause it may require repointing before the expiration of the contract, the Contractor must make good and complete the same at his own cost. Work left unfinished in the autumn must be properly protected during the winter by the Contractor, at his risk and cost.\n\n60. Retaining wall (with a sharp batter on the face,) shall be built of dry ma- Retaining walls. sonry, and shall be formed of large well shaped stones hammered to form good bonds, and carefully laid to bond as in bridge masonry, but without mortar.\n\nFOUNDATIONS.\n\n61. Foundation pits must be sunk to such depths as the Engineer may deem Depths of proper for the safety and permanency of the structure to be erected; they must in all cases be sunk to such depths as will prevent the structures being acted on by the frost, or by nature; in some cases coffer damming, pumping and bailing will be necessary. The material excavated therefrom to be deposited in embankment, unless the Engineer directs otherwise.\n\nARTIFICIAL FOUNDATIONS.\n\n62. Foundation timbers where required will be of such dimensions and of such Timber. kinds as the Engineer may direct. The timber employed will be tamarac, hemlock, pine or Douglass fir from 3 to 6 inches thick or timber flatted on two sides only, and ranging from 6 inches to 12 inches thick. The faces of the flatted timber will at least measure as much as its thickness, and the bark will be removed from the sides not flatted.\n\n63. All spikes, bolts, straps or other iron work found necessary to be used on Iron. timber foundations, must be of the best quality of iron usually employed for similar purposes.\nPiling.\n\n64. Whenever the Engineer may direct piling to be done, the timber shall be in every respect sound and of such description as he may approve. Where he may think it necessary trial piles shall first be driven.\n\nHow to be driven.\n\n65. The piles shall be carefully and truly pointed, shod and hooped with iron as may be directed. They shall be driven to any depth the Engineer may deem expedient, and the weight of the hammer shall be 1,500 lbs. or upwards. They will generally be tested by the hammer falling 24 feet at the last blow, under which they shall not yield over 2 inches. The greatest care must be taken to drive the piles plumb or battered in such position and distances apart as are shown on the plan and as he may direct; any pile that may be damaged or too short or out of proper line when driven shall be taken up and replaced by another; the heads of the piles must not be injured in driving.\n\nConcrete.\n\n66. Whenever concrete is employed, it will be composed of hydraulic lime, clean sharp sand, and good gravel of approved quality and proportions. The proportion of sand and lime will be about the same as in mortar, and in making the concrete a sufficient quantity will be used with the gravel to fill up the interstices and render the mass when set perfectly solid and compact.\n\nTrack.\n\nRoad bed.\n\n67. Before track-laying and ballasting is commenced, the Contractor will fill up with dry material all hollows and wheel ruts in the road bed arising from settlement, or from being used as temporary roads by the Contractor, or other causes, and trim the surface to formation level rounded, as before described.\n\nSleepers.\n\n68. The sleepers or cross-ties must be of tamarack, hemlock, Douglas fir or other approved sound timber, smoothly hewed or sawed, free from all score-hacks, and chopped or sawed square at the ends, 8 feet long, flatted on two opposite sides to a uniform thickness of 6 inches, the flatted surface being not less than 6 in. on either side, at the small end, and when sawed they shall be 8 in. wide and 6 in. in depth. They must be placed as nearly as possible at a uniform distance of 24 in. between centres, and at right angles to the rails. Joint sleepers must have both an upper and under surface bearing of at least 8 in., and be placed directly under the joint according to drawing No. 40.\n\nFish plate Bolts.\n\n69. The Bolts, 3/4 in. diameter, 3½ in. long, to be made with cupped heads and square necks, in accordance with the drawing No. 41. The nuts are to be square.\n\nIron.\n\n70. The iron is to be of a tough fibrous quality, equal to \"Best refined Iron,\" and shall be subject to the approval of the Inspecting Engineer.\n\nWorkmanship.\n\n71. The workmanship and finish must be of the best description, great care being taken that the internal faces of the head and nut are exactly square with the axis of the Bolt.\n72. The bolt heads and necks must be solid. The threads of screws to be Whitworth's standard, ten to the inch, cleanly cut, to fit tightly into the nuts, and made so as to hold throughout their entire length.\n\n73. Samples to be submitted to and approved by the Engineer before the work is commenced, and the whole must be subject to close inspection at all times.\n\n74. The bolts and nuts are to be heated and dipped in oil to prevent rusting.\n\n75. The spikes are to be made from the best refined iron §ths of an inch square track spikes, and must on test be equal to being bent to a double without fracture.\n\n76. The spikes are to have a pressed head of the usual size and form, and the points chisel-sharpened. They will be 6 in. long over all and similar to sample to be seen in the office of the Engineer.\n\n77. The points, crossings, switches and signals are to be well and truly made of the best materials of their several kinds in accordance with the drawings Nos. 38 and 39; the points and crossings may be made out of the steel rails supplied by the Minister of Railways and Canals.\n\n78. The rails shall be laid to a gauge of 4 feet 8½ in. clear between the rails, and they shall be well and carefully fastened at the joints, which must be as near as possible opposite each other and on the same tie; special care must be taken at points and crossings to have the rails laid to a tight gauge. The rails must be full spiked, and on curves the outer rail shall be elevated according to the degree of curvature as follows, that is to say, on one degree curves 0·05 feet, on two degree curves 0·10 feet, on three degree curves 0·15 feet, on four degree curves 0·20 feet, on five degree curves 0·25 feet, on six degree curves 0·30 feet. The rails shall be handled with care, and before being run over by either engine or cars shall be full sleepered and surfaced. Every precaution shall be taken to prevent them getting bent during the progress of the ballasting.\n\n79. The Contractors shall lay all sidings and put in all points and crossings complete, embracing wing and guard rails, connecting rods, head blocks, switch signal frames, and gearing. The sidings will range generally from 1,200 to 2,000 feet in length.\n\n80. The Contractors shall remove from the track and straighten all bent and damaged rails, and make good all injuries done before the works are finally accepted; and further, they will be held responsible for all materials provided them, and give a receipt for the same upon taking delivery.\n\nBALLASTING.\n\n81. The surface of ballast pits shall be stripped of soil where such exists, and no stripping material whatever shall be placed on the road bed but good clean gravel, free from\nearth, clay, loam, or loamy sand; no large stones shall be allowed. The maximum size of gravel must not be greater in diameter than 3 in. In unloading the ballast, the train must be kept moving to and fro so as to thoroughly mix the different qualities of ballast, until a sufficient quantity is deposited. The track must then be raised so that there will be not less than 6 in. beneath the sleepers, and the ballast must be well beaten and packed under and around them. As the raising proceeds the end of the lift shall extend over not less than three rail lengths, and before trains are allowed to pass over the inclined portion of track, it must be made sufficiently solid to prevent bending the rails, or twisting the rail joints. After the lift, the track shall be centred, lined, topped, surfaced and trimmed off to a proper form and width, according to drawing No. 41.\n\n**Wharf at Port Moody.**\n\n**Description.**\n\n82. A wharf shall be constructed at Port Moody, in accordance with plan No. 26. The piles shall be of tamarac or other approved timber and of sufficient size at the butt or larger end to square not less than 12 to 14 inches and not less than 10 inches in diameter at the small end. They must be perfectly sound and straight, and be of such lengths as circumstances may require. The piles must be driven by a hammer weighing 1,500 lbs., or upwards, until they reach perfectly firm ground. They will generally be tested by the hammer falling 24 feet at the last blow, under which they should not yield more than 2 inches. Care must be taken to have them driven truly, so that the caps and braces may be properly framed and bolted to them. The spur piles must be curve-pointed, so that as they are driven they will gradually come to the proper inclination. Before being driven the piles must be sawed or hewed to these dimensions, chopped off square at the butt, and tapered to a blunt point at the smaller end. Should there appear to be any danger of splitting, the heads must be bound with iron hoops, and if necessary the points be properly shod. The stringers which will be of Douglas fir or other approved timber, must be bolted together and to the corbels and caps. The stringers must be of sufficient length to reach over two spans, and break joints alternately inside and out. The whole will be covered as shown in the plan, and well spiked down.\n\n**Station Buildings, &c.**\n\n**Way Stations**\n\n83. A combined Passenger and Freight House shall be erected at each Way Station, in accordance with drawing No. 34.\n\n**Terminal Stations.**\n\n84. A Passenger Station in accordance with drawing No. 35, and a Freight House in accordance with drawing No. 36, shall be erected at the terminus at Port Moody.\n\n**Water service.**\n\n85. An ample supply of good water shall be provided at Port Moody, and at each alternate Way Station, with frost proof Elevated Tank fitted up with the requisite machinery, pumps, pipes, valves, and all other necessaries, and in complete running order in accordance with drawing No. 37.\n86. The list of plans referred to in the specification is composed of 43 drawings.\n\n**GENERAL PROVISIONS.**\n\n87. The track shall be left by the Contractors with everything complete, and well surfaced. The ballast shall average not less than 1,500 cubic yards per mile, and shall be dressed off to the form required, and the whole shall be executed according to the directions and to the approval of the Engineer or other officer duly appointed.\n\n88. At any time after the rails are laid and the track be required for public traffic, the Government will be at liberty to use it for that purpose and to regulate the running of all trains, so as to ensure safety.\n\n89. All station grounds shall be cleared to the extent heretofore mentioned and graded to the levels given by the Engineer and drained to his satisfaction.\n\n90. Before the works are finally accepted, the Contractor shall make good all slides, slips and defects, and shall finish up all cuttings and embankments, repair all damages by frost, freshets, or other causes; dress slopes to the required angle; clean out all ditches and drains; and complete all the works connected with the formation of the Railway and covered by the contract in a creditable and workmanlike manner, in accordance with the directions and to the entire satisfaction of the Engineer.\n\n91. The works are to be commenced and proceeded with as soon as practicable, after the person or persons whose \"Tender\" may be accepted, shall have entered into the contract. The whole of the works shall be completed and the line in good running order by the thirtieth day of June, one thousand eight hundred and eighty five.\n\n**TENDERS, ETC.**\n\n92. No tender will be entertained unless on one of the printed forms prepared for the purpose, and with the Schedule of Prices filled in; nor unless a Bank Cheque, marked good by the Bank, for $20,000 accompanies the Tender, which shall be forfeited if the party tendering, declines or fails to enter into the contract for the works when called upon to do so, upon the tender being accepted. In the event of a tender not being accepted, the Cheque will be returned.\n\n93. The Tender must specify the bulk sum for which the work described and shown on the plans, profile and specification, will be constructed. The Schedule of Prices attached to the Tender is to assist the Engineer in preparing the monthly progress certificates and to be applied to the diminutions of, and increases in the quantity of work caused by the change of grade or line of location; but such schedule is in no way whatever to vary the condition of the contract, which is the payment of a bulk sum for the entire completion of the whole section contracted for in accordance with the plans, profiles and specification.\n94. For the due fulfilment of the contract, satisfactory security will be required immediately on a tender being accepted, by deposit of money, or Canadian Pacific Railway Land Grant Bonds at 90 per cent., to the amount of five per cent. on the bulk sum of the contract, of which the sum sent in with the tender will be considered a part.\n\n95. The person or persons whose tender is accepted shall execute at once a contract under seal, similar in its provisions to the form of indenture hereto annexed, and it will be assumed that parties tendering have made themselves perfectly familiar with its contents; and further, may contain such special provisions as the said Minister may determine.\n\nCOLLINGWOOD SCHREIBER,\nChief Engineer,\n\nCANADIAN PACIFIC RAILWAY OFFICE,\nDEPARTMENT OF RAILWAYS AND CANALS,\nOTTAWA, 1st December, 1881.\nCANADIAN PACIFIC RAILWAY.\n\nPORT MOODY TO EMORY'S BAR.\n\nList of Drawings referred to in Specification and attached to the Contract.\n\nNo. 1—Plan of the line of location from Port Moody to Harrison River.\n\" 2. \" \" \" \" Harrison River to Emory's Bar.\n\" 3.—Profile of the line of location from Port Moody to Harrison River.\n\" 4. \" \" \" \" Harrison River to Emory's Bar.\n\" 5. Ground plan of the terminal station and wharf at Port Moody.\n\" 6. General cross sections of the line in earth cutting,\n\" 7. \" \" \" \" rock\n\" 8. \" \" \" \" embankment.\n\" 9.—Cross section of line tunnels in rock.\n\" 10. \" stream tunnels in rock.\n\" 11. Plan of fencing.\n\" 12. \" and gates for farm road crossings.\n\" 13. Plans of level crossings and cattle-guards at public roads.\n\" 14.—General plan and section of trestle bridging with bents 10 ft. apart.\n\" 15. \" \" \" \" 15 ft. single deck.\n\" 16. \" \" \" \" 15 ft. double deck.\n\" 17. \" \" \" \" 20 ft. single deck.\n\" 18. \" \" \" \" 20 ft. double deck.\n\" 19. \" \" of pile bridging.\n\" 20. \" of Howe Truss Bridge, 100 ft. span.\n\" 21. \" \" \" \" 125 \"\n\" 22. \" \" \" \" 150 \"\n\" 23. \" \" \" \" 200 \"\n\" 24. \" Pony Truss\n\" 25. \" of log culvert.\n\" 26. Plan and sections of wharf at Port Moody.\n\" 27. \" of bridging at Pitt River.\n\" 28. \" of \" at Stave River.\n\" 29. \" of \" at Harrison River.\n\" 30. \" of \" at Maria Slough Station, 577 to 585.\n\"31. Plan and sections of bridge over ravine and stream at Station 1506 (Harrison River & Emory.)\n\"32. \" \" \" \" river at \" 1664 \" \"\n\"33. Ground plans of Station grounds.\n\"34. General plan of combined passenger and freight house.\n\"35. Plan of passenger station at Port Moody.\n\"36. \" freight house at Port Moody.\n\"37. \" water tank.\n\"38. \" crossings.\n\"39. \" switch gear.\n\"40. \" track and ballast.\n\"41. \" Fish plate bolts.\n\"42. General plan of crib wharfing.\n\"43. \" Swing Bridge.\n\nCOLLINGWOOD SCHREIBER,\nChief Engineer.\n\nCanadian Pacific Railway Office,\nDepartment of Railways and Canals,\nOttawa, 1st December, 1881.\nThis Indenture made the.........................................\n\nday of ................................................................. One thousand eight hundred\n\nand ......................................................................................................................\n\nBETWEEN ...........................................................................................................\n\n................................................................................................................................\n\n................................................................................................................................\n\n................................................................................................................................\n\n................................................................................................................................\n\nhereafter called \"the Contractor\" of the first part, and Her Majesty Queen Victoria represented herein by the Minister of Railways and Canals of Canada, of the second part,\n\nWITNESSETH, that in consideration of the covenants and agreements on the part of Her Majesty hereinafter contained, the Contractor covenant and agree with Her Majesty as follows:\n\n1. In this Contract the word \"work\" or \"works\" shall, unless the context require a different meaning, mean the whole of the work and materials, matters and things required to be done, furnished and performed by the Contractor under this Contract. The word \"Engineer,\" shall mean the Chief Engineer for the time being having control over the work, and shall extend to and include any of his assistants acting under his instructions, and all instructions and directions, or certificates given, or decisions made by any one acting for the Chief Engineer, shall be subject to his approval, and may be cancelled, altered, modified and changed, as to him may seem fit.\n\nThe word \"Minister,\" means the Minister or acting Minister of Railways and Canals for the time being, and extends to and includes his lawful Deputy.\n\nThis Contract is made upon the distinct understanding that the Contractor has\nsatisfied himself respecting the nature of the country through which the works are to be built, the character and formation of the soil, both on the surface and underneath, the climate and kind of weather to be expected, the quantities of the various embankments, excavations, foundations and all other works whatsoever; the means of access and egress, to and from the works, the nature, kinds, qualities and cost of the various materials, plant and labor required for the works, and generally, respecting every matter or thing which may in any way affect the carrying out of this Contract or the cost of the works contracted for. No information obtained by or for the Contractor from any of Her Majesty's Ministers, Officers, Engineers, Agents or Servants, or from any other person, shall relieve the Contractor from any risks or from the entire fulfilment of this Contract, or shall give him any claim or right, equitable or otherwise, against Her Majesty in addition to his claims and rights under the express provisions of this Contract.\n\n2. All covenants and agreements herein contained shall be binding on and extend to the Executors and Administrators of the Contractor and shall extend to and be binding upon the successors of Her Majesty, and wherever in this contract Her Majesty is referred to, such reference shall include her successors, and wherever the Contractor referred to, such reference shall include Executors and Administrators.\n\n3. The Contractor will, with the exceptions hereinafter named, at own expense, provide all and every kind of labour, machinery, plant, lands for borrow pits, ballast pits, spoil banks and other purposes, temporary or otherwise, required for the works or in the construction thereof, and materials, articles and things whatsoever necessary for the due execution and completion of all and every the works set out or referred to in the Specifications hereunto annexed, and set out or referred to in the plans and drawings prepared and to be prepared for the purposes of the work, and will execute and fully complete the respective portions of such works and deliver the same complete to Her Majesty, on or before the\n\nTime of completion.\n\n30 June 185—\n\nMaterial and workmanship.\n\nThe said work to be constructed of the best materials of their several kinds, and finished in the best and most workmanlike manner, in the manner required by and in strict conformity with the said specifications and drawings now prepared and which may from time time be furnished, and to the complete satisfaction of the Engineer.\n\nExceptions.\n\n4. The exceptions above alluded to are (1) the land for the right of way and station grounds, (2) the rails and fish plates for the track. The said land is to be procured by Her Majesty from time to time as the Engineer may think it is required,\nfor the prosecution of the works, and the rails and fish plates are to delivered to the Contractor at the ships rail, at Port Moody, from time to time, as the Engineer may think they are required for the works.\n\n5. The aforesaid specification, plans and drawings, prepared and to be prepared, and the several parts of this Contract shall be taken together, to explain each other, and to make the whole consistent; and if it be found that anything has been omitted or mis-stated, which is necessary for the proper performance and completion of any part of the work contemplated, the Contractor will at own expense, execute the same as if it had been properly described, and the decision of the Engineer shall be final as to any such error or omission, and the correction of any such error or omission shall not be deemed to be an addition to, or deviation from, the works hereby contracted for.\n\n6. The Engineer, with the sanction of the Minister, but not otherwise, shall be at liberty at any time, either before the commencement or during the construction of the works or any portion thereof, to order any work to be done, and to make any changes which he may deem expedient in the grades, the width of cuttings and fillings, the dimensions, character, nature, location, or position of the works, or any part or parts thereof, or in any other thing connected with the works, whether, or not, such changes increase or diminish the work to be done, or the cost of doing the same, and the Contractor shall immediately comply with all written requisitions of the Engineer in that behalf, but the Contractor shall not make any change in or addition to, or omission, or deviation from the works, unless directed by the Engineer, with the sanction of the Minister, and shall not be entitled to any extra payment by reason of any change, addition, or deviation, unless such change, addition or deviation, shall have been first directed in writing by the Engineer, with the sanction of the Minister, and notified to the Contractor in writing, nor unless the Engineer certifies in writing that such change, addition or deviation increases the cost of the work, and specifies in writing the nature of the increase and the quantities and measurements thereof. The decision of the Engineer in that behalf shall be final, and the obtaining of his certificate shall be a condition precedent to the right of the Contractor to be paid therefor. If the Engineer certifies in writing that such change, addition or deviation increases the cost of the work, and specifies in writing the nature of the increase and the quantities and measurements thereof, the Contractor shall be paid, in addition to the contract price mentioned in this Contract for the works, such sum as may be certified to by the Engineer as being the value of such increase, calculated according to the rates for the various classes of work set out in the schedule hereto annexed, and should the increase contain work of a class not specified in the said schedule, such unspecified work shall be calculated according to a rate therefor to be fixed by the Engineer. If the Engineer certifies in writing that any such change, addition, omission or deviation diminishes the cost of the work, and specifies in writing the nature of the decrease and the quantities and measurements thereof, the decision of the Engineer in that behalf shall be final, and there shall be deducted from the contract...\nprice mentioned in this Contract for the works, such sum as may be certified to by the Engineer as being the amount of such decrease, calculated according to the rates for the various classes of works set out in said schedule or fixed by the Engineer, as aforesaid, as the case may be.\n\n7. That all the clauses of this Contract shall apply to any changes, additions or deviations, in like manner, and to the same extent, as to the works at present projected, and no changes, additions, deviations or variations shall annul or invalidate this contract.\n\n8. That the Engineer shall be the sole judge of work and material in respect of both quantity and quality, and his decision on all questions in dispute with regard to work or material, as to the meaning or intention of this Contract and the plans, specifications and drawings shall be final, and no works, or extra or additional works or changes shall be deemed to have been executed, nor shall the Contractor be entitled to payment for the same, unless the same shall have been executed to the satisfaction of the Engineer, as evidenced by his certificate in writing, which certificate shall be a condition precedent to the right of the Contractor to be paid therefore.\n\n9. It is hereby distinctly understood and agreed, that the respective portions of the works set out or referred to in the schedules of rates or prices for the different kinds of work mentioned in paragraph No. 6, include not merely the particular kind of work or materials mentioned in said schedule, but also all and every kind of work, labor, tools, and plant, materials, articles and things whatsoever necessary for the full execution and completing ready for use of the respective portions of the works to the satisfaction of the Engineer. And in case of dispute as to what work, labor, materials, tools, and plant are or are not so included, the decision of the Engineer shall be final and conclusive.\n\n10. A competent foreman is to be kept on the ground by the Contractor during all the working hours, to receive the orders of the Engineer, and should the person so appointed be deemed by the Engineer incompetent, or conduct himself improperly, he may be discharged by the Engineer, and another shall at once be appointed in his stead; such foremen shall be considered as the lawful representative of the Contractor, and shall have full power to carry out all requisitions and instructions of the said Engineer.\n\n11. In case any material, or other things in the opinion of the Engineer not in accordance with the said several parts of this Contract, or not sufficiently sound, or otherwise unsuitable for the respective works, be used for or brought to the intended works, or any part thereof, or in case any work be improperly executed, the Engineer may require the Contractor to remove the same, and to provide proper material or other things, or properly re-execute the work, as the case may be, and thereupon the Contractor shall and will immediately comply with the said requisition, and if twenty-four hours shall elapse and such requisition shall not have been complied with, the Engineer may cause such material, or other things, or such work, to be removed; and in any such case the Contractor shall pay to Her Majesty all such damages and\nexpense as shall be incurred in the removal of such material, materials, or other things, or of such work; or Her Majesty may, in her discretion, retain and deduct such damages and expenses from any amounts payable to the Contractor.\n\n12. All machinery and other plant, materials and things whatsoever, provided by the Contractor for the works hereby contracted for, and not rejected under the provisions of the last preceding clause, shall from the time of their being so provided become, and until the final completion of the said works, shall be the property of Her Majesty for the purposes of the said works, and the same shall on no account be taken away, or used or disposed of except for the purpose of the said works, without the consent in writing of the Engineer, and Her Majesty shall not be answerable for any loss or damage whatsoever which may happen to such machinery or other plant, material or things, provided always that upon the completion of the works and upon payment by the Contractor of all such moneys, if any, as shall be due from to Her Majesty such of the said machinery and other plant, material and things as shall not have been used and converted in the works, and shall remain undisposed of shall, upon demand, be delivered up to the Contractor, but if the Contractor be indebted to Her Majesty, the same may be held by Her Majesty as security for such indebtedness and may be sold and disposed of, and the proceeds applied towards payment of such indebtedness.\n\n13. If the Engineer shall at any time consider the number of workmen, horses, or quantity of machinery or other plant, or the quantity of proper materials, respectively employed or provided by the Contractor on or for the said works, to be insufficient for the advancement thereof towards completion within the limited times, or that the works are, or some part thereof is not being carried on with due diligence, then in every such case the said Engineer may, by written notice to the Contractor, require to employ or provide such additional workmen, horses, machinery or other plant, or materials, as the Engineer may think necessary, and in case the Contractor shall not thereupon within three days, or such other longer period as may be fixed by any such notice, in all respects comply therewith, then the Engineer may, either on behalf of Her Majesty, or if he see fit, may, as the agent of and on account of the Contractor, but in either case at the expense of the Contractor, provide and employ such additional workmen, horses, machinery and other plant, or any thereof, or such additional plant and materials respectively, as he may think proper, and may pay such additional workmen such wages, and for such additional horses, machinery or other plant, and materials respectively, such prices as he may think proper, and all such wages and prices respectively, shall thereupon at once be repaid by the Contractor, or the same may be retained and deducted out of any moneys at any time payable to the Contractor; and Her Majesty may use in the execution or advancement of the said work not only the horses, machinery, and other plant, and materials so in any case provided by any one on Her behalf, but also all such as may have been or may be provided by or on behalf of the said Contractor.\n14. In case the Contractor shall make default or delay in diligently continuing to execute or advance the works to the satisfaction of the Engineer, or in case the Contractor shall become insolvent, or make an assignment for the benefit of creditors, or neglect either personally or by a skilful and competent agent to superintend the works, then in any of such cases Her Majesty may take the work out of the Contractor's hands and either stop the same or employ such means and at such times as she may see fit to complete the work, and in such cases the Contractor shall have no claim for any further payment in respect of the works performed, but shall nevertheless remain liable for all loss and damage which may be suffered by Her Majesty by reason of the non-completion by the Contractor of the works; and all materials and things whatsoever, and all horses, machinery and other plant provided for the purposes of the works, shall remain and be considered as the property of Her Majesty for the purposes and according to the provisions and conditions contained in the twelfth clause hereof.\n\n15. The Contractor shall be at the risk of, and shall bear, all loss or damage whatsoever, from whatsoever cause arising, which may occur to the works, or any of them, until the same be fully and finally completed and delivered up to and accepted by the Minister; and if any such loss or damage occur before such final completion, delivery and acceptance, the Contractor shall immediately at own expense, repair, restore and re-execute the work so damaged, so that the whole works, or the respective parts thereof, may be completed within the time hereby limited.\n\n16. The Contractor shall not have or make any claim or demand, or bring any action or suit or petition against Her Majesty for any damage which may sustain by reason of any delay in the progress of the work, arising from the acts of any of Her Majesty's agents, and it is agreed that in the event of any such delay the Contractor shall have such further time for the completion of the works as may be fixed in that behalf by the Minister.\n\n17. The Contractor shall not make any assignment of this contract, or any sub-contract, for the execution of any of the works hereby contracted for; and in any event no such assignment or sub-contract, even though consented to, shall exonerate the Contractor from liability, under this contract, for the due performance of all the work, hereby contracted for. In the event of any such assignment or sub-contract being made then the Contractor shall not have or make any claim or demand upon Her Majesty for any future payments under this contract for any further or greater sum or sums than the sum or sums respectively at which the work or works so assigned or sub-contracted for shall have been undertaken to be executed by the assignee or sub-contractor; and in the event of any such assignment or sub-contract being made without such consent, Her Majesty may take the work out of the Contractor's hands, and either stop the same or employ such means and at such times as\nshe may see fit to complete the same; and in such case the Contractor shall have no claim for any further payment in respect of the works performed, but shall nevertheless remain liable for all loss and damage which may be suffered by Her Majesty by reason of the non-completion by the Contractor of the works; and all materials and things whatsoever, and all horses, machinery, and other plant provided by for the purposes of the works, shall remain and be considered as the property of Her Majesty for the purposes and according to the provisions and conditions contained in the twelfth clause hereof.\n\n18. Time shall be deemed to be of the essence of this contract.\n\n19. The Contractor shall be responsible for all damages claimable by any person or corporation whatsoever, in respect of any injury to persons or to lands, buildings, ships or other property, or in respect of any infringement of any right whatsoever, occasioned by the performance of the said works, or by any neglect or misfeasance or non-misfeasance on part, and shall and will at own expense, make such temporary provisions as may be necessary for the protection of persons, or of lands, buildings, ships or other property, or for the uninterrupted enjoyment of all rights of persons or corporations, in and during the performance of the said works.\n\n20. If the Contractor fail at any time in paying the salaries or wages of any person employed by upon or in respect of the said works, or any of them, and any part of such salary be one month in arrear, or if there be due to any such person one month's wages or salary, the Engineer may notify the Contractor to pay such salary or wages, and if two days elapse and the same be not paid in full up to the date of payment or to such other date as may be in accordance with the terms of employment of such person, then Her Majesty may pay to such person salary or wages from any date to any date, and to any amount which may be payable, and may charge the same to the Contractor, and the Contractor covenant with Her Majesty to repay at once any and every sum so paid.\n\n21. The Contractor will protect and will not remove or destroy or permit to be removed or destroyed, the stakes, buoys and other marks placed on or about the said works by the Engineers of the works, and shall furnish the necessary assistance to correct or replace any stake or mark which through any cause may have been removed or destroyed.\n\n22. Any notice or other communication mentioned in this Contract to be notified or given to the Contractor shall be deemed to be well and sufficiently notified or given, if the same be left at the Contractor office, or mailed in any Post Office to the Contractor or foreman, addressed to the address mentioned in this Contract, or to the Contractor last known place of business.\n\n23. And Her Majesty, in consideration of the premises, hereby covenants with the Contractor, that subject to the terms of this contract, will be paid for and in respect of the works, and in the manner set out in the next clause hereof, the sum of\nsubject to the increase or decrease thereof according to the terms of the sixth clause hereof.\n\nExcept as provided in the sixth clause hereof, the Contractor shall have no claim for additional price or remuneration in respect of any materials or workmanship alleged to be of a quality or cost superior or greater than those required by the specifications.\n\nPayments.\n\n24. Cash payments equal to about ninety per cent. of the value of the work done approximately made up from returns of progress measurements and computed at the prices set out on the schedule hereto annexed, or fixed by the Engineer for work not specified in said schedule, will be made to the Contractor monthly on the written certificate of the Engineer that the work for or on account of which the certificate is granted, has been duly executed to his satisfaction, and stating the value of such work computed as above mentioned—and upon approval of such certificate by the Minister, and the said certificate, and such approval thereof shall be a condition precedent to the right of the Contractor to be paid the same ninety per cent. or any part thereof. The remaining ten per cent. shall be retained until the final completion of the whole work to the satisfaction of the Engineer and acceptance thereof by the Minister, and within two months after such completion and acceptance the remaining ten per cent. will be paid. And it is hereby declared that the written certificate of the Engineer certifying to the final completion of said works to his satisfaction shall be a condition precedent to the right of the Contractor to receive or be paid the said remaining ten per cent., or any part thereof.\n\nMonthly estimates.\n\n25. It is intended that every allowance to which the Contractor fairly entitled, will be embraced in the Engineer's monthly certificates; but should the Contractor at any time have claims of any description which consider are not included in the progress certificates, it will be necessary for to make and repeat such claims in writing to the Engineer, within fourteen days after the date of each and every certificate in which allege such claims to have been omitted.\n\nClaims.\n\n26. The Contractor in presenting claims of the kind referred to in the last clause must accompany them with satisfactory evidence of their accuracy, and the reason why think they should be allowed. Unless such claims are thus made during the progress of the work, within fourteen days, as in the preceding clause, and repeated, in writing, every month, until finally adjusted or rejected, it must be clearly understood that they shall be forever shut out, and the Contractor shall have no claim on Her Majesty in respect thereof.\n27. The progress measurements and progress certificates are not to be taken as binding upon the Engineer or as final measurements, or as fixing final amounts, they are to be subject to the revision of the Engineer when making up his final certificate, and they shall not in any respect be taken as an acceptance of the work or a release of the Contractor from responsibility in respect thereof.\n\n28. Her Majesty shall have the right to suspend operations from time to time at any particular point or points or upon the whole of the works, and in the event of such right being exercised so as to cause any delay to the Contractor, then an extension of time equal to such delay or detention, to be fixed by the Minister as above provided for, shall be allowed to complete the Contract, but no such delay shall vitiate or void this Contract or any part thereof or the obligation hereby imposed or any concurrent or other bond or security for the performance of this Contract, nor shall the Contractor be entitled to any claim for damages by reason of any such suspension of operations. And at any time after operations have been suspended either in whole or part—such operations may be again resumed and again suspended and resumed as Her Majesty may think proper. And upon the Contractor receiving written notice on behalf of Her Majesty that the suspended operations are to be resumed, the Contractor shall at once resume the operations and diligently carry on the same.\n\nIf after a consideration of all the circumstances connected with the suspension and resumption of operations as above provided for, the Governor General in Council thinks proper to allow the Contractors a sum of money on account of any extra expenses to which they may have been put by reason thereof, the same shall be paid over to the Contractors only upon a receipt and release in full being given for all damages and claims in respect of such suspension and resumption of operations.\n\n29. Should the amount voted by Parliament and applicable towards payment for the work hereby contracted for, be at any time expended previous to the completion of the works, the Minister, for the time being, may give the Contractor written notice to that effect. And upon receiving such notice, the Contractor may, if he think fit, stop the work—but in any case shall not be entitled to any payment for work done, beyond the amount voted and applicable as aforesaid—unless and until the necessary funds shall have been voted by Parliament in that behalf. And in no event shall the Contractor have or make any claim upon Her Majesty for any damages or compensation by reason of the said suspension of payments, or by reason of any delay or loss caused by the stoppage of work.\n\n30. The Contractor shall not permit, allow or encourage the sale of any spirituous liquors on or near the works.\n\n31. No work whatever shall at any time or place be carried on during Sunday, and the Contractor shall take all necessary steps for preventing any foreman, or agent, or men from working or employing others on that day.\n32. It is hereby agreed that all matters of difference arising between the parties hereto, upon any matter connected with or arising out of this contract, the decision whereof is not hereby especially given to the Engineer, shall be referred to the award and arbitration of the Engineer, and the award of such Engineer shall be final and conclusive; and it is hereby declared that such award shall be a condition precedent to the right of the Contractor to receive or be paid any sum or sums on account, or by reason of such matters in difference.\n\n33. It is distinctly declared that no implied contract of any kind whatsoever, by or on behalf of Her Majesty, shall arise or be implied from anything in this contract contained, or from any position or situation of the parties at any time, it being clearly understood and agreed that the express contracts, covenants and agreements herein contained and made by Her Majesty, are and shall be the only contracts, covenants and agreements upon which any rights against Her are to be founded.\n\n34. This contract is hereby, pursuant to the provisions of the 8th section of the Statute, 41st Victoria (1878), chapter 5, made subject to the express condition that no Member of the House of Commons of Canada shall be admitted to any share or part of such contract, or to any benefit to arise therefrom.\n\n35. In the event of it becoming advisable in the interests of the public to suspend the work hereby contracted for, or any portion thereof, at any time before its completion, and to put an end to this contract, the Minister shall have full power to stop the work and to cancel this contract, on giving due notice to that effect to the Contractor. The Contractor, however, will be entitled to receive payment for all sums then due for work already done, materials used or delivered, or ready to be used, or in course of preparation, together with such reasonable compensation as will cover all bona fide damages, if any, resulting therefrom, and as may then be agreed upon; or, in case of disagreement, as may be determined by the Official Arbitrators of the Dominion of Canada; it being understood, however, that no compensation will be allowed to or claimed by the Contractor for materials procured for the works, after the date of the service of the notice above referred to, or for any loss of anticipated profits, either in respect of the works so suspended as aforesaid, or of the materials then procured for said works.\n\n36. It is distinctly declared and agreed that none of Her Majesty's Ministers, officers, engineers, agents or servants, have or shall have power or authority in any way whatever to waive on the part of Her Majesty any of the clauses or conditions of this contract, it being clearly understood that any change in the terms of this contract to be binding upon Her Majesty must be sanctioned by order of the Governor General in Council.\n\nIn Witness whereof, the Contractor has hereto set hand and seal and these presents have been signed and sealed by the said Minister, and countersigned by the Secretary of the Department of Railways and Canals, on behalf of the Contractor.\nbehalf of Her Majesty.\n\nSigned, Sealed and Delivered by\nthe Contractor in presence of\n\nSigned, Sealed and Delivered by\nthe Minister, and countersigned\nby the Secretary of Railways\nand Canals in the presence of\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_13610.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56670, "total-output-tokens": 18159, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1579, 3], [1579, 2685, 4], [2685, 5075, 5], [5075, 8108, 6], [8108, 11299, 7], [11299, 14473, 8], [14473, 17690, 9], [17690, 20679, 10], [20679, 23554, 11], [23554, 26597, 12], [26597, 29723, 13], [29723, 32724, 14], [32724, 35382, 15], [35382, 38249, 16], [38249, 40954, 17], [40954, 43985, 18], [43985, 46745, 19], [46745, 47575, 20], [47575, 48893, 21], [48893, 49505, 22], [49505, 51679, 23], [51679, 54499, 24], [54499, 57945, 25], [57945, 61226, 26], [61226, 64521, 27], [64521, 67598, 28], [67598, 70660, 29], [70660, 73363, 30], [73363, 76432, 31], [76432, 79580, 32], [79580, 79790, 33], [79790, 79790, 34]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]