[{"id": "1e9acd30e7b4e4f53c7b4459fad188cabb5e3ef7", "text": "The Institute has attempted to obtain the best original copy available for filming. Features of this copy which may be bibliographically unique, which may alter any of the images in the reproduction, or which may significantly change the usual method of filming, are checked below.\n\n- [ ] Coloured covers/\n- [ ] Covers damaged/\n- [ ] Covers restored and/or laminated/\n- [ ] Cover title missing/\n- [ ] Coloured maps/\n- [ ] Coloured ink (i.e. other than blue or black)/\n- [ ] Coloured plates and/or illustrations/\n- [ ] Bound with other material/\n- [ ] Tight binding may cause shadows or distortion along interior margin/\n- [ ] Blank leaves added during restoration may appear within the text. Whenever possible, these have been omitted from filming/\n\nAdditional comments:/ Commentaires supplémentaires:\n\nThis item is filmed at the reduction ratio checked below/ Ce document est filmé au taux de réduction indiqué ci-dessous.\n\n| Reduction Ratio | 10X | 14X | 18X | 22X | 26X | 30X |\n|-----------------|-----|-----|-----|-----|-----|-----|\n|                 | 12X | 16X | 20X | 24X | 28X | 32X |\n\nCover title is a photoreproduction from Queen's University, Kingston, Ont. There are some creases in the middle of the pages.\nThe copy filmed here has been reproduced thanks to the generosity of:\n\nUniversity of Saskatchewan\nSaskatoon\n\nThe images appearing here are the best quality possible considering the condition and legibility of the original copy and in keeping with the filming contract specifications.\n\nOriginal copies in printed paper covers are filmed beginning with the front cover and ending on the last page with a printed or illustrated impression, or the back cover when appropriate. All other original copies are filmed beginning on the first page with a printed or illustrated impression, and ending on the last page with a printed or illustrated impression.\n\nThe last recorded frame on each microfiche shall contain the symbol —► (meaning \"CONTINUED\"), or the symbol V (meaning \"END\"), whichever applies.\n\nMaps, plates, charts, etc., may be filmed at different reduction ratios. Those too large to be entirely included in one exposure are filmed beginning in the upper left hand corner, left to right and top to bottom, as many frames as required. The following diagrams illustrate the method:\n\n1 2 3\n\n1 2 3\n4 5 6\nEARLY\nMoral and Religious Education,\nBEING A LECTURE DELIVERED TO THE\nMECHANICS' INSTITUTE\nAND\nLIBRARY ASSOCIATION,\nBY THE\nREVD. JOHN COOK, D.D.\nMinister of St. Andrew's Church,\n\nQUEBEC\n\nPRINTED BY SINCLAIR AND POOLER,\n22, Mountain Street.\nEARLY\n\nMORAL AND RELIGIOUS EDUCATION,\n\nBEING A LECTURE DELIVERED TO THE\n\nMECHANICS' INSTITUTE\n\nAND\n\nLIBRARY ASSOCIATION,\n\nBY THE\n\nREV. JOHN COOK, D. D.\n\nMINISTER OF ST. ANDREW'S CHURCH,\n\nQUEBEC\n\n184\nEARLY\n\nMORAL AND RELIGIOUS EDUCATION,\n\nBEING A LECTURE DELIVERED TO THE MECHANICS' INSTITUTE\nAND LIBRARY ASSOCIATION, BY THE REV'D. JOHN COOK, D. D.\nMINISTER OF ST. ANDREW'S CHURCH, QUEBEC.\n\nIt is natural for an honest and right-minded dependent to feel peculiar anxiety, when a superior has entrusted him with something of special value and importance. There is in his mind a sense of responsibility connected with the charge,—an alarm lest any necessary care in respect of it should be neglected, any needful watchfulness relaxed,—lest by any accident misfortune should come over it while in his hands, and he be unable to render a satisfactory account of the trust that has been reposed in him. Such a sense of anxious responsibility, in respect of the charge committed to him, a parent, it would seem, is specially bound to feel. In the helpless little one which has just opened its eyes upon the light, and is as yet utterly incapable of the least effort for its own preservation, there are hidden the elements of a rational, a moral, an immortal nature. A being has commenced to which no end has been assigned. Yet a little, and the\nexercise of reason shall inform and irradiate that dim and wandering eye. Yet a little and passion shall sweep across that yet unconscious bosom: In that feeble form are planted, as if in embryo, and waiting only for development, those noble powers, in virtue of which man is but a little lower than the angels. Who but must look with solemn awe on the unconscious infant, while considering how unlimited the good he may do, or attain,—the evil he may do or suffer; above all, when taking into account, that he is an assured, predestined heir of immortality; and that according to the tenor of the course, which he has just begun, he shall hereafter be a seraph before the throne of God, or an outcast from all that is holy and happy in the universe? What trust can man give to man, to be compared in intrinsic value, or in the importance of its being discharged rightly, with that which Providence gives to a parent, to train and manage and care for such a being? Is it not reasonable that a sense of responsibility should be deeply fixed in the parent's mind,—an anxiety lest he should be wanting in the duty committed to him to do, and the precious jewel under his charge be marred or lost, through his ignorance, or negligence, or mismanagement? And should not the solemn reflection often recur to him, \"I am entrusted with the care and the training of a being who is to live forever?\"\n\nAssuredly there is no ground for the notion, which some parents would fain take up in order to lessen the painful sense of responsibility, that it is comparatively little which parents can do, to make or mar that which is entrusted to them. It is not so. Assuredly it is not so. Marvelous is that union, which by the ordination of Providence exists among\nmen, and the influence which they exercise, over the temporal happiness and the moral principles of one another. Strong and permanent in its results, especially, is that influence which a parent exercises over his child. The child is so entirely in the parent's hands. He is so completely subject to the parent's will. He is so dependent on his pleasure. He is so open to the force of his example. He is so accessible to the planting of those principles which the parent approves. He is so ready to adopt the maxims that are stamped with the parental sanction. He is so likely to fall into the habits of the household in which he is reared. Let no parent imagine for a moment that he can be simply harmless. That, his position renders altogether impossible. His influence, his precepts, his authority, his example must tell in one direction or another. What the future man, the future immortal, shall be, is assuredly very closely connected with the training and treatment which he receives at the parent's hands; and every parent therefore should take the deepest interest in the question, how the work of moral and religious education can best be begun, and be most effectually accomplished.\n\nIn shortly considering this question, suffer me first to guard you against attaching too limited a meaning to the word 'education.' To many minds that word conveys only the idea of imparting and receiving knowledge. And so, whenever it is mentioned, it conjures up a vision of books, and teachers and schools, and colleges, the necessary means, as is supposed of all good or valuable education. Now beyond all doubt, the imparting of knowledge is one part, and a most important part of education; and he does good service, who\neither points out, what knowledge is the most valuable to be obtained, or the means by which such knowledge may be most conveniently and successfully communicated. But the word 'education' has a far more extensive signification than the mere communication of knowledge to the mind. That is but one branch of education,—teaching. There is another equally, nay more important,—training. Between these it is very necessary we should distinguish. To teach is to communicate knowledge, to train is to establish habits. *To teach a child duty is to show him what is right.* *To train up a child in duty is to make him do what is right.* It would be preposterous to undervalue either of these, when both are necessary. A child must be taught. He must be made to know what is required of him. But the teaching will avail little, if it is not followed by training; if after the child knows what is required of him, he is not made to do it, and so regularly and constantly, that it shall become easy, natural, nay even necessary for him to do it. However clearly, by teaching, a soldier be made to comprehend what is the exercise required of him, it will avail little, unless by training, he be also accustomed to go through that exercise. And so, with moral teachers. However clearly, by teaching, you make a child know his duty, it will avail little, unless by training, you induce him to do his duty. By teaching you may commend yourself to his understanding and his conscience, and this it is well to do: but the impressions you make on these will speedily pass away, unless by training you establish in him the habit of acting according to the impressions which he has received.\n\nIt is only this second part of what is included in the term \"Education,\" that I mean at present to meddle with. What\ndoctrines of morals or religion should be taught to children; and how they should be taught; and by whom they should be taught, are all important questions. But they would scarcely bear discussion here. And any views, which any individual might give forth on them, would be likely to run counter to the established opinions of others. We keep therefore to what we may call a more catholic view of the subject, and in giving rules for early moral and religious education, we shall deal only with those general principles, which must be held alike by all, however different in religious profession or opinion. Among these rules, one very important, and very likely, it should seem, to be acceptable to all concerned, is that children should, as much as possible, be made happy.\n\nThere are two grounds on which we are warranted to consider this a wise and right rule.\n\nThe first is, the purpose of Providence that childhood should be happy;—a purpose plainly indicated by the provision which has been made to render it happy. Children are indeed so constituted, that they will enjoy a large share of happiness, unless very unfavourable external circumstances interfere to prevent it. There is in the young mind a well-spring of gladness, from which, unless some noxious element be cast into it, to embitter and poison it, the streams of happy enjoyment must and will flow. Now that, for which such provision is made, we may safely conclude to be urgent and necessary. Nor can it be other than our duty to further and protect that provision, as far as we have the means of doing so.\nThe second reason, why we should consider the rule laid down, wise and reasonable, is to be found, in the happy consequences which flow from it; is to be found in the fact, that in a happy childhood, those virtues of character, those good and kind and pious affections, by the existence and steady exercise of which, the true happiness of moral creatures can be most effectually secured, spring up most readily, and thrive most luxuriantly, and acquire most of strength and permanency. This is a matter of experience,—insomuch that we can say, not only, that provision has been made for the happiness of childhood, and that some good end must be served by it, but we can say, this good end it does actually serve. It is amidst the happiness which God has provided for childhood, that good principles can most easily be implanted, and cherished. Indeed it is mainly by cruelty and injustice, or by that foolish indulgence, which afterwards requires, and indeed leads of necessity, to what in the child's apprehension at least, is cruelty and injustice, that childhood is rendered miserable. And it is obvious that the feeling of being subjected to cruelty and injustice, necessarily gives rise to evil and unhappy tempers, and keeps them in that habitual exercise, which is so injurious to all moral principle.\n\nThere needs be no hesitation then, in laying down the rule, that children, in whom we desire to lay the foundation of moral and religious character, should be made, or rather should be kept, as happy as possible. There may be mistakes, however, in the application of this rule. There are two ways in which a parent may seek to comply with it. The one is indulging, the other is controlling his child. The one is for the\nparent to submit to the child. The other is for the child to be made subject to the parent. The former of these ways is as we all know, tried often. It appears the most natural, the most direct, easy, straightforward way to the accomplishment of the end. Indulge all a child's wishes, it is thought, and surely that will make the child happy. Perhaps it might. But it can never be put to the test, whether it would or not. There is a limit put to the parent's power, which totally prevents such an experiment from being tried. It is not given to any parent to indulge all his children's wishes. These wishes speedily extend far beyond what he has in his power to gratify. There is indeed one experiment, which may be tried, and which often is tried,—to gratify all a child's wishes as far as the parent can. And what is the result of this experiment? Why always the same result, that of making the child capricious, self-willed and wretched. So unvarying is this result, that no parent it might seem, truly seeking his children's happiness, would be foolish enough to seek it in that way. The truth is, however, that parents so indulgent are not solely, nor even chiefly animated by a regard to the happiness of their children. They are animated much more by a selfish regard to their own immediate ease and convenience. They are not, and cannot be ignorant, that the best way to make their children happy, is to regulate and control them. But the way of indulgence is for the moment easier, and so is preferred. It is as much their own indulgence, as the indulgence of their children which they seek; and thus they contrive to sow the seeds of future misery, both for their children and themselves.\n\nFor the truth of this, we may appeal to experience;—the\nexperience of all who have had opportunity of observing and comparing different families. In which family, supposing the parents to be alike kind and affectionate,—in which family is it, that the children are the happiest, and that the parents derive most happiness from the children? Is it where the will of the parent is weak and easily made to bow before the wishes and caprices of the children? Or where the parent's will is strong and must be yielded to;—where the parent's authority is recognised and established;—and there is felt by the child not only the rightness, but the necessity of a prompt obedience to his every mandate. In which family is there most to be looked for of contentment, and most of the joyous merriment of childhood? Why every one is constrained to pronounce in favour of the state of subjection, over that of rule on the part of the child. In the latter case, the child's wretchedness is almost infallibly the result,—the very affection of the parents leading to it. In the other the child's happiness is the result,—the steady though still affectionately exercised authority of the parent leading to it. It is not, as every one may know, who considers the matter,—it is not the mere tenderness of parental affection which will make children happy. It is far more the wise and steadfast exercise of power over them, constraining their wills to subjection and obedience. While the pining, the querulousness, the dissatisfaction, the endless caprices, the insatiable desires of children indulged and spoiled, necessarily destroy the comfort of the parents as well as their own.\n\nKeeping in view then, as an important end, in the moral cultivation of the minds of their children, that they should be made happy, parents must steadily contemplate the means,\nby which that end is to be attained. If they do so, they will speedily perceive, that while they should endeavour to remove from their children, whatever would mar the enjoyment intended for their period of existence, and while they should continually exercise towards them the most kind and warm affections, they are bound, in seeking their happiness, to do it, as occasion requires, by restraint,—by denying desired gratifications,—by correction and punishment,—by the steady, in short, and yet the kindly and affectionate exercise of authority.\n\nThe ignorance alike, of children, and their naturally capricious inclinations require such restraint and control.\n\nThe Divine government, it may be well to observe, is a parental government. And in the management of their own families, men may receive lessons from the government of Him, who is the Father and the Ruler of all the families of the earth. His end undoubtedly is to secure the happiness of his children. But in seeking that end he does not always indulge their wishes. He sometimes puts a restraint on them. He sometimes denies them. He controls and governs by fixed laws,—laws wise in their appointment, and steadily carried into execution. By these he puts on us a needful curb. And the more thorough our recognition of these laws, and the more complete our subjection to them, the happier we are. Now, so it should be with a parent, in the limited sphere in which he is placed. Happiness is the end he should have in view, steadily and habitually,—the happiness of his dependent household. But this happiness he is not to seek by granting every wish as it springs up; that indeed he cannot do; nor even by granting every wish which it is in his power to gratify; that he often should\nnot do; but by laying down well-considered rules, and steadily and constantly enforcing them, by such reward and punishments as are within his power. He should endeavor to imitate the system of the Divine government, in which nothing is capricious; in which all proceeds on fixed rules. Nothing in the government of children is so hurtful as caprice. To make them happy we must ourselves be guided by steady principle.\n\nBut assuming, that the happiness of childhood is to be made a distinct end, and that such happiness is best secured, by submission on the part of the child, a question arises for discussion,—and on which, for practical purposes, every hour of every day, a decision must be come to. That is, how is such submission to be enforced? On the sole ground of the parent's will? Or on that of reasons, to be made clear to the apprehension of the children? Is the parent's will to be purely despotic, neither submitting to be questioned, nor condescending to vindicate itself,—or is the reason of the child, in every case, to be addressed, and an attempt made at least, to gain its concurrence? There has been in the general mind some oscillation of sentiment, as to the answer which should be made to these questions. In former days, the principle of unchallengeable despotism, would have been most readily avowed. In these days, the principle of securing obedience by addressing the reason. Each, however, seems to involve an extreme to be avoided. The true course is to follow sometimes the one, sometimes the other.\n\nWith respect to the latter of them, the plan of always addressing the reason, and carrying along with us the convic-\ntions of children in favour of the rightness and the wisdom of the course we recommend and enjoin, three things may be said.\n\nFirst.—It is not always practicable. The reasons on which a parent grounds a command, or in virtue of which he enjoins some course of study or line of conduct, may be very good and sound and sufficient reasons. But they may be, and often they are, so complicated, so remote from the experience and apprehension of children, and they involve so many facts and considerations of which children are necessarily ignorant, that to them they may appear quite weak and insufficient. In point of fact, this is often the case. Every parent knows it to be so. And to limit the enforcement of obedience to those cases, in which he could clearly and satisfactorily show to his children the reasons on which he grounded his command, would be to restrain the exercise of his authority, in the very cases, in which the future interests of his children do most imperatively require it to be exercised.\n\nBut, Secondly, to address and convince the reason of children, even when practicable, is not always convenient. It would require much time and patience, even in the case of commands, in respect of which the mind is quite open to reason. Indolence and wilfulness are sharp casuists, and apt at finding arguments. Now for such encounter of wits or even for such calm exhibition of reasons however good and satisfactory, there is not time or opportunity amidst the cares and the business of the world. For the smooth and peaceful discharge of the common duties of life, there must, at least, in multitudes of cases, be between the superior and the inferior, and especially between the parent and the child,\nsimple command on the one hand, and prompt and unhesitating obedience on the other.\n\nThe Third thing to be said, about gaining the reason of children, is, that though it were always convenient and always practicable, it would not always prove effectual to secure obedience. Men are not themselves always subject to reason. Is it to be expected that children will always be so? How often does irregular and capricious inclination induce a man to take a course, which he perfectly well knows to be unreasonable and inexpedient. And is it to be thought that reason will be more powerful with children? It is plain, that if obedience is to be enforced at all,—in many cases, and these perhaps the cases of most necessity, the parent's will must come in as the \"ultima ratio,\" and must be enforced, independent of any concurrence, on the part of the reason of the child.\n\nStill, to resort to that \"ultima ratio,\" to the mere will of the parent, at all times, is certainly not to be recommended. That would not be, to treat the child like a reasonable being. That would be, to leave the child's reason unexercised on matters of duty. That would be, to leave him without proper grounds for the regulation of his conduct, in future life, when he must cease to be under a parent's control. It would be treating him, rather as a slave, than as a son, and preparing him to be a machine, rather than a man. Some weaker minds might be bowed down, by such bondage, and might become the very unreflecting, unreasoning machines, which such treatment tends to make them. But others, and these perhaps better, higher and nobler natures, would be revolted by such treatment, and would resent it as tyrannical and unjust. Because no reason was ever given them, it would seem to\nthem that none could be given,—and all the exertion to which they were prompted, and all the restraints which were put on them, would appear to be only the annoyances of an unreasonable, unnecessary, and capricious tyranny. All this children, of course, will not so express, as we now do, and perhaps may never clearly express at all. And yet we shall grievously mistake, if we suppose, that they are not alive to the feeling of it, or that the feeling does not lodge and rankle in their hearts, to the corrupting and injuring of their moral nature.\n\nWhat then is the medium between these two extremes, the latter of which is so injurious, and unsuitable to the reasonable nature of man;—the former of which is in multitudes of cases impracticable, inconvenient, and ineffectual? For an answer to this question, we may venture again, to refer to the conduct of the Divine government, a parental, as well as a wise and perfect government. On us, as the subjects of that government, a multitude of commands are laid, of various nature, and to which we are variously disposed. How then are we dealt with in regard of the reasons for these commands? Is provision made in every case for the full and perfect exhibition, and explanation of these, to our minds: or are these reasons often hidden from us in dark and inaccessible mystery? We all know, that the latter is the case, that often we can but imperfectly scan the grounds of the divine procedure towards us, and often we cannot discern them at all. Is it so, then, with all our duties, and all our trials? Does this darkness envelope the grounds and reasons of the whole of them? Why, neither, we know, is this the case. Though it is not given to us, to see the grounds of all the divine procedure, towards us, it is given to us to see the\ngrounds of some, and often of much of it. Though we cannot tell the reasons, why some things are laid on us, to do and to suffer, we can tell these reasons in the case of other things. We have not the reason given us, for every thing. But we have the reason given us for many things. And so much reason is either given us directly, or else rendered accessible to us, in respect of our course of moral discipline in the world, as to furnish abundant ground for the existence, and exercise of the sentiment of Trust, as respects the reasonableness of that which is left unexplained. Such is the method of the heavenly government. Much is revealed to us. Much is concealed from us. Yet enough is revealed to form a just and reasonable ground of confidence.\n\nNow thus it should be, and needs to be, in the little families over which men preside, even as in the great family, over which God presides. His treatment of us, is in this respect a model, for our treatment of our children. For many things which we enjoin, and enforce on them, reasons can be shewn, reasons, which even they can understand and feel, to be wise, and kind and good reasons. And these reasons we should take occasion from time to time to shew them; not always and in every case; but often, and in many cases;—so often as to call for and justify trust, in those cases, in which reasons are not, and perhaps cannot be given;—so often, as to do away the impression that the parent’s government is capricious and without reason; so often, as to give rise to the conviction, in the child’s mind, that there always is a reason, and a good and kind reason, whether it is stated or not. This is the right state of things in a well regulated family. In the child’s mind, there should be full and clear light, as to the grounds of\nmany things, which the parent enjoins, trust as to the rest, and a sense of the necessity of prompt obedience to all.\n\nBefore leaving this part of our subject, there is one more lesson, to which we may advert, and which may also be gathered from the Divine government. The reasons of some duty or trial, concealed till the duty is performed, and the trial endured, are sometimes afterwards explained and made clear to us. We are not brought to the knowledge of these reasons, to induce us to do the one, or to bear the other. The one is required to be done, the other to be endured, simply as a matter of duty. But afterwards, reasons are shown,—good reasons,—wise reasons;—and these justify and call for trust, in similar instances, when it may be, in our present state of being, we are incapable of comprehending the whole grounds of the divine procedure. Now this, the human parent may, in his sphere, also do. He need not always state his reasons for a command, before it is obeyed, and for the purpose of producing obedience. That obedience he may require, and enforce, simply on the ground of his own authority. But after the obedience has been rendered, he may explain his reasons, and shew them to have been wise and good reasons. And this, that, as in the other case,—the ease of the heavenly government, there may be, in regard of multitudes of duties, and hardships yet to come, the full reasons for which the child cannot comprehend or appreciate, the sentiment of trust,—trust in the parent's wisdom and kind and good intentions.\n\nIn the enforcement of obedience on the part of children, with the view we have suggested, that, viz; of securing their happiness, and in the way we have suggested, that, viz: in\nwhich reason is so much addressed as to satisfy in many cases, and to produce trust in all, one end is to be kept steadily in view, and one most important advantage will be gained.\n\nThat end, is the establishment of right habits,—habits, such as it is desirable should be formed and confirmed in the minds of children. There is no more familiar, and no more important law of our mental constitution, than the law of habit, in virtue of which, by the mere frequent repetition of any act, even though it were at the first disagreeable, or difficult, it becomes easy, natural, and so to speak, necessary to continue it. It is not easy to overrate the power with which this law operates upon all men, for good, or for evil. Nor should any one overlook, or disregard it, who is at all earnest in seeking his own intellectual or moral improvement. Especially is it to be taken advantage of in the case of the young. I say, especially in their case, because in their case, the most can be made of it. In the minds of children, habits are still to be formed. Evil habits easily, for that is sailing with the stream; you have wind and tide in your favor; good habits with more difficulty; for that is going against the stream. And the one or the other must be formed. Man is born to be, to a great extent, the creature of habit. That is the constitution of our nature. We cannot alter it. Nor should we seek to alter it, if we could. By the actions of every successive day, the child is establishing habits of one kind or another. His character is being formed. And what is character, but a collection of habits of different kinds, mental and bodily, moral and intellectual? This process, it is competent for\na parent to modify, to guide, but not to stop. It must go on. The child must acquire habits, habits of indolence or exertion, of virtue or of vice, habits favourable or unfavourable to the existence, power and prevalence of moral and religious principle. And these habits will prevail over any mere teaching. Good habits will resist temptation, far more than mere knowledge of the danger of yielding to temptation. And evil habits present a much more formidable obstacle to moral improvement, than mere ignorance. Surely then, if we would conduct aright the moral education of children, we should consider what habits should be established, and exercise all our influence, and all our authority, to have them established. It is miserable to see a parent contented to make his child know,—know moral duty, or religious duty, as if knowledge were enough, as if knowledge, in the case of either young or old, were always accompanied with corresponding practice. It is miserable to see a parent contented with a machinery, that is only designed for the giving of knowledge, moral and religious, and leaving habits to the mercy of chance and circumstances. It is miserable to see the whole attention directed to teaching, and no due thought, care, or attention paid to what by the law of our nature is as important, training. Doing is more important than knowing. If a child is permitted to do evil, a habit is established, against which any knowledge that can be given him, will contend but feebly. Whatever we wish him to be, we must make him by repeated acts, on his part, establishing a habit, or by more instruction. With this view, submission should be enforced to the course of conduct which we approve, and the formation of an\nevil habit should be checked, by punishing not the tenth or twentieth departure from that course, but the first. Punishment is often more grievous to the parent than to the child. That is the reason, why it is often remitted, when for the good of both, it should be inflicted. But punishment, early and promptly inflicted, needs never be so grievous. For it needs never be so severe. It is, when a habit has to be contended with, that most severity is required. And to avoid the necessity of such severity, or else, as the only alternative—the allowing his children in evil, it is the parent's wisdom to contend against the formation of an evil habit, by checking the first outbreakings of an evil temper; and better, and more effectually still, by forming good habits, in his children, and, so exercising parental authority, as to make them do often, what it is desirable, they should do always. In this way, moral habits will be formed, and a moral character which will not easily be destroyed.\n\nBut we spoke also of an advantage to be gained, as well as an end to be kept in view, in the enforcing obedience, so as to promote happiness, and produce trust. The advantage is, that thereby we lay most deeply and surely, the foundation of religious sentiment and character. To make this appear, let us consider what are the main elements of religion. They are affectionate reverence to a superior, and the submission of the will to the will of a superior. By whatever means, the feeling of reverence, affectionate reverence, is cherished, in the mind of a child; by whatever means, the habit of submission, implicit, yet trustful and confiding submission, is strengthened in the mind of a child;—by that means, is the child prepared for afterwards\nfeeling, and acting, as a religious being. Deepen the feeling, confirm the habit, and they may afterwards be transferred, from a visible to an invisible, from an earthly to a heavenly superior. This feeling, and habit, constitute the foundation, of the religious character, whatever be the peculiar nature of the religious doctrines which are entertained, and believed. To excite the one, and to form the other, is essential to religion under every system. But this, we do, when complying with the rules, which have now been laid down for the early moral culture of children.\n\nAnd observe, how soon it may be done,—how early and yet how efficiently, a parent may engage, in the religious, education of his children. It is evident, that the feeling of affectionate reverence may be cherished, and the habit of submission formed, long before it is at all possible, to present the truths of religion to the mind of a child; long before it is possible to explain to him the nature of God, or to give him any adequate conception, of what God requires. It is a hopeless attempt, to make a mere infant understand, what is meant by the word God, or to feel his obligation to obey the will and the commandments of an invisible Being. But it is not on that account hopeless, to prepare,—effectually and judiciously to prepare the child, for reverencing that God, of whom at the time he does know, and can know nothing; and for yielding obedience to an invisible Governor, when he is able to understand and to feel, that such a Governor there is. To effect this, it is only necessary, that his affectionate reverence should be called forth, and his implicit obedience enforced, to a seen superior. For a time, the parent is, and must be, as a god to the child. All the reve-\nrence, affection, submission, of which the child is capable, must be exercised toward the parent. The more the parent, by his consistent and affectionate exercise of authority, calls forth to himself, the affectionate reverence of the child, and the more constantly he enforces the submission of the child's will, to his will, the more wisely he is conducting the work of religious education. When such a feeling and such a habit exist, then religious truth has the original and elementary principles, to which it may address itself, and on which it can act with effect, directing them to proper objects, and stimulating them to more vigorous and lively exercise. And the child that has yielded, religious submission, for so we may almost call it, to the earthly parent, is more prepared to render it also, to the heavenly.\n\nThey who can truly say,\n\n\"A father's voice, with reverence we,\nOn earth have often heard;\"\n\nare the most likely to yield to the claim, while they add,\n\n\"The Father of our spirits now,\nDemands the same regard.\"\n\nSo much do we feel this to be the case, that were the question proposed to us: how may children best be trained up, as religious beings, and to be religious beings? we should not hesitate to give for the answer, as both containing plain truth and most truth,—by making them love, reverence, and obey their parents, from their very infancy. Let the parent see that his conduct be throughout such as is fitted to secure respect. Let his authority be unresistingly maintained, and while he is thus performing only a very obvi-\nous duty, about which there hangs no mystery whatever, he may feel assured, he is laying in the minds of his children the most stable foundation, for religious character. True, he is not to stop, with making his children reverence and obey himself. He is to go on, as far as he is able, to make them reverence and obey God. But having taught them to reverence and obey himself, he has accomplished an important part of the work. And even though he should stop there, blameable as he would, of course, be, he would really have done more for the religious character of his children, than could ever be effected, by a parent, whose capricious conduct makes him despised, or whose unstable will causes his commands to be disregarded, though he should make trial of all the systems of education, which man's wisdom ever devised, or though he should instil into the minds of his children, all the religious knowledge, which it is possible to make them comprehend.\n\nIt is necessary however, to observe, that to call forth such feelings of affectionate reverence, to produce such habits of trustful submission, the parent must himself be affectionate, and his whole conduct and deportment must be such, as to secure respect,—and respect, be it remembered, from the keenest, from the closest, from the most sharp-sighted of all observers, as a man's own children, without knowing it, or thinking of it, really are. Nor must his authority be other than wisely exercised, and unremittingly maintained. As infancy passes into childhood, childhood into youth, this becomes the more imperatively necessary. Children are to honour their parents. To honour them. It is an emphatic word, implying to love and reverence and obey. But that parents may\nhave their children honour them, they must see to it, that they be themselves worthy to be honoured; that there be that, in them, and about them, which their children cannot but respect and love; that in short, there be that union of warm affection, and prudent consideration, and steady moral and religious principle, which is fitted to call forth the complex sentiment expressed in the emphatic \"honour,\" of the Decalogue. How can parents expect to be honoured, if they are unworthy of honour? Do they imagine that their children will be blind to their defects and their follies? Do they suppose, that the proper sentiment will spring up in the minds of their children, without the corresponding qualities in them, to give rise to it. Nay, verily. If they would have their children honour them, they must act in such a way, as to lead them to do so. It is the wise and reasonable law of Providence, that a parent cannot do his duty to his children, or expect that they shall do their duty, as becometh children, unto him, unless, he be himself doing his duty to the Great Parent of all.\n\nIt is the want of right principles, and of proper self control, and self government, in the parent, that renders the moral and religious education of children so difficult of accomplishment. That very rule, which it would seem, is so much in accordance, with all the natural desires of a parent's heart,—that he should seek to make and keep his children happy, is for these reasons often disregarded. It is not that parents are wanting in natural affection, but that they are not careful, so to control their own tempers, as to avoid giving a great deal of trouble and misery, to those who are about them, and to their own children among others, or\nrather perhaps more than others. Self-government, and self-control, are essential, to the right moral training of children. Without these, the parent will appear to his children to be, and indeed, will often really be, cruel, tyrannical, and unjust. And he will, by the manifestation, of these tempers, not more certainly destroy the enjoyment, than he will corrupt the moral nature of his children. Parents are not to shrink from the infliction of pain upon their children, when it is necessary. But then it is only when it is necessary,—when the pain is to serve a distinct purpose; a wise and good and merciful purpose; when it is, in short, to prove a means of preventing or of rendering less likely, greater and longer continued suffering afterwards. All suffering inflicted by the parent, without this intention is unnecessary and unjust, and will have the effect of calling forth and establishing evil tempers, in the minds of the children. Again, therefore, we repeat, that to deal well, and wisely, and effectually, with the moral nature of his children, the parent must be seeking continually the improvement of his own.\n\nAnd that he should so deal with the moral nature of his children, how much is there to urge him? I began this lecture, by alluding to parental responsibility. I cannot conclude it, without again recurring to the same subject. That responsibility is great, in proportion to the power which parents possess; to the influence which they may;—nay, which they must exercise. Of that power and influence, it is not easy to overrate the extent. No government is so absolute as the parental government. No authority is so irresponsible to any earthly tribunal, as the parental authority.\nWithin his narrow circle, and among the youthful subjects whom providence has put under him, a parent may without challenge of man, exercise a despotism, more grinding and intolerable, than any tyrant ever exercised over a subject state. His power can do more to corrupt, to injure, to make wretched. On the other hand, it is also more efficient for good. He can do unspeakably more to improve; to imbue with right principles; to establish right habits; to make provision for future comfort and happiness. Can there fail to be a heavy responsibility connected with the exercise of such a power as this?\n\nWe have already spoken of the indefeasible arrangements of the Divine Providence, by which, the different members of our species are bound together, and rendered dependent and influential, for good or evil, on one another. Such dependence is often sufficiently startling; and because of the results to which it leads, to us inexplicable. Never certainly is it more so, than in the case of the children of a cruel, capricious, tyrannical and unprincipled parent. How absolute is their dependence! How bitter the tyranny, which the parent may exercise! How much the misery he may create! But that is not all. The mischief he can do, is not merely temporary, and as regards the body. He corrupts the mind. He instils, he strengthens, he exercises evil passions. He is an active instrument in establishing in the hearts, of his children, that reign of evil, which, for anything he can tell, may be permanent and enduring. How inexplicable, how dark, mysterious and unsearchable, the constitution of things, by which the young and ductile mind is thus subjected to the government, and influence of one, all whose energies go to deprave and to degrade it! How\nhelpless, how deplorable, how, we might almost say, without hope, is the condition of the child so placed! It seems, as if he were doomed to ruin, and as if moral depravity, and all its miserable consequences, were his destined portion. It is not for us to complain of the plan of Providence. That no doubt is, and shall hereafter be made to appear, the best of all possible plans. Nor may we doubt for a moment, however awed, and saddened by such reflection, that the Judge of all the earth both has done, and will ever do, what is right,—that he will not exact what he has not given—and that he will take fully into account, the circumstances, in which his creatures, have any of them been unavoidably placed.\n\nIt is a more pleasing subject, however, with which, to conclude, and on which, to allow our thoughts to rest, the power of parents for good, and the honour, comfort and reward of rightly discharging parental duty. It is with this duty, as it is with all duty. There is a satisfaction in doing right, even when it is difficult to be done. And there is a satisfaction in remembering what has been done right, which is itself, a great reward, to a good man. And there are happy consequences, to which, in the course of providence, duty, rightly performed, naturally leads. And these happy consequences, are not in our case, to whom life and immortality have been brought to light, limited to this world.\n\nIt would require a whole lecture, instead of a concluding paragraph, to set forth fully, how profitable in each of these respects, is the duty of rightly training the young. What satisfaction can be greater, or purer, than that which a parent enjoys, when he sees in his childrens' after life, the\ndevelopment of the good principles, which he was at pains to implant in them, in their youth; when he witnesses the respect which these principles gain for them, and the happiness and hope, which they yield to them? What greater reward, than to perceive such result of his early training of the youthful spirit, would he desire to have here? And hereafter, in another life, the reward will be increased. Even in the very work itself, there is a satisfaction. Every well constituted mind feels it to be pleasant. It is pleasant for a man, to see any work rising under his hand; a garden for example, with its useful plants, its gay and graceful flowers, each springing up in its season, each displaying its own peculiar beauty, and all the result of care and taste and management, without which the little paradise had been an unsightly waste. But what garden is like a man's own family, or what flowers can rival in beauty, those that may grow up there? To see in one's own children, the rise of generous sentiment, the struggle with evil passions, and the victory of principle, the glow of virtuous resolution, the tear of pity, the emotion of piety, and to think that we are employed as instruments to produce all these, what can give pleasure, to any heart, that is not utterly depraved and degraded, if this does not?\n\nOne word only, in conclusion. The close, continual watchfulness, both as respects body and mind, which children need, it is the mother's part, as well from her more affectionate nature, as from her better opportunities, especially to exercise. And every lesson, now given, and every encouragement, applies with special force to her, in her work,—a work noble and holy indeed, when engaged in with a right spirit, and with right views. There are, who set the retired devotee, that to secure her own well-being, has renounced the society\nand intercourse of the world, above the Christian mother, who in seeking the salvation of her children, is working out her own. But this is a judgment contrary to all sound principle. Nor is there in all the earth a character, deserving of truer and deeper reverence, than that of a mother, who knows and feels, and performs the high duties laid on her. Not till the world's doom is sealed, and the day of the revelation of all things has come, shall it be known, how much of all, that in the world's history, has contributed to the happiness of men, and the glory of God, has been owing to the efforts and prayers of mothers, whose names the world never knew, and who never desired, that the world should know them.\n", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/cihm_52193.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 36, "total-input-tokens": 58196, "total-output-tokens": 11463, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1220, 3], [1220, 2326, 4], [2326, 2566, 5], [2566, 2566, 6], [2566, 2765, 7], [2765, 2765, 8], [2765, 3904, 9], [3904, 5650, 10], [5650, 7372, 11], [7372, 9164, 12], [9164, 10743, 13], [10743, 12474, 14], [12474, 14231, 15], [14231, 16016, 16], [16016, 17766, 17], [17766, 19415, 18], [19415, 21132, 19], [21132, 22890, 20], [22890, 24682, 21], [24682, 26473, 22], [26473, 28195, 23], [28195, 29895, 24], [29895, 31625, 25], [31625, 33373, 26], [33373, 35137, 27], [35137, 36697, 28], [36697, 38430, 29], [38430, 40169, 30], [40169, 41881, 31], [41881, 43639, 32], [43639, 45352, 33], [45352, 47211, 34], [47211, 47928, 35], [47928, 47928, 36]], "primary_language": ["en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]