[{"id": "28f4fa2b9c019a8d6da8c62457cae95a7d33f0f8", "text": "The quantity of alkali required to saponify the fat is another valuable means of judging of the purity of a butter. This equivalent is an abstract number obtained by dividing the molecular weight of the alkali employed by the number of milligrams of it used in saponifying a given weight of the fat. Butter-fat contains acids (butyric chiefly) which have a lower molecular weight than oleic, margaric, and palmic acids. The saturation equivalent of a butter-fat is therefore expressed by a smaller number than if it were composed solely of glycerides of the acids with a higher molecular weight. The determination of the equivalent being an easy one, it is generally made as the first test in determining the genuineness of a butter sample. For genuine butters, this number is about 245. When it goes above 250, the samples should be regarded with suspicion. In one case of a Jersey butter very rich in butyric acid, this number fell to 239.8. On the other hand, in four samples of tallow, lard, and oleomargarine (two), the numbers were 280, 284, 282, and 281 respectively.\n\nPure butter contains a certain proportion of glycerides of fat acids soluble in water (butyric, capronic, caprylic, etc.). The percentage of these acids to the total weight of butter-fat is about five. In thirty analyses the lowest percentage found was 4.49, and the highest (except in one case) 5.66. In the case of the Jersey cow's butter, already mentioned, this number was 6.79. Tallow and lard have at most only a trace of these acids. In commercial oleomargarines the highest percentage found was .56, and the lowest .20. The determination of the soluble acid requires much time; but it is not a difficult operation, and it is the most certain method of determining the purity of a butter. A sample which would give no more than four per cent soluble acid would be open to condemnation. It would either be a very poor sample of genuine butter or else an adulterated article.\n\nPure butter which has not been melted gives, with polarized light and a selenite plate, a pure uniform tint of red or blue to the field of vision. Adulterated butter in similar circumstances always gives a mottled appearance to the field. This is a very simple and speedy qualitative test for the purity of butter, but is not sufficient in itself to definitely determine the matter.\n\nThe difficulties which make the analyses of milks of little practical value are equally as great with butter. A more extensive study of their composition, however, is certain to lead to profitable results. H. W. Wiley.\n\nTHE SASKATCHEWAN COUNTRY.\n\nThe district at present attracting attention as the scene of an insurrection of half-breeds and Indians against the Canadian government is situated on the North Saskatchewan River, near the northern margin of the great plains. The vast region of plain and prairie, which occupies the whole central portion of the continent, crosses the 49th parallel of latitude—which constitutes the international boundary-line—with a width of 750 miles, but extends north of the boundary about 300 miles only, being there limited by the edge of the great northern forest which stretches, with little interruption, to beyond the arctic circle. Prairies of considerable size occur, it is true, in the valley of the Peace, but these are isolated from the great plains by wide forests. There is reason to believe that the greater part of the prairie country in Canadian territory might become permanently wooded but for the almost annually recurring prairie-fires, which are still tending to increase its area. The southern edge of the forest is, however, in the main, coincident with that of a region of abundant rainfall.\n\nThe northern border of the prairie country may be generally defined by a line drawn from the vicinity of the city of Winnipeg westward to the junction of the Assiniboine and Qu'Appelle rivers; thence north-westward to the junction of the North and South Saskatchewan rivers; thence westward, nearly following the latter river, to Edmonton; from that point south-westward to Calgary, on the Bow; and thence southward along the eastern base of the Rocky Mountains. The total area thus outlined, which is either altogether treeless or characterized by wide stretches of prairie interspersed with scattered groves of aspen and other trees, is approximately 300,000 square miles. The southern and south-western parts of this region may be described as entirely without wood, though even there the rivers are almost invariably fringed by groves of cottonwood.\n\nThe general elevation of the plains of the Canadian north-west is very considerably less than that of the corresponding portion of the continent farther south, the mean height of the whole region above outlined being probably less than two thousand feet above the sea-level. The most pronounced inclination, however, giving direction to the rivers of this portion of the great plains, is that from the base of the Rocky Mountains to the east or north-east. The Red-River valley, which constitutes the\nTABLE OF DISTANCES.\n\nFrom Winnipeg to Qu'Appelle .................. 323 Miles\n\" Qu'Appelle to Touchwood Hills .............. 46 \"\n\" Touchwood Hills to Humboldt ................. 95 \"\n\" Humboldt to Carlton .......................... 82 \"\n\" Carlton to Batoche Crossing .................. 17 \"\n\" Prince Albert to Battleford ................... 120 \"\n\" Humboldt to Battleford ....................... 175 \"\n\" Qu'Appelle to Battleford ..................... 400 \"\n\nUnexplored\nlowest prairie-level, and lies along the base of the eastern Laurentian plateau, has an altitude of about eight hundred feet only. From this level, with minor exceptions, the surface may be regarded as sloping gradually and continuously upward, at a rate of from four to five feet in the mile, to the foot-hills. There the horizontal and unaltered strata of the cretaceous and Laramie formations break against the base of the ancient rocks of the mountains into a series of sharp and nearly parallel flexures, producing a varied and picturesque region, with quite peculiar characters. In the central portion of the plains, the most marked exceptions to their generally even and monotonous contour are found in the tumultuously hilly belt of country known as the Missouri Côteau and in a line of diffuse and indefinite elevations nearly parallel to the Côteau, which includes Turtle Mountain, Moose Mountain, and the File and Touchwood Hills. These hills, or mountains so called, are really tracts of considerable size, with rolling or hilly surface, more or less wooded. The northern extension of the Côteau, where known as the Eagle Hills, near Battleford, also becomes partly wooded.\n\nTo any one familiar with the territory lying west of the Missouri, the most remarkable difference of a general character, observable in this northern extension of the same region, is perhaps the extraordinary abundance of small lakes, ponds, or 'sloughs,' which are scattered everywhere over its surface. This peculiarity is evidently in connection with the mantle of glacial drift, which is here universal, and dependent on the irregular deposition of its material. The lakes and ponds, while at times arranged in intercommunicating linear series, are usually distributed without the least apparent regularity, and occupy shallow basins without outlet. Filled by the melting of the snow or rains of the early summer, a great proportion are completely emptied by evaporation before the autumn, while the water remaining in others becomes more or less distinctly saline in many instances. This is more particularly the case with those of the southern and more arid portion of the region. Near the northern margin of the plains, saline lakes are quite exceptional. It is generally on the edge of one of these rush-bordered pools that the traveller makes his evening camp; and, while the abundance of water in one respect facilitates travel in the spring and early summer, the moist condition of the deep alluvial soil at these seasons may prove a more than countervailing disadvantage. The most serious obstacles, however, to be met with in long journeys across the plains, are the various rivers. The Assiniboine, Souris, Qu'Appelle, and other streams of the eastern district, during the breaking-up of the ice, and for some time subsequently, may prove formidable barriers in the absence of bridges or ferries. The North and South Saskatchewan, the Red Deer, Bow, and Belly rivers, all eventually uniting to pour their waters into the northern end of Lake Winnipeg, rise far back in the Rocky Mountains, and, while subject to considerable spring freshets in some seasons, are generally not in full flood till June or July, when the snow is disappearing from the highest summits of the range, and the snow-fields and glaciers about the sources of some of them are melting most rapidly. These streams have trenched valleys across the surface of the plains, which are generally from a hundred to three hundred feet in depth, and a mile to two miles or more in width. All the trails used as regular means of communication make for recognized crossing-places on these rivers, where the approaches are favorable, and where very generally the river may be forded at low water, though ferries of some kind have usually of late years been established for use at other seasons.\n\nAs above indicated, almost all the larger river-valleys hold more or less timber; and in the northern part of the region this is not confined to the bottom-land, groves and thickets spreading also into the lateral valleys ('coulées') and broken ground which is very generally to be found in the vicinity of these great river-troughs. Should any serious opposition be offered to the expeditions now on their way to quell the present unfortunate disturbance, it will in all probability be at one or other of the 'crossings' which naturally lend themselves to defence. The rivers, as might be expected from the considerable general inclination of the surface, are usually rapid and shallow, with numerous gravel-bars, and reefs of bowlders, at low water. They are often, moreover, extremely tortuous; and in consequence of these peculiarities, and the considerable portion of each year during which they are ice-bound, they are not extensively utilized as means of communication; and trains of wagons or Red-River carts are still generally employed in travelling, or in the transport of supplies and goods at a distance from the railways. The Hudson-Bay company has, however, for a number of years, used a couple of small stern-wheel steamers between the Grand Rapids, near Lake Winnipeg, and Edmonton, far up on the North Saskatchewan. Two or more steamers\nof the same class have quite lately been placed on the South Saskatchewan; and it is proposed to employ these in the present emergency in carrying supplies from Medicine Hat, where this river is crossed by the Canadian Pacific railway, to the vicinity of Prince Albert.\n\nThis portion of the interior of the continent was reached in the days of the fur companies, either by the canoe route from Lake Superior, or by ascending the Nelson River from York Factory on Hudson Bay; and it was by the first-mentioned that Sir Garnett Wolseley, with his little force, penetrated to the valley of the Red River in 1870. When St. Paul had become a commercial centre, the Hudson-Bay company began to bring the greater part of its goods from the south; while in later years the police-posts, settlements, and cattle-ranches established in the far west were supplied from Fort Benton, on the Missouri. The Canadian Pacific railway, pushed with unexampled rapidity from Winnipeg across the plains, and completed to the summit of the Rocky Mountains about eighteen months ago, has, however, completely changed the old lines of travel. The time-honored trail from the Red River by Forts Carleton and Pitt to Edmonton—a journey of nearly nine hundred miles, requiring, with loaded carts or wagons, under the most favorable circumstances, nearly forty days—need no longer be followed. The points above mentioned, with other isolated little settlements of more recent date along the North Saskatchewan, are now reached by new trails from the nearest stations to the south on the railway; and a system of telegraph-lines, constructed and operated by the government, unites the more important of them. After leaving the railway, however, the distances to be traversed in the old-fashioned way, before the more remote settlements are reached, are still very considerable. Thus to Carleton and Prince Albert, from Qu’Appelle station, the trail-distances are 228 and 253 miles respectively; from Swift-Current station to Battleford, 202 miles; and from Calgary to Edmonton, 191 miles.\n\nThe length of this note does not admit of any detailed description of these and other main roads. It may be remarked, however, that while the trail from Qu’Appelle toward Carleton and Prince Albert, as far as the crossing of the South Saskatchewan, is generally through an open country, groves and belts of aspen are not infrequent in its vicinity. The longest stretch quite without timber is that known as the salt plains, about thirty miles only in width.\n\nThe country in the vicinity of Carleton, Prince Albert, and Duck Lake, is rolling, or characterized by low hills with numerous and in some cases extensive groves ('bluffs') of wood. The settlement is of a scattered character, but for the most part confined to the point of land between the two branches of the Saskatchewan, the total population being probably about three thousand.\n\nAt the crossing of the South Saskatchewan, by the trail from Swift Current to Battleford, there is a good ferry. This trail, to within about twenty miles of Battleford, is entirely destitute of wood. Battleford was at one time selected as the seat of government of the Northwest territory, but, since the definite location of the railway, has been abandoned in favor of Regina. There are scattered settlements of half-breeds and whites in the neighborhood, and several Cree Indian reserves. The trail from Calgary to Edmonton crosses the Bow, Red Deer, and Battle rivers, and several smaller streams flowing from the foot-hills and mountains. Ferries exist where necessary; and, should these not be destroyed, a rapid advance by this route would be easy. For sixty miles there is no wood on this trail: beyond that point timber is abundant. Edmonton is a somewhat important centre, with a number of little settlements of whites and half-breeds subsidiary to it.\n\nGeorge M. Dawson.\n\nTHE GLOW-LAMP.\n\nIt was stated not long ago that the number of incandescent lamps in this country alone is over one hundred thousand. Such a success as this warrants a glance at the history of the lamp, which is given by A. Gelyi in the London electrical review.\n\nWhile the arc-lamp emits twenty-two hundred candle-light per horse-power, and the glow-lamp gives but a hundred and twenty, it is the possibility of so reducing the light to a minimum that has brought the latter system forward; for, although it is true that the arc-light may be considered capable of a division into lamps of intensities varying from twenty to ten gas-flames, that minimum is in many cases, especially for domestic purposes, a great deal too high, whilst the regulating apparatus is expensive.\n\nBut two substances are known which possess such properties as are indispensable for the production of the glow-light; namely, platinum and its alloy with iridium, and, secondly, carbon. The former has the advantage, that, when heated to whiteness, it does not consume away even in the air: but, in a no less important respect, that metal is far behind carbon, for it is by no means capable of sustaining such a degree of heat without fusing; and this is of vital", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/1761314.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 16140, "total-output-tokens": 3631, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5051, 2], [5051, 5051, 3], [5051, 5051, 4], [5051, 5520, 5], [5520, 5520, 6], [5520, 5520, 7], [5520, 5520, 8], [5520, 10731, 9], [10731, 15853, 10]], "primary_language": ["en", "en", "None", "None", "en", "None", "None", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, true, true, true, true, true, false, false]}}]