[{"id": "a60f1a70d1876cd7a7352cdcb905dca57a79858d", "text": "A Legal Secret\n\nBy Thomas St. K. Bate\n\nPublished by special arrangement with the publishers, from an original copy of \"Journal of Legal Secret,\" No. 1.\n\nCHAPTER I - THE SECRETARY\n\nThere was once a man who had been employed as a secretary in many offices, by various firms and companies. He was very skilled at his work, and always managed to keep his employer's secrets safe. One day, while working in his office, he heard a knock at the door. He went to answer it, and found a young woman standing there. She introduced herself as a new employee, and asked if she could have a seat. The secretary invited her to sit down, and they began to chat. As they talked, the woman revealed that she had been working as a legal secretary for several years, and had recently moved to the city. She explained that she had heard about the secretary's reputation for keeping secrets, and wanted to learn more about the job.\n\nThe secretary was impressed by the woman's enthusiasm, and offered to show her around the office. They walked through the building, looking at various files and documents. The woman was amazed by the amount of information that was being kept secret, and asked many questions about the different types of secrets that were being kept. The secretary patiently answered each question, and showed her how to keep secrets effectively.\n\nAs they continued their tour, the woman became increasingly interested in the field of legal secretaries. She asked many questions about the different types of secrets that were being kept, and how to keep them safe. The secretary explained that the most important thing was to be honest and truthful, and to never share any secrets with anyone else.\n\nThe woman left the office feeling inspired, and determined to pursue a career in the field of legal secretaries. She knew that she had found a job that would allow her to use her skills and knowledge to help others keep their secrets safe.\n\nThe End\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/MJA_1890011001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6594, "total-output-tokens": 517, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1944, 3], [1944, 1944, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]