[{"id": "3897f792ce4cde5478d1d7c01d220c4f4e8ac1bf", "text": "REPORT\nOF THE\nNineteenth Annual Session\nOF THE\nRIGHT WORSHIPFUL\nGRAND ORANGE LODGE\nOF\nManitoba and the N.W.T.\nHELD IN THE\nODDFELLOWS HALL,\nPORTAGE LA PRAIRIE, MAN.,\nON\nWednesday, the 18th day of March, 1891, and\nby adjournment on the following days.\n\nBRANDON, MAN.\nTIMES BOOK AND JOB PRINTING OFFICE.\n1891.\nLODGE REQUISITES.\n\nThe following Lodge requisites can be procured from the Grand Secretary at the following rates:\n\nConstitutions, (latest edition), ........................................ $1.20 per doz.\nOrange Primary Certificates .............................................. 25c. each.\nOrange Rituals, (new issue), ............................................. 35c. each.\nOrange Summonses ......................................................... 60c. per hundred.\nApplication for Membership .............................................. 60c. per hundred.\nApplication for Membership with Certificate ....................... 60c. per hundred.\nRoyal Scarlet Rituals, (new issue) ...................................... 20c. each.\n\nThe Grand Secretary will supply all orders accompanied by the cash, with the utmost dispatch.\n\nAddress all Communications to\n\nW. J. KERNAGHAN,\nGRAND SECRETARY,\nP. O. Box 335.\nWinnipeg, Man.\nREPORT\n—OF THE—\nNineteenth Annual Session\n—OF THE—\nRIGHT WORSHIPFUL\nGRAND ORANGE LODGE\n—or—\nManitoba and the N.W.T.\nHELD IN THE\nODDFELLOWS' HALL,\nPORTAGE LA PRAIRIE, MAN.,\n—ON—\nWednesday, the 18th day of March, 1891, and\nby adjournment on the following day.\n\nBRANDON, MAN.:\nTIMES BOOK AND JOB PRINTING OFFICE, TWELFTH STREET.\n1891.\nGRAND ORANGE LODGE\n\nOF\n\nMANITOBA AND NORTH-WEST TERRITORIES.\n\nPROVINCIAL GRAND OFFICERS FOR THE YEAR 1891.\n\nGRAND MASTER.\nSTEWART MULVEY, Esq. . . . . . . . . . . Winnipeg.\n\nDEPUTY GRAND MASTER.\nJAMES MORROW, Esq. . . . . . . . . . . Silver Spring.\n\nJUNIOR DEPUTY GRAND MASTER.\nGED. MAXWELL, Esq. . . . . . . . . . . Winnipeg.\n\nPAST GRAND MASTERS.\nJ. M. ROBINSON, Esq. . . . . . . . . . . Brandon.\nI. MAWHINNEY, Esq. . . . . . . . . . . Holland.\nJOHN NIBLOCK, Esq. . . . . . . . . . . Medicine Hat, N.W.T.\nSAM'L McCOMB, Esq. . . . . . . . . . . Calgary, N.W.T.\n\nGRAND CHAPLAIN.\nREV. F. M. FINN. . . . . . . . . . . Carberry.\n\nGRAND TREASURER.\nFRANK D. STEWART, Esq. . . . . . . . . Carman.\n\nGRAND SECRETARY.\nW. J. KERNAGHAN, Esq. . . . . . . . (Box 335) Winnipeg.\n\nGRAND LECTURER.\nW. McCULLOUGH, Esq. . . . . . . . . Portage la Prairie.\n\nGRAND DIRECTOR OF CEREMONIES.\nW. J. MARSHAL, Esq. . . . . . . . . . Winnipeg.\n\nDEPUTY GRAND CHAPLAINS.\nREV. THOS. ARGUE, Esq. . . . . . . . Neepawa.\nREV. A. GORDON . . . . . . . . . . Portage la Prairie.\n\nDEPUTY GRAND SECRETARY.\nWM. CONOLLY, Esq. . . . . . . . . . Winnipeg.\nReport of Proceedings\n\nOf the Nineteenth annual session of the R. W. the Orange Grand Lodge of Manitoba and the Northwest Territories, assembled in the Oddfellows' Hall, in Portage la Prairie, on Wednesday, 18th of March, 1891, and by adjournment on the following days.\n\nPRESENT:\n\nR. W. GRAND OFFICERS.\n\nStewart Mulvey, Esq., G. M. ........................................... Winnipeg\nJas. Morrow, Esq., D. G. M., ........................................ Silver Spring\nGeo. Maxwell, Esq., J. D. G. M., .................................... Winnipeg\nRev. F. M. Finn, G. Chap., ........................................ Carberry\nFrank D. Stewart, Esq., G. Treas., ................................ Carman\nW. J. Kernaghan, Esq., G. S., ....................................... Winnipeg\nW. McCullough, Esq., G. Lect., ..................................... Portage la Prairie\nHenry Wood, Esq., D. G. Chap., .................................... Morris.\nWm. Conolly, Esq., D. G. S., ....................................... Winnipeg\n\nPAST GRAND OFFICERS.\n\nJ. M. Robinson, Esq., P. G. Master, .............................. Portage la Prairie\nIsaiah Mawhinney, Esq., P. G. Master, .......................... Holland\nJohn Niblock, Esq., P. G. Master, ................................. Medicine Hat\nJos. Andrew, Esq., P. G. Lect., ................................... Chumah\n\nCOUNTY MASTERS.\n\n| NAME            | COUNTY       | P. O. ADDRESS     |\n|-----------------|--------------|-------------------|\n| F. C. Morrison  | Norfolk      | Indian Ford       |\n| Abraham Patterson| Dufferin    | Shadeland         |\n| John Pollock    | Rock Lake    | Silver Springs    |\n| Geo. Black      | Minnedosa    | Minnedosa         |\n| Robert Scott    | Franklin     | Dominion City     |\n### Past County Masters\n\n| Name               | County                  | P. O. Address       |\n|--------------------|-------------------------|---------------------|\n| W. Mawhinney       | Portage la Prairie      | Portage la Prairie  |\n| W. J. Marshall     | Selkirk                 | Winnipeg            |\n| D. M. Ure          | Franklin                | Morris              |\n| R. B. Hetherington | Brandon                 | Douglas             |\n| W. Wigmore         | Minnedosa               | Portage la Prairie  |\n| Ed Scott           | Portage la Prairie      | Portage la Prairie  |\n| J. E. Cooper       | Franklin                | Emerson             |\n| Geo. Huston        | Shoal Lake              | Marney              |\n\n### County Proxies\n\n| Name       | County   | P. O. Address |\n|------------|----------|---------------|\n| John Mooney| Miniota  | Virden        |\n\n### District Masters\n\n| Name       | District   | P. O. Address |\n|------------|------------|---------------|\n| M. Keenan  | Winnipeg   | Winnipeg      |\n| W. R. Cahoon | High Bluff | High Bluff    |\n\n### Past District Masters\n\n| Name               | District   | P. O. Address |\n|--------------------|------------|---------------|\n| W. Kitson          | High Bluff | Burnside      |\n| H. Douglas         | High Bluff | Portage la Prairie |\n| S. S. Colter       | Stratford  | Virden        |\n| Isaac Mawbinney    | High Bluff | Holland       |\n| John Porteous      | High Bluff | Winnipeg      |\n\n### Masters of Primary Lodges\n\n| Name            | No. of Lodge | P. O. Address |\n|-----------------|--------------|---------------|\n| James Hoey      | 1501         | Elton         |\n| Jos. Quinn      | 1512         | Brandon       |\n| W. F. Carefoot  | 1519         | Virden        |\n| D. Lipsett      | 1443         | Meadow Lea    |\n| Geo. Johnstone  | 1456         | Emerson       |\n| Thos. Salter    | 1490         | Salterville   |\n\n### Deputy Masters\n\n| Name       | No. of Lodge | P. O. Address       |\n|------------|--------------|---------------------|\n| Jos. Bowes | 1351         | Portage la Prairie  |\nPROXIES.\n\n| NAME            | NO. OF LODGE | P. O. ADDRESS   |\n|-----------------|--------------|-----------------|\n| James Mawhinney | 1355         | Holland         |\n| J. W. Black     | 1505         | Minnedosa       |\n| Robt. Arthurs   | 243          | Winnipeg        |\n| Henry Gage      | 1520         | Winnipeg        |\n| Alex. Dalzell   | 1354         | High Bluff      |\n\nVISITORS.\n\nW. H. Hall ........................................ Virden\nThos. Willis ....................................... Virden\nD. Harper ........................................... Winnipeg\nA. Huston ........................................... Portage la Prairie\nA. E. Foster ......................................... Portage la Prairie\nW. Renner ............................................ Portage la Prairie\nJ. H. Evitt .......................................... Carberry\nW. Evitt ............................................. Carberry\nS. R. Porteous ...................................... Woodlands\nJos. Taylor .......................................... Portage la Prairie\nA. Palmer ............................................ Portage la Prairie\n\nAnd many others who did not Register.\nFIRST DAY.\n\nODDFELLOWS' HALL, Portage la Prairie,\nWednesday, March 18, 1891.\n\nAt the hour of 14 o'clock, the Right Worshipful Grand Master took the chair.\n\nThe R. W. Grand Master appointed Companion Sir A. Huston, Outside Herald and Companion Sir D. Ferguson, Inside Herald.\n\nCompanions Sir W. J. Marshall and W. M. McCullough tested the Companions present in the Royal Scarlet Degree.\n\nCompanion Sir F. M. Finn performed the opening services and the R. W. G. Master declared the Chapter opened for the transaction of business.\n\nCompanions Sir W. J. Marshall and Sir W. McCullough repeated the Royal Scarlet Lecture.\n\nMoved by Companion Jas. Morrow, seconded by Companion W. J. Kernaghan, and\n\nResolved—That Companions Finn, W. Mawhinney, W. McCullough and the mover and seconder be a committee to strike the standing committees.\n\nMoved by Companion W. R. Cahoon, seconded by Companion F. D. Stewart, and\n\nResolved—That this R. W. G. Lodge be reduced to the Orange degree.\n\nThe R. W. G. Master then declared the Grand Lodge reduced to the Orange degree.\n\nMoved by Bro. F. D. Stewart, seconded by Bro. A. Patterson, and\n\nResolved—That we do now adjourn until 19:30 o'clock.\n\nThe R. W. G. Master declared the G. Lodge adjourned.\nEVENING SESSION.\n\nAt the hour of 19:30 o'clock Bro. S. Mulvey, R. W. Grand Master, took the chair, and called the Grand Lodge to order.\n\nR. W. Grand Master appointed Bros. W. J. Marshall and W. McCullough to test the brethren in the Orange degree.\n\nThe R. W. G. Master declared the G. Lodge opened for the transaction of business.\n\nThe following letters of invitation were read by the Grand Secretary:\n\nTo the Right Worshipful Grand Lodge of Manitoba and the North-West Territories.\n\nThe members of your honorable body are cordially invited to visit, any time during your stay in Portage la Prairie, Lansdowne College, an institution established for the education of the youth of both sexes.\n\nB. FRANKLIN.\nPrincipal.\n\nPORTAGE LA PRAIRIE,\nMarch 18, 1891.\n\nTo the Grand Master, Officers and members of the Grand Lodge of Manitoba, L. O. L.\n\nGentlemen: I beg to extend a cordial invitation to all who can make it convenient to visit the Home for Incurables, during your stay in town, anytime from 1 o'clock to 4 in the afternoon.\n\nI have the honor to be\n\nGentlemen,\n\nYour obedient Servant,\n\nJ. P. YOUNG,\nSuperintendent.\n\nMoved by Bro. H. Douglas, seconded by Bro. Robt. Arthurs, and\n\nResolved—That the invitations be accepted and we visit Lansdowne College at 19 o'clock, and the Home for Incurables at 13 o'clock on Thursday.\nMoved by Bro. W. Conolly, seconded by Bro. M. Keenan, and Resolved—That Bros. J. M. Robinson, Rev. F. M. Finn and H. Douglas be a Press committee.\n\nThe Right Worshipful Grand Master then delivered his address.\n\nGRAND MASTER'S ADDRESS.\n\nTo the Members of the Grand Orange Lodge of Manitoba and the North-West Territories.\n\nBrethren,\n\nIt affords me pleasure to again meet the representatives of the Order from the different lodges in Manitoba and the Northwest.\n\nOn entering on a new decade it is earnestly hoped that the same prosperity will attend the order which has marked its progress since the first meeting of Grand Lodge, this day 20 years ago.\n\nProtestants of Canada have been much disturbed during the past few years owing to the favoritism shewn its enemies by powers in high authority, and nothing was more natural than in the late general election differences of opinion should exist, even in our own ranks; but now that the elections are over and that the people have expressed their opinions at the polls as constitutional abiding citizens, we have no alternative but to bow to that decision, and let the principles of our institution be the guiding star of our actions, more so in the future than in the past.\n\nAs will be seen by the reports of your Grand Secretary and Grand Treasurer, the Order in Manitoba and the Northwest Territories was never in a more prosperous condition, numerically, financially and fraternally, than at the close of the past Orange year. This success must, to a large extent, be attributed to the energy and zeal of your Grand Lodge Officers, particularly that of your Grand Secretary, Brother Kernaghan, than whom no better officer could be desired. In this connection I would take the liberty to suggest the propriety of increasing the remuneration of your Secretary, as I am aware that he is not sufficiently paid for the work done. In looking over his correspondence and work it will be perceived that his duties are increasing in proportion to the rapid progress of the Order, and now that the Grand Lodge is financially in a position to afford ample remuneration to its officers there is no reason why it should not be considered immediately.\n\n12th OF JULY CELEBRATION.\n\nIn accordance with a resolution of the Grand Lodge at last meeting, deciding to have a Provincial demonstration in Winnipeg on 12th of July last. The special committee appointed took steps early in the year with a view to the successful accomplishment of the undertaking. Most reasonable passenger rates were obtained from the Canadian Pacific, Manitoba & Northwestern, and the Northern Pacific Railroads. Special trains were engaged for the day requiring a guarantee deposit of $2000 before the\ntrains left the station. Through the liberality of some of the Brethren of Winnipeg and Portage la Prairie, this amount was paid the railroad companies on 11th of July. Your committee of arrangement held meetings daily for over two weeks, and did every thing in their power to make the demonstration a success. The price of tickets was so arranged that they would press more lightly on those who had long distances to come. The 12th, however, arrived and as usual a most beautiful Manitoba mid-summer morning, and I cannot better describe the success of the celebration than read you the following from a city of Winnipeg newspaper by no means too friendly to the Order.\n\n**Thousands in the City.**\n\nThe Orange Celebration to-day -- Nine Special Trains arrive this Morning and Afternoon--The Procession.\n\nLoyal Citizens of the Dominion—the Orangemen of Manitoba and the Territories—are in the city to-day by thousands. It is needless to bid them welcome. We are a free people, living in a free country, where all classes and creeds demand and have a right to think and act in accordance with the free doctrines upon which our constitution is founded; so that to-day the Orangemen are asking no favors or special privileges. Winnipeg is glad to have them. Yesterday afternoon the Canadian Pacific railway allayed all fears of the demonstration committee that the train accommodation would be too limited, by sending out word that there would be a place for everybody who desired to come in. What a scene there was throughout Manitoba to-day. Fathers, mothers, sons and daughters, grandfathers and grandmothers, people who never saw the city and those who have, but were anxious to see it again and honor the 12th, turned many a home into a state of excitement as they rumaged around for their Sunday best, and got to the train in good time, so that, as the Irishman said, if they forgot anything they would have time to go back and fetch it. What a tooting of band instruments and playing of 12th of July airs, \"The Protestant Boys,\" and so on. The like was never before seen in the country, and it may be many a long day before there is such another wholesale excursion on the part of the western people. Nothing short of the mountain steeps of the Rockies in the west and the wilds of Keewatin in the east prevented the celebration being national in extent. Orangemen are here from Calgary in the west to Rat Portage in the east, from the extreme south to the extreme north; from the United States 'o the south—in fact people from all parts of the compass. Nearly 300 excursionists arrived Friday night.\nThis morning and afternoon, when the specials began to come in, the scene was beyond description. A novice calculator of crowds would have affirmed that the outside districts must certainly be completely depopulated. The first train to arrive at the C. P. R. depot at 10:45 was from Manitou. Every car was loaded with hundreds of the finest people on earth—the tillers of the soil in the garden district of the province. Forty-five minutes later a Carberry train arrived. It was a toss-up as to which train contained the better looking lot of folks. The M. & N. W. Ry., Boissevain, Glenboro, Brandon local and West Brandon trains brought in thousands upon thousands. Careful estimators said that not less than 10,000 alighted from the cars. The Stonewall train increased the already large influx, and the regular eastern express and the Great Northern trains now arriving caused the depot platform to be jammed, and a perfect sea of humanity swayed to and fro for hours. The moment one contingent moved off there was another to take its place. Poor Mr. Swain, the depot master. He was patient as anyone could be, and answered a thousand or more questions that were asked of him. A half-dozen in one place were asking when the trains bearing friends would be in, and others were asking when they would have to be onboard so as not to miss the train going hom. One fortunate matter was the scarcity of baggage. Ninety-five per cent. of the folks had nothing with them but what was on their backs. There were numerous vacancies—within—and it didn’t take those lodges long to form into procession and make a bee line for their hotels, where they were consigned as follows:\n\nNo. 891, Souris, at the Park hotel.\nNo. 165, Glenboro, at the Park hotel.\nNo. 1531, Souris, at the Park hotel.\nNo. 1545, Boissevain, at the Park hotel.\nNo. 1501, Elton, at the Park hotel.\nNo. 1490, Carman, at the New Douglas house.\nNo. 1514, Carman, at the New Douglas house.\nNo. 1355, Holland, at the Cabinet hotel.\nNo. 1352, Foxton, at the Cabinet hotel.\nNo. 1646, Stonewall, at the Cabinet hotel.\nNo. 1512, Brandon, at the Cabinet hotel.\nNo. 1511, Carberry, at the Windsor house.\nNo. 1507, McGregor, at the Grand Pacific.\nNo. 1353, Thornhill, at the Mansion house.\nNo. 1494, Neepawa, at the Grand Union.\nNo. 1497, Manitou, at the Clifton house.\nNo. 1522, Fairburn, at the Nicollet house.\nNo. 1457, Morden, at the Winnipeg hotel.\nNo. 1351, Portage la Prairie, at the Clarendon.\nNo. 1354, High Bluff, at the Clarendon.\nNo. 1534, Rowland, at the American and Russell.\nNo. 1504, Carberry, at the Whelan house.\nNo. 1558, Creecord, at the Gault house.\nNo. 1567, Treherne, at the Palmer house.\nNo. 1519, Virden, at the Leland house.\nNo. 1443, Meadow Lea, at the Porteous restaurant.\nNos. 1500, 1503, 1508, 1513, Rock Lake, at the Brunswick hotel.\nNo. 962, Greenway, at the Grand Central.\n\nButchers, bakers, market gardeners, grocers have done a rushing business for days past in supplying the great demand made upon them by the hotels preparing for the 12th. It is well that elaborate preparations were made, as thousands of hungry farmers, many of them not having partaken of food since daybreak, had gorgeous appetites and got away with a lot of Winnipeg victuals in a surprisingly short space of time. Dinner over, and an immense task it was to feed the people, the lodges began to fall in by counties, shortly before two o'clock, taking their positions as under:\n\n| MAIN STREET | |\n|-------------|---|\n| Alexander St. W. | Alexander St. E. |\n| True Blue Lodges | Brandon County |\n| McWilliam St. W. | McWilliam St. E. |\n| Norfolk County | Turtle Mount'n Co. |\n| Rupert St. W. | Rupert St. E. |\n| Rock Lake County | Dufferin County |\n| James St. W. | James St. E. |\n| Minnedosa County | Minota County |\n| Market St. W. | Market St. E. |\n| Portage County | Lady True Blues, G. |\n| Markt City Hall | L. Officers and Speakers in carriages |\n| William St. Orange | |\n| Young Britons | |\n\nSelkirk Co.\nBy falling in on the streets indicated there was little difficulty in forming the procession, and the Orangemen marched up Main Street as follows:\n\n**GRAND TYLER, MOUNTED.**\n\n**WINNIPEG TRUE BLUE BAND.**\n\nMembers of Winnipeg True Blue Lodge, Brandon True Blue Band, members of Brandon and Souris True Blue Lodges.\n\n**BRANDON BRASS BAND.**\n\nLodges 891, 1501, 1503, 1504, 1510, 1511, 1512, 1523, 1531, 1558, of the Orange County of Brandon.\n\nLodges 1355, 1464, 1568, of the Orange County of Norfolk.\n\n**BOISSEVAIN BRASS BAND.**\n\nLodges 1522, 1541, 1545, of the Orange County of Turtle Mountain.\n\nLodges 1400, 1502, 1573, 1585, 962, of the Orange County of Rock Lake.\n\n**MORDEN BRASS BAND.**\n\nLodges No. 1353, 1457, 1490, 1497, 1514 and 1534, of the Orange County of Dufferin.\n\n**VIRDEN BRASS BAND.**\n\nLodges No. 1531, 1519, 1524, 1567, 1569 and 1583, of the Orange County of Minota.\n\n**PORTAGE LA PRAIRIE BRASS BAND.**\n\nLodges No. 1351, 1354, 1443, 1507, of the Orange County of Portage la Prairie.\n\n**CARBERRY BRASS BAND.**\n\nCarberry Orange Young Britons lodge.\n\nWinnipeg Orange Young Britons lodge.\n\n**WINNIPEG BRASS BAND.**\n\nLodges No. 243, 1307, 1352, 1467 and 1520 of the Orange County of Selkirk.\n\nLady True Blues in Carriages.\n\nGrand Lodge Officers and speakers in carriages.\n\nIt was a grand procession. Winnipeggers and the visitors from the country lined the streets in thousands and gazed on the grand parade as it passed along Main street to Broadway; up Broadway to Smith street; down Smith street to Notre Dame street west; along Princess to Market street; from Market to Main street; down Main street to Logan street; up Logan street to Dufferin Park, where the speechifying was to take place. A large platform was erected about fifty feet out from, and facing the grand stand, which was crowded with ladies.\n\nI deem it my duty as your chief officer and chairman of the management committee, to thank the officers and members for their co-operation, and more particularly for their exemplary conduct during the whole day, to\nthe credit of the Orangemen and those who accompanied them be it said that not one man could be seen under the influence of liquor and it was the universal exclamation that in the history of the Capital no more numerous, no more orderly, and no more well-conducted body of people ever paraded the streets of Winnipeg. While the demonstration of the past 12th was numerically and morally all that could be desired, you will perceive by the report of the committee that it also proved financially a success, your committee being able to place to the credit of this Grand Lodge, over and above all expenses, a sum ranging between eleven and twelve hundred dollars.\n\nDuring the year past I have been asked many questions in connection with the working of the Orange order, some of a legal character, which I found myself unable to answer. Our association in this Province being incorporated by a Provincial as well as a Dominion charter, different in Substance and in form, questions may at any time arise which require the attention of a legal gentleman. I would therefore suggest, as a corporation, that this Lodge appoint an additional officer, to be called the \"Grand Solicitor,\" whose duty it would be to advise this Grand Lodge on all matters connected with it as a corporation.\n\nI am glad to perceive that my recommendation at last meeting for the establishment of a Grand Lodge for the Territories, are about being carried into effect. It will be the duty of the brethren of Manitoba to aid our brethren in the West in every possible manner.\n\nFor 20 years I have devoted some time and attention to promote the interests of the Orange Association, and in early days at a great personal sacrifice. I have tried hard to remove in this country the prejudices existing against it in other places. I have struggled hard to make Manitoba a place where every man, of whatever creed, clime or country, could enjoy the benefits of his own opinions undisturbed. I believe our Province today bears testimony to our efforts in this respect.\n\nA few years ago when we sought incorporation for the Orange association in this Province our Bill passed through the Legislature with the almost unanimous support of the peoples representatives of all sides of politics, a circumstance unparalleled in the history of the order in any other Province. I consider then, as I firmly believe now, that in this Province particularly the policy of the Orange institution should be independent, in other words more patriotic than partizan, more Protestant than party. On these principles I stand, in defense of these principles I am prepared to fall. If you agree with me, so much the pleasure; if you disagree, I am sorry. If I have served you so long blameless, to me it is gratifying; if I have displeased anyone lately, love for the institution prompted it, duty, in my estimation, required it.\n\nYours Fraternally,\n\nSTEWART MULVEY,\nGrand Master.\nMoved by B. O. J. M. Robinson, seconded by Bro. F. D. Stewart, and\n\nResolved—That the able, eloquent, and opportune address of the Grand Master be referred to the Committee on Correspondence.\n\nThe Grand Secretary then presented his annual report as follows:\n\nGRAND SECRETARY'S REPORT.\n\nTo the R. W. Grand Master, Officers and Members of the R. W. Grand Orange Lodge of Manitoba and N. W. T.\n\nR. W. Sir and Brethren:—It is with feelings of gratitude to God, that I have the privilege of again meeting with you at this, the nineteenth annual session of this Grand Lodge, and of placing before you my third annual report as your Grand Secretary. In doing so I will try and give you a statement of the work of the Association in this jurisdiction, as far as it is possible for me to do so.\n\nIn looking over the year just closed we see much that is encouraging, although not unmingled with disappointments. Brethren it is my pleasing duty to inform you of the organization and resuscitation of a larger number of lodges, than for a number of years previous.\n\nWARRANTS.\n\nNine new warrants have been issued as follows, viz.:\n1588 to Bro. W. L. Hames, Alameda, Assiniboia County.\n1590 to Bro. Jas. Willoughby, Creeford, Minnedosa County.\n962 to Bro. J. Sexsmith, Ash Creek, Rock Lake County.\n1595 to John W. Elliot, Pasqua, Assiniboia County.\n1598 to Philip Beauchamy, Lake Dauphin, Minnedosa County.\n1599 to W. E. Fisher, Caron, Assiniboia County.\n1600 to William Clarke, Pense, Assiniboia County.\n1601 to John H. Switzer, Silver Creek, Shoal Lake County.\n1602 to David Philips, Morris, Franklin County.\n\nThe latter being incorporated under the Dominion Act and the following have been resuscitated, viz.:\n1456, Bro. Geo. Johnstone, W. M., Emerson, Franklin County.\n1510, Byo. William Orr, W. M., Wellwood, Brandon County.\n1511, Bro. J. Maguire, W. M., Carberry, Brandon County.\n\nOnly one lodge is reported dormant, viz., 1523, Rapid City, which according to Bro. James Hardaker's letter, which is on file, could easily be reorganized.\n\nBy resolution of this Grand Lodge, at its last session, I was instructed to call in Warrant No. 962, issued to Bro. Jos. Barker, of Glenboro, in 1888, and never opened, which I did, and I transferred it to Rock Lake County, where it is working and in a flourishing condition.\n\nOne Royal Scarlet Dispensation has been issued to Isolated, Primary Lodge No 1549, Medicine Hat.\n\nAn application has been received for a Primary lodge at Lethbridge, N. W. T., with Bro. G. W. Steele as W. M., which was duly forwarded the M. W. G. Secretary, and the warrant, no doubt, will be issued shortly. I would here call the attention of the brethren to the fact that the application fee for a Primary Warrant, is now $10.00, which covers cost of incorporation.\n\nRETURNS.\n\nBlank forms for annual returns were mailed, together with the usual circular of instructions to the W. M. of all the Primary Lodges, on Nov. 20th, District Masters on Dec. 25th, and County Masters on January 7th, 1891.\n\n64 of the Primary lodges have sent in duplicate returns. 10 have not done so, they are 1528, Moosomin; 1542, Moose Jaw; 1544, Davidsburg; 1548, Oakburn; 1559, Hill Farm; 1561, Workman; 1573, Cartwright; 1598, Lake Dauphin; 1600, Pense; 1601, Silver Creek.\n\nMy report of the numerical strength of the Association must be imperfect, owing to those lodges not sending in returns and to the very careless manner in which many of the officers make out their returns. Only 8 of the counties have complied with rule 51, page 19, of the constitution. Such gross neglect should be stopped, and at once.\n\nThe 64 lodges report a membership of ...................... 1593\n\nAnd placing the membership of those 10 lodges the same as last year, which is ........................................... 112\n\nWould make a total membership of .................. 1705\n\nThere have been Initiated .................................. 212\nJoined by Certificate ........................................ 207\nReinstated ........................................... 5\n\nTotal .............................................. 424\n\nAgainst that there have been\nWithdrawn by Certificate .................................. 111\nSuspended ............................................. 48\nExpelled ............................................... 8\nDied .................................................... 8\n\nTotal .............................................. 175\n\nTotal Gain 249.\n\nThe largest increase reported is that of 1507, McGregor, 18 Initiated and 8 joined by Certificate.\n\nThe following Counties have not made returns: Turtle Mountain, Portage la Prairie, Assiniboia and Shoal Lake, the latter not for two years.\n\nThe correspondence has more than doubled that of any previous year. All letters received are on file and my replies to those of most importance, are copied in the Grand Lodge letter book. All of which will be laid before the proper committee.\n\nIn accordance with a resolution passed at last session of this Grand Lodge, I mailed copies of resolution re Separate Schools and Dual Language, to Mr. McCarthy and all English speaking Dominion Parliament representatives, who hold seats from Manitoba and North-West. I also mailed copies of all resolutions and recommendations, re Constitutional Amendments to the M. W. G. Secretary, immediately after the close of last session of this Grand Lodge.\n\nNotice of an appeal against the decision of this R. W. G. Lodge, given at its last session, re the election of officers in Franklin County, was received from Bro. David Philips, and all documents relating thereto, were duly forwarded the M. W. Grand Secretary.\n\nThe usual Railway arrangements were made for conveying delegates to and from this meeting for one and one third fare, and certificates mailed to all entitled to them.\n\nYour Grand Secretary would here acknowledge receipts of printed reports from the the Grand Lodges of Scotland, Ireland, New Zealand, Ladies L. O. Association of U. S. and Canada, M. W. G. Lodge B. A., Middle Island, New Zealand; Ontario West and East, Quebec, New Brunswick, Nova Scotia, Newfoundland, P. E. Island, O. Y. Britons and True Blues.\nThe perusal of them must impress the reader with the greatness and rapid progress of the Order throughout the world. I am pleased to note the marvellous growth of the True Blue Association, their G. Secretary reporting the formation of nineteen new lodges, and of having doubled their membership, during the past year. I believe it to be the duty of this G. Lodge to assist our junior orders, in establishing lodges in this province. They have always proved a grand recruiting field for the Orange Association. The ladies of this Order have undertaken, and I am confident, will carry through to a successful issue a grand and noble work, viz., the establishment of a True Blue orphanage, in Toronto, for the purpose of caring for and rescuing Protestant orphans from Romish institutions throughout the Dominion.\n\nTHE SENTINEL.\n\nBrethren, I will again call your attention to the importance of increasing the circulation of this valuable paper, which should be supported by every Protestant, and I trust that ere this session closes, every member, who is not now a subscriber, will add his name to the list.\n\nI have pleasure also in referring to another thorough Protestant journal, published in New Glasgow, N. S., called the \"Vindicator,\" edited by Bro. W. D. Taunton, Junior D. G. Master of that province.\n\nI have also received sample copies of the Protestant Standard of Philadelphia, the Protestant Herald of Pittsburg, and the Patriotic American of Detroit. All of these are ever watchful of and true to the interest of civil and religious liberty.\n\nAccompanying this report, will be found a detailed statement of my account for the year, showing the receipts to be $165.87, and disbursements $166.20\n\nAnd now in conclusion, I beg to tender my fellow Grand Lodge officers and all the representatives of the various lodges, my deep felt appreciation of the kindly forbearing manner in which I have always been treated, which has made my duties a pleasure, during the three years I have held the office of Grand Secretary. It has always been my humble aim to do all in my power to advance the interests of our noble Order, and I trust that in this respect I have not come short of your expectations. And now brethren I fervently pray that God, Who ruleth everywhere, may so guide and govern the heart and actions of each of us, that the work of this session, may be done in harmony, that we may fully realize how good and pleasant it is for\nBrethren to dwell together in unity.\n\nI am Dear Brethren,\nFaithfully and Fraternally Yours,\nW. J. Kernaghan,\nGrand Secretary.\n\nSECRETARY'S FINANCIAL STATEMENT.\n\nW. J. Kernaghan, G. S., in account with the R. W. G. Lodge of\n1890 Manitoba and N. W. T.\n\n| Date   | Description                                      | CR. | DR. |\n|--------|--------------------------------------------------|-----|-----|\n| March 5| By Balance from last year                        | $134|     |\n|        | To D. M. Ure, const.                              |     | $50 |\n|        | To John Morgan, certs. and cons.                  |     | 60  |\n|        | To J. R. Jones                                    |     | 100 |\n|        | To W. G. McKay, const.                            |     | 10  |\n|        | To F. D. Stewart, G. L. Supplies                  |     | 17  |\n|        | By Cartage on G. Sec. Desk                        |     | 75  |\n|        | By O'Loughlin Bros & Co.                          |     | 83  |\n|        | To A. G. Hamilton, fee wrt.                       |     | 800 |\n|        | By Thos. Keyes, fee wrt.                          |     | 800 |\n|        | By Stationery                                     |     | 75  |\n|        | By Thos. Keyes account                            |     | 834 |\n|        | By Postage                                        |     | 200 |\n|        | To H. McWhirter, R. S. Disp.                      |     | 300 |\n|        | By Thos Keyes, R. S. Disp.                        |     | 300 |\n| April 5| To D. R. Gardiner, 20 Cons.                      |     | 200 |\n|        | To W. J. Rose, 4 Cert.                            |     | 100 |\n|        | To Geo. Black, fee wrt.                           |     | 800 |\n|        | By Thos. Keyes, fee wrt.                          |     | 800 |\n|        | To W. J. Rose, 8 cert.                            |     | 200 |\n| May    | To L. O. L. 243, 6 certs.                        |     | 150 |\n|        | By Express charges on Reports                     |     | 75  |\n|        | By Wrappers on Reports                            |     | 60  |\n| June   | To W. Kitson, Dist. Certs.                       |     | 100 |\n|        | To F. D. Stewart                                  |     | 370 |\n|        | To D. M. Ure, supplies                            |     | 300 |\n|        | By Postage                                        |     | 440 |\n|        | To Jas. Morrow, Fee wrt.                          |     | 800 |\n|        | To R. Hamilton, cons.                             |     | 120 |\n| July   | By Postage, (Reg.)                               |     | 75  |\n|        | To Geo. Black, fee wrt.                           |     | 800 |\n|        | To Jos. Starling, supplies                        |     | 150 |\n|        | To Jos. Callin, supplies                          |     | 120 |\n| Date | Description                                                                 | Amount |\n|------|-----------------------------------------------------------------------------|--------|\n| Aug. 4 | By F. G. Stewart, G. Treas.                                                 | 5 00   |\n|      | By O'Loughlin Bros. & Co., stationery                                       | 1 25   |\n|      | By O'Loughlin Bros. & Co., ink                                              | 60     |\n|      | By Postage                                                                  | 1 00   |\n|      | To S. S. Colter, cert.                                                      | 1 00   |\n|      | To John Colbert, fee cert 1527                                              | 50     |\n|      | To John Greenfield, supplies                                                | 2 00   |\n|      | By Thos. Keyes, Rituals                                                     | 2 00   |\n|      | To Robert Conn, supplies                                                    | 3 00   |\n|      | To F. D. Stewart                                                            | 8 00   |\n|      | By W. W. Wright, refund fee wrt                                             | 8 00   |\n| Sept. 17 | To Geo. Johnstone, supplies                                                 | 1 20   |\n|      | By Postage                                                                  | 1 00   |\n|      | To W. Duff, fee wrt                                                         | 8 00   |\n|      | By Robert Birmingham, fee wrt                                               | 8 00   |\n| Oct. 6 | By Express charges on Blank Returns                                         | 70     |\n|      | By Robt. Birmingham, Balance of Account                                     | 15 17  |\n|      | By A. B. Cail, stamp                                                        | 85     |\n|      | By Postage                                                                  | 1 50   |\n|      | To John Morgan, certs                                                       | 1 00   |\n|      | To W. H. Hall, blank forms                                                  | 60     |\n|      | P'y Paid for Printing                                                      | 60     |\n| Nov. 22 | To Jos Callin, certs                                                        | 1 00   |\n|      | By Robt. Birmingham, const                                                  | 1 00   |\n|      | By Postage                                                                  | 1 50   |\n| Dec. 1 | To Thos. McMahon, supplies                                                   | 3 00   |\n|      | By Robt. Conn, refunded                                                     | 60     |\n| Jan. 6 | To D. M. Ure, fee wrt                                                       | 8 00   |\n|      | To J. J. McConnell, G. L. dues and chapter 1526.                            | 7 00   |\n|      | By Robt. Birmingham, fee wrt                                               | 8 00   |\n|      | By F. D. Stewart                                                            | 7 00   |\n|      | To F. D. Stewart                                                            | 7 00   |\n|      | By Robert Birmingham, supplies                                              | 5 17   |\n|      | By P. O. Box Rent                                                           | 2 00   |\n|      | By Postage                                                                  | 1 50   |\n|      | To L. O. L. 1507, const.                                                    | 2 40   |\n|      | To L. O. L. 1568, G. L. Dues                                                | 2 50   |\n|      | By F. D. Stewart                                                            | 2 50   |\nFeb. 3 To D. M. Ure, balance on fee for wrt........... 2 00\n\" 4 By Robert Birmingham......................... 2 00\n\" 5 To J. J. McConnell, certs ..................... 2 00\n\" \" To W. J. Stinson, G. L. Dues, 1507........... 2 50\n\" 7 To G. W. Steel, fee wrt....................... 8 00\n\" \" By R. Birmingham............................ 2 50\n\" 9 By F. D. Stewart.............................. 2 50\n\" \" By R. Birmingham, fee wrt.................... 8 09\n\" 11 By Express Charges on R. R. certs........... 40\n\" 13 To I. L. Mawhinney, G. L dues, etc.......... 9 50\n\" 14 By F. D. Stewart............................ 9 50\n\" 16 By Postage................................. 3 00\n\" 23 To D. McKay, certs.......................... 1 50\n\" 25 To D. Tidsberry, supplies.................... 4 70\n\nMarch 3 By O'Loughlin Bros. & Co., order and receipt 2 25\n\" 14 To E. Scott, G. L. Dues and Chapter 1443.... 9 00\n\" 17 By Postage, Cards, etc....................... 85\n\" \" By F. D. Stewart............................ 9 00\n\n$166 20 $165 00\n\nMoved by Bro. W. Wigmore, seconded by Bro. Jos. Quinn.\n\nResolved—That the report of the Grand Secretary be received and landed to the committee on correspondence and Finance committee.\n\nThe Grand Treasurer then presented his annual report, as follows:\n\nGRAND TREASURER'S REPORT.\n\nTo the R. W. Grand Master, Officers and Members of the R. W. Grand Orange Lodge of Manitoba and N. W. T.\n\nR. W Sir and Brethren,—I have much pleasure in submitting for your consideration the Annual Financial Statement for the year ending March 18, 1891, being the fifth as your Grand Treasurer, I have the honor to present to you. At the last annual meeting of the Grand Lodge there was a cash balance of $186.48, and I have received during the past year the sum of $432.20. These amounts added together make a total of $618.68.\nThis amount is derived from the following sources:\n\nBalance on Hand, 5th March, 1890, .................. $186 48\nGrand Lodge Dues to date .................................. 165 00\nTax per Capita to date ........................................ 265 20\nPresentation Fund .............................................. 2 00\n\nTotal ......................................................... $618 68\n\nI have disbursed from the General Fund, during the year the sum of ........................................... $518 77\n\nLeaving a balance on hand to General Fund of ........ $99 91\n\nThere is also the sum of $1150.47 to the credit of this Grand Lodge, in the Commercial Bank of Manitoba, which is the proceeds of the celebration which was held in the city of Winnipeg on the 12th July last. Taking these amounts added together, places to the credit of this Grand Lodge, the very handsome sum of $1250.33.\n\nI regret to say that from some cause, not more than one half of the Primary lodges in the jurisdiction, have made the necessary returns to the Grand Treasurer, so that I am unable to make as full a financial report as I otherwise would, and I would urge upon the County Officers to use the utmost vigilance, immediately after county meetings, to have their reports prepared and forwarded to the proper Grand Officers, who will then be enabled to submit to this Grand Lodge such reports as will enable all parties interested to see at a glance, the status and financial standing of our Order. During the past year I used every means in my power to collect the outstanding accounts and have succeeded in collecting all except about half a dozen lodges. The same state of affairs presents itself, at the present time and I trust that in the future this difficulty will become less apparent from year to year.\n\nWith best wishes to my brethren and trusting that the present meeting of the Grand Lodge, will prove both pleasant and profitable.\n\nI am Yours Fraternally,\n\nFRANK D. STEWART.\nGrand Treasurer.\n\nGENERAL FUND.\n\n| Date     | Name            | L.O.L. No. | G. L. Dues. | Capita Tax. | Total   |\n|----------|-----------------|------------|-------------|-------------|---------|\n| 1889     |                 |            |             |             |         |\n| March 5  | Alex. Hamilton  | 1566       | $2 50       | $1 70       | $4 20   |\n|          | Geo. Huston     | 1533       | 2 50        | 1 50        | 4 00    |\n| Date   | Name               | Amount |\n|--------|--------------------|--------|\n|        | Albert Baldwin     | 1497   |\n|        | John Kyle          | 1512   |\n|        |                    | 891    |\n|        |                    | 1558   |\n|        |                    | 1504   |\n|        | James Burland      | 1523   |\n|        | T. D. Cavanagh     | 1583   |\n|        | James Burland      | 1523   |\n|        | John Petterson     | 1590   |\n|        |                    | 1502   |\n| May    | R. J. Granes       | 1585   |\n|        | Geo. Barber        | 1546   |\n|        | W. J. Stinson      | 1507   |\n|        | Thos. McMahon      | 1352   |\n|        | D. S. Carnahan     | 1574   |\n|        | Joseph Callin      | 1581   |\n|        | Jonas Christie     | 1465   |\n|        | John Patterson     | 1508   |\n|        | John Lee           | 1561   |\n|        | J. J. Ford         | 1568   |\n|        | J. J. Ford         | 1355   |\n| June   | Andrew T. Morrison | 1571   |\n|        | James Burland      | 1523   |\n|        | Frank Middleton    | 1567   |\n|        | James Cowan        | 1531   |\n|        | Geo. Broadfoot     | 1443   |\n| July   | Jas. D. Fulford    | 1573   |\n|        | Jas. Graham        | 1494   |\n|        | Samuel Taylor      | 1503   |\n|        | John Kyle          | 1501   |\n| Aug.   | W. J. Kernaghan    | 1544   |\n| Dec.   | H. Douglas         | 1354   |\n|        | George Ellis       | 1532   |\n| Jan    | W. J. Kernaghan    | 1526   |\n|        | John Patterson     | 1508   |\n|        |                    | 1502   |\n| Feb.   |                    | 962    |\n|        | W. J. Kernaghan    | 1507   |\n|        | H. McWhirter       | 1549   |\n|        | S. Combs           | 1563   |\n|        | John Kyle          | 1558   |\n|        |                    | 891    |\n| Date | Item Description                                      | Amount |\n|------|------------------------------------------------------|--------|\n| Feb. 17 | 1501                                                | 2.50   |\n|       | 1512                                                | 2.50   |\n|       | 1510                                                | 2.50   |\n|       | 1511                                                | 2.50   |\n|       | 1504                                                | 2.50   |\n|       | W. J. Kernaghan                                     | 2.50   |\n|       | 1355                                                | 2.50   |\n|       | 1568                                                | 2.50   |\n|       | Wm. Shannon                                         | 2.50   |\n|       | 1522                                                | 2.50   |\n|       | 1541                                                | 2.50   |\n|       | 1545                                                | 2.50   |\n|       | John Patterson                                      | 2.50   |\n|       | 1500                                                | 2.50   |\n|       | 1585                                                | 2.50   |\n| Mar. 4 | Frank Middleton                                     | 2.50   |\n|       | 1524                                                | 2.50   |\n|       | 1513                                                | 2.50   |\n|       | 1569                                                | 2.50   |\n|       | 1583                                                | 2.50   |\n|       | 1567                                                | 2.50   |\n|       | John W. Black                                        | 2.50   |\n|       | 1505                                                | 2.50   |\n|       | Jas. R. Jones                                       | 2.50   |\n|       | 1490                                                | 2.50   |\n|       | 1534                                                | 2.50   |\n|       | 1353                                                | 2.50   |\n|       | 1514                                                | 2.50   |\n|       | 1457                                                | 2.50   |\n|       | 1497                                                | 2.50   |\n\nTotal: $80.00\n\nEXPENDITURE (General Fund).\n\nDate. Items.\n\n1890\n\nMar. 7 Dues G. Lodge B. A., Wm. Anderson G. T. ........... $63.00\n\" 7 Three Telegrams, G. M. Stewart Mulvey ............. 3.25\n\" 7 W. J. Kernaghan, G. L. Supplies .................. 10.17\n\" 7 F. Gilmore, Services O. T. order G. M ............ 5.00\n\" 7 Grand Master's Expenses to Goderich .............. 25.00\n\" 7 H. Pollock & Co., Silver Service, etc. .......... 81.75\nJune 3 W. J. Kernaghan, G. S. Postage Account .......... 3.70\nAug. 27 W. J. Kernaghan, Refund Broadview ............ 8.15\n\n1891\n\nJan. 14 W. J. Kernaghan, \"Card Sentinel,\" ............. 10.00\n\" 17 W. J. Kernaghan, Supplies G. L .................. 7.00\nMar. 18 Frank D. Stewart, Grand Treasurer, Postage and Stationery ........................................ 15.00\n\" 18 Grand Master Mulvey, Expenses to Goderich ....... 50.00\nMoved by Bro. Jos. Quinn, seconded by Bro. M. Keen\n\nand\n\nResolved—That the report of the Grand Treasurer be received and referred to the committee on Finance.\n\nREPORT OF COMMITTEE TO STRIKE STANDING COMMITTEES.\n\nTo the Right Worshipful Grand Lodge of Manitoba and N.W.T.\n\nWe, your Committee appointed to strike Standing Committees, beg to Report as follows:\n\nCREDENTIALS.\n\nJos. Anderson, Chairman,\nR. B. Hetherington\nW. R. Cahoon\nW. J. Marshall\nJ. Pollock\n\nFINANCE.\n\nD. M. Ure, Chairman,\nW. McCullough\nS. Colter\nM. Keenan\nJ. Hoey\n\nPETITIONS AND APPEALS.\n\nW. Mawhinney, Chairman,\nJohn Mooney\nW. Wigmore\nF. C. Morrison\nHenry Wood\n\nAll of which is respectfully submitted.\n\nCORRESPONDENCE.\n\nJ. Niblock, Chairman\nJ. M. Robinson\nW. Conolly,\nA. Patterson\nF. M. Finn.\n\nSUSPENSIONS AND EXPULSIONS.\n\nI. Mawhinney, Chairman\nGeo. Black\nJos. Quinn, Sr.\nF. D. Stewart\nW. F. Carefoot\n\nCONSTITUTION AND LAWS.\n\nW. Kitson, Chairman\nGeo. Huston\nH. Douglas\nGeo. Maxwell\nThos. Salter.\n\nF. M. Finn; Chairman\nW. J. Kernaghan, Secretary\nWm. McCullough.\nI. Mawhinney.\nJas. Morrow.\nMoved by Bro. F. M. Finn, seconded by Bro. W. Mawhinney and\n\nResolved—That this report be received and adopted.\n\nREPORT OF 12TH JULY CELEBRATION COMMITTEE.\n\nGRAND LODGE ROOM,\nPORTAGE LA PRAIRIE,\nMarch 18, 1891.\n\nTo the Worshipful Grand Lodge of Manitoba and N. W. T. in Annual Session Assembled.\n\nYour Committee of Arrangements for 12th July celebration, beg to report as follows:\n\n1. That early in the year, your Committee met and made preliminary arrangements with the C. P. R., M. and N. W. and Northern Pacific Railroad Companies for passenger rates to Winnipeg. Nine special trains were engaged, requiring a special guarantee deposit of $2,300 by the Committee.\n\nYour committee held some twenty special meetings for the occasion, entailing a great amount of labor and responsibility. The prices were made as low as possible. We are glad to be able to report that the thousands who took advantage of the rates to participate in the demonstration, taxed all the railroads to their utmost capacity.\n\nThe day and demonstration were in every way a success, the conduct of the brethren being everything that could be desired.\n\nThe sum total realised from the sale of tickets, etc., amounted to $1516.02. Total amount of payments under the head of expense, in connection with the day, amounted to $365.55. Leaving a respectable balance of $1150.47 to the credit of this Grand Lodge.\n\nThe committee desire to thank the C. P. R., the Manitoba & North-Western, and the Northern Pacific railroads for their liberality in rates, also for their increasing efforts; under unexpected difficulties, in trying to make the excursionists as comfortable as possible.\n\nThe committee desire to express their thanks through you to the thousands, who participated in the day's celebration, for their excellent conduct throughout the day. It was the general remark that no more quiet or orderly gathering ever was seen in the city of Winnipeg.\n\nSTEWART MULVEY, Chairman,\nW. J. Kernaghan, Secretary.\nMoved by Bro. Jas. Morrow, seconded by Bro. M. Keenan and\n\nResolved—That this report be received and referred to Finance Committee\n\nCommunications were read from Bro. A. G. Hamilton, of Moosomin, and J. Mitchell, of Summerbury, re formation of Grand Lodge for the Territories.\n\nMoved by Bro. J. Niblock, seconded by Bro. F. D. Stewart, that the communication of Bro. A. G. Hamilton, be referred to committee on correspondence and that of Bro. J. Mitchell to committee on Finance.\n\nMoved by Bro. J. Niblock, seconded by Bro. F. D. Stewart, and\n\nResolved—That this Grand Lodge do now adjourn until the call of the Grand Master\n\nThe Grand Master declared the Grand Lodge adjourned accordingly.\n\nAt the hour of 23:30 o'clock, the Grand Master took the chair and called the Grand Lodge to order.\n\nBros. W. J. Marshall and Jos Andrews tested the brethren in the Orange degree and the Grand Master declared the Lodge open for the transactions of Business.\n\nREPORT OF COMMITTEE ON CREDENTIALS.\n\nTo the Right Worshipful Grand Orange Lodge of Manitoba and North-West Territories.\n\nRIGHT WORSHIPFUL SIR AND BRETHREN,—We, Your committee on credentials beg leave to report that we have examined the credentials submitted to us, and find the following members present and entitled to sit and vote in this Right Worshipful Grand Lodge:\n\nPROVINCE GRAND OFFICERS.\n\nGrand Master, Stewart Mulvey, Winnipeg.\nDeputy Grand Master, James Morrow, Silver Springs.\nAssociate Deputy Grand Master, George Maxwell, Winnipeg.\nGrand Chaplain, F. M. Finn, Carberry.\nGrand Secretary, W. J. Kernaghan, Winnipeg.\nGrand Treasurer, F. D. Stewart, Carman.\nGrand Lecturer, Wm. McCullough, Portage la Prairie.\nDeputy Grand Chaplain, Henry Wood, Morris.\nDeputy Grand Secretary, Wm. Connolly, Winnipeg.\n\nPAST GRAND OFFICERS.\n\nPast Grand Master, John Niblock, Medicine Hat.\ndo do Isaiah Mawhinney, Holland.\ndo do J. M. Robinson, Brandon.\ndo Lecturer, Jos. Andrew, Chumah.\n\nCOUNTY MASTERS.\n\n| NAME               | COUNTY     | P. O. ADDRESS   |\n|--------------------|------------|-----------------|\n| F. C. Morrison     | Norfolk    | Indianford      |\n| Abraham Patterson  | Dufferin   | Shadeland       |\n| John Pollock       | Rock Lake  | Silver Springs  |\n| George Black       | Minnedosa  | Minnedosa       |\n| R. Scott           | Franklin   | Dominion City   |\n\nPAST COUNTY MASTERS.\n\n| NAME              | COUNTY                | P. O. ADDRESS   |\n|-------------------|-----------------------|-----------------|\n| Wm. Mawhinney     | Portage la Prairie    | P'ge la Prairie |\n| W. J. Marshall    | Selkirk               | Winnipeg        |\n| D. M. Ure         | Franklin              | Morris          |\n| R. B. Hetherington| Brandon               | Douglas         |\n| W. Wigmore        | Minnedosia            | P'ge la Prairie |\n| Ed. Scott         | Portage la Prairie    | do              |\n| J. E. Cooper      | Franklin              | Emerson         |\n| Geo. Huston       | Shoal Lake            | Marney          |\n\nCOUNTY PROXIES.\n\nJohn Moony Miniota Virden\n\nDISTRICT MASTERS.\n\n| NAME     | DISTRICT     | P. O. ADDRESS   |\n|----------|--------------|-----------------|\n| W. Keenan| Winnipeg     | Winnipeg        |\n| W. R. Cahoon| High Bluff | High Bluff     |\n\nPAST DISTRICT MASTERS.\n\n| NAME       | DISTRICT     | P. O. ADDRESS   |\n|------------|--------------|-----------------|\n| Wm. Kitson | High Bluff   | Burnside        |\n| H. Douglas | High Bluff   | P'ge la Prairie |\n| S. S. Colter| Stratford   | Virden          |\n| Isaac Mawhinney| High Bluff | Holland         |\n| John Porteous| High Bluff | Winnipeg        |\nWORSHIPFUL MASTERS\n\nJames Hoey ........................................ L. O. L. 1501 ........... Elton\nJoseph Quinn ...................................... do 1512 ........... Brandon\nW. F. Carefoot ..................................... do 1519 ........... Virden\nD. Lipsett ........................................... do 1443 ........... Meadow Lea\nGeo. Johnston ....................................... do 1456 ........... Emerson\nThos. Salter ......................................... do 1490 ........... Salterville\n\nDEPUTY MASTERS\n\nJoseph Bowes ....................................... L. O. L. 1351 ........... P'ge la Prairie\n\nPRIMARY PROXIES.\n\nJames Mawhinney .................................. L. O. L. No. 1355 ........... Holland\nJ. W. Black .......................................... do 1505 ........... Minnedosa\nRobert Arthurs ...................................... do 243 ........... Winnipeg\nHenry Gage .......................................... do 1520 ........... Winnipeg\nAlex. Dalzell ......................................... do 1354 ........... High Bluff\n\nWe find Bro. W. M. Ingersol registered as County Master for Shoal Lake County, but as no returns are in, your Committee are not in a position to say that he is entitled to sit and vote in this Grand Lodge.\n\nAll of which is respectfully submitted.\n\nJos. Andrew, Chairman,\nW. J. Marshall,\nJohn Follock,\nW. R. Cahoon,\nR. B. Hetherington.\n\nMoved by Bro. Jas. Andrews, seconded by Bro. W. J. Marshall and\n\nResolved,—That the report of the Committee on Credentials be received and adopted\n\nMoved by Bro. W. Wigmore, seconded by Bro. W. J. Marshall, and\n\nResolved,—That Bro. Ingersol, County Master for Shoal Lake be allowed to vote, as the County returns are temporarily detained.\n\nREPORT OF THE FINANCE COMMITTEE.\n\nTo the Right Worshipful, the Provincial Grand Lodge of Manitoba and the North-West Territories,\n\nWe, your committee on Finance, would respectfully beg leave to submit the following report:\nThat we have examined the books, accounts and vouchers of the Grand Treasurer for the past year, and find his books to correspond with the report that has been presented to this Right Worshipful Grand Orange Lodge showing a balance on hand, $99.91\n\nTwelfth July Fund.................. $150.47\n\nTotal................................. $1250.38\n\nYour committee congratulate the Grand Treasurer on the able manner in which he has kept his books during the past year.\n\nYour committee examined the financial statement of the Grand Secretary and would recommend the same be adopted.\n\nYour committee would also recommend that, owing to the amount of increased work in connection with the Grand Secretary's office, that the Grand Secretary receive one hundred dollars for his services for the past year.\n\nYour committee would also recommend that Grand Treasurer be paid the sum of fifty dollars for his services for the past year, and would also recommend that the outside Tyler be paid the sum of Five dollars for his services and the inside Tyler Two dollars and a half.\n\nYour committee would also recommend that the petition of the Assiniboia County Lodge be put on file for future consideration.\n\nYour committee would also beg to report that the per capita tax be 10c. per member for the year 1892.\n\nAll of which is respectfully submitted.\n\nD. M. Ure, Chairman,\nS. S. Coulter,\nM. Keenan,\nJames Hoey,\nWm. McCulloch.\n\nMoved by Bro. D. M. Ure, seconded by Bro. M. Keenan and\n\nResolved,—That the report of the Committee on Finance be received and adopted.\n\nREPORT OF COMMITTEE ON SUSPENSIONS AND EXPULSIONS.\n\nTo the Right Worshipful Grand Orange Lodge of Manitoba and North-West Territories.\n\nRight Worshipful Sir and Brethren.—Your Committee on Suspensions and Expulsions beg leave to report that we have examined all\nthe various county lodge returns and find the following expulsions and sus-\npensions.\n\n**EXPULSIONS.**\n\nL. O. L. 1503, Daniel Wilson,\ndo Harry Merrill,\ndo Wm. Herron.\n\nContempt of Summonses and non-payment of dues.\n\nAll the above appear to be regular and constitutional with the exception of the suspension in L. O. L., No. 1477, and 1499 for which no particulars are given as to cause of suspension, or length of suspension. We would recommend that the other suspensions and expulsions be confirmed. We would strongly recommend that the recording secretaries of all lodges use more care in filling up returns so that they may reach the Grand Secretary in a better form than has prevailed during the past years.\n\nAll of which is respectfully submitted.\n\nJos. Quinn,\nW. F. Carefoot,\nGeo. Black,\nI. Mawhinney,\nF. D. Stewart.\n\nMoved by Bro. Jos. Quinn, seconded by Bro. Frank D. Stewart and\n\nResolved,—That the report of the Committee on Suspensions and Expulsions be received and adopted.\n\n**REPORT OF COMMITTEE ON PETITIONS AND APPEALS.**\n\nTo the Right Worshipful Grand Orange Lodge of Manitoba and the North-West Territories.\n\nWe, your committee on Petitions and Appeals, beg leave to report that on enquiry we find that there are no petitions or appeals to be submitted to your committee.\n\nRespectfully submitted.\n\nW. Mawhinney,\nH. Wood,\nFrank C. Morrison,\nJohn Jooney,\nW. Wigmore.\n\nMoved by Bro. W. Mawhinney, and seconded by Bro. W. Wigmore and\n\nResolved,—That the report of Committee on Petitions and Appeals be received and adopted.\nREPORT OF COMMITTEE ON CORRESPONDENCE.\n\nTo the Right Worshipful Grand Orange Lodge of Manitoba and the North-West Territories.\n\nYour committee on Correspondence beg leave to state that they have examined carefully the Grand Master's address, the report of the Grand Secretary and the correspondence of the Grand Secretary's office laid before them and would respectfully recommend as follows:\n\n1. That the Grand Master's address be published in full in the proceedings of this most Worshipful Grand Lodge and that the suggestion to increase the salary of the Grand Secretary be acted upon by the finance committee. In regard to the recommendation of the appointment of a Grand Lodge solicitor, we do not think it is necessary that such officer should be appointed at the present time.\n\n2. Referring to the letter addressed to the Grand Secretary by Bro. A. G. Hamilton, of Moosomin, stating that the Orangemen of the Territories had decided to form themselves into a Grand Lodge and also to a clause in the Grand Master's address, referring to the same matter, your committee are of the opinion that it is not advisable to institute a Grand Lodge in the Territories at the present time for the following reasons: 1st, the country intended to be embraced by that grand lodge, is entirely too sparsely settled to warrant the establishment of such Grand Lodge. 2nd, Your committee have reasons to believe that some of the most important lodges of the Territories are opposed to the movement. Your committee would therefore recommend that a petition be forwarded to the Most Worshipful Grand Lodge, praying that body not to grant the separation of the Territories from the jurisdiction of this Grand Lodge.\n\n3. Your committee beg to compliment your Grand Secretary upon the satisfactory report he has given of the work of his office and would recommend that it be printed in full in the Grand Lodge minutes.\n\n4. In regard to a letter from Bro. Niblock, asking that the Rev. Bro. Morrison, Past Grand Chaplain, be given a letter of recommendation to the Orangemen in Ireland, your committee would suggest that such a letter signed by the Grand Master and Grand Secretary, be forwarded to Bro. Morrison at an early date.\n\nAll of which is respectfully submitted.\n\nJ. NIBLOCK,\nF. M. FINN.\nA. PATTERSON.\nWM. CONOLLY.\nJ. M. ROBINSON.\n\nOrange Hall, Portage la Prairie,\nMarch 18, 1891.\nMoved by Bro. J. M. Robinson, and seconded by Rev. Bro. F. M. Finn, and\n\nResolved,—That the report of the Committee on Correspondence be adopted.\n\nNOTICE OF MOTION.\n\nBro. J. M. Robinson gives notice that at to-morrow afternoon session of this Grand Lodge, he will move that a grant of One Hundred Dollars ($100.00) be made, by this R W. Grand Lodge, in aid of the Medicine Hat Hospital.\n\nBro. Geo. Huston gives notice that he will, at to-morrow's session of this Grand Lodge, move that townships 15, 16 and 17, in Range 20 west, be detached from the Orange County of Minnedosa, and be added to the Orange County of Shoal Lake.\n\nMoved by Bro. Geo. Johnstone, seconded by Bro. R. Arthurs, and\n\nResolved,—That this Grand Lodge do now adjourn until 9 o'clock to-morrow.\n\nThe Grand Master declared the Grand Lodge adjourned accordingly.\n\nSECOND DAY.\n\nTHURSDAY, MARCH 19, 1891.\n\nMORNING SESSION.\n\nAt the hour of 9 o'clock the R. W. Grand Master took the chair and called the Grand Lodge to order.\n\nThe R. W. Grand Master appointed Bros. W. Conolly and M. Keenan to test the brethren in the Orange degree.\n\nRev. Bro. F. M. Finn then read a portion of Scripture, and\nthe Grand Master declared the Grand Lodge open for the transaction of business.\n\nMoved by Bro. F. D. Stewart, seconded by Bro. Geo. Huston and\n\nResolved,—That the minutes of last session be considered as read.\n\nADDRESS OF WELCOME FROM DISTRICT OF HIGH BLUFF.\n\nTo the Right Worshipful the Grand Master and the Grand Lodge of Manitoba and the North-West Territories.\n\nRIGHT WORSHIPFUL SIR AND BRETHREN,—The officers and members of the District Lodge of High Bluff, extend to you, a cordial welcome to the town of Portage la Prairie, on this occasion of your nineteenth annual meeting.\n\nWe earnestly hope that your visit may be pleasant and agreeable, and that all your deliberations may be conducive to the best interests of our order, and to the public good.\n\nWe are glad to assure you of the continued success and prosperity of the order in this district; and to hear of the equally progressive state of our association throughout your jurisdiction.\n\nFraternally Yours,\n\nW. R. CAHOON, District Master.\nW. Kitson, District Secretary.\n\nMoved by Bro. F. D. Stewart, seconded by Bro. Geo. Huston, and\n\nResolved,—That the address of welcome, presented by the District of High Bluff, be received and referred to a Committee composed of Bros. S. S. Colter, Rev. F. M. Finn, Jas. Morrow, W. M. Whinney and R. B. Hetherington, who will draft a reply.\n\nMoved by Bro. F. D. Stewart, seconded by Bro. Geo. Huston, and\n\nResolved,—That this Grand Lodge do now adjourn until 13.30 o'clock.\n\nThe Grand Master then declared the Grand Lodge adjourned accordingly.\nAFTERNOON SESSION.\n\nAt the hour of 15:00 o'clock the Deputy Grand Master took the chair and called the Grand Lodge to order.\n\nThe Deputy Grand Master appointed Bros. W. J. Marshall and W. Conolly to test the brethren in the Orange degree.\n\nThe Deputy Grand Master then declared the Grand Lodge open for the transaction of business.\n\nMoved by Bro. W. Wigmore, seconded by Bro John W. Black and\n\nResolved,—That in the opinion of this Grand Lodge, the County Lodge of Minnedosa should settle the question of difference between Bro. Adamson and L. O. L. No. 1526, at their semi-annual meeting in June.\n\nSUPPLEMENTARY REPORT OF COMMITTEE ON CREDENTIALS\n\nTo the Right Worshipful Grand Orange Lodge of Manitoba and North-West Territories.\n\nRIGHT WORSHIPFUL SIR AND BRETHREN,—We, Your committee on credentials beg leave to bring in a supplementary report as we have examined the register and credentials and find the following brethren entitled to sit and vote in this Right Worshipful Grand Orange Lodge:\n\nA. Gordon, Deputy Grand Chaplain, Portage la Prairie.\nO. Williamson, Past County Master, Portage la Prairie.\nThos. Muirhead, W. M. L. O. L. 1504, Fairview.\n\nAll of which is respectfully submitted.\n\nJos Andrew, Chairman.\nW. R. Cahoon,\nR. B. Hetherington.\nJohn Pollock,\nW. J. Marshall.\n\nMoved by Bro. Jos. Andrew, seconded by Bro. R. B. Hetherington, and\n\nResolved,—That the supplementary report of the Committee on Credentials be received and adopted.\nNOTICE OF MOTION.\n\nBro. Jas. Morrow gives notice that at next session of this Grand Lodge, he will move\n\nThat this Lodge humbly request the Most Worshipful Grand Master, to postpone the meeting of the M. W. Grand Lodge, until the last Wednesday, in June, with a view of allowing the delegates from this Grand Lodge to attend the meeting of the Triennial Council, without making an additional trip east.\n\nIn accordance with the notice given, it was moved by Bro. J. M. Robinson, seconded by Bro. W. Wigmore and\n\nResolved,—That a grant of One Hundred Dollars ($100.00) be made by this Grand Lodge in favor of the Medicine Hat Hospital.\n\nIn accordance with notice given, it was moved by Bro. Geo. Huston, seconded by Bro. Ingersol, and\n\nResolved,—That townships 15, 16, and 17, in range 20 west, be detached from the Orange County of Minnedosa and attached to the Orange County of Shoal Lake.\n\nA communication was read from the County Master of Brandon County.\n\nMoved by Bro. J. Niblock, seconded by Bro. R. B. Hererington, and\n\nResolved,—That the communication from Brandon County be referred to Committee on Suspensions and Expulsions.\n\nMoved by Bro. J. M. Robinson, seconded by Bro. W. Conolly and\n\nResolved,—That this Grand Lodge do now adjourn until 20:00 o'clock.\n\nThe Grand Master then declared the Grand Lodge adjourned accordingly.\n\nThe Officers and Members assembled in the hall at 19 o'clock and formed in procession, and marched to the Lansdowne College, where a very pleasant evening was spent, an excellent programme of vocal and instrumental music, having been provided by the pupils of the College.\nEVENING SESSION.\n\nAt the hour of 22 o'clock the R. W. G. Master took the chair and called the Grand Lodge to order.\n\nThe R. W. G. Master appointed Bros. W. McCullough and W. J. Marshall to test the brethren in the Orange degree.\n\nThe R. W. G. Master declared the Grand Lodge ready for business.\n\nMoved by Bro. W. J. Marshall, seconded by Bro. Jos Andrews and\n\nResolved,—That a cordial vote of thanks be tendered Dr. Franklin and management of Lansdowne College, for their kind reception and entertainment, given the members of this Grand Lodge.\n\nELECTION OF OFFICERS.\n\nThe Grand Master then declared the Grand Lodge ready to proceed to the election of officers, and called upon R. W. Past G. Master, J. M. Robinson, to take the chair, when the following officers were elected, Bros. W. H. Hall, D. Harper and W. J. Rose acting as scrutineers:\n\nBrother Stewart Mulvey, Grand Master.\n\" James Morrow, Deputy Grand Master.\n\" Geo. Maxwell, Junior Deputy Grand Master,\n\" Rev. F. M. Finn, Chaplain.\n\" F. D. Stewart, Grand Treasurer.\n\" W. J. Kernaghan, Grand Secretary.\n\" W. McCullough, Grand Lecturer.\n\" W. J. Marshall, Grand D. of C.\n\" Rev. Thos. Argue, Deputy Grand Chaplain.\n\" Rev. A. Gordon, Deputy Grand Chaplain.\n\" W. Conolly, Deputy Grand Secretary.\n\nMoved by Bro. W. Conolly, seconded by Br. W. J. Marshall and\n\nResolved,—That a hearty vote of thanks be tendered the scrutineers.\nMoved by Bro. W. J. Marshall, seconded by Bro. W. Conolly, and\n\nResolved,—That we do now adjourn for half an hour for lunch.\n\nThe Past Grand Master declared the Grand Lodge adjourned accordingly.\n\nThe Past G. Master took the chair and called the Grand Lodge to order.\n\nBros. W. J. Marshall and W. Conolly tested the brethren in the Orange degree.\n\nThe officers were then duly installed by the Past G. Master, Bro. J. M. Robinson.\n\nThe following brethren were duly elected delegates to the Triennial Council: Bros. S. Mulvey, Jas. Morrow, John Niblock, Mr. Robinson, W. J. Kernaghan, R. Arthurs, George Johnston. Alternate delegates: F. D. Stewart, Geo. Maxwell, Geo. Huston, Jos. Quinn.\n\nREPLY TO ADDRESS OF WELCOME.\n\nTo the Right Worshipful Grand Orange Lodge of Manitoba and North-West Territories.\n\nRIGHT WORSHIPFUL SIR AND BRETHREN.—We, your Committee appointed to draft a reply to the address of welcome, presented by the District Orange Lodge of High Bluff, beg to report as follows:\n\nWe have enjoyed the hospitality of the brethren during the continuance of the Grand Lodge and hereby express our hearty appreciation of their kindness and fully respond to the sentiments contained in the address of welcome, presented to this Grand Lodge. We have viewed with pleasure the rapid improvement in your town since our last visit thereto as a Grand Lodge, and fervently pray that this very desirable advancement may continue.\n\nAll of which is respectfully submitted.\n\nS. S. Colter,\nF. M. Finn,\nR. B. Hetherington.\nI. Mawhinney,\nJames Morrow.\nGENERAL FUND (Supplementary Report).\n\nPresented by the Grand Treasurer at second session of Grand Lodge. Statement in detail of amounts received from Primary Lodges\n\n| DATE | NAME            | L. O. L. No. | G. L. DUES | TAX PER CAP | TOTAL   |\n|------|-----------------|--------------|------------|-------------|---------|\n| Mar. 18 | Frank Morrison | 1465         | $2 50      | $7 25       | $9 75   |\n| \"     | Wm. Conolly    | 1520         | 2 50       | 16 50       | 19 00   |\n| \"     | Henry Wood     | 1307         | 2 50       | 9 00        | 11 50   |\n| \"     | Geo. Huston    | 243          | 2 50       | 7 00        | 9 50    |\n| \"     | Wm. Kittson    | 1456         | 2 50       | 3 75        | 6 25    |\n| \"     | Wm. Kittson    | 1351         | 2 50       | 15 25       | 17 75   |\n| \"     | Wm. L. Ingersoll| 1533        | 2 50       | 3 75        | 6 25    |\n| \"     |                 | 1351         | Testimonial Fund | 5 00 |\n| \"     |                 | 1548         | 2 50       | 7 75        | 10 25   |\n\nBalance from 1st report ........................................... $95 25.\n\nBalance on hand as per Auditor's Report ............ $1345 63.\n\nSUPPLEMENTARY REPORT OF THE FINANCE COMMITTEE.\n\nTo the Right Worshipful Grand Orange Lodge of Manitoba and the North-West Territories.\n\nWe, your committee beg to present the above report.\n\nMoved by Bro. D. M. Ure, seconded by Bro. S. S. Colter, and\n\nResolved,—That the supplementary report of the Finance committee be received and adopted.\n\nMoved by Bro. W. M. Ingersol, seconded by Bro. Thos. Salter and\n\nResolved,—That a hearty vote of thanks be tendered the I. O. O. F. of Portage la Prairie, for the use of their handsome hall in which to hold the annual meeting of this R. W. Grand Lodge.\n\nMoved by Bro. W. Wigmore, seconded by Bro. John Niblock and\n\nResolved,—That Bro. J. M. Robinson do the printing for this Grand Lodge, including 500 copies of the minutes of this meeting, for distribution among the different Lodges in the jurisdiction of this Grand Lodge.\nMoved by Bro. F. D. Stewart, seconded by Bro. W. Wigmore and\n\nResolved,—That this R. W. Grand Lodge continue their card in the lodge directory of the Sentinel for 1891.\n\nMoved by Bro. W. R. Cahoon, seconded by Bro. J. M. Robinson, and\n\nResolved,—That this G. Lodge place the sum of Seventy-five Dollars ($75.00), to the credit of R. W. G. Master Mulvey to defray his expenses as a delegate to represent this Grand Lodge in the M. W. G. Lodge in the M. W. G. Lodge of B. A.\n\nIn accordance with notice given it was moved by Bro James Morrow, seconded by Bro. John Pollock, and\n\nResolved,—That this Grand Lodge humbly request the Supreme Grand Master to postpone the meeting of the Supreme G. Lodge, until the last Wednesday in June, with a view of allowing delegates from this Grand Lodge to attend the meeting of the Triennial Council without making an additional trip east.\n\nNEXT PLACE OF MEETING.\n\nThe following places were proposed, viz., Winnipeg, Manitou, Emerson, Brandon, and Minnedosa.\n\nOn the vote being taken Brandon was chosen.\n\nMoved by Bro. W. J. Marshall, seconded by Bro. Jas. Morrow and\n\nResolved,—That the next meeting of this G. Lodge be held on the First Wednesday in March, 1892, at 14 o'clock.\n\nMoved by Bro. M. Keenan, seconded by Bro. Robert Scott, and\n\nResolved,—That the thanks of this R. W. Grand Lodge be tendered the various railroads who have granted reduced rates to delegates.\n\nMoved by Bro. W. Conolly, seconded by Bro. W. J. Marshall, and\n\nResolved,—That this R. W. Grand Lodge be raised to the R. S. Degree.\n\nThe brethren were then tested in the R. S. by Bros. W. Con-\nolly and W. J. Marshall, and the R. W. Grand Master declared\nthe Grand Lodge raised to the Royal Scarlet Degree:\n\nMoved by Comp. F. D. Stewart, seconded by Comp. J. L.\nRobinson, and\n\nResolved,—That the minutes be considered as read.\n\nThe Royal Scarlet Lecture was repeated by Comps. W.\nMarshall and W. McCullough.\n\nThe R. W. Grand Chaplain, Comp. Rev. F. M. Finn, repeated\nthe closing prayers.\n\nThe R. W. Grand Master, Companion Stewart Mulvey,\ndeclared the nineteenth annual session of the R. W. Grand Oran\nLodge of Manitoba and N. W. T., closed in due form\n\nSTEWART MULVEY W. J. KERNAGHAN,\nGrand Master, Grand Secretary,\nWinnipeg. Box 335, Winnipe\n\n\"GOD SAVE THE QUEEN.\"\n## Appendix A.\n\n**Directory of County, and District Masters, and Masters of Primary Lodges.**\n\n### Worshipful County Masters, 1891.\n\n| Name                  | P. O. Address       | County          | Province         |\n|-----------------------|---------------------|-----------------|------------------|\n| Jas. Tombs            | Stonewall           | Selkirk         | Manitoba         |\n| A. Patterson          | Thornhill           | Dufferin        | do               |\n| John Pollock          | Silver Springs      | Rock Lake       | do               |\n| Wm. Muirhead          | Douglas             | Brandon         | do               |\n| Robert Scott          | Dominion City       | Franklin        | do               |\n| Geo. Black            | Minnedosa           | Turtle Mountain | do               |\n| Jos. Andrew           | No Returns          | Minnedosa       | do               |\n| Thos. Fleming         | Summerberry         | Portage la Prairie | do              |\n| Frank C. Morrison     | Indian Ford         | Miniota         | do               |\n| W. M. Ingersol        | Shoal Lake          | Assiniboia      | North-West Territories |\n|                       |                     | Norfolk         | Manitoba         |\n|                       |                     | Shal Lake       | do               |\n\n### Worshipful District Masters, 1891.\n\n| Name                  | P. O. Address       | District        | County          |\n|-----------------------|---------------------|-----------------|-----------------|\n| M. Keenan             | Winnipeg            | Winnipeg        | Selkirk         |\n| W. R. Caboon          | High Bluff          | High Bluff      | Portage la Prairie |\n| John Bowes            | Bossevain           | Turtle Mountain | Turtle Mountain |\n| Thos. Fleming         | Summerberry         | Summerberry     | Wolsely         |\n| No. | County       | Name of W. M. | P. O. Address | Time of Meeting | Place of Meeting |\n|-----|-------------|---------------|---------------|-----------------|-----------------|\n| 243 | Selkirk     | M. Keenan     | Winnipeg      | 3rd Tuesday     | Winnipeg        |\n| 891 | Brandon     | John Deyel    | Souris        | do              | Liby School House |\n| 962 | Rock Lake   | V. Sexsmith   | Ash Creek     | do              | Ba dur          |\n| 1307| Selkirk     | H. W. A. Chambre | Winnipeg     | 1st Thursday    | Portage la Prairie |\n| 1351| Portage la Prairie | W. Kitson | Burnside     | Monday on or before full moon | Foxton |\n| 1352| Selkirk     | Alex. c.Malton | Foxtown       | 1st Monday      | Thornhill       |\n| 1353| Dufferin    | John G. Elliott | Calf Mountain | Friday do       | High Bluff      |\n| 1354| Portage la Prairie | W. R. Calhoun | Holland       | 1st Thursday    | Holland         |\n| 1355| Portage la Prairie | John Leslie | Holland       | do              | Woodlands       |\n| 1443| Portage la Prairie | D. Lipsett | Meadow Lea    | Friday on or before full moon | Emerson |\n| 1450| Franklin    | Geo. Johnston | Morden        | 1st Wednesday   | Morden          |\n| 1457| Dufferin    | W. G. McKay   | Morden        | 1st and 3rd Wednesdays | Stonewall |\n| 1464| Selkirk     | J. B. Butterford | Glenboro     | Friday on or before full moon | Gleulboro |\n| 1465| Norfolk     | William McKenzie | Morris      | do              | Morris          |\n| 1436| Franklin    | Robt. Turner  | Salterville   | Thursday do     | Carman          |\n| 1490| Dufferin    | Thomas Salter | Salterville   | 1st Monday      |                 |\n| 1493| Dormant     | Jas. F. Graham | Neepawa      | Friday on or before full moon | Neepawa |\n| 1494| Minnedosa   | Geo. Storey   | Manitou       | do              | Manitou         |\n| 1497| Dufferin    | Robt. Scott   | Dominion City | Monday do       | Dominion City   |\n| 1499| Franklin    | John Pollock  | Silver Springs| do              | Lariviere       |\n| 1500| Rock Lake   | Jas. Hoey     | Elton         | do              | Elton           |\n| 1501| Brandon     | John Sims     | Snowflake     | Wednesday do    | Snowflake       |\n| 1502| Rock Lake   | (has. Leachman) | Wawanessa   | Thursday do     | Wawanessa       |\n| 1503| Brandon     | Thos. Morehead | Carberry     | Saturday do     | Fairview        |\n| 1504| Brandon     | Geo. Black    | Vimmedosa     | Tuesday do      | Vimmedosa       |\n| 1505| Minnedosa   | Dormant       |               | 1st Friday      |                 |\n| No. | County | Name of W. M. | P. O. Address | Time of Meeting | Place of Meeting |\n|-----|--------|----------------|---------------|----------------|-----------------|\n| 1507 | Portage la Prairie | J. B. Young | Beaver Creek | Wednesday nearest full moon | McGregor |\n| 1508 | Rock Lake | Robert Rogers | Clewartler | Friday on or before do | Clewartler |\n| 1510 | Brandon | William Orr | Willowood | Monday do do do | Willowood |\n| 1511 | Brandon | J. L. Barry | Brandon | 1st Monday | Pleasant Point |\n| 1512 | Brandon | Jos. Quinn | Brandon | do | Brandon |\n| 1513 | Minotera | J. S. Kirk | Vm. Harrison | Saturday on or before full moon | Campbellville |\n| 1514 | Dormant | E. H. Dagg | Vm. Harrison | 1st Tuesday | Ohnahan |\n| 1516 | Dormant | W. J. Carfoot | Virden | Monday on or before full moon | Virden |\n| 1519 | Minotera | Geo. McLeod | Wimpeg | 1st Tuesday | Wimpeg |\n| 1520 | Sekirka | F. H. Dagg | Killarney | Wednesday on or before full moon | Rapid City |\n| 1521 | Minotera | S. E. Kent | Ralphston | Tuesday do do do | Breerwood |\n| 1522 | Minotera | Samuel Fleming | Riven | Monday do do do | Breerwood |\n| 1523 | Minotera | D. R. Gardiner | Summernberry | Wednesday on or before full moon | Breerwood |\n| 1524 | Minotera | D. R. Gardiner | Summernberry | Tuesday do do do | Breerwood |\n| 1525 | Minotera | S. E. Kent | Ralphston | Monday do do do | Breerwood |\n| 1526 | Minotera | D. R. Gardiner | Riven | Monday do do do | Breerwood |\n| 1527 | Isolated | A. G. Hamilton | Armstrong's Lake | Friday on or before full moon | Armstrong's Lake |\n| 1528 | Isolated | Jas. Sharp | Armstrong's Lake | Monday do do do | Armstrong's Lake |\n| 1529 | Assiniboina | Thos. Fry | Moose Jaw | Monday do do do | Moose Jaw |\n| 1530 | Assiniboina | Jas. Bryans | Mordean | Thursday or before full moon | Harrington House |\n| 1531 | Turtle Mountain | Thos. Fry | Homfeld | do do do | Homfeld |\n| 1532 | Isolated | T. N. Irvine | Not Given | Not Given | Not Given |\n| 1533 | Shoal Lake | Chas. Mason | Newdale | Thursday or before full moon | Harrington House |\n| 1534 | Turtle Mountain | Thos. Fry | Homfeld | Monday do do do | Harrington House |\n| 1535 | Assiniboina | R. L. Alexander | Moose Jaw | Monday do do do | Davidsburg |\n| 1536 | Isolated | Geo. Allingham | Davidsburg | do do do | Davidsburg |\n| 1537 | Turtle Mountain | Thos. Fry | Homfeld | do do do | Harrington House |\n| 1538 | Assiniboina | Jas. Bryans | Mordean | Thursday or before full moon | Harrington House |\n| 1539 | Turtle Mountain | Thos. Fry | Homfeld | do do do | Harrington House |\n| 1540 | Assiniboina | Thos. Fry | Homfeld | Monday do do do | Harrington House |\n| 1541 | Turtle Mountain | Thos. Fry | Homfeld | do do do | Harrington House |\n| 1542 | Assiniboina | R. L. Alexander | Moose Jaw | Monday do do do | Harrington House |\n| 1543 | Turtle Mountain | Thos. Fry | Homfeld | do do do | Harrington House |\n| 1544 | Isolated | Geo. Allingham | Davidsburg | do do do | Davidsburg |\n| No. | County       | Name of W. M          | P O. Address | Time of Meeting | Place of Meeting |\n|-----|--------------|-----------------------|--------------|-----------------|------------------|\n| 1545 | Turtle Mountain | John Bowes            | Boissevain   | Friday on or before full moon | Boissevain       |\n| 1546 | Assiniboia   | B. Barber             | Wolsely      | Tuesday on or before full moon | Shoal Lake       |\n| 1548 | Shoal Lake   | W. Gardner            | Oakburn      | Friday on or before full moon | Medicine Hat    |\n| 1549 | Isolated     | Jas. A. Armstrong     | Medicine Hat | 1st and 3rd Friday | Aikenside       |\n| 1558 | Brandon      | Wm. Curle             | Aikenside    | Thursday on or before full moon | Ellisboro       |\n| 1559 | Assiniboia   | Samuel Thompson       | Ellsboro     | Monday on or before full moon | Carnduff        |\n| 1561 | Assiniboia   | John Wilson           | Workman      | Monday on or before full moon | Calgary         |\n| 1563 | Isolated     | Samuel McComb         | Calgary      | 1st Thursday    | Rossburn        |\n| 1566 | Shoal Lake   | Wm. Peden             | Rossburn     | Wednesday on or before full moon | Viola Dale     |\n| 1567 | Winniota     | Alfred E. Brown       | Viola Dale   | Tuesday on or before full moon | Treherne       |\n| 1568 | Norfolk      | Frank C. Morrison     | Indian Ford  | Wednesday on or before full moon | Arrow River    |\n| 1569 | Minniota     | R. S. Wheeler         | Arrow River  | Monday on or before full moon | Fairmede       |\n| 1571 | Assiniboia   | John Clements         | Fairmede     | Thursday on or before full moon |                |\n| 1573 | Rock Lake    | No Returns            |              |                 |                 |\n| 1574 | Assiniboia   | D. S. Carnahan        | Fleming      | First Saturday  | Fleming         |\n| 1581 | Assiniboia   | Jos. Calin            | Whitewood    | Wednesday on or before full moon | Whitewood      |\n| 1582 | Isolated     | J. J. Mathews         | Battleford   | 1st Friday      | Battleford      |\n| 1583 | Minniota     | W. J. Taggart         | Elkhorn      | Thursday on or before full moon | Elkhorn        |\n| 1585 | Rock Lake    | A. N. Roe             | Crystal City | Monday on or before full moon | Crystal City   |\n| 1588 | Assiniboia   | W. L. Hames           | Alameda      | Friday on or before full moon | Alameda        |\n| 1590 | Minnedosa    | Jas. Wilmoughly       | Glendale     | Wednesday on or before full moon | Glenburney     |\n| 1595 | Assiniboia   | T. E. McWilliams      | Moose Jaw    | Not Given       | Pasqua          |\n| 1598 | Minnedosa    | No Returns            | Caron        | Wednesday on or before full moon | Caron          |\n| 1599 | Assiniboia   | W. E. Fisher          | Pense        | Not Given       | Pense           |\n| 1600 | Assiniboia   | Wm. Clarke            | Shake Creek  | Thursday on or before full moon | Lansburn       |\n| 1601 | Shoal Lake   | John H. Switzer       | Morris       | 2nd Tuesday     | Morris          |\n| 1602 | Franklin     | David Philips         |              |                 |                 |\nAPPENDIX B.\n\nThe Honored Death Roll.\n\nSELKIRK COUNTY.\n1352 Bro. Wm. C. Leedell. No date given\n1464 Bro. Wm. E. Montgomery No date given\n1464 Bro. Isaac Walton. No date given\n\nASSINIBOIA COUNTY.\n1525 Bro. John Wesley Fleming. Drowned July 20 '90\n\nTURTLE MOUNTAIN COUNTY.\n1541 Bro. Geo. Reynolds. No date given\n\nSHOAL LAKE COUNTY.\n1566 Bro. James McLeod. Died February 1st, 1891\n\nMINIOTA COUNTY.\n1569 Bro. Joseph Wallace Died February 15th, 1890\n\nISOLATED.\n1549 Geo. William Earl Died January 16th, 1890\nAPPENDIX C.\n\nCOUNTY LODGES AND OFFICERS.\n\nSELKIRK.\nJas. Tombs, County Master, Stonewall, Man.\nJ. W. Carroll, County Secretary, Winnipeg, Man.\nJ. B. Rutherford, County Treasurer, Stonewall, Man.\n\nDUFFERIN.\nA. Patterson, County Master, Thornhill, Man.\nWilliam Shields, County Secretary Manitou, Man.\nJ. R. Jones, County Treasurer, Warrington, Man.\n\nROCK LAKE.\nJohn Pollock, County Master, Silver Springs, Man.\nR. Armstrong, County Master, Silver Springs, Man.\nJohn Patterson, County Treasurer, Snowflake, Man.\n\nBRANDON.\nWilliam Muirhead, Co. M., Douglas, Man.\nR. B. Hetherington, Co. Sec. pro tem., Douglas, Man.\nJohn Kyle, County Treasurer, Douglas, Man.\n\nFRANKLIN.\nRobert Scott, County Master, Dominion City, Man.\nRobert Turner, County Secretary Morris, Man.\nA. C. Scott, County Treasurer, Morris, Man.\n\nTURTLE MOUNTAIN.\nNo Returns.\n\nPORTAGE LA PRAIRIE.\nNo Returns.\nMINNEDOSA.\n\nGeo. Black, County Master, Minnedosa, Man.\nS. C. Ranson, County Secretary, Minnedosa, Man.\nThos. Taylor, County Treasurer, Minnedosa, Man.\n\nMINIOTA.\n\nJos. Andrew, County Master, Chumah, Man.\nWesley Hazlewood, County Secretary, Chumah, Man.\nFrancis Middleton, County Treasurer, Viola Dale, Man.\n\nASSINIBOIA.\n\nThos. Fleming, County Master, Summerberry, N. W. T.\nR. J. Noble, County Secretary, Moosomin, N. W. T.\nJ. Mitchell, County Treasurer, Grenfell, N. W. T.\n\nNORFOLK.\n\nFrank C. Morrison, County Master, Indian Ford, Man.\nI. L. Mawhinney, Co. Secretary, Holland, Man.\nW. B. Thomas, County Treasurer, Cypress River, Man.\n\nSHOAL LAKE\n\nW. M. Ingersoll, County Master, Shoal Lake, Man.\nA. Crookshank, County Secretary, Rossburn, Man.\nRobert Gardiner, County Treasurer, Oakburn, Man.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/N018059.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 54, "total-input-tokens": 75472, "total-output-tokens": 24943, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 307, 1], [307, 1231, 2], [1231, 1563, 3], [1563, 1563, 4], [1563, 2676, 5], [2676, 2676, 6], [2676, 4438, 7], [4438, 6535, 8], [6535, 7710, 9], [7710, 8937, 10], [8937, 10261, 11], [10261, 12976, 12], [12976, 15581, 13], [15581, 18280, 14], [18280, 19546, 15], [19546, 21583, 16], [21583, 24507, 17], [24507, 26323, 18], [26323, 28491, 19], [28491, 30666, 20], [30666, 33109, 21], [33109, 35978, 22], [35978, 39832, 23], [39832, 41657, 24], [41657, 44082, 25], [44082, 45886, 26], [45886, 49086, 27], [49086, 50142, 28], [50142, 52121, 29], [52121, 53655, 30], [53655, 55720, 31], [55720, 57696, 32], [57696, 59506, 33], [59506, 61044, 34], [61044, 63418, 35], [63418, 64577, 36], [64577, 66123, 37], [66123, 67573, 38], [67573, 69185, 39], [69185, 70566, 40], [70566, 72109, 41], [72109, 74146, 42], [74146, 75748, 43], [75748, 76421, 44], [76421, 78300, 45], [78300, 80879, 46], [80879, 83848, 47], [83848, 86992, 48], [86992, 87494, 49], [87494, 88360, 50], [88360, 89152, 51], [89152, 89152, 52], [89152, 89152, 53], [89152, 89152, 54]], "primary_language": ["en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, true, false, false, false, false, false, false, true, false, false, false, false, false, false, true, true, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]