[{"id": "5d32e3467ae7174a632ce40470af45ea46a856a7", "text": "REMINISCENCES\nOF THE\nRed River Rebellion\nOF\n1869\nREMINISCENCES\n\nOF THE\n\nRED RIVER REBELLION\n\nOF 1869.\nReminiscences of the Red River Rebellion\n\nOF 1869.\n\nINTRODUCTION.\n\nThe scene of the Red River rebellion has always occupied a prominent position in the history of the North-west. Fort Garry has always been the great Fur-trading Depot of the interior, and very frequently the residence of the Hudson Bay Company's Governor. From it were issued those mandates which made the adjacent agricultural settlement a mere appanage of the Fort, and the settlers mere serfs of the officer in charge. In its courts were tried any persons who dared practically to test the power of monopoly of trade assumed by the Company, and to its jail were sent those who were convicted of daring to trade a muskrat or beaver skin from an Indian. The Chief Officer of this Fort had it in his power to make or mar the fortune of almost any one in the settlement; he named the rate at which all Agricultural Products should be sold, and the quantity that should be taken from the Producer; and he it was who arranged marriages between the well-favored, healthy daughters of the settlers and worn-out officers from the interior, who, tired of their Indian harems, sought repose and respectability by marriage, and a residence on the banks of Red River.\n\nThe officer in charge was in reality a king of the little community, and a similar and even more arbitrary state of affairs existed at the inland Posts; and many like Sir George Simpson, lost to all sense of decency, and setting aside the sacredness of the marriage tie, used their authority to make the wives of their subordinates minister to their pleasures.\n\nWith the exercise of arbitrary power there was with these officers of the Hudson Bay Company a profound conviction that the Company they represented, and they alone, had the right of trading with the Indians; where they had force they used it to carry this belief into execution, and houses were frequently searched and people imprisoned for trading in furs!\n\nOf course while the Inland Officers, educated in that belief, thought the monopoly almost a divine right, yet the heads of the organization knew that it could only exist so long as they could keep the country comparatively inaccessible to adventurous traders from the United States and Canada. To this end, after the coalition of the North-west Company with the Hudson Bay Company, the route (now the Dawson Route) over which the North-west people\nhad brought their goods, became disused, and reports were put into circulation that it was impracticable, and that even when the rocks, rapids and portages were passed to the Lake of the Woods, that an impassible bog and morass prevented the possibility of a road thence to Red River.\n\nThe luxuriant richness of the soil was denied; early frosts and eight months winter were assumed to exist, and the climax of these deliberate misstatements was reached, when, before a Commission of the House of Commons in England, a number of years ago, Sir George Simpson, obsequiously seconded by a number of people in the Hudson Bay interest, swore that astonishing mass of falsehood in regard to the country which is embalmed in the English Blue Book that records the proceedings.\n\nThese were the palmy days of the Hudson Bay Company, their sway was undisputed on half a continent, their profits were immense, their officers were potentates; but evil days were at hand. Canada sent Hind and Dawson, to spy out the land, and from that moment their monopoly was doomed, and their deadly hostility to Canada and Canadians began.\n\nThe ill-advised punishment of a French half-breed named Sayers, for trading a few furs, caused that numerous and excitable portion of the community to rise in arms for his rescue, and since that time the monopoly was never attempted to be secured by force.\n\nSince the death of Sir George Simpson, and the advent of free trade in furs, the profits of the Hudson Bay Company had gradually declined, and this fact was no doubt the chief reason why the stockholders finally consented to dispose of their rights to the Dominion of Canada. In making the hard bargain which they did, they could see a large sum (the purchase money) to be at once divided, and they hoped that the large quantity of land secured to them under the transfer agreement would be productive of yet greater dividends in the future.\n\nWhile they felt satisfied with the conditions on which they had given up what was now almost a worthless monopoly, the officers of the fur trade in the country, who receive in lieu of salary a share in the profits, were not so well pleased, for they did not know how far the stockholders in England intended them to share in the purchase sum and in the land. It soon began to be rumored that as they were only partners in the fur trade interest of the Company, they could not and need not expect any share of\nthe money or lands. This alarmed them, and strong remonstrances were sent home. For a while the matter was in abeyance, and finally the fiat went forth:—“The Chief Factors, Chief Traders, and Officers of the Hudson Bay Company, were to have no share in either money or Lands!” and from that moment commenced the History of the Red River Rebellion.\n\nThe first news of the transfer of the country to Canada was hailed with universal joy by all classes of the population of Red River. French, as well as English, looked upon it as the consummation of the hopes and wishes of years. Petition after petition had been sent, praying for escape from Hudson Bay servitude and for annexation to Canada, and on these petitions may still be found the names of John Bruce, that of the Father of Louis Riel and of many others among the French people, and there is no doubt but that for the unfortunate state of feeling existing among the Hudson Bay Company’s officers, the advent of Governor McDougall would have been hailed with the greatest demonstrations of joy.\n\nAt this juncture (spring of 1869) Chief Factor and Acting Governor Mactavish returned from his mission to England, which had for its object the securing to the officers in the country a share of the purchase money; he had failed in this, and came back by way of Ottawa. There he had interviews with the ministers, and told them that the Company were in a position to surrender the country peaceably, as was stipulated in their agreement. On being directly questioned as to the necessity of sending a detachment of the Royal Canadian Rifles, then available, he stated that there was not the slightest necessity, and repeated his assurance that the country would be transferred in peace. That this assurance was to cause serious trouble to Canada and afford great aid to the promoters of the rebellion, we will soon see; and taken in connection with the disappointment felt by Sir Mactavish and the company generally, at his not having received the offer from the Canadian Governor of Lt.-Governor of the Province, will go far in support of the prevailing belief in Manitoba, that Riel and his followers were simply the Agents of the Hudson Bay Company.\n\nOf course this belief involves a very serious charge against the resident Hudson Bay officers, whose duty it was to see the country peaceably transferred, and especially against Governor Mactavish, the Chief of these officers, who in discouraging the wish of the Canadian Government to send up troops, had incurred additional responsibility. It will be well then in the consideration of this\ncharge against the Hudson Bay Company, to see in how far they were able to transfer the country to Canada, assuming they were willing to do so. Undeniable evidence informs us that the executive power of the Hudson Bay Company at the time was not by any means small; they had a Sheriff, at the head of a regular constabulary force of between thirty and forty men; they had a special police force of three hundred men, sworn to act on special occasions; and they had a number of resident Chelsea out pensioners, also available for the support of the laws! They had Fort Garry, a stone walled and bastioned fort, with an arsenal containing thirteen field pieces and a stand of nearly three hundred Military rifles, with abundant ammunition for all, and they had the ordinary officers, clerks, and servants at the Fort, numbering nearly thirty persons.\n\nWe see then the executive force of the Hudson Bay Company thus represented, and it is now for us to consider what force was at the command of Riel, Lepine, Donohue, Bruce & Co., to enable them to set the Hudson Bay Company at defiance and prevent the transfer of the country to Canada.\n\nRiel commenced with a force of ten men, armed with shotguns, to stop the surveyors, and the famous barricade at Stinking River was guarded for three weeks by only thirty-five of the same class of warriors, and the force had only increased to fifty men when the peaceable occupation of Fort Garry was accomplished by him.\n\nThese seem to be the naked facts, and the Hudson Bay officials have failed to explain why, at any stage of the insurrection they failed to employ their regular Constabulary force, their special Police force, or even when informed twenty-four hours before the event that their Fort was to be occupied, they did not at least arm their own men, shut their own gates and bid that defiance which a score of men in the loopholed bastions might have easily done to Riel and his fifty ill-armed, undisciplined followers.\n\nIt does not appear from the very best information that they did one single thing, that they made one single effort to put down the rising. On the contrary, knowing winks were exchanged between the officers; one of their chief clerks, now the chief officer at Fort Garry, visited the barricade and chatted pleasantly with the insurgents; the Hudson Bay Post Master, formerly one of their clerks, and then, we believe, a Member of the Council of Assiniboia, aided the insurgents with supplies; the Hudson Bay following\nthroughout the country defended Riel's action, and every effort was made to keep down the rising wrath of the loyally disposed English and French settlers. Repeated offers of service seem to have been made by large numbers of persons, all of which were refused, and a direct proposition from two hundred English persons, who desired to be permitted to escort Governor McDougall in, shared the same fate.\n\nSo plain did it become, up to the time of the occupation of Fort Garry by Riel, that the Company did not desire to interfere with Riel's movement at Stinking River, and so certain were many that the Fort would be given to Riel without opposition, that a number of people proposed to occupy the Fort for its defense; this proposition so enraged Governor Mactavish, that he is said to have threatened to shoot the first man who attempted it!\n\nIn this extraordinary way did the Hudson Bay Company transfer their authority to Riel, instead of the Government of Canada, by placing Riel in charge of the Fort, which, besides containing all the arms and munitions of war in the settlement, had unlimited supplies of Pemican and Rum, with which it was easy to attract followers to his standard.\n\nAt this time Governor McDougall, who knew the real strength of the insurgent force, and had the best of reasons for suspecting the complicity of the Hudson Bay Company, resolved to make an effort to get into the country, with the aid of the loyally disposed inhabitants, and the effort would have been perfectly successful, if Governor Mactavish had not offered to it his strongest opposition. Colonel Dennis, duly commissioned by Governor McDougall, came in armed with full powers to raise the loyal people and put down the insurrection. That Colonel Dennis could have succeeded in raising fifteen hundred men, there can be no manner of doubt, and that his failure, with the subsequent capture of the forty Canadians in Dr. Schultz's house, is due to the active steps which all the officers, retainers, and adherents of the Hudson Bay Company took to defeat Colonel Dennis' plans and to aid those of Riel, there can also be no question.\n\nThe Hudson Bay Company first refuse to use a force of forty Constables, three hundred Policemen, and a number of Pensioners to put down an insurrection of thirty-five men. They next, although warned of his approach, deliver up to Riel their Fort, arms, and ammunition, and then they enhance his power and defeat the objects of those who were in favor of law and order and opposed to insur-\nrection, robbery and violence, by defending his actions and censuring those of his enemies.\n\nThese facts have engendered a belief which is very deeply rooted in the Red River Settlement; That in consequence of the action of English Stockholders in refusing a share of the purchase money to the Hudson Bay officers in the country, that these officers, unwilling to incur the responsibility themselves, saw in Riel a serviceable tool and agent for the purpose; That the insurrection from its commencement to near its close, was ordered and directed by Hudson Bay officers, and that the object was either to force the country back into its original condition, or to make a participation in the purchase money, the price of their acquiescence in the conditions of the transfer.\n\nThe writer has formed his conclusions after a careful study of all evidence that was to be obtained, and from conversations with people of all classes and nationalities in Manitoba, and the reader may be assisted in forming his, from the evidence presented in the accompanying extracts from the journals of the day, and if, before books written by people interested in endeavoring to remove the rebellion stains from the Hudson Bay Co. pass into history, the writer shall have succeeded in creating even a spirit of inquiry into the strange events of 1869, he will feel that in some small measure he has done his duty.\n\nG. T. D.\n\nToronto, 1st January, 1873.\n\nP. S.—Enquiry into the matter sufficiently explains the hostility evinced by the Hudson Bay Company through Riel to prominent Canadians in the country. Dr. Bown, Dr. Schultz, and others, had committed the unpardonable offence of opposing the Hudson Bay fur trade in the interior; and Dr. Bown had the hardihood to publish a newspaper—the Nor' Wester—in which he always fearlessly advocated the desirability of Canada possessing the North West Territories. The fact that Dr. Bown continued to print his paper under the very guns of Fort Garry, and even to print proclamations when armed guards surrounded his office, caused him to be the first Canadian whose arrest was attempted by Riel; but the Doctor had gained experience in many scene of danger in Australia, and among the Indians of the Interior, and with an ingenious disguise passed through those sent to take him, and joined the party under Col. Dennis, at the Lower Fort, whence he made his way to\nthe River Winnepeg, and boldly entered the settlement the following spring before the troops.\n\nDr. Schultz seems to have been specially obnoxious to the Hudson Bay Company, because of the enterprise and success with which he pushed his trade into the fur preserves of the interior, and because of his known influence with all but those of the Hudson Bay class in the settlement. This accounts for the strenuous efforts made by Riel to retake him after his escape from prison, and the reward that was offered for him dead or alive. The fate poor Scott met was doubtless intended for him, and he was only saved from it by the trip from Lake Winnipeg to Lake Superior, which a St. Paul paper describes as being \"nineteen days of travel over six hundred miles of rock and crusted snow, on a route no white man had ever before passed, and whence he emerged at Duluth, gaunt with hunger, worn with fatigue, his clothes in tatters, and his eyes blinded with the glare of the glittering snow of March.\"\n\nFor ten years preceding the transfer, Canadians were looked upon by the Hudson Bay Company as intruders and interlopers, and systematic efforts were made to injure their business, their character and social standing.\n\nG. T. D.\nREMINISCENCES\n\nOF THE\n\nRED RIVER REBELLION.\n\nThe following letter from Mr. Mair appeared in the columns of the Toronto Globe and give the writer's views on the subject:\n\nINSURRECTION IN RED RIVER.\n\nBY CHARLES MAIR,\n\n(Late of Red River.)\n\n\"The confiscation of the author's property by order of Riel and his associates involved the loss and probable destruction of numerous important manuscripts and memoranda, having special bearing upon occurrences in Red River during the author's residence in the settlement. Many of these papers, including journals of transactions to a comparatively recent date, were committed to the author's safe keeping by others; and, though a hurried effort was made to secure them, amidst the confusion of the surrender at Dr. Schultz's in December last, yet their recovery is extremely doubtful. Included in this general theft and destruction of private property are the originals of the various petitions addressed by the English-speaking portion of the natives of Red River to the Imperial and Canadian Governments, with the signatures attached. The author has been reliably informed that these petitions are now in possession of the ci devant Christian Brother, Donohue, the twin-villian in Riel's oligarchy. He regrets this the more, inasmuch as these petitions were the property of his aged and respected friend, Donald Gunn, Esq., of Red River, who placed them, with special admonitions, in his hands, who contemplates the publication of a reliable history of the Settlement, and who, in consequence of this loss, may be hindered in the completion of his work. Other losses will probably be made good from various sources hereafter, and then...\"\na more ample and succinct account may be presented to the reader. But for the present, the very limited time at the author's disposal, compels him to be brief and to jot down partly from memory and partly from evidence some details of a movement which has had for its undisguised object the destruction of principles most dear to every true Canadian.\n\n\"The Red River Settlement proper dates its origin from the year 1812. It was founded by the Earl of Selkirk, who joined the Hudson Bay Company in 1811 and received from them a grant of land comprising the so-called District of Assiniboia. A great antagonism existed at this time between the North-West Company of Canada, founded in 1803, and the Hudson Bay Company; and the establishment of a farming community on the banks of Red River; it was hoped, would have the joint effect of supplying the latter Company with desirable articles of food, and of acting as a check upon the encroachments and hostility of the Metis, or French half-breeds, who formed by far the larger proportion of servants in the employ of the Canadian Company. Averse to agriculture and to the slow tough steady gains of regular industry, the Metis looked with exceeding suspicion and distrust upon this attempt to establish a settlement in the interior, and every effort was made by them through the instigations of their employers, whose interests were threatened by this movement of their opponents, to disturb and destroy it. As early as 1771 the French had established an extensive trade on the Saskatchewan, and by intermarriage with the native women and an entire devotion to the fur-trade, with its attendant adventure and excitement, had not only lost all taste for settled modes of life, but viewed them with hatred and contempt. Their offspring inherited in a marked degree the peculiarities and inclinations of their fathers, and being in a manner anotocthonous, differed from them only in a greater jealousy and resentment of intrusion, and a more expansive lawlessness of nature.\n\nAt the date of Lord Selkirk's arrival in Red River, these descendants of the original French traders were called, indifferently, Bois-brules, from their dark complexions, and Metis, a corruption of the Spanish word Mestice, and were sufficiently numerous to form a powerful element of danger to the infant settlement. The poor yet sturdy and intelligent Scotchmen, who, at Lord Selkirk's behest, had crossed the ocean and the wilderness with their families, were persecuted with savage virulence. Their wives and children were hunted from their homes, their houses burned, their crops destroyed, and many of their people slain. The brutal ferocity of the half-breeds did not end with the death of their victims, but, according to the evidence of Mr. Pritchard, extended itself to their lifeless bodies, some of which were inhumanly mutilated, with \"horrid imprecations.\" In June, 1815, they compelled the Hudson's Bay Company to enter into an agreement signed by the \"Four Chiefs of the Half Breeds;\" the first article of which stipulated that all settlers should retire immediately from Red River, and no appearance of a colony remain; and on the 19th June, in the following year, this provision was enforced by the murder of\nGovernor Semple and nineteen colonists, on the Frog Plains, a few miles below the junction of the Assiniboine and Red Rivers. These proceedings at length attracted the attention of the Imperial and Canadian Governments, and efforts were made to bring the murderers to justice, but without effect. Several persons charged with the murder of Semple and his companions, were tried at the Assizes held at York, in Upper Canada, in October, 1818, but for lack of evidence as to jurisdiction, &c., were acquitted; and it was only when the two rival companies merged their interests in 1821, and the managers of the Canadian company exerted their influence to curb and restrain the vindictive passions of the half-breeds, that the terrified colonists began to enjoy in peace the fruits of their industry. By a wise policy so far as the new company was concerned, but a disastrous one for Canada, the old North-West route, via Lake Superior, was abandoned, and supplies for the trade of the northern department, as the vast district drained into Hudson's Bay, was called, were brought annually by sailing vessels to York Factory. The settlement was thus hermetically sealed to the outer world, and its growth, denied the stimulus of immigration, was proportionately slow. The policy of the new company regarding settlement, was one of stern exclusion and repression, and so tight a hold was maintained upon the expansive energies and development of the people, that a population which numbered some 6,000 souls in 1848, has scarcely doubled in the lapse of twenty years. Throughout this long period, the distinctive character of race has remained unchanged. The instinct of the English speaking native, led him to the farm, the instinct of the French speaking native urged him to the chase. The reciprocal effect of character upon the savages with whom they intermingled, exhibits a difference in mental constitution, not owing to external circumstances or altered modes of life, but radical and innate. In general the Frenchman married the Indian and sank to the level of her tastes and inclinations. In general the Englishman married the Indian and raised her to the level of his own. Nor are these remarks made in a spirit of detraction or dispraise. An existence uncurbed by custom and untrammelled by the bonds of civilization is not incompatible with the noble and simple use of life; but it is just this divergence of character and impulse which plants the British colonist all over the earth, and which, with all his refinement, all his science, all his philosophy, confines the Frenchman to the Continent of Europe. Nowhere have these differences in character been more marked or more conveniently contrasted than in Red River. Over both sections of the people's close the corporation, whose interests in progress lay far beneath their interests in fur, lorded it with exclusive authority. The strenuous toil of a lifetime was received with cold and thankless indifference; meagre portions of the soil, which lay like an ocean around them, were grudgingly conveyed at exorbitant prices; the right of search extended to every house in the settlement, and the possession of a muskrat was a penal offence. Even the purity of British law was invoked to\nits own pollution, the extension of settlement was violently opposed, and an iron finger rested upon the head of every member of the community. Subject to some of these galling influences, the French half-breeds, though in their case the grievances were more theoretical than practical, grew wildly turbulent and disorderly, and the presence of troops became necessary to repress them. The English, on the other hand, with instinctive addiction to constitutional methods, petitioned England and Canada for relief, and by calmness, yet firmness, did most to reduce a Government by force to a series of expedients.\n\nFrom the fact that the French half-breeds of Red River are, with few exceptions, the only people actively engaged in the insurrection, one is apt to overlook the gratifying fact that a considerable proportion of that people have, from the first, withheld its countenance and encouragement. As might be expected, these men are the property holders of the Settlement, men of intelligence, who think for themselves, and who from the first have cherished a single desire for peace. Many of these loyal and respectable men offered their services in the cause of order, and others abandoned their homes for the rude life of the Plains, rather than be seduced or forced into a course which they well knew would only end in disaster. As a consequence, their names have been covered with reproach by their countrymen, and in some instances their property has been confiscated in common with that of other loyalists in the Colony. It is no special honour to a man that he should stand up and espouse the cause of British law on British soil; but it is a special honour to these enlightened and gallant men, that despite of every inducement to do otherwise, and regardless of spiritual injunction they maintained their integrity, and were ready at all times to welcome the Governor from Canada with open arms.\n\nWhen the Hudson's Bay Company in Red River discovered that they could no longer carry out their object by force, they very discreetly resorted to expedients.\n\nWhen any one had independence enough to speak out and advocate progress and material improvements he was either consoled for the absence of both by a seat in the Council of Assiniboia, or by a sum of money in proportion to the sum of his influence.\n\nThe happy discovery that in the long run it costs less to buy men than to crush them, has tided the wintering partners over many a difficulty in Red River. It has enabled them, moreover, to build up a clique of adherents whose opinions are their opinions. A clique which believes in mosquitoes, grasshoppers, frosts and Crown Colonies; which envelopes the stranger, especially the English stranger in Red River, keeps him carefully from the people, and send him away with an idea that the country is a swamp, with only a mere riband of dry land along the River. There are possibly twenty-five or thirty such men amongst the English natives of the Settlement who believe that the only cure for immigration is a Crown Colony, for under such a system things would remain probably just as they are at present, and instead of pouring into the country as they are so absurdly doing into\nthe North-Western States, immigrants would not come in at all, or, at all events, would drop in one by one, and be amenable to reason. This clique is headed by Mr. A. G. B. Bannatyne, a fur trader in Winnipeg, and a brother-in-law of Governor McTavish. He is a native of Scotland, and came to the North-West in the service of the Company. Some years after his arrival he left their service, and taking an outfit to Norway House, began to trade with the Indians on his own account. This of course brought down upon him the wrath of the Company, who sent him up to Fort Garry in irons, but so involved themselves in the process of punishment as to give him a legal hold upon them, which he did not fail to make use of. He declaimed fiercely against their tyranny and oppression, signed petitions to the English Administration praying for relief and a change of government, and upon the whole behaved so badly in the sight of the wintering partners, that they found it to their interest to buy him up. He was accordingly nominated to a seat in the Council, and received a handsome sum to cement his broken interests. Since then Mr. Bannatyne has been their most useful tool and instrument, and a consistent advocate of their authority. His character for treachery, however, somewhat mars his usefulness, and the half-breeds who have been used and then deserted by him upon former occasions, now watch him keenly. They declare that since he warmly encouraged them to rebel, they take care he does not play them false at last. As an evidence of this determination when, in February last, when he discovered that a little loyalty was likely to be of use to them, they gaoled him until he recanted. Many in the Settlement, on the other hand, believed this imprisonment to be a mere matter of arrangement between him and Riel. The delegates were appointed, things were likely to go well in Canada, and it was desirable that Mr. Bannatyne should be looked upon in Canada as a martyr to her interests. His partner, Mr. Alexander Beggs, is a Canadian who came to Red River a few years ago, and, after hanging about the Settlement for a time, contrived to establish himself in Winnipeg as the agent of several Hamilton firms. He became an ardent admirer of Mr. Bannatyne, and a devoted adherent of the Company. He vehemently ran down his own country, actively advocated annexation to the United States in preference to union with Canada, and in consequence attracted Mr. Bannatyne's favorable consideration. The commission business was anything but self-sustaining, and having crept into Bannatyne's esteem by the methods specified, he ultimately became his partner. One of the first business transactions of this precious firm was the furnishing of Riel and his associates with supplies; having these and other doubtful interests to carry through. The Canadians were all in gaol, Riel held possession of Fort Garry, and ruled over the Settlement with a rod of iron, the mail bags were carefully searched and all loyal and truthful communications extracted, and consequently Mr. Begg had it pretty much his own way. The associates of these gentlemen were the Yankees in Winnipeg, and many weighty anti-Canadian affairs of State were nigh settled over a\ngame of draw poker with that delectable crew. The only thorn in their sides, whilst meetings and elections were the order of the day, was the fact that, according to their own principle of manhood suffrage, the Canadians in Winnipeg largely outvoted them, and it was consequently an irrepressible relief to Sheriff McKenney and to Mr. Bannatyne when the entire body was removed and quietly placed under lock and key at Fort Garry. So careful were they to keep them there, that upon one occasion on the eve of the election, when Riel ran short of guards, and it was imperatively necessary that Annexationists should be returned, the Yankees, with superlative insolence, offered to guard the Canadian prisoners. The visionary and nonsensical ideas which Canadians entertained about the Dominion and the duties of the loyal men were thus kept carefully in the background. McKenney, Bannatyne, Begg, the Yankee, the Company and the Priests had a fair field; whilst the loyal English natives, comprising two-thirds of the population, without arms and without ammunition, cursed, their own helplessness, and shrunk from the guns of Fort Garry.\n\nTo understand properly the encouragement and countenance which the Hudson's Bay Company gave to the insurgents at an early stage of their proceedings, it is perhaps necessary to explain here the position of the Company here in Red River and their relation to the Company in England. When the two Companies—viz., the North-west Company of Canada, which had its headquarters in Montreal, and the Hudson's Bay Company, which had its headquarters in London—were united in 1821, it was agreed that the Stockholders of each Company should have equal shares. On the other hand, the wintering partners—viz., the Chief Factors and Chief Traders, who conducted the business of the Company in the interior, contributed no capital, and were not stockholders; and to renumerate them for their services, it was provided that forty of the one hundred shares into which the profits arising from their trade were divided, should be distributed amongst them in the proportion of one share to each chief factor, and a half share to each chief trader. Up to 1857 the business of the Company returned an average of 12 per cent. per annum, which gave the factor as his share of the allotment about £600, and to the trader about £300. The reader will now understand that the wintering partners have no vested interest in the Company, that they simply share a portion of the annual profit, and that that share depends upon their success in the interior. So long as they had the entire field to themselves, and while fur-bearing animals were abundant and cheap, their interests did not suffer. But when the free-traders at length overcame their opposition and competed with them in their best districts, the shoe began to pinch them. The stockholders in England, in the event of a total drying up of dividends, could realize their territorial and other interest at any time, and avoid a loss whereas, the factors and traders in such an event, had nothing to fall back upon and were simply destitute. This fact, moreover accounts for a long string of petty tyrants in Red River, and for the strenuous opposi\ntion of the wintering partners to the opening up of the Territory on any terms. The new adjustment of the Company's affairs in London in 1863, contemplated a variety of progressive and civilizing schemes, one of which involved the establishment of telegraphic communication from Canada to British Columbia. These measures, however, evoked such a storm of opposition in the interior that the stockholders were fain to fall back upon the traditional methods, and to content themselves with \"realizing\" from mink-skins instead of from immigrants.\n\nAt length came the news of the final arrangement for the transfer of the Territories to Canada, coupled with the information that the winterers were to receive no share either of the purchase money or of the territorial reserve. Othello's occupation was gone at last, and instantly the position of the Company in Red River became antagonistic to the change. The younger men in the service never disguised their indignation and disgust, and the currency of a report in the Settlement that a proposal to secrete £30,000 worth of furs to be sold for the benefit of the winterers was only lost by the casting vote, serves to show the feeling which existed and still exists in the minds of these people.\n\nThe first direct evidence of this estrangement and antagonism came under the writer's notice in July last. He had occasion, in company with another gentleman, to call upon Doctor Cowan, the chief trader in charge of Fort Garry, and after the discussion of some matters of business, the conversation turned upon the negotiations with the Company in England, which had then terminated. He complained bitterly of the fact that during the entire negotiations the Company in London had never once referred to the partners in Red River. Their opinions and interests, he alleged, had been entirely ignored, not only by their own superiors, but by the Canadian Government. And after placing these facts before us at some length, he concluded with these memorable words:—\"The Hudson Bay Company in Red River has never yet been political, but, perhaps, it will be compelled to be.\" This concluding period was a chink which let in a deal of light, and the writer deemed it his duty to communicate immediately with one of the members of the Administration, advising that a force, either of volunteers or troops, should be sent to Red River in advance of Government and pointing out the element, always inflammable and already excited, which would be made use of to our confusion and dishonour. It is a pity this advice was disregarded, for there can be no doubt that the presence of two hundred volunteers in the Settlement last fall would have effectually prevented the insurrection. Example might, indeed, have been taken from the action of the American Government in Minnesota, who found it necessary to send troops to subdue the unruly spirit of the French half-breeds before the establishment of a territorial legislature.\n\nThere was an additional reason, which was also made known at that time in Canada, why troops should have been sent last summer. The Fenians in the Settlement were by no means despicable in point of\nnumbers, and were eager and willing to create trouble. By raising up the Fenian flag on Dominion eve they created a feeling which might have ended in bloodshed but for their timely silence. The Stars and Stripes, moreover, were flung boldly out in broad daylight, and all visible signs foreshadowed a period of misrule.\n\nMATTERS IN THE NORTH WEST:\n\nTHE TRUE EXPLANATION OF RECENT MOVEMENTS.\n\n(St. John Paper, 1870.)\n\nThe presence of a number of Red River people in Canada, just now is tending to give the public a better understanding of the state of affairs in the North West. It is now pretty clearly understood that a very large proportion of former information has been received from prejudiced sources, and the fact should be borne in mind that even before the advent of the so-called \"Provisional Government\" care was taken to open every letter which passed through the hands of the notorious Bannatyne, then the Hudson Bay Company's and now the rebels' Postmaster, and that only communications such as suited Riel, Donohue & Co., were allowed to pass to the world outside. Very little was known here before as to the last rising of the loyal inhabitants of Red River, except that a force of eighty men, said to have been under Major Boulton, came down from Portage la Prairie, sixty miles west of Fort Garry, and near that fort joined a force of over six hundred men, said to have been under Dr. Schultz, and that a demand for the release of all the prisoners, threatening instant attack on refusal, was followed by an immediate disgorgement by Monsieur Riel. Why this force stopped at this point,—why they did not follow up their advantage at least to the capture of the Fort and the raising again of the British Flag, are matters that have remained without satisfactory explanation.\n\nFrom perfectly reliable sources we now give a short sketch of the position of affairs immediately before and after the last rising, prepared expressly for the Telegraph and Journal.\n\nColonel Dennis, sent into the territory by Gov. McDougall, to head a rising of the inhabitants to restore law and order, fixed his headquarters at the Stone Fort, twenty miles north of Fort Garry, and organized the loyal people into companies, but, from a want of discretion and military knowledge, allowed a force of forty-three men,\ncommanded by Captain Lynch, Lieut. Miller and Ensign Allen, to be surrounded in the buildings of Dr. Schultz, near Fort Garry, and left them, in their brave attempt to defend the $18,000 or $20,000 worth of Canadian Government provisions stored there, unassisted by any portion of the force under his orders, until, surrounded by 250 Rebels, cut off from water and food, and ordered by Col. Dennis to do so, they reluctantly surrendered, believing that they would be released by their captors on the next day. Crowded into rooms in Fort Garry, which in summer would have almost vied with the Black Hole at Calcutta, these unfortunate Canadians remained, with a few exceptions, till the general jail delivery effected by the Portage and lower force of which we have spoken. Dr. Schultz was among the prisoners thus taken; and too ill to leave, Mrs. Schultz was taken with him to Fort Garry, and at first treated well. Soon, however, Mrs. Schultz had to leave the Fort, and the doctor was put into solitary confinement. At the end of two months he made his escape by removing the fastening of the windows with a penknife and gimlet, which his wife had managed to send to him, reached the ground by means of a buffalo robe rope, jumped the Fort Garry wall, and made his way to the loyal portion of the settlement, where he remained a month, trying to evade or scare off the parties sent to recapture him. The famous Rebel Council then confiscated his property, to the amount of over Forty Thousand Dollars, declared him an exile, and ordered him to be shot whenever found.\n\nIn the meantime, confinement, bad food, and want of exercise had done their work among the prisoners. Scurvy appeared, and hope deferred turned many a dark hair gray. Relief, however, was at hand. At the Portage la Prairie Settlement a sworn organization, headed by one Mr. Gaddie, an English half-breed settler of note, determined to effect their release by a surprise and night attack on Fort Garry, and when they thought a favorable time had arrived they started for that purpose. Sixty-five miles had to be traversed in secret, but a severe snow storm brought their horses to a halt, when still twelve miles west of Fort Garry. The chances of a surprise were now over, and the only hope was in a general rising, which should force the miscreant Riel (secure with the thirteen cannon and stone walls of Fort Garry) to disgorge his prey. Word was sent to the district where Dr. Schultz was, and it found the people ready. Sympathies strongly excited in favor of the prisoners showed earnestness in the march, at thirty hours notice, of between six and seven hundred men, armed, it is true, with all sorts of arms, but earnest in their purpose. They conveyed with them a six-pounder field piece, mounted hastily on a sled, hoisted the Union Jack once more, and moved on. Arriving at night at the Kildonan Church, of which they took possession, they were joined by the Portage Party, with whom was Major Boulton, demanded at once the release of the prisoners, and soon were shaking hands with the poor fellows, some of whom had to be carried out.\n\nMr. Riel said, in the extremely incoherent reply to the demand for the release of the prisoners, \"That he wanted\npeace,\" and there were many there who desired peace too, but were only willing to accept that peace after the rebel rag had been torn from its place and our own glorious Ensign hoisted. However, the elder and cooler argued in this way:—\"If we attack Fort Garry and drive Riel out, he will go to another place, and we will only have saved for the Hudson Bay Company their property without being asked, and possibly without being thanked. When it becomes quite apparent to us that the Company do not want the Rebels in the Fort, and when they can show us that they did not connive at this rebellion from the first, then we will expose our lives for them, but till that is done no man of us will pull a trigger.\" Although many, like Dr. Schultz, wanted to go on, yet their silence in this discussion probably resulted from a reflection that as Mr. Commissioner Smith, representing the Canadian Government, had sent word not to attack, even to save the prisoners, such an attack would be censured by the Canadian Government, and Dr. Schultz and other prominent men be blamed for it; hence the determination which was then come to, that the force should return, disband, and then meet to garrison the Stone Fort at their own expense, insist on the local magistrates going on with their duties, and defying Riel and his followers to interfere with their liberty and prospects. Such was the determination when the treacherous seizure of Major Boulton and party occurred.\n\nWarned against returning past Fort Garry, and urged, if they did do so, to keep together, they were foolish enough to believe an assurance sent from Riel by a special messenger, and allowed their party of eighty to scatter till only forty-three remained; and these when near the Fort, on being invited to confer with Riel, entered the Fort and were at once surrounded and disarmed, and Major Boulton and poor Scott claimed and shut up in the rooms lately vacated by the other prisoners. Instant sentence of death was passed on Major Boulton—death at midnight! There was too short a time for a rescue, and Riel, first promising to reprieve him if Dr. Schultz was given up, then agreed to spare his life on condition that the lower parishes should not continue armed resistance, but send delegates to the Council. After a stormy discussion, the desire to save Boulton's life prevailed, more especially after Commissioner Smith had begged the people \"for God's sake to acquiesce.\"\n\nAn immediate effort was now made to capture Dr. Schultz, dead or alive. A party of one hundred were sent to the Stone Fort for that purpose; a party was also sent to the Portage la Prairie; but the Doctor—who had gained experience in dangerous trips through the Sioux country during the famous massacre—was not so easily caught, and when still supposed to be in the Settlement, we hear of his emerging from the wilds between Lake Winnipeg and Lake Superior, after a tramp on snow shoes of over 500 miles. The Doctor is now in Ottawa, anxious to learn the details of the contemplated expedition, and purposing to return in advance of the force to get away to Mrs. Schultz, who is still in the loyal portion of the settlement with a\nfriend. Dr. Lynch, one of the prisoners released at the time of the rising, is also in the Dominion capital, representing the feelings and wishes of the loyal portion of the settlers; and in the presence of two English half-breeds, Mr. Monkman and Mr. Setter, the public have a chance to learn the view which the loyal natives take of the affair.\n\nAll parties from Red River agree as to the necessity of sending at least 2,500 men to restore order, they assuming that a smaller number will not have that moral force which is necessary to impress the Indians and others on the advent of a new Government.\n\n---\n\nMR. G. D. McVICAR'S STATEMENT.\n\nThe following letter which appeared in the Chatham Banner in 1870 gives a very good, and it was thought by most who knew the events, described a very fair account of what then took place:\n\n\"DEAR SIR,—I am once more at liberty to think and speak without fear, and as I am no more troubled with visions of sturdy Half-breeds in arms, I will endeavour to fulfil my promise, and give you a complete description of the whole affair.\n\nOn going to Red River, I followed close in the wake of the Hon. Mr. Howe, being only a few days behind him, and I am sorry to say that that gentleman, far from making Gov. McDougall's way smooth, and preparing the minds of the people to receive him with open arms, left a very unfavorable impression. Mr. Howe's position in Canada was known in Red River, and a great deal was expected of him. He has done injury, not so much by what he said, as what he did not say. He was thought in Red River to have come to that country from the Canadian Government to explain to the people what policy the Government intended to adopt with regard to it. He disappointed everyone by not speaking in public—was interviewed and advised by Hudson Bay Company gentlemen and others, who afterwards became Riel's warm friends and supporters. He is even reported (and I believe the report to be true) to have told parties there, that Red River people were right in demanding their so-called rights, and said they would get all they asked, giving them as an instance, Nova Scotia—what he had demanded there and what he had gained.\n\nBefore entering on a description of that all-interesting subject, the rebellion, it might be well to give a description of the principal parties engaged in it.\n\nThe first is the cut-throat Riel. He is a man of medium height, rather good-looking at first look; now very much bloated and disfigured by excessive drinking. He is rather a clever fellow, but unprincipled, and without honour. He was, by the kindness of Bishop Taché,\neducated in Montreal, as a priest of the R. C. Church, but was so depraved and dissipated that he was not allowed to take orders. From there he went to St. Paul, where he took a situation with a Frenchman in a store, as clerk, and was dismissed for some irregularities. He next turns up in Red River, holding agitation meetings among the French. I might here say that when I mention the French, without distinguishing them as loyal, I am to be understood as meaning the followers of Riel only.\n\nO'Donohue, a teacher in St. Boniface, and who had, I believe, already taken orders, is a publicly acknowledged New York Fenian; and threw aside his gown to become a partisan and soldier of Riel. He is as sleek faced and white-haired a hypocrite as ever I saw, and does the sanctimonious dirty work of the cabal,—says to his followers, \"pray that I may not be forced to call in the aid of the Fenian Brethren.\" He attends to the confiscating bureau, wears Mrs. Schultz's gold watch and drives the Doctor's blood mare.\n\nNext comes Lepine, who was unknown until this affair, when he has all at once risen into notice and to a high position in the New Republic. To him falls the making of arrests and all the drudgery.\n\nBannatyne is the apologist of the rebel party, whose duty it was to pacify any unruly or refractory English person who might come to town and express his opinions too strongly with regard to Riel's movements. It was his duty to say, and he did say: \"Well, Mr. ——, you know Mr. Riel is a fine fellow and has to do violence to his feelings in a great many matters. He had to take Fort Garry to save it, and had to place guards in town to protect it from being burned; had to guard the Canadian stores from Canadian adventurers and other outlaws. Keep quiet, my friend, keep quiet,\"—and the innocent person kept quiet accordingly.\n\nO'Loane and his partner are scarcely worthy of notice. They are both said to be Fenians, and are warm sympathizers with Riel.\n\nBegg (Bannatyne's partner), better known as \"Justicia,\" is a renegade Canadian who, from selfish motives, is led to fall in with his partner's views. He is sadly degenerate, and has certainly lost all the loyalty characteristic to all true Canadians.\n\nI will here give you a description of Dr. Schultz, by way of contrast, since he has lately come so much before our notice in the papers, not because he took a prominent part in the opposition, but because he had lived nine years in Red River, and through that time dared to stand up for Canada and Canada's cause, and to remain true and loyal to his country. He is a man for whom I have formed the highest respect, and is possessed of the greatest amount of coolness and bravery I ever witnessed. He is a man of whom his country may well feel proud, and who has suffered the greatest loss, the most humiliating dignities, and the most disgraceful treatment on account of the stand he took.\n\nA word from Sandford, of Hamilton, and I have done with the \"personal.\" He happened to be in Red River at the beginning of the rebellion, and by circulating a false report concerning a Mr. Hyman,\nof London, who, before Fort Garry was taken, made affidavit that it was the intention of the French to seize the Fort and all it contained, led the master of the Fort to believe that Mr. Hyman's information was not reliable.\n\nI will say very little about the causes of the rebellion and who are the prime movers, for it is involved in such mystery that it is almost impossible to tell much about it. It is evident that at first the Hudson Bay Company's officials aided it materially, if not directly and openly. They did so by a supineness and want of immediate and determined action. They set the ball rolling but now find that it went too far and is rebounding on themselves. The Roman Catholic priests undoubtedly have had, and still have a great hand in encouraging and aiding it.\n\nThe barricading of the road, the taking of Fort Garry, and the expulsion of McDougall, are well known, so that I pass on and come to the entrance of Col. Dennis and his subsequent movements. He came to Red River Settlement in December the 2nd, bringing with him Gov. McDougall's proclamation, and clothed with power from Gov. McDougall to raise a force, suppress the rebellion, and bring the Governor in by force if necessary.\n\nThis was the beginning of hostilities. The night of the 3rd of December, Riel, with a detachment of men, searched Dr. Schultz's houses as well as Col. Dennis's office, and several other places, in search of A. Clyne, who had carried messages from Governor McDougall to the Settlement. He would undoubtedly have seized Dr. Schultz or Dr. Bown, if he had found them. Fortunately, Dr. Schultz was away and Dr. Bown was still in town, but in a safe place. The next morning I drove him off to lower Fort Garry.\n\nColonel Dennis, in passing the town of Winnipeg, asked the Canadians to go to the Lower Fort, where he intended to make his headquarters. They did so, and willingly volunteered to aid him in everything he undertook to further this Canadian cause in Red River. In fact, Colonel Dennis then had the entire confidence of the loyal party. Contrary to our expectations, we were ordered back to the town of Winnipeg, to organize and concentrate ourselves, but to remain perfectly quiet and on no condition to fire the first shot, or in any other way to provoke an attack; and that when he had his schemes perfected he would come up and support us with a force, when we would join, and by concerted action, and a display of force, frighten Reil into submission without striking a blow. We, under Dr. Lynch as Captain, Miller as Lieutenant, and Allen as Ensign—occupied Dr. Schultz's building, mainly for the protection of our lives and property, and the protection of from $10,000 to $20,000 worth of Government stores which were placed in Dr. Schultz's store-house, and likely to fall into Riel's hands. We soon, however, found that we were placed in the front of the battle with our hands tied by orders on no condition to fire the first shot. Riel found out that we had such orders, surrounded the house and began a series of manoeuvres, by which we were\nkept constantly in alarm, and were not allowed to sleep day or night. On the first day we occupied the buildings I carried a report of our position to Col. Dennis, at Stone Fort, and returned with orders to retire to Kildonan Church. These orders I delivered into Major Boulton's hands, who at once held a council, at which were present besides the officers of the company, Dr. Schultz, Mr. Snow and myself. It was decided there, that considering that the orders were discretionary, and that we were then to protect so much property, and that the French were reported to be evacuating Fort Garry and retiring upon Stinking River, it was advisable to remain and hold our position till morning. Major Boulton took upon himself the responsibility of countermanding the orders, and in the morning started for Stone Fort to consult Col. Dennis, and to urge the necessity of immediate support. On Sunday we were allowed to go out and remained unmolested until evening when Riel surrounded us on all sides. I, in the meantime, had gone out to bring up some guns and blankets from the Scotch Settlement, and narrowly escaped being taken on my return. The party in the house numbered at this time about forty-five men, partially armed, some with rifles, some with revolvers and daggers, others with bayonets on sticks. Major Boulton succeeded in getting into the house about midnight and remained till morning, when he run the Guards on horseback to meet some parties in St. James's Parish, and fulfil some other imperative engagement.\n\nBlame was attached to Major Boulton by parties in Red River for not leading us out that morning, but he did what everyone then thought was right. He left orders with us to retire quietly in the afternoon, expecting that as usual in the day time, the vigilance of the French guards would be less. This, however, was not the case; on the contrary, their watchfulness increased, and we were regularly besieged. We were not allowed to get water from the river, our provisions were fast running out; we could not even hold communication with the members of our own party in the other house. In this state of affairs, we succeeded in smuggling out a report of our critical position to Col. Dennis, and next day received a note from him telling us to surrender and make the best terms we could, for he could not help us. It was with feelings of the greatest indignation that this was received. Mr. Snow was then commissioned to go to Riel and state to him that we were there, not to attack Fort Garry, but protect our lives and property and the property of the Canadian Government, and that if he guaranteed that our lives and property would be protected, we would quietly retire to our homes. Mr. Snow returned with a written command from Riel to surrender within fifteen minutes, and backed his command with an additional force of from 150 to 200 men. Mr. Bannatyne told us that Snow went to Riel and offered an unconditional surrender. Mr. Snow will know whether this is true or not. If so, he sold us into the hands of our enemies.\n\nWe were led to believe by Mr. Bannatyne (who was Riel's messenger) that it would be a mere matter of form; that we would be marched to\nthe Fort and set at liberty, and that all property would be respected. We surrendered, and the result is well known. On arriving at Fort Garry we were received by volleys of musketry, and imprisoned in three rooms. Dr. Schultz was taken to John McTavish's house and afterwards placed in solitary confinement. In these rooms we were packed so close that we had to break the windows to keep from suffocation. In one of them was a bed and table, and in that room the poor fellows found themselves in the morning in a position something like the following:—Seven on the bed, two under it, two under the table, and the remaining space literally packed with human beings. One man slept all night hanging on the bed-post. We were here fed on pemican and tea; and while here we saw the hoisting of the \"Flag of Rights,\" as it is called. The flag is of white material, and on it is the fleur de lis of France, and three golden shamrocks. After this thirty-eight (among whom I was included) were moved to Fort Garry jail, the worst indignity all. The place is close, small, and unhealthy. A narrow hall and six cells, 6 by 9 feet, filthy in the extreme, and crawling with vermin. Here I remained, until I escaped with four others, putting in an existence as best we could. The rest remained over two months, until they were liberated by the gallant movement of Major Boulton and his party of Canadians and Portage people. It is unnecessary to dwell upon this; sufficient to say, that while we were there we were constantly kept in alarm by reports coming from Riel that a certain number of us would be hanged—a certain number liberated, &c.—evidently trying to coerce us into swearing allegiance to his government.\n\nAt last, tired beyond endurance, we determined to escape, and succeeded one cold, stormy night, by forcing out a small window of two panes and an iron grating, and being shoved through by our fellow prisoners from within. A general escape was intended, but unfortunately the 13th man was detected and taken back. Among those who escaped was the unfortunate Scott, who passed out just before me. Of the twelve who got away, seven were retaken, some badly frozen. Poor Hyman was found by the French guards in a vacant house about seven miles from the Fort, trying to keep himself from freezing by walking back and forward. Being unable to walk back to the Fort, he was actually dragged through the snow by the hands, and so badly was he frozen that at one time it was feared he would lose both his feet, but I am happy to say that when we left he was liberated and recovering fast.\n\nOne more incident of the prison:—William Hallet, an influential English half-breed, who was always spoken of as one of the bravest men in Red River, was taken in attempting to get into Schultz's building the day before we surrendered. His son was one of our party, and the whole family are noted for their loyalty to the Queen and to Canada. He was confined in Fort Garry until the liberation of the prisoners when he was brought back to his family a raving maniac. He was high-spirited, and at the time of Dr. Schultz's escape, when Riel found he had been baffled, he came into the guard-room.\nand stormed fearfully, cursing the prisoners, who had heard of the escape and were cheering loudly, calling them a parcel of d——n dogs. This was more than Hallet could bear, and he sprang from his room and seized the wretch by the throat, but before he could do him any injury he was overpowered, put in irons, and taken to solitary confinement. This proved too much for his reason, and in a few days he was a crazy lunatic with little hope of his recovery.\n\nWhile in prison we were visited regularly by Rev. George Young (Methodist), and Archdeacon McLean. Once by the Rev. Mr. Black, and Rev. Mr. Fletcher (Presbyterian). They were allowed to pray with us, but not allowed to speak to any of the prisoners.\n\nThe last movement I did not participate in, as I had already left the Settlement, and after failing in an attempt to reach Canada by way of Fort William, took refuge at Fort Alexander with Rev. Mr. Blair, an Episcopalian clergyman, who at the risk of involving himself in difficulty and gaining Riel's enmity by harbouring a Canadian refugee, treated me with all the kindness and consideration of a brother, or a near relative.\n\nI have, however, all the facts of the last movement from persons who went through it all, and I feel certain that they are reliable. A party of eighty men under Major Boulton and Wm. Gadie, started for Fort Garry from Portage La Prairie, having first bound themselves by an oath to liberate the prisoners; and having provided themselves with scaling ladders and everything necessary for the heroic undertaking they came in the night as far as Headingley Parish, where they were overtaken by a fearful snow storm, and the surprise had to be given up; these brave fellows, however, determined to do something, and took up quarters in a church. From here they sent a messenger to the lower parishes, and Mr. Gadie himself went to see Dease and his party of loyal French, asking them to join, and by united action release the prisoners and wipe out for ever Riel and his ruffian rabble. Mr. Gadie in attempting to get to Dease, was taken prisoner. The messengers to the other Parishes was more fortunate, and found the people ready to join them. The Portage force then moved down, and established themselves in Kildonan school-house, where they were joined by a force from below of five or six hundred men who took up their quarters in Kildonan Church. From there they sent up a special messenger, a demand for the release of the prisoners. This demand was at once granted by the coward Riel, who now began to fear that his end had come. Here was shed the first blood; it occurred in this way: a Frenchman had been taken by the Portage force as a spy, and was kept a prisoner in the school-house. He, seeing an opportunity, seized a double barrelled gun and ran off; he was pursued and fearing a recapture, and in order to secure a horse, shot young Sutherland, who was coming to meet him. The ball only passed through his hand, but the report of the gun frightened the horse, and the young man was thrown off, and the horse went galloping up the river; the Frenchman seeing this, turned deliberately and fired the second barrel at Sutherland, who\nwas just rising from the ground—this time wounding him so that he died in a short time. The Frenchman was captured, and when the force dispersed, was taken to his father's where he was left to recover from some flesh wounds he had received. After the release of the prisoners, the English force sent word to Riel that now they had accomplished their object, they would disperse, but informed him that they would have nothing to do with his government. If he left them alone, they would not interfere with him, but that he must not take any more prisoners, and return as far as possible, the confiscated property. They then retired, intending to form a Government of their own, and invited the Portage men to go down with them till they had established themselves, when they would be sent home with an escort. The Portage people chose rather to go to their homes at once. Their men were already leaving by twos and threes, and their force numbered about 40. After getting Riel's assurance that they would be allowed to pass Fort Garry unmolested, they started for home; but when passing the Fort, Riel sent out a party of horsemen and invited them to go in and see him, as he wished to explain some matters to them. They unsuspiciously went in and were at once disarmed and made prisoners. Scott and Boulton were put in irons. Major Boulton was sentenced to be shot, and thus made the means of forcing the English party to submit to his authority. Commissioner Smith sent word to them \"for God's sake,\" to submit and save Boulton's life. They submitted and very unwillingly sent delegates to his Council. Then followed one of the most atrocious crimes ever committed. Poor Scott was taken out, tried by a sham court-martial and condemned to die, and was butchered in cold blood.\n\nI knew him well, and knew him to be a brave, true-hearted good fellow, whose only fault was too great loyalty to his country and to his fellow prisoners.\n\nA word or two about the Commissioners and I will close; their mission has of course been a failure. It seems strange to send Commissioners to treat with Rebels, and more than strange to send men whose feeling and interests would naturally be with the Hudson Bay Company; these men on arriving at Fort Garry, and finding a party of Canadians imprisoned there, should at once have demanded their release, or refused to have anything to say to the insurgents till they were released.\n\nThe whole affair has been sadly mismanaged, and there is great blame to be attached somewhere—but where, it is hard to tell. In my opinion had Dr. Schultz or Major Boulton held Col. Dennis' position, matters might have been different. I cannot close without mentioning the kindness of our friends outside. While in jail, Miss Drever, and Mrs. Crowson, whose kindness supplied us on several occasions with little dainties in the way of tarts and puddings, a rarity that quite astonished our stomachs, and provided a pleasant relief to pemican and tea. Mr. Crowson attended us regularly until he was stopped by Riel, and were it not for him we would scarcely have lived through it. They\nhave, I am sure, the hearty and sincere thanks of the prisoners, and will be long remembered by all of them. And now after having gone through all this, and now that I am once more free, I feel more and more and more a true and loyal Canadian, and more than ever a Reformer.\n\nG. D. MacVicar.\n\nChatham, April 7, 1870.\n\nTHE RED RIVER AFFAIR.\n\n(From Ottawa Paper, April 8.)\n\nFortunately the daily arrivals of Red River refugees places us in a position to furnish the public with information which will enable them to judge how far the statements of Hudson's Bay officials may be depended upon. We learn that it is notorious that for four years the Hudson's Bay Company have refrained from hoisting the British flag on the flag-staff in Fort Garry. On the 24th of May last the loyal people in the town of Winnipeg got up a slight demonstration in honor of the day. Fire torches were set agog and a bon-fire got up. During the day officers of the Company were in town and were asked why the flag was not hoisted, but received as an answer only a shrug of the shoulders. On the same day the Company's steamer International was on the Red River on its way to Fort Garry. It was suggested to the officers to hoist the flags with which the boat was supplied, but a scornful laugh was the only answer. Governor McTavish was, we believe, on board the boat at the time; but here is a damning fact which we hope the people of the Dominion will not soon forget. The loyal people who got up this demonstration on our Gracious Sovereign's birthday asked the officer in charge of Fort Garry for the loan of one of Her Majesty's guns, left in charge of the Company by the last body of troops stationed there, in order to fire a salute in honor of the day, and were refused. On the fourth of July the small body of Americans in the town determined to get up a demonstration in honor of the Declaration of Independence. They asked the corps officer in charge of Fort Garry for the loan of a gun to fire a salute, and their request was granted. The facts are notorious. The gun was brought from the Fort to the hotel in town, kept by George Emmerling, and at five o'clock on the morning of the fourth of July thirteen rounds were fired in honor of the thirteen original States and at noon thirty-seven in honor of the existing States. On the same fourth of July an accident took place which may be stated with some advantage to Mr. Alfred Scott, the special representative and bosom friend of Mr. President Riel. Dr. Schultz, notwithstanding the steady persecution which he endured, never faltered in his loyalty, and on a corner of his property he erected a magnificent flag-staff for the purpose of making up\nfor the lack of loyalty on the part of the Hudson Bay Company by hoisting the Union Jack. Hearing of the acquiescence of the Imperial Government to the transfer of the country to Canada and being aware that the surveyors of the Dominion were in the country surveying, the Doctor had the word \"Canada\" written in white on the red ground of the flag. This flag had been hoisted on the first of July, and floated bravely in the breeze, but it was a thorn in the side of the Yankees and Hudson Bay Company's Yankee sympathisers. There are in the town one or two Fenians, and the worthy O'Donoghue is the Head Centre. They have openly expressed sympathy with the Yankees, and early on the morning of the fourth of July a Fenian flag was hoisted on this flagstaff, and was discovered flying there by some of the Doctor's servants when they awoke in the morning. The Doctor, it may be remarked, was absent in Canada. Dr. Bown, Mr. Mair, and some others, took the flag down, first having to dig up the staff, the flagpole having been cut. The obnoxious flag was torn to rags by the small but indignant body of people who had assembled, and the Union Jack was then hoisted and honored with a salute. We are informed that the man who hoisted this flag was Mr. Alfred Scott, the delegate of Mr. Louis Riel, the murderer of Scott.\n\nRIEL I.\n\n(From Ottawa Paper, 8th April 1871.)\n\nIt is well known that His Majesty King Riel is in open rebellion against the Crown and dignity of the British Empire, but his peculiar mode of living and conducting his Government, since he has declared himself Emperor, etc., is perhaps not so well known, and a short account of the position of affairs in the rebel camp, will no doubt, be of interest to our readers. The particulars have been learned from Canadians who have lately arrived in the city from Fort Garry, and who were eye-witnesses of what they state.\n\nFort Garry like the ancient Jericho, is surrounded by stone walls, part wood and part stone, in quadrangular form. At each angle there is a bastion containing two six pounder guns. The walls of the Fort are about fourteen feet high, and are in a good state of preservation. The insurgents have not yet learnt to be expert artillerymen for on one occasion, when it was found necessary to add to the glory and dignity of the Government, by firing a salute, twenty minutes were expended in loading and firing each gun, rather slow time for the braves who intend defying the hosts of Britain, Armstrong guns and all. Beside the guns in the bastions there is a small field piece in good working order. Ammunition there is any quantity of, safely stored away in the magazine of the Fort.\n\nSoon after His Majesty Riel was appointed to the head of the\nnation he took possession of Dr. Cowans house inside the Fort, turned\nthe doctor out to shift for himself, confiscated the best furniture and\nhorses of the leading residents, and opened a court in true regal style.\nNext, all the Hudson Bay Company's stores were seized, including a\nlarge quantity of good old port and rum. The cellar of Dr. Cowan's\nhouse, also, happened to be well stocked, and His Majesty was not at\nall slow in making free with the contents. In order to have court\ncomplete, it was necessary to appoint courtiers, who could drink with\nHis Majesty, and help his muddled brain to order the puzzling affairs\nof State. Kindred spirits to fill these important posts were soon found\nin the persons of Bannatyne, James, Ross, and Alexander Begg, the\ntwo latter, Canadians who have turned traitors. With the prefix of\nHonorable to the courtiers' names, the court is complete. So Riel,\nwith his few hundred followers took possession of the Fort, and there\nreigneth at present. Riel is an inveterate drunkard, and although the\ncourt journal, the New Nation was kind enough to inform its readers\nthat His Majesty had lately been seriously indisposed from a severe\nattack of brain fever; it was well known that the painful indisposition\nwas nothing more or less than an attack of vulgar delirium tremens.\nIn fact, Riel has had two or three attacks of the same horrible illness\nand cannot long survive, should he continue the inveterate drinker he\nis at present. The court breakfasts at an early hour when His\nMajesty, if sober, gives audience and inspects his stronghold. Wine\nis served out in liberal quantity at head-quarters three times a day.\nA quarter past one the Court dines and gets gloriously drunk. As for\nanything like decency and order from the brute Riel, no man in the\nsettlement expects any such from him.\n\nThe army of the King of Fort Garry is composed of some three\nhundred as ill-favored looking half-breeds as ever were candidates for\na hell. The inside of the Fort is said to be nothing more or less than\nPandemonium let loose. There is no order, military or otherwise,\neven attempted to be kept. Men may be seen staggering about with\nbuckets half filled with Port wine and rum; others are sitting in\ngroups with their shirts off, drinking and shouting; others are dancing\naway to the squeaking of a fiddle; all riot and confusion. The consis-\ntated horses are kept in the Fort, and to feed them the grain of the\nHudson Bay Company is thrown in large quantities on the earth, and\nis half lost in the mud and dirt. There is no economy of the supplies,\nand the scene of riot and recklessness will last as long as they do.\n\nThe opinion of the Canadians who have witnessed this state of\naffairs is that the sudden change from a state of starvation to a position,\nwhere, for a time they have unlimited supplies, has completely turned\nthe heads of the half savage rebels, who are gorging to sickness, and\ndrinking to madness.\n\nThe principal food of the drunken devils, from His Majesty down-\nwards, is Pemmican and White Sugar. Pemmican is stored in large\nquantities, as is the white sugar, and the combination forms quite a\ndelicacy in the North West.\nA captain commands every ten men and at present there are no other officers.\n\nThe arms are principally hunting rifles and in some cases muskets. That the force by itself can hold out for any length of time, against well equipped men is a thing too absurd to be thought of.\n\nO'Donohue is a sanctimonious villian and humbug and next to Riel, should be strung up. He is more sober and quiet than Riel, but is none the less active in keeping up the excitement. He is the representative of the Fenian element. His private secretary as he is called, is a vagabond named Kennedy, a Fenian from Buffalo, who was at Ridgway, and who boasts that he bayoneted wounded Canadians on the occasion of the engagement at the above named place.\n\nThe delegates now in the city were appointed by Riel himself, and not by the so called Provisional Government. Judge Black, an old resident of the place distinctly refused by letter to recognise the delegates, and the English and Scotch half-breeds were very indignant at the insult offered to Judge Black, by the appointment. Judge Black has been an old resident in the place, and would have had great influence, had it not been for an unfortunate connection with the Hudson Bay Company.\n\nThe correspondent who wrote to the Montreal Herald under the title of \"Red River,\" was a clerk in the employ of the Hudson Bay Company—in fact, was Governor McTavish's private secretary. This fellow acted in conjunction with the renegade Canadian who wrote to the Toronto Globe under the signature of Justicia, and both agreed to give in their letters the Hudson Bay Company view of affairs, the one saying what the other couldn't.\n\nWe also learn from the report of the Canadians lately arrived in the West, that the story now in circulation about Riel packing his valuables for an immediate exodus is not at all true. Riel will carry things with a high hand till the troops actually reach the Lake of the Woods, and then he will endeavor to make his escape, probably across the line, possibly to the West, where we will next hear of him in the role of the notorious John la Rue. We also learn that Bannatyne, the notorious rebel postmaster, is packing up to leave, and the persons who send the news think this very likely.\n\n---\n\nMR. LUSTED'S STATEMENT.\n\n(From Daily Telegraph, Toronto, 1870.)\n\nSir,—I wish through your columns to put the public right on some matters connected with events at the Red River settlement, in which I took a part before being compelled to leave at the commencement of the reign of terror which has since prevailed. I emigrated from Woodstock, Ont., in 1870, and resided at the town of Winnipeg during\nmy stay in the Northwest. We all anxiously waited the proclamation of Dec. 1st as a release from the uncertainty of our position, and as giving us the legal right to defend our property and liberty, already threatened. On the eventful 1st of December, Col. Dennis arrived with the proclamations, which were duly posted, and he himself proceeded to Lower Fort Garry, better known as the \"Stone Fort\" twenty miles north of Upper Fort Garry, and in the midst of the loyal inhabitants, and there established his headquarters. In a few days afterwards he ordered the Canadians from the town of Winnipeg down to the Stone Fort to be enrolled, and on the same day Mr. Wm. Dease the leader of the loyal French half-breeds came to the town of Winnipeg for the purpose of going to see Colonel Dennis and offer the services of 200 of his followers, but being closely watched by Riel's guard he felt unable to proceed, when Dr. Schultz offered to drive him to the Lower Fort, and did so. Now commenced Riel's course of open violence and insult. The buildings of Dr. Schultz, in one of which a large quantity of Canadian Government provisions were stored, were the nearest building to Riel's stronghold at Fort Garry and a demand made on Dr. Schultz by Riel some time before for the surrender of these stores, not being complied with and an attempt made to frighten the Doctor into acquiescence by the training of two double-shotted Cannon on his premises, with blustering demand in writing for the instant surrender of the provisions under his charge, being equally unsuccessful, the Doctor became at once a marked man, and one who must be got rid of. As I have said, after the Proclamation, advantage was taken by Riel, of the Doctor's absence with Mr. Dease at Col. Dennis' Headquarters, to roughly search his house at midnight with armed men, at a time when the Doctor's wife was quite ill. On the doctor's return next day he was as indignant as we expected, and immediately prepared to resent a similar outrage by arming his clerks and servants and keeping guard at night. The Canadians from the town who had gone to the Stone Fort in obedience to the commands of Colonel Dennis, to be enrolled, returned by his orders, and quartered themselves in the rooms over which the Government provisions were stored and in an adjacent building as they had been directed to keep together for mutual protection and to avoid a collision. Soon Dr. Lynch was sent up to enroll others, and when Major Boulton arrived a day or two afterwards he found nearly seventy men collected from the town and neighboring parishes. These he immediately formed into a company, with Dr. Lynch as captain, Mr. Miller as lieutenant, and Mr. Allen as ensign, and directed them to continue occupying the position they had held, and while making no offensive movement, to defend themselves and the property under their charge. At this time I joined the force and continued with them until their surrender. In organizing companies in the neighboring parishes, those who had joined us there and our force was soon reduced to forty-one men, and these with Dr. Schultz, Mr. McArthur, Mr. Snow, Mr. Mair, and others, amounting to 48\nmen. We had among us only 35 guns, several pistols, some bayonets mounted on oak sticks, and a fish spear. We had enough determination to defend ourselves, and knew that the rebels exaggerated our numbers and arrangements. Moreover, one of the buildings we occupied under Dr. Lynch was of brick and well defended, and although that in which Dr. Schultz lived was of wood, yet the Doctor had made the part near the windows and doors well-guarded with matrasses, bales, etc. I need not occupy your time with the weary details of our long and anxious watching. Riel's rebels soon surrounded us, and were assisted by his sympathizers in the Town of Winnipeg in finding how their force was situated. We felt we were in his power from the time we were ordered not to fire first. Hemmed in, cut off from wood, water and provisions we asked leave to withdraw, or for fifty men to enable us to hold our position. We were ordered to leave if we could without provoking a collision. A council of the officers decided that a retreat without a collision was impossible, and then being ordered to surrender at once, as assistance could not be afforded, reluctantly we complied, and then occurred the following circumstance by which I managed to make my escape: The rebels formed two lines to receive the prisoners, and my wife appeared on the scene, crying. O'Donohue went up and insolently clapped his hands in her face, and laughed at her. I then went back into the house, put on my overcoat, and on emerging I went directly away unnoticed by any one, and walked down to the Scotch settlement. Ten days afterwards I left for Canada, Riel threatening to shoot me if caught. I now hope to return with the force.\n\nTHOS. LUSTED.\n\n---\n\nRED RIVER.\n\n(From Toronto Paper.)\n\nST. PAUL, June 29.\n\nFrom late news which has been received from Fort Garry, there is no doubt that the Manitoba Bill will be adopted by Riel's Legislature, the French portion of that wise convention being completely under Riel's thumb, and the English portion having, at the time of Scott's murder, concluded to acquiesce in everything till the troops arrive, and the reign of terror is put an end to, the delegates intend repudiating the acts by them during their forced sittings with robbers and murderers. The only unsound ones are thought to be Honorable Mr. Bunn and the Very Honorable Mr. Bannatyne, Inspector General of Letters. These are considered almost as bad as Riel himself, one being the brother-in-law and the other a strong supporter of the invalid (?) Governor MacTavish.\n\nCrops were taking well wherever they had been sown, and although\na few grasshoppers had been hatched out, yet they were dying off and disappearing.\n\nSome plain hunters were encamped near Fort Garry carousing continually, and Adjutant General Lepine has a cordon of guards around Fort Garry, and declares that Riel shall stay and see the end of the rebellion he has created. Riel himself is now continually within the walls of the Fort, and though he declares that he has all along been assured of an amnesty, yet many consider that he is afraid of his own people to venture out, and will some fine morning be missing.\n\nThos. Spence, a gentleman well known to the Ottawa Police Court, still edits the New Nation, and the inspiration is done by O'Donohue principally. It has been made a state offence to return the paper to the office as at first was done.\n\nCHARLES GARRETT'S STATEMENT.\n\nTo the Editor of The Evening Mail, Ottawa.\n\nSir,—The exiles from Red River have been anxiously waiting the Report of Mr. Commissioner Smith on the North West troubles. I, for one, feel disappointed and naturally disgusted by the report which stigmatizes the loyal Canadians and exonerates the Governor and officials of the Hudson's Bay Company of any intentional neglect of duty on their part. Now sir, I must emphatically charge those officials with gross neglect of duty and acquiescence with the murderer Riel, at the commencement of the outbreak. As Commissioner Smith, unfortunately, was not in the settlement until some months after the uprising, he will not feel himself warranted in denying that Governor McTavish refused to issue a proclamation, when urged to do so, well knowing that 2,000 loyal men were ready to rise, and prevent Riel from taking possession of Fort Garry. Dr. Cowan, chief factor in the Hudson's Bay Company, and a magistrate, informed the Chief of Police that the Company was to continue in charge of the Law Courts, and Riel was to enforce the judgments rendered by these Courts. Judge Black, another Hudson's Bay Co. official, refused to allow Sergt. Power and the other pensioners to put up the British flag on the Company's flagstaff. Again, it cannot be denied that Governor McTavish instructed James Mulligan, Chief, of Police, in writing, that Riel had promised to respect his guard whilst protecting the property of the Canadian Government. Many other similar actions of the Company's officials can be clearly proved if necessary, and which show their acquiescence in the rebellion, and sympathy with its promoters.\n\nThe statements made by Mr. Smith, will be looked upon as an insult to the loyal inhabitants of Red River, who have suffered imprisonment and confiscation at the hands of that arch fiend and murderer Riel. By their wanton neglect of duty in taking such\nsteps as they could have taken to put down rebellion in the territory, and for the protection of life and property the Hudson Bay Company officials are gravely responsible. If Commissioner Smith had not stigmatized the Canadians in such unwarranted terms as he has, he might be entitled to some consideration, but he must well know that his uncharitable assertion will not cover his own blunders and malignancy, either at Red River or in Canada, while his bombastic chandler style certainly will not relieve him from the contempt he so richly deserves.\n\nYours respectfully,\n\nOttawa, May 3, 1870.\n\nCHARLES GARRET.\n\nDESPATCHES FROM A CORRESPONDENT, 1870.\n\nSt. Paul, May 24.—The Press has the following:\n\nThe Winnipeg New Nation of the 8th instant has come to hand. It brings the report of an important speech delivered by President Riel on the 5th inst. He announced some changes in his \"Cabinet,\" which now, he said, was composed of Hon. Mr. Bunn, Secretary; Hon. Mr. Donohue, Treasurer; Hon. Mr. Bannatyne, Postmaster-General, and Hon. Mr. Lepine, Adjutant-General, and he had appointed Hon. Mr. McKay Commissioner of Indian Affairs, and Hon. Mr. Bruce Superintendent of Public Works. He continued:\n\nLet me then ask this Honorable House to pronounce on the Executive appointments. It may be, that with the advent of another government to power, by-and-bye, the Legislature may not have such an opportunity as that now offered. For myself, I am the more glad to take this action, as it forms a protest against the accusations brought against me, that I have assumed dictatorial powers. I am not, and have not been a dictator, and I sincerely hope it will never be necessary that any one in power in this country will play such a part. (Cheers).\n\nAfter Mr. McKay had indicated some reluctance to accept on account of health, Riel proceeded:\n\nWe have just learned by mail that something is going on in the other provinces of Confederation, which concerns us. Threats are being made; but I do not know how far these threats are going against us. For my own part I do not attach much importance to them; and I have been the more inclined to this view, in consequence of a telegram which has just been received from His Lordship Bishop Tache from Father Richot and the other Commissioners. They announce they are urging a settlement with Canada, and that there is no danger, (loud cheers). But at the same time I have observed in the other reports which have reached us that some importance is attached to one idea, namely, that\nthat the people here are divided, and that the conditions on which we were prepared to receive Canada had been changed before they left here with the Commissioners. It is true there has been a change, but it is, I think, one for the better, as the terms proposed in the long run could be more easily assented to, than those agreed on in the Convention. Some changes were found to be necessary by the Executive, and they had to be quickly decided on, as the Commissioners were expected in Canada, and the people here were anxious to see them starting to Ottawa. Hence the manner of making the alterations. But I would like to place them before the House, so that honorable members might judge for themselves. Hon. Mr. Bunn, the Secretary, was with us while the alterations were being made, and so limited was our time for the work that we had to work day and night in order to finish and enable the Commissioners to start at the time they did. The Commissioners, of course, had certain power in regard to these demands, but before anything was finally settled, they were instructed that the approval of the Legislative Assembly of this country was necessary,—so that, while complying with circumstances we had at the same time a saving clause that the ratification of the action of our commissioners depended altogether on the will of the Legislature of this country. (Cheers). To-morrow, if it is the wish of the House, I will place on the table the List of Rights as given the Commissioners, printed in English and French. (Hear, and cheers). I have to thank you, hon. gentlemen, for the attention you have given me with regard to the executive appointments. We must, of course, bear in mind, that they are merely provisional in their nature. It is said that we are going to fight with England, but we have not that pretension, (hear, hear),—and some may find out that the present arrangement, such as it is, is more provisional than they think, (cheers).\n\nTo this we append the following important letter from Fort Garry, in which an abstract of the list of demands sent to Canada by the delegates is given:\n\n---\n\n**RED RIVER.**\n\n(From Toronto Telegraph.)\n\n\"By Telegraph 2nd July, 1872.\"\n\nSt. Pauls, June 26.—The arrival here of Colin Inkster, Esq., an English native of Red River, supplements the news from Manitoba to a late date. Some days before Mr. Inkster arrived here we had an \"interview\" with Riel's uncle, an uncouth scalawag sent up by the Provincial Government to ascertain the intention of the Fenians in Minneapolis and to invite their co-operation with the insurgents at Red River. The fenian fizzle in Canada, however, has effectually snuffed out the brotherhood here, and rumor says put certain promi-\nnent merchants in this city considerable out of pocket for supplies sent to St. Cloud. The who \"uncle\" bears a strong resemblance to a musk-rat has returned in stupid disgust. The Musk-rat declared that the French were ready to oppose the Canadians from Lake Superior, if the Fenians would assist them; but this statement is totally contradicted by Mr. Inkster and others, who state that Riel held a mass-meeting of French half-breeds at White Horse Plains, and urged them to oppose the expedition, using every endeavor and the grossest falsehoods to inflame their minds, and screw them up to the sticking point. There was a counter influence, however, in the shape of one Paschal Berland, which Riel could not carry over.\n\nMr. Berland is a French half-breed of prosperity and intelligence, and is a resident of White Horse Plains. Last fall he was inveigled into insurrection by Riel against his own better judgment, but soon discovered his error, kicked over the traces, and to avoid entanglement went off to the Buffalo hunt, as did many others of the intelligent and independent French in Red River. Berland left his son in charge of his property at home, but taking advantage of the old man's absence, Riel and the priests got round him and seduced or frightened him into co-operation. When his father returned with the Plain hunters in the spring, and discovered the conduct of his son, his indignation knew no bounds. He called him a fool and simpleton, and the accomplice of robbers and murderers, and when Riel held his mass meeting at the Plains, cast in the entire weight of his influence against him. The various fluctuations of feeling exhibited by the people when submitted to Riel's murderous exhortations, and then of Mr. Berland's cold but peaceful counsels, are said to be very amusing. When Riel drew his red-hot pictures and handed round the rum, they brandished their flintlocks and swore vengeance! When Mr. Berland spoke, his words fell like snowflakes over a slow fire. He pointed to their rebellion, which was a sin, and though himself a Roman Catholic, to the influence of the priests, as crafty and criminal; to the thefts and plunder of loyal men's property, which made his cheeks tingle with shame, and to their murders which filled him with horror. His exhortations had great effect upon the White Horse Plainsmen, who had heard, moreover, of the Canadian expedition, and have a wholesome dread of soldiers.\n\nRiel returned to Fort Garry completely discouraged, and finding that he could not carry out his wishes, became suddenly loyal, and ordered his creditor of the New Nation, a poor, starved wretch by the name of Spence, to write loyal articles, and put a new face upon treason a measure which will not shield him from the righteous punishment he and his accomplices have so thoroughly earned. He still continues to keep a band of some 50 half-breeds about him, who subsists upon the remnant plunder remaining in Fort Garry.\n\nMr. Inkster now here, is a man of great intelligence, and a thorough Canadian in feeling. He is a brother of the late William Inkster, a native resident of Red River, and the largest private trader in the Territory. The death of Mr. Inkster, in the spring of '69 was a most\nunfortunate occurrence for Canada. He was a man of great energy and courage. Anxious for the introduction of Canadian Government, and having great influence among the English people, his counsel and decision of character would have operated at a time when the English natives had no person to take the lead in resistance to Riel's aggressive and insulting authority. His brother, Colin Inkster, is the person who, when Riel refused to have the Queen's letter read at the open air meeting in January last dragged him up to the platform and compelled its production. He says that had the English people risen at that time as they subsequently did, Riel and his crew could have been put down with the greatest ease. The English people on this occasion requested Donald A. Smith to run up the British flag, but he refused to do so, told them it was premature, and thus an important opportunity was wasted. It is easy to imagine what might have been accomplished by a brave man like Mr. Inkster, who had already collared the scoundrel Riel, and compelled him to listen to the Queen's letter, had the suggestion of the loyal people been then listened to by the Canadian delegates.\n\nThe Fenian flag still floats at Fort Garry from the tall flag-staff taken from Dr. Schultz's premises, and under it on a shorter pole, the British ensign hung at half mast. Donohue, who seems to have as much power as Riel, is luxuriating on the pennon of the land, and takes his ease under the flag of treason and misrule. Up to the receipt of the cheering news from Canada, the spirit of the loyal people had been very much depressed. They saw no hope of redress or of release from the brutal tyranny and insults of the French insurgents. They planted little or no grain, and many of them talk of leaving the country.\n\nIt was not until the news of the indignation meeting in Toronto was received in Red River that Riel hoisted the Union Jack even at half-mast; and if that noble and patriotic outburst had had no other effect, it made itself felt and created a shudder of terror in the rebel den at Fort Garry, such as never was felt before. He himself was completely cowed and terrified, and for many weeks has not been seen beyond the Fort walls. Lepine, his fellow murderer, is posted at Pembina, and declares that it is the intention of the French to prevent Riel from leaving the Territory. They have followed him, they say, and executed his orders, and now that punishment is imminent, they swear that he shall not escape and leave them in the lurch.\n\nLarge numbers of the French are leaving for the Plains, and by the time the troops arrive even the semblance of opposition will have disappeared. The Indians now know of the expedition under way, and are all friendly to it. Some time since they threatened to sweep the French out of existence, and a large body of them, posted near the mouth of Red River, meditated an attack upon the insurgents. Bishop Taché hastened down to their encampment with presents, &c., and entreated them to disband. He told them that his \"children\" had done no harm, and were their friends; and that all their acts would be recognized and justified by the Queen herself.\n\n\"Black Gown,\" said the chief, sternly, \"Many years ago one of my\npeople took life. He was captured by your people and put to death. He deserved his punishment. Last winter your people murdered a Winstikoosoo (Canadian) who had done no harm; and now you tell us that your people did well. Some years ago one of my young men took what was not his, and you put him in prison, and you did well. For eight months your people have been living as we all know upon stolen food, and are clad with stolen cloth, and you tell me your people have done no harm. Go away!\"\n\nAfterwards the English people succeeded in persuading the Indians to disband, fearing that their tender mercies would fall alike upon all sexes of the French.\n\nMr. Inkster leaves here for Red River in a few days. Mr. Newcomb, a Canadian, just arrived from Fort Garry, left here on Monday last by the Mississippi steamer, in company with Mr. Mair, and en route for Canada.\n\n---\n\nFULL DETAILS OF SCOTT'S MURDER.\n\nBY MR. CUNNINGHAM, SPECIAL CORRESPONDENT TORONTO \"TELEGRAPH.\"\n\nFort Garry, Sunday, Sept. 4.—This is Sunday evening, and feeling inclined to do a little writing, I sat down to give you an account of my wanderings amongst the churches in Winnipeg; but not having visited them all—only three of them—I thought better of it, left the churches till another occasion, and have preferred to undertake a more difficult but, at the same time, quite in consonance with Sunday evening's duties. I mean a brief account of the death of Scott. It is an old story, and it may be that I have not a new fact to relate, yet Mr. Young—than whom a more kindly, warm-hearted, generous, truthful man does not live—promised to Scott shortly before he died that he would give a true statement of the case to the people of Canada. Mr. Young has not till now given that statement, and preferring me and the paper I represent as the medium of its dissemination, I lay before you, as told by Mr. Young, the story of Scott's death.\n\nIt is a simple story and I have endeavored to eliminate from it anything of rhetoric flourish or grandiloquent mistatement.\n\nTo begin with, Scott was never taken in arms at all. It has been stated, and it is generally understood that he formed part of the party who were taken in Schultz's house. Such is not the case however. For all he had to do with the matter is, that when Riel had surrounded the doctor's house with guards, Scott, with that chivalrous spirit which probably cost him his life, went boldly down to the Fort in company with another, and asked Riel to allow the women and children to leave the buildings, where they were suffering considerable hardships. His manliness seemed to have terrified the President and his party, for instead of his request being complied with he was taken prisoner for\nhaving the temerity to make it. On this occasion he remained some time in prison; but subsequently made his escape along with several others of the prisoners. He was not released under an oath of any kind, but escaped from the prison.\n\nIn February, when the bondage had become galling and the reign of terror no longer bearable, the loyalists in different parts of the settlement began to show that they would make one more effort to free themselves. Riel on seeing the spirit and determination manifested, seems to have got frightened, and as a means of averting the coming storm he promised on his honor that he would release all the prisoners on a certain day. This caused somewhat of a relaxation of the efforts of the loyalists, and when the day came the promise was not kept and the prisoners remained in their dungeon. Then numbers of the loyalists once more rose in arms, and assembled at Kildonan, five miles from Fort Garry, to the number of six or eight hundred men. Amongst this number were sixty Portage men, and amongst these was poor Scott. Now on their march down, the Portage men passed near to Winnipeg, and when passing a house on the outskirts of the village, belonging to a man named Carter, where Riel had frequently lodged, they halted. And in this connection a great deal has been said involving Scott. It has been said that he violently entered the house, with a pistol in his hand, and demanded that Riel should be given up, and that he uttered many threats regarding Riel to the inmates.\n\nSuch is not the case, however. For Scott did not go into the house at all; but another of the party went to the door and knocked, and when he was informed that Riel was not there, he hurried away and the whole party marched off to Kildonan.\n\nThings now reached a crisis, and the rebels seeing that something must be done, released all the prisoners. Some of these made their way to Kildonan, and the people who had assembled having, by their actual presence, become convinced that so much of their work was done, held a council of war, and resolved to disband. Riel was communicated with, was informed of their decision, and it is said promised that the Portage men would be allowed to pass by the village on their way home unmolested.\n\nThe Portage men on the general disbandment started on their way home, and on the faith of Riel's promise took the road past the village. When laboring through the deep snow within three-fourths of a mile from the village, they were much surprised to see a large company of horsemen approaching them in something like battle array. Seeing the arch-rebel O'Donoghue at their head, and fearing treachery, the Portage men made ready to defend themselves, when O'Donoghue called out, \"Don't fire. We are friends. We mean you no harm. Come to the Fort and warm yourselves, and shake hands with us and have dinner, and all will be well.\" And the Portage men foolishly relying on the scoundrel's good faith, went down to the Fort, entered and found themselves prisoners.\n\nOn the morning of the following Sunday, Mr. Young called, as was\nhis usual custom, at the Fort to visit the prisoners, and amongst the first things he heard was that Scott was put in irons and placed in solitary confinement. On hearing this he at once asked permission to visit him, and on entering his room he saw a pitiable spectacle. The room was bare and cold, and the door kept closed, so that no warmth from the hall stove could reach him, and desolate on the bare floor lay the poor young man. One blanket had been vouchsafed him, but the hard soulless irons which bound his ankles became insufferably cold, painful, almost as if they had been molten, and he had taken his one blanket and wrapped it round his feet, and there he lay.\n\n\"What have you been doing Scott that you are in such a position?\"\n\n\"I don't know,\" was the reply.\n\n\"Have you been insulting the guards or making yourself obnoxious in any way.\"\n\n\"Well,\" said Scott, \"yesterday it was very cold, and I was trying to get near the stove to warm myself when one of the guards with insulting language, ordered me off. I reasoned with him, and while we were talking O'Donoghue came up and asked me why I was making so much noise, I replied that I was not making much noise, and said that though I was a prisoner I ought to be treated with common civility. Prisoners don't deserve to be treated with civility, said Uriah, and ordered me to be put in the room at the point of the bayonet. Soon afterwards I was brought out and put in irons.\n\nOn the next Thursday evening, about 9 o'clock, Mr. Young having just returned from holding a service in the country, and was just entering his house, when a messenger, one of Riel's soldiers from the Fort, called on him and stated that a prisoner, who was to be shot to-morrow, at noon, wanted to see him. Mr. Young was somewhat incredulous of this, and on the way to the Fort asked the guard if he thought there was an intention to carry out the execution. The guard gave it as his opinion that the matter was a serious one and that in all probability the prisoner would die.\n\nMr. Young entered the room, and there was Scott much more comfortably lodged than before, with a bed, pens, ink, &c., with a candle, but still the room was the condemned cell, and poor Scott was to die on the morrow.\n\nOn seeing Mr. Young, Scott was evidently much gratified and expressed his gratitude most fervently. He seemed fully to realize his position as a perilous one, and was fully impressed with the idea that the shooting would be carried out. But in the course of the conversation, seeing as it were, to get a true British view of the affair, he interjected, \"But will they dare to do it! They have the power to do it, and they hate me enough to do it, but will they dare to do it.\" Afterwards he spoke to Mr. Young of his friends, told him how to dispose of the various little articles he had, asked him to write them and told him what to say to them, and after that he devoted himself to his spiritual affairs. And here it may be well to mention that Mr. Young wishes it to be distinctly understood that the representations made by the cor-\nrespondence of the *St. Hyacinthe Courier* relative to Scott's hardenedness; his violence, his frequent refusals to receive Mr. Young, and his callousness as regards his position are false and utterly false, without a shade of foundation. For all along Scott was exemplary in his conduct, most respectful to Mr. Young, was gladdened even to tears at his kindness and sympathy, and instead of refusing to listen to him eagerly, listened to every word he said, and gave most satisfactory replies to all questions asked. After the abuse that has been heaped upon poor Scott, by many who ought to have been to fault a little blind, it is but right this matter should be put thoroughly right.\n\nWhen it got late Mr. Young offered to remain with Scott until noon next day, but Scott, who thoroughly appreciated the offer, said that he would prefer it otherwise; he wished to write to his friends; he wished a little rest, and asked Mr. Young that he would come down early in the morning. The Reverend gentleman agreed with him and went away.\n\nNext morning Mr. Young, who, it may easily be imagined, passed a sleepless night, was up and doing. He went to one and then to another, who, as he thought, might have the slightest influence in averting the fate of the unfortunate man, and pleaded with them to intercede. None of them had heard of the matter at all; most of them did not believe the execution would ever take place. But of those whom Mr. Young called upon, Mr. Donald Smith, then acting Commissioner, at once promised to use all the influence he possessed to stay the proceedings. Pere Lestung (the scoundrel) also promised to intercede for him. Mr. Young then went to Riel himself, and urged him to release the young man, but Riel was inexorable.\n\n\"No,\" said the scoundrel, \"he is a bad man and has insulted the guards; he has had a fair trial. Five out of six of the Council of War have found him guilty, only one objecting, and with tears in their eyes condemned him to die. (People talk of crocodile's tears, but—)\n\nIt may be mentioned here that Scott, when the trial had ended, and Riel told him that they \"must kill him,\" urged that his trial had not been a fair one—that it had been conducted entirely in French, and that so far he had not understood a single word that had been said; nor did he know what charges actually had been brought against him. Riel, in reply, said in English that five of the six Counsellors concurred in condemning him. Canada had blundered all through, and now he was resolved that Canada would respect them.\n\nScott said, \"If I have done anything worthy of death I am willing to die, but it is hard that I should have to die for the blunders of the Canadian Government.\"\n\nWhen interceeded with for a commutation of the sentence, or at least a short reprieve, Riel asked Mr. Young if Scott did not really think he would be shot. \"It is hard for him to believe it,\" said Mr. Young. \"What, does he not believe me,\" said Riel, and he seemed mightly offended at his word being doubted even by the poor prisoner.\n\nMr. Young seeing that there was no possibility of obtaining a pardon,\npleaded in the most earnest manner that more time should be granted the poor man, though it were only one day.\n\n\"What, said Riel, \"is he not penitent? Is he not prepared? Go and tell him from me that he has got to die in an hour.\n\nHave you got a cross, Mr. Young? You should get a cross, and hold it up before his eyes. That would impress his mind.\"\n\nMr. Young said he did not consider that a cross was at any time or in any circumstances necessary, but it would not do now for them to get into an argument upon that subject.\n\n\"No,\" said Riel, \"I would not argue with you on the point.\"\n\nLépine was present during a part of this conversation.\n\nHere M. Young again wishes to contradict the statement of the St. Hyacinthe Courrier, relative to the frigid prayers of the clergyman, and the soldiers being brought in to pray with Scott. For appearance certainly did not indicate that either Riel or his soldiers were in a very devout mood at that time, and if the clergyman or his prayers were frigid, poor Scott did not seem to regard them so, for he entered into all the exercises with a warmth, which showed how his heart was with them and that he felt as a brave christian man ought to feel when about to die.\n\nNoon came, and a little past it, and Mr. Young began to have some faint hopes that a pardon, or at least a respite, had been granted, but in a few minutes some of Riel's men appeared in the room. They tied Scott's arms and put a white veil over his head. \"O, this is awful,\" the poor creature exclaimed, (and what a simple, heart touching exclamation it was, and who that reads the words does not feel them as such); but he at once repressed his feelings and became perfectly resigned.\n\nMr. Young then asked that the men would go out a little and leave them together. They knelt together on the floor, the clergyman and the poor victim, and prayed fervently for a few minutes, and as if Scott had been strengthened by the exercise, he asked that he would be allowed to say \"Good bye to the boys.\" And this was the only request he made of his murderers.\n\nPermission having been granted, he looked in at each door, and said good bye boys to his old friends, and then went down the stairs. On his way down, he exclaimed to Mr Young \"This is a cold-blooded murder; be sure and make a true statement.\" No cry for vengeance—no call for retribution on the heads of his murderers. \"Be sure and make a true statement,\" that was all.\n\nThey then walked along, the clergyman and the victim leading each other by the hand—leading each other—for Scott walked with a firm manly step, not like a miserable murderer, but more like a martyr, and those who say he tottered as he walked, simply lie. They went out at the gate and along the sleigh track, and after having gone a few paces, the officer ordered them to halt. A few moments for prayer was granted them, and these two knelt down in the snow, and fervently addressed the Most High. Let the readers of the St. Hyacintho Courrier compare that simple description with the glowing picture their correspondent gave of prayers and crucifixes and other lying imaginings.\nMr. Young then said, I must leave you Scott for the present, when Scott asked him to draw the cloth a little closer over his eyes.\n\nThis was done, and then he said, \"Good bye,\" and these two friends parted forever. Mr. Young turned toward the gate and coming upon the officer commanding the firing party, he entreated him to defer it—to give him one day more with the prisoner. \"No, no,\" said the fellow, \"his time is come, he must die.\" With a bleeding heart, Mr. Young looked round to see if there was no help, and he saw O'Donoghue standing. It was a faint, faint hope, certainly to expect sympathy in that quarter, but hope catches at straws, so he went up to O'Donoghue, and said, \"O, this is a terrible thing, try and get it put off for a day; I know your influence is sufficient if you will use it.\" O'Donoghue replied, \"It is gone very far,\" but the cold blooded scoundrel remained in his place unmoved.\n\nThe executioners then moved him from the truck into the snow, where he knelt down. Mr. Young then was just passing in at the gate, when the volley was fired, and on looking back, he saw poor Scott fallen forward on his face in the snow. In an instant the good clergyman was by his side, and saw that life still remained in him, for his right shoulder twitched violently. One of the murderers, who had come up said, \"He is dead.\" A second said, \"Put him out of his misery.\" A third said, \"Put him out of his misery.\" And a fourth took a revolver and pointed it close to his head fired. (It ought not to be omitted that when the procession was moving from the cell to the execution ground, Riel came out of his quarters and seemed to hurry them forward and complain of their slowness). The statement which appeared in the Witness that Mr. Young left him some time before death and that Riel induced a priest to minister to him is false. After the execution Mr. Young asked to have the body given up to him for burial, to which request Riel at first acceded, but subsequently distinctly refused. Upon this he went to Olone and Alfred Scott, and begged them to use their influence to obtain the body. They did so and Riel conceded that if the English Bishop came with Mr. Young and guaranteed that everything be done quietly, it would be given up. But Mr. Lepine whose name ought to be Lépine as Adjutant-General, claimed the body, and so it remained with the chief of murderers, and was probably buried in a deep hole in the Fort, and that is the history of the death of poor Scott. Whether he suffered as has been stated will probably never be known, Mr. Young some time after met one of the officers and asked how the matter really stood. The fellow who was drunk at the time, said, \"O, God? yes he lived till six o'clock I sent a boy to put him out of pain.\"\n\nSubsequently Mr. Young met the scoundrel who fired the pistol at his head, asked him about it. He said \"It was all a parcel of lies, he was all played out in twenty minutes.\" Surely justice must have been very blind when she made such scoundrels her ministers.\n\nSCOTT'S PROPERTY.\n\nAfter the death, the little property Scott had with him was broken into—\nand the documents found on him by no means indicated the braggart reckless character he has been represented as. For these were old country letters, from old country friends. One of them was a letter from a Minister who testified that Scott had been a dutiful, attentive Sunday scholar at his school in Ireland. (It seems to me there is something exceedingly touching in the poor fellow carrying that old letter about with him from Ireland up to Red River, and the fact preaches a powerful sermon as to the Sunday school). Another letter was from a clergyman, certifying to his having been a member of his church in Ireland and the rest spoke as to his good character and his skill as a workingman.\n\n\"Surely,\" said Mr. Young to Riel after the execution, \"this will be the last.\"\n\n\"I don't know,\" said he who had assumed the power of life and death. \"I don't know. Some of them are almost as bad as Scott. Some of them are very bad men. One of them is now before the Council. He may go too. His name is Parker. He had better look out or he'll go for it.\"\n\nParker was put in irons, and so was another of the prisoners named McLeod, and Mr. Young is thoroughly of opinion that had not Bishop Taché arrived at the moment he did arrive, there would have been a series of murders, and instead of the foregoing simple story of Scott's murder, there would have been many others, probably more sad and more serious.\n\nEFFECT OF DR. SCHULTZ' ARRIVAL.\n\nTuesday, Sep. 6.—Hitherto I have been complaining, or rather moaning and groaning over the inertness and the seeming want of vitality amongst the people up here; but things are improving a little, and a little more vivacity is being thrown into affairs; and all this is owing to the arrival of Dr. Schultz and his party. There is no doubt about it, and there is no use denying it, Dr. Schultz is the coming man in Red River—provided always that he wishes to \"come.\" I must confess that almost up till now I have had a prejudice against Schultz, I don't know why. Probably it was that I never met him before, but since I have met him here, he gives me the idea that he is a man, not only to lead, but to be followed. And from the influence he has with the people, and the way they look upon him as their champion, combined with his noble, manly bearing, it is little to be wondered at that Riel and his party were so anxious to put him out of the way.\n\nThe first feat of the doctor's on his arrival at a meeting in St. John's parish held yesterday afternoon, to draw up an address to His Excellency the Lieutenant Governor. Archdeacon McLean occupied the chair, and in his opening address the Venerable Archdeacon explained that he had called the meeting, not from any peculiar desire he, as a clergyman, had to mix himself up with politics, but from the fact that hitherto the clergy had been locked up to, not merely as leaders in spiritual matters, but in all matters. And he thought the time had now arrived when the laity ought to take political matters into their own hands, and free the clergy from the labor that had hitherto\nbeen imposed upon them in this respect. But the Archdeacon in closing his remarks, as if they just wanted one more opportunity of doing a little work in the political field, read a model address, which Bishop McRae had circulated round the various parishes, and laid it before the meeting. The doctor rose, and in a very few remarks, quite agreed with the Archdeacon, that the aphorism, \"ne sutor ultra crepidam,\" was a capital one, and hinted that henceforth the clergy had better mind their own business and leave politics alone, and moved a resolution to the effect that a committee be appointed to draw up an address to His Excellency.\n\nSTATEMENT OF THOMAS LUSTED.\n\nIn the course of a debate in the House of Commons on the 20th April, 1871, the question was raised as to why the Hudson Bay authorities did not arrest Riel when reinstated in power by Col. Woolesty and his force, in the course of which an affidavit was read of one Thomas Lusted, as follows:\n\n\"Personally came before me Donald Gunn, senr., a duly sworn Justice of the Peace for the Province of Manitoba. Thomas Lusted, of the Town of Winnipeg, in said Province, who being duly sworn, says: That on the twenty-fourth day of August last, 1870, the day on which the 60th Rifles arrived at Fort Garry, he was informed by the Revd. George Young, that if he procured a warrant for the arrest of Riel, Donohue or Lépine, that Donald A. Smith, the Governor of the Hon. Hudson's Bay Company would see that it was duly acted upon. That upon the receipt of this information, he the said Thomas Lusted did go to John Inkster, Esq., a Justice of the Peace, by virtue of his seat in the Hudson Bay Council, and on application for it, he the said John Inkster did give to him the said Thomas Lusted a warrant to apprehend the said Riel, Donohue and Lépine, that he the said Thomas Lusted did take the said warrant to the said Donald A. Smith, and requested him to cause it to be executed: That said Smith ordered me to get forty or fifty men and bring them to him the said Donald A. Smith, to be sworn as special constables to execute said warrant: That he the said Thomas Lusted did procure and bring to the said Smith about forty men. After considerable delay, the said Smith said that the said men must wait before he could swear them in. After waiting for four hours, the said Smith would not swear the said men, and the said Thomas Lusted seeing that the opportunity for arresting Riel, Lépine and Donohue had passed, the said Lusted and said forty men retired to the Town of Winnipeg, and did not afterwards get any notice of their being wanted for said purpose.\n\nThat said Thomas Lusted really believes that said Smith did not wish to execute said warrant, and that he the said Smith was anxious that the said Riel, Donohue and Lépine should have ample time to escape from the Territory and go unpunished.\"\n\nSworn to and subscribed in my presence,\nin the Town of Winnipeg, on the 15th March, 1871.\n\nDONALD GUNN, SENR., J. P.\nThe only answer which Mr. Smith, M. P., for Selkirk, seems to have been able to make to this direct testimony was the following exceedingly crooked one, reported in the Ottawa \"Citizen\" of April 21.\n\n\"Mr. Smith (Selkirk) admitted the visit of Lusted and of his desire to induce him to act and swear him and some 50 others in as special constables, the authority was informal and the men wanted authority to go out without being chicken hearted and shoot down the rebels. He would not comply. He was chief officer of the Hudson Bay Company and could not consistently act.\"\n\nEXTRACTS FROM VARIOUS CANADIAN PAPERS.\n\n(Shewing the views of their Manitoba correspondants on affairs there, after the expulsion of Riel by Col. Wooolsely.)\n\n\"In a former letter describing our passage across the head of Lake Winnipeg to Red River, I mentioned the precautions taken by Col. Wooolsely in ascending the Red River to prevent Riel obtaining news of his approach. Skirmishing parties preceded the boats on both banks leaving guards at all bridges and thoroughfares. These precautions should have rendered certain the surprise and capture of Riel, but it seems that there are parties here lately in high position who did not, for reasons of their own, wish his capture, and the consequence is that the leaders of the Rebellion are now safe on the other side of the line instead of being held here to answer for their crimes. Riel boasted much that he would waylay and destroy any force sent out and in a recent harangue to his followers said that though deserted by all, he would spill the last drop of his blood in defending Fort Garry. So much for what he said, what he did, was to run like a scared dog, like a whipped hound, at the first news of danger which was conveyed to him by a Mr. Stewart, an officer of the Company who are thought here to be strongly interested in preventing his capture, and the consequent possibility of his disclosing facts which would criminate them: This gentleman managed to elude the guards and made his way to Riel's quarters, informed him that the force was near, and the untasted breakfast which the officers of the gallant 60th found was consequent on the information.\"\n\n\"You, of course, will have heard by telegraph from St. Paul of the flight of Riel, Donahue & Co., and the peaceable occupation of Fort Garry by the forces. The first thing done was to restore the old flag to the staff which had been desecrated so long by the emblem of rebellion, and to restore the civil power\nto the Hudson's Bay Company, personified by Donald A. Smith, their Governor. This was accomplished within a few hours, and as the troops had failed to catch Riel, the inhabitants of the place resolved to attempt his arrest by the usual legal process. To this end an information was laid and a warrant obtained from a magistrate. The warrant was then taken to Mr. Smith, then chief of the Executive civil power, and its execution demanded. Mr. Smith took that course which has engendered such suspicions in the minds of people here regarding the complicity of the Hudson's Bay Company with the rebellion; He temporized, placed all sorts of objections in the way, and although forty men offered themselves as special constables for the occasion, he delayed the matter till Riel's escape was certain; Of course a stranger can hardly judge of how far the feeling of people towards the Hudson Bay Company is well grounded, but in appearances at least there is a very strong case against them.\"\n\n\"The new Governor, Hon. Mr. Archibald, has at last arrived, and everyone is waiting to see what will be the policy laid down by him; unfortunately he has very injudiciously exposed himself to one particular set of influences by becoming the guest of the Hudson Bay Company. Rightly or wrongly the large majority of the population here believe that Riel was a mere tool for this Company, working for a particular end, and this belief alone should have made the Governor more cautious. Still, he has the field before him; he has an ample armed force to support his authority, those lately in arms are thoroughly cowed, and expect punishment, and the loyally disposed population are, of course, disposed to be satisfied with any treatment that is at all fair. Common sense, applied to the position, would seem to dictate a policy which would deal leniently with the misguided followers of the leaders of the rebellion, while satisfying the loyally disposed part of the population that even justice would be meted out to all classes, nationalities and creeds. It is much feared, however, that the evil counsels of the Hudson's Bay Company will prevail, and that those lately in rebellion will be favored while those who stood true to British interests may be entirely ignored. If that course is adopted by the Governor it will lead to disaster, and will thoroughly alienate from him that class of the population who have the wealth, the intelligence and the respectability of the population.\"\n\n\"I wrote you some time ago, shortly after Governor Archibald's arrival, that he was just then determining his policy, and that it was feared that favors would be showered on those lately in rebellion, and the loyal people be ignored. Unfortunately this has been the case, and the Governor has even now laid the foundation for a lasting unpopularity. He has utterly ignored the loyal people, and the appointment of the ex-President of the Provisional Government, John Bruce, to be a Justice of the Peace, has given special and needless offence. Riel's Postmaster, Bannatyne, has been confirmed in that position. Riel's Secretary of State, Bunn, has received the Deputy Sheriffship, and a host of minor rebels and their sympathisers have been appointed to other offices. Riel's organ, the \"New Nation,\" has become the Government organ, under the name of the \"Manitoban,\" and reassured by this policy, Riel himself has came back, and is openly holding meetings among his people.\"\nMr. Speaker—I would willingly have avoided any discussion of the matter which now occupies the attention of this House. I would have avoided it, because everything connected with recent events in Manitoba has been to me of so painful a nature, that now that we have better and brighter prospects, I would willingly have allowed the whole matter to have remained untouched. Still, I find in my newly undertaken duties that one's personal feelings must not always be consulted, and that the interest of the people he represents, and of the country at large must be considered first, and the observations of the hon. gentleman from North Hastings, are such as call from me, as one of the representatives from Manitoba, all the information I possess on one, and the principal point which he has adduced, namely the complicity of the Hudson Bay Company, or rather of a portion of their officers with the unhappy rebellion of last winter. I am aware Mr. Speaker, that the views which I shall advance in regard to the origin of Red River difficulty, and the substance of the documents which I shall read in support of these views, may differ materially from those generally entertained in some parts of this Dominion, yet I advance them with the full belief that they are concurred in, and indeed, openly expressed by nine-tenths of that portion of the people of Manitoba, unconnected with the rebellion itself, or with the Hudson's Bay Company. It might, at first sight, Sir, appear strange that a Corporation who had lately surrendered their rights to the North-West Territory, who had received what might be considered a fair compensation for that surrender, and who, moreover, still retained a very considerable landed interest in that Territory, could have any possible reason for desiring anything but the prosperity, the advancement, and the peace of the country. Indeed it was generally advanced as a reason for allowing them to retain one-twentieth of the land, that this concession would bind their interest to ours, and be the means of allaying any possible source of discontent. But, to properly understand the bearing of this question, it is necessary for the hon members of this House, to bear in mind that there are two elements in the composition of the Hudson Bay Company, namely: The Stockholders of that corporation, and its managing partners in the country. So long as the Company confined its attention to the collection of furs—so long these elements were in accord, and the immense profits, which in former times were made, were fairly divided between the Stockholders, who had advanced the money necessary to carry on the business, and those who had in the country, the care, the danger, and the labor of the trade. Hence it was that while the Stockholders who assumed territorial, as well as trading rights, would sometimes admit, that the country was fitted to be something better than a preserve for fur bearing animals, that concession was rarely, if ever, made by one of the inland officers, whose profit was derived solely from the fur trade, and whose right to participation in any other source of profit was disputed, if it was not entirely ignored by the stockholders.\nIt will be readily seen, then, Mr. Speaker that there was in such a union of diverse interests, the elements of discord, and this became apparent as soon as the Stockholders consented to entertain a proposition for the purchase of their territorial rights by this country. While the stockholders could see in the large sum to be paid for rights which were then in dispute, an ample compensation for the gradual but inevitable destruction of the fur trade profits which must follow, the inland fur trading officer saw in it only his own ultimate ruin, and he opposed the project with all the power he possessed, and when the bargain had been concluded, he felt that Canada had accomplished his ruin by the purchase she had made, and that the stockholders had unfairly dealt with him in refusing him a portion of the compensation they themselves had received. Men so circumstanced, Sir, are usually ready for rash and even violent action, and we find the first evidence of this at the annual meeting of the officers at Norway House, held a short time after the conclusion of the negotiations and a few months before the emeute at Red River.\n\nThe following description which I find in one of the respectable journals of the Dominion will, if its evidence may be trusted, show the state of feeling which prevailed:\n\n\"One of the causes of dissatisfaction amongst the Hudson Bay Company's officials in the North-West is this: they say that the £300,000 to be paid the Company by the Canadian Government, will be pocketed by the English shareholders, and that not one copper of it will ever be seen by the traders in this country. No doubt they are perfectly right in this view; when the English shareholders get hold of the money they will very likely hold on to it. But the traders of the Nor' West proposed a game a little while ago which, if carried out, would more than make up to them the share of the £300,000, which, they say, the English shareholders intend robbing them of. At a meeting of the Council of Rupert's Land—the body which controls the Company's affairs in the territory, a motion was submitted by one of the Chief Factors, proposing that they should secrete for their special use and benefit, furs to the value of £40,000 to be divided amongst the factors and those interested, just as soon as it should be clearly shown that the English shareholders intended gobbling up the whole of the Canadian purchase money. A lengthy and animated discussion took place on this exceedingly dishonest, proposition, after which the motion being put, it was lost simply by the casting vote of the Chairman.\"\n\nNow, Sir, this account may or may not be exactly correct, but it is true that a wide-spread and deep disaffection prevailed and the most violent language and even threats were used towards this Dominion of Canada.\n\nMr. Speaker, it has been argued that we had rebellion at Red River because we did not first consult the feelings and wishes of the people of that region. Well, I can only say that you will rarely hear that explanation attempted at Red River. Why, sir, I have myself seen on petitions praying for annexation to Canada many of the names of those who were foremost in endeavouring to prevent that union, and if it had been that this was really the cause we would, I think, have found all classes joining in it, instead of its being confined to that por-\ntion of the population who had the least property at stake, and to the friends and sympathizers of the Hudson Bay Company.\n\nNow, if we assume that the officers of the Hudson Bay Company at Fort Garry were anxious, or even willing, that Canada should possess the North-West Territory we find it utterly impossible to explain the fact of their criminal inaction, their advice to Governor McDougall to leave the territory, their surrender of their fort, their advice to the people to join the Provisional Government of President Riel. But if we assume their complicity in the matter, we can readily understand the prevalent belief among the loyal people, both English and French, of Manitoba, that the disaffection and dissatisfaction of the Hudson Bay Company's officers, the disappointment of Governor MacTavish at not being appointed governor, caused them to hope that with Reil as their tool and agent they could keep out the governor, disgust Canada with her bargain, and keep the country for some years longer, a preserve for fur bearing animals with the consequent extension of the fur trading profits. That they proposed taking steps which would lead to robbery, and end in murder, I am not prepared to state, but the general belief is that with Governor McDougall turned back, and with a Hudson Bay Company officer at the head of a Provisional Government they could have forced Canada into an arrangement more suitable to themselves even if less profitable to shareholders. However, this may be, I have not risen to make statements on my own responsibility. I will read to the House a number of affidavits bearing on the matter, and although I could say much from my own knowledge that is relative and corroborative, yet I shall refrain, and leave hon. gentleman to form any opinion they deem fit from the evidence I present. As for myself I shall be glad if they are able to do so, yet, until that body can show, that their responsible officers acted as loyal men should act under similar circumstances, I cannot consent to their receiving one penny of the money of this Dominion.\n\nThe first statement bearing upon the subject is that of Sgt. James Mulligan, a Pensioner of Her Majesty's 17th Foot, and lately and for some time Chief of the Police Force in the Town of Winnipeg. Sgt. Mulligan being duly sworn before one of the recently appointed Manitoba Justices of the Peace, states among other things.\n\n\"That hearing that the buildings of Dr. Schultz were threatened with a consequent danger of fire extending to the town, said James Mulligan, then Chief of Police, proceeded at once to Fort Garry, and spoke to Chief Factor, Dr. Cowan, who was a Justice of the Peace and in charge of Fort Garry, told him what he, the said Mulligan had heard. Said Mulligan urged said Cowan to take steps to prevent such an outrage, and asked for instructions how to proceed. Cowan answered, what can we do? Said Mulligan replied that it would be advisable to call out the 30 special constables who had been engaged. Said Cowan refused to do so, and said Mulligan returned to take what precautions he could with the two policemen under his charge. Said James Mulligan further says that before the rebels assembled at\nStinking River, he gave due notice to said Justice Cowan of their intention to do so, and that the said Justice Cowan seemed to take no notice of it. That repeatedly afterwards up to the time of the Fort being occupied by Riel and his men, the said Mulligan did not urge upon the said Cowan, the danger in which the Fort stood, and a short time before did inform the said Cowan that the rebels meditated doing so immediately and again urged the said Cowan to call upon the said 300 special constables, but was in all cases distinctly refused. Said James Mulligan further says that a short time after the rebels had taken Fort Garry he went to said Fort with one Sergeant Major Power and requested an interview with Governor McTavish that he was told that Governor McTavish was too sick to see anyone, but was referred by Dr. Cowan to Acting Governor Judge Black. To Judge Black the said James Mulligan said, I have come here with Sergeant Major Power to request permission to raise the British Flag and to defend it. Judge Black asked him, how that could be done? Said Mulligan declared that he could call on the pensioners to the number of thirty and get as many more as he wanted from the loyal population. Said Black said, I will see the Governor to-night and we will see about it, and I will give you an answer to-morrow. On or about three o'clock on the following day the said Mulligan was informed that the request about the flag could not be granted, and that his services with pensioners and loyal men were not required. Said James Mulligan further says that on the 29th November, 1869, he did receive from Governor McTavish an order in writing to procure the services of seven men, and with them to guard certain Government stores in the storehouse of Dr. Schultz, and that said order was issued in consequence of an urgent appeal for protection from Jno. A. Snow, the Agent of the Canadian Government at that time, that he did procure the said seven men and place them to guard the building, that he remained till the seventh day of December, when the buildings were surrounded by an armed force under Riel, and orders having come from Col. Dennis to surrender, he was included in the general capture, and remained for ten weeks in prison. Said Mulligan further states that after ten weeks imprisonment he went and saw Dr. Cowan, and asked to see Governor McTavish, that he wished the pay of the men that he had employed to defend the Government stores. Said McTavish raised all possible objections and said, to tell the truth Mulligan, Riel has deceived me, he promised me that he would respect my guard, he also promised me he would only remain three days. Mulligan then said, \"you seem to have made a close bargain with Riel,\" which Governor McTavish did not deny, and admitted in general terms that he had made a mistake in not calling upon the loyal people. Said Mulligan further says that a few days after the taking of Fort Garry by the rebels, he called upon Dr. Cowan and asked how these rebels were being fed and whether they had broken into any of the stores. Said Cowan said that they had not, but that he had given them access to the store. Said James Mulligan finally says that he has been Chief of Police in the town of Winnipeg.\nfor four years, and that he acted in that capacity during the whole of the rebellion until his own imprisonment on the 7th of December, 1869. That he repeatedly warned Dr. Cowan and other of his superior officers of the rising and of the intention of the rebels to overthrow the Government and take Fort Garry, but that on all occasions he was rebuffed, and all his offers of service on behalf of himself and in the name of the loyal people who were willing to support the police authority and anxious to keep down the rebellion were distinctly refused, and that the said James Mulligan fully believes that the Hudson Bay Company authorities could at any time have stopped the rebellion, but that they encouraged it for their own purposes and verily believes Riel and his men to have been invited to take possession of Fort Garry.\"\n\nThe next statement is one also upon oath made by a very respectable resident of the Parish of Kildonan who states:\n\n\"That during the Fall of 1869, he was working in the vicinity of Fort Garry, and slept occasionally at the house of his sister in said Fort. That on one occasion, just before the gathering of rebels at Stinking River, to resist the entrance of the Hon. Wm. McDougall into the Territory, in going out in the dusk of the evening he saw Louis Riel and Chief Factor Dr. Cowan enter Fort Garry by the South Gate, and not wishing to be seen, he, the said John Flett, did enter the porch leading to the Hudson Bay Company's store. That while in said porch the said Riel and said Cowan advanced and stopped about five yards from where he was. That he distinctly heard this conversation which took place between the said Cowan and Riel. That it appeared from the remarks he heard as the said Cowan and Riel approached that said Cowan urged said Riel to go on with the proposed stopping of the Hon. Wm. McDougall at Stinking River. That said Riel replied, \"What good will that do me? What will I get for it?\" Said Cowan answered that Governor McTavish should do as he promised, and said Cowan also assured him, the said Riel, that he would get what he had been promised. That said Cowan and said Riel then walked in the direction of said Cowan's residence. The said John Flett verily believes from the whole conversation that said Cowan, who was then in charge of Fort Garry, was inciting and encouraging the said Riel by promises of payment to take active steps for the keeping out of the said Governor McDougall which said Riel seemed to hesitate about doing. That said John Flett did on several occasions see the said Cowan and Riel in close conversation, but could not hear what was said.\n\nAnother and the last which I shall call the attention of this Honourable House to, is that of a Gentleman who occupied an official position under the Hudson Bay Company for some years and may be supposed to have had considerable insight into the real state of affairs, states:\n\n\"That about four years ago he was commissioned by the Hon. Hudson Bay Company in England a member of the Council of Assiniboia and that he has been a Petit Magistrate and Collector of Customs for about ten years. That about one week before the erection of barricades at Stinking River, and when the rebels were then collected at that\nplace he was summoned to attend a meeting of the said Council of Assiniboia to consider the state of affairs. That at said Council he warned the other members of the gathering near his place on the Stinking River, but that the President John Black, then Acting Governor, did not suggest or advise any active measures to prevent the evil. That he then urged upon the Council the necessity, and offered to raise among the loyal portion of his own people, the French half-breeds, enough men to put the gathering down. That on pressing the matter he was allowed to see what he could do in getting the names of persons willing to act in such service and to report. That he afterwards procured the names of ninety-six able-bodied men willing to act, and that Governor McTavish directed him to disband and pay off the force which he had gathered at the north side of the barricade to the number of fifty-six without giving him any reason for doing so. That he requested and waited a day and a half on a written order, but that such order was distinctly refused. That there were on being estimated about sixty-six of the party under Riel and Bruce at the said barricade at Stinking River. That he asked Governor McTavish for additional permission to call on the English people, but that request was refused. That afterwards, and a short time before Fort Garry was taken possession of by said rebels, he informed Dr. Cowan the master of said Fort, of their intention of doing so, but that he did not advise or take any steps to prevent their doing so, and that in his presence a prominent French half-breed informed Governor McTavish of the intention of the rebels to take possession of the Hudson Bay Company's safe and of the Fort. That to the best of his knowledge and belief the officers of the Hudson Bay Company at Fort Garry did not wish to stop the action of the insurgents at Stinking River, and that had he been given authority to do so, it could easily have been accomplished with the aid of the French half-breeds alone. That the said officers discouraged and frowned down every suggestion of a means of doing so and refused all offers of aid, and that he believes that for some private reason the movement of the insurgents under Riel, Bruce and Lepine was thoroughly in accord with their own wishes.\"\n\nOn this speech the \"Ottawa Citizen\" of the following day comments as follows:\n\n\"In the consideration of the Supplementary Estimates last night, some discussion took place on that part which provides that $40,000 shall be expended for the above purpose. Mr. Mackenzie Bowell objected to the clause as it stood, and proposed an amendment which should exclude the Hudson Bay Company from a participation in any portion of it. He had stated last session and he stated again his belief that the Hudson Bay Company form a participation with this rebellion and he was unwilling that this company, whom he believed had made a claim for their losses should receive any compensation. Some further remarks elicited from Dr. Schultz, the member from Lisgar, a long and eloquent speech on the subject. He regretted that he should be compelled to speak on the subject at all, but since it had become necessary\nfor him to express his opinion he would be guarded in what he said. He would endeavor to represent faithfully the opinion of his people on this point and he would supplement that opinion with certain statements made on oath by respectable persons in the Red River settlement. The honorable member then read certain affidavits containing the most damning proof of the complicity of the Hudson Bay Company in the rebellion. The member for Selkirk who is the present governor of the Hudson's Bay Company, it was noticeable and remarked that he did not rise to refute one single statement made by the honorable gentlemen from Lisgar.\n\nOn the matter being pressed by Dr. Schultz, Sir F. Hincks explained that the Government had no intention of acknowledging or even entertaining the claim of the Hudson Bay Company, and that the $40,000 asked for was intended entirely for the relief of the sufferers by the late rebellion who were unconnected with the Hudson's Bay Company.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000496.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 58, "total-input-tokens": 77696, "total-output-tokens": 34168, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 49, 2], [49, 49, 3], [49, 102, 4], [102, 102, 5], [102, 2498, 6], [2498, 4925, 7], [4925, 7523, 8], [7523, 10013, 9], [10013, 12535, 10], [12535, 14926, 11], [14926, 16149, 12], [16149, 16149, 13], [16149, 17829, 14], [17829, 21077, 15], [21077, 24327, 16], [24327, 27531, 17], [27531, 30772, 18], [30772, 33993, 19], [33993, 37153, 20], [37153, 39464, 21], [39464, 42696, 22], [42696, 45871, 23], [45871, 48481, 24], [48481, 51587, 25], [51587, 54659, 26], [54659, 57852, 27], [57852, 61034, 28], [61034, 64217, 29], [64217, 67318, 30], [67318, 70008, 31], [70008, 72737, 32], [72737, 75911, 33], [75911, 78559, 34], [78559, 81744, 35], [81744, 84353, 36], [84353, 87081, 37], [87081, 89604, 38], [89604, 92325, 39], [92325, 95560, 40], [95560, 98811, 41], [98811, 101536, 42], [101536, 104618, 43], [104618, 107694, 44], [107694, 110810, 45], [110810, 113926, 46], [113926, 117053, 47], [117053, 120127, 48], [120127, 123114, 49], [123114, 125620, 50], [125620, 129077, 51], [129077, 132272, 52], [132272, 135648, 53], [135648, 138860, 54], [138860, 142115, 55], [142115, 145360, 56], [145360, 148563, 57], [148563, 149532, 58]], "primary_language": ["None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]