[{"id": "429173d5db64f983911526ed74f7a757d267c114", "text": "L'AMNISTIE\n\nMÉMOIRE\n\nSUR LES CAUSES DES TROUBLES DU NORD-OUEST ET SUR LES NÉGOCIATIONS QUI ONT AMENÉ LEUR RÈGLEMENT AMIABLE\n\nPAR\n\nM. LOUIS RIEL\n\nPrésident de l'ex-Gouvernement Provisoire\n\nBUREAU DU \"NOUVEAU MONDE\"\n30, RUE ST. GABRIEL.\n\n1874\nL'AMNISTIE\n\nLes territoires du Nord-Ouest ont été transférés au Canada seulement le 15 juillet 1870. Mais le Canada fit commencer, en 1868-69, des travaux publics en son nom dans la terre de Rupert et le Nord-Ouest, sans l'autorisation du gouvernement de la Baie d'Hudson.\n\nL'arrivée des agents canadiens, dans ce pays, fut signalée par le mépris qu'ils affectèrent pour l'autorité de la Compagnie elle-même et pour les anciens colons. Ils cherchèrent à s'emparer des plus belles propriétés des Métis ; surtout à la pointe de Chênes, paroisse établie à 30 milles environ à l'Est du Fort-Garry. Ils prétendirent avoir acheté ces propriétés des Sauvages. Et pour se fortifier dans ce commencement de lutte contre nous, ils tentèrent une alliance avec les Indiens, et leur vendirent, afin de se les attacher, des liqueurs enivrantes contrairement à la loi.\n\nD'ailleurs, le surintendant des travaux canadiens à la Pointe de Chênes, M. Snow, ainsi que ses subalternes se conduisirent fort mal : ils faillirent en certaines circonstances s'entraîner à assassiner. L'un des employés, Th. Scott, qui fut plus tard exécuté, porta un pistolet à la figure de son maître, et s'en étant saisi avec une bande d'hommes effrénés comme lui, il le traîna à la Rivière pour l'y faire périr.\n\nDes métis sauveront le surintendant des mains de ses employés qui étaient en grand nombre d'Ontario. On conçoit qu'en agissant ainsi ces étrangers donnèrent aux habitants du pays une idée qui ne leur fut pas favorable.\n\nLes autorités de la Compagnie de la Baie d'Hudson furent obligées de sévir contre leurs désordres. Et elles protestèrent contre le gouvernement canadien, moins à cause de la mauvaise conduite de ses employés que pour avoir entrepris, en dehors de leur sanction, des travaux publics sur leur territoire. Après que\nM. Snow eut commencé les travaux du chemin Dawson entre le Lac des Bois et la Pointe de Chênes, en 68, au nom du Canada; un autre intrus s'était mis, de la même part, à arpenter, dans l'été de 1869, autour du Fort Garry, les terres publiques et privées, d'après un système nouveau d'arpentage, dérangeant sans explications aucunes, l'ordre des choses établies, et troublant sans scrupule les anciens colons dans la possession paisible et légale de leurs terres.\n\nLes protestations du gouvernement de la Compagnie de la Baie d'Hudson furent bientôt suivies de celles des colons qui s'opposèrent résolument à ce que des hommes aussi suspects ouvrisssent des chemins publics, et pratiquassent des arpentages sur leurs propres terres, au nom d'un gouvernement étranger, avec si peu de garanties.\n\nEn même temps, M. McDougall se présenta sur les frontières à Pembina. Tout le monde le disait envoyé par le Canada, pour nous gouverner. En réalité, il emmenait avec lui un Conseil tout composé d'hommes que nous ne connaissions pas. Mais comme principal titre à notre respect, un lot considérable de carabines les suivait tous de près.\n\nLes Méns alarmés se formèrent en comité national, et s'avancèrent au devant de M. McDougall, lui envoyant des courriers exprès pour lui dire de ne pas entrer ainsi dans leur pays. M. McDougall fit une réponse insultante et pleine de dédain. Beaucoup d'aventuriers qui s'étaient attachés à la remorque de MM. Snow et du colonel Dennis, alors prétendu arpenteur général, et qui s'étaient tous compromis avec eux, soit à la Pointe de Chênes, en ouvrant un chemin canadien, soit dans le reste du pays, en y commençant l'arpentage des terres, avaient déjà déclaré qu'ils étaient venus d'Ontario, en avant de M. McDougall, surtout comme soldats, pour lui prêter main forte contre nous, qu'ils étaient tous décidés à faire entrer et à installer par la force, s'il le fallait, M. McDougall, leur gouverneur. Et M. McDougall ne fut pas si tôt arrivé à Pembina, que ces aventuriers parlèrent hautement de s'emparer de Fort Garry, le siège de nos affaires publiques.\n\nAu reste, ni le gouvernement anglais, ni le gouvernement de la Compagnie de la Baie d'Hudson ne nous avaient annoncé aucun changement. Ni l'un, ni l'autre ne nous parlaient de M.\nMcDougall, ou de son conseil. M. McDougall était donc un ennemi. Nous le repoussâmes le 1er novembre 1869. Et le peuple entraîné dans le Fort Garry, et nous nous mimes à le garder contre les surprises dont il était menacé.\n\nAlors seulement le gouvernement recula devant l'œuvre d'agitation causée par ses empiètements et par les méfaits de ses employés. Il demanda à l'Angleterre de différer l'époque du transfert, alléguant que la Compagnie de la Baie d'Hudson n'avait pas agi loyalement à son égard, vu qu'en vendant tous ses droits de charte au Canada, elle ne l'avait pas averti des troubles qui agitaient son territoire.\n\nMais Lord Granville marqua bien le rôle prématuré que le gouvernement canadien avait commencé à jouer dans le Nord-Ouest. Dans une dépêche du 30 novembre 1869, il dit au gouverneur général que les troubles qui avaient surgi dans ces territoires étaient dus à la conduite même du gouvernement canadien.\n\nEn conséquence de tous ces faits, et depuis que les autorités impériales ont jugé à propos de réprimander ainsi le cabinet d'Ottawa, il a toujours paru étrange au peuple d'Assiniboia de s'étendre dans les documents officiels et autres du Canada, qualifier de population rebelle et égarée, sur l'allégation que nous n'avions pas voulu nous soumettre aux procédés arbitraires du gouvernement canadien.\n\nÀ la date du 17 novembre 1869, et les jours suivants, les prétendus amis du Canada à Winnipeg avaient écrit à M. McDougall qui séjourna à Pembina, pour le déterminer à proclamer sans délai le transfert des territoires du Nord-Ouest au gouvernement canadien. Ils ne s'occupaient pas qu'à la Reine eût opéré ou non ce transfert. Ce qu'ils voulaient, c'était le renversement au plus tôt du gouvernement de la Compagnie de la Baie d'Hudson, et faire établir par n'importe quels moyens, celui de M. McDougall.\n\nLe 16 novembre, le comité national des Métis avait réuni au Fort Garry, dans la maison de la Cour, de toutes les parties du pays, une convention de 24 députés, dont douze parlant l'anglais et douze parlant le français. Le but de cette convention était de s'entendre sur les mesures à prendre pour sauvegarder les intérêts des colons d'Assiniboia, contre les dangers de la situation. Elle avait siégé le 16 et le 17 novembre. Mais le 18 étant un jour marqué par le gouvernement de la Compagnie de la Baie...\nd'Hudson pour tenir les séances trimestrielles de la Cour générale, la convention témoignant tout son respect à l'autorité, prit ajournement jusqu'à ce que la Cour eût clos ses procédés.\n\nCependant le comité national des Métis prit ses précautions pour que nos affaires publiques ne tombassent par une ruse à la merci d'un prétendu lieutenant-gouverneur canadien qui ne prenait ses amis et ses conseils que parmi ceux dont la conduite était ouvertement hostile aux intérêts des Métis et des anciens colons.\n\nLe 24 novembre, le comité national voulut protéger les livres et les argent publics contre le complot que des amis de M. McDougall tramaient pour s'en emparer le 1er décembre. Il envoya ces livres et ces argent d'une forte garde.\n\nM. McDougall se laissa gagner. Et le 1er décembre 1869, il s'arroga le droit de proclamer l'annexion de la terre de Rupert et du Nord-Ouest au Canada.\n\nEt notre gouvernement de la Compagnie de la Baie d'Hudson, déjà tant affaibli par les violences de la lutte que les amis extravagants du Canada et de ses employés lui faisaient depuis une année surtout, M. McDougall s'arrogea aussi le droit d'en proclamer la déchéance... Il se proclama lui-même gouverneur.\n\nEt à toutes ces fausses proclamation, il ajouta une proclamation de guerre ouverte contre nous.\n\nLe Colonel Dennis, maintenant arpenteur général, reçut de M. McDougall, avec sa commission pour faire la guerre, les titres de Lieutenant et de Conservateur de la paix. Ces hommes nous attaquaient injustement, illégalement au nom du gouvernement canadien. Ils ne respiraient que la guerre...\n\nAvons-nous fait guerre pour guerre?\n\nLe Dr. Schultz avec une cinquantaine d'hommes armés se trouva bloqué dans sa maison par le comité national des Métis qui avait à ses ordres 800 hommes. Schultz et la plupart de ses cinquante partisans avaient été regardés depuis quelque temps par nos autorités comme des perturbateurs de la paix publique.\n\nEt ils avaient souvent parlé du projet de chasser les Métis vers les Montagnes Rocheuses, afin de débarrasser les environs du Fort Garry de leur présence. Qu'avons-nous fait de ces hommes quand ils se trouvaient à notre merci? La ville de Winnipeg eut la générosité d'intercéder en leur faveur. Le comité National des\nMétis laissa les assiégés libres de se rendre et se contenta de les emprisonner, après leur avoir accordé la vie à tous. C'était le 7 décembre 1869.\n\nPuis comme nous étions sans gouvernement, exposés à l'anarchie, tout préoccupés du soin de veiller à la conservation de nos vies et de nos propriétés, nous proclamâmes, le 8 décembre, la formation et l'autorité d'un gouvernement provisoire qui rencontra de suite l'approbation et le soutien d'une grande partie du peuple. À raison des conjonctures qui le faisaient naître, ce gouvernement était légal.\n\nVoyons la place qu'il a occupée dans l'estime publique.\n\nHuit jours après qu'il eut été proclamé, l'Honorable Conseil Privé pour le Canada, jugeant des circonstances, disait lui-même que l'existence de ce gouvernement était légale. On peut constater l'exactitude de cette assertion, en lisant le rapport d'un comité du Conseil Privé signé par Sir John A. MacDonald lui-même, en date du 16 décembre 1869, et adressé au bureau des colonies en Angleterre.\n\nDès le mois de janvier 1870, les commissaires canadiens, le Révérend M. J. B. Thibeault et le colonel de Salaberry reconnaissent officiellement notre gouvernement provisoire : ils s'adressèrent directement à lui pour expliquer au peuple les bonnes intentions que le gouvernement canadien les avait chargés de faire connaître de sa part dans la terre de Rupert et le Nord-Ouest. M. D. A. Smith parvint, grâce à un travail lent et difficile, à obtenir quelques jours après, au Fort Garry, une assemblée en masse des habitants du pays. En égard à l'effervescence des diverses opinions politiques, à ce moment là, une réunion aussi générale offrait bien des dangers. Mais comme M. D. A. Smith tenait à avoir cette assemblée, afin d'expliquer lui-même au public ce qu'il avait à lui communiquer de la part du Canada, le gouvernement provisoire se prépara à répondre aux exigences de la situation, et le président du gouvernement fixa le jour et l'heure où le peuple pourrait se réunir pour entendre M. Smith.\n\nL'assemblée eut lieu le 18 janvier et se continua durant deux jours.\n\nPlusieurs fois la guerre civile fut sur le point d'éclater au milieu de cette foule excitée.\nMais, chaque fois, grâce à Dieu, les mesures de précaution adoptées par le gouvernement provisoire réussirent à réprimer tous les désordres.\n\nM. D.A. Smith fut entendu. Et voici en résumé ce qu’il nous annonça en sa qualité de commissaire spécial : “Dans la Confédération, nous dit-il, tous les droits religieux et civils des anciens colons seront scrupuleusement respectés. De plus, la Reine a mandé à son Gouverneur-Général en Canada, advenant le cas où la paix se rétablirait, selon sa volonté expresse, dans les territoires du Nord-Ouest, de couvrir par un pardon général tous les troubles qui venaient malheureusement de se manifester dans cette partie de son empire. En conséquence, le Gouverneur-général du Canada avait formulé une proclamation dans ce sens pour les habitants du Nord-Ouest. Mais constatant que cette proclamation n’était pas arrivée à la connaissance du pays, M. Smith, le commissaire spécial, nous dit qu’il était autorisé à nous avertir de son contenu.\n\nÀ la fin de cette importante assemblée, le président du gouvernement provisoire demanda au peuple d’ordonner une convention de 40 délégués représentant tout le pays, et chargée de prendre en considération ce que M. D.A. Smith venait de nous dire, et de prendre, sur la situation, une décision publique conforme à nos meilleurs intérêts. Le peuple donna une approbation si entière à la demande du président du gouvernement provisoire, que le 25 janvier, étant le jour fixé pour cela, les 40 délégués, après avoir été élus par le peuple, se réunissaient à la maison de la Cour au Fort Garry, afin de remplir leur mission.\n\nLe Président du Gouvernement Provisoire nomma lui-même un Président à cette convention. Et elle discuta pendant plus de quinze jours les conditions de notre entrée dans la Confédération. Elle invita le Révérend J.B. Thibeault, le colonel de Salaberry et Monsieur D.A. Smith, à assister à une de ses séances, afin de recevoir officiellement les communications du Gouvernement Canadien par ces trois messieurs. Ils s’y rendirent tous les trois. Messieurs Thibeault et de Salaberry dirent qu’ils étaient commissionnés de nous assurer de la part du Canada que son Gouvernement n’avait qu’un dessein : celui de nous gouverner en respectant tous nos droits et en administrant les affaires du pays pour la plus grande prospérité de tous ses habitants.\nMonsieur D. A. Smith répéta ce qu'il nous avait déjà dit dans la grande assemblée qui avait eu lieu au Fort Garry.\n\nAvant de prendre congé de la convention, les trois Messieurs invitérent, au nom du Canada, le peuple de la terre de Rupert et du Nord-Ouest à envoyer des délégués à Ottawa pour en venir à une entente amicale. Et au nom de leur gouvernement ils promirent une réception cordiale à nos délégués.\n\nL'invitation ainsi faite au peuple fut acceptée par la convention au nom du peuple.\n\nLe Président du Gouvernement Provisoire ayant appris cela, fit observer à la convention le périlleux état où nous avions plongés les usurpations de Monsieur McDougall, et ayant attiré son attention sur la nécessité où nous étions, pour empêcher l'anarchie, d'affermir le Gouvernement Provisoire qu'une moitié des colons avait proclamé le 8 Décembre 1869, mais auquel l'autre moitié n'avait pas encore donné son adhésion ; et lui ayant fait observer que ce gouvernement réclamait l'appui des citoyens non seulement pour maintenir efficacement la paix, mais encore pour traiter convenablement avec le Canada, la convention consolida par le consentement unanime de tout le peuple qu'elle représentait, l'établissement du Gouvernement Provisoire. Et par un vote spécial, sur les quarante plus de trente de ses membres confirmèrent dans la position du Président du gouvernement celui qui, après Monsieur John Bruce, avait occupé cette charge depuis le 27 Décembre 1869.\n\nMonsieur le Juge Black avait jusque-là présidé aux délibérations de la Convention. Mais immédiatement après ce vote, sur le désir de la convention elle-même, il céda son siège au Président du Gouvernement Provisoire, qui sur le champ nomma Monsieur le Juge Black, le Révérend Monsieur Richeot et Alfred H. Scott délégués à Ottawa, félicita la convention de son patriotisme, la dissout et la congédia.\n\nLe lendemain, 12 Février, le Secrétaire d'Etat du Gouvernement Provisoire, écrivait au Révérend curé de St Norbert la lettre officielle suivante :\nFort-Gary, 12 Février 1870.\n\nReverend J. N. Ritchot, a St. Norbert, E. R. R.\n\nRévérend Monsieur,\n\nJe suis chargé de vous informer que vous avez été nommé par le Président des territoires du Nord-Ouest comme co-commissaire, avec John Black et Alfred H. Scott, Écuyers, pour traiter avec le Gouvernement de la Puissance du Canada les termes d'entrée dans la confédération.\n\nJe suis, Révérend monsieur,\n\nVotre obéissant serviteur\n\nThos. Bunn, Secrétaire.\n\nÀ peine avait-on commencé à respirer la tranquillité, 2 fois 24 heures ne s'étaient pas encore écoulées que les partisans du Dr. Schultz et de M. McDougall firent éclater un soulèvement de 7 à 8 cents hommes.\n\nOn sait que le Dr. Schultz avait été emprisonné le 7 décembre 1869. Mais durant l'élection des 40 représentants à la convention, il s'était échappé le 22 Janvier. Quand il vit qu'il n'avait pu influencer aucune des décisions de la convention, il travailla à détruire son œuvre, en poussant le peuple à renverser le gouvernement Provisoire qu'elle avait achevé d'établir. Ses adhérents se rassemblèrent à St. André, place située sur la Rivière Rouge à 10 milles environ au Nord de Fort Garry. Le 14-15-16 Février, ils restèrent attroupés là, pêle-mêle avec 2 ou 3 cents sauvages, se disposant à marcher sur le Fort-Garry. Dans ce confus assemblage de sauvages et de blancs, il se commit deux meurtres ; celui de l'infortuné Sutherland qui n'avait jamais pris aucune part à nos troubles, et celui de Parisien, un des plus chauds partisans du Dr. Schultz et de M. McDougall. Le camp des amis du Dr. Schultz s'était hâté de répandre dans le pays des courriers portant l'ordre de commencer la guerre sur plusieurs points à la fois, afin de forcer les soldats Métis à abandonner le Fort-Garry et à secourir leurs familles, espérant ainsi prendre aisément possession de la place la plus considérable du pays.\nLe gouvernement provisoire arrêta plusieurs de ces courriers. Quand la nature des dépêches dont ces hommes avaient consenti à se charger fut connue des soldats Métis, ceux-ci, indignés, demandèrent tous, capitaines et soldats, que le plus coupable William Goddy, qui s'était fait le porteur de pareils ordres dans sa propre patrie, fût sur le champ fusillé. Il fut conduit dans un des bastions du Fort pour y être exécuté.\n\nCette attitude des Métis, les bons conseils de beaucoup de citoyens marquants et paisibles, et un avertissement que le Président du gouvernement provisoire adressa lui-même aux révoltés, finirent par en calmer et à en disperser un grand nombre vers le soir du 16 Février.\n\nRevenons à William Goddy. Tout le monde le croyait mort. Mais il était plein de vie, grâce aux officiers généraux, A. D. Lépine et Elzéar Goulet qui, par leurs soins, n'avaient fait que le soustraire à la vindicte publique, en le faisant passer pour mort dans son obscur bastion. C'est ainsi que des nobles coeurs, comme A. D. Lépine, maintenant prisonnier politique à Manitoba, et Elzéar Goulet, qui a été assassiné, en plein jour, au milieu de la ville de Winnipeg, et impunément, peur de temps après l'arrivée du colonel Wolsely et du lieutenant-gouverneur canadien dans notre Province, se plaisaient à traiter leurs ennemis.\n\nDans la matinée du 17 Février, apparut en rase compagnie, à deux milles seulement du Fort Garry, une troupe de 48 hommes armés, à la tête desquels se trouvaient plusieurs des principaux conspirateurs amis du Dr. Schultz.\n\nLépine, adjudant-général, prend avec lui 30 cavaliers, et une centaine de fantassins, et au lieu de rosser cette poignée d'ennemis, il marche droit à eux, leur fait rendre les armes, et les emmène captifs en dedans des murs. Il me semble que c'était une façon généreuse d'exercer les droits de la guerre. La seule vie du major Boulton, chef de la bande, allait payer pour les autres, lorsque M. D. A. Smith demanda au Président du gouvernement provisoire de lui faire grâce. Le Président répondit que, malgré tout encore, Boulton serait infailliblement épargné, si toutes les localités rebelles à l'œuvre de la convention, voulaient définitivement reconnaître et appuyer le gouvernement provisoire.\n\nÀ la suggestion du Président lui-même, dont une des premières ambitions était de rétablir la paix, sans aucune effusion.\nde sang, M. D. A. Smith parcourut toutes les localités révoltées. Et par son influence d'homme de la compagnie de la Baie d'Hudson et de commissaire spécial du gouvernement canadien, il les détermina toutes à soutenir le gouvernement provisoire. Boulton fut sauvé. Comme on le voit, non seulement M. D. A. Smith, employé de la compagnie de la Baie d'Hudson et du Canada, lui-même a reconnu notre gouvernement provisoire, mais encore il a travaillé à le faire reconnaître et appuyer par tout le pays indistinctement.\n\nCette simple narration des principaux faits accomplis durant nos troubles depuis l'automne de 1868 jusqu'à la dernière partie du mois de février 1870, jointe au témoignage de Lord Granville, prouve 1o que le gouvernement canadien a provoqué les troubles qui ont éclaté dans les territoires du Nord-Ouest, à propos du transfert de ces territoires à la Puissance : par conséquent que la responsabilité de ces troubles retombe sur lui seul.\n\n2o. Que ce sont les employés du Canada qui, en amenant peu à peu, en 1869, le gouvernement de la compagnie de la Baie d'Hudson, ont forcé les habitants de ces territoires à se pourvoir d'un gouvernement provisoire dont la légalité est d'autant plus certaine, 1o qu'elle ressort du droit des gens. 2o qu'elle a été admise par l'Honorable Conseil Privé pour le Canada, dans un document officiel du 10 décembre 1869. 3o. Que le gouvernement provisoire lui-même a reçu l'appui de tout le pays, dont il était, après la Couronne, par des circonstances exceptionnelles, devenu la principale sauvegarde. 4o. Que ce même gouvernement provisoire a joui de la reconnaissance officielle des trois commissaires canadiens que j'ai l'honneur de mentionner : MM. D. A. Smith, le Révd. J. B. Thibault et le colonel de Salaberry. 5o. Que ce gouvernement provisoire a été invité officiellement par le Canada à traiter avec son gouvernement pour arrêter amicalement avec lui les conditions de notre entrée dans la Confédération.\n\nM. D. A. Smith, en sa qualité de commissaire spécial, convint même avec le Président du gouvernement provisoire, au Fort Garry, que toutes les dépenses publiques occasionnées au gouvernement provisoire par l'envoi de délégués à Ottawa seraient payées à même le coffre canadien. Et c'est ce qui a été fait.\n\nFort de toutes ces garanties et fort surtout de notre continue\nallégeance à la Couronne, le gouvernement Provisoire se disposait à faire partir vers la fin de février ses délégués pour Ottawa, quand de nouveaux désordres absorbèrent son attention.\n\nLe Dr. Schultz n'avait pas un instant cessé de pousser les sauvages à la guerre contre nous. Un grand nombre des habitants du Portage Laprairie le secondait dans cette œuvre barbare.\n\nLe Portage Laprairie est un établissement, placé sur la Rivière Assiniboine à peu près à 60 milles à l'Ouest du Fort Garry, et dont la plus grande partie de la population est composée d'émigrés d'Ontario.\n\nDans les derniers jours de février, ces hommes prirent avec tous les sauvages du pays, surtout de leurs environs, une attitude si menaçante que les Métis échelonnés sur la Rivière Assiniboine, entre le Fort Garry et le Portage Laprairie, craignaient pour leurs familles que leurs ennemis du Portage parlaient ouvertement de venir massacrer, et pour leurs biens qu'ils menaçaient de brûler dans une descente nocturne, exigeant du Gouvernement Provisoire une protection immédiate. Leurs craintes paraissaient d'autant mieux fondées que lors de la visite de pacification que M. D. A. Smith avait eu la générosité de faire auprès des habitants du Portage, ces gens alors aussi dévoués au Dr. Schultz qu'hostiles aux anciens colons, avaient écrit au Président du Gouvernement Provisoire que pour obtenir la grâce de Boulton, ils se soumettraient, mais qu'ils se soulèveraient encore certainement à la première occasion. Pour la sécurité des citoyens, deux détachements de soldats Métis furent stationnés sur la Rivière Assiniboine, l'un au fort de M. Layne, à 24 milles du Fort Garry, et l'autre à la Baie St. Paul, dix milles plus loin.\n\nCependant, l'audace de nos ennemis encouragés par notre patience était devenue extrême. Elle éclata jusqu'à parmi les prisonniers de guerre que nous avions faits le 17 février, dans l'enceinte même du Fort Garry. Il fallait mettre un terme à tout cela. Il fallait un châtiment pour en imposer aux conspirateurs et aux forcenés.\n\nAu commencement de Décembre 1869, Th. Scott avait été emprisonné au Fort Garry, après que M. McDougall nous eût déclaré la guerre, comme l'un des plus dangereux partisans du Dr. Schultz, de McDougall et de Dennis. Peu de temps après, Scott s'échappa de nos mains, et alla se réfugier au Portage\nLa prairie. Dans le mois de février 1870, au moment même où la convention des 40 délégués consolidait le Gouvernement Provisoire au nom de tout le peuple, Thomas Scott descendait du Portage avec une bande d'hommes armés pour la révolte, et força sur une distance d'à peu près 40 milles, nombre de citoyens paisibles à prendre malgré eux les armes, et à le suivre.\n\nAprès avoir ainsi recruté une centaine d'hommes jusqu'à la paroisse de Headingley qui est située à 15 ou 20 milles à l'Ouest du Fort Garry, sur la rivière Assiniboine, ils poursuivirent leur marche le long de l'Assiniboine jusqu'au Fort Garry. Il n'y avait pas encore deux fois 24 heures que les représentants de tout le pays réunis en convention avaient définitivement établi le Gouvernement Provisoire que Scott révolté contre cette autorité entrait en appareil de guerre dans la ville de Winnipeg. À la tête de sa troupe, il chercha à s'emparer de la personne du Président du Gouvernement, cernant à cet effet une maison où celui-ci avait coutume de se trouver.\n\nMais ne l'y ayant point surpris, ils allèrent rejoindre à St. André le rassemblement tumultueux de sauvages et de blancs aux ordres du Dr. Schultz.\n\nC'est là et par les personnes composant ce rassemblement que furent assassinés les malheureux Sutherland et Parisien.\n\nLe 17 Février, quand Boulton fut pris avec ses 47 hommes les armes à la main, sous les murs du Fort Garry, Scott était encore du nombre.\n\nAinsi capturé pour la seconde fois, Scott, dans sa prison ne laissa pas de se distinguer par la violence de sa conduite qui s'exagéra surtout le 1er Mars. Ce jour-là, Th. Scott et M McLeod forcèrent les portes de leur prison, se ruèrent sur les gardes, invitant leurs compagnons à faire comme eux. Les Métis qui avaient toujours traité leurs prisonniers avec beaucoup d'égards, furent si indignés à la vue de ces outrages qu'ils trainèrent Scott en dehors de l'établissement et allaient l'immoler, lorsqu'un de leurs représentants le déroba à leurs coups. Tous demandèrent que Scott fut traduit devant un conseil de guerre. Pense-t-on que Scott fut livré de suite à la Cour Martiale ? Le Président du Gouvernement Provisoire chercha à éviter cette extrémité en faisant venir Scott devant lui. Il l'invita à se bien rendre compte de sa position, le priant en quelque sorte, quelles que fussent ses\nconvictions, de se taire et de se tenir tranquille dans sa prison ; ainsi, dit le Président, que j'aie cette raison d'empêcher que tu sois traduit devant le conseil de l'Adjutant-Général, comme les soldats Métis le demandent à grands cris.\n\nScott dédaigna tout et persista dans sa mauvaise conduite.\n\nD'heure en heure, on s'attendait à voir surgir de nouveaux troubles. Ces troubles allaient mettre encore en jeu la vie des citoyens ; ils tendaient à entraver le départ de nos délégués. Ils ne pouvaient manquer d'être favorables au Dr Schultz qui, ne pouvant plus demeurer à la Rivière Rouge, se rendit à Ontario pour y soulever les masses contre le gouvernement Provisoire, empêcher nos délégués d'être reçus officiellement par le Gouvernement Canadien et pour tâcher de faire prévaloir à Ottawa une délégation du Nord-Ouest selon son choix.\n\nLe 3 du même mois, nous fîmes comparaître Scott devant un tribunal de guerre. Il fut examiné sous témoignages assermentés, il fut convaincu et condamné à mort.\n\nLe lendemain, 4 mars 1870, cette autorité de gouvernement qui nous avait été provisoirement confiée pour le salut d'une colonie anglaise et dont nous n'avions pendant trois mois de lutte acharnée fait usage que pour désarmer nos ennemis, nous l'exerçâmes enfin dans toute sa sévérité. Scott fut exécuté, parce qu'il le fallait pour faire triompher l'ordre et rem plir ainsi notre devoir en le faisant respecter.\n\nEt maintenant, non-seulement le Canada n'a rien à faire légalement avec cette exécution, mais il n'est pas raisonnable qu'il fasse retomber sur un particulier ce qui est le fait d'un gouvernement, et qu'il traite en vils aventuriers les membres et les officiers d'un gouvernement dont la légalité est certaine, et avec lequel il a lui-même traité au vu et au su de tout le monde pendant presque toute une session du parlement.\n\nQuatre jours après l'exécution de Scott, Sa Grâce Mgr Taché arrivait au milieu de nous.\n\nMandé de Rome, entr'autres par le gouvernement canadien, Monseigneur revenait dans le Nord-Ouest chargé par le Canada de travailler à une véritable entente entre les deux pays.\n\nSa Grâce réitera donc auprès du président du gouvernement provisoire l'invitation du gouvernement canadien d'envoyer des délégués à Ottawa.\nLe pays était redevenu calme. Le 22 mars le gouvernement provisoire expédia ses délégués vers la capitale du Canada.\n\nChaque délégué reçut la lettre de créance que voici :\n\nMonsieur,\n\nLe président du Gouvernement Provisoire d'Assiniboine, en conseil, vous, monsieur……… en compagnie de messieurs……… afin de vous diriger à Ottawa, en Canada, et que là vous placiez devant le gouvernement canadien la liste qui contient les conditions et les propositions sous lesquelles le peuple d'Assiniboia consentirait à entrer en confédération avec les autres provinces du Canada.\n\nSigné ce 22ième jour de Mars, en l'an de Notre Seigneur mil huit cent soixante-dix.\n\nPar ordre\n\nTHOMAS BUNN, Secrétaire,\n\nSiège du Gouvernement, Winnipeg Assiniboia.\n\nÀ l'arrivée de nos délégués à Ottawa, on voit comme Schultz, Mair, Lynch et autres tâchent de les accabler, en soulevant contre eux les préjugés de races et de religions. Le Dr Lynch fut annoncé et poussé en avant comme le véritable délégué du Nord-Ouest. Mais en réalité l'exécution de Scott, en rétablissant la paix, avait privé ces hommes de l'appui qu'ils avaient jusque là trouvé dans nos tribunaux ; et elle avait nullifié leur influence à Ottawa. Aussi le Dr Lynch ne fut point reconnu comme délégué du Nord-Ouest.\n\nAlors, pour se dédommager de la ruine de leurs projets, nos ennemis s'efforcèrent de nous rendre fatale à nous-mêmes l'exécution de Scott, et à cette fin ils ne cessèrent de lui prêter aux yeux de l'opinion publique des circonstances horribles et des motifs injustes. Ils entreprirent de détruire la force morale du gouvernement lui-même, en faisant passer ses membres et ses soutiens pour des rebelles et des usurpateurs, etc., en représentant la mort de Scott comme un meurtre simplement exécutable. Nos délégués furent indignement arrêtés et traînés devant les tribunaux.\nLa promesse que les commissaires canadiens nous avaient donnée au nom de leur gouvernement de les bien recevoir fut foulée aux pieds. Le gouvernement provisoire et ses délégués firent entendre leurs justes réclamations.\n\nL'Angleterre manifesta au gouvernement canadien le mécontentement que lui causait l'arrestation de nos délégués.\n\nD'un autre côté, Sa Grâce Monseigneur Taché n'épargnait aucune fatigue, aucune peine pour faire connaître à tous les bienveillantes intentions de la Couronne à l'égard des habitants du Nord-Ouest.\n\nDurant tous nos troubles nous avions toujours été remplis d'espoir que si nos humbles réclamations arrivaient jusqu'au trône de Sa Majesté, Elle ne nous laisserait pas écraser. Aussi faisons-flotter avec confiance le drapeau britannique au-dessus de nos têtes. La généreuse conduite que l'Angleterre venait en effet de prendre vis-à-vis de nous et les assurances si respectables que notre Archevêque nous donnait au sujet des arrangements que nous ferions avec le Canada, nous engagèrent, nonobstant l'outrage fait à nos délégués, à ne pas changer notre disposition de traiter avec le gouvernement canadien.\n\nSur ces entrefaites, le gouvernement Provisoire avait obtenu l'avantage d'être reconnu sur toute la terre de Rupert et le Nord-Ouest par la compagnie de la Baie d'Hudson elle-même.\n\nEn arrivant à Ottawa nos délégués, malgré les entraves qu'on leur suscita, avaient écrit comme suit au secrétaire d'Etat pour les Provinces, l'Honorable Jos. Howe.\n\nOttawa, 23 avril 1870\n\nÀ l'Honorable Secrétaire d'Etat, etc., Joseph Howe,\n\nMonsieur,\n\nLes soussignés, délégués du Nord-Ouest, désirant retarder le moins possible les affaires de leur mission, ont l'honneur de vous prier de vouloir bien informer le gouvernement de son Excellence, qu'ils désirent être entendus le plus tôt possible.\n\nALFRED H. SCOTT,\nJOHN BLACK,\nJ. N. RITCHOT.\nLe 26 avril l'Honorable Joseph Howe, secrétaire d'État, etc., avait répondu à nos délégués de la manière suivante :\n\nOttawa, 26 avril 1870.\n\nMessieurs,\n\nJe dois accuser réception de votre lettre du 22 courant, annonçant que comme délégués du Nord-Ouest auprès du gouvernement de la Puissance du Canada, vous désireriez avoir le plus tôt possible une audience du gouvernement, et en réponse, j'ai à vous informer que l'Honorable Sir John A. MacDonald et l'Hon. Sir George Étienne Cartier ont été autorisés par le gouvernement à traiter avec vous le sujet de votre mission ; et ils seront prêts à vous recevoir à 11 heures.\n\nJ'ai l'honneur d'être Messieurs\n\nVotre très-obéissant serviteur,\n\nJOSEPH HOWE.\n\nAu Révérend J. N. Ritchot,\nJohn Black, Ecr.,\nA. H. Scott, Ecr.\n\nLes négociations s'ouvrirent à l'heure indiquée entre les délégués du gouvernement canadien et ceux du gouvernement Provisoire.\n\nLa première condition du traité proposée par les délégués du Nord-Ouest a été qu'après les arrangements, une amnistie générale serait de toute nécessité proclamée dans le Nord-Ouest, avant que le Canada ne prenne possession de ces territoires.\" J'ignore si le Canada a jamais pesé sérieusement que cette condition de l'amnistie a été posée par nos délégués et acceptée par les délégués canadiens comme condition sine qua non.\n\nIl est vrai que notre dévouement à la Confédération elle-même l'a dispensé de faire attention à cela. Mais qu'on me permette de le dire, là justice demande qu'il s'en occupe.\n\nJ'ai dit que les délégués du gouvernement canadien accepte-\nrent la condition de l'amnistie. En effet Sir John et Sir George Etienne répondirent à nos délégués qu'il était de la nature même de l'arrangement amical qui avait lieu entre les deux pays, que cette amnistie fut proclamée comme ils la demandaient. Ils ajoutèrent que bien que la proclamation de cette amnistie fût de la prérogative Royale, ils étaient cependant en mesure d'assurer aux délégués du Nord-Ouest qu'elle serait certainement proclamée.\n\nLe très honorables Sir John Young, depuis Lord Lisgar, Sir Clinton Murdoch, délégué à Ottawa par la Couronne pour y faire connaître ses volontés au sujet des difficultés du Nord-Ouest donnèrent aussi péremptoirement à nos délégués l'assurance que cette amnistie serait proclamée, à la satisfaction des habitants du Nord-Ouest.\n\nNéanmoins nos délégués firent remarquer à Son Excellence qu'ils seraient heureux d'avoir par écrit cette promesse d'amnistie. Son Excellence répliqua que la chose ne souffrait aucune difficulté, et que cela serait fait aussitôt que le parlement aurait sanctionné le reste des arrangements.\n\nLes délégués du gouvernement canadien et ceux du gouvernement provisoire rédigèrent ensemble le bill de Manitoba.\n\nPendant ce temps là, le gouvernement impérial jugea à propos d'envoyer des soldats réguliers dans ses territoires du Nord-Ouest. C'était son droit et son devoir. Et nous étions contents de voir enfin arriver les troupes de la métropole pour assumer au milieu de nous les fonctions du gouvernement.\n\nMais quelle ne fut pas notre surprise de voir le Canada s'arroger le droit de nous envoyer aussi une expédition militaire, pendant les difficultés qu'il avait avec nous, et sans avoir conclu avec nous aucun arrangement.\n\nLe Président du gouvernement provisoire se plaignit auprès de Sa Grâce Monseigneur Taché de l'injustice de la conduite et des prétentions du Canada vis-à-vis de nous. Et il déclara à Sa Grâce qu'en autant que l'expédition de Wolseley était canadienne, elle verrait se fermer devant elle les portes du pays aussi longtemps qu'une entente amicale ne serait pas définitivement conclue entre le gouvernement canadien et le gouvernement provisoire,\net tant que nous n’aurions pas les garanties d’une amnistie générale.\n\nMonseigneur condamna de toute son autorité cette attitude de notre part. Mais sur la remarque que nous fîmes à Sa Grâce que nous nous défendions avec justice, Monseigneur, invoquant son pouvoir de commissaire canadien nous dit : “Ne faites pas cela. Je vous donne ma parole d’honneur qu’une amnistie générale sera proclamée avant l’installation d’aucun Lieutenant-Gouverneur canadien ici.”\n\nAu reste le gouvernement impérial avait enjoint au Canada de ne faire partir aucune de ses milices pour le Nord-Ouest, avant que les délégués de ce pays ne fussent satisfaits.\n\nLa Chambre à Ottawa ayant passé l’Acte de Manitoba, nos délégués insistèrent auprès du gouvernement Canadien pour avoir alors par écrit là convention déjà faite au sujet de l’amnistie. Son Excellence le Gouverneur Général répondit qu’elle ne crôyait pas qu’il y eut rien au monde de plus sûr que la parole même d’un représentant de Sa Majesté. Que cette parole, lui-même l’avait engagée en faveur de l’amnistie. Que les habitants du Nord-Ouest auraient cette amnistie, et qu’elle serait rendue dans le Nord-Ouest avant les délégués eux-mêmes.\n\nNos délégués revinrent au Fort Garry le 17 juin 1870. Le 24 du même mois, le Gouvernement Provisoire avant réuni la chambre des représentants du peuple, se fit rendre compte, dans une séance publique, des arrangements faits avec le Canada, par nos délégués.\n\nLe traité se composait de deux choses fort distinctes : 1o de la constitution politique d’une partie considérable des territoires du Nord-Ouest comme Province indépendante dans la Confédération. C’était l’Acte même de Manitoba. 2o du règlement définitif de toutes les difficultés passées par la proclamation, très prochaine d’une amnistie générale qui avait été garantie à notre délégation, comme je viens de le faire connaître.\n\nNous avions fait avec le gouvernement canadien des arrangements si favorables que la Chambre des représentants du Nord Ouest vota sans aucune opposition notre consentement d’entrée dans la confédération. Et le gouvernement provisoire par son Secrétaire d’Etat Thomas Bunn, notifia de ce fait l’hon. Joseph Howe, secrétaire d’Etat pour les provinces. Le document\nportait que nous consentions à nous confédérer avec le Canada, parce que nous avions dans l'acte de Manitoba les principes pour lesquels nous avions combattu, et parce qu'une amnistie générale ne devait pas tarder à être proclamée.\n\nSa Grâce Mgr. Taché porta cette importante pièce officielle aux autorités à Ottawa.\n\nIl faut remarquer ici que déjà le gouverneur Général avait négligé d'accomplir l'assurance qu'il avait donnée à nos délégués que l'amnistie précéderait leur arrivée dans le Nord-Ouest.\n\nCependant le 15 juillet 1870, le transfert de la terre de Rupert et des territoires du Nord-Ouest fut fait au gouvernement Canadien.\n\nPour terminer les arrangements, nos délégués avaient averti les délégués du gouvernement Canadien de faire savoir à leur gouvernement que les membres et les officiers du gouvernement Provisoire voulaient être déchargés de la responsabilité de gouverner, aussitôt après que le transfert aurait été opéré. Mais comme là-dessus, l'Honorable ministre de la Milice et de la Défense, Sir George Étienne Cartier avait insisté auprès de nos délégués en disant : Que Riel et son conseil continuent à maintenir la paix, après le transfert dans Manitoba et le Nord-Ouest, jusqu'à l'arrivée du lieutenant-gouverneur ; nous nous dévouâmes à cette tâche. Depuis le 15 juillet 1870 jusqu'au 24 du mois d'août suivant, nous gouvernâmes dans l'intérêt du Canada sa Province de Manitoba et ses territoires du Nord-Ouest. Cet espace de temps écoulé, le colonel Wolsely arriva au Fort Garry. Au lieu de se présenter amicalement, comme le droit des gens lui en faisait un devoir, son arrivée fut celle d'un ennemi. Le Vice-Président du gouvernement Provisoire, M. F. X. Dauphinais, M. F. X. Pagé et M. Pierre Poitras, deux des représentants du peuple qui, le 24 juin auparavant, avaient voté amicalement en faveur de notre entrée dans la confédération, suivaient paisiblement la route qui mène à leurs demeures. Wolsely les fit arrêter violemment et trainer en prison. L'un deux, P. Poitras, un vieillard, fut maltraité par les soldats du colonel Wolsely jusqu'à recevoir des blessures graves.\n\nAprès avoir ainsi pris possession du Fort Garry que nous avions laissé libre devant le représentant de Sa Majesté, Wolsely, dans un discours public se félicita, lui et ses troupes, d'avoir\nmis en fuite les bandits de Riel. Voilà les expressions dont il se servait pour qualifier le Président du Gouvernement Provisoire et ses soutiens.\n\nQuelques jours plus tard arriva le Lieutenant-Gouverneur Canadien. Mais il ne prit les rênes du gouvernement de notre pays que pour consommer l'acte de perfidie insigne dont le Canada nous faisait les victimes. Il s'installa sans remplir la condition sine qua non de l'amnistie.\n\nAinsi, le gouvernement canadien a rompu dès le commencement le traité solennel qu'il a fait avec le gouvernement Provisoire.\n\nDe plus le gouvernement canadien nous a fait faire des propositions amicales par le Vicaire Général, le révérend J. B. Thibault, par M. le colonel de Salaberry ; et quand eûmes accepté son amnistie, il s'est moqué de nous.\n\nIl s'est moqué des assurances publiques, formelles et spontanées d'amnistie qu'il nous a données, dans le mois de janvier 1870, par la bouche de M. D. A. Smith, maintenant surintendant de l'Honorable Compagnie de la Baie d'Hudson, dans Manitoba et le Nord-Ouest.\n\nIl s'est moqué de sa parole d'honneur qu'il nous a donnée spontanément en faveur d'une amnistie, dans le mois de mai 1870, par la bouche de Sa Grâce, le dévoué archevêque de St. Boniface.\n\nLa confédération canadienne pour Manitoba et le Nord Ouest est donc une supercherie.\n\nIl y a trois ans et demi que cet état de choses existe. Mais les anciens habitants de la terre de Rupert et du Nord-Ouest n'ont jamais cessé de réclamer ce qui leur appartient, ce que le gouvernement canadien leur doit à tant de titres. Et aujourd'hui plus que jamais ils le réclament avec force. Ce que nous demandons, c'est l'amnistie : c'est l'exécution loyale de l'acte de Manitoba. Rien de plus, mais aussi rien de moins.\n\nLOUIS RIEL.\n\nJanvier 1874.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000715.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 25, "total-input-tokens": 35704, "total-output-tokens": 12758, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 241, 3], [241, 241, 4], [241, 2047, 5], [2047, 4313, 6], [4313, 6657, 7], [6657, 8909, 8], [8909, 11084, 9], [11084, 13431, 10], [13431, 15441, 11], [15441, 17306, 12], [17306, 19676, 13], [19676, 22012, 14], [22012, 24346, 15], [24346, 26680, 16], [26680, 28934, 17], [28934, 30767, 18], [30767, 32634, 19], [32634, 34193, 20], [34193, 36341, 21], [36341, 38575, 22], [38575, 40876, 23], [40876, 42648, 24], [42648, 42648, 25]], "primary_language": ["None", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]