[{"id": "57f706c44567b28f43fbc3d8ef511dd13817955f", "text": "NORTH-WEST TERRITORIES:\n\nREPORT OF THE VERY REVEREND J. B. THIBAULT, G.V.\n\n(TRANSLATION.)\n\nST. BONIFACE,\n\n17th March, 1870.\n\nTo the Honorable Mr. Howe,\nSecretary of State.\n\nSIR.—In compliance with instructions furnished to us by the Canadian Government, Lieut.-Col. de Salaberry and myself left Ottawa on the 8th December last for Red River, about midway between Georgetown and Pembina, we met the Honorable William McDougall, who had left the latter place some days previously; and who was on his way to Canada. We immediately handed him the papers which we were directed to give him, and we informed him, in a few words, of the object of our mission, which did not prevent him from continuing his journey.\n\nThe circumstance of his departure changed almost entirely the nature of our mission, which was to endeavour to procure his admission into the country by pacifying the people.\n\nWe nevertheless continued our journey, and arrived at Pembina on the 24th December. We there found the people full of distrust against all persons coming from Canada, in fact, even against us, notwithstanding that they had been for a long time aware of our entire devotion to the interests of the Country. It is probable that orders had been already given to arrest us on the frontier for we had trouble in finding a guide to conduct us to St. Boniface. In view of these manifestations of feeling, and in accordance with the sound advice of Messrs. Cameron and Provencher, we decided that it would be more prudent were Colonel de Salaberry to remain there with all the papers with which the Government had entrusted us, and I to enter alone into the Territory. Accordingly at ten o'clock at night I started on my journey with an employé of the Provisional Government, who accompanied me as far as St. Norbert, where I met President Riel and some of his employees. As I was much fatigued, having travelled night and day in a very uncomfortable vehicle, I obtained permission, but not without difficulty, to sleep at the house of the Curé of St. Norbert, and to present myself the next day. I at once informed the President that I was sent by the Canadian Government with Colonel de Salaberry, and that I wished to know at once whether that honorable gentleman would be permitted to enter Red River. After some moments reflection and in view of the assurance that I gave him that his integrity might be relied on, I was told that he would be sent for, and that he might enter as soon as possible, and accordingly on the 6th January following, I had the pleasure of welcoming\nmy amiable companion. We immediately communicated our instructions to the President and his Council, and they were taken into consideration.\n\nSome days afterwards we were invited to appear before the Council, and the President then said that he was sorry to see that our papers gave us no authority to treat with them, but that they would, at the same time, be very glad to hear us, trusting that we had only good news to tell them.\n\nSince you have done us the honor of hearing us, said we to them, we will commence by telling you that we are in truth the bearers of good news, and we are enabled to assure you that the intentions of the Government who have sent us, are altogether those of peace and goodwill. It desires to respect your persons and your rights, to labor for the improvement of your country, by making a road in order to communicate more easily with Canada, &c., &c., &c.\n\nIt admits that it may have been mistaken in its choice of employees whose extravagant conduct may possibly have compromised it in the Territory, but it strongly condemns the arbitrary acts of such employees as have wantonly abused its confidence.\n\nAt the close of this conference, which lasted some hours, during which we were listened to with much attention and respect, we ventured to take upon ourselves to propose a delegation as being the surest means of arriving most speedily at a conclusion satisfactory to both parties. Then the President, after thanking us very courteously, without indeed giving us any official assurance, gave us to understand that we were likely to arrive at a satisfactory settlement, telling us that he would look into the matter with his Council, which also had seemed well disposed throughout our interview, and that he would give us an answer later. What contributed not a little to inspire us with hope, was the few words which the President whispered to Colonel de Salaberry as he was leaving the Hall. \"Colonel,\" said he, \"don't be in a hurry to leave, I think of charging you with a commission, which cannot but be agreeable to you.\"\n\nSuch was the position of affairs when an unlooked for occurrence not only threw back matters, but even caused us for some time to lose all hope. I shall not undertake to give you in this letter the details of this incident which so nearly kindled a flame throughout the settlement, and perilled for ever the hope of friendly relations between Canada and the Red River. Colonel de Salaberry, who, as well as myself, has seen and heard everything which has been said or done in the Territory since this unhappy occurrence, (which so nearly rendered our mission fruitless), can and will explain to you the causes of our delays, and how we have had to reason with the leaders and with the people; always, however, by conversations with single individuals, as that seemed to me the best, and probably the only, way of effecting any good result. Fortunately, also, almost all persons of much influence sided with us, and if we have been able to arrive at a satisfactory result, it is to the generous efforts and kind assistance of those persons that we owe it.\n\nI think I may say that, now the greatest obstacle in the way of a satisfactory settlement has been removed, and that the people are content to join with Canada, because they believe Canada sincere when she says that she desires their welfare.\n\nColonel de Salaberry's presence here, and the conduct of this honorable gentleman, have not a little contributed to revive our ancient sympathies for the land of our fathers. I constantly hear it said, \"Oh, if Canada had sent us from the first men like this gentleman, we should be satisfied, and should feel that they really loved us and desired our good.\" \"Yes,\" I said, \"you are right, my good friends, but the Government knows all that, and I am satisfied that it is disposed to do everything in its power to content you and make you happy.\"\n\nIt was on the 8th of February that we had the satisfaction of learning that it then decided to treat with Canada, and that the letter herewith enclosed had been addressed us, stating that they had accepted our invitation to send delegates authorized to come to a settlement.\n\nThe Colonel was on the point of leaving with the delegates when we received the gratifying intelligence that the Bishop of St. Boniface would shortly arrive. As we were\naware that his lordship had been commissioned by the Government of Canada, it was decided to await his arrival, and that the delegation, if necessary at all, should not leave until after his return. The Bishop's return has already done much good in the Territory, and peace and tranquility are being generally re-established. As, however, the Bishop had not sufficient authority to arrange matters, the delegates are to leave this on the twenty-first, and the worthy Colonel will place this letter in your hands, with the assurance of the profound respect of\n\nYour very humble Servant,\n\nJ. B. THIBAULT, Pte.\n\nCOURT HOUSE, PENNSYLVANIA,\n8th February, 1870.\n\nMoved by James Ross, seconded by Mr. Reil; and Resolved unanimously, that as the Canadian Commissioners have invited a delegation from this country to confer with the Canadian Government, as to the affairs of this country, and as a cordial reception has been promised to said delegates, be it therefore resolved, that the invitation be accepted and that the same be signified to the Commissioners.\n\nBy order,\n\nW. GOLDWELL, L. SCHMIDT, Secretaries to the Convention.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000609.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 1829, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2558, 2], [2558, 6914, 3], [6914, 8036, 4]], "primary_language": ["None", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]