[{"id": "5cd30c35407df763b11afec7e0259f83f9d2e976", "text": "THE\nHistorical and Scientific Society\nOF MANITOBA\n\nTRANSACTION No. 29. SEASON 1886-7.\n\nSOME\nRED RIVER SETTLEMENT HISTORY\n\nA PAPER READ BEFORE THE SOCIETY APRIL 29TH, 1887\n\nBY\nCHARLES N. BELL, F.R.G.S.,\nHonorary Corresponding Member Buffalo Historical Society, Chicago Academy of Science, Hamilton Association, Scottish Geographical Society, &c.\n\nWINNIPEG:\nPRINTED BY THE CALL PRINTING COMPANY.\n\n1887.\nSOME RED RIVER SETTLEMENT HISTORY.\n\nA paper read before the Manitoba Historical and Scientific Society, April 28th, 1887, by Charles N. Bell, F.R.G.S.\n\nDuring a visit to Ottawa last year I spent some time in the Archives Department, searching among the files of correspondence obtained by the Canadian Government from the Imperial authorities, for information relating to the history of the Red River settlement. With the kind assistance of Mr. D. Brymner, the archivist, I succeeded in finding the original correspondence, or part of it at any rate, that passed between the Hudson's Bay company and the British Government, resulting in the despatch of regular troops to Fort Garry in 1857.\n\nThe Hudson's Bay company, at that date, governed the inhabitants of the Red River settlement, and claimed, over a vast extent of country, the privilege of exclusive trade, etc.; but Canada contested the right of the company to these privileges, and was moving to gain possession of the Northwest, having sent representatives to London for that purpose, and to press on the Imperial Government the claims of Canada as against those of the Company. The occasion was opportune, as the license for the exclusive trading privileges for 20 years in what was termed the Indian territory, granted by the Imperial authorities to the company in 1838, was about expiring.\n\nOn the 5th February, 1857, the British House of Commons ordered \"That a select committee be appointed to consider the state of those British possessions in North America which are under the administration of the Hudson's Bay company, or over which they possess a License of Trade.\"\n\nThe committee included amongst its members such prominent persons as Mr. Gladstone, Mr. Labouchere, Lord John Russell and Lord Stanley.\n\nAs the meetings of this committee were held at a date when some of the correspondence which I have obtained was being carried on, it is thus possible, and very interesting, to compare the different views advanced by interested persons as to why troops ought to have been sent, and why they were sent, to the Red River settlement.\n\nBritish troops had already been stationed at Fort Garry from 1846 to 1848 on account of public demonstrations against the administration of justice by the council of Assiniboia, and of the trouble brewing at the time of the Oregon Treaty. A body of pensioners succeeded the regular troops in 1848.\n\nAs will be seen by the evidence presented later on, the people of Assiniboia were very much discontented, and anxious to attach the colony to Canada.\n\nThis was the state of affairs at the date when the following letter was written:\n\n[Extract of a letter from Sir George Simpson to the secretary of the Hudson's Bay Company, London, Eng., dated at Lachine, 20th October, 1856.]\n\n\"The chief topic of interest in the Red river letters is the arrival at Pembina of a detachment of one hundred United States troops, with the view of making preparations for forming a permanent garrison at St. Joseph's (Pembina) next year, to which end contracts have been made for timber, grain, etc. After having completed these preliminary arrangements, the troops are to go into winter quarters at Fort Snelling, returning to Pembina early next spring. The military occupation of the frontier by the United States is a threat which affects British interests at large, and I trust that a representation on the subject to her Majesty's Government may go far towards inducing them to form at Red river settlement the nucleus of a military force (regulars), which may serve as a counterpoise to the growing influence of the United States in the Northwest Territory.\"\n\nWe see by this letter that Sir George Simpson took the ground that British interests in general were threatened by the presence of American troops at the international line; but we will see further on that while he advanced this view, he at the same time held others in reserve, to use when the occasion offered.\n\nThis letter, addressed to the secretary of the Hudson's Bay Company, in London,\nwas forwarded to Mr. LaLouchere, then Colonial Secretary.\n\nNext in order is the following extract from a letter of John Swanson, to the secretary of the H.B. Co. at London, dated Fort Garry, 6th Oct., 1856, which was forwarded by John Shepherd, Governor of the company, to the Rt. Hon. H. LaLouchere on the 27th Nov., 1856:\n\n\"In the early part of last month a party of American troops, consisting of about 200 men, arrived at Pembina under the command of Colonel Smith, who forwarded me a notice, copy of which I have been pleased to send, prohibiting the inhabitants of the settlement from crossing the boundary line between Great Britain and the United States, for the purpose of hunting the buffalo or trapping furs, etc.\n\nThis notice I expect will not be much attended to by our plain hunters, as they have already departed for their fall hunt, which they intend to make wherever they fall in with the buffalo, whether on British or American territory. I have not been able to learn the object the American Government had in view in sending in this expedition to Pembina, but I rather suspect it was for the purpose of examining the localities for the erection of a distant period of a permanent garrison either at Graham's Point, the head waters of the river, or at Pembina.\"\n\nFollowing is the notice referred to in Mr. Swanson's letter.\n\n\"NOTICE.\n\nTo all whom it may concern:\n\nHeadquarters, Battalion 10th Infantry,\nPembina expedition, camp at St. Joseph's,\nMinnesota Territory, Sept. 3rd, 1856.\n\nThe undersigned, the commanding officer of a military expedition which has started today from Fort Snelling via Lake Winnipeg, has the instructions of the President of the United States to notify such of the inhabitants of the British Possessions as are in the habit of crossing the boundary line between the United States and Great Britain (49th parallel of north latitude) for the purpose of hunting and trapping, etc., on American soil that such operations will no longer be permitted. The undersigned accordingly hereby warns all such persons not to enter the territory of the United States for the above mentioned purpose.\n\n(Signed) C.F. Smith,\nCol. in the U.S. Army,\nCommanding.\"\n\nThat a number of traders and others in Minnesota were anxious that the United States should obtain possession of the Hudson Bay Territories, is well known, and this proclamation may have been issued with the idea that the people of the settlement would agitate for annexation if they found themselves cut off from access to the buffalo country, stretching across the line towards the Missouri, which was a locality annually resorted to by the Red River settlers to procure skins and provisions.\n\nA petition had already gone from some of the inhabitants of Assiniboia to the American Government, as is seen by the recorded evidence of Mr. Isbister before the House of Commons committee in London, on March 5th, 1857, in these questions and answers:\n\nQ.—Is it within your knowledge that any application or complaint was ever made to the Government of America on the subject?\n\nA.—There was a petition addressed by the Red River settlers to the American Government, I believe.\n\nQ.—What is the date of the petition?\n\nA.—It was about 1856, at the time of the excitement connected with the Oregon boundary question.\n\nQ.—What was the general purport of the petition?\n\nA.—I believe that they desired the American Government to annex the Red river territory to the United States, and promised their assistance against the Hudson's Bay Company, in the event of a war. I believe that was the object of it.\n\nSir George Simpson probably had this petition in his mind's eye when advising the quartering of British troops at Fort Garry. The complaints of the people of Assiniboia were embodied in various petitions to the Governments of the United States, Great Britain and Canada. The general form of the petition sent to the Legislative Assembly of Canada, dated in April, 1857, was as follows:\n\nAfter reciting dissatisfaction with the rule of the Hudson's Bay Co; the trouble of procuring deeds for their lands except on such terms as would by their construction reduce them to a state of absolute slavery; the search of their houses for furs by armed police; the breaking open of their trunks by armed constables when on their annual commercial journeys into Minnesota; all furs being confiscated; the interference with persons of aboriginal descent to an extent endangering the peace of the settlement; the people having no voice in the selection of the members of the Legislature; the exclusive system of the company which prevented the inhabitants from devoting their energies to tillage, soil, and other industrial pursuits, the petition closes in these words:\n\n\"As British subjects, we desire that the same liberty and freedom of commerce, as well as security of property, may be granted to us as is enjoyed in all other possessions of the British Crown, which liberty is become essentially necessary to our prosperity and to the tranquility of this colony.\n\n\"We believe that the colony in which we live is a portion of that territory which became attached to the Crown of England by the Treaty of 1763, and that the dominion heretofore exercised by the Hudson's Bay Company is an usurpation antagonistic to civilization and to the best interests of the Canadian people, whose laws being extended to us, will guarantee the enjoyment of those rights and liberties which would leave us nothing to enjoy in the institutions of the neighboring territory.\n\n\"When we contemplate the mighty tide of emigration which has flowed towards the north these six years past and has already filled the valley of the Upper Mississippi with settlers, and which next year will flow over the height of land and fill up the valley of the Red river, is there no danger of being carried away by that flood, and that we may thereby lose our nationality? We love the British...\"\nname! We are proud of that glorious fabric, the British constitution, raised by the wisdom, confirmed and hallowed by the blood of our forefathers.\n\n\"We have represented our grievances to the Imperial Government, but through the chicanery of the company and its false representations we have not been heard, much less have our grievances been redressed. It would seem, therefore, that we have no other choice than the Canadian plotch and printing press, or the American bill and flag of Slave Power.\n\n\"We, therefore, respectfully request formal subjects of the British Crown humbly pray that your honorable House will take into your immediate consideration the subject of this our petition, and that such measures may be devised and adopted as will extend to us the protection of the Canadian Government laws and institutions, and make us equal participants in those rights and liberties enjoyed by British subjects in whatever part of the world they reside.\n\n\"Wherefore, your petitioners will ever pray.\"\n\n(Signed) \"RODERICK KENNEDY.\"\n\nAnd 574 others.\n\nSir George Simpson seems to have had at an early date, a dread of a clashing of the interests of the inhabitants with those of the company, for the Hon. Donald Gunn informs us, in his History of Manitoba, with a knowledge of the facts, he being a resident of the settlement at the time, that Sir George had erected, in 1831-33, the stone walls of Lower Fort Garry as a refuge, in case of an outbreak among the French Metis. It is noticeable that while the French in 1849 assumed a threatening attitude during the Sayer trial and secured his liberation, thus virtually breaking up the monopoly of exclusive trade in furs of the company, that the agitation about 1857 was raised principally by the English-speaking portion of the community.\n\nNext in order in the correspondence, we have what is evidently the answer to a letter of enquiry regarding the nature of the encroachments on the American frontier, which drew forth such a proclamation from the officer commanding the American troops at Pembina.\n\nExtract from a letter from Sir George Simpson to J. Savile Lumley, Esq., dated Lachine, 1st Nov. 1856:\n\n\"In reply to your enquiry as to the nature of the encroachments said to have taken place on the frontier near Red river, from British into American territory, which re-echoed the presence of United States troops at Pembina last winter, I have to state that the transaction reported to me which could bear the name of an encroachment was the annual excursion of parties of Indians and H-16 breeds from Red river settlement to the buffalo hunting grounds in the plain country lying between the Saskatchewan and Missouri rivers, where from time immemorial they have chased those animals every summer the natives of the country, the descendants of the aboriginal tribes whether pure Indians or their half breed children claiming the rights of hunting wild animals over the whole country irrespective of international boundaries. It would be difficult to make these semi-savage people comprehend that hunting on one side of an imaginary line was perfectly legal, whereas the same pursuit on the opposite was a grave offence.\n\n\"But with those encroachments the Hudson's Bay Co. has no connection; they are carried on by the Indians and Cree tribes who make the chase their occupation, living almost entirely on the produce of their hunts, selling any surplus collection of buffalo meat or robes, either to the company at the Red River settlement or to the American traders settled at or near Pembina.\n\nThe American traders complained that the British hunters crossed the international line and carried back with them the produce of their hunts, while the Hudson's Bay Co. secured the furs and provisions, because the traders were not allowed to come in from the American side to barter. In other words the company had entrance to an extensive fur country in the United States, without giving in exchange to the Americans the privilege of trading on British soil.\n\nThen comes the following correspondence:\n\nWar Department, 12th Dec. 1856, from Lord Parmore, secretary, for information of Secretary Labouchere.\n\nLord Parmore had great reluctance in sending troops to isolated posts like Red river, and he suggests that further particulars be obtained from Sir George Simpson as to cause of movement of United States troops.\n\nWar Department, 5th March, 1857. Lord Parmore to Sir Wm. Eyre, Canada, acknowledging receipt of report on state of affairs at Red river, and \"the application which has been made by the Hudson's Bay company for a detachment of troops to be again stationed at Fort Garry.\"\n\nSo anxious was the Hudson's Bay Co. to have troops sent to Fort Garry that their governor in London offered, on behalf of the company, to pay for their transport both ways, and maintenance, \"on account of the existing state of affairs at Fort Garry and its neighborhood.\"\n\nThe American troops having departed from Pembina, after a stay of a month, it could no longer be advanced that \"British interests at large\" were imperilled by their presence, but it seems that other agencies were supposed to be at work, imperilling the company's interests, for we find from other sources that the Canadian Government had despatched an exploring expedition to the Red River settlement that year.\n\nHudson's Bay House,\n23rd March, 1857.\n\nTo Rt. Hon. H. Labouchere, &c., &c.\n\nSir.—As the period for the departure of Sir George Simpson for Canada approaches, I am naturally anxious to obtain your decision on the subject of our application for the assistance of a detachment of military at the Red River settlement.\n\nI have ventured to wait upon the secretary for war, on this subject, and his lordship has given me reason to expect that if I applied on behalf of the Hudson's Bay Co. for a hundred or a hundred and twenty rank and file of the Canadian Rifle corps with a field officer, and the other necessary commissioned officers that he was of the opinion that His Royal Highness the commander in chief would give his consent. It being understood that the Hudson's Bay Co. should defray the expense of the transport of those troops and also afford them free of ex-\nIn the light of the fact that the Canadian Government fitted out exploring parties under S. J. Dawson and Prof. H. Y. Hind in 1837, to examine the country between Lake Superior and the Red River, so that a report would be available on the character of the country, with the state and condition of the Red River settlement lands and people, it is now highly amusing and interesting to read the reasons given by a prominent shareholder of the company as to why troops were required at Fort Garry that year.\n\nIn the report from the select committee of the British House of Commons on the Hudson's Bay Co. in 1837, is the following answer given by the Rt. Hon. E. Ellice, M.P., a large shareholder in the company and who was formerly a shareholder in the old Northwest Co., which, mainly through his efforts, was consolidated with the H. B. Co. in 1820-1821. The answer was given in reply to whether a military force would be required at Red River, in the event of a Crown colony being established there.\n\n\"There has been a military force once or twice sent there at the desire of the Hudson's Bay Co., and latterly they have applied to the Government again. They were threatened with the invasion from Canada of some gentlemen coming in to look after the fur trade. They thought that might excite some disturbances among the half-breeds, and that it might easily extend across the line. There was further danger from disputes and threatened hostilities between the Americans and Indians. It would not be very desirable to leave that part of Her Majesty's dominions without protection under such circumstances. They have therefore lately applied to the Government to send out some troops, which the Government pay, and the H. B. Co. feed.\"\n\nOn the same day (June 23rd, 1857), when asked if the troops then going to the Red River were to be utilized for the preservation of peace, he answered—“Yes, to prevent any alarm about the half-breeds; there have been disturbances in the adjoining territory between the Americans and the Indians; there have been such disturbances in Minnesota; the country has been threatened with war there lately, and we were alarmed that it might extend; the Indians when once engaged, get to war with one another, and they are not even scrupulous as to whom they attack, and it was supposed to be better to be in a state of preparation against any emergency.”\n\nAgain he answered in reply to the question: “When the Queen’s troops were stationed there in the first instance (1846) were not they sent there for the purpose of in some degree allaying the disturbance or excitement which prevailed in the colony in consequence of the half-breeds entering into\ntrade in furs?\"—\"No, I think not especially for that; whenever any excitement takes place, immediately upon that frontier, it extends beyond it; some gentlemen are going in from Canada now, I believe, to endeavor to re-open the trade in furs; the first means which they will have recourse to in order to promote that trade will be to get some of those half-breeds with them; the half-breeds will again enlist some of the Indians; that may lead to disturbances upon the frontier which it is very desirable to have security against.\"\n\n\"Was it to guard against any apprehension of that sort that this provision of troops was made?\"—\"Not on that account, but from the danger which there always is on the frontier from any state of disturbance, from whatever reason, among the Indians.\"\n\nDuring 1857-58, when the Canadian exploring parties were working in the Northwest, an expedition under Captain Palliser was sent out by the Imperial Government to explore the country as far west as the Rocky Mountains, and as well, to ascertain the character of the passes through the mountains to British Columbia, and an exhaustive report was presented to the Royal Geographical Society in 1858 by Sir Bulwer Lytton, Colonial Secretary, who was very anxious to have this country opened up to settlers, either under the care of the Canadian Government, or as a Crown Colony, self-contained.\n\nNeither of the reports made by these exploring parties refer to any disturbances in the Red River country, but the Canadian report deals extensively with the discontent prevailing amongst the inhabitants of the settlement, on account of the management of public affairs by the Hudson's Bay Co. Both parties received every assistance from the Company in the prosecution of their work.\n\nThat the Canadian people had formed an idea as to the Company's object in desiring to have Imperial troops in the Red River settlement, is seen by the evidence given by Mr. McD. Dawson before a committee of the Legislative Assembly of Canada, on the 8th of June, 1857. He said that the troops about to be sent to Red River should not \"carry with them the erroneous views which of late years have been with some success imposed upon the public by the assiduous promulgation of the company, or they may unfortunately be placed in a position of antagonism to the civil power. Better that military rule prevailed entirely, for then the officers would know their duties and their responsibilities. If they go under the impression that they are to be subject to the supposed civil officers of a self constituted government which has no legal existence, they may find themselves called upon to enforce behests which are not law, which are infractions of law; they may be called upon to subdue resistance to illegal acts, to which resistance is a duty and a right; and if for acting on these behests they are ultimately brought before the courts of justice, they will find that they have acted under those whose orders will be treated as a nullity, whose civil offices will be held a mockery. This has been so before; it may be so again, if due precaution be not observed.\"\n\n\"If proper civil officers, magistrates, etc., were appointed by his excellency the Governor General, for the Red river country, to whom alone the troops could look in case of emergencies, as vested with authority, the danger and difficulty would be obviated.\"\n\nHe then referred to the case of Lord Selkirk, who applied, in 1816, to the commander the forces in Canada for a military guard for his personal protection against assassination while journeying from Lake Superior to Red River. The commander-in-chief granted a guard of an officer and 12 soldiers, under the express condition that they were in no way to engage in any disputes between Lord Selkirk and his people, and the employees of the Northwest company, with whom Lord Selkirk was at variance. And yet these soldiers became parties to grave offences by being led with Selkirk and his corps of disbanded soldiers from the same regiment to make arrests of people in the service of the Northwest company.\n\nThis was a specimen of the feeling that had been aroused in Canada over the negotiations between that Government and the home authorities.\n\nThe troops having spent one winter at Fort Garry, we learn in the next letter on file in the Archives Department, the opinion held by the commanding officer, as to the utility of their being stationed there, and the purposes for which the company desired them to be used, while willing to be at the great expense of supplying them with food, and providing for their transport, free of cost, to the Imperial Government.\n\nFORT GARRY, 14th March, 1858.\n\nMajor Seton to officer commanding Royal Canadian rifles, Toronto, writes that he should now officially write what he has already privately done.\n\n\"The subjects are, first, the expediency in a military point of view of stationing any portion of His Majesty's troops in this place. And secondly, such a step should be determined on the necessity or otherwise of the presence of a field officer to command the detachment selected for the service.\n\n\"The first point necessarily involves considerations of political as well as of a purely military kind, and which it is very difficult to settle. But, after careful consideration, also, the conclusion appears to me inevitable that H.M. troops ought not to be quartered in this locality, yet the general circumstances of the country may fairly be taken into\n\"account, in estimating the necessity for so an\n\"extreme and inconvenient a measure. If nev-\n\"ertheless it be contrary to my anticipations\n\"it would be resented on.\n\n\"The distance and isolation of the spot pre-\n\"sent in themselves difficulties and inconven-\n\"iences, so numerous, so great, and so obvious,\n\"that it would be scarcely necessary, or\n\"even possible to enumerate them all, but\n\"when to these is added the inadequate means\n\"of transport and distress possessed by H. M.\n\"Hudson Bay Co., other than the route from\n\"York Factory, or that from Canada, and\n\"which have already resulted in an entire fail-\n\"ure on their part to bring up the necessary\n\"clothing and stores for even the small force\n\"that is here, and would, in case of accident\n\"in any of the perilous raids or portages on\n\"the Red River, be unable without every con-\n\"dition until the month of August next, it can\n\"hardly be desirable to enter into minute detail\n\"to show that nothing short of the most over-\n\"whelming necessity could justify sending\n\"troops here at all.\n\n\"But I am bound to assume that H. M. forces\n\"are not sent to any quarter of the Empire ex-\n\"cept in contemplation of some particular mi-\n\"tary service, in contradiction to mere\n\"police duty and though there is not the\n\"smallest probability of their being called on\n\"to perform either the one or the other in this\n\"place, that fact does not at all testify as to the\n\"fitness of the station, while on the other hand\n\"it is certain, to the best of my judgment that\n\"if it were treated as a military force the\n\"troops could not do so with the faintest pro-\n\"spect of efficiency.\n\n\"The population contains about 1,200 male\n\"adults, nominally resident on the banks of\n\"the Red River, for about 70 miles upward\n\"from its mouth and thinly scattered also\n\"along the banks of Assiniboine to an ex-\n\"tent of many miles. These people, the residents\n\"so called of the settlement, are in reality\n\"more than one half of them absent at great\n\"distances in the interior nearly the whole year\n\"those that remain behind being the elder\n\"and more civilized portion and addicted for\n\"the most part to useful but peaceful attempts\n\"at husbandry. From another portion of the in-\n\"habitants come the traders of the Hudson's Bay Co., or any\n\"one else, any violence to apprehend.\n\n\"The ordinary administration of justice in\n\"small courts, adjusts all differences between\n\"man and man without any attempt, as I am\n\"assured, having ever been made, in the whole\n\"history of the colony, to prevent the execution\n\"of law.\n\n\"The Hudson's Bay Co. have long since\n\"abandoned in practice, their pretension of\n\"exclusive trade in this district and far beyond\n\"it; or even if there was any chance of a col-\n\"lision between the natives of the country\n\"and the people of the company in competing\n\"for furs with the Indians, the nearest point\n\"where such a thing could occur is at so great\n\"a distance as to evade the possibility of\n\"troops, even if they were considered (which I\n\"hardly venture to think would be the case)\n\"that armed interference between rival traders\n\"in the skins of animals were a proper service\n\"for any portion of the British army.\n\n\"The United States have no troops nearer\n\"than Fort Ripley (Crow Wing), a distance of\n\"about 400 miles beyond the frontier (and there\n\"only about 130 men). A small force of about\n\"40 men, I am informed, came to the frontier\n\"nearly two years ago to a place called Pem-\n\"bina (a few small cottages) but an encamp-\n\"ment of less than one month's duration at\n\"this place, resulted in their return to fort\n\"Ripley.\n\n\"As regards the second point which I desire\n\"to bring under notice, namely, the necessity\n\"for the presence of a field officer with the\n\"detachment. I have placed before you as\n\"truly as I can circumstances that will\n\"enable you to form a judgment which I should\n\"hope would not be altogether offensive to any\n\"own. In questioning to be withdrawn I can\n\"sincerely say that I do so not from impatience\n\"of my duty, however painful which Her\n\"Majesty's service may impose, but because\n\"I think it due to my superiors and myself to\n\"believe that when these circumstances are\n\"fully and fairly known, and rightly under-\n\"stood, the detachment of regular troops here\n\"will be withdrawn, and that if any repre-\n\"sentations for the necessity of their remain-\n\"ing even for a time, were to prevail, the pre-\n\"sence of a field officer is wholly superfluous\n\"and unnecessary.\"\n\nI have the to be, sir,\n\nYour most obedient and humble servant,\n\nGEORGE SETON,\nMajor R. C. R.\n\nThis letter was sent to Horse Guards and War Office.\n\nThis epistle from Major Seton was the\nbasis of the remaining letters, which were\nthe last I could find in the archives bearing\ndirectly on the subject.\n\nIt would seem that the Imperial Govern-\nment, to some extent, at least, held the\nviews advanced by Mr. Dawson in July,\n1857, by the caution given to \"the Governor\nand Council of the Hudson's Bay company\nas to the necessity of using great discretion\nin calling off the military for their assist-\nance, and confining such application to cases\nof actual disturbance of the peace.\"\n\nWAR OFFICE,\n22nd Feb., 1858.\n\nSIR.—I am directed by Lord Pamure to\nrequest that you will acquaint Mr. Secy. La-\nbouchere that from a report which has recently\nbeen received from the officers commanding\nthe detachment of the Canadian Rifles now\nstationed in the Red River Settlement His\nLordship has been led to believe that the\nduties for which a force is required there are\nnot of a character which should be performed\nby regular troops. This opinion is shared by\nthe General Commanding-Chief, who, in a\nletter of which I am in possession, expresses,\nhas further stated his belief that from the unpopu-\nlarity of the service the continuance of the de-\ntachment at Fort Garry is likely to influence\nprejudicially the recruiting for the Canadian\nRifle Regiment.\n\nIt would seem that the principal grounds of\ndisturbances in the Territory arise out of\ninfringements of the monopoly of the Hudson's\nBay Co., sometimes by Americans, sometimes\nby Half-Breeds, and occasionally, his Lordship\nunderstands, by Americans alone.\n\nWere regular troops to interfere in cases\nof this kind, and blood be shed, His\nLordship conceives that complications\nmight arise which would be difficult to set\nat rest. His Lordship would therefore suggest\nfor the consideration of Mr. Secretary La-\nbouchere whether armed police under the\ncontrol of the Hudson's Bay Co. would not be\na more suitable force for such a settlement.\nHis Lordship is of the opinion that about 80\nmen would probably be sufficient to preserve\norder and aid the civic power, and he does not\ndoubt that were a proper rate of pay offered,\nvolunteers might be obtained from the conste-\nbles in Ireland.\n\nI have etc.,\n(Signed) H. K. STORRS,\nH. MERIVALE, Esq., (Col. Storrs, K.C.B.)\nEtc., etc.\nWhile agreeing with Col. Storks, Mr. Merivale, under date of 6th March, 1858, states that it would be unfair to the Hudson's Bay company to withdraw the troops, and calls attention to a request of Sir George Simpson that troops were required on account of \"disturbance and discontent\" and the \"stirring up of the people of the Red River settlement in opposition to the civic authorities.\" The assent of Lord Panmure to the measure was therefore given with full knowledge of the particular service which was likely to be required of the detachment.\" He also says that \"as the future government of Red River is a subject of correspondence between H.M. Government and that of Canada he desires no change, but will, however, caution the governor and committee of the Hudson's Bay Company as to the necessity of using great discretion in calling on the military for their assistance, and confining such application to cases of actual disturbance of the peace.\"\n\nExtract from letter of Sir Geo. Simpson to Wm. G. Smith, secretary Hudson's Bay company:\n\nLACHNY (Canada) 5th March, 1858.\n\n\"It is unnecessary to say much in refutation of the conclusion Major Seton has arrived at that troops were wanted at Red River. That they were settled before they were sent. It will be remembered there was a growing sympathy in the past of the Red river half-breeds towards the United States, the Government of which country, with evident design, was bringing its military stations close to the British frontier, at the same time persons from Canada were making every effort to bring resistance to the established rule of the territory, which soon bore fruit, the course of justice having been resisted by force, while lives and property were at the mercy of a semi-barbarous population—these were real, threatening evils, and did not exist merely in the imagination of those members of the company who do not reside in this territory.\"\n\nIt is worth noting that while Sir George Simpson, in 1856, appeared to be so fearful of the presence of United States troops at the frontier (though on two occasions, prior to that date, British troops had been stationed on this side of the international line) nine years later, his successor, Governor Dallas, on receiving a written request from Major Hatch, dated at Pembina, March 4th, 1864, asking for permission to cross the line with his troops, to attack the refugee Sioux Indians, then camped at Poplar Point, sixty miles north of the line, answered immediately, giving full and free permission for the United States soldiers to act on British soil, stipulating only that blood should not be shed in the houses or enclosures of the settlers if the Sioux took refuge in those places. I mention this fact more particularly because it has been denied by some persons that such permission was ever granted. My authority is a copy of each letter, which I possess.\n\nIn conclusion, I draw to your notice the reasons given by different persons regarding the necessity for the presence of troops at Fort Garry. On various occasions we find that it was because \"United States troops were stationed at the frontier,\" \"discontent and disturbance at Red River,\" \"the stirring up of the people in opposition to the civil authorities,\" \"persons from Canada were mischievously employed at Red River inciting resistance to the established rule of the territories,\" \"necessity for the protection of the lives and property of the company's servants and the settlers,\" \"an invasion from Canada of fur traders,\" \"disputes between the Americans and Indians,\" and \"disturbances arising out of the infringements of the company's monopoly.\"\n\nA review of the correspondence, and the evidence given before the select committee in London, together with an acquaintance of the steps taken by the Canadian government, impresses me with the idea, that Sir George Simpson fearing an influx of settlers from Canada following the exploring parties sent out, and of an immigration from Minnesota, seized on the pretext that a small reconnoitering party of American troops had, for the first time, visited the frontier, made a requisition for British troops to support the rule of the Council of Assiniboia (which was the creation of the company) against all comers.\n\nAs negotiations were pending between the Imperial Government and that of Canada regarding the future possession and government of the country west of Lake Superior, the company found considerable difficulty in inducing the Imperial authorities to send out the troops to Fort Garry; but at last the application was so cleverly made, with references to American designs and the likelihood of an Indian war with a general massacre of the white population, together with an offer to provide transport and sustenance for the force, free of all cost to the Government, they consented, and the troops went out.\n\nThe population of Assiniboia had got beyond the control of the company, and the presence of troops was necessary to keep them within bounds until the company, if finally compelled to hand over the country to Canada, could attain a substantial award for their claimed rights under the charter of 1870.\n\nA perusal of the documents published in connection with the transfer, and Ontario boundary disputes, will, I think, convince people that the company saw that the \"day and hour had arrived\" when they must give up possession, at least of the best agricul-\ntural districts, of the Northwest, and it had become after 1837 simply a question with them of securing a good bargain. No person can blame the Governor and council for doing the best possible in the interests of the shareholders.\n\nThere is no doubt but that there was a strong feeling among some of the Red river settlers, in favor of annexation to the United States, as being their only hope of escaping from the rule of the company, as witness the petition of 1864 mentioned above.\n\nLater, in 1861, at the time of the Trent affair, when a war seemed possible, and even probable, between Great Britain and the United States, it is within my own knowledge, from official documentary evidence, that a proposal was made to the American Government, by a then prominent citizen of St. Paul, Minn., to send, in the event of war, a force of 1,000 Minnesota troops to Fort Garry, to secure possession to the whole of British North America west of Lake Superior to the Rocky Mountains which, of course, under the circumstances, would have been a perfectly legitimate act. Accompanying this proposal was a detailed statement concerning the route to be taken by the troops, with a full description of the country and its population, resources and future prospects, while the indifference of the British authorities to the complaints of the Assiniboia settlers was dwelt on as a reason why the inhabitants, \"French, American and Metis,\" would welcome annexation.\n\nInfluential men in Minnesota were fully of the opinion that a change was about to occur in the Governmental system of Assiniboia. They knew it was to be either for Canada or the United States, and they hoped it was for the latter, and were fully prepared to take advantage of any opportunity occurring to seize on what is now the Canadian Northwest.\n\nThe Hudson's Bay Company, as a fur trading corporation, had made a fatal error in first placing settlers on the Red river, and after the retirement of Lord Selkirk, they endeavored to isolate the settlement as far as was possible, but the flood of emigration into Minnesota from 1850 to 1870 rendered this impossible, even without the action taken by the Canadian Government in seeking to obtain possession of the country. The settlers, virtually without a market, contrasted their position with that of their fellows who had abandoned the colony and gone to Canada, and with the new settlers in Minnesota; so that only time was necessary to ripen a movement that would end all control held over them by a close corporation like the Hudson's Bay company.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000534.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 11, "total-input-tokens": 16696, "total-output-tokens": 8857, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 401, 1], [401, 401, 2], [401, 4445, 3], [4445, 10382, 4], [10382, 16586, 5], [16586, 19266, 6], [19266, 24754, 7], [24754, 31609, 8], [31609, 37029, 9], [37029, 39589, 10], [39589, 39589, 11]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false]}}]