[{"id": "6aa661210552d7097c5813fa49feaa61ec0903a9", "text": "RETURN\n\n(110)\n\nTo an ORDER of the HOUSE OF COMMONS, dated 11th March, 1878;—For Report of Surveys made of Lakes Manitoba and Winnipegoosis, the Waterhen River and Little Saskatchewan River.\n\nBy Command.\n\nR. W. SCOTT,\nSecretary of State.\n\nDEPARTMENT OF SECRETARY OF STATE,\n\nOTTAWA, 25th April, 1878.\n\nOTTAWA, 9th Feb., 1874.\n\nSir,—I have the honor to draw your attention to the result of a preliminary survey which I made in November and December last for the purpose of discovering a navigable route from Fort Garry to the Rocky Mountains.\n\nDifferent reports published in 1859 allude to these routes.\n\nAmong other projects then spoken of was to render the Assiniboine and Qu'Appelle Rivers navigable by bringing the south branch of the Saskatchewan into the Qu'Appelle Valley. With a view of studying this idea, I followed the Assiniboine River 140 miles up from Fort Garry, but I am convinced that the works to be performed on this portion alone would be by far too expensive. It was also suggested to use Lake Winnipeg and the River Saskatchewan, but the (Grand Rapid), which interrupts their communication, would need a very expensive canal, built altogether through the rock, which would seem to me a great objection, on account of its heavy cost, and would moreover open a navigation of 260 miles upon Lake Winnipeg, whose surroundings are almost sterile and altogether unfit for colonization and commerce.\n\nI take the liberty to submit to you a project of navigation of which I have made a special study and which seems to me preferable and less expensive than the two others above mentioned. A far more advantageous navigation would be opened by using the following rivers:—Assiniboine, Long Lake, Lake Manitoba, Lake Winnipegoosis and the Saskatchewan, and I am convinced that the sale of lands alone would exceed the cost of canal works, which would consist:—\n\n1st. To improve the River Assiniboine, which must be used for 40 miles. The approximate cost would not exceed $20,000.\n\n2nd. A canal should be constructed to connect the River Assiniboine with Long Lake, there being only 1\\(\\frac{7}{10}\\) feet of difference in the level. The cut to be made through clay would not be considerable.\n\n3rd. The navigation of Long Lake is 3\\(\\frac{1}{2}\\) miles, giving an average depth of from 5 to 15 feet. The Long Lake Creek, 2\\(\\frac{1}{2}\\) miles long, and about 40 feet wide, should be deepened a few feet. At this point, I have two routes to suggest—A and B. A needs only an easy cut of 5\\(\\frac{1}{2}\\) miles through the plain; this cut (as indicated on the map) leads to a gully, which would only require some few feet deepening, and then reaches a deep creek, which leads to Lake Manitoba.\nB commences by a cut of 3½ miles in length (similar to that of A) and leads to a gully of 6 miles, which would need deepening. Between this gully and Portage Creek, half a mile only remains to be cut before reaching Lake Manitoba.\n\n4th. Manitoba Lake offers an easy navigation for 120 miles, and would reach Lake Winnipegoosis by a cut in the plain of two miles.\n\n5th. Lake Winnipegoosis, which is navigable for 100 miles, would join Cedar Lake by a cut of three and a-half miles in the plain.\n\nFrom Cedar Lake, we run up the Saskatchewan, where navigation is so advantageous that the Hudson Bay Company is now constructing two splendid steamers, to run as far as the Rocky Mountains, for the purpose of supplying their forts. It remains for me, Sir, to state that the approximate difference of level between Cedar and Winnipeg Lakes is about sixty feet, and that between the latter and Long Lake, forty feet, on a length of nearly seventy miles.\n\nIt is easy to ascertain that those cuts through the plain would cost very little, and would require but twenty feet of dam works. I further humbly submit that the regular survey, together with the maps and estimates, in connection with this great work, can be completed and submitted to you within two months and a-half from the present date; and before closing, I earnestly recommend this exploration to your favorable consideration.\n\nI have the honor to be, Sir,\nYour most obedient servant,\n\n(Signed) E. P. Bender.\n\nTo the Hon. Alex. Mackenzie,\nMinister of Public Works,\nOttawa.\n\nWINNIPEG, 21st October, 1874.\n\nDear Sir,—I returned on Sunday, after making the inspection of Lakes Manitoba and Winnipegoosis and the River Saskatchewan, from its mouth up to Muddy Lake, in accordance with your instructions to me before leaving Ottawa. I was prevented leaving earlier in the season by the difficulties of procuring transport and matters which required attention here.\n\nI left here on the 3rd September, and returned on the 18th instant, having been absent six weeks and two days; out of this time I was detained in camp, by storms wind sixteen days, but in other respects, the weather was delightful. The first perceptible frost was on the night of the 15th September, when I was encamped on the upper portion of the Waterhen River. On the night of the 10th October we had ice one-quarter inch thick on the pails, and it froze on the ears, in the sunshine, until 10 a.m. next day; but with this exception I have hardly required an overcoat the whole time.\n\nThe prevailing winds, at this time of year, appear to be N.W. and S.E. It blows with great regularity on alternate days from one of these quarters; when from the former, the barometer always falls, and when from the latter, it rises. Storms rise with great suddenness, and in half an hour after they begin to blow, there is a very heavy sea running. The total distance travelled must have been over 800 miles.\n\nFrom here, I went to Oak Point, Lake Manitoba, by wagon, thence to the \"Narrows\" in canoe; from there to \"Mossy Portage\" in a Hudson Bay Co.'s boat, and from there down and up the Saskatchewan, and back to \"Swampy Creek,\" Lake Winnipegoosis, in canoe, then back to Oak Point in Hudson Bay Co.'s boat; the weather being too stormy to venture in a canoe.\n\nI now have to report as follows, dividing the subject into two heads, viz.:\n\n1st. The Country and Timber;\n2nd. The Waters traversed.\nFrom here to Oak Point, a distance of about 65 miles, the road I travelled runs almost in a direct line (N.W.) passing close to the south and west sides of Shoal Lake. For the first twenty miles of the above distance, the country is for the most part open prairie, and the land good; from that point it becomes gradually poorer, being covered in some places by clumps and belts of poplar, of small size. When the neighbourhood of Shoal Lake is reached, the land is very poor, being covered in many places by white saline incrustations, and a great many boulders of moderate size, the subsoil being a yellowish clay and gravel. This may be said to continue all the way to Oak Point, and probably further north; there are, however, some extensive tracts of excellent hay lands in the neighbourhood of Oak Point. As this name implies, there is a good deal of Oak timber in the vicinity, but I did not see any exceeding 6in. diameter, and twenty feet high; in fact, it looked stunted. At this time of year, or during a very dry season, there are only two points, at present, where good water can be obtained between this place and Oak Point; namely, at \"Boyd's Cattle Farm,\" where there is a well of excellent water, with a pump, and at a small fresh-water lake on the south-west side of Shoal Lake. The water of the latter is very brackish; it is not deep, and is said to have no outlet.\n\nFrom Oak Point to Swan Creek, a distance of about 15 miles, along the north shore of Lake Manitoba, the country appears to be of the same character, with an extensive belt of reeds and rushes along the shore, extending a considerable distance into the lake. Little or no timber can be seen.\n\nFrom this point to the Narrows, the country seems to improve, although in some places low and swampy; it is covered by a thick growth of timber, principally poplar of a good size.\n\nAbout the Narrows and the numerous islands in the neighbourhood, there are extensive beds of reeds and rushes, and at its upper end limestone rock, in situ, appears for the first time.\n\nI believe there will be no serious difficulty in the way of carrying the railway in a direct line from the Narrows to the crossing of the great Bog, except at two points, Dog Lake, near the Narrows, and Shoal Lake, near this end.\n\nFrom the Narrows to the crossing of Mossy River, the country is generally dry; there is, however, some swamps in the neighbourhood of Ebb and Flow Lake. It is well timbered with poplar, some spruce and a few tamarac. There are excellent grass lands on the west side of Lake Manitoba.\n\nFrom the Narrows to Waterhen River, at the head of the lake, the shores as seen from the water, are higher than on the lower portion, and appear throughout to be well timbered.\n\nThere is a considerable quantity of spruce of fair quality and good size to be found on the lower half of the Waterhen River, on the upper portion of the river, from Lake Winnipegoosis to Waterhen Lake; and at its mouth in Lake Manitoba there is a vast area of reeds and rushes.\n\nThe country around Lake Winnipegoosis is all thickly wooded with poplar, tamarac, elm and oak. The soil seems to be of fair quality, but higher and more sandy than the prairies. Limestone rock, in situ, is found at various points round the shores of the lake.\n\nIn the neighbourhood of Mossy River the land is good, and limestone rock is visible at the point where I think the railway will cross. When proceeding westward along the line or railway (as explored) from Mossy River, a portion of the country in the vicinity of the south-west side of Lake Winnipegoosis, is swampy but not to such an extent as to create any serious difficulty in constructing the line. As you approach and pass round the north-eastern end of the Duck Mountains, the land improves and there is very fine timber. In the valley of the Swan River, there is some magnificent land, unsurpassed by any within this Province.\n\nPieces of lignite of first-class quality have been found in the river and some of its tributaries this summer by members of the Geological Staff; but they did not succeed in finding the place from which they had been carried by the stream. I am informed that the country in the neighbourhood of Dauphine Lake is very fine.\nI visited the place on Red Deer Point, Lake Winnipegoosis, marked \"Salt works\" on the map. It is a most desolate looking spot, there being no vegetation in the neighborhood of the place where the salt is produced. The neck of land is quite level and but little above the surface of the lake. The brine issues with considerable force from some natural holes in the ground, like a spring, but I am informed that by digging wells in its vicinity, brine of greater strength is procured.\n\nThe method employed to make the salt is very crude, and the extent to which it is manufactured small; there are a few wrought iron pans of a rectangular form, about four feet long, two feet six inches wide and fifteen inches deep; in these the brine is placed, and a fire being lighted beneath, the water is evaporated and the salt remains. —As the brine is not kept in motion while being evaporated, the crystals of salt are very coarse, and being evaporated to dryness, the salt is not very pure, although of a good colour. When made, it is packed in baskets of birch bark and sent to Winnipeg. It is now owned and occasionally worked by the Hon. J. McKay, when the price of salt is high. There is no doubt however that when the demand for salt is greater and as the country gets more settled, the Railway passing in the neighbourhood, that a good business can be done in it.\n\nThe southern end of the Mossy Portage and the country around is heavily timbered with poplar, spruce, tamarac, and balsam, of a very good size; for half a mile at the north end, the ground is low and swampy and the cedar which is seen on the shores of Cedar Lake is very small; all the S.E. and E. shore has been completely swept by fire some time ago, and as seen from the water has the appearance of a Prairie. The ridge of land which divides Cedar from Winnipegoosis Lake continues almost at a dead level, all the way to the Grand Rapids of the Saskatchewan.\n\nThe country on both sides of the river, from Cedar Lake down to its mouth, seems of indifferent quality. Limestone rock is visible at many points, but there are some tracts of good land. It is all thickly wooded. From Cedar Lake upwards, as far as I went (to Muddy Lake), limestone rock is visible at several points on the south bank. At these places the banks are from six to ten feet above the water and covered with poplar, spruce, &c. The intervening spaces are extensive swamps. The northern side seems low and swampy, and the river is divided into numerous channels by large islands of reeds and rushes.\n\n2nd. The waters traversed.\n\nThere is very considerable inaccuracy in the general form and position of Winnipegoosis and Cedar Lakes; and the Saskatchewan River, from Cross Lake to its mouth, is not nearly so straight as is shown on the maps.\n\nI herewith enclose a sketch map which I have made from notes taken on my trip, which, although not professing to be perfectly accurate, is more like them.\n\nThe map of Manitoba Lake, which we purchased from Mr. Waggoner last spring, seems generally accurate, although many details of the shore line are wanting, and there are a great number of islands in the lake which are entirely omitted. Manitoba Lake is generally very shallow, especially that portion of it south of the Narrows. I believe the greatest depth found is about 20 feet, and to obtain 4 or 5 feet of water a considerable distance from the shore must be traversed along the coast that I have visited.\n\nThe northern portion is rather better in this respect, but both in it and the southern, there are a great number of reefs of boulders; some parts of these are a few feet above water, others just awash, while others again are a short distance below the surface. A careful survey of the lake would, therefore, be necessary before it could be safely navigated.\n\nThe waters of the lake are subject to considerable fluctuations; apart from high or low water, a northern wind will raise the water at the southern end 1 to 2 feet and vice versa. There is at such times a very strong current either up or down through the \"Narrows.\"\n\nThe Hudson Bay Company's officer at Manitoba House informed me that during the time a stormy west wind was blowing, the water receded 100 feet from the end of\ntheir wharf, where at ordinary times there is about 18 inches of water, leaving the bottom dry to that extent.\n\nIn the vicinity of \"Meadow Portage,\" the water of the lake is shallow for a considerable distance out from the shore, and this remark applies to even a greater extent to the water of Winnipegoosis at the other end of the portage, so that the construction of locks and a canal in that neighbourhood would be a costly undertaking.\n\nThe upper portion of the Waterhen River could be rendered navigable for steamers of the class which navigate Red River on the Saskatchewan, at a moderate expense, but when it flows into Waterhen Lake the work would be much more costly. From there down to Lake Manitoba, in which portion of the river most of the fall occurs, I do not think could be rendered navigable by the removal of boulders and stones in the existing rapids, as this would only have a tendency to lower the water at other points; to attempt to render it navigable by dams, locks, &c., would, if practicable—which I much doubt—be a costly undertaking.\n\nThe direction of the wind has a great effect on the level of water in the river. Lake Winnipegoosis is considerably deeper than Manitoba, still there are some places where it is shallow for a considerable distance from the shore. This is the case at Mossy Portage. At the southern end, where Mossy River empties into it, and in that river as far up as the railway crossing, there is plenty of water.\n\nThe remarks which I made in reference to reefs and boulders in Lake Manitoba, applies also to this lake, but they are not so numerous. I have already remarked about the storms.\n\nBefore passing to the waters of the Saskatchewan, I will report on the possibility of forming a connection between them and Lake Winnipegoosis. Up to the present time, it was supposed that the Mossy Portage would prove the best place for the purpose, but in addition to the disadvantage of the shoal water at its southern end, the amount of excavation would form a most serious item. As you are already in possession of the details in reference to it, I shall only add that I think it very probable rock would be found in making the excavation, before the requisite depth was reached. In addition to this, both ends of the portage are very much exposed, the southern end to gales from east by south-east round to west by south-west, and the northern from north-west by north round to north-east.\n\nI found two other points, either of which would, I believe, prove better locations for the proposed canal. They are marked respectively A and B in the accompanying sketch map, and are being surveyed by Mr. Bender.\n\nAt the line marked A, the water is deeper at both ends than at Mossy Portage, the height of land to be crossed is some 40 feet lower, and the length of the cutting will probably prove a mile less. It is much better sheltered at the southern end.\n\nAt the line marked B, advantage could be taken of a portion of \"Swampy Creek,\" which is about 60 feet wide, and has a depth of water ranging from 7 to 9 feet for a distance of from 2 to 3 miles from its mouth, and has little or no current.\n\nThis line would be longer than at A, from water to water, but it is believed that the whole intervening space is wet swamp which might be excavated by means of a steam dredge, and as its northern end would be in the Saskatchewan River, the storms in Cedar Lake would be avoided, and the line westward would be more direct than in the other case. It is, however, impossible to express a satisfactory opinion on the respective merits of the two routes until the surveys are made.\n\nIt has been assumed up to the present time that the level of Winnipegoosis and Cedar Lakes are the same. Now, although this may be the case at certain stages of the water in each, yet, as the Saskatchewan is subject to considerable fluctuation in level (from 3 to 6 feet) between high and low water, and the Winnipegoosis is also subject to considerable fluctuation, although not to so great an extent, and arising from different causes, it may so happen that at times the water in Cedar Lake will be higher than in Winnipegoosis, and at others that the difference in level will be reversed. This may possibly necessitate the construction of a lock with double gates,\nwhich, when the waters are level, could be kept open. The outlet of Cedar Lake is a short distance north of the point marked C on the accompanying map. Here the river may be said to commence, and from this point down to its mouth there is no point on the river where the current in the centre flows at a less velocity than from three to four miles an hour.\n\nLeaving the Grand Rapids out of the question altogether, there are six places, three of them heavy rapids, where the current must range from six to nine miles an hour. At two points the steamboat cannot get up without the aid of a strong cable, made fast on shore, which is wound up by steam power on the boat, while, at the same time, her wheel is left going full speed. These points are in the Red Rock and Cross Lake rapids. I do not think the company would attempt to run their steamboat on the portion of the river under consideration, were it not for the great cost of transport (by teams) between the points referred to.\n\nIt is, of course, true that the thing may be worked as at present for some time to come, but, as a permanency, it would never answer. With this object in view, a road or tramway could be built from the steamboat landing, below the Grand Rapids, to the steamboat landing above, at a moderate expense, as there are no engineering difficulties in the way; but, to make the Lake Winnipeg and Saskatchewan River a good route, either a canal or a railway would have to be built around the whole of that part of the river under consideration. The former would cost a great amount of money; the latter would not, I believe, entail great expense.\n\nFor the railway, the south side of the river would prove the best, as I am informed that there is a comparatively level ridge extending the whole distance, while on the north side, the country is much broken up and the northern end of Cross Lake extends much further north than is shown on existing maps. The probable length of the line, on the route proposed, would be between fifteen and twenty miles.\n\nI might here mention that I think the fall between Cedar and Winnipeg Lakes has been underestimated, probably from five to ten feet.\n\nIf, however, the connection between Lake Winnipegoosis and the Saskatchewan can be made at anything like a reasonable expense, it appears to me that will be the best route to follow for several reasons, among which are the following:—\n\nThe mouth of the Saskatchewan is blocked by ice in spring to such an extent that its upper portion and Lakes Winnipegoosis and Manitoba are open from a fortnight to a month before it.\n\nThe railway passing a navigable point at the southern end of Winnipegoosis, goods could only require one transhipment.\n\nThe water portion of the route, on this line, would be much better sheltered than on the other.\n\nThe cost of constructing the piece of railway between the mouth of Saskatchewan and Cedar Lake would go some way towards making the line to Winnipegoosis.\n\nI remain, Dear Sir,\n\nYours truly,\n\n(Signed) JAMES H. ROWAN.\n\nSANDFORD FLEMING, Esq.,\nEngineer-in-Chief, Canadian Pacific Railway.\n\nREPORT ON THE TRACK SURVEY OF THE WATERHEN RIVER.\n\n20th March, 1874.\n\nThe Waterhen River, properly speaking, is not one river, but two. The first or \"North Branch\" flows from Lake Winnipegoosis in a north-easterly direction, and falls into a large open sheet of water about seven miles long by five broad, known as the\nWaterhen Lake. The second or \"South Branch\" flows in a south-westerly direction from Waterhen Lake and falls into Lake Manitoba. The total length of the waterway connection is thirty miles, and the total fall 1872 feet.\n\nAt the head of the river, Lake Winnipegoosis forms itself into a long narrow reach of water, free from obstruction to navigation, except at one point—about seven and one-quarter miles (see Plan 2) from the head of the river, where the lake is scarcely three miles wide—there is an island two and one-half miles by three and one-quarter miles in the middle of the bay; on the left of this island the lake is shoal and filled with reeds, but on the right a depth of from six to eight feet may be obtained. From this to head of river eight to ten feet may be obtained. At the head of the river, one sounding gave five feet six inches on a soft muddy bottom, with this exception, the soundings throughout the entire length were deep, a few were six feet and several seventeen feet and over. The bed of the stream is as a rule muddy, but in some few places sand and stones may be found. The banks on both sides all the way up to the Waterhen Lake are low and marshy; timber, small birch and tamarac grows at some ten to twenty chains off.\n\nThe dotted red line on plan shows the deepest channel.\n\nAbout one and a half miles from Waterhen Lake, a shallow cross channel connects the North Branch with the Inner River, a shallow stream flowing from Lake Winnipegoosis into Waterhen Lake.\n\nThe general rise of the current is three miles per hour; general breadth from eight to ten chains.\n\nThe entire northing is nine and one-quarter miles, and eastings two and one-eighth miles.\n\nThe Waterhen Lake is naturally shoal, its bed being simply a small valley very nearly on the level of the bed of the North Branch, the bottom is covered over with large boulders scattered about in every direction. The bed is a stiff clay. The dotted red line shows the shortest and most uniformly deep channel to be obtained. The depth in clay in 1872, was three feet. Hudson Bay men state that in 1871 there was only two feet, and that it has been as low as one foot six inches. This latter, I am of opinion, is an extreme one, and could only have occurred much nearer the shore than my line. In general, I think that three feet and often four feet (when a north wind blows over Lake Winnipegoosis) and seldom less than two feet six inches and never less than two feet may be obtained by this passage; under any condition, the passage by this route is unsafe.\n\nFurther out in the lake than my line, water ten feet deep may be occasionally found, but there is no continued channel, shoals surmounted with large boulders occurring in every direction.\n\nFrom the lake to the Forks (see Plan 2) the depth of this branch fluctuates very much. It starts with a depth of seventeen feet, but this soon shoals down to five feet at two and one-quarter miles down. It increases again to nine feet and then shoals to four feet at four and one-eighth miles down. From this point it continues varying from twelve to four feet. In one particular place, about twelve miles down, the depth was only three feet. This sounding occurred between soundings of six feet, and probably was occasioned by my going out of the channel.\n\nThe rapids, which take place at seven and three-quarter, have a depth of seven feet over their crests and, except in the velocity of current, offer no obstruction to navigation. The bed of the river is, for the most part, strong, and in general free from boulders. In some places, however, these occur and greatly impede navigation. Below the Forks the bottom is of a soft muddy nature.\n\nThe banks are, in general, low, varying from two to four feet high, and timbered on both sides with small poplar, spruce and tamarac. This timber is not good for much. Some twelve inch tamaracs may be obtained. Below the Forks there is no timber; the banks are low and marshy. The general rate of current is from three to four miles per hour. At the rapids mentioned previously it is as strong as six miles per hour.\n\nThe general breadth is from eight to ten chains. At the head it is nearly forty\nAt the Forks the river divides into two branches, the one at the left (down stream) being the one generally used by Hudson Bay men. The one on the right, an uncharted channel, is much the better of the two, being straighter and deeper than the boat channel; its general depth is four feet bottom muddy. The river here diverges into three channels, each communicating with Lake Manitoba. The centre one of the three is the best. Nowhere does the depth go below four feet while it often is as high as nine feet.\n\nThe coast line of Lake Manitoba, at the Delta of the Waterhen River, is very nearly a uniform curve of four miles radius. The land is low and flat, all arable. Navigation to the mouth of the Waterhen is uninterrupted. By keeping to the south of the \"Two Islands,\" near the mouth, a depth of six feet and over may be obtained.\n\n**ESTIMATED IMPROVEMENTS**\n\nTo insure a constant depth of three feet (see instructions) throughout the Waterhen River, it will be necessary to excavate to a depth of five feet below present level. A base of one hundred feet will be necessary for safe navigation.\n\n| Description                                      | Quantity | Rate | Amount |\n|--------------------------------------------------|----------|------|--------|\n| Dredging in Waterhen Lake                        |          |      |        |\n| Pier in Waterhen Lake, 200 ft. x 20 ft. x 10 ft. |          |      |        |\n| Dredging South Branch                            |          |      |        |\n| \"Dam at the 'Little Forks,' 330 ft. x 20 ft. (at the top end 30 ft. at the bottom) x 10 ft.\" |          |      |        |\n| Contingencies 10 per cent                        |          |      |        |\n| **Total**                                        |          |      | $44,000.00 |\n\n*This dam is intended to shut up one channel, and thereby throw all the water of the river into the other.*\n\n(Signed) HENRY B. SMITH,\nEngineer in Charge.\n\n---\n\n**REPORT ON THE PROPOSED SITE OF HARBORS FOR LAKE MANITOBA.**\n\n(March 20, 1874.)\n\nThe coast line of Lake Manitoba, north of township thirteen, range six, west, is almost a regular segment of a circle. A rugged broken sand bank varying in height from four to ten feet, with a narrow strip of low shelving sandy beach on the north side, and from one to three chains of loam (three to six feet) covered soil on the south, serves to keep back the waters of the lake. This bank is, however, broken in several places by horse-shoe bends (with their entrances towards the lake, which, as they are only four feet above the lake's level, must often admit the waters of the lake into the marsh beyond.\n\nThe sand bank ranges from forty to ninety feet in breadth, and in some places it splits into two, standing side by side. The nature of the bank is, in general, clear sharp sand, unmixed, as far as I could see, with foreign substances, such as boulders,\nIndeed, throughout its entire length I did not observe the single stone larger than a pigeon's egg. The beach is made up of three feet of fine white sand; and beneath, a layer of gravel.\n\n**Lake Manitoba:**\n\nLake Manitoba presents, at this point, to the eye an unbroken reach of water—no islands, no rocks. The beach runs out into the lake with a long gentle slope, so gently that at a distance of ten chains a line might be drawn parallel to the curve of the shore, and show only a depth of three feet at twenty chains; the average depth would not exceed four feet six inches. While at thirty chains seven feet and upwards might be obtained; at thirty chains the bottom is of clean sandy sand.\n\nOpen channel at north-east end. At five miles from camp station (see Plan No. 6) begins a fine open channel fourteen chains broad, connecting the lake and the marsh. At twenty-four chains out in Lake Manitoba a depth of ten feet on a bottom of firm compact sand may be obtained. At the mouth of the channel the depth is five feet, and throughout its entire length of twenty chains the soundings fluctuate between one foot three inches and three feet. The banks are soft and muddy; their general nature seems to be twelve inches white sand and clay; nine inches decayed roots and leaves; three feet six inches clay mixed with sand, clay and sand and water.\n\nFirst open sheet of water passing out of this channel, we strike on a large sheet of open water 130 chains by 120 chains, of a circular form. Just at the end of the channel there are several shoals, and an extremely shallow depth of water; the general depth of this lakelet may be safely taken at six feet. The boundary is entirely made up of reeds, standing six feet high, and preventing a landing at any point, except at its southern end, here there is good firm soil.\n\nThe channel running into the marsh from its north-western extremity is a fine open one, but only three feet deep and seventy feet broad at the south-west corner of the first lakelet; there is a channel connecting with the second lakelet to the southwest.\n\nThe general depth may be taken at eight feet, though ten feet and over is not uncommon sounding. Banks are firm but covered with reeds. The bottom is a little mud.\n\n**Second Basin or Lakelet:**\n\nThis lakelet is roughly 60 chains by 100 chains, and its average depth six feet, on a soft muddy bottom. The boundary, like the former, is made up of reeds six feet high. Traces of firm land may be found near its southern boundary.\n\n**Third Lakelet:**\n\nNo connected channel with the second or third lakelets could be found. A passage through the reedy islands had to be made. Amongst these islands, the depth varied from three to five feet. The passage is difficult and very uncertain. The third lakelet is in the form of a T. The greatest dimensions of the lower part are 100 chains by 70 chains, and the mean depth six feet; at the contraction of the lakelet one sounding reached four feet. The remaining part of the lakelet is six feet deep uninterrupted by shoals. The boundary is made up of tall reeds. The bottom is of soft mud.\n\n**Fourth Lakelet:**\n\nAn entrance into the fourth lakelet may be made by a passage through the Reedy Islands at the north-west extremity of the former. The depth to be obtained is from three to four feet six inches.\n\nThe fourth lakelet is oblong shaped 110 chains by 45 chains to 70 chains. Its average depth lengthwise and crosswise is six feet six inches on a soft muddy bottom. Its boundary is irregular; many openings into the marsh may be made on all sides. Near its north-easterly extremity, a winding channel, one mile long, 70 to\nThere are several entrances into this lakelet from the lagoon. The narrowest opening is four feet six inches deep and twenty chains long. The lakelet is not deep; it is thirty chains long and eighty chains broad at the east end, and the west sixty chains. The general depth is seven feet.\n\nSixth Lakelet.\n\nThe entrance into this lakelet is open, and from two to six feet deep. This lakelet (which is known as Portage Creek Lakelet) is thirty chains broad by 120 chains long. A clear depth of seven feet may be easily obtained. Its bottom, like the former ones, is muddy, and its bottomless mud.\n\nSouth-Western Channel.\n\nAt the chains west of Camp Station occurs the second channel between Lake Manitoba and the marsh. At the point where it passes over the beach it is a mere till a few inches deep, but at ten chains from the lake it becomes a fine open channel, seventy feet broad, and from three to six feet deep. Where it detaches into the marsh it is only two feet six inches deep. A passage from this point to one of the open lakelets is easy.\n\nGeneral Remarks on the Marsh.\n\nIn all open sheets of water a depth of from six to seven feet may be obtained, and in their connecting channels from three to five feet. The bottom, in all cases, soft mud. The boundaries are obtained by anchoring the boat in the middle of each lakelet and drawing a rude approximation to their outline by joining the various points. The most eastern lakelet is the only one from which a landing can be made on the south of the marsh. A distance of a few chains through the marsh will bring one to open meadow land, and then to fine rolling prairie. A landing on the sand bank is a very serious undertaking. Parties have been known to be two entire days searching out a passage among the reeds.\n\nPortage Creek.\n\nAt its mouth, Portage Creek is concealed from view by rocky islands, the greatest depth of water being five feet six inches. The depth continues at from two to six feet up to the middle of section 29, where it becomes three feet six inches. From this it gradually lowers down to two feet six inches, opposite Green's house, and then it gradually lessens till we reach the \"head of water,\" some seven and three-quarter miles from open water in marsh.\n\nThe general nature of the bottom is a very soft mud, two feet deep; beneath this, sand and clay adhering very closely together. Beneath this again, according to the accounts of those who have dug wells in the vicinity, lies a very thick layer of sand. The general breadth of the creek, from the mouth to Green's house, varies from five to eight chains; from Green's house it gradually tapers away into a mere nothing.\n\nThe banks up to Green's house are low and flat, scarcely two feet above the creek's level, and covered with reeds. From Green's house to head of water they range from three to six feet. There is no current in this creek, except what is caused by the wind forcing in or driving out water.\n\nVery few trees grow on its banks; such as there are all, grow on the banks at the southern end, and consist for the most part of dwarf oak, a few inches in diameter.\n**ADDITIONAL REMARKS ON COST.**\n\nThere will be saved by not using the angle of the lake which lies between the mouth of Portage Creek and the Assiniboine River, diverting from a point 300 feet above and at least 100 feet below the mouth of Portage Creek, and proceeding in a straight line westward, reaching Portage Creek at the mouth of the river, thus saving the cost of constructing the dam.\n\nThe dam will be constructed of stone, and will be about 10 feet high and 50 feet long. It will be built in sections, each section being about 10 feet wide and 5 feet high. The dam will be completed in about six months.\n\nThe proposed improvements include an entrance into Portage Creek, and the dam constructed to the Assiniboine River, the following is the approximate cost:\n\n| Description                                      | Quantity | Rate | Amount |\n|--------------------------------------------------|----------|------|--------|\n| Breeding in Lake Manitoba                        | 14,600   | 60   | $876,000 |\n| Out through sand bank                            | 16,800   | 60   | $1,008,000 |\n| Out through marsh to open water                  | 11,840   | 25   | $296,000 |\n| Pier in Lake Manitoba, 200 ft. x 20 ft. x 10 ft. | 40,000   | 10   | $400,000 |\n| Breeding Portage Creek                           | 140,000  | 40   | $5,600,000 |\n| Excavation around pier                            | 1,000     | 60   | $60,000 |\n| Lockage of 10 ft., including water, &c., at $2,000 per ft. of lift | 24,000   | 11   | $264,000 |\n| Pier in Assiniboine River, 100 ft. x 20 ft. x 8 ft. | 100       | 10   | $1,000 |\n\nContingencies 10 per cent.\n\nTotal $9,841,000\nREPORT ON THE TRACK SURVEY OF THE LITTLE SASKATCHEWAN AND PARTRIDGE CROP\nHENRY B. SMITH, ENGINEER IN CHARGE.\n\n(To accompany Plan No. 4.)\n\nOTTAWA, 20th March, 1874.\n\nBetween the great lakes, Winnipeg and Manitoba, there is only one known waterway connection, namely, the outlet which the surplus waters of the former lake find through the channel of the Partridge Crops, or Fairford River, into St. Martin's Lake, and thence westward by the Little Saskatchewan or Danphin River into Lake Winnipeg, a total distance of some 68 miles.\n\nFor purposes of description, the Little Saskatchewan may be divided into the following parts, beginning at Lake Winnipeg:\n\nDivision 1, course south by west, 2 miles.\n\" 2, \" west by south, 2 \"\n\" 3, \" north-west, 3½ miles.\n\" 4, \" west by south, 1 mile.\n\" 5, \" north-west, 1½ mile.\n\" 6, \" south-west, 2½ \"\n\" 7, \" north-west, 3½ \"\n\" 8, Turn.\n\" 9, course south-east, 7¾ miles.\n\" 10, \" south by west, 1½ miles.\n\" 11, \" south, 1¾ miles.\n\" 12, \" west, 1 mile.\n\" 13, \" south, 3¾ miles.\n\nNo. 1. The south by west course of two miles has no obstruction. The bay of Lake Winnipeg is deep and well sheltered. The depth of the river up to the first rapid, at two miles from the lake, ranges from 12 to 5 feet. The bottom is of small limestones and conglomerates of all kinds, washed in by former storms.\n\nThe breadth varies from 5 to 6 chains. The banks are steep and precipitous ranging from 6 to 16 feet in height. Both are densely timbered with poplars and tamaracs, from 12 to 6 inches diameter.\n\nNo. 2. The west by south course is very much different from the former. Its whole length is a series of rapids, over the crests of which it is not possible to obtain more than two feet of water; and this is amongst boulders and rugged rocks, ranging from 6 by 6 by 4 to 2 by 2 by 2, which render a passage extremely dangerous.\n\nBottom is composed of limestone rock, which continues up stream for 1¼ mile. At this point the bed becomes gravelly, but it is extremely possible the limestone rock continues under the gravel a much greater distance, though this could not be ascertained. The current in front of the rapids is three miles per hour; on the crests it is more like a mill race than anything else.\n\nFrom marks on the exposed limestone rock I found that the water of 1872 was 9 inches higher than that of 1871. The lowest level was 1 foot less than that of 1872, while the highest was 2 feet 6 inches above.\n\nThe breadth is 4½ chains. The banks are 20 feet high and of a reddish clayey nature. They are fringed on both sides with small sized poplars and tamaracs.\n\nNo. 3. This Division for a distance of 205 chains is essentially the same as the last—one continued series of rapids with a depth of water varying from 2 to 7 feet. Boulders are scattered about in every direction, putting a complete barrier in the way of navigation. The current varies from three miles to six miles per hour. However, at 205 chains a change for the better takes place. The depth here becomes 7 feet, which continues to the end of the Division.\n\nThe current, too, is much milder, two miles per hour, and the bed is made up of small stones and gravel. The banks are 4 feet high. From Indian accounts, good junipers, from 8 to 15 inches in diameter, can be found; here, none such could be seen.\nNo. 4. This Division is free from obstructions of any kind, having a depth of from 5 to 12 feet and a current of \\( \\frac{3}{4} \\) miles per hour.\n\nNo. 5. This Division is free from any material obstructions. There is one rapid with a depth of 3 feet 6 inches over the crest. There are some boulders of traps, gneiss and granite scattered about. Towards the end of the division the depth increases to 12 feet.\n\nThe banks are 4 feet high, wooded on the right with aspens and on the left with tamaracs. The current is 2\\( \\frac{1}{2} \\) miles per hour, flowing over a gravelly bed.\n\nNo. 6. For some distance the depth in this Division is 5 feet, but several rapids soon occur which have only a narrow passage over them and a depth of scarcely 3 feet. Navigation is extremely difficult. The banks are wet and marshy and timbered at some distance from the shore with tamarac and poplar. One rapid has only a depth of 2 feet. This is the last rapid in the Division. Beyond it the water deepens to 7 feet, and weeds begin to appear on the surface.\n\nNo. 7. This Division begins at 11\\( \\frac{1}{2} \\) miles from Lake Winnipeg. For two miles this Division presents a very fair appearance. By keeping to the main channel not being worse than a current of four miles per hour will be encountered. The Hudson Bay Company's channel in the north of the islands is very shallow and filled with boulders; soon, however, several dangerous rapids with very shoal water occur. The right bank becomes 8 feet high, and the left remains 2 feet. The breadth in many places does not exceed 200 feet, and in consequence the current is very strong.\n\nNo. 8. Upto this point, the general course of the river has been due west; but here it takes a definite change, the upstream direction of the current being in general southerly. From this fact this part of the river is called the Turn by Hudson Bay voyageurs. One sounding here gives a depth of 3 feet and the rest are from 5 to 10 feet on a fine gravelly bottom. The current is swift. The banks are timbered and the average breadth is 2-80 chains. At the beginning of the Turn the river branches and forms a low stoney island, 15 chains broad. The branch channel is 4 feet all through and is uninterrupted by rapids. This branch might find a good place to winter in as no traces of any great \"shove\" could be found.\n\nNo. 9. This Division begins at 15\\( \\frac{1}{2} \\) miles from Lake Winnipeg. Both banks are low, the right reedy and the left hard good ground. For some distance the depth varies from 9 to 4\\( \\frac{1}{2} \\) feet on a stony bottom with many large boulders. Further on the soundings vary from 12 to 3 feet. At this latter sounding there is a current of 4 miles per hour. Many large boulders lie scattered about in every direction, rendering a passage extremely hazardous. Further on the river presents a very bad appearance, there are several very dangerous rapids with only 2 feet of water over their crests, while boulders and shoals lie in every direction. In many places the current becomes as high as 5 miles per hour; towards the end of the division the depth becomes 12 feet, the banks low and marshy and the current 3 miles per hour.\n\nNo. 10. This Division begins at 23\\( \\frac{1}{2} \\) miles from the Lake Winnipeg. There is only one rapid, and this is easily surmounted. A general depth of from 3 to 8 feet may be obtained.\n\nNo. 11. This Division begins at 25\\( \\frac{1}{2} \\) miles from Lake Winnipeg. The river here branches into two channels; the Hudson Bay one on the right is only 4 feet deep, while the main river is 8 feet deep all through. At twenty-six and one-quarter miles from the lake it shoals down to two feet six inches.\n\nNo. 12. is shoal all through, its general depth being scarcely over four feet. Both banks are low and gravelly. The current is three miles per hour.\n\nNo. 13. has no rapids, a strong current, low banks, and a depth of six feet till we arrive at the head of the river. Here there is a bar of mud and sand with only four feet of water at its head; the river is filled with small reedy islands. Both banks are low, the left with a gravelly fringe and the right covered with reeds.\n\nGENERAL REMARKS.\n\nThe average breadth of the river is 260 feet. The highest current over any boulder bar was 7 miles per hour, while the lowest in any part of the river was one\nmile per hour. The banks in the Northern Branch are low and marshy, while in the Eastern Branch, they range from 6 to 20 feet high. There are thirty noticeable rapids in the whole length of 30½ miles. The general nature of the bed of the stream is a large sized gravel covered with boulders of gneiss, trap and granite, varying in size from one to five feet square, though one or two exceed this latter dimension.\n\nIt is extremely improbable the bed is ever in a state of regime, all observation tended to show that the constituents of the bottom were always changing position.\n\nST. MARTIN'S LAKE.\n\nPassing out of the Little Saskatchewan we enter into \"Shoal Bay,\" an oblong sheet of water lying with its greatest length S.E. of the river. In this bay there is no regular channel, although the general depth seems to be from 4 to 6 feet; at 4½ miles from the river it shoals down to 2 feet 6 inches.\n\nThe bottom is of fine clay, covered over in every direction with large boulders. The dotted red line on plan 4 shows the deepest channel. This channel is, however, very dangerous. The boundary of the bay is a marshy swamp, wooded with small balsam, spruce, poplar and willows on the west and tamaracs and spruce on the east.\n\nPassing from Shoal Bay we come to the \"Narrows,\" at a distance of eight miles from the river. The Narrows resemble a river in appearance, being in some places only ten chains broad; the greatest available depth in their present state is four feet, till we arrive at the opening into St. Martin's Lake proper.\n\nHere there is a bar of mud with only two feet six inches of water. The banks are marshy and covered with reeds. There are no boulders.\n\nThe open part of St. Martin's Lake has a deep water channel of eight feet all through it. The course we pursued, the ordinary in-shore route, has a depth of from five to eight feet. The bottom is muddy and covered with aquatic vegetation. The boundary is low and flat, timbered with small spruce and poplar.\n\nPARTRIDGE CROP RIVER.\n\nTwenty miles south and eighteen and three-quarters miles west of the head of the Little Saskatchewan River lies the mouth of the Partridge Crop or Fairford River.\n\nAt the mouth, the river forks into two branches, of which the right hand one is the better and deeper. The breadth is five chains, and for half a mile up the greatest depth is four feet six inches on a bottom of hard gravel; up to this there has been no trees on the banks; the current has been one mile per hour, but now the current becomes very rapid and large boulders appear on the bed, and the right bank is fringed with poplars.\n\nThe depth fluctuates now between 3 and 5 feet till we arrive at the Turn, a distance of 3½ miles from the Lake, here the river widens out considerably and forms a small lake 18 by 22 chains, surrounded by a swampy marsh; the depth is 3 ft. on a gravelly bottom covered with large boulders.\n\nLeaving this small lake, we enter the Narrows, where the depth is from 6 to 7 feet, on a soft muddy bottom. At the termination of the Narrows, there is a dangerous boulder bar, with only 3 feet of water. For three miles beyond this bar the depth is good—being from 6 to 12 feet. The banks are low and marshy and the current is mild. At 6½ miles from the lake the depth is 3 feet 8 inches, and at 7½ miles there is a dangerous rapid, with only 3 feet of water amongst the boulders. Both banks are fine and lined with trees at a short distance from the river.\n\nIn the neighborhood of Fairfield House the depth is 6 feet, and from this to a distance of 8½ miles is uninterrupted by rapids or bars, though in many places the depth does not exceed 4 feet, on a hard gravelly bottom; the banks are 6 feet high and timbered with poplar, juniper, and small oak.\n\nAt 40 chains from the head of the river, there are three dangerous rapids, with scarcely 2 feet 6 inches of water. The bottom is of compact limestone rock. The\ncurrent is very rapid. At the head, the breadth is 7½ chains, and the depth 5 feet 10 inches. Both banks are high, and wooded out into Lake Manitoba a distance of nearly one mile. The general depth does not exceed 3 feet. The bottom is gravelly, and covered with large boulders. There are several stony islands and gravelly shoals, and on the whole there is nothing like a safe channel.\n\nGENERAL REMARKS.\n\nIt must be borne in mind that all depths given in this report are those found in August, 1872. The river then, according to best accounts, was 1 foot 6 inches higher than in the fall of the previous year. This, however, does not agree with the rise of the Little Saskatchewan, which, as stated formerly, was 9½ inches. If we take the rise of the Partridge Crop at the same, I do not think it will be far from the truth. The spring levels are said to be very high. In many places my guide pointed out to me points which he had observed under water in the spring freshets. These were fully 4 feet above the then level. The total length of the Partridge Crop is 9 statute miles. The actual distance in a straight line between Lake Manitoba and St. Martin's Lake is 4 miles.\n\nPROPOSED IMPROVEMENTS.\n\nIf it is intended to dredge out a channel through these rivers and lakes, it will be necessary to dredge to a depth of 6 feet below present level (south-east level of 1872) to ensure a constant depth of 5 feet. (See instructions.) On an average, it will be necessary to take out a depth of 2 feet of the bottom throughout the whole length, that is to say, to take out 2,000,000 cubic yards, which, at 75c. per cubic yard, would cost $1,500,000. To improve the river by dams, locks and dredging, which will eventually prove the more successful and cheaper, it will be necessary to dredge out of the Partridge Crop and Lake Manitoba 60,400 cubic yards, and in the same river to build one lock and dam of triangular section hypothemuse 26 ft. height 7 feet, and length 400 feet. In St. Martin's Lake, 176,000 cubic yards will have to be taken, and in the Little Saskatchewan 51,500 cubic yards. In this river, also, five dams, five locks, and five sluices will be required.\n\nThe following is an approximate estimate of the cost:\n\n| Description                                      | Quantity | Rate | Amount |\n|--------------------------------------------------|----------|------|--------|\n| Excavation in Partridge Crop River and Lake Manitoba | 60,400   | 75   | 45,300 |\n| One dam in same river                             | 76,400   | 10   | 7,640  |\n| Lockage of 4 ft. in same river                    |          |      | 10,000 |\n| Cutting in St. Martin's Lake                      | 176,000  | 50   | 88,000 |\n| do Little Saskatchewan River                      | 51,500   | 75   | 38,625 |\n| Five dams in same river                           | 382,000  | 10   | 38,200 |\n| Lockage of 20 ft., at 2,500 per foot of lift      |          |      | 50,000 |\n| $2,500 per foot of lift                           |          |      | 277,765|\n| Contingencies, 10 per cent                        |          |      | 27,776 |\n| **Total**                                         |          |      | **$365,541** |\nREPORT ON THE SURVEY OF THE MEADOW PORTAGE.\n\n(To accompany Plan No. 1.)\n\nMarch 20th, 1874.\n\nThe Meadow or Plain Portage (or, as it is called by the Indians, Mis-quat-ewin-ikum) is, as its name denotes, a low-lying marshy tract, which divides the waters of Lakes Manitoba and Winnipegoosis. Its total length, as the crow flies, is 1 mile, 57 chains and 20 links. The traverse lines on Plan No. 1 show a total distance of 146 chains, 30 links. For the purposes of description, this may be divided into three portions, and, including the bays formed by the two lakes at each extremity, thus make five divisions, as follows:\n\nDivision No. 1 .............................................. Lake Manitoba.\n\" \" 2 .................................................. Station A to Station B.\n\" \" 3 .................................................. \" B \" \" C.\n\" \" 4 .................................................. \" C \" \" D.\n\" \" 5 .................................................. Lake Winnipegoosis.\n\nNo. 1. Lake Manitoba here forms itself into a beautiful bay, with a fine pebbly beach, surrounded by a natural wall of small limestones, about three feet high. This wall serves the purpose of resisting the inroads which the lake might make on the land beyond. The beach is a narrow strip of gravel and small limestones, about 60 feet in extreme breadth. The bay of the lake is open, no such thing as an island being near. At ten chains out, six feet of water may be obtained. The general nature of the bottom and its underlayers may be conjectured from the pit made at the lake edge, which showed one foot of brown mud, mixed with small but compact limestones of a fawn colour, whitish yellow clay one foot six inches, and beneath this, hard gravelly soil. The prevailing wind seems to be from the north-east, and sometimes it blows very violently, too violently, indeed, to admit of vessels lying at anchor with any degree of safety. In some of the storms that blow over this lake the pressure of the long rolling waves cannot fall far short of nine feet of water, or 600 lbs. to the square foot.\n\nNo. 2. Station A to Station B.—Immediately behind the natural wall mentioned above, lies a marshy swamp eight inches in depth. At a distance of twelve chains from the lake, and at an elevation of 8'67 feet above it, timber begins, consisting, for the most part, of small poplars and red willows, varying from three to nine inches in diameter. The highest elevation in the whole portage, viz: 29'77 feet above Lake Manitoba, occurs at thirty-three chains from the lake; a pit sunk here showed twelve inches black loam, three inches small limestones, twelve inches marl, and beneath this latter limestones. From this pit the ground slopes down till we arrive at Station B, which is 21'54 feet above the lake; here there are a few small oaks of from nine to twelve inches in diameter.\n\nNo. 3. Station B to Station C.—The whole of this division, 80 chains and 6 links, is made up of a succession of prairie, swamp and timber land. The timber is good for nothing, consisting principally of very small poplars and red grey willows. A pit sunk in this division at an elevation of 24'33 feet above Lake Manitoba, showed: 18 inches loam, 2 inches small limestones, 24 inches marl, and beneath limestones.\n\nNo. 4. Station C to Station D. The whole of this division is low and marshy. Station C is 22'17 feet, and Station D 19'31 above Lake Manitoba.\n\nNo. 5. Lake Winnipegoosis, at Station D, forms itself into an angular bay, very shallow and full of stones. For fully 30 chains out the depth fluctuates between 3 feet and 6 feet. The bed is composed of layers of gravel, mud and stones. There is no protection against the sudden rise of the waters of the lake. The banks are, in general, low and marshy. There are no islands in the bay. Its altitude in July, 1872, was 18'73 feet above Lake Manitoba.\n\nThe level of Lake Manitoba fluctuates very much between Spring and Fall. According to the best accounts 3 feet is no uncommon difference. This, however,\nseems a large allowance. The shores of Lake Manitoba are very flat, and if such great changes of level were to take place, a vast part of what is at present dry land would be flooded. Lake Winnipegoosis fluctuates also in a like manner to Lake Manitoba.\n\nIt must be borne in mind that the winds have a great deal of influence over the levels of these great lakes. A difference of level of 1 to 2 feet is often occurring, owing to the direction in which the wind tends to blow the lakes volume. In the whole length of the portage I only met with two large stones. They lay far apart, and how they came to their present position is unaccountable, as they were evidently of the same nature as the boulders that line the eastern shore of Lake Manitoba. Good timber cannot be found in the immediate neighbourhood. On the Waterhen River there is some good tamarac. A large tract of land a little to the north, called the Two Islands, contains good pine. This is on the authority of my guide. He says logs from 20 feet by 8 inches can be obtained in great numbers.\n\nDIMENSIONS, &c., OF PROPOSED CANAL.\n\nTo secure a constant depth of 6 feet 6 inches throughout (5 feet 6 inches on sills) the cutting must be carried down to 8 feet 6 inches below the present level of Lake Winnipegoosis. For ordinary traffic on these lakes a canal of the following dimensions will be most appropriate:—Base, 50 feet; slopes, 1\\(\\frac{1}{2}\\) feet; depth below present level of Lake Winnipegoosis, 8 feet 6 inches; wooden locks, 130 feet in length by 30 feet in breadth, with 5 feet 6 inches on mitre sills; excavations in lakes to be of 100 feet base; piers in lakes to be of wood, roughly hewn, 200 feet by 20 feet in breadth at top. An estimate for such a canal will be found on the following page.\n\nESTIMATE.\n\n| Description                                      | Quantity | Rate | Amount |\n|--------------------------------------------------|----------|------|--------|\n| Excavation for canal                             | 325,000  | 75   | $246,000 00 |\n| do                                               | 32,000   | 75   | $24,000 00 |\n| Dredging in Lake Winnipegoosis                   | 46,200   | 75   | $34,650 00 |\n| do                                               | 14,000   | 75   | $10,500 00 |\n| Pier in Lake Winnipegoosis, 230 ft. x 20 ft. x 8 ft. | 32,000   | 10   | $3,200 00 |\n| do                                               | 32,000   | 10   | $3,200 00 |\n| Lockage of 21 ft. (i.e. 19 ft. difference of level of lakes and 2 ft. of fluctuation) at $2,500 per foot of lift |          |      | $52,500 00 |\n| Contingencies, 10 per cent                       |          |      | $374,050 00 |\n| Total                                            |          |      | $411,455 00 |\n\n(Signed) HENRY B. SMITH,\nEngineer in Charge.\nREPORT ON THE SURVEY OF THE CEDAR PORTAGE.\n\n(To accompany Plan No. 3.)\n\n20th March, 1874.\n\nBetween Lake Winnipegoosis and Cedar Lake on the Saskatchewan lies, in a due northerly direction, the narrow strip of land known to Hudson Bay voyageurs as the \"Cedar Portage, Mossy Portage or Hard Ground Portage.\"\n\nLake Winnipegoosis lies at the south end of the portage. Its coast line is straight, no break of any considerable extent occurring for miles east or west. In consequence, in a gale of wind the waters of the lake beat with great violence on the shore, rendering an approach extremely dangerous. There are no islands within some miles of the shore.\n\nThe bottom is composed of small limestones measuring roughly 4 inches by 4 inches by 2 inches. The depth is considerable, 6 feet being attainable at 200 feet out. The beach is pebbly, small flat limestones being in preponderance.\n\nProceeding in a northerly direction, along Traverse Line (see Plan No. 3) the ground rises very rapidly, so rapidly that at a distance of 19-25 chains it reaches its greatest elevation, 93-14 feet above the lake on the left hand side of the line; 130 feet from the lake is the Hudson Bay storehouse.\n\nAt this point begins a tract of dense timber, consisting of spruce, poplar, tamarac and birch, from 9 inches to 18 inches in diameter. The soil on which these grow, is a reddish brown earth 12 inches deep, beneath which is a thick layer of small lime-stones, so firmly pressed together that they are as difficult to excavate as broken rock; and to all appearance the whole ridge that separates the two lakes is made up of the same material, with a thin overlying surface of mould or moss.\n\nFrom Station B the ridge slopes gradually downwards, till at Station C it is nearly 35 feet below B. For half a mile the timber continues good, but after this the whole features change, and the line passes over a very wet muskeg, timbered very sparsely with small tamaracs and bastard willows, growing in a soil made up of 4 inches of yellow moss, 14 inches of black earth and moss, three inches of small limestones, 12 inches of marl, and beneath all small limestones; the muskeg is filled with small water holes and is very unstable and difficult to walk upon. West, as far as the eye can see the cross section is uniform, while on the east it gradually slopes up into a hard stony ridge.\n\nNear Section D the timber shows traces of fire. Burnt stumps are scattered round on all sides.\n\nAt a distance of 3 miles, 29 chains, 71 links, the traverses strikes Hudson Bay Company's waggon road, when the timber consists of cedar, spruce and tamarac, but of very small size.\n\nThe worst part of the muskeg begins here, and continues till Cedar Lake is reached. The Hudson Bay Company have here built a corduroy road. The dearth of good timber may be seen on this road, as the usual size of the cross-trees does not exceed six inches diameter.\n\nOn July 19th, Cedar Lake was at an elevation of 1-53 above Lake Winnipegoosis. When this latter level was observed, however, Cedar Lake was very much blown up by a heavy gale of wind. Judging from the strength of the wind, and the remembrance of its level as seen on the 15th (calm day, when the lakes must have been very near their normal condition), I have no hesitation in saying both lakes are on the same level.\n\nThe lake forms itself into a fine open bay about 30 chains in extreme breadth. This bay is shallow. A depth of 6 feet can be obtained at 10 chains out. Its bottom is composed of strips of sand and mud, lying side by side, beneath which is a layer of mud and sand in mechanical combination. There are no islands in the Bay, though a few miles out one or two may be seen.\nThis ridge is an elevation of small limestones, raised slightly above the level of the surrounding muskeg, and affording hard solid footing almost throughout its entire length. The Hudson Bay Company's waggon road runs over it. It is admirably suited for a road of any kind.\n\nPROPOSED CANAL.\n\nSince the levels of Lake Winnipegoosis and Cedar Lake are so nearly on a level, no locks will be required. An open cut through the portage will allow the waters of Cedar Lake (i.e., the Saskatchewan River) to flow into Lake Winnipegoosis, and till it up to its own level, thereby deepening the latter lake a foot or so.\n\nTo secure a constant depth of 6 feet 6 inches throughout, the cutting must be carried down to 8 feet 6 inches below the present level of Cedar Lake.\n\nThe most suitable canal will be of the following dimensions: Base, 50 feet; slopes 1\\(\\frac{1}{2}\\) to 1 foot; depth below present level of Cedar Lake, 8 feet 6 inches; excavation in lakes to be of 100 feet base; piers in lakes to be of wood, 200x20 in breadth at top.\n\nESTIMATE.\n\n| Description                                      | Quantity | Rate | Amount   |\n|--------------------------------------------------|----------|------|----------|\n| Cubic yds. $ cts.                                |          |      |          |\n| Excavation for canal                             | 7,470,000| 1 00 | 7,470,000 00 |\n| Dredging in Lake Cedar                           | 18,000   | 75   | 13,500 00 |\n| do Lake Winnipegoosis                            | 17,000   | 75   | 12,750 00 |\n| Cubic feet                                       |          |      |          |\n| Pier in Lake Cedar, 200 ft. x 20 ft. x 8 ft.     | 32,000   | 10   | 3,200 00 |\n| do Winnipegoosis, 200 ft. x 20 ft. x 8 ft.       | 32,000   | 10   | 3,200 00 |\n| Isolated pier in Lake Cedar, 150 ft. x 20 ft. x 8 ft.| 24,000   | 10   | 2,400 00 |\n| do do Winnipegoosis, 150 ft. x 20 ft. x 8 ft.    | 24,000   | 10   | 2,400 00 |\n| Contingencies at 10 per cent                    |          |      | 750,745 00 |\n| Total                                            |          |      | $8,258,195 00 |", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000833.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 28416, "total-output-tokens": 16508, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2700, 2], [2700, 6103, 3], [6103, 10341, 4], [10341, 14573, 5], [14573, 18864, 6], [18864, 22273, 7], [22273, 26460, 8], [26460, 29357, 9], [29357, 33006, 10], [33006, 36124, 11], [36124, 37783, 12], [37783, 41083, 13], [41083, 45428, 14], [45428, 49339, 15], [49339, 52547, 16], [52547, 56586, 17], [56586, 59405, 18], [59405, 63108, 19], [63108, 65234, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]