[{"id": "26bee4d84e4c86fe3eb17dcb80985a7c24233c0c", "text": "The Historical and Scientific Society of Manitoba.\n\nTRANSACTIONS Nos. 35 & 37.—SEASON 1888-9.\n\nCONTINUATION OF\n\nHENRY'S JOURNAL,\n\nCOVERING\n\nADVENTURES AND EXPERIENCES IN THE FUR TRADE ON THE RED RIVER, 1799—1801,\n\nBY\n\nCHARLES N. BELL, F.R.G.S.,\nFIRST VICE-PRESIDENT OF THE SOCIETY,\nFELLOW ROYAL SCOTTISH GEOGRAPHICAL SOCIETY, HONORARY CORRESPONDING MEMBER MINNESOTA HISTORICAL SOCIETY, CHICAGO ACADEMY OF SCIENCE.\n\nTRANSACTION No. 36.\n\nLord Selkirk's Deed from the Hudson's Bay Co.\n\nREAD BEFORE THE SOCIETY BY:\n\nMR. JAMES TAYLOR, RECORDING SECRETARY.\n\nWINNIPEG:\nMANITOBA FREE PRESS PRINT.\n1889 — 1894.\nHENRY'S JOURNAL.\n\nAt the meeting of the Scientific and Historical Society March 28th, 1889, President C.N. Bell read a paper on \"Henry's Journal, covering adventures and experiences in the fur trade in the Red River country, from 1801 to 1806.\"\n\nIn the library or Parliament at Ottawa there is the manuscript journal of Alexander Henry, a fur trader of the Northwest Fur Company. A year ago I read a paper on Henry's experiences in the Red River country in 1799, 1800 and a part of 1801. As this manuscript has never been printed, its existence is almost unknown to historical students in Canada. So far as the writer is aware, it is practically speaking, the only detailed information extant regarding the history of the Red River country between 1799 and 1809, or in other words, of the years immediately preceding the establishment of the first settlers in the Selkirk colony. The present paper takes up the narration of Henry's experiences, as recorded on the 22nd August, 1801, on his arrival at the Forks, on the site of the present City of Winnipeg, after returning from the annual gathering of the fur traders at Fort William, Lake Superior.\n\nAT THE FORKS.\n\n\"Aug. 22nd.—We arrived at the forks of the Assiniboine river and sent on the canoes (to Pembina) and took the horse myself, and two men proceeded by land up the Assiniboine river, three leagues to the grand passage, where we crossed over on our horses, having the water up to our saddles, came on and slept at the passage on the River Salle.\"\n\nAt Pembina Henry found his new fort completed and fifty armed Saulteau Indians awaiting his arrival; the same band that traded with him there during the previous season. \"The latter have made several trips to the Assiniboine river and have now a number of horses which they purchased there for guns and medicines; the latter is of their own collection, and consists of different roots and barks, some of which are found on the banks of this river and others are brought from the Fond du lac country and even from the south of Lake Superior.\" \"An Indian arrived with his family in a small canoe in fifteen days from Leech Lake (now in Minnesota) and brings intelligence from that place of several Saulteaux having all their arms from them. They were all drunk and kept up a most terrible crying, screaming and howling and lamenting the death of their relatives. The liquors tended only to augment the false grief.\" Scenes like the above were frequent and illustrate the deadly effect of the liquor traffic when the traders' outfits contained large quantities of high wines, which when diluted, was dealt out to the Indians, generally as a free gift.\n\nOn Sept. 1st Henry sent off a party of men under John Cameron, to Grand Forks, to establish a trading post. Men with trading goods were also sent to the Hair Hills post.\n\n\"Bras Court's daughter (a Saulteau girl) died, aged nine years. Great lamentation, and they must have a keg of liquor to wash away the grief from their hearts, and a fathom of cloth to cover the body, and a quarter pound of vermilion to paint the same.\"\n\nDuring the winter of 1800-1 the Northwest Co.'s traders were alone on the Red River, though the Hudson's Bay Co. and the X. Y. Co. had posts on the Assiniboine. In September (1801) Thos. Miller, of the H. B. Co., with eight Orkney men arrived at Pembina from Albany River, Hudson Bay, and established a post on the east side of the Red River in the vicinity of where the town of\n\nEMERSON NOW STANDS.\n\nA few days later Mr. J. Crebosa and ten men of the X. Y. Co. appeared on the scene and established a trading post on the Red River below Henry's Fort Panbian, (Pembina.) \"None of them dare build above me for fear of the Sioux coming here.\" There was a great deal of rivalry between the traders of the different interests during the ensuing season. Learning that the X. Y. Co. people in charge of a Mr. Desford were building at Scratching river, Henry sent down J. B. Desmarais with five men to oppose them in the fur trade.\n\nOn the 3rd Oct. Henry notes that he took one and a half bushels of potatoes from his garden patch on the east bank of the Red River, where he had planted some seeds in the spring. Horses had destroyed all the vegetables. On the 10th October Henry went to the Hair Hills (Pembina Mountains) and found that \"Langlois had built about three leagues higher up than our house of last winter, exactly at the foot of the steep sandy banks where the river (Pembina) first issues out from the mountains. A few Assiniboines, Crees and Sonnats now begin to come to our house at the mountain to trade.\" A few days later we are informed that Cournoyer of the X. Y. Co., set off from Pembina for the Hair Hills to build near the N. W. Co.'s house.\nNeither of my neighbors have a horse, all their transportation is on their men's backs.\" The H.B. Co. people started to build a post at the \"Grand Passage\" on the Pembina River.\n\nThe better to observe the movements of his rivals in trade Henry had built in his fort a watch tower fronting the door of X.Y. company's fort, placing in it as watchmen St. Germain and Le Derc (or Le Diec.) The houses were whitewashed with a clay found in the Pembina Mountains.\n\nTHE FIRST RED RIVER CARTS.\n\nThe famous Red River cart now was constructed apparently for the first time, and fortunately we have given us a most interesting description of the original vehicles. \"Men now go again for meat with small low carts, the wheels of which are of one solid piece sawed from the ends of trees, whose diameter is three feet. These carriages we find much more convenient and advantageous than to load our horses on the back, and the country being so smooth and level that we can make use of them to go in every direction.\" It may be as well here to give another entry in the journal made a year later which indicates that improvements had been made in the style of the carts and that they had been advanced to such a form of perfection that little change has since been made. \"We require horses to transport the property, of which we have now a sufficient number for all our purposes, and a new sort of cart. They are about four feet high and perfectly straight, the spokes being placed perpendicularly without the least bending outwards, and only four in each wheel. These carts will carry about five pieces, and are drawn by one horse.\"\n\nDuring the winter of 1801-2, little of particular interest took place. Stabbing affrays resulting from \"drinking matches\" were of frequent occurrence. The snow was deep and the cold intense, three of their horses dying from exposure. Tobacco was passing between the Crees, Assiniboines and Saulteaux from Leech Lake, at the head waters of the Mississippi river, to Lake Dauphin, to raise a large war party to raid in the Sioux country during the coming summer. The buildings in the fort at Pembina must have been large in size, as one store house is mentioned as being 100 feet long by 20 wide, built of oak logs.\n\nA FORT BURNED.\n\nIn March the trading post of the H.B. Co. at the Grand passage of the Pembina river was burned, with great loss to the traders, though their rivals appear to have been delighted at their neighbors misfortune.\n\nAs early as the 28th April, 1802, the H.B. Co.'s people embarked for the Forks. On the 3rd May \"arrived four Assiniboines in company with the Saulteaux, the first Assiniboines that came to this fort to trade and drink. They are very suspicious of the Saulteaux and appear always on their guard with their arms in their hands, guns, bows and arrows. The young Saulteaux would fain insult them during their drinking matches, but the men and myself prevented them from receiving any insults.\" Henry mentions that he set the first sturgeon net used in the river and it required 90 fathoms to reach across as the water was high and the current \"forms a great bend\" in the net. Garden seeds were sown on the 15th May.\n\nMAKING THE WABANO.\n\n\"The Indians, having finished the grand medicine, are now making the Wabano. This ceremony is performed at all seasons of the year, but more particularly in the fall and spring, when they are assembled together in large parties. The ceremony is not of that solemn nature as the grand medicine, and does not require that ceremonious admittance. People of all ages and sexes may be partakers in the outward show of singing and dancing, but it is not every one of them who are acquainted with the mysteries concerning it, such as the different medicines that are required for certain cures, songs, conjurations, tricks, etc.\"\n\nOn the 30th May Henry left Pembina for the annual rendezvous of the Northwest traders at Grand Portage, Lake Superior. After transacting the usual business relating to the year's trade and obtaining the supply of goods for his next year's outfit, Henry returned with his canoes to the Red River district, arriving at the Forks on the 4th Sept. He went on horseback\n\nTO PORTAGE LA PRAIRIE;\n\nwhere he made the following appointments: E. Harrison at Portage la Prairie, L. Dorion at Bear's Head River, J. McDonell at Manitoubaunce and Jos. St. Germain at Ft. Dauphin and Prairie en longue. Thence he proceeded to Pembina where the Indians were anxiously awaiting his arrival to taste the \"new milk\" as they termed the rum. Men were sent up to Turtle river to establish a post and others to the Pinacewaywining; and the Terre Blanche river near Rosseau Lake.\n\nA young man having offered to Henry to work for nothing if he was allowed board and clothing with an Indian woman he was in love with, Henry notes—\"This proposal did not surprise me, having seen several of these people as foolishness him and would not hesitate in signing an agreement of perpetual bondage on conditions of our permitting them to have an Indian woman that has struck his fancy.\"\n\nThe winter of 1802-3 passed quietly, nothing of consequence transpiring.\n\nGATHERING RAT TAILS.\n\nIn April 1803, \"Women gathering rat tails to eat. This root is about the size of\na common pipe stem and from six to ten inches long, and from the same stalk adheres a number of these roots. They grow in pools and marshes of standing water and are of a yellowish color, and are tender and pleasant to the taste. They are edible at all seasons of the year, but more particularly in the spring. They are preferable to the esquibois, and not so hurtful to the constitution.\"\n\nThe men of the Northwest and X.Y. Companies quarrelled and fought during the spring.\n\nA PLURALITY OF WIVES:\n\n\"Beaupere was desirous I should take his second daughter, saying one woman was not sufficient for a chief, and that all great men should have a plurality of wives, the more the better, provided they were all of the same family. In this he gave me a striking example in himself as he had three sisters at that time.\" Henry had evidently taken to himself a wife, though an entry in his journal of two years back points out that he was disinclined to do so.\n\nTHE FIRST CAT.\n\nMention is made of a cat having been taken from Portage la Prairie to the Souris river, and it is probable that the traders had at that early date taken cats into the country to destroy the mice, which committed great havoc with their dry goods, etc., as noted several times in Henry's journal. Gardening was now made quite a feature of the work at the fort. On the 6th June Henry transplanted 500 cabbage plants.\n\nA TRIP TO SUPERIOR.\n\nOn the 13th June Henry started for Lake Superior, leaving Langlois with six men in charge of the Pembina fort, all winter posts being abandoned for the summer. The following brigades of boats left the Lake Winnipeg post together for Lake Superior: Athabasca, under Mr. McLain; Fort des Prairies, Mr. McDonnell; Swan River, Mr. McGillis; Upper Red River (Assiniboine), Mr. Cameron; Lake Winnipeg, Mr. McKenzie; Lower Red River, A. Henry. This year the brigades took a new route to Lake Superior, leaving Cross Lake east of Rainy Lake and making for the mouth of the Kaministiquia establishment, while the X.Y. Co.'s people went as usual to the Grand Portage. On the 3rd of July \"we arrived at our new establishment of Kaministiquia. The first object that struck us was the two vessels laying with their sides against the bank, the Invincible and the Otter, who were unloading their cargoes. We found great improvements had been made here for the space of one winter season. Fort, store, shop, etc., built, but not a sufficient number of dwelling houses for all hands. There was only one range erected and that not complete. Here was the mess room and apartments for the agents from Montreal, with a temporary kitchen, etc., adjoining. We were under the necessity of erecting our tents for our dwelling and in them we lodged during our stay here, which seldom exceeds twenty days. Building was going forward very briskly in every corner of the fort, and brick kilns were also erected and turning out great numbers. So that we shall have everything complete and in good order before our arrival here next year. Mr. R. McKenzie was in charge during the absence of the agents.\"\n\nSept. 20th.—Henry arrived at the Forks on his return from the new Fort William, and his notes of this date are interesting as descriptive of the wild state of the Winnipeg district at that time.\n\n\"I sent the Indians off hunting moose, red deer and bears, of which there are an abundance. I sent a hunter out to the Petite Montagne de Roche (Little Stony Mountain), who returned with the meat of four cow buffalos.\" After remaining here for a few days Henry \"made up an assortment of goods for this place, where I leave Mr. Dorion.\" And so began the occupation of this site by the Northwest Company.\n\nA SPECIMEN PARTY.\n\nAfter commenting on the habits of indolence engendered by the use of horses amongst the traders' servants, Henry states that the men who owned horses always took Indian wives, and were led into great extravagance thereby. He gives the following amusing description of the departure of some of his men from Pembina to the Hair Hills post: \"Let us now take a view of the bustle and noise which attends the present transportation of five pieces (450 pounds weight) to a place where they will find houses already built in 1801-2. The men were up at break of day and their horses tackled long before sunrise, but they were not in readiness to move before ten o'clock, when I had the curiosity to climb up on the top of my house to examine their motions and observe their order of march.\n\nAub Payet, guide and second in command, leads off the van with a cart drawn by two horses and loaded with his own private baggage, cassettes, bags, kettles, mashquemowtes (Indian sacks), etc.\n\nMadame Payet follows the cart with a child of one year on her back—very merry.\n\nC. Bottineau, with two horses and a cart loaded with one and a half packs, his own baggage and two young children with kettles and other trash hanging to his cart.\n\nMadame Bottineau, with a young squalling child on her back, and she scolding and tossing it about.\n\nJoseph Dubord, goes on foot with his long pipe stem and calumet in his hand. Madame Dubord follows her husband on foot carrying his tobacco pouch with a broad head tail.\n\nAut. Thelliere with a cart and two horses loaded with one and a half packs of goods and Dubord's baggage.\nAut. LaPointe, with another cart and two horses loaded with two pieces of goods and baggage belonging to Brisbois, Jessimine and Poulliotte and a kettle suspended on each side.\n\nAng. Brisbois follows with only his gun on his shoulder and pipe in his mouth fresh lighted.\n\nMic. Jessimine goes next same as Brisbois, with gun and pipe, puffing out clouds of smoke.\n\nMic. Poulliotte, the greatest smoker in the Northwest, has nothing but pipe and pouch. Those three fellows having taken their farewell dram and lighted fresh pipes, send forth clouds of smoke and go on brisk and merry, playing numerous pranks.\n\nDom. Livernois, with a young mare, the property of Langlois, loaded with weeds for smoking, an old Indian worsted bag, Madame's property, and some squashes and potatoes and a small keg of fresh water and two young whelps, howling, etc.\n\nNext goes Livernois' young horse drawing a traville loaded with his own baggage and a large worsted masquemowte belonging to Madame H. Langlois.\n\nNext appeared Madame Cameron's young mare kicking and raving, hauling a traville which was loaded with a bag of flour, some cabbages, turnips, onions and a small keg of water and a large kettle of broth.\n\nM. Langlois, who is master of the band, now comes on leading a horse that draws a traville that is nicely covered with a new painted tent under which is laying his daughter and Mrs. Cameron, extending at full length, and very sick. This covering or canopy has a pretty effect in the caravan and appears at a great distance in the plains.\n\nMadame Langlois now brings up the rear of the human beings following the traville, with a slow step and melancholy air, attending to the wants of her daughter, who notwithstanding her sickness can find no other terms of expressing her gratitude to her parents than by calling them dogs, fools and beasts, etc. Rear guard consists of a long train of dogs, twenty in number. Some bred for sleighs, others for game, and some for pets of no use whatever only to snarl and destroy meat. The total forms a string near a mile long and appears like a large band of Assiniboines.\"\n\nGATHERING GARDEN STUFF.\n\nIn the middle of October the vegetables were taken from the garden and included 300 cabbages, 8 bush. carrots, 16 bush. onions, with turnips, beets, parsnips, etc., and \"420 bush. potatoes, the produce of 7 bushels, exclusive of the quantity we have eaten since our arrival here.\" This was probably the first gardening on a large scale that was ever undertaken on the banks of the Red River.\n\nAn account is given of a \"bad cough\" that attacked the Indians and caused the death of many, which agrees with the records of more modern days when large numbers of the natives are destroyed by whooping cough.\n\nA WIFE AT SIGHT.\n\nIt is well known that the traders purchased Indian women by trading horses for them, but the following passage in the journal seems extraordinary: \"Livernois has exchanged his mare for a young wife about eighteen years of age. This is a very common circumstance in the Northwest to give a horse for a woman.\"\n\nMuch suffering was endured by the traders at The Forks, Death river and Portage la Prairie, in January 1804, on account of the cold and scarcity of food. When visiting the latter place, Henry refers to Lake Manitoba as follows: \"This part of the lake is erroneously called by us Manethowaubane. The southern part is called by the natives the Rush lake, and the Northern is called Manitouaung.\" The earliest maps generally refer to it as Meadow lake, or Assiniboine lake, and it is likely that these names were given to the southern and northern parts respectively.\n\nINDIANS FIGHTING.\n\nDuring the winter the Indians, as usual, were fighting in their camp near the fort. By the 4th of April the Red River was clear of ice, and on the 20th of that month the canoes were laden and the brigade started for Lake Superior. On leaving Lake Winnipeg the N. W. Co., X. Y. Co. and the Swan River Co. (?) mustered a fleet of 33 canoes and 5 bateaux. Quite a large assortment of furs was shipped from Henry's out post at the forks of the Red and Assiniboine rivers, where Mr. Dorion had been in charge during the winter. Portage la Prairie post was placed in care of Dorion for the summer. The N. W. company's posts during the winter of 1803-4 in the Red River district were situated at Portage la Prairie, Lake Manitoba, Dead River (Nettly Creek), Portage en Longue, the Forks, Bare Hills, Park River and Pembina.\n\nAt Fort William in July Henry writes: \"Men not so difficult to hire this year as last, when boaters for the Lower Red River refused 700 Grand Portage currency and Milleux extra equipments.\"\n\nArriving again at Pembina September 6th Henry found \"men (Saulteaux) all off to war since the 4th.\" This is the second excursion, the Assiniboines have now joined them and form a party of about 300 men, of which 150 are on horse back. The Crees stole the traders' horses at Pembina Mountain. A large crop of vegetables, including melons, cucumbers, squashes, corn, 500 cabbages and 1,000 bushels of potatoes was raised at Pembina by the men left in charge during the summer months.\n\nIn November the traders were fired on by the Indians near Nettly Creek.\nBUFFALO BURNED.\n\nNov. 25th.—“Plains burnt in every direction. Blind buffalo were seen wandering about every moment. The poor beasts have all their hair singed off to the skin, and even the skin in many places is shrivelled up and burnt in a most terrible manner, their eyes swollen and closed fast. It was really pitiful sight to see them walking about, sometimes running foul of a large stone, at other times tumbling down hill and falling into creeks that were not yet frozen over. In one spot we found a whole herd all lying dead near each other.\n\nThe traders of the X. Y. Co. were established on the Salt River and the N. W. Co. had posts in the Red River district at Portage la Prairie, Dog Lake, Prairie en Longue, Dead River, White Mud River of Lake Winnipeg, Hair Hills, Salt River and Paubian.\n\nOn the first day of January, 1805, an express arrived at Pembina with information to the traders that the N. W. Co. and the X. Y. Co. had amalgamated their interests, and Henry writes that it was high time as every Indian on the river was a chief and goods were given gratis, except “silver works, strouds and blankets.” All the Indians wore scarlet coats, had large kegs and flasks and were very insolent and saucy.” It is worth noticing his statement made concerning the red coats, for it was probably by this means that the Indians were educating into holding their ideas concerning the Queen’s soldiers being all clad in scarlet. The N. W. Co. sent inland from Fort William in 1805, as that year’s outfit of goods, 156 canoes, containing 3,290 “pieces” of goods, each piece weighing 90 pounds. Accompanying the goods were 1,771 “pieces” containing provisions. This statement gives us some idea of the immense trading business carried on.\n\nTHE SUMMER OF 1805.\n\nHenry apparently remained in the Red River district during the summer of 1805, and as the Crees, Assiniboines and Saulteaux gathered at Pembina to form a war party to attack the Sioux, who had killed some Saulteaux at Tongue River, he descended the river to the mouth of the Assiniboine, (Winnipeg), to be out of the way, where he enters in his journal the party “were ten days amusing ourselves fishing and hunting wild fowl, and getting fruit. We caught sturgeons and all other kind of fish peculiar to this river in great abundance. Wild fowl were in plenty about the entrance of the river, and at the Dead River plums were perfectly ripe and the men daily go out and return with loads of that delicious fruit. During our stay here we took a number of excellent whitefish in our small nets.\n\nThe women gather great quantities of hazel nuts but the mice render it almost impossible to preserve them. Choke cherries, paubians, plums, grapes, wild red cherries, &c., are all in abundance, and delightful amusement for all hands.”\n\nEarly in October they returned to Pembina and found the Hudson’s Bay Co.’s people building and about 80 Indian anxiously awaiting their arrival in expectation of getting as much rum as usual, but in this they were mistaken, for Henry at once drew up an agreement with Mr. Miller, the H. B. Co.’s officer, and divided between them the Indian hunters. With naiveté Henry records “taking good care to keep the best hunters for myself, and settled matters so as to keep them in due order and prevent them cheating us, &c.” Flattery and threats did not induce the traders to give out liquor without returns. Henry’s men found the remains of a Sioux supposed to have been killed by the Saulteaux in a fight. The body was laid out on the open prairie, and gaily decorated. The arrival of\n\nSOME FREE HUNTERS\n\nat Pembina is announced in the following words: “X. Y. Freemen from the Assiniboine, the first of the kind ever came to the Paubian River, as great a nuisance according to their capabilities as even their former employers. This quarter has always been free from men of that description, having always made it a settled rule, with myself, never to give a man his freedom in this country on any condition whatever.” In November a buffalo walked into the fort through the open gate and was killed by the men. Henry owned what was likely the first library taken into the Red River country and he mentions that it was partially destroyed by fire.\n\nThe winter passed quietly until February, when a three days’ “drinking match” took place and guns, axes and knives were freely used. Henry sums up the situation in the two words “very disagreeable.” In April the workmen had made fifteen carts and one wheelbarrow. The latter article was, in all probability, the first of its kind ever in use in the Red River country. Henry describes the punishment inflicted on a squaw by her husband for\n\n“GADDING ABOUT.”\n\nThe rascal hamstring his young wife. On the 14th May three quarts of oats were sown in the garden. Starting the brigade for Fort William in June, Henry returned and left for a trip to the Missouri River, where he encountered the Mandan and Cheyenne Indians. The H. B. Co.’s brigade from the Red River had a drum and fife band which “plagued” Henry to a considerable extent.\nMr. C. N. Bell read the following paper at the meeting of the Historical Society, held on Thursday evening, May 9th, 1889, in the society's rooms in the city hall:\n\nThe present paper is the third of a series of publications of the manuscript journal of Alexander Henry, a trader of the Northwest Fur Company. The manuscript is on deposit in the library of Parliament at Ottawa. No. 31 of this society's transactions reviews the journal for the years 1799-1801; No. 35 covers the period from 1801 to 1806 and the present deals with the occurrences of 1806-1808, and includes a description of a trip to the Mandan villages on the Missouri River at a date subsequent to the famous visit of Catlin by twenty-four years.\n\nIn 1805 the Northwest Co. sent from Fort William to inland points 156 canoes loaded with 3,290 pieces of merchandise and 1,771 pieces of provisions. (A piece weighed about 90 pounds, and was made up of that weight for convenience in transporting on the men's backs across the numerous portages.)\n\nHenry, during the summer of 1806, made a trip from his fort at Pembina to Fort Souris and thence to the Missouri river. Taking horses, he left Pembina on the 7th July and following a prairie trail, some miles west of the Red river, struck across to the \"Grand Passage\" of the Assiniboine about nine miles from the junction with the Red, or in other words to the ford in the present Parish of St. Charles. Camping at the \"White Horse Plains\" he found a well worn cart road branching off to \"Lac Plat\" (Shoal Lake) where a number of freemen were passing the summer. Then, as now, Shoal Lake was a favorite resort for wild fowl. Long Lake, at Bale St. Pauls, is mentioned under the name of \"Raft Lake.\" Arriving at Portage la Prairie post, Henry notes that there was \"an excellent garden and well stocked with potatoes, carrots, corn, onions, beets, parsnips, turnips, &c., all in great forwardness and good order. Cabbages and melons do not turn out so well as at the Paubian (Pembina) river.\"\n\nOn the 11th of July Henry, accompanied by his men Toussant Vaudrie and Joseph Ducharme, left Portage la Prairie for the Souris river, and \"at nine o'clock we passed the old Fort de Tremble where formerly there was an old establishment which\n\nWAS ATTACKED BY THE CREES\n\nin the year 1781, when several of them were killed by the Canadians. This unfortunate affair appeared to be the opening of a plan, which the natives had in contemplation, for the total destruction of the whites throughout the Northwest country. Mr. Bruce was master at this place. The Indians concerned were the Crees, Assiniboines and Bas de la Riviere Indians. Sixty tents were at the house at the time. The affair took place soon after the arrival of the canoes in the fall of the year 1781, while the people were still building, and, out of 21 men present, 11 hid themselves. The remaining 10 defended themselves bravely and drove off the Indians, both out of the houses and fort, and shut the gates. They however, lost three out of the ten, viz: Belleau, Tecteau and La France, and they killed 15 Indians on the spot and 15 more died afterwards of their wounds. The place was instantly abandoned, canoes loaded, and all hands embarked and drifted down to the Forks (now Winnipeg) but on the moment of their departure arrived two young Indian lads from towards Fort Dauphin (on Lake Manitoba) and being strangers here, and the Indians all fled, they requested to embark, which was allowed them. At this time there was no mention of the small pox yet, but the first day they embarked one of the young lads complained of being unwell. The people gave him the loan of a blanket to cover himself with. (For some three years after this date the small pox raged throughout the whole Northwest and thousands of the Indians died.)\n\nAt the Riviere Millieu (Middle Creek) Henry notes that \"the Hair Hills advance to this place within about two miles of the river (south side Assiniboine), and with their most northerly extremity.\" After ascending a high hill they rested under some oak trees. \"At this place we have for several years past kept up a trading establishment for the winter season; but the country at present is\n\nENTIRELY DESTITUTE OF BEAVER\n\nand other good fur. You are sure of your horse only when you are on his back. The Salteaux will not steal, except rum, but the Crees, Assiniboines and Sonnants will steal anything.\" At the Wa-wap River, he writes, was the old Fort de Epinette. \"At this place we formerly had an establishment for several years, but from the scarcity of wood, provisions, and other circumstances, the place was abandoned and was built higher up the river, where the settlement is at present, at the Riviere la Souris.\" Soon after the trail took them to \"Montagne du Diable\" (the Sand Hills), where \"the sand is constantly moving eastward. There are many extraordinary stories related concerning this mountain, both by the Indians and Canadians, of the uncommon noise that has been heard in its bowels and the many apparitions that have been seen at night at one particular place.\" \"We arrived at the establishment of Riviere La Souris which is situat.\ned on the south side of the Assiniboine river. (Later on he states that the fort was \"a few miles above the mouth of the Souris.\") I was therefore under the necessity of applying to the H. B. Co. people to ferry us over, which they very willingly did. Their fort stands on the north side where indeed ours formerly stood also, but it is rather extraordinary that the gentleman of Northwest Co. are so very fond of shifting their buildings, that a place is scarcely settled, when it is thrown up and planted elsewhere.\" Henry was a great mover himself, as is learned from his journal. The statement regarding the situation of the H. B. Co.'s fort at this place is clear and decisive. Most writers of Northwest history have located the H. B. Co.'s post as being on the south side of the Assiniboine. Leaving for the Missouri they took a trail to the Moose Head, touching the Souris at the junction of the Plum river. Crossing the Plum they kept on the north side of the Souris and camped for the night near the \"Fort de la Frenier,\" (Ash House.) Travelling 42 miles next day, on the morning following they arrived at the \"Bute de Sable.\" Finding the Souris too high to ford \"our route was some miles lengthened as the river here makes a considerable bend to the Northwest.\" \"At 6 o'clock we came to the little river of Tete a la Biche, camping on a most beautiful high hill, at the foot of which flowed the little river on our left and the Riviere la Souris on our right.\" Buffalo were in plenty. On the 16th July they arrived at \"another little stream of the Tete a la Biche, then the Souris spreads out on the plains for 20 leagues as far as the Riviere au Soule. Left the river and went out on the plain W.S.W. At 4 p.m. crossed the Pie River which rises in the Moose Mountain, about 15 leagues west of this, flowing into the Souris below the Riviere au Soule.\" Further on they found a ford of the Souris. Henry states that the Sioux Indians often ranged up from the Missouri to this place.\n\nIN SEARCH OF THE CREEES and Assiniboines. Game was very abundant; antelope, deer, buffalo and many beavers were met with.\n\nThey then pushed on for the Missouri river and arrived there at a point \"opposite the Big Belly (Gros Ventre) village, which is on the Knife river about a mile from the Missouri.\" The Big Bellies would not ferry them over to the west side, so they went down four miles to the Mandan village, which was on their north side. On their way they noticed the little Big Belly village and the Soullier village, situated on the south side. Before reaching the Mandan village they passed through about two miles of woods and then through \"several plantations of Indian corn, beans, squashes and sunflowers. The latter grow wild, but are not so good as the cultivated plants. Passed through one of their abandoned villages about a mile above the present one. Near the deserted village we saw great numbers of their dead lying exposed upon stages, about eight feet from the ground. The envelopes or coverings, which are generally of dressed leather and parchment; many of which were still very good, whilst others were decayed and nothing but the bones appeared. Others again were decaying and daily falling to the ground as the stages fell to pieces. The sight was really melancholy and cast a damp upon our spirits, which had been much enlivened by the prospect of our having reached our destination.\"\n\nNear the village they met a Mandan guarding a lot of women hoeing corn. He had a gun and was pleased to see them. They saw large numbers of women and children working in the cornfields and near the village they were met by \"Chat Noir,\" the chief of the place. They were conducted to a hut \"especially reserved for strangers.\" The horses were tied to one side of the house while they occupied the other, \"this being customary.\" The hut in which Henry lived during his stay in the village was 90 feet in diameter (circumference?). The floor was excavated, being a foot and a half below the surrounding ground. The fireplace was in the centre, about four feet square and sunk two feet in the ground. Two holes, about four feet square, were made at two sides of the roof and\n\nWERE COVERED WITH SKINS when it rained. There was no other light nor chimney. The roof was thatched with willows and one foot of earth placed on top, while at the sides the wall was three or four feet thick. The door was five feet broad and six in height, with a covered way, or porch, on the outside, of the same height as the door, but seven feet broad and ten long. The doors were of raw buffalo hide stretched on frames and hung from above by cords. The doors were barricaded at night by bars. The firewood supply for the year was caught in the spring drifting down the Missouri. Long strings of dried squashes hung in the huts. The medicine post was adorned with buffalo heads well daubed over with paint. The beds were in the form of bunks running around the sides.\n\nMany pages of the journal are filled with notes regarding the Mandans which are too lengthy to be given in this paper, but they are for the most part almost identical with the observations recorded many years after by Catlin. Some of the most striking are as follows:—\n\n\"An extraordinary circumstance struck me among these people to see several children of about ten years of age whose hair was perfectly grey and bore the resemblance of an aged person. Those I saw were all girls. The hair of these people inclines to brown and in cases almost fair. It is not coarse. It is not more than 30 years since they first saw any of us.\"\nTheir eyes are from grey to dark brown.\"\n\nTheir meat was often cooked by suspending it by a cord from the roof, a person sitting turning and moving it continually until cooked. They were at this time much troubled with a bad cough, which killed many of them. \"This, a kind of whooping cough which has made its appearance all through the Red and Assiniboine Rivers, and even to Fort des Prairies.\" The weather was very warm, but the huts were cool.\n\nReferring to the women working in the fields, Henry writes, \"Their hoes are nothing more than the shoulder-blades of a buffalo, to which is fastened a crooked stick, and serves for the handle; the soil being but little interrupted by stones, renders this slight utensil of every use of a real hoe.\" So much cultivated land was seen that Henry remarks, \"In every direction are the plantations, the whole view together had really a very agreeable appearance, and had more the appearance of a country inhabited by a civilized nation than by a set of barbarous savages. The Souliers are entirely distinct from Big Bellies and Mandans. They had 40 huts. The Big Bellies were also different in many respects from the Mandans. They left their summer camp in the fall, and travelled about a good deal, though they cultivated corn and beans. Their burial places were the same as the Mandans, with bodies decaying and falling from the stages.\n\nWith the Mandans the corn was generally bruised or pounded in a wooden mortar which is fixed fast and firm in the ground in one corner of the hut. This is the first work performed by the women in the morning after having paid their devours to their lovers and wash themselves in the Missouris. Their sweet corn and beans are boiled whole. They make use of large earthen pots of their own manufacture, made of a black clay, of which they have plenty near their villages. They make them of different sizes, from five gallons to one quart. In these vessels is never anything cooked of a greasy nature, every family being provided with a brass or copper kettle for the purpose of cooking flesh in. Whether this proceeds from superstition or not I cannot say, but they assured me that any kind of flesh cooked in those earthen pots would cause them to split. These are constantly standing by the fire, one or more of the largest kind boiling prepared corn and beans, and whoever comes in is welcome to help themselves with as much as they can eat. The bottoms of these pots are of an oblong shape. It therefore requires much care to keep them from upsetting, for which purpose, when they are put to the fire, a hole is made in the ashes to secure and keep them erect, and when taken away they are placed upon a sort of coil made of the fibres of the bois blanc. These coils or rings are made of different sizes, according to the dimensions of the several pots, which keep them firm and secure. Some of their pots are provided with two ears or handles and are more convenient than those that have none.\"\n\nPrior to this time the Pawnees and Mandans, with the Big Bellies, were at peace, but were now at war continually. The Mandans used the bow and arrow for hunting buffalo. On their arrival in the village \"Baptiste Lafrance made his appearance. This man had left the Riviere Souris in May, equipped by the H. B. Co. with a small assortment, for the purpose of trading. He now resides upon the south side of the river at the great Mandan village, and hearing of the arrival of white people, came over to us. He now informed the Black Cat, our kind host, who his guests were, and the cause of our visit was mere curiosity.\" The Black Cat then put his American flag over the hut.\n\nA FLAG AND MEDAL\n\nhad been given to him by Captains Lewis and Clarke the year before, when they stopped there while en route to the Pacific. A lot of articles had also been left for the Indians, including an iron hand mill, which was immediately broken up to make arrow points. At the mouth of the Knife River was the little village of Big Bellies, consisting of sixty tents. On the Knife River was the large Big Belly village of 130 huts. At this place they found two Northwest Company employes, named Charles Mackenzie and James Coldwell, who were trading from the Souris fort.\n\nHenry went with the Gros Ventres to a large camp of Schains (Cheyennes) which was situated at a distance of two days' journey. They found the Cheyennes far from friendly and had to closely watch them to prevent an attack.\n\nSixteen years before the date of Henry's visit (or about 1790) the Gros Ventres had been attacked by the Sioux (Tetons and Yantons) in their village, but had fought them off and, it was said, had killed 300 Sioux. Henry was shown a great pile of bones of the killed.\n\nThat corn was extensively cultivated by the Big Bellies is learned by the following: \"They keep their corn in holes which contain 20 or 30 bushels. I was really surprised to see what quantities they had still upon hand and I am very confident they had a sufficient stock to serve them at least twelve months without any supply of flesh or anything else.\" The village was surrounded by a stockade of driftwood very much dilapidated and falling to pieces, but quickly repaired on a signal of danger being given. The Mandans, Gros Ventres and Souliers cut off the first joint of the finger on the death of relatives or on arriving at the age of manhood. When a young man arrived at the age of twenty he went to a\nhigh hill and remained for several days without food or water, crying and singing. He then returned to the village and had one or more buffalo heads fastened to an arrow thrust through a strip of his skin and flesh, one head being attached for each day he remained on the hill. He then walked about the village pulling the heads, making a circuit for each day he had been absent. They also tortured themselves by thrusting arrow points under the skin, in bars, from the wrist to the shoulder. The women tattooed extensively and were vilely unchaste. Diseases that are generally understood to have been communicated to the natives by white men are declared by Henry to have been common amongst these Indians, and he states that the whites contracted them when they went there to trade.\n\nThirty families of Crow Indians from the Rocky Mts. arrived at the Mandan camp \"with furs and slaves to trade for guns, etc., which can only be got here unless they go with the Flatheads to the Spanish settlements. The Big Bellies are not good to the Crow Indians and frown on them in their villages. Their language is nearly the same. A few Flatheads were with the Crows. The Crows are much like the Big Bellies in dress, customs, etc., and only give way to them because they have to trade for guns, etc.\"\n\nReferring to the tobacco raised by the Mandans, Henry writes: \"But as that herb (tobacco) is not yet arrived at proper maturity, they make use of only the blossoms at present. Those are collected as necessity requires, and dried before the fire, upon a fragment of an earthen pot, and in this state it is smoked by all the natives, but I find the flowers a very poor substitute for our own tobacco, being only a mere nauseous, insipid weed. When ripe the leaf is something better, but even then it is mere trash, possessed of neither strength nor virtue.\"\n\nA party of Assiniboines from Moose mountain had been trading for horses and corn in the camp, so it is evident that the Northern tribes were in communication with the Missouris river Indians.\n\nIn reference to the provisions used by the Mandans; Henry does not mention pemmican, but especially describes the food carried by travellers as\n\n\"PRINCIPALLY PARCHED CORN, pounded into a fine flour in a mortar and then mixed up with a small portion of fat and mixed up into balls about the size of an egg. This may be eaten in its present state or mixed with water, or allowed to boil for a short time.\"\n\nLeaving the Missouris on the 28th of July, the party, consisting of ten men, with twenty-five horses, made straight across the prairies to the Assiniboine at the mouth of the Souris, whence Henry proceeded to his post at Pembina, taking a trail on a direct course via the Pembina river.\n\nThe only outpost established this year in connection with the Pembina was at the Sandy Hill river. The trade at Portage la Prairie was destroyed through a fight between the Indians there. \"A party of our Indian hunters from Sandy Hill river was attacked in the spring while working the beaver in the Folle Avoine (Wild Rice) river. One Indian was killed and a Canadian of the name of Charrette.\" Nothing of interest is mentioned during the following winter or summer of 1807 until the 14th September, when \"I sent off a boat for above, Wm. Henry, master, with T. Veudrie, interpreter, and seven men, to build at the Grand Fourche.\" This evidently was the beginning of the present rising town of Grand Forks. A few days after the Hudson's Bay Company's people followed Henry's men to Grand Forks to build a fort. A large number of \"freemen,\" or discharged employees of the fur companies, began to enter the Red River country, where they hunted and traded. The Northwest Company in 1806-7 had posts at Portage la Prairie, under L. Dorion; Riviere au Milieu, T. Veudrie; Sandy Hill River, Wm. Henry and M. Longlais; and Pembina, A. Henry. On Dec. 15th, 1807, a young Orkney girl, who had passed as a boy in the service of the H. B. Co., went to Henry's house at Pembina and gave birth to a child. She had followed her lover from the Orkneys, and he was at that time stationed at Grand Forks.\n\n[NOTE.—The late Mr. Donald Murray informed me that the history of this girl was well known to him and others of the early Selkirk settlers. She was at James Bay for two years, and then at Brandon House, on the Assiniboine, for some time, and was afterwards sent to the H. B. Co.'s post at Pembina. It has been claimed that the first white woman who arrived in the Red River country was a French Canadian, Madame Lagimoniere, who came to the Northwest from Three Rivers, Quebec, in 1806; but from the evidence obtained from Henry's journal, and verbal statements of Mr. Donald Murray, there can be no doubt but that this Orkney girl had been here for at least a year when Madame Lagimoniere arrived. Concealing her true sex for three or four years, it was only revealed to one man, John Scott, until after the birth of her child, in December, 1807. She was sent home to the Orkneys, and I am informed became, with her daughter, public characters, and were known as vagrants, under the name of the \"Norwesters.\" Mr. Murray stated \"this was undoubtedly the first white woman who lived in the Red River country. I knew both Baptiste Lagimoniere and his wife, but I never before heard that it was claimed that she was the first white woman in this country.\"]\n\nDuring the winter of 1807-8 the Saulteaux and Sioux along the Red River were continually fighting. Several of Henry's Indian hunters were killed at Grosse Isle, near the Folle Avoine River (now in Da-\nIn January, 1808, buffalo were killed at Pembina by men stationed at the stockades of the fort. In February, mention is again made of the people being afflicted \"with a cough and cold which attacked every man, woman and child.\" The Indians hunted but little through fear of the Sioux. Henry had \"a carriage made for the cohort,\" so that we have evidence that cannon, of some description, were used by the traders at that date to defend their trading posts.\n\nUnder date of 29th March the journal contains an entry throwing light on the introduction of poultry to the Red River country. \"Having brought a cock and two hens in last summer from Fort William, one of the hens died last fall and the other began to lay eggs to-day.\" On the 11th April the Red River was clear of ice, and in May Henry notes: \"Out of 12 eggs, my hen hatched 11 chickens.\" On May the 10th, \"in the course of twenty-four hours, we caught 120 sturgeon in one net, weighing from 60 to 150 pounds each.\"\n\n\"The drinking match commenced by my giving out a ten gallon keg of high wines gratis. During the boozon an Indian was murdered; he received fifteen stab.\" A few days before a young woman had blown off her husband's head with his own gun. \"Murders amongst those people are so frequent that we pay but little attention to them, the only excuse they have for such outrageous conduct is that they were drunk and foolish.\"\n\nOn June the 10th Henry sent off the brigade for Fort William and returned to Pembina to pass the summer, and he notes that there were great swarms of grasshoppers. The furs sent out this year from the Red River posts included 696 beavers, 161 black bears, 935 martens, 198 mink, 118 otter, 118 fishers, 46 raccoons, etc. 3,159 pounds of maple sugar were received at Pembina from its neighborhood, and Leech Lake (Minnesota). Under the heading of \"Provisions destroyed (i.e. eaten) at the Pembina River, from Sept. 1st, 1807 to July 1st, 1808, by 17 men, 10 women, 14 children and 45 dogs,\" is given a statement of 147 buffalo weighing 63,000 pounds, 6 deer, 4 beavers, 3 swans, 1 crane, 12 geese, 36 ducks, 1,150 fish, 775 sturgeon (weighing from 50 to 150 pounds each), 410 pounds of grease, 140 pounds pounded meat, 325 bushels potatoes, and an assortment of small vegetables. The total cost of the above provisions to the Northwest Company was £24 6s. The weight in pounds of dressed buffalo are given as follows: A fat cow 600 to 700, a lean cow 300, a bull averages 550, a two-year-old heifer 200, a one-year-old calf 110. The percentage for cost of carriage to Pembina on original invoices were: Twine 45 per cent.; shot and balls 26 per cent.; gun powder 90 per cent.; liquor 210 per cent., etc.\n\nOn July 20th, 1808, a note appears in the journal that a trip was made for the first time with carts on the east side of the Red River.\n\nOn July 22nd, there had been a drinking match at Pembina and the Indians were all drunk, 22 men 50 women and a large number of children. In the fort Henry had nine men. About midnight a volley was fired into the Saulteau camp by a band of Sioux. Henry had disarmed the Saulteaux when their drinking match began and they now rushed to the fort and climbed the stockades, yelling and howling. The gates were opened to admit the women and children and then securely fastened, and sentinels stationed in the blockhouses in the corners of the fort. On hearing the Sioux across the Pembina river consulting together, Henry loaded his cohorn with a pound of powder and thirty balls and discharged it at the spot. The Sioux immediately decamped to another place, when he again fired the cohorn at them. They then fled to a distance of about a mile and a half from the fort and endeavored to entice the occupants out. Henry would not allow any one to go, but sent the women to the river, close by, to get water for fill vessels kept in readiness for such an occasion. The Saulteaux were very anxious to fight. An hour after sunrise the Sioux filed off to the south by a road along the Red River. The Saulteaux immediately crossed the Pembina and examined the place where the Sioux had fired from in the night. They found a whip, saddle, and several pairs of shoes which had been thrown away. The whip was stained with blood. Shortly after a party of \"freemen\" from the Upper Pembina arrived, having luckily taken a road not usually followed, and in this way escaped the Sioux. The next morning Henry, with five Indians on horseback, started from the fort to follow the war trail for a distance to learn its direction. On the spot where they had prepared themselves for the attack in the night, and which was in full sight of the fort, about one and a half miles from it, were found upwards of one hundred pairs of worn out shoes, scalps, and remnants of leather and buffalo skins, saddle cloths made of buffalorobes, whips, pieces of old saddles, rolls of bark that contained their war caps, bark and willow dishes, paunches and bladders of water for a journey, upwards of 100 willows stripped of their bark with a fork about the middle, and stuck into the ground. They were about six feet long, and this I am told, is for the purpose of hanging their war caps, previous to their attacking an enemy. Here we also observed a vast number of places where they had seated themselves in the long grass by twos, threes and fours, for the purpose of adjusting their war dresses. At every seat we found a quantity of swansdown colored with red earth, under which we found from one to four small stones about the\nsize of an egg, and near this was stuck in the ground the same number of willows about two feet long, stripped of their bark, and daubed with red earth also. This place is called by the Indians the spot of the last sacrifice, and is common amongst all Indians. It is here that they adjust themselves for the battle, and generally make a sacrifice of different articles that they have brought with them for that purpose, and make the protection of the supreme being, or as they term it, the master of life. The Saulteaux are much more liberal on these occasions; when they go to war with their neighbors the Sioux, they generally take a quantity of their very best articles to sacrifice previous to engaging in battle.\n\nThe Sioux trail was followed for some distance, when it resembled a buffalo path winding along the edge of the prairie or cutting across from point to point of the woods. They had not all been mounted, and from the make of the different shoes found, \"were likely of the following tribes, viz.: Yantons, Gens de la Feuille (Leaf) and some other.\" Under the date of August 1st, Henry writes, \"our H. B. Co. neighbors dare not stir from their fort, they are so much in dread of the Sioux.\"\n\nAugust 3rd, Henry received orders to proceed to the Saskatchewan to take charge of the Lower Fort des Prairies district, and a few days latter he\n\nBID ADIEU TO THE RED RIVER amidst the sorrowful farewells of the Indians. Descending the river from Pembina he stopped at Nettley Creek, then known as the River of Death. He camped at the Dead River with the Court Orielle and other Indians who were taking care of their gardens. \"From them I purchased a small quantity of provisions. This small band of Court Orielle's, who had settled here at present, were formerly from the Michilimakinack. About sixteen years ago the prospects of making great hunts in beaver invited them from their native country. At first they dispersed themselves in different quarters over the Northwest. A band of them went as far northwest as the Lesser Slave Lake and Athabasca River, by the route of the Saskatchewan, but the beaver getting scarce they abandoned those parts and have now assembled nearly all at this place, where they pass the summer season attending the corn and potatoes, and in the autumn they separate for the purpose of hunting to procure the necessaries for us. These people have no inclination of intermixing by marriage with the Saulteaux. They keep within themselves and dispose of their daughters only among their own tribe. Their manner of living is equally correspondent with their own nation, erecting stationary bark huts for the summer and light bark rind for the winter, also rush mats. Their utensils and handsome furniture are all of a more neat construction, and generally kept very clean. Upon the whole they are much more civilized and more laborious than the Saulteaux. The first corn and potatoes they planted here was a small quantity which I gave them in the spring of 1805, since which period they have extended their fields and hope, in the course of a few years, to make corn a perpetual article of trade by selling their produce to us. A Saulteau came to me in a very ceremonious manner, and after having lighted and smoked his pipe, informed me of his having been up a small river a few days ago upon a hunting excursion, when, one evening, while upon the water in his canoe watching the beaver, to shoot them, he was suddenly surprised by the appearance of a very large animal in the water. At first he took it for a moose deer and was preparing to fire at it accordingly, but on its approach towards him he perceived it to be one of the\n\nMITCHE AMICKS, OR LARGE BEAVER.\n\nHe did not fire, but allowed it to pass on quite near to his canoe without molesting it. I had already heard many stories concerning this large beaver among the Saulteaux, but I cannot put any faith in it. Fear, I presume, magnifies an ordinary sized beaver into one of those monsters, or probably a moose deer or a bear, in the dark, may be taken for one of them.\"\n\nLeaving the Death river, they entered Lake Winnipeg and skirted along the west side, \"among the reeds and rushes as far as the entrance of the Riviere la Terre Blanche, where they put ashore for a short time near the old establishment where I had a party of my people who wintered here in 1804-5. They made but miserable returns and perished with hunger. Since that time no Indians will consent to winter here. This is now my last Saulteau establishment which I made upon the Red River and I must now bid adieu to the Saulteau tribes, with whom I have passed sixteen long winters, during which space of time I have experienced every trouble, danger and inconvenience, attending the trade and management of affairs among that turbulent nation. I have been frequently fired at by them, and had several very narrow escapes for my life, but am happy to say they never pillaged from me the value of a needle. Fifteen of those winters I was strongly opposed by different interests, and of all professions upon earth I sincerely believe that of all, competition in trade among the Saulteau tribes is the greatest slavery a person of any feeling can undertake. A common dram shop in a civilized country is a Paradise in comparison to the Indian trade when two or more interests are engaged. The Saulteau are always ready to take advantage of the moment and will dispose of their skins and furs to the highest bidder. No ties or former favors or service rendered them will in any manner induce them to\ngive up the skins one penny cheaper than they can get elsewhere.\"\n\nCreeping slowly along the shore, they passed Riviere aux Brochet, Pointe aux Ragomi Noire, Tete aux Pichaux and Isle du Campment, at the foot of the traverse of St. Martin's Islands. \"It is at this place that the canoes for Fort Dauphin, Swan River and Riviere a la Biche strike off to the left southwest, down the bay for the entrance of the Riviere Dauphin, while those for the Northwest cross among St. Martin's Islands for the mainland.\" They then stood for the Toad Island, Pointe aux Canah Cassie, Pointe Maline, Egg Island, Pointe aux Gravois, Moose Nose Island, Horse Island, and \"soon after came to the mouth of the Saskatchewan River, or, as the French call it, Riviere du Pass.\"\n\nThis closes Henry's narrative of his life in the Red River country. The following three years of his life were spent in the Saskatchewan, and his daily journal contains some very valuable information regarding the country and the Indian tribes.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000060.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 22466, "total-output-tokens": 14518, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 602, 2], [602, 602, 3], [602, 5347, 4], [5347, 10594, 5], [10594, 15893, 6], [15893, 21108, 7], [21108, 26183, 8], [26183, 26183, 9], [26183, 31342, 10], [31342, 36928, 11], [36928, 42367, 12], [42367, 47950, 13], [47950, 53480, 14], [53480, 59043, 15], [59043, 60045, 16]], "primary_language": ["None", "en", "None", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false]}}]