[{"id": "0e11c0fbe0bdafe112bc3db76d6f5d249b35a6cc", "text": "LEGISLATURE OF MINNESOTA.\n\nREPORT\n\nFROM A\n\nSELECT COMMITTEE\n\nOF THE\n\nHOUSE OF REPRESENTATIVES,\n\nON THE OVERLAND EMIGRATION ROUTE FROM MINNESOTA TO BRITISH OREGON.\n\nWITH AN APPENDIX.\n\nPrinted by Order of the H; of R.\n\nSAINT PAUL:\nEARLE S. GOODRICH, STATE PRINTER.\nPIONEER AND DEMOCRAT OFFICE.\n\n1858.\nREPORT.\n\nThe Select Committee of the House of Representatives to whom certain Resolutions of citizens of St. Paul, upon the subject of overland emigration from Minnesota to British Oregon, have been referred would respectfully report:\n\nSuch a continental communication has suddenly become a practical question, in view of the discovery of gold upon the waters of Frazer and Thompson Rivers. Little doubt now remains that Great Britain is in possession of a district on the Pacific coast which is likely to become a second Australia, changing the current of emigration from southern to northern routes across the Continent.\n\nOur citizens, in a series of meetings, have embodied for the public information numerous facts and statistics, which establish the superiority of a route through the valleys of the Red River of the North and the Saskatchewan. The Committee append to this Report the published proceedings of these meetings, at one of which some legislative action, hereafter to be considered, was advocated.\n\nIn addition to the advantages which the Minnesota and Saskatchewan land route is thus found to possess, there is reliable testimony that the western districts of Minnesota may be connected by continuous steamboat navigation with a point at the eastern base of the Rocky Mountains, which is only eight days journey from the gold districts of British Oregon.\n\nThe head of steamboat navigation on the Red River of the North is in about 46 deg. 23 min. The river, flowing from south to north, is, according to Capt. John Pope, five feet deep at the mouth of Sioux Wood River; six feet twenty miles north, at the site of a military post proposed by Maj. S. Woods, 6th Infantry, in 1849, and soon to be occupied as Fort Abercrombie; thence to Shayenne, six feet; from Shayenne to Goose River, nine feet, but with an intervening rapid one mile long with five feet upon it; from Goose River to Red Lake River, twelve feet; from Red Lake River to Pembina and Lake Winnipeg, sixteen feet deep.\n\nEvery portion of Minnesota is in intimate relation with the navigation thus described. When the International Emigrant Route\nto the North Pacific receives the recognition it so amply deserves, a line of steamboats on the Red River would be reached over the area of Minnesota by various communications. From England, Canada and the States within the line of the Lakes, Lake Superior and the valley of the Upper Mississippi would be favorite routes; while from the Southern and Middle States, routes through the southern counties of the State and the valley of the Minnesota River would be eligible. Whatever, therefore, tends to open the route through Northern Minnesota and British America west, cannot fail to enlist the interest and co-operation of every Minnesotian.\n\nWe have shown above, from the soundings and report of Capt. Pope, that the Red River is navigable from a point midway of our western boundary, to Lake Winnipeg. That lake is two hundred and fifty miles long—of course, navigable by a propeller or any class of vessels. From its northern extremity, the Saskatchewan is navigable seven hundred miles west on an air-line (much further by the windings of the stream) with no material obstacle except the Rapids at the mouth of the river. The traveler may ascend the north and south branch of the Saskatchewan, by either route reaching the immediate vicinity of favorable passes through the Rocky Mountains. If, at this moment, these links of internal navigation were connected by vessels, the Overland Journey to the headwaters of Frazer River could be made in twenty-four days. The volume and depth of the Saskatchewan is fully equal to the Mississippi above Cairo.\n\nIt is understood that the Canadian Parliament has incorporated some enterprising citizens of Toronto into a \"Western Transportation Company;\" and if the policy of colonization and settlement is to succeed the exclusive occupation of the Hudson Bay Company, it may be proper for the Legislature of Minnesota to cooperate, as far as the Constitution will admit, in facilitating the enterprise of the above named Company or similar associations within the limits of this State. As no special act for such a purpose can be enacted, the Committee have prepared a general provision that may be adequate to encourage any enterprise which seeks to appropriate the navigation of the streams connecting with our northern frontier.\n\nThe Committee are impressed with the belief that a re-publication of such statements as will illustrate and enforce the advantages of the International Overland Route to the Pacific, should be included among the legislative documents of this session, and these accordingly accompany the present report.\nIn regard to the recommendations of the citizens of Saint Paul, they are best stated in the terms of resolutions adopted at a meeting held in the Hall of the House of Representatives on Saturday, July 17, Hon. J. Starkey presiding. The resolutions were as follows:\n\n\"Resolved, That the Legislature is hereby memorialized to pass an Act authorizing the incorporated cities and towns of Minnesota to guarantee the re-payment of sums advanced by the citizens of said cities or towns in organizing and furnishing overland parties to the Pacific, but limiting, as may be deemed expedient, the extent of such guaranty.\n\n\"Resolved, That the State Government be also memorialized, on the return of parties so organized and forwarded, to compile, publish and circulate, under the direction of the Governor, all observations and information which may be collected by said parties, and to appropriate at this session a reasonable amount for that purpose.\"\n\nThe Committee can readily appreciate that the local advantages to the cities and towns of this State resulting from the establishment beyond all question of the superiority of the Minnesota Overland Route, would justify a reasonable degree of aid by their authorities; while the proposition that the State should supervise and provide for the publication of any valuable information obtained by the explorations of parties from Minnesota, is eminently appropriate. A Bill is therefore submitted in accordance with the foregoing views; but which contains some modification of the suggestions made by the memorialists.\n\nRespectfully submitted,\n\nJ. R. WAKEFIELD,\nS. R. JOHNSON,\nE. PIERCE,\nJ. G. RANDALL,\nJAMES C. FROST.\n\nCommittee.\n\nA BILL for the Encouragement of an International Overland Emigration Route from Minnesota to Puget Sound.\n\nBe it enacted by the Legislature of the State of Minnesota:\n\nSEC. 1. Any company incorporated by the English or Canadian Governments for the purpose of trade or transportation upon the rivers which form portions of the northern and western boundaries of this State, is hereby authorized and empowered to exercise all\nthe powers conferred by their respective charters within the limits of this State, but upon the express condition that no power thereby exercised shall interfere with any right now held and enjoyed by the citizens of this State, or shall be inconsistent with the Constitution or Laws of this State.\n\nSEC. 2. The authorities of incorporated cities and towns in Minnesota are hereby authorized to appropriate money or guarantee the repayment of sums subscribed and paid by individuals for organizing and furnishing overland parties of exploration during the year 1858; but the total amount of such appropriation or guarantee by or on behalf of any single city or town, shall not exceed the sum of three thousand dollars.\n\nSEC. 3. The Governor is hereby authorized and required to compile such reports of overland parties as he may deem proper for public information, and either publish the same during the recess of the Legislature or report at the ensuing session thereof, as he may deem expedient.\nAPPENDIX\nAPPENDIX NO. I.\n\nPROCEEDINGS OF PUBLIC MEETINGS HELD AT ST. PAUL, MINNESOTA, ON THE FIRST, SEVENTH, TENTH AND SEVENTEENTH DAYS OF JULY, A.D. 1868.\n\nPRELIMINARY MEETING.\n\nAt an informal meeting of citizens of St. Paul, for the purpose of considering the practicability of a route from Minnesota to the Northern Pacific Coast, through the valley of the Red River of the North, the Saskatchewan, the Upper Columbia and the gold district of Frazer and Thompson Rivers, Col. Wm. H. Noble was called to the chair, and J. A. Wheelock was appointed Secretary.\n\nWhereupon, a Committee consisting of N. W. Kitson, James Ridpath, John H. Stevens, James W. Taylor, and J. C. Borden, were appointed and requested to communicate to an adjourned meeting upon the subject above named.\n\nAdjourned to meet on the call of the Chairman.\n\nFIRST ADJOURNED MEETING.\n\nAn adjourned meeting of citizens of St. Paul and of citizens of Minnesota sojourning in St. Paul, was held at the Fuller House, on Wednesday, July 7, at 8 P.M. Col. Wm. H. Noble, of St. Paul, resumed the chair, and Mr. E. Pierce, of St. Peter, was appointed Secretary.\n\nMr. James W. Taylor, from the committee previously appointed, presented the following report upon the general subject of an overland route, and the natural features of the regions connected with it.\n\nGEOGRAPHICAL REPORT.\n\nIt is now established that a District of British Oregon, holding a relation to Puget Sound, similar to that of the Sacramento Valley to\nthe Bay of San Francisco, contains rich and extensive gold placers.\n\nThe upper waters of Frazer River, including its principal tributary, Thompson River, are eagerly sought by adventurers from Oregon and California, and all accounts concur that the surface minings are as successful as those of California and Australia have been. Geologists have anticipated such a discovery, and Governor Stevens in his last message to the Legislative Assembly of Washington Territory, claims that a district south of the international boundary is equally auriferous.\n\nThe Frazer river mines have already been mentioned in the British Parliament as not less valuable and important than the gold fields of Australia, and it is in view of the influence of these events upon overland emigration, that the present report is submitted.\n\nThe southern boundary of Minnesota is in latitude $43\\frac{1}{2}$ degrees; St. Paul and the Falls of St. Anthony are about 45 degrees, and our northern boundary, conterminous with the international line, is partly on the parallel of 49 degrees.\n\nThe Frazer River mines will probably be explored from latitude 49 degrees to 55 degrees; therefore, if an overland emigrant route thither is practicable from Minnesota, it will be an important consideration in favor of such a route, that the valleys of the Upper Mississippi and the Red River of the north, are on the most direct line of communication from Canada and the States north of latitude 40 degrees to the Frazer River district.\n\nAn overland route through Minnesota, ascending the course of the Saskatchewan and crossing the Rocky Mountains, in latitude 54 degrees, to British Oregon, would traverse a region of North America, hitherto withheld from colonization, but soon to be surrendered by the Hudson Bay Company for civilized settlement. West of the Rocky Mountains that company claims no chartered rights, and their licence of Indian trade will expire in May, 1859. The British Parliament have just published the report of a select committee of the House of Commons, which exhibits a disposition on the part of the company to withdraw from an immense district reaching west of Lake Winnipeg to the Pacific, if thereby a recognition of the exclusive privileges hitherto enjoyed by them within the remainder of their chartered limits can be obtained. Even such a compromise is vigorously opposed by the people of Canada, but the citizens of Minnesota would have reason to be satisfied if our northwestern connection with Assiniboia, Saskatchewan and British Oregon, should be placed on the footing of such an adjustment.\nIn this respect, our interests are identical with the inevitable policy of Great Britain. Henceforth, no other relation than \"reciprocity\" is possible between British America and the adjacent States of the American Union. Minnesota especially welcomes the assurance that Victoria, the capital of Vancouver Island, is to be selected as the Naval station of England on the Pacific, perhaps to become, under the impulse of an international railroad, the Liverpool of the Pacific coast.\n\nAs to the \"adventurers of England trading into Hudson's Bay\" (so the stockholders of the company are technically styled in the charter of incorporation) they can turn their partial defeat into a victory. The map of Arrowsmith exhibits their posts at every advantageous locality between latitude 49 and 55 degrees. Open that immense belt of country to European and American colonization—extend over it the benefits of \"Reciprocity\"—adopt the American system of land surveys and land bounties to settlers, and the members of the Hudson's Bay Company would receive more advantage in ten years as proprietors of cities and towns, than would be possible for them as fur traders in a century.\n\nThe press and citizens of St. Paul have observed with much satisfaction the progress of public opinion in England on this important subject. Encouraged by the London Geographical Society; if not by the Government, Captain Palliser leads an exploring party to the sources of the South Saskatchewan, and the passes westward through the Rocky Mountains. Col. Elliott, at the head of fifty engineers and as many soldiers, has recently arrived at Vancouver Island, and accompanied by an hundred voyageurs, will thence move eastward through British territory, definitely locating a railroad route as he advances. Simultaneously, a joint commission of the American and English governments are engaged in running the international boundary, from Puget Sound to Lake Superior, commencing at the Pacific terminus. And now comes the gold discovery of the Northwest, which will probably renew in that direction the wonderful history of California and Australia.\n\nAn overland route from St. Paul, on American territory, to Puget Sound, or through the Saskatchewan Basin to Frazer River and Vancouver Island, is central to an immense and fertile area, which, at no distant day, must connect with the channels of the Mississippi and St. Lawrence, within the limits of Minnesota. From latitude forty-four to fifty-four, and from longitude ninety-two to one hundred and twelve (west of Greenwich) or between\nLakes Superior and Winnipeg on the east, and the Rocky Mountains, there is comprised an area of 631,050 square miles. Extend these lines of latitude to the Pacific in longitude one hundred and twenty-four, and we have a further area of 378,636 square miles, or an aggregate of 1,009,686 square miles—equal in extent to France, Germany, Prussia, Austria and that portion of Russia which lies south of St. Petersburg and west of Moscow. A district ten degrees of latitude wide by thirty-two of longitude in length, would comprise twenty-four States of the size of Ohio.\n\nOur present inquiry, however, is confined to the upper half of this vast region, or exclusively north of the boundary of 49 degrees, and since an emigration route to Frazer River is under consideration, a general view of the districts to be traversed by such a route or closely connected with it, will first be presented. Those districts of British America west of the Lakes, which, by soil and climate, are suitable for settlement, may be thus enumerated:\n\n- Vancouver Island, ........................................... 16,200 square miles.\n- Frazer and Thompson Rivers, ......................... 60,000 do.\n- Sources of Upper Columbia, ............................. 20,000 do.\n- Athabasca District, ........................................ 50,000 do.\n- Saskatchewan, Red River, Assineboin, &c. .......... 360,000 do.\n\n506,200\n\nUnder these geographical divisions, whose area would constitute twelve States of the size of Ohio, we propose to give the results of a Parliamentary investigation, just published, into the affairs of the Hudson Bay Company, so far as they are descriptive of the foregoing districts.\n\nVancouver Island.—This Island is fertile, well timbered, diversified by intersecting mountain ranges and small prairies, with extensive coal fields, compared to the West Riding of Yorkshire coal, and fortunate in its harbors. Esquimaux Harbor, on which Victoria is situated, is equal to San Francisco. The salmon and other fisheries are excellent, but this advantage is shared by every stream and inlet of the adjacent coast. The climate is frequently compared with that of England, except that it is even warmer. The winter is stormy, with heavy rains in November and December; frosts occur in January, but seldom interrupt agriculture; vegetation starts in February, progressing rapidly in March, and fostered by alternate warm showers and sunshine in April and May, while intense heat and drought are often experienced during June, July and August. As already remarked, the Island has an area of 16,200 square miles, or as large as Vermont and New Hampshire.\nFrazer and Thompson Rivers.—Northward of Vancouver, the mountains trend so near the Pacific as to obstruct intercourse with the interior, but \"inside,\" to use the language of a witness, \"it is a fine open country.\" This is the valley of Frazer River. Ascending this river, near Fort Langley, \"a large tract of land\" is represented as \"adapted to colonists;\" while of Thompson River, the same witness says that \"it is one of the most beautiful countries in the world\"—climate capable of producing all the crops of England and much milder than Canada. The sources of Frazer River, in latitude 55 degrees, are separated from those of Peace River, which flows through the Rocky Mountains eastwardly into the Athabasca, by the distance of only 317 yards.\n\nSources of the Columbia—The map will show how large a district of British Oregon is watered by the Upper Columbia, and its tributary, the McGillivray, or Flat Bow River. It is estimated above as 20,000 square miles, and has been described in enthusiastic terms by the Catholic Bishop of Oregon, De Smet, in his \"Oregon Missions.\" The territory of the Kootonais Indians would seem, from his glowing description, to be divided in favorable proportions between forests and prairies. Of timber he names birch, pine of different species, cedar and cypress. He remarked specimens of coal, and \"great quantities of lead,\" apparently mixed with silver. The \"source of the Columbia\" seemed to impress him as a \"very important point.\" He observes that \"the climate is delightful;\" the \"extremes of heat and cold are seldom known, the snow disappearing as it falls.\" He reiterates the opinion \"that the advantages nature seems to have bestowed on the source of the Columbia will render its geographical position very important at some day, and that the magic hand of civilized man would transform it into a terrestrial paradise.\"\n\nIt is an interesting coincidence that Father De Smet published in a St. Louis paper, a few months since, a similar description of this region, adding that it could be reached from Salt Lake City along the western base of the Rocky Mountains with wagons, and that Brigham Young proposed to lead his next Mormon exodus to the source of the Columbia River. Such a movement is not improbable, and would exhibit greater sagacity than an emigration to Sonora. Already the Mormons have established a flourishing half-way post on the Salmon River, a branch of the Columbia, and as De Smet has had many opportunities for ascertaining the designs of the Mormon hierarchy, the next scene of their zeal and industry may be under the protection of the British crown.\nThe Athabasca District.—The valleys of the Peace and Athabasca rivers, eastward of the Rocky Mountains from latitude 55 deg. to 58 deg., share the Pacific climate in a remarkable degree. The Rocky Mountains are greatly reduced in breadth and mean elevation, and through the numerous passes between their lofty peaks the winds of the Pacific reach the district in question. Hence it is, that Sir Alexander Mackenzie, under date of May 10th, mentions the exuberant verdure of the whole country—trees about to blossom, and buffalo attended by their young. During the late Parliamentary investigation, similar statements were elicited. Dr. Richard King, who accompanied an expedition in search of Sir John Ross, as \"Surgeon and Naturalist,\" was asked what portion of the country visited by him was valuable for the purpose of settlement. In reply, he described \"as a very fertile valley,\" a \"square piece of country\" bounded on the south by Cumberland House, and by the Athabasca Lake on the north. His own words are as follows: \"The sources of the Athabasca and the sources of the Saskatchewan include an enormous area of country. It is, in fact, a vast piece of land surrounded by water. When I heard Dr. Livingston's description of that country, which he found in the interior of Africa within the Equator, it appeared to me to be precisely the kind of country which I am now describing. * * * It is a rich soil, interspersed with well wooded country, there being growth of every kind, and the whole vegetable kingdom alive.\" When asked concerning mineral productions, his reply was, \"I do not know of any other mineral except limestone; limestone is apparent in all directions. * * The birch, the beach and the maple are in abundance, and there is every sort of fruit.\" When questioned farther, as to the growth of trees, Dr. King replied by a comparison \"with the magnificent trees round Kensington Park in London.\" He described a farm near Cumberland House, under very successful cultivation—luxuriant wheat, potatoes, barley, pigs, cows and horses.\n\nThe Saskatchewan, Assineboin and Red River District.—The area northwest of Minnesota, the Saskatchewan district, is estimated to comprise 368,000 square miles. Northwest from Otter Tail Lake, the geographical centre of Minnesota, extends a vast silurian formation, bounded on the west along the eastern base of the Rocky Mountains by coal measures. Such a predominance of limestone implies fertility of soil, as in the Northwestern States, and a speedy colonization of Saskatchewan would be assured, if the current objection to the severity of the climate was removed. On this point a few facts will be presented.\nThe sea of Azof, which empties into the Black Sea, forming the eastern border of the Crimean peninsula, freezes about the beginning of November and seldom opens before the beginning of April. A point less than one hundred miles north, but far down in Southern Russia, namely, Catherinoslav, has been found from the observation of many years, to be identical in summer and winter climate with Fort Snelling. Nine-tenths of European Russia, therefore—the main seat of population and resources—is farther north than St. Paul. In fact, Pembina is the climatic equivalent of Moscow, and for that of St. Petersburg, (which is 60 deg. north,) we may reasonably go to latitude 55 deg. on the American continent. Like European Russia, also, the Saskatchewan district has a climate of extremes—the thermometer having a wide range; but it is well understood that the growth of the cereals and of the most useful vegetables depends chiefly on the intensity and duration of the summer heats, and is comparatively little influenced by the severity of winter cold, or lowness of the mean temperature during the year. Therefore, it is important to observe that the northern shore of Lake Huron has the mean summer heat of Bordeaux, in Southern France, namely 70 deg. Farenheit, while Cumberland House, in latitude 54 deg. longitude 102, on the Saskatchewan, exceeds, in this respect, Brussels and Paris. The United States Army Meteorological Register has ascertained that the line of 70 deg. mean summer heat crosses the Hudson river at West Point, thence descends to the latitude of Pittsburg, but westward is traced through Sandusky, Chicago, Fort Snelling, and Fort Union, into British America. The average annual heat at Quebec is experienced as far north as latitude 52 deg. in the Saskatchewan country. Mr. Lorin Blodget, of Washington, (who has published a comprehensive work upon the climatology of the United States) asserts that there is a rapid increase of heat in going westward, on a line of latitude from points in Minnesota, and this even where the elevation increases. \"It is warmer,\" he says, \"at Fort Benton on the Missouri, in latitude 110½ deg. west, and latitude 47½ deg. north for every season, than at St. Paul, Minnesota. The mean winter temperature at Fort Benton is 25 deg., and the same as that of Chicago, Toronto, Albany, and Portland, Maine. At St. Paul it is but 15 deg., or 10 deg. less; it is not so cold as this on the main (south) branch of the Saskatchewan.\"\n\nMr. Blodgett claims that not only is the vicinity of the south branch of the Saskatchewan as mild in climate as St. Paul, but the north branch of that river is almost equally favorable, and that the ameliorating influence of the Pacific, through the gorges of the Rocky Mountains, is so far felt on Mackenzie River, that wheat may be grown in its valley nearly to the sixty-fifth parallel.\nThe foregoing details have been produced to exhibit the general features and advantages of the country which extends between Minnesota and the gold region of the North Pacific. It now remains to arrange the facts relative to the journey thither by the route of Pembina and the Saskatchewan. To do so, the committee propose to compile from an overland journey of Sir George Simpson, Governor of Hudson Bay Company, which was published in 1847, whatever facts may throw light upon the experience of a traveller over the same route.\n\nThe journey from St. Paul to Pembina is familiar to all. From Pembina to the junction of Mouse River with the Assiniboine, there is a well defined track over a plain, such as Sir George Simpson describes on the way to the same point from Fort Garry. Under date of July 3d, he says: \"On the east, north and south, there was not a mound or tree to vary the vast expanse of green sward, while to the west (it would be to the north of our advancing party) was the gleaming bays of the Assiniboine, separated from each other by wooded points of considerable depth.\"\n\nGov. Simpson, with relays of horses, made the journey from Fort Garry to Edmonton in thirteen days, about forty-six miles per day. Commencing with his diary of the third day from Fort Garry, (at the point where a party from Pembina would intersect his trail) such extracts will be made as embody useful information:\n\nJuly 5.—\"On resuming our journey we passed among tolerably well wooded hills, while on either side of us lay a constant succession of small lakes, some of them salt, which abounded in wild fowl. In the neighborhood of these waters the pasture was rich and luxuriant; and we traversed two fields, for so they might be termed, of the rose and the sweet briar. On reaching the summit of the hills that bounded the pretty valley of the Rapid River, we descried an encampment, which proved lodges of Saulteaux Indians. We spent an hour in fording the stream.\" No assistance from the Indians, but unmolested by them.\n\nJuly 6.—A good supper of wild fowl, which was very numerous in the small lakes still along the route—a large salt lake—hilly and well wooded district—complaints of mosquitoes.\n\nJuly 7.—Passed Bird's Tail Creek, a rapidly flowing tributary of the Assiniboine—beyond this stream an undulating prairie of vast extent—bands of antelopes—ferried over the Assiniboine to Fort Ellice in a batteau, swimming the horses—leaving the Fort, passed through a swampy wood, forded the Qu'appelle or Calling River, and surmounting a steep hill, encamped on a level meadow of several thousand acres in extent.\nJuly 8.—Extensive prairies, studded with clumps of trees—considerable inconvenience with regard to provisions from heat of the weather—antelopes in sight—in the afternoon the country swampy and beset with underwood.\n\nJuly 9.—Prairie harder and more open; grass withering under recent drouth; more antelopes; circuit of a swamp near Broken Arm River, losing a few hours.\n\nJuly 10.—Forsed White Sand River with the mud up to the bellies of the horses; hitherto weather dry, clear and warm, but a cold rain fell afternoon and night.\n\nJuly 11.—During the night a serenade by the wolves and foxes; an early start and a glimpse of an object eagerly looked for, the Butte aux Chiens, towering with a height of about four hundred feet over a boundless prairie as level and smooth as a pond, evidently once the bed of a lake, with the Dog-knoll as an islet in the centre, and which was covered with an alluvial soil of great fertility. On leaving the Dog-knoll, the party traversed about twenty miles of prairie among several large and beautiful lakes. The cavalcade now consisted, in all, of nineteen persons, fifty horses, and six carts with the following order of march. The guide was followed by four or five horsemen to beat a track; then came the carts, each with a driver, and lastly followed the unmounted animals under the charge of the rest of the party.\n\nJuly 12.—Followed for twenty miles, the shore of \"Lac Sale,\" having waters as briny as the Atlantic. The most curious circumstance with respect to these saline lakes, is, that they are often separated from fresh water only by a narrow belt of land. For three or four days the soil had been absolutely manured with the dung of the buffalo, but the animal had not been met.\n\nJuly 13.—March till ten o'clock in a soaking rain. In the afternoon, \"traveled a long distance through a picturesque country, crossing the end of an extensive lake, whose gently sloping banks of green sward were covered with thick woods.\" Here the party fell upon the trail of emigrants from Red River to Columbia, and then followed the well beaten track made by them for both horses and carts.\n\nJuly 14.—Under this date we annex a considerable extract:\n\n\"In this part of the country we saw many sorts of birds, geese, loons, pelicans, ducks, cranes, two kinds of snipe, hawks, owls and gulls; but they were all so remarkably shy that we were constrained to admire them from a distance. In the afternoon we traversed a beautiful country with lofty hills and long valleys, full of sylvan lakes, while the bright green of the surface, as far as...\"\nthe eye could reach, assumed a foreign tinge, under an uninterrupted profusion of roses and blue-bells. On the summit of one of these hills we commanded one of the few extensive prospects we had of late enjoyed. One range of heights rose behind another, each becoming fainter as it receded from the eye, till the farthest was blended in almost undistinguishable confusion with the clouds, while the softest vales spread a panorama of hanging copses and glittering lakes at our feet.\"\n\nJuly 15.—The travelers had now reached the Bow River, or the south branch of the Saskatchewan, \"which,\" says Simpson, \"takes its rise in the Rocky Mountains near the international frontier, and is of considerable size, without any impediment of any moment. * * * At the crossing place the Bow River was about a third of a mile in width, with a strong current, and some twenty miles below, falls into the main Saskatchewan, whence the two streams flow toward Lake Winnipeg, forming at their mouth the Grand Rapids of about three miles in length.\"\n\nA smart ride of four or five hours from the Bow River through a country very much resembling an English Park, brought the party to Fort Carlton, on the Saskatchewan—latitude 53 deg. longitude 108 deg.\n\n\"The Saskatchewan,\" remarks Gov. Simpson, \"is here upward of a quarter of a mile wide, presenting, as its name implies, a swift current. It is navigable for boats from the Rocky Mountain House, in longitude 116, to Lake Winnipeg, upwards of seven hundred miles in a direct line, but by the actual course of the stream, nearly double that distance. Though, above Edmonton, the river is much obstructed by rapids, yet from that Fort to Lake Winnipeg, it is descended without a portage alike by boats and canoes, while even on the upward voyage, the only break in the navigation is the Grand Rapids, already mentioned.\"\n\nJuly 17.—After forty-eight hours at Fort Carlton, Gov. Simpson's party resumed its journey along the north or left bank of the Saskatchewan. The first day's route \"lay over a hilly country so picturesque in its character that almost every commanding position presented the elements of a picturesque panorama.\"\n\nJuly 18.—The hottest day—inconvenience from thirst—encamped at 9 P. M. on a large lake.\n\nJuly 19.—Overtook the emigrants to the Columbia. In this connexion so many particulars of interest are given that we make a liberal extract.\n\n\"These emigrants consisted of agriculturists and others, principally natives of Red River Settlement. There were twenty-three\nfamilies, the heads being generally young and active, though a few of them were advanced in life, more particularly one poor woman, upwards of seventy-five years of age, who was tottering after her son to his new home. This venerable wanderer was a native of the Saskatchewan, of which, in fact, she bore the name. She had been absent from this, the land of her birth, for eighteen years; and on catching the first glimpse of the river from the hill near Carlton, she, under the influence of old recollections, burst into a violent flood of tears. During the two days that the party spent at the Fort, she scarcely ever left the bank of the stream, appearing to regard it with as much veneration as the Hindoo regards the Ganges. As a contrast to this superannuated daughter of the Saskatchewan, the band contained several very young travelers, who had, in fact, made their appearance in this world since the commencement of the journey.\n\n\"Each family had two or three carts, together with bands of horses, cattle and dogs. The men and lads traveled in the saddle, while the vehicles, which were covered with awnings against the sun and rain, carried the women and young children. As they marched in single file, their cavalcade extended above a mile in length, and we increased the length of the column by marching in company. The emigrants were all healthy and happy, living in the greatest abundance, and enjoying the journey with the highest relish.\n\n\"Before coming up with these people, we had seen evidence of the comfortable state of their commissariat, in the shape of two or three still warm buffaloes, from which only the tongues and a few other choice bits had been taken. The spectacle gave us hope of soon seeing the animals ourselves, and accordingly it was not long before we saw our game on either side of the road, grazing or stalking about in bands of between twenty and a hundred, to the number of about five thousand in all.\"\n\nJuly 20.—The first complaint of the scarcity of water—only one supply, from Turtle River, during thirty-six hours. Game abundant, buffalo, beaver and deer, besides wolves, badgers and foxes. Returned to the immediate valley of the Saskatchewan, reaching Fort Pitt about dark.\n\nJuly 21. Crossed to south bank of the Saskatchewan and traveled about thirty miles through bolder scenery than formerly. At night, first apprehensions of Indians expressed, by hobbling horses and mounting guard.\n\nJuly 22. No water till eleven o'clock, and again, in the afternoon, passed over a perfectly arid plain of about twenty-five miles\nin length; encamped for the night at the commencement of the Chaine des Lacs, a succession of small lakes, stretching over a distance of twenty or thirty miles. The journal adds, \"During the afternoon we saw our first raspberries; they proved to be of large size and fine flavor. Two days previous we had feasted on the service berry, or mis-as-quitomica—a sort of a cross between the cranberry and the black currant, and before leaving Red River we had found wild strawberries ripe.\"\n\nJuly 23.—\"Encamped on the confines of an extensive forest, a tongue of which, stretching away to the northward, is known as La Grand Pointe. In the afternoon we had come upon a large bed of the eye-berry, or oos-guisikoomina, very nearly resembling the strawberry in taste and appearance. It grows abundantly in Russia; and flourishing as it does in the same soils and situations as the strawberry, it would doubtless thrive in England.\" Nights chilly, dews heavy.\n\nJuly 23.—Reached Edmonton House. In the vicinity is an extended plain, covered with a luxuriant crop of the vetch or wild pea, almost as nutritious a food for cattle and horses as oats. The Saskatchewan here is nearly as wide as at Carlton, while the immediate banks are well wooded, and the country behind consists of rolling prairies. Coal is also found in its banks.\n\nGov. Simpson's further route was along the eastern base of the Rocky Mountains, to the sources of the Bow River, or South Saskatchewan, whence he crossed to the head waters of the McGillivray or Flat Bow River. He left his carts at Edmonton, making the journey to Fort Colville with pack horses; but a party destined to Frazer and Thompson Rivers, would find a direct route, but not for wagons, through the Athabasca Portage to the Boat Encampment on the Upper Columbia. This pass is between Mount Hooker and Mount Brown, and on its divide a small lake, called on some maps \"Committee's Punch Bowl,\" sends its tribute from one end to the Columbia, and from the other to the Mackenzie.\n\nA witness before the Parliamentary Committee, Mr. John Miles states that from the Boat Encampment it is \"two days level walk,\" on the head of the Columbia, before reaching the mountain, \"a goods days walk and hard work too\" to reach its summit, and three days before getting out of the mountain ridge altogether. It seems reasonable to suppose from this testimony that a party might traverse the Rocky Mountains from Edmonton House, to the head-waters of Thompson River in about twelve days.\n\nThe Committee compute the distance from St. Paul to the eastern border of the Gold Mines to be 1,650 miles, as follows:\nTO BRITISH OREGON.\n\nSt. Paul to Pembina, .................................................. 450 miles.\nPembina to Carlton House, ........................................... 600 \" \"\nCarlton House to Edmonton, .......................................... 400 \" \"\nEdmonton to Thompson River, ....................................... 200 \" \"\n\n1,650 \"\n\nThey estimate, in view of the facilities afforded by the face of\nthe country, and a continuous line of Hudson Bay Company's\nposts, that this journey can be accomplished in seventy days.\n\nWhat outfit will be requisite and the facilities for supply, at St.\nPaul, will be the subject of another report.\n\nRespectfully submitted.\n\nOn motion, the foregoing report was accepted and adopted.\n\nBUSINESS REPORT.\n\nCol. John H. Stevens, of Glencoe, presented the following report:\nThe distance from St. Paul to the gold mines of Frazer and Thomp-\nson Rivers, may be put down as follows:\n\nSt. Paul to Pembina .................................................. 450 miles.\nPembina to Carlton House ........................................... 600 \" \"\nCarlton to Edmonton .................................................. 400 \" \"\nEdmonton to Boat Encampment .................................... 150 \" \"\nBoat Encampment to Thompson River ............................. 50 \" \"\n\n1,650 miles.\n\nMaking a total distance of 1,650 miles from St. Paul. The Com-\nmittee have made the following estimate of the expense necessary\nto equip and fit out a party of ten from St. Paul. They have in-\ncluded in the estimate sufficient food for six months.\n\n10 bbls. Flour, cost $4 per bbl ...................................... $ 40\n5 \" Pork, \" $18 \" \" .................................................. 90\n450 lbs. Sugar \" ......................................................... 54\n40 \" Tea \" 60c \" \" ..................................................... 24\nSundries ................................................................. 100\nPowder and Lead ...................................................... 100\n10 prs. Blankets ......................................................... 100\nTools and implements ................................................ 100\nTeams and vehicles ..................................................... 1000\n\n$1,608\n\nThe foregoing report was accepted and adopted.\n\nHon. Martin McLeod presented the following resolutions, which\nwere unanimously adopted:\n\nRESOLUTIONS.\n\nResolved, That the overland emigration to British Oregon, at-\ntracted by the gold discovery on Frazer and Thompson Rivers, will\nfind Minnesota the most desirable point of departure and supply for the following reasons:\n\nFirst, The emigrant has the choice of three routes, far more easy and direct than any south of St. Paul, to wit: (1) By Pembina, Carlton, Edmonton, Athabasca Portage and the Boat Encampment on the Columbia. (2) By the South Saskatchewan and the Kootenais Pass to Fort Colville; and (3) By Gov. Stevens' well known Rail Road route on the American side of the international boundary.\n\nSecond, Either of these routes has more water, timber and game, and is less difficult, than those which start from the Missouri River.\n\nThird, Supplies of all kinds are very cheap in Minnesota\n\nFourth, Faithful guides and attendants are easily obtained on our frontiers, and in the territory of the Hudson Bay Company.\n\nFifth, There is no danger of molestation from Indians on these Northern routes.\n\nResolved, That the citizens of Minnesota will join heartily with the people of Canada in the policy of colonizing the Western districts of British America, which is about to be established; and that relations of reciprocal trade with the United States, if not now existing, should be extended over that region of North America.\n\nResolved, That our citizens be urged to encourage the formation of parties over either of the routes above designated.\n\nA committee, consisting of Messrs. Martin McLeod, Norman W. Kittson, A. F. McDonald, Alexander Ramsey, and R. G. Murphy, were appointed, and requested to report at an adjourned meeting to be held at the Hall of Representatives, on Saturday, July 10, at 4 o'clock p.m., upon the relations of the Red River settlements to Minnesota, the nature and extent of their commerce with our citizens, and the facilities thereby afforded for an overland communication with British Oregon.\n\nAfter remarks by Messrs. McLeod and Stevens, the meeting adjourned to the Hall of the House of Representatives, on Saturday, July 10, at 4 p.m.\n\n---\n\nSECOND ADJOURNED MEETING IN THE HALL OF THE HOUSE OF REPRESENTATIVES, AT ST. PAUL, JULY 10, 1858.\n\nA large assembly convened as above, at 4 o'clock, p.m. Long before the organization of the meeting, groups were engaged in the examination of maps, which were suspended upon the walls\nfor the sake of geographical illustration. One was a large map, published from the Land Office of Canada, upon which both the northern and southern Saskatchewan routes were delineated. Elsewhere, Colton's Map of the United States was suspended, with a scheme of ten States between Minnesota and the Pacific, marked with colors and described by names, and which was a part of a plan for the subdivision of all the present territory of the Union into new States. A map of the globe had a broad red line drawn across its face on the latitude of $43\\frac{1}{2}$ degrees north, with a view of exhibiting how large a portion of the Pacific coast and of Europe lies north of the southern boundary of Minnesota.\n\nThe Chair was occupied by Col. Wm. H. Noble. J. A. Wheelock, Esq., acted as Secretary.\n\nThe Chairman briefly referred to the objects of the meeting. He had long been interested in the project of a northern route to California, and while engaged in the prosecution of an enterprise, having for its object the connection of the head waters of the Mississippi with the Bay of San Francisco, by a route which he believed to have advantages over all others—his attention years ago was repeatedly called to the still greater advantages of the more northern route terminating at the magnificent harborage of Puget Sound; and he had only deferred a scheme of exploration which was long since proposed to him, till he had finished his engagements with the Government on the California route. He spoke of the interest which had been everywhere excited by the proceedings of the previous meetings held on this subject, and read several letters of inquiry from agents of parties at Chicago and elsewhere, who wished to take the route to Frazer River; and in conclusion laid before the meeting the proposition of a gentleman to make an exploration of the whole route.\n\nMr. Martin McLeod, from the committee appointed at a previous meeting, asked leave, (which was granted,) instead of the special inquiry referred to the committee, to submit the following report:\n\nIt will be recollected that at the meeting held at the Fuller House on the 7th inst., a resolution was passed in reference to the choice of three routes for the emigrant road from St. Paul to the Frazer River gold mines in British Oregon. First, by Pembina, Red River Settlement and the north branch of the Saskatchewan. Second, by the South Saskatchewan and the Kootanais Pass. Third, by Gov. Stevens' railroad route on the American side of the international boundary.\n\nFor the practical information of those desirous of undertaking the journey, I have hastily prepared some brief notes gathered\nfrom the journals of voyaging and scientific parties of exploration, by various routes, through that region.\n\nFor a small party of ten to fifteen persons hastily gotten up, the Stevens route appears to be the least favorable of the three routes not only as to distance, but also as to the features of the country, character and number of the Indian tribes through which they would unavoidably have to pass. The distance from St. Paul to Vancouver on the Columbia is 1,864 miles, to Seattle, a port on the east side of Puget Sound, by the Columbia route, two thousand twenty-five miles, 1,152 miles of which is through an uncultivable region, affording but little game, at uncertain seasons, and at a late season not a sufficiency of grass for animals. We will then dispose of this route, with the remark that however practicable or desirable it may be—as being all within our own boundary—for a large and strong party, leaving St. Paul not later than the 15th of May, it cannot be recommended for a small party starting from here at a late season. We have then the choice of the two routes by the Saskatchewan, and to give something like a correct idea of that region, and the features of the routes usually travelled by the voyageurs of the Hudson Bay Company, I will quote from the Journal of an expedition by the Columbia, up that river by its north branch, thence to the tributaries of the Saskatchewan, and down that stream and the valley by water, and by land to Bas de la Riviere, a day's journey from Fort Garry, Red River Settlement.\n\nThe party started on the 4th of April, from near the mouth of the Columbia, which they ascended in canoes. On the 10th of May they first got sight of the Rocky Mountains, and sent forward a party to procure horses and supplies from the east side. From the west base of the mountains they travelled on foot, carrying packs of fifty pounds each, including their provisions, which consisted of pounded corn brought from the Columbia, and pemmican, found in a cache. Before, however, they commenced their foot march, and after leaving the Columbia, they ascended for some distance a small stream called Canoe River, from the fact that it was upon its banks the first canoes were constructed which descended to the Pacific; distance by Arrowsmith's map, twelve hundred miles.\n\nTheir march through the passes of the mountains commenced on the 14th of May, and \"was very fatiguing in consequence of the depth of the snow; on either side were immense glaciers of ice-bound rocks, on which the rays' of the setting sun reflected the most beautiful prismatic colors. One of those peaks was like a fortress of rock; it rose eighteen hundred feet perpendicularly\nabove the mountain lakes, and had its summit covered with ice.\" The party here passed near two lakes not more than 300 or 400 yards in circuit, and 200 yards apart. \"Canoe River takes its rise in one of them, flowing westward into the Columbia; while the other lake gives birth to one of the branches of the Athabasca, which runs first eastward, then northward, and which, after its junction with the Unjeghah north of the Lake of the Mountains, takes the name of Slave River as far as Slave Lake, and afterward that of Mackenzie River, until it empties into the Frozen Ocean.\n\nOn the 15th of May they began to descend the eastern declivities of the Rocky Mountains, and encamped under some cypress trees, the common timber being stunted pine and cedar. As a striking contrast on the western side, the hills were covered with immense forests, mostly of Norway pine and firs of a prodigious size. \"17th May, encamped on the margin of a verdant plain called by the guide Coro Prairie. 18th.—Hunted horses and shot seven wild ducks, reached Rocky Mountain House, situated on the shore of a little lake in the midst of a wood, surrounded, except on the water side, by steep rocks, inhabited by mountain sheep and goats. From here is seen in the west the chain of the Rocky Mountains covered with perpetual snow.\"\n\n\"People so often speak of the Rocky Mountains that I desire here to say a few words on that subject. They extend nearly in a straight line from the 36th parallel to the mouth of Mackenzie River, in the Arctic, in latitude about 65 deg. north. This distance, 30 deg. of latitude, equivalent to 2,250 miles, is, however, only the mean side of a right-angled triangle, the base of which occupies 26 deg. of longitude, in latitude 35 deg. or 36 deg., that is to say, about 1,600, while the chain of mountains from the hypotenuse, so that the real, and as it were, diagonal length of the chain across the continent is nearly 3,000 miles from southeast to northwest. In such a vast extent of mountains, the perpendicular height and width of base must be very unequal. The party were eight days in crossing them, whence I conclude from our rate of travel, that they have at this point, about latitude 54 deg., a base of 200 miles—with an altitude of about 6,000 feet above the sea,\" while the real height of the Rocky Mountains, as since ascertained, average 12,000 feet, the highest known peak being 16,000 feet.\n\nFrom the mountains the party descended in canoes fastened together, and on the 1st of June reached the confluence of the river Pembina, which flows from the south and takes its rise in a spur of the Rocky Mountains. On the 2nd June they reached Slave\nLake river—met a band of the Kinisteneaux who had just killed a buffalo, which they sold for a brass kettle. Passing by a tortuous route through the region of the Red Elk and Athabasca rivers, which were obstructed by boulders, some of the party had to take to the shore, while the men dragged along the canoe, a laborious and tedious operation; and so on, on foot and in canoes, until they reached the main stream of the Saskatchewan on the 17th of June.\n\n\"This river flows over a bed composed of sand and marl, which contributes not a little to diminish the purity and transparency of its waters, which, like those of the Missouri, are turbid and whitish; except for that, it is one of the grandest rivers in the world. The banks are perfectly charming, and offer, in many places, a scene the fairest, the best smiling, the best diversified, that can be beheld or imagined. Hills in rare forms crowned with superb groves, valleys agreeably embowered, and embrowned at evening and at morning by the prolonged shadows of the hills and of the woods which adorn them; herds of light-limbed antelopes and majestic buffalo, bounding on the slopes of the hills, or trampling with ponderous tread the verdure of the plains; all these champaign beauties reflected, and doubled, as it were, by the waters of the gently gliding river, the melodious and varied songs of a thousand birds, perched on the tree-tops, the refreshing breath of the balmy breeze, the serenity of the sky, the purity and salubrity of the air, all in a word, pours contentment and joy into the soul of the enchanted spectator. It is beyond and above all, in the morning when the sun is rising, and in the evening, when he is setting, that the spectacle is really ravishing. I could not detach my regards from that superb picture, until the nascent obscurity had obliterated its perfection.\" Such is the graphic and glowing picture given to us of the Saskatchewan country, by one of the earlier travelers, and as it first presented itself to the eye of the wanderer, the experienced voyageur, and practical man.\n\nFrom these notes it appears that it takes thirty-eight days to ascend the Columbia, eight days to cross the Rocky Mountains, thence along and across numerous rivulets and streams northward to the Saskatchewan, down the valley of that river and through Lake Winnipeg, forty-one days more; in all, eighty-seven days to Bas de la Riviere, near the Red River Settlement.\n\nWhen we take into consideration the difficulty of the ascent of the Columbia, and the tortuous and tardy march at the eastern base of the mountains, before entering the main valley of the Saskatchewan, we are forcibly led to the conclusion that twenty or even\ntwenty-five days should be deducted from the time expended on the whole route. That length of time would be amply sufficient for a large train to reach Red River Settlement, where guides and hunters could be procured without much difficulty, and additional supplies of the proper kind of food, such as pemmican, biscuit and flour could be purchased at reasonable rates. American horses could probably be exchanged for Indian ponies, and the common wooden carts of the colony obtained for the journey through the valley of Saskatchewan. At the mountains these cheap carts should be abandoned and pack-saddles substituted to cross the mountains and complete the journey. There would be no difficulty in ascertaining at the colony which of these two routes by the Saskatchewan would be the preferable one, but unless we have come to erroneous conclusions, and have been misled by information derived from sources which we believe to be reliable in the main, we think the most northern route will be found the most practicable, as it certainly is more direct than the one by the Kootanais Pass, and would not exceed in length the estimate made at our former meeting, of 1,650 miles from St. Paul.\n\nAllowing for delays and difficulties which cannot be foreseen in a journey of such length through a country comparatively but little known, we think that in three months from St. Paul a large train would reach the gold digging region near Thompson and Frazer Rivers. A small train would in all reasonable probability reach there in seventy-five days, but more reliable data, on which to found practical conclusions of this nature so very desirable now, would doubtless be learned at the colony of the Red River settlement.\n\nOn motion, the above report was unanimously accepted by the meeting.\n\nCol. John H. Stevens, of Glencoe, being called upon, expressed the opinion that the Frazer River discovery would lead to a knowledge of the interior of British America, which would make the navigation of the Red and Saskatchewan Rivers a very important commercial fact. How few appreciate that a steamer can depart from the mouth of Sioux Wood River, at about the central point of the Western boundary of Minnesota, and thence descend a distance of 500 miles to Lake Winnipeg, then pass 300 miles through that mighty inland sea and ascend the Saskatchewan to the base of the Rocky Mountains—at least 3,000 miles of inland navigation, including the north and south branches of the Saskatchewan. Ten days of slow land travel suffice to connect from the point thus reached, with the navigable channel of the Columbia and Boat En-\ncampment. When, in addition to these facts, the fertile character of the immense district thus drained, and the measures now on foot for its colonization are considered, the subject rises in dignity and importance far beyond any ordinary scheme of exploration and occupation.\n\nNot a town or farm in Minnesota but is interested in bringing prominently before the emigration of Europe and America, the facts hitherto so unfamiliar in regard to the western portion of British America. He cordially assented to the suggestion of the late meeting, that relations of reciprocity should at once be established with our American people. Our crops were to be abundant—our markets are cheap—our merchants can furnish a full outfit at reasonable prices; and he entertained no doubt that the towns of Minnesota were the most advantageous points for departure to the Frazer and Thompson River districts.\n\nHon. A. Ramsey, in answer to a call by the meeting, responded by reminding the audience that it is in the recollection of men now living, when all the trade of the valleys of the Ohio and Mississippi, was carried on pack-horses by the way of Fort Pitt, (now Pittsburgh,) across the Alleghany Mountains to Philadelphia.\n\nThe immense region west of the Alleghanies has, in the period of seventy-five years, grown immensely. The business which at that time was carried on by this primitive mode of transportation, now employs a greater length of miles of railroad and a larger tonnage of steamboats than all the rest of the Union.\n\nThe immense area west of the Red River and south of the Athabasca, with a climate not inferior to our own, is capable, according to the estimate of Lord Selkirk, founded on a personal observation of the Territory in question, of supporting a population of thirty millions, and will furnish the world with a trade not much inferior to that which now passes between the Atlantic States and the Valley of the Mississippi. And, Mr. President, this is a trade which belongs to us in Minnesota. It cannot be diverted from us. The difficulties and the cost of transportation on the old canoe route along Rainy River, which has heretofore been followed by the Hudson Bay Company, constitute an objection against that channel of communication, which becomes irresistible when brought into competition with the immensely greater facilities of communication by this route.\n\nAccordingly, sir, we every year witness a large accession of our trade from this quarter—which every season gathers new volume from the gradual abandonment of the old routes by Superior and\nHudson Bay—to pour its valuable contributions into our market. And as illustrative of the value and importance of this trade to us, I may state that I have been informed by our worthy Mayor, Mr. Kittson, who is perhaps as thoroughly acquainted with the statistics of this trade as any man in Minnesota, that the Red River trains of this season will have brought an aggregate of $100,000 in money and an equal amount in furs to the trade of this city, and thus, sir, it is easy to foresee, is but the germ of a trade which at no distant day, will give to the waters of the Northern Mississippi the commercial position now enjoyed by those of Lake Michigan.\n\nLet us unite, then, in urging upon our Government at Washington, the importance of encouraging, by all the means they have in their power, an unrestricted reciprocity of commercial relations between the people of Red River and those of the States. This little rivulet, which while it follows its natural course contributes so considerably to our prosperity, will yet grow to a mighty river, and in the development of the grand scheme of an inter-oceanic railroad, which is yet to connect the Valley of the Mississippi with that of Frazer River, will bear upon its swelling tides the golden harvests of the mineral slopes of the Pacific and the rich freight of China and India.\n\nAnd among other things which it seems to me should be pressed upon the attention of the Government, is the fact that there is at present only a monthly mail between St. Paul and these important settlements on Red River. Our growing trade with that region demands an increase of postal facilities, and the establishment of a semi-monthly mail service between St. Paul and Pembina, seems to me a proper subject for a legislative memorial at this time. The speaker adverted to the beneficent effect which the extension of the jurisdiction of the Canadian Government over these regions would have upon their colonization. The above is a very imperfect sketch of the able and impressive speech of the Ex-Governor.\n\nMr. James W. Taylor next addressed the meeting. He first, in reply to a question from Gov. Ramsey, alluded to the geological indications of British Oregon. Except on Vancouver Island, and the opposite shore of Puget Sound, there had been observed to be an absence of the silurian and other limestone formations, which either underlie or are associated with coal fields. West of the Rocky Mountains, the Pacific slope was an immense development of the primary rocks, thrown up by volcanic violence. And it is in such districts, where quartz, granite, gneiss and trap abound, that minerals are mostly found, especially the precious minerals.\nThese seem to be closely related to the fiery mass which is now generally supposed to constitute the interior of the globe, and are thence ejected through the crust of the earth's surface. Therefore, we look to the primary formation—the original crust of the globe—for the gold-bearing quartz. From Mexico to the Russian Possessions, the Pacific coast is characterized by parallel ranges of mountains, quite unlike the limestone ridges and undulations of the Alleghanies. The Rocky Mountains, the most easterly of the Pacific ranges, have been called Stony or Glistening Mountains, because abounding in siliceous rocks. These conditions are favorable to gold discovery, and exist in British Oregon as fully as in Australia, California or Siberia.\n\nAs to the surface minings, the Frazer and Thompson River District had one great advantage. Its northern situation secured to the country frequent and copious rains. The rivers are numerous and full of rapids; hence the disintegration of the gold bearing quartz by the action of the rains and frosts, and the dispersion of the gold along the beds of the streams may be expected in a greater degree than in California, where much less rain falls, and where work is often suspended in consequence. Perhaps this is a cause why the mines of Australia are falling off in productiveness. The speaker regarded this fall of water through North-western America, as not only valuable for mining, but as affording a great resource for agriculture and stock raising in the valley of the Columbia and its tributaries, Frazer and Thompson rivers, and Vancouver Island. The rainless district of the Continent was far to the south; but the immense region north of the southern boundary of Minnesota extended to the Pacific, was favored in that respect, and agriculture was not limited by the necessity of irrigation. A glance at the map would show the immense river systems thus comprised. The basins of the Columbia, the Upper Missouri, the Yellow Stone, the James, the Sioux, the Minnesota, the Red River of the North, the Upper Mississippi, the St. Louis and the St. Croix, are evidently adequate for the organization of ten first-class States of the American Union; while north of the international line, similar river systems, to-wit, the basins of Frazer and Thompson rivers, the Upper Columbia, the Athabasca, the Saskatchewan, the Assiniboin and the Red River of the North, (the last named divided with Minnesota,) are now well understood to be no less adapted to settlements. The present discussion, as had been previously observed, was no less a question than the dedication to Anglo-Saxon civilization of one million square miles of the globe; an area as large and almost identical in physical respects, with the Continent of Europe.\nMr. Taylor, in further illustration of the geological topic, referred with some minuteness to the relative position of Minnesota. The limestone bluffs at St. Paul were lower silurian, and the sandstone beneath would be found resting directly on the granite. Indeed, this primary rock was found in place, as we descend still further through the geological basin toward St. Cloud and the valley of Sauk River. Thence northwest, we are rising, and on the head waters of the Red River, a short distance below the outlet of the Otter Tail Lake, Prof. Owen discovered fossils identical with those observed in the limestone bluffs below St. Paul. Here silurian rocks reappear, and by all analogies, the coal measures should be found by going northwest. Accordingly, maps published by the British Parliament, reveal an immense silurian development, embracing the Red River valley and the Saskatchewan, except the vicinity of its sources near the Rocky Mountains, where the coal measures appear and are estimated to occupy an area of three hundred miles in diameter, while the mountains themselves are a mighty upheaval of primitive rocks, as already stated. Doubtless the fact that the Saskatchewan plains are of such gentle elevation as to average less than a mean of twelve hundred feet above the sea, may serve to explain the vast range of the silurian formation, as well as the similarity of climate to what we enjoy in Minnesota.\n\nWhile the difference in altitude between the Saskatchewan valley and the United States Territory is great, materially affecting the climate, the circumstance may not be without influence geologically. The plateau of the Upper Missouri, although much lower than corresponding longitudes of Kansas, Utah and New Mexico, greatly exceeds in mean elevation any portion of Minnesota and Saskatchewan. While, therefore, the silurian rocks are developed on a vast scale in the districts last named, Nicollet and others testify that the banks of the Missouri at Fort Pierre, due west from St. Paul, present the cretaceous formation. This is above the coal; and of course coal must be found either in Minnesota or the future Territory of Dacotah, since the Mississippi bluffs are well known to be situated below the coal measures. Whether on the James, the Sioux, the Upper Minnesota, or the tributaries of the Blue Earth, these valuable deposits may be concealed, will soon be ascertained.\n\nTo return from this digression. While the natural features of British Oregon prepare us for the recent intelligence, there is evidence that the actual discovery has been for some years \"the secret of a corporation.\" Gov. Stevens, of Washington Territory, speaks of successful gold mining on the American side of the boun-\ndary; and a witness before the Parliamentary Committee states explicitly that, two years ago, Americans were on the bars of Thompson River, making occasionally twenty dollars per day. Why then, it may be asked, has not gold \"broke out,\" (to use a California phrase,) long since? And the obvious reply is, that the Hudson Bay Company, until the present time, discouraged emigration, whether for agriculture, mining or any purpose. This was to be expected from an association of fur traders. Except as a wilderness sparsely occupied by the employees of the Company, the country would be useless to them. Now, however, there is reason to believe that the policy of the Company in regard to the belt of country between latitudes 49 deg. and 55 deg. will be totally changed, and that henceforth the co-operation of the Company in all measures for settlement may be anticipated.\n\nThe explanation of this change of policy in a powerful and sagacious corporation as the Hudson Bay Company unquestionably is, may be found in the events of the last two years, and an event which will occur next year. For two years past the Canadian and British publics, in view of the expiration in 1859 of the Company's lease of Vancouver Island and of their exclusive license to trade with the Indians west of the Rocky Mountains, have gone into a rigid scrutiny of the charter and territorial claims of the Company. Public opinion in Canada seems to be an unit, and highly excited also, in opposition to the charter, as invalid and long since superceded, and, of course, to all pretensions of territorial dominion under it. A committee of the British House of Commons has made a searching inquiry, publishing the testimony and documents in a voluminous Blue Book, into the constitution and management of the Company. While on that committee, friends and even incorporators of the Company were prominently represented, yet the interests of colonization were ably guarded by the well known radical leader, Roebuck, and others. Perhaps there is no commercial enterprise of Great Britain that enlists in a greater degree the interests of the British nobility than the Hudson Bay Company. Its shares are held in very influential quarters—otherwise, there would have been no question as to the result. The incorporators became themselves alarmed; and in the hopes of saving their charter, they themselves proposed to give up the immense region described in the report of the first adjourned meeting, for settlement—withdrawing to the more northern portions of the Continent. Such is probably the basis of a late adjustment, as it had previously been the recommendation of the Committee.\n\nBut the Hudson Bay Company will probably retain certain\n\"possessory rights,\" as the phrase is. The recognition of them in Oregon by our Government is a familiar example of great benefits secured, while apparently making a sacrifice. So from Lakes Superior and Winnipeg to the Pacific. How easy now to see, in the language of the report, that the members of the Company will receive an hundredfold more advantage as proprietors of future cities and towns, than as incorporated fur-traders. Fort William on Thunder Bay, Lake Superior North shore; Fort Francis on Rainy River; Fort Garry on Red River; Carlton, Pitt and Edmonton on the North Saskatchewan; Chesterfield on its south branch, and points on the Upper Columbia and Frazer river, besides Victoria, already indicated as the naval station of England on the Pacific—these and many other locations will be the scenes of operations far more remunerative and exciting than these trading posts have ever before witnessed.\n\nIt is reasonable to anticipate that all connected with the Hudson Bay Company, will now facilitate emigration from the direction of Minnesota, as its agents and servants have at the Pacific posts. The English or Australian plan may be adopted of issuing licenses to miners, but such a tax implies the obligation of protection, and as to the attempt to confine the trade in supplies to the Company, there is great doubt whether such a regulation can be enforced, and even if it is, it may be well for the protection of the miners from extortion by other parties.\n\nUpon the practical question of an overland journey to British Oregon, a preference has been generally expressed, during this discussion, for the more northern route, by way of Pembina, Carlton, the north branch of the Saskatchewan and the Athabasca Portage to the Boat Encampment on the Upper Columbia. The advantages of this route consist of the succession of grass, water, timber, and game, as detailed in Sir George Simpson's narrative—the frequent posts of the Hudson Bay Company, the security from Indian attacks, and the important fact that the point of egress from the Rocky Mountains, namely, the Boat Encampment, is immediately adjacent to the gold district.\n\nStill, a route from Pembina, far more to the south, has every advantage of the route above named, except that a party might be annoyed by Blackfoot Indians; and there are no trading posts as a resource against unforeseen accidents. A Mr. James Bird, for 35 years in the employment of the Hudson Bay Company and the American Fur Company, and occasionally acting as interpreter to negotiations with the Blackfeet Indians, has often traversed the plains and mountains between Salt Lake City and Athabasca, and\ndescribes the Kootenais pass very near the international line as more favorable than any other. A route thither would start from Pembina, pass to the right of Turtle Mountain, (perhaps forty-five miles north of it), and the same distance beyond the boundary, cross the valley of Mouse or Saurie River, and thence north of west and about midway from the boundary to the South Saskatchewan, by Cypress Mountain, to the head-waters of Mo-kosse or Belly River, which is the most southerly of the head-waters of the Bow or South Saskatchewan.\n\nThe whole route is very favorable, consisting of an extensive prairie or buffalo range, and easily traversed by carts. The pass thus reached, known as the Kootenais Pass, rises gradually and is only three days walk—one day on horseback—to the borders of the Kootenais, McGillivray or Flatbow River. Over this pass the Kootenais or Flatbow Indians are accustomed to descend into the plains of the Saskatchewan for their summer hunts of buffalo. Beyond the pass, the route to Fort Colville, as pursued by Simpson, is circuitous and difficult—so much so as to add 500 miles before reaching the gold district. If a more direct connection should be discovered, this route might be found more advantageous than any other. It is preferable to the line of Stevens' railroad survey.\n\nIn regard to the route of Gov. Stevens, and the district through which it passes, Mr. T. was inclined to believe, notwithstanding the strictures of Mr. McLeod, that the country within reach of the line was capable of sustaining ten flourishing communities. No one supposed that the immediate vicinity of the line was equal to the fertile districts of Illinois or Minnesota. All that was necessary to establish in the coming struggle in Congress upon the Pacific Railroad question, was, that the northern route, from Lake Superior to Puget Sound, has immeasurably the advantage over any similar proposition which has been urged at Washington. For one, the speaker believed that the most desirable route to the Pacific would be found in the possession of Great Britain, and that a great inter-oceanic communication was more likely to be constructed through the Saskatchewan basin, than over what may be not improperly called the American Desert—the cretaceous and comparatively rainless areas of southern latitudes within the territory of the United States. This Frazer River discovery may operate to the discomfiture of politicians. While Congress has appropriated $600,000 per annum to forward a route near latitude 32 deg., and even in the present depleted state of the treasury can spend $150,000 for a wagon road near the latitude of Santa Fe, a miserable sectionalism ignores the claims of nine degrees of latitude south.\nof the British boundary. The controversy has degenerated to a centralization on one route with no prospect that it will be for the common welfare.\n\nHence the last Congress, brought to a deadlock in the struggle of localities, made the best possible disposition of the Pacific Railroad bills in postponing them. Let the whole subject remain in abeyance, until it can be approached in a spirit of national statesmanship. The Northwest makes no unreasonable demand upon the other sections of the Confederacy. The debouchure of the Mississippi upon the Gulf of Mexico; the junction of the Missouri and the Ohio in mid-channel of the Mississippi, and the head of navigation upon the Mississippi—from each of these localities must yet project across the continent those communications by Railroads which are already familiar as the Northern, the Central and the Southern. Let Congress determine, in its wisdom, what aid in land, stock and postal bounties it will make for one route, and then, either magnanimously extend that encouragement to the three great routes, or else proclaim that the proposed aid of the nation shall be earned by that road which first reaches the longitude of the Falls of the Missouri! Certainly either course would be perfectly fair.\n\nBut if the determination to exhaust the diplomacy and treasury of the country, in spasmodic attempts to sectionalize this vital subject, is persisted in, Minnesota, at least, has only to reach a friendly hand across her northern border to extricate herself from all the consequences of Congressional injustice. We have come to know the people of Canada—equally American citizens with ourselves, at least under the auspicious influence of Reciprocal Trade and future Identity of Interests, if not of Political Association. English capital also, sensitive to the immense benefit of attracting the boundless transportation of the Northwest over the public improvements of British America, and fully conscious that the Canadian railroad system can never be carried to the north of Lake Huron and Superior, crosses the Detroit River, builds a road through Michigan even at this season of financial depression, and will yet co-operate with the citizens of Wisconsin and Minnesota in a connection with British America at Pembina. \"Thence to Vancouver!\" will be the watchword of Progress, continental in the grandeur both of design and results.\n\nThe time has long passed when the danger of future wars with England will deter from undertaking and consummating such an international enterprise. If, in the late war with Russia, a secret compact mutually exempted from its hazards the British and Rus-\nsian fur-trading posts on this Continent—if we have, at this moment, an agreement with Great Britain, that neither power shall exceed an insignificant number of guns on the Great Lakes, and if the Telegraph, when successfully submerged on the Atlantic plateau, is unquestionably to be neutralized during the accident of international hostilities—surely an emigrant route in the first instance, and a railroad soon thereafter to succeed the wagon or mule track, may be safely entrusted to the guardianship of peace and civilization. No other guaranty of protection is needed, than the enlightened intelligence and moral sensibility of the Anglo-Saxon communities, only separated by an ocean.\n\nBelieving that he was not alone in these opinions and sentiments, Mr. Taylor said in conclusion, that he had ventured to embody them in resolutions, which he would read; but if a single suggestion of reluctance to entertain them was intimated, by any gentleman present, he begged leave in advance to withdraw them. He then offered the following\n\nRESOLUTIONS:\n\nResolved, That the citizens of Minnesota, in common with the States of the Northwest, are deeply interested in a connection between the northern lakes and the Pacific Ocean; and if sectional counsels shall prevail at Washington, excluding the great national highway between Lake Superior and Puget Sound, from its equal and just recognition by Congress, then we congratulate the citizens of the Lake States, that by co-operation with our Canadian brethren, an international route through the valleys of the Red River of the North, the Saskatchewan and the Columbia is not only practicable, but will develop the most valuable portions of the North American continent into powerful and populous States.\n\nResolved, That the great physical fact will vindicate itself, namely, that the commerce and power of the globe lies north of the fortieth degree of north latitude, and that four-fifths of Europe, with a corresponding area of the Pacific coast of North America, is north of the centre of Minnesota.\n\nResolved, That the discovery of gold fields on Frazer River, and the probable removal from the Saskatchewan District, British Oregon and Vancouver Island, of dominion by the Hudson Bay Company, opening those immense and fertile territories to settlement, are considerations which imperatively demand a far different policy by the Government of the United States than has hitherto prevailed.\nResolved, That we ask nothing more for the Northern route of a Pacific railroad, than we would grant in aid of a Central or Southern route; but anything less will be a gross injustice, against which the people of Minnesota have a right to protest.\n\nResolved, That our Senators and Representatives be requested to vote for the postponement of Pacific railway bills, unless they are just to the great Lake route, or at least until the Census of 1860 gives the Northwest her full voice in the Councils of the Union.\n\nThe resolutions were unanimously adopted.\n\nThe meeting then adjourned to Saturday at 4 P. M., in the Hall of the House of Representatives.\n\nTHIRD ADJOURNED MEETING.\n\nThe third adjourned meeting of the citizens of St. Paul upon the subject of opening the overland emigration route from St. Paul to Frazer River, was held at the Capitol on Saturday, July 17th, at 4 o'clock P. M.\n\nCapt. Starkey was called to the chair, and in the course of remarks explanatory of the objects of the meeting, read some news of an interesting character, which had just been received from that quarter.\n\nJ. W. Taylor, Esq., having been called upon, made some remarks upon the practical object of these and previous meetings, which he said should result in measures. He cordially recommended Martin McLeod, Esq., as the man to carry out these measures, and introduced the following series of resolutions, indicating a plan of operations:\n\nResolved, That Martin McLeod be requested to organize and conduct a party of ten men for the purpose of exploring the best route from Minnesota to the Frazer River Gold District through the valleys of the Red River of the North, and the Saskatchewan.\n\nResolved, That Henry McKenty, J. W. McClung and J. M. Stone, be a Committee to obtain subscriptions of citizens payable to the order of Martin McLeod, on or before the 1st day of August, in amount and items as follows:\n\n| Item                                      | Amount   |\n|-------------------------------------------|----------|\n| Cash or Credits at Red River Settlements or Hudson Bay Company's Posts | $1000.00 |\n| Teams and Vehicles                        | 1000.00  |\n| Ten barrels Flour, cost $4 per barrel     | 40.00    |\n| Five barrels Pork, cost $18 per barrel    | 90.00    |\n| Four hundred and fifty pounds Sugar       | 54.00    |\nForty pounds Tea, 60c per pound ........................................... 24.00\nTen pairs Blankets .............................................................. 100.00\nPowder and Lead ............................................................... 100.00\nSundries .................................................................................. 200.00\n\nTotal ..................................................................................... $2008.00\n\nResolved, That the Common Council of the city of St. Paul, is hereby memorialized to make a direct appropriation for the above object, or to guarantee the payment of the sums subscribed by individuals, at the expiration of one year, from August 1, 1858.\n\nResolved, That Mr. McLeod be requested to take the personal obligations of all men employed by him for the repayment of their respective shares of the foregoing outfit at the expiration of one year from August 1, 1858, and to hold the same for the stockholders; but with power to cancel said notes in whole or in part, if unforeseen events make it equitable to do so.\n\nAlso, To announce to the public, at his earliest convenience, the terms and conditions upon which he will receive volunteers, in addition to the \"picked men,\" who may compose his own party.\n\nAlso, To preserve careful notes of his own observations, and of all accessible information in regard to the intermediate country, and emigrant routes to the Pacific; and furnish the same for publication.\n\nResolved, That the Legislature is hereby memorialized to pass an act authorizing the incorporated cities and towns of Minnesota to guarantee the repayment of sums advanced by the citizens of said cities or towns, in organizing and furnishing overland parties to the Pacific; but limiting, as may be deemed expedient, the extent of such guaranty.\n\nResolved, That the State Government be also memorialized, on the return of parties so organized and forwarded, to compile, publish and circulate, under the direction of the Governor, all observations and information which may be collected by said parties, and to appropriate at this session, a reasonable amount for that purpose.\n\nResolved, That the Secretary, J. A. Wheelock, Esq., be requested to prepare a memoir upon the population and commerce of the Red River Settlements, and their relations to the subject of overland emigration; and also, a memorial to the Postmaster General for a semi-monthly mail to Pembina, via Otter Tail Lake.\n\nOn motion, the resolutions were adopted. Whereupon the meeting adjourned sine die.\nAPPENDIX NO. II.\n\nPARTICULARS OF THE GOLD DISCOVERY ON FRAZER AND THOMPSON RIVERS,\nAND OF EMIGRATION THITHER.\n\n[San Francisco (May 19) Correspondence of London Times.]\n\nTwo vessels have arrived here from the British possessions in the northwest since the despatch of my last letter on the 8th inst. The last steamer from Vancouver Island arrived the day before yesterday. The richness of the new gold mines is fully confirmed. The accounts, both private and public, are so voluminous that I can only venture to give the salient points. First, I will quote a few facts to show the productiveness of the mines. \"A returned miner,\" writes the special correspondent of a San Francisco paper from Fort Langley, on the Frazer River, whose name is given, and who was two months in the diggings,\n\n\"Earned from $15 to $20 per day in his 'claim.' He brought down with him $2,500 worth of gold dust, which he sold at Fort Langley. There are numbers of men here with gold. They all intend to return to the mines with provisions, which they came down for.\"\n\nFrom Victoria, Vancouver Island, a gentleman writes on the 9th instant:\n\n\"Yesterday the Hudson Bay Company's steam propeller Otter arrived here from Fort Langley, one of their trading posts on the Frazer River, and brought gold dust valued at $35,000—judging from the fact that its weight was as much as one could conveniently carry. Heavy gold is found ten miles from the mouth of Thompson River, at a place called Necowman. The heaviest nugget yet found was $8 25. Bank and river mining is going on between the Forks and Big Falls of Frazer River, into which Thompson River runs, or in other words, is a tributary to the former. The number of miners now working is estimated by one of their number, from whom I received the above, at 1,000 men—all of whom, he assured me, were doing well. To quote his figures, they were making from $10 to $40 per day.\"\nFrom other sources we learn that miners located near the Forks of Thompson River, about two hundred miles distant from the mouth of the Frazor River, are successfully at work. One man writes that he is getting out $35 a day. The higher up the richer the diggings, it would appear; for at Fort Yale, some eighty-five miles down, the \"yield\" is only from $8 to $16 a day to the men. From the last named place we have the following information:\n\n\"Some fifty or more are at work a few miles above Fort Yale. Mr. McCaw ascended the river some twenty miles above Fort Yale, and asserts that the diggings are rich along the whole of that distance, the mines yielding an average of not less than $12 per day per man. The gold is found on and within six inches of the surface. Mr. McCaw brings fifty ounces of the gold with him, the largest pieces of which are worth $3 or $4. He received this in trade with the Indians.\"\n\nFrom a new town just springing up, called Whatcom, near Bellingham Bay, on the Gulf of Georgia, a correspondent writes:\n\n\"From the mines the news is quite as favorable as any heretofore received. Mr. Giddings estimates that upwards of $20,000 had been received at Whatcom by merchants within the week preceding his departure, in payment for goods. Miners were arriving and departing every day; those arriving invariably making their stay as short as possible. A party had returned to Whatcom a few days previous to Mr. Giddings' departure, who had proceeded as far as Fort Hope, where they met a large company just from the mines, to whom they disposed of provisions at about 400 per cent. above cost. The miners instantly retraced their steps, while the others returned to Whatcom.\"\n\n\"We were shown by Mr. Giddings a specimen of the gold brought from the mines. It is very fine; and of the kind known as 'scale gold.' By those familiar with it we are informed that it is very similar to the 'placer gold' of California. Among the dust shown us, which amounted to some $200, were several large lumps, beautiful specimens, which were probably worth from $2.50 to $5 each. The gold is of a dark red color.\"\n\nOn the last day of April, a miner, writing from McCaw's Rapids, beyond Fort Yale, on his way up, says:\n\n\"We have prospected on several bars, and on one of them we got from 6c. to 25c. to the pan, and took only the top dirt. On another we got from 5c. to 10c. to the pan. We could not stop at the former place, as the Indians would not allow us, and we were not strong enough for them.\n\n\"The Indians were all-at work themselves, and we saw two or...\"\nthree pans with about 50c. in each. At the latter place we cannot work to advantage without a quicksilver machine. An old California miner says that this place very closely resembles the North Fork of the American River in California, and that he believes richer mines will be discovered here than have ever been discovered in California.\n\n\"A few miles below this there is a party of whites, who were to have a sluice in operation either today or tomorrow. An Indian has just arrived in a canoe, and he tells me the sluice is in operation, and that they are taking out 'kiyu (or plenty) gold.' Major Tidd and Mr. Finnigan have both started to see them.\"\n\nThere is no necessity to multiply instances of individual gains, \"strikes,\" or \"luck,\" to prove that gold exists in abundance. The area of the auriferous country is as yet unknown. It seems to be, in fact, a continuation of the great California gold field running through Oregon (where its treasures have for years past been dug up) and the intermediate American Territory of Washington to the extensive British possessions washed by the waters of the Gulf of Georgia and of Puget Sound on the west, and extending northwardly and eastwardly to the Rocky Mountains.\n\nThere are at present difficulties to be encountered in getting to the mines, owing to the swollen state of the Frazer River and to the country near its banks, being inundated by the freshets which prevail at this season from the melting of the snows of the Rocky Mountains, and in consequence of the \"rapids,\" which necessitate long and wearisome \"portages.\" Several persons have been drowned by the upsetting of canoes, which they were not acquainted with the management of. Indians are to be had in plenty to perform this labor, however, and at moderate wages—$1 a day and meals.\n\nThe following are given as the distances from Victoria to the trading posts of the Hudson Bay Company, en route to the gold fields—viz: from Victoria, Vancouver Island, to Fort Langley, 80 miles; from the latter to Fort Hope, 60 miles; Fort Hope to Fort Yale, 15 miles; Fort Yale to mouth of Thompson River, 110 miles; thence to Big Falls on the Frazer, 75 miles; total, 340 miles to the diggings as yet found to be the richest. The means and expense of getting from the coast to the lower and nearest mines are thus described by a person at Port Townsend:\n\n\"The mines commence about fifteen miles above Fort Hope. Frazer River can be navigated by sailing vessels of considerable size as far as the mouth of Harrison River, or half-way between Fort Langley and Fort Hope. Vessels sailing from Port Townsend\ncharge $10 passage to Fort Langley, and $15 to Harrison River, allowing each passenger to take three months' provisions without charge for freight. At the mouth of the Harrison River the rapids commence, but form no very serious obstruction. Light steamers can go up to the very gold mines, fifteen miles above Fort Hope.\"\n\nSome rival routes to that of the ascent by Frazer River have been tried, but experience is proving that this river affords the safest and easiest route.\n\nThe Pacific Steam Navigation Company's boats, which leave San Francisco twice a month for Puget Sound, will call to land passengers and freight on every trip, either at Victoria or Esquimalt Harbor (close to the former,) Vancouver Island, in terms of an arrangement made last week with the Governor; and it is understood that the Hudson Bay Company will make provision for the conveyance of passengers up the Frazer River, by means of suitable steamers. This river is navigable a distance of one hundred and fifty miles for vessels drawing four feet of water, all which will greatly facilitate getting to the new El Dorado.\n\nThe Indians are said to be behaving, on the whole, very well, engaging themselves in the labor of working canoes, and trading freely. In a few cases they prohibited white men from \"digging\" in their placers, but in other instances, showed a spirit of commendable liberality.\n\nA miner on the spot says: \"The Indians are friendly, and will continue so as long as they remain unmolested.\" This report is corroborated by others. The fact is, these Indians are brave and warlike, well armed with \"shooting irons,\" and skilled in the use of them. They have been accustomed to just treatment from the Hudson Bay Company, and will exact \"justice\" from their new neighbors. The only vice they are charged with is that they give a very loose interpretation to the doctrines of meam and tuum—certainly an inconvenient weakness to travellers adrift among them. They seem, however, to be very civil and obliging thieves.\n\nThe quantity of gold brought by the last steamer from the new mines to San Francisco, as manifested, was only two hundred ounces; but the passengers brought a good deal more. From the quantity offered for sale to-day, it is judged that about $15,000 worth was brought altogether.\n\nA strong desire is evinced here and at the North to ascertain the spot where the chief city, which is certain to spring up, is to be located. The Americans will make a strong effort to have the city in their territory—at Bellingham Bay, probably. They are great adepts at this sort of thing, and unless the English take immediate\nsteps to secure the city on English territory, they may find themselves cut out by their \"faster\" neighbors, who have one advantage in the fact, that the majority of the emigrants will be Americans, who will prefer to \"locate\" on American soil.\n\nThe site once selected, much capital will be attracted to it for speculation in \"real estate,\" to use a slang phrase of ours. Present appearances would point to the main land as a more convenient location for a town to be dependant upon the mines in the interior, rather than to Vancouver Island, separated as it is from the coast by the Gulf of Georgia, although from the following flattering notice of the island, it has also peculiar advantages:\n\n\"The situation for a large town here is almost unequalled—the climate is equal to the South of France. Living is cheap, the resources of the country good. There is a wild grass common on the prairie land here, the root of which is an onion-like bulb, as large as a good-sized thumb, on which pigs feed and keep fat all the year round. The keeping of pigs is a very profitable business. Cattle and sheep get their living all the year round, and keep fat. Stock raising is very profitable—cows and oxen are worth now one hundred dollars per head. There is an abundance of wood of almost every description found in these latitudes. Vegetables are quite equal to, if not better than those of Nova Scotia. There is a vast abundance of fish of the very finest quality—salmon and halibut.\"\n\n[From letters in the Sacramento Union of June 12.]\n\nA. D. McDonald, writing from Stellacoom, May 13th, to a friend, and whose letter appears in the Bulletin, says:\n\n\"Miners are making from $8 to $16 a day, the pan and rocker alone being used. The hopper of the latter is in most cases made of bored cedar. There are not over two hundred men at work, and from the awkward manner in which most of them operate, there are evidently few California miners among them. They are all in exuberant spirits, and from the fact of their having got up the river previous to its rise, and having a supply of provisions to last them for at least two or three months, they are likely to realize their sanguine hopes of speedy wealth, for the facility and ease they have in realizing \"an ounce to the hand,\" was never equaled in any country before. They dig on the banks (not the bars of the rivers, which are covered here with water) from sixteen to eighteen inches deep. Quartz also abounds, and crops out on the surface in many places very conspicuously. A host of Indians are at work\nalong the banks, with wooden boxes or bowls, about twelve inches square, and some with a rude imitation of a sluice, dug out of cedar, about two by five feet, which they place at an angle of about ten degrees. They put the earth into it and then throw water upon it, collecting the gold which remains in the bottom, and panning out in the usual way with their wooden bowls. The dust found here, I would inform the initiated, is, both in quality and description, characteristic of the American River gold; it perhaps resembles the Mississippi Bar dirt, in this vicinity, more than any other; but higher up the stream it is much coarser, and approaches so nearly that it would be taken for Rector's or contiguous bars, on the Middle Fork of the American River. The Fall, Winter and Spring seasons are, on account of the low stage of water in the rivers, the best months, not only for working the mines, but also for navigating the streams. During the Winter, Frazer River can be navigated by canoe some hundreds of miles. It drains a large extent of territory, and has been explored 700 miles. Under present circumstances, I would advise no person to start for the mines before the middle of August.\"\n\nRobert H. Austin writes from Victoria, V. I., on the 23d of May, to his uncle, Joseph Austin, a Justice of the Peace in San Francisco, as follows. The letter appears in the Bulletin:\n\n\"Doane, Homer and myself, since I wrote the within, have been out to Esquimalt. We met with one Cole, whom I had heard of before. He was formerly a Lieutenant in the British Navy. He served in the Russian war, and was at the taking of Sebastopol, where he lost an eye and received a wound in his leg. He has been here mining since March last, on Frazer and Thompson rivers. He assures us that where he was mining, the miners averaged eight dollars per day; and, indeed, that very many of them with a common rocker have realized $150 for a day's work. He has no doubt, he says, but that when the river falls on the bars, they will take it out in much larger quantities. Quartz is found in the mountains about there, with more or less gold in it; and the higher you go up Thompson River, the richer the ground becomes. But 150 miles above Fort Yale the Indians are troublesome, and will not allow the miners to work. Cole leaves to-morrow for the mines again; but thinks it time enough for persons to leave here in about four weeks, when they may be able to go all the way in a whale boat without danger. Little Creighton and a party leave here in the morning by canoes, for Fort Langley, and from thence to the mines.\"\n\nA \"Returned Miner\" gives the Alta the following:\n\"Having just returned on the steamer Panama, from the new gold diggings on Frazer and Thompson rivers, I have determined to write a few lines, as I see other people's statements are welcome. My remarks will probably be desultory and disconnected, so you must fix them up. In the first place, all the news you receive by the steamer looks decidedly favorable, as far as the existence of gold is concerned. The statement is true—gold does exist in this new country, and there is no doubt in my mind that the upper mines are much like the upper mountain mines of California. You know gold was found twenty miles from Sacramento, on the American River, at Mormon Island, and that there is the first commencement of the gold bearing region. And so on Frazer River; the first diggings are not far from the Sound; but there, as here, the richest mines will be found far up in the mountains. Now, what I want to get at is, that, granting the gold country is there, let people intending to emigrate look well before they start. The route to the mines by Frazer River can never be successful as a freight line of traffic, as it is impassable twenty miles above Fort Yale, and the trails are almost hopelessly impassable for any human being, not to speak of horses and mules. The latter are not to be got there, and the former are utterly useless in that country. You must see it is impossible to get provisions to the upper mines by the river. All the provisions on the head waters of these rivers have been brought from the Colville country, by the half-breed traders of the Columbia River. The people who get to the interior mines first, must take their own provisions on their backs, their blankets, their tools, etc., all added to their pack, to be carried over a terrible road, from 60 to 150 miles. All the towns on the Sound are now endeavoring to get trails through to the mines and each is asserting that the other's trail is impracticable, until you cannot believe any of them. I know none of them have yet succeeded, and none can say whether they will, or if so, when. For my part, I cannot tell what is going to become of all the crowd now going to Puget Sound, because they must all stop on the river below the falls, or pack, as I said, their food, blankets, tools, etc., as there are no trading posts stocked with goods in the land to which they are going.\"\n\n\"If a trail can be opened through the Coast mountains into the valley of the Columbia, and from thence into the upper mining regions, the travel would not be so bad. Pack horses could be used, and the route would be through American territory.\"\n\nA Correspondent of the New York Advertiser, writing from Victoria, Vancouver Island, June 9th, gives the following interesting facts relative to the new gold region:\n\"I arrived here on the 15th April last. It was only a few weeks before that gold was discovered in British Territory on Frazer River; since which I have been carefully watching events, and getting all the information relative to the gold regions and the resources of this fine country. It is now fully confirmed and universally admitted, that this is the third great Eldorado, and the mines, as far as known, exceed in riches those of California in 1849, and cover a vast extent of country. The higher they ascend the rivers, the richer the mines and coarser the gold. But miners do not go very far up at present, not being sufficiently strong to defend themselves against the Indians. Immigration has commenced from Washington and Oregon Territories, and from California alone about two thousand arrive weekly at the mines. We anticipate a very large immigration, and from the Pacific coast alone nearly a hundred thousand, it is expected, will arrive by November next. This island contains about twenty thousand square miles. It abounds in excellent harbors, vast forests of good timber, a great abundance of fish of the finest quality, very extensive beds of coal, and the best description of lands for agricultural purposes. It has a remarkably fine climate, resembling the west coast of France. It has also quartz and other gold mines with copper, iron, &c. Of the continental portions of this extensive country but little is known, except by the Hudson Bay Company, who rigidly conceal all they can from the world.\n\n\"Victoria has a small harbor. Vessels drawing eleven feet can enter at low water. Esquimalt, three miles distant, has one of the finest harbors in the world. It is the British naval depot. A town is being built out there to be incorporated with Victoria. All large vessels and steamers put into Esquimalt; small vessels into Victoria. There are little or no port charges, except lighterage, there not yet being any wharves. There are no duties on any description of merchandise, this being a free port. There are no taxes of any kind, except a license for selling liquors. The expenses of the colony are paid by sales of public lands. All persons of all nations are allowed full privileges to trade on this Island, but on the adjoining continent, the Hudson Bay Company claim the exclusive right of trade and the navigation of its rivers. Miners are permitted to ascend Frazer River in canoes by paying $6 for a permit, and each to pay one guinea per month as a license for mining. The Hudson Bay Company, however, have permitted a steamer to run up Frazer River lately, which they say will be continued until action is taken by the British Government, who will take the colonization of the country into their own hands in two or three months.\"\n[From the foregoing extracts the reader will notice the following facts:\n\n1. The distance by Frazer River to the centre of the gold-bearing region, is 340 miles. The sources of the Saskatchewan, to which an immigrant could go in a wagon, are no more remote.\n\n2. A \"returned miner,\" it will be seen, recommends communication with the Gold District from the Upper Columbia, but the river last named is only a few days journey, through favorable passes, from the Saskatchewan plains.\n\n3. Observe the testimony of McDonald, that the Fall, Winter and Spring are the best seasons for mining. This is sufficient testimony to the mildness of the climate.\n\n4. There is accumulated evidence that the Indians, on the Northern routes, are not hostile.\n\n5. In the last place, all doubts as to the richness of the gold fields are removed, and the most important fact is elicited, that the most valuable \"diggings\" are near the sources of the streams—thus shortening the requisite route from Minnesota. Indeed, the waters of the Columbia, within three or five days of the Saskatchewan plains, may prove the most desirable for gold seekers.]\n\nAPPENDIX NO. III.\n\nGEOGRAPHICAL DESCRIPTION OF MINNESOTA NORTH OF LATITUDE FORTY-SIX.\n\n[From a communication by J. W. Taylor, to the St. Paul Advertiser of January 31, 1857.]\n\nThat portion of Minnesota which lies north of latitude 46 deg. and east of the Red River, is as large as the State of New York, which has an area of 47,000 square miles or 30,800,000 acres. It is difficult to realize this fact, but a moment's computation from the outlines of a map will establish it, and I venture the further state-\nment that no larger portion of north-eastern Minnesota is unsuited to settlement than of New York. Admit all that is charged against the district east of Pokegoma Falls and extending from Lake Superior to Rainy Lake—that it is a sterile waste of primary rock, useless forests and desolate swamps,—that nineteen twentieths of the country will never be occupied.—The case is put strongly; but New York presents its full parallel, in what is known as John Brown's Tract, or the Adirondack Region, which, with a diameter of one hundred miles, has hitherto resisted the settlement of north-eastern New York. Its eastern margin, along Lakes Champlain and George, has been settled, and so will the plateaux extending along the immediate Minnesota shore of Lake Superior be found desirable to the emigrant, as well for the mineral wealth of the rugged coast, as for the fertility of the inland ridges, with their growth of sugar maple. The Minnesota vicinity of the Vermilion, Swan and Sandy Lakes, east of the Mississippi, is similar in its geological features to the Adirondack desert east of Lake Ontario—it is frankly surrendered to the same fate; and having thus cleared our decks, we will proceed to further points of analogy between the Empire State and our embryo State.\n\nThe purpose in such a comparison is not to exhibit features of physical resemblance—only to establish an equal capacity for agriculture. There are innumerable lakes in northern Minnesota, but New York has a considerable surface of inland waters, while the highlands which divide the Minnesota streams are always cultivable, in this respect differing from the Catskills, and the northern spurs of the Alleghanies. It will be seen from the annexed details, whether the equivalent of western or central New York can be found in the more favored sections of northern Minnesota.\n\nThe materials at our disposal may be arranged into geographical districts. 1, The Rainy River district. 2. The vicinity of Red Lake. 3. The sources of the Mississippi. 4. The valley of the Red River, and 5. The Otter Tail Lake Region. The channel of the Mississippi from Crow Wing to Pokegoma Falls—the future head of steamboat navigation on that river—is presumed to be sufficiently familiar to the reader.\n\n1. THE RAINY RIVER DISTRICT.—This river, after emerging from the wilderness of peninsulas and islands, which confuse the traveler in Rainy Lake, flows northwest into the Lake of the Woods, its channel constituting the international boundary. In Sir GEORGE SIMPSON'S \"Overland Journey around the World,\" occurs a glowing description of Rainy River in this section of its course.—\"From Fort Francis downwards,\" writes the well-known Governor of the\nHudson Bay Company, \"a stretch of nearly a hundred miles, it is not interrupted by a single impediment; while yet the current is not strong enough materially to retard an ascending traveler. Nor are the banks less favorable to agriculture than the waters themselves to navigation; resembling, in some measure, those of the Thames near Richmond. From the very brink of the river there rises a gentle slope of green sward, crowned in many places with a plentiful growth of birch, poplar, beech, elm and oak. Is it too much,\" he continues with enthusiasm, \"for the eye of philanthropy to discern through the vista of futurity, this noble stream, connecting as it does the fertile shores of two spacious lakes, with crowded steamboats upon its bosom and populous towns on its borders?\"\n\nIf this is a faithful description of the river, is it not reasonable to anticipate that the valleys of the streams, which the map discloses as tributary to it on the south, are equally desirable? One very important circumstance remains to be stated. Mr. Henry R. Schoolcraft, in a communication to Silliman's Journal of Science, (March, 1855), refers to \"recent information of a reliable character,\" that on the western coast of the Lake of the Woods, and south of the national boundary, large deposits of coal exist.\n\n2. The Vicinity of Red Lake.—It is enough to characterize this portion of Minnesota, to mention the success of the missionary farm at the southern extremity of Red Lake. No crop is surer or more abundant than Indian corn—a fact significant to every farmer of successful agriculture. The outlet of Red Lake falls into the Red River of the North, and at its junction with that stream is represented by Dr. Owen as a hundred feet wide, discharging waters of a reddish brown cast. Such a circumstance, in the case of the Missouri river, indicates the fertility of the country which is drained.\n\n3. The Sources of the Mississippi.—Perhaps a district of five hundred square miles—about the area of Hennepin county—must be surrendered to the wide and flattened bed of the Mississippi, before it forms and proceeds through a clearly defined channel. This undine wilderness is described by Nicollet as clogged up with intermediate spaces of clear water, looking like channels; but among which it is difficult to discover the true course of the river, for at certain seasons of the year the whole is nothing more than a marshy prairie. Thence to Pokegoma Falls, the prominent objects to the descending traveler are the Lakes Pemidji, Cass, and Wini-bigosish. Of these we give a few particulars from well-known explorers. Of Lake Pemidji, Nicollet remarks:\n\n\"It is a magnificent sheet of water, from ten to twelve miles...\"\nlong, with a breadth of from four to five, perfectly clear and without islands; the eye having a free command over gently swelling hills, receding and thickly-wooded; and it is said that no river but the Mississippi empties into it, save an obscure inlet at its northern extremity. I must confess,\" adds the Swiss savant, \"that in crossing it, I felt melancholy, that even within my artificial optics I could not descry any evidences of civilization—no cottage of the agricultural, no meadows, no herds, nor any of those cultivated fields, whose mellow shades contrast so gracefully with the foliage of the forest.\"\n\nNICOLLET describes Lake Cass as \"another beautiful sheet of water studded with islands.\" Dr. J. G. Norwood, of Owen's Survey, says that its waters are clear, and the islands bear red cedar, while along the shore, which fell under his observation, the hills rise to the height of twenty and thirty feet above the lake and are covered with oak, ash, aspen, pine, and some small birch, the low grounds bearing a good growth of elm.\n\nLake Winibigoshish is represented by Dr. Norwood, to differ from Cass and Pemidji, in not being clear and pure, owing, as he conjectures, to some peculiarity of its bed. It is about twelve miles in diameter, and destitute of islands. On the south-west, the shores are lined with tamarac swamps, and on the north-east by gentle undulations bearing oak, maple, and other hard woods. The soil of the higher lands is good, and corn and potatoes can be cultivated to good advantage. Dr. N. remarks, that the clay beds which abound on the Upper Mississippi, contain a great deal of calcareous matter, and when mingled with the sand which overlays them, which also contains limestone gravel, form a strong rich soil.\n\nLeech Lake, the basin of which is skirted on three sides, by the winding channel of the Mississippi—west, north and east—is an interesting body of water, thus described by NICOLLET:\n\n\"The circuit of Leech Lake, including its indentations, is not less than one hundred and sixty miles. It is next in size to Red Lake, which is said to be 200 miles in circumference. The former has twenty-seven tributaries of various sizes. A solitary river issues from it, known by the name of Leech Lake River, forming an important outlet from one hundred to one hundred and twenty feet wide, with a depth of from six to ten feet. It has a moderate current, without any obstruction, and flows into the Mississippi (not far above Pokegoma Falls,) after a course of from 45 to 50 miles.\n\n\"To be more particular in the description of Leech Lake, I may add that it has nine large bays, presenting six prominent points, and its depth varies from six to ten fathoms. The fish of the lake,\nthe wild rice of the bays, and maple sugar, are the three great natural resources of the Chippewas. The fisheries are abundant at all seasons, but it is principally in the spring and fall that they are most so and are carried on to much advantage. With two nets, set over night, from 400 to 600 fish may be calculated upon by the next morning, which are dried for winter provisions. ** The white fish, which is taken in Leech Lake, is said by amateurs to be more highly flavored than even that of Lake Superior, and weighs from three to ten pounds. As the name indicates, this lake swarms with leeches, and amphibious reptiles. There are several species of terrapin and turtle, of which Mr. Say has described three of each kind in the appendix to the second expedition of Major Long.\"\n\nThe rice-plant, like the cranberry, goes far to redeem the marshes which it covers. Dr. Nonwood estimates that an acre of this rice is nearly or quite equal to an acre of wheat for sustaining life. Dr. N. thus closes his description of the sources of the Mississippi:\n\n\"In this connexion, it may not be out of place to remark, that, so far as the mere support of life is concerned, taking into account the amount of labor required to do it, this region is equal, if not superior, to many portions of the settled States. The rice fields, which require neither sowing nor cultivating, only harvesting, cover many thousands of acres, and yield all that is essential for bread-stuffs; but in addition to this, corn can be cultivated with as little or less labor than in the middle States. Potatoes far superior in size and flavor, to any I have ever seen in the Ohio Valley, are grown with little attention; and turnips and beets produce abundantly. Extensive natural meadows border the lakes and streams, the luxurious grasses of which are sweet and nutritious, and eagerly eaten by cattle; while the streams and almost innumerable lakes abound with a great variety of fish of the first quality, and which may be taken at all seasons with little trouble. The uplands are generally covered with a good growth of both hard and soft woods, sufficient for all the wants of man. The sugar maple is abundant, sufficiently so to yield a supply of sugar for a large population. In addition to all this, the forests are stocked with game, and the lakes and rice-fields, must always, as they do now, attract innumerable flocks of water fowl.\"\n\n4. THE VALLEY OF THE RED RIVER.—We have the authority of Capt. John Pope, who ascended the Red River of the North in 1849, that the average depth is five feet at the junction of the Sioux Wood River, and fifteen feet at Pembina. Its head of steamboat navigation is about 46 deg. 23 min., where the stream cuts deeper into the clay, which forms its substratum for three hundred\nmiles, rendering the waters turbid. No rapids or obstacles occur to the British line or beyond; the current of the river is moderate, running about a mile and a half an hour; the western bank is a vast plain, but on the east, while the country is level, a belt of timber usually adjoins the stream; the soil is congenial to the ash, which tree attains a large size in some localities; below the mouth of the Red Lake Fork, strong chalybeate springs ooze from the clay-banks; saline springs have also been discovered; and in addition to these particulars Dr. Owen mentions that \"the air along Red River from the mouth of the Psihu to the Pembina settlements, (latitude 47 to 49) is scented during the months of June and July, with a delightful perfume arising from the wild roses, which form a thick shrubbery along its banks.\"—Very probably, the margins of the Red River will be subject to inundation in the Spring, but all accounts concur that no more productive region—the soil being eminently adapted to cereal cultivation—has been discovered on the continent.\n\n5. The Otter Tail Lake Region.—Capt. Pope, in his exploration of 1849, remarks that for fifty miles in all directions around Otter Tail Lake, is the garden of the Northwest. The outlet of the Lake, constituting the source of the Red River of the North, has been very favorably described by Dr. Owen. It presents a succession of lakes and rapids, while, at other points, rolling prairies extend from its banks, crested with beautifully dispersed groves of timber. It was in this section of Minnesota, that the magnesian limestone containing silurian fossils, identical with those in the bluffs of the Minnesota and the Mississippi below St. Paul, was recognized by Dr. O. in place—showing that the primary formation, which divides Minnesota from northeast to southwest, is succeeded to the northwest by the ascending series of sedimentary rocks.\n\nI have repeated the remark of Capt. Pope, that the vicinity of Otter Tail Lake, for fifty miles in all directions, is superior to any other portion of Minnesota; to Daniel Rohrer, Esq., of St. Paul, who has frequently traversed the district in question, and that gentleman more than confirms the statement. Westward, for at least one hundred miles, or to the great plains, he assures me, northward to Red Lake, if not beyond, and east to the Mississippi, the country is destined to attract and sustain a denser population than the Minnesota Valley. No more favorable distribution of beautiful prairie, wood and timber, can be imagined. The lakes are numerous, but small, and almost invariably skirted with timber, the sugar maple largely preponderating.\nSeldom is the traveler out of sight of these groves, while the soil is unsurpassed. Mr. R. concurs, that the whole country between the meridian of Pokegoma Falls, on the Mississippi River, and the Red River of the North, is sufficient in area and capacity, to triumphantly sustain a comparison with the most desirable sections of New York.\n\nAPPENDIX NO. IV.\n\nROUTES THROUGH MINNESOTA TO THE NAVIGABLE WATERS OF THE RED RIVER OF THE NORTH.\n\nSituated as Minnesota is, with a length from South to North of four hundred miles, the transverse routes connecting the Mississippi and Lake Superior with the navigable channel of the Red River of the North, are quite numerous. They will be described in an order progressive from the Southern to the Northern boundary of the State.\n\n1. SOUTHERN INTERIOR ROUTE.—Travellers may leave the Mississippi opposite Prairie du Chien and La Crosse, or at Winona, and after leaving the river bluffs, a beautiful plateau is reached from which streams diverge in opposite directions to the Mississippi and the Minnesota. In addition to the agricultural advantages of these southern counties, unsurpassed by any equal area on the globe, the divide between the sources of Root, Zumbro and Cannon Rivers, and the tributaries of the Mankato and Minnesota, is very favorable for the passage of waggons. The Big Woods, a belt of forest, extending from Northeast to Southwest through the prairie districts of Minnesota, ranging in breadth from twelve to sixty miles, constitute almost the only serious obstacle to a party moving North-westwardly to Red River.\n\n2. THE ROUTE FROM MINNEAPOLIS TO BRECKENRIDGE.—This route,\nwhich with an extension eastward to Stillwater, of twenty-five miles, forms the main line of the Minnesota and Pacific Railroad, was fully explored in the summer of 1857, by parties under charge of C. H. Allen and Charles C. Smith, Division Engineers. Mr. Allen who conducted the survey and location of the Western half of the line, (about one hundred and twelve miles) had the satisfaction of communicating particulars previously unpublished, of an interesting region, watered by the tributaries of the Upper Minnesota, and as large as the State of Massachusetts. The reconnoissance, conducted by Mr. Smith, was of the Eastern section of this route, or from Minneapolis westward through the Big Woods. From the notes of these gentlemen, it appears that west of Minneapolis, the first ten miles is undulating prairie; the next sixty miles traverses the Big Woods; about one hundred miles is a succession of prairies, scattered with groves, and diversified by lakes; while the last forty miles, to the mouth of Sioux Wood River, is through a plain or savanna, without timber, streams or lakes, but bearing a remarkable growth of nutritious grass, and consequently not lacking moisture. The district between the valleys of the Upper Minnesota and the Mississippi, (the section explored by Mr. Allen,) is represented to equal in beauty and fertility the richest portions of Southern Minnesota. The timber and soil in the \"Big Woods,\" is thus described in the report of the Chief Engineer of the Minnesota and Pacific Railroad Company:\n\n\"From a point ten miles west of Minneapolis, extends the \"Big Woods,\" a dense forest, dotted with myriads of beautiful lakes and natural meadows. As crossed by the main line this forest is nearly sixty miles in breadth. The timber is very heavy, and consists of oak, maple, ash, elm, basswood, black walnut, butternut, aspen, and second growth hickory. Unlike the growth of most forests, these different varieties of timber are distributed in the same proportions and reach as great perfection upon the high as the low lands, indicating an unusual degree of equality in the soil, which is a black vegetable mould from two to three feet in depth, resting on a subsoil of clay; and in the ordinary acceptation of the term, is inexhaustible.\n\n\"Among the few scattered tracts, as yet brought under cultivation, are found abundant evidences of its great fertility. Winter wheat, corn, oats, and potatoes, sown or planted in an opening barely large enough to admit the sun's rays, and usually not half cultivated, afford large returns. The numerous meadows yield a full supply of excellent grass for the subsistence of stock, the want of which forms a serious drawback upon the settlement of most\ntimbered countries. It is rapidly filling up with a good class of settlers, and will soon rival any portion of the Territory in density of population and agricultural wealth.\"\n\n3. From St. Cloud by way of the Sauk Valley to the mouth of Sioux Wood River.—The valley of the Sauk River, as described by Capt. Pope and Gov. Stevens, is extremely fertile, consisting of an agreeable succession of small prairies and woodlands. After leaving its sources and the numerous beautiful lakes of that vicinity, the route to the head of navigation on Red River, \"is an extended savanna, presenting no obstacle to waggons.\n\n4. Crow Wing by way of Otter Tail Lake.—It is deemed advisable, in the first instance, to describe the route along the Eastern bank of the Mississippi River from St. Anthony to Crow Wing, being a section of the branch line of the Minnesota and Pacific Railroad. Here the report of D. C. Shepard, Esq., Chief Engineer of the Company, is available:\n\n\"The surface of the Upper Mississippi Valley,\" he remarks, \"is pretty evenly divided between prairie and oak openings, with occasional marshes, bearing a fine growth of tamarac. An exception, to this, however, is the western slope of the valley from St. Cloud to Crow Wing, which is principally covered with a heavy forest growth. The soil is usually of a light sandy character, though much more fertile than its surface indicates. Some portions of it have been under cultivation for many years without giving any signs of exhaustion, and an examination of the crops grown during the past season, is conclusive as to its capability of enduring a protracted drought. Although it cannot be called a first rate Western soil, it is sure, easy of tillage, and produces well. The accessibility of this valley at all seasons, by means of excellent roads, has conduced largely to its prosperity. It already numbers many flourishing towns, among which are Anoka, St. Cloud, Sauk Rapids and Little Falls.\"\n\nWith these preliminary statements, we proceed to a sketch of the route above indicated, still employing Mr. Shepard's language:\n\n\"The region between Crow Wing and Otter Tail Lake, a distance of about sixty miles, is usually represented as possessing but little agricultural value, except in some few isolated portions, but is well timbered with pine, oak, maple, basswood and tamarac. Immediately on passing the summit between the Mississippi and Red Rivers, at Otter Tail Lake, a decided improvement in the soil and general aspect of the country occurs. From Otter Tail Lake to Pembina, along the route of the trail, the surface is rolling prairie interspersed with fine groves of timber, amply sufficient for the\nnecessities of a dense population, and well watered. Its soil is universally described as excellent, and many do not hesitate to declare it superior to any other in the Territory. There can exist no reasonable doubt of its perfect adaptation to the purposes of agriculture.\"\n\nCanoe Routes Through Northern Minnesota.—An examination of the map, and of the geographical sketch of Northern Minnesota, reproduced in this Appendix, will indicate that travelers may proceed by water communication from Crow Wing by Gull and Leech Lakes, and from Superior by the St. Louis and Savanna rivers to Sandy Lake and the Upper Mississippi—both routes connecting in Cass Lake, and thence proceed through Red Lake, and the navigable stream forming its outlet to the Red River of the North.\n\nAs there is a probability that St. Vincent, or Pembina, (which is the northern terminus of the branch line of the Minnesota and Pacific Railroad,) or the Selkirk settlements near the mouth of the Red River, will be prominent points of outfit for the overland trip to New Caledonia, many will prefer to make this canoe voyage, and may be interested by a sketch of its incidents. Some notes of such a voyage by Maj. E. A. C. Hatch, a gentleman long resident in the Northwest, have been politely furnished, and are appended in his own form of a daily diary:\n\n1853—August 26.—Cold, windy, rainy day. We made a portage to Gull Lake—distance 14 miles; concluded to remain the night with Mr. Stateley, government blacksmith, having made a start, which is all that is expected on a voyage of this kind for the first day.\n\nAugust 27. Beautiful morning. Started across the lake with my canoe, a small bark one, and my crew consisting of two Chipewa half-breeds. Crossed the lake and made a portage of one and one-half miles into another lake. We make these portages very quick; the manner of proceeding is as follows: immediately upon the bow of the canoe touching the shore, the men spring overboard and commence unloading. As soon as this is finished, one man takes the canoe and paddles upon his head and starts off on a trot, the other man gathers the luggage, consisting of blankets, provisions, cooking utensils, &c., and trots after him, and the passenger goes trotting on behind. We passed through the second lake and made a portage of two miles to the third lake; crossed that and made a portage of three miles to the fourth lake; this proved to be more of a marsh than lake, the men being often obliged to wade and drag the canoe. It was only about one and one-half miles through it, and we then made a portage of one mile.\ninto Pine River. This stream where we entered it was about a stone's throw across and very shallow. After running up it about five or six miles, we passed through a large rice lake where we saw a number of Chippewas gathering wild rice. We passed through this lake into the river again and camped for the night.\n\nAugust 28. Fine morning. We started at 6 o'clock; traveled on up Pine River about one and a half miles and made a portage of six miles across a bend and to avoid rapids. We breakfasted at the upper end of the portage. After breakfast we paddled on up the river, occasionally passing through a rice lake, until 12 o'clock, when we made a short portage into the fifth lake. This lake was about one and a half miles long and half a mile wide; passed through it and made a portage of twenty feet into the sixth lake, a beautiful lake about two miles across, water very pure; crossed it, and made a portage of half a mile to the seventh lake. Crossed this (one mile) and made portage of one and a half miles into the eighth lake. Passed through it, and portage one mile, into the ninth lake. We dined here at 2½ o'clock. This lake is about five miles across with a very pretty island in the center. Crossed the lake to the mouth of a creek; went up the creek about two miles, found the water so low that we were often compelled to wade and drag the canoe. Passed from this creek into the tenth lake, which was quite shallow, several large rocks showing themselves above water. Crossed it and entered another creek; made our way up this, one and a half miles, and then made portage of half a mile into the eleventh lake. This was three miles where we crossed it. We entered another creek, paddled up it about two miles, and into the twelfth lake; it had rather an insignificant appearance when we first entered it, but we soon found it worthy of notice; it increased in width, every point we passed. Night overtook us, the wind blew a gale and we had to make for shore, and barely escaped shipwreck. This was Trout Lake, so called from the Mackinaw trout which are taken from it.\n\nAugust 29. Weather unchanged—no wind. The lake looked beautiful this morning, with its glassy surface, smooth beach, &c., but we had no time to admire the beauties of nature. We were off at 6 o'clock. Made passage of one and a half miles into the thirteenth lake—this was nearly round and two miles across. We crossed it and made portage of two miles to a creek, descended the creek one-fourth mile into Leech Lake. This lake is probably twenty miles long and ten wide at its greatest width. There is much good soil and maple timber in its vicinity. Numerous islands, at one of which we stopped to breakfast. We passed through the\nlake about twelve miles to the mouth of a creek, ascended the creek seven miles and entered the fifteenth lake, one and a half miles across. After crossing this we made a portage of three miles into the sixteenth lake, which was about one mile across. We dined here—weather very warm. Crossed the lake and made a portage of one mile to the seventeenth lake. This was Cass or Red Cedar Lake; its first appearance from where we struck it was that of a lake about three miles across, but after crossing this we passed through a natural channel or canal a few rods long into the main lake about ten miles wide. We crossed and reached the opposite shore after dark, at the mouth of a small river near the Missionary Station, and camped.\n\nAugust 30. Weather same. We traded some flour with a half-breed for white fish, and bought a few potatoes of the missionaries. We paddled up the creek about seven miles and stopped for breakfast; ascended the stream about sixteen miles further and took dinner. We found some good soil on the banks as well as about Cass Lake. After dinner we traveled four miles more up stream and entered the eighteenth lake. We passed through this six miles and then made portage of two and a half miles to the nineteenth lake, where we camped for the night.\n\nAugust 31. We were up and off at 5 o'clock. We crossed the lake (two and a half miles) and made portage half a mile into twentieth lake. Passed through this four miles and made portage of one mile into twenty-first lake, about two miles wide, crossed it and stopped for breakfast. We here left the waters which flow into the Mississippi and made portage of one and a half miles into the twenty-second lake. We passed through this lake about two miles and down the outlet about three miles, when it widened into a rice lake in which were a large number of Indians gathering rice, and in less than five minutes we were surrounded by thirty or forty canoes. After exchanging news with them we passed on down the outlet about two miles to Grand Portage. We here left our canoe, made up our packs, and started across the portage. We got through to Red Lake (fifteen miles) before dark, found our trading establishment, and our missionary ditto. Went to the mission, were kindly received and hospitably entertained. These missionaries are not compelled to import much for food, raising an abundance from their own gardens.\n\nSept. 1, 1853.—Clear, calm morning; Red Lake, with its unruffled surface and surrounding scenery, was truly beautiful; it was much the largest on the route, probably twenty miles wide and thirty long and connected by a short natural canal with another\nnearly as large, both are commonly recognised as one and called \"Red Lake.\" My men both left me here, one pretending that he was sick, and the other that it was necessary that he should return to his family; but a rumor of a disturbance with the Sioux, and the possibility of meeting a party of them when we should reach the prairies, probably was the real cause of their desire to return, but as I was enabled to supply their places immediately with two brothers, who resided here, and were reputed excellent voyageurs, I did not object to the change. I had some difficulty in procuring another canoe, but finally succeeded in purchasing a small one for six dollars. As my man desired to make some preparations for the trip, such as making moccasins, paddles, &c., I concluded to spend the day with the missionaries. I was entertained by them with a history of their settlement, progress and future hopes in regard to the civilization of these Indians. I could, and can do no less than wish them success, but I fear they have imposed upon themselves a hopeless and a thankless task. The Indians have raised more corn and potatoes than they could consume for several years past, and we had upon our table excellent bread made from wheat raised here and ground in a hand-mill.\n\nSept. 2.—Beautiful morning, slight breeze, but not enough to detain us. We were off at nine o'clock, were four hours crossing the lake to the outlet; we stopped to dine and then ran down the river until dark and camped. This stream is large enough apparently to float any steamer that navigates the Upper Mississippi. We saw great numbers of ducks and geese, I also saw a woodcock fly across the river. A heavy shower passed over us soon after we camped and we got well soaked. We were much troubled with musquitoes at this camp.\n\nSept. 3.—Very foggy morning. We started at five o'clock, traveled down stream until eight o'clock, stopped for breakfast; while eating it commenced raining. We found growing here, near the bank, large quantities of plums and high-bush cranberries; the banks were literally red with the latter in many places from this point down to the mouth of Thief River.\n\nWe paddled on and it soon cleared off and was quite pleasant until two o'clock, when we halted to dine; after dinner it again commenced raining and we travelled in the rain until half-past six o'clock, when we camped for the night, being uncomfortable, bedding quite damp.\n\nSept. 4. Cool and cloudy, off at six o'clock, current stronger, breakfasted at eight; passed first rapid at ten, a favorite place of the Chippewas for spearing sturgeon which run up there in the spring\nin great numbers. We came in sight of the first prairie, after passing one or two more rapids, about eleven o'clock; this was the mouth of Thief River and our point of debarkation. Our object in taking the land route from this place, was to save time, as we could go afoot to the mouth of the Pembina River in less time than to follow the Red Lake and Red River, the distance being probably not one-fourth as great. We soon made a cache of our canoe, a few pounds of flour, potatoes, &c., taking with us our blankets and a little corn bread, which we had procured at Red Lake, depending upon our guns for provisions. We started on, traveled one mile across prairie and then struck into a slough interspersed with poplar thickets; this was probably six or seven miles across and the water two feet deep the greater part of the distance, through which we were compelled to wade; the grass was about five feet high, which made it very tiresome, but we got through it very well considering the shortness of our legs and depth of the water. Traveled until dark, striking into the cart road from St. Paul about sunset. We were compelled to camp without water for cooking; very unpleasant, having so much more than was needed in our garments. Went dinnerless and supperless to bed in a clump of poplars; rained all night.\n\nSept. 5.—Cool morning; started on at half past five o'clock. We reached water at seven, called Snake River, the snakes may have been there but the river had disappeared, we found water enough for our purposes, however, in the holes, and took breakfast. We travelled over a prairie until ten o'clock, then through a poplar thicket two miles; crossed Snake River again, found some water at this point; on over prairie and through timber until half past one o'clock; stopped to dine at Tamarac River, nice little stream; prairie chickens and pheasants for dinner. Travelled over prairie balance of the day and camped at dusk in a hollow; not much timber, plenty of water. We here met a party of Englishmen who had been out on a hunt and were on their way to St. Paul.\n\nSept. 6.—Took breakfast at camp; on over prairie fifteen miles and dined at one of the Two Rivers. Travelled slow, as we could not reach Pembina in one day we concluded to make two easy days. Soil excellent and timber increasing in quantity and quality. Crossed the other river at four o'clock; found collector of customs and another man camped here with horse and cart and concluded to stop over one night with them; dried buffalo meat for supper.\n\nSept. 9.—Travelled over prairie, in sight of timber most of the time; twenty miles to Pembina; crossed river in a canoe; river ten\nfeet deep; banks thirty feet high on west side; higher on east bank. Soil excellent, timber plenty; five houses occupied, all on west side; one mile to the 49th parallel.\n\nSept. 10.—I remained at Pembina the eighth and ninth to recover from the fatigue of the trip. Started today at 12 o'clock for Pembina Mountain, or St. Joseph, as it is now called. We traveled over the prairie thirty miles, and reached the mountain in good time, having taken advantage of an opportunity which presented itself for a ride. The prairie today was a rich, black soil, covered with a very heavy growth of grass, mixed with wild pea vine, making the finest grazing district I have yet seen. The immediate valley of Pembina River is well timbered, and our course was nearly parallel with, and not far from it.\n\nSept. 11.—As it was dark when I reached here, I arose early to satisfy my curiosity, that is, to see the mountain. It was a lovely morning, and I walked to the summit—probably one hundred and fifty feet high, and is nothing more than the river bluff, which here breaks off, running off at a right angle from the river, and not appearing again near it below. But still, insignificant as this hill appeared to me, compared with what I had expected, the view was well worth the trouble of the ascent. At my feet lay the village, consisting of twelve log houses and fifty skin lodges. In the rear, the bluff stretched away, as far as the eye could reach, covered with burr oaks. Beyond the village was the prairie, with cattle and horses. Taking it all together, it was certainly a lovely spot. Remained here until\n\nSept. 14.—Fine morning—started for home—went to Pembina—crossed the river and camped.\n\nSept. 15.—Rainy, disagreeable morning. Went to a point of timber and dined—to our old camp at first of Two Rivers for the night.\n\nSept. 16.—Started at sunrise—went to second river to breakfast. On across third river, and took dinner on the prairie. While eating dinner, we were joined by a small party of Chippe-was with a Sioux scalp on a pole. After dinner we went to old camp for the night, (where we met the Englishmen.) This I think was one of the worst nights I ever passed upon the prairie in the summer. It rained until near daylight, and there was not a dry thread about the camp. The wind blew a perfect hurricane, and the lightning was so incessant, and the continuous roll of thunder so deafening that it was impossible to sleep.\n\nSept. 17.—It was a clear, fine morning. We did not travel very fast today. Stopped at Tamarac River to dry our blankets; camped at Snake River.\nSept. 18.—Started early. Went to second crossing of Snake River to breakfast. Traveled on across prairie and through the slough, and reached our canoe about sunset. Soon commenced raining, and rained all night.\n\nSept. 19.—Started up river—killed a few ducks—camped at half past six—rained all day.\n\nSept. 20.—Fine morning once more. Off before sunrise. We made a very good run to-day, and killed plenty of ducks, so that at night when we camped, we concluded to eat our fill once more, having been half starved for the last week. One of my men had brought along some buffalo marrow fat, which he had procured of some half-breeds at Red River, and he used that for shortening, as he called it. He cooked about four quarts of potatoes which we had taken from our cache—made the flour into bread, and boiled sixteen ducks. Three Indians were traveling in company with us in another canoe; we of course invited them to sup with us. When we had finished, there was not a particle of provisions left, except three or four ducks that were reserved for breakfast, and had not been cooked.\n\nSept. 21.—Off at half past five o'clock; did not stop once during the day; reached Red Lake at two o'clock, and the Missionary Station before dark.\n\nRemained at Red Lake the 22nd, and started on.\n\nSept. 23.—We crossed the portage and left in our canoe at three o'clock; on up the creek; through Rice Lake; up the creek into Lake No. 22; across portage one and a half miles to Lake No. 21 and camped.\n\nSept. 24.—Started across lake at five o'clock; crossed portage one mile to Lake No. 20; across lake four miles, portage quarter of a mile to Lake No. 19; across lake two and a half miles and breakfasted; crossed portage two and a half miles through lake and down creek to Cass Lake.\n\nSept. 25.—Started before daylight, in order to get across lake before wind should blow, but were compelled to put behind a point soon after daylight and were wind bound four hours; started on at half past eleven and camped within a half mile, and in sight of Leech Lake.\n\nSept. 26.—Started early; through Leech Lake; up creek; over portage three miles; lake one and a half miles, portage quarter to Trout Lake; through it and down creek two miles, across lake three miles; portage one mile into creek and down creek, one and a half miles into Lake No. 10; through lake and down another creek, found it long, and made a portage into Lake No. 9,\nCLIMATOLOGY OF MINNESOTA.\n\nthrough it; portage one mile into Lake No. 8, through lake, portage half a mile to Lake No. 7; through lake over portage, &c., and camped on Pine River.\n\nSept. 27.—Worked hard all day; made twenty-two miles of portages besides the canoeing.\n\nSept. 28.—Arrived at Agency at nine o'clock.\n\nAPPENDIX NO. V.\n\nCLIMATOLOGY OF MINNESOTA.\n\n[Extract from a Report of D. C. Shepard Esq., Chief Engineer of the Minnesota and Pacific Railroad Company, January 12, 1858.]\n\nNo region which at present engages the public mind, as a field for settlement, has been so grossly misrepresented in regard to peculiarities of climate as Minnesota. Fabulous accounts of its Arctic temperature, piercing winds, and accompanying snows of enormous depth, embellish the columns of the Eastern press, to the no little injury of this Territory. An examination of this subject, and especially in relation to the snows and winds of winter, as opposed to the operation of lines of railroad, seems necessary to correct existing prejudices, and fortunately the means are at hand for conducting this examination with an exactness nearly reaching mathematical precision. The data employed are compiled from the \"Army Meteorological Register,\" and \"Blodgett's Climatology of the United States,\" both standard authorities based upon the system of meteorological observations which have been conducted by the Surgeons of the United States Army, and other scientific gentlemen through a series of upwards of thirty years.\n\nIn the following table illustrative of the temperature of Minnesota, St. Paul is inserted in the place of Ft. Snelling, (six miles distant,) where the observations were made. The column headed \"No. of years\" gives the duration of the observations at each station:\n### TABLE OF PLACES\n\nWHICH\n\nCOINCIDE IN MEAN TEMPERATURE WITH SAINT PAUL, DURING THE DIFFERENT SEASONS,\n\nAND THE ENTIRE YEAR.\n\n| SPRING. | No. of Years | SUMMER. | No. of Years | AUTUMN. | No. of Years | WINTER. | No. of Years | YEAR. | No. of Years |\n|---------|--------------|---------|--------------|---------|--------------|---------|--------------|-------|--------------|\n| MEAN TEMP'T. 45° deg. | | MEAN TEMP'T. 70° deg. | | MEAN TEMP'T. 45° deg. | | MEAN TEMP'T. 16° deg. | | MEAN TEMP'T. 44° deg. | |\n| St Paul, M. T. | 35½ | St Paul, M. T. | 35½ | St Paul, M. T. | 35½ | St Paul, M. T. | 35½ | St Paul, M. T. | 35½ |\n| Boston, Mass. | 20 | Lowell, Mass. | 7 | Portland, Me. | 31 | Houlton, Me. | 17 | Litchfield, Conn. | 1 |\n| Springfield, Mass. | 2 | Trenton, N. J. | 5 | Burlington, Vt. | 6 | Hanover, N. H. | 3 | Johnstown, N. Y. | 14 |\n| Worcester, Mass. | 7 | Middletown, N. J. | 3 | Montreal, Canada | 15 | Williamstown, Vt. | 13 | Oxford, Chenango Co., NY | 17 |\n| Kinderhook, N. Y. | 17 | Flatbush, L. I., N. Y. | 24 | Lake Simcoe, C. W. | 1 | Montreal, Canada | 15 | Cortland, Cortland | 18 |\n| Utica, N. Y. | 9 | Newburg, N. Y. | 18 | Lowville, Lewis Co., NY | 19 | Sault Ste Marie | 31 | Whitesboro, N. Y. | 7 |\n| Cooperstown, N. Y. | 16 | Philadelphia, Pa. | 10 | Plattsburg, N. Y. | 11 | Bath, Me. | 10½ | Concord, N. H. | 10 |\n| Onondaga, N. Y. | 16 | Millftown, Pa. | 3 | Fairfield Academy, N. Y. | 19 | Mexico, Oswego Co., NY | 11 | Smethport, Pa. | 3 |\n| Lewiston, N. Y. | 18 | Warren, Pa. | 13 | Cherry Valley, N. Y. | 15 | Ebensburg, Pa. | 24 | Green Bay, Wis. | 21 |\n| Detroit, Mich. | 13 | Hudson, O. | 7 | Smethport, Pa. | 3 | Manitowoc, Wis. | 21 | Portage City, Wis. | 16 |\n| Ann Arbor, Mich. | 3 | Oberlin, O. | 5 | Chicago, Ill. | 5 | Green Bay, Wis. | 21 | Pembina, M. T. lat. 49°7-12th | 1 |\n| Battle Creek, Mich. | 5½ | Beloit, Wis. | 6 | Portage City, Wis. | 16 | Manitowoc, Wis. | 21 | Baraboo, Wis. | 1 |\n\nNote: The table lists places that coincide in mean temperature with Saint Paul during different seasons and the entire year.\nTaking a Map of the United States and applying to it lines of mean temperature for the seasons and year, passing through the places indicated in the foregoing table, we find that while the winter temperature of St. Paul does not fall below the average of places on its parallel of latitude, its spring temperature coincides with that of Central Wisconsin, Northern Illinois, Southern Michigan, Central New York and Massachusetts, its summer with that of Central Wisconsin, Northern Illinois, Northern Ohio, Central and Southern Pennsylvania, and New Jersey, its autumn with that of Central Wisconsin, Northern New York, a small part of Northern Pennsylvania, Northern Vermont and Southern Maine, and its entire year with that of Central Wisconsin, Central New York, Southern New Hampshire and Southern Maine.\n\nConsidering this subject with reference to the extremes of latitude touched by these isothermal lines, we discover that St. Paul has a temperature in spring equal to Chicago, which is two and a half degrees of latitude south, in summer equal to Philadelphia five degrees south, in autumn equal to Northern New York one and a half degrees south, and during the whole year, equal to Central New York two degrees south.\n\nThese statements do not admit of the slightest doubt or question, no matter how widely they may differ from preconceived opinions, for they are founded on facts of experience which have occupied an entire generation in their development.\n\nThis condition of temperature not only obtains in Minnesota, but it is a well established fact that there extends hundreds of miles to the north west of her an immense area of fertile and cultivable soil, possessed of a climate hardly inferior in warmth to her own. The closing chapter of Blodgett's Climatology treats so directly of the climate and resources of this vast region that it is copied nearly entire as an appendix to this report.\n\nThe obstruction opposed by snows to the rapid and regular passage of trains is among the chief difficulties of winter operation and in order to submit in the plainest and most concise manner possible the magnitude of this obstacle as found here, in comparison with other districts, a table of mean results, compiled from the same sources with the preceding, is here introduced.\n\nThe results given in the table are all reduced to water, but in order to convert them into equivalents of snow we have only to consider the figures in the columns as representing feet and decimals of a foot. The rule adopted in the \"Register\" gives ten inches of snow as equivalent to one inch of water, but the proportion of twelve to one is believed to be more correct, particularly as regards snows of our latitude.\nMEAN FALL OF RAIN AND MELTED SNOW AT VARIOUS PLACES FOR THE DIFFERENT SEASONS AND THE ENTIRE YEAR.\n\nALSO, THE MAXIMUM AND MINIMUM FALL DURING THE WINTER MONTHS.\n\nDEPTH IN INCHES AND DECIMALS OF AN INCH.\n\n| PLACES          | SPRING Mean | SUM'N. Mean | AUT'N. Mean | WINTER Mini | WINTER Mean | WINTER Maxi | YEAR Mean | No. of Years |\n|-----------------|-------------|-------------|-------------|------------|-------------|-------------|-----------|--------------|\n| Saint Paul, Min.| 6.61        | 10.92       | 5.98        | 0.35       | 1.02        | 3.50*       | 25.43     | 19           |\n| Montreal, Canada| 11.64       | 11.18       | 16.00       |            | 7.26        |             | 47.28     | 2            |\n| Houlton, Me.    | 7.62        | 11.92       | 9.96        | 4.02       | 7.49        | 10.00       | 36.97     | 94           |\n| Eastport, Me.   | 8.88        | 10.06       | 9.85        | 8.91       | 10.61       | 11.95       | 39.39     | 58           |\n| Portsmouth, N. H.| 9.03       | 9.21        | 8.96        | 4.44       | 8.38        | 11.08       | 35.57     | 13           |\n| Hanover, N. H.  | 9.90        | 11.40       | 10.50       |            | 9.10        |             | 41.00     | 18           |\n| Burlington, Vt.  | 7.41        | 10.83       | 9.82        |            | 6.02        |             | 34.11     | 20           |\n| Cambridge, Mass.| 10.85       | 11.17       | 12.57       |            | 9.89        |             | 44.48     | 12           |\n| Worcester, Mass.| 10.89       | 10.71       | 13.51       |            | 11.85       |             | 46.96     | 13           |\n| New York City    | 11.69       | 11.64       | 9.93        | 4.99       | 10.39       | 19.27       | 43.65     | 14           |\n| Plattsburg, N. Y.| 8.86       | 10.03       | 10.02       | 2.90       | 4.85        | 9.33        | 35.39     | 10           |\n| Potsdam, N. Y.   | 6.20        | 10.15       | 8.38        |            | 3.90        |             | 26.63     | 20           |\n| Utica, N. Y.     | 9.26        | 12.83       | 9.76        |            | 8.12        |             | 40.57     | 19           |\n| Rochester, N. Y. | 6.82        | 8.56        | 9.38        |            | 5.58        |             | 30.44     | 19           |\n| Fort Niagara, N. Y.| 6.87      | 8.91        | 8.68        | 5.23       | 6.41        | 9.24        | 31.77     | 54           |\n| Pittsburgh, Pa.  | 9.98        | 8.87        | 8.23        | 4.39       | 7.48        | 11.97       | 34.96     | 9            |\n| Hudson, O.       | 8.76        | 8.87        | 6.16        |            | 8.00        |             | 32.73     | 13           |\n| Cincinnati, O.   | 8.94        | 10.00       | 9.90        |            | 11.12       |             | 46.89     | 20           |\n| Detroit, Mich.   | 8.02        | 8.28        | 7.11        | 2.84       | 5.86        | 6.01        | 30.07     | 12½          |\n| Sault St. Marie, Mich.| 5.44   | 9.97        | 10.76       | 2.85       | 5.18        | 11.57       | 31.35     | 16½          |\n| Athens, Ill.     | 12.20       | 13.30       | 9.20        |            | 7.10        |             | 41.80     | 10           |\n| Muscatine, Iowa  | 11.19       | 15.08       | 10.34       |            | 5.79        |             | 33.63     | 13           |\n| Milwaukee, Wis.  | 6.60        | 9.70        | 6.80        |            | 4.20        |             | 27.20     | 7            |\n| Green Bay, Wis.  | 9.00        | 14.45       | 7.84        | 2.90       | 3.36        | 4.80        | 34.65     | 7½           |\n| Portage City, Wis.| 5.68       | 11.46       | 7.63        | 1.92       | 2.82        | 3.84        | 27.49     | 9            |\n| Beloit, Wis.     | 13.16       | 18.12       | 10.44       |            | 6.49        |             | 48.15     | 4            |\n\n* In the Winter of 1849. The next less fall was in the Winter of 1837—2.96 inches.\n\nWithout going into a detailed review of the contents of the foregoing table, which presents the facts in a light that argument cannot strengthen, it may be well to inquire what proportion of the winter precipitation is in the form of snow, and in the absence of positive knowledge we may arrive at general conclusions by other means.\n\nSince Houlton, Hanover, Plattsburg, Montreal and Sault St. Marie coincide in mean winter temperature with St. Paul, we must infer that the precipitation at those places assumes the form of snow in the same proportion as here. Admitting this, and supposing the entire winter precipitation to be a successive accumulation of snows, the resulting depths would be as follows, viz: Average annual depth at St. Paul, 2 feet; Houlton, 7½ feet; Hanover, 9 feet; Plattsburg, 5 feet; Montreal, 7 feet; Sault St. Marie, 5 feet. Maximum depth at St. Paul, 3½ feet; Houlton, 10 feet; Plattsburg, 9½ feet; and Sault St. Marie, 11½ feet. It is hardly necessary to\nadd that such immense depths of snow are never known, and it must follow that a great part of the fall at all these localities is dissipated during the higher fluctuations of temperature. This is confirmed by Mr. Blodgett, who estimates the average depth of snow constantly occupying the ground in winter among the elevated and Northern districts of New England at two feet, and the experience of the present winter at St. Paul is, that out of a total fall of upwards of twenty inches of snow, the depth on the ground has at no time exceeded six inches.\n\nAlthough no reliable evidence can be adduced upon this point, it seems entirely safe to assume that the average of extreme depths of snow in Minnesota, during the nineteen years through which the observations extend, does not exceed ten inches, and it is certain that the average here falls quite below that in Wisconsin, Illinois, Michigan or New York, and very far below that in the Eastern States.\n\nThe rapid decrease in winter precipitation north and northwest from Central Illinois is worthy of particular note in this connection. It will be seen that at Athens, Illinois, the mean fall is 7.1 inches; at Beloit, 6.43 inches; at Milwaukee, 4.2 inches; at Green Bay, 3.36 inches; at Portage City, 2.82 inches; while at St. Paul it is only 1.92 inches.\n\nThe force of the wind, which frequently converts even moderate falls of snow into formidable barriers to the passage of trains, is another element requiring attention, and resort is again had to the Army Register for the purpose of illustrating this subject. In the succeeding table will be found the mean force of the wind for a term of years, expressed in whole numbers and decimals under the classification of forces laid down in the \"Register.\"*\n\n*In this classification, 0 signifies a calm, 1 a barely perceptible breeze, 2 a gentle breeze, 3 a moderate breeze, 4 a brisk breeze, and so on to 10, which represents a violent hurricane.\nTable showing the Mean Force of the Wind at various places during the months of January, February, March, and December, in each Year for a Series of Years.\n\n| PLACES                        | Mean Force | Mean Force | Mean Force | Mean Force | Mean Force | Mean Force | Whole Year | Mean Force |\n|-------------------------------|------------|------------|------------|------------|------------|------------|------------|------------|\n| Fort Snelling, Min., near St. Paul | 1.59       | 1.72       | 1.63       | 1.74       | 1.55       | 2.06       | 2.18       | 2.00       | 1.80       | 2.41       | 10         | 1.87       |\n| Fort Trumbull, New London, Conn. | 2.63       | 2.85       |            |            | 3.41       | 2.98       | 2.31       | 2.45       | 2.16       |            |            | 7          | 2.67       |\n| Fort Hamilton, New York City   | 3.28       | 3.43       | 3.18       | 3.08       | 3.40       | 3.14       | 3.40       | 3.14       | 1.90       | 1.66       |            | 10         | 2.96       |\n| Fort Niagara, New York         | 3.33       | 3.28       |            |            | 3.30       | 3.24       | 2.50       | 3.54       | 2.20       | 2.57       |            | 8          | 3.01       |\n| Plattsburg Barracks, Plattsburg, New York | 2.58 | 1.69 |            |            | 1.48       | 1.54       | 2.19       |            |            |            |            | 5          | 1.90       |\n| Fort Sullivan, Eastport, Maine | 3.29       |            |            |            | 2.31       | 2.37       | 2.65       | 2.63       |            |            |            | 5          | 2.63       |\n| Fort Constitution, Portsmouth, N. H. | 2.44 |            |            |            | 2.18       | 2.53       | 2.70       | 2.05       |            |            |            | 5          | 2.50       |\n| Alleghany Arsenal, Pittsburgh, Pa. | 2.13 | 1.85 | 2.08 | 1.86 | 2.08 | 2.29 | 2.16 | 2.74 | 2.31 | 2.55 |            | 10         | 2.20       |\n| Detroit Barracks, Detroit, Mich. | 2.52 | 2.46 |            |            | 1.72       | 2.11       | 2.32       |            |            |            |            | 5          | 2.26       |\n| Fort Atkinson, Winneshiek County, Iowa | 2.85 | 2.07 |            |            |            |            |            |            |            |            |            | 2          | 2.48       |\n| Fort Leavenworth, Kansas       | 2.30       | 2.19       | 1.70       | 1.99       | 2.55       | 1.45       | 1.61       | 2.03       | 2.07       | 2.30       |            | 10         | 2.09       |\n\nAverage force at all places: 2.63 2.40 2.15 2.17 2.57 2.32 2.30 2.59 2.22 2.30\n\nIt appears that the mean force of the wind at Fort Snelling for the whole term is less than at any other station, and twenty-five per cent. less than the average of all stations for the whole term, and that the mean force in any year is below the average at all stations for the year, except in 1854, when it slightly exceeds the average.\n\nIn concluding this subject I will state that the extracts comprised in the foregoing tables have been made at random, so far as the nature of each case would permit, and with the sole purpose of arriving at the truth; yet, if further confirmation of the deductions drawn from them is desired, it may be found in the fullest measure within the volumes quoted.\nAPPENDIX NO. VI.\n\nCLIMATOLOGY OF THE SASKATCHEWAN DISTRICT AND OF BRITISH OREGON.\n\n[Extract from Blodgett's Climatology of the United States.]\n\nThe assertion may at first appear unwarranted, but it is demonstrable that an area, not inferior in size to the whole United States east of the Mississippi, now almost wholly unoccupied, lies west of the 98th meridian and above the 43d parallel, which is perfectly adapted to the fullest occupation by cultivated nations.  \n\nBy reference to the illustration of the distribution of heat, we see that the cold at the north of the great lakes does not represent the same latitude farther west, and that beyond them the thermal lines rise as high in latitude, in most cases, as at the west of Europe. Central Russia, Germany, the Baltic districts, and the British Islands, are all reproduced in the general structure, though the exceptions here fall against the advantage, while there they favor it, through the immediate influence of the Gulf Stream.\n\nClimate is indisputably the decisive condition; and when we find the isothermal of 60 deg. for the summer rising on the interior American plains to the 61st parallel, or fully as high as its average position for Europe, it is impossible to doubt the existence of favorable climates over vast areas now unoccupied. This favorable comparison may be traced for the winter also, and, in the averages, for the year. The exceptional cold of the mountain plateaus, and of the coast below 43d parallel, masks the advantage more or less to those who approach these areas from the western part of the central States and from the coast of California; but, though the distinct mountain ranges remain high at the north, the width of their base, or of the plateau from which they rise, is much less than at the 42d parallel. The elevated tracts are of less extent, and the proportion of cultivable surface is far greater.\n\nIt is decisive of the general question of sufficiency of rain, to find the entire surface of the upper plains either well grassed or well wooded; and recent information on these points almost warrants the assertion that there are no barren tracts of consequence after we pass the Bad Lands and the Coteaux of the Missouri. Many\nportions of these plains are known to be peculiarly rich in grasses, and probably the finest tracts lie along the eastern base of the mountains, in positions corresponding to the most desert-like of the plains at the south. The higher latitudes certainly differ widely from the plains which stretch from the Platte southward to the Llano Estacado of Texas, and none of the references made to them by residents or travellers indicate desert characteristics. Buffalo are far more abundant on the northern plains, and they remain through the winter at their extreme border, taking shelter in the belts of woodland on the Upper Athabasca and Peace rivers. Grass savannas like these necessarily imply an adequate supply of rain, and there can be no doubt that the correspondence with the European plains in like geographical position—those of Eastern Germany and Russia—is quite complete in this respect. If a difference exist, it is in favor of the American plains, which have a greater proportion of surface waters, both as lakes and rivers.\n\n* * * The northwestern coast of this continent is even more profusely rainy than any part of the north-west of Europe; and the configuration is less sharply interrupted along the coast north of Puget Sound than it is south of that line. If positive evidence were wanting with regard to any part of the interior plains above the 45th parallel, it could not reasonably be inferred that they were wanting in an adequate supply of atmospheric moisture.\n\nWith these facts of climatological capacity established, as the whole tenor and significance of American research on this point clearly shows, it may be more easy to understand the descriptions of those who have travelled there, and to connect the somewhat meagre accounts yet written. It is most surprising that so little is known of the great Islands, and the long line of coast from Puget Sound to Sitka, ample as its resources must be, even for recruiting the transient commerce of the Pacific, independent of its immense intrinsic value. To the region bordering the northern Pacific the finest maritime positions belong throughout its entire extent, and no part of the west of Europe exceeds it in the advantages of equable climate, fertile soil and commercial accessibility of the coast. The western slope of the Rocky Mountain system may be included as a part of this maritime region, embracing an immense area from the 45th to the 60th parallel and five degrees of longitude in width. The cultivable surface of this district cannot be much less than three hundred thousand square miles.\n\nNext is the area of the plains east of the Rocky Mountains, not less remarkable than the first for the absence of attention hereto-\nfore given to its intrinsic value as a productive and cultivable region within easy reach of emigration. This is a wedge-shaped tract, ten degrees of longitude in width at its base along the 47th parallel, inclined northwestward to conform to the trend of the Rocky Mountains, and terminating not far from the 60th parallel in a narrow line, which still extends along the Mackenzie for three or four degrees of latitude in a climate barely tolerable. Lord Selkirk begun his efforts at colonization here as early as 1805, and, from personal knowledge, he then claimed for this tract a capacity to support thirty millions of inhabitants. All the grains of the cool temperate latitudes are produced abundantly. Indian corn may be grown on both branches of the Saskatchewan and the grass of the plains is singularly abundant and rich. Not only in the earliest period of exploration of these plains, but now, they are the great resort for buffalo herds, which, with the domestic herds, and horses of the Indians and colonists, remain on them and at their woodland borders through the year. The simple fact of the presence of these vast herds of wild cattle on the plains at so high a latitude, is ample proof of the climatological and productive capacity of the country. Of these plains and their woodland borders the valuable surface measures fully five hundred thousand square miles.\n\nIn various parts of the present work, references have been made to the leading incidents of natural capacity and of actual growth in the northwestern districts. It is not necessary to repeat them here, and the present purpose is only to direct attention to the development in that quarter as one offering clearly the greatest field in which natural advantages await the use of civilized nations. The reason for most of the previous and present neglect of this region lies in mistaken views of its climate, and the peculiarities of much of the Lake Superior district are such as to perpetuate the mistake. With the unusual severity of the last two or three winters there, it appears incredible that the country at the west, rising toward the Rocky Mountains should be less severe. But the vast plain rises very little. Fort Union is but 2,000 feet above the sea, and Fort Benton but 2,600, though 15 deg. of longitude due west of the plain at the sources of the Mississippi at 1,500 feet. Much of it declines in altitude northwestward, indeed, toward the northern lake-basins and Hudson's Bay. The increase of temperature westward is quite as rapid as it is southward to New Mexico, and the Pacific borders at the 50th parallel are milder in winter than Santa Fe. In every condition forming the basis of national wealth, the continental mass lying\nwestward and northwestward from Lake Superior is far more valuable than the interior in lower latitudes, of which Salt Lake and Upper New Mexico are the prominent known districts.\n\nThe history of this northwestern district has unusual interest also, though the details are meagre. French traders ranged the fertile plains of Red River and the Saskatchewan nearly two centuries since, and the rich trade in furs and peltries has for so many years been constantly gathered from the surrounding tracts through that as a central area. This occupation was coeval with the Spanish occupation of New Mexico and California, and but for the pernicious views entailed by the fur traffic, as to the necessity of preserving it as a wilderness, it would long since have been open to colonization. The Hudson Bay and Northwest Companies had a gigantic contest for possession after the French had given way to British dominion in Canada; and both these Companies at last concentrated their strength in efforts to preserve the wilderness, and to crush the infant colony of Lord Selkirk.\n\nThe whole space here designated the North-west is, however the joint possession of the United States and Great Britain—not only in territorial title, but in all the incidents of development. Its commercial and industrial capacity is gigantic, and one which it is the highest interest of both governments to bring out at the earliest moment.\n\nThe illustration of the summer and winter climates for the country north of the 50th parallel is given—though with less fulness than could be desired, on the isothermal and rain charts—for the temperate latitudes of both continents. The allusions' here made may be traced there in a general way; but a map on a more ample scale, representing the now unknown plains of the Yellowstone and the southern Saskatchewan, and the equally important Pacific districts north of Vancouver Island, and with a full geographical detail, where so much is now vaguely placed, is much to be desired. For the small number of points observed above the 45th parallel, the statistics are very well distributed to define the climate.\n\n* * *\n\nThe conditions existing in this immense area deserve a distinct treatment, and particularly the importance of the great channel of access through Lake Superior attaches the highest interest to the definition of its peculiar climate. In severe winters the most formidable ice-barriers are interposed over a portion of its surface, as the ice remains late and in large fields and masses at the eastern end of Lake Erie in the same cases—in both lakes the western and larger portions being free from obstructions at a date much earlier.\nAPPENDIX NO. VII.\n\nMEMOIR OF THE SELKIRK SETTLEMENT UPON THE RED RIVER OF THE NORTH,\nWITH NOTICES OF THE MANNERS AND LIFE OF THE SETTLERS.\n\n[Prepared by J. A. Wheelock, Esq., at the request of a Public Meeting at St. Paul, held July 17, 1858.]\n\nSimultaneously with the movement in this city and in different parts of the State, for the establishment of an Emigrant route through Minnesota and the British Possessions to the new field of adventure on Frazer River, the opportune arrival of some six hundred carts from the Red River, laden with the furs of that region, had the effect of directing public attention more immediately to the growing importance of our commercial relations with these remarkable settlements, while it furnished at the same time a multitude of witnesses not only to the advantages of the proposed route, but to the richness of the resources which such a route would develop, and to the beauty and fertility of the region tributary to the valley of the Mississippi, which it would open to colonization.\n\nThe novel appearance of the visitors themselves, the odd uniformity of their costume of coarse blue cloth, with its barbaric opulence of brass buttons and fanciful ostentation of red belts; the strange mixture of complexions which they presented, all the way down from the fair skin, and light, soft curls of the Celt to the dingy color and straight black hair of the Indian, with every intermediate shade which the amalgamation of races could produce; their language as various as their origin—a curious medley of Chippewa, Cree, French, English and Gaelic; their rude wooden carts, guiltless of iron, even to the venial peccadillo of a nail, drawn for the most part by oxen harnessed singly in shafts, with gearing made of strips of raw hide, and filing in long procession through the streets of the city, with the disciplined sequence of an Asiatic caravan—it is not surprising that these incidents of a social life, removed at once from barbarism and civilization, should have excited some interest in the history of a people who, with the marks of a European extraction, emerge from the depths of the wilderness with the characteristics of the savage.\nNomadic as to one half of his origin, pastoral and agricultural as to the other; a hunter by his Indian blood, a citizen from his European instincts; thrifty, indolent, staid, mercurial, as father or mother predominates in his nature—the Red River half-breed has a story as curious as any which while away the winter nights in the chimney corner of his ancestral Highland home. When emigration had scarcely ventured to pass the Alleghanies, a colony of Scotchmen had penetrated beyond the waters which flow into Lake Superior and settled at the mouth of the Assineboin. For fifty years since then, the advancing wave of American colonization has rolled westward, till the valley of the Mississippi from one extreme to the other, is submerged with population and carved into wealthy States, and the most remote of the inland lakes is thronged with steamboats and lined with embryo cities; and yet the farthest point which the American pioneer has reached, is still five hundred miles short of the nearest of the settlements, which for half a century have occupied the valley of the Red River. This strange isolation of a European people in the profound abysses of a region almost unknown to the geographer, surrounds them with the charm of romance, and the dramatic situation prepares us for their strange, eventful history.\n\nOver a hundred years ago French adventurers, eager to extend the area of their fur trade and the limits of the French dominions, pushed their explorations through the rivers which debouche on the northern shore of Lake Superior beyond Lake Winnipeg. In an old map reproduced in Mr. Neill's History of Minnesota, and dated as early as 1762, Fort La Reine is designated at the confluence of the Assineboin and Red Rivers, where the coureurs des bois from the French establishment at Mackinac, used to trade with the Omahas and Assinneboins. A similar trading station at the same period existed on the east side of Lake Winnipeg, and another on the Lake of the Woods.\n\nThomas Ourry, a Canadian trader, who ascended the Saskatchewan in 1776, was the first who advanced beyond Lake Winnipeg, with view to traffic. The profits of his voyage encouraged others to follow his example. Their success aroused the jealousy of their English competitors, who had established a traffic on the shores of Hudson's Bay, and gave rise to a long series of disorders and excesses. Joseph Frobisher and his brother, who went beyond the fifty-ninth degree of latitude to Churchill and Île la Crosse, and Peter Pond, who in 1778 entered English River and the river L'Orignal, where he passed the winter—are the principal names associated with the earlier explorations of this country.\nIn 1781, four canoes filled with traders ascended the Saskatchewan to the highlands which divide its sources from the valley of the McKenzie. In 1783, the Northwestern Company, principally composed of the persons already mentioned, was organized, and waged a bitter competition with numerous rivals. In 1787, the several Fur Companies, who had been contending for the exclusive trade of the Indians of the northwest, consolidated under the name of the Northwest Company, which then had only one remaining rival in the Hudson Bay Company.\n\nThe latter corporation, whose charter dated back to the reign of Charles II, in 1670, had not yet extended their establishments into this region, and the Northwest Company enjoyed an undisturbed monopoly of the lucrative trade, which the French had resigned into their hands. Their dream of exclusive dominion was, however, soon ended.\n\nIn 1805, Lord Selkirk, a benevolent but impracticable Scotchman, and a member of the Hudson Bay Company, who had penetrated into this region, was so struck with its beauty and fertility, and the mildness of its climate, that he conceived the project of planting colonies here whose growth should compensate the British crown for the recent loss of the United Colonies, and he wrote several tracts, urging the superiority of this region for the British emigrant, over any portion of the United States. In 1811, he succeeded in obtaining for colonization, a grant of land on the Red River, from the Hudson Bay Company, which was at the same time, aroused by his representations, to the necessity of extending their jurisdiction over a country so rich in furs and of securing its trade to themselves.\n\nIn the Autumn of the following year, a small detachment of emigrants, whom Lord Selkirk had collected from the highlands of Scotland, after a long and toilsome journey—which must have been terrible in the vast solitudes through which it led them and to which it led—arrived on the banks of the Red River, near its confluence with the Assineboin. There they commenced building houses, when their work was stopped by a party of men in the service of the North-West Company—who, disguised in Indian costume, ordered them to desist. Frightened by their menaces, they were induced to take refuge at Pembina. Their guides, as savage in disposition as in their assumed dress, tyrannized without mercy over the affrighted colonists, robbing them of whatever they most prized, and found a cruel sport in the alarm they caused the mothers by pretending to run off with their children. Several of the more delicate died under the shock of this inhuman treatment. The winter\nhaving been passed in tents at Pembina, they were permitted to return to their settlements in the Spring. Their labors were about to be rewarded with an abundant harvest, when it was destroyed by birds. The next winter was again passed at Pembina, and when they returned to their settlements in the Spring, they were in a condition of abject poverty.\n\n\"By the month of September, 1815,\" says Mr. Neill, \"the number of settlers was about two hundred, and the colony was called Kildonan, after the old parish in Scotland, in which many were born. With increased numbers, all seemed auspicious. Houses were built, a mill erected, and imported cattle and sheep began to graze on the undulating plains.\"\n\nBut avarice and jealousy followed them even to these solitudes. The Northwest Company never looked with favor on the growth of the settlement, which was regarded as a scheme of their rivals of the Hudson Bay Company, to dispossess them of the lucrative posts which they occupied in the neighborhood; and in the summer of 1814, Duncan Cameron and Alex. McDonnel were appointed at a meeting of the partners of the Company to concert measures to stop the progress of the colony. In pursuance of this design, Cameron, who spoke Gaelic with fluency, artfully insinuated himself into the confidence of the Highlanders, and without evincing direct hostility to the plans of Selkirk, gradually sowed the seeds of disaffection in the settlement, which, in the Spring of 1815, culminated in the desertion of a number of the colonists to the quarters of the Northwestern Company, whose employees in the meanwhile had broken open the storehouse of the colony and carried away their field pieces. Endeavors were also made with partial success to excite the minds of the Indians against the settlers.\n\nA murderous attack was made by the Northwest party on the Governor's house, who was seized and carried off to Montreal by Cameron. McDonnel followed up this outrage with a series of aggressions on the settlers. Persecuted to extremity, they were again forced to abandon their homes. About this time, says Mr. Neill, toward the latter part of the pleasant month of June, two Ojibwa Chiefs arrived with forty braves, and offered to escort the persecuted settlers with their property to Lake Winnipeg. Guarded by the grim children of the forest from the assaults of their foes, they, like the Acadian peasants in \"Evangeline,\" were \"friendless, homeless, hopeless.\" The mournful picture of the Acadian expatriation was mournfully fulfilled, even in the sad sight of their dwellings wrapped in the flames which the incendiary's torch had lighted.\nIn the following Spring the fugitives returned to their colony, under the protection of an officer of the Hudson Bay Company, who arrested Cameron and sent him to England for trial.\n\nIn the meantime, the Earl of Selkirk, learning of the distresses of the colonists, sailed for America. He arrived at New York in the fall of 1815, where rumors of their defection reached him, and in the following spring he set out for the colony with a military escort, which he had organized from some disbanded military companies. At Sault St. Marie, tidings of new disasters reached him. Semple, the Governor of the territory of the Hudson Bay Company, who had but just taken possession of his new quarters on Red River, was attacked by a party of the employees of the North-western Company, and killed with a number of his men, in the affray. The settlers were again expelled from their homes by the victorious marauders, and were already on their way to the sea coast, when they were recalled by the welcome news of Selkirk's approach. A reinforcement of emigrants sent to the colony under his direction, had preceded him. Incensed at the atrocities which had been perpetrated by the agents of the North-western Company, he had proceeded with his force to the headquarters of that Company, at Fort William, on Lake Superior, and having apprehended the principal parties, sent them to Montreal for trial.\n\nHis arrival at Red River soon retrieved the affairs of the colony, and he left it the following year in a flourishing condition.\n\nOwing, however, to the scarcity of seed, which was the natural consequence of the difficulties already stated, the harvest of 1817, though the yield was prolific, was insufficient to supply the wants of the increasing population, and hunting was again resorted to for subsistence. Tlicy set out in December across the plains to join a distant camp of Pembina half-breed hunters and Indians. They reached it after a journey of terrible suffering, to find the Buffalo scarce and the camp subsisting upon scanty fare. Spring renewed their hopes. The summer was propitious. The harvest was already ripe for the sickle, when a new and terrible calamity befell them.\n\nIt was at this epoch, in the summer of 1818, that the grasshoppers, which for the past and present years have again devastated those settlements and extended their depredations over a considerable part of Minnesota, made their first recorded appearance in that region. The vast armies of these insects darkened the air, and passed over the land like a consuming fire, licking up every green thing. The next year, (1819) the havoc was even worse.\n\n\"They were produced,\" says Ross, \"in masses, two, three or\nfour inches in depth. The water was infected with them. Along the river they were to be found in heaps like seaweed and might be shovelled with a spade. Every vegetable substance was either eaten up or stripped to the bare stalk. The bark of trees shared the same fate. Even fires, if kindled out of doors, were immediately extinguished by them.\"\n\nThe hunter's life alone seemed left to the despairing colonists, but one more effort was made to retrieve their condition. During the winter of 1819-20, a deputation of settlers traveled a thousand miles on snow-shoes across Minnesota to Prairie du Chien, for seed. The details of the return trip in the Spring of 1820, are highly interesting. Three Mackinac boats laden with wheat, oats, and peas started on the 15th of April from Prairie du Chien for the Selkirk settlements on Red River. \"On the third day of May the boats passed through Lake Pepin. The voyage was continued up the Minnesota River to Big Stone Lake, from which a portage was made into Lac Traverse, a mile and a half distant, the boats being moved across on rollers.\" On the third day of June the party arrived at Pembina, where on opposite sides of the stream of that name, the Hudson Bay and North-west Companies had rival trading posts, which still exist. This eventful voyage is one of the most striking incidents in the chronicles of the settlement, and as remarked by Gov. Sibley in an address delivered by him, \"is worthy of note, as it is the only instance of heavy articles being transported the entire distance from Prairie du Chien to the Red River by water, with the exception of the narrow portage between Big Stone Lake and Lake Traverse.\"\n\nThe next two years of continued prosperity repaired the disasters which had heretofore assailed the colony. In 1821, the two great rival Trading Companies, tired of useless bloodshed and expensive strife, consolidated under the name of the Hudson Bay Company, and their union seemed to secure the future peace and safety of the settlement.\n\nIn the same year, a number of Swiss arrived in the colony. Clockmakers in profession, the new pursuits to which they were called were not congenial to them. Like the Swiss soldiers of Napoleon, they grew homesick, and pined for their native mountain homes.\n\nThe settlement was not done with calamity. Misfortune, which had pursued it in every form, in each successive visit took shapes more appalling than the last. The winter and spring of 1825-6 brought a fresh train of disasters. In the month of December a furious storm overtook a large party of buffalo hunters in the north-\nern plains of Minnesota, and drove the buffalo out of their reach. Relying solely on the flesh of this animal for subsistence, cut off by the wide waste of deep snows from the nearest settlement at Pembina, nearly 200 miles distant, they had no resource in this emergency. Starvation stared them in the face. Fuel was as inaccessible as food. Imprisoned in the deep snows, overwhelmed with cold and hunger, numbers perished in the camp, or in a vain attempt to reach Pembina, before rumors of their situation reached the colony.\n\nThe calamities of the settlers reached their climax in the ensuing spring, when the melting snows poured their torrents into the streams. The year 1826 is memorable in their calendar, as the year of the flood. On the 2d of May the Red River rose nine feet in twenty-four hours, and by the 5th the level plains were submerged. The waters continued to rise till the 21st, when houses and barns were swept off in the deluge. The settlers fled to the distant hills, whence the waters swept over the wide plains as far as the eye could see. The flood abated in June, \"and such,\" says Mr. Neill, \"is the surprising quickness with which vegetation matures five degrees of latitude north of St. Paul, that wheat planted on the 22d of June came to maturity.\"\n\nThe discontented Swiss, driven from their homes by the flood, did not return to the settlement, but departed for the United States and settled at different points on the banks of the Mississippi. It is a curious historical fact, that the first emigrants to Minnesota, were the Swiss refugees from Red River in 1826, who opened farms on the present site of St. Paul, and near Fort Snelling; and, according to our historian, should be recognized as the first actual settlers of the State.\n\nSince this destructive inundation, no event has occurred in the history of the settlement to interrupt the calm course of its prosperity, until the year 1852 brought another recurrence of the deluge which had swept over the plains twenty-six years before. The waters in that year rose a foot higher than in 1826. In consequence of the exposure of the settlement at Pembina to these ruinous casualties, a new site was selected for the Catholic Mission at that place near Mount Pembina, forty miles distant, at a place called St. Joseph.\n\nAnd during the last two or three years the Red River valley has been re-visited by the mysterious army of grasshoppers, whose advance guard paused last year, in their blasting flight, in the northwestern counties of Minnesota.\n\nA visit of Col. Sumner, of the U. S. A., to Pembina in 1844 to\nstop the encroachments of the British Half Breeds on the Buffalo ranges of Minnesota, and of Gov. Ramsey, in 1851, to make a treaty with the Upper Chippewas; an occasional battle with the Yankton Sioux; the arrival of a new missionary, or the visit of an explorer; the success or failure of a season's hunt, and the yearly expeditions from the settlement to the new cities which have arisen during the last ten years on the head waters of the Mississippi; the excitement of their return, freighted with curious wares to gratify the fancy of the delighted women and children, are all the incidents which have occurred in the interval to vary the quiet uniformity of their lives, until the prospect of emancipation from the control of the Hudson Bay Company, gave a new impetus and an intelligent direction to the discontents which have been long brewing in the colony.\n\nImprisoned in the depths of the vast solitudes which surround them, cut off for half a century from human sympathy by the universal ignorance of their situation, they suddenly find themselves the object of the concern of the civilized world, and all eyes fixed upon the isolated spot they occupy as the theatre of the most stupendous enterprize of the age, and destined in its realization to change the face of the continent.\n\nCharacteristics of the population.\n\nThe Gens Libres.—Long before the Scotch settlement was formed at the mouth of the Assineboin, the traffic in furs had attracted a class of roving adventurers from Canada, attached to the numerous trading posts which the French, and after them the North-west Company, had established throughout this region. Fascinated with the wild romantic life of the coureur des bois—severed from a society which no longer had any charms for them, their restless temperaments found a congenial employment in the pursuit of this adventurous and erratic life, while the pleasures of the song and dance and pipe, and the caress of an Indian maid compensated them for all their toils and dangers.\n\nThe formation of a permanent settlement by the Scotch colonists, with the nucleus of a civilization, had the effect of giving an organized social state to the gens libres, as they called themselves, and their half-breed children. The establishment of missions recalled them to some of the duties of civilized life, and they have become gradually incorporated without becoming assimilated with the settlement.\n\nEnumeration and Social Division.—The population of the Red River Valley, of white and mixed blood, which in 1812, amounted\nshafts, in which a single ox, harnessed in gearing made of strips of raw hide, performs the labor of transportation. The wives and children of the hunters accompany them in these expeditions, to perform the menial services of the camp, to pitch the tent and cook the evening meal.\n\nThe Departure of the Trains.—Over a thousand carts are frequently assembled for the journey. And as they emerge from the settlements, mutely following each other in single file, and the vast procession winds away across the plains and over the distant hills, and slowly sinks with the setting sun into the vast wilderness beyond, the intelligent spectator instinctively recalls the caravans which fill with pictures of romance and poetry the desert plains of Asia.\n\nThe Camp.—A thorough organization ensures the order of the camp—which is divided into brigades under the command of captains elected by the hunters, while a chief officer controls the whole body. Rules are adopted by the captains in council for the government of the camp, which are in general implicitly obeyed. A flag hoisted in the morning is their reveille—and when lowered at night it is the signal for a halt. The formation of their night encampments is conducted with the discipline of an army in the presence of an enemy, and their preparations indeed look to the possibility of attack from the savage foes who often hover on their trail. \"The carts are arranged in the form of a circle with the shafts projecting outward; the tents are pitched at one end and the animals tethered at the other.\" Sentinels relieved at regular intervals patrol the camp, and not unfrequently the cry of alarm startles the hunters from their mid-night slumbers to repel the treacherous attack of their stealthy Yankton enemies.\n\nThe Sabbath day is observed by abstinence from hunting. Theft is rigorously punished.\n\nThe Hunt.—Regulating their journey by these rules, the buffalo is sought in his favorite ranges on the Shyenne or the more distant plains of the Saskatchewan, where thousands are often found in a single herd. Scouts announce their presence; a permanent encampment is formed. Mounted on trained horses, the hunters advance in a regular cavalcade under the orders of their leader, towards the herd, taking advantage of all the inequalities of the surface to conceal their approach. The cautious advance gives place to a swift gallop, as they burst in among the frightened herd and pour a volley into their flanks. The flight of the herd and the hunter's pursuit is a scene of fierce excitement, which has no parallel except upon the field of battle. The tramp of the re-\ntreating army of buffaloes is described as like the shock of an earthquake. Often thousands of these noble animals in a single day will bite the dust under the practiced aim of the hunters. As they dash forward at full gallop in the swift pursuit, their mouths full of bullets which they drop from their teeth, without wadding, into the muzzle of their guns, while the hasty charge is beat into the barrel, by concussion upon the pummel of the saddle, they lead and fire in a few seconds, never stopping for an instant in the headlong race.\n\nThe carts follow the hunters to bring in the spoils. A busy scene ensues; the carcasses are stripped of their skins, the tongues cut out; such of the meat as can be used is carried into camp; a part is dried, the rest is converted into pemmican—a preparation of boiled tallow, mixed with shreds of meat, and poured into sacks of raw hide—and when the skins are dressed and the tongues cured, the labors of the expedition are ended;—and the hunters return to their homes to subsist till the Fall hunt, on the results of their adventure. They live mostly on pemmican and buffalo meats. The former is the sine qua non of the voyageur, and sells at the settlements for four cents per pound. The tongues and hides are reserved for barter. A dried tongue sells usually for twenty-five cents, and a buffalo skin for two or three dollars.\n\nHISTORY OF THE FUR TRADE OF THE RED RIVER VALLEY.\n\nFor two hundred years the traffic in furs with the Indian tribes who inhabit the basin of Lake Winnipeg has been prosecuted on the shores of Hudson's Bay.\n\nObliged by the conditions of the treaty of Utrecht in 1714, to surrender the traffic on these shores to the exclusive possession of the Hudson Bay Company, the French confined their attention to the new channel of trade which the Great Lakes opened out to them, and pushing their enterprises through the streams which flow from the West into Lake Superior, emerged upon the magnificent plains which are watered by the affluents of Lake Winnipeg, and established trading posts on the Lake of the Woods, the Assineboin, and even among the distant tribes who inhabited the sources of the Saskatchewan. In 1763, by the terms of the treaty of Versailles, the French relinquished their North American possessions to England, and three years afterward, British subjects from Canada following the routes pursued by the old French traders, began to avail themselves of the profitable traffic which the French had established, and penetrating as far westward as their predecessors, began to occupy the posts which the latter had deserted along the great rivers that flow into Lake Winnipeg. They even stretched\nnorthward, and engaged in direct competition with the Hudson Bay Company for the traffic which they at this time carried on along the rivers which debouch into Hudson's Bay. These adventures, however, were individual enterprises, and their prosecution often brought them into collision with the servants of that company. Uniting against their common enemy, the principal of these traders formed, in 1783, a powerful organization under the name of the Northwest Company. This was not a chartered company, but as successors to the old French traders, they pursued a very lucrative traffic via the lakes, penetrating to regions which the French had not reached, even to the shores of the Pacific. Their fleets of canoes laden with goods for the Indians or furs for Montreal, traversed the continent in every direction through the connected chain of rivers and lakes from Montreal to Puget's Sound. It was not till 1811 that the Hudson Bay Company, at the instigation of the Earl of Selkirk, set up a claim of exclusive jurisdiction under their charter, over this immense region, and in 1812, with the arrival of the first instalment of Selkirk colonists, they established a fort and factory on the Red River. The savage contest followed with the Northwest Company, some details of which have already been given, in which the colony was ruinously involved, and which after years of murderous strife, terminating with the mutual exhaustion of both parties, was at length concluded by the coalition of the rival companies in 1821. Some idea of the extent to which the energy and activity of private enterprise had carried the fur trade in the region west of Lake Superior, principally along the valleys of the Red River and Saskatchewan, may be obtained from the fact that in 1815 the Northwest Company had sixty trading posts in this region.\n\nThus the history of the fur trade of the Red River Valley may be divided into three periods, of nearly equal duration: the period of the French occupancy, from 1714 to 1763, when the trade of this region had its outlet through Rainy Lake River into Lake Superior—the period of over fifty years following, from 1766 to 1821, when the trade was principally in the hands of the Northwest Company, and followed the old water courses which the French had pursued—and the remaining period, from 1821 to the present time, during which it has been nearly monopolized by the Hudson Bay Company, and forced by them through the difficult channel of Nelson's River, which connects their interior trade with their ancient posts on the shores of Hudson's Bay.\n\nThe vast country watered by the majestic rivers which interlock in Lake Winnipeg, extending from Hudson's Bay and Lake Superior\nto the Rocky Mountains, is one of four principal divisions of the Company's Territories, and such is the withering effects of commercial monopoly, that the numerous trading posts which the Company found established at every eligible point along the streams, have dwindled to thirty-three in number.\n\nThe furs collected at these posts, which extend westward, from Red River to the Rocky Mountains, and from two or three hundred miles apart are transmitted in barges and canoes down the Saskatchewan and other streams, to Lake Winnipeg, whence they have three different outlets, to wit: Through Nelson's River to Hudson's Bay; through Red and Rainy Lake Rivers to Lake Superior; and latterly by carts overland, from the Red River Settlement to St. Paul. The expense and difficulty of travel through the two former canoe routes, interrupted by innumerable portages has had the effect, during the last decade, to turn this trade in the direction of its geographical affinities, which furnish in the smooth adjacent plains of the Red River and Mississippi, its easiest and cheapest avenues to market. The land route to St. Paul has increased in favor since the completion of Railroads to the Mississippi, has brought us into direct communication with the seaboard, and the Hudson Bay Company itself ceasing to struggle against the inevitable tendency of things, has itself acknowledged the superiority of the route it had ignored, by sending, this year, over sixty packages of its goods by this channel.\n\nThe adoption of this new avenue marks a new era in the history of the trade, and it will be interesting to inform ourselves of the value of that trade which is shortly to be emancipated from the arbitrary restraints of a commercial monopoly—to follow its legitimate impulses—and then to show by statistics the progress of the commercial intercourse which has sprung up in obedience to its natural tendencies—and its prospects of future expansion in the development of the varied resources of the immense region which is drained by this channel.\n\nAccording to an English document before us, the gross value of the furs and skins exported to England from the possessions of the Hudson Bay Company, varies from $1,000,000 to $2,500,000. At the half yearly sale at London, in April of last year, the proceeds were $1,150,000.\n\nThe average of annual exports of furs &c., from the Company's possessions will be about $1,800,000—about five times the value of the imports sent in exchange, which amount to about three hundred thousand dollars in all. The proportion of these imports which go to the district under consideration, will afford a reliable measure\nof the value of the exports therefrom, which are shown to be as five to one. The imports of the Company's goods into the Red River Settlement alone, have averaged for a number of years past about $100,000 per year. It is fair to presume that at least an equal amount (a very low estimate) has been distributed among the numerous posts along the Saskatchewan and its tributaries. The proportion, then, of the whole export of furs from the basin of the Winnipeg may be safely estimated at more than one half of the whole trade of the Company, or at least $1,000,000.\n\nSuch are the proceeds of the trade in its present restricted state, and in one class of commodities alone. What will it be when left to the free course of commercial competition, and when an unrestricted colonization opens new fields of industry, and presses all the resources of this new North-Western empire into the stream of reciprocal intercourse, whose swelling volume is already wearing a deep track between Red River and St. Paul?\n\nTHE FUR TRADE OF ST. PAUL WITH THE RED RIVER VALLEY.\n\nIt is to Norman W. Kittson, Esq., the present Mayor of the City of St. Paul, that we are indebted for the first establishment of a regular trade between the Red River Valley, and the navigable waters of the Mississippi. Mr. Kittson went to Pembina in 1843. This advantageous point, at the mouth of the Pembina River and immediately on the international boundary, which had formerly been occupied by the old North-West Company as a trading post, he found deserted.\n\nBut perceiving the eligibility of this situation for tapping the rich fur trade of the Red River Valley, with an entire exemption from the jurisdiction of the oppressive monopoly on the other side of the line, he made arrangements for establishing a post here in connection with the Outfit of the American Fur Company at Mendota, at the junction of the Mississippi and Minnesota rivers, and in the following year, 1844, arrived at Pembina with the first American outfit ever established in the Red River Valley.\n\nThe first recorded journey from Red River to the Mississippi undertaken with a commercial object, was in 1820, when the exigencies of the Red River settlement obliged them to procure supplies of seed at Prairie du Chien. The details of the voyage homeward, accomplished in Mackinac boats, through the Minnesota and Red Rivers, all the way by water except the narrow portage of a mile and a half between Lake Traverse and Big Stone Lake, have already been given. And the citizens of St. Paul are familiar with the venerable form of Peter Hayden, who has until recently annu-\nally visited St. Paul, and who long before Mr. Kittson established his post at Pembina, was in the habit of making occasional excursions from the Selkirk Settlement to Mendota, with droves of cattle and cargoes of moccasins.\n\nIn connection with the earlier exploits in this trade may be mentioned, also, the trip made by Alexis Bailly, Esq., now a citizen of Wabashaw, in company with Francois Labothe, now a resident of Nicollet county. Mr. Bailly took a herd of cattle and horses to Red River, which were in great demand at the colony at the time, and commanded high prices. He had several escapes from Indian war parties, who stole all the horses. Mr. Bailly sold milch cows at the colony for $100 and $135 each, and other cattle in proportion.\n\nBut the staple of the country—furs—formed no part of these erratic ventures. In these commodities, the Hudson Bay Company rigidly preserved their monopoly, the least infringement of which was rigorously punished. But from the time of the establishment of Mr. Kittson's trading post in 1844, on the very edge of their territory, yet shielded from their animosity by the inviolability of American soil and American citizenship, they were compelled to witness a constant encroachment on their monopoly, without the possibility of preventing it. The British half-breeds roamed unrestricted over American Territory, gathering thousands of robes annually, on the Shayenne and the Missouri, to enrich the Hudson Bay Company. International justice certainly did not suffer, although the Company might, if furs procured on the Saskatchewan and the Assineboin found their way gradually to the intrusive American post, on the frontier. The Company did what they could to break up the new establishment. They even had Mr. Kittson at one time arrested for a violation of their charter, but discreetly failed to bring any suit against him, which might have tested its validity.\n\nBut partly in consequence of the repressive measures adopted by them, and still more from the natural difficulty of attracting trade from its established channels, the first years of this single-handed competition with a corporation which, in a history of two hundred years, had worsted all its rivals, gave little promise of the success which has at a later period attended its prosecution.\n\nThe amount of capital invested in the first venture, in 1844, was only about $2000, and the gross proceeds of the furs collected in return, scarcely exceeded $1400. The next two years' operations involved a similar loss, the proceeds of furs collected in 1855 being only some $3000, against an investment in merchandize, &c., of $4000—and of furs in 1846, of $5000, against a capital invested of\nof the value of the exports therefrom, which are shown to be as five to one. The imports of the Company's goods into the Red River Settlement alone, have averaged for a number of years past about $100,000 per year. It is fair to presume that at least an equal amount (a very low estimate) has been distributed among the numerous posts along the Saskatchewan and its tributaries. The proportion, then, of the whole export of furs from the basin of the Winnipeg may be safely estimated at more than one half of the whole trade of the Company, or at least $1,000,000.\n\nSuch are the proceeds of the trade in its present restricted state, and in one class of commodities alone. What will it be when left to the free course of commercial competition, and when an unrestricted colonization opens new fields of industry, and presses all the resources of this new North-Western empire into the stream of reciprocal intercourse, whose swelling volume is already wearing a deep track between Red River and St. Paul?\n\nTHE FUR TRADE OF ST. PAUL WITH THE RED RIVER VALLEY.\n\nIt is to Norman W. Kittson, Esq., the present Mayor of the City of St. Paul, that we are indebted for the first establishment of a regular trade between the Red River Valley, and the navigable waters of the Mississippi. Mr. Kittson went to Pembina in 1843. This advantageous point, at the mouth of the Pembina River and immediately on the international boundary; which had formerly been occupied by the old North-West Company as a trading post, he found deserted.\n\nBut perceiving the eligibility of this situation for tapping the rich fur trade of the Red River Valley, with an entire exemption from the jurisdiction of the oppressive monopoly on the other side of the line, he made arrangements for establishing a post here in connection with the Outfit of the American Fur Company at Mendota, at the junction of the Mississippi and Minnesota rivers, and in the following year, 1844, arrived at Pembina with the first American outfit ever established in the Red River Valley.\n\nThe first recorded journey from Red River to the Mississippi undertaken with a commercial object, was in 1820, when the exigencies of the Red River settlement obliged them to procure supplies of seed at Prairie du Chien. The details of the voyage homeward, accomplished in Mackinac boats, through the Minnesota and Red Rivers, all the way by water except the narrow portage of a mile and a half between Lake Traverse and Big Stone Lake, have already been given. And the citizens of St. Paul are familiar with the venerable form of Peter Hayden, who has until recently annu-\nally visited St. Paul, and who long before Mr. Kittson established his post at Pembina, was in the habit of making occasional excursions from the Selkirk Settlement to Mondota, with droves of cattle and cargoes of moccasins.\n\nIn connection with the earlier exploits in this trade may be mentioned, also, the trip made by Alexis Bailly, Esq., now a citizen of Wabashaw, in company with Francois Labothe, now a resident of Nicollet county. Mr. Bailly took a herd of cattle and horses to Red River, which were in great demand at the colony at the time, and commanded high prices. He had several escapes from Indian war parties, who stole all the horses. Mr. Bailly sold milch cows at the colony for $100 and $135 each, and other cattle in proportion.\n\nBut the staple of the country—furs—formed no part of these erratic ventures. In these commodities, the Hudson Bay Company rigidly preserved their monopoly, the least infringement of which was rigorously punished. But from the time of the establishment of Mr. Kittson's trading post in 1844, on the very edge of their territory, yet shielded from their animosity by the inviolability of American soil and American citizenship, they were compelled to witness a constant encroachment on their monopoly, without the possibility of preventing it. The British half-breeds roamed unrestricted over American Territory, gathering thousands of robes annually, on the Shayenne and the Missouri, to enrich the Hudson Bay Company. International justice certainly did not suffer, although the Company might, if furs procured on the Saskatchewan and the Assineboin found their way gradually to the intrusive American post, on the frontier. The Company did what they could to break up the new establishment. They even had Mr. Kittson at one time arrested for a violation of their charter, but discreetly failed to bring any suit against him, which might have tested its validity.\n\nBut partly in consequence of the repressive measures adopted by them, and still more from the natural difficulty of attracting trade from its established channels, the first years of this single handed competition with a corporation which, in a history of two hundred years, had worsted all its rivals, gave little promise of the success which has at a later period attended its prosecution.\n\nThe amount of capital invested in the first venture, in 1844, was only about $2000, and the gross proceeds of the furs collected in return, scarcely exceeded $1400. The next two years' operations involved a similar loss, the proceeds of furs collected in 1855 being only some $3000, against an investment in merchandize, &c., of $4000—and of furs in 1846, of $5000, against a capital invested of\n$6000. From this time, however, the stream of trade began to turn in the direction of the Mississippi valley, and to break over the artificial barriers interposed by the Company. Mr. Kittson's post grew in favor with the half-breed settlers, who deserted in numbers from the service of the Company, to receive their supplies from the American trader. In 1850 the trade had increased so as to involve a consumption of goods to the extent of $10,000, and it is possible that the proceeds in furs were at least $15,000. Five years later, (in 1855,) the Pembina outfit engaged an expenditure of $24,000, with a return in furs of nearly $40,000.\n\nThe importance of the trade at this time seemed to demand a special depot at St. Paul, and accordingly in this year, the firm of Forbes & Kittson was organized, principally on this basis, and Mr. Kittson, abandoning the subordinate outfit to younger traders, took up his residence in this city—and the enterprising firm of Culver & Farrington soon after established an agency in the same lucrative district.\n\nIn 1856, the total furs received at St. Paul from this source amounted to nearly $75,000, being nearly four-fifths of the whole fur trade of St. Paul.\n\nFrom statistics published in the St. Paul Advertiser of December 21, 1857, we learn that the total value of the furs which passed through St. Paul houses that year for exportation below amounted to $180,000—of which at least two-thirds, or $120,000, was the product of the Red River Valley. This year, owing to the partial failure of the Buffalo—the most important crop of furs—the receipts are lighter; and will not perhaps exceed $100,000. But the carts which are laden with furs form but a small part of the immense caravans which now annually set out from the Red River Colony to St. Paul. The loaded carts, of the five hundred which recently arrived at St. Paul, did not exceed one-fourth of the whole number. The rest arrived empty, and returned to the settlement laden with merchandise, purchased—not by exchanges of furs—but by direct outlays of money.\n\nFrom the number of empty carts which did not depend upon exchanges of furs to fill them, in proportion to loaded ones, it is a low estimate to presume that the amount of money brought to St. Paul from the Selkirk Settlement by the arrivals of this season was at least equal in value to the fur product—or about $100,000.\n\nThese carts, like the marine tonnage in a particular trade, afford a valuable measure of the growth of the trade. In 1844 the carts which accompanied Mr. Kittson to Mendota to convey the results of his first season's business at Pembina, were only six in number.\nIn 1858 the aggregate arrivals are currently stated at six hundred. Of these, it is interesting to note that over four hundred came from the British Territory. The owners of these, instead of furs which they are prohibited by the \"Company\" from exporting, except through their hands, bring the money which they have obtained in exchange for their peltries.\n\nThe monopoly in the course of the last five years has hung very loosely round the shoulders of the \"Company.\" The competition in the fur trade, which, before that was put down by the most rigorous measures, now proves too formidable and is backed by too powerful a public opinion in Canada to be suppressed by the usual policy of restriction.\n\nIn addition to the American posts on this side of the line, there are some hundred independent traders in the Territories of the Company itself, of which there are at least seventy in Selkirk Settlement alone. Though rigidly prohibited from dealing in the contraband articles of furs and rum; both branches of trade are prosecuted to considerable extent and the product smuggled across the border.\n\nIt cannot be doubted that if the enormous duty of $12\\frac{1}{2}$ per cent now levied on importations of British furs across the boundary were abolished, that with the termination of the sway of the Hudson Bay Company, the whole of the trade now forced through the difficult channel of Nelson's River, would seek its more natural and congenial outlet in this direction.\n\n---\n\nAPPENDIX NO. VIII.\n\nA VISIT TO THE RED RIVER SETTLEMENTS.\n\n[Extract from an Address before the Minnesota Agricultural Society, delivered by Hon. Alexander Ramsey, first Governor of the Territory of Minnesota.]\n\nIt was my fortune in 1851 to be commissioned by the President of the United States to negotiate a treaty with the Chippewa Indians of Pembina, Red Lake and Turtle Mountain, for the extinguishment of their nominal title of occupancy (the real title being in the Red River Half Breeds themselves) to the valley of the Red River of the North.\nAfter closing our council with them and the half breeds at the point of confluence of the Pembina with the Red River, I had a few days leisure while preparations were being made for the return of our own party southward, and I concluded to visit the Selkirk Settlement, some eighty miles beyond the international boundary line and about one hundred miles down the Red River of the North.\n\nSecuring two birch bark canoes of the largest size, and employing eight voyageurs or paddlers, in each, with Dr. Thomas Foster, Lieut. Corley, Hugh Tyler, Esq., and Pierre Bottreau, our faithful guide, in company, we committed ourselves to the muddy waters of the famed Red River of the North, and descended northward as rapidly as the nervous arms of our sturdy voyageurs could send us.\n\nOur first night out was spent in our tent pitched on the bank of the river; but the next day about noon we had notice that we were approaching the upper portion of the Selkirk Settlement, and at about 2 o'clock P.M., the first house broke upon our view—farm houses with gardens attached, and fenced fields around them, each farm with its proper complement of substantial barns and outhouses, and the common assortment of poultry industriously picking up their living as usual, with cattle grazing in the distance, and men moving around with teams at their work, and grain stacks, hay ricks, and all the evidences of prosperous farming, filling up the cheerful picture.\n\nTo us it was a cheerful one indeed. We felt as the marines do when a month or more at sea, upon catching sight of land again. Land ho! is their cry. Farm ho! was ours. To us these farms that were almost within shaking hand distance of the North Pole, gave us assurances that civilized people lived there; that plenty reigned there; that comfort was about the hearthstone. It was a pledge also, gentlemen, of a good dinner in store for us; a thing not to be despised by such wayfarers as we were in the wilderness; but a thing which I assure you is not always to be obtained when meeting with those generally needy and scantily provisioned people of the wilderness who have no farms! Those farmless denizens of the wild are much more likely to want, and take, too, if they can, your dinner, if you have one, than to bestow a noon meal upon you—for, gentlemen, believe me, that out there in the wilderness, they still cling to\n\n\"The good old rule, the simple plan,\nThat they shall take who have the power,\nAnd they shall keep—who can.\"\n\nBut a farm house, on the contrary, in whatever part of the world you may drop in upon it, is synonymous with the horn of plenty;\nyou may be sure there are good things inside and around it, and that the farmer's heart is always as large in the way of hospitality as his barn is big, and sometimes a little larger. On this presumption we forthwith acted, and beaching our canoes, soon found our anticipations realized by partaking of a real civilized dinner once more, of which the usual vegetables, such as we are familiar with, formed an acceptable part.\n\nPerhaps you wonder at my dwelling on this circumstance which possibly has but little interest in your ears; but no incident of my life dwells more vividly on my mind, or is looked back upon with more pleasure, than this meeting with those farm houses of that far northern river; a feeling akin to that which would make a parched traveler in Sahara's Desert remember forever his discovery of a spring of living water that was unknown before to exist amidst its arid sands.\n\nRe-embarking in our canoes, we continued descending the river for some fifteen miles further, through the French portion of the settlement lining mainly the west or left bank of the river, until we arrived about the centre of the colony, at the mouth of the Assiniboin tributary of Red River, where we landed and remained a few days, viewing the colony and its improvements.\n\nI was at that time, and am even now when I look back upon it, lost in wonder at the phenomena which that settlement exhibits to the world.\n\nImagine a river flowing sluggishly northward through a flat alluvial plain, and the west side of it lined continuously for over thirty miles with cultivated farms, each presenting those appearances of thrift around them which I mentioned as surrounding the first farms seen by us; each farm with a narrow frontage on the river of only twenty-four rods in width, but extending back for one or two miles, and each of these narrow farms having their dwellings and the farm out buildings spread along the river front, with lawns sloping to the waters' edge and shrubbery and vines liberally trained around them, and trees intermingled—the whole presenting the appearance of a long suburban village—such as you might see near our eastern seaboard, or such as you find exhibited in pictures of English country villages; with the resemblance rendered more striking by the spires of several large churches peeping above the foliage of the trees in the distance; whitewashed schoolhouses glisten here and there, amidst sunlight and green; gentlemen's houses of pretentious dimensions and grassy lawns and elaborate fencing, the seats of retired officers of the Hudson Bay Company, occasionally interspersed; here an English Bishop's Parson-\nage, with a Boarding or High School near by; and over there a Catholic Bishop's massive Cathedral, with a Convent of the Sisters of Charity attached; whilst the two large stone forts, (at which reside the officers of the Hudson Bay Company, or of the Colony, one called Upper Fort Garry, and situated at the mouth of the Assiniboin, and the other termed Lower Fort Garry, which is twenty miles farther down the river,) helped to give additional picturesqueness to the scene.\n\nI had almost forgotten to mention, what is after all the most prominent and peculiar feature of that singular landscape—singular from its location—and that is, the numerous wind mills, nearly twenty in all, which on every point of land made by the turns and bends in the river, stretched out their huge sails athwart the horizon, and seemingly looked defiance at us, as invading strangers that were from a land where steam or water mills monopolize their avocation of flour making.\n\nOne morning, as we passed down the principal high road, on our way to Lower Fort Garry, the wind after a protracted calm began to blow a little; when presto! each mill veered around its sails to catch the propitious breeze, and as the sails began to revolve, it was curious to observe the numerous carts that shot out from nearly every farm-house, and hurried along the road to these mills, to get ground their grists of spring wheat, with which they were respectively loaded.\n\nAnother incident during the same trip that struck us oddly, was seeing two ladies driving by themselves a fine horse hitched to a buggy of modern fashion, just as much at home apparently as if they were driving through the streets of St. Paul, St. Anthony or Minneapolis, instead of upon that remote highway towards the North Pole; but this was not a whit more novel than to hear the pianoforte, and played too, with both taste and skill. While another \"lion\" of those parts that met our view was a topsail schooner lying in the river at the Lower Fort, which made occasional trips into Great Lake Winnipeg of the North, a hundred miles below.\n\nI took occasion during my visit to inquire what success the farmers met with in securing good crops, and the profits of farming generally.\n\nAs to wheat, I learned that the yield of the spring variety was quite equal in quantity and quality to the crop of that grain on any more southern farms; that in raising barley they could almost surpass the world; and that the cereals generally, and all the eculent roots, were easily raised. Indian corn was not planted as a field crop, though it was grown in their gardens.\nIn a word, the capacity of their land to produce almost everything plentifully and well, was established; but for all this, farming did not afford much profit for want of a sufficient market; beyond a small demand by the Hudson Bay Company, there was no outlet for their superabundance, and to use an Austrian phrase in regard to the Hungarians, the Selkirkers are metaphorically \"smothering in their own fat.\"\n\nTo remedy this state of things they were beginning, when I was there, to turn their attention towards raising Cattle and Horses, for which their country is well calculated, and the first fruits of this new direction given to their farming energies, we have already experienced, in the droves of both which have recently been driven from thence and sold in this vicinity.\n\nThe Hudson Bay Company have taken considerable pains to aid in this stock enterprise. I saw at Lower Fort Garry, a splendid bay stallion of almost gigantic size, and of the finest points, which the Company had imported from England at a cost of two thousand pounds sterling, expressly to afford the colonists an opportunity to improve the breed of their horses. And at the Upper Fort, I was shown a bull of extraordinary size, and of the pure Durham blood, which the Company had also brought from England, for the purpose of improving the cattle of the colony.\n\nIn entering upon these particulars respecting a farming community five hundred miles north of us, my object first is to exhibit to you how people live and what kind of farming they carry on in a country that is perhaps really \"too cold for corn\" as a common field crop; and second, but mainly, to show, how wide a scope of arable land, capable of supporting and destined to support some day, tens of thousands of farmers, is spread out away northward, in regions which are now ignorantly considered impracticable for profitable tillage, on account of the supposed rigors of their climate.\n\nWhy, away up on Peace River, on the extreme northern slope of the Rocky Mountains, they raise around the Hudson Bay posts, as Gov. Colville told me, as fine barley as anywhere in the world, and yet that is in latitude 60 degrees north, or a thousand miles nearer the North Pole than we are!\n\nBut without casting more than a passing glance on the agricultural capacity of remote Peace River, we may come down to the fertile valley and plains of the great Saskatchewan, the Mississippi of the North, which pours its waters from the Rocky Mountains over more than a thousand miles of agricultural territory, teeming with coal and other mineral treasures, into Great Lake Winnipeg.\nof the North; and we may note the still more fertile and desirable lands of its South or Bow River Branch, the winter home in its wooded valleys of the buffalo and myriads of other game, but which was for a long time inaccessible to the white man on account of the hordes of hostile savages which its recesses contained; as far north as these regions are, actual experiment has shown them to be capable of raising successfully nearly every cereal, hardly excepting corn, and every vegetable that can be produced, in our lands of the temperate zone further South.\n\nFrom what I have seen of the land in that direction, and from what I learned respecting its capacity, and making every allowance for its climate, and for its extraordinary fertility also, I hesitate not to ascribe to the whole of the upper plains on both branches of the Saskatchewan River, an agricultural value superior naturally to the fields of our New England in their primitive condition; and though lack of timber might be an objection to some portions of the Saskatchewan territory, yet it has mineral coal in abundance, which may be easily mined to supply fuel for a population of the densest character.\n\nAnd in regard to this very country, remote as it is, and notwithstanding the prevailing misconception of the severity of the winter's cold, and of the warmth of its summer heat, I venture to put on the mantle of a prophet and say, that some men who now hear me will live to see its present sparse and half hunter race displaced by the advancing tide of farmers seeking homes, who, after Minnesota is packed and crammed with immigrants, will swell resistless over the border upon those northern plains.\n\nNot, gentlemen, that Minnesota is yet near, nor will be for many years to come, so full of farmers that the annual immigrants cannot find places in it unclaimed, whereupon to set up their family altars, or lands into which they are not free to strike deep their hoes and plows.\n\nThose who think the cup of our farming capacity near full, little know its depth and breadth, and the volume it will contain.\n\nThose who have fears, that the \"good country\" in which to make claims is nearly absorbed, take but a limited view of the topography and geography of our Territory.\n\nWhat else is there occupied by claimants as yet, but comparatively narrow strips on the Mississippi and Minnesota rivers? The whole interior lies untouched, awaiting to receive within its luxurious bosom a million of farmers if they should come along in search of \"homes for the homeless and land for the landless.\"\n\nIn the treaties with the Sioux Indians of 1851, were purchased over 40,000,000 acres of land, nearly all arable, with less waste\nland among it than could be found in any country of so great extent in the world.\n\nAnd how much of this, do you think, has, up to this time, been appropriated by settlers, or sold to speculators?\n\nNot much over one-eighth of it, scarcely an acre over 5,000,000, leaving 35,000,000 acres of the Sioux Purchase alone, still open to new-comers and settlers!\n\nSouth of the Minnesota, east of the Big Sioux, west of the Mississippi, and north of the Iowa line, there is an Agricultural Basin of rich lands well watered and heavily timbered, which has only been touched upon, or barely dipped into.\n\nThere is a chance in that Basin to submerge, to bury up, two hundred thousand farmers more; bury them deep in luxuriant corn fields, and place huge wheat and oat stacks as buoys to mark where each \"bold farmer\" went down!\n\nIn another portion of that Purchase, north of the Minnesota, and west of the Mississippi, to the Otter-Tail Lake branch of the Red River of the North, there is hardly a commencement of settlement far back from the main river!\n\nMuch of this region I have myself seen by passing through, sufficiently to pronounce it surpassed in fertility and agricultural capacity generally, by no other part of the Territory, if it can be equalled.\n\nIt is a paradise of beautiful lakes and groves, and waving meadows rank with fine grasses, often as tall as a man riding on horseback!\n\nParties are just beginning to explore the recesses of this noble country—and their favorable reports, and the roads by which they make it accessible, will ere long roll in a tide of immigration upon it, which will astonish those croakers who are already alarmed about land for \"claims\" growing scarce!\n\nThen, there is the garden-like region around Otter-Tail Lake, and on the beautifully diversified streams flowing from it, to which emigrants may fly when the nearer lands are all absorbed, if they will wait until then.\n\nAnd last but not least, to use a common-place saying, there is the glorious valley and wide savannas of the Red River of the North itself, clear up to Pembina near the British line, inviting the Farmer, whether stock grower or grain raiser, to luxuriate upon its fertile bosom—a land now flowing with milk and buffalo—a valley watered by a river the most admirably calculated by the depth of its channel, its freedom from rapids, and the sluggishness of its current for navigation by steamboats for over 500 miles—a\nvalley, or rather a slightly oval basin, with islands of timber dotting it over, the bluff slope of the Coteau du Prairie bounding its horizon on the west, and heavy woods east of the river circumscribing it in that direction.\n\nHere in this lovely valley there is room and verge enough for population to spread itself out in every direction; and I look to see it blossom with roses and flowers from cultivated gardens around comfortable farm-houses, as it does now with the wild flowers which, in the summer season, involve the voyageur on Red River in a continuous atmosphere of perfume, as he paddles down its stream in his bark canoe.\n\nIt is now a kind of \"no man's land,\" which even the Indian does not occupy; for it is a war-ground where opposing parties of the savage family meet each other occasionally in desperate conflict, and which for that reason they have nearly totally abandoned.\n\nIn my whole journey of nearly two months travel, to and from Pembina in 1851, I did not see the face of a human being besides those of our own party.\n\nHow long will this character of human desolation be ascribed to it by travellers through its otherwise smiling plains?\n\nSo great is the luxuriance of the grasses in this valley, that the buffalo winter there and find food by pawing away the snow to get at the sward beneath.\n\nEven at its ultima thule at Pembina Mountains, where I stayed with the Rev. Mr. Belcourt on the night of October 2d, 1851, watermelons and cantelopes were served to us for desert, and the first frost that occurred sufficient to kill those vines, was on the very night I passed at that point, at which is located the thriving settlement of Saint Joseph, the principal village of those Half Breeds of the North who reside on the American side of the line. We also saw some Indian corn raised there, the seed of which had been brought over from the missionary station at Red Lake.\nAPPENDIX NO. IX.\n\nPROCEEDINGS OF A PUBLIC MEETING HELD AT SAINT ANTHONY ON THE TWELFTH OF JULY, 1858.\n\nPursuant to adjournment, a large number of the citizens of St. Anthony and Minneapolis convened at the Winslow House, to take further measures to open the emigrant route to the Frazer River mines. Geo. F. Brott resumed the Chair. The Committee appointed to enquire into the feasibility of steam navigation on the northern route, &c., made the following report:\n\nYour Committee having under consideration the practicability of steamboat navigation by way of the Red River, Lake Winnipeg and the Saskatchewan to the gold regions on Thompson and Frazer rivers, and over the land route in the same direction, beg leave to make the following report.\n\nThat upon examination of Capt. Pope's report of his survey of the Red River of the North, the depth of water from Breckinridge at the mouth of the Sioux Wood River to the Wild Rice River, is four feet; from thence down to Shayenne River and further to the mouth of the Red Lake River, from eight to nine feet, and from thence to Pembina and Selkirk Settlement, fifteen feet, and this continues to where it debouches into Lake Winnipeg. Lake Winnipeg is long, narrow and deep. The Saskatchewan River is said to be very large—about the size of the Mississippi near Dububue. Gov. Simpson, in his notes of travel up that River, pronounces it navigable for seven hundred miles in a direct line towards the Rocky Mountains, with only one rapid to obstruct navigation. How difficult the rapid to be overcome is, we have not sufficient information to determine.\n\nWe are satisfied that there is no perpendicular fall, for Gov. Simpson says \"that canoes and flat boats pass over the rapids with safety.\" With the exception of the rapids above mentioned, your Committee are of the opinion, that it is entirely feasible to traverse said route by steamboat, from Breckenridge, by the Rocky Mountain House, only about two hundred miles distant from the gold mines on Thompson River. We calculated the distance from\nBreckenridge, by river to Lake Winnipeg four hundred miles, from thence to the mouth of the Saskatchewan, two hundred miles, and up said river to the Rocky Mountain House, one thousand miles, making the distance of continuous water communication sixteen hundred and fifty miles. From St. Cloud, the head of navigation of the Upper Mississippi, to Breckenridge, the distance overland is one hundred and twenty-five miles, making from S. Anthony to Frazer and Thompson River gold mines, about three hundred and twenty-five miles of overland travel only, a part of which passes through a country thickly settled. The advantages of this route more fully appears, by consulting Pope's report, describing the rich valley of the Red River, with its luxuriant vegetation, abounding with wild fruit and fragrant with flowers; also by consulting Blodget's Climatology, and tracing, the course of the isothermal lines, showing the climate and temperature of Chicago and St. Anthony to extend in a Northwest direction along our proposed emigrant route, and as far as the fifty-fifth degree of north latitude. The average depth of rain in a year along this route is estimated at thirty-two inches, while on the plains on the central and southern routes the depth of water is estimated at two inches, showing that trees and vegetation necessary for the habitation and the sustenance of man grow in great abundance; and that most of the way, if not all, dent corn will grow and mature along this northern route which it will not do in New York or the New England States.\n\nYour Committee would recommend that active measures be immediately taken to construct a suitable steamboat, to test the navigation of this route, and would further recommend that a sum of five thousand dollars be raised to be donated to some competent person who will contract to build a boat as above described, at Breckenridge, all complete by the first day of May next. We would also recommend, that a Committee be appointed to correspond with the Governor of Hudson Bay Territory, and such other persons as would be likely to assist in putting a line of steamers on said route. Your Committee estimate that by steamboat, the emigrant can accomplish a journey to Frazer River by the way of Red River, Lake Winnipeg and the Saskatchewan, in one-third of the time, at less cost and with much less hardship and danger than would be necessarily incurred in traveling the overland route. The Committee in the short time allowed them, have not matured a report as they desired; we trust however, that what knowledge we have, is sufficient to engage the active co-operation of every Minnesotian in the enterprise.\nOn motion the report was adopted; remarks were made by E. M. Wilson, of Minneapolis, Geo. W. Wilson, of Virginia, Geo. F. Brott, Geo. Hollister and others, in reference to the climate, soil, timber, &c., of the Red River Valley, and the character and depth of water of the river, all of whom concurred in giving a very favorable description.\n\nOn motion, Richard Chute of St. Anthony, W. J. Parsons, and E. M. Wilson of Minneapolis, were appointed a Committee of correspondence, to communicate with such persons in this State and elsewhere, as may be deemed necessary to promote the object of the meeting.\n\nOn motion, Geo. F. Brott, D. S. B. Johnston, and Henry T. Welles, were appointed Committee to raise by subscription five thousand dollars, and to contract for a steamboat to be built on Red River at the earliest time convenient.\n\nOn motion of W. J. Parsons, the following resolution was adopted:\n\nWhereas, It has upon conference had with some of the most experienced voyaguer and pioneers of the northwest, been ascertained that the Red River of the North from the town of Breckenridge at mouth of the Bois Des Sioux is navigable to its mouth, and\n\nWhereas, This statement is fully corroborated by Capt. Pope, U. S. Top. Engineer in the official report of the U. S. survey of 1849, and\n\nWhereas, Gov. Simpson, in his able report of his survey of the Saskatchewan Valley, has fully demonstrated the practicability of steam navigation of the Saskatchewan River to within 200 miles of Thompson River, a branch of Frazer River in British Oregon, therefore\n\nResolved, That the way proposed in the Committee's report for an emigrant route, from the Falls of St. Anthony to the gold mines of Frazer River, is not only practicable, but is the best and most expeditious route for emigrants from any and all points east of St. Anthony's Falls to that region.\n\nOn motion the meeting adjourned.*\n\n* These proceedings, bearing directly upon the subject discussed by the House Committee, should have been previously inserted; but were not received until most of the present publication had passed through the press. They are transferred from the columns of the St. Anthony Express of the 17th of July.\nState of Minnesota.\n\nOVERLAND EMIGRATION\n\nFROM\n\nMINNESOTA TO FRAZER RIVER.", "source": "olmocr", "added": "2025-10-05", "created": "2025-10-05", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P000371.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 101, "total-input-tokens": 141210, "total-output-tokens": 57283, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 299, 1], [299, 299, 2], [299, 2425, 3], [2425, 5009, 4], [5009, 7109, 5], [7109, 8107, 6], [8107, 8116, 7], [8116, 8116, 8], [8116, 9588, 9], [9588, 12185, 10], [12185, 14748, 11], [14748, 17393, 12], [17393, 20018, 13], [20018, 22685, 14], [22685, 25555, 15], [25555, 28170, 16], [28170, 30747, 17], [30747, 33267, 18], [33267, 35834, 19], [35834, 38456, 20], [38456, 41000, 21], [41000, 43236, 22], [43236, 45890, 23], [45890, 48585, 24], [48585, 51254, 25], [51254, 53959, 26], [53959, 56574, 27], [56574, 59148, 28], [59148, 61833, 29], [61833, 64609, 30], [64609, 67341, 31], [67341, 70056, 32], [70056, 72713, 33], [72713, 75453, 34], [75453, 78102, 35], [78102, 80546, 36], [80546, 82877, 37], [82877, 85430, 38], [85430, 87331, 39], [87331, 89901, 40], [89901, 92512, 41], [92512, 95135, 42], [95135, 97686, 43], [97686, 100338, 44], [100338, 103114, 45], [103114, 105881, 46], [105881, 107518, 47], [107518, 110221, 48], [110221, 112936, 49], [112936, 115661, 50], [115661, 118455, 51], [118455, 121120, 52], [121120, 122760, 53], [122760, 125484, 54], [125484, 128155, 55], [128155, 130754, 56], [130754, 133473, 57], [133473, 136121, 58], [136121, 138764, 59], [138764, 141427, 60], [141427, 144005, 61], [144005, 146416, 62], [146416, 148190, 63], [148190, 150262, 64], [150262, 152971, 65], [152971, 157902, 66], [157902, 159854, 67], [159854, 163233, 68], [163233, 165463, 69], [165463, 168181, 70], [168181, 170910, 71], [170910, 173578, 72], [173578, 175764, 73], [175764, 178450, 74], [178450, 181088, 75], [181088, 183719, 76], [183719, 186410, 77], [186410, 189005, 78], [189005, 191602, 79], [191602, 194147, 80], [194147, 196769, 81], [196769, 199451, 82], [199451, 202164, 83], [202164, 204816, 84], [204816, 207428, 85], [207428, 210131, 86], [210131, 212743, 87], [212743, 215446, 88], [215446, 218096, 89], [218096, 220124, 90], [220124, 222736, 91], [222736, 225384, 92], [225384, 227982, 93], [227982, 230596, 94], [230596, 233294, 95], [233294, 235720, 96], [235720, 237622, 97], [237622, 239672, 98], [239672, 242339, 99], [242339, 244533, 100], [244533, 244607, 101]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]