[{"id": "49170908501c4e40f8ae9089e52cf0afa962cc91", "text": "DE NEDERLANDSCH-AMERIKAANSCHE LAND MAATSCHAPPIJ.\n\nOFFICIAL GUIDE BOOK\n\nTO THE LANDS OF\n\nThe Netherlands American Land Company.\n\nSELECTED LANDS\n\nIN\n\nMANITOBA AND THE NORTH WEST TERRITORIES.\n\nJOHN B. McKILLIGAN,\n\nGENERAL AGENT,\n\n2 PORTAL AVENUE\n\nWINNIPEG.\n\nTHE BISHOP ENGRAVING AND PRINTING COMPANY, WINNIPEG.\nDe Nederlandsch-Amerikaansche Land Maatschappij.\n\nThe Netherlands-American Land Co.\n\nOF\n\nAMSTERDAM, HOLLAND.\n\nAuthorized by Special Act of Parliament to transact business in the Dominion of Canada.\n\nDIRECTORS IN AMSTERDAM:\nA. A. H. Boissevain, President, J. H. Van Eeghen,\nH. M. Huydecoper.\n\nIN ST. PAUL, MINN.\nG. W. Vis, Managing Director. Isaac C. Jolles, Attorney-in-fact.\n\nSECRETARY: A. C. BIENFAIT, Amsterdam.\n\nHEAD OFFICE FOR CANADA, 387 MAIN STREET, WINNIPEG.\n\nJOHN B. McKILLIGAN, General Agent.\n\nSOLICITORS: BAIN, BLANCHARD & MULOCK, Barristers, Winnipeg.\n\nWINNIPEG:\nTHE BISHOP ENGRAVING AND PRINTING COMPANY.\n\n1885.\nDE NEDERLANDSCH AMERIKAANSCHE\nLAND MAATSCHAPPIJ.\n\nThe Netherlands-American Land Company\n\n50,000 Acres of the best and most carefully selected land in\nManitoba and the North West.\n\nTHE NETHERLANDS-AMERICAN LAND COMPANY are prepared to sell\ntheir lands on the most favorable terms. The lands are chiefly in\nthe mile-belt of the Canadian Pacific Railway between Virden and Wolseley,\nand are suitable for wheat raising, mixed farming and stock raising.\n\nIntending purchasers can, with little trouble or expense, personally\ninspect the lands, as they are situated quite close to the following\nstations:—Virden, Hargrave, Elkhorn, Fleming, Moosomin, Burrows, White-\nwood, Percival, Broadview, Oakshela, Grenfell, Summerberry, Wolseley,\nand Sintaluta.\n\nLands may be purchased in large or small quantities, that is, in parcels\nof 640, 320, or 160 acres.\n\nTERMS OF PAYMENT.\n\nPayment may be made in full at time of purchase and an indisputable\ntitle given, or by instalments to suit purchasers, with interest at the rate of\n6 per cent. per annum. The Company are willing to make the first three\nyears payments on the land very light, in order to give the purchasers an\nopportunity of getting over the most trying part of a settler's life without\nbeing burdened by heavy payments.\n\nLocal agents have been appointed at the principal stations and towns\non the line of the Canadian Pacific Railway, who will give all particulars.\nAll payments must be made to the undersigned.\nThis Company are in a position to sell lands at cheaper rates and on easier terms than any private individuals or large corporations, and you are urgently requested to call and see the agent who has the field notes of Canadian Pacific Railway land examiners in his hands. A list of the lands with extracts from the field notes is herewith subjoined, but these extracts are merely intended to show the nature of the land. The full field notes show also timber, water, grass, stone, coal, &c., and special remarks of the examiners.\n\nFrom the maps appended hereto, and the list of lands, intending purchasers will have no difficulty in locating the Company's lands.\n\nThese lands were specially examined by the Company's inspector before purchase from the Canadian Pacific Railway Co.\n\nJOHN B. MCKILLIGAN,\nGeneral Agent for the Dominion of Canada.\nHead Office: 387 Main Street, Winnipeg.\nLANDS FOR SALE\n\nBY\n\nTHE NETHERLANDS-AMERICAN LAND CO.\n\nVIRDEN DISTRICT.\n\nI WEST OF THE 1ST PRINCIPAL MERIDIAN.\n\n| No. | Tr. | R. | Section. | Acs. | Remarks |\n|-----|-----|----|----------|------|---------|\n| 1   | 11  | 25 | W. ½ of 5 | 320  | Gently undulating; sand and clay loam; subsoil clay with a little gravel. |\n| 4   | 10  | 26 | Whole of 31 | 640  | Rolling; black loam 16 to 20in.; gravel and sandy subsoil. |\n| 5   | 11  | 26 | \" 5 \"      | 640  | Undulating; do. 8 to 12in.; light clay subsoil. |\n| 6   | 11  | 26 | \" 7 \"      | 640  | Upland rolling prairie; black loam 12 to 18in.; sand subsoil. |\n| 7   | 11  | 27 | \" 3 \"      | 640  | Rolling; dark loam with gravel 10 to 24in.; subsoil clay and gravel |\n| 8   | 11  | 27 | \" 23 \"     | 640  | Rolling; black sandy loam 12 to 16in.; clay subsoil. |\n| 9   | 9   | 28 | \" 15 \"     | 640  | Undulating; |\n| 10  | 9   | 28 | \" 31 \"     | 640  | \" broken by marshes; 6 to 14in. sand loam; subsoil sand and clay. |\n| 11  | 10  | 28 | \" 15 \"     | 640  | Undulating; black sandy loam 8 to 15in.; gravel clay subsoil. |\n| 12  | 10  | 28 | \" 19 \"     | 640  | \" light and stony on ridges. |\n| 13  | 10  | 28 | \" 35 \"     | 640  | \" sand and clay loam mixed with gravel; subsoil sand and clay. |\n| 14  | 11  | 28 | \" 23 \"     | 640  | Rolling; rich black loam 12 to 20in.; light gravel on ridges. |\n\nMOOSOMIN DISTRICT.\n\n| No. | Tr. | R. | Section. | Acs. | Remarks |\n|-----|-----|----|----------|------|---------|\n| 15  | 10  | 29 | E. ½ of 17 | 320  | Sandy clay loam 12 to 18in.; sandy clay subsoil. |\n| 16  | 10  | 29 | N. ½ of 19 | 320  | Pipestone creek runs through; good clay loam; subsoil clay and gravel. |\n| 17  | 12  | 29 | Whole of 15 | 640  | Rolling prairie; light black loam 8 to 12in.; sand and gravel subsoil. |\n| 18  | 12  | 29 | \" 31 \"     | 640  | Rolling; broken by sloughs and hills; light black loam; gravel clay subsoil. |\n| 19  | 13  | 29 | E. ½ of 17 | 320  | Rolling; dark sandy loam with gravel; subsoil gravelly; clay subsoil. |\n| 20  | 13  | 29 | N. ½ of 23 | 320  | Rolling; broken by ridges and small sloughs; dark clay loam; clay subsoil. |\n### Moosomin District.—Continued.\n\n| No. | Tp. | R. | Section | Acs. | Remarks |\n|-----|-----|----|---------|------|---------|\n| 21  | 13  | 30 | S 1/4 of 3... | 320 | Rolling; black loam 12 to 14in.; clay and gravel subsoil. |\n| 22  | 13  | 30 | Whole of 5... | 640 | \" black clay loam; clay and gravel subsoil. |\n| 23  | 13  | 30 | \" 7... | 640 | \" black sandy loam 16 to 23in.; clay and gravel subsoil. |\n| 24  | 13  | 30 | \" 15... | 640 | \" small ponds and ridges; light clay loam 8 to 14in. |\n| 25  | 13  | 30 | \" 17... | 640 | \" sandy loam; clay subsoil; well drained. |\n| 26  | 13  | 30 | \" 19... | 640 | \" clay and gravel subsoil; well drained. |\n| 27  | 13  | 31 | \" 23... | 640 | Low; gentle slope; black sandy loam 10in.; sandy clay subsoil. |\n| 28  | 13  | 31 | \" 27... | 640 | Varies from level to rolling; broken; light clay loam 6 to 14in. |\n| 29  | 13  | 31 | \" 35... | 640 | Varies from undulating to hilly; sandy loam; clay and gravel subsoil. |\n| 30  | 14  | 29 | \" 3... | 640 | |\n| 31  | 14  | 29 | \" 7... | 640 | |\n| 32  | 14  | 29 | \" 15... | 640 | |\n| 33  | 14  | 29 | \" 17... | 640 | |\n| 34  | 14  | 29 | \" 23... | 640 | |\n| 35  | 15  | 29 | \" 3... | 640 | |\n| 36  | 15  | 29 | \" 5... | 640 | |\n| 37  | 15  | 29 | \" 17... | 640 | |\n\n### Broadview District.\n\nII. West of the 2nd Principal Meridian.\n\n| No. | Tp. | R. | Section | Acs. | Remarks |\n|-----|-----|----|---------|------|---------|\n| 38  | 14  | 1  | S 1/2 of 3... | 320 | Rolling; dark loam 18 to 24in.; subsoil clay and gravel. |\n| 39  | 14  | 1  | Whole of 17... | 640 | \" rich black sandy loam 10 to 25in.; subsoil clay and gravel. |\n| 40  | 14  | 1  | \" 19... | 640 | Rolling; black sandy loam with gravel 12 to 16in.; subsoil clay and gravel. |\n| 41  | 14  | 1  | \" 27... | 640 | Uplands gently rolling; black sandy loam and gravel; subsoil clay and gravel. |\n| 42  | 14  | 1  | \" 31... | 640 | Rolling; a few ponds; black sandy loam and gravel; subsoil clay and gravel. |\n| 43  | 14  | 1  | \" 35... | 640 | Rolling; a few ponds; black sandy loam and gravel; subsoil clay and gravel. |\n| 44  | 16  | 1  | \" 7... | 640 | Undulating with ridges; dark loam with gravelly clay subsoil. |\n| 45  | 14  | 2S 1/4 N.E. 1/4 15 | 480 | Gently rolling; dark sandy loam with fine gravel on knolls; subsoil clay and gravel. |\n| 46  | 14  | 2  | Whole of 23... | 640 | Gently rolling; black sandy loam 12 to 18in.; subsoil clay and gravel. |\n| 47  | 14  | 2  | \" 27... | 640 | Gently rolling; black sandy loam 12 to 18in.; subsoil clay and gravel. |\n| 48  | 15  | 2  | \" 17... | 640 | Rolling; rich black sandy loam 8 to 16in.; subsoil clay and gravel. |\n| No. | Tr. | R. | Section | Acs. | Remarks |\n|-----|-----|----|---------|------|---------|\n| 49  | 15  | 2  | Whole of 27... | 640  | Rolling; rich black sandy loam 8 to 16in.; subsoil clay and gravel. |\n| 50  | 16  | 2  | \" 23... | 640  | Undulating; black loam with sand; light clay subsoil. |\n| 51  | 16  | 2  | \" 27... | 640  | \" light black loam 12 to 18in.; clay and gravel subsoil. |\n| 52  | 15  | 3  | N. 1/2 of 3... | 320  | Gently rolling; black sandy loam 8 to 16in. |\n| 53  | 15  | 3  | Whole of 3... | 640  | Rolling; |\n| 54  | 15  | 3  | \" 31... | 640  | High rolling; broken in part by ridges and meadows; clay and gravel subsoil. |\n| 55  | 15  | 3  | \" 35... | 640  | Rolling; black sandy loam 12 to 16in.; clay and gravel subsoil. |\n| 56  | 16  | 3  | \" 3... | 640  | Undulating; broken by marshes; light black loam and gravel; clay and gravel subsoil. |\n| 57  | 16  | 3  | \" 17... | 640  | Undulating; broken by ridges, knolls and ponds; dark sandy loam; clay and gravel subsoil. |\n| 58  | 16  | 3  | \" 23... | 640  | Gently rolling; sandy loam and clay; subsoil sandy clay. |\n| 59  | 16  | 3  | \" 27... | 640  | Undulating; somewhat broken; black loam; gravel and sand subsoil. |\n| 60  | 16  | 3  | \" 35... | 640  | Undulating; rich loam 8 to 12in.; clay subsoil excellent. |\n| 61  | 15  | 4  | \" 23... | 640  | Gently rolling; clay loam 12 to 16in.; subsoil clay. |\n| 62  | 15  | 4  | \" 27... | 640  | \" clay loam with gravel 10 to 18in.; subsoil clay. |\n| 63  | 16  | 4  | \" 3... | 640  | Rolling; boulders and gravel on high land; sand and clay. |\n| 64  | 16  | 5W. 1/2 of 23... | 320  | \" in some places low and flat; Weed Lake on this; clay loam. |\n| 65  | 16  | 5S. 1/2 of 27... | 320  | Gently rolling; sandy loam 10 to 20in.; steep; subsoil clay; Lake. |\n| 66  | 16  | 5W. 1/2 of 35... | 320  | Rolling; stiff clay 12 to 18in.; subsoil clay. |\n| 67  | 16  | 6  | Whole of 27... | 640  | \" broken on north by ravine; black sandy soil; subsoil sandy clay. |\n| 68  | 16  | 6  | \" 31... | 640  | Rolling; clay loam and sand; stony in places; Qu'Appelle trail runs through. |\n| 69  | 17  | 7  | \" 3... | 640  | Undulating; Gravelly loam 6 to 12 in.; subsoil clay and gravel. |\n| 70  | 17  | 8S. 1/2 of 5... | 320  | \" dark sandy loam; gravel and clay subsoil. |\n\n**WOLSELEY DISTRICT.**\n\n| No. | Tr. | R. | Section | Acs. | Remarks |\n|-----|-----|----|---------|------|---------|\n| 71  | 16  | 8  | Whole of 15... | 640  | Rolling; clay loam and mould 8 to 20in.; clay subsoil. |\n| 72  | 16  | 8  | \" 23... | 640  | \" clay loam 8 to 16in.; subsoil sandy clay and gravel. |\n| 73  | 16  | 9E. 1/2 of 31... | 320  | Undulating; sand and clay loam 6 to 15in.; subsoil sandy clay. |\n| 74  | 17  | 9  | Whole of 3... | 640  | Level to rolling; sandy loam 6 to 10in.; gravel and clay subsoil. |\n| 75  | 17  | 9  | \" 5... | 640  | Rolling; sandy loam 12 to 14in.; clay subsoil. |\n| 76  | 17  | 9  | \" 15... | 640  | Undulating; dark sandy loam 7 to 14in.; clay and gravel subsoil. |\n| 77  | 17  | 9  | \" 17... | 640  | \" sandy loam 8 to 14in.; gravelly clay subsoil. |\n| 78  | 18  | 9  | \" 23... | 640  | N. 1/2 broken by steep hills of Qu'Appelle River; S. 1/2 slopes to River; rich clay loam. |\n| 79  | 18  | 9  | \" 27... | 640  | Gently rolling open prairie; rich clay loam; good clay subsoil. |\n### Wolseley District.—Continued.\n\n| No. | Tr. | R. | Section | Acs. | Remarks |\n|-----|-----|----|---------|------|---------|\n| 80  | 18  | 9  | Whole of 31 | 640  | Gently rolling; deep clay loam, good quality; gravelly subsoil. |\n| 81  | 18  | 9  | \" 35 | 640  | \" black loam and clay of good quality; subsoil good clay. |\n| 82  | 19 A | 9 | \" 3 | 640  | Gently rolling; heavy clay with rich black loam to 12in.; subsoil clay. |\n| 83  | 17  | 10 S. ½ N. E. ¼ | 3 | 480  | Rolling; dark loam 8 to 15in.; clay and gravel subsoil. |\n| 84  | Whole of 17 | 640  | Undulating upland; dark sandy 14 to 18in.; subsoil clay. |\n| 85  | 18  | 10 | \" 35 | 640  | Rolling; heavy clay with rich dark loam; subsoil good clay. |\n| 86  | 19 A | 10 | \" 3 | 640  | \" broken by ravines; heavy clay on north. |\n| 87  | 19 A | 10 | \" 5 | 640  | Rich loam in parts; stony and gravelly along top of hills. |\n\n### TOWNSHIP DIAGRAM.\n\n```\n   31  32  33  34  35  36\n   30  29  28  27  26  25\n   19  20  21  22  23  24\n   18  17  16  15  14  13\n    7   8   9  10  11  12\n    6   5   4   3   2   1\n```\nTOWNSHIP FIELD NOTES.\n\nRANGE 25. WEST OF 1ST P. M.\n\nTownship 11.—Is traversed on the west side of the Assiniboine River, with a mixed growth of oak, elm, ash and poplar along the banks. The surface is generally rolling with a soil of dark sandy loam on a clay and gravel subsoil, a fair growth of grass, and good water throughout the township. Is fairly well adapted for general farming purposes.\n\nRANGE 26.\n\nTownship 11.—Gently rolling prairie with a soil of dark sandy loam, and gravelly clay subsoil, with sand in some localities. Water and hay in numerous ponds, and meadows good. Beautiful township for general farming purposes.\n\nRANGE 27.\n\nTownship 11.—Undulating to hilly, with numerous ponds of good water and small hay meadows. The soil is generally a dark sandy loam with sandy clay subsoil, well adapted for general agricultural purposes.\n\nRANGE 28.\n\nTownship 11.—Undulating prairie, with small ponds and hay meadows. The line of the Canadian Pacific Railway crosses the township in a southeasterly direction. Surface is generally undulating, with a good soil of dark loam, and clay subsoil, sometimes mixed with sand and gravel. Nearly all the township is suited for agriculture.\n\nRANGE 28.\n\nTownship 10.—Surface is well drained by a number of small ravines running in a south-easterly direction. Undulating prairie comparatively dry. Soil is a dark sandy loam with clay and gravel subsoil, in some places sandy clay subsoil. Adapted for general farming.\nTownship 9.—Is traversed by Pipe Stone Creek, with a limited quantity of poplar, &c. along its bank. Small meadows and ponds occupy a large portion of the surface on the north-east side of the creek, while the north-west side is comparatively dry. Soil is a dark sandy loam, with clay and gravel subsoil, in some places sandy clay subsoil. Well adapted for mixed farming.\n\nRANGE 29.\n\nTownship 10.—Is gently rolling prairie, with a good sandy clay loam and gravelly clay subsoil. There are several mill sites in this township on the Pipe stone, which intersects south-west corner. Numerous good hay meadows and ponds. The district, too, is well opened up by one of the oldest trails in the country—that from Brandon to Moose Mountain and other points in the far west. For stock farming it would be difficult to find a more desirable locality than this township.\n\nTownship 12.—The line of the Canadian Pacific Railway crosses in a north-westerly direction, and a creek flowing south-easterly drains a large portion of the township. The surface is gently rolling prairie, with a soil of dark loam, clay and gravel subsoil. An abundance of good water and hay makes it desirable for mixed farming.\n\nTownship 13.—Is rolling prairie, traversed in various directions by a number of ravines, into which ponds may be drained. The soil, as a rule, is a dark loam from six inches to two feet deep, with a clay subsoil, in some places mixed with gravel. There are a number of meadows, which will cut from one to two tons per acre of excellent hay. On the whole this township is better adapted for grazing than general farming purposes.\n\nTownship 14.—Is traversed by Scissors Creek. A number of patches of poplar bush adorn the north half. Surface, as a rule, is open rolling prairie, with soil and subsoil same as preceding. Well adapted for general farming purposes.\n\nTownship 15.—Scissors Creek, a small stream of fairly good water flows through the township. Surface is chiefly rolling, dotted here and there with clumps of poplar bush. Soil is a rich dark loam, with clay subsoil, occasionally mixed with a little gravel. This is a choice township for general agricultural purposes.\n\nRANGE 30.\n\nTownship 13.—Is rolling, with occasional patches of bush in the southern portion of township, suitable for fencing, fuel, &c. Good hay and water. Soil is a dark loam, six inches to two feet deep with a clay subsoil, in some cases slightly mixed with gravel. Well adapted for general farming purposes.\nRANGE 31.\n\nTownship 13.—Is well watered by the Pipe Stone River, which cuts off the south-west corner, and several coulees. The Canadian-Pacific Railway crosses in a north-westerly direction, with Moosomin, one of the most important stations on the line, located in section 33. Here also the Moose and Wood Mountain trail from Fort Ellice is intersected by the Brandon and Qu'Appelle trail, making Moosomin an important distributing point for a large tract of country. The surface is dotted with islands of poplar and clumps of willow. Good water and hay are abundant. Surface is chiefly rolling, with a soil of rich dark loam, and clay subsoil, mixed with a small percentage of limestone gravel. The very perfection of soil for cereals.\n\nRANGE 1, WEST OF 2ND P. M.\n\nTownship 14.—Is rolling prairie, traversed by natural drains, which can be utilized in reducing the area of wet land. The soil is black sandy loam, mixed with gravel, and the subsoil is clay, in which there is a small percentage of gravel. The grass is plentiful and of fair quality, as also is the water; and sections having an excess of ponds and low land can be drained at a small cost. Many of the sections are well timbered, and will afford an ample supply of firewood and fence rails for settlers. The township is well suited for general farming purposes.\n\nRANGE 2.\n\nTownship 14.—Surface is rolling prairie, breaking into hills on the south-west. General slope is towards the Pipe Stone River, which runs through sections 19, 17, 16, 9, 10, 11 and 12. The soil is a dark sandy loam, with clay subsoil, in which there is found a small percentage of gravel. There is a good growth of grass on the uplands, and sufficient hay in the meadows, and around the margins of the marshes to supply every requirement of settlers. Water is to be found in the ponds and marshes, while that of the Pipe Stone River is pure ever running water. Timber, both for firewood and fencing, abounds in the township. The majority of the sections are well adapted for general farming; remainder reported as more suitable for stock raising.\n\nTownship 15.—Is rolling prairie, with occasional patches of poplar suitable for fencing or fuel. In other respects same as preceding.\n\nRANGE 3.\n\nTownship 15.—The surface is rolling, with occasional patches of small poplar and numerous marshes and meadows. There are several natural drains running through the township, which will be available for reclaim-\ning wet lands. The soil is a black sandy loam, with subsoil of clay and gravel. Water is plentiful and good, and the grass on the uplands is of fair growth, while the meadows will give a large yield of hay. This township, until drained, will be best adapted for mixed farming. It lies within easy reach of Percival and Whitewood, both stations on the line of the C. P. R.\n\nTownship 16.—The line of the C. P. R. crosses the township in a north-westerly direction. Percival Station is located on section 19. In other respects the township is the same as the preceding.\n\nRANGE 4.\n\nTownship 15.—Surface is gently rolling prairie. The soil is a clay loam, mixed in some cases with sand and clay with sandy clay subsoil. Water is plentiful and good, especially in Pipe Stone Creek, which flows through the south half of the township. There is a fair growth of prairie grass on the uplands, and the meadows will cut about two-tons of hay to the acre. The township is fairly well suited for general farming purposes, though some sections, by reason of low wet land, are better adapted for grazing purposes.\n\nRANGE 5.\n\nTownship 16.—The line of the C. P. R. crosses the north part of the township, with Broadview, a rapidly-growing town and terminus of a railroad division, located on section 25. Weed Creek, taking its rise in a lake of the same name, winds its tortuous course through a valley about five chains in width and thirty or forty feet below the prairie level, on its way to join its waters with the Qu'Appelle, a little east of Crooked Lake.\n\nWeed Lake, charming and picturesque, is located chiefly in the southeast corner of the township. At certain points the banks are bold and precipitous, with a rugged rock-bound shore; at others, a gentle upward slope from the gravelly beach backward to the sky line, a distance of forty chains, with an occasional oak and poplar grove to lend variety to the scene and enhance the beauty of a most delightful spot. Some of the sections bordering on the east side of the lake are very beautiful, section 1 being reported by the examiner as the choicest.\n\nThe township is chiefly open prairie, with a soil of sandy loam, and well adapted for settlement.\n\nRANGE 6.\n\nTownship 16.—The C. P. R. cuts off the north-east corner of the township. Oakshela Station is located on section 33. The Pipe Stone River\ntouches the south-west corner. The southerly part of the township is broken by the Weed Hills, which are well wooded and furnish an ample supply of fencing, fuel, etc., for settlers. The north half is chiefly open prairie. The soil of the entire township is a sandy clay loam suitable for farming.\n\nRANGE 7.\n\nTownship 17.—Grenfell, a station on the line of the C. P. R., is situated in the south-west corner of the township. The surface is rolling, and water and grass good and plentiful. The soil is a dark sandy loam with gravelly clay subsoil. The township is well adapted for farming purposes.\n\nRANGE 8, WEST OF 2ND P. M.\n\nTownship 16.—Is partially in the Weed Hills. The south half is well wooded with poplar, suitable for fencing, fuel, etc. A lake of good clear water is situated in the southern part of the township. The Qu'Appelle trail crosses the north half, which is almost entirely open rolling prairie, with an excellent soil of sandy clay loam, every section of which may be cultivated. The south half can only be recommended for grazing purposes.\n\nRANGE 9.\n\nTownship 16.—Wolf Hills, so-called, lie almost wholly within the township, in point of fact however, the surface, instead of being hilly, is simply high rolling prairie, beautifully drained by a number of coulees which intersect it. The soil is generally a dark sandy loam with a gravelly clay subsoil. Ninety per cent. is all that can be desired for farming purposes.\n\nTownship 17.—The C. P. R. crosses the south half. Wolf Creek cuts off the north-west corner. In other respects the township is identical with preceding.\n\nTownship 18.—Is traversed by the magnificent Qu'Appelle Valley with its wondrously rich bottom lands of alluvial deposit. Wolf Creek emptying into the river in this township and a number of ravines make the drainage perfect. Timber for domestic purposes may be had in the neighborhood of the streams. The surface is rolling, with a soil of rich clay loam, in some cases containing a small percentage of sand, and clay subsoil. The entire township is good, but sections 27, 31, 33 and 35 are superb.\n\nTownship 19a.—The surface and soil is the same as the preceding township. No timber.\nRANGE 10.\n\nTownship 17.—Wolseley Station, on the south-east corner of the township, on the C. P. R., is the centre of a fine agricultural district. The soil is a rich dark loam, with a gravelly clay subsoil. Wolf Creek traverses the township in a north-easterly direction on the east side, with some poplar bush in the immediate vicinity. Well adapted for general farming purposes.\n\nTownship 18.—The Qu'Appelle River enters this township at section 31, and flowing in a south-easterly direction, leaves it at section 13. A sufficient supply of timber may be had along the banks of the river and other parts of the township to meet the wants of settlers. The surface is rolling, dotted here and there with islands of poplar and ponds of good water. A very desirable township for general farming purposes.\n\nTownship 19a.—Is rolling prairie, with a rich clay loam. The Qu'Appelle Valley lies adjacent to the south boundary of the township. Good wood, good water, good hay. Desirable in every respect for general farming purposes.\nMr. McKilligan has lands in all parts of the Province for sale. Lands in the immediate neighborhood of Winnipeg, and in Southern Manitoba. He has also a large quantity of town lots in Winnipeg and suburbs. From his large experience in dealing in Real Estate, and his influential connection with the largest land owners in the Province, he is able to give intending purchasers the best selection, and the most favorable terms. Mr. McKilligan does not do a public Real Estate business, but confines himself to selling the lands of several of the largest land owners in the Province. Call and see his lists.\n\nJOHN B. MCKILLIGAN,\nNOTARY PUBLIC, COMMISSIONER IN B. R., &C.\nCONVEYANCER, AND REAL ESTATE AGENT.\n387 MAIN STREET, WINNIPEG, MAN.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001511.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 27, "total-input-tokens": 39070, "total-output-tokens": 9046, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 308, 1], [308, 308, 2], [308, 933, 3], [933, 933, 4], [933, 2395, 5], [2395, 3279, 6], [3279, 5410, 7], [5410, 8039, 8], [8039, 11352, 9], [11352, 12427, 10], [12427, 12427, 11], [12427, 12427, 12], [12427, 12427, 13], [12427, 12427, 14], [12427, 12427, 15], [12427, 12427, 16], [12427, 12427, 17], [12427, 12427, 18], [12427, 13894, 19], [13894, 16381, 20], [16381, 18825, 21], [18825, 21170, 22], [21170, 23353, 23], [23353, 24380, 24], [24380, 24380, 25], [24380, 24380, 26], [24380, 25115, 27]], "primary_language": ["en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "None", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, true, true, false, true, false, true, false, true, false, false, false, false, false, false, false, false, false, false]}}]