[{"id": "020d03050cca35148111e7a8fe7b0bd8b8fcb609", "text": "REPORT\n\n—ON—\n\nManitoba Products\n\n—EXHIBITED AT—\n\nSt. John, N. B., and Boston, U. S.,\n\n1883.\n\nBy W. CLARK.\n\nOTTAWA:\nDepartment of Agriculture.\n1884.\nREPORT\n\n—ON—\n\nMANITOBA PRODUCTS\n\n—EXHIBITED AT—\n\nSt. John, N. B., and Boston, U. S.,\n\n1883.\n\nBy W. CLARK.\n\nOTTAWA:\nDEPARTMENT OF AGRICULTURE.\n1884.\nREPORT ON MANITOBA PRODUCTS AT ST. JOHN, N. B., AND BOSTON, U. S.,\nEXHIBITIONS.\n\nWINNIPEG, 31ST DECEMBER, 1883.\n\nSir,—According to instructions contained in your telegram, dated Ottawa, 1st September, 1883, I waited upon Mr. Acton Burrows, Deputy Minister of Agriculture, and Secretary and Treasurer of the Board of Agriculture for this Province, whom I found in Council with the Honorable J. Norquay, Premier of this Province; Honorable A. M. Sutherland (then Attorney-General, now Provincial Secretary); C. J. Brydges, Esquire, President of the Board of Agriculture, giving audience to a committee of citizens, headed by His Worship the Mayor, who were consulting with the Local Government, as to what could be done to represent Manitoba, through the medium of her resources, at the coming Dominion Exhibition, to be held at St. John, N.B., on the Centennial anniversary of the foundation of that city.\n\nFor particulars of this meeting, I would respectfully refer you to a report of Mr. Wm. Clarke, Secretary of the Manitoba Exhibit Committee.\n\nAs neither the President nor Secretary of the Board of Agriculture could render any active aid in getting up the Dominion exhibit, I, with their consent, was added to a Committee of citizens, who had undertaken to aid in the work of collection, of which His Worship the Mayor was Chairman, and Mr. Robert Keith, seed merchant, of this city, Manager, who selected for his assistant, with the consent of the Committee, Mr. Wm. Clarke.\n\nIn securing the services of these two gentlemen, I consider the committee, and the country at large, were extremely fortunate, as the former (Mr. Keith), has had a great deal of experience in such matters, coupled with a natural liking for the work, a keen knowledge of the art of decoration, and an earnest desire to assist his adopted Province.\n\nIn the latter (Mr. Clarke), we found a gentleman gifted with wonderful descriptive powers; one who had travelled over all the grain producing portions of the old world, who spoke, with fluency, many of the languages of the continent, and also was withal an indefatigable worker.\n\nThe time at our disposal was very limited, hence, the samples we forwarded, although very good, and far ahead of anything of the kind at either the St. John or Boston Exhibitions, were by no means the best that Manitoba could produce.\n\nAs Mr. Clarke has given a thorough report of proceedings, it is needless for me to say more, but as you urgently requested that I, as the representative of your Department, should make extra exertions, in order that the exhibit should be a success, I quote the following extract from the Winnipeg Free Press, dated September 24th, 1883, by which you will be able to judge whether your instructions were carried out or not:\n\n\"Capt. W. C. B. Grahame, Immigrant Agent, was indefatigable in his exertions, not only then, but from the inception of the enterprise. Having a wide circle of acquaintances, and knowing just whose co-operation to secure, he was able to add much to the success of the collection. His courtesy in placing a large room in the...\"\nupper story of the Immigration Building at the disposal of the Committee, very greatly facilitated the receiving and loading of the goods. This was of no small importance in the saving of time, which was of great account, in view of the few days within which the whole work had to be done.\n\nUnder no other circumstances is it likely that the Committee would have been able to secure a suitable room, situated right on the railway track, so that the articles could be placed on the car with so little difficulty.\"\n\nFor a proof as to the success which attended our efforts as a body, I attach extracts from prominent American journals.\n\nAccording to instructions, I transferred the $1,200 forwarded to me from the Department, for exhibition purposes, to Mr. Acton Burrows, Deputy Minister of Agriculture, and Secretary and Treasurer of the Board of Agriculture for this Province.\n\nI have the honor to be,\n\nSir,\n\nYour obedient servant,\n\nW. C. B. GRAHAME,\nDominion Immigration Agent.\n\nThe Honorable\nThe Minister of Agriculture,\nOttawa.\n\nReport of Mr. Clarke.\n\nSir,—I have the honor to submit to you, through Mr. Grahame, your Agent at Winnipeg, a report of the Manitoba portion of the Dominion Exhibition, held at St. John, New Brunswick.\n\nYour Government placed at the disposal of the Board of Agriculture, the sum of $1,200 for the purpose of forwarding a collection of Manitoba products to the Dominion and Centennial Exhibition, held in October last in St. John.\n\nAfter due consideration, the Provincial Government, in conjunction with the Board of Agriculture, declined to undertake the work, for the reason that the time available was insufficient, that the grant was inadequate for the purpose, and that on account of the necessity of devoting all their energies to the Provincial Show, soon to take place at Portage la Prairie, they could give no attention to the matter.\n\nThese facts, having become known to the public, a deputation, introduced by Mr. Mayor McMicken, waited on the Provincial Government, and was received by the Premier, the Deputy Minister of Agriculture, Mr. Burrows, and Mr. Brydges, President of the Board of Agriculture.\n\nThe deputation explained that, in the opinion of many citizens, the opportunity offered for advertising the Province should not be lost, and pointed out that if the sum granted were placed in the hands of a responsible Committee, there would be, with the aid of outside subscriptions, no fear of carrying the work on to a successful issue.\n\nThe Honorable Mr. Norquay expressed full sympathy with the object in hand, but while anxious to see the Province represented at the Dominion Show, regretted that he could afford no pecuniary help, as the agricultural vote for the year had already been disbursed.\n\nMr. Burrows and Mr. Brydges explained at length the reasons for the action they had taken, promised to the Committee all the help they could possibly render, and having been assured that the Dominion Government grant would be forthcoming, the deputation, after thanking the Premier for the courteous hearing accorded them, withdrew. A meeting of citizens was immediately convened, when a working Committee was appointed, the members of which were: R. R. Keith, seed merchant; W. C. B. Grahame, Dominion Immigration Agent; W. H. Browne, seed merchant; N. Bawlf, grain merchant, and William Clarke, grain merchant, with Mayor McMicken as Chairman of Committee. Mr. R. R. Keith, was appointed to take charge\nof the exhibit, Wm. Clarke, Secretary, and N. Bawif, Treasurer.\n\nThe City Council voted the sum of $250 towards the expenses of the exhibit, and several land companies, as well as private individuals having promised assistance, work was begun without delay. Letters requesting co-operation were sent to the Mayors of Portage la Prairie, Brandon, Gladstone, Selkirk, Nelson, St. Boniface, Morris and Emerson.\n\nA circular was also addressed to all the parties who contributed samples to the exhibit of the previous year, and in order that the samples collected should be as representative as possibly of the various districts, special agents were appointed to secure, by personal canvass, a contribution from every important settlement.\n\nThe agents appointed, and the districts apportioned to them, are as follow:\n\nDistrict north west of Brandon, including Birtle, Shell River and Oak River—W. H. Disbrowe, Winnipeg.\n\nBrandon and surrounding District—Mr. Bennett, Dominion Government Immigration Agent, Brandon.\n\nCarberry District, including Big Plain—Henry Crowe, Carberry.\n\nDistrict of Portage la Prairie—James Mitchell, Portage la Prairie.\n\nNelson District—Thomas Duncan, Nelson.\n\nCarman and Boyne Districts—L. K. Cameron, Winnipeg.\n\nPembina Mountain District—D. Hom, Winnipeg.\n\nEmerson and Mennonite Settlements—D. G. McEdward, West Lynne.\n\nStonewall District—John Lant, Winnipeg.\n\nNiverville District—Thos. Church, Niverville.\n\nDominion City District—Duncan McKercher, Dominion City.\n\nCity District and Market Gardens—H. Glenn, City.\n\nA large room in the Immigration Buildings was placed at the disposal of the Committee by Mr. Grahame.\n\nFrom its close proximity to the railway track, this proved of the greatest service in receiving, classifying and loading the products.\n\nMr. McTavish, Land Commissioner of the Canadian Pacific Railway, and his deputy, Mr. Hamilton, went heartily into the work, not only supplying a considerable quantity of cereals, and a collection of grasses of the most complete kind, but making arrangements whereby samples, from all stations on their line, were sent in by express trains free of expense.\n\nGeneral Superintendent Egan provided a new baggage car, suitable for attaching to passengers trains, for the purpose of carrying the exhibit to St. John.\n\nUnder his directions this car was specially and most artistically painted, having on the sides the words, \"Manitoba and Canadian North-West products for the Dominion Exposition at St. John, New Brunswick.\" The car attracted much attention and proved to be an advertising medium of no mean order.\n\nAssistant Traffic Manager Harder arranged for free return transit of car and parties in charge over the Minneapolis and Manitoba, the Chicago and North-Western, and Chicago and Grand Trunk Railways.\n\nMr. Grahame, Immigration Agent, arranged with your Department at Ottawa, for transport over the Grand Trunk and Intercolonial roads to St. John, N. B.\n\nThe actual work of collecting did not occupy more than two weeks, and though of pronounced excellence, the samples were nothing more than a fair example of the best that each district could produce.\n\nThe collection was inspected in the Immigration Buildings, on Saturday the 22nd September, by members of the Government and other prominent citizens, and was loaded into the exhibit car the same evening.\n\nThe lists of exhibits are as follows:\n\nDonald Fraser, Emerson—Wheat, red Fyfe; turnips, Aberdeen purple; potatoes, beauty of Hebron and early rose, Scotch kale; oats, in straw.\n\nS. J. Jackson, Stonewall—Oats, black; barley; wheat, white Fyfe; peas, beets, Egyptian; parsnips, hollow crowned and student; celery, Carter's crimson and Boston market; carrots, Altringham red; oats, white; wheat, red Fyfe and fall.\n\nJohn Reynolds, Boulah—Onions, red early.\n\nNorris Fines, Balmoral—Wheat, white Fyfe, red Fyfe, fall and club; oats, white.\nJohn Hall, Blumenort—Wheat, red Fyfe.\nIsaac Muller, Blumenort—Barley.\nWm. Bradley, Lorne—Turnips, Graystone and Swede.\nWm. Brown, Blumenort—Wheat, red Fyfe; turnips, Aberdeen; beets, potatoes, early rose.\n\nE. Synder, Portage la Prairie—Oats, black.\nJames Keating—Turnips, red, top white.\nEdward Davis, West Lynne—Wheat, red Fyfe.\nCharles O. White, St. James—Carrots, long red Carenton; beets, Egyptian; onions; potatoes, early rose and white elephant.\nColt. McKay, High Bluff—Wheat, white Fyfe.\nThomas Swalos, Portage la Prairie—Wheat, red Fyfe.\nJohn O'Connell, High Bluff—Beets, potatoes.\nBirtle Farming Company, Beulah—Turnips, Aberdeen; potatoes; wheat, bearded, in straw.\n\nW. Cruthers, Portage la Prairie—Oats, white.\nR. McCusig do do\nJoseph Batcher, Birtle—Crown peas; cabbage, red; sage, mangold, yellow gold; carrots, long white; potatoes, beauty of Hebron and St. Patrick.\nH. Hodgson, Springfield—Cabbage, marble head and Winningsteadt; potatoes, white rock.\nR. Lang, Long Lake—Mangold; squaw corn; turnips, Swede, purple and green top.\n\nE. H. D. Hall, Moose Jaw—Turnips, white.\nWm. Logan, Carberry do\nHon. C. P. Brown, Winnipeg—Sunflower.\nW. B. Hall, Headingley—Turnips, purple top; radishes, summer; mangold, gold and long red; carrots, short horn, intermediate and long.\nJohn Doran, Little Souris—Turnips, white and Swede.\nH. M. Power, Elkhorn—Wheat, read Fyfe.\nGeo. F. Bennett, Brandon—Wheat, red Fyfe; barley; potatoes; and oats, in straw.\n\"Bell Farm,\" Indian Head—Wheat, red Fyfe.\nV. Bowerman, Brandon do do\nW. O. Fowler, Routhwaite—Barley; wheat, red Fyfe.\nW. F. Lowden, Souris Plum Creek—Wheat, red Fyfe.\nAlex. Kelly and Sutherland, Brandon—Wheat, red Fyfe.\nW. H. Lowden, Souris Plum Creek—Wheat, red Fyfe.\nJames Gray, Two Creeks—Turnips.\nR. R. Ross, Rosshurn—Turnips; carrots; beets.\nW. A. Doyle, Beulah—Potatoes, beauty of Hebron and mammoth pearl; carrots, French short horn; beet, blood turnip.\n\nL. J. Crowder, Portage la Prairie—Potatoes.\nJames H. Proctor, Virden—Potatoes, early rose; barley, 6-rowed; wheat, red Prussian, red Fyfe, and red Siberian; peas, mixed; oats, Tartarian.\nRobert Black, Springfield—Potatoes.\nR. Hatch, Portage la Prairie—Potatoes, early rose.\nR. Dixon, Broadview—Potatoes, early rose.\nA. D. Brice do do do\nJos. Batchelor, West Lynne—Potatoes, beauty of Hebron and snowflake.\nW. G. Fonseca, Winnipeg—Kohl-rabbi, early purple and green; beets; parsley, mosscurled; squash, scollop; tomatoes; apples, Siberian and transcendent crab; beans, German, wax and butter; corn, sweet; rhubarb; carrots, intermediate, Lorne and long Surrey; turnip, hardy, sweet and early red top.\nW. D. Poynter, Beulah—Onions, new queen, red Weathersfield and yellow Danvers; beets, long blood; chicory; parsnips.\nD. G. McBain, Winnipeg—Mangold, long red; turnips, Swede.\nMcIntosh and Bell, Kildonan—Parsnips, early student; carrots, intermediate and short horn; potatoes, beauty of Hebron.\nCharles Cuthbert, High Bluff—Wheat, red and white Fyfe; timothy seed.\nPeter Campbell, Campbellville—Potatoes, early rose and snowflake; wheat, red Fyfe.\n\nA. G. P. Smellie, Glen Durham—Wood, white poplar.\n\nGeorge Church, Niverville—Wheat, red Fyfe; oats, white; barley, in straw.\n\nThomas Scott, St. Pie—Cauliflower; cabbage, pickle and Winningestead; turnip, Swede; carrots, early horn; onions, red.\n\nF. Salter, Winnipeg—Celery, dwarf; cabbage; onions, red Weathersfield; carrots, intermediate; beets, long blood.\n\nJ. S. Ireland, West Lynne—Cabbage, ox heart; turnip, nimble dyck, greystone and yellow jelly; chicory; beets, blood and intermediate; mangold, long red, yellow globe and red globe.\n\nJulius Hallett, Winnipeg—Cabbage, drumhead.\n\nJames Jefferson, Balmoral—Turnips, Swede and white; wheat, red Fyfe.\n\nW. H. Tomalin, St. James—Cabbage, drumhead and Henderson's summer; celery.\n\nNathaniel Lamb, Broadview—Turnips.\n\nWilliam Brigham, Winnipeg—Parsnip; turnip; celery; carrot, short horn.\n\nJoseph Scott, Stonewall—Turnips, Swede and white; wheat, red Fyfe and club, in straw; oats, in straw.\n\nB. McIvor, Deer Lodge—Beets; celery; corn; parsnips; tomatoes.\n\nDavid Schellenber, Gretna—Flax, Russian; oats, golden Russian; wheat, red Russian.\n\nWilliam Rawson, Beulah—Oats, in straw.\n\nMrs. Robertson, St. Francis Xavier—Corn, hardy; garlic, custard pumpkin; citrons; beets, early blood; turnips, Swede.\n\nWalter James, Gross Isle—Vegetable marrow; oats, black; flax.\n\nMrs. Macbeth, St. Francis Xavier—Radish.\n\nRobert Massey, St. Andrews—Wheat, red Fyfe, in straw; oats, in straw.\n\nEli Stodgell, Argyle—Citrons.\n\nCharles B. Eddie, Millbrook—Citrons.\n\nSamuel Kennedy, Carman—Cabbage, red; cauliflower.\n\nJohn McKercher, Dominion City—Cabbage; cauliflower; wheat, in straw.\n\nW. J. Brown, Pomroy—Cabbage, sugar loaf; cauliflower.\n\nH. Crowe, Carberry—Cabbage; turnips, whites tone.\n\nJohn Ford, Carberry—Wheat, red Fyfe.\n\nW. F. Brown, Pomeroy—Cauliflower; potatoes, early rose and white elephant.\n\nLouis Archibald, Bird's Hill—Mangolds; turnips; beets, blood.\n\nW. Wishart, Portage la Prairie—Wheat, red Fyfe.\n\nRobert Gardner, Stonewall—Beets, blood.\n\nBenjamin Lagimodiere, St. Boniface—Beets, blood.\n\nJ. M. Muir, Stonewall—Turnips, strap leaf.\n\nJames Barbour, Balmoral—Turnips, Swede.\n\nHenry York, Miami—Beets, Egyptian.\n\nGeorge Lawson, Linkrathen—Turnips, yellow; potatoes, snowflake.\n\nDavid Williamson, St. James—Potatoes, champion.\n\nC. Wright, Beaconfield—Mangold, mammoth; carrots, white.\n\nSamuel Parsons, Springfield—Sunflower; maple; gooseberry; currant.\n\nAlex. Waddell, Dominion City—Rhubarb; lettuce; southernwood.\n\nMajor-General Pigott, Two Creeks—Beets; oats, white and black.\n\nJohn Wittick, Niverville—Oats, white and black; Fyfe wheat.\n\nA. W. Russell, Dominion City—Rhubarb; onions.\n\nEothen Hartle, Stonewall—Oats.\n\nWalter Oldfield, Springfield—Onions; lettuce; cabbage, Trotter's, Brunswick and Winningestead; turnips, strap leaf; beets, flat Egyptian; potatoes, beauty of Hebron.\n\nJohn King, Dominion City—Onions; mangolds; potatoes, white elephant.\n\nAndrew Fournier, Carman—Onions; potatoes; barley.\n\nJohn Smith, St. James—Onions, Weathersfield and large yellow.\n\nJames Campbell, Campbellville—Onions, seed and top; hope, wild.\nR. McKnight, Pomeroy—Onions, seed; beets; rhubarb; parsnips; potatoes, early rose.\n\nR. H. Cole, Lintrathen—Onions, potato; turnips, Greystone and Swede; peas; oats, in straw.\n\nJoseph Baskerville, Dominion City—Celery; cabbage; mangolds, yellow globe and red; turnips, Swede; potatoes, snow-flake, beauty of Hebron and early rose.\n\nThomas Church, Niverville—Tares, wild; peas, wild; hops, wild; potatoes; prairie grasses.\n\nJohn Middleton, Brandon—Carrots, onions.\n\nAlexander Hickey, Stonewall—Barley.\n\nCaptain Colquhoun, Stonewall—Bale of hay.\n\nCanada North-West Land Company, Winnipeg—General collection of cereals, roots and grasses.\n\nSpecial collection of soils, from the Birtle, Brandon, Morris, Winnipeg and Selkirk District.\n\nThe Lowe Farm, Morris—Soil and cereals.\n\nGeorge Reid, St. Boniface Woollen Mills—Samples of wools, yarns and blankets, buffalo yarn, buffalo wool socks.\n\nD. Parker, Winnipeg—Buffalo head.\n\nBarber Brothers, Winnipeg—Plans and sketches of City (Winnipeg) Buildings.\n\nR. D. Richardson, Winnipeg—Blank books and book-binding.\n\nHistorical and Scientific Society, Winnipeg—Collection of 340 specimens.\n\nR. D. Paterson, Winnipeg—Samples of native woods.\n\nWoods, Owen & Co., Winnipeg—Collection of biscuits.\n\nSaskatchewan Coal Company, Winnipeg—Samples of coal from Medicine Hat and Devil's Creek.\n\nCascade Coal Mining Company, Calgary—Sample of coal.\n\nOur departure on the evening of the 23rd was witnessed by a large and sympathetic gathering, who had assembled to wish our mission success.\n\nOur party included Mr. J. Hayes Panton, representing in particular the Canadian Pacific Railway, and Mr. S. A. Bedford, of the Canada North-West Land Co.\n\nThrough the courtesy of United States Consul Taylor, arrangements were made which enabled us to pass the Customs at St. Vincent without delay. This gentleman also arranged for our return at Port Huron, while Mr. Mingaye, Collector of Customs at Winnipeg, kindly undertook the arrangements necessary for our passage at Sarnia and our return to Manitoba.\n\nThe Custom House officials, everywhere, were exceedingly kind and helpful, which added not a little to the pleasure of the journey. At St. Paul, the agent of Manitoba road had the car immediately transferred to the Chicago and North-Western, which railway, in the most expeditious way, had the car transferred to the Chicago and Grand Trunk.\n\nFrom Chicago we were pushed on to Toronto and Montreal. The remainder of the journey to Point Lévis and over the Intercolonial was accomplished in the same pleasant and expeditious manner.\n\nWe arrived at St. John, without accident or mishap of any kind, on the morning of the 29th inst., the whole journey having been accomplished in less than six days.\n\nNothing could exceed the kindness and attention of the officials of the various railways over which we passed. To these gentlemen we are much indebted for the efforts they made to get the car forward in time for the Exhibition.\n\nWe are fortunate in securing space for the Manitoba exhibit in one of the best locations on the show ground. Here Mr. Keith's long experience in such work stood us in good stead, and we were enabled, under his directions, to set up the exhibit in such a manner as to win the admiration of all parties. The Exhibition lasted, at St. John, from the 1st to the 10th October, during which time visitors, estimated at fully 75,000, inspected the Manitoba Hall.\n\nThe greatest interest was taken in our products by every visitor, and it is needless to say that our party found abundant employment in supplying information and in answering questions relative to the great North-West. I am satisfied that much was accomplished, during our stay there, to bring the merits of the Province under\nthe special notice of the inhabitants of the Maritime Provinces. We experienced the greatest kindness and consideration at the hands of the Commissioners and all officials connected with the Exhibition.\n\nMr. Inches, Secretary, and Mr. John Magee, Commissioner, in charge of the particular department in which the Manitoba exhibit was located, deserve special mention for their unremitting attention. It is worthy of notice that R. D. Richardson, of Winnipeg, was awarded the silver medal for his specimen of blank books.\n\nThis was the only part of our exhibit entered for competition, and proves that in this department Winnipeg is ahead of any city in the Dominion.\n\nBefore leaving St. John, I received information from the office of the Canadian Pacific Railway, at Montreal, that the exhibit would be sent on to Boston, and also received instructions from the Department of Agriculture, at Ottawa, to take my orders from the Secretary of the Canadian Pacific Railway, on my arrival in Montreal.\n\nOn our arrival there, we found that arrangements had been completed, and we proceeded to Boston without delay. Our products were displayed in the hall of the New England Institute, in that city, under the auspices of the Canadian Pacific Railway. We were located in close proximity to the elaborate displays of the various America Pacific Roads, including those of the Union, Texas, Missouri and Northern. These had been got up at great expense, and it is noteworthy in this connection that the exhibit of North Carolina, showing the varied resources of the State, was carried through at a cost of upwards of $30,000 and required thirty-one cars for its shipment.\n\nMr. Keith succeeded in setting up our exhibit so attractively that our space, over which depended the Union Jack, was crowded with visitors from first to last.\n\nIn cereals, grasses and roots, our collection was incomparably the best and most complete, and frankly admitted to be so by both press and public.\n\nOur stay in Boston extended to three weeks, during which time an admirable opportunity was offered for making known, in the New England States, the advantages of our Canadian North-West. During this time excursion trains were run daily into the city, for the purpose of enabling the inhabitants of the outlying towns and neighboring States to see the fair.\n\nIt was estimated that about 10,000 people visited the Exhibition daily. Nothing could exceed the interest with which our products were examined, or the eagerness for information displayed by the thousands who visited us.\n\nThe Railway Company supplied a large number of maps, pamphlets, folders, &c. During our stay the number distributed would not be less than 75,000.\n\nI am of opinion that the Exhibition at Boston will be of even more benefit to the North-West than that of St. John.\n\nOn our return to Montreal, the products were, by orders of your Department at Ottawa, handed to the Canadian Pacific Railway, to be forwarded, along with their special collection, to Liverpool.\n\nThe portion belonging to the Canada North-West Land Company was discharged at Toronto. It has since been on exhibition, under the charge of Mr. Bedford, in that city, and elsewhere in Ontario.\n\nA Committee of grain experts examined the samples in Toronto. Their report is as follows:\n\n\"We, the undersigned examiners of grain, appointed by the Board of Trade of Toronto, have examined the exhibit of grain of the North-West Land Company, and beg to report as follows: The fall wheat is of plump, full size, being well grown and matured, weighing 64 lbs. to the bushel. The spring wheats are principally of the Fyfe variety, one sample, especially, being remarkably pure and fine, weighing 68½ lbs. to the bushel.\n\n\"We should estimate its value at from 10 cents to 15 cents per bushel above the value of our No. 1, notwithstanding the fact, that the crop of spring wheat in Ontario, is the best that has been raised for many years. Both the fall and spring wheats are valuable to millers, for mixing with our crop, owing to their strength for manufacturing into flour, an element that is lacking in the wheats grown in Ontario.\n\n\"Barley, though not as fine as some samples raised in Ontario, is remarkably good, and far ahead of any that we have seen raised in the North-Western States. Peas cannot be better.\"\n\"Oats are very good, but have been equally as fine raised in this Province.\n\"Timothy seed is very choice. In fact, we are assured it would have been very difficult, if possible, to have procured as good a selection of grain from the whole produce of Ontario this year.\n\n\"George A. Chapman,\n\"J. D. Laidlaw,\n\"H. W. Baird,\n\"W. D. Mathews, Jun.,\n\"L. Coffee,\nJ. Harris,\nInspector.\n\nEdgar A. Wills,\nSecretary.\n\nThe thanks of the Committee are specially due to the railway companies over whose lines we passed, to the gentlemen who undertook the work of collecting, and to the farmers who, at their busiest season, at great inconvenience to themselves, supplied the samples; to the Historical and Scientific Society of Winnipeg, the Best Brothers, photographers, and to Barber Brothers, architects, each of whose collections lent much of interest and attractiveness to the exhibit.\n\nIn particular, I desire to thank Mr. W. C. B. Grahame, Dominion Immigration Agent, for the many services he rendered during the difficulties encountered at the outset. I am safe in stating, that but for this gentleman's exertion, the work undertaken could not have been carried through.\n\nOur thanks are due to Mr. J. Hayes Panton, who arranged and catalogued the collection of the Historical Society, and whose scientific knowledge tended so much to make this Department one of the most attractive in the exhibit.\n\nWe are also much indebted to Mr. Bedford for his unwearied efforts in explaining the resources of our North-West to thousands of inquirers.\n\nI desire, before closing this Report, to express the belief that we cannot advertise the advantages of our Province better than by showing to the public what the land will produce. It becomes, however, necessary that timely and efficient arrangements should be made in order to secure the most complete collection available. A special effort may be put forth, as in the present instance, to get together a satisfactory exhibit, but this can only be accomplished at much expense.\n\nA retrospect of all exhibits sent out by Manitoba, points to the conclusion that it is impossible to do justice to the Province by getting together a collection in time for the annual Dominion Exhibition. At that date, root crops are far from being matured, and, as a rule, harvesting has barely begun when the work of collecting must commence. It seems to me, therefore, that we can only send out an exhibit that will do full credit to our Province by delaying the collection to a date when all products shall have fully ripened.\n\nWhile such an arrangement would be unsuitable for the purposes of the Dominion Exhibition, it might well be considered, in view of sending an exhibit to the Mother Country, where our resources are as yet but imperfectly understood, and where we have by far the largest field for securing emigrants.\n\nI venture, in closing, to express the belief, that should the Dominion and Local Governments combine with our railway and land corporations, in such an enterprise, an exhibit of Manitoba products could be secured, which, if efficiently managed, would, after a tour throughout the Mother Country, give an impetus to emigration unprecedented in our history.\n\nI have the honour to be, Sir,\n\nYour obedient servant,\n\nWilliam C. Clarke,\nSecretary of Manitoba Exhibit Committee.\nPress Comments on Manitoba Exhibits.\n\nThe Boston newspapers are unanimous in expressing surprise and admiration at the extent, completeness and value of the products of Manitoba, and the Canadian North-West, which the Canadian Pacific Railway are showing at the great American Exposition in Boston. Says the Boston Advertiser, of the 20th October, under the head of \"The Agricultural Marvels of Manitoba\":\n\n\"After experiencing some delay in going through the formalities of getting its goods through the Custom Office, the Canadian Pacific has now got placed in the Institute Fair its exhibit, illustrating the natural wealth of the country through which the road passes—the region in which is included the Province of Manitoba, now fast becoming famous for its wonderful wheat fields, and destined to be hardly less known for its other agricultural as well as mineral products. The Company has made no effort to set up a sensational display of exceptional specimens, but has simply made up a collection of ordinary products, gathered almost at random from the prairies and mines of the region, for the purpose of correcting, by an ocular demonstration, the popular idea that the Canadian climate is too severe to make possible any very extensive or varied agricultural production. The merest glance at the exhibit is sufficient to dispel that allusion most effectively. The display of cereals and grasses is but a comparatively small feature of the collection, but this feature itself is most remarkable and suggestive. From forty to fifty varieties of native grasses alone are shown, and these, though all of them wild grasses, are of the most luxuriant description, and a bale of perfectly \"untamed,\" Manitoba hay, here shown, is as sweet, clean and nutritious as the best hay to be found in the market. It is hardly necessary to say that the specimens of the great wheat product of Manitoba, the \"No. 1 hard,\" are of the first quality. The average yield of this wheat, it is claimed, is from twenty-five to thirty bushels an acre. The specimens of oats, barley and flax are equally notable. But when we come to vegetables we find a collection which must dilate with pleased surprise even the most untutored eyes. Every specimen, almost, is a monster of its kind, but unlike the vegetable monsters so often seen at our agricultural shows, these are not forced growths, wonderful to behold but of little value for food purposes, but perfectly normal products of ordinary farm cultivation, and, therefore, sound to the core and fine in quality as the best. Here is a squash weighing 292 pounds, raised near Winnipeg, and the other vegetables correspond—turnips, each large enough for a meal for a large family, carrots, onions, potatoes that make one's mouth fairly water and all quite exceptional in development. A vegetable novelty shown here is what the Canadians call a \"half-breed,\" being, indeed, a cross between a cabbage and a turnip, the German name of which is Kohl Rabi.\n\n\"The display further includes a collection, not large but quite significant, of minerals. There are specimens of gold ores, some of which assay about $300 to the ton, and fine specimens of iron ores; also specimens of coal, a cross between lignite and bituminous coal, from the Medicine Hat mines, on the banks of the Saskatchewan River. It is stated that beneath the Manitoba prairies is a practically inexhaustible supply of this coal, but thus far the mining of it has been confined to the banks of rivers, where it can be got out with very little expense, comparatively speaking. Contrary to a very general impression, too, Manitoba is a perfect mine of fossils, of extreme interests to scientific men. A hint of this wealth in this direction is given by a collection brought here by Mr. J. Hayes Panton, M. A., and all gathered by him during the past summer. Though necessarily small, the collection is one richly to reward the student's attention.\n\n\"Taken in connection with this exhibit, the rapid progress which the Canadian Pacific Company is making toward the completion of its transcontinental line, is an unmistakeable prophecy of the coming greatness of this region, and the proud agricultural empire which Manitoba is so fast becoming. It has already completed its line from Montreal to Toronto, and in the spring will have a spur of its main track running down to Algoma, on Lake Superior, whence the Company's line of steamers will be ready to extend its transportation facilities to Fort William, and from that point, by its already completed track, to Calgary, at the base of the Rocky...\"\nMountains. The Company expects to complete its road to the Pacific terminus, at Port Moody, within two years time, and then, having also completed the new unbuilt section north of Lake Superior, it will have a continuous all-rail line from Montreal to the Pacific. Before that time it will also have its own line to Chicago, via Toronto.\"\n\nThe Boston Journal of 20th October, has the following on the subject:\n\n\"Aside from the superb exhibits of the resources of the States of North Carolina and Tennessee, at the American Exposition in this city, those of the Pacific railroads (the Missouri, Union and Northern) have undoubtedly attracted the most careful attention. Yesterday the exhibit of another Pacific railroad, the Canadian, was opened, and through the assistance of Assistant General Passenger Agent Geo. W. Smith, of that road, an opportunity was given members of the press to examine the products of the new and distant region which the Canadian Pacific is opening up to settlers. The exhibit of the road has been delayed, from the fact that it has also been upon exhibition in the British Provinces. To those who have a preconceived idea that the short seasons of the Canadian North-West do not allow of the production of so large and rich a harvest as regions further south in our own country, the present exhibition of grains, vegetables, grapes, &c., raised in the far distant regions of Manitoba, will be a surprise. The climate appears to be of such duration the past season, notwithstanding reports of early frosts, that a magnificent squash, weighing 292 pounds, had opportunity to ripen, and the huge potatoes, onions, beets, turnips, &c., shown, can compete successfully with the monsters which the Pacific coast, in the vicinity of San Francisco, is noted for. The collection is also rich in grasses and grains, including samples of the famous No. 1 hard wheat. Of this wheat it is claimed that large crops can be raised, although often not a drop of rain falls from the time the seed is planted until it is reaped in the early fall. The seed is sown as soon as three or four inches of frost is out of the ground, the theory being advanced that the long time it takes to thaw out the balance of the frost—several feet in depth—affords sufficient moisture to the roots of the plant to bring it to maturity. Excepting the Mexican Central, the Canadian Pacific is the only scheme of great importance upon the continent that is now being pushed along.\n\n\"At the end of this year the road will have been completed from Montreal, westward, 470 miles; from Winnipeg, eastward, 530 miles; from Winnipeg, westward, to the summit of the Rocky Mountains, 963 miles; and from Victoria, British Columbia, eastward, 140 miles, making a total of 2,103 miles. The distance from Montreal to Victoria is 2,870 miles, and it is expected that the entire line will be completed and opened to traffic within two years. A branch line, from a point on the main line of the Eastern Division, to the northern extremity of Lake Huron, is expected to be completed and ready for business by the time lake navigation opens next spring, so that the Canadian Pacific Railway Company, by means of steamers plying between the branch terminus on Lake Huron and Port Arthur, near the head of Lake Superior, will have the advantage of a through rail and water route from Montreal to the Rocky Mountains. Upon the division from Port Arthur, north of Lake Superior, there is a force of 6,000 men at work, and as an attempt will be made to push construction all through the coming winter, an opportunity will be offered to test the question of whether a line can be operated in that region through the cold terms. Portland, at present, aspires to the honour of being the winter port of the Canadian Pacific Railway upon the Atlantic. We are confident in the belief, however, that Boston will participate, in some degree, at least, in future developments of Canada's great Pacific Railway.\"\n\nThe Boston Herald, of the same date, deals with the subject in the following terms:\n\n\"A large and handsome addition was made to the attractions of the American Exposition yesterday, in the shape of samples the agricultural and mineral wealth of Manitoba and the Canadian North-West. The exhibition is made by the Canadian Pacific Railway, largely through the efforts of Mr. George W. Hibbard, the Assistant, General Passenger Agent. The exhibit was late in arriving, owing to the fact that most of it has been at the Dominion Centennial Exhibition at St. John, N.B., but although late, it is one of the most interesting exhibits in the entire fair, and its ex-\ntent and variety will give visitors many new ideas of the region from which it comes. The character of the soil of Manitoba is shown in 4 series of boxes filled with rich, fine, black argillaceous mold or loam and so arranged as to exhibit the soil four feet deep. The winters of Manitoba are very cold, and this soil freezes 3 or 4 feet deep. Just as soon as the spring warmth thaws out the ground 5 or 6 inches, seed is sown, and as the season advances the sun penetrates deeper and deeper and the moisture from the frozen ground deeper down rises and helps germinate the seed, so that no rain is needed till along in June. This rich soil produces wild grasses in abundance, and of the 100 varieties existing there are 42 kinds shown here. All of the varieties are excellent for cattle, though some are best when young and tender, while others are eagerly eaten when older. While cultivated grasses would undoubtedly grow in Manitoba, the abundance and excellence of the wild grass renders it needless to cultivate any. The display of vegetables is especially fine, and 30-pound turnips, 11-pound carrots, 1½-pound onions, 24-pound beets, 50-pound cabbages, and squashes of 5 feet diameter, and half a dozen varieties of potatoes, large and handsome looking, attest the capabilities of the soil. There are numerous large bags of wheat, barley and oats, showing conclusively that Manitoba can raise cereals that fairly rival those of Minnesota. In regard to the mineral wealth of the region, the Historical and Scientific Society of Winnipeg exhibits 340 specimens from its collection of 2,000 specimens. The exhibit, which will well repay careful examination, is arranged in seven divisions, comprising Silurian, Cretaceous, Laramie and Post Tertiary deposits and mineralogical specimens. The display of native woods is unfortunately deficient, through the failure of the person in charge of that feature to attend to his work properly. But there is enough in the general exhibit, as it stands, to interest and instruct any who desire to learn of the characteristics of Manitoba and the great Canadian North-West, and the gentlemen in charge are abundantly able and courteously willing to impart any information desired.\"\n\nThe Boston Post's notice is equally flattering. It remarks:\n\n\"One of the finest of the many railway companies' exhibits at the Institute fair is that of the Canadian Pacific. People in this part of the country have heard and read most marvellous stories of the agricultural and mineral wealth of the extreme North-West, that country where the winter weather is made, but here they will find a substantial demonstration of the truth of these stories. The exhibit is a large one, particularly in the line of grains, grasses and vegetables. Of the 150 kinds of grasses which grow wild in Manitoba and North-Western Canada, some 75 different specimens are found in this collection. They are grasses which, for luxuriance and richness, compare favourably with any raised in the United States. There are also many varieties of various species of wild sweet peas. Winter radishes, several feet in length, and potatoes half the size of one's head, flank enormous cabbages, beets, onions and squashes. One squash alone weighs some 292 pounds. There are also some wonderfully large cabbage-turnips, or Dutch turnips. The finest potatoes in the exhibit come from Medicine Hat, some 400 or 500 miles west of Winnipeg. The specimens of wheat are many and various, and the company has upon the premises a veteran miller from the North-West to explain the merits of the exhibits.\n\n\"Samples of the soil from Manitoba, which are handsomely arranged in upright cabinets, disclose the secret of cultivating their rich grasses and roots. The cabinet of minerals shows some fine specimens of gold-bearing rock, and is particularly rich in fossils. There are nearly 400 specimens in this collection, representing largely Silurian, Cretaceous and Post-Tertiary deposits. There are also some interesting remains taken from the mounds along the Red River.\n\n\"The size attained by vegetables and roots in Manitoba appears truly marvellous, considering the shortness of the season there. Cabbages often weigh 17 pounds apiece, and turnips 25 pounds. Onions often produce 270 bushels to the acre, and carrots 300 bushels. The exhibit of these marvellous products reflects credit alike upon the Canadian Pacific Railway and its efficient Assistant General Passenger Agent, Mr. George W. Hibbard, through whose enterprise our Canadian friends were enabled to make so good a showing.\"\n\nAll of the newspapers have first-class notices, the exhibit being of the nature of a great surprise to our friends on the other side of the line. They are now willing to\nbelieve that there is a Canadian North-West, as distinct from a United States North-West, and that—in the words of the late Earl Beaconsfield—it is \"a land of illimitable possibilities.\"\n\nThe St. John, N.B., Daily Sun, says:—\n\n\"Undoubtedly one of the great attractions of the Exhibition, great and varied though its features are, is the collection which has been sent from Manitoba. Great interest in it has been taken by our farmers and others, who were amazed at the wonderful growth of many of the vegetables. But it is especially as a supplier of grain that the Canadian North-West excels, and the exhibits in that line are full of interest to all who feel a concern as to the future of this great Dominion. Our reporters have dealt fully with all the specimens from the Prairie Province, which, it should be added, have been arranged in a very tasty and attractive style. Several parties have been wanting to buy the potatoes singly for seed purposes, and several offers have been made for the fossils, all of which were, of course, politely declined. The reptilian remains have been especially noticed. They were discovered in a ravine 20 miles east of Medicine Hat, and at the same time the remains of seven others were obtained. The study of the geology of that country develops some interesting facts. The presence of corals and other marine forms found, as fossils, in the Silurian rocks, in the vicinity of Winnipeg, prove conclusively that at one time in the history of the world Manitoba enjoyed a climate like that which we find in countries where corals exist at the present time, such as Australia.\n\n\"The Manitoba exhibit is now in perfect shape, and is undoubtedly the main attraction of Agricultural Hall, and maintains a position among the leading features of the whole Exhibition. Messrs. Keith, Clarke, Panton and Bedford have worked hard in getting the exhibit in shape, and they are entitled to great credit for the tasteful manner in which it is arranged. The crowd around the specimens from the great North-West, yesterday, was very large, and the officials in charge were kept busy answering numerous questions regarding the exhibits and the country from which they came. Canadian Pacific Railway maps and folders, Canada North-West Land Company pamphlets and copies of the Daily Times, of Winnipeg, were distributed by the hundred to the visitors, who were all eager to gain information regarding our wonderful North-West land. Great interest was taken in the boxes of earth, showing the quality of the prairie soil at Winnipeg and Brandon, foot by foot, to a depth of 4 feet. There are some five or six magnificent black Spanish radishes, one of them being 20 inches in circumference. The white radishes are also of splendid size and quality. There is also an astonishing exhibit of white garden turnips, similar to the variety grown in the Maritime Provinces. The specimens shown are larger than any seen here, one from the vicinity of Stonewall, measuring 40 inches in circumference. Visitors are much amazed at the wild timothy grass, one specimen which grew on dry land near Moose Jaw measuring 6 feet 2 inches in height. Champion and Early Rose potatoes are well represented, one of the Champion variety being 16 inches in diameter, while the Early Rose from Manitoba completely overshadow in size any shown from the three Provinces by the sea, while, as has been before remarked, their quality is the very best. A curious vegetable is the Kohl Rabi, which is simply a turnip-rooted cabbage. This hybrid, between a turnip and a cabbage, is found in the East, but no such fine specimens are seen as these from Manitoba, one of them being fully 25 inches in circumference. The onions are remarkable for their size and beauty, and some of the immense carrots shown are of sufficient size to feed a whole family. An exhibit which has attracted much attention is that of socks and yarns, made from buffalo hair, by a farmer's wife at St. Boniface, opposite Winnipeg. But it is of the Manitoba wheat that special mention must be made. People here do not seem to thoroughly understand the fact that Manitoba No. 1 hard wheat stands, today, pre-eminent in the grain markets of the world above all other wheat. It is worth as much in Winnipeg today as ordinary wheat in Toronto, selling at latest advices at from 90 cents to $1.25 per bushel. It has been remarked that the ears of wheat shown are short. This is a peculiarity of Manitoba wheat, but there are always a more than usual number of ears to the stock, which explains the cause of the prolific yield. Major Bell, of the renowned Bell Farm at Qu'Appelle, is collecting at present some samples of grain to be sent as exhibits to\nLondon, Eng. One of these is a sample of oats, the product of one single germ seed. It is composed of thirty stalks, more like young canes than oat stalks, and it is estimated that there are 10,000 seeds of grain on these stalks. Another is a sample of 'soft wheat, Red River variety.' There are 30 stalks and 1,200 seeds of grain attached to them. A third sample has 83 heads of the Fyfe variety, containing 3,000 prickles of the finest wheat. The grain shown in the exhibit here is well worthy of inspection.\n\n\"Accompanying the Manitoba exhibit is an interesting collection of 340 specimens sent by the Historical and Scientific Society of Winnipeg, comprising the geology, mineralogy, ethnology and history of the Canadian North-West. For the convenience of those interested in such specimens, they have been arranged under divisions. Division I. comprises Silurian deposits, which are represented by specimens from the Selkirk quarries, which are situated on the east side of the Red River, about 21 miles north of Winnipeg. The stone from the outcrops is of a greyish-white colour, and effervesces strongly on treatment with cold acids. It dresses readily and is largely used in Winnipeg as ornamental stone in building. When burnt, it produces a very white variety of lime. Much of the stone from this place shows a peculiar mottled-like appearance. Fossils are shown which were obtained from these outcrops and which are confined to a stratum of rock not exceeding 10 feet in thickness. They are classified under the following sub-kingdoms: Protozoa, Caelenterata, Annulosa and Mollusca. Under division II., we find\n\n\"SILURIAN DEPOSITS\n\nfrom the Stony Mountain exposure. At this place, some 15 miles north-west of Winnipeg, an excellent exposure of Silurian strata occurs. The so-called mountain stands like an island of limestone, elevated above the surface of the surrounding prairie some 60 feet. It is about 5 miles in circumference, and resembles the shape of a horse-shoe in outline. The west side is quite steep and along the escarpment the exposed edges of the strata are easily observed; while the east side slopes gradually to the prairie level. The whole appears to be an outlying patch of Silurian dolomitic limestone, left by denudation in the condition in which we now find it. The surface near the quarry shows excellent traces of glacial action, the striæ indicating a N. N. W. direction. Two distinct kinds of rock are observed here; one a hard dolomitic limestone, of brownish grey colour, about 40 feet thick; the other a reddish-grey limestone, 10 feet in thickness. The latter is exceedingly fossiliferous and effervesces on treatment with cold acid. The former has but few fossils, usually very imperfect and effervesces only when treated with hot acids. The stone from this dolomitic stratum is largely employed for building purposes. Owing to its hardness, it dresses with difficulty, and on this account is not so much used for ornamental stone as that from Selkirk. It produces, when burnt, a strong lime. The fossils of this division are nearly all obtained from the lower stratum, and are principally shells, in striking contrast with those from Selkirk, most of which are either corals or representatives of the cuttle-fish family.\n\n\"CRETACEOUS DEPOSITS.\n\n\"The above are to be found in Division III. Some of the most beautiful fossils in this division were obtained from a large boulder taken out of a well on the farm of John H. Poyser, near Pense Station, Canadian Pacific Railway. The stone was about 3 feet in diameter, and presented no appearance of fossils on the external surface, but on breaking, proved to be a mass of beautiful specimens. The matrix in which they were embedded, when compared with the cretaceous limestone of the Rocky Mountains, showed it to be the same in physical characters and chemical composition. This stone, found embedded in the clay 30 feet below the surface, was no doubt far removed from the rock of which it was a fragment. In this group are also some fossils from 60 miles south of Regina, and from the southern shore of Buffalo Lake, about 15 miles north of Moose Jaw, where an outcrop of cretaceous rock occurs. From Pense Station is shown an ammonite (allied to the nautilus of modern seas) and a mass of shells. Under Division IV. are placed deposits of the same kingdom, including fossils obtained from a ravine near Irvine Station, on the Canadian Pacific Railway, and those found at the coal mine near Medicine Hat. The escarpment of\nsandstone at Irvine is one of intense scientific interest, on account of there being found here this summer the fragmentary remains of some huge forms of extinct reptilia. There is no doubt that this place will, ere long, become a field of scientific investigation.\n\n\"At Medicine Hat, where coal appears along the banks of the Saskatchewan, about 8 miles above the town, the principal fossils obtained are oyster remains and fragments of petrified wood. The seam of coal worked at present is 6 feet thick, 220 feet below the surface of the prairie. Two hundred feet from the surface, layers of oyster shells are found, and also in a stratum 213 feet below the prairie level.\n\n\"LARAMIE DEPOSITS.\n\n\"Division V., includes the above, and embraces specimens from an escarpment of sandstone rock on the Bow River, 6 miles west of Calgary. Much of the sandstone here contains innumerable fossil leaves, belonging to many different species of trees. In some cases the leaves are very complete and readily identified. Owing to the soft nature of the sandstone, it is difficult to secure perfect specimens. Bivalve and univalve shells are also common. There is shown in this division a fragment of a large ammonite from Belly River, showing very distinctly the peculiar structure of the septa in these shells, and fragments of baculites from Edmonton, as well as coal from Prince Albert, Edmonton, the Calgary District, Belly River and Medicine Hat.\n\n\"POST-TERTIARY DEPOSITS.\n\n\"In Division VI., under this heading, there is a very interesting exhibit, embracing a number of Indian remains found in a mound, which was opened by the Historical Society in October, 1879. It was about 18 miles north of Winnipeg, in the Parish of St. Andrew's, on the banks of the Red River. The mound was 90 feet in diameter, and 5 or 6 feet at the highest point above the surrounding prairie. Owing to its situation, half of it had fallen into the river, as the banks had worn away. In this division are also included selections from the archives of the Historical Society and publications of the Society. Division VII. comprises mineralogical specimens from the mining districts on the Lake of the Woods and some localities on Lake Winnipeg. All the specimens of gold-bearing quartz are very rich, and in many of them the gold is readily seen with the naked eye. This department of the Manitoba exhibit is under the special direction of Mr. J. Hayes Panton, M.A., who is a prominent member of the Historical and Scientific Society, and has made valuable contributions to the geological history of the Canadian North West.\"\n\nThe \"COMMERCIAL WORLD and UNITED STATES EXPORTER,\" (NEW YORK and CHICAGO), 16th November, 1882, says:\n\n\"At the recent fair of the New England Manufacturers' and Mechanics' Institute, Boston, one of the most attractive features was the splendid exhibit made by the Canadian Pacific Railway, of the agricultural and arboreal and mineral products of Manitoba and other sections of the Canadian North-West. The display was calculated to enlarge the general conception of the natural capabilities of the vast region traversed by this road, and stimulate emigration to a country so eminently adapted to be the home of millions of prosperous agriculturists.\n\n\"A few words as to the road itself, and the principal cities and towns along its route: The Canadian Pacific Railway extends from Montreal, Canada, to Port Moody, the Pacific terminus, a distance of 2,906 miles, the shortest trans-continental line in America, and the shortest route between Great Britain and India, China and Japan. Upwards of 1,500 miles of the road are now in operation, and by the close of the year at least 2,000 miles will be in complete running order. Its construction is first-class in every respect, and its equipment includes drawing room, dining and sleeping cars that are not excelled in elegance and perfection of appointments.\n\n\"The great prairie section of the Canadian North-West extends from the neighbourhood of Winnipeg to the base of the Rocky Mountains, a distance of over 800 miles, and contains large tracts of the finest agricultural lands in the world. Fuel and water are abundant, and the salubrity of the climate and richness of the soil peculiarly adapt this region to the cultivation of grain and the raising of stock. There are vast deposits of coal in various localities, only waiting development, and\nthe country is rich in other minerals, and in timber of the finest varieties.\n\n\"Railroad or Government lands are procurable on exceedingly liberal terms, and settlers are afforded every facility for establishing comfortable homes. The immigration is large and steadily increasing, and is mainly composed of the most desirable elements. The wonderful progress of the country is shown by the rapid growth of its settlements. Winnipeg, the Capital of Manitoba, which, in 1879, was a mere village, containing only about 200 inhabitants, is now a city of more than 25,000 population, is lighted by electricity and gas, has splendid public buildings and elegant private residences, is furnished with all the conveniences of older cities, is the centre of seven lines of railway, and is making rapid strides in commercial importance.\n\n\"Among the other principal towns are Portage la Prairie, Brandon, Broadview, Qu'Appelle, Moose Jaw and Regina; the latter the future Metropolis of the North-West Territory and the seat of Government of the Province of Assiniboia.\n\n\"To return to the exhibition at the Institute Fair, now closed: From our correspondent, who was present at the fair, we received the following description of the exhibit made by the Canadian Pacific Railway. The display of grain is very fine, comprising splendid specimens of wheat, barley, rye, oats, etc. Among the varieties of wheat are the Scotch Fyfe, Golden Drop, Canada Club, White Russian, Red Spring, etc., the Red Fyfe being the kind most largely cultivated. The average yield of wheat is from twenty-five to thirty-three bushels to the acre, and its weight ranges from sixty-one to sixty-four pounds per bushel. Ogilvie's flouring mills, at Winnipeg, capacity 600 barrels per day; the City mills, at Winnipeg, capacity 300 barrels per day, and the Assiniboine mills, at Portage la Prairie, now running 200 barrels per day, are all flourishing establishments. Next year the last named mills are to produce double this quantity, or 400 barrels per day. They have the building and engine power suitable to produce this quantity. These mills have the same machinery as the Pillsbury and Washburne mills, of Minneapolis, Minn.\n\n\"The samples of oats comprise both the white and black varieties. There are handsome specimens of the Black Tartarian and the White and the Yellow Russian. The yield of oats varies from fifty to seventy bushels to the acre, fifty bushels being considered only a very ordinary crop.\n\n\"The specimens of barley embrace the two, four, and six-rowed varieties. The usual yield of this grain is from forty to fifty bushels per acre. The display includes all kinds of grain in the sheaf as well as in bags.\n\n\"Fine specimens of flaxseed are shown, also flax and hemp in the fibre. These crops are extensively grown in Manitoba by the Russian Mennonite settlers, of whom there are now between 8,000 and 10,000 in the country, all industrious and prosperous.\n\n\"Of the wild grasses which grow in such luxuriance, there are more than forty varieties exhibited, many of them over 6 feet high. A sample of thatch grass is shown which is more than 10 feet high, and prairie grass over 7 feet high. There is a sample bale of hay, such as is put up for commercial purposes and shipment. This kind of grass is cut when about 2 feet high; it possesses all the nutritive elements requisite to fatten stock and keep them in good condition. Among the wild grasses are vetches, which, we are told, grow so luxuriantly that a cricket ball would not sink when thrown into a patch of it. Wild peas also grow in abundance, and it is said that a mixture of vetches or peas with hay will make cattle exceedingly fat.\n\n\"The vegetable display is magnificent; there are potatoes weighing over two pounds each, in many varieties—Early Rose, Champion, Peerless, Snow Flake, St. Patrick, etc.; marrowfat, and other varieties of peas; gigantic squashes, enormous cabbages, onions and carrots; beets over 2 feet long, turnips of immense size; radishes, the Black Spanish, larger than the largest beets grown at the east; chicory and citron of astonishing growth, and the \"Kohi Rabi,\" a hybrid between the cabbage and turnip, largely cultivated as food for cattle.\n\n\"The character of the soil of Manitoba is shown by samples in a series of boxes 4 feet deep. There are three samples from the bottom lands along the Red River, and from the first plateau. In the first named, the soil is black mould till the third foot is reached, when clay begins to appear; in the last, there is a mixture of sand.\nThis will produce immense crops in a rainy season, the other in a dry season. In winter the soil freezes to the depth of 4 feet. As soon as the sun thaws the ground to the depth of 8 or 10 inches, seed is sown, and the increasing warmth gradually draws up the moisture from beneath, so that rain is not needed till the middle of June.\n\n\"For the foregoing information we are much indebted to Mr. William Clarke, Winnipeg, one of the gentlemen in charge of the exhibition.\n\n\"There are samples of coal from the vicinity of Medicine Hat, South Saskatchewan, where there is an area of some 200 miles of coal lands, with seams varying from 2½ to 11 feet in thickness. The coal is bituminous and of excellent quality. In the North Saskatchewan district the coal deposits are immense, with veins 11 feet thick. The coal can be broken off with a pick and thrown directly into the hold of boats or steamers.\n\n\"The display of woods is incomplete, owing to some inadvertence in collecting specimens. The native woods of the Canadian North-West comprise oak, white and red cedar, birch, poplar, spruce, white ash, cottonwood, tamarack, cherry, white willow, balsam, ash, maple, pine, elm, and box elder, the latter very valuable for the use of wood engravers.\n\n\"The Historical and Scientific Society of Winnipeg, in charge of J. Hayes Panton, M.A., makes a very interesting exhibition of 340 specimens, from their collection of 2,000 specimens, illustrative of the geology, ethnology and history of the Canadian North-West. A study of these fossils and minerals will readily show that this country affords an immense field to the student of science. Among the more interesting specimens are those of Reptilian remains, discovered by Mr. Panton this summer in a ravine near Irvine Station, on the line of the Canadian Pacific Road. They are, no doubt, the bones of gigantic Saurians that flourished in those regions long ago. One is especially struck with the fossil coral shells and representations of the cuttle-fish family, all marine forms and characteristic of warm climates in striking contrast with that of Manitoba now. The whole collection is unique in its character, and shows some of the most complete fossils ever seen. To the most illiterate, there is no difficulty in identifying that these are the remains of extinct animals, which flourished in the Silurian and Cretaceous seas of the North-West.\n\n\"One of the most attractive features of the exhibit is a series of photographic views. That of Winnipeg shows buildings which would do no discredit even to the Modern Athens. One of these fine buildings is the Hudson Bay store. The beautiful residences of some of the wealthy inhabitants are also represented. There are various scenes along the route of the Canadian Pacific Railway and on the Saskatchewan River and the \"Lake of the Woods,\" a most beautiful sheet of water, of large dimensions, dotted with numerous islands. One of the farming scenes represents seventeen ploughs at work on the \"Bell\" Farm; another shows seventeen reapers in operations on the same property.\"\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001134.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 32334, "total-output-tokens": 14995, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 148, 1], [148, 148, 2], [148, 296, 3], [296, 296, 4], [296, 3392, 5], [3392, 6851, 6], [6851, 10729, 7], [10729, 13709, 8], [13709, 16875, 9], [16875, 20612, 10], [20612, 24934, 11], [24934, 28250, 12], [28250, 32842, 13], [32842, 37476, 14], [37476, 42225, 15], [42225, 46936, 16], [46936, 51454, 17], [51454, 55851, 18], [55851, 60405, 19], [60405, 63483, 20], [63483, 63483, 21], [63483, 63483, 22]], "primary_language": ["en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]