[{"id": "7b8ac42deb3ab24fd8d29f3e54303f0b054447d6", "text": "QUESTION RIEL\nRebellion du Nord-Ouest\nREBELLION DU NORD-OUEST\n\nJ. C. Littauer\nLETTRE DE SIR D. L. MACPHERSON.\n\nCHESTNUT PARK,\n\nTORONTO, 1ER JANVIER, 1887.\n\nCHER MONSIEUR WHITE,\n\nJe vous suis excessivement obligé pour la copie anticipée d’un pamphlet sur la Rébellion du Nord-Ouest.\n\nLes extraits que vous publiez, provenant des documents conservés au Département de l’Intérieur prouvent clairement que le Gouvernement de Sir John Macdonald n’a rien fait, ni par action, ni par omission, pour provoquer le moindre mécontentement légitime, encore moins la rébellion, parmi les métis.\n\nJe n’ai pas besoin de dire, que lorsque j’étais Ministre, ou lorsque j’ai remplacé le Ministre de l’Intérieur, aucun métis n’a été troublé ou menacé de l’être, par rapport à l’occupation de sa terre.\n\nL’histoire, mise en circulation par l’Opposition, que j’ai poussé la compagnie de colonisation St-Albert, à chasser les métis des lots accordés à la Compagnie, est une de ces calomnies, dont le grand nombre est fabriqué par ces écrivains de la presse grite, si bien décrits par la Presbyterian Review, comme étant des hommes qui “écrivent des mensonges pour gagner leur pain et leur beurre.”\n\nCroyez-moi,\n\nCher M. White,\n\nVotre très dévoué,\n\nD. L. MACPHERSON.\n\nL’Honorables Thos. White,\nMinistre de l’Intérieur,\nOttawa.\nFAITS POUR LE PEUPLE.\n\nLA REBELLION DU NORD-OUEST.\n\nLa Question des Métis et leur traitement par le Gouvernement.\n\nOn accuse le Gouvernement de la responsabilité de la rébellion qui éclata récemment sur les bords de la Saskatchewan Sud, et de ses conséquences. Quelques faits démontrent l'injustice de cette accusation.\n\nPREMIÈREMENT EN CE QUI REGARDE LE MANITOBA.\n\nLorsque le Gouvernement du Canada prit possession des Territoires et organisa la Province du Manitoba, il prit des mesures pour régler les réclamations des métis qui vivaient dans le pays. Comme première démarche, le Gouverneur Archibald fut chargé d'en faire le dénombrement. Il le fit, et sur son rapport, 1,400,000 acres de terre furent réservés, par acte du Parlement, pour répondre aux réclamations. Tout ceci fut fait avant le changement du Gouvernement, en 1873. Si ce changement n'avait pas eu lieu, toutes les réclamations des métis du Manitoba auraient été alors réglées. Malheureusement, à l'arrivée de Mr. MacKenzie au pouvoir, il traita de nouveau la question, et nomma Mr. Matthew Ryan et Mr. Machar de Kingston, pour faire un autre dénombrement. Ils trouvèrent moins de métis que n'en avait comptés le Gouverneur Archibald, et accordèrent à chacun d'eux une étendue plus considérable de terre, sur les 1,400,000 acres. Il en résulta de grandes difficultés pour régler avec les métis, puisque l'énumération du Gouverneur Archibald a été reconnue moindre que la réalité, et que celle des commissaires de Mr. MacKenzie était grandement erronée.\n\nEn 1876, des traités furent faits avec différentes tribus des Sauvages du Nord-Ouest, qui céderont leurs titres comme sauvages, en échange de réserves de terrains et de certaines autres considérations. Il aurait été sage de résoudre, en même temps, la question du titre de tous les sauvages du Nord-Ouest, ainsi que celui des métis. Au contraire, Mr. Mills, alors Ministre de l'Intérieur, chargea Mr. Matthew Ryan, Magistrat Stipendiare et Membre du Conseil du Nord-Ouest, de s'enquérir des réclamations des métis. Le 3 mars 1877, Mr. Ryan adressait la lettre suivante à l'agent des Terres Fédérales, à Winnipeg :\n\n\"Rivière du Cygne, 3 mars 1877.\n\n\"Cher Monsieur, — Afin de continuer mon enquête au sujet des terres des métis, comme je n'ai pas d'autre communication officielle que celle d'un télégramme m'autorisant à prendre le témoignage des réclamants qui pourraient se présenter devant moi dans le Territoire du Nord-Ouest, voudriez-vous m'informer, le plus tôt possible de l'intention du Département. Veuillez me faire connaître quelles mesures les réclamants métis en visitant les endroits où ils résident ou, veuillez que j'agisse en leur faveur, toutes les fois que je pourrais les rencontrer pendant l'exécution de mes devoirs de magistrat ? Dans ce dernier cas, je crains qu'on ne fasse pas grand bien pratique de sitôt. Le grand nombre des métis des différents territoires est de provenance diverses, connus ou certains, et je ne sais pas à quelle époque ou à quelles époques mes devoirs de magistrat m'appelleront aux différentes places. Je crains qu'en comptant sur la coïncidence de nos rencontres nous retardions inutilement les affaires et nous exposons par là aux métis et aux autres habitants du Nord-Ouest, la perte des bénéfices que leur accorde la loi. Ne conviendrait-il pas alors, que je fisse des recherches spéciales en leur faveur, durant le printemps et l'automne prochains ? Je pourrait me rendre au Lac Qu'Appelle, en mai, ou, d'après Mr. MacKenzie, cent de la Cité de la Baie d'Hudson, et d'après le général MacKenzie, je peux faire le grand nombre des métis entre le 15 de ce mois et le dix ou le quinze du mois suivant. Plus tard je pourrai visiter l'établissement écossais de Prince-Albert et l'établissement français de St. Laurent, et ainsi de suite. On ne m'a pas informé, non plus, de ce qui a rapport aux dépenses, mais je suppose qu'elles seront payées par le Département de l'Intérieur. Je vous prie de m'informer de votre avis, ainsi que des autres que je mentionne dans cette lettre, le plus tôt possible et d'agir en conséquence.\n\n\"Votre très dévoué,\n\n\"MATTHEW RYAN.\"\n\nD. Codd Ecr., Winnipeg.\n\nLoin d'agir sur la suggestion de cette lettre si raisonnable, on refusa toute action en se servant de termes qui nous indiquent avec quel esprit Mr. Mills traitait alors les\naffaires du Nord-Ouest. En marge de la lettre, nous voyons les mots suivants, écrits de la propre main de Mr. Mills :\n\n\"II n'est pas nécessaire de chercher les réclamants. S'ils s'occupent de leurs intérêts, ils se présenteront eux-mêmes et produiront leurs réclama-\ntions.—D. M.\"\n\nMr. Ryan, malgré ce refus de la part du Ministre, de lui permettre de prendre les mesures convenables pour remplir sa mission, se rendit à Qu'Appelle. Il envoya son compte pour $75, et Mr. Mills fut tellement indigné qu'il refusa de le payer, parce qu'on n'avait pas suivi ses ordres. Sir John Macdonald paya ce compte lorsqu'il arriva au pouvoir! Rien ne fut fait, à vrai dire, avant le 24 juin, lorsque Mr. David Laird, Lieutenant Gouverneur des Territoires du Nord-Ouest, télégraphia ce qui suit:\n\n\"Remarquez que l'autorité de Mr. Ryan pour s'enquérir des réclamations des métis, en vertu de l'Ordre en Conseil, du 14 juin 1876, est expirée. Recommande une extension de temps pour un an. Il est ici à présent. Réclamants attendent. Répondez.\"\n\nLe 28 juin, Mr. Ryan télégraphia lui-même de Battleford:\n\n\"Métis me pressent. Accorderez-vous une extension de temps?\"\n\nLa réponse suivante lui fut envoyée:\n\n\"Le Ministre a pris le sujet en considération et autorisera probablement M. Duck, qui a été nommé agent des Terres Fédérales pour la Saskatchewan, à s'enquérir de ces réclamations.\"\n\nCe fut là le dernier acte de M. Mills. Les vues du Département à cette époque, ressortent cependant d'un memorandum de M. Denis, Arpenteur-Général et chef de la branche des terres, du département:\n\n\"La question soulevée par Son Honneur le Lieutenant-Gouverneur, relativement à la manière de régler les réclamations des habitants qui se sont établis sur les terres des Territoires du Nord-Ouest, avant le transfert, est une question politique que le Ministre doit considérer. Le soussigné, cependant, osse exprimer l'opinion que si une telle terre devait être donnée gratuitement à l'occupant, soit qu'elle possède une valeur exceptionnelle, par rapport à la situation, soit qu'elle ait été prise en vue de spéculation, si le réclamant l'a toujours occupée et cultivée sur une étendue raisonnable. Pour donner effet à une telle pratique, cependant, il faudrait un acte du parlement.\"\n\nOn voit par ce memo, que la solution de cette question, dans l'opinion du Département, à cette époque, était de donner aux métis, les terres sur lesquelles ils s'étaient établis. On doit dire qu'ils n'ont jamais été privés de ces terres, et que notre gouvernement leur a donné gratuitement les terres qu'ils occupaient sur une étendue de 160 acres; de sorte que cette politique, suggérée par le Département en 1877, a été la politique invariable de l'administration actuelle.\n\nLa conduite de l'administration Mackenzie vis-à-vis des réclamations des métis peut être résumée comme suit:\n\n1. Ils ont ignoré la conduite du gouvernement précédent en faveur des réclamants du Manitoba dont les réclamations auraient été réglées depuis dix ans; par la nomination de nouveaux commissaires, ils ont retardé ces règlements et augmenté les prétextes de présenter des réclamations frauduleuses.\n\n2. Ils ont nommé Mr. Ryan pour s'enquérir des réclamations, et ils lui ont refusé l'occasion de visiter les établissements des métis, rendant par là sa nomination inutile.\n\n3. Aucune réclamation n'ayant été réglée durant les deux années qui suivirent sa nomination, ils lui ont refusé de prolonger sa commission, disant que le Ministre avait pris le sujet en considération, et qu'il chargerait probablement Mr. Duck, agent des terres à Prince-Albert, de s'enquérir des réclamations des métis qui se présenteraient.\n\n4. La lettre de l'arpenteur-général indique que la pensée du Département était simplement de régler les réclamations des métis en les confirmant dans leurs possessions, où le gouvernement actuel ne les a jamais troublées.\n\nOn dit que\n\nDE NOMBREUSES PÉTITIONS\n\nfurent envoyées au gouvernement et qu'elles restèrent sans résultat favorable. Il est vrai que des pétitions de tout genre, furent envoyées. Il y en a même jusqu'à 1873. Une des plus importantes, parce qu'elle est la plus élaborée, est celle de Sa Grandeur Monseigneur Grandin, de St.-Albert, en date du 5 Avril 1875, et peut servir comme type des réclamations généralement faites. Ce que demandait Mgr. Grandin, comme il le résume lui-même était:\n\n1. Quelqu'encouragement pour les colons.\n\nA ce sujet il dit:\n\n\"Les missionnaires catholiques ont fait des choses presque impossibles dans ce but. Ils ont établi trois moulins, à différents endroits. Pour la troisième fois, nous avons tenté d'en bâtir un dans la colonie de St. Albert—croirez-vous que nous avons dépensé plus de 2900 sterling, pour ce moulin et que nous, nous sommes encore dans le besoin? Que le gouvernement, de son côté, daigne faire quelque chose pour encourager l'agriculture.\n\n2. De l'aide pour un hôpital—au moins pour le construire et le mettre dans un état convenable pour recevoir les malades.\n\n3. De l'aide pour des écoles—Le gouvernement fait beaucoup pour l'éducation dans tout le Canada, laissez-nous le Nord-Ouest seul, sans assistance? On ne peut pas dire que nous avons moins besoin que les autres parties du pays.\n\n4. De l'aide pour nos asiles d'orphelins, afin que\nnous agrandissions ces établissements pour recevoir un plus grand nombre de petits sauvages.\n\n5. Des concessions de terrains à chaque asile d'orphelinat ou ferme modèle.\n\n6. Des réserves de terres pour les enfants élevés dans les asiles, ainsi qu'un peu d'aide pour leur permettre de faire un peu de culture, après leur mariage.\n\n7. Enfin—les réserves qui seront accordées aux sauvages soient de terre arable et situées près des lacs abondants en poissons.\n\nLa réponse du Lieutenant Gouverneur, David Laird, écrite sous la direction du Surintendant général, Mr. Mills, dispose de ces demandes, de la façon suivante:\n\n\"Quant à la première demande, c'est-à-dire, l'encouragement de l'agriculture parmi les colons, le surintendant général ne peut que féliciter Votre Grandeur des efforts faits par la mission en ce sens, spécialement de l'établissement de moulins qui permettront aux colons de votre diocèse d'utiliser le grain qu'ils récolteront.\n\n\"Le surintendant désire vous rappeler que ce sujet appartient à la juridiction du Gouvernement Local qui sera bientôt inauguré dans le Nord-Ouest. Il croit explicable que, si c'est évident, que les concessions accordées par le Gouvernement Fédéral, pour construire une voie ferrée et une ligne télégraphique à travers les territoires, auront pour effet d'ouvrir le pays, de faciliter les communications, et par ce moyen, donner un impetus aux intérêts agricoles du territoire.\n\n\"Les deuxièmes points que vous mentionnez concernent des affaires qui appartiennent à la législature locale.\n\n\"Relativement au premier point, je dois remarquer que l'Acte des Terres Fédérales, pourvu aux fins générales d'éducation dans les Territoires, au moyen d'une subvention libérée en terres, et pour ce qui regarde les sauvages, le Gouvernement Fédéral, sera certainement prêt à faire pour leurs écoles, les mêmes concessions faites ailleurs, lorsqu'il nous aura remis le territoire par traité. En attendant, je suis chargé par le Ministre de transmettre à Votre Grandeur, un chèque officiel, pour la somme de $300, pour aider à l'école de St-Albert, en vertu de l'Ordre en Conseil du 10 Octobre 1878, comme nous l'avons appris par le rapport de Votre Grandeur, que l'assistance moyenne des enfants sauvages à cette école n'est pas moins que le nombre requis par l'Ordre en Conseil, c'est-à-dire 25.\n\n\"Chacune des autres écoles que Votre Grandeur choisira, aura droit au même montant pour l'année courante, pourvu toujours, que l'assistance moyenne des enfants sauvages durant l'année, ne soit pas moins de 25.\n\n\"Quant au cinquième point, savoir, les concessions de terre en faveur des orphelinats et des fermes modèles, le surintendant général n'est pas prêt à contracter à présent, aucun engagement défini au nom du Gouvernement. Il pourra mieux définir ce point après l'établissement d'un traité, et quand on connaîtra mieux l'étendue du terrain que l'on demande pour les fins ci-dessus mentionnées.\n\n\"Le sixième point se rapporte à une question de politique publique, sur laquelle il serait manifestement préjudiciable aujourd'hui d'exprimer une opinion. Les colons du Nord-Ouest ont de bonnes raisons pour croire que le Gouvernement Fédéral agira avec eux d'une manière libérale. Il y a assez de terre dans les Territoires pour tous les colons et leurs enfants, et nous entretenons la ferme espérance qu'ils en cultiveront autant qu'ils le feront possible, et qu'ils se bâtiront des demeures confortables dans le pays auquel ils appartiennent.\n\n\"Quant au septième point, c'est-à-dire, les réserves pour les sauvages, tous les traités faits avec les sauvages comportent des dispositions spéciales à ce sujet, par lesquelles on leur fournit de l'aide en argent et en instruments ; il n'y a pas de doute que ces sujets seront toujours considérés avec le même esprit de libéralité dans les traités futurs.\n\n\"Les réserves accordées aux sauvages, renferment sans doute une partie notable de terre arable y compris, tous les lacs abondants en poissons, que les sauvages voudront fréquenter, lorsque ce sera praticable.\"\n\nNous avons cité cette pétition et la réponse qui lui a été donnée pour cette raison ; les sujets mentionnés par Mgr. Grandin, furent pour la plupart, compris dans des pétitions subséquentes, et il devient alors important d'indiquer que lorsqu'ils furent ainsi présentés en détail à Mr. Mills, le Ministre de l'Intérieur, dans le Gouvernement Mackenzie, il les reçut avec refus péremptoire.\n\nNous citerons la pétition suivante à l'appui de notre avancé. Cette pétition d'un certain nombre de métis, a été transmise à Ottawa, le 13 février 1878, par le Gouverneur Laird. Elle avait rapport à des sujets de politique publique, et une des demandes que l'on y faisait, était pour des graines et des instruments aratoires pour faire les semences. Voici la réponse, datée le 18 Mars 1878, et signée par Mr. Mills lui-même:\n\n6. Je ne considère pas favorablement la prière des pétitionnaires, qui demandent des graines et des instruments aratoires pour leurs semences. Je ne vois pas sur quelles bases s'appuient les métis, pour demander à être traités d'une manière si différente des colons blancs des Territoires.\n\n7. Les métis qui ont, sous quelques rapports, des avantages sur les nouveaux colons des Territoires, devraient être frappés de la nécessité qu'il y a pour eux de s'établir sur des terres non occupées, certains endroits et de diriger leurs efforts vers les travaux pastoraux ou agricoles ; dans ce cas, nous leur assignerons sans doute, des terres, comme nous en assignons aux colons blancs. En dehors de cette considération, ils ne doivent pas s'adresser au Gouvernement pour aucune assistance spéciale dans leurs opérations agricoles.\n\nQuelques-unes des autres pétitions avaient rapport aux colons établis sur des terres non encore arpentées. Nous prenons pour exemple celle de Gabriel Dumont et de 45 autres, adressées au Ministre de l'Intérieur, le 4 Septembre 1882. Après avoir mentionné que les métis avaient été forcés d'abandonner la chasse, les pétitionnaires disent:\n\n\"Les terres arpentées étant déjà occupées ou vendues, nous avons été forcés de nous établir sur des terres non arpentées, la plupart d'entre nous ne connaissant pas aussi les règlements du Gouvernement touchant les terres fédérales. Grandes alors, furent notre surprise et notre perplexité, lorsque nous fûmes notifiés qu'après l'arpentage, nous aurions à payer $2 de l'acre du Gouvernement. Si nos terres étaient comprises dans les sections de nos nommés, nous devrions, d'ailleurs, vivre rapprochés les uns des autres afin de nous procurer plus facilement une école et une église. Nous sommes un pauvre peuple, et nous ne pouvons pas payer nos terres sans nous ruiner entièrement, par la perte du fruit de notre travail et par le passage de nos terres à des étrangers, qui iront au Bureau des Terres, à Prince-Albert, et paieront le montant fixé par le Gouvernement. Dans notre anxiété nous faisons appel à votre secours de la justice comme Ministre de l'Intérieur et chef du Gouvernement, et vous prions de nous répondez promptement, en ordonnant que nous ne troubliez pas nos terres, et en nous accordant le Gouvernement à nous accorder le privilège de nous considérer comme occupants des sections à nombres pairs, puisque\nnous avons occupé ces terres de bonne foi. Ayant été regardés pendant si longtemps comme les maîtres de ce pays, l'ayant défendu contre les sauvages au prix de notre sang, nous considérons que nous ne demandons pas trop, en priant le Gouvernement de nous permettre d'occuper en paix nos terres, et de faire exception aux réglements, en accordant aux métis du Nord-Ouest, des subventions gratuites de terrains.\"\n\nOn avait déjà accédé à cette pétition. Quant aux prix, ils furent déterminés par certaines résolutions passées à une grande assemblée, tenue à Prince-Albert, le 8 Octobre 1881. La deuxième de ces résolutions était conçue en ces termes :\n\n2. Attendu que le prix des terres à acheter et celui des terres prises avant l'arpentage ont été considérablement augmentés en mai 1881, et que plusieurs personnes se sont établies dans le district de Lorne, dans les Territoires du Nord-Ouest, antérieurement à cette date, il est résolu de prêter le Très Honorable Ministre de l'Intérieur d'accorder à ces colons, les terres qu'ils occupent, au taux de l'Ordre en Conseil qui était en force au moment de leur établissement.\n\nPar une lettre de Mr. Lyndsay Russell, Député actif du Ministre de l'Intérieur, datée à Ottawa le 22 Novembre 1881, on répondit à cette résolution de la manière suivante :\n\n\"Résolution No. 2.—On n'accordera les privilèges demandés que pour les quartiers de section qui ont été réellement occupés et améliorés. Les colons devront faire connaître au Ministre la nature de chaque établissement et l'étendue des améliorations faites. Les privilèges seront accordés ou ne le seront pas, suivant les faits, qui devront donner satisfaction au Ministre.\"\n\nC'est-à-dire que les personnes qui s'étaient établies avant l'arpentage des terres, avaient droit à leurs terres en payant le taux qui était en force au moment de leur établissement, si cet établissement était de bonne foi. Quant à leur droit d'établissement (homestead) gratuit lorsqu'ils occupaient des sections impaires, comme c'était le cas pour Gabriel Dumont et un certain nombre de ceux qui ont signé sa pétition, le paragraphe suivant d'une lettre de Mr. Burgess, Secrétaire du Département, en date du 16 Juin 1882, adressée à Son Honneur le Lieutenant-Gouverneur Dewdney, indique que la requête avait été favorablement prise en considération, trois mois avant la date de la pétition de Gabriel Dumont :\n\n\"Les personnes qui occupèrent sans droit des terres non arpentées avant mai 1880 et avant la mise en force de l'Acte 43 Victoria, chapitre 25, auront leur droit d'établissement (homestead) sur les dites terres, pourvu qu'ils prennent qu'ils les ont continuellement occupées et cultivées jusqu'au moment de l'arpentage.\"\n\nOn voit que cette pétition qui renferme la même demande que d'autres pétitions renfermaient, a reçu une réponse favorable du Département, la requête n'ayant pas été accordée seulement dans le cas de pétitionnaires particuliers, mais le principe qu'elle renfermait, ayant été suivi dans la politique générale du Gouvernement. Comme matiére de fait, on doit dire qu'aucun métis n'a jamais été dépossédé de la terre sur laquelle il s'était établi ou qu'il avait droit de réclamer en vertu de son établissement.\n\nUn autre point soulevé dans cette requête est celui qui concerne le droit\n\nDES PERSONNES À RECEVOIR DES LETTRES PATENTES,\n\nsans avoir complètement rempli leurs devoirs de colons après la date de l'inscription.\n\nD'après les règlements primitifs du Ministère aucune Lettre Patente ne pouvait être émise sans que les conditions nécessaires ne fussent remplies après l'inscription ; mais dans le but de pouvoir au cas de ceux qui pouvaient s'établir avant l'arpentage, ce règlement fut changé et un ordre en Conseil du 19 octobre 1882, contient ce qui suit :\n\n\"Le Ministre recommande, sur l'autorité de la 125ème clause de la loi sur les terres fédérales, qu'il soit autorisé, avant d'accorder l'inscription finale d'établissement dans les cas en question, a anti-dater l'inscription de manière à couvrir le temps qui aurait pu s'écouler entre la demande et l'octroi de l'inscription et durant lequel le pétitionnaire aurait été colon bona fide.\"\n\nDepuis ce temps les conditions de colonisation ont été considérées comme ayant commencé à être remplies à partir de la date de l'établissement sur la terre, que l'entrée formelle en ait été faite ou non, dans le Bureau des terres.\n\nIl n'y a donc dans ces requêtes que deux points sur lesquels il peut y avoir discussion et sur lesquels on accuse le Gouvernement de négligence.\n\nLe premier est qu'on a refusé aux colons la demande qu'ils ont faite d'avoir\n\nLES EXPLORATIONS SUR LE SYSTÈME DES LOTS DE RIVIÈRE,\n\net non sur le système rectangulaire ; l'autre qu'ils avaient droit à un certificat (scrip) pour l'extinction de leurs titres sauvages, de même que les métis du Manitoba en avaient reçu. En ce qui concerne le premier cas, la manière d'agir du gouvernement a été la suivante : lorsque des colons se sont fixés sur le bord des rivières avant l'arpentage, les arpenteurs reçurent ordre de faire leur travail d'après la méthode des lots de rivière, de manière à ce que chaque colon conservât le bénéfice de ses améliorations, s'il en avait faites.\n\nD'un autre côté, s'il n'y avait pas de colons, le système ordinaire d'arpentage suivi sur tous les Territoires et autorisé par la loi de 1871, fut adopté.\n\nLe 16 janvier 1883, le Révérend Père André transmit une requête se plaignant que ces instructions n'étaient pas suivies.\nLes vues du Ministre d'alors sont indiquées dans la lettre qui suit :\n\n\"Ottawa, 23 avril, 1883.\n\n\"Cher Mr. Russell, — Vous trouverez ci-jointe une lettre du Père André, Supérieur de St-Laurant, T. N. O., sur la question des arpentages. Comment se fait-il que ces difficultés se présentent encore quand c'est la règle du Département de l'Intérieur de ne pas déplacer les terrains anciens sans déranger les colons établis ? Les arpenteurs ont-ils reçu des instructions convenables ?\"\n\n\"Bien à vous,\n\n\"D. L. Macpherson,\n\n\"Lindsay Russell, Esq.\"\n\nIl est bon d'ajouter, cependant, que les terres en question avaient été arpentées sur le système rectangulaire, avant la plainte du Père André, et à une époque où, suivant l'indication des plans des arpenteurs, il n'y avait que deux cols entre le Poste de St. Laurent et la réserve des sauvages sur le côté Sud-Est de la rivière.\n\nL'on demandait donc que les terres déjà arpentées, avant qu'elles fussent colonisées, fussent arpentées de nouveau sur un mode différent, parce que les cols qui s'y fixaient après l'arpentage, préféraient cet autre mode ; il n'est pas nécessaire de discuter ce qu'il y a de déraisonnable dans une telle demande.\n\nIl y eut d'autres correspondances à ce sujet et parmi les lettres reçues, on en trouve une du Révérend monsieur Vegreville demandant l'arpentage sur le plan des lots riverains.\n\nCette lettre fut référée à monsieur Deville, inspecteur en chef des arpentages, qui dans son rapport du 14 février 1884 fit les remarques suivantes :\n\n\"On peut facilement faire droit aux désirs des colons sans préjudice aux droits du Gouvernement en adoptant le mode suivant :\n\n\"1o. Si l'inspecteur des agences, lorsqu'il sera sur les lieux, est convaincu que la grande majorité des cols du canton, désire des lots de rivière, il pourra alors ordonner que chaque établissement aboutissant à la rivière soit équivalent au quart d'un quart de section, ou à un lot de vingt chaines de largeur sur un mile de profondeur.\n\n\"2o. En cas contraire, les cols d'une section préférant qu'ils soient divisés en quart de section, auquel cas leur demande sera accordée.\n\n\"3o. Ou à moins que les cols de deux sections désirent que les lots aient dix chaines de largeur sur deux milles de profondeur sur les deux sections, auquel cas leur demande devrait aussi être accordée.\n\n\"Un lot de dix chaines de largeur sur un mile de profondeur serait décrété dans le texte Patente comme étant composé de quatre quarts d'un quart de section.\n\n\"Un lot de dix chaines de largeur sur deux milles de profondeur serait décrété comme étant les moitiés Ouest, Est, Nord et Sud de huit quarts d'un quart de section.\n\n\"Les superficies pourraient être facilement trouvées en référant à ce bureau.\"\n\nLe Secrétaire du Département en accusant réception de la lettre de Mr. Deville le 20 mars 1884, l'informa que le Ministre avait approuvé ses remarques et que l'inspecteur des agences des terres fédérales avait reçu des instructions dans le même sens.\n\nComme on peut le voir, ceci se passait plus d'un an avant la révolte et quelques mois avant l'arrivée de Louis Riel dans le pays.\n\nPour montrer jusqu'à quel point l'on a suivi ce système d'arpentage par lots de rivière, voici une lettre de Mr. Deville à ce sujet :\n\n\"Branche Technique, Ottawa,\n26 Nov., 1883.\n\n\"Monsieur : — En réponse à votre lettre du 23ème du courant, dans laquelle vous demandez les noms des rivieres du Territoire du Nord-Ouest, le long desquelles le terrain a été arpenté et subdivisé en lots de riviere, je dois vous informer que les instructions permanentes sont de suivre ce mode d'arpentage le long des rivieres Saskatchewan, Bataille, au Cheveu-Rouge et Ventre.\n\n\"Des instructions particulières ont aussi été données de suivre le même système d'arpentage le long du lac Winnipeg et des îles de ce lac, ainsi que dans les trois colonies dont le front est situé sur la riviere du Vieux-Land.\"\n\n\"A l'honneur d'être, monsieur, votre obéissant serviteur,\n\n\"E. Deville, Inspecteur en chef des arpentages.\n\n\"J. R. Hall, Esq., Sec.-Dep. de l'Intérieur.\"\n\nEn un mot, lorsque les cols s'établissaient sur les terres avant qu'elles fussent arpentées, le Gouvernement les faisaient arperter suivant les désirs des cols. D'un autre côté, lorsque les terres étaient arpentées avant l'arrivée des cols, le système rectangulaire était suivi, comme dans tout le reste des Territoires, mais alors même, l'ordre fut donné d'accorder aux cols, s'ils le désiraient, leurs octrois suivant les subdivisions légales, au lieu de quarts de section, ce qui, en pratique, donnait les mêmes avantages que le système des lots de rivière. Il faut dire néanmoins que cette question relativement au mode d'arpentage ne peut aucunement être considérée comme donnant droit à des réclamations ou à des dommages. La loi définissait le système des arpentages dans le Nord-Ouest, et personne n'avait le droit de se révolter contre le Gouvernement parce qu'il refusait, ce qu'il n'a pas fait, de se conformer aux désirs des cols ou des communautés, en changeant, ce système. Le changement, en adoptant un système différent, était simplement une concession de la part du Gouvernement, dictée par une saine politique, dans l'intérêt des métis.\n\nIl ne reste plus, maintenant, que\n\nLA QUESTION DU TITRE DES SAUVAGES.\n\nOn a reproché au Gouvernement de ne pas avoir accordé aux métis des Territoires les mêmes privilèges qu'à ceux du Manitoba, et en faisant ce reproche on s'appuie sur les pétitions transmises et les suggestions faites au Gouvernement, surtout celles de l'Archevêque Taché, des Évêques de la \"Terre\nRupert\" et de Saskatchewan, et celles du Conseil du Nord-Ouest. Apart de ce dernier dans son deuxième rapport au Gouvernement en 1883, aucune de ces autorités ne s'accordait dans l'opinion que les métis devaient être traités de la même manière que ceux du Manitoba ; les suggestions du Conseil du Nord-Ouest en 1883 \"à l'égard des métis sur les Territoires, qui n'ont pas participé à l'arrangement conclu pour l'extinction des réclamations des métis dans le Manitoba, et qui néanmoins jouissent du même privilège que celui accordé aux métis de cette Province\" doivent être considérées en rapport avec les recommandations raisonnées de ce même Conseil deux années auparavant. Faisons une revue de ces recommandations. Celle de l'Archevêque Taché était incluse dans son memorandum du 29 janvier 1879, comme suit :\n\n\"(a) La population actuelle des métis dans le Nord-Ouest est d'environ douze cents familles. Que le Gouvernement leur fasse douze réserves, la même qu'ils ont réservées.\n\n\"(b) Chaque réserve devrait être occupée par au moins cent familles, et devrait contenir une superficie de douze milles de terrain qui peut être utilisé, c'est-à-dire, l'étendue de quatre cantons.\n\n\"(c) Tous les métis, hommes, femmes et enfants, résidants dans le Nord-Ouest, au 1er janvier 1879, devraient recevoir des scrips non négociables pour quatre-vingt acres chacun, et devant être choisis dans l'une des douze réserves sus-mentionnées.\n\n\"(d) Ces terrains ne devraient pas être vendus, hypothéqués ou taxés avant d'avoir été possédés par la troisième génération des premiers propriétaires, ou par leurs représentants.\n\nSa Grâce élabore ces recommandations avec grand soin, et suggéra le mode suivant lequel les réserves devraient être délimitées et utilisées. Il recommanda aussi l'octroi d'outils et de grains de semence, et l'établissement d'écoles, pour chacune des réserves, questions dont M. Mills avait déjà disposé, comme cela a déjà été expliqué. L'Évêque Protestant de Saskatchewan, dans sa lettre à M. Dennis, s'opposa aussi à l'adoption du mode de règlement suivi pour le Manitoba. Il dit :\n\n\"Le résultat du mode suivi dans le Manitoba, de donner des terres aux parents et aux enfants respectivement, n'a pas été tel que l'on doive en faire autant dans les Territoires du Nord-Ouest.\"\n\nJe pense que ceci est généralement admis et n'a pas besoin d'être discuté.\n\nQuant à la suggestion d'émettre du scrip, il dit :\n\n\"La deuxième alternative, celle de faire une émission absolue de scrip à chaque personne, est consiste de l'abandonner à son sort naturel. Je suis convaincu qu'un résultat désastreux en ce qui regarde le fait que le Gouvernement se propose. La seule classe de personnes qui pourrait retirer quelqu'avantage d'une telle émission serait celle des commerçants et des spéculateurs sur les terrains ; ceux-ci obtiendraient bientôt le scrip des métis inexpérimentés pour un prix nominal, et ces derniers seraient ainsi pauvres, qu'au contraire, moins favorables, disposés à l'égard du Gouvernement et conséquemment plus dangereux dans leurs rapports avec les sauvages.\"\n\nL'évêque fait observer ensuite que le mode le plus sûr à suivre est celui \"de donner aux métis l'encouragement de s'établir sur les terres, et les moyens pratiques pour y réussir;\" puis il continue en disant relativement au memorandum de M. Dennis, auquel sa lettre était la réponse :\n\n\"Je suis heureux de voir que le mode proposé est le même que celui que vous avez recommandé. Quant aux moyens pratiques pour leur venir en aide, je vois que le conseil du Nord-Ouest recommande deux choses : (a) un octroi non-négociable de scrip à chaque métis, sous certaines conditions ; (b) un aide en outils et en grain jusqu'à ce qu'ils soient déterminés. Vous paraissiez croire que cette proposition est bonne, mais je ne peux pas assez loin. Vous suggérez (c) que les métis devraient s'établir en bandes ; (d) qu'il faudrait leur donner des écoles et des instituteurs, pour leur enseigner la culture, l'élevage des animaux, les métiers mécaniques, et les connaissances utiles à leur genre de vie. Ces recommandations, je dois le dire, ont mon appui le plus cordial.\n\nL'Évêque protestant de la Terre de Rupert, en répondant au Col. Dennis, lui dit qu'il craint de connaitre trop peu les métis pour que son opinion à leur égard, ait quelque valeur, puis il ajoute :\n\n\"La grande difficulté que je redoute, est celle de les convaincre que l'agriculture doit être l'occupation principale de toute leur vie. Leur penchant naturel les portera toujours à choisir des terres où ils pourront faire bonne chasse et bonne pêche de préférence à celles qui sont plus propices à l'agriculture. En effet, en rapport de la culture. Il est donc essentiel pour eux d'avoir, au Fort, un avocat sage et expérimenté qui puisse les guider dans le choix de leurs établissements. Je suis d'avis qu'on ne devrait pas faire de réserves ni pour les métis, ni pour le Gouvernement, et que les métis devraient être libres comme tout autre colon de se choisir le terrain nécessaire pour leur établissement, mais non pas de choisir tout le meilleur terrain simplement, par caprice, pour empêcher d'autres colons de s'y établir.\"\n\nLa recommandation du Conseil du Nord-Ouest, dont on a tant parlé, était incluse dans les résolutions passées le 2 août, 1878. Ces résolutions étaient en réponse à une pétition, signée par 278 personnes qui demandaient qu'une section de terrain fut octroyée \"comme réserve spéciale, perpétuelle et inaliénable, sur laquelle ils auraient le droit de s'établir avec leurs familles, d'une manière permanente,\" ainsi que les employés du Gouvernement, en rapport avec leurs besoins et leur population, mais à l'exception des blancs qui devaient tous être exclus.\" L'étendue de cette réserve était de 150 sur 50 milles, le long de la frontière internationale, à l'ouest de l'emplacement traversé par la rivière Pembina. Ils demandaient le privilège de posséder cette réserve avec exemption de taxes soit pour\ntoujours, soit pour un terme assez long pour leur permettre de les payer sans désavan-\ntage à leurs familles. Ils demandaient aussi qu'on leur accorde des écoles, des instituteurs et des institutrices dont les dépenses seraient payées par le Gouverne-\nment, des églises et des prêtres de leur religion, et aussi des artisans tels que des forgerons, un menuisier, un cordonnier, etc., auxquels ils pouvaient recourir en cas de besoin, et qui pourraient leur enseigner ces métiers de la vie civilisée. La recomman-\ndation du Conseil, relativement à cette pétition, était comme suit :\n\n\"1. Il ne serait pas judicieux d'accorder des réserves de terrain aux métis du Nord-Ouest, ni de leur donner du scrip négo-\nciable.\n\n\"2. Prenant en considération, néanmoins, le fait que les octrois de terres ou les émissions de scrip ont été faits aux métis du Manitoba, dans le but d'encourager le titre des sauvages relativement aux terrains de cette Province, il y aura sans doute un mécontentement général parmi les métis des dits Territoires, à moins qu'ils ne reçoivent quelque compensation de même nature.\n\n\"3. La compensation la plus avantageuse aux métis serait de leur accorder un billet de location non trans-\nférable pour cent soixante acres à chaque chef de famille métis et à chaque enfant de parents métis rési-\ndants sur les dits Territoires, au moment de leur trans-\nfert au Canada, le billet devant être émis immédiate-\nment en faveur de chaque métis âgé de dix-huit ans ou plus, à condition qu'il fournisse la preuve de son droit à ce billet ; le même privilège serait accordé à chaque enfant lorsqu'il atteindra l'âge susdit et fournira la preuve nécessaire quant à son droit d'y participer.\n\n\"4. Chaque métis bénéficiaire de ces billets de location pourrait s'établir sur une de ces terres défrichées non-occupées, le titre de cette terre restant à la cou-\nronne, pour une période subséquente de dix années ; si, après trois ans d'inscription, le métis-locataire ne l'a pas améliorée, son droit à cette terre sera révocable.\n\n\"5. Des outils d'agriculture et des graines de semence devraient être accordées une seule fois à chaque famille qui s'établira, dans le cours de trois ans, afin de les encourager à résider sur leurs terres et à les culti-\nver en liaison avec les travaux des plaines et de s'ex-\npatrier ainsi à de grandes privations, d'autant plus que le basile est à la ville de disparition.\n\n\"6. Les métis qui ont reçu leur part de la distribu-\ntion des terres et du scrip dans le Manitoba, ne\ndevraient pas avoir le droit de recevoir des billets de location dans les territoires, quoiqu'ils y puissent rési-\nder maintenant.\"\n\nL'on voit donc, d'après ce qui précède que parmi toutes les autorités, pas une n'a recommandé d'accorder du scrip aux métis de la même manière que dans le Manitoba. La proposition de l'Archevêque, relative-\nment à une réserve, fut condamnée par les autres autorités mentionnées et toutes les recommandations tendaient à faire placer les métis sous la tutelle du Gouvernement, ce à quoi ce dernier ne pouvait guère con-\nsentir. Ce conflit des recommandations fut la cause réelle du délai. Malgré cela, le Gouvernement ne négligea pas son devoir. Par un ordre du Conseil daté le 7 de juin, 1883, Mr. Lindsay Russell, alors sous-\nministre de l'Intérieur, reçut l'ordre de faire une enquête rigoureuse relativement à tout ce qui regardait les établissements dans le Nord-Ouest, et de régler sur les lieux même, toutes les réclamations pendantes, de n'im-\nporte quelle nature, dans cette région, comprenant celles des métis. Mr. Russell avait des qualifications exceptionnelles pour une telle mission, parce qu'il connaissait le pays et beaucoup de métis qui l'habitaient, et pouvait parler en Français et en Cri. Malheureusement, avant de pouvoir partir pour remplir sa mission, il eut le malheur de se faire casser la jambe par accident, ce qui l'empêcha de remplir ses fonctions pendant plusieurs mois, et de fait, il n'a pu conti-\nnuer l'exercice de ses devoirs officiels depuis ce temps-là. Le Gouvernement désespérant de pouvoir faire concorder les opinions diverses à l'égard du règlement des réclamations des métis, résolut enfin de les traiter comme les métis du Manitoba, et le 28 janvier 1885, un Ordre du Conseil fut passé, nommant des commissaires qui devaient faire l'enquête nécessaire, dans le but d'accorder des terres ou du scrip (billets de location). La copie de cet Ordre du Conseil est comme suit :\n\n\"Copie certifiée d'un rapport d'un comité de l'hono-\nrable Conseil Privé, approuvé par Son Excellence le Gouverneur Général, en Conseil, le 28 janvier, 1885.\n\nLe ministre de l'Intérieur ayant soumis un memo-\nrandum par lequel il appert qu'il est désirable qu'il soit\nautorisé à obtenir l'enquête des métis et à em-\nployer trois personnes pour faire cette enquête, dans le but de régler équitablement les réclamations des métis dans le Manitoba et les Territoires du Nord-Ouest, qui auraient eu le droit d'avoir des terres s'ils avaient résidé dans le Manitoba dans le temps du trans-\nfert, et s'ils avaient présenté leurs réclamations suivant les dispositions de l'acte de Manitoba, et aussi dans le but de régler les réclamations des métis qui résident au Manitoba et avaient droit de participer à l'ordre de transfert, mais n'ont pas présenté leurs réclamations.\"\n\n\"Le comité a examiné la dite recommandation, et recommande que l'autorisation requise soit accordée.\"\n\n\"JOHN J. MCGEE,\n\n\"Greffier du Conseil Privé.\"\n\nLa nomination de cette commission fut annoncée immédiatement, et le Père André, en rendant témoignage pendant le procès à Regina, déclara sous serment que la nomination de la commission fut annoncée au peuple le 4 de mars, plus de deux semaines avant la bataille du lac aux Caïdards. Voici le témoignage, donné relativement à ce sujet :\n\n\"Q.—Voulez-vous dire si, depuis l'arrivée du prison-\nnier dans le pays, jusqu'au temps de la rébellion, le Gouvernement a donné une réponse favorable aux dé-\nmandes et aux réclamations des métis ?\n\n\"R.—Oui, je sais qu'il a acquiescé à certaines dé-\nmandes relativement à ceux qui n'avaient pas de scrip dans le Manitoba. Un télégramme fut transmis le 4 mars dernier, accordant le scrip.\n\n\"Q.—Avant ce temps là ?\n\n\"R.—Oui. Quant au changement de l'arpentage des lots le long de la rivière, il y eut une réponse du Gouvernement disant qu'il l'accorderait, et c'était une question importante.\n\n\"Q.—Quelle question restait alors à régler ?\nR.—Celle des patentées. Cette question a aussi été réglée en quelque sorte, car M. Duck fut envoyé, et je l'accompagnai en qualité d'interprète.\n\nQ.—Quelle autre question restait-il ?\n\nR.—La seule question du bois de chauffage et du bois de construction.\n\nQ.—La question quant au bois de chauffage et de construction, était relativement aux réglements ordinaires applicables à tous les colons, qui étaient obligés de payer certaines redevances pour le bois qu'ils prenaient sur les terres du Gouvernement, en surplus de ce qui suffisait à leurs besoins, dans l'intention de le vendre. Dans le cas des métis, la somme collectée, pour redevances sur le bois de chauffage, et sur le bois de construction n'excédait pas une moyenne de cinq cents par année, pour chaque colon ! Charles Nolin, dans son témoignage pendant le procès, après avoir donné le recit des réclamations de Riel pour un octroi d'argent par le Gouvernement Canadien, en sa faveur, dit ce qui suit à l'égard de l'action du Gouvernement ; le M. Macdonald qu'il nomme est le représentant du district de Saskatchewan, au Conseil du Nord-Ouest :\n\n\"Le jour suivant, je reçus de Macdonald une réponse à un télégramme ; le télégramme disait que le Gouvernement allait faire justice aux droits des métis, mais ne faisait aucune mention d'une indemnité à Riel.\"\n\nQ.—Avez-vous montré cette réponse à Riel ?\n\nR.—J'ai montré, le Dimanche suivant, la réponse que j'ai reçue.\n\nQ.—En quel mois était-ce ?\n\nR.—En février.\n\nQ.—Au commencement du mois ?\n\nR.—Oui.\n\nQ.—Que dit l'accusé ?\n\nR.—Il répondit que les Anglais voulais depuis 40 ans, qu'il était temps d'y mettre un terme, que cela avait duré assez longtemps.\n\nQ.—Y a-t-il eu, au commencement de mars, une assemblée à l'établissement de Halton ?\n\nR.—Oui.\n\nQ.—Étiez-vous présent quand il a organisé cette assemblée ?\n\nR.—L'assemblée n'a pas été organisée par lui exactement ; c'est moi qui l'avais organisée, mais l'accusé profita de l'occasion pour agir comme il a fait. L'assemblée avait été convoquée dans le but d'informer la population de la réponse que le Gouvernement avait faite à la pétition qu'elle lui avait adressée.\"\n\nC'est donc entièrement faux de dire, comme on l'a répété dans les journaux et les assemblées publiques, que le Gouvernement n'a rien fait avant que l'insurrection ait éclaté et que des vies aient été sacrifiées.\n\nRelativement à cette QUESTION DE SCRIP (BILLETS DE LOCATION), il est bon de noter que l'insurrection a éclaté et s'est bornée, en ce qui concerne les métis, dans les environs de Saint-Laurent et de Batiscan, sur la Saskatchewan sud. Comme question de fait, le titre indien de 92 pour cent des métis de ce district, était éteint au Manitoba ; par conséquent, ils n'avaient aucun droit à considération au sujet de ce titre. Mais trois pétitions furent envoyées de cette région particulière au gouvernement. L'une d'elles fut envoyée par Gabriel Dumont et 45 autres ; or parmi les signataires, 36 avaient obtenu leur scrip au Manitoba et n'avaient aucun droit à en recevoir dans les territoires. Une autre venait de colons établis dans la paroisse de Saint-Louis de Langevin, et était signée par 32 personnes, dont 24 avaient obtenu leur scrip au Manitoba. La troisième, venant de la paroisse de Saint-Laurent, était signée par 78 dont 60 avaient obtenu leur scrip au Manitoba. On voit donc que dans la région où la rébellion a éclaté, il n'existait aucun droit raisonnable à réclamer des scrips.\n\nLES COMPAGNIES DE COLONISATION.\n\nOn a accusé le gouvernement d'avoir précipité l'insurrection en concédant à la compagnie de colonisation de Prince-Albert les terres des colons de la paroisse de Saint-Louis de Langevin, sur la rivière Saskatchewan. Il est bien vrai que la compagnie de colonisation de Prince-Albert a demandé ces terres en échange de quelques-unes de celles qu'elle possédait déjà et que le gouvernement a consenti à cet échange, mais dans la convention passée avec le gouvernement, se trouvait l'article suivant qui protégeait amplement les colons :\n\n\"Si une partie des terres formant l'objet de la présente convention est occupée par une personne ou des personnes qui pourront s'y être établies, ces personnes ou ces personnes devront être indemnisées par la compagnie, à moins que ce ne soit avec le consentement par écrit du ministre de l'Intérieur ; et le ministre de l'Intérieur pourra, s'il juge à propos de le faire, de temps en temps, donner à la compagnie avis par écrit que les terres en la possession de ces personnes respectivement, et les terres voisines qu'il pourra juger convenables (mais n'excédant pas en tout 320 acres pour chaque colon séparément) sont soumises à l'ordre d'un mandat d'arrêt, et alors les dites terres seront retirées à la présente convention cessera d'avoir effet à cet égard.\"\n\nCependant, la compagnie n'a jamais accepté l'échange et elle n'est jamais entrée en possession des terres ; elle n'a jamais, non plus, dérangé un seul colon dans sa tenure. Comme question de fait, les colons ignoraient la correspondance qui avait lieu entre la compagnie de Prince-Albert et le gouvernement au sujet de l'échange des terres, comme en fait foi les déclarations faites sous serment par tous les colons. Ces déclarations ont été produites devant le parlement. Il suffira d'en donner ici quelques extraits. William Bremner déclare :—\n\"Je ne m'a jamais dit, et je ne pense pas non plus qu'on ait fait à mes fils et à mon gendre, car je l'aurais su, que nous ne pourrions pas obtenir une inscription pour la terre, ainsi que nous le désirions.\" Riel m'a dit une fois que probablement nous ne l'obtiendrions pas. Si nous avions été informés alors que nous avons donné la terre, et nous n'avons pas continué, comme nous l'avons fait, à l'améliorer.\n\nMagloire Boyer déclare :\n\n\"Je déclare positivement que personne ne m'a jamais dit que les colons de ce township ne pourraient obtenir l'inscription, ni que le gouvernement avait vendu les terres à une corporation.\"\n\nJonas Laviolette déclare :\n\n\"Je n'ai jamais entendu dire que le gouvernement eut vendu ou donné cette terre ou des terres de ce township à un particulier ou à une corporation. Je n'ai jamais entendu dire que des colons de ce voisinage eussent été informés qu'ils n'obtiendraient pas leur lot, et j'ai cru que définitivement, l'inscription serait accordée pour des lots d'10 chaînes donnant sur la rivière.\"\n\nElzey Swain déclare :\n\n\"Je n'ai jamais demandé l'inscription, et on ne m'a jamais dit que la terre appartenait à d'autres qu'au gouvernement. On ne m'a jamais dit que mon lot eut été vendu à un particulier, à une corporation ou à une compagnie de colonisation.\"\n\nElisabeth Richard déclare :\n\n\"Je ne me suis jamais adressée au bureau des terres pour avoir une inscription, ayant toujours pensé que nous l'obtiendrions si nous le voulions, mais je ne m'attendais pas à la recevoir sans la demander. J'ai toujours supposé que le gouvernement nous la donnerait quand nous ferions une demande à cet effet.\"\n\nWilliam Bruce déclare :\n\n\"On ne m'a jamais informé, et je n'ai jamais entendu dire que le gouvernement eût concédé cette terre à une personne ou à une corporation, et je n'ai jamais cru que nous n'obtiendrions pas l'inscription.\"\n\nJ. Baptiste Boyer déclare :\n\n\"Il devient dans le township 45 depuis 1882. Je parle en connaissance de cause, et je déclare positivement que personne ne m'a jamais dit que l'inscription ne pourrait être obtenue par les colons des townships 45-27, O. 2, pour les terres qu'ils réclament.\"\n\nAlexander Bremner déclare :\n\n\"Pour ma part, j'ai toujours pensé que j'aurais à traiter avec le gouvernement, et avec personne autre, et je crois que tous les autres colons pensaient pareillement ; le seul retard que nous prévoyions était dans l'obtention de l'inscription, comme nous le devions être de 10 chaînes, et non pas en quatre de sections, tels qu'arpentés avant que j'en eusse pris possession.\"\n\nAlade Légardé déclare :\n\n\"On ne m'a jamais dit que le gouvernement eût concédé une partie du township 45-27 O. 2me méridien, à une personne ou corporation et que par conséquent on n'aurait obtenu l'inscription ; je n'ai jamais, non plus, entendu une personne déclarer qu'on lui avait dit, et j'ai toujours pensé que l'inscription lui serait accordée en lots de dix chaînes.\"\n\nModeste Laviolette déclare :\n\n\"On ne m'a jamais dit que je ne pourrais obtenir inscription pour cette terre. D'autres personnes qui souhaitent avoir leurs terres en lots de dix chaînes en ont eu une aussi. On ne m'a jamais dit que le gouvernement eût vendu ou concédé cette terre à un particulier, une corporation ou une compagnie de colonisation, et j'ai toujours pensé que définitivement l'inscription serait donnée comme les autres colons de ce district le désiraient. Riel ne m'a jamais dit que je n'obtiendrais pas inscription pour cette terre telle que demandée.\"\n\nMarguerite Boyer déclare :\n\n\"On ne m'a jamais dit que mon mari n'obtiendrait pas l'inscription, ni moi-même depuis sa mort. J'ai toujours supposé que nous aurions cette terre en 10 chaînes sur la rivière. Si mon mari ou moi avions supposé que nous perdions cette terre, nous l'aurions abandonnée depuis longtemps et nous ne l'aurions pas améliorée.\"\n\nAlexandre Lamirande déclare :\n\n\"On ne m'a jamais dit que cette terre eut été vendue ou concédée par le gouvernement à un particulier, à une corporation ou compagnie de colonisation. Riel ne m'a jamais dit que l'inscription ne serait pas obtenue pour cette terre ou une partie de cette terre dans le township 45, rang 27, Orient du 2me méridien, et je n'ai jamais entendu aucune des colons du dit township dire qu'ils ne pourraient obtenir l'inscription pour ces terres.\"\n\nAlex. McDougall déclare :\n\n\"Je n'ai jamais été informé qu'une partie de ce township appartenait à une compagnie de colonisation, et à l'heure qu'il est, je n'ai jamais reçu d'avis à cet effet.\"\n\nPaul Grézaud, commerçant et ex-Frère, déclare :\n\n\"Les gens parmi lesquels je demeure sont tous métis. Je ne les ai jamais entendu se plaindre d'avoir été molestés en aucune façon ou d'avoir été privés de leur propriété avant l'insurrection. J'ai demandé ici plusieurs fois à des colons de dire s'ils avaient des colons, et je n'ai jamais appris que le gouvernement ou les spéculateurs leur fussent enlevé leurs terres ou leur eussent donné avis à cet effet. Je n'ai jamais entendu parler de pareille chose.\"\n\nUn Correspondant du Globe de Toronto a prétendu que ces déclarations sous serment avaient été obtenues à l'aide de menaces et que les gens qui les avaient faites ne les comprenaient pas. M. Duck, qui accompagnait M. Pearce lorsqu'elles furent prises, fait sur ce point la déclaration sous serment qui voici :\n\n\"Fai aussi les déclarations sous serment des Bouche, Swain, Feller et autres au sujet de cette affaire ; j'étais présent à l'exécution des différentes déclarations faites par eux ; je connais personnellement tous ces étrangers ; les dites déclarations leur ont été données en anglais, et même dans la langue qui leur est la plus familière. Ils les ont parfaitement comprises, et ils ont exécuté les dites déclarations sans y être poussés en aucune façon, mais librement et volontairement, et sans autorité ou peur de contrainte, de la part de personne.\"\n\nEt M. Marion, un métis fait aussi la déclaration solennelle suivante :\n\n\"Je, Louis Marion, cultivateur de la colonie de Lac-aux-Canards, dans la division électorale de Lac-aux-Canards, dans la province de Québec, déclare solennellement :\n\n\"Je suis né en Île-du-Français, et j'ai résidé continuellement au Lac-aux-Canards depuis 1879. Je puis parfaitement comprendre parfaitement l'anglais, le français, le cri et le sauteux. Au mois de décembre dernier, j'ai accompagné M. William Pearce dans sa visite aux établissements français de Batcote et de Saint-Louis de Langevin, ainsi que dans les environs, et, servant\nd'interprète, j'expliquai complètement aux colons, dans chaque cas, la signification des papiers qu'ils signaient pour eux ; ils ont compris ce que voulaient dire les papiers qu'ils signaient pour eux. Souvent j'expliquais les choses aux mêmes français en citant et en français, et je leur demandais s'ils étaient sûrs de bien comprendre les papiers. Ils signaient alors, sachant qu'ils y mettaient leur signature, et ils ont déclaré avant de signer aucune des déclarations, qu'ils les comprenaient et qu'ils voulaient des signes. Je n'ai jamais entendu aucun de ces colons se plaintre d'avoir été égarés dans leur tenue soit par le gouvernement ou par une personne autorisée par le gouvernement ou par aucune personne quelconque.\"\n\nCeci établit clairement que ceux qui ont fait ces déclarations sous serment, savaient parfaitement ce qu'ils disaient, et les ont faites sans être induits et sans recevoir des menaces.\n\nLA QUESTION DES PATENTES.\n\nOn a accusé le gouvernement, dans certains quartiers, d'être la cause de ce que les métis ne pouvaient point obtenir leurs patentées. À cette accusation, une lettre de M. Duck, qui a été produite devant le parlement durant la dernière session, est une réponse suffisante. Cette lettre était adressée à M. Pearce, membre de la commission des terres, et en voici des extraits :\n\n\"Après avoir reçu, au mois de mars 1864, vos instructions au sujet de l'étude de ces réclamations, je consultai le Révérend Père André, supérieur du district, pour savoir quel serait le temps le plus favorable où je pourrais faire l'enquête et obtenir les renseignements désirés. Il me dit que comme plusieurs des réclamants étaient alors absents, travaillant aux transports, je ferais mieux de remettre ma visite après Pâques, après qu'ils seraient tous revenus pour les semaines. C'est ce que je fis, et je partis pour Batoche au cours de la première. En route, j'arrêtai à Grand-Pré, je rencontrai le Père André, lequel me dit qu'il m'attendait pour m'informer que les habitants avaient tenu une série d'assemblées dans tout l'établissement et qu'ils avaient décidé, entre autres choses, de ne pas faire de demandes d'inscriptions, pour leurs terres au bureau d'État. Après consultation avec lui, je crus devoir mériter de ses services pour expliquer clairement aux habitants les raisons de ma mission et pour leur démontrer la futilité de leur résolution. Je fis ensuite un voyage à Batoche, et dans une réunion qui eut lieu chez Emmanuel Champagne, il leur expliqua au long l'objet de ma visite, et leur conseilla de produire des déclarations assermentées au soutien de leurs réclamations.\"\n\n\"Dès l'année 1862, on me fit rapport que certaines personnes intéressées avaient conseillé à ces gens, même à ceux qui s'étaient établis et réclamaient leurs terres conformément au système d'arpentage alors en vigueur, de ne pas faire de demandes de leurs terres, cela pour une raison que j'ignore. À moins que ce ne fût pour forcer le gouvernement à adopter un autre système d'arpentage sur les bords de la rivière. D'après la liste qui a été préparée, vous verrez combien les colons établis sur la rivière étaient alors peu nombreux ; ils n'étaient que 42 en tout, et sur ce nombre, 22 auraient pu obtenir une inscription s'ils l'avaient voulu.\"\n\n\"Conformément aux instructions que vous avez envoyées en août 1863 à M. Gauvreau, l'agent adjoint, ce dernier visita les différentes parties des districts habités par les personnes mentionnées dans les listes 1, 2 et 3 et leur expliqua clairement les clauses de l'acte des terres qui avaient trait à leurs réclamations. Il m'informa, à son retour, que la principale réponse que lui avaient faite les gens qu'il avait visités, c'était qu'ils étaient pauvres et ne possédaient pas l'argent pour faire l'inscription. A part cela aucune plainte d'aucune nature.\"\n\n\"On voit donc qu'en l'absence de toute émission des lettres-patentes, le gouvernement a pris tous les moyens possibles pour engager les colons à faire l'inscription de leurs terres, condition qui doit être remplie avant que les lettres patentes puissent être accordées. En réalité, tout ce qui s'est passé, démontre que ces métis, qui n'étaient après tout que des colons venus du Manitoba, et qui, en cette qualité, n'avaient pas droit à plus de considération que les autres colons, au dire de M. David Mills, ont été beaucoup mieux traités que les autres par le gouvernement qui n'a rien négligé pour les aider dans leurs travaux de colonisation.\n\nL'on doit bien se rappeler que Louis Riel n'a pas prêché la revolte aux métis pour les réclamations contenues dans leurs pétitions, qui sont maintenant au domaine de la discussion publique. Riel, après son arrivée dans le pays, afficha des prétentions beaucoup plus grandes. Les métis n'envoyèrent au gouvernement aucune résolution ou document d'aucune sorte, après l'arrivée de Louis Riel. Tout ce qui a été reçu fut un brouillon de pétition, envoyé par M. Jackson, le secrétaire de Riel, avec l'avis que les métis étaient à signer cette pétition qui devait être ensuite transmise au Secrétaire d'État. Ce brouillon de pétition, sans l'allégé qui réclamait pour les enfants des métis les 240 acres de terre, comme pour ceux du Manitoba, ne traitait entièrement que de questions de politique publique. Elle parlait par exemple du prix des prémices, de la méthode de disposer des homesteads annulés, de la politique de demander des droits sur le bois de construction, les perches et le bois de chauffage, des droits de douane perçus en vertu de la politique nationale ; de la question de permettre de labourer et cultiver les terres prémises au lieu des homesteads, de l'opportunité de compter aux acheteurs des lots de squatters le temps pendant lequel ces derniers avaient occupé ces terres, de la méthode de donner les entreprises des travaux publics et de fournir l'approvisionnement dans le Nord-Ouest, des emplacements des édifices publics, de l'importance du chemin de fer de la baie d'Hudson, du système du vote par scrutin qui n'y existait pas, du système des licences pour la vente de liqueurs enivrantes, de ce que le gouvernement avait fait en 1870 pour les délégués du Manitoba, de la nécessité d'établir\nun gouvernement responsable dans les territoires ainsi que de la représentation de ces territoires dans le parlement du Canada, bref, d’un certain nombre d’autres questions qui ne peuvent certainement pas être considérées en aucune manière comme réclamations ou droits, mais simplement des questions de politique publique. Fait significatif c’est que la question des arpentages, au sujet de laquelle on a fait tant de bruit, n’était pas même mentionnée dans ce brouillon de pétition. À part ce brouillon de pétition le gouvernement n’a reçu aucun document d’aucune sorte; il n’a pas même reçu la pétition originale si jamais elle a été signée. Louis Riel apprit évidemment qu’il devait adopter d’autres moyens pour provoquer des troubles. Connaissant bien le caractère supersticien de la population, il entreprit en conséquence de créer une nouvelle religion. Dans un sermon prononcé à l’église de Saint-Roch, Québec, dans le cours de l’été dernier, l’évêque Grandin décrivait ainsi les agissements des chefs de la rébellion :\n\n\"Afin de parvenir plus sûrement à leur fin et d’empêcher les métis de se laisser influencer par les missionnaires qui les auraient détournés de leur projet sinistre, les chefs de la rébellion emprisonnèrent quatre prêtres, six religieuses et quelques sœurs laïques, placèrent des sentinelles à la porte de leur prison pour empêcher tout moyen de communication entre les métis et les missionnaires. Nous avons eu l’occasion de leur dire : 'Vous ne gagnez rien par là, au contraire vous avez tout à perdre. Si vous tuez un soldat, ce dernier sera remplacé par mille autres. Vous avez à combattre un gouvernement puissant, vous qui n’êtes qu’une poignée d’hommes et ne pouvez remplacer vos morts.' Toutefois, les chefs se conduisirent de façon à faire mépriser nos avertissements et conseils et la rébellion eut lieu avec toutes ses terribles conséquences.\"\n\nLe document suivant contenant la signature de tous les prêtres du district témoigne également de la conduite que Riel a cru devoir tenir pour s’attacher les métis :\n\n\"PRINCE-ALBERT, 13 Juin 1886.\n\n\"Nous avons signé prêtres du district qui se sont particulièrement soumis à soutenir la rébellion, savoir : des paroisses de Saint-Laurent, Saint-Antoine, Grandin, de Lac aux Canards et Batoche—c’est-à-dire au milieu de notre population où Louis \"David\". Riel avait établi son quartier général, nous désirons attirer l’attention de nos compatriotes du Canada sur les faits suivants :\n\n\"Louis \"David\" Riel ne mérite pas les sympathies de l’Église catholique romaine ou des membres de cette Église, parce qu’il a usurpé notre mission de prêtres et infligé à notre peuple les avantages et consolations qu’il est de notre devoir de lui procurer. Il a fait toutes ces choses pour son intérêt purement personnel.\n\n(Signé) \"Père André,\n\n\"TOURS,\n\n\"MARCEL,\n\n\"THÉRÈSE,\n\n\"LACOQ,\n\n\"FOURMONT,\n\n\"Cure de Batoche.\"\n\nSuivant de nouvelles citations dont on s’est servi dans la Chambre des Communes, au cours du débat sur la motion de M. Landry pour censurer le gouvernement d’avoir laissé pendre Riel.\n\nL’évêque Grandin dit :\n\n\"Je ne peux pas être le seul à avoir étudié ce mouvement, je sais fort bien qu’un mécréant qui a abusé de son pouvoir et s’est paré d’une piété mensongère et hypocrite, en même temps qu’il faisait des menaces et des menaces infructueuses, a trompé les métis et les a obligés à prendre les armes contre l’État. Lorsqu’il exerçait sur eux était tel que, pour le plus grand nombre d’entre eux, ils ne pouvaient pas ou n’osaient pas lui résister.\"\n\nLe père Fourmont dit dans son témoignage :\n\n\"Louis \"David\" Riel, dans son étrange et alarmante folie, fascinait nos pauvres métis comme la serpente fascine ses victimes. Il abusait, pour ses propres fins, de la grande confiance que tous les métis reposeaient en lui, confiance obtenue par l’influence qu’il exerçait sur leur esprit, grâce à son éloquence passionnée et sur-dépassée, à l’apparence de ses sentiments profondément religieux, et de sa dévotion dont il faisait constamment parade de la manière la plus hypocrite possible. Il les avait convaincus par des proclama-\n\ntions publiques de sa mission de prophète inspiré, et il leur faisait croire à cette mission en se servant des moyens les plus insidieux et les plus diaboliques. Pour protéger l’esprit de la population et la tenir sous son pouvoir, Riel eut recours à toutes sortes de superstitions.\"\n\nLe père Fourmont ajoute :\n\n\"Or mon pauvre peuple, je ne pouvais le contenir; il était infatigé de cet archi-traitre et fouillé jusqu’à ce qu’il eût répandu le sang. Il fut alors tout à fait en son pouvoir et il se servit de son autorité sans aucun sentiment de miséricorde.\"\n\nJe déclare de plus que, pendant les troubles, j’ai conversé avec plusieurs de ceux qui se trouvaient dans le camp rebelle, et j’ai constaté que, pour le plus grand nombre, ils étaient contre leur gré et n’y demeuraient que par la crainte d’être fusillés, s’ils s’échappaient ou désertent.\"\n\nDans son témoignage, dans la cause de Joseph Arcand, le père André dit :\n\n\"Il déclare de la manière la plus solennelle, qu’à ma connaissance personnelle, sauf Gabriel Dumont, Napoléon Levasseur et l’abbé Carrière, maintenant déclaré, pas un seul des métis n’avait la moindre idée ou le moindre soupçon d’une rébellion, jusqu’à ce que Riel les eût complètement pris dans ses filets et les eût totalement compromis, qu’ils ne pouvaient plus s’échapper.\n\n\"Ils leur fit croire fermement qu’ils n’avaient plus à attendre de miséricorde de la police ou du gouvernement du Canada,—que s’ils étaient faits prisonniers ou blessés, rien que la mort et des tortures impitoyables les attendaient, que leurs filles et leurs enfants seraient déshonorées sous leurs yeux, leurs enfants massacrés et tout ce qu’ils possédaient-là-bas détruit, et que toute leur nation serait exterminée par la soldatesque brutale.\"\n\nVoici ce que dit Joseph Pilon :\n\n\"Riel me commanda de venir au camp, en qu’il me forceait de m’y rendre. Pilon, pendant que Riel le menaçait, vint trouver le prêtre et lui dit en plaisantant ce que Riel lui demandait. Riel, l’obligea de force et au moyen de menaces contre sa vie, d’exécuter ses dessins.\"\n\nLe Père André fait allusion en la\nmanière suivante, au cas des frères Tou-\nrond :\n\n\"Le russe Riel chercha de toute manière à engager ces jeunes gens à le joindre, mais sans réussir. Jour par jour, il se rendit auprès de leur père pour leur parler de sa situation et de la situation avec une ruse diabolique. Il lui raconta ses visions célestes, etc., et la pauvre femme ayant foi dans sa mission divine, prit ses enfants de s'en-\nrôler et de combattre sous la bannière du ciel.\"\n\nParlant des prisonniers en général, il dit :\n\n\"Ils ont été trompés par un homme qui connaissait parfaitement que leurs cœurs et leurs esprits étaient faibles. Ils ont été appelés aux armes, au nom de Dieu et des Saints, par un homme qui se disait l'envoyé de Dieu pour accomplir une bonne et grande œuvre. Ils ont été avoués par de prétendues visions et messa-\nges de l'Esprit-Saint; pauvres gens, dans leur absolue confiance, ils ont été conduits à la désolation, la misère et la mort.\"\n\nAyant fondé une nouvelle religion, Riel institua une cérémonie à l'église de Batoche qui devait consister dans le baptême de son secrétaire Jackson à la foi nouvelle. Il envoya des éclaireurs pour amener les métis à cette cérémonie, les engageant à apporter leurs fusils, pour tirer une salve, et comme on le verrait par les déclarations assermentées, il eut beaucoup de difficulté, dans certains cas, à les engager à s'y ren-\ndre. Lorsque les métis furent arrivés à Batoche, Riel leur dit que le gouvernement envoyait des troupes pour les tuer, leur enlever leurs propriétés et détruire leurs familles, et ces menaces eurent pour résul-\ntat d'amener le combat du Lac-aux-Canards, qui compromit ses dupes infortunées, et de causer les tristes événements qui s'en sui-\nvirent. Ces faits découlent du témoignage assermenté d'un certain nombre de ces gens eux-mêmes. Il suffira de citer quelques-\nunes des déclarations assermentées qui suivent:\n\nJean Baptiste Laplante, cultivateur, jure:\n\n\"J'étais en voyage, quand la rébellion a éclaté à Troy, avec des marchandises pour des marchands de Batoche appelés Walters & Baker. Je n'ai pas été ailleurs; après avoir livré mes marchandises, je suis retourné chez moi. Je suis resté chez moi un seul jour et un homme nommé J.B. Deschamps est venu me chercher. Deschamps avait un fusil et il dit qu'il me prendrait par force si je ne voulais pas venir, et nous prendrons tout ce que vous avez. Ils étaient deux, tous deux armés. Ils m'ont emmené avec eux, mais je n'avais pas de fusil. Ils m'ont emmené à Batoche et m'ont dit qu'il fallait que je serve comme les autres. * * * Riel nous dit que nos familles seraient tuées par les troupes et qu'il fallait toutes les réunir.\n\nGabriel Parenteau, cultivateur, jure:\n\n\"J'étais ici pour acheter des marchandises et j'y suis resté deux jours; quand je suis revenu, j'ai appris qu'on avait déposillé les magasins et que c'était blott, par partis à Batoche. Quand je suis allé à l'église le dimanche, j'ai été fait prisonnier (dans l'église de Saint Laurent) par Philippe Guardoupi et un autre, je ne sais pas son nom.\" Ils m'ont dit qu'ils allaient me fouiller ou m'enfermer si je n'allais pas. Ils m'ont fait passer la rivière et m'ont mis dans une maison et m'ont gardé deux jours. Le troisième jour je me suis échappé et suis allé chez moi. Environ trois jours après, il sont venus me chercher; Gabriel Dumont est venu me chercher et me dit que si je ne voulais pas venir, ils m'attacheraient, me menaçaient dans la rue et m'entraîneraient tous les deux. Je leur ai dit qu'ils ne devaient pas me prendre, mais ils m'ont forcé à aller avec eux; et après quatre jours, je me suis encore enfui chez moi et suis resté là cinq jours avec mes chevaux dans la prairie; je ne venais à la maison qu'à la nuit. John Ross, le jeune, est en-\ncore venu me chercher et nous a tous emmenés—nos familles, femmes et enfants—et nous a gardés, la longue temps jusqu'à ce qu'elles fussent peur d'essayer de me sauver.\"\n\nJean Carroo, cultivateur, jure:\n\n\"J'étais à Batoche pendant la rébellion et j'ai pris part avec les rebelles dans la rébellion. Je n'étais pas un conseiller. Je suis entré à venir au baptême de Jackson et a apporté mon fusil de peur que nous y fussions arrêtés par la police. Je n'avais pas alors de fusil et j'ai été vingt jours sans en avoir un. Je n'ai pas été forcé à marcher, mais j'ai été trompé par Riel lui-même. Je lui ai dit que j'avais beaucoup d'ouvrage, mais il m'a demandé d'assister à la rébe-\nllion et ainsi j'ai été entraîné dans la Rébellion. Quand je suis à l'église de Saint-Antoine, Riel nous dit qu'il y avait cinq cents hommes de la police qui venaient nous combattre, que Clark, de la compagnie le lui avait dit; il avait alors autour de lui tous les hommes de Batoche et Riel a dit cela devant tout le monde.\"\n\nLouis Marion, cultivateur, jure:\n\n\"Je sais que M. Ness a été fait prisonnier par les rebelles. Quand j'ai été pris, j'ai été mis dans la même chambre que lui et il était encore prisonnier quand j'ai été mis en liberté. M. Ness était un cultivateur et il avait des vaches et des chevaux et des animaux. Il a été les amis des rebelles. Dans l'église où on nous a mis, dire qu'ils traînaient Ness, et prenaient son fusil et toute autre chose qu'il leur serait utile. Le 17 mars, j'étais au magasin de Walter à Batoche, et il est entré un jeune homme qui nous a dit qu'il allait y avoir du trouble. Le lendemain matin nous étions transportés à l'église et il tint une assemblée, et Riel me dit que j'avais dix minutes pour me joindre à eux, mais à la première occasion, je m'échappai. Une fois, Riel avait pro-\nnoncé une sentence contre Charles Nolin et William Boyer parce qu'ils ne s'étaient pas joints à eux. Ensuite il demanda aux gens qu'est-ce qu'ils pensaient de ce qu'il avait fait en condamnant ces hommes, et tout le monde l'approva en faisant un grand bruit. Il a été fait prisonnier par les rebelles, et les rebelles qu'il avait fait, quand il m'avait vu, et il dit alors Dieu vous soit en aide. J'ai ri de lui quand il dit: il n'est pas encore trop tard; et se tournant vers le peuple il dit qu'il m'avait oublié, mais qu'il me donnerait dix minutes pour réfléchir à ma position. Cette même nuit, ils sont allés au magasin de Batoche et en ont tiré des ballots de couvertures et de hardes et les ont distribués à ceux qui partaient pour aller prendre des provisions. Le lendemain, le colonel commandant Provosture s'organisa et tint là ses séances. Riel nommait les membres au peuple et si le peuple approuvait, celui qui était nommé entrait dans le Conseil. Je crois qu'il se joignit à lui, seize capitaines qui étaient nommés par Riel et dix par la foule qui était dans l'église. J'ai entendu Riel dire : est-ce que la vie de nos marchands de cette localité vaut plus que la nôtre ? nous allons aller, et les rebelles ont dit : oui, nous irons. Un homme Fisher et un fils de Salomon Vienne et un jeune Garant qui furent amenés de cette manière. J'ai vu la plupart des sauvages, quelques-uns étaient de la bande de Ude...\"\nFlèche, quelques-uns de celui du Barbu et quelques-uns, sauvages Sioux. J'ai entendu dire que plusieurs avaient été forcés de se joindre à eux; les gens en ont eu peur. Riel a fait des menaces pour intimider les gens et en avoir plus de son côté; on ne pouvait pas s'opposer à lui et à ses principaux hommes. Ses menaces contre nous, ont réussi à faire rester son monde ensemble.\n\nNorbert Turcotte, cultivateur, jure:\n\n\"J'étais à Batoche pendant la Rébellion. J'ai été invité avec les autres au baptême de Jackson, et après cela, nous avons traversé la rivière et ils nous ont voulu me laisser revenir. Je ne suis pas resté tout le temps. On m'a mené au Lac aux Canards, mais je n'ai pas pu être battu et je suis descendu. Je ne peux pas dire combien de temps j'ai été là. Je suis retourné chez moi environ une semaine; ensuite deux hommes armés sont venus me chercher et m'ont ramené à Batoche où je suis resté tous le temps. J'étais là quand les magasins de Ratoche, ceux de Boyer et de Fisher ont été pillés et les marchandises distribuées ainsi que celles du magasin de Venne; à ce moment-là, il y avait environ deux cents hommes armés qui ont commencé à nous prêter un pilage. On m'en a offert, mais j'ai refusé. Je n'ai pris part à aucune des batailles. Ils avaient des gardes à différents endroits et ils avaient passé une loi que si quelqu'un désertait, il serait fusillé.\"\n\nPierre Tourond, cultivateur, jure:\n\n\"J'étais présent à Batoche avec les rebelles, j'ai été obligé de marcher par Riel, et j'étais présent à la bataille de l'Anse aux poissons sous les armes et j'ai été blessé. Ma mère nous a dit plusieurs fois de ne pas marcher, mais Riel nous a dit tant de menaces que nous avons décidé de marcher et de nous battre, et nous avons trouvé beaucoup de nourriture. Nous avons marché à partir du lac, quand nous avons fait dire de venir au baptême de Jackson et d'apporter nos fusils pour saluer la cérémonie, chaque fois que l'un de nous essayait de retourner chez lui, ils nous arrêtaient et nous disaient que si nous partions, nos animaux et nos effets seraient pris, et que si nous étions repris, nous serions fusillés.\"\n\nMaxime Lépine, cultivateur, jure:\n\nQuand Riel vient, le soir de mon arrivée, chez moi, il me dit que deux cents hommes de la police viennent pour nous exterminer nous et nos familles, qu'il avait convoqué tout le monde pour voir le baptême de Jackson et que les cinq cents hommes de la police venaient aussi pour empêcher la cérémonie. Riel par la manière dont il s'était conduit depuis quelques mois, avait amené les gens à croire que tout ce qu'il disait devait arriver. Il avait tant d'influence sur les gens que tous les gens qui étaient là, même ceux qui étaient amis de Riel, ont été obligés de se joindre à lui. Après que toute la bataille fut finie, les Métis, et moi, pour un, avons vu que tout ce que Riel nous avait dit était une mensonge, nous avons été insultés et humiliés. Après cela, je me suis informé des cinq cents hommes que Riel avait dit devaient venir et j'ai trouvé que ce n'était pas vrai et que personne ne venait comme il l'avait dit et nous avons vu qu'il nous avait trompés et nous avons été attirés dans un piège. C'est là la seule raison que nous avons de prendre les armes contre le gouvernement. Nous avons été obligés de nous défendre, comme je l'ai dit, de protéger nos femmes et nos enfants contre les outrages, et Riel nous a toujours dit là, que quand nous avons pris les armes, nous l'avons fait, non contre le gouvernement, mais contre la police. Riel disait que les outrages étaient que nous devions être massacrés avec nos familles et notre race exterminée, et je ne suis pas capable de dire la moitié des menhonges qu'il nous a faites.\"\n\nPierre Paranteau, cultivateur, jure:\n\n\"Ils m'ont dit—Riel m'a dit—que les soldats venaient pour tuer nos familles, et quand j'arrive à l'église, elle était pleine. Riel nous a trompés. Riel a dit aux gens que les soldats venaient pour nous détruire, et c'est pour cette raison que nous nous sommes battus; je ne connais pas d'autres raisons. Je suis sous serment, et je sais ce que je dis: nous ne nous sommes battus que pour sauver nos vies et les vies de nos familles, comme Riel nous l'avait dit. Charles Nolin s'est battu pour la nation quand la bataille a commencé; avant cela il était un des chefs. Si nous n'avions pas été trompés comme nous l'avons été, nos hommes n'auraient pas du tout pris les armes.\"\n\nOn verra que ces déclarations assermentées des principaux métis donnent une histoire de la rébellion et de ses causes, bien différente des romans débités sur les estrades de l'opposition et dans la presse de l'opposition, d'un bout à l'autre de la Puisance.\n\nCes déclarations pourraient être multipliées à l'infini; mais les extraits que nous en donnons servent à démontrer les moyens dont Riel s'est servi pour faire tomber dans le piège ses partisans, simples d'esprit, et leur faire commettre des actes de rébellion ouverte.\n\nCe qui peut être la réponse la plus complète aux prétendues causes de la rébellion, telles qu'exposées dans les journaux de l'opposition et dans les discours des orateurs de l'opposition, se trouve dans le rapport de M. Pearce, mis devant le parlement, à sa dernière session, et dans lequel ce monsieur prouve que des 258 colons lors de l'élection de la rébellion dans les districts qui en ont été troublés, 238 n'avaient aucun droit à des scrips, attendu que leurs titres avaient été éteints avant leur départ du Manitoba. M. Pearce fait rapport comme suit:\n\nPrince-Albert, T.N.O., 14 Déc. 1885.\n\nL'Hon. Thomas White, Ministre de l'Intérieur, à Ottawa, Ont.:\n\nMonsieur—S'adressant les instructions que j'ai reçues de vous, lors de votre dernière visite au Nord-Ouest, que je dois, pendant ma présente visite dans ce district, rassembler toutes les informations possibles sur les prétendues causes du malheureux soulèvement qui vient d'éclore au Nord-Ouest, j'ai l'honneur de vous faire rapport comme suit:\n\nLes six causes, prétendues telles, sont les suivantes:\n\n1. Que les colons métis n'ont point reçu de titres pour leurs terres, par suite de délais dans la faute incombe au seul gouvernement, et qu'il est impossible de faire inscrire des entrées pour les terres sur lesquelles ils étaient établis.\n\n2. Qu'en conséquence du système d'arpentage, il a été impossible à ces colons de se faire donner les terres sur lesquelles ils s'étaient établis et qu'ils avaient améliorées avant l'arpentage.\n\n3. Qu'ils avaient droit à obtenir le même privilège que celui qui avait été accordé aux métis du Manitoba.\n4. Que les terres sur lesquelles ils résidaient depuis des années, avaient malgré leurs droits été vendues à d'autres, principalement à des spéculateurs.\n\n5. Que la taxe sur la coupe du bois leur avait été très-onéreuse et avait été une cause grave de mécontentement, et\n\n6. Que la taxe pour la coupe du foin sur les terres du gouvernement était aussi onéreuse et une cause de grand mécontentement.\n\nAprès avoir donné des détails complets sur ses recherches et leur résultat, M. Pearce résume et conclut, comme suit, son rapport :\n\n1. Ce rapport démontre que de tous les 258 colons au moment du soulèvement, pas un seul n'avait été obligé d'abandonner sa terre par suite de l'action ou plutôt de l'inaction du gouvernement, et même en Mars 1884, il n'y avait qu'un cas en retard, et ce retard résultait d'une différence entre la tarification de la Réserve de Une Flèche et celui de la paroisse de Saint-Laurent ;\n\n2. Que pas un homme de ces 258, ni personne autre ayant jamais résidé dans le district, n'a perdu un seul pouce de territoire par suite du système d'arpentage, lorsque cet arpentage a été fait après que le colon se fut établi sur sa terre ;\n\n3. Que 92 par cent de ces 258 n'avaient pas de droits comme métis du Nord-Ouest. Sur les 22 par cent, ceux qui étaient métis, avaient participé à tous les droits accordés à ces personnes dans la Province du Manitoba ;\n\n4. Que pas un colon dans le district, n'a vu vendre, en dehors de ses droits, un acre de terre sur lequel il était un titre ou même sur lequel il en réclamait ;\n\n5. Que la taxe sur la coupe du bois n'était pas onéreuse, vu qu'elle ne s'élevait qu'à 5 cents par colon, par année ;\n\n6. Que la taxe sur la coupe du foin ne les a jamais affectés, fut-ce au plus minime degré.\n\nCe qui fut le motif réel du chef de la rébellion, peut s'apprendre au témoignage suivant du Père André, donné au cours du procès de Riel. Il nous fait voir cet homme que les Rouges de Québec nous représentent comme un héros-martyre, et les Grits d'Ontario, comme un malheureux qu'on n'a pu laisser pendre qu'en commettant un crime ; il nous le fait voir comme un aventurier mercenaire, essayant de faire chanter le gouvernement.\n\nQ. Je crois qu'au mois de décembre 1884, vous avez eu une entrevue avec Riel et Nolin au sujet d'une certaine somme que l'accusé réclamait du gouvernement ? R. Non, pas avec Nolin. Nolin n'était pas présent à l'entrevue.\n\nQ. L'accusé y était ? R. Oui.\n\nQ. Voulez-vous déclarer ce que l'accusé voulait avoir du gouvernement fédéral ? R. J'ai eu deux entrevues avec l'accusé à ce sujet.\n\nQ. L'accusé réclamait une certaine indemnité du gouvernement fédéral ? R. Lorsque l'accusé fit sa réclamation, j'étais là avec une autre personne et il voulait avoir $100,000 du gouvernement. Nous fûmes d'accord que cette demande était exorbitante et l'accusé répondit : \"Attendez un peu ; je prendrai tout de suite $35,000 comptant.\"\n\nQ. Et à cette condition, l'accusé devait quitter le pays, si le gouvernement lui donnait $35,000. R. Oui, c'est la condition que Riel mit.\n\nQ. Quand ceci se passait-il ? R. Le 23 Décembre 1884.\n\nQ. Il y eut une autre entrevue entre vous et l'accusé, n'est-ce pas ? R. Nous étions une vingtaine d'entrevues.\n\nQ. N'était-il pas toujours à vous demander de vous servir de votre influence auprès du gouvernement pour lui obtenir une indemnité ? R. Il m'a parlé de cette affaire pour la première fois le 12 Décembre. Il n'en avait jamais été question entre nous avant cela, et le 23 Décembre, il m'en parla de nouveau.\n\nQ. Il en a parlé souvent ? R. En deux occasions seulement.\n\nQ. N'était-ce pas sa grande préoccupation ? R. Oui dans ces deux entrevues.\n\nQ. N'est-il pas vrai que l'accusé vous a déclaré qu'il était lui-même la question métisse. R. Ce n'est pas ce qu'il a dit en propres termes, mais c'était bien la pensée qui ressortait de ses paroles. Il m'a dit : \"Si vous êtes satisfait, je serais content.\" Il m'a dit encore : \"Quand on lui objecte qui est le gouvernement qui accorderait $35,000, la question métisse restorait toujours la même et il répondit : \"Si je suis satisfait, les métis le seront.\"\n\nQ. N'est-il pas vrai qu'il vous a dit qu'il accepterait même une somme moindre que $35,000 ? R. Oui, il m'a dit : \"Faites valoir toute l'influence que vous pouvez avoir ; il se peut que vous n'obtenez pas tout cela, mais obtenez tout ce qu'il est possible d'avoir ; si vous obtenez moins, nous verrons.\"\n\nEt cependant, voilà l'homme qu'on loue d'un bout à l'autre de la Province de Québec comme un héros-martyre, dont le nom est devenu un facteur important dans la politique de la Puissance et à cause de son exécution, M. Blake et son parti espèrent arriver à cheval jusqu'au pouvoir !\n\nLes faits que nous énonçons dans ces pages, font voir que, bien loin qu'il y ait eu de justification pour la Rébellion, il n'existait rien qu'il put servir à en atténuer la criminalité.\n\nCe fut un soulèvement sans excuse, provoqué pour le plus vil des motifs, l'appât d'un gain pécuniaire, par un homme qui a justement expié ses crimes sur l'échafaud. Et l'on peut s'en rapporter au bon sens et à la loyauté du peuple du Canada pour espérer que le gouvernement n'aura pas à souffrir, parce qu'il a suivi le projet qui lui était tracé, lorsqu'il a permis à la loi de suivre son cours.\n\nEn résumé, les faits qui se rapportent à l'administration des affaires du Nord-Ouest, sont les suivants :\n\n1. Dès 1873, on a envoyé des requêtes dont il n'a pas été tenu compte pendant les cinq années de l'administration libérale.\n\n2. En 1876, M. Mills télégraphia à M. Ryan de s'enquérir des réclamations des métis, mais il lui refusa péremptoirement de prendre les moyens de donner aucune valeur à cette enquête.\n\n3. En 1878, rien n'ayant été fait dans l'intervalle, M. Mills refusa d'étendre la commission de M. Ryan, disant que la\nchose était sous sa considération et que probablement il chargerait l'agent local pour le district de la Saskatchewan, de faire l'enquête.\n\n4. Pendant le terme d'office de M. Mills, des requêtes furent envoyées par Monseigneur Grandin et d'autres, demandant de l'aide sous différentes formes pour les colons métis; elles furent toutes rejetées.\n\n5. Après que le gouvernement actuel fut venu au pouvoir, des requêtes furent envoyées demandant pour les colons, établis avant les arpentages, (a) qu'ils pussent obtenir leurs terres aux prix qui étaient fixés lorsqu'ils s'y établirent; (b) que l'on tienne compte de leur labour et des améliorations exécutées avant l'arpentage, lorsqu'on étudierait leurs droits à une patente; (c) que l'on confirmât leur occupation même si l'on découvrait, après l'arpentage, qu'ils se fussent fixés sur des sections impaires ou sur des terres des écoles, ou sur des terrains de la Compagnie de la Baie d'Hudson. Chacune de ces demandes fut promptement accordée en 1881 et 1882.\n\n6. Quand les colons qui s'étaient établis avant l'arpentage des terres, ont demandé que leurs terres fussent arpentées de manière à leur donner la rivière comme front, ces demandes furent accordées et les arpenteurs reçurent leurs instructions en conséquence. Quand les personnes qui s'étaient établies après le tracé, demandèrent un nouvel arpentage, cela fut avec justice refusé, mais dans ce cas on offrit aux colons de leur accorder leurs terres par subdivision reconnaissables en loi, ce qui, en pratique, leur accordait la rivière comme front, et l'agent des terres fut envoyé pour les en informer et les presser de faire faire leur entrées.\n\n7. Quant à la question des billets de location (scrips) toutes les principales autorités du Nord-Ouest:—l'archevêque Taché, les évêques de la terre de Rupert et de la Saskatchewan, et le conseil du Nord-Ouest, ont été d'avis que les scrips ne fussent pas accordés. Mais finalement, le 28 janvier, deux mois avant que n'éclatait le soulèvement, le gouvernement céda aux prières des métis eux-mêmes et, par ordre en conseil, autorisa la nomination d'une commission chargée de faire l'énumération demandée, afin de faire émaner les scrips.\n\n8. Aucun métis ne fut jamais, par l'action, ni par l'inaction du gouvernement, privé d'un acre de terre sur lequel il fut établi; ou auquel il eût un titre même présumable en vertu de son établissement.\nANNEXE.\n\nALLÉGUÉS DE M. LAURIER DANS ONTARIO.\n\nDepuis que les pages précédentes ont été écrites, l'honorable M. Laurier a visité Ontario et a porté la parole dans un certain nombre d'assemblées. Au défi de nommer un seul métis qui ait jamais été dépouillé d'un acre de terre sur lequel il se fut établi ou qu'il ait réclamer en vertu de son établissement, l'honorable M. a répondu en citant deux cas : le premier étant une difficulté entre le Père André et un M. Kelly, et le second, le cas d'un M. Salter qui a fait une entrée pour un quart de section de terre dans la paroisse de Saint-Louis de Langevin. À l'appui du premier, il a dit qu'il y avait une lettre du Père André se plaignant qu'un nommé Kelly s'était emparé de son lot et y avait érigé une bâtisse. Il se trouve que M. Kelly réside, dans le moment, dans Ontario, et en voyant l'énoncé de M. Laurier, il a adressé une lettre au Free Press de London, à propos de la véracité de cet énoncé, et il donne un affidavit donnant, comme suit, les détails de cette difficulté :\n\n\"M. Laurier, parait-il, ne peut trouver qu'un outrage pour justifier la rébellion, et il paraît aussi que c'est un cas si grave qu'aucune population au monde ne l'aurait toléré.\" Maintenant, M. le Rédacteur, il se trouve que je suis le \"J. Kelly\" qui est mentionné, et je me propose, avec votre permission, de faire voir au pays combien M. Laurier est loin de justifier la rébellion. Ce n'est pas un cas commençant un exemple d'injustice. En 1879, je vis le Père André à Lac aux Canards, T. N. O., où mon frère Henry Kelly s'était établi depuis quelques années. Le Père André, de la Mission du Lac aux Canards, possédait 200 acres de terre sur lesquels la Mission était bâtie. À côté des terres de la Mission étaient 320 acres qui, depuis deux ans, étaient possédés par un canadien-français nommé Thibault, un membre du trésorier du Père André. Il réclamait 160 acres comme \"homestead\" et 160 acres en présomption. Le Père André réclamait ainsi le terrain de présomption, vu que cela appartenait à la propriété de la Mission, malgré que l'arpentage ne justifiait pas cette présomption. Thibault ne voulait pas admettre la réclamation du Père André, et il laboura quatre acres de la terre afin de valider son titre à la présomption. Je cherchais une solution en vain, et le Père André vint à moi et me dit que comme il était membre de la réclamation du Père André, il ne voulait pas avoir de problème avec le prêtre et il m'offrit de me vendre ses droits à la présomption, moyennant une paire de bœufs, et me mis à travailler et louai une paire de bœufs, et me mis à labourer, à commencer et à élever le cadre d'une maison. Le Père André vint et me menaça : \"Il fallait que j'abandonne la terre, ou bien il m'arrangerait. Mais je ne pouvais pas voir que son titre fût aussi bon que celui de Thibault, et je ne peux pas dire. Le Père André alla trouver l'abbé à Prince Albert, puis le Lieutenant-Gouverneur Laird, à Battleford ; mais tous deux lui dirent qu'il n'avait pas de cause. Alors il fit faire une requête par ses parolissiers et l'envoya au Département à Ottawa, mais sa réclamation ne fut pas admise là non plus. Dans l'intervalle je continuai mes améliorations jusqu'au commencement du mal ; alors M. Owen E. Hughes, le garde de la mission Sainte-Anne aux Cie., à Lac aux Canards, vint à moi et me dit que le Père André m'avait offert $100 pour moi, pour ma réclamation. Je ne pus de les prendre. M. Hughes causa de la chose avec mon frère qui me conseilla d'accepter, parce qu'il pourrait être désagréable pour moi de continuer une querelle avec le Père André, et qu'il y avait, tout près de là, d'aussi bonne terre à prendre et qui n'était réclamée par personne. J'ai dit à M. Hughes que je ne voulais pas. Un jour après, le Père André vint au bureau, par le canton patriote, M. Hughes, qui me donna, et il accepta un reçu rédigé par M. Hughes et signé par moi, transportant au Père André mes droits et mon titre à la propriété. Voilà, franc et vrai, l'exposé de toute l'affaire et vos lecteurs peuvent juger jusqu'à quel point cet 'outrage' peut justifier le meurtre des hommes de la police, l'assassinat du maire Skeff Elliott, les massacres du Lac à la Grenouille et les autres horribles incidents de la rébellion. M. Laurier fait bon marché de la vie des canadiens loyaux, s'il pense que deux cents personnes ont été justement tuées parceque ma terre a coûté cent plastras au Père André.\"\n\nEn second lieu vient\n\nLE CAS DE M. SALTER.\n\nM. Laurier a dit que Salter avait obtenu une entrée pour un quart de section de terre dans Saint-Louis de Langevin, lequel était déjà occupé par un métis, et que par là, il avait dépouillé le métis de sa propriété.\n\nLe dossier de cette affaire, au Département de l'Intérieur, tel que fourni par le Député-Ministre, est comme suit :\n\n\"Ni le Registrateur du département, ni le commissaire du bureau des patentes, n'ont pu trouver rien qui indiquait que les terres qui furent un jour entrées au nom de Thomas Salter, ou de Richard Thomas Salter, ce qui est le véritable nom, aient jamais été réclamées en aucune façon, par un métis ou par aucune autre personne, avant l'entrée de celui-ci. Les entrées de celui-ci furent pour le quart de section sud-est du No. 12, township 45, range 27, à l'ouest du second méridien, ET ELLES ONT DEPUIS LORS ÉTÉ ANNULÉES À SA PROPRE DEMANDE,\"\nAinsi, quelle qu'ait pu être cette difficulté à l'origine, les terres sont sorties de la possession de Salter depuis longtemps et il n'y a pas eu d'autre trouble à ce sujet. Ce sont là, les deux seuls cas mentionnés par M. Laurier et l'on voit qu'ils ne répondent aucunement au désir de nommer un métis qui ait été dépossédé de sa terre, soit par l'action, soit par l'inaction du gouvernement.\n\nM. Laurier pour démontrer l'absence de bonne foi chez le gouvernement, a fait allusion à la mission du\n\nREV. PÈRE LEDUC ET DE M. MALONEY à Ottawa. Il a dit que ces messieurs vinrent à Ottawa dans l'intérêt des métis en général, qu'ils recurent la promesse d'un nouvel arpentage des terres de Saint-Louis de Langevin et que cette promesse bien que donnée par écrit, n'avait pas été remplie. Voici les faits :—D'abord la mission du Père Leduc et de M. Maloney n'avait rien à faire avec les réclamations des métis, ni avec les arpentages dans le District de Prince-Albert. Ils vinrent comme représentants des habitants de Saint-Albert, d'Edmonton et du Fort Saskatchewan, qui sont entre 400 et 500 milles de la branche sud de la Saskatchewan où la rébellion a éclaté. Ainsi que l'explique le rapport du Député-Ministre, le fait que le gouvernement avait ordonné à M. Michael Deane, l'arpenteur chargé de certain travail spécial dans le District d'Edmonton, et qui avait, sans ordre, commencé d'autres arpentages, de cesser ces autres arpentages, avait fait craindre que le gouvernement n'entendait pas continuer l'arpentage, et le Père Leduc et M. Maloney furent envoyés à Ottawa à ce sujet. Leur mémoire présenté au gouvernement le 10 mars 1883, au nom des \"habitants de Saint-Albert, Territoires du Nord-Ouest\" demandait spécialement certaines choses, comme suit :\n\n1. Qu'on leur accordât un arpentage à partir de la rivière, avec une limite de deux milles, comme à Prince-Albert, T. N. O., et dans le Manitoba.\n\n2. Leurs terrains étant occupés depuis plusieurs années, quelques-uns même depuis avant la cession, ils demandèrent que le gouvernement reconnût leurs titres et leur accordât des patentes.\n\n3. Ils demandèrent de la part des habitants de Saint-Albert, Edmonton et Fort Saskatchewan, que l'arpentage par lots de rivière fut étendu depuis Edmonton jusqu'au Fort Saskatchewan, les deux colonies comprises, \"comme ailleurs sur la Saskatchewan, à Prince-Albert, sur l'Assiniboine et sur la Rivière Rouge.\"\n\n4. Ils demandèrent un Bureau des Terres à Edmonton, afin que les entrées pussent y être faites, et les patentes émanées, aussitôt que les colons auraient rempli leur devoir.\n\n5. Ils demandèrent que les personnes qui s'étaient fixées, avant les arpentages, fussent protégées dans leurs droits comme si elles se fussent fixées après l'arpentage.\n\n6. Ils demandèrent la représentation au Parlement du Canada.\n\n7. Ils demandèrent l'abolition de la taxe sur la coupe de bois.\n\n8. Ils demandèrent la nomination d'un Régistrateur à Edmonton ou dans les environs.\n\n9. Ils demandèrent que le chemin entre Edmonton et Saint-Albert, fût homologué comme grand chemin public.\n\n10. Ils demandèrent qu'on leur donnât des scrips comme aux métis du Manitoba.\n\nOn voit par là, que loin que le Père Leduc et M. Maloney aient demandé des arpentages à Prince-Albert ou dans le voisinage de Prince-Albert, à Saint-Louis de Langevin, leur demande se bornait entièrement au district d'Edmonton et n'avait aucune relation à la paroisse de Saint-Louis de Langevin, ni à la demande faite pour un nouvel arpentage dans cette paroisse. Le 12 Avril de la même année (1883) le Ministre fit faire cette réponse écrite aux représentants :\n\n1. On promit de faire arperter les lots à partir de la rivière, ainsi que demandé.\n\n2. On promit de faire émaner des patentes aussi tôt que les notes d'opérations et les plans de l'arpenteur seraient envoyés au département.\n\n3. On promit d'accorder la requête des habitants de Saint-Albert, d'Edmonton et de Saskatchewan, de faire arperter, à partir de la rivière, les terres qu'ils occupaient et de leur donner le droit de préemption.\n\n4. On promit un agent des terres.\n\n5. On promit de tenir compte du temps passé par les colons sur leurs terres, avant l'arpentage, comme s'il eut été passé après, quand il s'agirait de leur demande des patentes.\n\n6. La question de la représentation au parlement, occuperait l'attention du gouvernement.\n\n7. Le gouvernement refusa d'abolir la taxe sur la coupe de bois, considérant qu'elle était d'intérêt public et nécessaire pour la conservation des forêts.\n\n8. On promit de nommer un régistrateur pour le district d'Edmonton.\n\n9. Le droit de réglementer les chemins publics étant dans les attributions du Lieutenant-Gouverneur en Conseil, on promit d'attirer l'attention du Gouverneur sur ce paragraphe du mémoire.\n10. Il fut dit que le gouvernement s'occupait de la question de la réclamation des métis des Territoires du Nord-Ouest demandant des *scrips*.\n\nAinsi l'on voit qu'en substance, toutes les requêtes présentées par le Père Leduc et M. Maloney, au nom des habitants du district d'Edmonton, furent accordées — sauf la représentation au parlement qui était une question d'économie publique, l'abolition de la taxe sur la coupe de bois, et la question des *scrips*, qui ont été expliquées dans les pages précédentes.\n\nM. Laurier dit que quand le Père Leduc retourna au Nord-Ouest, il s'aperçut que ces promesses n'avaient pas été remplies. Le Père Leduc, en effet, écrivit au gouvernement, disant qu'il avait appris qu'il n'avait pas été transmis d'instructions à l'arpenteur, ainsi qu'on avait promis de le faire, mais la réponse du département à cet énoncé, rencontre suffisamment l'accusation.\n\nLa réponse fut comme suit :\n\n\"DÉPARTEMENT DE L'INTÉRIEUR,\n\nOTTAWA, 3 Sept., 1883.\"\n\n\"Monsieur, — J'ai l'honneur, par ordre du Ministre de l'Intérieur, d'accepter réception de votre lettre du 20 Juillet dernier, et de vous prier d'être assez bon de dire sous quel rapport, à votre retour à Saint-Albert, vous avez trouvé que les promesses contenues dans la lettre du 15 Avril 1883, promesses qui étaient faites à vous, et qui avaient été transmises à M. Michael Deane, et qui devaient être exécutées, n'avaient pas été exécutées par le gouvernement. Je dois attirer votre attention sur le fait que non-seulement M. Michael Deane a reçu des instructions à propos de l'arpentage, mais qu'une partie de son rapport d'arpentage a déjà été reçu et est en ce moment sous examen dans la boîte de l'Intérieur, et que le Père Leduc a été examiné et approuvé, et que nous avons eu l'honneur de recevoir des instructions relatives à cette affaire. Dans le cas de ces dernières, l'administration des Territoires du Nord-Ouest, qui est en train de recevoir des instructions relatives à cette affaire, ne peut pas être considérée comme une preuve de l'indifférence du gouvernement.\n\nJ'ai l'honneur d'être,\n\nMonsieur,\n\nvotre obéissant serviteur,\n\nJOHN R. HALL,\n\nSecrétaire par Intérêt.\"\n\nEn effet on avait envoyé des instructions à M. Michael Deane de procéder à ces arpentages, dès qu'on eût appris à Ottawa que les habitants d'Edmonton étaient sous une fausse impression quant aux actes du gouvernement, et cela avant l'arrivée à Ottawa du Rév. Père Leduc et de M. Maloney; et des instructions plus spéciales furent envoyées, avant qu'on ne leur eût remis la lettre en réponse à leur mémoire. Voici un télégramme de l'arpenteur-général, M. Deville, adressé au Ministre de l'Intérieur, à Ottawa, à ce sujet :\n\n\"OTTAWA, 21 Décembre, 1883.\n\n\"A l'Honorable Thos. White,\n\n\"Les instructions à Michael Deane pour l'arpentage de la colonie de Saint-Albert, sont du 29 février, 1883. Il a de plus reçu instruction le 9 avril, 1883, de donner à cet arpentage la priorité, sur tout autre ouvrage.\n\n\"E. DEVILLE,\n\n\"Arpenteur-Général.\"\n\nCes arpentages furent promptement terminés; un agent des terres fut nommé, M. Gauvreau, un canadien-français, étant choisi pour cet office; on nomma un régistrateur, M. Roy, aussi canadien-français, et les réclamations de ces colons furent toutes réglées à leur satisfaction. Il est digne de remarque que ces personnes, au nom desquelles le Père Leduc et M. Maloney visiteront Ottawa, bien loin de se plaindre, ou de prendre part à la rébellion, se sont engagées comme volontaires au service du gouvernement, pendant la rébellion, afin de maintenir l'autorité de la Couronne.\n\n---\n\n**RÈGLEMENT DES RÉCLAMATIONS DES MÉTIS**\n\nUn argument populaire employé par M. Laurier, pour indiquer le nombre des Métis qui étaient intéressés à la distribution des *scrips*, est l'argument que le gouvernement a réglé cette question avec deux mille d'entre eux. Cet argument est des plus fallacieux. Ces réclamations admises, comprenaient le cas des enfants, des personnes décédées et représentées par des héritiers, et des métis précédemment considérés comme sauvages mais qui maintenant se sont retirés des Tribus. Dans le cas de ces derniers, l'annuité qu'ils recevaient comme Sauvages, ne leur sera plus payée. Voici un sommaire des réclamations admises par la commission durant 1885 et 1886 :\n\n| Année | Total |\n|-------|-------|\n| 1885  | 4,666 |\n| 1886  | 2,159 |\n| Total | 6,825 |\n\nAinsi, le nombre des chefs de familles dans le Nord-Ouest, qui, au temps du soulèvement, avaient droit à des terres, était de 403 au lieu de deux mille, comme on le dit habituellement, et de ceux-là, une vingtaine à peine demeurait dans le district où il éclata, on bien prit part à la rébellion.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001560.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 23, "total-input-tokens": 31878, "total-output-tokens": 29315, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 38, 1], [38, 38, 2], [38, 78, 3], [78, 1304, 4], [1304, 5640, 5], [5640, 10904, 6], [10904, 18165, 7], [18165, 23656, 8], [23656, 29236, 9], [29236, 35210, 10], [35210, 41660, 11], [41660, 46983, 12], [46983, 53500, 13], [53500, 59695, 14], [59695, 65901, 15], [65901, 72891, 16], [72891, 79461, 17], [79461, 85280, 18], [85280, 87681, 19], [87681, 93039, 20], [93039, 97808, 21], [97808, 102479, 22], [102479, 102479, 23]], "primary_language": ["fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]