[{"id": "3b5df88aa0ec9dd7da762b73017341703b4b3066", "text": "LA SITUATION\n\nPar Mgr Alexandre Tache\n\nArchevêque de Saint-Boniface\n\nVoici venir là fin de 1835, cette année a été grosse d'événements pour toute la Puisance du Canada et en particulier pour le Nord-Ouest Canadien. Les complications ont été si graves, les conséquences si multiples que malgré les nombreuses prières qui m'ont été faites, avec instances, de faire part au public de mes idées, j'ai cru devoir garder le silence jusqu'à ce jour. À différer de répandre des journaux ou prétendre me faire parler, mais leurs assertions n'ont jamais été autorisées et par conséquent ne sont pas de moi.\n\nCe silence, j'aurais peut-être continué à le garder, si mon nom n'avait été mêlé, d'une manière ainsi injuste que déloyale, au débat qui a été provoqué par l'attitude prise récemment dans la Province de Québec. Malgré mon désir sincère de me tenir à l'écart des luttes et de l'agitation, je ne veux pas être obligé de dire ce que je pense, pris qu'on s'obstine à me prêter des idées que je n'ai jamais eues, des sentiments que je répudie.\n\nJe ne suis pas un homme de parti, je n'ai aucun désir de flatter, ni d'honorer qui que ce soit, mais j'aime mon pays et je veux apporter à sa prospérité et à son bonheur tout le concours dont je suis capable, puisque pour l'accomplissement de ce devoir, je sais que s'il y a un temps pour se faire, il y a aussi un temps pour parler, c'est le désir du bien qui me porte à rompre le silence.\n\nQuant à parler tout le monde convient que difficile d'exprimer les douloureuses émotions, les cruelles angoisses, les regrets, la vérité sans tapisseries, sans faux fuyants, c'est cette vérité-telle qu'elle est apparue à mes yeux, affirmée par le cœur, prévue que pour arriver à ce but, je cours le risque de froisser, blesser des susceptibilités, provoquer peut-être des colères, j'accepte à l'avance ces tristes responsabilités, mais à la condition qu'on n'en fasse peser les conséquences que sur moi personnellement.\n\nMaux et dangers de la rébellion\n\nDepuis neuf mois, notre pays a éprouvé des chocs, des malheurs, des désastres, qui ont eu un violent retentissement par tout le monde, puis, faut-il le dire, ce pays que nous aimons tant, a connu d'autres dangers qui, pour n'être pas soupçonnés, par le plus grand nombre, n'en ont pas été moins réels, ni moins épouvantables. Comme peuple, nous avons subi une humiliation profonde. Comme hommes, un cri d'horreur s'est échappé de nos poitrines, à l'aspect de cruels massacres. Comme citoyens, nous avons eu à déplorer la guerre civile, la guerre qui a porté le deuil et la désolation dans de nombreuses familles. Un sang généreux a coulé, et, avec lui, des larmes abondantes.\n\nPuis l'chef d'état s'est dressé pour faire ses victimes. Les cachots renferment des citoyens d'une grande honnêteté, des hommes dont la vie avait été sans reproche jusqu'à ce jour. Tous ces faucons, tous ces maux qui semblaient impossibles, il y a une an, ont eu lieu, et il n'y en a pas un parmi nous qui n'ait pas eu sa part de souffrances, au milieu de tous ces désastres. Moi aussi, j'ai eu ma large part aux souffrances morales qui ont été endurées, il me serait plus difficile d'exprimer les douloureuses\nmais qu'il m'était impossible d'appliquer ; acceptant sans hésitation les imprescriptibles exigences du devoir ; ne pouvant et ne voulant bannir de mon cœur les affectueuses sympathies de toute ma vie ; craignant à chaque instant des complications dont les autorités elles-mêmes ne semblaient pas se préoccuper, qui ont été à deux doigts de se produire et qui auraient entraîné le pays entier dans une ruine complète ; ignorant les moyens matériels, qui pourraient être mis à contribution et c'était la clef de la situation, puisque quelques centaines de cartouches pouvaient consommer notre ruine ; je le répète, j'ai souffert plus que je ne puis le dire ! Non, le public ne saura jamais ce que j'ai enduré, ni quelles appréhensions j'ai eues.\n\nDe plus, je suis convaincu, que tout ce qui s'est produit, peut se renouveler et s'aggraver de tout ce que j'ai craint dans le temps. Sous l'empire de cette conviction, je viens conjurer tous les hommes sévères qui ont à cœur le bonheur et la prospérité de notre cher Canada, de réfléchir sur les causes qui ont amené nos malheurs.\n\n**Causes diverses**\n\nDes esprits, hélas ! trop superficiels ou trop intéressés pour se livrer à un examen sérieux et impartial de nos difficultés, croient avoir satisfait à leur devoir de citoyens en s'écriant : \"c'est Riel qui est la cause de tout le mal, c'est lui qui a tout fait ; il a payé de sa tête, maintenant le pays est en sûreté.\" Cette explication est tellement déraisonnable que, si elle était acceptée, nous pourrions nous attendre à de nouveaux troubles, dans un avenir prochain. Le récif sur lequel va se briser une embarcation n'est pas la seule cause du naufrage... Le mode de construction, la violence de la tempête, l'insuffisance ou la faiblesse de l'équipage, l'ignorance ou l'incurie des pilotes, en un mot l'ensemble des circonstances dans lesquelles s'accomplit la navigation n'est pas étranger au désastre qui se produisit sur un écueil. Quand bien même on serait sauter le rocher, sur lequel vient de se briser l'Algoma, on ne mettrait pas pour cela la navigation du lac Supérieur à l'abri de tout péril. C'est donc s'aventurer ou vouloir aventurer les autres, que de rejeter sur un seul, les causes que nous déplorons tous.\n\nÀ mes yeux, les responsabilités de nos désastres et de nos hontes sont multiples. Elles pesent non seulement sur les agents actifs du soulèvement et les administrations qui se sont succédées au pouvoir, mais aussi sur bien d'autres. Le peuple canadien et ceux qui le gouvernement en acquièrent les territoires du Nord-Ouest, n'ont pas pensé qu'à l'étendue et à la richesse de vastes domaines dont ils entraînaient en possession. Ils n'ont pas compris la situation parce qu'ils ne savaient rien ou presque rien de ce qu'ils avaient besoin de connaître. Les incertitudes, les modifications les contradictions, etc., etc., qui se trouvent dans les statuts sont une preuve évidente de mon assertion. Undes plus grave inconvénients, c'est que les autorités partagent les préjugés des provinces entières ont pénétré dans le Nord-Ouest, avec défiance contre tous ceux qui s'y trouvaient ou le connaissaient. On s'est cru en possession d'un pays ordinaire; tandis qu'au contraire on arrivait dans un pays entièrement inconnu.\n\nCette ignorance n'aurait pas été si complète si on avait voulu prêter une oreille attentive aux informations qui ont été données.\n\nDes hommes distingués par leur caractère, leur position et leur expérience ont tenté, à maintes reprises, de donner des suggestions et des renseignements utiles ; on a presque invariablement repoussé tout ce qu'ils désiraient faire connaître. On n'a rien accepté, en dehors des données fournies par les documents, préparés dans les offices du gouvernement et je regrette de le dire, souvent ces informations auraient dû être les seules reçues.\n\n**Employés publics**\n\nCette première cause de nos difficultés se lie naturellement avec une seconde. Je viens de suggérer l'idée d'hommes en officier. Je dois, sans doute, à la justice de dire, que quelques-uns de ces hommes étaient qualifiés pour les fonctions plus ou moins élevées auxquelles ils étaient appelés, mais, hélas ! il n'en a pas été de même de tous. On a confié des emplois même importants à des officiers qui n'avaient aucune des qualités essentielles à l'accomplissement de leurs devoirs. Dans mon humble opinion, il en sera toujours ainsi tant que toutes les nominations se feront exclusivement au point de vue des partis politiques. Tout en nommant des hommes indignes on en a écartés ou laissés dans l'oubli d'autres éminemment aptes et cela uniquement parce qu'il y a cinq, dix ou quinze ans, ils étaient des adversaires politiques.\n\nOn se figure quelques fois que tout est bon pour un pays nouveau, surtout parmi les Sauvages. C'est une grave erreur. Il faut au contraire plus de sens, plus de tact, plus de savoir faire, dans un pareil pays, puisque tout y est à créer, à organiser. Dans une ville populeuse, un employé public peut être toléré jusqu'à un certain point.\nprononcées à leur sujet, par Lord Dufferin,\nen son discours d'adieux à Manitoba, le 29\nseptembre 1877 : \"Il n'y a pas le moindre\ndoute qu'une large part des bonnes dis-\npositions, qui existent entre les Peaux\nRouges et nous-mêmes, est due à l'in-\nfluence et à l'action de cette inappréci-\nable classe d'hommes les Métis habitants\net pionniers de Manitoba, (vifs applau-\ndissements), qui, combinant, comme ils\nle font la vigueur, la force et l'amour des\naventures naturels au sang indien qui\ncoule dans leurs veines, avec la civilisa-\ntion, l'instruction et la force intellectu-\nelle qu'ils tiennent de leurs ancêtres\npaternels ont proclamé l'évangile de la\npaix, de la bonne volonté et du respect\nmutuel, avec des résultats, également\navantageux au chef sauvage dans sa loge\net au colon dans son chantier... (Applau-\ndissements renouvelés.) Ils ont été les\nambassadeurs entre l'est et l'ouest, les\ninterprètes de la civilisation et de ses\nexigences vis-à-vis de ceux qui habitent\nla prairie, tout comme ils ont dit aux\nblancs, qu'elle est la considération juste-\nment due aux susceptibilités, à l'amour\npropre si sensible aux préjugés, au désir\ninné de justice de la race sauvage. (Ap-\nplaudissements continus.) De fait, les\nMétis ont fait pour la colonie ce qui ne\nse serait pas accompli sans eux ; ils ont\nétabli entre la population blanche et\nindienne, des sentiments traditionnels de\nbon vouloir et d'amitié, qu'il n'aurait\npas été possible d'établir sans eux. (Ap-\nplaudissements).\"\n\nSi les paroles précédentes avaient été\nmieux comprises, si la ligne de conduite\nqu'elles semblent indiquer avait été suivie,\nle pays n'aurait pas eu à déplorer les maux\nqui sont venus foudre sur lui. Quand Lord\nDufferin a visité Manitoba, heureusement\npour l'honneur des Métis, il n'y avait pas\nde chefs païens ; Son Excellence a dû voya-\nger comme on voyagait alors, et tout natu-\nrellement, il a voyagé avec des Métis.\nAvec eux, il a parcouru la prairie, il a tra-\nversé la forêt ; il a connu la charrette et le\ncanot d'écorce, il n'a pas désigné de parler\navec ses guides. Sachant le français, il n'a\npas eu besoin d'interprète ; intelligent, il\na compris la population ; homme d'état, il\na dit au pays et aux aviseurs des représen-\ntants de Sa Majesté : voici le passé des\nMétis, leur utilité, quelques-unes de leur\nnobles qualités ; voyez ce que vous devrez\nfaire à l'avenir. Les suggestions d'un grand\ndiplomate n'ont pas été comprises. On a\nmieux aimé continuer sur le ton donné, par\nle soldat heureux qui est entré au Fort\nGarry longtemps après que les Métis lui en\navaient ouvert les portes.\n\nLe colonel Wolseley avait traité les\nMétis de \"bandits et de lâches.\" Cette\nstupide assertion (c'est l'appréciation qu'en\na fait le ministre de la milice d'alors) a\nfait son chemin. Un grand nombre de\njournaux l'ont répétée, les officiers de tous\ngrades s'en sont inspirés ; et au lieu de\nrendre aux Métis la justice à laquelle ils\navaient droit, on en a souvent oublié, à\nleur égard, les prescriptions les plus élé-\nmentaires. Au lieu de les traiter comme\ndes gentilshommes traitant tout le monde,\non s'est permis à leur égard des grossière-\ntés et des insolences capables de blesser les\nsusceptibilités les plus légitimes. Un rude\net dédaigneux : I don't talk French, a sou-\nvent été l'unique réponse à des demandes\nlégitimes. On a oublié qu'étant les enfants\ndu sol, ils avaient des droits particuliers.\nSi au moins, on avait voulu se souvenir\nqu'étant le lien naturel, les intermédiaires\nles plus efficaces entre les sauvages et les\nblancs, leur concours était nécessaire. Comme dit\nLord Dufferin et ce qui est vrai, en par-\nlant de la paix qui régnait dans le pays, on\na invoqué une prétendue Canadian Policy\nwith the Indians, qui n'existait que dans\nl'imagination, puisque, en réalité, le Ca-\nnada ne fait que d'entrer en relations avec\nses sauvages. Les tristes événements de\ncette année prennent jusqu'à l'évidence,\nque ce sont les Métis qui maintenaient les\ntribus indiennes dans leur attitude pacifi-\nque. À la première rumeur de rupture en-\ntre les Métis et les autorités, les sauvages\nse sont soulevés ; ils se soulèveront encore\nsi de circonstances analogues se reprodui-\nsent.\"\n\nQuant à la question de la prétendue li-\nchété des Métis, je crois qu'elle a été résol-\nue amplement ! Après ces réflexions et ce\nqu'il a déconnu officiellement, il m'est im-\npossible d'exonérer les autorités de toute\nresponsabilité. Depuis quinze ans, on aurait dû faire autrement qu'on n'a fait. Je\nle répète, je ne suis pas homme de parti\npolitique, mais je crois que les deux partis\nont leurs responsabilités. On aurait dû et\non aurait pu prévenir les troubles. Que\nn'a-t-on écouté ceux qui les prévoyaient et\nqui en ont averti qui de droit ? Nos hom-\nmes d'État ont mon respect, mais l'erreur\nest trop commune parmi les hommes pour\ncroire qu'ils ne pourront pas souffrir qu'u-\nne voix amie leur dise, qu'ils se sont trom-\npés. D'ailleurs, la justice veut qu'on se\nsouviene qu'ils ne sont pas les seuls con-\npables. Les banquettes ministérielles sont\nau nombre de treize, mais les banquettes\nparlementaires se chiffrent par près de trois\ncents. Il est sans doute pénible et humi-\nlliant de savoir, que des Ministres de la\nLors même qu'il n'est qu'un mot ou un fait ; ceux qui sont mieux que lui contrebalancent les inconvénients que seul il ferait patte. Dans le désert ou la prairie, c'est bien autre chose. L'incapacité d'un fonctionnaire est d'autant plus saillante qu'il est isolé. Il n'y a point le moindre doute, que si l'on veut bien gouverner le Nord-Ouest, il faut être très particulier sur le choix de ceux auxquels on confie des emplois. Une qualification indispensable pour eux tous, c'est d'être polis et sympathiques envers les natifs et les colons. Un bon procédé, une parole aimable, suffisent pour éloigner ou faire taire un mécontentement. L'autorité a besoin d'exercer un prestige et c'est une erreur profonde de croire qu'on en impose par la grossièreté et l'arrogance ; ces procédés au contraire, font beaucoup de mal et démontrent une ignorance plus grande que celle que l'on croit être l'apanage exclusif des illétrés.\n\nLes Colonnes\n\nUne autre cause de nos difficultés est venue du mécontentement des nouveaux colons eux-mêmes. Le gouvernement, les sociétés de colonisation et autres ont publié à profusion des brochures plus ou moins exactes sur le pays et ses avantages. Le malheureux boom (fièvre de spéculation) de Manitoba a aussi saisi le Nord-Ouest dans ses étreintes. Bien des gens ont vu dans ce pays la terre promise aux avides de richesses, avec ou sans travail. Attirés par ces séductions, bien des gens sont partis pour le Nord-Ouest. Le pays n'était pas encore prêt à les recevoir en nombre. La fatigue, l'ennui, l'isolement, les contraintes d'autant plus sensibles qu'ils étaient imprévus, furent le résultat d'une immigration trop hâtive et commencèrent la série de déceptions, dont on voulut faire peser toute la responsabilité sur le gouvernement... Les fautes véritables firent croire aux fautes imaginaires... De là, une disposition naturelle, à un mécontentement général. Pour se venger on eut recours à des procédés regrettables. Les plus brillantes espérances étaient déçues. La fortune rêvée ne venait pas. Les difficultés réelles et nombreuses d'un nouvel établissement, au milieu de la solitude, l'absence de la famille, l'inquiétude de l'avenir, tout cela augmentait le malaise. Puis vinrent les gelées précoces. Oh ! que ces gelées ont fait de mal aux gouvernants et aux gouvernés ; sans le dire, on agit comme si on en tenait les autorités responsables. On s'indigna, on fit des assemblées nombreuses et fréquentes, on dépensa tout ce que l'on sait dépenser d'éloquence dans un pays constitutionnel ; on ne voulait pas de révolte contre l'autorité, mais on voulait une évolution quelconque ; agitation d'abord raisonnable, prit bientôt une autre forme. On fit des suggestions plus ou moins hardies ; on savait qu'il y en avait d'autres qui parlaient moins, mais qui agiraient plus.\n\nOn ne voulait pas l'effusion du sang, mais on désirait ardemment l'effusion des écus du trésor public. On ne pensait pas qu'en semant le vent on récolte la tempête. La chose est tellement vraie, qu'à présent que la tempête est un peu calmée, et quelque violente qu'elle ait été, il est bon nombre de colons qui disent : \"Après tout, nous y avons gagné, il nous faudrait quelque chose de semblable tous les dix ans, nous étions ruinés et les affaires se rani-ment.\" Aussi tous le monde est d'une loyauté à mettre au défi, colls de leurs Altesses Royales elles-mêmes. Oh ! misère des bassesses humaines, il est des gens qui ont poussé à la rébellion, qui se réjouissent des avantages matériels qu'elle leur a procurés et qui, pour dissimuler leur joie, sont les plus ardents à demander vengeance et à parler de loyauté. Le gouvernement doit connaître ce que je viens de dire, et il est bon que le pays entier le sache afin que chacun porte sa part de responsabilité.\n\nD'un autre côté, qu'on ne se méprenne pas sur la portée de mes assertions. S'il y a des colons qui ont joué un rôle indigne en tout ce qui a en lien, ce n'est que l'exception. Le grand nombre de ceux qui se sont plaints se sont contentés de faire valoir leurs réclamations. Il y a tout lieu d'espérer que la confiance reviendra et que si les gelées précoces ne les éprouvent pas trop, la prospérité sur laquelle ils ont compté sera leur partage. Je crois d'autant plus facilement à ce retour de la prospérité que l'expérience me persuade que la bonne Providence a toujours en réserve un dédommagement proportionné aux malheurs dont elle permet que nous soyons frappés. Depuis quarante ans que je suis dans le pays, bien des fois les choses m'ont paru assumer un aspect alarmant et chaque fois, les causes mêmes de nos alarmes nous ont procuré des avantages inattendus.\n\nEn parlant des troubles du Nord-Ouest, la pensée se porte naturellement sur les Métis et cette pensée à le double résultat d'exciter le mécontentement chez les uns et les plus ardentes sympathies chez les autres. Tous ceux qui me connaissent savent que j'aime la population métisse. Je me rangerai toujours du côté de ceux qui sympathisent avec elle. Avant de parler de la part, prise par les Métis, dans les troubles du Nord-Ouest, je veux citer ici les paroles\nreligieux, les péripéties, les chances et les succès d'une chasse qui n'a jamais eu de parallèle!\n\nIl faut avoir connu ce flâneur à qui l'abondance permettait de passer presque toute sa vie dans une oisiveté à laquelle le caprice seul offrait des variétés. Oui, il faut avoir vu tout cela et voir le sauvage d'aujourd'hui, traînant sa misère; privé de son incomparable indépendance; dans un état continu de gêne et de demi-jérôme; ayant ajouté à ces vices les dégoutantes conséquences de l'immoralité des blancs!\n\nIl faut avoir vu tout cela, et l'avoir vu sous l'influence de la sympathie, pour comprendre tout ce que souffrent les Sauvages aujourd'hui.\n\nQu'on ne parle pas des traités comme compensation à ce changement. Ces traités, le sauvage sans culture ne les a pas compris. Il en a compris la forme, si vous voulez, mais il n'en a pas saisi la portée, par conséquent n'en a pas accepté les conséquences. Je dis plus, le gouvernement et ceux qui ont fait des traités en son nom, n'ont jamais compris eux-mêmes ce qu'ils faisaient, dans ce sens du moins qu'ils n'ont jamais su quelle position inacceptable ils préparaient aux Sauvages, en maintes circonstances. Aussi, volontiers, je dirais, avec Son Excellence le Gouverneur-Général: \"Il ne faut pas être surpris de voir ces pauvres Sauvages se livrer de temps à autre à une sorte de désespoir.\"\n\nLes plus stoïciens ne pourront s'empêcher de dire que ces Sauvages ont \"un droit moral à un traitement équitable.\"\n\nC'est plus le temps que jamais de penser aux fautes qui ont été commises à leur égard: \"On les a laissés en proie aux séductions d'hommes d'une immoralité révoltante et quand l'attention a été attirée sur ce point les amis de l'humanité ont eu un regret de plus à enregistrer, par suite les Sauvages ont conçu un profond mépris pour des personnes qu'ils auraient eu besoin de respecter.\"\n\nDans d'autres circonstances on a dépouillé les Sauvages de la pittance qui leur était assignée, ou on leur a données de plus mauvaise grâce qu'on ne serait un chien. On a dit blanc et noir quand ce n'était ni l'un ni l'autre. L'indien qui est beaucoup plus intelligent qu'on ne fait semblant de le croire a senti son mépris s'augmenter.\n\nC'est parmi les Sauvages surtout, qu'il est important de faire un choix judicieux de ceux qui ont à exercer une autorité quelconque. Ce choix, je suis heureux de le dire, est-ce qu'il doit être en maints endroits la conséquence c'est que là, les satisfaisants et le gouvernement.\n\nRien, absolument rien ne peut atténuer les massacres du lac La Grenouille, c'est même une sentimentalité exagérée que de vouloir blâmer le gouvernement d'avoir laissé exécuter les auteurs de ces forfaits.\n\nJe ne veux donc nullement justifier les Sauvages, mais puisqu'il est à propos que la vérité soit connue, et au risque d'étonner beaucoup, j'affirme que ces massacres n'ont pas été sans provocations du moins éloignées. J'invoque le témoignage d'une des victimes elle-même. Le Révé P. Fafard disait à un de ses confrères qui me l'a répété: \"Un tel est d'une brutalité indignes envers les Sauvages. Il se fera tuer en quelque jour.\" Celui dont il était question a été tué et deux généreux missionnaires ont augmenté le nombre des victimes, qu'ils voulaient protéger.\n\nUn gentilhomme, contre la véracité duquel je ne puis avoir de doute, m'a assuré à moi-même que des Sauvages lui avait dit en 1834, que tel individu les traitait comme des chiens, et ce dernier aussi a été tué par un des Sauvages qui se plaignaient de lui. Je dis ces choses, si pénibles à dire, parce que les deux cas que je cite ne sont pas les seules exceptions aux bons traitements auxquels ces pauvres gens ont un droit moral, et je le dis, puisque je parle pour l'avenir encore plus que pour le passé.\n\nLES MÉTIS\n\nBien sûr, personne ne m'accusera de manquer de patriotisme ni de justice, quand j'affirme que je regrette beaucoup, que certains employés n'aient pas été dignes de la confiance que je suis si heureux de voir accorder à d'autres du département indien, qui certainement méritent cette confiance à un haut degré. Sans flatterie ni hésitation, je dis qu'il y a dans ce département, comme dans les autres, des hommes honorables, dévoués et intelligents qui font du mieux possible, au milieu des difficultés sans nombre qu'ils rencontrent dans l'accomplissement de leurs devoirs.\n\nOn a tort de jeter sur les Métis, toute la responsabilité du soulèvement des sauvages. L'alliance des uns et des autres est naturelle et doit se produire indépendamment de toute tentative ad hoc. Il y a entre ces deux races communauté de langue, d'origine et j'ajouterai de mécomptes.\n\nDans la prairie et dans la forêt, le sauvage a reconnu la supériorité du Métis, sans le jalouser, parce que c'était son parent; aussi, dès que les Métis ont manifesté du mécontentement, les sauvages n'ont nécessairement tiré une conclusion, qui n'a pas pu manquer d'être... C'est un...\nCouronne ont pu affirmer officiellement qu'il ne s'était jamais fait de démarches en faveur des Métis, soit par eux-mêmes, soit par leurs amis, mais d'un autre côté, il est aussi bien pénible de savoir que les voix isolées qui se sont fait entendre dans les deux chambres de notre Législature, n'ont pas trouvé un appui assez influent pour forger à l'étude approfondie de la situation et des moyens de remédier à ce qu'il y avait de déficienceux. Dire qu'il n'a fallu rien moins que l'effusion du sang et la dépense de millions, pour faire comprendre à ceux qui s'occupent de la chose publique, à quelque titre que ce soit, que non seulement le Nord-Ouest est un vaste pays, mais qu'il y a là de vastes questions sociales, qui sont loin d'avoir reçu une solution satisfaisante.\n\nOn parle beaucoup de la puissance de la presse. C'est en effet, un très puissant levier. Mais les aborigènes de ce pays ont le droit de se demander si tous les organes de la publicité leur ont été utiles. En Canada, règle générale, les journaux se réjouissent au point de vue de l'intérêt des partis politiques. Les uns attaquent le gouvernement sans la modération nécessaire pour produire un bon résultat. D'autres, au contraire, le louent avec une ardeur encore plus regrettable que les attaques. Dire qu'aujourd'hui, il y a des journaux qui pour déplacer la responsabilité veulent rendre le vénérable Monseigneur Grandin, ses dévoués missionnaires et moi-même responsables des fautes commises à l'égard des Métis !\n\nCes assertions ridicules et mensongères font plus de tort que de bien à ceux que l'on veut servir et par suite, sont très-dommageables aux intérêts publics.\n\nLes Sauvages\n\nEn commençant à parler des Métis j'ai été heureux d'invoquer, en leur faveur, le témoignage de Lord Dufferin.\n\nEn parlant des sauvages, j'éprouve une joie analogue, puisqu'il m'est permis de citer les paroles d'un autre représentant de notre Gracieuse Souveraine. Le Marquis de Lansdowne a voulu voir les sauvages, leur parler, les entendre et voici les nobles paroles, que ces conversations lui ont inspirées, d'après la traduction que j'ai sous les yeux : \"Il est impossible de rencontrer ces pauvres gens d'entendre leurs dires, sans ressentir une vive sympathie pour la situation actuelle où ils se trouvent. Ils sont les habitants originels de ce continent. Ils se considèrent comme les premiers occupants du sol, des pauvres sauvages, maintenant que le buffle, de l'existence duquel dépendait leur propre existence, depuis nombre d'années, est presque complètement disparu, se livrer de temps à autre, à une sorte de désespoir; celui, surtout lorsqu'ils voient, comme ils le disent eux-mêmes, les blancs s'enrichir d'année en année, et eux, au contraire, devenir de plus en plus pauvres. Ce n'est pas ici l'endroit de discuter la question du titre qu'ils prétendent avoir aux terres du Nord-Ouest. La valeur de ce titre, ne se résume pas tant à une question légale, qu'à un droit moral que possèdent ces pauvres gens, de recevoir un traitement équitable de ceux qui ont répandu dans ce pays, le flot irrésistible de la civilisation, devant lequel ces races primitives ont dû céder le pas et reculer.\"\n\nCes paroles ont été prononcées par le Gouverneur-Général à Winnipeg, le 22 octobre dernier. J'ai eu le plaisir de les entendre. L'émotion de Son Excellence était si profonde qu'elle se traduisait dans sa voix. Ces paroles si sympathiques furent vivement applaudies. On voyait l'homme intelligent qui a compris la gravité d'une question et l'homme de cœur, après d'un généreux enthousiasme pour des êtres humains que notre civilisation tant vantée ne sait que reculer en attendant qu'elle les détruisse.\n\nLes sauvages ont eu leur part aux troubles. Les uns par de cruels massacres, dont rien ne peut pallier l'horreur, les autres par une attitude regrettable sans doute, mais pleine, à certains points de vue, d'enseignements importants pour ceux qui savent réfléchir et sentir.\n\nLes sauvages du Nord-Ouest ! Voilà une classe d'hommes bien peu comprise du peuple Canadien en général et qui ne le sont jamais entièrement que par ceux qui parlent leur langue, qui ont vécu avec eux et qui leur ont voué leurs sympathies. Jamais le Canada ne saura quelle épreuve il fait subir aux fiers enfants du désert, en les parquant sur des réserves pour souffrir les angoisses de la faim et déroger les répugnances d'une demi-captivité.\n\nIl faut avoir vu l'indomptable sauvage se dresser au milieu des immenses prairies; se draper avec complaisance, dans sa demeure ; promener son regard de feu sur des horizons sans bornes ; humer une atmosphère de liberté qui ne se trouve nulle part ailleurs ; se comporter dans une sorte de royauté qui n'avait ni les embarras de la richesse, ni la responsabilité de la dignité !\n\nIl faut avoir vu cet infatigable...\ndouloureuse condamnation au milieu de criminels avec lesquels ils n'ont rien de commun, et Louis Riel a été exécuté à Regina, le 16 novembre dernier.\n\nL'opinion publique s'est partagée sur ce dernier événement et en sa partageant, elle s'est passionnée.\n\nEn général, la presse anglaise approuve cette triste exécution, tandis que la presse française la condamne, comme une cruauté inutile.\n\nDes deux côtés, il y a des exceptions. La presse américaine est unanime, ou à peu près, à considérer cet acte de nos autorités comme une faute politique. Je regrette extrêmement que des hommes, de qui on devait attendre mieux, se soient oubliés jusqu'à vouloir faire peser la responsabilité de cette mesure extrême sur ceux mêmes qui étaient les moins capables de la conseiller.\n\nLes missionnaires ont consenti; mais les missionnaires ne savent pas créer vengeance. Les deux seuls qui ont été appelés en témoignages en cette cause, ont rendu témoignage dans le sens de la défense. Pourquoi joue-t-on le rôle si indigne de recommencer le procès de l'infortuné exécuté devant le public, en invoquant les témoignages des Révérends Pére André et Fourmond, qui, mis sous serment à la cour, ont rendu un témoignage dont la conclusion naturelle n'était certainement pas l'échafaud ? On va jusqu'à torturer l'âme si généreusement altérée de Monseigneur Grandin, en lui prêtant un rôle indigne de sa position et de son cœur. Et tout cela, on a l'audace de le dire, pour faire prévaloir la vérité.\n\nLe gouvernement a laissé faire l'exécution, il en a donc la responsabilité et c'est une indignité de vouloir la faire peser sur d'autres, qu'on s'est bien donné garde de consulter à ce sujet. Pour ma part, une observation de vingt années m'a donné des convictions diamétralement opposées à celles que l'on invoque. J'avais trop de raisons d'étudier dans ses moindres détails les dispositions et les actes de mon infortuné protégé, pour pouvoir ne pas me rendre compte de ce qu'il était et de ce qui a pu le conduire à la voie déplorable qu'il a suivie. Il y a bien des années que je suis convaincu, au-delà de la possibilité d'un doute, qu'à côté des brillantes qualités de l'esprit et du cœur, l'infortuné chef des Métis était en proie à une mégalomanie et théomanie qui seules peuvent expliquer tout ce qu'il a fait jusqu'au dernier moment. Mes convictions sont sincères, mais on n'en peut conclure que ceux qui ne les partagent pas, manquent tous de sincérité. Les conséquences naturelles de mes convictions, sur ce triste sujet, ont épuisées et j'ai vu disparaître l'espoir que j'avais entretenu qu'au dernier moment. Malgré cette déception, je ne me permettrai pas d'injurié ceux qui me l'ont infligée.\n\nJe ne désespère pas assez de notre pays, pour croire que nos hommes publics soient capables de se laisser inspirer uniquement par la haine et les froids calculs qu'elle inspire.\n\nJe ne sais pas ce qui s'est passé dans le conseil de ceux qui nous gouvernent, mais je ne puis pas croire qu'ils ne se soient pas mis en face de leurs obligations. Dans tous les cas, ils ont accepté la responsabilité et je ne veux pas faire naître ou développer des embarras auxquels il est difficile d'assurer une issue favorable.\n\nAgitation dangereuse\n\nJe ne dissimulerai pas que la douleur que j'éprouve depuis le commencement de nos troubles, au lieu d'être allégée a été de beaucoup augmentée depuis trois semaines. Je ne fais aucune allusion à un mouvement qui ne serait que politique et enfermé dans les limites déjà si larges de la constitution. Que ceux qui ont un vote à donner soit dans les circonscriptions parlementaires, soit sur les hustings, que ceux là présentent tout dans l'intime de leur conscience et dans la balance de l'amour de leur pays et qu'ensuite ils votent suivant leurs convictions. C'est leur droit, c'est leur devoir.\n\nÀ côté de la question purement politique, il y a une question sociale à laquelle je suis trop étroitement lié pour me réjouir à garder le silence.\n\nJe ne crois pas avoir besoin de dire que j'aime mon pays. La province qui m'a vu naître a gardé tout mon cœur et je n'ai fait qu'étendre le cercle de mes affections, en assimilant le pays de mon adoption à celui de ma naissance. Donc, tout ce qui touche Québec, tout ce qui touche Manitoba et le Nord-Ouest, tout cela me touche vivement, et c'est pour cela, qu'en face d'une agitation qui ne peut pas être sans dangers, je prends la liberté aussi respectueuse qu'affectueuse de dire à mes amis de ne pas se laisser entraîner dans un mouvement qui peut leur être très préjudiciable à eux-mêmes et à la cause qu'ils embrassent avec tant de générosité.\n\nAu milieu de tout ce qui s'est dit et s'est écrit depuis trois semaines, j'ai admiré les nobles élans d'un généreux patriotisme. Cependant pour être sincère, je dois avouer que j'ai déploré bien des élans, qui, dans mon humble opinion, ne sont pas l'écho du même sentiment ou du moins ne révèlent pas la prudence extrême qui s'impose au vrai patriote dans la crise de l'histoire d'une nation.\nJ'ai promis de dire la vérité sans tapis-\nsation, aussi il ne faut aborder le point\nle plus délicat de la question de nos trou-\nbles et parler de celui qui a été le plus en\névidence et que l'on dit résumer toute la\nsituation.\n\nLouis Riel a été choisi par les Métis\ncomme leur chef. Ils sont allés le chercher\nsur la terre étrangère ; ils l'ont amené au\nmilieu d'eux, sur les bords de la Saskat-\nchewan. Cette demande s'est faite par suite\nde l'inutilité des efforts tentés par les Mè-\ntis et leurs amis pour faire reconnaître\nleurs droits. Les Métis, ne comprenant pas\ncomment on s'obstinait à les ignorer, se\nsont persuadés qu'ils étaient joués par\nceux mêmes en qui ils avaient mis jus-\nqu'alors leur confiance. Ils crurent que\nRiel était des leurs, ayant confiant avec eux\net pour eux, mettrait plus de zèle à faire\nvaloir leur cause, et par cela même obten-\ndrait plus de succès. Riel se rendit à Ra-\ntoche, excité par les uns, sollicité par les\nautres, il crut voir l'unanimité entre tou-\ntes les sections de la population, et persuadé\npar cela même d'un succès facile, il com-\nmença une agitation toujours dangereuse,\nsurtout au milieu d'une population plus\nprompte à l'action qu'au désir de parler.\n\nCette agitation développait de plus en\nplus le mécontentement. Des menaces in-\ndiscrètes, des vantardises stupides et des\nencouragements secrets conduisirent les\nesprits à un état d'excitation des plus dé-\nplorables.\n\nL'a-surance qu'on enverrait une commis-\nsion ne fut point acceptée ; on aimait mieux\ncroire à une rumeur qui allait à dire qu'au\nlieu de leur accorder leurs droits, les auto-\nrités envoyeraient des fers pour le chef et du\nplomb pour ceux qui le protégeraient, cette\nconviction produisit le résultat qu'on devait en attendre.\n\nLes métis songèrent à la résistance et à\nse défendre. Mal armés, sans munitions,\nsans provisions, ils s'emparaient des maga-\nsins qui se trouvaient dans le voisinage.\nL'attaque inconsidérée faite contre eux, au\nLac des Canards, fut une déclaration de guerre.\n\nLa suite de ce drame sanglant occupe le\nCanada depuis plusieurs mois. Ce n'est\npeut-être pas le temps de rectifier les nom-\nbreuses erreurs qu'une publicité trop hiti-\nve a accumulées autour de l'histoire de\ncette douloureuse période. Ce qui n'est que\ntrop certain, c'est que des vies généreuses\nont été sacrifiées ; la misère et la désola-\ntion règnent au milieu d'établissements\nmaigreusement prospères.\n\nDes hommes respectables subissent une\nEncore une fois, recourez aux moyens institutionnels tant que vous voudrez, mais n'imprimez pas à notre état social les commotions qui peuvent rendre la vie désagréable pour vous ou pour les autres. Nous sommes catholiques et dans nos relations sociales, nous devons nous rappeler ce qu'a dit un homme illustre : \"que l'Église Catholique est la plus grande école du respect;\" respect pour l'autorité et pour ceux qui la représentent, respect pour tous, même pour ceux qui ne comprennent pas l'obligation de ce devoir.\n\nDans le cercle rétréci d'une famille, où il y a communauté entière d'idées, de sentiments, d'intérêts, on trouve hélas! beaucoup de divergences. Comment oser espérer que dans un pays aussi vaste que le nôtre, où il y a une si grande différence de nationalités et de diversités de provinces, comment espérer de pouvoir nous harmoniser, à moins que chacun soit prêt à faire la part de sacrifice qui peut être exigée de lui? Somme toute, nous devons en convenir que la Providence nous a fait un sort plus heureux que nous ne pouvions naturellement l'attendre. Nos institutions ont de l'ampleur et de la pesse; l'atmosphère que nous respirons est en général plein de liberté. Sans doute, autour de nous, n'est pas perfection, mais rien ne s'oppose à ce que nous travaillons avec énergie à ce perfectionnement, pourvu que nous ne dépassions pas les limites circonscrites par le devoir.\n\nLa majorité n'a aucun droit de nous opprimer, aussi quoique nous ne soyons que la minorité, tout le monde est frappé de la position que nous avons pu nous faire. Défions-nous des exagérations, défions-nous d'un islamisme qui, à un point de vue, pourrait nous flatter, mais qui certainement peut conduire à des conséquences que les vrais amis du pays ne pourraient que déplorer.\n\nVeuillez croire que ce que je dis ici coule d'une plume tenue par une main tremblante d'émotion. C'est pour nous, isolés dans l'extrême Nord-Ouest, que vous luttez dans la province de Québec; c'est de vous, en maintes circonstances, que nous avons imploré secours et appui; c'est encore, au milieu de vous, que se trouve aujourd'hui mon ami vénérable et si aimé collègue, Mgr Grandin; c'est à vous qu'il tend la main en faveur des pauvres ruinés de la Saskatchewan, et je sais que votre main généreuse n'est jamais fermée. C'est vous qui m'avez encouragé, honoré, soutenu par vos sympathies quant j'ai eu la douleur de traverser les jours les plus éprouvés de ma carrière. Je comprends, que vous auriez peut-être raison de me dire, qu'au lieu d'avoir l'air de donner je leçons, je devrais m'estimer tenter de vous remercier.\n\nPardonnez-moi, mes amis, si j'ai trop les allures d'une vie passée, dans l'extrême Nord-Ouest. Je puis me taire avec ceux que je ne connais pas ou dont je ne me mêle, mais je ne peux dissimuler, quand je parle à ceux que j'aime et qui j'ai confiance. Puisque vous vous intéressez à Manitoba et au Nord-Ouest, j'ai la certitude que ce que je viens de dire, au lieu de vous blesser, vous arrivera comme l'écho affaibli, mais sincère d'une voix autorisée.\n\nBonne entente à Manitoba\n\nL'entrée en Confédération de la province de Manitoba s'est faite dans des conditions très alarmantes pour la paix et le contentement de ses habitants.\n\nLe danger était trop imminent pour que je ne le visse pas. Secondé par le dévouement intelligent de mon clergé, appuyé par les hommes influents du pays et par les amis si distingués qui nous venaient de la province de Québec, nous nous sommes mis à l'œuvre, unis dans une communauté d'idées et de moyens. Notre action a été comprise. Nous avons fait taire bien des susceptibilités, étouffé bien des ressentiments fermé les yeux et les oreilles à bien des provocations, et obtenu une entente telle que les troubles du Nord-Ouest, cette année, n'ont pas provoqué au milieu de notre peuple la moindre agitation regrettable, malgré la douleur amère qu'ils nous ont causée.\n\nJe dois à la justice d'ajouter que nous n'avons pas été les seuls artisans de la bonne entente. Des hommes influents de nationalité et de croyances différentes des nôtres ont fait comme nous, et avec nous ont contribué à amener un ordre de choses, que personne n'avait d'abord pu espérer.\n\nAMNISTIE\n\nAvant de prendre congé de vous, encore un mot, qui, bien sûr, ira à vos sympathies comme aux miennes. Sans doute qu'il ne nous est pas possible de rendre la vie aux morts, mais il nous est peut-être possible de rendre la liberté aux prisonniers. Demandons grâce pour tous les prisonniers politiques, demandons grâce pour tous les Métis que l'insurrection a conduit au pénitencier, à la prison ou à l'exil. Demandons grâce pour les pauvres sauvages qui ont pris part à ce mouvement insurrectionnel, sans tremper leurs mains dans le sang des victimes du meurtre ou de l'assassinat.\n\nJe crois pouvoir assurer que cet acte de clémence, au lieu de provoquer des divergences d'opinions, rencontrera l'assentiment des hommes raisonnables de toutes les nationalités et de toutes les croyances.\n\n† Alex, Arch. de Saint-Boniface.\n\nSt-Boniface, 7 déc. 1885. —Du Manitoba.\nElement Anglais\n\nPuisque nous en sommes à ce sujet, je ne surprendrai personne, en disant que nos compatriotes d'origine anglaise, qui nous accusent de susceptibilité excessive, agissant et écrivant souvent comme si nous n'étions pas capables de ressentir les affronts qu'on veut nous infliger.\n\nIl est une foule de Canadiens-Anglais qui n'ont jamais vu l'Europe, et sur lesquels, le mot French fait une telle impression, qu'ils \"play britannique\" disparaît complètement. Par exemple, et j'en appelle au bon sens anglais, les injures et insinuations qui ont été dites et écrites contre les missionnaires français catholiques, contre la population Canadienne-française, contre nos soldats Canadiens-français à l'occasion des troubles et autres malheurs qui ont ébranlé le pays, tout cela n'est-il pas d'une absurdité qui n'est égaleée que par l'injustice qui s'y manifeste ?\n\nIl n'a fallu rien moins que les tortures endurées par nos généreux missionnaires et même l'effusion du sang de deux d'entre eux, pour faire taire les calomnies qu'on leur prodiguait, en les accusant d'être des fumeurs de rébellion et de désloyauté. Pourtant on devrait le savoir, ces crimes sont énergiquement condamnés par la Sainte Eglise Catholique, depuis bientôt vingt siècles, et cela, non seulement quand ses enfants ont comme nous l'avantage de vivre sous la protection de lois sages et équitables, mais bien encore, lorsqu'ils ont été les martyrs de la cruauté des tyran.\n\nQuant à notre origine française, elle est assez noble pour que ceux qui ne la partagent pas dessinent la respecter. Nous pouvons nous consoler à la pensée que ceux qui nous vilipendent tant, ne nous con-\n\nuaisent point. Faisons-nous connais-\n\nson par les crisilleries et les chants sé-\n\nrieux dans la rue, nous en feront ceux-\n\nci qui ne savent pas ce qu'ils font (malheureusement) pour nous, ils sont trop nombreux à ignorer l'histoire du Canada, non seulement l'époque héroï-\n\nque du Régime Français, mais bien aussi depuis la conquête. Notre histoire est toute enrichie de faits honorables pour nous; aucun Anglais de bon sens ne peut étudier cette histoire, sans voir se dissiper au moins une partie des préjugés que lui et les siens causent avec complaisance.\n\nC'est l'étude de cette histoire qui dès 1847, inspirait au London Times la réflexion suivante : \"Qui est-ce qui nous a conservé le Canada, jusqu'à ce jour ? Ce n'est rien de ce qui lui est venue de ce pays... Ce ne sont point ses affinités po-\n\nlitiques. Ce n'est pas la similitude de race. Ce n'est pas la communauté des institutions. Ce n'est pas la force des armes, c'est l'origine française du Ca-\n\nnada que nous devons qu'il soit notre.\"\n\nLes habitudes sociales ont prevalues contre les antipathies nationales, et son régime primitif de seigneurs, de Prêtres et d'habitants, a été fidèle, à nous leurs recents concitoyens, lorsque notre propre chair et notre propre sang nous chassait du sol.\"\n\nJe remercie un ami qui n'est pas d'ori-\n\ngine française, de m'avoir communiqué cet article, je prie mes autres amis non fran-\n\nçais de vouloir bien le lire.\n\nAux Canadiens-français\n\nA mes nationaux je dirai : \"Soyez fi-\n\ndèles à notre histoire.\"\n\nOn s'irrite de ce que non content d'avoir pendu Riel en réalité, on a voulu avant et après le pendre en effigie. Je ne chercha-\n\nrai pas à pallier cet acte indigne.\n\nJ'ai eu bien honte, quand à Winnipeg on a fait passer le Lieutenant-Gouverneur de la Province et le général Middleton sous un échafaud de fantaisie, dressé à la place d'un arc de triomphe.\n\nLe regret éprouvé dans cette circonstan-\n\nce n'a pas diminué celui que j'ai ressenti,\n\nquand j'ai appris qu'en maints endroits de la Province de Québec, on avait dressé des échafauds et des bûchers, pour y simuler l'exécution d'hommes publics, dont on n'est pas obligé d'approuver tous les actes, mais auxquels on doit le respect que commandent les hautes positions qu'ils occupent.\n\nOh ! mes chers compatriotes, veniez en croire à ceux qui parmi nous pensent sérieusement ! Des actes comme ceux que je viens d'indiquer ne peuvent pas grandir au peuple.\nLA SITUATION\n\n— PAR —\n\nMGR ALEXANDRE TACHÉ,\n\nARCHÈVEQUE DE SAINT-BONIFACE.\n\n[Signature]\nLA SITUATION\n\n— PAR —\n\nMgr Alexandre Taché,\n\nArchevêque de Saint-Boniface.\nLA SITUATION\n\nPAR\n\nMgr Alexandre Taché,\n\nArchevêque de Saint-Boniface.\n\nVoici venir la fin de 1885, cette année a été grosse d'événements pour toute la Puissance du Canada et en particulier pour le Nord-Ouest Canadien. Les complications ont été si graves, les conséquences si multiples que malgré les nombreuses prières qui m'ont été faites avec instances, de faire part au public de mes idées, j'ai cru devoir garder silence jusqu'à ce jour. À différentes reprises, des journaux ont prétendu me faire parler, mais leurs assertions n'ont jamais été autorisées et par conséquent ne sont pas de moi.\n\nCe silence, j'aurais peut-être continué à le garder, si mon nom n'avait pas été mêlé, d'une manière aussi injuste que déloyale, au débat qui a été provoqué par l'attitude prise récemment dans la Province de Québec. Malgré mon désir sincère de me tenir à l'écart des luttes et de l'agitation, je me vois forcé de dire ce que je pense,\npuisqu'on s'obstine à me prêter des idées que je n'ai jamais eues, des sentiments que je répudie.\n\nJe ne suis point homme de parti, je n'ai aucun désir de flatter, ni d'humilier qui que ce soit, mais j'aime mon pays et je veux apporter à sa prospérité et à son bonheur, tout le concours dont je suis capable; puis, pour l'accomplissement de ce devoir, je sais que s'il y a un temps pour se taire, il y a aussi un temps pour parler, c'est le désir du bien qui me porte à rompre le silence.\n\nQuant à parler, tout le monde convient facilement que c'est la vérité qu'il faut dire: la vérité sans tergiversation, sans faux fuyants; c'est cette vérité telle qu'elle m'apparaît, que je veux affirmer. Je prévois que pour arriver à ce but, je cours le risque de froisser bien des susceptibilités, provoquer peut-être des colères; j'accepte à l'avance ces tristes responsabilités, mais à la condition qu'on n'en fera peser les conséquences que sur moi personnellement.\n\nMAUX ET DANGERS DE LA RÉBELLION.\n\nDepuis neuf mois, notre pays a éprouvé des chocs, des malheurs, des désastres; qui ont eu un violent retentissement par tout le monde. Puis, faut-il le dire, ce pays que nous aimons tant, a couru d'autres dangers qui, pour n'être pas même soupçonnés, par le plus grand nombre, n'en ont pas été moins réels ni moins épouvantables. Comme\npeuple, nous avons subi une humiliation profonde. Comme hommes, un cri d'horreur s'est échappé de nos poitrines à l'aspect de cruels massacres. Comme citoyens, nous avons eu à déplorer la guerre civile, la guerre qui a porté le deuil et la désolation dans de nombreuses familles. Un sang généreux a coulé, et, avec lui, des larmes abondantes. Puis l'échafaud s'est dressé pour faire ses victimes. Les cachots enferment des citoyens d'une grande honorabilité, des hommes dont la vie avait été sans reproche jusqu'à ce jour. Tous ces fléaux, tous ces maux qui semblaient impossibles, il y a un an, ont eu lieu, et il n'y en a pas un parmi nous qui n'ait pas eu sa part de souffrance au milieu de tous ces désastres. Moi aussi j'ai eu ma large part aux souffrances morales qui ont été endurées, il me serait plus que difficile d'exprimer les douloureuses émotions, les cruelles angoisses, les regrets amers que j'ai éprouvés depuis un an. Obligé, par position, de maintenir un calme apparent, que tout bannissait de ma pensée ; gardant le silence lorsqu'il y aurait en tant à dire ; consiant dans un remède qui aurait peut-être eu son efficacité, mais qu'il m'était impossible d'appliquer ; acceptant sans hésitation les imprescritibles exigences du devoir ; ne pouvant et ne voulant bannir de mon cœur les affectueuses sympathies de toute ma vie ; craignant à chaque instant des complications, dont les autorités elles-mêmes ne semblaient pas se préoccuper, qui ont été à deux doigts\nde se produire et qui auraient entraîné le pays entier dans une ruine complète : ignorant les moyens matériels qui pourraient être mis à contribution, et c'était la clef de la situation, puisque quelques centaines de carabines et quelques milliers de cartouches pouvaient consommer notre ruine ; je le répète, j'ai souffert plus que je ne puis le dire ! Non, le public ne saura jamais ce que j'ai enduré, ni quelles appréhensions j'ai eues.\n\nDe plus, je suis convaincu, que tout ce qui s'est produit, peut se renouveler et s'augmenter de tout ce que j'ai craint dans le temps. Sous l'empire de cette conviction, je viens conjurer tous les hommes sérieux qui ont à cœur le bonheur et la prospérité de notre cher Canada, de réfléchir sur les causes qui ont amené nos malheurs.\n\nCAUSES DIVERSES.\n\nDes esprits, hélas ! trop superficiels ou trop intéressés pour se livrer à un examen sérieux et impartial de nos difficultés, croient avoir satisfait à leur devoir de citoyens en s'écriant : \"c'est Riel qui est la cause de tout le mal, c'est lui qui a tout fait ; il a payé de sa tête, maintenant le pays est en sûreté.\" Cette explication est tellement déraisonnable que, si elle était acceptée, nous pourrions nous attendre à de nouveaux troubles, dans un avenir prochain. Le récit sur lequel va se briser une\nembarcation n'est pas la seule cause de naufrage. Le mode de construction, la violence de la tempête, l'insuffisance ou la faiblesse de l'équipage, l'ignorance ou l'incurie des pilotes, en un mot l'ensemble des circonstances dans lesquelles s'accomplit la navigation n'est pas étranger au désastre qui se produit sur un écueil. Quand bien même on serait sauter le rocher, sur lequel vient de se briser l'Algonquin, on ne mettrait pas pour cela la navigation du Lac Supérieur à l'abri de tout péril. C'est donc s'aveugler ou vouloir aveugler les autres, que de rejeter sur un seul, les causes des malheurs que nous déplorons tous.\n\nÀ mes yeux, les responsabilités de nos désastres et de nos hontes sont multiples. Elles pèsent non-seulement sur les agents actifs du soulèvement et les administrations qui se sont succédées au pouvoir, mais aussi sur bien d'autres. Le peuple canadien et ceux qui le gouvernent en acquérant les territoires du Nord-Ouest, n'ont pensé qu'à l'étendue et à la richesse des vastes domaines dont ils entraînaient en possession. Ils n'ont pas compris la situation parce qu'ils ne savaient rien ou presque rien de ce qu'ils avaient besoin de connaître. Les incertitudes, les modifications, les contradictions, etc., etc., qui se trouvent dans les statuts sont une preuve évidente de mon assertion. Un des plus graves inconvénients, c'est que les autorités, partageant les préjugés de provinces entières, ont pénétré dans le Nord-Ouest, avec la\ndéfiance contre tous ceux qui s'y trouvaient ou le connaissaient. On s'est cru en possession d'un pays ordinaire, tandis qu'au contraire, on arrivait dans un pays entièrement inconnu.\n\nCette ignorance n'aurait pas été si complète si on avait voulu prêter une oreille attentive aux informations qui ont été données.\n\nDes hommes distingués par leur caractère, leur position et leur expérience ont tenté, à maintes reprises, de donner des suggestions et des renseignements utiles ; on a presqu'invariablement repoussé tout ce qu'ils désiraient faire connaître. On n'a rien accepté en dehors des données fournies par les documents, préparés dans les offices du gouvernement ; et je regrette de le dire, souvent ces informations auraient dû être les seules repoussées.\n\nEMPLOYÉS PUBLICS,\n\nCette première cause de nos difficultés se lie naturellement avec une seconde. Je viens de suggérer l'idée d'hommes en office. Je dois, sans doute, à la justice de dire, que quelques-uns de ces hommes étaient qualifiés pour les fonctions plus ou moins élevées auxquelles ils étaient appelés, mais, hélas ! il n'en a pas été de même de tous. On a confié des emplois même importants à des officiers qui n'avaient aucune des qualités essentielles à l'accomplissement de leurs devoirs. Dans mon humble opinion,\nil en sera toujours ainsi tant que toutes les nominations se feront exclusivement au point de vue des partis politiques. Tout en nommant des hommes indignes, on en a écartés ou laissés dans l'oubli d'autres éminemment aptes et cela uniquement parce qu'il y a cinq; dix ou quinze ans, ils étaient des adversaires politiques.\n\nOn se figure quelquefois que tout est bon pour un pays nouveau, surtout parmi les Sauvages. C'est une grave erreur. Il faut, au contraire plus de sens, plus de tact, plus de savoir faire, dans un pareil pays, puisque tout y est à créer, à y organiser. Dans une ville populeuse, un employé public peut être toléré jusqu'à un certain point, lors même qu'il n'est qu'un sot ou un fat ; ceux qui sont mieux que lui contrebalancent les inconvénients que seul il ferait naître. Dans le désert ou la prairie, c'est bien autre chose. L'incapacité d'un fonctionnaire est d'autant plus saillante qu'il est isolé. Il n'y a point le moindre doute, que si l'on veut bien gouverner le Nord-Ouest, il faut être très particulier sur le choix de ceux auxquels on confie des emplois. Une qualification indispensable pour eux tous, c'est d'être polis et sympathiques envers les natifs et les colons. Un bon procédé, une parole aimable, suffisent pour éloigner ou faire taire un mécontentement. L'autorité a besoin d'exercer un prestige, et c'est une erreur profonde de croire qu'on en impose par la grossièreté et l'arrogance ; ces procédés au contraire, font beaucoup de mal.\net dénotent une ignorance plus grande que celle que l'on croit être l'apanage exclusif des illétrés.\n\nLES COLONS.\n\nUne autre cause de nos difficultés est venue du mécontentement des nouveaux colons eux-mêmes. Le gouvernement, les sociétés de colonisation et autres ont publié à profusion des brochures plus ou moins exactes sur le pays et ses avantages. Le malheureux boom (flèvre de spéculation) de Manitoba a aussi saisi le Nord-Ouest dans ses étreintes. Bien des gens ont vu dans ce pays la terre promise aux avides de richesses, avec ou sans travail. Attirés par ces séductions, bien des gens sont partis pour le Nord-Ouest. Le pays n'était pas encore prêt à les recevoir en nombre. La fatigue, l'ennui, l'isolement, les contre-temps d'autant plus sensibles qu'ils étaient imprévus, furent le résultat d'une immigration trop hâtive et commencèrent là série de déceptions, dont on voulut faire peser toute la responsabilité sur le gouvernement. Les fautes véritables firent croire aux fautes imaginaires. De là, une disposition naturelle, à un mécontentement général. Pour se venger on eut recours à des procédés regrettables. Les plus brillantes espérances étaient déçues. La fortune rêvée ne venait pas. Les difficultés réelles et nombreuses d'un nouvel établissement, au milieu de la solitude, l'absence de la famille, l'inquiè-\ntude de l'avenir, tout cela augmentait le malaise. Puis vinrent les gelées précoces. Oh! que ces gelées ont fait de mal aux gouvernements et aux gouvernes; sans le dire, on agit comme si on entendait les autorités responsables. On s'indigna, on fit des assemblées nombreuses et fréquentes, on dépensa tout ce que l'on sait dépenser d'éloquence dans un pays constitutionnel; on ne voulait pas de révolte contre l'autorité, mais on voulait une évolution quelconque; l'agitation d'abord raisonnables, prit bientôt une autre forme. On fit des suggestions plus ou moins hardies; on savait qu'il y en avait d'autres qui parlaient moins, mais qui agiraient plus. On ne voulait pas l'effusion du sang, mais on désirait ardemment l'effusion des écus du trésor public. On ne pensait pas qu'en somant le vent on récolte la tempête. La chose est tellement vraie, qu'à présent que la tempête est un peu calmée, et quelque violente qu'elle ait été, il est bon nombre de colons qui disent: \"Après tout, nous y avons gagné, il nous faudrait quelque chose de semblable tous les dix ans, nous étions ruinés et les affaires se raniment.\" Aussi tout le monde est d'une loyauté à mettre au défi, celle de leurs Altesses Royales elles-mêmes. Oh! misère des bassesses humaines, il est des gens qui ont poussé à la rébellion, qui se réjouissent des avantages matériels qu'elle leur a procurés et qui, pour dissimuler leur joie, sont les plus ardents à demander vengeance et à parler de loyauté. Le gouver-\nnement doit connaître ce que je viens de dire, et il est bon que le pays entier le sache, afin que chacun porte sa part de responsabilité.\n\nD'un autre côté, qu'on ne se méprenne pas sur la portée de mes assertions. S'il y a des colons qui ont joué un rôle indigne en tout ce qui a eu lieu, ce n'est que l'exception. Le grand nombre de ceux qui se sont plaints se sont contentés de faire valoir leurs réclamations. Il y a tout lieu d'espérer que la confiance renaitra et que si les gelées précoces ne les éprouvent pas trop, la prospérité sur laquelle ils ont compté sera leur partage. Je crois d'autant plus facilement à ce retour de la prospérité que l'expérience me persuade que la bonne Providence a toujours en réserve un dédommagement proportionné aux malheurs dont elle permet que nous soyons frappés. Depuis quarante ans que je suis dans le pays, bien des fois les choses m'ont paru assumer un aspect alarmant et chaque fois, les causes mêmes de nos alarmes nous ont procuré des avantages inattendus.\n\nLES MÉTIS.\n\nEn parlant des troubles du Nord-Ouest, la pensée se porte naturellement sur les Métis et cette pensée a le double résultat d'exciter le mécontentement chez les uns et les plus ardentes sympathies chez les autres. Tous ceux qui me connaissent savent que j'aime la population métisse.\nJe me rangerai toujours du côté de ceux qui sympathisent avec elle. Avant de parler de la part, prise par les Métis, dans les troubles du Nord-Ouest, je veux citer ici les paroles prononcées à leur sujet, par Lord Dufferin, en son discours d'adieu à Manitoba, le 29 septembre 1877 : \"Il n'y a pas le moindre doute qu'une large part des bonnes dispositions, qui existent entre les Peaux Rouges et nous-mêmes, est due à l'influence et à l'action de cette inappréciable classe d'hommes les Métis habitants et pionniers de Manitoba, (vifs applaudissements) qui combinant, comme ils le font la vigueur, la force et l'amour des aventures, naturels au sang indien qui coule dans leurs veines, avec la civilisation, l'instruction et la force intellectuelle qu'ils tiennent de leurs ancêtres paternels ont proclamé l'évangile de la paix, de la bonne volonté et du respect mutuel, avec des résultats également avantageux au chef sauvage dans sa loge et au colon dans son chantier. (Applaudissements renouvelés.) Ils ont été les ambassadeurs entre l'est et l'ouest; les interprètes de la civilisation et de ses exigences vis-à-vis de ceux qui habitent la prairie, tout comme ils ont dit aux blancs, quelle est la considération justement due aux susceptibilités, à l'amour propre si sensible aux préjugés, au désir inné de justice de la race sauvage. (Applaudissements continus.) De fait, les Métis ont fait pour la colonie ce qui\nne se serait pas accompli sans eux ; ils ont établi entre la population blanche et indienne, des sentiments traditionnels de bon vouloir et d'amitié, qu'il n'aurait pas été possible d'établir sans eux. (Applaudissements).\n\nSi les paroles précédentes avaient été mieux comprises, si la ligne de conduite qu'elles semblent indiquer avait été suivie, le pays n'aurait pas eu à déplorer les maux qui sont venus fondre sur lui. Quand Lord Dufferin a visité Manitoba, heureusement pour l'honneur des Métis, il n'y avait pas de chansons pâles. Son Excellence a dû voyager comme on voyagéait alors, et tout naturellement, il a voyagé avec des Métis. Avec eux, il a parcouru la prairie, il a traversé la forêt, il a connu la charrette et le canot d'écorce, il n'a pas dédaigné de parler avec ses guides. Sachant le français, il n'a pas eu besoin d'interprète ; intelligent, il a compris la population ; homme d'état, il a dit au pays et aux aviseurs des représentants de Sa Majesté : voici le passé des Métis, leur utilité, quelques-unes de leur nobles qualités ; voyez ce que vous devrez faire à l'avenir. Les suggestions du grand diplomate n'ont pas été comprises. On a mieux aimé continuer sur le ton donné ; par le soldat heureux qui est entré au Fort Garry longtemps après que les Métis lui en avaient ouvert les portes. Le colonel Wolseley avait traité les Métis de \"bandits et de lâches.\" Cette stupide assertion (c'est l'appréciation qu'en a fait le ministre de la milice d'alors) a fait\nUn grand nombre de journaux l'ont répétée, les officiers de tous grades s'en sont inspirés; et au lieu de rendre aux Métis la justice à laquelle ils avaient droit, on en a souvent oublié, à leur égard les prescriptions les plus élémentaires. Au lieu de les traiter comme des gentilshommes traitent tout le monde, on s'est permis à leur égard des grossièretés et des insolences capables de blesser les susceptibilités les plus légitimes. Un rude et dédaigneux : I don't talk French, a souvent été l'unique réponse à des demandes légitimes. On a oublié qu'étant les enfants du sol, ils avaient des droits particuliers. Si au moins on avait voulu se souvenir qu'étant le lien naturel, les intermédiaires les plus efficaces entre les sauvages et les blancs, leur concours était comme nécessaire! Au lieu de se rappeler ce que dit Lord Dufferin et ce qui est vrai, en parlant de la paix qui régnait dans le pays; on a invoqué une prétendue Canadian Policy with the Indians, qui n'existait que dans l'imagination, puisque, en réalité, le Canada ne fait que d'entrer en relations avec nos sauvages. Les tristes événements de cette année prouvent jusqu'à l'évidence, que ce sont les Métis qui maintenaient les tribus indiennes dans leur attitude pacifique. À la première rumeur de rupture entre les Métis et les autorités, les sauvages se sont soulevés; ils se soulèveront encore, si des circonstances analogues se reproduisent.\nQuant à la question de la prétendue la-\ncheté des Métis, je crois qu'elle a été résolue\namplement!\n\nAprès ces réflexions et ce qu'il y a de\nconnu officiellement, il m'est impossible\nd'exonérer les autorités de toute responsa-\nbilité. Depuis quinze ans, on aurait dû\nfaire autrement qu'on n'a fait. Je le ré-\npète; je ne suis pas homme de parti poli-\ntique, mais je crois que les deux partis ont\nleurs responsabilités. On aurait dû et on\naurait pu prévenir les troubles. Que n'a-t-\non écouté ceux qui les prévoyaient et qui\nen ont averti qui de droit? Nos hommes\nd'État ont mon respect, mais, l'erreur est\ntrop commune parmi les hommes pour\ncroire qu'ils ne pourront pas souffrir qu'une\nvoix amie leur dise, qu'ils se sont trompés.\nD'ailleurs, la justice veut qu'on se souvienne\nqu'ils ne sont pas les seuls coupables. Les\nbanquettes ministérielles sont au nombre\nde treize, mais les banquettes parlemen-\ntaires se chiffrent par près de trois cents.\nIl est sans doute pénible, et humiliant de\nsavoir, que des Ministres de la Couronne\nont pu affirmer officiellement qu'il ne s'était\njamais fait de démarches en faveur des\nMétis, soit par eux-mêmes, soit par leurs\namis, mais d'un autre côté, il est aussi bien\npénible de savoir que les voix isolées qui se\nsont fait entendre dans les deux chambres\nde notre Législature, n'ont pas trouvé un ap-\npui assez influent pour forcer à l'étude ap-\nprofondie de la situation et des moyens de\nremédier à ce qu'il y avait de défectueux.\nDire qu'il n'a fallu rien moins que l'effusion du sang et la dépense de millions, pour faire comprendre à ceux qui s'occupent de la chose publique, à quelque titre que ce soit, que non-seulement le Nord-Ouest est un vaste pays, mais qu'il y a là de vastes questions sociales, qui sont loin d'avoir reçu une solution satisfaisante !\n\nOn parle beaucoup de la puissance de la presse. C'est en effet, un très-puissant levier. Mais les aborigènes de ce pays ont le droit de se demander si tous les organes de la publicité leur ont été utiles. En Canada, règle générale, les journaux se rédigent au point de vue de l'intérêt des partis politiques. Les uns attaquent le gouvernement sans la modération nécessaire pour produire un bon résultat. D'autres au contraire le louent avec une ardeur encore plus regrettable que les attaques. Dire qu'aujourd'hui, il y a des journaux qui pour déplacer la responsabilité veulent rendre le vénérable Monseigneur Grandin, ses dévoués missionnaires et moi-même responsables des fautes commises à l'égard des Métis !\n\nCes assertions ridicules et mensongères sont plus de tort que de bien à ceux que l'on veut servir et par suite, sont très-dommageables aux intérêts publics.\n\nLES SAUVAGES.\n\nEn commençant à parler des Métis j'ai été heureux d'invoquer, en leur faveur, le témoignage de Lord Dufferin.\nEn parlant des sauvages, j'éprouve une joie analogue, puisqu'il m'est permis de citer les paroles d'un autre représentant de notre Gracieuse Souveraine. Le Marquis de Lansdowne a voulu voir les sauvages, leur parler, les entendre et voici les nobles paroles, que ces conversations lui ont inspirées, d'après la traduction que j'ai sous les yeux : \"Il est impossible de rencontrer ces pauvres gens et d'entendre leur dire, sans ressentir une vive sympathie pour eux; vu la situation actuelle où ils se trouvent. Ils sont les habitants originaires de ce continent. Ils se considèrent eux-mêmes, et non sans raison, comme légitimes possesseurs du sol. Aussi, il ne faut pas être surpris de voir ces pauvres sauvages, maintenant que le buffle, de l'existence duquel dépendait leur propre existence, depuis nombre d'années, est presque complètement disparu, se livrer de temps à autre, à une sorte de désespoir, cela, surtout lorsqu'il voit, comme ils le disent eux-mêmes, les blancs s'enrichir d'année en année, et eux, au contraire, devenir de plus en plus pauvres. Ce n'est pas ici l'endroit de discuter la question du titre qu'ils prétendent avoir aux terres du Nord-Ouest. La valeur de ce titre, ne se résume pas tant à une question légale, qu'à un droit moral que possèdent ces pauvres gens, de recevoir un traitement équitable de ceux qui ont répandu dans ce pays, le flot irrésistible de la civilisa-\n\"tion, devant lequel ces races primitives\n\"ont dû céder le pas et reculer.\"\n\nCes paroles ont été prononcées par le\nGouverneur-Général à Winnipeg le 22 octobre dernier. J'ai eu le plaisir de les entendre. L'émotion de Son Excellence était si profonde qu'elle se traduisait dans sa voix. Ces paroles si sympathiques furent vivement applaudies. On voyait l'homme intelligent qui a compris la gravité d'une question et l'homme de cœur, épris d'un généreux enthousiasme pour des êtres humains que notre civilisation tant vantée ne sait que reculer ou attendant qu'elle les détruisse.\n\nLes sauvages ont eu leur part aux troubles. Les uns par de cruels massacres, dont rien ne peut pallier l'horreur, les autres par une attitude regrettable sans doute, mais pleines, à certains points de vue, d'enseignements importants pour ceux qui savent réfléchir et sentir.\n\nLes sauvages du Nord-Ouest ! Voilà une classe d'hommes bien peu comprise du peuple Canadien en général et qui ne le sera jamais entièrement que par ceux qui parlent leur langue, qui ont vécu avec eux et qui leur ont voué leurs sympathies. Jamais le Canada ne saura quelle épreuve il fait subir aux fiers enfants du désert, en les parquant sur des réserves pour souffrir les angoisses de la faim et devorer les répugnances d'une demie captivité.\n\nIl faut avoir vu l'indomptable sauvage se dresser au milieu des immenses prairies ;\nse draper avec complaisance, dans sa demi-nudité ; promener son regard de feu sur ces horizons sans horizons ; humer une atmosphère de liberté qui ne se trouve nulle part ailleurs ; se complaire dans une sorte de royauté qui n'avait ni les embarras de la richesse, ni la responsabilité de la dignité !\n\nIl faut avoir vu cet infatigable chasseur, élevant jusqu'à une sorte d'enthousiasme religieux, les péripéties, les chances et les succès d'une chasse qui n'a jamais eu de parallèle !\n\nIl faut avoir connu ce flâneur à qui l'abondance permettait de passer presque toute sa vie dans une oisiveté à laquelle le caprice seul offrait des variétés. Oui, il faut avoir vu tout cela, et voir le sauvage d'aujourd'hui, traînant sa misère, privé de son incomparable indépendance ; dans un état continu de génie et de demi-jeûne ; ayant ajouté à ces vices les dégoutantes conséquences de l'immoralité des blancs !\n\nIl faut avoir vu tout cela, et l'avoir vu sous l'influence de la sympathie, pour comprendre tout ce que souffrent les Sauvages aujourd'hui.\n\n...Qu'on ne parle pas des traités comme compensation à ce changement. Ces traités, le sauvage sans culture ne les n'a pas compris. Il en a compris la forme, si vous voulez, mais il n'en a pas saisi la portée, par conséquent n'en a pas accepté les conséquences. Je dis plus, le gouvernement et ceux qui ont fait des traités en son nom,\nont jamais compris eux-mêmes ce qu'ils faisaient, dans ce sens du moins qu'ils n'ont jamais su quelle position inacceptable ils préparaient aux Sauvages, en maintes circonstances. Aussi, volontiers, je dirai, avec Son Excellence le Gouverneur-Général : \"Il ne faut pas être surpris de voir ces pauvres Sauvages se livrer de temps à autre à une sorte de désespoir.\" Les plus stoïciens ne pourront s'empêcher de dire que ces Sauvages ont \"un droit moral à un traitement équitable.\"\n\nC'est plus le temps que jamais de penser aux fautes qui ont été commises à leur égard. On les a laissés en proie aux séductions d'hommes d'une immoralité révoltante, et quand l'attention a été attirée sur ce point, les amis de l'humanité ont eu un regret de plus à enregistrer, par suite les Sauvages ont conçu un profond mépris pour des personnes qu'ils auraient en besoin de respecter.\n\nDans d'autres circonstances on a dépouillé les Sauvages de la pitance qui leur était assignée, ou on lui a donné de plus mauvaise grâce qu'on ne serait un chien. On a dit blanc et noir quand ce n'était ni l'un ni l'autre. L'indien qui est beaucoup plus intelligent qu'on ne fait semblant de le croire a senti son mépris s'augmenter.\n\nC'est parmi les Sauvages surtout, qu'il est important de faire un choix judicieux de ceux qui ont à exercer une autorité quelconque. Ce choix, je suis heureux de le dire, est ce qu'il doit être en maints en-\ndroits, et la conséquence c'est que là, les Sauvages sont satisfaits et le gouvernement a aussi raison de l'être.\n\nRien, absolument rien ne peut atténuer les massacres du lac La Grenouille, c'est même une sentimentalité exagérée, que de vouloir blâmer le gouvernement d'avoir laissé exécuter les auteurs de ces forfaits.\n\nJe ne veux donc nullement justifier les Sauvages, mais puisqu'il est à propos que la vérité soit connue, et au risque d'étonner beaucoup, j'affirme que ces massacres n'ont pas été sans provocations du moins éloignées. J'invoque le témoignage d'une des victimes elle-même. Le Révé P. Fafard disait à un de ses confrères qui me l'a répété : Un tel est d'une brutalité indignes envers les Sauvages. Il se sera tué quel que jour. Celui dont il était question a été tué et deux généreux missionnaires ont augmenté le nombre des victimes, qu'ils voulaient protéger.\n\nUn gentilhomme, contre la véracité duquel je ne puis avoir de doute, m'a assuré à moi-même que des Sauvages lui avait dit, en 1884, que tel individu les traitait comme des chiens, et ce dernier aussi a été tué par un des Sauvages qui se plaignaient de lui. Je dis ces choses, si pénibles à dire, parce que les deux cas que je cite ne sont pas les seules exceptions aux bons traitements auxquels ces pauvres gens ont un droit moral, et je le dis, puisque je parle pour l'avenir encore plus que pour le passé.\nBien sûr, personne ne m'accusera de manquer de patriotisme ni de justice, quand j'affirme que je regrette beaucoup, que certains employés n'aient pas été dignes de la confiance que je suis si heureux de voir accorder à d'autres du département indien, qui certainement méritent cette confiance à un haut degré. Sans flatterie ni hésitation, je dis qu'il y a dans ce département, comme dans les autres, des hommes honorables, dévoués et intelligents qui font du mieux possible, au milieu des difficultés sans nombre, qu'ils rencontrent dans l'accomplissement de leurs devoirs.\n\nOn a tort de jeter sur les Métis toute la responsabilité du soulèvement des sauvages. L'alliance des uns et des autres est naturelle et doit se produire indépendamment de toute tentative ad hoc. Il y a entre ces deux races communauté de langue, d'origine et j'ajouterai de mécomptes.\n\nDans la prairie et dans la forêt, le sauvage a reconnu la supériorité du Métis, sans la jalouser, parce que c'était son parent; aussi, dès que les Métis ont manifesté du mécontentement, les sauvages en ont nécessairement tiré une conclusion a fortiori, qui n'a pas pu manquer d'avoir son effet. C'est une des raisons pour lesquelles il était si important de ne pas s'alléger l'attention des Métis, mais, bien au contraire de se les ménager, comme intermédiaires efficaces.\n\nNon-seulement, les sympathies naturelles des Sauvages pour les Métis se sont maint...\nfestées au milieu de nos troubles, mais les différentes nations sauvages ont senti naitre cette sympathie les unes pour les autres.\n\nLes Cris et les Pieds-Noirs se sont poursuivis, pendant des générations, d'une haine féroce. Les missionnaires avaient réussi à diminuer la féroce, sans pouvoir détruire la haine nationale. Aujourd'hui, cette haine a fait place à l'amitié. Crow-Foot pleure la captivité de Pound-Maker et de Gros Ours. La tribu entière des Pieds-Noirs donnait des signes de peines, quand on lui apprenait la mort d'un Cris ou d'un Assiniboine tué à la guerre, le printemps dernier.\n\nCe seul fait a une portée immense, il indique que les blancs sont devenus l'ennemi commun, le seul ennemi.\n\nCeci prouve aussi, qu'on faisait un calcul aussi faux que cruel, quand on parlait d'armer les Pieds-Noirs contre les Cris. Ce procédé n'aurait eu d'autre résultat que de procurer des armes aux uns et aux autres, pour l'anéantissement des blancs dans le Nord-Ouest.\n\nJ'ai lu ces jours derniers, quelques réflexions qui m'ont paru bien étranges : C'était, faut-il le dire, des plaisanteries sur la pendaison des sauvages à Battleford. L'auteur de ces inepties menaçait ni plus ni moins les Indiens du Nord-Ouest de les prendre tous pour leur donner une leçon efficace. \"Que le canon soit la dernière raison des Rois,\" c'est déjà assez regrettable, vis que dire de ceux qui veulent que la\nordre soit la première raison de la civilisation chrétienne vis-à-vis de nos sauvages, à la première difficulté sérieuse que nous avons avec eux !\n\nAvant de terminer ces réflexions, je me crois tenu de dire qu'elle est pour les sauvages, l'impression produite sur eux par les événements qui se sont déroulés dans le Nord-Ouest. Je ne sais pas encore, ce qu'ils pensent des exécutions qui viennent d'avoir lieu, mais je sais bien ce qu'ils pensent du mouvement de nos troupes.\n\nLe Canada serait dans l'erreur, s'il croyait que les sauvages du Nord-Ouest sont terrifiés, et qu'ils ont une très-haute idée de nos armements ; c'est tout le contraire qui a lieu. Ce résultat doit étonner, mais, quelqu'étonnant qu'il soit, il a ses dangers et il est à propos qu'il soit connu, pour éviter des méprises.\n\nLOUIS RIEL.\n\nJ'ai promis de dire la vérité sans tergiversation, aussi il me faut aborder le point le plus délicat de la question de nos troubles et parler de celui qui a été le plus en évidence et que l'on dit résumer toute la situation.\n\nLouis Riel a été choisi par les Métis comme leur chef. Ils sont allés le chercher sur la terre étrangère ; ils l'ont amené au milieu d'eux, sur les bords de la Saskatchewan. Cette demande s'est faite par suite de l'inutilité des efforts tentés par les Métis\net leurs amis pour faire reconnaître leurs droits. Les Métis, ne comprenant pas comment on s'obstinait à les ignorer, se sont persuadés qu'ils étaient joués par ceux mêmes en qui ils avaient mis, jusqu'alors, leur confiance. Ils crurent que Riel étant des leurs, ayant souffert avec eux et pour eux, mettrait plus de zèle à faire valoir leur cause, et par cela même obtiendrait plus de succès. Riel se rendit à Batoche, excité par les uns, sollicité par les autres, il crut voir l'unanimité entre toutes les sections de la population et persuadé par cela même, d'un succès facile, il commença une agitation toujours dangereuse, surtout au milieu d'une population plus prompte à l'action qu'avidé de parler.\n\nCette agitation développa de plus en plus le mécontentement. Des menaces indiscretes, des vantardises stupides et des encouragements secrets conduisirent les esprits à un état d'excitation des plus déplorables. L'assurance qu'on enverrait une commission ne fut point acceptée; on aimait mieux croire à une rumeur qui allait à dire qu'au lieu de leur accorder leurs droits, les autorités envoyaient des fers pour le chef et du plomb pour ceux qui le protégeraient.; cette conviction produisit le résultat qu'on devait en attendre. Les Métis songèrent à la résistance et à se défendre. Mal armés, sans munitions, sans provisions, ils s'emparèrent des magasins qui se trouvaient dans le voisinage. L'attaque inconsidérée faite contre eux, au Lac\nles Canards, fut une déclaration de guerre. En suite de ce drame sanglant occupe le Canada depuis plusieurs mois. Ce n'est peut-être pas le temps de rectifier les nombreuses erreurs qu'une publicité trop hâtive accumulées autour de l'histoire de cette douloureuse période. Ce qui n'est que trop certain, c'est que des vies généreuses ont été sacrifiées : la misère et la désolation règnent au milieu d'établissements naguère prospères.\n\nDes hommes respectables subissent une douloureuse condamnation au milieu de criminels avec lesquels ils n'ont rien de commun, et Louis Riel a été exécuté à Régina, le 16 novembre dernier.\n\nL'opinion publique s'est partagée sur ce dernier événement, et en se partageant, elle s'est passionnée.\n\nEn général, la presse anglaise approuve cette triste exécution, tandis que la presse française la condamne, comme une cruauté inutile.\n\nDes deux côtés, il y a des exceptions. La presse américaine est unanime ou à peu près, à considérer cet acte de nos autorités comme une faute politique. Je regrette extrêmement que des hommes de qui on devait attendre mieux se soient oubliés jusqu'à vouloir faire peser la responsabilité de cette mesure extrême sur ceux mêmes qui étaient les moins capables de la conseiller.\n\nLes missionnaires ont souffert, mais les missionnaires ne savent pas crier ven-\nLa situation\n\nLes deux seuls qui ont été appelés en témoignage en cette cause, ont rendu témoignage dans le sens de la défense. Pourquoi joue-t-on le rôle si indigne de recommencer le procès de l'infortuné exécuté devant le public, en invoquant les témoignages des Révérends Pères André et Fourmond, qui mis sous serment à la cour, ont rendu un témoignage dont la conclusion naturelle n'était certainement pas l'échafaud ! On va jusqu'à torturer l'âme si généreusement aimante de Monseigneur Grandin, en lui prêtant un rôle indigne de sa position et de son cœur. Et tout cela, on a l'audace de le dire, pour faire prévaloir la vérité !\n\nLe gouvernement a laissé faire l'exécution, il en a donc la responsabilité, et c'est une indignité de vouloir la faire peser sur d'autres, qu'on s'est bien donné garde de consulter à ce sujet. Pour ma part, une observation de vingt années m'a donné des convictions diamétralement opposées à celles que l'on invoque. J'avais trop de raisons d'étudier dans ses moindres détails les dispositions et les actes de mon infortuné protégé, pour pouvoir ne pas me rendre compte de ce qu'il était et de ce qui a pu le conduire à la voie déplorable qu'il a suivie. Il y a bien des années que je suis convaincu, au-delà de la possibilité d'un doute, qu'à côté des brillantes qualités de l'esprit et du cœur, l'infortuné chef des Métis était en proie à une mégalomanie et théomanie qui seules peuvent expliquer tout ce qu'il a fait jusqu'au dernier moment. Mes convictions\nsont sincères, mais, on n'en peut conclure que ceux qui ne les partagent pas, manquent tous de sincérité. Les conséquences naturelles de mes convictions sur ce triste sujet, ont été repoussées et j'ai vu disparaître l'espoir que j'avais entretenu jusqu'au dernier moment. Malgré cette déception, je ne me permettrai pas d'injurier ceux qui me l'ont infligée. Je ne désespère pas assez de notre pays, pour croire que nos hommes publics soient capables de se laisser inspirer uniquement par la haine et les froids calculs qu'elle inspire.\n\nJe ne sais pas ce qui s'est passé dans le conseil de ceux qui nous gouvernent, mais je ne puis pas croire qu'ils ne se soient pas mis en face de leurs obligations. Dans tous les cas, ils ont accepté la responsabilité, et je ne veux pas faire naître ou développer des embarras auxquels il est difficile d'assigner une issue favorable.\n\nAGITATION DANGEREUSE.\n\nJe ne dissimulerai pas que la douleur que j'éprouve depuis le commencement de nos troubles, au lieu d'être allégée a été de beaucoup augmentée depuis trois semaines. Je ne fais aucune allusion à un mouvement qui ne serait que politique et enfermé dans les limites déjà si larges de la constitution. Que ceux qui ont un vote à donner soit dans les enceintes parlementaires, soit sur les hustings, que ceux là pesent tout dans l'intime de leurs con-\nscience et dans la balance de l'amour de leur pays et qu'ensuite ils votent suivant leur convictions. C'est leur droit, c'est leur devoir.\n\nÀ côté de la question purement politique, il y a une question sociale à laquelle je suis trop étroitement lié pour ne résoudre à garder le silence.\n\nJe ne crois pas avoir besoin de dire que j'aime mon pays. La province qui m'a vu naître a gardé tout mon cœur et je n'ai fait qu'étendre le cercle de mes affections, en assimilant le pays de mon adoption à celui de ma naissance. Donc, tout ce qui touche Québec, tout ce qui touche Manitoba et le Nord-Ouest, tout cela me touche vivement, et c'est pour cela, qu'en face d'une agitation qui ne peut pas être sans dangers, je prends la liberté aussi respectueuse qu'affectueuse de dire à mes amis de ne pas se laisser entraîner dans un mouvement qui peut leur être très-préjudiciable à eux-mêmes et à la cause qu'ils embrassent avec tant de générosité.\n\nAu milieu de tout ce qui s'est dit et s'est écrit depuis trois semaines, j'ai admiré les nobles élans d'un généreux patriotisme. Cependant pour être sincère, je dois avouer que j'ai déploré bien des élans, qui, dans mon humble opinion, ne sont pas l'écho du même sentiment ou du moins ne révèlent pas la prudence extrême qui s'impose au vrai patriote dans les crises de l'histoire d'une nation.\nLes querelles de races et surtout de religions, sont des instruments bien dangereux à manier ; surtout dans un pays où des hommes d'origines et de croyances différentes sont en relations journalières. Il en est des différentes nationalités un peu comme des partis politiques. Chacun se contente de voir les bonnes aspirations auxquelles il tend, sans tenir compte de celles des autres : tout comme on ferme les yeux sur ses propres défauts, pour les ouvrir démesurément sur ceux d'autrui.\n\nUn retour sincère sur soi-même, finirait par convaincre que l'égoïsme personnel est ordinairement la cause de l'égoïsme national, comme de l'égoïsme politique. Ceci ne veut pas dire qu'il faut s'oublier soi-même ou les siens, jusqu'à ne plus ressentir ni essayer de faire taire l'injure, quand elle nous est prodiguée.\n\nÉLÉMENT ANGLAIS.\n\nPuisque nous en sommes à ce sujet, je ne surprendrai personne, en disant que nos compatriotes d'origine anglaise, qui nous accusent de susceptibilité excessive, agissent et écrivent souvent comme si nous n'étions pas capables de ressentir les affronts qu'on veut nous infliger.\n\nIl est une foule de Canadiens-Anglais qui n'ont jamais vu l'Europe, et sur lesquels, le mot French fait une telle impression, que le \"fair-play britannique\" disparaît complètement. Par exemple, et j'en\nappelle au bon sens anglais, les injures et insinuations qui ont été dites et écrites contre les missionnaires français catholiques, contre la population Canadienne-française, contre nos soldats Canadiens-français, à l'occasion des troubles et autres malheurs qui ont éprouvé le pays, tout cela n'est-il pas d'une absurdité qui n'est égale que par l'injustice qui s'y manifeste ?\n\nIl n'a fallu rien moins, que les tortures endurées par nos généreux missionnaires, et même l'effusion du sang de deux d'entre eux, pour faire taire les calomnies qu'on leur prodiguait, en les accusant d'être des auteurs de rébellion et de déloyauté. Pourtant on devrait le savoir, ces crimes sont énergiquement condamnés par la Sainte Eglise Catholique, depuis bientôt vingt siècles, et cela, non-seulement, quand ses enfants ont comme nous l'avantage de vivre sous la protection de lois sages et équitables, mais bien encore, lorsqu'ils ont été les martyrs de la cruauté des tyrans.\n\nQuant à notre origine française, elle est assez noble pour que ceux qui ne la partagent pas dussent la respecter. Nous pouvons nous consoler à la pensée que ceux qui nous vilipendent tant, ne nous connaissent point... Faisons-nous connaître, non par les criailles et les chants séditions dans la rue, mais en forcant ceux-mêmes qui ne parlent pas notre langue (malheureusement pour eux et pour nous, ils sont trop nombreux) à étudier l'histoire\ndu Canada, non-seulement l'époque héroïque du Régime Français, mais bien aussi depuis la conquête. Notre histoire est toute enrichie de faits honorables pour nous ; aucun Anglais de bon sens ne peut étudier cette histoire, sans voir se dissiper au moins une partie des préjugés que lui et les siens caressent avec complaisance.\n\nC'est l'étude de cette histoire qui dès 1847, inspirait au London Times la réflexion suivante : \"Qui est-ce qui nous a conservé le Canada, jusqu'à ce jour ? Ce n'est rien de ce qui lui est venu de ce pays. Ce ne sont point ses affinités politiques. Ce n'est pas la similitude de races. Ce n'est pas la communauté des institutions. Ce n'est pas la force des armes, c'est à l'origine française du Canada que nous devons qu'il soit notre. Les habitudes sociales ont prévalu contre les antipathies nationales, et son régime primitif de seigneurs, de Prêtres et d'habitants, nous a été fidèle, à nous leurs récents conquérants, lorsque notre propre chair et notre propre sang nous abhorraient et nous chassaient du sol.\"\n\nJe remercie un ami qui n'est pas d'origine française, de m'avoir communiqué cet article, je prie mes autres amis non français de vouloir bien le lire.\n\nAUX CANADIENS-FRANÇAIS,\n\nÀ mes nationaux je dirai : \"Soyons fidèles à notre histoire.\"\nOn s'irrite de ce que non content d'avoir pendu Riel en réalité, on a voulu, avant et après le pendre en effigie. Je ne chercherai pas à pallier cet acte indigne. J'ai eu bien honte, quand à Winnipeg on a fait passer le Lieutenant-Gouverneur de la Province et le général Middleton sous un échafaud de fantaisie, dressé à la place d'un arc de triomphe.\n\nLe regret éprouvé dans cette circonstance n'a pas diminué celui que j'ai ressenti, quand j'ai appris qu'en maints endroits de la Province de Québec, on avait dressé des échafauds et des bûchers, pour y simuler l'exécution d'hommes publics, dont on n'est pas obligé d'approuver tous les actes, mais auxquels on doit le respect que commandent les hautes positions qu'ils occupent.\n\nOh ! mes chers compatriotes, veuillez en croire à ceux qui parmi nous pensent sérieusement ! Des actes comme ceux que je viens d'indiquer ne peuvent pas grandir un peuple.\n\nEncore une fois, recourez aux moyens constitutionnels tant que vous voudrez, mais n'imprimez pas à notre état social les commotions qui peuvent rendre la vie désagréable pour vous ou pour les autres. Nous sommes catholiques et dans nos relations sociales, nous devons nous rappeler ce qu'il dit un homme illustre : \"que l'Eglise Catholique est la plus grande école du respect ;\" respect pour l'autorité et pour ceux qui la représentent, respect pour tous, même pour ceux qui ne comprennent pas l'obligation de ce devoir.\nDans le cercle rétréci d'une famille, où il y a communauté entière d'idées, de sentiments, d'intérêts, on trouve hélas! beaucoup de divergences. Comment oser espérer que dans un pays aussi vaste que le nôtre, où il y a une si grande différence de nationalités et multiplicités de provinces, comment espérer de pouvoir nous harmoniser, à moins que chacun soit prêt à faire la part de sacrifice qui peut être exigée de lui? Somme toute, nous devons en convenir la Providence nous a fait un sort plus heureux que nous ne pouvions naturellement l'attendre. Nos institutions ont de l'ampleur et de la souplesse; l'atmosphère que nous respirons, est en général plein de liberté. Sans doute, tout autour de nous, n'est pas perfection, mais rien ne s'oppose à ce que nous travaillons avec énergie à ce perfectionnement, pourvu que nous ne dépassions pas les limites circonscrites par le devoir.\n\nLa majorité n'a aucun droit de nous opprimer, aussi quoique nous ne soyons que la minorité, tout le monde est frappé de la position que nous avons pu nous faire.\n\nDéfions-nous des exagérations, défions-nous d'un isolement qui, à un point de vue, pourrait nous flatter, mais qui certainement peut conduire à des conséquences que les vrais amis du pays ne pourraient que déplorer.\n\nVeuillez croire que ce que je dis ici coule d'une plume tenue par une main tremblante d'émotion. C'est pour nous, isolés dans\nl'extrême Nord-Ouest, que vous luttez dans la province de Québec ; c'est de vous, en maintes circonstances, que nous avons imploré secours et appui ; c'est encore, au milieu de vous, que se trouve aujourd'hui, mon si vénérable et si aimé collègue, Mgr Grandin ; c'est à vous qu'il tend la main, en faveur des pauvres ruinés de la Saskatchewan, et je sais que votre main généreuse n'est jamais fermée. C'est vous qui m'avez encouragé, honoré, soutenu par vos sympathies quand j'ai eu la douleur de traverser les jours les plus éprouvés de ma carrière. Je comprends, que vous auriez peut-être raison de me dire, qu'au lieu d'avoir l'air de donner une leçon, je devrais m'estimer trop heureux et me contenter de vous remercier.\n\nPardonnez-moi, mes amis, si j'ai trop pris les allures d'une vie passée, dans l'extrême Nord-Ouest. Je puis me taire avec ceux que je ne connais pas ou dont je me mêle, mais je ne puis dissimuler, quand je parle à ceux que j'aime et en qui j'ai confiance. Puisque vous vous intéressez à Manitoba et au Nord-Ouest, j'ai la certitude que ce que je viens de dire, au lieu de vous blesser, vous arrivera comme l'écho affaibli, mais sincère d'une voix autorisée.\n\nBONNE ENTENTE À MANITOBA.\n\nL'entrée en Confédération de la province de Manitoba s'est faite dans des conditions très-alarmantes pour la paix et le contentement de ses habitants.\nLe danger était trop imminent pour que je ne le visse pas. Secondé par le dévouement intelligent de mon clergé, appuyé par les hommes influents du pays et par les amis si distingués qui nous venaient de la province de Québec, nous nous sommes mis à l'œuvre, unis dans une communauté d'idées et de moyens. Notre action a été comprise. Nous avons fait taire bien des susceptibilités, étouffé bien des ressentiments, fermé les yeux et les oreilles à bien des provocations, et obtenu une entente telle que les troubles du Nord-Ouest, cette année, n'ont pas provoqué au milieu de notre peuple la moindre agitation regrettable, malgré la douleur amère qu'ils nous ont causée.\n\nJe dois à la justice d'ajouter que nous n'avons pas été les seuls artisans de la bonne entente. Des hommes influents de nationalité et de croyances différentes des nôtres ont fait comme nous, et avec nous ont contribué à amener un ordre de choses, que personne n'avait d'abord pu espérer.\n\nAMNISTIE,\n\nAvant de prendre congé de vous, encore un mot, qui bien sûr, ira à vos sympathies comme aux miennes. Sans doute qu'il ne nous est pas possible de rendre la vie aux morts; mais il nous est peut-être possible de rendre la liberté aux prisonniers. Demandons grâce pour tous les prisonniers politiques, demandons grâce pour tous les Mé-\ntis quo l'insurrection a conduit au pénitencier, à la prison ou à l'exil. Demandons grâce pour les pauvres sauvages qui ont pris part à ce mouvement insurrectionnel, sans tromper leurs mains dans le sang des victimes du meurtre ou de l'assassinat.\n\nJe crois pouvoir assurer que cet acte de clémence, au lieu de provoquer des divergences d'opinions, rencontrera l'assentiment des hommes raisonnables de toutes les nationalités et de toutes les croyances.\n\n† Alex. Arch. de Saint-Boniface.\n\nSaint-Boniface, 7 Décembre 1885.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001546.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 51, "total-input-tokens": 64236, "total-output-tokens": 27493, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3172, 1], [3172, 8192, 2], [8192, 13401, 3], [13401, 18513, 4], [18513, 23427, 5], [23427, 28245, 6], [28245, 33257, 7], [33257, 35713, 8], [35713, 40782, 9], [40782, 44862, 10], [44862, 44950, 11], [44950, 44950, 12], [44950, 45025, 13], [45025, 45025, 14], [45025, 45958, 15], [45958, 47289, 16], [47289, 48771, 17], [48771, 50076, 18], [50076, 51544, 19], [51544, 52835, 20], [52835, 54318, 21], [54318, 55653, 22], [55653, 57135, 23], [57135, 58439, 24], [58439, 59858, 25], [59858, 61345, 26], [61345, 62766, 27], [62766, 64239, 28], [64239, 65569, 29], [65569, 66973, 30], [66973, 68359, 31], [68359, 69741, 32], [69741, 71153, 33], [71153, 72544, 34], [72544, 73965, 35], [73965, 75358, 36], [75358, 76654, 37], [76654, 78105, 38], [78105, 79429, 39], [79429, 80926, 40], [80926, 82270, 41], [82270, 83605, 42], [83605, 84914, 43], [84914, 86325, 44], [86325, 87610, 45], [87610, 89037, 46], [89037, 90431, 47], [90431, 91794, 48], [91794, 93099, 49], [93099, 93621, 50], [93621, 93621, 51]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]