[{"id": "d5feb1b1939d0b7a8c4e82415cd5cd4f6723137c", "text": "ELECTIONS DE 1887\n\nLA VRAIE QUESTION\n\nLe 16 novembre 1885, jour de l'exécution de Riel, il fut poussé quelque part un immense cri de joie.\n\nCe sont les orangistes, allez-vous dire, qui se sont montrés barbares et féroces à ce point ?\n\nIls ont pu témoigner une certaine satisfaction, mais des hommes qui ont triomphé ce jour-là, les hommes qui n'ont pas caché leur immense satisfaction, ce sont ceux qui le lendemain, s'apitoyaient avec une suprême hypocrisie sur le sort de leur frère Riel, du martyr du Nord-Ouest, de la grande victime.\n\nQui ce sont les chefs rouges de Montréal et de Québec qui ont poussé ce cri de joie sauvage, ce sont eux, seuls qui avaient quelque chose à gagner à la mort de Riel et jusqu'au dernier moment, ils avaient craind de voir leur projet leur échapper.\n\nSi je suis gracié, disaient-ils dans leurs réunions secrètes, nous sécherons à l'ombre, loin du pouvoir pendant encore dix ans.\n\nSi je tombe, nous soulevrons le Bas-Canada, nous organiserons une immense conspiration et à la faveur du trouble et pendant que le peuple trompé agira sous l'emprise de l'émotion, nous essaimerons le pouvoir.\n\nTel était leur calcul. Du reste, n'ont-ils pas fait tout ce qu'il était possible pour empêcher toute commutation de sentence. Des les premiers jours du procès de Riel, n'ont-ils pas sans cesse fait des appels aux préjugés de race et de religion, n'ont-ils pas cherché\nché à semer la discorde entre les deux provinces d’Ontario et de Québec ? S’ils avaient voulu réellement sauver Riel, ils auraient fait des appels à la modération, à la clémence. Ils auraient invoqué des motifs de conciliation ; ils se seraient efforcés de rendre la tâche du gouvernement plus facile. Mais parler de clémence ne faisait pas leur affaire. S’ils avaient réussi, quel n’aurait point été leur désappointement. Ils se sont dit : “ Attaquons les orangistes, attaquons les protestants ; une fois soulevés, ils reclameront l’exécution de Riel et le gouvernement pris entre deux feux : entre Québec et Ontario, laissera tout naturellement la sentence des tribunaux suivre son cours.\n\nIls étaient bien secondés dans leur œuvre, car les journaux grits d’Ontario ne craignant pas de se mettre en contradiction avec les gazettes libérales de Québec poussaient des cris de bêtes fauves, défaisaient sir John d’oser faire droit aux réclama- tions de la Province de Québec. Voilà quelle était la situation. Les gazettes rouges criaient : “ Sir John va laisser pendre Riel parce que les protestants d’Ontario exigent son exécution et le Globe répondait : si sir John n’exécute pas Riel, ce sera une insulte à la justice ; ce sera un défi lancé à Ontario, ce sera une nouvelle preuve de sa servilité envers les Canadiens-français.”\n\nNous ne voulons pas prétendre que le gouvernement s’est laissé influencer par cette conduite malhonnête, non, il y a été indifférent, mais il a laissé exécuter Riel parce que les tribunaux les plus élevés du Canada et de l’empire ont déclaré sa sentence bien fondée et qu’il était urgent de faire un exemple dans le Nord-Ouest.\n\nMais le jeu des libéraux a été évident en tout ceci. Battus en 1878, battus de nouveau en 1882 parce qu’ils n’avaient pas de programme à opposer à celui du gouvernement, parce que le peuple n’avait pas encore oublié leur régime si désastreux pour notre pays, leur incapacité notoire, leur injustice pour le Bas-Canada, ils se sont dit que leur seule chance d’arriver était de tromper le peuple, de l’empêcher de comparer leur œuvre à celle des conservateurs. Voilà pourquoi Riel est devenu le frère de M. Mercier ; voilà pourquoi les libéraux ont voulu faire un martyr, un héros et en même temps un insensé, de l’homme qui détestait les Canadiens-français pardessus tout, qui\na été un fléau pour le Nord-Ouest, qui a ruiné les catholiques qu'il disait vouloir sauver tandis qu'il ne cherchait dans tout ce qu'il a fait que son avancement personnel.\n\nIl est temps que cette indigne comédie cesse ; il est temps que les Canadiens-français se demandent s'ils doivent continuer à négliger leurs intérêts, risquer leur avenir, sous le prétexte de punir une injustice; mais en réalité pour permettre aux libéraux d'escamoter le pouvoir à Ottawa. En 1873, ils y sont arrivés en organisant la conspiration du Pacifique. Le pays revint trop tard de son erreur, et dut les subir pendant cinq ans. En 1878 et en 1882, ils furent battus, parce qu'ils n'avaient pas de faux prétextes sous la main; et aujourd'hui ils voudraient s'y installer à la faveur de la conspiration Riel. Les Canadiens vont-ils se laisser tromper encore une fois pour regretter leur erreur ensuite pendant cinq ans ? Vont-ils encore oublier la question véritable comme ils ont fait dans les élections de Québec ? Nous sommes certains qu'ils sont trop intelligents pour se laisser blaguer deux fois de suite.\n\nLa vraie question qui devra être discutée aux élections qui commencent est celle de savoir quel est le gouvernement qui a rendu le plus de services à notre province ; qui a le plus fait pour sa prospérité et son avancement matériel. C'est ce que nous étudierons dans les pages qui suivent.\nLES AMIS DE QUEBEC\n\nIl ne faut guère connaître l'histoire politique des dernières années pour contester ce fait qui est devenu une évidence : le gouvernement conservateur s'est montré bien plus généreux, bien plus bienveillant à l'égard de notre province que le régime libéral. M. Laurier et ses amis ne veulent pas convenir de ce fait, lorsqu'ils les rencontrent dans des documents officiels ; il faut les entendre alors peindre en belles phrases l'amour que les grits ont toujours nourri pour nous. Ils nous embrasseraient, il est vrai, s'ils pouvaient nous étouffer dans l'embrassade, mais c'est à cela seul qu'on se réjouit leur affection pour nous. Il est un moyen bien simple de mesurer la valeur relative de l'amitié des libéraux et des conservateurs pour notre province. Les preuves doivent se trouver écrites quelque part et se traduire autrement que par des affirmations des avocats rouges. Ces preuves nous allons les chercher dans les comptes publics et les statuts.\n\nPrenons d'abord le chapitre du gouvernement de Québec et voyons ce que M. Mackenzie a donné, nous ne disons pas seulement au gouvernement de M. de Boucherville, mais à celui de M. Joly. Nous avons beau feuilleter les statuts, nous n'y trouvons absolument rien, ni au compte de M. de Boucherville, ni au compte de M. Joly.\n\nVoyons maintenant ce qu'a fait pour notre gouvernement cet ennemi acharné de notre province qui s'appelle sir John Macdonald secondé par ces traîtres à leur nationalité, les ministres français à Ottawa.\n\nPar le statut 48 Vic. ch. 78, le gouvernement Ross a reçu pour le chemin de fer du nord :\n\nPour la section Est ........................................ $954,000\nPour la section Ouest ...................................... 1,440,000\nPour faire arriver le Pacifique jusqu'à Québec (48-49 Vict. ch. 58) .................................................. 1,500,000\nAugmentation de subsides (47 Vict. ch. 4 et 5) ................................................................. 2,549,213\n\n$6,443,213\nNous voilà en présence d'environ 6 millions et demi de dollars donnés directement pour le bénéfice de la province de Québec! Qu'on nous montre ce que MM. Laurier, Lachapelle, Pelletier et autres ministres libéraux ont obtenu du gouvernement MacKenzie pour Québec; ces patriotes sans pareils qu'on devrait honorer en bronze de leur vivant! L'écho répond à notre question: Rien! rien! Les libéraux ont obtenu quelque chose pourtant et il ne faut pas être injuste au point de ne pas le mentionner.\n\n1o) La charge de lieutenant-gouverneur pour le ministre d'agriculture M. Letellier.\n\n2o) La charge très honorable, très lucrative de juge en chef pour M. Dorion, ministre de la justice du temps.\n\n3o) La charge non moins honorable, non moins lucrative de juge de la Cour Suprême pour M. Fournier, patriote immolé sur l'autel de la patrie à raison de $7,000 par année comme ses deux er devant collègues aussi patriotes que lui.\n\n4o) La charge identique comme lucratif et honneur de lieutenant-gouverneur de Manitoba pour M. Cauchon.\n\nTout cela en moins de 5 ans! Ces messieurs dégotés par les déboires, les misères de la politique n'ont fait pour ainsi dire que passer au pouvoir pour se placer! Et dire que les traitres Langevin, Caron et Chapleau, subissant les avanies sans nom, bataillent pour notre province, pouvant eux aussi s'assurer de confortables et sûres retraites pour le restant de leurs jours, sont encore à leur poste endurant les misères qui ont si vite rebuté MM. Dorion, Fournier, Letellier et Cauchon!\n\nMais on nous objectera: l'item de 2 millions représentant l'augmentation de subsides provincial, le gouvernement fédéral n'était pas libre de nous les refuser ou de nous les donner; il provient de l'augmentation décennale, qui suit l'augmentation de la population. Point du tout. Le gouvernement a fait remonter l'augmentation de subsides qui datait de 1871, et ce à la demande de la province de Québec. Quelques avocats subtils pourraient peut-être arguer que si cette faveur avait été demandée aux libéraux ils l'auraient probablement accordée. Rien n'autorise un pareil argument! Au contraire. En 1873 Sir John proposait d'enlever à la province de Québec une partie de l'excedant de dette de\nl'ancienne province du Canada qui avait été mise à sa charge par l'acte de 1867 et l'on vit le parti gris dirigé alors par MM. Cartwright, Paterson etc., avec leur chef M. Mackenzie se opposer énergiquement.\n\nCette conduite généreuse a sauvé nos institutions provinciales et a permis à notre trésorerie de passer des déficits de $372,000 de M. Joly aux surplus de $25,000 et de $100,000 du gouvernement Ross.\n\nEn rendant justice à notre province, sir John, que l'on représente comme l'ennemi de l'autonomie provinciale, a sauvé nos institutions. Il est évident que sans ces subsides et ces millions distribués à temps, il aurait fallu tellement augmenter les taxes à Québec, que le peuple trompé par les libéraux aurait préféré l'union législative au surcroit d'impôts qu'il aurait fallu payer pour sauver la situation.\n\nPrenons un autre chapitre. Voyons ce que M. Laurier et ses amis ont fait pour les chemins de fer du Bas-Canada pendant leurs cinq années de pouvoir. Espérons que sur ce point, au moins ils feront meilleures figures. Hélas ! trois fois hélas ! pour l'honneur de ce grand patriote, la législation des comptes publics des années 1874, 1875, 1876, 1877, 1878 ne mentionnent pas même le nom de la province de Québec en ce qui concerne les octrois de chemin de fer.\n\nVoyons la suite des statuts et regardons si les ennemis du Bas-Canada ne nous auraient pas mieux traités que les grands-patriotes du parti libéral.\n\nOuvrons les statuts de 1884 et nous trouvons ce qui suit :\n\n| Chemin de Alymer et Pontiac | $272,000 |\n|-------------------------------|---------|\n| Chemin Union Jacques-Cartier | $200,000 |\n| Embranchement de St Charles   | $1,500,000 |\n|                               | $1,972,000 |\n\nSession de 1885 :\n\n| Chemin de Montréal à Borel | $72,000 |\n|----------------------------|--------|\n| du lac St-Jean             | $96,000 |\n| Montréal à lac Champlain    | $30,000 |\n| Long Sault à Temiscamingue  | $25,000 |\n| de la Gatineau à Dessert    | $320,000 |\n| des Basses Laurentides      | $217,500 |\n| Canada Atlantique           | $96,000 |\n\n$1,721,600\nSESSION DE 1886.\n\nChemin du Long Sault ........................................ $ 6,000\nde New-Glasgow à St-Lin .................................. 57,600\nde Héreford à l'International ................................ 108,000\nSt-Félix au lac Maskinongé .................................. 32,000\nde l'Assomption à l'Epiphanie ................................. 11,200\nMontréal et Occidenta (chemin du curé) .................... 361,000\nLacolle de St-Jérôme au Désert .............................. 22,400\nSt-André à Lachute ........................................... 57,600\nSt-Eustache à Ste-Placide ..................................... 300,000\nde la Baie des Chaleurs ....................................... 955,800\n\nC'est encore plus de 4 millions accordés à la Province de Québec, en sus des 6 millions dont il vient d'être question. À votre tour, grands patriotes de nous montrer ce que nous avons cherché en vain dans les livres bleus ; les preuves de votre liberté et celle de vos alliés envers notre province.\n\nNous ne trouvons rien.\n\nPeut-être seriez-vous plus heureux vous-mêmes.\n\nRésumons ces faits en un tableau :\n\nMONTANT ACCORDE PAR LES LIBERAUX :\n\nAu gouvernement de Québec ................................ $6,443,213\nAux chemins de fer ........................................... 4,469,400\n\nMONTANT ACCORDE PAR LE GOUVERNEMENT CONSERVATEUR :\n\nAu gouvernement de Québec ................................ $6,443,213\nAux chemins de fer de Québec ............................... 4,469,400\n\n$11,092,613\n\nNous rappelons cependant quelque chose. Un jour, un entrepreneur de chemin de fer,—un libéral—partit de Montréal pour obtenir, du gouvernement Mackenzie, une légère faveur. Il voulait emprunter pour la ligne de chemin de fer à laquelle il était intéressé, des rails de chemin de fer qui avaient déjà servi. Il était certain de réussir.\n\nTous les ministres de Québec appuyaient sa demande. Du reste, il avait un précédent : M. Mackenzie venait d'accorder cette faveur à une compagnie de la Nouvelle-Ecosse. Notre\nhomme part et malgré toute l'influence de M. Laurier et Cie, revient avec un refus.\n\nIl avait été aussi heureux que la députation du chemin de fer du Nord de Montréal, qui avait aussi demandé à M. Mackenzie de prêter main forte à cette entreprise de la Province de Québec. Tous les délégués sont encore vivants pour nous dire quelle belle réception ils ont eue du gouvernement libéral et quelles preuves de sympathie, ils rapportèrent à Montréal.\n\nQuiconque veut ouvrir les yeux, aura assez de ce qui précède pour se former une idée de la valeur relative des hommes qui nous ont gouvernés. D'un côté, nous avons obtenu plus de $11,000,000 ; de l'autre : rien. Il n'est pas étonnant que les patriotes, genre Laurier et Mercier qui ont un si triste passé, fassent autant de bruit autour de l'affaire Riel, ils y ont un double intérêt : cacher leur nullité au pouvoir et l'hostilité de leurs alliés envers le Bas-Canada.\nLA PROSPÉRITÉ DU PAYS\n\nÀ la session de 1873, une bataille en règle s'engageait entre les libéraux et les conservateurs. C'était M. Cartwright qui avait jeté le gant à l'ennemi et avait posé les conditions du combat. Vous, conservateurs, vous prétendez que pour ramener la prospérité dans le pays, il suffirait de protéger la production nationale. C'est une utopie. Le pays souffre d'une crise à laquelle le gouvernement ne peut rien, mais qui cessera avec le temps. Les gouvernements sont impuissants à ramener la prospérité aux moyens de la législation. Nous nous en tiendrons au libre-échange.\n\nÀ cette époque et depuis plusieurs années, la situation économique du pays était déplorable. Nos manufactures se fermaient l'une après l'autre, écrasées par la concurrence américaine qui venait vendre ses produits de son industrie à un prix, pendant que le gouvernement des États-Unis empêchait nos marchandises de traverser la frontière. Nos villes étaient remplies d'ouvriers sans travail et les cultivateurs ne pouvaient trouver, dans nos marchés, un prix raisonnable pour leurs denrées. La gêne était partout et la prospérité nulle part.\n\nSir John et les autres chefs du parti conservateur soutenaient que si nos industries étaient protégées, que si nous frappions de droits les marchandises étrangères, surtout celles des États-Unis, nous retiendrions le courant d'importations américaines si ruineuses pour notre commerce; que les manufactures ouvriraient de nouveau leurs portes et qu'il s'en fonderait des nouvelles et que les milliers d'ouvriers alors sans travail, pourraient se remettre à l'ouvrage et trouveraient les moyens d'acheter les produits de l'industrie agricole. C'est sur cette discussion que s'engagea la lutte en 1878 et l'on sait que le peuple se rallia en masse à l'opinion des conservateurs qui reprirent le pouvoir.\nDès la session de 1879, le gouvernement nouveau inaugura ce qui a été appelé depuis la politique nationale, c'est-à-dire politique des intérêts généraux du pays, faisant passer l'avancement du Canada avant celui de quelques individus. Le système nouveau a été mis à l'épreuve et d'une année à l'autre, il est facile d'en constater les bienfaits incontestables. Lorsque nous prêchons les bienfaits de la politique nationale, il n'est pas nécessaire de sembler de recourir à de nombreux arguments pour confondre les libéraux, car nous pouvons dire que sur ce terrain, nous prêchons des convertis. La plupart de leurs chefs étaient des protectionnistes et le sont encore de cœur, mais ils ont sacrifié leurs principes pour se soumettre à M. MacKenzie, le libre-échange, faisant passer le désir de le servir avant les intérêts de la Province de Québec. Et ce sont ces mêmes hommes si souples d'échine en présence des chefs, gré, qui n'ont pu rien obtenir pour le Bas-Canada, qui voudraient nous faire croire qu'ils auraient résigné s'ils avaient été à la place des ministres français d'Ottawa, lors de l'affaire Riel. Les intérêts de toute notre province étaient cependant chose plus précieuse que ceux de cet individu que M. Laurier traitait de meurtrier lorsqu'il ne s'était encore rougi les mains que du sang de Scott.\n\nSous le régime libéral la somme des substances alimentaires achetées des pays étrangers pour la consommation s'est élevé à $169,000,000 pour quatre ans, ou à peu près de 42 millions par année. De 1880 à 1885 les importations de marchandises étrangères du même genre ont été de 106,500,000, soit près de 17 millions par année, ou à peu près le tiers des importations du régime libéral ou une différence de 25 millions par an. C'est ce que tout le monde peut constater en ouvrant les livres bleus. La différence en moins de nos importations, c'est-à-dire les deux autres tiers ont été produites par notre pays et l'argent qui aurait servi à les acheter en Europe ou aux États-Unis est resté au Canada.\n\nD'après des calculs basés sur le dernier recensement, il y a au Canada 700,000 personnes vivant de l'agriculture. En partageant ce surplus de 25 millions entre elles, on trouve que chacune s'est enrichi de $50 par année. Cette diminution dans les importations n'a point porté sur les spiritueux, le vin, la bière, car les\nimportations de ces articles montrent qu'elles changent sous le régime libéral et sous le régime conservateur. Sous le régime libéral, les importations ont été de $1,569,000 ; sous le régime conservateur, elles ont été de $1,569,000. Il est donc clair que nous avons acheté autant sous un régime que sous l'autre ; mais ce sont des céréales, des fruits, des légumes, des provisions de toutes espèces et du sucre raffiné que nous avons importé en bien moindre quantité dans un temps que dans l'autre. Remarquez que tous ces articles — moins le sucre — sont des produits de l'agriculture. Cette diminution pour les légumes seulement s'est élevée à plus de $250,000 par année ou à environ 10 millions par six années du régime conservateur. D'où est venu ce que nous avons acheté en moins de l'étranger ? Évidemment, ce sont nos agriculteurs qui l'ont fourni et qui ont bénéficié, grâce à la politique nationale, de cet excédent de consommation produite par le Canada. Voilà des faits, des résultats appréciables devant lesquels ne peuvent demeurer debout les plus belles phrases et les plus brillantes théories des libres-échangistes.\n\nPassons maintenant à un autre point qui établira encore aussi les excellents résultats de la politique nationale. De 1874 à 1878, il a été importé des matières premières nécessaires pour nos manufactures pour un montant de $45,750,000 ou $9,200,000 par année. De 1880 à 1885, les importations sous le même titre se sont élevées à une valeur de $105,500,000 soit 17 millions par année, ou une augmentation de 93 pour 100. Cela ne suffit-il pas à démontrer que le travail des manufactures a presque doublé sous l'influence de la nouvelle législation, qui inspirant de la confiance aux capitalistes, les a engagés à placer dans l'industrie des fonds qui restaient inactifs et sans profit pour le pays. La protection a donné presque deux fois plus de travail aux ouvriers qu'avant, et leurs moyens ont augmenté dans les mêmes proportions car on a vu leurs dépôts dans les banques d'épargnes qui étaient sous le régime McKenzie de $7,960,411 se sont élevés sous le régime conservateur à $12,268,938.\n\nLa protection a donc été utile aux classes ouvrières de même qu'à l'agriculture. L'industrie qui n'importait que pour 9 millions de matières premières, a été obligée de presque doubler ses importations pour satisfaire aux demandes. Ces chiffres ne sont-ils pas éloquents !\nEn élaborant le nouveau système qui a produit de excellents résultats, le gouvernement avait posé en principe qu’optimisant les droits de douane, il fallait frapper de droits élevés les produits de l’industrie étrangère que nous pouvions manufacturer et les produits de l’agriculture que nous avions en abondance. D’un autre côté, il décidait de laisser entrer sans taxe les matières premières que nous ne produisions pas et qui étaient nécessaires pour alimenter l’industrie. N’était-ce pas là un système qui s’impose par sa logique et son bon sens ? Du reste, quoi bon discuter ? L’expérience qui en a été faite depuis six ans n’est-elle point là pour en démontrer l’excellence ? Grâce à cette politique sage et clairvoyante, nous sommes de tous les pays du monde celui qui a le moins souffert de la crise qui pèse sur le commerce et l’industrie depuis 1882. La Grande Bretagne, la France, l’Allemagne, la Belgique voient tout en souffrance et il y a quelques semaines, la colonie de New South Wales (Australie) faisait savoir au monde par le voix de ses journaux que depuis 22 ans, jamais elle n’avait vu son commerce et son industrie dans un pareil état de crise. Mais cette colonie jouit des bienfaits du libre échange qui permet à l’industrie étrangère de rimer ses manufactures.\n\nOn va peut-être nous objecter que la protection pourrait augmenter les prix et c’est l’objection que l’on faisait en 1873. Encore là, les prédications libérales ont mal donné. Les prix ne sont pas plus élevés parce que ces monopoles qui devaient s’établir et nous ruiner, disaient les libéraux, sont encore à naître. La concurrence dans le pays entre manufacturiers a fait descendre les prix pour bien des articles au-dessous de ce qu’ils étaient avant 1873.\n\nNous disions plus haut que les libéraux étaient protectionnistes avant l’arrivée de M. Macdonald au pouvoir. En voici la preuve :\n\nOn se souvient qu’une grande convention des chefs libéraux eut lieu à Québec en 1872, dans le but de jeter les bases du parti national. À cette assemblée, l’honorable Mr Joly était élu chef de l’association, et voici le langage qu’il dit en cette circonstance : « On a proposé de donner au parti qui veut se charger de cette tâche le nom de Parti National » (Appl.) Je vais vous dire pourquoi on a choisi ce nom.\nVous avez dû voir par la discussion de la chambre et des journaux que, pour attirer une immigration considérable et avantageuse dans le pays, il faut encourager l'industrie par tous les moyens possibles. Tout le monde comprend que nos jeunes gens ne quitteraient pas le pays s'ils y trouvaient de quoi suffirent, non pas pour faire du luxe, mais pour se payer au moins un morceau de pain et de quoi se vêtir. Il faut donc pour empêcher cette dépopulation en détail, un parti qui encourage l'industrie sous toutes ses formes, un parti qui soit avant tout national, qui nous obtienne de prime abondance une indépendance politique, mais une indépendance commerciale.\n\nVoici donc une politique nationale, si nous voulons ramener nos compatriotes dans leurs foyers, encourager une immigration étrangère et établir un marché avec les autres pays. (Appl.) Au lieu de faire des théories, d'échafauder des utopies, je crois qu'il vaut mieux adopter une plateforme, comme disent les Anglais, une plateforme nationale, commerciale et industrielle.\n\nSoyons un parti national ! Encourageons l'industrie sous toutes ses formes. Adoptons une politique nationale. À bas les utopies ! Il nous faut une plateforme nationale, commerciale et industrielle.\n\nEst-ce là le langage d'un chef libéral ? Ne croirait-on pas ces paroles sorties plutôt d'une bouche conservatrice ? C'était pourtant ainsi que parlait M. Joly, en l'an de grâce 1872.\n\nM. Joly ne s'en tint pas à cette déclaration. Quatre ans plus tard il se proclamait encore protectionniste. C'est ce que nous allons prouver.\n\nOn se souvient que, dans la session de 1878 de la Chambre des Communes, une commission fut chargée de prendre en considération la question de l'agriculture. Cette commission siégea sous la présidence du Dr. Orton qui en avait proposé la formation. Or, voici des extraits de la lettre transmise par M. Joly, dans laquelle il réitère ses sentiments protectionnistes :\n\n[Texte de la lettre]\n\nQuébec, 24 mars 1876.\n\nMon cher docteur, Je n'ai reçu qu'aujourd'hui une série de questions imprimées venant de votre commission aux travaux de laquelle je prends un vif intérêt, et je m'empresserai de vous envoyer mes réponses. Je crains qu'elles ne soient un peu longues, mais je dois dire que j'ai trouvé une certaine satisfaction d'être capable de formuler mes vues sur le sujet, quelle que soit leur valeur. En effet, c'est une espèce de protestation contre l'accusation portée contre moi pendant cette session dans la Chambre des Communes et dans la presse — d'avoir abandonné le principal article du programme de notre parti national. Nous clamions, en effet, une politique commerciale nationale. On a reproché à mes amis de l'avoir abandonné et, comme chef du parti national, je ne peux pas me reprocher, mais je n'ai point...\nabandonné cette politique.\n\nQuestion : Est-il de l'intérêt du Canada de continuer à admettre les produits américains exempts de droits, tandis que les produits canadiens exposés de l'autre côté de la frontière sont soumis à des droits élevés ?\n\nRéponse : Non, c'est contraire à l'intérêt du Canada. Je crois fermement que nous ne devrions admettre exempts de droits que les matières brutes employées par nos manufactures.\n\nCe n'est pas en faisant baisser le prix de toutes choses que nous atteindrons la richesse nationale. Le plus cher nous payons, le mieux c'est pour nous, pourvu que nos moyens de payer soient de pair avec l'augmentation des prix. Demandez à l'ouvrier ce qu'il préfère, la farine $6 le baril et pas d'outrage, ou la farine $3 et de l'ouvrage en abondance ? L'agriculture et la manufacture peuvent ensemble arriver à de grandes résultats ; mais que ces deux industries isolent leurs intérêts, et leurs forces divisées seront loin de pouvoir accomplir autant.\n\nOn le voit, M. Joly se défend comme d'un crime d'avoir abandonné en sa qualité de \"chef du parti national\" la politique commerciale nationale. Il demande que l'on protège les producteurs canadiens contre la concurrence américaine. II proclame que ce n'est pas en abaissant le prix de toutes choses qu'on arrivera à la grandeur nationale; que l'ouvrier préférera toujours payer la farine $6 le baril s'il a de l'ouvrage que de payer $4.50 s'il n'a pas de travail.\n\nN'est-ce pas là toute la doctrine protectionniste des conservateurs, prêchée en quelques mots ? Cela n'empêchait pas ce bon M. Joly de soutenir deux ans plus tard, aux élections de 1878, la politique libre-échangiste du gouvernement MacKenzie qui avait déclaré, par l'entremise de sir Richard Cartwright, que la protection est un vol légalisé (legalized robbery).\n\nGrand patriote ce M. Joly !\n\nDans cette même assemblée du parti libéral en 1872, un autre chef, l'honorable M. Pelletier, se prononça avec non moins d'énergie pour \"cette immense blague,\" suivant l'expression de l'Électeur.\n\nVoici quelques passages de son discours :\n\nLes manufactures, les différentes branches d'industrie, que nous pouvons développer avec tant d'avantages ne reçoivent pas la protection nécessaire. Il y a pourtant une diversité, un écart vers lequel il faut diriger nos efforts.\n\nOui messieurs, la faim, la misère font faire bien souvent des efforts surhumains. Aujourd'hui la terrible crise commerciale que nous traversons alarme ceux qui étaient les plus confiants dans un avenir meilleur, leur fait faire des efforts supérieurs pour éviter une ruine complète.\nDe généreux efforts sont tentés depuis quelque temps, c'est vrai, quelques capitalistes entreprenants, essayant bien d'établir des manufactures, mais ont-ils pu inspirer confiance dans leur succès ? Ont-ils pu faire disparaître cette objection si grande du tarif qui rend presque impossible l'exportation de nos produits ?\n\nQuelle garantie ont-ils pour risquer leurs capitaux dans les manufactures exposées constamment à un changement de tarif qui paralyse tout. (Apple).\n\nIl y a, à côté de nous, une population de quarante millions avec lesquels nous ne pouvons commercer. Notre pays offre des avantages immenses et c'est pourtant encore le plus arrière de l'Amérique, faute d'encouragement aux manufactures.\n\nNos manufactures ne reçoivent pas la protection nécessaire. Les capitalistes n'osent pas risquer leurs fonds dans les manufactures, exposées constamment à un changement de tarif qui paralyse tout, s'exclame M. Pelletier. Si en est ainsi, n'est-ce pas la meilleure condamnation des libéraux qui cherchent à paralyser l'industrie en menaçant les capitalistes de changements de tarif ?\n\nQuant à l'assertion que nous sommes le pays le plus arrière de l'Amérique, elle est tout simplement ridicule. N'en déplaise à M. Pelletier, même en l'absence d'encouragement aux manufactures, nous croyons notre situation commerciale et industrielle moins rétrograde que celle du Mexique et de la Patagonie. Pas flatteur pour son pays, M. le sénateur Pelletier.\n\nEt M. Laurier qu'on a la bonne volonté de prendre pour un chef !\n\nVoici un court extrait d'un discours fort significatif qu'il prononçait à la Chambre d'Assemblée de Québec en 1871 :\n\nIl y a déjà bien des années, le grand patriote que nous venons de perdre, l'honorable L.J. Papineau, cherchant un remède à nos maux, alors, résumait sa politique à ce sujet dans ce simple précepte : \"Il ne faut rien céder de la métropole.\" Je sais d'expérience que cette politique s'impose à nous aujourd'hui avec autant de force qu'à l'époque même où elle était formulée. C'est pour nous, nous, certains Canadiens d'origine française, un devoir de créer une industrie nationale.\n\nN'achetons rien de la métropole, s'exclame M. Laurier, à l'instar de M. Papineau. Et cependant, son parti, reproche entre autres choses au tarif actuel d'avoir des tendances déloyales, d'être anti-anglais (anti-British). M. Laurier s'est proclamé depuis protectionniste—c'est-à-dire partisan de l'immense blague, ce qui ne l'a pas empêché de courber l'échine devant les chefs grits d'Ontario et de soutenir leur programme.\nQuel patriote que ce M. Laurier!\n\nÀ Ottawa, M. Laurier s'est bien gardé de prétendre qu'il venait de prêcher à Québec. Il proclama vigoureusement la province de Québec, que la politique nationale était une \"farce\" et que l'industrie était suffisamment protégée. S'est-on jamais autant moqué de l'opinion publique de notre province? Car cette protection a été et est encore populaire quelque part, n'est-ce pas dans la province de Québec qui a été le berceau de la renaissance industrielle?\n\nPour que l'on puisse juger M. Laurier par ses propres paroles, citons celles-ci suivantes. Elles ont été prononcées aux Communes à la séance du 22 mars 1877:\n\nLa politique nationale ne nous a pas encore été exposée, et si elle comporte quelque chose, elle veut que le peuple soit taxé; tel est en effet, le remède aux abus du gouvernement actuel, qui nous est proposé par le grand parti conservateur qui prétend être l'ami du peuple. Je ne peux parler pour d'autre province que pour la mienne, mais je puis dire qu'à Québec on regarde la politique nationale comme un leurre et une farce, comme une politique inhumaine, puisqu'elle aurait pour effet de rendre le combustible et les denrées plus chers.\n\nJe suis d'avis, cependant, qu'il y a certaines industries qui ne sauraient être établies sans l'aide de la législature. Et cela je le dis ouvertement en face de mes amis politiques.\n\nOn pourrait me demander alors pourquoi je soutiens la politique du gouvernement. À cela je répondrai que c'est parce que nous avons suffisamment de protection.\n\nLe parti adverse ne vient pas autant à obtenir plus de protection qu'à préjuger les masses contre le gouvernement.\n\nIl ne faut pas perdre de vue que le tarif est approprié à la situation. Il est vrai qu'il y a un déficit, mais il n'est pas que temporaire. Un tel plan d'économie l'aurait rendu possible.\n\nIl est certaines industries qui ont besoin de protection, je le dis à la face de toutes les provinces. M. Laurier. Mais quelles sont ces industries? C'est ce que M. Laurier est bien en droit de dire. Aussi cette déclaration n'est pas plus courageuse qu'elle n'est sincère.\n\nLe tarif de 173 ne pouvait suffire à combler les déficits; ces déficits n'étaient pas temporaires, comme le prétendait M. Laurier, puisqu'ils n'ont pu être combler qu'en 1880, quand le tarif protecteur fut en pleine opération.\n\nM. Richard, un libéral ancien représentant le comté de Megantic\nsous le ministère Mackenzie. C'était un protectionniste convaincu.\n\nVoici un court extrait d'une série d'articles qu'il publia en 1873 dans l'Opinion Publique :\n\nJe conçois les embarras du fisc, les difficultés qu'il lui faut surmonter ; mais, d'un autre côté, en taxant certains produits exempts de droits, l'augmentation de consommation produite par l'augmentation de population que nous vandra l'industrie, produirait, ce me semble, une compensation suffisante, et l'exemple le prouve surabondamment : les États-Unis ont prospéré en protégeant leur industrie, et cela, tout en diminuant la dette contractée par leur guerre civile, de 100 millions par an, sans compter les intérêts. Nous avons perdu pour le fisc, en comprenant mal nos intérêts, 750,00 consommateurs, qui font le profit de la république américaine, sans compter l'immigration étrangère, que notre système force à passer en Canada en transit.\n\nNotre politique, à mon avis, devrait être : protection pour tout objet manufacturé dont nous avons la matière première ; exemption de droits ou droits purement fiscaux sur toute matière première étrangère qui pourrait être manufacturée avec avantage dans ce pays, et impôts bas pour tout objet importé devant être consommé sans être manufacturé.\n\nUne fois en chambre, M. Richard blâma M. Cartwright de ne vouloir rien faire pour encourager l'industrie nationale. Voici quelques-unes des paroles qu'il faisait entendre en 1876 :\n\nJe ne regrette de ne pouvoir approuver le tarif du ministre des Finances. Au lieu de taxer le thé et le café, articles que nous ne pouvons pas produire, le ministre des Finances aurait dû imposer les articles qui peuvent être manufacturés au milieu de nous, car nous aurions pu dans ce cas non seulement nous assurer un revenu, mais donner aux manufactures cette protection dont elles ont besoin. Je dois dire que nous devrions particulièrement donner de la protection à nos produits agricoles, qui sont essentiels au développement du pays et doivent servir de base à l'établissement de nos manufactures. Je ne saurais approuver ce qu'a dit l'honorable député de Bothwell, et pour ce qui regarde les États-Unis, je ne crains pas d'affirmer que sans la protection, ils ne seraient pas aujourd'hui ce qu'ils sont.\n\nOn n'a pas oublié le Bien Public fondé par les promoteurs du parti national à Montréal. Ce journal était rédigé par M. David et M. Beausoleil, deux chauds partisans de la protection. Or, voici ce qu'il disait en 1874 à la suite d'une réunion de l'association des manufacturiers d'Ontario :\n\nLes résolutions adoptées à une grande assemblée de fabricants qui a eu lieu à Toronto, demandent que le tarif soit élevé à 20 pour cent sur tous les objets venant d'Angleterre et d'Irlande qui peuvent être fabriqués en Canada et que sur tous les articles venant des États-Unis et d'autres pays, le\nCanada devrait imposer des droits égaux à ceux qu'on impose sur les produits canadiens allant aux États-Unis et dans d'autres pays étrangers.\n\nNous acceptons ces résolutions et nous n'hésitons pas à dire qu'elles devraient être le programme de tout gouvernement ayant à cœur le bien du pays. C'est ce que tout le monde demande à l'exception de certains hommes politiques qui sacrifient la pratique à la théorie. L'honorable M. MacKenzie a dit que le tarif serait modifié dans l'intérêt du Canada, et nous sommes sûr qu'il tiendra parole.\n\nLe Bien Public étant donc prêt non seulement à approuver la protection, mais une politique de représailles à l'égard des États-Unis, c'est-à-dire des droits s'élevant en certains cas à 75 pour cent. Il exprimait une confiance bien mal placée en M. MacKenzie lorsqu'il affirmait qu'il tiendrait parole en modifiant le tarif dans le sens national. Si M. MacKenzie a jamais eu cette idée, il s'est bien gardé de la mettre à exécution. Cela n'est pas étonnant lorsque l'on sait qu'il a proclamé en mainte et mainte circonstance que la protection était une chose surannée, un hors d'œuvre, un anachorisme, un reliquat de ce qu'il appelle les âges de ténèbres et d'ignorance.\nLE PACIFIQUE\n\nDeux questions ont eu le privilège de mettre en relief la valeur relative des hommes publics qui dirigent d'un côté le parti conservateur et de l'autre, le parti libéral. Nous avons déjà vu que lorsque le pays fléchissait sous le poids de la terrible crise commerciale et industrielle qui a désolé le Canada sous le régime grigri rouge, les gouvernants d'alors MM. Mackenzie, Cartwright, Laurier et Pelletier, déclarèrent en plein parlement qu'ils étaient incapables de soulager le peuple, que ce n'était pas le devoir des gouvernements d'essayer à mettre un terme aux crises économiques. Ils avouaient leur incapacité en face de la misère. Les conservateurs se hâtèrent d'indiquer le remède au mal et le gouvernement refusa de l'appliquer. C'est alors que le peuple leur donna congé aux élections de 1878, John appelé à les remplacer mit fin à la crise en inaugurant la politique nationale. La question du chemin de fer du Pacifique vint aussi démontrer la différence qu'il y a entre des hommes de gouvernement, des hommes politiques et les discoureurs, les gens à théorie qui ne s'entendent qu'à critiquer les actes de leurs adversaires.\n\nOn sait que par l'acte qui réunissait la Colombie au Canada, ce dernier s'engageait à construire une voie ferrée entre les anciennes provinces de la Confédération et la Colombie. Les libéraux commencèrent à déclarer que ce projet serait la folie et qu'il était hors de proportion avec les ressources du pays. Plus tard, en 1873, lorsque M. Mackenzie arriva au pouvoir, il changea d'idée avec le parti libéral et trouva qu'entre ses mains l'entreprise était très praticable. Les libéraux proclamèrent alors qu'on allait enfin voir ce que c'était qu'un homme pratique.\nIl se mit à l'œuvre et un jour on l'entendit exposer en présence du pays, son étonnant projet. Il voulait, on s'en souvient, construire une voie, moitié par eau, moitié par terre, en utilisant, disait-il, les nappes d'eau qui se trouvent entre la baie Georgienne et Manitoba. La route traversait le nord Ontario jusqu'au fond de la baie Georgienne, traversait le lac Supérieur, jusqu'au fort William et suivait ensuite les étendues d'eau qui se trouvent vers le sud. M. Mackenzie fit commencer des travaux considérables, mais qu'il n'osât jamais terminer quand il vit que tout le pays condamnait son projet qui aurait eu le grave inconvénient d'être impraticable pendant les mois d'hiver. Il se décida à reconnaître son immense erreur qui fit perdre d'immenses sommes d'argent au pays. Une autre erreur de ce gouvernement si pratique qui comptait dans son sein MM. Laurier, Pelletier, ce fut de vouloir construire le chemin lui-même et non de le donner à l'entreprise publique. D'après les membres du gouvernement libéral, le Pacifique devait coûter 180 millions de piastres. On ne sait pas à quels désastres nous aurions été condamnés, si le gouvernement conservateur n'était pas arrivé au pouvoir en 1878.\n\nLe gouvernement conservateur se mit tout de suite à l'œuvre et organisa la puissante compagnie que l'on connaît. Elle s'était engagée par contrat à terminer le chemin en 1889, mais les travaux, les ouvrages furent poussés avec tant de vigueur que la voie a été ouverte au public dès 1886, aux applaudissements non seulement du Canada tout entier mais aussi à ceux des États-Unis, de la Grande-Bretagne et de la France, émerveillés de voir une entreprise gigantesque, qui paraissait si difficile, menée à bonne fin en si peu de temps. C'était la récompense due aux hommes qui n'avaient pas désespéré de leur pays et qui avaient mesuré avec une grande attente de coup d'œil les ressources du Canada et avaient jugé qu'elles étaient plus que suffisantes pour faire face aux difficultés de l'entreprise.\n\nCette voie ferrée, qui d'après M. Mackenzie devait coûter 180 millions de piastres au Canada, a été loin de nous entraîner à pareil sacrifice.\n\nPar l'acte de 1881, le gouvernement accordait à la Compagnie du Pacifique 25,000,000 acres de terre et 30 millions de piastres\net lui donnait en plus les sections en voie de construction dans la Colombie. Ce qui faisait comme subside en argent :\n\n| Subsidies | $40,000,000 |\n|-----------|-------------|\n| Coût des sections en Colombie | $24,000,000 |\n| 25 millions d'acres à $1 par acre | $25,000,000 |\n\nTotal : $79,000,000\n\nSoit 79 millions en y comprenant le prix des terres, mais en réalité que 54 millions en argent. On est loin des 180 millions de M. Mackenzie. Il est bon de faire observer que ces 25 millions d'acres restaient absolument sans valeur pour le gouvernement si le chemin de fer n'était pas construit, mais que dès que le Pacifique les traversait, l'aspect des choses changeait aussitôt, les terres acquéraient immédiatement un prix considérable ainsi que celles que le gouvernement se réservait dans le Nord-Ouest et qui dans un avenir rapproché lui permettront de se rembourser de ses sacrifices. Dans la seule année de 1886, il a été vendu pour plus de 2 millions de terres au nord-Ouest. Il est facile d'en conclure que le gouvernement retrouvera un jour dans la vente de ses terres du Nord-Ouest, les 54 millions qu'il a déboursés pour le Pacifique. Il arrivera que cette gigantesque entreprise destinée à donner une si grande impulsion au commerce d'Ontario, de Québec et des Provinces Maritimes ne leur aura rien coûté.\n\nDéjà les plus brillantes perspectives s'ouvrent pour le commerce du Canada, grâce au chemin du Pacifique qui ne vient que de s'ouvrir. D'abord, l'établissement du Nord-Ouest où les villes et les villages surgissent comme par enchantement, offriront un immense marché aux manufactures du Canada, et nos ports s'alimenteront en retour de l'immense production de blé et de toutes espèces de céréales qui seront de là expédiées en Europe. Québec, Trois-Rivières, Montréal, peuvent attendre une part de ce commerce d'exportation proportionnée à l'énergie qu'elles apporteront chacune pour l'attirer de leur côté.\n\nLa Colombie d'autre part, a déjà commencé à expédier à Montréal, ses bois incomparables que l'Europe voudra nous acheter. Et enfin, l'immense commerce de l'Orient et de l'Europe semble vouloir chercher la ligne du Pacifique de préférence à toute\nautre comme étant la voie la plus rapide entre les deux continents. Dans le cours de l'automne de 1886, quelques mois avant l'ouverture du chemin, Montréal a vu arriver par ses quais plus de 7 millions de livres de thé expédié de la Chine. Que ne devons-nous pas attendre de ce côté, lorsqu'une ligne de grands et rapides steamer voyagera entre les ports de l'Orient et de la Colombie Britannique ! Les plus beaux rêves que l'on peut faire, seront sans doute dépassés par la réalité.\n\nLe mérite de cette entreprise, le mérite de l'avoir conçue et exécutée, ne revient-il pas tout entier aux chefs du parti conservateur et aux électeurs qui les ont soutenus ?\nLES FINANCES DU PAYS\n\nL'examen comparatif de l'administration des finances sous les deux régimes ne démontrent pas moins clairement que la façon dont ont été traités la politique nationale et le Pacifique, la supériorité des chefs conservateurs comme hommes d'affaires et Hommes de gouvernement. Comme pour le tarif et le Pacifique, nous exposerons la question en toute franchise et l'on pourra vérifier l'exactitude de nos chiffres en ouvrant les livres bleus.\n\nUn fait domine l'ensemble de la question de nos finances, c'est que chaque année du régime gris, moins deux, a été marquée par un déficit et que chaque année du régime conservateur s'est terminée par un immense surplus, moins 1885-86, où les frais de la guerre du Nord-Ouest ont entraîné des dépenses énormes qu'il ne serait pas juste de porter au compte des dépenses ordinaires. Si le gouvernement avait voulu, il n'y aurait pas eu de déficit ; il lui aurait suffi de couvrir les dépenses au Nord-Ouest par un emprunt dont l'intérêt seul aurait figuré dans les comptes publics. Le gouvernement a préféré en finir une bonne fois avec ces dépenses de la guerre et les porter au chapitre des dépenses courantes. Si les rouges trouvent un déficit considérable, ils devront en faire porter la responsabilité au grand patriote Riel, seule cause de cette dépense extraordinaire comme il a été la seule cause des malheurs du Nord-Ouest et de la ruine de ses honnêtes citoyens.\n\nAfin de bien exposer la position financière du pays, nous allons donner ci-après un tableau qui montre le montant du surplus ou du déficit de chaque année depuis la première année de la Confédération.\n| Année | Surplus | Déficits |\n|-------|---------|----------|\n| 1868  | $101,835 |          |\n| 1869  | 341,090  |          |\n| 1870  | 1,156,717|          |\n| 1871  | 3,712,479|          |\n| 1872  | 3,125,345|          |\n| 1873  | 1,638,821|          |\n| 1874  | 888,774  |          |\n| 1875  | 935,644  |          |\n| 1876  | $1,900,785|         |\n| 1877  | 1,460,028|          |\n| 1878  | 1,128,146|          |\n| 1879  | 1,938,000|          |\n| 1880  | 1,543,227|          |\n| 1881  | 4,132,743|          |\n| 1882  | 6,316,352|          |\n| 1883  | 7,064,499|          |\n| 1884  | 7,542,266|          |\n| 1885  | 240,059  |          |\n| 1886  | 865,553  |          |\n\nIl suffit d'étudier un instant ce tableau pour se rendre compte de l'immense succès qui a couronné l'administration financière du Canada sous le régime conservateur.\n\nLorsque les conservateurs quittèrent le pouvoir en 1873, ils avaient plus de 11 millions de surplus à leur actif. Après leurs cinq ans de règne, les libéraux se retiraient, laissant plus de 7 millions de déficit, et, à l'heure qu'il est, en faisant le compte des déficits et des surplus du régime actuel, celui-ci peut encore montrer 10 millions d'excédent et il est probable que la prochaine année fiscale va se terminer par un excédent de recettes supérieures : cet excédent était déjà de plus de 2 millions pour les premiers six mois de la présente année.\n\nNous n'arrêterons pas la comparaison ici ; nous la pousserons plus loin. Mais avant il serait bon de mettre fin aux commentaires ridicules que se permettent les libéraux sur la prétendue énormité de la dette publique. Elle s'élève, disent-ils, à 300 millions. Songez-y donc, 300 millions de dettes ! D'abord, la dette publique n'a pas atteint ce chiffre ; elle était, au 1er avril 1885, de 264 millions. Si les libéraux voulaient être justes et ne pas essayer de tromper le public, ils ne se contenteraient pas de faire flamboyer aux yeux du peuple le chiffre de la dette ; ils expliqueraient comment elle a été contractée et pourquoi...\nLorsque l'on fait le bilan d'une banque, on ne se contente pas de dire sa dette est de tant, mais on fait voir quel est son actif et ce que représente cette dette. Il n'est que juste d'en faire autant pour le gouvernement.\n\nNous allons établir ce bilan. Il y a dans la dette publique une somme de 106 millions qui a été apportée dans les comptes du Canada par les différentes provinces en entrant dans la Confédération. C'est un fait acquis indiscutable. Il faut retrancher cette somme et il nous reste 158 millions. Il y a de plus dans la dette une dette active de 68 millions qui rapporte un intérêt de 3,92 p. 100 au gouvernement, et que nous devons retrancher de la dette brute sur laquelle nous ne payons que 3,92 p. 100 d'intérêt. Ces 68 millions retranchés des 158, il reste 90 millions comme dette nette. Soit pour résumer :\n\n| Dette brute | $264,000,000 |\n|-------------|--------------|\n| Moins dette des provinces | 106,000,000 |\n| Moins intérêts | 68,000,000 |\n| Reste | 90,000,000 |\n\nOn nous demandera maintenant ce qui a été fait de ces 90 millions ? Il sera bien facile d'en justifier l'emploi. Ils ont été employés en travaux d'utilité publique qui ont développé le pays, fait pénétrer partout la richesse et l'aisance, décuplé la valeur de la propriété privée. Depuis la Confédération, il a été dépensé 30 millions pour élargir les canaux, construire des hâvres des quais, des phares, enfin, pour rendre la navigation antérieure plus vive, l'approche de nos côtes moins dangereuse et attirer par la voie du Saint-Laurent, une partie de l'immense commerce de l'Ouest. L'Intercolonial et le Pacifique qui vont d'un océan à l'autre, et bien d'autres chemins de fer, ont coûté au pays près de 60 millions. Ce sont des travaux indispensables et assurément personne n'oserait soutenir sérieusement qu'ils n'auraient pas dû être construits. Lorsque l'on fait le compte de la dette en se demandant ce qu'elle représente par chaque individu on est vraiment étonné de voir le fardeau léger qu'elle fait porter à chacun. La\ndettes en effet ne représente que $1.69 par tête entièrement payé par les droits de douane et d'accise et par la même presque insensible. Qu'est-ce en comparaison des taxes municipales, des taxes des villes si élevées, si pénibles et que chacun paie sans sourciller ! Pitié du ciel que les taxes des villes ne fassent pas plus sensibles que les taxes du parlement fédéral.\n\nPoursuivons notre comparaison, afin de ne laisser aucune dette dans l'esprit du plus prévenu de nos lecteurs. En 1865 nous avons payé, en intérêt, $2,994,428 de plus qu'en 1867, et c'est là une augmentation énorme, disait-il y a quelque temps, M. Blake. Mais il oubliait de dire qu'en 1867, la population créditée de 3,831,000, ce qui faisait un montant par tête de 1.39, mais aujourd'hui la population est d'au moins 4,700,000 et l'intérêt se trouve de 1.63 par tête, soit une augmentation de 23 cents que nous payons pour avoir des communications d'un bout du pays à l'autre, et une augmentation dans la valeur de la propriété qui représente beaucoup plus que cette légère augmentation. Ce montant par tête durant le régime libéral était de $1.664, en prenant comme chiffre de proportion 4,125,866.\n\nCe qu'il y a de plus singulier, c'est que c'est sous le régime libéral que l'augmentation de la dette a été le plus considérable. À leur arrivée au pouvoir en 1878, l'intérêt de la dette s'élevait à $5,161,377. À leur sortie des affaires, cinq ans plus tard, en 1878, l'intérêt sur la dette s'élevait à $6,687,794, soit une augmentation de $1,526,417 ou une moyenne annuelle de $305,284 à la fin de l'année fiscale finissant le 30 juin 1883, c'est-à-dire pour sept ans, l'intérêt sur la dette était de $7,069,089. C'est une différence avec le montant de $6,687,794 payé par les libéraux de $967,295 ou une moyenne d'augmentation annuelle de $127,162 à opposer au $305,284 d'augmentation annuelle du régime libéral.\n\nConcluons ce chapitre déjà trop long par quelques chiffres qui démontreront qu'en Angleterre, la situation n'a pas été jugée autrement que nous l'avons fait nous-même. Alors que le ministre qui a été surnommé le grand incapable Sir Richard Cartwright, était ministre des Finances, ses emprunts ont été placés à $84. C'est-à-dire que pour chaque $100 qu'il s'engageait à payer pour le Canada, il retirait $84. C'était le cas...\nde notre crédit sur le marché de Londres. Sous le régime qui nous ruine, disent les rouges, nous avons emprunté aussi à Londres et pour chaque $100 que notre ministre des finances s'est engagé à payer, nous avons reçu $101.18\\frac{1}{2}$. Chacun peut vérifier les chiffres, ils sont de notoriété publique; on les trouve dans des documents officiels. Il est très instructif de les étudier et de les comparer. Nous invitons le public à s'en occuper et nous pouvons anticiper son jugement sur la valeur des hommes qui lui fournissent les éléments de cette comparaison.\n\nEn résumant ce qui précède, nous avons le tableau suivant :\n\n| Description                                      | Montant |\n|--------------------------------------------------|---------|\n| Les emprunts sous Sir John ont produit           | 102,184 p. 100 |\n| Les emprunts libéraux                            | 88 p. 100 |\n| Dette par dette sous McKenzie                    | 1,664 |\n| Sir John                                         | 1,83 |\n| Augmentation annuelle d'intérêt sous McKenzie   | $305,244 |\n| Augmentation sous Sir John                       | 127,182 |\n| Surplus de Sir John                              | 11,000,000 |\n| Dette McKenzie                                   | 7,000,000 |\n\nIl est important de noter que ces chiffres ne sont pas les seuls à considérer. La situation financière du pays est complexe et il est nécessaire de prendre en compte tous les facteurs avant de tirer des conclusions définitives.\nL'AFFAIRE RIEL\n\nIl n'entre pas dans notre intention de traiter à fond la question Riel qui, depuis dix-huit mois, a été épuisée par les journaux. Tous ceux qui lisent sont aujourd'hui fixé sur la valeur de Riel et sur l'affaire des Métis. Nous voulons seulement citer des extraits de documents sur l'ensemble de cette fameuse affaire.\n\nJamais question importante n'a été traitée au Canada, avec un plus profond mépris de la vérité, jamais l'hypocrisie n'a joué un plus grand rôle ; ce n'était plus de l'hypocrisie ; c'était de l'effronterie, de l'impudence mêlée à un profond mépris pour l'opinion publique. Pouvons-nous qualifier autrement la conduite des journaux et des chefs grits d'Ontario qui en 1872 et 1874 ont mis la tête de Riel à prix, offrant $5,000 à quiconque le livrerait à la justice, qui l'ont mis hors-la-loi, ce qui autorisait le premier venu à tuer Riel s'il le rencontrait sans avoir rien à craindre ; qui avant l'exécution de Riel au mois de novembre 1885, déflaient Sir John de le soustraire au bourreau et qui depuis ont blâmé cette exécution ?\nGRIEFS DES METIS\n\nCe sont les mêmes hommes qui tentent de justifier la rébellion, en soutenant que les Métis avaient des griefs et qui, cependant, ont refusé lorsqu'ils pouvaient redresser ces griefs de faire quoique ce soit pour eux, pendant leurs cinq années de pouvoir. En effet, lorsque l'on demandait à l'hon. M. Mills, ministre de l'intérieur de mettre les Métis sur le même pied que les Sauvages, auxquels le gouvernement donnait des terres, à titre de premiers possesseurs du Nord-Ouest, le ministre refusait absolument voici sa réponse :\n\n\"Je ne suis pas disposé à faire droit à la demande des requérants qui veulent avoir des grains de semence et des instruments agricoles. Je ne vois pas d'après quel principe les Métis peuvent demander à être traités autrement que les colons blancs des Territoires. On devrait persuader aux Métis, qui ont des avantages sur les colons blancs, de se fixer dans certains endroits et de se livrer à l'agriculture ; dans ce cas, des terres leur seront accordées, comme aux colons blancs. Ils ne doivent pas s'attendre à recevoir des secours spéciaux du gouvernement.\"\n\nAinsi, il ne voulait pas les traiter autrement que les émigrés au Nord-Ouest. Cependant, en 1870, le gouvernement de Sir John avait posé en principe que les Métis devaient être traités comme les sauvages en ce qui regardait l'octroi des terres, etc. À cette époque, les Métis de Manitoba reçurent des terres.\n\nQue les Métis aient eu des droits, personne ne le conteste, mais que le retard apporté au règlement de ces réclama- tions fut de nature à justifier une révolte, aucun homme de sens ne peut y admettre. C'est tellement évident qu'au procès de Riel, MM. Lemieux et Fitzpatrick, les avocats de Riel, si on jugeaient de justifier la rébellion. En Chambre, M. Cameron, le plus fanatique des grits a déclaré ce qui suit : \"Je ne veux pas justifier la rébellion ; je veux montrer quelle\nétait la situation du Nord-Ouest ; je veux prouver que le prisonnier était justifiable d'y aller, et exposer les circonstances qui l'ont conduit.\"\n\nEt dans une autre circonstance le même député disait :\n\n\"J'admets que les Métis avaient des griefs ; mais leurs griefs n'étaient pas suffisants pour justifier la rébellion. Qui a prétendu qu'ils avaient des griefs suffisants pour justifier la rébellion ? Qui a fait cette déclaration ? Est-ce un membre de la gauche ?\n\nQuelques députés : Oui.\n\nM. Cameron : \"Non, personne du côté de la gauche n'a fait une telle déclaration, à savoir, que les Métis avaient des griefs justifiant la rébellion.\"\n\nSir Richard Cartwright ne pense pas autrement et l'éloquent avocat de Riel, M. Fitzpatrick lui-même a déclaré, comme nous venons de le dire : Qu'il n'y avait rien qui justifiait une rébellion.\n\nLe gouvernement n'avait jamais non plus refusé de reconnaître les réclamations, mais on sait qu'à Ottawa, comme à Washington, à Londres et à Paris, les affaires de bureau vont lentement ; il faut qu'elles passent d'un employé à l'autre. Prenez par exemple l'affaire du règlement du surplus de la dette du Canada que Québec et Ontario devaient porter pendant combien d'années a-t-elle été dissoute ? Et la moindre affaire portée devant les tribunaux combien y traîne-t-elle de temps ? Cependant en l'examinant, le premier venu serait porté à croire qu'une heure d'étude devrait la régler. Mais les retards viennent de la multitude d'affaires semblables, de la négligence des avocats, de l'absence des témoins, de la fatigue des juges. Il en a été de même pour les Métis.\n\nDeux causes principales ont contribué aux retards : le Parmi ceux qui réclamaient des terres, il s'en trouvait un grand nombre qui n'y avaient aucun droit, ayant déjà reçu des terres au Manitoba. Ces réclamations illégales compliquaient les demandes qui étaient bien fondées, car le département devait faire une enquête en chaque cas pour ne pas être trompé.\n\nD'un autre côté, les Métis ne s'entendaient pas tous entre eux sur la manière de régler cette affaire. Les uns, c'était le petit nombre et les plus sages, voulaient un scip (document émané par le gouvernement qui donnait droit à 240 acres de terre) qu'il ne leur serait pas permis de transporter à un autre et les forceraient à garder les terres. Les autres le plus grand nombre exigeaient un scip transférable pour le vendre si bon leur semblait, et c'est ce\nqui a été fait. Aussi la plupart des Métis se sont empressés de vendre leurs *scripts* à vil prix, pour 60 à 80 piastres, montrant ainsi l'importance qu'ils attachaient à ces fameuses réclamations pour lesquelles Riel leur a fait prendre les armes.\n\nQuoiqu'il en soit de ces réclamations et des retards, tout était réglé avant la révolte, et comme le Père André l'a déclaré au procès, dès le 4 mars, il recevait une dépêche lui annonçant que la Commission créée par un ordre du Conseil du mois de janvier précédent, avait reçu ordre de régler les dernières réclamations qu'il restait à faire valoir. Citons sur ce point le témoignage du Père André au procès de Régina :\n\n\"D. Voulez-vous dire si, depuis l'arrivée de l'accusé dans le pays jusqu'au temps de la révolte, le gouvernement avait fait quelque réponse favorable aux demandes et réclamations des Métis ? R. Oui. Je sais qu'il avait acquiescé à certaines demandes concernant ceux qui n'avaient pas eu de *scripts* dans le Manitoba. Un télégramme envoyé le 4 mars dernier accordait des *scripts*.\"\n\nD. Avant ce temps-là ? R. Oui. Quant au changement de l'arpentage des lots le long de la rivière, il y eut une réponse du gouvernement disant qu'il l'acquerrait, et c'était une question importante.\n\nD. Quelle question restait alors à régler ? R. Celle des patentes. Cette question a aussi été réglée en quelque sorte, car M. Duck fut envoyé et je l'accompagnai en qualité d'interprète.\n\nD. Quelle autre question restait-il ? R. La seule question du bois de construction.\n\nD. Savez-vous s'il y a une commission qui siège au sujet des réclamations et des demandes des métis ? R. Oui.\nLE BUT DE RIEL.\n\nCe règlement définitif annoncé dès le 4 mars, et qui était bien connu de Riel ne faisait pas son affaire; car la question Métisse, c'était lui, c'était son intérêt personnel qu'il poursuivait. Voyant que toutes les réclamations allaient être négligées, il persécuta aux Métis et aux sauvages qu'ils vont être poursuivis, persécutés par la police et il précipita l'affaire du lac aux Canards. C'est là toute la raison de la prise d'armes, comme elle déclaré le Père André dans sa lettre au lieutenant-gouverneur Dewdney.\n\nLe but de Riel était de personnaliser la cause des Métis et de la vendre, de se faire acheter par le gouvernement.\n\nAu procès de Régina, le Père André réitère son accusation d'une façon encore plus formelle. Citons encore son témoignage qui est corroboré par Charles Nolin, auquel nous laisserons d'abord la parole :\n\nD. A-t-il dit comment il ne proposait d'exécuter ses plans ?\nR. Non, pas alors.\n\nD. En a-t-il parlé dans la suite ? R. Il commençait à en parler vers le premier décembre 1884. Il commença à manifester le désir d'avoir de l'argent. C'est à moi, je crois, qu'il en a parlé le premier.\n\nD. Quelle somme a-t-il dit qu'il voulait ? R. La première fois qu'il parlait d'argent, je pense qu'il disait qu'il lui fallait $10,000 ou $15,000.\n\nD. De qui entendait-il avoir cet argent ? R. La première fois qu'il en parla, il ne savait trop quel moyen prendre pour l'obtenir, en même temps il me parla de son intention de réclamer une indemnité du gouvernement canadien, prétendant que ce gouvernement lui devait $100,000, mais la question était de savoir\nquelles personnes seraient chargées de s'adresser au gouvernement à ce sujet. Quelque temps après, l'accusé me dit qu'il avait eu une entrevue avec le Père André et qu'il avait fait sa paix avec l'église ; que depuis son arrivée dans le pays, il avait tenté d'éloigner le peuple du clergé ; que jusqu'alors il avait été en guerre ouverte avec le clergé. Il dit qu'il était entré à l'église avec le Père André, et qu'en présence d'un autre prêtre et du Saint-Sacrement, il s'était soumis, et qu'il ne ferait jamais rien contre le clergé. Le Père André lui promit de se servir de son influence auprès du gouvernement pour lui faire obtenir $35,000. Il se déclarait satisfait s'il recevait $35,000 alors, et dit qu'il réglerait lui-même avec le gouvernement pour la balance des $100,000. Cet arrangement eut lieu à Saint-Laurent, et ensuite le Père André retourna à sa mission de Prince-Albert.\n\nVoici maintenant le témoignage du R. P. André sur le même sujet :\n\nD. Je crois qu'au mois de décembre 1884, vous avez eu une entrevue avec Riel et Nolin au sujet d'une certaine somme que l'accusé réclamait du gouvernement ? R. Non, pas avec Nolin, Nolin n'était pas présent à l'entrevue.\n\nD. L'accusé y était ? R. Oui.\n\nD. Voulez-vous déclarer ce que l'accusé voulait avoir du gouvernement fédéral ? R. J'ai eu deux entrevues avec le prisonnier à ce sujet.\n\nD. L'accusé réclamait une certaine indemnité du gouvernement fédéral ? R. Lorsque l'accusé fit sa réclamation, j'étais là avec une autre personne et il voulait avoir $100,000 du gouvernement. Nous fûmes d'avis que cette demande était exorbitante et l'accusé répondit : \"Attendez un peu ; je prendrai tout de suite $35,000 comptant.\"\n\nD. Et à cette condition, l'accusé devait quitter le pays si le gouvernement lui donnait $35,000 ? R. Oui, c'est la condition que Riel mit.\n\nD. Quand cela se passait-il ? R. Le 23 décembre 1884.\n\nD. Il y eut une autre entrevue entre vous et l'accusé, n'est-ce pas ? R. Nous eûmes une vingtaine d'entrevues.\n\nD. N'était-il pas toujours à vous demander de vous servir de votre influence auprès du gouvernement pour lui obtenir cette indemnité ? R. Il m'a parlé de cette affaire pour la première fois le 12 décembre. J'avais jamais eu de contact entre nous avant cela, et le 23 décembre, il m'en parla de nouveau.\nD. Il en a parlé souvent? — R. En deux occasions seulement.\n\nD. N'était-ce pas sa grande préoccupation? — R. Oui, dans ces deux entrevues.\n\nD. N'est-il pas vrai que l'accusé vous a déclaré qu'il était lui-même la question métisse? — R. Ce n'est pas ce qu'il a dit en propres termes, mais c'était bien la pensée qui ressortait de ses paroles. Il m'a dit : \"Si je suis satisfait, les métis le seront.\" Je dois expliquer ceci. On lui objecta que si le gouvernement lui accordait les $35,000 la question métisse resterait toujours la même, et il répondit : \"Si je suis satisfait, les métis le seront.\"\n\nD. N'est-il pas vrai qu'il vous a dit qu'il accepterait même une somme moindre que $35,000? — R. Il m'a dit : \"Faites valoir toute votre influence; il se peut que vous n'obtenez pas tout cela, mais obtenez tout ce qu'il est possible d'avoir; si vous obtenez moins, nous verrons.\"\n\nLes Métis ont compris eux aussi après l'avoir appris à leur dépens les motifs qui faisaient agir Riel, et après la prise de Batoche, le R. P. André écrivait au Mail de Toronto, à la date du 24 juil. 1885, ce qui suit :\n\n\"Le calme est maintenant rétabli en cette région (Batoche) et le silence qui y règne fait un contraste des plus saisissants avec le bruit, l'agitation qui y révahent il y a à peine un mois. Qui que ce soit peut maintenant voyager sur cette rivière de la Saskatchewan sans appréhender aucun danger, soit de la part des Sauvages ou des Métis. Tous ces hommes égarés sont redevenus eux-mêmes; quand vous les rencontrez sur la route, ils se montrent des plus polis et des plus courtois. La défaité qu'ils ont éprouvée ne semble pas avoir laissé de ressentiment dans leur âme. Ils semblent contents comme tous les autres de voir l'insurrection finie.\n\nLe nom de Riel est en grand désarroi parmi eux, maintenant qu'ils voient clairement les mauvais desseins de celui qui fut leur chef. Ils ne peuvent comprendre, comment ils ont pu être assez aveugles pour le suivre et devenir ainsi les instrument de leur propre ruine. La leçon a été sévère pour eux et vraisemblablement, ils n'oublieront jamais le terrible prix que leur a coûté l'allégeance qu'ils ont donnée à Riel qui, en provoquant l'insurrection, a provoqué le plus terrible fléau qui ait frapper les Métis et leur pays.\"\n\nLe 12 juin 1885, six missionnaires écrivent de Prince-Albert :\n\nLouis David Riel ne mérite pas les sympathies de l'église catholique romaine et des membres de cette église, ayant usurpé notre mission de prêtres et privé notre population des avantages et des consolations que nous aurions pu lui offrir.\n\nIl a fait tout cela dans son intérêt purement personnel.\"\nCe document porte la signature des RR. PP. André, Touze, Moulin, Fourmond et Lecocq.\n\nLe frère J. M. Piquet avait écrit le 19 juin 1885 :\n\n\"Depuis que la rébellion est finie, nous sommes bien tranquilles ici. Mardi, 9 juin, les prisonniers métis et sauvages ont quitté Prince-Albert et sont partis pour Régina.\n\n\"Ici la tranquillité est rétablie. Dieu que nous avons souffert pendant cette insurrection. Nous venons d'être témoins de bien tristes choses. Quel homme que ce Louis David Riel ! Non content d'avoir entraîné ses compatriotes dans l'insurrection, il en a fait encore apostasier un grand nombre. Tout le monde sait maintenant, que le premier jour de la rébellion, Louis Riel s'est déclaré apostat et a voulu fonder une nouvelle religion. Il a renoncé au Pape, \"La vieille Romaine est cassée,\" disait-il. Il a remplacé le dimanche par le samedi, il a rejeté le dogme de l'Eucharistie, nié la divinité du Christ et celle du Saint-Esprit. Suyant lui le Père seulement était Dieu.\n\n\"Tous les matins, comme les sauvages infidèles, il racontait ses rêves.\n\n\"Pendant ces deux malheureux mois, il a dit aux RR. Pères, toutes les insultes possibles et imaginables. Il disait qu'ils étaient vendus au gouvernement et soulevaient les sauvages contre eux parce qu'ils préféraient la mort plutôt que d'adhérer à ses monstrueuses erreurs.\n\nNous disions tantôt que le but de Riel était son intérêt personnel et rien autre chose. En effet, du moment où Riel a arrivé au Nord-Ouest, le pétitionnement des Métis s'arrête. Ce serait là certes une circonstance fort étrange, si nous n'eussions trouvé l'explication dans une lettre de la main de Riel, adressée à nos frères les métis anglais et français du lac Qu'Appelle et des environs. Dans cette épître, Riel écrit à ses : Bien chers parents et amis.... Achetez toutes les munitions que vous pourrez. Allez vous en procurer s'il le faut de l'autre côté des lignes. Tenez-vous prêts. N'écoutez pas les offres que le gouvernement d'Ottawa va vouloir vous faire, ces offres sont des offres de voleurs. Ne signez ni papiers, ni pétitions, flez-vous sur le bou Di-u (Procès Riel). Cette lettre est confirmée par les témoignages de Wiloughby, Th. Jackson, etc., auxquels il a tenu un langage analogue. Voilà la manière dont cet homme instruit, ce guide du peuple, voulait faire de l'agitation constitutionnelle !\n\nMais ne nous imaginons pas que telle était l'unique préoccupation de Riel, nous verserions dans une erreur grossière. Pendant qu'il entraîne ces pauvres métis à leur perte, dans le but de forcer la main au gouvernement canadien, et d'obtenir de lui le règlement de sa réclamation de $35,000, il ne perd pas le nord et n'oublie pas de prendre ses précautions pour mettre sa responsabilité à couvert. Le 12 mai il dit à Astley : J'ai trois chances ou moyens d'échapper : d'abord par la politique ; deuxièmement, au moyen des papiers du conseil—Vous deviez savoir que j'ai\narrangé tous ces papiers de façon à démontrer que le conseil a tout fait ; je ne paraîtrai pas m'être mêlé du mouvement... Mon troisième moyen sera ma qualité de chef de la nouvelle religion. (Procès Arcand et autres.) Il tâche en outre de se faire bien venir des métis anglais, qu'il désire radicalement entraîner dans le mouvement, et à cet effet il a recours au fanatisme religieux : il leur dit que : Il s'est séparé entièrement de l'Église de Rome, et qu'il n'aura plus rien à faire avec le Pape, qu'il ne paierait plus de taxe à Rome. Que s'il restait attaché à Rome, il ne pourrait s'accorder avec les Canadiens et les blancs qui viendraient demeurer là, parce que leur gouvernement devrait chasser tous les protestants en dehors du pays s'il voulait rester en bonne intelligence avec Rome. (Procès Riel—Témoignage de Thomas Sanderson.)\nRIEL ET LES SAUVAGES\n\nUn des plus grands crimes que l'histoire aura le droit de reprocher à Riel, c'est d'avoir voulu soulever les sauvages. Il jugeait lui-même ce crime abominable et se félicitait en 1870 de ne pas les avoir soulevé lors de sa première insurrection. Mais comme nous l'avons vu dans la citation qui précède, il n'a pas reculé devant cette extrémité en 1885 et il a mis à son crédit ce crime de lèse-civilisation qui est toujours puni de mort aux États-Unis. C'est probablement ce qui a empêché le Président Cleveland d'intervenir pour Riel comme il en avait été requis, bien que Riel fut citoyen américain. À ce sujet, un de nos confrères Canadiens disait :\n\nLes journaux canadiens-français des États-Unis ont emboîté le pas derrière la presse rouge de notre Province. Ils ont tonné contre le gouvernement Ross, lancé l'anathème contre ceux qui lui conserveraient leur sympathie après ce qu'ils appellent un crime, une abdication ; mais il ne leur est pas venu un moment à l'idée de critiquer le Président des États-Unis, M. Cleveland, pour n'avoir pas intervenir en faveur du chef métis. Un peu de logique nous aurait fait mal, confrères. Si le gouvernement Ross est blâmable et nous venons de vous prouver que cela n'est pas le Président de la République américaine l'est bien davantage, car le prophète Riel était sujet américain et, à ce titre, avait en quelque sorte droit à la protection du gouvernement de l'Union. Vous ne souffrez pas de cette circonstance et vous ne trouverez pas à redire à l'indifférence indifférente du chef de l'État. Pourquoi cette différence ? Connaîtrez-vous par hasard les motifs du Président ? Pourquoi alors ne les faites-vous pas connaître ?\n\nNous allons vous dire, c'est que cela dérangeait un peu vos petites combinaisons rouges. Vous casseriez ainsi entre vos mains la seule arme que vous avez contre les conservateurs. Ce\nn'est pas logique, mais nous n'avons pas le droit de nous attendre à une abnégation de votre part et nous allons, nous, donner les motifs du Président.\n\nSi le Président Cleveland s'est abstenu de parler en faveur du rebelle, c'est d'abord qu'il ne pensait pas qu'il dut couvrir de sa protection un citoyen américain qui va fomenter la révolte dans un pays ami. De plus le Président connaissait les antécédents de l'exovide. Il savait qu'en 1878 Riel avait quitté St. Ives de Dakota pour aller s'établir au milieu de la nombreuse colonie de métis venu du Manitoba après les troubles de 69-70, à Sun River dans le Montana. Qu'ayant ouvert une école, il se constitua leur chef, leur fit refuser de payer les droits sur les marchandises importées du N.O., et emprisonner le shérif John Healy et ses deux assistants, venus pour confisquer ces marchandises et fourrures. Qu'il a fallu un corps d'armée pour délivrer ses fonctionnaires. Qu'une autre fois, il (Riel) prétendait que ses partisans avait droit de vote dans une élection territoriale et que, sur le refus des autorités de les recevoir au scrutin, il en ouvrit un lui-même et enregistra le vote des métis, offense pour laquelle il fut emprisonné au fort Benton. Le Président n'ignorait pas non plus que depuis son arrivée à Sun River les autorités n'avaient éprouvé que des difficultés, tandis qu'avant, la colonie était calme et paisible. Le président n'ajoutait pas foi à la prétendue folie du prophète et ne le croyait pas plus excusable que le tristement célèbre Guiteau. Mais ce qui a surtout décidé M. Cleveland à abandonner l'agitateur à son triste sort, c'est que celui-ci avait soulevé les indiens. Le Président s'est souvenu de ce que ces soulèvements de sauvages ont coûté à la république américaine, il n'a pas perdu de vue que dans son pays, on laisse à l'autorité militaire le soin de faire respecter la loi, que dans certaines circonstances, comme dans le massacre de Custer, les fauteurs de la guerre indienne ont été fusillés et pendus par quatre douzaines. Il a sagement pensé que le Gouvernement canadien avait usé envers le rebelle Riel, d'une longanimité que la loi américaine n'admet pas, et qu'il ne fallait pas demander la grâce d'un homme, qui d'après les lois de la république, aurait été passé par les armes séance tenante.\nCES BONS AMIS DE RIEL\n\nIl est bon de mettre sous les yeux du lecteur les opinions émises avant le 16 Novembre 1885, par la presse grite-libérale sur Riel, sa rébellion et le sort qu'il méritait.\n\nCes déclarations font voir avec quelle joie féroce M. Blake et les siens eussent pendu Riel s'ils avaient été au pouvoir, à la place des ministres actuels.\n\nNos ministres conservateurs ont refusé de gracier Riel par pur sentiment du devoir, par respect pour leur serment d'office et par obéissance aux rigoureuses exigences de la justice ; mais si les adversaires de sir John eussent été appelés à statuer sur le sort du meurtrier de Scott, ils l'auraient envoyé à l'échafaud pour assouvir une vengeance qui couvait depuis 15 ans.\n\nLes conservateurs ont puni Riel par devoir et à regret, les grits l'auraient puni par vengeance et avec une suprême satisfaction.\n\nCitons d'abord ce que disait la Patrie de Montréal au moment de la rébellion en mai 1885. Ce que l'organe libéral dit des griefs de Riel est surtout à noter. Si tels griefs avaient existé sérieusement, un journal de cette importance aurait-il pu les ignorer à cette phase de l'agitation ? N'y a-t-il pas là une pré-omission, sinon une preuve, que ces griefs sont imaginés et fabriqués pour les besoins de la cause. Nous citons :\n\n\"Nos lecteurs verront par nos dépêches que M. Louis Riel est en train de faire encore des siennes dans le Nord-Ouest. Nous ne connaissons pas assez les griefs du chef de bandes pour apprécier avec impartialité sa nouvelle tentative d'insurrection, mais si nous en jugeons par ce que nous connaissons du jeune tapageur, nous sommes d'avis que ceux qui le suivent feraient mieux de l'engager à se tenir tranquille.\n\n\"Riel est toujours de plus en plus menaçant. On est très ému à Winnipeg. Nous ne souhaitons aucun succès à cette folle entreprise.\"\n\nCitons maintenant quelques passages recueillis, dans le temps et au hasard, dans les colonnes des journaux organes de M. Blake, celui que nos rouges ont effrouterie de nous proposer pour remplacer Sir John sous le prétexte de venger la mort de Riel.\n\nGlobe, 25 Mars 1885 :\n\n\"S'il a été commis des crimes comme ceux que l'on dit avoir été commis, il sera peut-être jugé nécessaire que les chefs, au moins, soient punis. Mais que doit-on faire de Riel, cette fois ? Il semble qu'il ait porté le peuple à la révolte. On dit qu'il était à\nla tête de ceux qui ont commis des délits si graves et si nombreux. Va-t-on encore mettre sa tête à prix?\"\n\nGlobe, 30 mars 1885:\n\nLe premier sentiment a été un sentiment de profond regret. Le second a été que la loi et l'ordre doivent être maintenus à tous prix et que les insurgés, quels que soient leurs griefs, doivent apprendre que la résistance armée à l'autorité suprême est un crime si grand que cela leur enlève tous droits à la sympathie.\n\nGlobe, 31 mars 1885:\n\n\"La rébellion doit être réprimée et tous les partis doivent aider sincèrement le gouvernement à rétablir la paix au Nord-Ouest et à traduire devant les tribunaux ceux qui ont porté ces gens à l'insurrection.\"\n\nGlobe, 4 avril 1885:\n\nIl est à espérer que les instructions données au général Middleton comprennent l'offre d'une amnistie à tous, à l'exception de Riel et des quelques individus qui ont tiré sur le drapeau patriote du major Crozier, s'il est vrai qu'on ait tiré ainsi, et à l'exception de ceux qui sont personnellement impliqués dans tout autre crime qui aurait pu être commis.\"\n\nGlobe, 22 août 1885:\n\n\"On ne saurait douter non plus qu'il ne soit sans esprit de puisque le jury avait entendu les témoignages des spécialistes, a décidé que Riel était responsable.\"\n\nGlobe, 3 août 1885:\n\n\"La lettre de Riel au major Crozier prouve clairement que le prisonnier avait non seulement pris part à la rébellion, mais qu'il en fut le véritable instigateur, l'esprit dirigeant.\"\n\nGlobe, 14 août 1885:\n\nLe Free Press a raison de déclarer qu'aucun des griefs des métis ne saurait justifier la conduite de Riel et que le crime pour lequel il a été condamné semble ne devoir être attribué qu'à des sentiments de haine. Tous ceux qui ont lu les dépositions des témoins ne peuvent nier que Riel mérite richement la mort.\n\nLe Reforme de Gatineau, un autre journal rouge-gris, disait à son tour de Riel:\n\nLe gouvernement n'osera probablement pas permettre à Riel de s'échapper une deuxième fois.\n\nLa population n'est pas d'humeur à se laisser blaguer par le temps qui court, et Riel doit monter sur l'échafaud pour expier son crime.\"\n\nLe 22 juin 1885, le Free Press d'Ottawa disait:\n\nRiel est un rebelle; il a pris les armes contre l'administration des lois du pays; il est coupable d'avoir exclu les sauvages et les métis à la révolte; il est la cause immédiate des meurtres, des outrages, des grandes pertes de bien et des dépenses de plusieurs millions de piastres. Les griefs des métis sont quelque chose ou des outrages pépétités par Riel sont une autre...\nCONCLUSION\n\nDans une lettre qu'il écrivait au gouverneur Dewdney, après l'arrivée de Riel au Nord-Ouest, le R. P. André rapporte les paroles suivantes prononcées par Riel devant une assemblée de Métis : \"Le Riel de 1869 et celui de 1884 sont deux hommes bien différents. En 69, il se souleva contre le Canada, qui voulait prendre possession du pays sans faire d'arrangement préalable pour garantir les droits de la population du Manitoba et du Nord-Ouest ; mais aujourd'hui le Nord-Ouest est une partie intégrale du Canada, et après une expérience de 9 années passées aux États-Unis, il peut assurer ses compatriotes les Métis qu'ils sont mieux de ce côté-ci de la frontière et qu'il ne veut pas qu'ils deviennent américains.\"\n\nEt c'est après avoir montré aux Métis du Canada qu'ils étaient plus heureux que s'ils étaient Métis Américains qu'il prend sur lui, un an plus tard, de les conduire à la boucherie et à la ruine ! Il semble qu'il n'en faut pas davantage pour démontrer la perfidie et la méchanceté de Riel.\nLe Parti Conservateur et les Ouvriers\n\nLe parti libéral qui a la spécialité de toutes les hypocrisies, a poussé l'audace, en ces derniers temps, jusqu'à vouloir se poser en ami de la classe ouvrière. On se demande à quoi sert cette démarche ? Est-ce parce qu'il refuse en 1878 de protéger l'industrie nationale, ce qui laissait sur le pavé des milliers d'ouvriers éconduits des manufactures mises dans l'impossibilité de soutenir la concurrence des manufactures américaines protégées à outrance ? Qu'on nous montre la preuve d'amitié donnée par les libéraux à la classe ouvrière ! Que l'on s'entende ! Nous ne voulons pas des promesses ni de belles paroles, mais des faits. C'est toujours là qu'il faut en arriver : Des faits donc. Hélas, ils sont bien rares !\n\nEn 1872, le chef libéral George Brown, rédacteur du Globe, faisait emprisonner 24 de ses ouvriers parce qu'ils faisaient partie d'une société ouvrière, une Trade Union. Il s'était appuyé pour faire ce coup d'autorité sur un ancien statut anglais qui condamnait les coalitions d'ouvriers ! Il ne s'éleva aucune protestation du sein du parti libéral, ni à Montréal, ni à Québec, ni à Toronto. Cet acte de tyrannie, sans précédent au Canada parut tout naturel à ces amis du peuple et de la liberté. Sir John indigné de cet abus de pouvoir, se servit de son autorité de ministre de la justice pour faire remettre ces ouvriers en liberté et le gouvernement conservateur faisait passer à la session suivante, la loi qui permet les coalitions d'ouvriers. N'est-ce pas la loi la plus favorable qui ait été passée dans le pays en faveur de la classe ouvrière ? Grâce à cette loi les ouvriers peuvent se coaliser si les patrons abusant de leur pouvoir voulaient les exploiter.\n\nLe parti conservateur ne s'est pas arrêté là, et dernièrement il a créé une commission qui étudiera la question ouvrière et cherchera à prévenir les grèves si dangereuses pour les patrons et pour les ouvriers. Ne sont-ce pas là deux preuves tangibles de l'intérêt que le parti conservateur porte à la classe ouvrière ? Nous ne\nparlons pas de la politique nationale, car les ouvriers sont assez intelligents pour comprendre que s'il est vrai que cette politique favorise tout le pays, il n'en est pas moins évident qu'ils sont les premiers à en profiter et à en sentir les meilleurs effets.\n\nNous ne pourrions mieux faire connaître cette question qu'en citant quelques extraits du discours prononcé sur ce sujet l'automne dernier à Ottawa par Sir John lui-même :\n\n\"Puisque cette assemblée a été convoquée par l'association libérale conservatrice des artisans et par le cercle Lafontaine, disait Sir John, qui est composé en grande partie d'ouvriers, je crois qu'il est à propos de discuter brièvement, la différence qui existe entre la politique des Gris et celle des Conservateurs, quant à ce qui regarde la classe ouvrière surtout, je désire vous bien convaincre que la politique du gouvernement actuel, a toujours été de travailler au développement des ressources matérielles et intellectuelles et à l'amélioration de la position sociale des ouvriers, (applaudissements) et pour vous prouver cela je vous parlerai de quelques-uns des sujets qui intéressent le plus les classes ouvrières. D'abord j'appelle votre attention sur un fait que beaucoup d'entre vous ne connaissent pas à cause de leur jeune âge ; je veux parler de la manière dont les ouvriers ont été traités à Toronto ; ces braves artisans, dans le but de protéger et d'assurer le libre exercice de leurs droits, se formèrent en une organisation puissante de défense et de secours mutuels ; cette mesure de prudence bien légitime leur valut l'injure d'être accusés de conspiration et de se voir traînés en prison. Les lois régissant les unions ouvrières, en Canada, en 1872 étaient excessivement sévères.\n\nL'Angleterre avait abrogé l'ancienne loi qui empêchait les ouvriers de s'unir en associations, et nous n'avions jamais cru qu'au Canada dans ce jeune pays qui sort du berceau, cette même loi serait un jour mise en vigueur ; M. le président, c'est un fait reconnu que la population entière du Canada en a été épouvantée dans le temps, oui, en 1872, nous avons vu l'ancien chef du parti Réformiste du Canada, prendre sur lui d'appliquer dans la ville de Toronto, cette loi surannée, typhonique, tombée en désuétude, et qui aurait dû être à jamais abrogée il y a plus d'un siècle.\n\nNous nous souvenons tous du sentiment général d'indignation, de dégoût et d'horreur que fit naître la nouvelle de l'arrestation de 24 ouvriers, jetés dans la prison de Toronto, parceque, poussés\nà bout, ces hommes s'étaient permis de s'organiser en une union ouvrière et avaient manifesté l'intention de donner effet aux principes de leur association.\n\nLe 18 avril 1872, vingt-quatre typographes ont été arrêtés à Toronto ; ils étaient accusés de conspiration ; et M. le président et messieurs, laissez-moi vous citer le langage que tenait alors le chef du parti Rouge, le rédacteur du Globe. Permettez-moi de vous rapporter ce qu'il a dit dans une assemblée de patrons, tenue le 18 avril, à Toronto. M. Brown fit à cette assemblée un discours des plus violents contre les organisations ouvrières, et entre autres choses, il disait : \"que les patrons ne devaient pas s'occuper du tout de ceux qui appartaient aux unions, qu'ils ne devraient employer que ceux qui déclareraient par écrit n'appartenir à aucune union ; il espérait que ceux des ouvriers qui s'étaient rebellés contre leurs maîtres seraient chassés du Canada, c'est là, dit-il, la meilleure ligne de conduite à suivre ; les réglements des organisations ouvrières sont intolérables.\"\n\nM. le Président, j'étais ministre de la justice dans le temps, et en ma qualité de ministre, j'ai conseillé au représentant de Notre Souveraine d'ordonner immédiatement que ces 24 ouvriers fussent relâchés et qu'il leur fut encore permis de jouir des douzeurs de la liberté. Et plus que cela, j'ai, de suite, présenté un bill au Parlement, abrogeant ces vieilles lois tyranniques, et tombées en désuétude en vertu desquelles ces hommes avaient été arrêtés. Je les ai rayées de nos statuts, car je les considérais comme une honte pour notre grand siècle, de civilisation. J'ai ensuite présenté et fait adopter un autre bill, permettant la création d'unions ouvrières et remettant en vigueur celles qui avaient été établies précédemment. En vertu de cette loi, les unions ouvrières du Canada peuvent se réunir et agir de concert ; elles peuvent surveiller et promouvoir leurs propres intérêts, et si besoin il y a, elles ont le privilège de se protéger contre toute injustice que les patrons et capitalistes pourraient exercer contre eux.\nTRAVAIL DES PRISONNIERS\n\nIl y a une question qui a agité les classes ouvrières d'une extrémité à l'autre du Canada, et qui a fait plus de bruit que ne l'auraisait son importance ; c'était tout de même une cause permanente d'ennuis et de recriminations, d'une nature irritante, et qui a fait que de vives protestations d'indignation se sont fait entendre en parlement et en dehors du parlement. Il s'agissait de l'emploi du travail des prisonniers et de l'amener en concurrence avec le travail de l'honnête ouvrier. Des hommes, comme récompense de leur crime, étaient vêtus, nourris et confortablement installés dans le pénitencier, tandis que les ouvriers qui n'étaient ni flous, ni voleurs, ni meurtriers étaient obligés de contribuer, par la taxe, au maintien de ces individus dans le pénitencier. Les ouvriers prétendirent que c'était offrir une récompense au crime, et que cet état de chose ne devait plus être toléré. Dès avant 1873, lorsque nous nous retrouvions, le gouvernement à cette époque (le gouvernement conservateur) avait mis cette question à l'étude, et il avait promis au parlement, et il avait promis au pays qu'il abolirait le système de contrats auquel le travail des prisonniers était soumis, au fur et à mesure que le permettraient les contrats qui existaient alors, et qu'il n'emploierait le travail des prisonniers qu'à des travaux qui ne faisaient pas concurrence aux honnêtes ouvriers du pays ; et nous mettions ce principe en pratique de la manière la plus large que le permettrait la bonne foi et les obligations légales que le gouvernement avait contractées plusieurs années auparavant en donnant des contrats à long terme pour la fabrication de certains articles. Mais lorsque nous avons abandonné le pouvoir nous avons constaté que le gouvernement\nde M. MacKenzie ne s'entendait pas avec nous sur cette question. Il adopta de sang-froid la doctrine d'économie politique au point de vue utilitaire—que les effets doivent être produits à bon marché, que les prisonniers doivent être employés, et que leur travail doit être utilisé, qu'il privat ou non de travail l'honnête ouvrier—quelque fut le résultat vis-à-vis de l'artisan honnête. En 1875, alors que je dirigeais l'opposition, je soumis cette question au parlement : Je demandai si le gouvernement avait adopté une politique quelconque au sujet de l'exploitation du travail des prisonniers par contrat ; vu que, en général, les auteurs contemporains désapprouvaient ce système.\n\nM. MacKenzie, (Débats, page 641) dit, \"son gouvernement n'avait pas adopté de politique déterminée.\" (Rires.) Tel a été leur défaut pendant les cinq années qu'ils ont été au pouvoir. Ils n'ont jamais eu d'autre politique que celle de toucher leurs appointements tous les trois mois. (Rires.) \"Le gouvernement,\" dit-il, mettra ce sujet à l'étude après la session. Il a une idée à ce sujet qui n'est pas encore clairement définie, ce serait d'employer les prisonniers aux travaux publics du pays. Il est possible qu'ils seraient capables de fabriquer la plus grande partie du matériel roulant des longues voies ferrées qui vont être construites. C'est une des raisons pour laquelle il désire placer les prisons des Provinces Maritimes à des endroits avantageux, près du chemin de fer Intercolonial ; mais le gouvernement n'a encore rien décidé à cet égard.\n\nNous avons mis fin au système et maintenant le travail des prisonniers ne vient plus en concurrence avec le travail de l'ouvrier.\"\n\nEn dépit de l'opposition des libéraux, le gouvernement conservateur a aussi fait passer à la session de 1886 une loi pour arrêter l'immigration des Chinois au Canada et protéger l'ouvrier de race blanche contre le travail à vil prix des immigrés du céleste empire et éviter les troubles de toutes espèces que la présence des Chinois a provoqués en Californie.\n\nSir John terminait comme suit son discours :\n\n\"Pour résumer mon discours, nous avons légalisé les unions ouvrières, et nous avons fait en sorte que les ouvriers ne soient plus arrêtés et envoyés en prison, parce qu'ils appartiennent à ces unions. Nous avons aboli le travail des prisonniers et la concurrence injuste que ce travail faisait à l'honnête artisan.\"\nNous avons mis un frein et une fin au travail chinois dont on était inondé, nous avons payé un taux raisonnable d'intérêt à l'ouvrier qui tout en faisant profiter son argent, le place dans l'endroit le plus sûr du monde. En adoptant cette politique, sur tous et chacun de ses points, nous l'avons fait en dépit de l'opposition constante de ceux qui prétendent s'appeler Réformistes.\n\nMaintenant, M. le Président et Messieurs, vous avez dit que nous avons fait dans le passé, je vais vous dire, en peu de mots ce que nous nous proposons de faire à l'avenir. D'abord, nous allons appliquer les principes que nous avons professés jusqu'à présent, et en maintenant notre même politique, nous allons nous efforcer de développer les industries du pays afin d'en faire la patrie de l'une des nations les plus prospères de l'univers.\n\nNous nous proposons en second lieu d'établir un bureau de statistique du travail. Nous avons annoncé ce projet, mais nous allons être obligés, je crois, de nous adresser à la Législature pour lui faire adopter une mesure qui étende nos pouvoirs à cette fin. Sans ce bureau, sans la statistique du travail, nous ne pouvons arriver à une solution satisfaisante des diverses difficultés qui de temps à autre surgissent des conflits entre le travail et le capital.\n\nEn troisième lieu, nous avons décidé de constituer une commission Royale, dans laquelle les ouvriers seront suffisamment représentés. Cette commission aura pour mission de s'enquérir de toutes les questions qui pourront surgir des conflits entre le capital et le travail et de faire rapport de leurs recherches. Afin de vous faire mieux comprendre la nature de cette commission je vais vous énumérer les pouvoirs dont elle sera investie. Les commissaires devront s'enquérir de l'état du travail et faire rapport, et constatant la nature des relations existant entre l'ouvrier et le maître ; ils verront aux heures de travail, et aux gages des journaliers et des femmes ; ils avisent aux moyens de promouvoir leur prospérité matérielle, sociale, intellectuelle et morale et de développer l'industrie du pays de manière à en améliorer le commerce en général. La commission devra de plus voir à juger et à régler à l'amiable les différends qui pourraient survenir entre les patrons et leurs employés. Elle décidera s'il est opportun de soumettre toutes les questions dont elle sera chargée de s'enquérir, au contrôle de l'un des Ministres de la Couronne, qui sera spécialement chargé\nde s'occuper de toutes les grandes questions qui intéressent le commerce,—en d'autres termes, de nommer un Ministre du Trafic et du Commerce, qui aura sous sa garde et sous sa surveillance toutes les questions nombreuses et importantes qui surgissent, directement ou indirectement au sujet du trafic et du commerce. En ce faisant, elle mettra en exécution les conclusions auxquelles en sera venue cette Commission Royale. Dans cette commission se trouveront des artisans et non pas des artisans d'occasions mais bien de véritables ouvriers qui travaillent à leur métier, et qui apporteront au Gouvernement, dans la solution de ces grandes et importantes questions, l'aide de leurs connaissances pratiques et de leur expérience dans chacun de leur métier.\nA PROPOS DU \"MAIL\"\n\nNos confrères rouges et ceux qui ne valent pas mieux qu'eux, pour ne pas dire moins, comme l'Élendard et la Vérité, se sont voilés la face en entendant le Mail de Toronto, tonnant contre l'influence du clergé et de la race française. On aurait dit que leurs oreilles n'étaient pas habituées à pareilles sottises, cependant c'est la monnaie courante de leur parti. En ce qui regarde l'Eglise le Mail ne fait que hurler ce que les bons rouges chuchotent tout bas. Mais ceux qui connaissent la situation savent fort bien que plus le Mail s'éloignait de nous et des conservateurs, plus il se rapprochait des libéraux. Inutile pour vous de vous récrier ; personne n'osera contester sérieusement que le grand nombre des chefs libéraux pensent autrement que le Mail. Ils tolèrent bien dans leurs rangs le Witness, et quelle différence entre ces deux journaux ? S'il y en a une elle est en faveur du Mail qui est moins vieux dans le fanatisme.\n\nEt le Free Press de Winnipeg, un organe libéral, un franc frère en radicalisme, dépasse le Mail de plusieurs longueurs de tête. Il demande purement et simplement l'abolition de la langue française au Parlement de Manitoba et la persécution de l'élément français. Il ne se cache pas au moins celui-là : il montre clairement son but.\n\nVoici en quels termes le Manitoba explique la situation que les gris veulent faire à l'élément français du Manitoba :\n\n\"Maintenant, voyons pourquoi nous combattons et devons combattre toute candidature qui aurait pour but de détruire l'état présent des choses :\n\n1o. Parce que les chefs du parti de l'opposition appuyés par le Free Press, prétendent que nous jouissons d'une plus grande part d'influence que celle à laquelle nous avons droit. Ces messieurs ne se gênent pas de dire que c'est trop pour nous de six députés sur trente-cinq qu'il y a. Superflu de répéter ici ce qu'a dit à ce propos le Free Press qui en cela se faisait le complaisant écho de M. Martin, député de Portage-la-Prairie.\n\n2o. Parce que MM. Fisher, Lindsay, McLean et plusieurs autres candidats de ce parti, osent dire ouvertement qu'ils ne nous re-\nconnaissent pas de droit à l'usage officiel de la langue française et en demandent l'abolition.\n\n30. Parce que l'opposition, en principes, et plusieurs de ses candidats ont déjà exprimé leur opinion à ce sujet, est en faveur de l'abolition de notre système d'écoles séparées.\n\nDans un autre numéro, le même journal disait :\n\n\"En vérité, pouvons-nous attendre quelque chose de raisonnable des messieurs de l'opposition ? La ligne de conduite qu'ils ont tenue autrefois et celle qu'ils tiennent encore aujourd'hui ne nous fournit-elle pas un enseignement précieux dont nous devons profiter ? Sont-ils soucieux de ce qui nous est cher, ces hommes qui comme M. Fisher, par exemple, le président de l'Association de Réforme dont le programme est adopté par le Free Press, prêche dans sa campagne électorale l'abolition de la langue française, et prétend que nous n'avons aucun droit constitutionnel à son usage dans la législature et les cours de justice ? Sont-ils soucieux de ce qui nous est cher, ces hommes qui trouvent qu'ici, à Manitoba, nous avons plus que ce que nous méritons ? Ces hommes qui ont écrit jadis contre nos immunités politiques, dans certains journaux de Winnipeg et au Globe de Toronto, et qui, nous en avons la conviction, écriraient encore aujourd'hui s'ils n'étaient obligés de faire leurs opinions par nécessité politique ?\n\nNous savons ce qui en est du Mail du Free Press et du Witness mais il reste un petit côté de la question bien intéressant à étudier. La presse conservatrice de Québec a combattu le Mail sans plus ni moins de ménagement que s'il avait été une feuille libérale. Sir John s'est hâte de repousser des lèves dernier l'homme qui tournait le dos à son passé. M. Meredith, le chef de l'opposition conservatrice d'Ontario, en a fait autant et le Mail a été forcé de déclarer qu'il se séparait du parti conservateur, arborant un nouveau drapeau et devenant purement et simplement l'organe des prohibitionnistes et des protestants. À l'heure qu'il est, il publie des articles contre le gouvernement d'Ottawa qu'il signale à l'opinion publique comme l'instrument du clergé du Bas-Canada. Voilà où il en est descendu.\n\nSi Sir John au nom de son parti, si M. Meredith, au nom de ses partisans n'avaient pas complètement rompu avec le Mail, s'ils ne l'avaient pas désavoué, il y a déjà longtemps, nous prenions sur nous de déclarer que ses collègues français et catholiques se seraient retirés du cabinet fédéral.\n\nCette déclaration fera peut-être crier les libéraux, mais il faut bien qu'ils apprennent la différence qu'il y a entre des hommes de gouvernement, ayant souci de leur réputation et des individus qui ne font que de la politique d'expédients et d'aventure, comptant plus pour arriver au pouvoir sur le mal qu'ils peuvent inventer sur le compte de leurs adversaires que sur la valeur de leur programme et de leurs principes.\n\nLeur programme, leurs principes ! Quel sujet d'inégalable comédie ! Le programme et les principes de gens qui pendant\ndeux générations, de Papineau à MM. Laurier, Mercier, David et Beausoleil, ont réclamé la protection comme le seul moyen de sauver la province de Québec et qui ont renié ce principe pour obtenir McKenzie. Parlez-en des principes des hommes qui font passer la servilité à leur chef avant le salut du pays ! Voilà les vengeurs de Riel bien disposés à laisser ruiner toute une population.\n\nEt ces pauvres politiques de bas étage qui ont fait tant de bruit autour du Mail, quand ont-ils répudié le Witness et le Free Press ; quand ont-ils condamné les francs-maçons du Bas-Canada, eux qui seignent d'avoir une si grande horreur pour les orangistes de l'Ouest ! Hélas ! tout n'est que contradiction chez ces hommes qui ont pour alliés bien dignes d'eux, les enragés qui, pendant les deux mois avant le 16 novembre, ne cessaient de demander la tête de Riel et condamnaient son exécution !\n\nLes rouges d'aujourd'hui sont bien les dignes descendants des rouges d'il y a vingt ans, marchant sous la férule de George Brown et du Globe.\n\nOnt-ils jamais alors répudié la feuille qui insultait nos prêtres et nos religieuses, ont-ils répudié George Brown, le chef du parti ? Non, ils l'ont supporté.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001417.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 52, "total-input-tokens": 67598, "total-output-tokens": 30118, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1394, 2], [1394, 3731, 3], [3731, 5115, 4], [5115, 7118, 5], [7118, 9330, 6], [9330, 11412, 7], [11412, 13436, 8], [13436, 14354, 9], [14354, 16196, 10], [16196, 18538, 11], [18538, 20940, 12], [20940, 23231, 13], [23231, 26019, 14], [26019, 28610, 15], [28610, 31155, 16], [31155, 33563, 17], [33563, 36406, 18], [36406, 37615, 19], [37615, 39337, 20], [39337, 41618, 21], [41618, 43793, 22], [43793, 44452, 23], [44452, 46087, 24], [46087, 48123, 25], [48123, 50152, 26], [50152, 52471, 27], [52471, 53967, 28], [53967, 55036, 29], [55036, 56936, 30], [56936, 59364, 31], [59364, 61001, 32], [61001, 62600, 33], [62600, 64895, 34], [64895, 67532, 35], [67532, 70454, 36], [70454, 71298, 37], [71298, 73178, 38], [73178, 75483, 39], [75483, 77854, 40], [77854, 80381, 41], [80381, 81398, 42], [81398, 83455, 43], [83455, 85972, 44], [85972, 88061, 45], [88061, 89841, 46], [89841, 92237, 47], [92237, 94707, 48], [94707, 95462, 49], [95462, 97578, 50], [97578, 100566, 51], [100566, 101752, 52]], "primary_language": ["None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]