[{"id": "4b454acf2a1fc8078478a8798d6e22bee9ff0683", "text": "Mr. BLAKE. I trust the hon. gentleman who has just sat down (Mr. Macintosh) will not impute to me any desire to depreciate the varied and versatile talents of which he has just given us an illustration, if I do not devote any considerable portion of the time for which I shall feel called on to trespass on the House, to a discussion of his speech. It was indeed a production which, if it were to be followed and discussed, would lead us tolerably far afield from the question we are now called upon to debate; and there is nothing I more admired than the apparent fervour and freshness and zeal with which the hon. gentleman in his peroration, denounced the propriety of dealing with dead issues, after he had commenced his speech, by laying before us an olla podrida not very savoury of ancient fancies and fictions, rather than facts, which he proposed should be discussed so as to prevent us from dealing with the very serious issue which is really before us. I have admired his skill and talent in several capacities. I have admired his skill in the making of printing contracts; I have admired his powers in the acquisition of railway subsidies; and I am to-day called on to admire his attainments in the profession of law; and in the profession of medicine, as well as in that process of the collection of odds and ends of dead issues, which he began by telling us about, though he ended by denouncing their being raised. Now, Sir, the question before us belongs to that part of the administration of justice for which the Executive is responsible to Parliament. It is, in its nature, out of the ordinary scope of our enquiries. But I am glad to know that the Government has frankly recognized the proposition which I ventured a few weeks ago to suggest in public—that this particular case\n\nComes fittingly within the scope of our enquiry;\n\nthat it is a proper thing, under the circumstances which have occurred, and in the condition of the question that it should be brought into parliament, and should be here debated and decided. There is, therefore, on this occasion, no necessity to engage in the consideration of what are the limitations under which we may properly intervene in Parliament with this portion of the administration of justice, because both sides of the House appear to agree that this particular case does not fall within any rule which should\nprevent our interference, but rather that its nature is such as imperatively demands our interference; and, for my part, I should have thought it a humiliation to the Parliament of Canada if—in the circumstances which preceded, which attended, and which have followed the event round which the interest of this debate centres—it should have been argued by any responsible statesman, that it was in this Chamber, and in this Chamber only, that there should not be free discussion, and a decision after that discussion, upon the conduct of the Administration. But while this is the case, and while I for my part do not desire to complicate the particular issue which is raised with any other issue not necessary to be considered in order to its determination, I am not equally able to compliment the Administration upon the mode in which they—because I drop disguises, and say they—have brought this question forward, and have insisted that it shall be debated. I entirely agree that, while the case is one for our consideration, the discussion is of a delicate character, dealing as it does with the administration of justice. It is a case in which I believe\n\nWe ought absolutely to eschew all spirit of partisanship.\n\nin which we ought, as far as possible, to eliminate from our minds all spirit of party, and which we ought to approach as nearly as we may with the calmness, the dignity, and the impartiality of the judge. This is always a difficult task for a political body, and therefore a task rarely to be attempted—to be attempted only under that pressure of necessity which rests upon us today. But it is a task peculiarly difficult on the present occasion, because of those questions of race and creed which have been drawn into the discussion; because of the old offence, which has been made, rightly or wrongly, a part of the question under consideration; and because also of the question of the responsibility of the Government itself in connection with the outbreak which gave rise to the trial which resulted in the sentence which the Government ordered to be executed.\n\nBut, Sir, though I quite recognise the special difficulties which surround us in approaching this our task, in the spirit in which it ought to be approached, I conceive that the existence of those difficulties only makes the adoption of that spirit the more imperative, and that our duty is, so far as the interests of truth and justice will allow, to say no word that may irritate, and as far as possible, to take a course which may heal old scores—and new scores too.\n\nI agree in the observation which was thrown out from the opposite side of the House the other day, as to the general tone and temper of the debate so far; and I hailed with extreme pleasure the courteous and kindly compliments which were paid to my hon. friend beside me (Mr. Laurier), by two of the Ministers, on his speech of the other evening. It is to my mind the crowning proof of French domination. My hon. friend, not contented with having for this long time, in his own tongue borne away the palm of parliamentary eloquence, has invaded ours; and in that tongue has pronounced a speech, which, in my humble judgment, merits this compliment, because it is the truth, that it was the finest parliamentary speech ever pronounced in the Parliament of Canada since Confederation; That speech has been complained of a little because it differed from the tone, it was said, of former speeches. Some things have been said upon it to which I may ask your permission to allude at a later date.\n\nNow, Sir, the hon. member for Ottawa (Mr. Mackintosh), announcing in varied tones and at different intervals, the attitude of hon. gentlemen on this side of the House, with reference to this question, a little mistook it, and, I think without any justifiable cause for such mistake. I have the honor to occupy, however unworthily, the position of leader of the Liberal party; and with a full sense of the responsibility attaching to that position, I took at the earliest practicable moment, after my return to the country, the opportunity of declaring publicly, what I conceived ought to be and was the\nattitude of that party towards this question. I have since enforced by argument on all occasions, the view that that was our true attitude; and I repeat today, in the presence of this Parliament, the declaration I then made, that upon this subject there has not been, nor is there intended to be, the slightest association of party in our ranks,—that offset purpose and in the belief that we shall so best discharge our duty to our country, we have agreed that each one of us shall, after listening to the arguments and coming to such conclusion as we can, vote as he conceives, entirely irrespective of party alliances, the interests of his country demand.\n\nSome hon. MEMBER. Hear, hear.\n\nMr. BLAKE. Hon. gentlemen opposite cheer derisively. I understand them perfectly; they cannot conceive of such an act. It is incredible to them that public men should so act, and I do not feel moved at all by their cheers, knowing as I do, from eighteen years' experience, their manner of conducting business. But what I say is true, for all that; and so, upon this occasion,\n\nI must speak, not at all in my capacity of leader of a party, but as an individual for myself alone\n\nThe hon. member for Lincoln (Mr. Ryker), the other evening, very much complained that I had not been heard from earlier, and he also, with that vivid imagination which he shares with the hon. member for Ottawa (Mr. Mackintosh) made some statements with reference to my course in debates on important questions, which I might challenge if it were perhaps worth while. I had thought that I had expressed opinions which are recorded in the Debates, and of which I believe I have no cause to be ashamed, with reference to the Streams Bill, the Boundary Question, so far as that was at all a constitutional question, and the License Law. But it seems that the hon. member's diligence and researches have failed to recall to his recollection or to enable him to ascertain that I ever spoke on any of these topics. However that may be, I never intended that this debate should close without my saying something upon this question; but, as I stated upon the occasion to which I refer, I desired to hear, being entirely uncommitted by any declaration or absolutely formed opinion, what was to be said on both sides of the question, and I have awaited, I think, a convenient time for the presentation of the case by those who have been assailing the Administration and by the Administration in its defence. I think we have the right to assume, at this period of the debate, that all the material positions which could be brought forward on the side of either of the contending parties have now been advanced. I waited, I confess with some anxiety, to hear the legal adviser of the Government, who, I thought, might at an earlier period than this have enlightened us upon those portions of this important question which specially appertain to his duty, to his responsibility, and to his office. But when I saw, two or three nights ago, after the close of the speech made by the hon. member for Iberville (Mr. Béchard), though half a dozen Ministers or more, including the Minister of Justice and the Secretary of State, were in their places, that the Government declined to rise; when I saw their supporters calling \"question;\" when I saw the Government insisting upon Opposition members, or upon hon. gentlemen on this side, gentlemen who did not take the view that the Government took, following one another, and thus declining the debate; when I found my hon. friend from East Quebec (Mr. Laurier), obliged to rise after the hon. member for Iberville, and when I found, 24 or 48 hours afterwards, that still the Minister of Justice did not rise, I presumed he was not going to rise at all, or, at any rate, not until after he had heard some other speakers on this side. If therefore I shall be obliged to state some conclusions, to advance some opinions, which, after the further light that he may perhaps be able to throw upon this subject, I should have modified, I trust that the House will not suppose, at any rate,\nafter the taunt from the hon. member from Lincoln (Mr. Rykert), and after the course pursued by the Government so far with reference to the debate that I have indecently hurried my presentation of my humble self to this House. I have said that I believe that there are materials very important to a satisfactory discussion of this question, which materials the Government have not thought fit to bring before us. I do not intend to enlarge upon that topic, having had an opportunity of referring to it a day or two ago. I say we ought to have had an opportunity of seeing some of the papers which have been brought down, and which we have not yet seen, because we know that unprinted papers are accessible to but few. For my part, I have not yet had the opportunity of seeing a single paper brought down by the Government so far, with the exception of the instructions to the Crown counsel of which I obtained a copy. There are important papers, so far as I am able to gather from statements made by the Minister when presenting from time to time those which he did bring down, which are not yet brought down, and some, as I shall show before I resume my seat, very important.\n\nI think the\n\nConduct of the Administration on the question of the production of papers\n\nis blameable in the extreme. They use these papers as a fund upon which they can draw, so far as they think them advantageous to themselves in the conduct of the discussion; but such papers as they think do not tell in their favor, they hold back. Take the Minister of Militia. The other evening he thought it would help his argument with reference to the patriotism and disinterestedness of Riel, with reference to the degree of sympathy or the reverse which we ought to extend to him, to read a letter of Bishop Grandin. The Minister takes the letter out of his pocket, and he reads it. He thought it would help him to anticipate the encounter which I am sure we are looking forward to with great interest, of the two military men, the hon. Minister of Militia and the hon. member for Bellechasse (Mr. Amyot); he thought it would do him a little good to bring down some correspondence in advance, and he read extracts of a lot of letters, and a couple of telegrams, which he says, were sent to him by the hon. member for Bellechasse, and he read them at a time when the hon. member for Bellechasse (Mr. Amyot), having already spoken, had no opportunity, according to the rules of the debate, of replying to him, and when they were but very little relevant to the question. Such was the course that the hon. Minister of Militia thought consistent with his duty to the House, with the dignity of his position that he thought consistent with the generosity which ought to prevail between political opponents. The Government select such papers as they think they can make a point on in the debate. These they bring down at the moment they want to use them, but the mass of papers, on the perusal of which, if they had been placed in an accessible form before us, a proper general judgment could be reached, these they refuse to bring down. They say they have no time to bring them down, that they have no time to do anything else but to debate this question from day to day, and have time only to bring down those papers which serve their own arguments. I said the other day, and I repeat, that in my opinion the whole question of the conduct of the Government, before the rebellion, and up to the outbreak, and the whole attitude and relation of the half-breeds and white settlers to the Government with reference to the various questions which have been agitated, are extremely material to the formation of a judgment upon this question. I do not say what the hon. the Minister of the Interior the other day misunderstood me as saying, that I thought we ought to debate them in the same debate on which we debate this question. I did not think so far a reason which is very obvious, for the reason that, even the debating of them, by themselves taking them altogether, involve a question so large in point\nof time, in point of subject, in point of reference to documents, as to transcend the limits, the ordinary and reasonable limits of debate, while the question we have before us is one of quite sufficient magnitude and complication at any rate to involve a debate by itself. So far I quite agree, but what I said the other day, and what I reiterate, is that, notwithstanding that proposition as to the complexity and magnitude of the questions rendering it inconvenient that they should be debated together, it is none the less important to a sound decision upon this question that the other questions should be debated, and we are doing a wrong thing: we are\n\nPutting the cart before the horse, when we discuss first of all the final act in the great drama, instead of dealing in the first instance with those precedent facts and circumstances, threshing them out, sifting them, and endeavoring to reach a conclusion as to the relative responsibilities and attitudes of the Government of the country and of the people who rose. I say that we ought to know that in order that we may properly measure what the moral guilt was of those who rose, we ought to know it in order that we may properly measure what was the right of this Government to act as judge in this cause. And, therefore, Sir, I am of opinion that the course which the Government has decided and insisted upon being pursued in this matter is an inconvenient, an illogical, an unsatisfactory course. I think also that it must be thoroughly understood—and we may as well understand it now—that, if we are to put the cart before the horse, we shall have to deal with the horse a little later. I think it had better be understood that we are not debating in this motion, in the form in which it is insisted that the question shall be put, when we cannot call, if it were convenient to call, for a decision upon it, when we have not those materials to which I referred the other day, the obligation to submit which to us has been admitted by the Government but remains unperformed; that we are not now debating, still less deciding, that\n\ngreat question, a question which is the question, Sir; for what we are debating today, however important it may be with reference to the considerations of sentiment and of feeling which have been raised about it, that question is but an incident of the real question which is to be tried between the two sides of this House.\n\nAnd again, Sir, I am unable to compliment the Government upon the course which they have pursued in determining that, this question being brought forward now, the discussion, in its practical form and sense, should be limited, by their motion of the previous question. I am not hinting that we may not debate the main motion just as freely after the previous question is put as before—of course we may; but all the subjects which are involved in the main motion are questions which are properly to be debated, and some of them should have been brought forward in a manner in which the opinion of the House could be taken upon them in this connection; and the capacity to take the opinion of the House upon them in this connection being taken away from us by the proposal of the previous question, the Government has, as I conceive, exercised a very unwise discretion, and pursued a very needless course as well, in so dealing with the matter. I say a needless course, because I think it is pretty palpable to all of us that no possible amendment that could have been moved would have prevented us in the end from coming back upon the motion of the hon. member for Montmagny (Mr. Landry). I should myself deplore any attempt to evade a decision upon that precise question, but quite consistently with a decision upon that precise question being desirable, is this proposition also good that it is desirable that there should be decisions upon other questions as well. Therefore, Sir, upon these grounds, and notably on the ground to which I have referred a moment ago with reference to the papers, when we happily reach that stage in this debate at which our opinions are to be converted into votes, I shall myself vote against the proposition.\nthat this question be now put, believing it is not fit that, at this time and under these circumstances that the question should be now put. I shall represent, I feel sure, though I do not know, I am quite satisfied I shall represent in that declaration the opinions of a minority—how small or how large a minority is of little consequence—the opinions of a minority, and therefore immediately afterwards we will come to the question itself, and coming to the question itself and recognising therefore the fact that with that question we shall have to deal, I propose to discuss now the method in which we should deal with it, as of course after that first vote there will be no opportunity for further discussion. Now, I could well understand and I believe that I could well justify this proposition—that under the circumstances to which I have briefly alluded, it would be fit further to emphasise one's view of the inexpediency,\n\nThe Impropriety, the Unfairness of the course\n\nwhich the Government is pursuing by abstaining from voting either way upon the main motion. I can thoroughly understand the opinion of many people as being in favour of such a view, thus leaving the question to be debated at its proper time and under its proper circumstances; and I can understand also—as you will readily perceive—the opinion as existing in some minds that in the sum of this whole matter, though they may not be able wholly to agree with the view of the Government, they should yet think that it was not a case in which there were grounds for recording a censure upon the Government in regard to their action. I have already declared, on the occasion to which I have referred, that such conditions have existed in my knowledge, paying as I naturally do, some attention to the operation of criminal justice in the country, and I say that I can very well understand that some persons should reach that conclusion. It is not the view or course which I propose to adopt. I have reached, for my own part, conclusions which seem to me to be so clear, which seem to me to be so well founded, which seem to me to be so important in the general interest of the administration of criminal justice, that I feel it my duty notwithstanding the disadvantages in which we are placed in coming to a conclusion, not to permit those disadvantages to deprive me of an opportunity which, perhaps, might not recur, of recording my vote or expressing my opinion. Now then, as I have said, it will be necessary that we should, before we can finally dispose of this question, though we are called upon to dispose of it now, it will yet be necessary that we should, before we can really and properly dispose of it, to thresh out the subject of the North-West affairs. I do not propose to enter into that discussion now, for the reasons which I have given. It is, perhaps, needless for me to do so, because I have already, at some considerable length, variously stated at from six to seven hours—I hope it was not quite seven, Mr. Speaker; I dare say you know better than any one of us—but I have stated in a speech which was but, after all, a chronological recital of the actions on the one side and of the other, my view upon the evidence which was then presented, of the relations of the Government to the North-West, to the white settlers, and to the half-breeds in the neighborhood of Prince Albert and elsewhere; and I have declared, and I think I have proved, that there were in those matters\n\nGross, Palpable, Incredible Delay, Neglect and Mismanagement.\n\nI was struck the other night when my hon. friend from East Quebec (Mr. Laurier) in the course of another branch of his argument altogether, referred to the execution of Admiral Byng. I thought I recollected something of a historical parallel in another regard between those times and persons and these times and persons; and turning next morning to the book I had in my memory, Walpole's book on George II, I\nfound what happened at that time. At that time, too, Sir, there was a North American question with England; at that time there was a French question in North America; and just at that time the annalist of the reign of George II, records, with reference to the Secretary of the Southern Department, the Minister of the Interior of that day, the Duke of Newcastle, that Duke who, when he was told, as I said a while ago in this House, that Annapolis must be defended, said, \"Oh, yes, of course; Annapolis must be defended; certainly. Where—where is Annapolis?\" Of that same Minister, the annalist records, that what facilitated the enterprises of the French was the extreme ignorance in which the English court had kept themselves of the affairs of America. \"It would not be credited,\" says the annalist, \"what reams of paper, representations, memorials and petitions from that part of the world lay mouldering and unopened in his office.\" And turning a few pages on to the other event which had called my attention to the subject, I find the account of this same Minister with reference to Byng, that when a deputation waited on him shortly before the trial to make representation against the Admiral, he answered: \"Oh, indeed, he shall be tried immediately, he shall be hanged directly.\" So you see, Sir, there are very curious parallels between past and present times.\n\nNow, Sir, I have held, and I hold this Government responsible for every dollar of the public and private treasure which has been expended, for every pang that has been inflicted, for every life that has been lost, whether on the field or on the scaffold in the North-West, and I believe that for this, their responsibility, they will be called to a strict and stern account, here first, and afterwards at the great tribunal, so soon as they, who so boldly challenge us to come on, choose to bring forward those papers which they hold—I do not know whether they be mouldering or unopened—but which, in some way or other, they hold within their vaults.\n\nThe Guilt of the Insurgents.\n\nNow, with reference to the insurgents, of course there was legal guilt—of course, rebellion, the old saying is, is always treason until it becomes revolution. The degree of moral guilt is not a question for the jury at all; it is a question to be considered when you come to award the punishment. It does not affect in the slightest degree either the verdict of the jury or the sentence of the court. Riel was legally guilty, no matter how great, and pressing, and long endured the grievances may have been; no matter how strong the case may have been, Riel was legally guilty: no matter what the moral justification or the moral palliation or excuse may have been, Riel, and those who rose with him, were legally guilty of the crime of treason, if they were mentally responsible. The Crown in the course of this trial, stopped the evidence about the grievances, and they stopped it—I make no complaint of their conduct—they stopped it rightly, because it was no defence at law, because it was utterly impossible, as the Crown counsel observed, that the court which sits under the authority of this Parliament and of this Government, could permit evidence to be taken to show that treason or rebellion against this Government was a justifiable thing. There was then, Sir, upon this trial before the jury, complicity with and a lead in the insurrection being abundantly proved, and in fact practically admitted, the single question whether the prisoner should be found guilty, or whether he should be found not guilty, on the ground of insanity. Now, before dealing with that question, I wish to refer to some only of the incidents connected with the trial, and I regret that the course of this debate has somewhat lessened in one or two respects the favorable impression which I had derived and had pleasure in expressing on a former occasion. I have myself expressed—and I had hoped, and hope now that what I said, though not said here, might have been thought, perhaps, not wholly unworthy of some observations—I have expressed my regret at\nthe Choice of the Judge,\n\nin this case. I have pointed out there were some difficulties in relation to any judge who might be appointed under the existing circumstances; that in the first place these stipendiary magistrates, in the North-West, were, in truth, inferior magistrates. They are not magistrates—I desire to speak of them with all due respect—but confessedly they are not magistrates in any sense of that weight, dignity, authority and standing which belong to those magistrates, who, under the laws of the older Provinces of the Dominion, are entrusted with the trial of capital offences. I have pointed out, besides, that these judges are political officers, as members of the North-West Council, of that very North-West Council which, shortly after these trials, thought it within the sphere of its duty to pronounce an opinion—first of all, upon the conduct of the Government with reference to the transaction of its business, that portion of its business the neglect of which led to the insurrection or gave the opportunity for the insurrection; and secondly, to pass an opinion upon the course which ought to have been, or the course which was pursued by the Government with reference to the execution of this very sentence. I have pointed out also that the standing of those officers in another important respect is inferior to that which ought to be the standing of men entrusted with such issues, in this: That they are not officers holding their office during good behaviour; they are officers holding office practically during pleasure. The security which grows from the entire independence of the judges of the Executive Government, does not subsist in this case, and the fact that it does not subsist has been emphasized by this Government, which in a well-known case has removed one of those stipendiary magistrates from office. So that, not merely in theory, but in practice has the lesson been taught that these judges are under the control of this Government. Those difficulties in my opinion should have been removed by legislation. I do not think that Parliament as a whole, whatever the Administration may have done, really contemplated that trials for high treason or treason felony should take place before those magistrates. I do not suppose that in what we thought was happy, peaceful and contented Canada there was anyone who thought of the possibility of a trial for high treason or treason felony. Speaking for myself I say it never occurred to me that we should have such a trial last year or any year in our country; and I therefore say that I fancy it must have been upon that view very largely that the legislation which was passed by the late Government and which was amended by the present Government in a direction which diminished to some extent the securities for the prisoner was passed. You may say these are but theoretical difficulties after all. I say, no. I say they are serious practical difficulties. They are intensely practical. I have already said elsewhere that the question is not simply of the actual fairness of the trial. It is of the last consequence that the public should retain all the securities which constitutional government and parliamentary government have wrested from the prerogative and that there should be in the minds of the public a certain conviction that those securities exist and are available. This is not a new question with us. Its spirit is exhibited in our Statute Book, in the Act which constitutes the Supreme Court, by which it is expressly provided that the judges of that court shall not be competent to accept any commission or employment, of emolument under the Government of the day. In the Consolidated Statutes of Lower Canada, an express prohibition of a similar character exists, and was brought into play, we recollect, not so many years ago, by our lamented friend Mr. Holton, and that in connection with a North-West matter too, when a learned judge of the Superior Court of the Province of Quebec had been appointed administrator of the Government of the Province of Manitoba. This statute precluded the taking effect of that appoint-\nment. And how did this take place? How was it that the law was engraffed on the Statute Book? Because it had been found of practical consequence to the people of the Province of Quebec that it should be so. There also, as we know, there has been an agitation against grievances of many years' standing, which culminated in the rebellion of 1837; and for a great many years this question was one of the questions agitating the people of that Province. You will find that as early as 1825, the resolutions of the Legislative Assembly of Lower Canada, declared as follows:\n\n\"That for the more upright and impartial administration of justice it is expedient to render the judges of His Majesty's Court of King's Bench and Provincial Courts more independent than hitherto by incapacitating the said judges from seats in the Executive and Legislative Councils, and disqualifying such as have now seats therein from sitting or voting in such Councils.\n\n\"That it is expedient to secure by law to the said judges their respective offices during good behaviour in the same manner as those officers are secured in England.\n\n\"That it will be expedient for the aforesaid to secure adequate permanent salaries to the said judges on their being prevented from holding any other office of profit or emolument under the Crown.\"\n\nIt is not, Sir, in the heyday of liberty that we are to forget the securities for freedom. The price—according to a hackneyed but ever-to-be-remembered maxim—the price of liberty is eternal vigilance; and in this regard, as I have said, an error has been committed. Now, what is the measure and extent to which this Administration is chargeable in this respect? Certainly not in the existing state of the law with reference to a trial before one of the stipendiary magistrates. All that can be complained of fairly against them is, that their attention being called to the special circumstances of the case, to the unprecedented and unanticipated circumstances, during the late Session of Parliament, by the hon. member for Beauharnois (Mr. Bergeron), and the suggestion being made that legislation should take place, they declined to accede to the suggestion, and insisted that the trials should go on under the existing laws. Sir, I have said that trials of this description differ altogether from all other classes of trial in respect to the importance of the independence of the judiciary.\n\nRelation of the Government to trials for treason:\n\nThey differ wholly, because in trials of this description there is hardly a conceivable case in modern times, at any rate, in which the Government does not occupy a wholly different relation to the prosecution from that which it occupies in all ordinary cases in the administration of criminal justice. There can be no question, for example, of the Government being otherwise than an impartial and equal administrator of the law if John Jones or Tom Smith is taken up and accused of having picked somebody's pocket, or robbed somebody's barn, or maimed somebody, or killed somebody. But cases of this description wholly differ. In this case the Government may be, generally is, in this particular case unquestionably was—a prosecutor in altogether a different sense and with altogether different relations to the prisoners than in those other cases. I point out—for I desire through this discussion to sustain myself by authority—what authority says upon this topic. I refer to the well-known book of Lieber on Civil Liberty, when he uses these words:\n\n\"In the trial of treason the Government is no longer theoretically the prosecuting party, as it may be said it is in the case of theft or assault, but the Government is the really offended, irritated party; endowed at the same time with all the force of the Government to annoy, prosecute and often to crush. Governments have therefore been most tenacious in retaining whatever power they could in the trial for treason; and on the other hand, it is most important for the free citizen that in the trial for treason he should not only enjoy the common protection of a sound penal trial: but far greater protection. * * * * * The trial for treason is a gauge of liberty. Tell us how they try people for treason and we will tell you whether they are free.\n\n\"It redounds to the glory of England.\"\nthat attention was directed to this subject from early times, and that guarantees were granted to the prisoners indicted for treason centuries before they were allowed to the person suspected of a common offence.\n\nExperience proves that not only are all the guarantees of a fair penal trial peculiarly necessary for a fair trial in treason, but that it requires additional safeguards; and of one or the other the following seem to me the most important.\n\n\"The judges must not depend on the Executive.\"\n\n\"The judges must not be political bodies.\"\n\nMany safeguards are specified, of which I select the two that are opposite to the present case: \"The judges must not depend on the Executive; the judges must not be political bodies.\" Now, Sir being in the difficulty that in these particular trials the Government, under the standing laws which they did not choose to propose to alter, had to select a judge who was dependent on the Executive—a judge who was one of a political body, it was\n\nEminently incumbent on them to have made the best selection.\n\nthe one which was least objectionable, the one in respect of which it might be said, though there is a difficulty as to all to which I have adverted, this one is certainly the least, or at any rate not the most obnoxious. But what I have objected to on a former occasion, an objection which I renew to-night, is the choice of the particular judge, because this particular judge, as you will see if you refer to the Public Accounts, was the recipient of special favors, the occupant of special relations to the Executive of the day. In the first place, he is the legal adviser to the Executive of the North-West; he is so appointed during the pleasure of the Government; he is so paid a salary during the pleasure of the Government. He answers to the Attorney-General, the legal adviser of the Government in the North-West Territories; and it needs not to enlarge upon the relations and responsibilities of a Lieutenant-Governor of the North-West Territories to a rebellion in the North-West, and upon the relations and responsibilities of the First Minister of Canada, who declared that he was the medium of communication between the two Governments and of the Minister of the Interior towards the Lieutenant-Governor of the North-West Territories to show that it was an unhappy choice to select out of the three or four judges, the very person who filled the position of the political adviser, the political law officer, to the Government in the Territories to be the judge in this particular trial. He is also the recipient of special favors. I find, in the Auditor-General's Report, just brought down, a statement of his accounts. I find that, irrespective of his salary of $3,000 a year, there has been paid to him, during the year to which these accounts refer, a special rental allowance of $500, an additional salary as legal adviser to the Lieutenant-Governor of $200, three votes of $200 each as a nominative member of the North-West Council, his travelling allowance of $1,000, and something between $400 and $500 for expenses and allowances for attendance at Ottawa in connection, it is said, with the Torrens' Act; making a total of over $2,700 paid during the last year to this judge, in addition to his salary of $3,000. Now, as to travelling allowances, and allowances as nominative members of the North-West Council, the other judges were in the same position; but the allowances for house rent and as legal adviser and in connection with the Torrens' Act are peculiar to the particular officer whom the Government, I think, extremely unfortunately, decided they would entrust with the duty of conducting these trials. Well, the judge chooses.\n\nThe Jury Panel,\n\nand we have heard from the hon. member for Bellechasse (Mr. Amyot) a statement, which I think is of considerable importance, and with reference to which I should have desired to hear something from the Government before now—a statement to the effect that there were persons of the faith and nationality of the prisoner eligible as jurymen, but that none or only one such was chosen of the panel. I heard the hon. member for-\nMontreal Centre (Mr. Curran) say that no objection of that description could apply; in consequence of the relations of the prisoner at the time of his trial to the church of his fathers and the church to which he himself belongs; but I do not think that argument holds; and, for my part I must express my regret that, if the circumstances be as up to this moment they appear to be from the uncontradicted statement of the hon. member for Bellechasse (Mr. Amyot), a wider selection should not have been made of the panel; and I share the regret expressed by several hon. members that the single person who happened to be on the jury, of that faith, should have been peremptorily challenged. For that challenge there may have been, for all I know, a good reason; but we are not told, and we must not presume it was a challenge for cause. We all know the shock to the administration of justice which ensued when those of his faith were challenged on the occasion of the O'Connell trial. That ought to have been a lesson on this occasion, and the same difficulty ought not to have recurred in our day. Again, with reference to\n\nThe character of the prosecution.\n\nThe written instructions which were given to the Crown lawyers were to try all the leaders, with the exception of certain Indians and others who might be chargeable with murder—to try all the leaders for treason. No distinction whatever was made in those instructions between Louis Riel and the other leaders. Now, how did it happen under these circumstances, that all the prisoners, except Louis Riel, were indicted—for the same offence, is true, but under the more modern statute and procedure, for treason-felony, while Riel alone was tried for high treason under the ancient law. Were there special instructions given which have not been brought down to us, or special verbal instructions or communications differing from the general instructions which have been brought down to us, as the only instructions given to the officers? If there were none such, I consider it to have been a violation of those instructions to try for treason-felony the mass of the leaders, and for high treason, one. They were all ordered to be tried for treason, and they all ought to have been tried under the same statute, unless special instructions were given to the contrary. It was, of course, with the cognisance of the Government that this difference was made, because it was everybody's news—it was reported in the papers; and, therefore, I assume that the Government either instructed, in the first instance, or else acquiesced in the course pursued; and I am entitled to assume that because I observe still further that the Deputy Minister of Justice was one of the officers associated with the others in the conduct of the trial.\n\nAs to the time,\n\nI agree with the observations that have been made, that it seems to have been short; but I am not prepared, in the present state of the evidence, to maintain that it was too short, simply because I have been unable to observe any protest on the part of the prisoner's counsel that it was too short, excepting in so far as such protest may be implied from their having asked for a longer time than the Crown counsel granted. Upon that subject, I think we might have some further information.\n\nI was glad to be able to make an observation, which has been referred to before in this debate, as to the assistance given by the Crown in procuring\n\nThe Prisoner's Witnesses.\n\nThat observation can no longer be repeated in its full force, because I have learned, since this debate commenced, the course which was pursued with reference to the request for witnesses. In my view, it was of the highest consequence, and in saying that I do not overlook the letter which the hon. member for Montreal Centre (Mr. Curran) read, that Dr. Howard should have been called. I do not, after the statement of that hon.\nmember, charge his not being procured upon the counsel for the Crown, because the hon. gentleman read a letter addressed to Dr. Howard from the Department of Justice here, from which it appeared that negotiations had been going on between the Department of Justice and Dr. Howard as to the terms upon which that gentleman would visit Regina; that he had named, under the special circumstances which the hon. gentleman mentioned, the sum of $500; and that it was upon the question of that charge that the Department of Justice declined to arrange for Dr. Howard going up to Regina. Now, Sir, I regret that decision. I think it extremely unfortunate that Dr. Howard—who, besides being a well-known alienist, also had charge of Riel for, as well as I could gather, a period of nine months in the asylum over which he presided—was not a witness at the trial, and that we have not now the benefit of his evidence. I do not think any such question as the difference between what might have been supposed to be his reasonable charge and the sum of $500 ought to have weighed for an instant in considering the question whether he should have been available or not. Then, Sir, I think it is unfortunate that we do not know more with reference to the\n\nComplicity and responsibility of the Whites in the rebellion. We remember the speech of the First Minister, last Session, in which he declared that it was not to the Indians or to the half-breeds, but to the whites of Prince Albert, that we owed the shame, the disgrace and the discredit of the rebellion. We find the law officer of the Government pointing out the same proposition, not as positively, but still with a tolerable degree of certainty, to the counsel he was sending there, and instructing them that no point was more important than that they should secure evidence and convict those who were guilty in this regard. We hear from the Minister of Justice that reports have been received from the law officers of the Crown on all these points; we know the beggarly kind of attempt made to mete out justice to these guiltier whites. We know that two only were committed for trial, for the Minister of Justice has told us so; we know that one was Jackson, of whom the Secretary of State, with that liveliness of imagination which characterizes his oratory, told his constituents at Terrebonne that he was a Frenchman in all but the name, that he was Francisé, that he was just as much a Frenchman as Regnier, and there was no question of nationality about it.\n\nMr. CHAPLEAU. I did not.\n\nMr. BLAKE. Oh! well, we will verify as we go. Here is a report in La Minerve of the hon. gentleman's speech:\n\nUne VOIX. Vous avez bien gracié l'Anglais Jackson, pourquoi ne pas avoir gracié Riel? Jackson, messieurs, ce qu'on a dit et écrit au sujet du pardon de Jackson, était, laissez-moi employer ce mot, une grosse bêtise. D'abord, Jackson n'est pas plus Anglais que vous et moi. Il n'avait d'Anglais que le nom, et il était aussi Français par le sang et le langage que Riel lui-même. Il rassemblait en cela à beaucoup de nos compatriotes d'origine anglaise ou écossaise, mais qui sont complètement francisées. Jackson était l'un des secrétaires de Riel; il a eu le sort de Régnier, son compagnon, un Canadien de nom et d'origine.\n\nAnd then the hon. gentlemen proceeds to say;\n\n\"Ils ont été graciés tous deux comme complices au second degré, de sorte que la question de race n'a eu rien à faire dans leur cas.\"\n\nThat was the hon. gentleman's statement by the revised report of the hon. gentleman's speech in the Minerve.\n\nMr. CHAPLEAU. It was not my statement. The hon. gentleman who corrects the Hansard here should allow other people to correct reports in other papers.\n\nMr. BLAKE. I do allow it to be corrected. So this is the account of the trial of Jackson, who, I admit, was an Englishman, contrary to the incorrect report of the gentleman's speech, which some wicked adversary, with intent to get him into a corner and injure him.\npolitically, has foisted into that well known hostile paper to him, the Minerve. I leave the responsibility to him and the hon. member for Ottawa (Mr. Tasé) of settling with the reporter, and I hope the hon. gentleman will not blame me if I have chosen the report from that paper which has given ostensibly, in the first person, a verbatim report of his speech.\n\nMr. CHAPLEAU. I blame the hon. gentleman for not accepting the statement of one of his colleagues in the House.\n\nMr. BLAKE. I said I hoped he would not blame me for having taken the report. With reference to Jackson, we know well the circumstances in his case. We know that he had joined Riel at an early period, and that he is said to have become a lunatic and was acquitted on the ground of insanity. The other person was one Scott, of whom we have not equal particulars, but of whom the Minister of Justice reports to us the result of the trial, saying he was found \"not guilty\"; and I think having read that in the instructions to the law officers and hearing the Government declare that the persons principally guilty were the whites of Prince Albert, it would be important to us in measuring out the degree of lenity or severity that was due to Riel, to have heard something more of the result of this search by the Government against their white enemies.\n\nStatement of the real issue before Regina Jury.\n\nI pass, although there are other points to which I might refer, to the issue which I have said was for the jury to decide on that occasion, and that issue was, not whether Riel was insane in the sense in which, in common parlance, we use that word, but whether he was insane in the sense in which the word is so used that it may create irresponsibility for crimes. By our law, whether that law be right or wrong, he might be insane in the sense in which we ordinarily use the word, and yet criminally responsible; and the question for the jury was, in fact, whether he was so insane as, within the meaning of the law, to be irresponsible for his acts. This is a difficult question, as are all questions of insanity, and it may be divided into two headings: First, what was the effect if his conduct were genuine? And next, was it genuine or feigned? Now, I want to fasten if I can, upon your mind, the question for the jury. I want you to remember that the question, for the jury was whether he was insane within the meaning which the law attaches to that term, so as to induce the consequence of irresponsibility for crime, because it must be always remembered, as the vital question, as the vital point, that without disturbing in the slightest degree the finding of the jury, there may remain, and generally will remain, under circumstances like these, important considerations as affecting the moral guilt, and therefore, as affecting the degree of punishment to be awarded to the prisoner. The verdict then of guilty would be right, first of all, no matter how great were the faults of the Government, no matter how clearly political was the offence, no matter how great the grievances, no matter how long-enduring and long-suffering the people might have been, the verdict of guilty would be right, no matter how these things might have been, and also the verdict of guilty would be right, no matter how clearly Riel's intellect were disordered, if it were not disordered up to a certain point; and these two things, the question of the political character of the offence and the resultant considerations, and the question of the disorder of intellect, would fail to be considered, consistently with not disturbing in the least the verdict of guilty by the jury, in the award of punishment. Now I shall make good after a little while by authorities those two propositions; but before touching the facts as to the mental condition of this individual, it may be as well to look for a moment at\n\nThe general knowledge on the subject and the principles of enquiry.\n\nThere is an old controversy between the lawyers and the doctors upon this head, the doctors widening the degree of\nirresponsibility due to disordered intellect, and the lawyers narrowing it. Both extremes were, I humbly venture to think, perhaps wrong, and I believe that these extremes are somewhat meeting now. I believe that many eminent men in the medical profession in these modern days have come round to the view that there may consist with a decidedly disordered intellect a measurable responsibility for crime, and that on the other hand the lawyers have come round largely to the view that the old and, what I may call in the main, the barbarous dispositions of the law, ought no longer to be considered as governing the case of insanity. But we have not to do, in the disposing of this matter, with the law as we would like it to be, or as we think it ought to be, or as we may hope it is going to be.—It would be unjust entirely to try the Administration, or the judge, or to consider of the case on any such footing. We have to ascertain, if we can, what the law is, as applicable to the case and then see how the facts fit into it. Upon this question of insanity, so much has been said abroad and within this House utterly inconsistent, as I understand them, with the settled facts, that I desire, besides alluding to authorities which were quoted on the trial, and to the authorities which my hon. friend who spoke on that subject quoted, to refer to a very few passages from books. I have heard two hon. gentlemen speak of homicidal mania, as if we had anything very specially to do with that here, and point to the fact that the homicidal maniac acts without accomplices, and that because Riel had accomplices, therefore he could not be a homicidal maniac. I have heard an hon. gentleman this afternoon illustrating this subject by reference to the description of idiocy, by reference to the description of imbecility, by reference to the description of dementia. Now, however much those descriptions may apply to many very respectable persons who entertain, and even to some who express, opinions on this subject, they certainly have nothing to do with the peculiar kind of insanity with which we are dealing. Now, Sir, the eminent French writer Georget, who is quoted by Browne in his work, says:\n\n\"In conversing with patients on subjects foreign to their morbid delusions, you will generally find no difference between them and other people. They not only deal in commonplace notions, but are capable of appreciating new facts and trains of reasoning. Still more they retain their sense of good and evil, right and wrong, and of social usages to such a degree that whenever they forget their moral sufferings and delusions, they conduct themselves in their meetings as they otherwise would have done, enquiring, with interest, for one another's health, and maintaining the ordinary observances of society.\"\n\n* * * * *\n\n\"Those who conduct themselves so well in the asylum, in the midst of strangers with whom they have no relations, and against whom they have conceived no prejudice or cause of complaint, and in quiet submission to the rules of the house, are no sooner at liberty in the bosom of their families, than their conduct becomes unsupportable; they are irritated by the slightest contradiction, abusing and threatening those who address the slightest observation to them, and working themselves up to the most intolerable excesses.\"\n\nClouston, who had charge of the Morning-side Asylum, a very well known institution at Edinburgh, in his lectures on the matter, says:\n\n\"But to return to D. M., who may be taken as a typical case of monomania of grandeur, his mind is not only affected with the delusion that he is king, but it is affected by an unreal tendency to elevation in all directions, and it is now somewhat enfeebled, as is commonly the case, after many years in such cases. He often writes me long rambling letters proposing various impractical modes of managing the asylum, and he is the greatest fault finder in it. Then affectively, he is different from a sane man, showing small love for his wife and children, and he takes morbid dislikes to people without real cause. * * * He is of course very inconsistent to work as a blacksmith, he being a king; but the conduct of by far the majority of the insane is quite inconsistent with their beliefs; and then, if he did not work he would get no tobacco, or beer to lunch, arguments that even royalty can appreciate.\"\n\nAgain he says:\n\n\"I have a 'prophet of the Lord,' D. O. B,\"\na joiner who by no means at our disposal can be got to work at his trade. He says that the Lord has sent him a new work and he must follow it. He sees visions from God all the time, which he puts down on paper, &c., &c.\n\n\"I have another man, D. O. C., with almost precisely the same delusion, viz., that he is a 'man of God,' who is a capital worker in the garden, and enjoys a dance or concert immensely.\"\n\nThen, referring to a number of the others of the inmates of the asylum, he says;\n\n\"Here is Jesus Christ, and here are the prophet Elias, the Emperor of the Universe, the Universal Empress, Empress of Turkey, the only daughter of God Almighty, Queen Elizabeth, four kings of England, one King of Scotland, the Duke of Kilmarnock, the inventor of perpetual motion, a man who has discovered the new elixir of life that can cure delusions, 12 persons to whom this establishment and all that it contains belongs, a lady who daily and nightly has delightful conversations with the Prince of Wales and the rest of the royal family, &c., &c. Those are all calm and harmless people, bearing themselves in their deportment and manner as becomes such distinguished persons, though a few do not exhibit any outward or muscular indications of their greatness, all are some way inconsistent and absolutely unmoved by the most conclusive argument or evidence that their ideas are wrong or unfounded.\"\n\nIn the report of the Commission on Capital Punishment, which sat in 1865, the very eminent physician, Dr. Tuke, being examined, gave the following answers to questions:\n\n\"Q.—I believe that the knowledge of right and wrong is by no means uncommon among persons who are decidedly insane? A.—It is the normal state for them to have such knowledge.\n\n\"Q.—I suppose that in lunatic asylums you find a consciousness between right and wrong; that is to say, obedience to the rules which you lay down? A.—Except in cases of absolute idiocy or dementia, the knowledge of right and wrong is intact.\"\n\nThen with reference to the border line, Clouston says on the subject of delusional insanity:\n\n\"There are plenty of persons doing their work in the world well and getting through their labor under monomania of pride or suspicion in a mild form. The now famous case of Mr. Wyld who held an important government office and did his work well all his life, and yet had labored under the delusion of grandeur, that he was the son of George IV, and left all his money to the town of Brighton, because that monarch had been fond of that place, is one in point. He was held to be sane in everything he did but his will making. I am constantly consulted by their friends about the insane delusions of persons who do not show them to anybody but their near relations, and continue to do their work and occupy responsible positions. I now know in, Scottish lawyers, doctors, clergymen, business men and workmen who labor under undoubted delusional insanity, and yet do their work as well as if they had been quite sane.\"\n\nThe latest work I have been able to see on this subject is that of Dr. Ireland, published last year, called \"The Blot upon the Brain;\" and he says this:\n\n\"Thus between the soundest intelligence and the most disordered there are differences our vague adjectives will not define. People mad enough to be shut up in asylums are not so rare—say one in every 500 in highly civilized countries. Then again, people with a less dangerous or intractable degree of insanity are very common. Every man skilled in the symptoms of lunacy knows this. * * * In the world's history, men somewhat deranged in mind have had a great influence; but to effect this their delusions must harmonize with the delusions of the multitude. * * * * *\n\n\"The history of religious imposture shows how powerful may be the Influence of the insane upon the sane.\n\nIf disposed to enlarge upon such a subject, we might show the characteristics of some of the founders of the wild sects which sprang into being during the period of the Reformation, from John of Leyden to Venner. Towards the end of the last century, Mr. Richard Brothers, of whose insanity there can be no question, infected some educated people, and many of the vulgar, with his claims to be an inspired prophet. Mr. Halhead, a well-known Orientalist, and member of Parliament, was one of his followers. There are people still living who knew Joanna Southcote, who was when 60 years of age, to give birth to the Messiah, and who was said to have had 100,000 followers. In 1838 John Nicholl Thom collected a number of followers among the ignorant rustics of Kent, and killed a constable who came to\napprehend him: After this he persuaded his dupes to face the military, under the assurance that he would make them invulnerable. Thom killed with a pistol the officer of a detachment which came to arrest him, and was instantly shot dead, with nine of his credulous followers, by the soldiers. It was even believed that he would rise again within a month.\"\n\nI read this—partly to meet what I conceive to be the erroneous argument stated in the report of Sir Alexander Campbell, in which he argues the impossibility of Riel having been seriously affected in his mind, because he could not have done what he did do, and had the followers he had, and pursued the career in that respect that he did, unless he were sane. Then, Sir, we come to\n\nThe question of the legal view of insanity and of responsibility as affected thereby,\n\nand here again I trouble the House with what I conceive to be the best records of the expounded law upon the subject.\n\nAmos, in his work, says:\n\n\"Insanity, in the largest sense of the term as used for legal purposes, is a temporary or permanent disorder of the relations between the mental and physical functions of man, of such a nature as to destroy the value of the current presumptions, founded on those relations, as existing in a condition of health.\"\n\nThe other quotations which I make are from Sir James Fitzjames Stephen, the well known criminal lawyer, who has devoted, I suppose, more attention to the principle and theory, and the practical operation of the criminal law, than any, or, at any rate, most other modern criminal lawyers, who has been practically engaged in the attempt at codification, and whose knowledge and position have been recognized by his appointment to the judiciary, subsequently to which he became a member of the latest commission upon this subject. Now, in his very recent work upon the history of criminal law, he gives an exposition of this subject which he derives principally from the writer Griesinger, of whom he says that, after having read all that was to be found upon it, he thinks that this concurs with, if not all, the overwhelming bulk of medical authority of which it may be fairly taken as a summing up:\n\n\"Insanity exists when the brain and the nervous system are in such a condition that the mental functions of feeling and knowing, emotion and willing can be performed in their regular and usual manner.\n\n\"Insanity means a state in which one or more of the above mentioned mental functions is performed in an abnormal manner, or not performed at all by reason of some disease of the brain or nervous system.\n\n\"There are two grand groups or fundamental states of mental anomalies which represent the two most essential varieties of insanity. In the one the insanity consists in the morbid production governing and persistence of emotions and emotional states, under the influence of which the whole mental life suffers according to their nature and form.\n\n\"In the other the insanity consists in disorders of the intellect and will which do not (any longer) proceed from a ruffling emotional state, but exhibit without profound emotional excitement, an independent, tranquil, false mode of thought and of will (usually with the predominant character of mental weakness). Observation shows further, that, in the great majority of cases, those conditions which form the first leading group precede those of the second group; that the latter appear generally as consequences and terminations of the first, when the cerebral affection has not been cured. **\n\n\"Then the emotions are divided into two classes: those which tend to depression, resulting in melancholia; and those which tend to excitement, resulting in mania, the condition in which the disease of the brain constitutes an excited vehement state of the emotions tending to morbid energy and restlessness.\n\n\"Melancholia often passes into mania. The approach of mania displays itself by great restlessness and loquacity, accompanied with morbid activity of thought. ***\n\n\"*** The effect of mania upon the intellect is to increase the rapidity and quantity of thought. In its most moderate degrees this relation appears as an exaggeration of the normal faculty of thought. ***\n\n\"The principal effect of mania upon the intelligence is incoherence arising from precipitation of thought. The patient may call himself Napoleon, the Messiah, God, in short, any great person. He may believe that he is intimately acquainted with all the sciences, or offer to those around him all the treasures of the world. ***\n\"Mania may be incompletely developed, in which case the patient shows a natural activity and restlessness, adopts strange, eccentric projects, and is apt to be exceedingly vain, cunning and intriguing, but does not manifest either definite marks of disease of the brain or positive disturbance of the intellect. This state may be the first step towards mania proper, or it may continue for a length of time.\n\nThe earlier forms of madness, melancholia and mania, sometimes pass into a condition of feeling in which, however, particular delusions which, in the earlier stage of the disease, may have occurred to the patient in an unstable, transient way, become fixed in his mind and regulate his conduct.\n\n\"The condition in which a person is a victim for a time or permanently of fixed delusions is called monomania. The word has been objected to on the ground that it suggests that the disease is much more limited than it really is, involving nothing more than isolated mistaken beliefs not capable of being dispelled by reason. It appears that this view of the disease is incorrect. SUCH FIXED DELUSIONS PROCEED FROM A PROFOUND DISTURBANCE OF ALL THE MENTAL POWERS AND PROCESSES. IT MAY SEEM AS IF THERE WERE MERELY A PARTIAL DESTRUCTION OF THE INTELLIGENCE, WHILE, IN REALITY, THE ESSENTIAL ELEMENTS OF THOUGHT, NORMAL SELF-CONSCIOUSNESS, AND A CORRECT APPRECIATION OF THE SPECIAL INDIVIDUALITY AND ITS RELATION TO THE WORLD ARE UTTERLY PERVERTED AND DESTROYED.\n\n* * *\n\n\"The more limited the circle of these delirious conceptions, the more do they appear on superficial considerations to be simple and even inconsiderable errors of judgment. But how much do such errors, even in the most favorable cases, differ from those mistakes which in the same proceed from deficient knowledge? A long series of psychical disorders must precede them; they are inwardly developed from states of emotion. The whole personality of the patient is identified with them; he cannot cast them from him by an act of will, nor rid himself of them by argument, and in order to the existence of the delirium in this mild form, not only must that long series of emotional states from which it grew have run their course, but there must also remain behind a deficiency of thought to ensure its existence.\"\n\n\"This account of the disease of madness may be summed up in the following short description:—Any one or more of numerous causes may produce diseases of the brain or nervous system, which interferes more or less with the feeling, the will and the intellect of the person affected. Commonly the disease, if it runs its full course, affects the emotions first, and afterwards the intellect and the will. It may affect the emotions, either by producing morbid depression or by producing morbid excitement of feeling. In the first, which is much the commoner of the two cases, it is called melancholia, in the second mania. Melancholia often passes into mania. Both melancholia and mania commonly cause delusions and false opinions as to existing facts which suggest themselves to the mind of the sufferer, as explanations of his morbid feelings. These delusions are often accompanied by hallucinations which are deceptions of the senses. Melancholia, mania and the delusions arising from them, often supply powerful motives to do destructive and mischievous acts.\" * * *\n\n\"Insanity affecting the emotions in the form of melancholia and mania is often succeeded by insanity affecting the intellect and the will. In this stage of the disease the characteristic symptom is the existing permanent incurable delusions commonly called monomania. The existence of any such delusions indicates disorganisation of all the mental powers, including not only the power of thinking correctly, but the power of keeping before the mind, and applying to particular cases, general principles of conduct.\" * * *\n\n\"The result of all this is that insanity produces upon the mind the following effects which must be considered in reference to the responsibility of persons shown to have done acts which would but for such effects, amount to crime. Insanity powerfully affects, or may affect the knowledge by which our actions are guided, the feelings by which our actions are prompted, the will by which our actions are performed, whether the word \"will\" is taken to mean volition or a settled judgment, the reason acting as a standing control on such actions as relate to it. The means by which these effects are produced are unnatural feelings, delusions or false opinions as to facts, hallucinations or deceptions of the senses; impulses to particular acts or classes of acts, and in some cases (it is said) a specific physical inability to recognise the difference between moral good and evil as a motive for doing good and avoiding evil.\"\n\nThat being the statement by, I suppose, the most eminent and recent authority upon the legal view of what insanity is, so far as it is material to the question now in hand, namely responsibility for criminal acts, I turn to\nThe question of responsibility according to the law.\n\nAmos says:\n\n\"This topic which in many criminal cases excites an interest oftentimes of the most strained and afflicting sort is one surrounded with peculiar difficulties of its own, due to the complexity and variety of the facts which it brings into consideration. These facts are partly physical or belonging to that indistinctly marked region which lies between physical and psychological science; partly ethical or dependent on a given person's apprehensions of right or wrong under abnormal or exceptional conditions, partly legal or political or dependent upon the amount of legal responsibility attributable to various degrees of mental health, in view of the protection claimed by individual persons, and of a due regard to the general safety of the whole community. It is probably rather in the first of these regions, that is the physical or psychological one, that the main practical difficulty is experienced. It is generally admitted in all systems of law that sufficient and satisfactory grounds for exculpation are found in an actual mental incapacity, whether fixed or transient, of knowing at the moment of doing an act that it is forbidden by law, or at any rate that it is morally reprehensible according to some moral notions in the agent's own mind—or in a physical incapacity to abstain from doing the act. The difficulty is presented at the moment at which it is attempted to establish the fact of either of these sorts of incapacity, and it is greatly exaggerated in cases where a legal system instead of exculpating all insane persons as a class affects to attach different degrees of punishment to different measures of presumed moral responsibility.\n\nThe records of criminal trials are full of an almost endless diversity of conditions of medical and moral theories to account for them.\"\n\nThen Stephen's notion of the law, as it probably is, is extracted from the Digest:\n\n\"No act is a crime if the person who does it is at the time when it is prevented (either by defective mental power—or) by any disease affecting his mind:\n\n\"(a) From knowing the nature or quality of his act, or\n\n\"(b) From knowing that the act is wrong, or\n\n\"(c) From controlling his own conduct, unless the absence of the power of control has been produced by his own default. But an act may be a crime although the mind of the person who does it is affected by disease, if such disease does not, in fact, produce upon his mind one or other of the effects above mentioned in reference to that act.\"\n\nThen in answer to the question:\n\n\"What is the meaning of a maniac laboring under such a defect of reason that he does not know that he is doing what is wrong?\"\n\n\"It may be said that this description would apply only to a person in whom madness took the form of ignorance of the opinion of mankind in general as to the wickedness of particular crimes—murder, for instance—and such a state of mind would, I suppose, be so rare as to be practically unknown. This seems to me a narrow view of the subject, not supported by the language of the judges.\n\n\"I think that any one would fall within the description in question who was deprived by disease affecting the mind of the power of passing a rational judgment on the moral character of the act which he meant to do.\n\n\"Suppose for instance, that by reason of disease of the brain, a man's mind is filled with delusions, which if true, would not justify his proposed act, but which in themselves are so wild and astonishing as to make it impossible for him to reason about them calmly or to reason on matters connected with them, &c., &c.\n\nHe quotes Bucknill and Tuke as follows:\n\n\"It is of the highest importance to distinguish between that part of wrong conduct which patients are able and that which they are unable to control.\n\n\"Clinical experience alone gives the power of distinguishing between the controllable wrong conduct which is amenable to moral influences, and that violence utterly beyond the command of the will which yields only to physiological remedies.\"\n\nThen Sir James Stephen shows very clearly that the language of the judges is doubtful and capable of different interpretations. He adds this:\n\n\"I understand by the power of self control the power of attending to general principles of conduct and distant motives and comparing them calmly and steadily with immediate motives and with the special pleasure or other advantage of particular proposed actions.\n\n\"Will consists in an exertion of this power of attention and comparison up to the mo-\nment when the conflict of motives issues in a volition or act.\n\n\"Diseases of the brain and the nervous system may in any one of many ways interfere more or less with will so understood. They may cause definite intellectual error, and if they do so their legal effect is that of other innocent mistakes of fact.\n\n\"Far more frequently they affect the will by either destroying altogether, or weakening to a greater or less extent, the power of steady, calm attention to any train of thought and especially to general principles and their relation to particular acts. They may weaken all the mental faculties so as to reduce life to a dream. They may act like a convulsion fit. They may operate as irresistible motives to an act known to be wrong. In other words they may destroy, they may weaken or they may leave unaffected the power of self control.\"\n\n\"The practical inference from this seems to me that the law ought to recognize these various effects of madness. It ought, where madness is proved, to allow the jury to return any one of these verdicts:\n\n\"(1) Guilty;\n\"(2) Guilty; but his power of control was weakened by insanity;\n\"(3) Not guilty on the ground of insanity.\"\n\nI once again call the attention of the House to the suggestion as to what the law ought to be, and I call attention to it because I shall point out before I have done that this practical result of dealing with the second class of cases, namely, guilty, but his power of control was weakened by insanity, is achieved by other means today, namely,\n\nBy the Action of the Executive.\n\nAgain Stephen says:\n\n\"As to the verdict of not guilty on the ground of insanity, the foregoing observations show in what cases, in my opinion, it ought to be returned, that is to say in those cases in which it is proved that the power of self-control in respect of the particular act is so much weakened that it may be regarded as practically destroyed, either by general weakening of the mental powers, or by morbid excitement, or by delusions which throw the whole mind into disorder or which are evidence that it had been thrown into disorder by diseases of which they are symptoms, or by impulses which are irresistible and not merely resisted.\"\n\n\"The position for which lawyers have always contended as to insanity is that parts of the conduct of mad people may not be affected by their madness, and that if such parts of their conduct are criminal they ought to be punished for it. It may, however, be asked how ought they to be punished? Ought they to be punished in all respects like sane people. To this I should certainly answer, yes, as far as severity goes; no, as far as the manner of punishment goes. The man who, though mad, was found guilty without any qualification of murder I would hang, but if the jury qualified their verdict in the manner suggested in respect of any offender I think he should be sentenced, if the case were murder, to penal servitude for life, or not less than, say 14 years, and in cases not capital to any punishment which might be inflicted on sane man.\n\n\"The question what are the mental elements of responsibility, is, and must be, a legal question.\n\n\"I believe that by the existing law of England, those elements, so far as madness is concerned, are knowledge that an act is wrong and power to abstain from doing it, and I think it is the province of judges to declare and explain this to the jury.\n\n\"I think it is the province of medical men to state, for the information of the court, such facts as experience has taught them, bearing upon the question whether any given form of madness affects, and in what manner, and to what extent it affects either of these elements of responsibility; and I see no reason why, under the law as it stands, this division of labor should not be fully carried out.\"\n\nIn the Criminal law commission to which I have already referred, Baron Bramwell sends a letter to the commissioners stating the results of his murder trials, from which I extract this:\n\n\"Six persons in six cases were acquitted on the ground of insanity, and rightly. I do not mean that the prisoners were as insane as the law requires, but the cases were those of real madness.\"\n\nThe Facts which show Riel to have been Insane.\n\nNow, Sir, having thus attempted to state, not in my own words, but in words which I think will be taken as those of the greatest authority, what are the doctrines of the law upon this subject, I propose to address myself for a brief space to what was the evidence in this particular case\nadduced at the trial as distinguished from other circumstances which might have been adduced. And first of all, the most important point in the case is this: THE MAN HAD BEEN INSANE. Unquestionably he had been insane, I say that is a most important point, and therefore it is first to be taken up. Dr. Roy, the medical superintendent of the Beauport lunatic asylum, was examined, and the substance of his testimony was:\n\nThe prisoner was put in the asylum by the Quebec Government in June, 1876, and discharged January, 1878.\n\nDr. Roy, in discharge of his duty, studied his case and attended him. He was unquestionably insane at that time. The type was magalomania. The symptoms or prominent features are connected with religion, or power, pride and egotism. The patient cannot bear contradiction, and becomes irritated. There are delusions.\n\nOn ordinary subjects, and where not affected by the delusions, the patient seems to reason well, and may be clever. Riel had these symptoms, and was at that time of unsound mind, and incapable of controlling his acts.\n\nThe disease may disappear, or intermit and recur.\n\nRiel was of sound mind when released.\n\nThe witness heard the evidence given by the witnesses as to Riel's words and conduct during his visit to the North-West.\n\nThe symptoms were the same as he had witnessed himself in the asylum at Beauport; and he believed Riel was insane at the time in question.\n\nNow, according to this statement, if we were to assume, that that was to conclude the case, according to the opinion of Dr. Roy as to what his condition was during the rebellion, I would infer the right to acquit him on the ground of insanity.\n\nBUT WHAT IS UNDISPUTED AND INDISPUTABLE, IS THAT THE MAN WAS INSANE FROM 1876, TO 1878, AND THAT THE SYMPTOMS HAD RECURRENT IN THE YEAR 1885—THE SAME SYMPTOMS WHICH OCCURRED WHEN HE WAS UNQUESTIONABLY INSANE, FROM 1876 TO 1878.\n\nNow, there was more evidence on this subject which I want to refer to at another period; but I may say that what has been made very plain, though it was not proved on the trial, is that he had been in two other asylums, and I now refer to the\n\nProbabilities of a Recurrence of Insanity.\n\nBrowne, in the \"Medical Jurisprudence of Insanity,\" says:\n\n\"One circumstance must not be overlooked in connection with the durability of insanity, and that is that there is a tendency to recurrence even after complete restoration to health. Perhaps of 100 persons who have an attack of mania and recover from it, fifty will, after such recovery, again become insane. After insanity has passed away there seems to exist a hyper sensitive condition of mind which is ill-suited to carry on the rough intercourse of the world and its society. The man who has recovered is not so well as he was before he was taken ill. Disease always chooses the weak for its victims. Disease, like water, will take the easiest way, and as the individual who has recovered from insanity is weak, in that he labors under its hyper-sensitive condition of mind, he a second time falls under the wheels of some Juggernaut catastrophe. Any great events in the world's history cause insanity; but the events are seeds which have fallen by the way-side, they require to fall on ground well suited before they can spring up and blossom in insanity—and the good ground is weakness.\n\n\"Thus we have insanity connected with child-birth, we have it connected with the weakness of childhood, with the weakness of age, with the change of life and various bodily diseases, and finally, we find it in connection with previous attacks of mental disease. The result then of these researches, which have been made into the intricacies of this subject, are these: that of twelve persons attacked with insanity, six recover and six die sooner or later; that of the six who recover three only will remain sane during the rest of their lives, and that the recovery of the other three will not be permanent.\"\n\nThe result of that is, that once found it is that a man is unquestionably insane, the chances are three out of four either that he will continue insane till he dies, or if he recovers, that recovery will be but temporary and he will once again become insane. Brown says again:\n\n\"With regard to the one, when it does take place, it is to be remembered that health no more than Rome, is to be built up in a day. Health returns very gradually. In some cases it is true that a man is sane to-day\nand insane to-morrow, and that the change from insanity to sanity may be as rapid; but it is certainly exceptional. It is easy to jump over a precipice, but if one wants to get to the top from the bottom he must be content to clamber up the hill. It need scarcely be added that as recovery of health is gradual so must the recovery of responsibility, or civil ability be also a matter of time. But as the law cannot recognise the minute distinctions which exist between today and tomorrow, it cannot recognise graduated responsibility, and it is only necessary to remember that this recovery of mental strength is gradual, that due allowance may be made for those persons who have recently suffered from an attack of mental disease, and that it is safe to regard such persons as still irresponsible for criminal acts and incapable of civil privileges, even although the recovery may seem complete, unless the contrary can be proved. Let the presumption be in favor of their want of capacity and their irresponsibility, and no injustice is likely to arise. At the same this presumption is liable to be rebutted by proof of its opposite.\"\n\nIn the commission to which I have already referred, Dr. Tuke, being examined, made these answers:\n\n\"The fact is certain that insanity constantly exists with long lucid intervals, and that it is more or less patent at different times.\n\n\"Q. And that the patient fluctuates in a condition between what may be termed sanity and insanity, the line between which is not easily definable?—A. Yes; that is a constant form of what we call insanity with lucid intervals, or insanity with remissions, or recurrent insanity.\"\n\nA case closely resembling Riel's.\n\nThen Clouston gives one example, that of patient \"C. Y.\" of whom he says:\n\n\"His mental condition was at that time exactly that intense exaltation, that morbid mental 'expansion,' that 'ambitious delirium,' or 'mania of grandeur' which we find so commonly in general paralysis, and which some physicians suppose to be characteristic of that disease. In three months he had become quiet in manner, self composed and rational, but had just a suggestion of his former state of mind in being too pleased with things and too grateful for little kindnesses. His friends thought him well and he was removed home. In seventeen days he was back again. He would come up and be most pleased to see you, and in a moment, sometimes with some little provocation, such as your not agreeing at once with him that he was an earl and sometimes without he would strike you suddenly, very often going down on his knees immediately after and in a theatrical manner begging your pardon and hopping he had not offended you. * * * He labored under chronic maniacal exaltation.\"\n\nThen comes the instance of \"C.J.\", who was admitted, October, 1866, discharged, January, 1867; admitted, April, 1870, discharged, May, 1870; admitted, August, 1871; discharged, September, 1871; admitted, December, 1872, discharged, February, 1873; admitted, February, 1874, discharged, May, 1875; admitted, August, 1877, discharged, September, 1877; admitted, November, 1880, discharged, January, 1881; admitted, December, 1881, discharged, March, 1882, and he gives several other instances showing the constant recurrence of insanity. I do not think that too much importance can be attached to the circumstance of the unquestioned and unquestionable insanity of Louis Riel, as proved by the facts to which I refer at this precedent time, and to the character of his alleged illusions or delusions, as you please to call them, at the later date. Having regard to the knowledge and experience we have with reference to the probability of recurrent insanity it seems to me these circumstances show that he was laboring under insane delusions on religion and politics, prior to, and during the outbreak, and that these delusions were directly connected with the crime with which he was charged. He believed himself a prophet, a priest, a religious potentate; he had visions; he had irrational ideas as to foreign policy, as to the lands and the division of them, as to other nationalities, as to religion, as to politics, as to his influence, as to his mission, and as to the Metis nation. Of these facts I think the evidence taken at the trial afforded abundant testimony. I think it affords abundant testimony as to his condition anterior to the outbreak, and I have taken the evidence chronologically.\nNow, the evidence which was given by the priests as to his condition is to be accepted, with this observation—that if it were possible for any one to suppose that any course of conduct on his part could have influenced them to swerve from the accurate, honest truth—if it were possible, which I am the last to suggest, that such a thing could be, it is clear that they would not have been swerved in favor of this man, from whom they had suffered so much, who had cast aside their religion, who had profaned their churches, who had insulted themselves, who had assumed their position, who had led away their flocks, who they thought was instrumental, directly or indirectly, in the murder of two of their order, who had caused all the misery of the people in benefitting whom their whole lives had been spent—I say it is impossible to suppose that they could have been swerved in favor of this man by anything in the way of feeling; and at that time he had not recounted his religious errors. But they state not only opinions, but facts, and facts of the most important character.\n\nTestimony of Father André.\n\nFather André says on religion and politics he and Riel frequently conversed, against his will; because on these subjects Riel was no longer the same man; it seemed as if there were two men in him; he lost all control of himself on those questions. Twenty times he told Riel he would not speak on those subjects, because Riel was a fool, did not have his intelligence of mind; that was the witness' experience; he had the principle that he was an autocrat in religion and politics, and he changed his opinion as he wished; his ideas changed; today he admitted this, and tomorrow he denied it; he believed himself infallible; he would not allow the least opposition at all; immediately his physiognomy changed and he became a different man. Then comes a most important act. All the priests met and they discussed whether it was possible to allow Riel to continue in his religious duties; and they unanimously decided that he was not responsible on these questions; that he could not suffer any contradiction; that he was completely a fool in discussing these questions: it was like showing a red flag to a bull. Now, remember that these statements of Riel to Father André were made and this conclusion was reached long before the outbreak, and before, as he says, Riel had actually risen against the priests. These erroneous ideas, and these manifestations of irregularity of mind, were during the latter part of 1884 and the early part of 1885, before the rebellion.\n\nFather Fourmond's Testimony.\n\nFather Fourmond says that he was present at this meeting of the priests, that it was he who raised the question; and he states the facts on which his view rested. He says: Before the rebellion it seemed as if there were two men in the prisoner; in private conversation he was affable, polite, pleasant and charitable; if contradicted on religion and politics he became a different man and would be carried away with his feelings; he would use violent expressions. As soon as the outbreak began he lost all control of himself; he often threatened to destroy all the churches. He had extraordinary ideas on the subject of the Trinity; according to his ideas it was not God who was present in the Host but an ordinary man six feet high. As to politics he wanted first to go to Winnipeg and Lower Canada and the United States, and even to France; and he said \"We will take your country even,\" and then he was to go to Italy and overthrow the Pope, and then he would choose another Pope of his own making; he said something to the effect that he would appoint himself as Pope. As the agitation was progressing he became a great deal more excitable; at the time of the rebellion Father Fourmond thought him insane. At one time when there was a gathering he kept following the witness into the tents and compelled him to leave the place and cross the water. There was a very extraordinary expression on his face; he was excited by the opinions he had expressed on religion. He said to the women:\n\"Woe unto you if you go to the priests, because you will all be killed by the priests.\" All of a sudden, when the witness came to the boat, Riel came up with great politeness and said: \"Look out, Father; I will help you to get on the boat.\" In an instant he passed from rage to great politeness. Once again at the Council the witness was brought up for trial; Riel was enraged, and called him a little tiger; but when the witness was leaving, he passed again from rage to extraordinary politeness, offered a carriage and took the witness' parcel and carried it for him.\n\nCharles Nolin's Testimony.\n\nThen Charles Nolin (whose conduct seems to have been inconsistent and certainly unfriendly) says, that about a month after prisoner arrived, say the end of July, he showed him a book he had written in the States. The first thing there was to destroy England and Canada, and also to destroy Rome and the Pope. He said he had a divine mission to fulfill and showed Bishop Bourget's letter, eleven years old, as proof. Riel showed him a book written with buffalo blood, the plan in which that was, after taking England and Canada, he would divide Canada, and give Quebec to the Prussians, Ontario to the Irish, and the North-West Territories he divided between the European nations. The Jews were to have a part, and the Hungarians and Bavarians. As to the money, he wanted from the Government, he said if he got the money he wanted from the Government, he would go wherever the Government wished to send him. He told Father André, if he was an embarrassment to the Government by remaining in the North-West, he would even go to the Province of Quebec. He said also if he got the money he would go to the United States and start a paper and raise the other nationalities in the States. He said: \"Before the grass is that high in this country, you will see foreign armies in this country.\" He said: \"I will commence by destroying Manitoba, and then I will come and destroy the North-West and take possession of the North-West.\"\n\nHe told the witness that he considered himself a prophet; one evening there was a noise in Riel's bowels, and Riel told him that it was his liver, and that he had inspirations which worked through every part of his body. He wrote his inspirations on a sheet of paper, and said he was inspired. Whenever the word \"police\" was pronounced, he became very excited. He proposed a plan to the witness, and said he had decided to take up arms, and the first thing was to fight for the glory of God, for the honor of religion, and for the salvation of souls. Before the Duck Lake fight, he was going about with a crucifix a foot and a-half long, taken out of the church. Now all these things save the last were before the rebellion, and a great portion of them in the year before the rebellion, the year 1884.\n\nGarnot's Testimony.\n\nThen, P. Garnot proves that about the beginning of the outbreak, Riel talked to him about changing the Pope; wanting to name Bishop Bourget Pope of the new world, he said that the spirit of Elias was with him; he wanted the people to acknowledge him as a prophet, and said he had the spirit of Elias in him and was prophesying. Another time he declared he was representing St. Peter. Almost every morning he would come in front of the people and say such and such a thing would happen. When he slept at the witness' house he was praying loud all night;\n\nThere was no one else there.\n\nHe would not stand any contradiction by anyone. He several times said how this country was to be divided into seven Provinces, one for the French, Germans, Irish, and others; he mentioned Italians; he expected the assistance of an army of several nationalities; he mentioned the Jews, he expected their assistance and money, and he was going to give them a Province as a reward for their help. He had no doubt of his success, or that any obstacle could prevent him from succeeding; he always mentioned that he was going to succeed, that he had a divine\nmission, and was an instrument in the hands of God. The witness thought the man was crazy, because he acted very foolish, and communicated to others at the time this impression of him.\n\nEvidence of George Ness.\n\nGeorge Ness says that at the beginning of the outbreak he witnessed a difficulty between Riel and Father Moulin, in which Riel accused Bishop Grandin and Bishop Taché of being thieves and rogues; Father Moulin wished to speak to the people; Riel refused and said: \"No, we won't let him speak; take him away, take him away, we will tie him.\" Riel said he would take possession of the church. Father Moulin said he protested. \"Look at him,\" said Riel, \"he is a Protestant.\" He said that the Spirit of God was in him. Father Moulin said he was making a schism in the church. Riel said Rome had fallen. \"Rome est tombée,\" and that the Pope was no longer legally Pope; that the Spirit of God was in him (Riel), and that he could tell future events.\n\nDoctor Willoughby also.\n\nDr. Willoughby says: At the commencement he saw Riel. He said his proclamation was at Pembina, that it was going forth, and he would be joined by Indians and half-breeds, and that the United States was at his back. He intended to divide the country into seven portions he mentioned as parties, Bavarians, Poles, Italians, Germans and Irish. There was to be a New Ireland in the North-West. These nationalities were going to assist him in the rebellion, before the war was over, and they would have their portion. He mentioned the Irish of the United States, the Germans, Italians, Bavarians and Poles. He put Germany and Ireland twice; first, the Irish and Germans of the United States, then Germany and Ireland themselves. The proposition did not appear rational to the witness, who also proves the excitement of Riel.\n\nSimilar Evidence from other Witnesses.\n\nSaunderson says: Riel told him that he was going to divide the country into sevenths, one-seventh for Canadians or white settlers, one for the Indians, one for the half-breeds, three-sevenths to remain to support the Government. He said he had cut himself loose from Rome altogether, and would have nothing more to do with the Pope. Walters says: Riel told him that the land was to be divided—one-seventh to the pioneer whites, one-seventh to the French-half-breeds, one-seventh to the church and schools, and the balance was to be government lands. He said that if the whites struck a blow, a thunderbolt from heaven would strike them, that God was with their people. Lash says: He mentioned that he was going to give one-seventh to the Indians and one-seventh to the half-breeds. He had been waiting fifteen years and at last his opportunity had come. Astley proposed an exchange of prisoners, but Riel came up and said he could not see it in that light, but that he would exchange them for Hon. L. Clarke, Registrar Sproat and McKay. We know what an exchange of prisoners is, but Riel proposed that the most important personages on the other side should be given up to him in lieu of inferior prisoners on the same side whom he had in his hands. Jackson says Riel told him his brother's mind was affected; that it was a judgment on him for opposing Riel. He talked of giving one-seventh of the proceeds of the land to the Poles, one-seventh to the half-breeds and one-seventh to the Indians, and some to the Hungarians, and so on. I was surprised to hear it stated that it was a mark of sanity in Riel that he should have thought Jackson insane, while we know that inmates of the insane asylums know that their neighbors are insane and discuss the question of their insanity.\n\nMackay's Evidence\n\nMackay had a conversation with Riel. He appeared very excited and said:\n\n\"It was blood, and the first blood they...\"\nwanted was mine. There were some little dishes on the table, and he got hold of a spoon and said: You have no blood—you are a traitor to your people. Your blood is frozen, and all the little blood you have will be there in five minutes, putting the spoon up to my face and pointing to it. I said: If you think you are benefitting your cause by taking my blood you are quite welcome to it. He called his people and the committee, and wanted to put me on trial for my life, and Garnot got up and went to the table with a sheet of paper, and Gabriel Dumont took a chair on a syrup keg, and Riel called up the witnesses against me. He said I was a liar, and he told them that I had said all the people in that section of the country had risen against them. He said it was not so; that it was only the people in this town. He said he could prove that I was a liar by Thomas Scott.\n\nThen goes on the account of the trial during which Riel was upstairs.\n\n\"When he came down, he, Riel, apologised to me for what he had said, that he did not mean it to me personally, that he had the greatest respect for me personally, but that it was my cause he was speaking against and he wished to show he entertained great respect for me, he also apologised in French to the people there, and he said as I was going out that he was very sorry I was against him. That he would be glad to have me with them, and it was not too late for me to join them yet.\"\n\nYoung's Testimony.\n\nYoung says:\n\nRiel explained that at Duck Lake he gave three commands to fire.\n\n1. In the name of God who made us reply to that.\n\n2. Then they fired and Crozier's man replied: and Riel said: In the name of God the Son who saved us reply to that.\n\n3. In the name of God the Holy Ghost who sanctifies us reply to that.\n\nRiel gives a like account in less detail to half a dozen witnesses of his action at that time and General Middleton says:\n\n\"Of course I had heard constantly before about reports of his insanity. I heard for instance one or two of the people that escaped from him, scouts, half-breeds. One man, I remember told me 'Oh! Riel is mad, he is a fool.' He told me what he was doing at Batoche. So that I really had heard it, but I came to the conclusion he was very far from being mad or a fool.\"\n\nTo that is to be added the prisoner's own conduct at the trial, the statements he made, even in the course of his interruptions during the trial, with reference to these points, and then in his addresses. In them, you will find him declare that he does not plead insanity, and you find him saying he showed that calmness which they said he could not show. He obviously, in the address he made to the jury, was doing his best to restrain himself in respect to those matters which had been presented as proofs of his insanity, with the view and in the hope, so far as was consistent with his assumed position, that he might prevent the jury from coming to the conclusion that he was insane. For instance, this extraordinary division of the territory into sevenths among different nationalities was pressed very much. What does he say to that? He says:\n\n\"A good deal has been said about the settlement and division of lands, a good deal had been said about that. I do not think my dignity to-day here would allow me to mention the foreign policy, but if I was to explain to you or if I had been allowed to make the questions to witnesses, those questions would have appeared in an altogether different light.\"\n\nA little after, when the verdict had been given and he was showing his reasons against the sentence, you will find he developed the policy which, at this time he preferred not to do, when he restrained himself, as those people often do under similar circumstances, in order to obtain that which he desired, a verdict which would not find him insane. He speaks in the same way, thanking General Middleton and Captain Young for proving him as he believes he is sane.\n\nRiel on his own Inspiration.\n\nHaving touched the question of foreign policy, as he calls it, in the lands, he feels called upon to deal with this question of inspiration, and he attempts to explain that matter. He says:\n\n\"It is not to be supposed that the half-breeds acknowledge me as a prophet if they\nhad not seen it that I could see something into the future. If I am blessed without measure I can see something into the future, we all see into the future more or less. As what kind of a prophet would I come? Would it be a prophet who could all the time have a stick in his hand and threatening, a prophet of evil? If the half-breeds have acknowledged me as a prophet, if on the other side priests come and say that I am polite, if there are general officers, good men, come into this box and prove that I am polite, prove that I am decent in my manners, in combining all together you have a decent prophet. An insane man cannot withhold his insanity, if I am insane my heart will tell what is in me. Last night while I was taking exercise the spirit who guides and assists me and consoles me, told me that to-morrow somebody will come to aid; and help me. I am consoled by that. While I was recurring to my God, to Our God, I said: But woe to me if you not help me, and those words came to me in the morning: 'In the morning some one will come to aid, that is today.' I said that to my two guards and you can go for the two guards. I told them that if the spirit that directs me is the spirit of truth it is today that that I expect help. This morning the good doctor who has care of me came to me and said: 'You will speak today before the court,' I thought I would not be allowed to speak, those words were given to me to tell me that I would have the liberty to speak. There was one French word in it, it meant, I believe, that there was to be some French influence in it, but the most part English. It is true that my good lawyers from the Province of Quebec have given me good advice. Mr. Nolin came into the box and said that Mr. Riel said that he heard a noise in his bowels and that I told him that it meant something. I wish that he had said what I said, what I wrote on the paper of which he speaks, perhaps he can yet be put in the box. I said to Nolin \"Do you hear?\" Yes, I said there will be trouble in the North-West and was it so or not, has there been no trouble in the North-West? Besides Nolin knows that among his nationality which is mine, he knows that the half-breeds as hunters can foretell many things, perhaps some of you have a special knowledge of it. I have seen half-breeds who say: \"My hand is shaking, this part of my hand is shaking, you will see such a thing today,\" and it happens. Others will say: \"I feel the flesh of my leg move in such a way, it is a sign of such a thing, and it happens.\" There are men who know that I speak right. If the witness spoke of that fact with which he mentioned to show that I was insane he did not remember that perhaps on that point he is insane himself, because the half-breed by the movement of his hand, sometimes of his shoulders, sometimes his leg, can have certain knowledge of what will happen. To bring Sir John to my feet, it was well reported it would appear far more reasonable than it has been made to appear. Mr. Blake, the leader of the Opposition is trying to bring Sir John to his feet in one way. He never had as much at stake as I had, although the Province of Ontario is great it is not as great as the North-West.\n\n\"I am glad that the Crown have proved that I am the leader of the half-breeds in the North-West, I will perhaps be one day acknowledged as more than a leader of the half-breeds, and if I am I will have an opportunity of being acknowledged as a leader of good in this great country.\n\n\"One of the witnesses said that I intended to give Upper Canada to the Irish, if he had no mystery he would have seen that. Upper Canada could not be given to the Irish without being given to England, he rested only upon his imagination.\n\n\"There is another thing about the partition of the lands into seven. I do not know if I am prepared to speak of it here because it would become public information, there is so much at stake that if I explained that theory Canada would not very long remain quiet.\"\n\nThen, he says about the delegations:\n\n\"The half-breeds also know that I told them I would be punished, that I did not say it of my own responsibility but that I said it in the same way as I had told them other things. It was said to me that the nation would be punished. Why? Because she had consented to leave Rome too quick. What is the meaning of that? There was a discussion about it, too quick. They said that they should do it at once. Too quick does not mean too soon. If we say yes, it shows no consideration to the man. If God wants something and if we say yes, that is not the way to answer him; He wants the conscience to say yes. Oh my God I do thy will; and because the half-breeds quickly separated from Rome in such a quick manner it was disagreeable to God and they were punished, and I told them it would happen—fifty of those who are there can prove it. But you will say: 'You did not put yourself as a prophet.' The nineteenth century is to be treated in certain ways, and it is probably for that reason I have found the word 'Exovede.' I prefer to be called one of the flock. I am no more\nthan you are—I am simply one of the flock, equal to the rest. If it is any satisfaction to the doctor to know what kind of insanity I have, if they are going to call my pretensions insanity, I say humbly, through the grace of God I believe I am the prophet of the new world.\n\n\"I wish you to believe that I am not trying to play insanity; there is in the manner, in the standing of a man, the proof that he is sincere, not playing. You will say 'What have you got to say?' I have to attend to practical results. Is it practical that you be acknowledged as a prophet? Is it practical to say it? I think if the half-breeds have acknowledged me, as a community, to be a prophet, I have reason to believe that it is beginning to become practical. I do not wish for my satisfaction the name of prophet. Generally the title is accompanied with such a burden, that if there is satisfaction for your vanity there is a check to it.\"\n\nRiel thankful to be found Guilty and Sane.\n\nThen, the moment the verdict was given and the prisoner was called to speak in respect of sentence, he congratulates himself, and thanks the jury for having found him sane, and says: \"At least, if I were going to be executed, I would not be executed as an insane man.\" Then he goes on to say:\n\n\"Must not I take advantage of the situation to show that they are right and that I am reasonable, and yesterday, when I said by repeating the evidence which has been given against me, when I said in conclusion that you had a decent prophet, I have just today the great opportunity of proving it is so, besides clearing me of the stain of insanity, clearing my career of the stain of insanity. I think the verdict that has been given against me is a proof that I am more than ordinary myself, but that the circumstances and the help that is given is more than ordinary, are more than ordinary, and although I consider myself only as others, yet by the will of God, by his Providence, by the circumstances which have surrounded me for fifteen years, I think that I have called to do something which at least in the North-West nobody has done yet, and in some way I think that to a certain number of people the verdict against me today is a proof that may be I am a prophet, may be Riel is a prophet. He suffers for it. Now, I have been hunted as an elk for fifteen years. David has been seventeen, I think. I would have to be about two years still; if the misfortunes that I have had to go through were to be as long as those of the old David, I would have two years still, but I hope it will come sooner.\"\n\nThen he proceeds to describe what he had kept concealed in the earlier speech—the question of the lands. He says:\n\n\"The half-breeds had a million and the land grant of 1,400,000 acres out of about 9,500,000, if I mistake not, which is about one-seventh of the land of Manitoba. You will see the origin of my insanity and of my foreign policy. One seventh of the land was granted to the people, to the half-breeds of Manitoba, English and French, Protestant and Catholic. There was no distinction whatever, but in the subdivision, in the allotment of those lands between the half-breeds of Manitoba, it came that they had 240 acres of land. Now, the Canadian Government say, that we will give to the half-breeds of the North-West, 240 acres. If I was insane I would say yes, but as I have had, thank God, all the time, the conscientiousness that I had a certain degree of reason, I have made up my mind to make use of it, and to say that one-seventh of the lands in Manitoba, as the inauguration of a principle in the North-West, had to bring to the half-breeds of the North-West, at least as soon as possible, the guarantee for the future that a seventh part of the lands will also be given to them. And seeing and yourself understanding how it is difficult for a small population as the half-breed population to have their voice heard, I said what belongs to us ought to be ours. Our right to the North-West is acknowledged, our co-proprietorship with the Indians acknowledged, since one-seventh of the lands is given us, but we have not the means to be heard, what we do? I said to some of my friends: If there is no other way, we will make the people who have no country understand that we have a country here which we have ceded on condition, we want the seventh of the land, and if the bargain is not kept, it is null and void, and we have no right to retreat again, and if we cannot have our seventh of the lands from Canada, we will ask the people of the States, the Italians to come and help us as immigrants, the Irish I will count them.\"\n\n\"Now, it is my turn, I thank you. I count them and I will show you if I made an inaccurate enumeration of the parties. I say, we will invite the Italians of the States, the Irish of the States, the Bavarians of the States, Poles of the States, Belgians of the States, and if they come and help us here to have the seventh, we will give them each a\nseventh; and to show that we are not fanatics, that we are not partisans, that we do not wish only for the Catholics, but that we have a consideration for those who are not Catholics, I said, we will invite the Danes. We will invite the Swedes, who are numerous in the States, and the Norwegians, to come around, and as there are Indians and half-breeds in British Columbia, and as British Columbia is a part of the immense North-West, we said, not only for ourselves, but speaking for our children, we will make the proposition that if they help us to have our seventh on the two sides of the Rocky Mountains, they will each have a seventh; and if the Jews will help us, and on the condition that they acknowledge Jesus Christ as the Son of God and the only Saviour of human kind, if they help us with their money, we will give them one-seventh. And I said, also, if the principle of giving one-seventh of the lands is good in the North-West, if the principle of giving one-seventh of the lands to the half-breeds in the North-West is good, it ought to be good in the east also, and I said, if it is not possible that our views should be heard, we will—I, as an American citizen—I will invite the Germans of the States and I will say: \"If you ever have an opportunity of crossing the line in the east, do it, and help the Indians and the half-breeds of the east to have a revenue equivalent to about one-seventh. And what would be the reward of the Germans? The reward of the Germans would be, if they were successful, to take a part of the country and make a new German-Indian world somewhere in British North America. But that is the last resort, and if I had not had a verdict of guilt against me I would have never said it. Yesterday it was just those things that I have avoided to say, when I said, I have a reason not to mention them. And when I said, as one of the witnesses said, that my proclamation was in Pembina, I think I am right, because of this trial. You see that my pretension is that I can speak a little of the future events; My trial has brought out the question of the seventh, and although no one has explained the things as I do now, still there is enough said about the sevenths of the lands and the divisions of the lands into sevenths, seven nationalities, while it ought to have been said ten nationalities, that by telegraph today my proclamation is in Pembina truly, and the States have my ideas. They have my ideas. * * * And Gabriel Dumont, on the other side of the line, is that Gabriel Dumont inactive? I believe not. He is trying to save me from this box. This is no threat. I have written it. I have written a document of that kind, and put it into the hands of Captain Dean, three weeks ago. This is not an inspiration of the moment. I have the right to thank God for the provision of what happens today. But another means. I don't wish these means.\"\n\nHe would Establish a New Ireland.\n\nThen he reverts to it again, and says:\n\n\"My heart will never abandon the idea of having a new Ireland in the North-West, by constitutional means, inviting the Irish of the other side of the sea to come and have a share here; a new Poland in the North-West, by the same way; a new Bavaria by the same way; a new Italy in the same way. And on the other side of Manitoba—and since Manitoba has been erected it has been increased since 1870, at least by 9,600,000 acres of land, now it is 96,000,000, say there is about 86,000,000 acres of land to which the half-breeds title has not been extinguished. One seventh gives 12,000,000 of those lands—and I want French Canadians to come and help us there today, tomorrow, I don't know when. I am called here to answer for my life to have time that I should make my testimony. And on the other side of the mountains there are Indians, as I have said, and half-breeds, and there is a beautiful island, Vancouver, and I think the Belgians will be happy there, and the Jews who are looking for a country for 1,800 years, the knowledge of which the nations have not been able to attain yet, while they are rich and the lords of finance. Perhaps will they hear my voice one day and on the other side of the mountains while the waves of the Pacific will chant sweet music for them to console their hearts for the mourning of 1,800 years, perhaps will they say: He is the one thought of us in the whole Cree world, and if they help us there on the other side between the great Pacific and the great Rockies to have a share, the Jews from the States.\"\n\nThen he says:\n\n\"The Scandinavians, if possible, they will have a share. It is my plan, it is one of the illusions of my insanity, if I am insane, that they should have on the other side of the mountain a new Norway, a new Denmark, and a new Sweden, so that those who spoke of the lands of the great North-West to be divided in seven forget that it was in ten, the French in Manitoba, the Bavarians, the\nItalians, the Poles and the Irish in the North-West, and then five on the other side too.\"\n\nThen again he says:\n\n\"Not insanity, because it is disposed of but whether I am a deceiver or an imposter. I have said to my lawyers: 'I have written things which were said to me last night, and which have taken place today.' I said that before the court opened last night the spirit that guides and assists me told me: 'The court will make an effort.' Your honor, allow me to speak of your charge, which appeared to me to go on one side. The court made an effort, and I think that word was justified. At the same time there was another thing said to me: 'A commission will sit; there will be a commission.' I did not hear yet that a commission is to take place. I asked for it. You will see if I am an imposter thereby.\"\n\n\"In Batoche many things which I said have already happened. It was said to me: 'Not far from here.' And that is why I never wanted to send the half-breeds far. I wanted to keep them, and it was said to me: 'I will not begin to work before 12 o'clock and when the first battle opened I was taking my dinner at Duck Lake. When the battle began it was a little after 12 o'clock. 'I will not begin to work before 12 o'clock.' And what has happened? And it was said to me: 'If you don't meet the troops on such a road you will have to meet them at the foot of a hill, and the half-breeds facing it.' It is said my papers have been published. If they have been published examine what took place, and you will see we had to meet General Middleton at the foot of the hill. It was also told me that men would stay in the belle prairie, and the spirit spoke of those who would remain on the belle prairie, and there were men who remained on the belle prairie.\"\n\nMedical Testimony.\n\nNow these were the events of the trial itself, and apart altogether from the other evidence which is before us, although not official. There was, besides the evidence of the other medical witnesses. Dr. Clark was called and examined. He had examined Riel three times, had heard the evidence, and if he was not feigning, he was insane to the limit of irresponsibility. But it takes long to find out that a man is insane. Dr. Wallace, who, I believe, is the Superintendent of the Hamilton Lunatic Asylum, examined him once and heard the evidence. He could only say that he did not find out—he might be insane. It takes long to find out whether a man is insane. Dr. Jukes, who was not a specialist, and was the police surgeon in charge of the prisoner, had never examined or tested him at all. He also says it takes a long time to find out, though he had not found out anything to show his insanity. Now I do not, myself, believe that it can be at all seriously contended that this man was feigning. The old insanity had recurred. They were the same sort of views which he had expressed during the old insanity. He was most anxious to avoid the imputation of insanity and to this end he restrained himself at the trial, to a considerable extent, in his expressions. He was artful in his insanity, as often happens, and what he wanted was to show that he was a genuine prophet. All the symptoms which are stated in cases of feigned insanity are symptoms which indicate that THIS MAN'S INSANITY WAS NOT FEIGNED.\n\nTaylor says:\n\n\"Insanity is frequently feigned by persons accused of criminal offences in order to procure an acquittal or discharge. In the first place, when this is suspected, it will be proper to enquire whether the party had any motive for feigning the malady. It is necessary to remember that insanity is never assumed until after the commission of a crime and the actual detention of a criminal. No one feigns insanity merely to avoid suspicion. In general, as in most cases of imposition, the part is over-acted—the person does either too much or too little, and he betrays himself by inconsistencies of conduct and language which are never met with in cases of real insanity. There is commonly some probable cause to which real insanity may be traced, but when the malady is feigned there is no apparent cause; in this case the appearance of the assumed insanity is always sudden; in the real malady the progress of the attack is generally gradual, and when the attack is really sudden, then it will be found to be due to some great moral shock, or other very obvious cause.\n\n\"We should observe whether there has been any marked change of character in the individual, or whether his conduct, when he had no interest to feign, was such as it is now observed to be.\"\nThe same learned author says:\n\n\"I am indebted to a learned judge for the following note on feigned insanity:—It may be safely held that a person feigning insanity will rarely ever try to prove himself to be sane—for he runs the great risk of satisfying others that he is sane—the conclusion he desires to avoid. There is no better proof in general that the insanity (supposing other evidence of it to be strong) is real than in the keen and eager attempts by the accused to prove that he is sane, and strong and indignant remonstrance against being held to be insane, though that would protect himself against trial and punishment. In one case, at Edinburgh, some doubt existed whether a party was feigning insanity, and some of those about him, and in charge of him in gaol, from his clearness and coherence, were satisfied that he was quite sane, and that what he exhibited was merely eccentricity, or simulated attempts to act as a mad man. Insane he certainly was beyond all doubt; but he fought the point of his sanity most bravely in court. He made very clear and quick remarks upon the evidence of the medical men; who had no doubt of his entire insanity; and when one physician of great experience with insane persons that he thought him quite incapable of giving information to counsel and agents for conducting his defence, he said instantly; 'Then, why did you advise me to apply to see counsel and agents?'\"\n\nNow, Sir, my clear conclusion from this evidence is that in the testimony at the trial there was overwhelming proof of great disorder of intellect, of insane delusions on religion and political topics, those very topics out of which the acts grew.\n\nDegree of Riel's Insanity.\n\nNow it is unnecessary to enquire for the purpose of the issue before us whether that disorder was so great as, by our law, to justify a verdict of not guilty on the ground of insanity. On that point minds will differ as to whether it was great enough or not. Assume if you please—and I think there is great force in the proposition—that, dealing with the verdict of the jury and with the judgment of the court in Manitoba, you may not unfairly argue that it was indicated strongly as far as the evidence at the trial went that he was not so irresponsible within the meaning of the law so as to have a verdict of not guilty returned—though that conclusion would not accord with my own individual opinion—but assume that. Give the verdict all its just weight, omit the very strong point to which my hon. friend from East Quebec alluded, the evidence in the case of Jackson which I have read in the imperfect report we got in the newspapers, in which Dr. Jukes seems to have sworn that, with the exception of something said about his not speaking rationally all the while, his delusions were much the same as Riel's and on which evidence he was found insane—I say that assuming, if you please, that the disorder was not so serious as to render the prisoner wholly irresponsible, so deciding you justify the verdict of guilty, and having justified the verdict of guilty, you by no means rid the Executive of very grave duties.\n\nJudicial Duties of the Government.\n\nNow upon this question there are very serious errors largely prevailing in the public mind. It is common talk, and this House has not been wholly free from that common talk, that there should be no interference with the verdict or sentence in capital cases—talk, which if it were acted on, would render it impossible to maintain capital punishment on the Statute Book for twelve months in any civilised country. Now, I shall prove the errors of this view by statistics. The statistics of the administration of justice in England and Wales, during ten years, before 1863, show that the proportion of convictions to committals for all classes of crimes taken together, was 70 to 71 per cent; and I may say that there is a curious run of similarity for many years in both England and Canada in that regard. But for murder during those ten years the proportion of convictions to committals was only 23½ per cent. or a little over one-third of the proportion in the general run. While thus you find, in the first place, that a much smaller proportion of persons in proportion to those charged were convicted of murder than in the general run, you\nfind the proportion of executions to the convictions for murder was but 60 per cent, and that 40 per cent. were commuted. In the 20 years from 1861 to 1880 there were 512 capital sentences for murder. Out of those there were only 279 executions, or 54½ per cent., and 233 not executed, or 45½ per cent. In the 5 years from 1880 to 1884 there were 168 capital sentences. Out of these only 80 executions took place, or 48 per cent., 88 were not executed, or 52 per cent. Thus there are now fewer executions in proportion to sentences than there were. In the first period I gave you there were something more than half, during the second period there were fewer but still a little more than half; but for the last available period less than half those sentenced were executed. Let me give you the individual cases which came before Mr. Justice Stephen in three years. He sentenced ten persons to death; four were executed, six commuted; four because the means by which they caused death were neither intended nor in themselves likely to cause death; in these cases, under an improved definition, the prisoners would have been found guilty of manslaughter; one, because after the conviction it appeared probable that he had received provocation, which might reduce the offence to manslaughter; one because the convict was subject to epileptic fits, which rendered her frequently unconscious and had permanently impaired her powers, though she was probably not insane at the moment. Judge Stephen had not the least doubt when he passed sentence as to the cases in which there would be commutation and execution. In France, by the evidence taken in 1864, the persons found guilty of murder in four years, from 1859 to 1862, were 1,368; of these 1,228, or nine-tenths, were found guilty with extenuating circumstances, leaving only 140 or one-tenth guilty, and liable to death. These were the very worst cases, yet of these about one-half only were executed and the rest were commuted. The English Commission on Capital Punishment state the custom in France as follows:\n\n\"Whether the convict has or has not sued for pardon or commutation of penalty, the case is always examined by a commission at the Ministry of Justice, and by the advice of this commission the execution either takes place or the penalty is commuted, unless the Emperor should take the initiative; his right of pardon has no limit.\"\n\nNow take Ontario and Quebec, in the four years, 1880 to 1883, according to the criminal statistics brought down by the hon. gentleman opposite, there were ninety-six persons charged with murder; twenty-six only were convicted or twenty-seven per cent., thirteen only were left for execution; every second sentence was commuted. During the same four years seventy per cent. of those charged with all crimes were convicted; and the commutations (including murder and second commutations of capital cases) were only one in 350, and of those many were due to ill-health. The result is that of 500 charged with all crimes 350 are convicted, and of these 349 or more suffer the sentence of the law, so that practically the sentence is executed in all these cases. But of 500 charged with murder only 135 are convicted instead of 350, the general average; of the 135 only 67 or 68 suffer the sentence of the law, or one out of two, instead of 349 out of 350 the general average. Of the 500 charged with murder only sixty seven are convicted and suffer the sentence of the law, or less than twelve per cent. of the committals; while out of 500 charged with all crimes 349 or more are convicted and suffer the sentence of the law, or seventy per cent of the committals—nearly six times as many as in capital cases. What is the general result? The general result of these statistics is that in England, in France, in Ontario and Quebec there is a more careful sitting in the preliminary process before verdict in the capital cases than there is in the general average of crime. There is a greater reluctance to convict, there is a greater tendency to acquit, and so there is a very much smaller proportion of persons charged with that particular offence, the capital offence, who are convicted than of those who are charged with other offences. What follows? Is it that it is in the recidivism, the worst cases\nthe plainest cases, the most obvious cases alone that conviction takes place, and after that preliminary sifting which results in the most obvious and plainest cases only leading to conviction in cases of charges of murder, yet while only one in 350 of all classes of sentences is commuted, in capital cases 175 out of 850 are commuted. Why is it that we do not interfere with other sentences, and yet we interfere to such an enormous extent with these particular sentences, capital sentences?\n\nReason for large proportion of Commutations to Death Sentence.\n\nThe reason is perfectly obvious. It is because there are various classes and degrees of moral guilt in the same legal offence having the same legal definition, and because in all other cases than cases of capital sentence the judge has a discretion to apportion the punishment to the particular circumstances of the case. He does so. He tempers justice with mercy himself; he considers the palliating circumstances; he considers among other things the state of mind and degree of responsibility; he exercises a wide discretion, he may have a right to commit a man for life or for one hour, for a long term of years or for a month. The law gives it to him because the law feels that in all these classes of cases, of larceny, of intent to commit murder, of assault, of what crime you will it is impossible to predicate the same degree of moral guilt, and therefore that it is essential to provide some machinery by which, to some extent, the punishment awarded shall be proportionate to the degree of guilt in the specific case. But in capital cases there are not less—there are even more—shades of guilt than there are in other cases. No one will dispute that; no one who has read the interesting but harrowing accounts of murder trials but must agree that there are all sorts and shades of guilt in the commission of that which, according to the law of the land, is yet always murder. And yet in that particular case, the judge has not any discretion at all. He must pronounce the only sentence, the ultimate sentence, the maximum sentence, the sentence which is the worst and severest sentence now applied, not to all murderers, but to the worst murderers alone. But there is a discretion, notwithstanding. There is no reason why, in this particular case, there should not be somewhere that discretion which exists in other cases, not as a part of the prerogative of mercy, but as part of the administration of criminal justice, which in other cases is vested in the judge. It is impossible to say that you should not find somewhere in the case of murder the discretion to apportion the punishment to the moral guilt, when you give it by your Statute Books in all the other cases in the land. For reasons which I need not discuss, this discretion is not in capital cases vested in the judge. The reasons may be satisfactory or unsatisfactory; it is no matter, but in fact the discretion rests in capital cases, not with the judge, but with the Executive, and\n\nIN THIS CASE THE MINISTERS DISCHARGE UNDER THE LAW OF THE LAND A DUTY WHICH IS PART OF THE ADMINISTRATION OF CRIMINAL JUSTICE, AND WHICH IN ALL OTHER CASES IS, UNDER THE LAW OF THE LAND, DISCHARGED BY THE JUDGE WHO TRIES THE CASE AND AWARDS THE SENTENCE.\n\nThey have combined and commingled also the prerogative of mercy strictly so-called, as distinguished from this part of the administration of justice, the prerogative which they exercise with reference to all cases. If they think the judge's sentence too severe, they may—though I am glad to say the power is rarely exercised—commute the severe sentence of the judge. This is a distinct exercise of the prerogative of mercy; and in the capital cases they have, as a matter of course, to consider the two positions, and they are commonly considered together; the whole case and the circumstances are considered together. Now, I think I have shown you perfectly plainly and\nperfectly clearly that there is the most marked distinction that can be conceived between the capital sentence and its execution and all other sentences and their execution. I might put it to you in another point of view, in this way: the case would be the same in kind, though not in degree, if your law, for all other crimes than the capital crimes, obliged the judge to award the maximum sentence which the law now awards for the particular crime. Then you would immediately have the Executive necessarily invaded with applications, as a branch of the administration of criminal justice. They would say: Your law has made no distinction at all, yet the moral guilt and the degree of responsibility varies, and in this case it is very light, and yet there is a twenty years' sentence; you must mitigate. This discretion the judge exercises now in all other cases. You accomplish this result by another operation in all cases of capital sentence. You do it by the operation of the Executive in the case of a capital sentence. Thus the capital sentence is not in the sense which has been applied to it, the sentence of the law with reference to the capital crime. It is the extreme sentence of the law. It is not the rule to execute that sentence. In Ontario and Quebec, as many sentences are commuted as are executed, and in England and Wales, more. There it is the exception to execute, and why? Because it is not fitting there any more than in other cases to apply as a rule the extreme, the maximum penalty of the law to this class of crimes.\n\nTreason less Heinous than Murder.\n\nNow, Sir, I have spoken up to this point of the capital offence of murder, because it is in practice—or was in practice until the 16th of November, in modern times—the only capital offence. The old law as to high treason, of course, remains, but milder views have long prevailed with reference to political offences. Since June, 1848, in England, and since a later period here, the same offences precisely, the same character of offences may be, and since that time, as far as I know, have always been in England, tried under the milder Act as treason-felony in respect of which the maximum sentence is imprisonment for life. I do not mean that this observation applies to isolated act of murder which, are generally excluded from amnesties and are tried as such. If, therefore, there be any distinction with reference to the application of the general principles of the administration of criminal justice to which I have adverted and which I have established, if there be any distinction between murder and treason, it is not what has been intimated from the other side. It is not that your law is more severe in the case of treason; it is that your law is milder in the case of treason. It is that while you continue in the case of murder to provide only a machinery under which the sentence must be capital, yet you have provided in the case of treason, and you have used in every case in the North-West except one, a milder procedure, another law in respect to which the maximum penalty is imprisonment for life for the same offence. There is the distinction as is enshrined in the Statute Book in England and in Canada, and you cannot from that make out this conclusion which hon. gentlemen opposite have made of treason as the highest crime. I know there is a sense in which it may be so regarded. You may talk about the life of the State, the body politic, the corporation, and so on; but I think I shall show before I sit down how much there is in all that. The distinction, then, is that. Now, sir, I ask what more is to be said after this statement, of its being a duty on the part of the Executive to carry out the sentence of the law? I maintain that there is no duty on the part of the Executive, to leave the law to take its course when, in this particular case, it is the maximum punishment which the law obliges the judge to award and when as I have shown as often as not, that maximum punishment is not inflicted.\nIn truth and in fact, disguise it how you will, in England, in France, in Canada, it is the Executive that awards the real sentence of the law in capital cases; and in this particular case the duty of the Executive was emphasised and enlarged by the special provision in North-West Territories Act, which having a due regard, or some regard, to the comparative weakness of the tribunal and the circumstances of the case, made a special provision under which the sentence was not to be executed until the pleasure of the Executive was known; which the learned Chief Justice of Manitoba described as providing in fact, three trials: First, before the judge and jury; secondly, before the court in Manitoba; and thirdly, before the court in Ottawa—the Executive of the country.\n\nHow the Prerogative of Mercy should be Exercised.\n\nNow Sir, I propose to reinforce the position which I have taken as flowing inevitably from the statistics and the reasoning which I have given you, as to the principles and the practice of the exercise of what is called the prerogative of mercy; and first of all, let me deal with it in capital cases generally. I quote from the same learned authority to which I before referred, Sir James Stephen's work:\n\n\"The subject of the discretion exercised by the judges in common cases, and by the Executive Government (practically the Home Secretary) in capital cases appears to me to be little understood. As to this it must be remembered that it is practically impossible to lay down an inflexible rule by which the same punishment must in every case be inflicted in respect of every crime falling within a given definition, because the degrees of moral guilt and public danger involved in offences which bear the same name and fall under the same definition must of necessity vary. There must therefore be a discretion in all cases as to the punishment to be inflicted. This discretion must from the nature of the case be vested either in the judge who tries the case or in the Executive Government or in the two acting together.\n\n\"From the earliest period of our history to the present day the discretion in misdemeanor at common law has been vested in the judge.\n\n* The cases which still continue to be capital—practically murder and treason—supply the only instances worth noticing in which the judge has no discretion. The discretion in such cases is vested in the Secretary of State.\n\n\"It was never intended that capital punishment should be inflicted whenever sentence of death was passed. Even when the criminal law was most severe the power of pardon was always regarded as supplementary to it, and as supplying that power of mitigating sentences of death which the words of the law refused.\n\n\"The power of pardon, in the exercise of which Her Majesty, advised by the Home Secretary, still remains unaltered, and in respect of capital sentences, it answers the purposes fulfilled in other cases by the discretionary power entrusted to the judges. The fact that the punishment of death is not inflicted in every case in which sentence of death is inflicted, proves nothing more than that murder, as well as other crimes, has its degrees, and that the extreme punishment which the law awards ought not to be carried out in all cases.\"\n\nHe says further:\n\n\"I am strongly of opinion that capital punishments should be retained and that they should be extended to some cases in which offenders are at present liable to them; but I am also of opinion that no definition which can ever be formed, will include all murders, for which the offender ought to be put to death and exclude all those for which secondary punishment would be sufficient.\n\n\"The most careful definition will cover crimes involving many different degrees, both of moral guilt and of public danger; moreover, those murders which involve the greatest public danger, may involve far less moral guilt than those which involve little public danger.\"\n\n\"The question of the necessary disproportions between gradations of crime and gradations of punishment is brought to the most perplexing issue in the case of the punishment of death. This punishment has the following characteristics as distinguished from all others: It admits in itself of no gradation; it is irrevocable; and it is more different in kind from all other punishments than they are from each other. * * * Murder is the offence to which the punishment of death is now almost universally restricted.\"\n\nThen the Commission on Capital Punishment declared:\n\n\"There is one point upon which the witnesses whom we have examined are almost\nunanimous, viz., that the power of directing sentence of death to be recorded should be restored to the judges. We think this change desirable.\"\n\nWhat was that? There was a power for some time allowed the judge, instead of passing the sentence of death, to permit it to be recorded, which was equivalent to a reprieve, and was invariably followed by commutation thus granting to the judge some measure of that judicial discretion, which here is applied wholly by the Executive. Then if you deal with cases of political offence, as has already been pointed out, the severity of the law has been mitigated in France by the Constitution of 1848, which abolished the punishment of death en matière politique.\n\nExtent of customary exercise of the prerogative.\n\nNow, let me come to the mode and extent of the exercise of this prerogative in these cases. The Commission on Capital Punishment examined, among others, Mr. Walpole, the Home Secretary. Mr. Hardy asks him:\n\n\"Q. You have the Chancellor and other judges; in addition to that, I think you will remember that in your own time there was one case in which it became very important to ascertain the facts with regard to the locality?—A. Certainly.\n\n\"Q. And do you remember that you there authorized an intelligent person upon the spot to have the distances measured to show whether they were in conformity with the evidence, which was impugned upon that ground?—A. Certainly, I did.\"\n\nSo that you find that examinations of that kind took place where evidence given at the trial was impugned in order to test whether it was really accurate or not. Again, the Royal Commission on Indictable Offences, composed of the learned Judges Blackburn, Barry, Lush, and Stephen, report thus:\n\n\"Cases in which, under some peculiar state of facts, a miscarriage of justice takes place, may sometimes though rarely occur; but when they occur it is under circumstances for which fixed rule of procedure cannot provide.\n\n\"Experience has shown that the Secretary of State is a better judge of the existence of such circumstances than a court of justice can be. He has every facility for enquiring into the special circumstances; he can and does, if necessary, avail himself of the assistance of the judge who tried the case, and of the law officers. The position which he occupies is a guarantee of his known fitness to form an opinion. He is fettered by no rule, and his decision does not form a precedent for subsequent cases. We do not see how a better means could be provided for inquiry into the circumstances of the exceptional cases in question. The powers of the Secretary of State, however, as to disposing of the cases which come before him are not as satisfactory as his power of inquiring into their circumstances. He can advise Her Majesty to remit or commute a sentence; but, to say nothing of the inconsistency of pardoning a man may be unsatisfactory. The result of the inquiries of the Secretary of State may be to show, not that the convict is clearly innocent, but that the propriety of the conviction is doubtful; that matters were left out of account which ought to have been considered; or that too little importance was attached to a view of the case, the bearing of which was not sufficiently apprehended at the trial.\"\n\nRather extensive powers, Sir. Then, I refer to a series of authorities of the highest character, being mainly the explanations which have been given by successive Home Secretaries in the British Parliament, with reference to the discharge of their functions.\n\nOpinions of British Home Secretaries.\n\nIn 1835, with regard to the Dorchester laborers, Lord Russell, then Home Secretary, said:\n\n\"What I have to say is, that in this case, as in any other that may be brought before me, whether in the House or out of it, I do not hold myself precluded from entering upon the consideration of any facts or circumstances that may come to my knowledge, or from forming a judgment upon them without reserve.\"\n\nLord Loughborough, who was at one time Chief Justice, said in the House of Lords:\n\n\"That he had tried prisoners who had been capitally convicted, and he had carefully examined and revised all the circumstances\nof their cases without being able to find a single reason which would justify his recommending mercy to be extended to them, and he had reported to the Government that he did not think himself warranted in saying that they were entitled to favorable consideration, and yet mercy had been extended to them more than once, and, he verily believed, on fair and just principles.\"\n\nSir Geo. Grey, Home Secretary, said:\n\n\"I cannot accept the doctrine of the hon. member that the Secretary of State is bound to consider the verdict of a jury in a capital case as absolutely final, and to refuse to investigate any alleged facts which may be stated to him tending to alter the view of the case submitted to the judge and jury. The duty of a Secretary of State would be easy if in all cases he refused to receive any appeal for mercy founded upon facts not stated at the trial. But he cannot shrink from the performance of the duty which is now imposed upon him however painful it may be; if he did his conduct would meet with universal condemnation.\"\n\nMr. Home Secretary Walpole said that a murder referred to was one of aggravated enormity and barbarity; yet the sentence was commuted. Again Mr. Gathorne Hardy, Home Secretary, said:\n\n\"After the trial and condemnation facts might come out which it would be desirable to sift; and however long it might be after a man's conviction, if circumstances transpired showing that the conviction was unjust, or throwing such a doubt on it as to make it clear that there ought to be some interference, there must necessarily be some authority to exercise the prerogative of mercy.\"\n\nMr. Home Secretary Walpole said:\n\n\"Do not it be supposed that I think that the Home Secretary has not a very large power vested in him of advising the Crown to exercise its prerogative of mercy. I think there is such a power vested in him, not for the purpose of re-hearing a case which can only be properly reheard before a judge and jury, but for the purpose of taking into consideration, not only the facts proved at the trial, but any other facts and circumstances that may be brought to light subsequently, of weighing them, and of determining whether, under all the circumstances, it is his duty to recommend the Crown to exercise its prerogative of mercy, and to mitigate the severity of punishment. In no case, however, should he interfere against the decision both of judge and jury, unless the case is so plain as to leave no reasonable doubt on the mind of any intelligent man that a great injustice had been done.\"\n\nMr. Gathorne Hardy, Home Secretary, said:\n\n\"Certainly, in this instance, the jury did not neglect their duty, but found a verdict of 'wilful murder' in a case which was undoubtedly one of wilful murder according to the law of this country. As far as I am concerned in this transaction, I have no hesitation in explaining all that has taken place in regard to it. ** The memorial was sent down to the judge, and by return of post I received an answer in which the judge recommended that the sentence of death should be commuted to penal servitude.\"\n\nAnd it was commuted. On the Bill to abolish capital punishment which came up in 1869, Mr. Secretary Bruce, said:\n\n\"He would undertake to say that the law (as to capital punishment) could not exist at all were it not for the large discretionary power entrusted to the Home Secretary, which devolved upon him duties, not only of the most difficult, but of the most painful character.\n\n\"It was hard, for instance, to justify the continued existence of a law under which it was not merely in the power, but became absolutely the duty of the Secretary of State to remit sentences of death solemnly passed by a judge after verdict found by a jury. In accordance with long tradition in his office, it was the duty of the Home Secretary to remit the extreme sentence in all cases of infanticide. Another custom which had grown to be inviolable—at least he had not been able to find a single exception—was that no sentence of death was ever inflicted in a case where, in the opinion of the judge, it ought not to be inflicted. Everybody acquainted with the subject, must be aware that after every assize there were judges who hastened to inform the Home Secretary, that although, according to the definition of law, the jury had been right in finding the prisoner guilty of murder, and although the judge was himself bound to pass sentence of death, yet, in his opinion, that sentence ought not to be carried into execution. Then no inconsiderable number of cases arose where the judge passed sentence of death, himself disagreeing with the jury. In the two latter classes of cases, the Home Secretary, whether he agreed with the opinion of the judge or not, was bound, according to the practice, to abandon his own...\"\nopinion and act upon that of the judge—morally bound, he meant, of course, for there was no legal obligation resting upon him beyond the precedents invariably recognised by his predecessors.\"\n\nMr. Bruce again said:\n\n\"A third class of cases, extremely difficult to deal with, and exposing the holder of the office to comments, harsh and very frequently unjust, was when fresh evidence arose after the conviction of the offender, and he must say that, in his opinion, this was the weakest part of our present system, and one deserving the most serious consideration of the Legislature. The case was that of a very poor class of persons, who either where unable to obtain legal assistance, or from their position or perhaps from their previous character, excited but little sympathy in the neighborhood, and facts which might have told in their favor were not brought out till the consciences of those acquainted with those facts were aroused by the impending death of the convicts. Cases such as these were by no means infrequent. In his short experience he had already had two or three signal instances in which evidence of the most unbounded importance had been kept back, either from want of means on the part of the prisoner to have his case properly investigated, or from want of interest on the part of those by whom the evidence could be given.\"\n\nThen on the remission of capital punishment Mr. Bruce said:\n\n\"It is well that the House and country should understand how in the cases, which so often offend the honest opinion of the public, there is apparent discrepancy between the opinion of judge and jury on the one hand and that of the Home Secretary on the other. It arises from this—that the jury is obliged to find, from the direction of the judge, a verdict of wilful murder, and that the judge is constantly required to pass a sentence of death, when it is quite certain it will not, cannot, ought not, to be executed. * * * Such is the state of the law, and so long as it is the state of the law it is absolutely impossible but that the decision of the Secretary of State must occasionally be in disaccord with the finding of the jury and the sentence of the judge.\"\n\nOn another occasion, he said:\n\n\"I may here mention another case which was brought under my notice more recently. A prisoner was entirely undefended, not a palliative circumstance was adduced on his trial for murder, and he was consequently convicted and sentenced to death; but other evidence was afterwards brought forward which, in the opinion of the judge, would, if laid before the jury, have turned the scale in favor of the prisoner and shown that he was guilty of manslaughter instead of murder.\"\n\nMr. Bruce says again:\n\n\"While the law respecting murder remains as it is, and while the spectacle is so often seen of judges and juries dissenting—the one from the verdict and the other from the sentence which, in accordance with law, they are obliged to pass—there must be lodged somewhere the power of administering the prerogative of mercy.\"\n\nLord Penzance says:\n\n\"Now, independently of the cases in which the punishment of death has been commuted, it has, I believe, been the practice for many years of the Home Office to mitigate severe sentences.\"\n\nMr. Trevelyan, Irish Secretary, said:\n\n\"I am glad to have an opportunity of saying a word about the Kilmartin case. If His Excellency erred at all in that case, he erred on the right side. In the last paragraph of his letter it is stated:\n\n\"His Excellency has determined to release Kilmartin. He does so without impeaching the correctness of the original conviction, or the bona fides of Hernon; but subsequent information having created some doubt as to the identification of Kilmartin, His Excellency feels himself enabled to exercise the prerogative of mercy on Kilmartin's behalf.\"\n\nSo late as 1884, Mr. Gladstone, in a great debate to which I shall have occasion subsequently to allude; said this:\n\n\"The constitution of this country knows nothing of criminal appeal, properly so called, nothing of the retrial of cases, as was explained by the Home Secretary last night. It knows of the reference to the responsible Minister, who, surrounded by the very best advisers, and acting under the deepest sense of responsibility, is entitled to exercise the prerogative of mercy. That mode of operation you begin by excluding, because what you are asking for is not a further investigation of the question by the responsible officer of the Queen, but it is a full and public enquiry, a description to which his operation could not correspond.\"\nWhat should be the Effect of a Recommendation to Mercy?\n\nI think I have sufficiently established the accuracy of my statement, and enlarged even my own statement by these proofs of the extensive powers and consequential duties of the Executive in exercising this branch of the administration of criminal justice, particularly in capital cases; but before I pass to the question of what should be done in cases of insanity and the specialties of those cases, I wish to make an allusion, at this point, to the effect of the recommendation to mercy. The hon. member from Ottawa, quoted a portion of a passage, which I deem it my duty to read, from Sir James Stephen's book:\n\n\"There is one other point on which the English and French systems are strongly contrasted. This is the French system of circumstances atténuantes and the English system of recommendations to mercy. The finding of circumstances atténuantes by a French jury ties the hands of the court and compels them to pass a lighter sentence than they otherwise would be entitled to pass. It gives a permanent legal effect to the first impressions of seven out of twelve altogether irresponsible persons upon the most delicate of all questions connected with the administration of justice—the amount of punishment which, having regard to its moral enormity and also to its political and social danger, ought to be awarded to a given offence. These are I think matters which require mature and deliberate considerations by the persons best qualified by their position and their previous training to decide upon them. In all cases not capital the discretion is by our law vested in the judges. In capital cases it is practically vested in the Secretary for the Home Department advised by the judge, and inasmuch as such questions always attract great public interest and attention and are often widely discussed by the press, there is little fear that full justice will not be done. To put such a power into the hands of seven jurymen to be exercised irrevocably upon a first impression is not only to deprive the public of any opportunity to influence a decision in which it is deeply interested.\n\n\"Jurymen having given their decision disappear from public notice, their very names being unknown. A Secretary of State or a judge is known to every one, and may be made the mark of the most searching criticism, to say nothing of the political consequences which in the case of a Secretary of State may arise from mistakes in the discharge of his duty. On the other hand one English system allows the jury to exercise at least as much influence on the degree of punishment to be inflicted on those whom they may convict as they ought to have. It is true that the recommendation to mercy of an English jury has no legal effect and is no part of their verdict, but it is invariably considered with attention and is generally effective.\n\n\"In cases where the judge has a discretion as to sentence, he always makes it lighter when the jury recommend the prisoner to mercy. In capital cases, where he has no discretion, he invariably in practice informs the Home Secretary at once of the recommendation, and it is frequently, perhaps generally, followed by a commutation of the sentence. This seems to me infinitely preferable to the system of circumstances atténuantes. Though the impression of a jury ought always to be respectfully considered, it is often founded on mistaken grounds, and is sometimes a compromise. It is usual to ask the reason of the recommendation, and I have known at least one case in which this was followed first by silence and then by withdrawal of their commendation. I have also known cases in which the judge said: 'Gentlemen, you would hardly have recommended this man to mercy if you had known as I do that he has been repeatedly convicted of similar offences.' There are also cases in which the recommendation is obviously founded on a doubt of the prisoner's guilt, and in such cases I have known the judge tell the jury that they ought to reconsider the matter, and either acquit or convict simply, the prisoner being entitled to an acquittal if the doubt seems to the jury reasonable. This will often lead to an acquittal.\"\n\nThen I refer to two cases in which Home Secretaries have expressed their views on the subject. In the case of the convict Wager, Mr. Walpole said:\n\n\"His first impression was that it was a case of such barbarity and cruelty that it was proper that the law should take its course. On the other hand, he found that the jury recommended the criminal to mercy. Moreover, he felt that in this, as in all similar cases, it was his duty to appeal to the judge who tried the criminal, and he did so without intimating any opinion one way or the other. The learned judge had twice favored him with his opinion, and he would read a portion of the report. It was as follows:\"\n\"The murder was not premeditated, and I do not think when he commenced the pursuit of his wife he intended that act of violence which he afterwards made use of. I am, therefore of the opinion that the case is not an unfit one for the exercise of the prerogative of mercy.\n\n\"After the recommendation of the jury, expressed not only at the time when the verdict was given, but since conveyed to him in stronger language than the original recommendation was couched in; and after the deliberate opinion of the judge that the case was, in his opinion, not unfit for the exercise of the prerogative of mercy, he did not think that he could have taken any other course than the one he had adopted, and the sentence was commuted to penal servitude for life.\"\n\nIn another case, the case of John Toomer, the same Home Secretary said:\n\n\"Perhaps, upon this point, I shall not transgress my duty by saying that from the very beginning I thought the punishment to which Toomer was sentenced was so severe that it ought not to stand. I never had the slightest hesitation upon that point, but that question has never been brought before me. The reason why I thought the punishment ought not to stand was, because I felt that the jury's recommendation to mercy, founded probably upon some indiscretion of the prosecutrix, should have been attended to.\"\n\nNow, I ventured to observe, on the only occasion on which I have spoken in public on this case until to-day, that it was a matter of regret that the jury were not asked to state what their reason was for the recommendation—I do not mean by the Executive, of course, but by the judge at the trial, as it was fitting that he should have done. We had some public information given to us from a source which I suppose hon. gentlemen will not challenge as distinctly unfriendly to them, or as being biased in any way against them.\n\nMeaning of the Riel Jury's Recommendation.\n\nAt the time of the trial, the Mail correspondent at that trial telegraphed to the Mail newspaper as follows:\n\n\"REGINA, N.W.T., 3rd August—Three of the jurors in Riel's case tell me that the meaning of the recommendation to mercy is that in their opinion Riel should not be hanged, as they think that, while he is not absolutely insane in the ordinary accepted meaning of the word, he is a very decided 'crank.' The other three jurors I have not been able to see, but this is their view also. Most of the witnesses for the Crown admitted on cross-examination that Riel, in their estimation, was 'not all there'; and this, with the testimony of the experts, and that of Rev. Father André, of Prince Albert, who fought with might and main against Riel during the agitation which culminated in the rebellion, produced a profound impression upon the minds of the jury. Lastly, the jury saw and heard the prisoner in the box.\"\n\nThat was the only information which, at the time I spoke, I had as to the meaning of the recommendation. A gentleman residing in the North-West, with whom I had no acquaintance, wrote to me, stating that he had seen the statement made that it was not known what the meaning of the recommendation was, and he enclosed to me a letter addressed to himself from one of the jury, which I think it necessary to give to the House as the only information I have had since on the subject, given to me without any solicitation on my part, and simply coming in the way I have stated. That letter is as follows:\n\n\"My Dear Sir,—In answer to your enquiries regarding our verdict, &c., in the Riel trial, I would say that as a friend I have no objections whatever to giving you our reasons for recommending the prisoner to the mercy of the Crown, but I would ask you as a favor not to make public my name or residence.\n\n\"The judge, in his charge, told us distinctly that we must take into consideration these two points, the prisoner's implication in the rebellion and the state of his mind at the time. He said: 'If you are perfectly satisfied in your own mind that the prisoner was implicated in the rebellion, directly or indirectly, and at the same time able to distinguish between right and wrong, you must bring him in guilty; if, on the other hand, you find him implicated in the rebellion, but of an unsound mind, you must bring him in not guilty, and state, on account of his insanity.' This was the purport of the charge, although by no means the whole of it.\n\n\"After we had retired to consider the verdict, our foreman asked each and every one...\"\nties of investigating the cases of the exercise of the prerogative of mercy for several years past, opportunities not vouchsafed to other hon. gentlemen, had extended his inquiries and had gone into those cases in which the recommendation to mercy was effectual, instead of confining himself to those in which it was ineffectual, I think he would have given us an array of facts more important and more satisfactory than the representation of only one side which he has given us. The question is in what cases, and in what classes of cases the recommendation has been made, and what degree of weight has been given to it.\n\nProper Exercise of Prerogative in Cases of Insanity.\n\nI turn to the question, so far as it may be illustrated by authority, of the exercise of mercy in those cases in which the defence of insanity arises, and upon that subject, no less a learned judge than Lord Cranworth was examined by the Capital Punishment Commission, in 1865, and the Attorney-General for Ireland put to him this statement:\n\n\"I happen to know a recent case where a man was tried, and the defence was insanity—incapacity to judge of his actions. The jury convicted this man; not believing that he was insane. The Executive subsequently received information from various doctors who had not been produced, showing that the man really was insane, and in that case the prerogative of mercy was exercised, the man being retained in prison.\"\n\nAnd the answer was:\n\n\"That would be the reasonable mode of dealing with him.\"\n\nSo you see that where the question of insanity was raised at the trial, and where the jury decided against it, and where the Executive, upon the evidence given at the trial and before them, did not think they were wrong—and where of course the judge was not dissatisfied with the verdict either—yet where subsequent medical testimony was brought forward it was acted upon by the Executive and they commuted upon the score of the subsequent medical testimony, and there-\nfore they received it. Now then, on the Bill to abolish capital punishment in 1869, the Home Secretary, Bruce, said:\n\n\"One of the first cases he had to adjudicate upon was that of the convict Bisgrove, the circumstances of the murder being such as in themselves to excite suspicion of insanity. No evidence was adduced before the court as to the previous life of this unhappy man; but after sentence had been passed the conscience of the neighborhood was aroused, and information was given which led to the discovery of what the facts really were viz., that for three years he had been subject to fits of epilepsy, and while quite peaceable at other times, under the influence of these he was dangerous, so much so that he had been dismissed from one employment. With a knowledge of these facts, it was impossible to allow the sentence of death to be carried out, and the result of two medical examinations since instituted at different places, and conducted by most competent persons, established that the prisoner was actually insane.\"\n\nSo you see subsequent evidence of the facts was received by the Executive and upon that subsequent evidence they started separate medical examinations, conducted at different places, to test the condition. Their report was accepted, and upon it the prisoner's sentence was commuted. Then Mr. Gilpin said, in the same debate:\n\n\"The Home Secretary himself stated, only a few weeks ago, that at the last spring assizes two persons were sentenced to death who were entirely innocent. Mr. Bruce, Home Secretary said, the one was innocent and the other insane.\"\n\nSo that an innocent person had been sentenced to death, but his sentence had been afterwards commuted on the ground that he was insane. Then Mr. Bruce, in 1870, in the case of Jacob Spinasa, said:\n\n\"A murder was committed, for which no motive could be assigned, by a person who was apparently laboring under some temporary and violent hallucination. The judge and jury, however, thought there was not sufficient evidence of this state of mind, and therefore they treated the prisoner as a man who had committed a murder, with a full knowledge of what he was doing. After the trial evidence was given upon oath in Switzerland by a surgeon who had repeatedly attended Spinasa while he was in militia regiment, and who had seen him in a state of hallucination similar to that described at the trial, and accompanied by acts of violence, of which he was unconscious. Then it was proved that persons in a German hospital in London had seen him under similar circumstances.\"\n\nThus the sentence was commuted on the score of these subsequent enquiries in a case in which proof of hallucination had been given at a trial, after which proof both judge and jury agreed that the prisoner was, within the law, responsible and properly convicted. Then, on the motion by Lord Penzance, the Lord Chancellor, speaking of the character of the enquiries which were made by the Home Secretary, said this:\n\n\"In particular cases other matters are inquired into, but those cases are extremely few. In some of them the delicate and difficult question of the state of the criminal's mind is raised, in which experience proves there is obviously a large margin for difference of opinion; but this would not be improved by requiring all evidence to be on oath, for on matters of opinion there will always be great variety of opinion, and the oath will be no security, because a man giving his opinion may honestly swear that he believes so and so. Certificates, therefore, are just as valuable whether they are on oath or not; and the only other evidence is that occasionally given by friends and relatives, as to the convict's state of mind at former periods—matters which are not of such difficult solution as may at first appear.\n\nAt present the functionary to whom this duty is confided, having ample assistance, is able to consider this subject without delay. He is, moreover, a responsible Minister of the Crown, and is, therefore, accountable to Parliament for the manner in which he discharges his duties.\"\n\nThere you find the responsibility of the Government declared by the Lord Chancellor, the head of the judiciary and the legal official of the Government, who explains what is done in criminal cases where a man has been convicted and sentenced; and a question exists as to the state of his mind. You find that an inquiry is made, that medical opinions are taken, and evidence is taken as to the facts from which conclusions are to be drawn. Then the Royal Commission on Indictable-\nOffences in 1878, composed as I said before, of Judges Blackburn, Barry, Lush and Stephen, said:\n\n\"It must be borne in mind, that although insanity is a defence which is applicable to any criminal charge, it is most frequently put forward in trials for murder, and for this offence the law—and we think wisely—awards upon conviction a fixed punishment which the judge has no power to mitigate. In the case of any other offence, if it should appear that the offender was afflicted with some unsoundness of mind, but not to such a degree as to render him irresponsible—in other words where the criminal element predominates, though mixed in a greater or less degree with the insane element—the judge can apportion the punishment to the degree of criminality, making allowance for the weakened or disordered intellect. But in a case of murder this can only be done by an appeal to the Executive—and we are of opinion that this difficulty cannot be successfully avoided by any definition of insanity which would be both safe and practicable, and that many cases must occur which cannot be satisfactorily dealt with otherwise than by such an appeal.\"\n\nNow this is stated at a late day by men of the highest authority, having had the advantage of the evidence of many learned men engaged in the actual administration of the criminal law, declaring the theory and practice of that administration in cases in which there is a weak or disordered intellect, though not so weak or disordered as to justify a verdict of not guilty on the ground of insanity; and in language in which I would only weaken by attempting to restate the argument, they point out\n\nWhat common sense and common humanity approve,\n\nthat a weak and disordered intellect, although there may be enough to leave a man responsible, leaves him not responsible to the same degree as to the severity of punishment, as if he were of perfectly sound mind; and that while in all other cases by the law the precise sentence proper to be awarded as proportioned to the moral guilt and to the palliative circumstances, is fixed by the judge, in the particular case in which the sentence is that of death, that duty is discharged by the Executive. Sir James Stephen, in his book to which I have so frequently alluded, alluding to the provision for recording sentences which as I have said had the effect of a reprieve, says:\n\n\"I remember a case in which Mr. Justice Wightman ordered sentence of death to be recorded upon a conviction for murder. The prisoner, though not quite mad enough to be acquitted, was obviously too mad to be hanged. I have met with cases in which I wished I had a similar power.\"\n\nMr. Stephen in the same book says:\n\n\"These considerations appear to me to show that murder, however accurately defined, must always admit of degrees of guilt, and it seems to me to follow that some discretion in regard to punishment ought to be provided in this and in nearly every other case. This discretion does in fact exist at present and is exercised by the Home Secretary, though on every conviction of murder sentence of death is passed by the judge.\"\n\nThen he gives cases affecting the guilt of such an offence:\n\n(1.) Absence of positive intention to kill, &c.\n\n(2.) Provocation, &c.\n\n(3.) There are many cases in which a man's mind is more or less affected by disease, but in which it cannot be said that he is entitled to be altogether acquitted on the ground of insanity.\"\n\nAnd then he gives a long series of other cases, the precise case to which I allude, being number three, proving demonstratively that this case was recognised by our law, which else would be a barbarous and inhuman law, and that it justifies the principle of dealing with the case according to the circumstances. Then Lord Penzance, during a debate in the House of Lords in 1870, said:\n\n\"Well, the Home Secretary does as much as any man can do, under the circumstances. He makes his inquiry. It very often happens that the crime is one which depends on scientific evidence, as in the case of poisoning and then he has often a very delicate task. In other cases new and additional facts are alleged; but there are no authorised sources of information. I believe, indeed, that he sometimes sends down persons to make inquiries on the spot.\"\nThen Sir James Stephen in his book, speaking as to the doubts thrown on the justice of a verdict, or the accuracy of the evidence, and the course of the Home Secretary in Smethurst's case says:\n\n\"Sir George Lewis, Home Secretary, states: I have come to the conclusion that there is sufficient doubt of the prisoner's guilt to render it my duty to advise the grant of a free pardon.\n\nThe necessity which I have felt for advising Her Majesty to grant a free pardon in this case has not, as it appears to me, arisen from any defect in the constitution or proceedings of our criminal tribunals; it has arisen from the imperfections of medical science, and from fallibility of the judgment in an obscure malady, even of skilful and experienced practitioners.\"\n\nI am unable to deal with some of the cases in our own country as fully as the hon. member for Ottawa (Mr. Mackintosh) but I observe a report in the Mail newspaper of\n\nA trial that took place in October, 1882, at Napanee.\n\nOne Lee was tried for murder and the defence was insanity. The medical evidence was conflicting. One doctor proved that he had examined the prisoner and he was—in his opinion insane, and insanity was not feigned. Another doctor was called and said he had come to the same conclusion. The gaol surgeon thought the examination disclosed delusions, and he saw indications of insanity. Another doctor thought the prisoner was acting a part and knew quite well that he was doing. The judge charged that the evidence showed that his mind was, perhaps not very strong, although some years ago he had labored under delusions. At and about the date of the crime. Persons who were in frequent intercourse with him discovered nothing to lead them to suppose him of unsound mind. A person taking revenge is not acting under delusion; he is doing it with some degree of knowledge of the difference between right and wrong. There was a verdict of guilty rendered, and there is no report of a recommendation for mercy. The judge in passing sentence said that after hearing all the evidence he was quite of opinion that at the time the prisoner committed the crime he knew what he was doing and was perfectly accountable for his action. He was sentenced to death. That sentence was commuted. It was commuted by hon. gentlemen opposite. I am not able to speak with authority as to the circumstances of the commutation; and I state simply that I received a letter on the case this morning, and therefore too late to enable me to apply to the hon. gentleman, as I otherwise would have done, to bring down the papers, but I now make the application. The letter is written by a respectable person who ought to know and who professes to know as to the circumstances which preceded that commutation. But before I refer further to that letter, I should like to give the reporter's account of the prisoner as published in the Mail:\n\n\"The prisoner whose appearance is not such as to give the unprofessional eye much, if any, indication of insanity has watched apparently with much interest throughout. He seemed to understand about what evidence each witness called would give, and it could be noticed as some of the more important ones came to the stand that he placed himself in an attitude of close attention as if to catch every word said. He did not at any time display indifference, and toward the close though showing signs of weariness seemed to take, if possible, more interest than at first and to be in a measure impressed with a sense of his peril. In this respect there was a visible change in his countenance after he heard the address of the Crown counsel and the judge's charge, and a very marked one when the verdict was rendered.\"\n\nThe information communicated to me by letter this morning is as follows: When the trial of Michael Lee for murder took place at Napanee some time ago, Dr. Metcalf, of Rockwood, Dr. Clark, of Toronto, Dr. Lavell, of Kingston, examined him. Drs. Metcalf and Clark pronounced him insane; Dr. Lavell pronounced him perfectly sane. His sentence was commuted and he was sent to the penitentiary, were he was transferred to the criminal insane ward as insanity became marked. Whether he still remains there or not, I do not know. I\nknow, having had some reason to learn, that a very great number of those whose minds are disordered are kept, and perhaps not unwisely so, out of the insane ward and mix with the other prisoners. That is the statement given to me; and I think, considering the circumstances and the names I have given, it would have been fortunate if the hon. gentleman for Ottawa had so far perfected his investigation as to be able to state all the facts respecting the case of Lee.\n\nSummary of what has now been provided.\n\nI think it is established beyond all contradiction that the practice accords with reason, that a disordered condition of the intellect, which in the view rightly or wrongly of the law is not sufficiently disordered to entitle the prisoner to immunity from crime, is yet regarded in dealing with the quantity of punishment awarded; that in all other cases than the capital cases that regard is paid by the judge, and in the capital cases it is to be paid by the Executive, whose duty is, not as a matter of clemency or mercy simply, but as part of the administration of criminal justice, as part of that justice which we declare in our Statute Books we seek to accomplish by the apportionment of the punishment to the moral guilt, to have regard to what surely must be an element of the moral guilt, the degree of the disordered intellect, the degree of the insane impulses, of the insane delusions of the unbalanced mind. Even although this degree may be not enough to entitle him to acquittal, though the verdict may be right and the judge's sentence under the law may be right, there is not a mere discretion but a sacred, solemn and imperative duty to have regard to the circumstances disclosed on the trial, and all other circumstances which may be made known, and if upon the whole of the circumstances, you find, as was said by Mr. Justice Stephen, that the man was not mad enough to be acquitted but too mad to be hanged, you cannot shelter yourself under the proposition that it was your duty to carry out the sentence of the law, and that the verdict of the jury had settled all that matter. The verdict of the jury settled no more than this; the prisoner was not so completely insane as to be entitled to be absolutely acquitted on the ground of insanity. Consistently with that finding, his intellect might be seriously disordered. He might be seriously disordered mentally though not sufficiently disordered to give him immunity. Is not that question to be decided? Was that question settled by the verdict? No, it was left unsettled. It was to be settled by the Executive. Has it been settled? If not, they did not discharge their duty. If they settled it, and decided that it did not apply in this case, then I humbly say that I wholly disagree from them in opinion.\n\nThe Question of Political Offences.\n\nNow, Sir, to come to the other branch of this case, the question of political offences, that has also to be considered on the question of the award of punishment, and in this matter I am obliged to differ very much from the spirit of a good deal that has been said by hon. gentlemen opposite. The prerogative of pardon is dealt with by Mr. Amos, as applied to these cases, thus:\n\n\"There are other cases in which the faculty of granting a remission or diminution of the penalty may also properly belong to the Executive. Thus in cases of what are sometimes called 'political crimes' in which the perpetrators of them are as often as not persons of virtuous habits and tendencies, and even in some cases of a heroic spirit of self-sacrifice, it must depend entirely upon the danger to the community to be apprehended from a repetition of such particular offences whether any and what penalty should be exacted. It may not be wise to leave to the judge the supreme decision of a question more of political circumspection than of simple moral insight. The usual if not necessary rule is to leave a considerable amount of choice of penalties to the judge, but to reserve to the Executive the opportunity of entirely rebutting, or as political sagacity prompts from time to time the penalty exacted by...\"\nthe strict letter of the law. These remarks while justifying the institution of the prerogative of pardon, none the less point to the essential importance of hedging round the exercise of this prerogative with all the safeguards which a vigilant legislature and an active public opinion can devise.\"\n\nWith reference to the exercise of the prerogative in case of political offences, an instructive statement was made on the application in\n\nThe case of certain Fenian Convicts.\n\nof 1869, when Sir Frederick Heygate said:\n\n\"He would beg to ask the Chief Secretary for Ireland, whether, in the selection of those Fenian convicts now proposed to be released, the course had been adopted usual in the remission of sentences of obtaining the approval of the judges who tried each case.\n\n\"Mr. Chichester Fortescue, in reply, said, that in ordinary cases when a memorial was presented from a prisoner for a mitigation of punishment or a free pardon, that memorial was referred to the judge who tried the case. But in the present instance no such memorial had been received by the Government and the question was not considered as one respecting a mitigation of an ordinary sentence. On the contrary, it was regarded by the Government as a question to be decided by themselves and by the Lord Lieutenant of Ireland. What they did was to institute a most rigid examination into the case of each prisoner, and in conducting that examination they had the assistance of the law officers of the Crown, and more especially of the Attorney-General. The examination was conducted in every case in reference to the character of the persons and the circumstances of the case, and to all that came out of the trial. Having done that, Her Majesty's Government and the Lord Lieutenant were of opinion that it was their duty to decide the question solely on their own responsibility, and without inviting the judges to share that responsibility.\"\n\nThen, Sir there is a most interesting and instructive discussion on Mr. O'Connor Power's motion, in 1877, with reference to certain Fenian convicts, notably.\n\nThe Manchester Murderers,\n\nof whom three suffered the extreme sentence of the law, and the others sentences of imprisonment for considerable terms; and after a period, an agitation took place for a remission of these sentences. Mr. Gathorne Hardy said:\n\n\"He would admit that this question came very near the hearts of a great many of the Irish people; but they were not the Irish nation and the Irish nation was not the whole people of the empire. This was an empire and not an aggregate of separate kingdoms, and the Government had to consider the interests of the whole of this great empire. It was also a free empire. Every man who was wronged had the opportunity of bringing his wrong to light, and there was no man who suffered an injury who had not an opportunity of obtaining redress in a constitutional manner. Therefore, the man who took up arms had to vindicate himself from a charge of the deepest dye. Where there was no necessity—not even an excuse—for shedding blood, the man who raised his arm to shed blood, committed a crime; and for that crime the country had a right to demand, he would not say vengeance, but utmost punishment the law allowed. Much more when men who had taken upon themselves the character of defenders of the country, violated the oaths they had taken and conspired to destroy the country, no punishment could be inflicted upon them which they did not deserve.\"\n\nThen the Attorney-General of England, in the same debate, describing the offenses, used these words:\n\n\"When the van emerged from under a railway arch, about half-a-mile from Bellevue, a large number of persons were seen upon some vacant ground, slightly elevated above the road. They were armed with revolvers, and had evidently been waiting for the approach of the van, determined to all hazards to rescue the prisoners. It was proved afterwards that messages had been sent in order that they might be prepared. They discharged their revolvers at the policemen, stopped and surrounded the van, and some of them got on the roof and attempted to break it in by means of hammers, while others handed up large stones to aid them. Others, again, tried to break open the door. It was the duty of Sergeant Brett to guard the door. He was a brave officer, and he did his duty. He positively refused to admit the assailants. When he was in the act of closing a ventilator—which was something in the shape of a small venetian blind—for the purpose probably of preventing them from getting a hold there, one of the conspirators pointed a revolver at the aperture, and, deliberately dis-\ncharging it, shot the officer. Sergeant Brett fell in the van, the door was then broken open, and the prisoners were released. Hon. members might, if they liked, call that accidental shooting, but he (Attorney-General) called it deliberate homicide.\n\nThey might call it a technical crime; but he called it vulgar murder. They might call it a political offence; he called it deliberate and atrocious assassination. It was a deliberate planned attack, carried out by the prisoners who were afterwards convicted, regardless whether they committed murder or not, but determined to do murder rather than fail in their object.\"\n\nMr. Pease, the member I think for South Durham said:\n\n\"Well they had had a real rebellion some years ago in Ireland, headed by a gentleman who sat for many years in that House, and was highly respected by all who knew him—he alluded to Mr. Smith O'Brien. He was taken while in arms, holding a cottage some hours against the Queen's soldiers; and, in that extreme case, when the offender was actually convicted of treason, and formally sentenced to be hanged, drawn and quartered, the dread sentence was afterwards commuted to 14 years' banishment, and was afterwards again commuted, and Mr. Smith O'Brien was brought home to his country. Had any of the men whose fate was now before the House of Commons been guilty of such a great crime as Mr. Smith O'Brien? He had signed the roll of Parliament, had taken the oath of allegiance, was in the Queen's commission of the peace, and yet it was felt consistent with public safety to commute his punishment twice after he had been sentenced to death, and had been transported to mark the turpitude of his crime.\"\n\nMr. Gladstone said:\n\n\"The question which we have to determine is, what constitutes a political offence. It is quite clear that an act does not become a political offence because there was a political motive in the mind of the offender. The man who shot Mr. Percival, and the man who intended to shoot Sir Robert Peel did not become political offenders merely on this ground. By a political offence, I, at least, understand an offence committed under circumstances approaching to the character of civil war. Whenever there is a great popular movement, the offences committed in giving effect to the intentions of the people partake of the character of civil war. Reference has been made to the action of the President of the French Republic in pardoning offences committed by communists; but it must not be forgotten that the offences—though darker than the crimes for which the Irish prisoners are under punishment—were committed in the progress of a civil war. But the riot committed at Manchester, by a crowd locally gathered together, was a proceeding totally of a different character, and must be considered as in the main belonging to the category of ordinary crime, though it is not on the ground that the offence is a political offence, that I think the prisoners in question can be recommended for consideration. But if these offences be not political offences in a strict sense, yet they were undertaken for a political motive, and in so far partake of that character as to effect, in a material degree, the moral guilt of the persons concerned.\"\n\nThat was the observation made by the most eminent of Englishmen as to the ingredients of a political offence, even in a case so obviously gross and, as many of us would regard it so totally alien from the ordinary category of political offences as the case of the Manchester murder.\n\nCanadian Cases.\n\nWell, Sir, let us come to our own country. History repeats itself in a wonderful way. I remember when we brought this case first on the tapis last Session amongst other things, we enquired of the Government what they had done with certain persons who were very active, apparently in stirring up discontent, in the latter half of the year 1884, Schmidt, Dumas and others; and after a while we found out that the Government had been giving them little offices, contracts, and one thing or another, and that they had been thus either marking their sense of their worthiness or attempting to isolate them from the popular movement. And that is an old plan. I was looking a while ago into the earlier history of Lower Canada, and I found an account of what used to go on in the long agitation which culminated in the rebellion of 1837. As long before that time as I think, a quarter of a century, Governor Craig sent home Mr. Ryland as his secretary, to communicate with the Home Government with reference to the affairs of the\ncolony, which he was endeavoring to carry on with large assertions of prerogative and limited local rights; and Mr. Ryland gives an amusing account of an interview with Lord Liverpool, then Prime Minister, on the subject of agitators:\n\n\"Lord Liverpool then adverted to the particular character of the persons who edited the—\"\n\nBlank, I will say, for the moment—\n\n\"and asked whether they might not be brought over. I observed that, unfortunately, this system had hitherto been acted on in Canada, and that I considered the late proceedings of these individuals as the natural consequence of it, men of desperate fortunes with some talents, but destitute of principle, having been thereby encouraged to oppose Government for the purpose of forcing themselves into place.\"\n\nSir, the paper on which that was written was the Quebec Canadian. The Canadian still lives. Now the signatories of the response in 1837, by the committee of the county of Montreal to the Workingmen's Association of London made this representation:\n\n\"Our grievances are not of new characters or of recent date. They have been publicly and distinctly stated, and the mode and measures of redress have been plainly defined. Our citizens have at public meetings reiterated them for years past. They have founded upon them humble petitions to your Parliament, which turning a deaf ear, now adds aggression to contempt.\"\n\nThat was signed among others, by Papineau, O'Callaghan, Nelson, Duchesnois and Cartier; and then comes also something which shows us how power generally acts under circumstances like these. We remember the events—so widely differing in many particulars—of the Lower Canadian revolt. But see how power treated it in the proclamation of Sir John Colborne on the 29th of Nov. 1837:\n\n\"Whereas, in divers counties of the district of Montreal, dissatisfaction with the Government of Her Gracious Majesty Queen Victoria, has unequivocally declared itself and divers outrages upon the persons and properties of Her Majesty's loyal subjects have been recently perpetrated therein; and whereas, prisoners arrested on charge of high treason have been rescued from the hands of justice, and the troops of Her Majesty, in the lawful discharge of their duty, which aiding the civil authorities have been assailed and fired on by the hands of an armed peasantry:\n\n\"And whereas, it is notorious that the present blind and fatal excitement in that district is to be attributed to the machinations of a few evil minded and designing men, who have imposed upon the credulity of an unsuspicious peasantry, and by plausible misrepresentations and wilful calumny, by practising upon their fears and inflaming their passions, by appealing to national distinctions and exciting political prejudices, which it has been the unabated endeavor of the British Government to extinguish, have at length succeeded in implicating a part of a peaceable and loyal population in the first excess of a reckless and hopeless revolt.\"\n\nYou would almost think I was repeating a speech we heard the other day. Then, we find how power acted again in the proclamation of Lord Gosford:\n\n\"Whereas, L. J. Papineau is charged with the crime of high treason, and there is reason to believe he has fled from justice; and whereas, it is expedient and necessary for the due administration of justice and for the security of Her Majesty's Government in this province, that so great an offence should not escape unpunished:\n\n\"I do hereby require and command all subjects to discover, take and apprehend the said L. J. Papineau and carry him before a justice; and for the encouragement of all persons to be diligent, a reward of £1,000.\"\n\nA similar proclamation was issued against Wolfred Nelson, E. B. O'Callaghan, J. T. Drolet, M. P., W. H. Scott, M. P., A. Girod, T. S. Brown, C. H. O. Côté, M. P., J. J. Girouard, M. P., E. E. Rodier, M. P., and Jean O. Cherrier, offering £500 reward, and against others at the lesser price of £400. Then the ordinance of Lord Durham, who assumed to banish Wolfred Nelson, R. S. M. Bouchette, B. Viger, S. Marchessault, H. A. Gauvin, T. Goddu, R. Desrivières and L. H. Masson, to Bermuda, also provided:\n\n\"If any of them, or if L. J. Papineau, C. H. O. Côté, J. Gagnon, R. Nelson, E. B. O'Callaghan, E. E. Rodier, T. S. Brown, L. Duvernay, E. Cartier, G. E. Cartier, J. Ryan, sen., J. Ryan, Jun., L. Perrault, P. P. Dema-\nray, Jos. F. Davignon and Louis Gautier, against whom warrants for high treason have been issued, shall hereafter without permission come into the Province they shall be deemed guilty of high treason and suffer death.\n\n\"Nothing in any proclamation shall extend to the cases of certain named persons, or if any other person charged with the murder of Lieut. Weir, or with the murder of the late J. Chartrand, and they shall derive no advantage from such proclamations.\"\n\nThe case of these persons was raised in the English House, and Lord John Russell says:\n\n\"The Government has not neglected to let Sir J. Colborne know its opinion of the inexpediency of inflicting capital punishment on occasions of this nature.\"\n\nSir Robert Peel argued that an exception should be made in the case of the murderers of Lieut. Weir. As soon after as 1841, the following resolution was passed in the House of Assembly by a vote of 39 to 9:\n\n\"Resolved, That it is the opinion of this committee, that an humble Address be presented to His Excellency the Governor-General, as representing the Crown in this Province, praying for the exercise of the royal prerogative for granting a free pardon, indemnity and oblivion, of all crimes, offences and misdemeanors, connected with the late unhappy troubles in the late Provinces of Upper and Lower Canada, to such of Her Majesty's misguided subjects, in so far as may be compatible with the safety of the Crown and the security of the Province, and of all attainders and outlawries during the period of four years.\"\n\nIn 1842, Mr. Lafontaine proposed to Sir Charles Bagot an amnesty, to which he agreed for all except Papineau. Mr. Lafontaine declined, and threatened to resign. The Government yielded, and a nolle prosequi was ordered as to Papineau whereon he was able to return, as he did in 1845. It is unnecessary, Sir, for me to refer to the Upper Canadian rebellion, in respect of which, one might almost go through a similar history. I have gone so far, in order to show the language which is used in events of this description, while they are going on, as contrasted with the language used a few years afterwards, as illustrating the view taken when passions have subsided and the mists of prejudice have disappeared. It is to that view that the Executive should look in their determination of cases of this description; it is not the view of the moment; it is the view of the future they should look to.\n\nCases in the Fenian Invasion of Canada.\n\nThen I turn to another case of a more recent date—the case of the Fenian invasions of Canada. These Fenian invasions harassed us for a number of years. On the 9th of March, 1866, Lord Monck reports to the Secretary of the Colonies:\n\n\"These reports, taken in connection with the open avowals at their public meetings, held in the United States, of the leaders of a portion of the Fenian Society, that it was their intention to attack this Province, had induced a feeling of great uneasiness and insecurity amongst the people. It will be satisfactory to you to learn that the order calling out the force was issued by telegraph from headquarters and the different stations, late in the afternoon of Wednesday, the 7th instant, and that by noon on Thursday, the 8th, answers had been received showing that at that time about 8,000 men were mustered and prepared to move on any points where they might be required.\"\n\nWell, the advance did not come at that time. On the 4th June, 1866, Lord Monck says:\n\n\"The body of Fenian conspirators who crossed the frontier from Buffalo to Fort Erie, on the morning of Friday, 1st June, proved to be between 800 and 900 men, and seemed to have been well armed. Immediately on the receipt of the intelligence of the invasion, Major General Napier pushed on by rail to Chippewa, a force consisting of artillery and regular troops, under Col. Peacocke, 16th Regiment. They came upon the Fenians encamped in a bush, and immediately attacked them, but were outnumbered and compelled to retire to Port Colborne. This occurred some time on Saturday, 2nd June. We have 65 prisoners in our possession, who have been, by my direction, committed to the common gaol, at Toronto, to await trial.\"\n\nOn the 8th June, 1866, Lord Monck writes thus:\n\"Immediately after the first news of the invasion reached me the whole volunteer force of the province was placed on active duty.\n\n\"I am sure I do not exaggerate when I say that within twenty-four hours after the issue of the order 20,000 men were under arms and that within forty-eight hours after the same time they, in combination with the regular troops, were disposed, by the Lieutenant General commanding, in positions which rendered the Province secure from attack.\n\n\"With the assistance of the officers and men of the ships of war now in the St. Lawrence, a flotilla of steamers has been chartered by the Provincial Government, and fitted up as temporary gunboats for service, both on the river St Lawrence and the lakes.\n\n\"Parliament is to assemble this day, and it is intended at once to suspend the Habeas Corpus Act and to extend to Lower Canada the Act at present in operation in Upper Canada (Consolidated Statutes Upper Canada, chap. 99), providing for the trial by military courts martial of the prisoners.\"\n\nThen on the 29th May, 1869, Sir George Cartier and Hon. Wm. McDougall, presenting the claims of Canada with regard to the Fenian invasion, made the following report to His Excellency Sir John Young, Governor-General:\n\n\"The undersigned * * * * deemed it their duty to represent on behalf of the Government of Canada to the Right Hon. the Secretary of State for the Colonies, Earl Granville, that the Dominion of Canada, and the Provinces comprised in it had expended several millions of dollars in resisting the attacks of the so-called Fenians. That such invasion did take place, and that several of Her Majesty's subjects lost their lives in repelling their murderous attacks, and a large amount of property was destroyed; and heavy losses and damages were sustained by several of Her Majesty's subjects.\"\n\n\"GEO. E. CARTIER,\n\"WM. McDOUGALL.\"\n\nThe report of the Privy Council, 2nd June, 1870, calls the Fenian invaders \"Bri gands.\" The despatch of Lord Granville expressly calls them \"A body of conspirators\" and declares that \"It is not often in the history of civilised nations that a country has suffered from an attack so gratuitous and unjustifiable.\" The report of the Privy Council on 1st July, 1870, speaks of the Fenians as \"The miscreants concerned in these outrages.\" The report of the Privy Council, 28th July, 1871, states that:\n\n\"The Fenian organization has for nearly seven years been a source of irritation and expense to the people of Canada.\"\n\nThe memorandum of the Privy Council of 1871, declares that one of the principal objects of the organization created in November, 1863, has been \"the conquest of Canada against the people of which it is not pretended it has had any cause of complaint. The report of the Privy Council, of November, 1871, says of the expeditions:\n\n\"These plundering and murdering expeditions were promptly repulsed, but not without the loss of valuable lives and great injury to the country.\"\n\nSo much with reference to the view that high political authorities took of the character of those expeditions. Listen also to the language of Judge J. Wilson in passing sentence on R. B. Lynch found guilty without any recommendation to mercy:\n\n\"You and those who were with you profess to have come here to redress the grievances of many centuries and to right the wrongs of an oppressed people. You allege that the iron heel of the Saxons was placed on the neck of the Celt hundreds of years ago, and that your object was to free your land from that oppression. If you had reflected you would have seen that you began to do this by attempting to inflict on us the very injuries under which you contemplated your native land as suffering. Why should your iron heel be placed on our necks? In what way did we hurt you that you should endeavor to do this grievous harm, and why should our homes be made desolate, our young men slain, and our farms pillaged by you? Will any man of sense answer these plain questions? Was it anything less than murder, was there any possible excuse for you to come here in the dead of night to kill our people, to ravage our homes, and to lay waste our farms and habitations, in order, as you say, to relieve the conditions of Ireland? What right had you, or who could have authorized any man to commit such a wrong as you perpetrated upon us? It is putting the matter in a very plain and clear light, just such a light\nas you must have perceived it in, if you had thought for a moment before going with this mad and wicked enterprise. You stand there surrounded by the friends and relations of the men you slew on that occasion.\n\nYou cannot be surprised that the law should be enforced, and that you should suffer its dread penalty, as I am very much afraid you will; for how could we permit the young unreflecting men who were brought here by you and others like you, who placed confidence in you, who put faith in what you said; how I say could we in justice punish them if we allowed you, the greater criminal, to escape.\"\n\nAnd after that sentence and under those circumstances, that sentence was not executed. The prisoner's sentence was commuted, not even for life, but for twenty years' imprisonment and as far as my knowledge goes he was pardoned not very long after the sentence was given. That was the case of a person who never had any pretension of being a Canadian citizen, who never had any pretense of having a grievance against Canada, and who cost us so much in time, money, anxiety and life. That indicates that the modern doctrine, as applied by ourselves in this case, is a doctrine which practically excludes from almost any conceivable case of a political offence a capital sentence.\n\nThe Half-breed Rebellion.\n\nNow I turn to this case in hand, and I say that some language has been used before and in the course of this debate, which I, for my part, cannot approve of, language which seems to ignore as non-existent the right of resistance. I think here, and I have never disguised my opinion, that the half-breeds should not have risen, and that in that sense the rebellion was not justifiable, but the position which was taken by the Minister of Militia at Winnipeg, and the position he took the other evening, and the position which other hon. gentlemen have taken in this debate, upon the general question, seems to me to be at variance with our understood constitutional rights in the larger sense. Always there is legal, but only generally is there moral guilt in a rising; always legally, generally morally, is there guilt, but not always morally. I cannot approve of the spirit of those observations. God forbid that we Canadians should forget for a moment that the corner stone of our liberty is the sacred right of resistance. Some, through their blind zeal, do forget this. They forget that the sacred right of resistance was exemplified in the events which preceded the great charter, and is enshrined in that instrument itself; they forget that the pious and immortal memory of William is the memory of an intruder who rose to the throne through the people's resistance to their king; they forget that the battle of the Boyne was the triumph of the insurgents over the monarchy; they forget that the glorious revolution was the consecration of the right to resist, and that the present settlement of the British Crown is the visible embodiment of that right. Let me read you just two passages on that point to show that I am not extreme in these views. Amos says:\n\n\"But, as now, resisting tests were inconsistent with the revolution which was founded upon resistance, those of the acts of uniformity and militia were abolished at that epoch; and the non-resisting test in the Corporation Act was expunged from our statute book at the accession of the House of Brunswick.\n\nThus there is no longer any obligation of conscience binding one soul in secular chains to regard the royal dignity merely as a descendible property, instead of viewing it as a trust for millions, subject to a right of resistance when rendered indispensably necessary by the salus populi.\"\n\nAnd take Brougham's Political Philosophy:\n\n\"The national resistance was not only in point of historical fact the cause of the revolutionary settlement; it was the main foundation of that settlement. The structure of the Government was made to rest upon the people's right of resistance as upon its corner stone, and it is of incalculable importance that this never should be lost sight of; but it is of equal importance that we should bear in mind how essential to the preservation of the constitution, thus established and secured, this principle of resistance is; how necessary both for the Governors and the governed it ever must be to regard this...\"\nrecourse to that extremity as always possible—an extremity no doubt, and to be cautiously embraced as such; but still an extremity within the people's reach, a protection to which they can and will resort as often as their rulers make such a recourse necessary for self-defence.\"\n\nI say I cannot, as a Liberal, permit sentiments which appear to me to be sentiments of retrogression to the ages of absolute government, sentiments which from time to time in the best eras of English liberty, have been repudiated, to pass without saying what I feel of the sacred right of resistance; and I think it came with a very ill grace from the hon. the Minister of Militia to throw taunts at this side of the House upon that subject and to accuse us in effect of having stimulated by our views feelings of this description when he ought to have remembered that the Minister of the Interior under whose reign this rebellion broke out was the very gentleman who in 1849, signed the annexation manifesto declaring that it was the object and intent of the signatories to agitate, peacefully of course, for—and they set that up as their object—separation from England and annexation to the States. According to the high flown views of loyalty which hon. gentlemen opposite utter that would have been a treasonable act, I do not say it was a treasonable act. I shall not inquire into its motives and shall not ask how it was that the high-flying Tories suddenly turned round and advocated annexation. I believe there was a great deal to be said against the action of dismissing those who signed that statement from the militia; but for a gentleman who had for his colleague a Minister of the Interior who signed that declaration, and set that great example to the half-breeds, to give us the high-toned notions which he expressed, was, I thought, a little out of place. Now, having said this as to the abstract right of resistance, I think it is important that we should remember also that the more representative and popular is our form of Government, the rarer are the occasions upon which resistance is necessary or justifiable for the redress of grievances; and, if, as stated in our Canadian charter, in that Colonial Secretary's despatch upon which our rights were chiefly dependent for so many years, if, the spirit of our charter is observed, and so long as the Government is administered according to the well understood wishes of the people, there will be no grievances to redress, and consequently there will be no cause for agitation, moderate or extreme, resistant or otherwise; and on the other hand, if the Government is not administered according to the views of the people, this Parliament is the field of battle, and we members of Parliament and representatives of the people are the army, and it is in this peaceful way that our contests are conducted and our grievances are redressed, and that government according to the well understood wishes of the people is eventually obtained.\n\nWhen right of Resistance may be Excusably Exercised.\n\nWe must remember as well, that whatever the form of Government may be, whether you have a parliamentary form of government or not, there are two other conditions which are essential to the moral justification of the exercise of the right of resistance; first, that the grievances must be serious, must have been long endured, patiently represented, all peaceful means used and exhausted, so that there seems to be no hope of amendment by other means; and, secondly, that there may be some reasonable hope of success by this, the last resort, net indeed without loss to those engaged, but of important practical results. Now in the case before us, unfortunately, so far the unhappy persons who rose are concerned, our constitution was lame and imperfect. There was no representation in Parliament for them, and therefore we had not that safety-valve, that opportunity, that means of averting difficulties which a representative Government, applied to every part of the general body of the people, gives. My own opinion is that, if at an earlier date that representative government had been accorded, that the circumstance would have\nprevented this rising. My opinion is, that if there had been a representative from the North-West, knowing what Mr. McDowell knew, what Mr. Lawrence Clarke knew, what the other persons who have made representations, some of which are before us, knew, a representative here in Parliament, speaking on the floor of this House the sense of his people, telling us what their difficulties were, calling for the papers, showing the grounds of their grievances and pointing out their neglect by the Government, each Session pointing out to the Government and to the House their remissness and declaring the growing condition of discontent and difficulty, the Government would have been stimulated to action, and that which ought to have been done would have been done, if not as early as it ought to have been done, yet early enough to avoid the frightful results which have given rise to this debate. The absence of that guide and safety-valve, of course at once increased the responsibility of an autocratic and paternal Government such as ours was in reference to the North-West; a paternal Government which refused this assistance; and it also operated, more or less, in as much as they had not provided for them the representative machinery to diminish the moral guilt of the people. But, with regard to the other aspects and conditions to which I have referred, I have already said that, while I condemn as in the highest degree censurable the conduct of the Government, I myself have not been able to agree that this rising was justified, that the conditions remove, although they may, and in my opinion do, lighten the stain of moral guilt; and therefore the case had to be dealt with on the question of punishment, and by the Executive under their responsibility to us.\n\nUnhappily it was impossible in this case for the Government to judge this question fairly. They had precluded themselves from that position. They had made this their own issue. They had declared that to admit the existence of grievances as a justification or a palliation for the insurgents, would be their own condem-\n\nnation, and they, therefore, had declared that that death, which would be the indication that the extreme rigor of the law was the appropriate punishment, that death on the scaffold was needful, in order to avert their own death here, and thus they had become disqualified for sound judgment.\n\nAn hon. MEMBER. That is your opinion?\n\nMr. BLAKE. That is my opinion. In this connection I desire to say a word, and a word only, with reference to a charge highly calculated, if true, to increase the guilt, so far as he was morally responsible, of Riel. I refer to\n\nThe charge of venality.\n\nI have already read that portion of the evidence of Nolin which shows the purpose to which this man stated he would apply the money which he was about to get from the Government—that he would apply it in starting a newspaper and in raising other nationalities in the States, and in effecting the prosecution of his designs. I say that however plainly that may appear to be a violent, a wicked, or a mad sentiment, it is utterly inconsistent with the charge of venality; it shows that this was the mode which, in his disordered mind, he thought would be most efficacious in order to accomplish the design for his people and for himself, as part of his people, which he entertained. But the very circumstance that he made that statement to Nolin to my mind proves that it is impossible that he could have made the proposal for a venal purpose. I know perfectly the prejudices which exist. I know how many men would like to ease their consciences by saying: Oh, this was a base, and venal man. But it would be an act of humiliating cowardice on the part of one who has formed another conclusion on this subject, to bend to such prejudices, and to allow a name which must ever be deeply clouded and stained, to receive another cloud or stain which he, at any rate, in my judgment, does not deserve. But I will add to this, that I had expected to hear now from an hon. gentleman who was\nvery intimately associated with Louis Riel, who worked together with Louis Riel in the North West, his appreciation of that portion of the case. I have been told a story—I was told it by one who knew—on this subject. When the first intelligence came, that he had asked the Government for money, that he was going to sell the cause: \"Well,\" I said, \"this is a most extraordinary thing; it entirely alters the whole complexion of the case.\" \"Oh, do not believe it,\" said the gentleman who knew. \"Well,\" I said, \"I have every reason to believe that he asked for the money.\" \"Yes, that is quite possible, he is quite convinced he has a claim, but depend upon it, I know that it is impossible that he can have asked for money to deceive or to betray his people, or that he would betray their cause. I know all the events which occurred when he was in the Provincial Government. I do know that at the time when he was in power there in 1869-70, when he had the resources of the Hudson Bay Company at his command, his own family was in a state of destitution, living down at their place, and he would not allow any portion of what he called public property to be sent to them at all, even to keep them in life, and that same provisional council was obliged secretly to send down a bag of flour or something of that kind to his mother, who had the charge of the family, in order to keep them alive.\"\n\nAn hon. MEMBER. Too thin.\n\nMr. BLAKE. Somebody says that is too thin. I refer the hon. gentleman to the hon. member for Provencher (Mr. Royal) on that subject.\n\nIncitement to Indians.\n\nNow, Sir, with reference to the question of the Indian warfare. I think that if there was one thing above another that nerved us the very instant we heard of this rising, to press on the Administration in every way we could, to take all the steps which they with their greater knowledge of the conditions up there might themselves deem necessary, and not to make a single suggestion that they were doing too much, it was the possibility of an Indian rising; the thought which immediately engaged us all was that there could not be a rising created by Riel and the half-breeds without imminent danger of an Indian rising, and that in the condition of the country we owed it to ourselves and to our humanity, to the isolated settlers all through that country to take very large steps, to make very great preparations that if possible, we might anticipate, at any rate minimise, the terrible results that might flow from that rising. No man felt, no man feels, more strongly than myself, the dangers, the difficulties, and the probabilities of an Indian warfare, and therefore I am quite prepared to agree that if you are dealing with a man of perfectly sound intellect, this would be very important as importing a very much deeper dye to the crime he was committing. But, Sir, I may say that I do not think that hon. gentlemen are entitled to rest the whole burden of this case upon that fact. In the first place we are to remember that the man himself was a half-breed, that he was partly of Indian blood, that those who were with him were half-breeds, that it was natural, in fact, in view of so large a part of their, through not of his, training, that that warfare should be adopted. In the second place, we can hardly hold our heads high with reference to this question of Indian warfare. Why, you remember the great fight between Wolfe and Montcalm at Quebec, and you remember the monument which celebrates that event, and in which their names are joined. But Montcalm had amongst his forces a thousand Indian warriors, and an Indian warfare was going on in connection with these events. In the other part of the Province at the very same time the English were using the Indians in warfare; the Americans had used them in warfare. Why Sir, it is but a few years ago that at the instance of my hon. friend from Brant, we voted $5,000 towards a monument to Joseph Brant. I suppose we all know something of the history of Joseph Brant, and what a remarkable man he was. But to the end of his life\nJoseph Brant defended, with all his enlightened Christian views, the Indian system of warfare as, for their circumstances and under their circumstances, proper and necessary, barring the question of torture, as to which, I am glad to say, he took an entirely different view, as many remarkable persons among the Indians have done, from the ordinary line. So with reference to Tecumseh, a name, perhaps, hardly inferior to that of Joseph Brant. So, that while we honor and refer to those persons, we cannot altogether forget this past in the present. Nor need we go so very far back. Why in the Lower Canadian-rebellion there is a most interesting account of the feats of the Indians of Caughnawaga, who captured some 60 or 70 insurgents, but they were on the loyal side, and therefore it was a proper act. In the course of 1869-70, when Lieut.-Col. Dennis, as conservator of the peace, went into Manitoba and proposed to raise forces, he raised an Indian force. There 50 Indians under Chief Prince were enrolled as part of his forces, and they were doing garrison duty, which was all, fortunately, they were called upon to do at the time. The Government very properly disapproved of it, and they stopped it. They were thoroughly alive to the dangers and improprieties of it. But it was not a crime of so deep a dye to engage the Indians and thus to create a great probability of an Indian warfare, as to prevent the late Lieut-Col. Dennis from being raised immediately afterwards in the public service by those gentlemen, and being promoted in that service, and remaining in it until he was superannuated. Now, Sir, referring to another point, to the.\n\nQuestion of the Old Offence.\n\nIt is said by the hon. gentlemen opposite, and has been said very loudly, that my attitude on that subject entirely precludes me from condemning this execution. Well with reference to the old offence. We must remember that there was a general amnesty announced by the Government by proclamation, on their responsibility covering not that particular offence, but covering all the political offences and disturbances. That amnesty was received with universal approbation. I do not remember a single voice or newspaper ever being raised against it. It was universally thought that the Government had done proper in issuing, and issuing early, that particular amnesty. It did not, however, cover this particular offence; but the rising, the political part of the whole affair, the raising of men in rebellion, the creation of a Government, the organization of forces, all that was with the unanimous consent of the people of Canada amnestied. There remained, as I have said, the question of this particular offence. As to that, what was my attitude in 1871? It is the same as my attitude today. I thought then, as I said then, that in my opinion the death of Scott was a cruel murder. There is just one point in respect of which the discussions which have gone on within the last few months have tended to modify my view, and that is the very point to which I have been drawing the attention of the House this evening. It is questionable, in my opinion, and those who read with the light which recent events and evidence have thrown upon these matters, will agree with it, will see in much that has occurred the reason of that question, it is questionable how far the mind of Riel may even at that early day have been thoroughly balanced. I do not intend to discuss it; I allude to it as the only thing in regard to which there is an observation to be made which differs my attitude today from my attitude of 1870 with respect to that event. That being my attitude then and my attitude ever since, an attitude in which I was confirmed by Sir George E. Cartier, who called it a cruel murder, by Sir John A. Macdonald, who also stigmatised it as such and invoked his Maker to testify to his anxiety to catch the criminal—that being my attitude, I was exposed at that time to a storm of indignation, because I expressed the view that those who had been, as I conceived, guilty of cruel murder should be brought to justice.\n\nMr. HESSON. It was because ye...\"\nwanted to make political capital out of it?\n\nMr. BLAKE. The hon. gentleman, who is always charitable, says it was because I thought to make political capital. The hon. gentleman has been some time in Parliament, and he ought to know it is not parliamentary to impute motives. I wonder what the hon. gentleman thought of it himself? I wonder whether he thought it was a cruel murder, and whether he thought the murderer should be brought to justice or not?\n\nMr. HESSON. I have not changed my mind.\n\nMr. BLAKE. The hon. gentleman thought it then and thinks it now.\n\nMr. HESSON. You have, I have not.\n\nMr. BLAKE. We shall see. I have just said I have not changed my mind. I did my best to enforce that view. I am told that I did it without papers and I want papers now. I had papers; the Government had brought down the papers to the House; they had brought down the full account of the murder. I have Mr. Donald Smith's account and the account of other dignitaries—all the evidence on which a man could reasonably come to a conclusion in advance of a trial. What did I want? I wanted a trial; I wanted that the man should be brought to trial, and I thought then and I think now that I had quite ample evidence to justify me in stigmatising that event as a murder, and in calling that the perpetrator should be brought to trial.\n\nFull Amnesty was granted.\n\nThat being so, yet in the year 1875, I think I was amongst those who though, not of the Government, yet in our party councils, and subsequently in my place in parliament, most strongly supported by voice and vote the proposition that there should be an amnesty in respect of that offence. I believed that the facts which were revealed before the special committee on the North-West troubles proved that we were in duty bound to grant that amnesty, that we were in honor bound to grant that amnesty; and so believing I acted upon that belief and sustained, as I have said, by every force in my power the proposition that an amnesty should be granted. That amnesty was a very effectual and complete transaction. It was not granted simply upon the responsibility of the Crown without the approval of the people's representatives. The people's representatives were asked to take the initiative, at the instance, of course, of the responsible Ministers of the Crown, and they did so by an overwhelming majority, in which you are to count, not merely that very large majority, that voted for the granting of that amnesty, but also all those who voted for the granting of an unconditional amnesty and may have recorded their votes against this one because it was conditional. There was not absolute unanimity. The Minister of Customs was, I have no doubt, a Protestant, as Riel says, upon that subject, as some others were, and the First Minister declined to vote upon that occasion at all, so his opinions were left to be gathered from rather indefinite observations. But take it all round both as to political parties and as to the absolute majority, there was a very close approach to unanimity. The hon. member for Ottawa has made a discovery on the head of this and has found that because Riel was amnestied on the condition that he should absent himself from Canada for five years, and because for some sixteen months of those five years he was confined as a lunatic in a lunatic asylum by the authority of and at the instance of the Local Government of the Province of Quebec, Canada, he thus broke the condition and made himself liable, but for the leniency, kindness and consideration of this Government, to be executed forthwith upon his being found in the country and caught by the constables. Such is the view of the hon. member for Ottawa upon the criminal law. He has supported it by some extract from a book upon contracts, dealing with civil rights, and with the somewhat complicated question of the voidable character of agreements when made by a person of insane mind. But I will tell the hon. member, without endeavoring to enlighten him upon these subjects, that\nmy opinion is that the presence in this country of Riel in an insane state, should not be taken, as a breach of that condition in point of law, and that I little regard it, for I believe it would be considered even if it were a nominal, a technical breach, as nothing less in the literal sense of the term than a judicial murder if advantage had been taken of the presence of this lunatic to award execution against him. I therefore pass from this essay of the hon. member for Ottawa, into the regions of criminal law. I am a little surprised that it should be said that I am not free to exercise my judgment now, and to decide as to the extent of Riel's responsibility, because, in common, I believe, with a very large majority of my fellow-countrymen, I came to a particular conclusion which I still retain, with reference to the events of 1869 and 1870, which had been amnestyed in 1875. How of my critics? Was the Minister of Customs free to come to such a conclusion? Was he hampered by the views he held on that topic in the earlier days? Was he hampered by his declination to vote even then for the amnesty? Was not he perfectly free to deal with this question in his executive capacity, entirely irrespective, as he was bound to do, of the view that he held that the death of Scott was in fact a cruel murder? How of the Secretary of State? As I have said, I was exposed to a storm of obloquy in certain portions of the Dominion because I had affirmed the proposition I have mentioned with reference to the death of Scott. Different views upon that subject were stated by many hon. gentlemen, and amongst them was the Secretary of State, who was of an entirely different opinion with reference to the question of the execution of Scott. My hon. friend from East Quebec, read the other day the resolutions which the hon. gentleman caused to be passed by the Legislative Assembly of Quebec upon that subject. I have here in addition an extract from a speech of the hon. gentleman, made in support of those resolutions on the 18th of December, 1874:\n\n\"I arrive at a point brilliant, at a unfortunate event which has put me in fear of the Canada, at the sole fault which marked the conduct of the government provisional of Manitoba.\n\n\"On a voulut rejeter sur quelques individus la responsabilité qui doit peser sur tous ceux qui avaient chargé Riel et ses compatriotes de les protéger, de les conduire. Cet acte regrettable et que je condamne, a été commis par des personnes qui ont cru, de bonne foi, qu'il était nécessaire à la sûreté de la société et du gouvernement qu'ils jugeaient légal parce qu'il était issu du suffrage populaire. Tout ce que l'on peut dire sur l'exécution de Scott, a été répété souvent. C'est un sujet qu'il importe de laisser dans l'oubli afin de ne pas réveiller les susceptibilités nationales. Je demande qu'on l'oublie comme je déteste que l'on ne parle plus du meurtre de Goulet et des autres mérités. Le sang appelle le sang, et il y en a eu assez de répandu pour satisfaire les deux partis, en admettant, ce que je ne veux pas admettre, que les deux nationalités en conflit sur ce point exigent cette barbare réparation.\"\n\nOf course this statement made by the hon. gentleman who in the remaining part of his speech pointed out that he knew something of this matter, who himself had been the counsel for Lepine upon his trial for that murder, naturally produced a great impression amongst his compatriots, and would have the effect of causing me to be regarded amongst them as very cruel, hard-hearted and unjust man, who had proceeded so to deal with transactions which the hon. gentleman avec connaissance de cause, has so described. I am relieved from those imputations so far as those imputations may be, due to any weight which his compatriots at that time placed in the words and statements of the Secretary of State, by his recent utterances. I am going at this moment to try another mode of arriving at the hon. gentleman's recent statement. I am afraid from the type that it is from the same unhappy paper, but it is a letter I am about to quote, and perhaps by some fortunate accident it may have been correctly copied. The letter of the hon. gentleman to his constituents contains these words:\n\n\"Riel was informed of it—\"\n\nThat is of the arrival or approaching arrival of Monsieur Tache.\n\"Riel was informed of it, and feeling that his reign was about to close, did not hesitate to throw a corpse between himself and the conciliation which was arriving with the holy missionary. Scott was immolated, and his blood thrown as defiance at all efforts of reconciliation.\" * * Last winter was not Riel's debut in this course of high treason. His revolt in 1869 will be remembered—the useless murder of Scott, whom he caused to be executed when that poor unfortunate was in a position where it was impossible for him to injure his captor.\"\n\nI am going to try another plan of being correct this time, and I shall take the Montreal Gazette's report of the Secretary's speech at Terrebonne, in which he said, with reference to his action in 1874, in the case of Lepine:\n\n\"I defended my client, and during that defence I had proof, and the best proof too, that the killing of the unfortunate Scott was one of the most atrocious murders ever committed. That atrocious murder was without the connivance and, without the approval of Lepine, but it was the result of the selfish vengeance of the then dictator of the North-West—Louis Riel.\n\nNow, Sir, perhaps the hon. member for North Perth (Mr. Hesson), with that accurate appreciation of motives and that Christian charity which animates him in the exercise of that appreciation, will discern on what principle it was that the Secretary of State in 1875 described, as I have read to you the event to which I have referred, with the knowledge that he had of that event, as proved by the description of it which we got from the Secretary in the year 1886; and he will tell us how he came to treat it in one way in 1875, and in another way altogether in 1886. I do not occupy that position. I regard it now as I regarded it in 1871 and in 1875. I am fortunate enough not to have required a reversal of my opinion in the interval, though the Secretary of State seems to have required fifteen years to ascertain the facts and arrive at his last conclusion. Now, Sir, whatever was the guilt of 1870, whether the hon. Secretary of State of 1875, or the hon. Secretary of State of 1886, be right upon that subject, here was, as I have said, a solemn amnesty—an act of oblivion.\n\nWhat is the meaning of \"Amnesty\"?\n\nIt is a blotting out of remembrance. What is the meaning of \"oblivion\"? It is the same. That is the technical meaning expressing the reality of these transactions; and it is in my opinion, contrary to the spirit of our law that we should, at this time and under these circumstances, bring up the event which was so solemnly amnestied, as a reason why the extreme penalty of the law should be inflicted if but for that event it should not be inflicted. Will you allow me to read a word or two that Sir Robert Peel used in the House of Commons when, at as early a period as 1825, he proposed a Bill for restoring the credit of criminals:\n\n* * * \"By the spirit of the English Constitution, every man who had satisfied the justice of the country, by a pardon ought to be restored to the same situation as he was in before he committed any offence.\" * * * The Bill would also go to place persons whose sentence had been commuted in the full enjoyment of all their rights as free citizens. So when a capital convict has fulfilled his commuted sentence of seven years' transportation, he was to be restored to all his 'credits and capacities.' * * * In God's name, when parties had expiated their offence by fulfilling the sentence of the law, why should any exclusion remain against them? It was therefore provided by the Bill, that whatever a party had undergone the punishment awarded by the court for any offence, he was then restored to all his rights, credits and capacities, in as full a manner as if no offence had been committed.\"\n\nMuch more solemnly can we apply such language to the case of a parliamentary amnesty such as was granted here. Now was he hanged for the old offence? If yes—if his sentence would have been commuted—but for that, then he was in effect hanged for it; and this would be in effect to adopt the views of those who called for his blood, on the ground of the death of Scott. But, Sir, if his intellect were disordered, how could the old offence be taken into consideration in administering the extreme punishment for the new. Incarceration for life was required; pardon would not have been right.\nThat is one of the observations hon. gentlemen opposite make: \"You say he ought to have been pardoned.\" I have not said so. *I say pardon would not have been right.* The safety of the State and his punishment, taking the strongest view against him of his mental condition, demanded incarceration; but the amnestied offence should not have hanged him.\n\nWas Riel Executed as a Deterrent.\n\nIt is said the execution was needed as a deterrent. Sir Alexander Campbell, in his report, has declared that there never was a rebellion of which it might be so truthfully said, that it was entirely the act of one man—that if he had not come there, or had been removed one day before it took place, the outbreak would not have taken place. Yet, he said that as a deterrent to others against retelling, it was necessary that he should be executed. I do not think so, I have not so ill an opinion of the people of the North-West. Incarceration would have been quite enough to deter, with all the other results which have followed from their unjustifiable rising. Justice and mercy, redress of grievances, and a proper attention to the rights and interests of the people, are the best deterrents. We asked, to-day, Sir, in our prayers, that peace and happiness, truth and justice, religion and piety, might be established amongst us through all generations, but I do not believe that it is by this man's blood that a step has been taken to accomplish that result. *I do not see how, on the score of necessity to deter, you can justify hanging a man of a disordered intellect.* That is a deterrent, it is true, but it is a deterrent to the continued existence of the principle of capital punishment. Now, Sir, one word with reference to the\n\nReprieves and the Delays.\n\nWe have not yet heard a satisfactory explanation of the last reprieve. I do not desire to detain you on that subject; but I wish to advert to an authority upon it. In 1869 the Home Secretary, Mr. Bruce, said this:\n\n\"In Windsor's case, again, although the enormity of the offence was undoubted, still the sentence having been postponed for six months, in order that important questions of law might be determined, the right hon. gentleman had thought that it would not be right, after that lapse of time, to permit the prisoner to be executed.\"\n\nI will advert to one other case of which I happened to become personally cognisant when Minister of Justice. In the discharge of my duties I visited the Kingston penitentiary and conversed with the Warden in reference to a number of prisoners. Amongst them was one whose sentence had been commuted a great many years ago. I enquired into his case. He was a navvy, I think, living a little way out of Hamilton, on the Toronto and Hamilton Railway, perhaps during the time of its construction. He had been convicted of a cruel and brutal murder of his wife with a crowbar. She was found in a terribly mutilated state; he was tried, convicted and sentenced. At the last moment the technical legal point was raised that the law required an associate on the bench when the sentence was pronounced, or at some stage of the trial. The associate had as little to do with the case as the magistrate in this case. Yet it was proved that the associate was off the bench. Upon that the man was reprieved until the question should be decided by the judges. The judges decided that the objection was fatal and the trial a mistrial, and that the man must be tried again. He was tried at the next assizes, and of course convicted again, and upon the score of the time that had passed, though there was not the slightest ground otherwise, his sentence was commuted. Now, the hon. Minister of Militia referred to what he called the evidence with regard to the\n\nLetter of General Middleton to Riel;\n\nYet he did not satisfy me that Riel did not surrender on that letter. The statement of Colonel Boulton read by the\nMinister was directly to the contrary, and if we remember the whole circumstances of the case — the time General Middleton wrote the letter, and the condition of things stated by the First Minister on one of the discussions last session as to papers, I do not think that is a fair inference from the evidence. But the hon. Minister said he would prove the purpose for which that letter was given, and he proved it by reading a letter from the Lieutenant General, who, he said had been told by some one that Riel was afraid of being killed in the camp. That was not very good evidence against Riel as the hon. gentleman knows. The intent with which General Middleton sent the letter is of no consequence.\n\nThe question is what does the letter fairly import? The authority of General Middleton is not of any consequence, if that were disputed, though I do not suppose it is. Now, the question, to my mind, on this subject is just this; Is it for the honor and credit of the volunteers of Canada that it should be declared that that paper was sent in order to warrant the prisoner, if he surrendered himself, against lynch law? Is it to the credit and honor of the volunteers to say that it was necessary for a Major General in the British army to give assurance to Riel and his council that they would not be lynched if they surrendered themselves? I should be sorry to come to any such conclusion; and then, the question remains: Was it not reasonable to believe that the result of this statement was, you shall not, in fact, be exposed to the very worst that you can possibly be exposed to if you are caught, that is death. I think the liberal interpretation of that letter, in the sense and spirit in which such letters and assurances have been interpreted in all events of this description, would have led to that conclusion. I turn to the subsequent question, the promise of inquiry and the expectations of commutation. I turn to the very important statement by the hon. member for Hochelaga (Mr. Desjardins) on that subject, and to the language of the Ministerial press, and I say that those expectations ought not to have been aroused, that that attitude ought not to have been taken unless they were to be acted upon and abided by, truly, faithfully and loyally, because if they had not been aroused, other steps might have been taken, other evidence might have been brought forward, other facts might have been presented to the Executive, which naturally would not be brought forward if there was an understanding that there was to be an efficient inquiry. For my part, I always believed there would be in this case, a commutation, having regard to the circumstances and the testimony as to the prisoner's mind; and I believed that if there was doubt in the mind of the Government on the question of\n\nThe Mental Condition of the Prisoner.\n\nthat doubt would have been attempted to be solved by an efficient and proper medical enquiry; particularly so when we find that Dr. Howard was not called. Now Dr. Howard said in Montreal he could do Riel no good, because, under the law, although he obviously implied he did not agree with the law, he would have been obliged to prove that Riel was responsible. Of course he would. He thought Riel was irresponsible and that the law was wrong. He could not have disturbed the verdict, but his evidence would have been important as to the state of Riel's mind with a view to the awarding of punishment afterwards. So with Archbishop Tache who, we see, in his letter declared that he had formed the conviction that for twenty years, with all his brilliant gifts, this unfortunate man was the victim of megalomania and theomania. So with reference to Bishop Grandin, whose letter the Minister of Militia read, dated June, in which the bishop characterises Riel as a miserable maniac. So with reference to a number of pieces of evidence I have collected and gathered from newspapers which were accessible to Ministers, but which I will not trouble the House with\nat this hour. So with reference to the diary which contains indubitable traces of a disordered mind. So with reference to the last effusion I have read, the prophecy of Regina, which no man can read without coming to the conclusion that he who wrote it was disordered in his mind. So with reference to the papers not brought down. I have been told that of the Orders in Council of the provisional government, which are in the custody of this Government, the very first is an order declaring Riel a prophet, something after the fashion of John the Baptist. I have shown you he called himself Elias and Peter, and this order, I believe, represents him as John the Baptist. The next order was one altering the days of the week and so forth. All these things and many statements that were made, some of them at an earlier period, as to circumstances which had occurred, were worthy of attention. So were the letters written with reference to the trial. At the close of the trial, the correspondent of the Mail reported that Dr. Clarke, after having heard the evidence which was called since Riel's examination, and after having heard the prisoner himself speak, was quite convinced he was insane. I say the case was one in which it was incumbent on the administration, if they felt a doubt as to the propriety of commutation, to have a thorough medical examination and enquiry. The medical examination they caused was limited in scope. Sir John A. Macdonald's letter expressly points that out. We have not the instructions to these gentlemen, but Sir John's letter to the Minister of Militia pointed out that it was limited to the question whether Riel's condition had become so much worse since his trial that he was no longer capable of knowing right from wrong. It was not therefore such an enquiry as has been frequently made in cases infinitely weaker than this; it was not an inquiry which involved the real question: What was the condition of his mind at the time of the offence, which constituted the crime he committed? What was the condition of his mind before that time? So with reference to the very important point of hereditary insanity. I have read in the Mail the statement that his mother went into a state of absolute craziness during the rebellion, and a statement of her falling into the same condition at a subsequent period, when she heard of the conviction—a circumstance, the importance of which, in considering what the real condition of this man's mind was, cannot be overstated, as must be extremely familiar to all those who have made mental alienation a study. These gentlemen were not specialists. Dr. Valade certainly was not; Dr. Lavell had very limited experience, having had, for a short number of years only, the charge of the criminal lunatics in the Kingston penitentiary, because up to a comparatively recent period the criminal lunatics were transferred to Rockwood which was under other orders. Dr. Lavell also, if I be rightly informed as to his views upon a late occasion, that of Lee's examination, was a very improper person to send to find Riel sane or insane, because upon that occasion, if I am rightly informed, his opinion was that the man was sane, though the others found him insane. The experts also who had been examined at the trial took no part in the subsequent examination, except perhaps Dr. Jukes, who did not take any real part in it. Then we have not the reports of the commission, we have only this edition of their reports which has been laid on the Table, and we do not know what their instructions were or what were the reports on which the government acted. I say however that for the purpose of a proper discharge of the duties of the Executive in cases of disordered intellect though not amounting to irresponsibility, those reports, even such as they are brought down, were of the highest importance. They prove the genuine existence of delusions and hallucinations on the subjects of religion and politics, on the very subjects on which the delusions and hallucinations were proved, in respect of which the crime was committed. They show that these were persistent, and my conclusion is clear that Riel was to dis-\nordered in mind as not, within the accepted rule, to have been a proper subject for the capital sentence. It is impossible, in case of serious delusion or so called monomaniac, to be sure how far the flaw has affected the conduct in question. It may not have affected it in some cases, though whether it did or not is very frequently a question beyond the wit of man to determine. But here we know it did, because we know that the flaw had regard to these very two points of religion and politics upon which this rising and these events turned. Criminal responsibility, then, for public security there may and must be, though there may be some mental disorder; but not responsibility unto death; and here again come in the political nature of the offence, the general rules relating to these offences and the special circumstances of the conduct of the Government in this matter; and my belief, therefore, is that the maximum sentence for the same crime of which Riel was convicted, had he been tried under the milder procedure of the modern law under which his colleagues were tried, namely, imprisonment for life would have been the proper and adequate disposition of his case. But if the Government doubted this there was an imperative call for thorough and efficient inquiry, for an inquiry going far beyond what was possible at Regina, and extending to the condition of the criminal not only at that moment, but at other times, there was imperative ground for such an inquiry before a determination should be reached; that the sentence should be executed.\n\nMy own opinion is, then, that a great wrong has been done, and a great blow has been inflicted upon the administration of criminal justice; and for this the Executive is responsible to us. I know the atmosphere of prejudice and passion which surrounds this case; I know how difficult it will be for years to come to penetrate that dense atmosphere; I know how many people of my own race and of my own creed entertain sentiments and feelings hostile to the conclusion to which I have been driven; I know that many whom I esteem and in whose judgment I have confidence, after examination of this case, have been unable to reach my own conclusion. I blame no one. Each has the right and duty to examine and judge for himself. But cries have been raised on both sides which are potent, most potent in preventing the public from coming to a just conclusion; yet we must not, by any such cries, be deterred from doing our duty. I have been threatened more than once by hon. gentlemen opposite during this debate with political annihilation in consequence of the attitude of the Liberal party which they projected on this question; and I so far agree with them as to admit that the vote I am about to give is an inexpedient vote, and that, if politics were a game, I should be glad to be able to reach a conclusion different from that which is said by hon. gentleman opposite to be likely to weaken my influence and imperil my position. But it can be said of none of us, least of all of the humble individual who now addresses you, that his continued possession of a share of public confidence, of the lead of a party, or of a seat in Parliament, is essential or even highly important to the public interest; while for all of us what is needful is not that we should retain, but that we should deserve the public confidence; not that we should keep, but that while we do keep we should honestly use, our seats in Parliament. To act otherwise would be to grasp at the shadow and to lose the substance; propter vitam vivendi perdere causas. We may be wrong—we must be true—we should be ready to close, but resolved to keep unstained our public careers. I am unable honestly to differ from the view that it is deeply to be regretted that this execution should have been allowed to take place, and therefore in favor of that view I must record my vote.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001576.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 66, "total-input-tokens": 96358, "total-output-tokens": 57027, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2372, 1], [2372, 6524, 2], [6524, 10604, 3], [10604, 14676, 4], [14676, 18844, 5], [18844, 22790, 6], [22790, 26886, 7], [26886, 31026, 8], [31026, 35331, 9], [35331, 39485, 10], [39485, 43385, 11], [43385, 47363, 12], [47363, 51421, 13], [51421, 55875, 14], [55875, 60498, 15], [60498, 65040, 16], [65040, 65040, 17], [65040, 65040, 18], [65040, 70069, 19], [70069, 74633, 20], [74633, 79156, 21], [79156, 83588, 22], [83588, 88032, 23], [88032, 92128, 24], [92128, 96113, 25], [96113, 99872, 26], [99872, 104115, 27], [104115, 109217, 28], [109217, 114182, 29], [114182, 119096, 30], [119096, 123662, 31], [123662, 127962, 32], [127962, 132259, 33], [132259, 136207, 34], [136207, 140221, 35], [140221, 144807, 36], [144807, 148993, 37], [148993, 153798, 38], [153798, 158382, 39], [158382, 163257, 40], [163257, 167732, 41], [167732, 169713, 42], [169713, 174278, 43], [174278, 178555, 44], [178555, 182782, 45], [182782, 186910, 46], [186910, 191571, 47], [191571, 196134, 48], [196134, 200527, 49], [200527, 204772, 50], [204772, 204772, 51], [204772, 204772, 52], [204772, 209183, 53], [209183, 213517, 54], [213517, 217690, 55], [217690, 221751, 56], [221751, 225827, 57], [225827, 229961, 58], [229961, 233991, 59], [233991, 238327, 60], [238327, 242706, 61], [242706, 246599, 62], [246599, 250604, 63], [250604, 254785, 64], [254785, 258689, 65], [258689, 258689, 66]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]