[{"id": "c8a44baddc6354506dfc1e810ecaad377baadd0a", "text": "MEMORIAL OF W. F. BRYANT IN THE MATTER OF LOUIS RIEL.\n\nSTATEMENT OF CASE.\n\nLouis Riel was born in Rupert's Land, British North America, October 22, 1844. He was seven-eighths white and one-eighth Indian. His descent was as follows: His mother (who is now living) is of pure white blood. His father was of mixed Indian and white blood—a quarter blood. Riel's paternal grandmother was a half-breed. Her mother (Riel's great-grandmother) was a squaw. His (Riel's) great-great-grandfather was the nearest ancestor having tribal relations. Thus Riel was of pure white blood on his mother's side, and his (Riel's) father was of pure white blood on his father's side.\n\nAfter the creation of the province of Manitoba the half breed inhabitants (which term included all of mixed Indian and white blood) were treated as though they were both Indians and white men. As Indians they were given \"scrip;\" as white men, they were allowed to take homesteads. Riel never availed himself of any of his rights, by virtue of his Indian descent, and was so far treated as a white man as to be thrice elected to the Canadian Parliament. He was, April 23, 1875, banished from the Dominion for five years. He resided in the United States and married here. Three years after the expiration of the term of banishment, to wit, on March 16, 1883, he became an American citizen by regular naturalization.\n\nAt the time of the difficulties in 1884, Riel returned to the Dominion for the purpose of aiding the half-breeds in a constitutional agitation to secure to themselves the same rights as were accorded to their race in Manitoba. Riel went in response to an invitation from a delegation sent to him for that purpose. His pacific intent appears from his written response delivered at the time. Riel went to the Saskatchewan and commenced a constitutional agitation. At a public dinner he proposed the health of the Queen, and never showed any desire to subvert her authority. When he (Riel) found that the constitutional agitation was fruitless he felt disheartened. It is claimed that he would have returned to the United States, but was prevented from so doing by the half-breeds. The only response to the demands of the half-breeds was an increase of the mounted police. Lawrence Clark, an Indian agent, was asked by the half-breeds what answer the government would give. He replied: \"Bullets for you, and chains for your leader.\" Receiving this\nas an authoritative assertion, the half-breeds took up arms to defend themselves, but made no attack on the government. Major Crozier came from Prince Albert to Duck Lake to remove some government stores. As he appeared there with not only mounted police, but volunteer troops armed to the teeth, the half-breeds supposed that the troops had come to assault them. Gabriel Dumont (leader of the half-breeds) called out: \"Does it mean a fight?\" The troops responded by firing upon the half-breeds. Thus began the battle of Duck Lake, the first of the \"war.\" During all that followed the half-breeds acted upon the defensive. Lord Melgund, who was military secretary of the Marquis of Lansdowne (and who accompanied General Middleton to the Saskatchewan), wrote thus in the Nineteenth Century for August, 1885:\n\nIt would seem as if they (the half-breeds) intended only to defend their homes against invasion. At Fish Creek they met us at their frontier, at Batoche they fought us on their own doorsteps.\n\nThe so-called rebellion was nothing but a local bread riot. The whole number of half-breeds in the Saskatchewan country was about five thousand, according to the census. The entire number (as estimated by the government) engaged in the outbreak did not exceed two hundred and fifty. As a matter of fact, there were never one hundred of them. The trouble never extended beyond Saint Laurent district, so called.\n\nThe half-breed forces were under the command of Gabriel Dumont, and the whole movement was under the control of a council of fourteen members, of which council Riel was not a member. As appears from the testimony of Thomas McKay, a witness for the Crown at the trial, this council was not controlled by Riel's influence. The half-breeds never put up any ensign or flag of their own.\n\nRiel surrendered himself on the strength of a letter written him by General Middleton; He was tried for high treason; convicted, condemned, and executed. The attention of the President and Secretary of State was called to the affair and they refused to interfere. For a more specific account of his trial I refer you to my book, \"The Blood of Abel,\" pages 121-142.\n\nIn regard to the question of Reil's race: Of course, if he were an Indian the naturalization laws would not apply to his case. The only question is, What admixture of Indian blood could preclude one from being denominated a white person? If a question exactly like this, on \"all fours\" therewith (if you will pardon the expression), has ever been decided by a federal court, I am not informed of it. In the judicial history of the country the question frequently arose (not, however, in cases of naturalization) with regard to negroes. The decisions are, however, in point. But there is no agreement between the courts. In some the proportion of African blood was one-eighth; in others, one fourth; and in still others, as South Carolina, any distinct and visible admixture of negro blood, to be determined by the evidence or features, complexion, and parentage. In Ohio, the rule was established, that any person having more white than either Indian or negro blood was white. You are familiar with the decisions. (See Lane vs. Baker, 12th Ohio, 237; Grey vs. The State, 4th Ohio, 354; Williamson vs. The School Directors, etc., Wright, 578; Jeffries vs. Ankeny and others, 11th Ohio, 372.)\n\nIt seems to me, that if we adopt the South Carolina rule, a person with one-eighth Indian blood, whose ancestors had no tribal relations for four generations, who had always acted and been treated as a white man, whose features were those of a white man (see portrait in \"The Blood of Abel\"), should be considered a white man. If we adopt the Ohio doctrine, Riel was clearly within the rule.\nAgain, it is to be presumed that the Montana court, in making up decision, examined into everything necessary to the finding, determination, and judgment. Although the proceeding is *ex parte*, the rule, according to my understanding, is as stated. There is no evidence that his certificate of naturalization was obtained in bad faith. That a certificate of naturalization is *in all cases* conclusive, I would not for a moment contend. But the judge who ordered Riel to be admitted citizenship was the competent authority to pass upon his eligibility. The presumption is in favor of his action, and in the absence of fraud the decree is conclusive. These questions have been so frequently adjudicated that I deem authorities unnecessary.\n\nRespectfully submitted.\n\nWILBUR F. BRYANT,\nOn behalf of the rights of American citizens.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001354.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 6460, "total-output-tokens": 1724, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2422, 3], [2422, 6170, 4], [6170, 6998, 5]], "primary_language": ["None", "None", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, false, false], "is_diagram": [false, true, false, false, false]}}]