[{"id": "7c1ce76b1a47d5dce01eca85802e4bdd4fe3b9d0", "text": "LE VERITABLE RIEL\n\nTEL QUE DÉPEINT DANS DES LETTRES DE\n\nSA GRANDEUR MGR GRANDIN, ÉVEQUE DE SAINT-ALBERT, DU\nREVD P. LEDUC, VIGAIRE-GENERAL DE SAINT-ALBERT, DU\nREVD P. ANDRÉ, SUPERIEUR DES MISSIONS DU DI-\nTRICT DE CARLETON, DES REYDS PÈRES TOUZE,\nFOURMOND, VEGREVILLE, MOULIN ET LECOQ,\nMISSIONNAIRES DU NORD-OUEST.\n\nD'UNE RELIGIEUSE DE\nBATOCHÉ, ETC., ETC.\n\nSUIVI D'EXTRAITS DES\n\nMANDEMENTS DE NOS SEIGNEURS LES ÉVÊQUES\n\nCONCERNANT L'AGITATION RIEL\n\nMONTREAL\nIMPRIMERIE GÉNÉRALE 45 PLACE JACQUES-CARTIER\n1887\nEST-IL PERMIS DE SE REVOLTER ?\n\nIl n'est pas plus permis de mépriser le pouvoir légitime, quelle que soit la personne en qui il réside; que de résister à la volonté de Dieu. Or, ceux qui lui résistent courent d'eux-mêmes à leur perte. Qui résiste au pouvoir, résiste à l'ordre établi par Dieu, et ceux qui lui résistent s'attirent à eux-mêmes la damnation (saint Paul). Ainsi donc secouer l'obéissance et révolutionner la société par le moyen de la sédition, c'est un crime de lèse-majesté non seulement humaine mais divine.\n\n(Paroles de Sa Sainteté Léon XIII, Encyclique Immortale Dei)\n\nLe sang appelle le sang, c'est la réaction naturelle, inévitable, infaillible; malheur à qui la provoque! Quand on s'obstine à susciter des troubles civils et des commotions politiques, on s'expose à en tomber victime.\n\nParoles de Napoléon.\n\nLe peuple américain doit apprendre, s'il ne le sait déjà, que la trahison est un crime, et qu'elle doit être punie; que le gouvernement n'endurera pas ses ennemis, et qu'il est fort non seulement pour protéger, mais aussi pour punir. Quand nous prenons le code criminel et examinons le catalogue des crimes, nous voyons l'incendie posé comme un crime avec son châtiment approprié; nous trouvons le vol et la rapine exposés comme crimes; et nous trouvons le plus grand de tous les crimes, la trahison. Notre peuple est familier avec les autres offenses inférieures. Mais dans notre histoire pacifique, la trahison a été presque inconnue. * * * Le peuple doit comprendre que c'est le plus ignoble des crimes et qu'il sera certainement puni. Je fais cette allusion, non pas pour exciter les sentiments publics déjà exaspérés, mais pour signaler le principe de justice publique qui doit guider notre action dans cette conjoncture particulière, et qui s'accorde avec la saine morale. Qu'il soit gravé dans tous les coeurs que la trahison est un crime et que les traitres devront souffrir le châtiment.\n\n(Paroles du président des États-Unis)\nLE VERITABLE RIEL\n\nJUGÉ PAR LES\n\nMISSIONNAIRES DU NORD-OUEST\n\nIls le déclarent indigne de la confiance publique.\n\nRiel a tout fait dans son intérêt personnel.\n\nLe 12 juin 1885, les missionnaires du Nord-Ouest, région de la Saskatchewan, signaient conjointement le manifeste suivant, pour montrer que Riel, qui venait d'être livré à la justice, ne méritait aucunement les sympathies des catholiques du Bas-Canada, qu'il avait usurpé les fonctions des prêtres et agi par des motifs d'intérêt personnel, que les Métis qu'il avait égarés étaient plus dignes de pitié que de blâme, qu'il les avait dépouillés de tout ce qu'ils possédaient, tandis que le général Middleton avait fait tout ce qu'il avait pu pour soulager leurs maux. Voici cette déclaration :\n\nPRINCE-ALBERT, 12 juin 1885.\n\nNous, prêtres des districts qu'affecte plus particulièrement la rébellion, savoir : Saint-Laurent, Saint-Antoine, Grandin, Lac-aux-Canaux et Batoche, puisque c'est là, au milieu de notre population que Louis \"David\" Riel avait établi ses quartiers-généraux, désirons attirer l'attention de nos nationaux du Canada et d'ailleurs sur les faits.\n\nLOUIS \"DAVID\" RIEL NE MÈRIT PAS LES SYMPATHIES DE L'ÉGLISE CATHOLIQUE-ROMAINE et des membres de cette Église, ayant usurpé notre mission de prêtres et privé notre population des avantages et des consolations que nous aurions pu lui offrir. IL A FAIT TOUT CELA DANS SON INTÉRÊT PUREMENT PERSONNEL.\n\nNous croyons donc que L'ÉGLISE ET LES HABITANTS DU CANADA DEVRAIENT SYMPATHISER AVEC NOUS ET NOTRE POPULATION, laquelle est plutôt À PLAINDRE QU'À BLAMER, pour S'ÊTRE LAISSÉ ÉGARER.\nNombre de nos gens sont dans la plus GRANDE MISÈRE, RIEL ET SON CONSEIL LEUR AYANT D'ABORD ENLEVÉ CE QU'ILS POS-\nSÉDAIENT, et le passage de l'armée leur ayant infligé les pertes ordi-\nnaires. LE GÉNÉRAL MIDDLETON N'A RIEN ÉPARGNÉ POUR\nALLEGÉRER, autant que possible, LES PERTES ET LES SOUF-\nFRANCES DE NOTRE POPULATION, et À DROIT, en conséquence,\nÀ NOS SINCÈRES REMERCIEMENTS. Mais si nous ne recevons pas\nd'autres secours, notre population mourra de faim. Nous prions donc\nles Canadiens-français de nous accorder leurs sympathies, et de conjurer\nle gouvernement de tempérer la justice PAR LA CLÈMENCE, AU\nSUJET DE CEUX QUI FURENT ÉGARÉS.\n\nSigné : RR. PÈRES ANDRÉ,\nTOUSE,\nMOULIN,\nFOURMOND,\nVEGREVILLE,\nLACOQ.\nDENONCIATION DU REV. PÈRE ANDRÉ.\n\nIl traite Riel de monstre, d'homme néfaste, il maudit le jour de son apparition.\n\nRiel est seul responsable de la révolte.\n\nSa devise était argent ou vengeance.\n\nQuelques jours après, soit le 17 juin, le Rév. P. André, vicaire général de Mgr Grandin, et le premier des signataires de la déclaration ci-dessus, écrivait lui-même à la Minerve, une lettre spéciale, qui parut dans ce journal le 1er juillet, sous la signature Testis Fidelis (Témoin fidèle). Dans cette lettre, le révérend missionnaire exprime son regret de voir la presse du Bas-Canada essayant de défendre Riel et de \"pallier son mouvement insurrectionnel.\" Il déclare en même temps que les griefs des Métis ne justifiaient pas une révolte, que les Métis, laissés à eux-mêmes, n'auraient jamais songé à se soulever, mais qu'ils ont été précipités dans la rébellion par Riel, sur qui seul, dit-il, doit retomber toute la responsabilité de leur malheur ; Riel qui voulait tout simplement se faire redouter du gouvernement et se faire acheter ; Riel, dont la devise était L'argent ou la vengeance, et que l'intérêt personnel guidait seul.\n\nLe Père André affirme que la population du Nord-Ouest était heureuse et prospère avant que Riel ne vint la troubler, et il \"maudit le jour où cet homme néfaste a fait son apparition.\"\n\nVoici cette lettre :\n\nSASKATCHEWAN, 17 juin 1885.\n\nAu directeur de la Minerve,\n\nMontréal.\n\nMonsieur le Directeur,\n\nEN-LISANT LES JOURNAUX FRANÇAIS DE LA PROVINCE DE QUÉBEC, nous ne pouvons nous défendre d'un sentiment d'ÉTONNEMENT MÉLÉ DE REGRET, de voir la CHALEUR QUE LA PLUPART\nD'ENTRE EUX DÉPLOIENT POUR DÉFENDRE RIEL ET PALLIER SON MOUVEMENT INSURRECTIONNEL parmi les Métis de la Saskatchewan.\n\nA en croire les journaux, Riel, en faisant ce mouvement, n'a cédé qu'à la générosité de son cœur, et s'est sacrifié pour tenter un effort suprême pour délivrer ses compatriotes de l'oppression qui pesait sur eux. Assurément, je suis loin de nier que les Métis de cette contrée aient eu des griefs sérieux et irritants dont ils se plaignaient depuis longtemps ; mais ces griefs, tout fondés qu'ils fussent, ne justifiaient pas une révolte et un appel aux armes. Je puis affirmer en toute certitude que nos Métis, laissés à eux-mêmes, n'auraient jamais pensé à se soulèver ; mais Riel, comme un génie malfaissant, s'est servi de son influence sur ces pauvres gens pour les précipiter dans une rébellion dont ils déplorent aujourd'hui les suites funestes. C'est sur lui seul que retombe la terrible responsabilité d'avoir plongé ces infortunés dans un mouvement qu'ils ruine et les détruit. Riel, étant encore dans les États, avait de longue main préparé parmi les Métis de la Saskatchewan, l'excitation qui a provoqué son rappel dans le pays. Les pauvres gens étaient loin de prévoir les malheurs qu'ils allaient attirer sur eux, quoique les avertissements qui les prévenaient contre le danger qui les menaçait, ne leur manquassent pas dans cette circonstance. RIEL, EN REVENANT DANS LE PAYS AVAIT UN PLAN TOUT TRACÉ COMME LES ÉVÉNEMENTS L'ONT MONTRÉ : c'était de produire une grande agitation parmi les Métis pour SE FAIRE REDOUTER DU GOUVERNEMENT ET LUI FOURNIR AINSI UNE OCCASION DE SE FAIRE ACCHETER ET DE LAISSER LE PAYS MOYENNANT UNE BONNE RETRIBUTION. S'il ne réussissait pas à recevoir l'argent, il était résolu à faire un soulèvement, sacrifiant tout au désir de la vengeance, ne s'inquiétant pas si, dans sa ruine, il entraînait celle de ses compatriotes qui avait placé toute leur confiance en lui. L'ARGENT OU LA VENGEANCE ÉTAIT SA DEVISE, et il ne se faisait faute de le proclamer dans ses moments de surexcitation.\n\nRien de noble, ni de généreux ne vibrait dans ce cœur, que dominent l'orgueil et l'ambition ; TOUS LES DROITS ET TOUTES LES RECLAMATIONS DES MÉTIS AUX YEUX DE RIEL SE RÉSUMAIENT DANS SA PERSONNE et tous les avantages que le GOUVERNEMENT aurait pu offrir aux Métis, n'auraient jamais été acceptables, à moins que RIEL n'eut quelqu'intérêt personnel de les leur faire accepter. SI JE SUIS SATISFAIT, LES MÉTIS LE SERONT, ET LA SEULE QUESTION EN LITIGE EST DE ME SATISFAIRE : il avait l'habitude de dire.\n\nVoilà la conduite de Riel exposée telle qu'elle apparaît à ceux qui ont eu occasion de l'observer de près ou de l'étudier à fond. Je comprends que les malheurs de Riel, surtout quand on sait qu'il est à la veille de subir un procès où il va jurer sa tête, lui attirent des sympathies et at-\ntristent les cœurs ; j'honore ces sentiments et je suis loin de les condamner. Son nom aussi réveille des souvenirs en nous, mettant devant les yeux cette haine féroce dont il fut l'objet de la part des gens fanatiques de la province d'Ottawa, pour avoir repoussé l'agression injuste dont son pays avait été l'objet de la part du Canada, qui prétendait envahir le Rivière-Rouge sans nullement consulter le peuple qui s'y trouvait. Mais LES SITUATIONS NE SONT PLUS LES MÊMES. Nous vivons dans le Nord-Ouest sous un gouvernement régulièrement établi, et PERSONNE N'A LE DROIT DE REDRESSER CET ORDRE DE CHOSES SANS SE DÉCLARER REBELLE CONTRE DIEU ET L'AUTORITÉ SOUVERAINE DE SON PAYS ; LES PRINCIPES SONT CLAIRS COMME LE JOUR ET NE DEVRAIENT JAMAIS FAIRE L'OBJET D'UN DOUCE POUR PERSONNE. C'est ce qui excite l'indignation contre Riel quand on se rappelle QU'IL A EMPLOYÉ TOUS LES ARTIFICES ET TOUTES LES FOURBERIES POUR POUSSEUR DANS LA RÉVOLTE CETTE POPULATION MÉTISSE, DE SA NATURE SI PAISIBLE ET SI SOUMISE : elle était SI HEUREUSE ET SI PROSPÈRE CETTE POPULATION, QUANT À PEINE IL Y A UN AN, RIEL, COMME UN MALIN ESPRIT, EST ARRIVÉ AU MILIEU D'ELLE. Son arrivée a été le signal de la discorde et EN VOYANT LES RUINES AMONCELÉES autour de nous, les veuves et les orphelins, le désespoir et le deuil dans toutes les familles, je ne puis retenir mes larmes et ne pas MAUDIRE LE JOUR OU CET HOMME NÉFASTE A FAIT SON APPARITION AU MILIEU DE NOUS ! Il a mis tout en œuvre pour ruiner nos pauvres Métis au spirituel comme au temporel ; en RENIANT LUI-MÊME LA FOI DE SES ANCÊTRES, IL A VOULU ENTRAINER SES COMPATRIOTES DANS SON APOSTASIE, et pendant les deux mois de sa rébellion il n'y a point d'INJURIES NI DE BLASPÈMES QU'IL N'AIT LANCÉS CONTRE NOTRE SAINTE RELIGION ET SES DOGMES VÉNÉRÉS ; à ces gens simples et ignorsants, il a voulu ôter la seule consolation qui leur restait dans leur misère ; leur foi et leur confiance en Dieu, et à la place : LE MONSTRE VOULAIT SUBSTITUER UNE RELIGION DE SA FABRIQUE, qui consistait en rêves et en autres stupidités aussi extravagantes.\n\nVOILÀ LE VERITABLE RIEL ET NON LE RIEL QUE LES IMAGINATIONS AIMENT À SE REPRÉSENTER. J'AI VOULU FAIRE DE LUI UNE PEINTURE FIDÈLE ; afin que le malheureux excite une compassion réelle et véritable en portant les bonnes âmes à prier pour lui, car il en a bien besoin, et de plus afin QU'IL SOIT UNE LEÇON TERRIBLE POUR TOUTE LA JEUNESSE INSTRUITE DU CANADA, Riel avait reçu de grands talents et il aurait pu jouer un magnifique rôle parmi nos concitoyens auxquels il aurait pu rendre d'immenses services, mais l'orgueil l'a perdu, il s'est cru appelé à de brillantes destinées, et il n'a voulu écouter ni conseil, ni avis de personne ; il s'est montré INGRAT ENVERS TOUS SES BIENFAITEURS les accablant d'injures en retour pour leurs bienfaits, et NOUS VOYONS LE GOUFFRE DANS LEQUEL IL S'EST JETÉ. GRANDE LEÇON POUR CEUX QUI SAVENT REFLECHIR.\nMaintenant, en finissant, je prie tous les journaux canadiens d'unir leurs efforts afin de porter le gouvernement à envoyer de prompts secours à la population métisse de Batoche et des environs. Ils sont, ces malheureux, dans un dénuement et une pénurie extrêmes ; ils sont rebelles, dit-on, mais les femmes et les enfants ont droit à la compassion, et le gouvernement, à moins qu'il n'ait décidé de les laisser périr de faim, doit les secourir et cela sans différer.\n\nM. le Directeur, je suis avec respect, votre dévoué serviteur,\n\nTESTIS FIDELIS\nSECONDE DENONCIATION DU PÈRE ANDRÉ.\n\nLa population de la Saskatchewan était heureuse et prospère avant l'arrivée de Riel.\n\nRiel, auteur des maux des Métis est en grand désespoir parmi eux.\n\nLe 24 juin suivant, c'est-à-dire six jours après avoir écrit sa lettre à la Minerve et douze jours après avoir signé la déclaration conjointe des missionnaires, le Rév. Père André adressait au Mail de Toronto, la lettre suivante, où il peint en termes éloquents la prospérité des Métis avant l'apparition de Riel et leur désolation après le passage de cet homme néfaste :\n\nMonsieur le Directeur,\n\nIl y a quelques jours je suis allé visiter la rive Est de la Saskatchewan du Sud, qui a été dernièrement le théâtre de deux rencontres sanglantes. C'est de ce côté qu'a éclaté l'insurrection, et la population qui y est établie a eu à subir les suites de la terrible revanche nécessaire par la résistance désespérée opposée par les Métis à la marche du général Middleton. Jusqu'à ce qu'enfin ils furent obligés de se rendre, lorsque Batoche, leur château fort, eut été emporté d'assaut.\n\nLe calme est maintenant rétabli en cette région et le silence qui y règne fait un contraste des plus saisissants avec le bruit et l'agitation qui y prévalaient il y a à peine un mois. Qui que ce soit peut maintenant voyager sur cette rive de la Saskatchewan sans appréhender aucun danger, soit de la part des Sauvages ou des Métis. Tous ces hommes égarés sont redevenus eux-mêmes ; quand vous les rencontrez sur la route ils se montrent des plus polis et des plus courtois. La défaite qu'ils ont éprouvée ne semble pas avoir laissé de ressentiment dans leurs âmes. Ils semblent contents, comme tous les autres, de voir l'insurrection finie.\n\nLE NOM DE RIEL EST EN GRAND DISCRÉDIT PARMI EUX. MAINTENANT QU'ILS VOIENT CLAIREMENT LES MAUVAIS DESSEINS DE CELUI QUI FUT LEUR CHEF, ILS NE PEUVENT COMPRENDRE COMMENT ILS ONT PU ÊTRE ASSEZ AVEUGLES POUR LE SUIVRE ET DEVENIR AINSI LES INSTRUMENTS DE LEUR PROPRE RUINE. LA LEÇON A ÉTÉ SEVERE POUR EUX ET VRAISEMBLABLEMENT, ILS N'OUBLIERONT JAMAIS LE.\nTERRIBLE PRIX QUE LEUR A COUTÉ L'ALLÉGÉANCE QUILS ONT DONNÉE À RIEL QUI, EN PROVOQUANT L'INSURRECTION, A PROVOqué LE PLUS TERRIBLE FLEAU QUI PUT FRAPPER LES MÉTIS ET LEUR PAYS.\n\nL'été dernier, à cette même saison, il m'est arrivé de visiter le pays que je viens de mentionner. Comme J'ÉTAIS HEUREUX DE VOIR LA BEAUTÉ DES CHAMPS EN CULTURE, tout le long de la route, et les espérances qu'entretenaient la population établie sur la rive Est de la rivière. À chaque maison où j'étais accueilli, je félicitais les gens de l'énergie et du goût qu'ils avaient déployés dans la construction de leurs JOLIES RÉSIDENCES ET DANS LA CULTURE DU SOL. Je ne pouvais me lasser d'admirer LE CONTRASTE QUI FRAPPAIT MES YEUX, en me rappelant que cette vallée arrosée par la Saskatchewan n'était rien autre chose, il y a quelques années, qu'un pays sauvage, complètement inhabité, tandis que depuis elle était devenue UN MAGNIFIQUE ÉTABLISSEMENT PARSEMÉ DE BELLES RÉSIDENCES ET DE RIANTS JARDINS : UNE MAGNIFIQUE PRAIRIE OU PAISSAIENT DES TROUPEAUX CONSIDÉRABLES.\n\nÀ chaque maison où je m'arrêtai, j'étais frappé DU CONFORT qui y régnait. LA POPULATION SEMBLAIT HEUREUSE ET PLEINE DE CONFIANCE DANS L'AVENIR. Hélas ! que j'étais loin de songer au terrible sort qui l'attendait ! MAIS, RIEL PARUT COMME UN NUAGE DANS LE CIEL PUR ; SA PRÉSENCE BOULEVERSA TOUS CET HEUREUX PAYS.\n\nQuel désolant spectacle a frappé mes yeux, l'autre jour, quand je visitai cette même paroisse de Saint-Antoine. Les résidences que j'avais tant admirées l'an passé, étaient presque toutes brûlées, jusque là solides ; celles qui étaient restées debout n'étaient qu'une masse de ruines. Les champs et les jardins avaient été laissés à l'abandon ; chevaux et bétails étaient partis, les seuls qui fussent restés étaient ceux qui ne valaient pas la peine d'être emmenés.\n\nPartout où je suis allé, j'ai été frappé par le spectacle de la misère et de la pauvreté. Ça été une dure épreuve pour moi. Nombre de maisons étaient sans occupants, leurs propriétaires étaient morts ou absents. À la vue de toutes ces ruines, je ne pus retenir mes larmes, tant mon âme était remplie de douleur.\n\nQui aurait pu rester insensible à la vue de ces pauvres et infortunées mères de familles qui venaient entourées de leurs enfants, me serrant la main ? Elles semblaient la personnification de la désolation.\n\nLes petits enfants ne présentaient pas une apparence moins attendrissante. Je les vois encore devant moi, pleurant à chaudes larmes en me racontant les malheurs qui leur étaient arrivés. Ils avaient perdu tout leur linage, au sac de Batoche, et, à leur retour, ils trouvèrent tous les meubles mis en pièces et les murs de leurs maisons complètement dénudés. C'est dans cet état que je les ai trouvés, exposés à mourir de faim, à moins de secours immédiats.\n\nAjoutez à cela, que la plupart de ces pauvres familles portaient le deuil, qui d'un fils, qui d'un époux, ou de l'un et de l'autre enfermés dans la\nprison de Régina, en attendant leur procès, et vous concevrez combien cette population infortunée est digne de compassion.\n\nJe vous supplie, monsieur, de plaider leur cause auprès du public et du gouvernement. Oh ! faites comprendre aux autorités la nécessité qu'il y a de les secourir. Ce sont des êtres humains, et à coup sûr le Canada, ce pays chrétien, ne les laissera pas mourir.\n\nVotre, etc.,\n\nALEXIS ANDRÉ, O.M.I.\nSupérieur des missions du district de Carlton.\n\nPRINCE-ALBERT, 24 juin 1885\nTémoignage du Père André lors du procès de Riel.\n\nRiel a voulu se vendre au gouvernement pour $35,000. \"Si je suis satisfait, disait-il, les Métis le seront.\"\n\nTous les griefs des Métis étaient réglés ou allaient l'être quand Riel leur a fait prendre les armes.\n\n(Extraits du compte-rendu officiel)\n\nPar M. Casgrain:\n\nQuestion.—Je crois qu'au mois de décembre 1884, vous avez eu une entrevue avec Riel et Nolin au sujet d'une certaine somme que l'accusé réclamait du gouvernement?\n\nRéponse.—Non, pas avec Nolin. Nolin n'était pas présent à l'entrevue.\n\nQuestion.—L'accusé y était ?\n\nRéponse.—Oui.\n\nQuestion.—Voulez-vous déclarer ce que l'accusé voulait avoir du gouvernement fédéral ?\n\nRéponse.—J'ai eu deux entrevues avec l'accusé à ce sujet.\n\nQuestion.—L'accusé réclamait une certaine indemnité du gouvernement fédéral ?\n\nRéponse.—Lorsque l'accusé fit sa réclamation, j'étais là avec une autre personne et il voulait avoir $100,000 du gouvernement. Nous fûmes d'avis que cette demande était exorbitante et l'accusé répondit : \"Attendez un peu; je prendrai tout de suite $35,000 comptant.\"\n\nQuestion.—Et à cette condition l'accusé devait quitter le pays si le gouvernement lui donnait $35,000 ?\n\nRéponse.—Oui, c'est la condition que Riel mit.\n\nQuestion.—Quand ceci se passait-il ?\n\nRéponse.—Le 23 décembre 1884.\n\nQuestion.—Il y eut une autre entrevue entre vous et l'accusé, n'est-ce pas ?\n\nRéponse.—Nous eûmes une vingtaine d'entrevues.\n\nQuestion.—N'était-il pas toujours à vous demander de vous servir de votre influence auprès du gouvernement pour lui obtenir cette indemnité ?\n\nRéponse.—Il m'a parlé de cette affaire pour la première fois le 12 décembre. Il n'en avait jamais été question entre nous avant cela, et le 23 décembre, il m'en parla de nouveau.\nQuestion.—Il en a parlé souvent ?\nRéponse.—En deux occasions seulement.\n\nQuestion.—N'était-ce pas sa grande préoccupation ?\nRéponse.—Oui, dans ces deux entrevues.\n\nQuestion.—N'est-il pas vrai que l'accusé vous a déclaré qu'il était lui-même la question métisse ?\nRéponse.—Ce n'est pas ce qu'il a dit en propres termes, mais c'était bien la pensée qui ressortait de ses paroles. Il m'a dit : \"Si je suis satisfait, les Métis le seront.\" Je dois expliquer ceci. On lui objecta que si le gouvernement lui accordait les $35,000 la question métisse resterait toujours la même, et il répondit : \"Si je suis satisfait, les métis le seront.\"\n\nQuestion.—N'est-il pas vrai qu'il vous a dit qu'il accepterait même une somme moindre que $35,000 ?\nRéponse.—Il m'a dit : \"Faites valoir toute l'influence que vous pouvez avoir ; il se peut que vous n'obtenez pas tout cela, mais obtenez tout ce qu'il est possible d'avoir ; si vous obtenez moins, nous verrons.\"\n\nQuestion.—Voulez-vous dire si, depuis l'arrivée de l'accusé dans le pays jusqu'au temps de la révolte, le gouvernement avait fait quelque réponse favorable aux demandes et réclamations des métis ?\nRéponse.—Oui. Je sais qu'il avait acquiescé à certaines demandes concernant ceux qui n'avaient pas eu de scènes dans le Manitoba. Un télégramme, envoyé le 4 mars dernier, accordait les scènes.\n\nQuestion.—Avant ce temps-là ?\nRéponse.—Oui. Quant au changement de l'arpentage des lots le long de la rivière, il y eut une réponse du gouvernement disant qu'il l'accorderait, et c'était une question importante.\n\nQuestion.—Quelle question restait alors à régler ?\nRéponse.—Celle des patentées. Cette question a aussi été réglée en quelque sorte, car M. Duck fut envoyé, et je l'accompagnai en qualité d'interprète.\n\nQuestion.—Quelle autre question restait-il ?\nRéponse.—La seule question du bois, du bois de construction.\nDENONCIATION DU REV. P. FOURMOND.\n\nIl traite Riel d'Antechrist, de révolutionnaire de la pire espèce.\n\nLe massacre des missionnaires est la conséquence de ses plans diaboliques.\n\nQuelques semaines plus tard, le 16 juillet 1885, le Rev. Père Fourmond écrivait au révérend chanoine Grandin, de Laval, France, une lettre terrible contre Riel. Le chanoine Grandin, frère de Mgr Grandin, publia dans la Semaine Religieuse de Laval cette lettre où Riel est dénoncé comme l'Antechrist du Nord-Ouest, comme un révolutionnaire de la pire espèce, comme un apostat, un hérétique, un nouveau Mahomet, comme responsable du massacre des Pères Fafard et Marchand, l'auteur de la ruine des Métis, etc.\n\nVoici cette lettre, qui est datée de Saint-Laurent, district de la Saskatchewan, 16 juillet 1885 :\n\nMonseigneur me charge de vous écrire pour lui et pour moi car il n'a pas un instant à lui ; il adresses des pétitions de tous côtés pour implorer la grâce des pauvres révoltés qui doivent passer en jugement sous peu de jours.\n\nEnfin la paix étant un peu rétablie, Monseigneur a pu quitter Saint-Albert pour venir vers nous ; mais, hélas ! quel changement il trouve dans nos chères missions ; naguère si prospères, tout est ruiné et incendié ; la plupart de nos pauvres Métis sont sans asile et ne possèdent que ce qu'ils ont sur le corps. Aussi jugez, cher ami, de l'accablement et des larmes de votre digne frère. Il nous quitte aujourd'hui pour aller visiter nos Pères, encore plus éprouvés que nous, à Battleford, puis au lac de la Grenouille, pour recueillir et vénérer les restes des PP. Fafard et Marchand, massacrés le vendredi-saint, au moment où ils administraient les mourants.\n\nPour moi, je n'ai pas eu le même bonheur ; cependant, j'ai lu dans plusieurs journaux du Canada et de la France, que le P. Fourmond était au nombre des morts ; mais je viens protester contre cette nouvelle, puisque je vis encore. Sans doute, j'ai été bien près de la mort, car si les balles et la fureur des révoltés m'ont fait défaut, la guerre, L'APOSTASIE, L'HE-\nRÉSIE, LA TRAHISON, LA PERSÉCUTION, L'INCENDIE, LE PIL-\nLAGE, TOUT S'EST DÉCHAÎNÉ CONTRE NOUS ; ou se serait cru à\nla fin du monde. Déjà nous avons notre ANTECHRIST DANS LA\nPERSONNE DE CE FAMEUX RIEL, CONTRE LEQUEL IL NOUS A\nFALLU LUTTER, AU PERIL DE NOTRE VIE, pour détruire sa fu-\nneste influence sur nos pauvres gens.\n\nMon Dieu ! QUEL HOMME, QUELLE HYPOCRISIE, QUELLE IM-\nPEDE TOUT À LA FOIS : il se disait l'envoyé de Dieu, dirigé par les\nanges du ciel qui venaient souvent le visiter. Véritable ange des ténèbres,\nil simulait l'ange de la lumière : c'était un loup caché sous la peau de la\nbrebis pour mieux dévorer le troupeau ; il semblait friser beaucoup et\npratiquait la plus grande mortification ; il ne mangeait que du sang de\nboeuf, suivant à la lettre les impostures diaboliques qu'il avait consignées\ndans un livre écrit de sa main avec du sang.\n\nREVOLUTIONNAIRE DE LA PIÈRE ESPECE, IL VOULAIT TOUT\nDETRUIRE : et s'il réussissait, comme les anges lui en donnaient l'assu-\nrance, disait-il, il voulait, comme un nouveau Mahomet, parcourir les\ndeux mondes en triomphant, POUSSEUR JUSQU'A ROME POUR Y\nMETTRE UN PAPE DE SON CHOIX, qui approuverait son hérésie et\nses rêves orgueilleux.\n\nEnfin il faudrait un livre entier pour raconter toutes les folies perni-\ncieuses de cet homme : et c'est pour ses folies que RIEL A FAIT COU-\nLER LE SANG DE NOS PLUS BRAVES CHRÉTIENS sur le champ de\nbataille de Batoche, du lac la Grenouille, etc.; c'est pour cela QU'IL A\nRUINÉ NOS FAMILLES CHRÉTIENNES PAR LE PILLAGE ET L'IN-\nCENDIE ; c'est par une conséquence horrible de ses plans diaboliques\nqu'a coulé LE SANG DES BLANCS ET CELUI DES CHERS ET ZÈDES\nCONFRÈRES, MASSACRÉS PAR LES SAUVAGES SUR SES OB-\nDRES. Moi-même, avec trois de mes confrères et six bonnes religieuses\nde nos écoles, avons été mis en état de siège, à la mission de Saint-An-\ntoine, après avoir été violemment arrachés de nos missions respectives.\nPendant la bataille de Batoche, qui a duré quatre jours, nous nous som-\nmes trouvés entre les feux des deux armées continuellement ; les balles\nqui sifflaient autour de nous ont criblé notre maison et notre église.\nL'un de nous, le R.P. Moulin, directeur de la mission, fut blessé griè-\nvement par une balle qui lui traversa la cuisse ; le R.P. Le Goff ne dut\nson salut qu'au dévouement de ses chrétiens qui l'arrachèrent des mains\ndes assassins. Enfin je m'arrête, pardonnez-moi ces trop longs détails,\ncar je n'en finirais pas s'il fallait vous raconter toutes nos épreuves ; mais\nla VICTOIRE DU GÉNÉRAL MIDDLETON NOUS A DELIVRES, et\nMonsieur votre frère, est venu cicatriser nos blessures par le baume\nde ses larmes, de ses bonnes paroles et des miséricordes divines dont il\nest le si digne ministre. De grandes consolations pour tous, pasteurs et\ntroupeau, ont été le prix de sa charitable visite.\nSECONDE LETTRE DU P. FOURMOND.\n\nLa révolte s'organisait secrètement depuis un an.\n\nRiel fait prendre les armes aux Métis sous de faux prétextes.\n\nIl s'empare de l'église de Batoche d'une façon sacrilège.\n\nRiel apostasie et déclare qu'il faut détruire la vieille Romaine.\n\nSes blasphèmes contre l'Eglise catholique et ses persécutions.\n\nBaptiste Hamelin refusant d'apostasier est menacé d'être fusillé par Riel.\n\nRiel subira la mort en expiation de ses crimes et du sang qu'il a fait verser.\n\nLes Missions Catholiques du 10 mars 1886 publient une lettre du R. P. Fourmond sur les événements du Nord-Ouest et les terribles épreuves subies par nos missionnaires durant la révolte organisée par Riel contre l'Eglise et contre l'Etat. Voici l'en-tête des Missions ainsi que la lettre qui suit cet en-tête, et que nous signalons à l'attention de ceux qui se sont naïvement laissé persuader que Louis Riel était un héros et un martyr.\n\nDans notre livraison de septembre, nous avons publié une touchante lettre de Mgr Grandin sur la guerre civile qui a désolé le Canada et a causé la mort de deux missionnaires, les PP. Fafard et Marchand. La relation suivante, que nous adressée de R. P. Fourmond, complète les renseignements envoyés par le vénérable évêque, indique les causes et les différentes phases de l'insurrection et raconte plusieurs épisodes dans lesquels éclate la foi admirable des chrétiens du diocèse de Saint-Albert.\nLettre du R.-P. Fourmond, Oblat de Marie immaculée, missionnaire à Saint-Albert, à MM. les Directeurs de l'Œuvre de la Propagation de la Foi.\n\nSAINT-LORENT GRANDIN, 24 mai 1885.\n\nMessieurs,\n\nVous connaissez déjà la terrible tempête qui a tout à coup frappé la jeune Eglise de Saint-Albert et particulièrement nos trois maisons de Saint-Laurent, de Saint-Antoine de Padoue et du Sacré-Coeur, et a fallu tout détruire, tout emporter au physique et au moral. Nous respirons à peine de tous les maux, de toutes les persécutions qui nous ont accablés. Ce n'est pas sans raison que les journaux ont annoncé ma mort et ont publié une notice sur ma vie de missionnaire. Pendant six semaines les balles ont sifflé à nos oreilles, si bien qu'à la fin ce bruit lugubre ne nous inspirait plus de crainte, les témoignages de continuelle et miraculeuse protection que la divine Providence faisait éclater en notre faveur nous remplissant de confiance.\n\nDepuis environ un an, une trentaine d'agitateurs, sous prétexte que le Gouvernement violait leurs droits les plus sacrés, se réunissaient souvent à l'écart dans le bois, à l'ombre des grandes épinettes et complotaient, avec serment de ne dire à personne ce dont il s'agissait.\n\nBien entendu, nous désapprouvâmes hautement ces menées secrètes ; de là, tout à coup, une sourde irritation contre le clergé ; la population nous accusait de ne plus favoriser ses intérêts comme nous avions coutume de le faire. Un premier acte de ces assemblées fut d'aller chercher au-delà des lignes du territoire canadien, sur les rives du Missouri, le trop fameux Riel, le grand chef du mouvement métis en 1870, devenu depuis ce temps citoyen américain et exerçant les modestes fonctions d'instituteur sous la direction des révérends Pères Jés.\n\nIl fut reçu en triomphe par notre population qui le regardait comme son père, son chef, l'espoir de la nation métisse. En arrivant il vint droit à notre mission, me saluant par ces paroles bien belles si elles n'avaient pas été, comme tant d'autres, un effet de l'hypocrisie la plus raffinée.\n\n\"Mon Père, je suis parti avec la bénédiction du prêtre de la paroisse Saint-Pierre, et je viens en arrivant demander au prêtre, en votre personne, la bénédiction dont j'ai besoin avant toute chose pour faire le bien dans ce nouveau pays de la Saskatchewan. Je serais le plus docile, ne voulant rien entreprendre que sous votre direction et votre approbation.\"\n\nJe le félicitai de ces excellentes dispositions. Il édifiât tout le monde par ses longues prières ; la bonne opinion qu'on avait déjà de lui s'accrut vite jusqu'au point de le faire regarder comme un saint.\n\nLe 4 septembre, Mgr Grandin, de retour de son voyage au Caribou, présida une assemblée nombreuse des principaux Métis de la colonie. Les orateurs publics déplorèrent surtout le malaise qui existait entre la population et le clergé et les défiances d'autant plus regrettables que c'était la première fois qu'une situation si fâcheuse se présentait ; on affirma qu'on ne voulait pour rien au monde se séparer des bons Pères.\nqu'on désirait toujours leur obéir. Sa Grandeur nous justifia, et des explications réciproques qui furent pacifiquement données résulteront, à la satisfaction générale, une entente cordiale et l'affirmation solennelle qu'il n'y aurait pas de révolte, que personne n'y songeait, qu'on ne voulait réclamer ses droits auprès du gouvernement que par des moyens légaux. Le prélat proposa alors d'instituer l'union métisse de Saint-Joseph sur le modèle de l'union canadienne Saint-Jean-Baptiste; proposition qui réjouit tous les cœurs. Enfin la bénédiction solennelle de notre évêque vint couronner les décisions de notre pacifique assemblée, et tout le monde se retira content et joyeux.\n\nMonseigneur, qui connaissait particulièrement M. Riel, ne pouvait partager la confiance et la joie générales. \"Je ne puis m'empêcher,\" disait-il, de redouter l'influence de cet homme et de craindre pour l'avenir.\"\n\nCes craintes ne furent que trop justifiées. Pendant les six mois qui suivirent, Riel continua de tromper le public et le clergé par ses paroles séduisantes et ses apparences de pitié; c'était le loup ravisseur caché sous la peau de l'agneau, l'ange de ténèbres déguisé en ange de lumière. Il choisit la belle fête de Saint-Joseph, patron donné par Sa Grandeur à la nation métisse. Sous prétexte de relever la solennité et de faire honneur au baptême d'un néophyte anglais, il convoqua ses amis les plus dévoués et leur fit prendre les armes dès la veille de la fête; puis le soir du même jour, pour effrayer tout le monde et avoir un prétexte pour un appel général à la nation, il répand partout le faux bruit de l'arrivée de cinq cents hommes de la police qui s'avancent pour massacrer les familles, brûler les maisons et s'emparer des terres: \"Il faut marcher au-devant d'eux,\" s'écrie-t-il; si nous sommes unis, ils ne pourront tenir contre nous.\"\n\nUn bon nombre ne voulant pas ajouter foi à ces nouvelles dont on n'avait du reste aucune preuve, refusèrent de se révolter; mais bientôt ils y furent forcés les armes à la main, ou les menaçait même de les fusiller, de piller leurs fermes. Ils céderent presque tous à la force, quelques-uns seulement finirent bon et bravèrent la mort. Dès la veille de la Saint-Joseph, au milieu des ténèbres de la nuit, un gouvernement provisoire fut proclamé et son premier acte fut un acte sacrilège, c'est-à-dire la prise de possession de l'église de Saint-Antoine (Batoche), malgré les protestations énergiques du R. P. Moulin. Le dimanche, 22 mars, un pieux et fervent Métis, l'un des auteurs du mouvement, voyant la mauvaise fortune des affaires, avait déjà refusé de prendre part à la révolte; le jour de la Saint-Joseph, il avait préféré se laisser faire prisonnier plutôt que de participer à tous les crimes qui insinuaient et devaient si honteusement marquer le passage de cette terrible révolution.\n\nIl ne pouvait oublier là miraculeuse protection dont Notre-Dame de Lourdes avait converti sa famille, par la guérison de sa femme qui était depuis longtemps abandonnée des médecins. Pressé d'un côté par la reconnaissance, d'un autre côté par le désir de détourner l'orage qui menaçait de jeter sa nation dans l'abîme, il fait un appel public aux hommes à la porte de la maison du Rév. Père, et là, devant la petite\nchapelle où repose le Très Saint-Sacrement, il leur adresse une chaleureuse exhortation à la prière, à la confiance en Dieu.\n\n— Je pense, ajoute-t-il tout-à-coup, qu'il faudrait de notre part un généreux sacrifice pour détourner les maux qui nous menacent et attirer sur nous la miséricorde et les bénédictions du ciel. Métis, mes frères, êtes-vous capables de le faire ce sacrifice que je veux vous demander ? Répondez !\n\n— Oui, oui, nous sommes prêts à tout, parlé.\n\n— Eh bien, il nous faut solennellement promettre la tempérance ; jurons tous ensemble que jamais une goutte de boisson enivrante ne touchera nos lèvres.\n\n— Nous le jurons, s'écria la foule présente en levant les mains devant le saint tabernacle qui apparaissait mystérieux au fond de la petite chapelle avec sa pauvre croix de bois et ses deux chandelles allumées pour cette solennelle circonstance.\n\nHeureusement les principaux chefs de l'insurrection n'étaient pas là. Dans leur fanatisme impie ils n'avaient pas manqué d'arrêter cet élan des cœurs comme ils le firent plusieurs fois plus tard en ma présence.\n\nMais si tôt qu'ils apprirent ce qui venait de se passer sous l'inspiration si généreuse du bon M. Nolin, leur rage s'en accrut davantage et contre notre sainte religion et contre le dévot serviteur de la Sainte Vierge ; il fut en butte aux menaces les plus terribles et sa condamnation à mort fut prononcée. Comment a-t-il pu échapper à un si grand danger ? Marie veillait sur son serviteur, comme elle a veillé sur tous les siens et sur nous en particulier.\n\nCependant, il leur fallait une vengeance ; elle fut terrible, épouvantable, vraiment diabolique. En voici les principaux coups : Le 25 mars, Riel réunit à son tour dans l'église profanée de Saint-Antoine ses plus chauds partisans, et là, au milieu des scènes où rivalisent le ridicule, la folie, l'impiété, renonce publiquement à la Sainte Église qu'il appellera désormais par mépris la vieille Romaine.\n\nAprès avoir proclamé sa prétendue mission de prophète envoyé de Dieu pour réformer la religion qui, selon lui, à besoin de réformer tous les trois cents ans, il fait apostasier ceux qui l'écoutent ; quelques-uns résistent, d'autres gardent le silence ; ne comprenant pas ce qu'on leur demande ; le plus grand nombre obéit servilement, ne voyant pas assurément les terribles conséquences de leur folle impiété.\n\nLe réformateur se donne le nom d'Exovide et son conseil s'appellera l'Exovidat. La persécution est décrétée contre les fidèles et particulièrement contre le clergé ; on vient nous arracher à nos paisibles demeures, nous et nos pieuses fidèles compagnes de Jésus ; pour nous mettre en état de siège et nous exposer aux plus grands dangers dans le nouveau presbytère de Saint-Antoine (Batoche). Plusieurs fois nous sommes traduits devant l'exovidat, où, entendant les impiétés et les blasphèmes de l'exovide, nous sommes obligés, les P.P., Moulin, Vegreville et moi, de confesser et de défendre notre foi insultée, ce qui nous attira un déluge d'outrages et la menace de nous exposer au feu de l'ennemi, si nous nous obstinons à ne pas vouloir céder au tyran.\nPendant ce temps, des messagers sont envoyés aux pauvres sauvages de la Prairie, pour la plupart infidèles obstinés, toujours mécontents de la domination des blancs et ne demandant pas mieux que de voir arriver, sinon l'heure de la délivrance, du moins celle de la vengeance. La barbarie redevient sanguinaire, féroce comme aux plus mauvais jours, et dans plusieurs places, particulièrement à Frog Lake, lac des Grenouilles, les blancs sont massacrés et avec eux les missionnaires qui voulaient les sauver et empêcher la révolte ; ce sont les RR. Pères Fafard et Marchand. Leur mission est incendiée ainsi que les demeures des blancs.\n\nÀ Batoche, l'Exovide fait réunir les familles de tous les points du district de Saint-Laurent, sous prétexte de les protéger, mais en réalité, afin de les avoir sous la main et de les amener moitié par séduction, moitié par force à l'apostasie. J'ai pu plusieurs fois les consoler et les encourager à tenir bon pour la Sainte-Eglise infaillible. Mais le faux prophète était toujours là sur mes pas pour me combattre et fasciner mes pauvres chrétiens qui, presque tous trompés par ses airs de grande piété et ses prières continuelles, le prenaient pour un saint et un ange descendu du ciel.\n\n\"Comment se fait-il, Baptiste, demandait-on hier à l'un d'entre eux, comment se fait-il que vous ayez été assez aveugle, assez insensé pour refuser d'écouter les Pères et pour croire à cet homme qui vous a perdus ?\n\n\"Vois-tu, mon père, a-t-il répondu avec franchise, explique cela comme tu voudras, mais je te l'avoue franchement, pour ce qui me concerne, j'avais plus confiance en ce malheureux que dans Monseigneur, et vous tous ; pour moi, c'était un homme à miracle, un saint. Aujourd'hui je vois bien que je me suis grossièrement trompé. Que le bon Dieu me le pardonne ! je pense que les autres ont été comme moi.\"\n\nIl s'en faut beaucoup cependant que tous se soient laissé séduire, il y a eu d'admirables résistances et des confessions de foi dignes des premiers temps de l'Eglise. Je dois citer d'abord un Breton, du nom de Rodiguez, qui a rivalisé de courage et de foi avec sa femme métisse ; tous deux ont failli périr victime de leur haine de l'Exovide.\n\nSignalons encore un brave Métis, de Saint-Laurent : il avait su conquérir une certaine indépendance dont il profitait pour faire le bien autour de lui, calmer les esprits, soutenir les faibles. Un jour, il apprend avec une profonde douleur que les apostats ont décidé l'incendie de notre pauvre mais vénérable église de Saint-Laurent. Nouveau Machabée, il s'écrie aussitôt devant le public : \"Plutôt mourir que survivre à un pareil crime, vous me passerez pardessus le corps avant d'accomplir vos abominables projets, et je le vois, je ne suis pas seul prêt à donner ma vie pour la sainte maison de Dieu. Frappez, si vous l'osez !\"\n\nTant de fermeté arrête les incendiaires.\n\nMais le plus admirable de tous est notre cher Baptiste Hamelin, père d'une nombreuse famille, élevé dans la piété et la crainte du Seigneur. Lui aussi, comme le bon M. Nolin, avait vu son pauvre foyer visité par la sainte Vierge. Sa femme avait été miraculeusement guérie. Il fut un de ceux qui résisteront à toutes les provocations et qui, à mon appel, au\nmilieu du camp et en présence du séducteur, cria à haute voix : \"Vive la vicelle Romaine ! Vive le Saint Père le Pape !\"\n\nPersécuté de plus en plus, condamné à être fusillé, il se voit entouré par les Séides de l'Exovide. La couronne du martyr est suspendue sur sa noble tête ; à quelques pas sont sa femme et ses nombreux enfants qui tremblent pour ses jours, mais demeurent fermes comme lui. Il est animé d'un courage surhumain, ses regards habituellement doux deviennent tout à coup terribles.\n\n\"Eh bien ! s'écria-t-il puisqu'il vous faut le sacrifice de ma foi ou de ma vie, mon choix est fait depuis longtemps, le bon Dieu me donne assez de force pour braver vos menaces et vos fusils ; si un seul de mes frères ici présents, en a le cœur, qu'il frappe ! Vous pouvez me fusiller, mais me faire renoncer à ma religion, jamais !\"\n\nLes apostats vaincus se retirèrent la honte au front, n'osant pas tremper les mains dans le sang de leur frère, et la rage du tyran, une fois de plus, échoua impuissante contre la fermeté d'un juste.\n\nJe ne puis passer sous silence la foi d'un vieux patriarche, Joseph Quellette, on 83 ans. Tout, vieux qu'il est, recevant la nouvelle que ses parents, ses enfants et petits-enfants ont pris les armes pour leur droit et leur terre, il sent bouillonner encore le vieux sang français dans ses veines, il décroche son fusil si redoutable aux buffalos et au gibier de la Prairie, et le voilà parti lui aussi pour le combat. C'était, il faut le dire à sa louange un grand serviteur de Notre Très Saint-Père le Pape, pour la conservation duquel il faisait célébrer plusieurs messes chaque année.\n\nL'Exovide le voyant arriver eut pitié de ce bon patriarche et voulut le renvoyer. Mais il ne réussit pas mieux que ses enfants. Comme il lui manifestait des craintes sur l'issue du combat.\n\n\"Aie confiance, mon petit-fils,\" lui dit le courageux vieillard, Notre Saint Père le Pape va nous porter bonheur.\"\n\n\"—Mon grand-père,\" reprit l'apostat, \"ne parlez pas ainsi. Le Pape, on n'en use pas.\"\n\n\"Eh bien, malheureux ! si tu n'en uses pas, moi, j'en use et je veux mourir son serviteur.\"\n\nEn effet, quelques jours après il tomba frappé au cœur au premier rang. Je l'ai vu couché sur le champ de bataille, on eût dit qu'il sommeillait, tant son visage était calme et vénérable malgré les cruelles étreintes de la mort. Je crus faire une bonne œuvre en honorant ce vieillard, qui de son vivant commandait à tous le respect, en lui procurant un cercueil, ce qui ne put être fait pour les autres victimes du combat.\n\nDe mauvais la folie et l'hypocrisie d'un seul homme ont accumulées sur notre pauvre petite population ; une vingtaine de tués, autant de blessés, des incendies, des pillages ; quel sombre et lugubre tableau nous avons eu sous les yeux ! Tout n'est pas fini encore, une trentaine de nos malheureux chrétiens sont prisonniers de guerre et attendent leur jugement à Régina, capitale du Nord-Ouest Territoire. L'Exovide Riel est du nombre, et il est le seul, croit-on généralement, qui subira une\nSENTENCE DE MORT EN EXPIATION DE SES CRIMES ET DU SANG QU'IL A FAIT VERSER.\n\nMgr Grandin vient de passer au milieu de nous. Que de larmes il a répandues ! Mais aussi quel bien nous a fait sa paternelle charité : les faibles se sont élevés et, nous en avons tous la confiance, cette épreuve va tourner à la plus grande gloire du Seigneur qui l'a permise ; ce sera le fruit de miséricorde produit par les prières de tout le monde, car on a prié jour et nuit, même parmi les apostats. Oui je suis convaincu que c'est un merveilleux effet de la prière si nous n'avons pas été anéantis.\n\nFOURMOND, O. M. I.,\nMissionnaire apostolique.\nPREMIERE LETTRE DU FRÈRE PIQUET.\n\nRiel ennemi implacable du gouvernement, du clergé et des Métis.\n\n\"Si nous sommes vaincus, la corde en attend plusieurs d'entre nous,\" disait-il.\n\nSi Riel eut triomphé, il aurait mis à mort les prêtres, religieux et métis qui n'auraient pas apostasié.\n\nIl se fait un rempart des femmes et des enfants à Batoche.\n\nIl traite les Canadiens-français de canailles!\n\nEn même temps que les lettres des Pères André et Fourmond, sont venues celles du Frère Piquet, de la même Congrégation des Oblats. Ces lettres qui sont aussi d'un témoin oculaire, contiennent la charge la plus accablante possible contre Riel, que le révérend Frère traite de monstre, de cœur de tigre, d'apostat, de traître, etc., etc. Voici ces lettres, par ordre de date:\n\nTout le monde dans le Canada a entendu parler de Riel, tout le monde connaît son histoire, mais personne n'a porté sur lui un jugement véritable, ses ennemis mêmes sont restés au-dessous de la vérité. Le moment n'est pas loin où la vérité se fera jour partout et brillerà de tout son éclat. Ce moment est venu pour nous. Les actes que cet homme a posés depuis qu'il est venu dans ce pays jusqu'au jour où la police s'est emparée de sa personne, permettent de dévoiler au public les mystères que Louis Riel a toujours soigneusement cachés dans les replis de son cœur.\n\nCE QUE JE VAIS AVANCER EST SI SUR QUE JE PUIS EN DONNER DES PREUVES IRREPUTABLES A TOUT HOMME QUI M'EN FERA LA DEMANDE.\n\nRIEL ÉTAIT L'ENNEMI IMPLACABLE DU GOUVERNEMENT CANADIEN, DU CLERGE CATHOLIQUE ET DE SES CONCITOYENS LES MÉTIS. Comment s'y est-il pris pour arriver à son but? Son principal moyen a été la dissimulation, l'hypocrisie. Oui, cet homme, depuis son arrivée dans ce beau pays de la Saskatchewan, a fait de la dissimulation la règle constante de sa conduite. Riel, qui avait répudié sa patrie pour se faire Américain, savait bien que le gouvernement ne consentirait jamais à traiter avec lui. On peut donc dire maintenant que toutes ses\nassemblées, ses paroles, ses démarches ne tendaient qu'à un seul but : SOULEVER LES MÉTIS ET LES SAUVAGES pour créer un gouvernement provisoire. IL SAVAIT BIEN PAR AVANCE QUE LES SUITES DE CETTE RÉBELLION LUI SERAIENT FUNESTES ET LUI METTRAIENT LA CORDE AU COU, mais cette terrible perspective n'a pas été capable d'arrêter une seule minute SON ESPRIT DE VENGEANCE. Il s'est écrié dans les premiers jours de son provisoire : \"SI NOUS SOMMES VAINCUS, LA CORDE EN ATTEND PLUSIEURS D'ENTRE NOUS.\" Il voyait clairement le malheur, la misère dans laquelle il allait plonger les Métis, le sang qu'il allait verser et toutes les suites désastreuses de la rébellion.\n\nMAIS DANS CE COEUR DE TIGRE BATTAIT AUSSI LA HAIPE DU CLERGÉ. A sa première visite au R. P. Fourmond, en juillet, à Saint-Laurent, j'étais présent ; il prit toutes les apparences d'un homme pieux, soumis au clergé. Si, dans ce moment, il m'avait été donné de connaître toute la haine que cet homme avait pour l'Eglise catholique et ses prêtres, j'aurais frémis d'épouvante.\n\nCETTE HAIPE ÉTAIT D'AUTANT PLUS HORRIBLE ET REDOUTABLE QU'ELLE ÉTAIT CACHÉE SOUS L'EXTERIEUR DE LA PIÈTE. Il savait bien que le clergé opposerait une forte barrière, à ses projets ambitieux. Riel n'étant sans doute, depuis longtemps, CATHOLIQUE QUE DE NOM.\n\nDepuis son arrivée, le premier juillet 1884, jusqu'au dix-huit mars 1885, premier jour de la rébellion, CHACUNE DE CES COMMUNIONS FRÉQUENTES A ÉTÉ UN HORRIBLE SACRILÈGE ; LES PREUVES EN SONT PALPABLES aujourd'hui. Il s'est SERVI DE DIEU POUR COMBATTRE DIEU, SON ÉGLISE ET SES PRÊTRES, ET, CE QUI PARAIT PLUS SURPRENANT, LES MÉTIS, SES FRÈRES. S'il eut été vainqueur, IL EUT MIS À MORT TOUS LES PRÊTRES, LES RELIGIEUSES ET TOUS LES MÉTIS QUI N'AURAIENT PAS VOULU EMBRASSER LA RELIGION QU'IL AURAIT FABRIQUÉE lui-même.\n\nJe ne puis aujourd'hui entrer dans tous ces détails ; plus tard, j'espère pouvoir satisfaire pleinement le lecteur. Je m'occupe en ce moment à RÉUNIR LES MATÉRIAUX POUR FAIRE L'HISTOIRE DU TRISTE DRAME DONC NOUS VENONS D'ÊTRE LES SPECTATEURS.\n\nJe finirai en disant que Louis Riel avait une telle haine pour les Métis, ses frères, que, non content de faire massacrer les hommes, IL S'ETAIT ENCORE FAIT UN REMPART DES FEMMES ET DES ENFANTS. Grâce à la Providence, trois ou quatre femmes seulement ont été blessées. On assure aussi qu'un enfant l'a été. IL DISAIT AVEC JOIE LE SOIR DE LA DERNIÈRE BATAILLE, au moment où il se savait avec les femmes et les enfants : \"J'ai été pauvre pendant quinze ans, oh ! bien, les Métis seront aussi pauvres pendant quinze ans.\" PRESQUE TOUS LES MÉTIS ONT ÉTÉ ENTRAINÉS PAR FORCE À LA REBELLION PAR CE MONSTRE DE RIEL.\n\nVoilà ce Riel qui dans le Conseil devant les RR. Péris de ce district et son secrétaire Garnot, Canadien-Français, disait : \"CES CANAILLES DE CANADIENS-FRANÇAIS.\" Cette parole, paraît-il, avait fait tomber la plume de Garnot qui en signe de honte avait baissé la tête.\nDEUXIÈME LETTRE DU FRÈRE PIQUET.\n\nL’apostasie de Riel, ses insultes aux prêtres.\n\n“La vieille Romaine est cassée,” dit Riel.\n\nBATOCHÉ, 19 juin 1885.\n\nDepuis que la rébellion est finie nous sommes bien tranquilles ici. Mercredi, 9 juin, les prisonniers métis et sauvages ont quitté Prince-Albert et sont partis pour Régina.\n\nIci la tranquillité est rétablie. Mon Dieu ! que nous avons souffert dans cette terrible insurrection. Nous venons d’être témoins de bien tristes choses. QUEL HOMME QUÊ CE LOUIS DAVID RIEL ! Non content d’avoir ENTRAÎNÉ SES COMPATRIOTES DANS L’INSURRECTION, IL EN A FAIT ENCORE APOSTASIER un grand nombre. Tout le monde sait maintenant que le premier jour de la rébellion, Louis Riel s’est DÉCLARÉ APOSTAT et a voulu FONDER UNE NOUVELLE RELIGION. Il a renoncé au Pape. “LA VIEILLE ROMAINE EST CASSÉE” disait-il. Il a remplacé le dimanche par le samedi, il a rejeté le dogme de l’Eucharistie, nié la divinité du Christ et celle du Saint-Esprit. Suivant lui le Père seulement était Dieu.\n\nTous les matins comme les infidèles sauvages, il racontait ses rêves.\n\nPendant ces deux malheureux mois, IL A DIT AUX RR. PERES, TOUTES LES INSULTES POSSIBLES ET IMAGINABLES. Il disait qu’ils étaient vendus au gouvernement et SOULEVAIT LES SAUVAGES CONTRE EUX parce qu’ils préféraient la mort plutôt que d’adhérer à ses monstrueuses erreurs.\n\nPendant la rébellion tous les sauvages Cris et Sioux se sont montrés très polis et très affables pour nos Pères. Les Métis se sont bien montrés aussi, excepté cependant quelques-uns. Voici une épisode qui fait honneur aux sauvages.\n\nLe samedi 9 mai, premier jour de la bataille de Batoche, après que les troupes du gouvernement eurent battu en retraite pour regagner le camp, on vit accourir de plusieurs points des Métis et des sauvages qui poussaient des cris de joie. Ils viennent nous toucher la main avec émotion de cœur. Ils courent par-ci par-là pour s’emparer du butin et des vivres qu’ils supposent que les Polices ont abandonnés dans leur fuite précipitée. Ils cherchent, rodent d’un bord et d’autre, et à leur grand désappointement ils ne trouvent que la voiture du Révé P. Fourmond, qu’ils font\ndéjà rouler vers la petite ville. Mais on dit aux Sioux que c'est la voiture du Père et aussitôt ils abandonnent leur capture. Les Sioux tirent en l'air plusieurs coups de fusil en signe de réjouissance.\n\nPlusieurs, entr'autres un métis français que je connais bien, rentrent dans la maison du Père Moulin. Quelqu'un dit : Les polices ne reviendront plus. Il voulait dire que la peur les avait fait fuir. Je ne veux point nommer tous ceux qui se trouvaient dans la maison lorsque Gabriel Dumont rentrait tout à coup, s'écria avec colère : \"Il y a ici des blessés,\" il s'adressait aux RR. Pères, ne les cachez pas, vous nous traguez toujours.\"\n\n\"Cherchez partout, lui répondit le Rév. P. Fourmond avec calme, et deux hommes sont chargés de la visite. Doucement, disaient les Métis, doucement, Gabriel. Dans ce moment même où Gabriel parlait aux RR. Pères d'un ton si brutal, un sauvage qui n'a, je crois, que la moitié du nez, voulait faire peur, réputé pour le plus mauvais sauva... à place tire son couteau du fourreau en peau, et menaçant Gabriel il appuie contre sa poitrine son couteau-poignard et, le menaçant, il dit d'une voix forte et grommelante : \"Si tu fais peur aux Pères, moi aussi je vais te faire peur.\" Gabriel, en effet, se radoucit. Il y a longtemps, disait-il, que l'on aurait foncé sur la police si l'on n'avait pas voulu ménager la mission, mais on les tient maintenant, le steamboat est échoué et j'ai mis des hommes pour le garder. Vite on va poursuivre les polices, les attaquer pendant la nuit et s'emparer de leur camp, c'était là un rêve qu'il faisait depuis longtemps.\n\nMais la nouvelle religion de Riel avait mis le trouble dans les esprits et découragé beaucoup de monde.\nTROISIÈME LETTRE DU FRÈRE PIQUET\n\nRiel auteur des troubles doit seul être puni.\n\nC'est lui qui a tout fait, les membres de son Conseil n'étant que des statues.\n\nRiel prémeditait la révolte depuis quatre ans. Il en avait écrit le plan dans un livre écrit de sa main avec du sang de buffle.\n\nIl fait prendre les armes par ruse, mille témoins peuvent l'attester.\n\nCet homme là n'est pas fou. Il est responsable de tous les malheurs causés par la rébellion.\n\nJe suis heureux aujourd'hui de pouvoir vous envoyer cette correspondance et de vous aider à faire le bien que vous vous proposez par la publication de votre estimable journal. Je commencerai donc par vous parler de nos prisonniers. QUEL EST L'AUTEUR DES TROUBLES DU NORD-OUEST ? C'EST LOUIS RIEL. Si c'est Riel qui est l'auteur des troubles du Nord-Ouest, C'EST LUI SEUL QUI DOIT ÊTRE PUNI. Mais, me direz-vous, les autres aussi ont participé à la révolte. Si comme moi vous aviez suivi pas à pas, étudié à fond L'HYPOCRISIE, LA FINESSE, LA RUSE ET LES AUTRES MOYENS SECRETS DONC RIEL S'EST SERVI POUR TROMPER ET SÉDUIRE CE PEUPLE ET POUR L'ENTRAÎNER À LA REBELLION DE GRÈCE OU DE FORCE, comme moi vous rejettez sans peine sur cet HOMME CRUEL ET TYRANNIQUE LA CULPABILITÉ DE CETTE REBELLION. Riel s'est servi de leur religion, il s'est servi de leur ignorance, de leur simplicité, et a touché toutes leurs cordes sensibles pour en faire le jouet de ses ambitions. Ainsi je le répète, que l'on examine bien la cause, que l'on entend des témoignages dignes de foi, que l'on scrute avec soin la conduite de Riel depuis son arrivée dans le pays jusqu'au jour où il a levé l'étendard de la révolte, et l'on se convaincra facilement de la vérité que je viens d'énoncer. Ils ont été trompés, ces pauvres ignorants ! Voyez la placidité et la confiance avec laquelle ils ont été se livrer entre les mains du gouvernement. Aurait-il été se livrer s'ils s'étaient sentis coupables ? Les uns ont été entraînés et les autres forcés de prendre les armes, et c'est le plus grand nombre. Mais les conseillers sont au moins\ncoupables dites-vous ? Riel par son astuce, son audace, par la peur qu'il inspirait avait toujours entièrement dominé le conseil. Figurez-vous des STATUES SIÈGEANT DANS LE CONSEIL et vous aurez une idée des conseillers. Ceci est si vrai que CE QUE RIEL VOULAIT LE CONSEIL LE VOULAIT. TOUT CE QUE RIEL NE VOULAIT PAS, LE CONSEIL NON PLUS NE VOULAIT PAS. Car sa raison était toujours la meilleure et tout le monde se rangeait à son avis. En effet, ces gens étant naturellement religieux, comment pouvait-il en être autrement lorsque Louis David Riel leur disait : \"L'Esprit de Dieu m'a dit, l'Esprit de Dieu m'a révélé.\" Même en matières religieuses, combien y en a-t-il qui l'ont contrarié ? Deux seulement, l'un est mort et l'autre est en ce moment prisonnier. Lorsque LA PRÉSENCE SEULE DE RIEL FAISAIT TREMBLER TOUT LE MONDE, comment les conseillers n'auraient-ils pas tremblé eux aussi devant lui.\n\nLes Métis français qui ont commencé les troubles dans le Nord-Ouest ne sont pas si coupables que le public hostile se le figure généralement. Celui qui, comme moi, a suivi pas à pas et étudié à fond L'HYPOCRISIE, LA FINESSE, LA RUSE et les autres moyens secrets dont Riel s'est servi pour tromper et séduire ce peuple, naturellement si simple et si paisible, rejetera sans peine sur cet homme cruel et tyran toute la culpabilité de cette rébellion. DÉJÀ DEPUIS QUATRE ANS IL PRÉMEDITAIT LES TROUBLES qu'il vient de faire, et en avait tracé le plan dans un livre écrit de sa propre main, avec du sang de buffle. Louis Riel avait profité d'une occasion favorable pour venir dans ce pays.\n\nL'histoire de ce mouvement nous montre Napoléon Neault, commerçant métis, se concertant avec Riel, dans une entrevue qu'il eut avec lui à la Rivière-Rouge, dans l'été de 1833. Ce Neault, une fois arrivé dans la Saskatchewan, n'a eu rien de plus empressé, de concert avec Nolin-Maxime Lepine et Gabriel Dumont, que de réunir la première assemblée qui donna naissance au mouvement politique dont Riel devait être l'âme.\n\nMais je dois dire ici que quelques mois avant la rébellion CHARLES NOLIN S'ETAIT SEPARE DE RIEL et travaillait contre lui. L'insurrection étant survenue, IL AVAIT ÉTÉ PRIS DE FORCE PAR RIEL ET CONDAMNÉ À MORT PAR LUI, et avait profité de la première occasion favorable pour se sauver à Prince-Albert.\n\nComme les enfants qui veulent mal agir se cachent de leur père, ainsi Riel, oui je dis Riel, avait donné sans nul doute, le mot d'ordre : non seulement de ne pas consulter les RR. Pères, dans une question si grave, mais encore de mépriser leurs avis, si le but de l'assemblée tenue secrète venait à être dévoilé.\n\nDepuis son arrivée dans ce district, on verrait Riel faire beaucoup de politesses et de bassesses aux RR. Pères, étudier leurs caractères et se flatter parmi eux par une dissimulation constante. Sous des formes fines et rusées, il travaillera sans cesse à les mépriser en cachette. Ainsi, avec ce poing celui du serpent, sa tactique continue sera de diminuer leur influence sur le peuple, pour augmenter la sienne.\nMalgré son habileté pour se cacher, SA DOCTRINE PROTESTANTE ET RATIONALISTE et la haine qu'il cachait dans son cœur se faisaient jour malgré tout, mais il savait toujours s'excuser, s'humilier et revenir sur ses pas.\n\nL'indigence même avec ses privations était pour lui un moyen d'arriver à son but. Mais comme le serpent fasciné l'oiseau pour l'attirer à lui et pour en faire sa pâture, ainsi RIEL FASCINAIT LE PAUVRE PEUPLE MÉTIS ET L'ATTIRAIT À LUI POUR EN FAIRE LE JOUET DE SES AMBITIONS ET SATISFAIRE SA SOIF DE VENGEANCE. On ne peut pas se faire une idée du DEGRÉ DE FINESSE DE CET HOMME; tout entre ses mains, même l'événement le plus insignifiant, était une arme, une force pour aider à ses plans. La religion, la morale, l'instruction et la simplicité lui servaient de moyens pour arriver à ses fins. C'EST ENCORE PAR LA RUSE QU'IL FAIT PRENDRE LES ARMES AUX MÉTIS, MILLE TÉMOINS PEUVENT LE CERTIFIER; la force fait rendre ceux que la ruse n'a pu rassembler. Un des plus puissants moyens de cet homme était d'inspirer la terreur à tout le monde, aux intelligents comme aux ignorants. Les moyens lui avaient tellement réussi que sa parole seule était écoutée. Il pouvait leur faire avaler la mer et les poissons. Il faisait tourner toute chose à la glorification de sa propre personne. LE CLERGÉ AVAIT TOUT FAIT POUR PRÉVENIR SA REBELLION et pour l'empêcher d'éclater. DANS LA CHAIRE, dans les conversations privées, LE CRIME DE LA REBELLION AVAIT ÉTÉ EXPLIQUÉ ET DÉNONCÉ.\n\nLe refus des sacrements, la menace d'une mort éternelle, TOUT AVAIT ÉCHOUÉ, RIEL SEUL ÉTAIT ÉCOUTÉ. Mais la constance et la persévérance du prêtre avaient produit quelques fruits.\n\nPlusieurs métis avaient promis de ne jamais tirer sur les soldats du gouvernement et plusieurs même avaient eu le courage de déposer leurs armes. La religion rationaliste de Riel avait achevé de mettre le trouble parmi les métis.\n\nQUELQUES PERSONNES DISENT QUE CET HOMME EST FOU, MAIS PLUS ON EXAMINE SA CONDUITE, PLUS ON RESTE CONVAINCU QUE CET HOMME NÉFASTE, SOUS L'APPARENCE DE FOLIE, CONSERVAIT LA PLÉNITUDE DE SA RAISON, car tous ses dessins avaient une suite et une conséquence qui montraient un plan arrêté pour atteindre son but et pour échapper à la corde, s'il échouait dans son entreprise criminelle.\n\nRIEL DOIT PORTER TOUTE LA RESPONSABILITÉ DE CETTE REBELLION, C'EST À LUI SEUL QUE L'ON DOIT ATTRIBUER TOUS LES MALHEURS passés et à venir, suites nécessaires des troubles qui nous ont fait tant souffrir.\nQUATRIÈME LETTRE DU FRÈRE PIQUET\n\nLe plan diabolique de Riel\n\nIl dit que l'église catholique est pourrie, il vomit d'horribles blasphèmes en présence des missionnaires.\n\nIl empêche les Métis d'aller à la messe, il insulte les prêtres, menace de les chasser du pays.\n\nDétails sur ses impostures\n\nLes faits que je vous expose aujourd'hui, j'en ai été le témoin oculaire et auriculaire, ces faits sont aussi attestés par tous les Métis français et les personnes dignes de foi de cette contrée. Depuis le premier jour où M. Louis \"David\" Riel est arrivé dans ce pays, je l'ai suivi pas à pas, et je puis dire que je le connais à fond. Comme son plan prémédité était de TONDER UNE NOUVELLE ÉGLISE, adaptée comme il le disait lui-même aux besoins et au tempérament des Métis, le plus grand obstacle qui devait s'opposer à l'établissement de sa nouvelle religion, sans nul doute proviendrait du clergé. Je ne parlerais pas aujourd'hui du plan systématique qu'il a suivi : je ne dirais pas non plus de quelle manière il est parvenu à DÉTRUIRE UNE PARTIE DE L'INFLUENCE QUE LES PRÊTRES DE CE DISTRICT AVAIENT SUR LES METIS FRANÇAIS POUR SE L'ASSUMER SUR SA PROPRE PERSONNE. Mais qu'on me permette seulement de tracer les grandes lignes de ce PLAN DIABOLIQUE. Les traits empoisonnés que Louis \"David\" Riel lançait aux Réverends Pères et à tout le clergé étaient toujours enveloppés de pompeux éloges, et s'il discutait avec les prêtres il voulait toujours avoir le haut du pavé.\n\nS'il priait beaucoup et s'approchait souvent des sacrements, c'était pour dire à ses gens, qu'il savait simples, ignorants, confiants et naturellement religieux — Voyez, je suis meilleur que les prêtres, je prie plus qu'eux. Il priait quelquefois des nuits entières.\n\n— S'il était pauvre et paraissait aimer à être mal vêtu, c'était pour dire à ses gens : Voyez les prêtres sont dans le confortable. Ils ne manquent de rien, et moi je suis mal vêtu et je n'ai pas seulement un morceau de pain pour donner à ma femme et à mes enfants, je vis de la charité publique.\n—S'il faisait un grand étalage de son savoir, et si, dans ses discussions, il aimait à tenir le haut du pavé, surtout devant le monde, c'était pour dire à ses gens : Vous voyez, JE SUIS PLUS SAVANT QUE LES PRÊTRES.\n\nAussi, c'était là en effet le dictum populaire.\n\nRiel, à leurs yeux, était UN GRAND SAINT, un excellent homme, un grand savant. Ainsi, TOUT CE QUE RIEL A DIT, tout ce qu'il A FAIT depuis son arrivée et pendant son séjour dans ce pays, IL L'A DIT ET IL L'A FAIT POUR FAIRE UNE GUERRE À OUTRANCE AU GOUVERNEMENT ET À LA RELIGION CATHOLIQUE. Or, le premier jour qu'il commence la rébellion, il jette son masque et apostasie devant le R. P. Moulin et le public.—VOUS ÊTES UN HERÉTIQUE, M. RIEL, s'écria le Père. Le même jour, vers dix heures du soir, il vient à la mission de Saint Laurent, et en présence des R. P. Fourmond, Vegreville, du R. P. Paquet et de deux métis, il vomit D'HORRIBLES BLASPÈMES, et d'une voix irritée il s'écrie : \"LA VIEILLE ROMAINE EST CASSEE, LE PAPE EST TOMBÉ, Mgr Grandin n'est plus évêque\" ; et se tournant vers les Révérends Pères : \"Vous serez les premiers prêtres de la nouvelle religion.\" etc. Le jour avant de quitter Batoche pour aller camper avec sa troupe au lac des Canards, IL RENONCE AU PAPE, ET Y FAIT RENONCER UNE PARTIE DE SES GENS, DANS L'ÉGLISE MÊME DE SAINT ANTOINE, QUE QUELQUES JOURS AUPARAVANT IL AVAIT PRISE DE FORCE, malgré les protestations du curé de la paroisse. DEBOUT SUR LA MARCHE DE L'AUTEL, IL INSULTE LE DIEU DU TABERNACLE, et en disant : Recevez le Saint-Esprit, il pousse des beuglements, il danse lui-même et fait danser dans le lieu saint. Dans toutes ses prêches, l'église catholique, les prêtres et les évêques sont l'objet de ses diatribes, il se dit prophète et envoyé de Dieu pour REFORMER L'ÉGLISE CATHOLIQUE, QUI, TOUS LES TROIS CENT ANS, DISAIT-IL, A BESOIN D'ÊTRE REFORMÉE ; les nombreux miracles que je ferai seront une preuve éclatante de ma mission. Il prie et fait prier sans cesse, quelquefois nuit et jour. Il leur disait encore : \"Dieu est avec nous, si les munitions nous manquent, les flèches tombent du ciel pour disperser nos ennemis.\" Il assurait souvent qu'il n'y aurait pas de sang versé. C'est à cause de cette assurance sans doute, qu'après la bataille du lac des Canards, IL A LAISSÉ LES MORTS QUATRE JOURS SANS SEPULTURE, disant qu'il allait les ressusciter. C'est ainsi qu'il se jouait d'eux tout le temps. Après avoir rejeté le Pape, Louis \"David\", Riel, Exovide, rejette aussi le dimanche, et choisit le samedi pour le jour du repos. Les noms de chaque jour de la semaine sont aussi changés, et le premier de mai est le jour choisi par lui pour la célébration de la Pâque. C'est ce jour-là même que RIEL L'APOSTAT appela les RR. PP. Fourmond, Moulin et Vegreville devant l'Exovidad ; car tel est le nom qu'il avait donné à son conseil. Et devant ce Sanhedrin presque tout hérétique, il accable chaque Père séparément de toutes les insultes qu'il peut trouver. ON PEUT DONNER DES PREUVES IRREFUTABLES DE LA HAINE QUE RIEL AVAIT POUR LE CLERGÉ. IL VOMISSAIT MÊME LES PLUS GRANDES INSULTES CONTRE\nMGR TACHE SON BIENFAITEUR. Ceux qui ne voudraient pas y croire qu'ils demandent des informations aux Pères Oblats du district de Saint-Laurent.\n\nPendant deux mois qu'a duré la rébellion, je ne pus pas dire COMBIEN DE FOIS LES RR. PP., TENUS COMME PRISONNIERS À BATOCHÉ, ONT ÉTÉ INSULTÉS PAR RIEL QUI DISAIT QU'UNE TOUTE L'ÉGLISE CATHOLIQUE ÉTAIT POURRIE.\n\nLes rêves qu'il a écrit de sa propre main pendant son Provisoire et que j'ai lus, et d'autres documents irréfutables, me permettent d'exposer ici sa doctrine. Les erreurs qu'il a prêchées, les RR. PP. eux-mêmes de ce district les ont entendues et combattues.\n\nIl niait la divinité du Fils et du Saint-Esprit, il disait en parlant de lui : C'est moi qui suis le Saint-Esprit, suivant lui il n'y avait que le Père qui était Dieu, le Fils n'était fils de Dieu que par adoption. La Sainte-Vierge par conséquent n'était pas, disait-il, la mère de Dieu. Aussi, au \"je vous salue Sainte-Marie mère de Dieu,\" il faisait dire à ses sectaires : Sainte-Marie, mère du fils de Dieu. Il se disait être en communication avec la divinité, toutes ses révélations (rêves) commençaient ainsi : L'Esprit de Dieu m'a dit, l'Esprit de Dieu m'a révélé ; lorsqu'il parlait ainsi, c'était article de foi, il fallait y croire, alors toute discussion avec lui devenait inutile. Toutes les erreurs ci-haut mentionnées et les suivantes, c'était toujours l'Esprit de Dieu qui les lui avaient révélées. C'est par le même moyen qu'il connaissait le présent, le passé et l'avenir, mais il faut dire ici en passant qu'aucune de ses prophéties ne s'est réalisée. On attend encore le grand miracle qu'il disait devoir se faire. Il niait aussi la présence de Notre-Seigneur dans la Sainte-Eucharistie. Comment, disait-il, Notre-Seigneur qui avait six pieds et demi peut-il être dans une petite hostie ? Je dois dire en outre qu'il EMPLOYAIT, AUTANT QU'IL LE POUVAIT, LE MONDE D'ALLER À LA MESSE.\n\nIl disait que l'enfer n'était pas éternel, rejetait les épîtres de saint Paul. Par ses rêves on voit clairement que le Dieu qu'il invoquait n'était pas le Dieu des Chrétiens. C'était un Dieu matériel. Dans la divinité, dit-il dans ses rêves, il y a bien des matières laiteuses. Il voulait faire une religion composée de la religion catholique, de la religion protestante et de l'ancienne religion des Sauvages.\n\nTous les matins il racontait son rêve comme un indien. Voici quelques-unes de ses révélations : L'Esprit de Dieu m'a dit que je serais blessé légèrement au haut de l'annulaire.\n\nL'Esprit de Dieu m'a fait voir un quart, au fond de ce quart ces paroles étaient écrites : \"Les entrailles du Nord.\" Oh mon Dieu ! donnez-moi les entrailles du Nord, je vous en conjure au nom de la Sainte-Vierge, au nom de Saint-Joseph et de Saint-Jean-Baptiste.\n\n\"O mon Dieu, donnez-moi les canons de Middleton, un canon, deux canons, trois canons.\n\n— L'Esprit de Dieu m'a fait voir la nation métisse sous la forme de Geneviève Arcan, etc.\n\nLe 4 mai il vient au presbytère de Batoche où tous les pères du district\nétaient réunis. Damase Carrière était avec lui. \"Mes RR. Pères, dit-il, \"je viens de la part du Conseil vous transmettre l'ordre que désormais \"je serais votre directeur.\" Tous les Pères d'une voix unanime : \"NOUS \"NE RECONNAISSONS POUR NOTRE DIRECTEUR QUE MONSEI- \"GNEUR GRANDIN, on vous l'a déjà dit ; il VOUS EST PLUS FA- \"GILE DE NOUS ENVOYER UNE BALLE QUE DE NOUS FAIRE \"CHANGER DE RELIGION.\"—J'espère, répondit Riel d'un air hypo- crite, que dans ce beau mois de Marie la Sainte-Vierge changera vos sen- timents.—Nous faisons gloire, dirent encore les Pères, d'appartenir à la VIEILLE ROMAINE.—Si je fais un traité avec le Canada, JE VOUS, CHASSERAI DE CE PAYS, leur dit encore Riel.\n\nJe finirai par un fait récent. Riel disait après sa capture devant plu sieurs officiers : c'est fâcheux que je n'aie pas pu tenir plus longtemps PERSONNE JUSQU'A CE JOUR N'A EU UN MEILLEUR PLAN QUE MOI POUR DÉTRUIRE LA RELIGION CATHOLIQUE.\n\nIl y a deux mille ans, répondit un des officiers, que des hommes comme vous s'attaquent au rocher de la religion catholique, ils n'ont pas pu en- coré l'ébranler. Vous monsieur Riel, vous êtes comme un maringoin, vous ne ferez qu'ébrécher ce rocher.—Vous êtes catholique repartit Riel—Oui, je suis catholique et je suis bien plus convaincu de ma religion en voyant un homme comme vous.\n\nLe texte original des lettres du Rév. Frère Piquet se trouve au bureau de la Minerve ou quiconque pourra l'examiner s'il le désire.\nLE MARTYRE DES PÈRES FAFARD ET MARCHAND\n\nRACONTE PAR SA GRANDEUR MGR GRANDIN\n\nConséquences de la révolte du Nord-Ouest\n\nLa mission du lac à la Grenouille est mise en cendre.\n\nLes Pères Fafard et Marchand tombent sous le couteau des sauvages, martyrs de leur dévouement apostolique.\n\nLes soldats du 65e élèvent une croix à l'endroit du martyr.\n\nOn a pu voir, par les lettres précédentes, dans quelles circonstances les Pères Fafard et Marchand avaient été massacrés par les sauvages. Voici maintenant le touchant récit qu'a fait Mgr Grandin de la découverte des cadavres des martyrs, de leur ensevelissement, ainsi que des désastres éprouvés par la mission du Lac à la Grenouille, dans une lettre adressée par Sa Grandeur au père et à la mère du R. P. Fafard :\n\nLe 6 août, après la sainte messe, nous laissions le R. P. Remas avec les Cris, et le R. P. Legoff et moi nous rendîmes au lac à la Grenouille. Notre première visite fut, bien entendu, au cimetière : tous les deux nous priâmes et pleurâmes sur les tombes de nos frères. Le vieux père du misérable sauvage qui a donné le coup de mort au cher P. Fafard, était venu du lac d'Oignon en même temps que nous ; bien qu'il n'eût point été témoin du massacre, il savait où les victimes étaient tombées, les ayant vues plusieurs fois. Il nous conduisit d'abord à la place où le P. Fafard avait été frappé à côté de Delaney ; il se coucha lui-même dans la position du cadavre de notre frère et s'unit à nous pour prier.\n\nQuelques centaines de pas plus loin, il nous montra où était tombé le cher P. Marchand et se coucha aussi à la place où était son corps.\n\nCes deux places, comme tout le terrain, du reste, étaient recouvertes de grandes herbes en fleurs, mais la place même où nos pauvres frères avaient versé leur sang, étaient absolument nue, on n'y découvrait pas le plus petit brin d'herbe.\n\nAprès avoir fait là différentes prières et marqué les places où ces dignes missionnaires étaient tombés, nous retournâmes au cimetière : deux ou\ntrois familles qui avaient eu connaissance de notre arrivée nous y attendaient, et deux Montagnais se trouvant là de passage se joignirent à nous. Ayant revêtu les ornements pontificaux, nous chantions un libera sur les tombes, puis, afin que les fidèles puissent s'unir à nous, nous récitons ensemble le chapelet. Pendant le chant du libera, me tenant sur mes gardes, je pus chanter tout le temps : il n'en fut pas ainsi au chapelet, l'émotion me gagna tellement que je dus le faire réciter par mon compagnon.\n\nQuant nos prières furent terminées, j'engageai les assistants à revenir le lendemain pour les messes, et nous allâmes ensuite visiter les ruines que nous n'avions pas encore vues. Quelle désolation ! cet établissement si propre, si complet en tout, grâce en partie à votre charité, cher Monsieur Fafard, et à l'énergie et à l'activité de votre digne fils, il n'en reste absolument plus rien que des cendres et du fer brûlé ; il n'y a pas jusqu'à la cloche suspendue à un clocher noir attenant à l'église, et que pour cette raison le feu avait laissé intacte, elle y était encore le 8 de juin, des soldats l'ont descendue, et nous avons eu beau chercher nous n'avons pu la trouver. Pour ce qui est du mobilier, voitures, bibliothèques, sacristerie, que le cher Père avait pu mettre sur un bon pied, grâce à votre généreuse charité et à celle de ses amis, tout a absolument disparu.\n\nJ'espère que le gouvernement me tiendra compte d'une partie de ces pertes ; je le lui demanderai du moins, mais supposons qu'il me paie absolument l'équivalent de nos pertes, ce qu'il ne fera pas, il y a quelque chose qu'il ne me rendra pas, ce sont mes zélés et dévoués missionnaires. Joignez-vous à moi, chers parents et amis de nos Martyrs, pour demander au bon Dieu de m'envoyer d'autres missionnaires, aussi dignes que possibles de leurs prédécesseurs. Nos pauvres chrétiens, devenus orpheline, me demandent d'espérer, beaucoup de ceux qui, jusqu'à présent, ont résisté à la grâce, semblent décidés aujourd'hui à embrasser la foi. Est-ce qu'autrefois le sang des Martyrs n'était pas une enseigne de chrétiens ? J'espère qu'il en sera encore ainsi, et si nous obtenons par nos prières des ouvriers comme il nous en faut, et les moyens pécuniaires pour les entretenir, nous pourrons relever les établissements de leurs ruines et en fonder même de nouveaux.\n\nJe reviens à nos chers défunts. Des chrétiens n'ayant ni le temps, ni la liberté de les ensevelir, les portèrent avec respect dans le caveau de l'église, avec les corps des deux autres victimes, mais les malfaiteurs ayant mis le feu à l'église, les corps furent passablement endommagés.\n\nIl n'est pas vrai, suivant que certaines personnes l'ont rapporté, que leurs corps aient été mutilés : les sauvages se sont permis ces traitements à l'égard des soldats, peut-être aussi de quelques employés du gouvernement ; mais ils ont respecté les corps des prêtres.\n\nEn ce moment, je reçois le journal du cher P. LeGoff, il y a longtemps qu'il me l'avait adressé, mais à cause de mes voyages continus, il n'a pu me rencontrer que maintenant. Je vais copier mot à mot les renseignements qu'il me donne, concernant les faits du Lac la Grenouille.\n\nCe pauvre père a été pendant plus d'un mois, lui et ses chrétiens, pri-\nsommiers de Gros-Ours, il parle d'une danse superstitieuse dont il a eu la douleur d'être témoin. C'est lui maintenant qui va parler :\n\n\"Mais, Monseigneur, ce qui ajoutait encore à l'horreur de cette danse et achevait de lui donner un caractère vraiment satanique, c'étaient les profanations que ces barbares y mettaient. Le croirez-vous, ils ont dansé avec les soutanes de nos deux prêtres et les ornements de nos églises. Vous représentez-vous bien le bel effet que devaient faire une quinzaine de démons de cette sorte, la tête ornée de plumes et de pendeloques, le visage affreusement barbouillé, celui-ci affublé d'une soutane, celui-là le dos couvert d'une chasuble en drap d'argent, un autre d'une chasuble en drap d'or, tel autre d'une chasuble en drap noir, tel autre d'une chape, etc. Enfin toutes les soutanes de nos deux prêtres et tous les ornements de leur église y ont passé sauf quelques voiles et manipules que les Métis du lac la Grenouille ont pu arracher à des sauvages moins pervers en les payant. Je leur aurais pardonné de bon cœur s'ils m'avaient fait partager le sort des bons pères Faïard et Marchand. Je ne pouvais faire un pas hors de ma loge sans voir flotter au bras ou au cou de quelqu'un tantôt une étoile ou autre partie de nos ornements sacrés. Pendant le long mois que j'ai passé dans cet enfer, j'ai dû presque chaque jour, subir, sans mot dire, le dégoût de voir passer et repasser devant moi, un jeune homme vêtu d'une robe, autrefois magnifique, maintenant souillée et coupée à la taille du sire qui la portait. Un autre sauvage avait cru bien de se tailler un capot dans une chape du P. Faïard, un autre s'était taillé un tapis de selle dans une des plus belles chasubles. Et ce crevé cœur, je l'ai eu tous les jours de ma captivité, bien que pourtant il ait été tempéré par quelques adoucissements.\n\nIl me fut d'abord bien doux d'apprendre que le sort de mes deux confrères, tombés sous les balles des assassins, avait touché le cœur de quelques personnes compatissantes qui n'avaient pas craint de rendre à leurs corps, et cela au péril de leur vie, le devoir que leur état réclamait.\n\nUne vieille femme nommée Matchekeway, racontait en pleurant à nos Montagnais, ce qu'elle avait fait, vu le péril auquel elle s'était exposée; alors que toute marque d'intérêt donnée à nos deux martyrs, ne pouvait qu'exaspérer les Cris, ce qu'elle avait fait, dis-je, me parut grand à moi.\n\nQu'avait-elle donc fait ? Eh bien elle avait lavé le visage des Pères Faïard et Marchand, lorsqu'ils étaient encore étendus au lieu où ils étaient tombés. Elle le fit dans un état de satisfaction facile à comprendre, allant et venant de l'un à l'autre, s'y prenant et s'y reprenant encore avec le respect et la tendresse d'une mère, et avec cela cherchant dans son cœur une prière pour eux et ne pouvant que pleurer.\n\nCe premier devoir rempli, il s'agissait de transporter les corps en tel lieu où l'on put les ensevelir convenablement. Deux Métis, sans calculer les dangers auxquels ils s'exposaient, mais néanmoins que leur respect et leur dévouement voulurent s'acquitter de ce dernier devoir et tenant à faire les choses convenablement, ils revêtirent les deux corps d'ornements sacrés et les déposèrent ainsi dans la cour de l'église sans les couvrir de terre. Voilà ce que firent de grands coeurs. Vous savez le reste.\"\nMa citation est longue, mais je crois que pour votre intérêt elle ne l'est pas trop; si j'en avais eu connaissance plus tôt, j'aurais pu abréger mon rapport à moi et c'en eut été mieux, maintenant finissons. Le feu, bien entendu, endommagea les cadavres et l'église disparaissant, ils demeurèrent découverts.\n\nS'il faut en croire un journal anglais de Winnipeg, je ne sais plus lequel des soldats leur aurait donné une première sépulture, et cela avec tout le respect et la piété possibles et quelques jours après, le R. P. Prévost, aumônier du 65e, qui avait tant à cœur d'honorer ses frères martyrs put satisfaire sa piété paternelle en transportant les corps dans le cimetière de la mission, et cela, avec toutes les cérémonies de l'Eglise.\n\nLe jour même que les soldats faisaient la première sépulture, le R. P. Prévost se trouvait à cinq ou six milles de là, avec les officiers et soldats du 65e;\n\nIls eurent l'excellente idée d'élever une belle grande croix à la mémoire de nos martyrs, et l'aumônier la bénit; j'ai salué de loin ce monument de la piété des braves soldats canadiens, et ceux qui voyageront sur la Saskatchewan le feront comme moi.\n\nLe 7 août, le R. P. Legoff et moi offrîmes le Saint Sacrifice sur la tombe de nos chers martyrs, assistés des quelques chrétiens qui s'étaient unis à nous la veille, puis nous allâmes passer quelques jours avec nos bons Montagnais.\n\nLe mardi 11 août je repassais encore, et j'enfonçai autant que possible une planche à la place même où mes chers missionnaires sont tombés, afin de ne pas l'oublier. Le 12 au soir, je renouvelais mon pèlerinage avec le bon Père Rémas qui, après avoir terminé sa mission auprès des Cris, voulut se donner la consolation de prier et de pleurer sur la tombe de ses frères et à la place où ils étaient tombés. Cette fois nous étions absolument seuls. Je vis cependant avec plaisir que ces tombes avaient été visitées après moi, car on avait déposé une fleur aux pieds des croix.\n\nMaintenant l'établissement du lac la Grenouille est absolument détruit et je doute qu'il se relève de sitôt, les sauvages, honteux et effrayés, s'en tiennent éloignés, ceux qui y habitaient vont probablement se joindre à ceux des autres réserves.\n\nSi les circonstances me permettent de relever la mission du lac la Grenouille, je ferai transporter dans l'église les corps de nos chers frères, si je ne puis la relever, je les ferai transporter dans l'église de la mission la moins éloignée, je ferai en sorte qu'on plante plus tard, au moins une croix à chacune des places où nos chers Pères sont tombés.\n\nCher monsieur et chère madame Fafard, je suis presque honteux de ma longue lettre, de tous ces détails si intimes qui n'ont pu que vous faire répandre des larmes. Je ne regrette pourtant pas de l'avoir fait, car j'en suis sûr, ces détails si tristes qu'ils soient, vous êtes heureux de les connaître. J'ai si peu de regrets de vous les avoir écrits, que je vais immédiatement les copier presque mot à mot pour les envoyer à la famille du regretté P. Marchand; lui et le cher P. Fafard s'aimaient comme deux frères; ils se voyaient souvent, ainsi que leurs autres frères des missions environnantes, ils se soutenaient mutuellement dans leurs nombreuses\ndifficultés, tous les deux ont été en même temps victimes de leur dévouement, martyrs de la charité, tous deux expirant l'un à côté de l'autre, la mort même n'a pu les séparer.\n\nJe regrette que la distance qui sépare les deux familles qui les pleurent ne leur permettent pas de se voir, de se communiquer leurs peines et de se consoler mutuellement.\n\nLa congrégation des Oblats et le diocèse de Saint-Albert sont comme deux autres familles qui se sentent frappées avec vous, qui mêlent leurs regrets et leurs larmes aux vôtres. Si les peines nous sont communes, nous partagerons aussi la gloire et l'honneur de vos chers martyrs, ne l'oubliions pas. Si les familles Faïard et Marchand ne peuvent se voir et communiquer entre elles, je m'efforcerai de leur servir d'intermédiaire, bientôt, je l'espère, j'aurai la consolation de vous voir et, tôt ou tard, si Dieu me prête vie, je verrai aussi la famille Marchand.\n\nEn attendant, au nom de nos chers enfants, de nos chers martyrs, je vous bénis en commun et vous prie de me croire votre tout dévoué et respectueux\n\n† VITAL J.,\nEvêque de Saint-Albert, O. M. I.\nDeuxième lettre de Mgr Grandin\n\nRiel représente les prêtres comme vendus au gouvernement\n\nLes prêtres ont tout fait pour empêcher la révolte\n\nLes horreurs de la guerre\n\nL'attitude du clergé de la Saskatchewan, à l'égard des rebelles est nettement définie dans cette lettre ; mais Mgr Grandin l'avait encore mieux établie pendant l'insurrection, dans la lettre suivante, adressée au R.P. Antoine, supérieur des Oblats à Montréal, et qui était une réponse péremptoire aux accusations de complicité portées contre le clergé de la Saskatchewan par les journaux libéraux, entre autres le Globe, le Witness et l'Aurore. Il est aussi question dans cette lettre des massacres et déprédations commis par les sauvages, soulevés par Riel :\n\nMon cher Père,\n\nLes auteurs de la révolte, croyant que nous nous opposions à leur mouvement, ce que nous faisons évidemment, nous représentent comme des hommes vendus au gouvernement, qui s'entendent avec lui pour les aveugler. Ils n'auraient pas voulu nous faire massacrer sans doute, mais les sauvages, dont la majorité sont encore infidèles, une fois excités, c'est comme le feu de nos prairies, qu'on ne peut plus l'arrêter. J'ai le cœur gros de douleur, les yeux fatigués de pleurer ; on massacre nos pauvres pères, on saccage nos établissements, on brûle ce qu'on ne peut prendre.\n\nQui sait ce que le bon Dieu nous réserve ? Nous n'avions plus d'argent mais nous avions des établissements. Que va-t-il nous rester des misères à soulager, la famine peut-être, car ces révoltés n'ont pas semé et pour vivre, vont détruire tous les animaux domestiques du pays.\n\nIci l'excitation est grande, les sauvages qui nous entourent nous ont donné beaucoup d'inquiétude. La population étrangère au pays surtout a été effrayée. Nos pères font ce qu'ils peuvent pourtant, pour apaiser les sauvages. Les Pères Scollen et Gabillon, qui se trouvent avec la plus grosse bande, avec les sauvages, les plus dangereux, ont vraiment été exposés. Le Père Scollen a été admirable de prudence et d'énergie. Il a fait déposer les armes à ses sauvages, leur a fait restituer des choses\nvolées, a empêché l'effusion du sang, a rendu les plus grands services au gouvernement, au pays et aux sauvages eux-mêmes. Et cependant, jusqu'à présent, chaque fois que les sauvages ont menacé de se révolter, si un missionnaire se trouvait avec eux, il était accusé de les pousser à la révolte. Que n'a-t-on pas dit et écrit contre le Père Scollen lui-même? Nous ne sommes point des révolutionnaires.\n\nNous déplorons de grands malheurs, et ces malheurs vont encore augmenter nécessairement et nous mettre dans une grande détresse. Je ne sais ce que je pourrai entreprendre pour faire face à tous les besoins. Dès qu'il sera possible de voyager, je vais visiter nos missions, ou du moins les places où elles étaient. Je vais probablement aller pendant l'hiver tendre là main quelque part. Priez et faites prier pour nos chers Pères. Je ne sais ni quand ni comment je pourrai vous envoyer cette lettre, peut-être demain, peut-être dans huit ou dix jours. Si alors j'ai d'autres nouvelles, je tâcherai de vous les donner.\n\nP. S.—Le 26 avril, nous avons été agréablement surpris par le cher Père Lacombe. Les Pieds-Noirs étaient encore tranquilles quand il est parti. Mais nos mauvaises nouvelles se confirment toujours. J'ai des nouvelles du lac la Biche; on y était tranquille, il y a une dizaine de jours.\n\n+ VITAL J.,\nEvêque de Saint-Albert, O. M. I.\nTroisième lettre de Mgr Grandin\n\nIl traite Riel de misérable maniaque, d'espèce de possédé,\nde nouveau Mahdi\n\nLes ruses hypocrites par lesquelles il a trompé les Métis\n\nIl demande grâce pour les autres prisonniers de Regina,\n\"plus bêtes que coupables\"\n\nSir Adolphe Caron a cité une lettre, au cours du débat, sur la\nquestion Riel, qu'il importe de mettre sous les yeux du lecteur.\nCette lettre qui était adressée au ministre de la milice, est de Sa\nGrandeur Mgr Grandin, et porte la date du 16 juillet 1885 :\n\nHonorables et cher monsieur,\n\nAssurément les troubles du Nord-Ouest n'ont pas manqué de vous pré-\noccuper beaucoup et il me semble que Votre Honneur doit respirer plus\nà l'aise, maintenant qu'ils sont apaisés. Je partage pleinement votre\nsatisfaction, cependant je dois ajouter que chez moi elle est loin d'être\ncomplète. La révolte m'a tout particulièrement blessé au cœur ; j'ai\nsouffert de voir nos si bons métis trompés par un MISÉRABLE MANIAQUE,\nmépriser nos avis, se dénier de notre dévouement, se déclarer contre le\ngouvernement, contre l'Eglise et contre Dieu. J'ai été surtout bien\npéniblement affecté de voir, à LA VOIX DE CETTE ESPÈCE DE POSSÉDÉ, les\nsauvages se soulever et aller jusqu'à massacrer des personnes qui ne leur\navaient fait aucun mal, qui ne leur avaient fait que du bien, des per-\nsonnes, qui, comme nos chers missionnaires Fafard et Marchand, leur\navaient tout sacrifié, leur existence même. Les massacres, la destruction\npresque entière de plusieurs de nos établissements ; absolument com-\nplète de plusieurs autres, la pauvreté, le malaise, l'inquiétude, la crainte,\nle découragement chez les vaincus, la haine et le désespoir chez beau-\ncoup, voilà surtout ce qui m'effraie et me fait presque oublier mes mal-\nheurs personnels. Chacun assurément souffre plus ou moins de ces\nmalaises et de ces funestes prévisions ; et il me semble que j'en souffre\nplus qu'aucun autre.\n\nJ'adresse à l'honorable ministre de la justice une pétition en faveur des\nmétis compromis dans cette regrettable révolte, non que je l'approuve,\nbien loin de là, mais je sais positivement que ces pauvres révoltés ont été\nodieuxement trompés, on a abusé de leur simplicité et on leur a fait prendre les armes, sans presque qu'ils s'en doutassent. Un misérable avait capté leur confiance, en se donnant comme un homme divin ; ils étaient convaincus qu'il avait une puissance presque divine ; ils redoutaient ses colères et ses menaces, il aurait eu la foudre en main, qu'il ne serait pas fait rédouter davantage. Il n'en est pas venu là tout d'un coup. Il a profité de tout, de sa popularité d'autrefois, de sa réputation, de la confiance et de l'affection que ses compatriotes lui portaient, de leur esprit vraiment religieux, et parfois superstitieux ; et surtout de leurs griefs contre le gouvernement, comprenant pourtant que pour en devenir absolument maître, il avait besoin de la religion, il a commencé par faire des efforts pour se gagner l'appui du clergé, tout en travaillant à aigrir les métis contre le gouvernement. Il lui a été trop facile de réussir sur ce point, mais il n'a pu venir à bout des prêtres. Pour obvier à cet échec, il a travaillé longtemps, pour faire croire à ses compatriotes qu'il était un grand saint. Il passait les jours et les nuits en prières, il jeunait souvent et disait à tous qu'il avait une mission vraiment divine. Il a fini par se donner comme l'homme de Dieu, et dès lors rien ne le géna plus. Jouissant d'une autorité divine, il était supérieur au clergé et à toute religion. Il n'avait à la bouche que ces mots : \"Il faut que la volonté de Dieu s'accomplisse.\" Plusieurs de ses compatriotes ont été effrayés de ses excès ; comme les prêtres, ils ont voulu lui résister ; dans les disputes, il les battait par ses injures, ses mensonges et ses menaces ; il les faisait emprisonner, il les condamnait à mort même. Comprisant qu'il était impossible de lui résister, beaucoup se réfugièrent soit à Prince-Albert, soit dans le bois. À leur retour, ils se sont trouvés ruinés comme les autres.\n\nAinsi honorable et cher monsieur, la plupart des prisonniers de Regina sont victimes du terrorisme surtout ; ils sont plus bêtes que coupables, et pour cette raison je demande qu'on soit indulgent pour eux. En demandant cette faveur au gouvernement, je puis dire que je serais appuyé par toutes les personnes respectables du pays, de toutes nationalités et de toute dénomination religieuse.\n\nPour ce qui est des conseillers de ce nouveau Madhi, comment les justifier ? Hélas, cher monsieur, ces pauvres gens ont été choisis positivement à cause de leur ignorance et de leur timidité. Dans les assemblées, ils n'osent pas ouvrir la bouche ; on prenait les résolutions à leur nez et ils ne savaient pas même de quoi il s'agissait ; aujourd'hui, l'épouvante est chez tous les métis du district ; je dirais même dans toute la nation, bien que se louant de la noble conduite du général Middleton qui me disaient de pauvres mères et des missionnaires, agissait plus en père qu'en vainqueur.\nLettre du Père Leduc\n\nLes horreurs causés par le soulèvement des Sauvages\n\nLe martyre des Pères Fafard et Marchand, la destruction de plusieurs missions, la fuite des religieuses\n\nLes Pères Vegreville, Fourmond, Touze, Moulin et cinq religieuses prisonniers de Riel, exposés aux feux des deux armées. Le P. Moulin blessé à la jambe\n\nRiel est condamné à périr par la corde. Puisse-t-il revenir au bon Dieu et abjurer ses erreurs!\n\nLe 19 novembre 1885, l'Union, de Paris, reproduisait une lettre adressée à un prêtre de Rome, par le Père Leduc, O. M. I., Grand-Vicaire de Mgr. Grandin. Dans cette lettre datée du 18 août, le révérend Père parlait du massacre du lac Grenouillé, des excès des Sauvages, poussés par Riel, et qui voulaient se débarrasser des blancs et de leurs prêtres. Il parle aussi des souffrances endurées par les missionnaires et les religieuses tenus par Riel à Batoche et délivrés par le général Middleton. Voici cette lettre :\n\nSAINT-ALBERT, le 18 août 1885.\n\nMonsieur et bien digne collègue,\n\nJ'arrive d'une longue excursion à Calgary, Regina, Winnipeg, Saint-Boniface, Qu'Appelle, Batoche, Duck-Lake; Prince Albert.\n\nParti le 20 mai, je suis rentré à Saint-Albert le 11 août, après avoir visité le théâtre de la malheureuse guerre par laquelle nous venons de passer.\n\nLa mission du lac Grenouillé a été détruite de fond en comble : école, presbytère, église, tout a été livré aux flammes, par les sauvages révoltés, les chers Pères Fafard, canadien, et Marchand, du diocèse de Rennes, ont été massacrés par les infidèles, leurs cadavres horriblement mutilés, leurs cœurs arrachés et sans doute dévorés.\n\nTous les deux sont glorieusement tombés sous les balles des païens\nqui les immolaient à leur haine aveugle et insensée. Tous les deux sont tombés en pratiquant la noble vertu de charité, portant secours aux victimes que faisaient les infidèles et s'efforçant d'apaiser, de calmer la fureur des Indiens. Ceux-ci, aveuglés par de pernicieux conseils, voulaient se débarrasser non seulement des blancs, mais de leurs prêtres et de leur religion.\n\nDans notre deuil profond, une immense consolation nous reste, c'est que nous avons deux martyrs, deux protecteurs de plus auprès du bon Dieu ; c'est que l'honneur, la grâce insigne du martyr du sang a été accordée aux Oblats de Marie Immaculée dans ces vastes territoires du Nord-Ouest, dans ce cher diocèse de Saint-Albert.\n\nLa mission du lac d'Agnéau a été anéantie aussi et brûlée ; celle de Notre-Dame de Pontmain a été pillée ; celle de Battleford, du lac Canard, de Batoche et de Grandin ont souffert beaucoup, et les pertes matérielles que nous avons éprouvées s'élèvent à une somme très considérable.\n\nLes Sœurs de Charité de deux de nos missions se sont réfugiées sur des îles, au lac Labiche et à l'île de la Crosse, afin d'échapper au danger, redouté plus que la mort, de tomber entre les mains des sauvages.\n\nLes Pères Vegreville, Fourmond, Touze, Moulin et cinq Sœurs, fidèles compagnes de Jésus, sont restés, pendant des semaines, prisonniers du fameux Riel, chef des Métis révoltés.\n\nPendant la bataille de Batoche, c'est-à-dire pendant quatre jours entiers, Pères et Sœurs sont restés exposés au feu des deux camps ennemis ; la maison d'école, qui leur servait de PRISON, se trouvant malheureusement prise entre deux feux, celui du général Middleton pour le gouvernement, et celui des Métis insurgés ; le R. P. Moulin a été blessé d'une balle à la jambe. Dans cette maison, qui fut criblée de balles, c'est un vrai miracle que les autres Pères et Frères se soient échappés sains et saufs.\n\nMgr-Grandin est parti, depuis quelque temps, pour aller pleurer et prier sur la tombe de nos martyrs.\n\nLa guerre est finie et le chef de l'insurrection doit monter à l'échafaud le 18 du mois prochain, condamné à périr par la corde. Puissait-il revenir au bon Dieu et abjurer ses erreurs ! Car ce malheureux insensé a voulu s'ériger en prophète, en réformateur, en quelque chose de divin, en un mot. Il a poussé la folie jusqu'à vouloir fonder une nouvelle religion, entraînant avec lui un certain nombre de pauvres ignorants...\n\nMerci, cher et vénéré collègue, de tout votre dévouement pour le diocèse de Saint-Albert. La somme que vous envoyez à l'occasion des noces d'argent d'épiscopat de votre saint ami, somme si généreuse, pour fonder de nouvelles missions, a été employée. Aujourd'hui, ce sont des ruines nombreuses que nous devons relever. Merci encore une fois de votre charité et de votre générosité...\n\nPriez et faites bien prier pour nos pauvres missions, et veuillez me croire votre tout dévoué et très respectueusement affectueux collègue,\n\nHENRI LEDUC, O.M.I.,\nVicaire-Général.\nLe récit d'une religieuse de Batoche\n\nCinq semaines d'emprisonnement et de terribles anxiétés\n\nPrêtres et religieuses s'attendent au martyre d'un jour à l'autre\n\nRiel apostasie et veut établir sa nouvelle religion par la violence\n\nIl défend toute relation entre les missionnaires et les Métis, sous peine d'emprisonnement.\n\nLes coupables sont ceux qui ont soulevé les Sauvages\n\nLes missionnaires ont raconté les horreurs de la révolte de la Saskatchewan. Ils ont dit combien ils ont eu à souffrir de Riel, qui, ayant apostasié, voulut soustraire les Métis—et il ne réussit que trop malheureusement—à la salutaire influence du clergé. Si les Métis eussent écouté leurs meilleurs amis, les missionnaires, que de maux ils auraient évités !\n\nLes religieuses n'ont pas été mieux traitées que les prêtres. Ces saintes femmes n'ont pas été respectées. À chaque instant elles s'attendaient à la mort, au martyr !\n\nOn connaît les atrocités qui se sont commises ou que l'on se proposait de commettre.\n\nDans la lettre qui précède, le Père Leduc parlait des horreurs de la captivité où Riel avait tenu les Prêtres et les Soeurs. Ce qu'il dit est pleinement confirmé par le récit suivant, publié par une sœur de la Saskatchewan, dans le Tablet, journal catholique de Londres :\n\nLes bons Pères (Moulin et Vegreville) s'installèrent dans le rez-de-chaussée et eurent la complaisance de nous laisser la seule pièce qui composait le premier étage. C'est là que nous avons passé près de cinq semaines, pendant lesquelles la douleureuse anxiété où nous nous trou-\nvions a dû compter, je l'espère bien, comme une expiation pour nom des fautes commises dans le passé. Bientôt les missionnaires paroisses voisines arrivèrent, de sorte que la communauté des Obla comptait cinq membres dans moins d'une semaine après notre arrivée. Une tertiaire de saint François s'établit dans le grenier. Ainsi le toit hospitalier de Saint-Antoine abritait les sujets de trois différents ordres religieux.\n\nLe 23 avril, les éclaireurs de Riel apportèrent la nouvelle que les troupes canadiennes approchaient de Qu'Appelle. Immédiatement une bande d'environ cent-quinze métis et sauvages se porta à leur rencontre. Ils firent halte un instant à la porte du révérend Père pour lui dire adieu. Les sauvages s'élançaient en avant en poussant leur terrible cri de guerre. Ils offraient un spectacle étrange dans leur tenue de combat, nus, ou à peu près, car ils avaient rejeté leurs couvertures afin de pouvoir manier plus à l'aise leurs fusils et leurs couteaux, mais tout frais peints et tatoués.\n\nLe lendemain matin au moment où retentissait le premier coup de feu, à l'engagement de l'Anse-au-Poisson, nous sommes tombés à genoux et avons récité le rosaire avec ferveur pour les nombreuses âmes qui étaient jetées dans l'éternité. De la porte de l'habitation les Pères entendirent les détonations. Il nous semblait affreux de n'être qu'à une douzaine de milles d'un champ de bataille ; nous étions loin de penser à ce qui nous était réservé.\n\nAvec le temps les efforts déplorables de Riel pour établir sa nouvelle religion augmentèrent de violence, et par malheur il ne trouva que trop d'adhérents parmi les gens simples qui l'entouraient : La sainte autorité de nos pères, la divinité de Notre-Seigneur, la maternité divine de Marie, la présence réelle de Jésus-Christ dans le divin Sacrement de l'Eucharistie, tout cela fut renié. Conformément aux décrets de Riel et de son conseil, Pâques fut fixé au 1er mai. Ce jour-là les Pères furent sommés de comparaître devant le conseil, et leur héroïque défense fut récompensée par des insultes et des menaces ; de ce jour ils devinrent de véritables confesseurs de la foi. On ne voulut pas leur permettre de retourner dans leurs missions respectives, même pour une heure, et tout rapport avec leurs ouailles leur fut strictement défendu. Tous ceux qui venaient, soit pour assister à la messe ou pour voir les Pères, étaient menacés des chaînes et de la prison.\n\nNous nous trouvions ainsi réellement prisonniers à Saint-Laurent. Les Pères étaient prêts à toute eventualité et s'attendaient d'un jour à l'autre à mourir comme martyrs ; nous avions l'espoir de partager nous aussi leur heureux sort.\n\nDes hommes que les missionnaires avaient comblés de bienfaits et dont les enfants étaient élevés par charité dans notre petit pensionnat, proposèrent dans le conseil de brûler l'église et le couvent de Saint-Laurent Grandin, mais la proposition rencontrera de l'opposition et fut ajournée plus tard.\n\nLe 1er mai nous régimes une lettre qui confirmait la nouvelle du mas-\nsacre des Pères Fafard et Marchand. Le signataire, le Père Cochon, était lui-même prisonnier dans le camp des Sioux ; il exprimait son ardent désir d'être trouvé digne de donner sa vie pour le salut de ces pauvres infidèles.\n\nNous étions encore sous le coup de l'émotion produite par cette lettre, lorsque, vers 6 heures du soir, nous vimes l'habitation environnée par une bande de sauvages à l'aspect terrible. Ils firent cercle devant la porte et leurs fusils en joue, ils commencèrent le chœur le plus infernal que nous avons jamais entendu de gosses sauvages. Nous pensions que notre dernière heure était arrivée et nous n'avons pas perdu de temps pour nous préparer à la mort. Mais il paraîtrait que les sauvages n'étaient pas venus avec de mauvaises intentions. C'est du moins ce que nous avons supposé charitalement, car ils se retirèrent tous dès qu'ils eurent reçu des Pères un peu de tabac, comme présent.\n\nPauvres sauvages ! Je ne crois pas qu'ils puissent être blâmés pour leurs méfaits, car ils ne savent ce qu'ils font. Les coupables sont ceux qui les ont soulevés.\n\nOui, les coupables sont ceux qui ont poussé les Métis et les Sauvages à la révolte. Ces hommes-là peuvent exciter notre pitié, mais ils ne sauraient mériter ni la couronne du martyr ni celle du patriote.\nRiel dénonce Sa Grandeur Mgr Taché\n\nRiel trompe Mgr Taché en le rassurant sur le but pacifique de son agitation\n\nIl vomit les plus grandes insultes contre son bienfaiteur\n\nIl traite Nos Seigneurs Taché et Grandin de voleurs et de canailles\n\nDans une de ses lettres, le Révérend Frère Piquet, parlait en ces termes de l'ingratitude de Riel et de sa haine envers le clergé.\n\nOn peut donner des preuves irréfutables de la haine que Riel avait pour le clergé. Il vomissait même les plus grandes insultes contre Mgr Taché son bienfaiteur. Ceux qui n'y voudraient pas croire, qu'ils demandent des informations aux Pères Oblats du district de Saint-Laurent.\n\nLe Frère Piquet avait raison de dire que Sa Grandeur Mgr Taché a été le bienfaiteur de Riel. C'est à l'archevêque de Saint-Boniface que Riel doit d'avoir été conduit, tout jeune encore, au séminaire de Montréal, où les messieurs de Saint-Sulpice lui donnèrent gratuitement son instruction.\n\nInjurier, outrager son bienfaiteur était donc l'un des actes les plus coupables, les plus odieux, les plus injustifiables qu'il put commettre. Il n'a pas reculé devant cette infamie.\n\nPeu après son arrivée dans la Saskatchewan, Riel écrivit à Mgr Taché pour l'informer du but de son agitation qu'il disait devoir être toute pacifique. Cette lettre porte la date du 25 juillet 1884. En voici un extrait :\n\nMonseigneur, mes démarches ne sont pas des démarches de trouble. Je me propose d'agir dans le Nord-Ouest de la manière la plus propre à me gagner l'approbation des gens honnêtes et paisibles des deux côtés des lignes. J'ai des amis en Canada ; j'en ai dans les États-Unis. Il est de bienséance, dans les circonstances où je me trouve, que je n'oublie ni les uns ni les autres. Et en respectant strictement le droit des gens, il ne m'est pas impossible d'être agréable à ceux-ci et de faire plaisir à ceux-là.\nJ'ai reçu des faveurs des deux bords. Il importe qu'en me montrant reconnaissant vis-à-vis d'un côté, je ne sois pas ingrat vis-à-vis de l'autre.\n\nJe souhaite me tenir en rapport avec Votre Grandeur.\n\nMonseigneur Grandin est absent, mais il est rumeur que le saint évêque sera bientôt de retour.\n\nVeuillez prier pour moi que Dieu veuille daigner me soutenir, et qu'il lui plaît d'amener tous les gens de bien à s'entendre, et dans l'Est, et dans le Manitoba et dans le Nord-Ouest.\n\nMonseigneur, j'ai l'honneur d'être comme auparavant,\n\nVotre reconnaissant et obéissant serviteur,\n\nLOUIS RIEL.\n\nOn pourrait difficilement être plus respectueux, plus pacifique, plus reconnaissant, plus désireux de gagner l'approbation des gens honnêtes et paisibles, de respecter strictement le droit des gens, que Riel ne se montrait en apparence. Mais il est évident que Riel jouait la comédie et qu'il voulait tout simplement empêcher qu'on ne vit clair à travers son jeu.\n\nQui le croirait ? Quelques mois à peine s'étaient écoulés que Riel dénonçait Nos Seigneurs Taché et Grandin—nous osons à peine l'écrire—comme des voleurs et des canailles !\n\nOn a lu plus haut le témoignage du Frère Piquet. Voici maintenant ce qu'a raconté M. George Ness, lors du procès Riel. Ness fut l'un des prisonniers de Riel et demeurait tout près de Batoche lors de la révolte.\n\n—Quand avez-vous vu Riel après le 17 mars ?\n—Le 18.\n—Vous l'avez vu lorsqu'il prit possession de l'église ?\n—Oui.\n—Vous avez entendu ce qu'il dit aux prêtres alors ?\n—Oui.\n—Jusqu'à cette date lui avez-vous entendu faire aucune remarque insultante pour le prêtre ?\n—Oui.\n—Quand ?\n—Au mois de février, je crois.\n—Vers la fin de février.\n—Vers février.\n—À cette époque n'a-t-il pas eu une difficulté avec le Père Moulin ?\nVeuillez la faire connaître.\n—Il accusa l'évêque Taché et l'évêque Grandin d'être des voleurs et des canailles. (Thieves and rogues.)\n\nC'est ainsi que le reconnaissant et obéissant serviteur de Mgr.\nTaché traitait son bienfaiteur, ainsi que Mgr Grandin, le saint évêque.\n\nAu cours de son allocution aux jurés, Riel commenta cette déclaration de George Ness. Se rétracta-t-il ? Qu'on lise cette partie de son discours :\n\nL'un des témoins, George Ness, je crois, dit que j'ai parlé de l'archevêque Taché et que je lui ai dit qu'il était un voleur. Si j'en avais eu l'occasion je l'aurais interrogé sur ce que je lui ai dit, de façon à être compris par vous. J'ai connu l'archevêque Taché comme un grand bienfaiteur, je l'ai vu entouré de sa grande propriété, la propriété d'une veuve, dont le chemin passait tout près, il acheta le terrain alentour et s'empara de ce chemin pour essayer d'obtenir sa propriété à bon marché.\n\nEt comme l'archevêque Taché est mon grand bienfaiteur, comme il est mon père, je dirai, vu qu'il m'a fait immensément de bien, et comme il n'y avait personne qui eut le courage de le lui dire, je l'ai dit, parce que je l'aime, parce que je reconnais tout ce qu'il a fait pour moi. Quant à l'évêque Grandin, c'était pour les mêmes motifs. J'ai d'autres exemples de l'archevêque Taché, et le témoin aurait pu dire comme le R. P. Moulin : \"Quand vous parlez de personnes telles que l'archevêque Taché, vous devez dire qu'il a fait une erreur et non pas un vol.\" Je dis que nous avons été patients assez longtemps, et quand nous voyons que les mots doux ne servent qu'à couvrir les grands pour faire le mal, nous sommes justifiables de dire que le vol est le vol partout, et les coupables sont forcés par l'opinion publique d'y faire attention. L'homme qui a le courage de parler de cette façon, au lieu d'être un homme odieux, est un bienfaiteur et pour ces hommes-là et pour la société.\n\nTel est le langage exécable, que tenait Riel envers son bienfaiteur au moment même où il implorait la clémence du jury. Quelque chose d'inoui, de renversant.\n\nQuand s'est-il rétracté ? La nuit seulement qui précéda sa mort. Réalisant tout l'odieux de son procédé, il chargea son confesseur, le P. André, d'aller demander pardon en personne à Mgr Taché. Écoutons le récit du Manitoba :\n\nDurant sa dernière nuit, il dit au Révérend Père André : \"Vous irez à Saint-Boniface n'est-ce pas mon Père ? Eh bien ! Quand vous y serez vous vous prosternerez devant Mgr Taché, et lui demanderez pour moi pardon des paroles effrayantes que j'ai prononcées contre lui durant mon procès. Est-il possible que j'aie pu le traiter de la sorte jusqu'à dire qu'il avait volé, lui qui m'a élevé, qui m'a protégé toujours, que j'ai regardé comme mon père et qui a tant fait pour les miens. Promettez-moi d'aller à Saint-Boniface et d'aller voir Monseigneur.\"\n\nUn ami de notre feuille qui a eu l'honneur de se trouver au palais avant hier a été témoin de l'exactitude avec laquelle le Révérend Père André a\nrempli le message de son malheureux pénitent. Se jetant aux genoux de Sa Grandeur, il La conjura d'oublier ce que le pauvre condamné avait dit dans un moment de démence.\n\nLa scène était on ne peut plus saisissante.\n\nMonseigneur en pleurant releva le bon Père : \"Je n'ai rien à pardonner dit-il, je n'ai rien contre personne et en particulier je n'ai jamais rien eu contre ce pauvre M. Riel.\"\n\nLe pardon efface tout, même les fautes les plus odieuses. Mais nous refusons de croire que l'homme qui a pu ainsi outrager son bienfaiteur dans un moment aussi solennel et aussi critique, soit doué de brillantes qualités de l'esprit et du cœur.\n\nCe n'est pas tout.\n\nQuand Sa Grandeur Mgr Taché vint de Rome en 1870, à la demande du gouvernement, dans le but de pacifier les Métis, Riel s'opposa tout d'abord à ce qu'il eut aucune communication avec les chefs. Il fit même placer un piquet de soldats en face de l'Évêché pour faire comprendre à Mgr Taché qu'il était le maître du pays.\n\nLe croirait-on encore ? Non content de traiter l'archevêque Taché de voleur et de canaille, durant la dernière révolte, Riel serait même allé jusqu'à demander sa tête comme prix de sa reddition. Voici ce que nous écrivait une personne haut placée dans le Nord-Ouest, en date du 19 mai 1885.\n\nLe pauvre garçon a causé beaucoup de mal : c'est lui qui est responsable des massacres des pauvres missionnaires par les sauvages. Sachant l'opposition que ferait le clergé à tout mouvement suggéré par lui, il mit les sauvages en garde contre les prêtres, leur donnant à entendre que ces derniers étaient leurs pires ennemis, vendus au gouvernement. C'est ce qui donna lieu au massacre du lac La Grenouille.\n\nLes métis eux-mêmes menacèrent les prêtres. Lorsque Middleton lança sa proclamation, invitant les Métis à retourner à leurs demeures, demandant une entrevue avec les chefs qu'il sommait de se rendre, Riel répondit : \"Livrez-moi Dewdney, Lawrence Clarke et Mgr Taché, et je cesse les hostilités.\" Tels sont les principaux faits que l'on raconte et qu'on vient de source authentique.\n\nLe trait concernant Mgr Taché, si révoltant qu'il puisse paraître, nous l'avons entendu confirmer par un membre important du clergé du Nord-Ouest.\n\nEn face de pareilles choses, nous concevons que le Père André traite Riel de monstre, que le Frère Piquet lui applique le même qualificatif, et que le Père Fourmond ait cru voir en lui l'Antechrist. Et c'est cet homme-là que l'on nous représente comme un héros, comme un martyr, comme la personnification de notre race ! Nous ne sommes pas descendus si bas.\nL'abbé McWilliams et Riel\n\nL'agitation Riel n'est, d'après lui, qu'une manœuvre politique.\n\nIl assiste Riel dans ses derniers moments, et sa fin n'est pas celle d'un fou.\n\nIl a confiance dans le parti conservateur et Sir John Macdonald.\n\nOn a beaucoup parlé de l'abbé McWilliams qui, avec le Père André, assista Riel dans ses derniers moments. Voici la lettre que ce prêtre adressait dernièrement à un homme important.\n\nCette lettre dément la fausse et malicieuse assertion que l'abbé McWilliams se serait rendu auprès de Riel comme émissaire du gouvernement canadien, dans le but de l'empêcher de parler sur l'échafaud.\n\nElle établit en second lieu que Riel était parfaitement sain d'esprit et parfaitement repentant de ses fautes lorsqu'il lui fallut expier la sentence portée contre lui.\n\nL'abbé McWilliams n'hésite pas non plus à qualifier l'agitation qui se fait de simple manœuvre politique, et à exprimer la ferme confiance que notre population, revenue d'un premier affolement, n'hésitera pas à redonner sa pleine confiance au parti conservateur.\n\nVoici cette lettre :\n\nMon cher Monsieur,\n\nJe vous envoie la copie imprimée d'une correspondance écrite pour la presse en général et dans laquelle je retire la phrase peu chrétienne qui se trouve dans ma lettre à Son Excellence le gouverneur général et ses conseillers.\n\nJ'espère que tous l'accepteront comme une amende honorable. Je regrette d'avoir à dire que l'on m'attribue beaucoup de paroles qui ne sont jamais sorties de mes lèvres ou de ma plume.\n\nOn me rapporte que quelques-uns de nos journaux canadiens ainsi que des journaux américains ont dit que j'étais un émissaire du gouvernement et que j'avais été chargé de fermer la bouche du malheureux et mal inspiré Riel.\nRien ne saurait être plus faux. Le gouvernement ne connaissait pas plus mes projets de voyage et mon but lorsque je suis parti de chez moi que l'homme dans la lune. Et pourquoi les eût-ils connus ?\n\nVous désirez peut-être connaître mon opinion sur la condition du pauvre ambitieux dans ses derniers moments. La voici : il est impossible d'être plus sain d'esprit qu'il ne l'était ; jamais homme n'a été plus fortifié que lui par la puissance de la foi et par les sacrements de l'Eglise, jamais homme n'a reconnu plus sincèrement ses fautes passées.\n\nLe grand tapage que l'on fait dans la province de Québec n'est pas inspiré par des motifs sincères. C'est une simple manœuvre, en vue de faire du capital politique.\n\nJ'aimerais à demander à quelques-uns des Montréalais les plus turbulents, dont un grand nombre d'anciens compagnons de collège de Riel, pourquoi, lors de la grande réunion des anciens élèves, rassemblés au collège de Montréal, au nombre de 1300, le 9 septembre dernier, ils n'ont pas témoigné de sympathie pour lui en signant une requête au gouvernement, comme on le leur avait demandé. Je suis en mesure de répondre : c'est qu'ils ne sympathisaient pas avec lui.\n\nJ'ai vu Riel, j'ai conversé avec lui. J'ai pris le temps voulu pour étudier son cas avec calme ; et je dois dire que sa fin n'a pas été celle d'un fou.\n\nJ'ai confiance en Sir John A. Macdonald et dans le parti conservateur autant que jamais. Je n'hésite aucunement à dire que dès que cette agitation sans motifs sera apaisée, la province de Québec témoignera de sa confiance dans le parti qui a tant fait pour elle dans le passé.\n\nVotre tout dévoué,\n\nCHAS A. McWILLIAMS,\nPrêtre.\nNos évêques dénoncent Riel\n\nMgr Taché dit qu’un souffle d’émotion et de révolution passe sur notre pays et que ce mouvement n’annonce rien de bon pour l’avenir.\n\nMgr Gravel dit que Riel a eu recours à des moyens condamnés par l’Église.\n\nMgr Langevin blâme les soi-disant catholiques qui refusent d’infliger la peine de mort aux criminels et aux séditieux.\n\nMgr Cameron est d’avis que Riel a eu le sort qu’il méritait.\n\nMgr Duhamel ne veut pas qu’on impute à l’apostasie les divergences en matières politiques.\n\nOn a pu voir par ce qui précède ce que le clergé du Nord-Ouest, évêques et simples prêtres, pensaient de Riel, de son insurrection, de la guerre de sauvages qu’il avait soulevée, et des désastres qui en sont résultés.\n\nPar les extraits qui suivent, on pourra voir ce que nos évêques pensent de l’agitation soulevée dans la province de Québec par des politiciens sans scrupules, et comment Leurs Grandeur ont flétri le mouvement révolutionnaire dit mouvement national :\n\nSA GRANDEUR Mgr FABRE.\n\nUN SOUFFLE D’ÉMEUTE ET DE RÉVOLUTION PASSE SUR NOTRE PAYS. Nous avons pu voir : Nous-même un spectacle qui était loin de faire honneur à notre ville ; notre jeunesse s’est portée à des démonstrations qui ont peiné les hommes sérieux ; et même des hommes haut placés ont donné la main à ces manifestations, où le ridicule le disputait au dévergondage révolutionnaire. PUISQU’IL FAUT TOUT DIRE, ON A VOULU SE SERVIR DE LA RELIGION POUR ACCENTUER T\nFAIRE ACCEPTER AUPRÈS DE NOS POPULATIONS UN MOUVEMENT QUI N'ANNONCE RIEN DE BON POUR L'AVENIR.\n\nOù allons-nous, N. T. C. F., si nous marchons dans cette route ? Nous accoutumons notre peuple à l'émeute, à la révolution, et loin de le former à l'exercice sage et prudent de ses devoirs politiques, nous l'habitue à l'effervescence, à la licence, et NOUS NOUS RENDONS RESPONSABLES DES TRISTES CONSEQUENCES QUI DEVONT EN RESULTER.\n\nComme nous sommes loin des sages conseils et des prudentes prescriptions de l'immortel Léon XIII dans son Encyclique Immortale Dei ! Combien auront à gémir plus tard ceux qui, par la presse, ou par d'autres moyens, auront contribué à faire sortir les catholiques de ce pays du sentier des traditions d'ordre qui y étaient respectées. Nous avons nommé la presse, N. T. C. F., et nous croyons de notre devoir de dire publiquement qu'il y a des journaux dans ce diocèse, qui manquent à leur mission, parce que, tout en se proclamant catholiques et soumis à l'Eglise, ils sément la défiance contre les autorités, s'appliquent à les combattre, et montrent trop l'ambition de supplanter, par tous les moyens possibles, ceux contre lesquels ils dirigent leurs accusations.\n\nSA GRANDEUR Mgr MOREAU.\n\nPar ce que vous avez lu dans les journaux, vous êtes suffisamment instruits de ma manière de voir concernant les services chantés pour Riel...\n\nL'EXCITATION PRODUISE À CETTE OCCASION EST TRÈS MALHEUREUSE POUR NOTRE PAYS ET POUR NOTRE PROVINCE EN PARTICULIER. PUISE-T-ELLE NE PAS NOUS CONDUIRE À QUELQUE CHOSE DE LAMENTABLE ! Prions bien et faisons prier beaucoup, afin qu'il ne nous arrive rien de fâcheux pour nos intérêts religieux et nationaux. Espérons que ce soulèvement, dont on profite en certains quartiers pour répandre des principes condamnés par l'Encyclique Immortale Dei, que nous venons de recevoir, va se calmer bientôt.\n\nSA GRANDEUR Mgr GRAVEL.\n\nIl sera bon de profiter de cette heureuse occasion pour rappeler les principes de l'Eglise, en référence à la manière de revendiquer des droits que l'on croit violés. Alors même que l'on pense avoir sujet de se plaindre, on n'est pas pour cela autorisé à se révolter, comme on l'a fait si malheureusement au Nord-Ouest, et malgré Mgr Grandin et tous les missionnaires du pays. Ainsi, pour servir la bonne cause des Métis, LE PAUVRE RIEL A EU RECOURS À UN MOYEN CONDAMNABLE ET CONDAMNÉ PAR L'EGLISE.\n\nIL EST ÉGALEMENT CONTRAIRE AU BON ORDRE ET AU RESPECT QUE L'ON DOIT AUX DÉPOSITAIRES DES POUVOIRS PUBLICS, DE BLÂMER LEUR CONDUITE PAR DES MOYENS QUI RESPIMENT LA SÉDITION, comme de faire des processions tumultueuses et provocatrices, de livrer des mannequins, sous des noms connus au bûcher, à l'échafaud ou à la fusillade. C'est\naccoutumer le peuple à s'attribuer un pouvoir souverain qu'il n'a pas, et déposer dans son cœur des instincts féroces qui y germeront, et produiront un jour des fruits amers pour les familles et la société.\n\nSA GRANDEUR Mgr LANGEVIN.\n\nDepuis quelques semaines, une dangereuse agitation et un esprit démagogique se sont répandus dans une partie de notre population, généralement si paisible et si religieuse. On a travaillé à soulever les masses, on a porté surtout la jeunesse, toujours plus impressionnable, à des démonstrations tumultueuses, à des voies de faits extrêmement regrettables, qui ne peuvent que rabaisser notre peuple dans l'estime publique, nous exposer à une guerre de race et de religion et à arrêter pour longtemps la prospérité du pays...\n\nDes journalistes trop ardents et irréfléchis, parmi lesquels quelques-uns se proclament cependant bien haut catholiques et soumis à l'Eglise, ont méconnu les graves enseignements de l'Encyclique Immortale Dei, ont osé glorifier ou au moins justifier des actes de violence, l'émeute et l'insurrection, ont contesté à la société le droit de se protéger en infligeant la peine de mort aux criminels et aux séditieux, sans penser qu'il est bien plus facile d'exalter le désordre et le trouble que de les apaiser. Au lieu de se borner à user de leurs droits constitutionnels en temps et lieu convenables, avec la réflexion et le sang froid requis, ils ont préféré flatter les passions populaires et posséder à des manifestations où une effervescence aveugle a causé de déplorables écarts.\n\nAu lieu de prendre et de suivre la direction des évêques, comme le recommande si fortement Léon XIII, ils ont oublié qu'à toutes les phases de notre histoire, surtout les plus critiques, le peuple canadien a toujours trouvé son épiscopat prêt à l'éclairer et à le guider, à sa tête et à l'éloigner des dangers et des malheurs qui le menaçaient.\n\nSi nous croyons devoir vous parler ainsi, N. T. C. F., c'est pour remplir un devoir de Notre charge, et dans votre intérêt bien entendu que Nous le faisons. Oh ! écoutez donc les recommandations du Pape et de vos évêques ; maintenez-vous dans l'ordre, dans le respect des autorités, dans la charité et la justice envers tous ; restez dans les bornes de la modération chrétienne ; évitez soigneusement les injures et les invectives à l'égard de ceux qui ont une opinion différente de la votre. De cette sorte, vous rencontrerez les vues et les intentions du Saint-Père dans son admirable Lettre Encyclique.\n\nSA GRANDEUR Mgr CAMERON.\n\nJe suis convaincu que Riel a eu le sort qu'il méritait. Toute tentative de faire du capital politique avec cette question, dans la Nouvelle-Ecosse tombera à plat et fera beaucoup plus de tort que de bien aux libéraux. Je ne puis comprendre que les Canadiens-français éprouvent de si vives sympathies pour un homme qui est si loin d'être le grand martyr qu'on a dit. Riel n'est pas mort sur l'échafaud parce qu'il était français catholique, mais parce qu'il avait violé les lois du pays. Si un protestant a\nété accusé de la même offense et a échappé au châtiment qu'il méritait, ce n'est pas une raison pour qu'un catholique y échappe. Une faute est toujours une faute ; s'il y avait une question de principe au fond de cette affaire, ce serait bien différent.\n\nSA GRANDEUR Mgr GRANDIN.\n\nVoici, d'après le Révérend M. Dowd, quelle est l'opinion de Mgr Grandin, évêque de Saint-Albert, sur le compte de Riel :\n\n\"Dans une entrevue qu'il a eue avec Mgr Grandin, il a entendu le récit des atrocités commises dans le Nord-Ouest par les Sauvages infidèles et les crédules Métis inspirés par UN HOMME SANS SCRUPULES. On lui a dit comment de pauvres missionnaires avaient été MASSACRÉS presque sous les yeux du saint évêque ; comment les malheureux Métis avaient été non-seulement POUSSES À LA REVOLTE contre le gouvernement du pays par UN CHEF MAL INTENTIONNÉ, mais aussi à RUINER LEUR FOI ET SE SÉPARER DE SON CLERGÉ SI DÉVOUÉ POUR SUIVRE RIEL QUI REJETAIT LE PAPE ET L'ÉGLISE, TOUTE AUTORITÉ RELIGIEUSE OU CIVILE.\"\n\nMgr Grandin lui a aussi dit que comme RÉSULTAT DE TOUT CELA, les Métis, aujourd'hui, MEURENT DE FAIM, et que lui recueille des aumônes dans tout le pays pour soulager ces infortunés.\"\n\nCes paroles ont été prononcées du haut de la chaire de Saint-Patrick, par le Révd M. Dowd.\n\nSA GRANDEUR MGR RACINE.\n\nSa Grandeur Mgr Racine, évêque de Chicoutimi, a adressé la lettre suivante à M. Cimon, éditeur de l'Echo des Laurentides :\n\nCHICOUTIMI, 11 janvier 1886.\n\nA. S. Cimon, Ecr., Malbaie.\n\nMonsieur,—Votre qualité d'éditeur du journal l'Echo des Laurentides, m'engage à vous offrir une copie de la dernière Encyclique de Sa Sainteté Léon XIII sur la constitution chrétienne des Etats.\n\nLa lecture de ce document important vous sera d'autant plus agréable qu'elle vous donnera lieu de constater que votre journal ne s'est pas déparié de la loi imprescriptible que le Souverain Pontife trace aux écrivains et surtout aux journalistes.\n\nMieux inspiré que plusieurs de ses confrères aînés, votre journal s'est toujours tenu renfermé dans la sphère de son action, évitant de soumettre au tribunal de l'opinion publique des questions qui ne sont ni de son ressort, ni de sa compétence. Sachant que ce sont les évêques, et non les journalistes, qui ont été placés par l'Esprit Saint pour régir l'Eglise de Dieu, il ne s'est pas non plus arrogé le droit, qui n'appartient qu'au Chef Suprême de l'Eglise, de leur demander compte de leur administration.\nIl a su également conserver le calme et la modération convenables dans les jours d'effervescence et d'excitation que nous venons de traverser.\n\nJe profiterai de l'occasion présente pour vous exprimer le regret que j'ai éprouvé en voyant la déférence et la charité chrétiennes cruellement blessées dans certaines correspondances.\n\nLe passé de votre journal me donne donc l'espoir qu'il persévérera dans la bonne voie et me fait désirer voir tous ses confrères en faire autant.\n\nVotre serviteur,\n\n+ DOM.,\nEvêque de Chicoutimi.\n\nSA GRANDEUR Mgr DUHAMEL.\n\nTous doivent admettre les points suivants :\n\nLa foi catholique est incompatible avec les germes du rationalisme et du naturalisme, qui vont à détruire toute institution chrétienne, et à mettre l'autorité de l'homme à la place de celle de Dieu ; il n'est pas plus permis de rejeter l'autorité de l'Eglise dans la vie publique que dans la vie privée.\n\nSur les questions politiques, la forme du gouvernement, les systèmes d'administration, les divergences honnêtes sont permises et ne doivent pas être imputées à personne comme un crime, ou même comme une apostasie : avis aux journalistes et aux écrivains.\n\nDans la lutte présente tous doivent tendre unanimement au but commun de sauver la religion et la société, oubliant à cet effet les dissensions, même les injustices du passé, suppliant Dieu de tout transformer et de tout diriger à la gloire et au salut du genre humain.\nLettre du Révd P. Touze\n\nIl condamne énergiquement le mouvement Riel comme étant le fait de \"politiciens éhontés\"\n\nRiel était coupable et a été justement condamné\n\nSi les Canadiens savaient, ils n'auraient pas de sympathies pour cet homme\n\nL'agitation Riel est de nature à causer les plus grands maux parmi les Métis\n\nLa lettre suivante du Révd P. Touze, l'un des missionnaires persécutés par Riel, a été livrée récemment à la publicité. Elle est adressée à un citoyen qui voulait connaître son opinion sur la situation.\n\nSTOBART, Lac des Canards, 22 nov. 1830.\n\nCher monsieur,\n\nVous m'avez demandé de vous exprimer mon opinion touchant cette trop fameuse agitation que la question Riel soulève dans certaines parties du Canada.\n\nJe n'ai ni le talent ni l'habitude d'écrire, mais je le ferai néanmoins, espérant que par ma franchise et ma simplicité je mériterai votre attention. Et d'abord laissez-moi vous dire que, même avec beaucoup de charité, de bienveillance et de sympathie, il me semble bien difficile, je ne dirais point d'expliquer, mais d'excuser cette agitation, cette excitation, disons le mot, cette folie qui s'est créée et qui se continue depuis dans le Canada à propos de la mort et de l'exécution de Riel. La chose paraît d'autant plus inexplicable qu'elle est l'effet d'une contradiction des plus apparentes.\n\nCes mêmes libéraux disaient durant le procès et jusqu'à la veille de l'exécution de Riel : vous verrez que le gouvernement n'aura pas le courage de remplir son devoir et que Riel, qui a mérité surabondamment la peine de mort, ne subira jamais ce châtiment.\n\nMais contre leur attente le gouvernement, après avoir épuisé toutes les longueurs de la miséricorde et avoir donné au pauvre Riel toutes les...\nfacilités et les chances de plaider sa cause en lui ouvrant accès auprès d'autres cours de justice, a permis, comme il le devait, que la sentence portée contre lui, par la cour de Régina, et que les autres cours de justice supérieures avaient ratifiée et confirmée, fut exécutée. Alors ces mêmes libéraux voulant quand même embarrasser, gêner le gouvernement et le renverser surtout s'ils étaient capables, ont changé de refrain et crient depuis, aussi haut et aussi fort, que le gouvernement a laissé exécuter Riel parce qu'il était Métis-Français-Catholique. Riel était-il, oui et non, tout cela durant les procédures de son procès et avant l'exécution de sa sentence? Il l'était évidemment. Et vous aussi, messieurs les libéraux, vous étiez autant alors qu'aujourd'hui les ennemis non seulement du gouvernement de sir John, mais aussi, et c'est là à mon sens le comble de l'absurde, vous aviez en égale haine sir John, Riel, et tous ceux dont vous vous faites aujourd'hui les protecteurs et les défenseurs.\n\nJe ne pense pas qu'en aucun temps, ni chez aucun peuple, il n'y ait jamais eu un mouvement politique analogue à celui qui se produit depuis quelque temps dans le Canada. Que pour une juste sentence légalement portée, et que le pouvoir Exécutif devait, et à comme de raison fait exécuter, un peuple à la voix et à l'instigation de quelques politiciens éhontés, sans prendre le temps de réfléchir fasse chorus avec eux pour blâmer ce qu'il ne devrait qu'approuver, voilà qui est difficile à expliquer. D'autres l'ont dit avant moi, je le redirai avec eux et sans non moins de raison : VOUS TOUS BONS CANADIENS, HONNÊTES GENS, LOYAUX CITOYENS, VOUS SURTOUT BONS CHRÉTIENS, SI VOUS EUSSIEZ ÉTÉ ICI AYANT ALORS TOUT VU ET TOUT ENTENDU, VOUS VOUS GARDERIEZ BIEN DE VOUS UNIR À CES GENS QUI VOUS FAUSSENT TOUTE CETTE AFFAIRE POUR LA SEULE CHANCE DE RÉUSSITE POUR LEUR PARTI ET LEURS AFFAIRES PERSONNELLES.\n\nSi réellement ces gens-là aimaient les métis, s'ils avaient à cœur l'intérêt du parti français et catholique, il me paraît évident qu'ils tiendraient une conduite tout autre. J'aime à croire de Riel, dont la fin parut bonne, que sa mort a été précieuse devant Dieu, qu'elle le soit donc devant nous tous. Si Dieu dans sa miséricorde l'avant trouvé assez pur l'a déjà introduit dans la maison de sa gloire, pourquoi alors si nous l'aimons, travailler à troubler sa joie et sa gloire?\n\nQue si au contraire son âme n'étant point encore assez purifiée gémissait dans les lieux de souffrances et d'expiation, faisons silence autour de lui et recueillons-nous pour l'aider et le soulager par de bonnes prières. Et ses compatriotes, ses parents, ses amis, ses frères, sa nation entière les métis, croyez-vous que vous ne leur seriez pas d'un plus grand service et d'un exemple plus beau si vous leur laissiez oublier et vouliez oublier vous-mêmes un fait qui mérite de l'être?\n\nLes tristes événements accomplis ici dans le printemps de 1885 ont eu assez de fâcheux résultats; les conséquences immédiates, les suites nécessaires de cette rébellion ont été assez dures et pénibles sans qu'on cherche encore à en augmenter le nombre. C'est bien déjà trop du mal qui s'est fait alors sans prendre occasion d'en faire davantage. Sans rien exagérer je puis dire que cette agitation continue au Cana-\nDA, PRODUIT ICI DE BIEN MAUVAIS EFFETS. LES BLESSURES ÉTAIENT ASSEZ VIVES, POURQUOI DONC LES LACÉRER D'AVANTAGE.\n\nLe plus grand nombre de mes gens qui avaient pris part à cette triste et déplorable rébellion l'avaient fait par surprise et malgré eux. Comment voulez-vous à présent les faire revenir de leur erreur ? La chose était d'abord possible et facile, mais déjà la tâche est devenue bien ardue et difficile et, pour peu que cela continue, je crains fort qu'elle ne devienne impossible.\n\nDE GRACE, BONS CANADIENS, PUISQUE VOUS DITES AIMER RÉELLEMENT LES MÉTIS, NE TRAVAILLEZ DONC PLUS CONTRE LEURS INTÉRÊTS LES PLUS PRÉCIEUX, aidez-nous au contraire, par votre calme, votre tranquillité, votre soumission parfaite aux autorités et au gouvernement établi ; refaire ce qui a été défait et détruit ; LAISSEZ À NOS GENS LA PAIX ET LA TRANQUILLITÉ D'ESPRIT DONT ILS ONT BESOIN POUR SE RELEVER ET RETIRER DES RUINES OU LES A PLONGÉS LA RÉBELLION NÉFASTE DONC LE PAUVRE RIEL A LÈVÉ L'ÉTENDARD.\n\nAvec mes plus respectueuses salutations, je me dis, cher monsieur, votre serviteur,\n\nLa Touze, Prêtre, O. M. I.\n\nP. S.—Nous avons fait plus haut plusieurs assertions que nous voulons maintenant appuyer par des documents officiels.\n\nNous avons prétendu que Riel avait voulu vendre la cause métisse pour une somme d'argent. Cela a été prouvé au procès de Riel par le Père André, missionnaire. Voici sa réponse aux questions des avocats sur ce sujet :\n\nQuestion.—Voulez-vous déclarer ce que l'accusé voulait avoir du gouvernement fédéral ?\n\nLe Père André.—J'ai eu deux entrevues avec l'accusé à ce sujet.\n\nQuestion.—L'accusé réclamait une certaine indemnité du gouvernement fédéral ?\n\nLe Père André.—Lorsque l'accusé fit sa réclamation, j'étais là avec une autre personne et il voulait avoir $100,000 du gouvernement. Nous fûmes d'avis que cette demande était exorbitante et l'accusé répondit : \"Attendez un peu ; je prendrai tout de suite $35,000 comptant.\"\n\nQuestion.—Et à cette condition l'accusé devait quitter le pays, si le gouvernement lui donnait $35,000 ?\n\nLe Père André.—Oui, c'est la condition que Riel mit.\n\nQuestion.—Quand ceci se passait-il ?\n\nLe Père André.—Le 23 décembre 1884.\n\nQuestion.—Il y eut une autre entrevue entre vous et l'accusé, n'est-ce pas ?\n\nLe Père André.—Nous étions une vingtaine d'entrevues.\n\nQuestion.—N'était-il pas toujours à vous demander de vous servir de votre influence auprès du gouvernement pour lui obtenir cette indemnité ?\n\nLe Père André.—Il m'a parlé de cette affaire pour la première fois le 12\ndécembre. Il n'en avait jamais été question entre nous avant cela, et le 23 décembre, il m'en parla de nouveau.\n\nQuestion.—Il en a parlé souvent ?\nLe Père André.—En deux occasions seulement.\nQuestion.—N'était-ce pas sa grande préoccupation ?\nLe Père André.—Oui, dans ces deux entrevues.\nQuestion.—N'est-il pas vrai que l'accusé vous a déclaré qu'il était lui-même la question métisse ?\nLe Père André.—Ce n'est pas ce qu'il a dit en propres termes, mais c'était bien la pensée qui ressortait de ses paroles. Il m'a dit : \"Si je suis satisfait, les Métis le seront.\" Je dois expliquer ceci. On lui objecta que si le gouvernement lui accordait les $35,000 la question métisse resterait toujours la même et il répondit : \"Si je suis satisfait, les Métis le seront.\"\nQuestion.—N'est-il pas vrai qu'il vous a dit qu'il accepterait même une somme moindre que $35,000 ?\nLe Père André.—Il m'a dit : \"Faites valoir toute l'influence que vous pouvez avoir : il se peut que vous n'obtenez pas tout cela, mais obtenez tout ce qu'il est possible d'avoir ; si vous obtenez moins nous verrons.\"\n\nNous avons dit aussi que lorsque les prêtres du Nord-Ouest l'avaient dénoncé, ils n'avaient jamais déclaré qu'il était fou ; mais qu'ils l'avaient mis au ban de l'opinion publique comme un criminel. Voici ce document signé par six prêtres et qui doit peser un peu plus que les paroles en l'air des petits avocats rouges :\n\nPRINCE-ALBERT, 12 juin 1885.\n\nNous, prêtres des districts qu'affecte plus particulièrement la rébellion, savoir : Saint-Laurent, Saint-Antoine, Grandin, Lac-aux-Canards et Batoche, puisque c'est là, au milieu de notre population, que ce mécréant Louis \"David\" Riel avait établi son quartier-général, désirons attirer l'attention de nos nationaux du Canada et d'ailleurs sur ces faits.\n\nLouis \"David\" Riel ne mérite pas les sympathies de l'Eglise Catholique Romaine et des membres de cette Eglise, ayant usurpé notre mission de prêtres et privé notre population des avantages et des consolations que nous aurions pu lui offrir.\n\nIl a fait tout cela dans son intérêt purement personnel.\n\nSigné : RR. PP. ANDRÉ,\nTOUZÉ,\nMOULIN,\nFOURMOND,\nVEGREVILLE,\nL'ECOE\n\nEt le Père Fourmond, signataire de la lettre, desservant de Batoche même, écrivait de plus ce qui suit :\n\nJ'ai été bien près de la mort, car si les balles et la fureur des révoltés m'ont fait défaut, la guerre, l'apostasie, l'hérésie, la trahison, la persécu-\ntion, l'incendie, le pillage, tout s'est déchaîné contre nous ; on se serait cru à la fin du monde. Déjà nous avions notre Antéchrist dans la personne de ce fameux Riel, contre lequel il nous a fallu lutter, au péril de notre vie, pour détruire sa funeste influence sur nos pauvres gens.\n\nMon Dieu ! quel homme, quelle hypocrisie, quelle impiété tout à la fois !\n\nC'est pour cela qu'il a ruiné nos familles chrétiennes, par le pillage et l'incendie ; c'est par une conséquence horrible de ses plans diaboliques qu'a coulé le sang des blancs et celui des chers et zélés confrères, massacrés par les Sauvages, sur ses ordres.\n\nCes témoignages, si forts et si accablants, suffisent à édifier tout homme de bon sens sur le caractère et la conduite de celui qui a entraîné ses frères, les Métis, dans les plus grands malheurs.\n\nTerminons en citant sur Riel le témoignage de Mgr l'Archevêque Taché, qui l'a protégé mainte et mainte fois et que Riel s'est montré disposé à sacrifier au procès de Régina pour se sauver lui-même.\n\nUne ambition effrénée qui a vicié son intelligence et l'a poussé jusqu'au délire, une soif désordonnée de pouvoir, un orgueil insensé, qui l'a conduit à l'apostasie, ont été les mobiles de ses actes.\n\nVoilà ce qu'en a dit le plus grand prêtre du Nord-Ouest.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001440.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 63, "total-input-tokens": 87284, "total-output-tokens": 42355, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 507, 1], [507, 2473, 2], [2473, 4081, 3], [4081, 4791, 4], [4791, 6393, 5], [6393, 9234, 6], [9234, 12150, 7], [12150, 12698, 8], [12698, 14764, 9], [14764, 17716, 10], [17716, 18213, 11], [18213, 19975, 12], [19975, 21836, 13], [21836, 23878, 14], [23878, 26696, 15], [26696, 28121, 16], [28121, 31174, 17], [31174, 34436, 18], [34436, 37552, 19], [37552, 40776, 20], [40776, 43804, 21], [43804, 44433, 22], [44433, 46421, 23], [46421, 49355, 24], [49355, 51516, 25], [51516, 53218, 26], [53218, 55280, 27], [55280, 58318, 28], [58318, 60798, 29], [60798, 62833, 30], [62833, 65935, 31], [65935, 68957, 32], [68957, 70408, 33], [70408, 72401, 34], [72401, 75666, 35], [75666, 79010, 36], [79010, 82232, 37], [82232, 83341, 38], [83341, 85435, 39], [85435, 86787, 40], [86787, 88919, 41], [88919, 91819, 42], [91819, 93512, 43], [93512, 96488, 44], [96488, 98033, 45], [98033, 101064, 46], [101064, 102349, 47], [102349, 104206, 48], [104206, 106169, 49], [106169, 108963, 50], [108963, 111532, 51], [111532, 113265, 52], [113265, 114925, 53], [114925, 116376, 54], [116376, 119090, 55], [119090, 122120, 56], [122120, 124563, 57], [124563, 125990, 58], [125990, 127722, 59], [127722, 131020, 60], [131020, 133555, 61], [133555, 135972, 62], [135972, 137251, 63]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]