[{"id": "b030d69213cff59edd94e4643cb2b3fc435367f0", "text": "THE RIEL AND HOME RULE QUESTIONS.\n\nHON. JOHN COSTIGAN'S SPEECH\n\nAt Woodstock, N. B.\n\nMr. Costigan's Letter to Lord Lorne on Home Rule for Ireland.\n\nGLADSTONE'S BILL FORESHADOWED.\n\nOPINIONS OF THE IRISH NATIONAL NEWSPAPERS.\n\nMessrs. Curran, Coughlin, &c., &c.\nTHE\nRIEL AND HOME RULE\nQUESTIONS.\n\nIn the course of the following speech delivered by him at Woodstock, Carleton County, N.B., the Hon. Mr. Costigan very tritely remarks that the \"National Policy\" nor the \"Riel\" question will not be the only important factors in the approaching struggle for supremacy in Canadian affairs. \"Home Rule for Ireland\" has been made a party cry in Canada. Therefore, it has been thought well to lay before the Canadian Public Mr. Costigan's reasons for the course he and his fellow-Irish representatives thought proper to pursue with regard to this question during the session of 1886. No need for any elaboration; for Mr. Costigan explains his position and that of his fellows in clear forcible language, and without any \"beating about the bush?\" How common is the remark even amongst well-intentioned, patriotic Irishmen: \"They (Costigan—and the rest of them) made a mistake!\" Yes! they did make a mistake; they made a mistake when viewed as Canadian politicians, but as patriotic Irishmen, loving the land of their birth or of their ancestors, they made\n\nNO MISTAKE!\n\nHad Messrs. Costigan, Curran, Coughlin, Burns, Hackett, McGreevy and the other Irish Catholic Conservatives (there were none such on the other side of the House) chosen to play the \"demagogue role,\" they would have simply voted for Mr. Blake's resolutions—which would have been defeated—and leave the responsibility to be shouldered by those who forced the resolutions of 1886, not caring one straw whether they were lost or carried. Leaving Mr. Costigan to tell his tale in plain, unpretentious language, there is no need for further introduction. But there is one point that it is just as well to direct attention to. It is that wherein Mr.\nCostigan, with that love of justice, of fair play and of \"doing unto others as you would be done by\" he uses the following language, in speaking of the resolutions of 1882:—\"Edward Blake made one of the ablest speeches I ever heard in my life in support of them\" (the resolutions of 1882.) This is only a repetition of the language which Mr. Costigan has ever held regarding Mr. Blake's speech in 1882. When he was interviewed by a (now) member of the British House of Commons in 1884, (a Conservative,) he referred to the matter in the same words. And this is the man who has been vilified as a \"traitor\"—that foulest of words in the Irish vocabulary. Here was John Costigan, a member of the Liberal-Conservative Government of Canada, saying words of promise in favour of the Liberal leader in Canada to a Conservative Englishman who wanted to understand the Irish question, just because he (Costigan) felt that justice demanded it. Let anyone who reads the Parliamentary reports, or who has happened to sit for an hour or two in the galleries of the Canadian Commons, contrast this with the sneers—little short of insult—session after session with which the leader of the Liberal party, Mr. Edward Blake, in the pride and egotism of his position has time and time again treated the single-minded John Costigan. But Mr. Costigan has been addressing his people \"down by the sea,\" and here is his speech delivered at Woodstock, New Brunswick:\n\nTO THE ELECTORS OF THE UPPER ST. JOHN.\n\nTHE RIEL QUESTION AND HOME RULE.\n\nMr. Costigan, says the St. John, N.B., Sun, was received with hearty applause. He said, I feel greatly gratified at the opportunity afforded me this evening of appearing before so large and intelligent audience as I see before me at present. At this hour of the night, I think it well to assure you at the start that I do not intend to trespass very largely upon your time or patience. You have listened, no doubt, with a great deal of pleasure, and felt a deep interest in the address delivered by my distinguished colleague, Mr. Foster, and, if he had reason to complain of our friend, the Minister of Customs, for having taken the ground from under his feet and left nothing for him to say, with how much greater force may I appeal to your sympathy after he has followed the Minister of Customs and left still less for me to say. Mr. Chairman, ladies and gentlemen, the two former speakers have dealt with questions that affect the interests of every citizen in this country. They have drawn a picture of the two great political parties in\nthis country who appeal to the intelligence of the electors of Canada. They have referred to the National Policy as being the great issue in the coming contest; but, ladies and gentlemen, the National Policy will not be the great issue in the coming contest. The Liberal party, under the leadership of Hon. Mr. Blake, does not seek re-election on account of any fixed policy that would recommend itself to intelligent people. The policy of the party led by Hon. Edward Blake, is a policy calculated, and intended, to gain strength from strife, that may be created by arraigning class against class, race against race, from one end of the country to the other. A reference has been made by Mr. Foster to the fact that notwithstanding the repeal agitation in Nova Scotia, that province will send a majority to the support of the Liberal-Conservative Government of this country, and I have great pleasure in endorsing that statement with the firm conviction that it is the truth. He has also stated that notwithstanding the excitement produced by demagogues in the Province of Quebec, that old province will send to the support of the Government, who have carried out the policy of progress and improvement in the country, a good majority. And I might add that notwithstanding the addition of a few supporters to Mr. Mowat, in the Province of Ontario, that province will send as strong a majority, if not stronger, to support the Conservative party in the next general election as now represent it in the Parliament of Canada. You all know that the Province of British Columbia will send an unanimous representation, and every man will know after the contest is ended, that there will not be a province in the whole of Canada that will not send a majority to the support of the Conservative Government.\n\nWhat is the policy of the Opposition, and what are the weapons to be used against the Government of this country? The great weapon to be used in the Province of Quebec, as far as it can be used by the Liberal party, is to excite the prejudices of that people against the present Government because the sentence passed on a criminal by the highest courts of the land was allowed to be carried out. We all know what excitement was produced in that country by demagogues travelling through the various counties and appealing to the prejudices of the people because that unfortunate man was executed. We have all heard of the cries raised and the terms and epithets applied to the Liberal-Conservative Government because that execution took place. We have been called hangmen, and if the statements made by the Liberal party from one end of the country to the other were well founded, they should not have called us hangmen, but murderers, because if the statements they made were true, and the men forming the present Government consented to execute an unfortunate man in order to strengthen themselves politically or consented to the death of a man whom otherwise they would have believed to be innocent, from the prospect of deriving additional support from any element of the people of this country, they were not merely hangmen but murderers in the face of the country and in the face of God. But I can well remember\nwhen a question of this kind once came before the House of Commons, when Mr. Blake was Minister of Justice, and when he defended himself in words of eloquence and power because some insinuations had been cast upon him with regard to the carrying out of the death penalty imposed on criminals, he said, \"can you for a moment imagine—can you not make allowances for the position of Minister of Justice and the painful responsibility under which he rests? Can you imagine a man would be so lost to all sense of honesty and justice that he would give that advice upon which depended the life of his fellow-being, and be influenced by any unworthy or selfish motive or political considerations?\" He made that strong appeal then, but he forgot it afterwards when he crossed the House and became the attacking party, and there was another Minister of Justice in the office who was as sensitive of his honour and conscience as Mr. Blake could possibly be. And I would ask any intelligent audience in any part of this country, can any set of men—is there one single man who will reason the matter out and say to himself that he honestly believe that these fourteen Ministers sat around the Council table so lost to all that was honest and truthful and just, so lost to all sense of principle, so dead to their sense of justice and their consciences, that they sat there and deliberated and finally yielded to the dictation of the Orange or any other element, and agreed that this man should die? No, sir; I do not believe there is any living man in Canada to-day possessed of any intelligence, no matter what his political prejudices may be against us, who would coolly and calmly pass such a judgment against the Cabinet considering the question at the time.\n\nWhat were really the grounds for the agitation in 1869-70 in the North-West? This unfortunate man, Louis Riel, was then a British subject. The citizens of this country believed that he and his people had grievances. No doubt they had had difficulty with the first surveyors, who went up there and located the land, and probably were imposed on by some of these men at the time. Governor Macdonald went out to take charge of the territory. In the difficulty then existing Louis Riel had the French and a portion of the Scotch and English half-breeds with him. He was determined to resist entry and possession of that territory by the Dominion Government before a guarantee would be given to them or the bill of rights acceded to. Very few lives were lost in the rebellion itself, but a prisoner was taken by Riel's men, and the execution of that man was the only stain upon Riel's character; the great mistake he made at the time, because the people of Canada generally were in sympathy with the half-breed people, because their rights and position in this country were not fully understood by either party in Canada. But, sir, he took prisoner a man by the name of Scott, he was tried and convicted, sentenced, and shot. I want you to remember one incident in the trial and execution of that man. At the time one of Mr. Riel's colleagues was Prof. O'Donoghue, who had been a professor in the St. Boniface College prior to that, and had joined the\nProvincial Government of Riel. When that trial was being taken up, O'Donoghue protested against any such proceeding; declared that they had no authority for taking upon themselves a matter of life and death, and he would not take the responsibility and withdrew. But his counsel did not prevail. Scott was tried, sentenced and executed. That event created almost as much excitement throughout a large portion of Canada as the execution of Riel has caused, and in the one case as in the other the same politicians fanned the flame in Ontario when it was the question of the murder of Thomas Scott.\n\nWe find that Hon. Edward Blake, who recently shed tears for the wrongs of the half-breeds, was the man who rose in the Ontario Legislature and depicted Louis Riel as a red handed murderer, and offered $5,000 reward for his apprehension, and declared that so foul a murder must be avenged by the men of Ontario—not by the laws of the country, sir, but by giving it that local and sectional character he appealed to the people of Ontario as if the crime was not committed against all Canada. General Wolseley was sent with an expedition into that country, and the half-breed found that with the forces coming against him if they reached the country his time would be short and his reign would be over. His warmest friends, those who took the deepest interest in him, advised him to give himself up, and the best manner in which he could do so was to offer his services to Governor Archibald, who was then Governor of Manitoba. In the meantime, before he had received this advice and acted upon it, General Wolseley was making slow progress through what was known as the Dawson road with his troops. Prior to this Riel and his council met, discussed the whole question, and decided to raise a force and meet and cut off the march of General Wolseley and his forces, but he could not raise the required number of men in Manitoba. What did he do? Why, he, himself, over his own hand and signature and those of his colleagues in the provisional government, authorized O'Donoghue to go into the United States and appeal to the Americans there to give them arms and men and aid in any way to repel, if they could, the invasion of the Canadians. O'Donohue went down, a member of the provisional Government, as I have said, with these documents of authority in his pocket—documents which I held in my hands afterwards and produced before Parliament, and therefore, I know of what I speak and know of their existence. He went to the United States, procured money from sympathizers for these people, procured arms and the assistance of a certain number of volunteers who offered to come and aid Louis Riel.\n\nWhen O'Donoghue reached Pembina word came that reinforcements were coming to Louis Riel, but at this moment Riel offered his services to do what? Why, to go and repel the so-called Fenian invasion, to fight his own colleague coming with his own authority; coming to his rescue at his request, having fulfilled the mission of danger. He offered to go and repel the invasion, headed as it was by his own col-\nleague, carrying out his own instructions. Louis Riel escaped from Manitoba to the United States; warrants were issued for him, but he became an American citizen, was no longer a Canadian, and troublesome and designing characters began to agitate in Manitoba among the half-breeds and Indians. There was the Farmers' Union, which was a political engine at that time, working in the Liberal interest, and they thought the course best calculated to promote their interest was to preach discontent and dissatisfaction in that country. They worked upon the sympathies of the half-breeds, making them believe that they were with them and prepared to rebel. A few of the half-breeds went down and brought Louis Riel up into the country. He held several meetings. Up to this time the half-breeds had always been led, guided, and advised by their clergy. They were an innocent, industrious, honest, harmless class of people—ignorant, of course, having never enjoyed the advantages of civilization to any great extent. They were without education, and like children in the hands of their clergy. Their clergy gave them the best of advice, and told them to have nothing to do with Louis Riel. They told them that Riel had got them into trouble once before and he would get them into trouble again. The people took the advice of their clergy, and what did Riel do then? He then took it upon himself to proclaim himself a prophet to work upon the prejudices of these people. He persuaded a portion of them that he was more powerful than the priests, persuaded a small portion of them that the Church of Rome was tyrannical, that it kept the people in ignorance and extorted money from them, but he said he was inspired, he was to teach them, and they were to follow him. He exposed the Sisters of Charity to great danger during the trouble that took place shortly after.\n\nWell, he succeeded in putting the Indians upon the warpath, and while we all regret the end of that unfortunate man, while we all regret that he placed himself in such a position that the extreme penalty of the law had to be visited upon him, while I have heard orators appeal to the passions of the Canadian people in favour of this course, I have never heard them make reference to those two young men who went out there with their wives to settle down in that country, and who were shot down by the creatures of Louis Riel without a word of warning. (Applause.) Nor to the two priests who went out to that country, devoting their lives to the cause of Christianity, and while offering the last consolations to these dying men, and kneeling beside them, received the murderer's bullet. The victims of this savage butchery were cast into an old cellar, and their bodies left there in the ruins of that place. No sympathy was expressed for them. I think the people of this country are disposed to think that these lives were just as valuable as that of Louis Riel.\n\nLet me give you another instance of the unfair attacks upon the Dominion Government for the execution of Louis Riel. Let me ask the attention particularly of those Irishmen who have blamed the Government for the execution. Not more than six weeks before this\nevent an Irishman committed murder in that country, was tried and convicted, but his counsel appealed, claiming that the court had no jurisdiction to try a case of murder. The appeal came before the Minister of Justice, no appeal was granted, the law took its course and the man was executed.\n\nLouis Riel was tried afterwards by that same tribunal in the same country, and sentence of death was passed upon him. His lawyers advised an appeal on account of want of jurisdiction in that court. The Government did not value the life of Louis Riel more than that of an Irishman. They had no more doubt as to the jurisdiction of the court than in the former case. They saw that the case of Louis Riel was one which a portion of the population of this country were trying to give a national character. They said, \"We must try and keep that dangerous sentiment down, and therefore will make an exception in this case, and while we fully believe the court has jurisdiction, while we believe it is constitutionally constituted, still in order that these demagogues may not have anything to appeal to the passions of the people of the country upon, we must show that the Government are disposed to afford him an opportunity of clearing himself from the death penalty, if he can be cleared under the laws of this country.\" Accordingly an appeal was allowed, the case was carried to the Supreme Court in Winnipeg, where the sentence of the first court was confirmed after a full investigation and examination of all the evidence that could be produced. And let me say here as an answer to those who charge the Government with refusing to furnish means for the trial, that the Government did furnish all the money for bringing the witnesses asked for by the defence.\n\nAs I have said the decision of the first court was confirmed. But the lawyers of the defence said: \"Now, there is still one last resort, one tribunal in which the whole empire has confidence. Let us see if we can get an appeal to that higher tribunal, the judicial committee of the Privy Council. That demand was made upon the Government. The Government said yes. The political demagogues must have no ground or excuse for saying the prisoner had not a fair and impartial trial. So the case was carried before the judicial committee of the Privy Council, and with what result? That committee confirmed the decision of the two former courts. Then there was nothing to be done unless the Government would step in and say, \"No, this man must not be hanged.\" But the Government could not consistently take such a course as that. They did not consider that it was only the life of Louis Riel that was at stake; the policy of the Government was to settle and people that great Hudson Bay country with a law-abiding population. Exposed to the possible outbreak of the savage tribes in that territory, if there was one thing above all other things necessary for the future peace and prosperity of our Canadian Northwest, it was to assure the people of that country that the law of the land must be obeyed and maintained. They felt they owed it to every new settler\nwho went into that territory that he should feel that the arm of the law was strong enough to protect him and punish wrong doers.\n\nLet us suppose here that in response to the strong appeals made to them—not by the countrymen of Louis Riel, for the French-Canadian people were not the countrymen of Riel, who was as much an Indian as a Frenchman, and did not represent them in the true sense of the word, although I can understand that on account of being half French they would take a deep interest in him—supposing, I say, the Dominion Government had yielded to the very earnest and numerous solicitations made for his release, what then? I say it would have paralyzed the people of the western country, that it would have irrevocably shaken their confidence in the administration of justice. What would they do with the savages who, stimulated by Riel, committed brutal murders in the distant territory? They were arrested and found guilty of murder. Could the government pardon Louis Riel and let these savages be punished? Would they not be handed down to future generations as corrupt and cowardly administrators of the law? Would it not be said, and justly said, \"You let Louis Riel escape because he had a large section of the civilized portion of the country to use their influence to set him free, but you strung up these poor, uncivilized savages who had none to plead on their behalf?\" They could not do it. They could not allow the man who created the rebellion to go clear and punish his hapless victims and dupes. Well sir, the result was that the majesty of the law was vindicated, the law took its course, the death penalty was carried out and Louis Riel died for the terrible crimes he had committed. (Applause.)\n\nAnd that is not the only question that will be a prominent issue at the next general election. I would like to say a few words in self-defence and in defence of my friends in Parliament who, with me, have been accused as traitors—I mean the question of Home Rule. I desire to state the history of that question in as few words as possible. In 1882 I was called upon by a committee of Irishmen representing both political parties in this country, and being a warm sympathizer with the movement for Home Rule in Ireland, I was asked what I thought would be the prospect of carrying a resolution in the House of Commons favouring a system of government in Ireland such as the Canadian people enjoyed in this country. Well, I said, I think the people of Canada, who know all about Home Rule, who enjoy its benefits and feel satisfied with the blessings of the government under which they live, will not object through their representatives to express a willingness to see the people of Ireland enjoy the same privilege. I was asked to take charge of that question, and I consented to do so on one condition—that it would not be a political question, that it would not be a party question, and that I should have the assurance of the Irish people themselves, that they wanted me to move in this matter so that I would not be charged with acting the part of a demagogue in the House of Commons. Resolutions were passed all over the\nDominion of Canada from the Atlantic to the Pacific coast, endorsing my resolution of 1882, a copy of the resolution which had been sent to them, and which it was intended to move before the House. I took steps to have the resolution placed before the House, to get the expression of the House upon it. I invited every Irish member, Protestant as well as Catholic, in the House and in the Senate, to meet and appoint a sub-committee to prepare the resolution; still carrying out the one condition I started with at first that it should not be made a political question, I invited gentlemen from both sides of the House to co-operate. The meeting was held, most of them attended, we formed a sub-committee, framed the resolutions, gave notice of motion, and to make a long story short, not a vote was recorded against them in the House of Commons.\n\nEdward Blake made one of the ablest speeches I ever heard in my life in support of them. I did not consider that his speech carried the question, because you all know, gentlemen, that in the House of Commons the ones who carry the questions are the ones who have the majority of the members in sympathy with them. The minority do not initiate many measures, nor carry them through, but I am willing to give Mr. Blake and his friends the credit of having co-operated with us. We carried it to the Senate. There it received almost unanimous sanction, only six members voting against it. The address was then forwarded to Her Majesty through His Excellency the Governor-General. Earl Kimberley was instructed to reply that in such matters Her Majesty would consult her own Ministers, that this was not a matter the people of Canada had anything to do with—practically told us to mind our own business. At that time Mr. Gladstone held a good many of the leading Irish Home Rulers imprisoned in Kilmainham, and in this address was a suggestion that they should be set at liberty. They were set at liberty shortly afterwards. But I would like to call the attention of my friends—if I may call them such—for I have a great respect for the Irish people here on account of the warm sympathy for the movement which is being made in Ireland. I admire the pluck and energy of the fight they are making for what we are enjoying in this country, and which no liberal man will say they are not entitled to in Ireland. What followed? I do not find fault with the masses of the Irish people, for I know they have been deceived and misled. But I have supreme contempt for the demagogues who, knowing that I have been trying to do what is right and honest, endeavour to injure me in the estimation of my own countrymen. The Irish all over Canada sent me messages of congratulation for the passing of a motion which they had not believed would pass the House. The most they expected at the time was that it would elicit a favourable vote in Parliament, but they never dreamed that a majority would carry it through. I am sorry to say that the congratulations, that warmed and cheered my heart at the time, were soon to be changed into insults and injuries, inspired by the demagogues to whom I have before referred.\nLast session when there had not been a word said, not a single word had I received that the Irish question ought to be raised again in the House, the first indication I ever had of it was when the Montreal Post and True Witness published an article saying that \"it is rumoured that a motion is to be introduced in Parliament to thank Mr. Gladstone for the legislation he has initiated in favour of Home Rule. If it should come from the Tory side (and you will remember it was a Tory who moved and carried these resolutions at the request of the Irish people in 1882), if it should come from the Tory side, we know what it means; it will be pure bunkum and humbug to please the Irish people, but the time is past for passing any such resolutions.\" Well, sir, a few days afterwards the St. Patrick's Literary Society of Ottawa came to me and asked me to move another resolution on the Irish question. I said, \"show me how you expect to strengthen the hands of the men who are fighting the battle of Home Rule in Ireland, and I am with you. Can you get a better vote in the House of Commons than you got before? Is not there danger that you might not get as good a one? Then, why re-open the question? I will not do it unless you can show me or give me assurances that you are not going to injure the question, but that it is going to gain by it.\" But the game was apparent. It was not Home Rule the wire pullers among these people wanted. It was not to strengthen the people in Ireland, but the Grit party, in Ontario especially. They wanted to be able to go back to Ontario and say, \"We introduced a resolution for Home Rule and the Government opposed it.\" That is proved by the course they pursued. Mr. Blake then, as we all expected, moved as an amendment to the motion to go into supply, his motion on the Irish question. That motion coming from the leader of the Opposition was beyond any cavil a clear, open question of want of confidence. It was so accepted and he was advised that if he forced that motion under present circumstances the Government could not do anything but vote it down. No doubt that would have suited Mr. Blake's purpose as far as Canadian politics was concerned, but when Sir John A. Macdonald told him that he would name a day to discuss the question Mr. Blake had to withdraw the motion.\n\nThe day fixed was Thursday, and I saw that if the motion was carried at all it would be carried by a very much reduced vote compared with that of 1882, and I saw also that those opposed to any Home Rule would say at once: \"In 1882 Costigan's Home Rule resolution received the unanimous support of the Canadian House of Commons, and was carried in the Senate, receiving every vote but six, and what was the result in 1886? Why, the resolution introduced by Mr. Blake, the leader of the Opposition, was voted on and carried by a bare majority, and never was sent to the Senate at all. There has been a great change of opinion in Canada. The Canadian people whose sympathies were so strong in 1882 have changed their views greatly because the vote of 1886 is very much weaker than that of 1882.\" What then did I do? I introduced an amendment to Mr.\nBlake's motion, and I was careful in preparing that amendment to reproduce the sentiments contained in the motion of 1882. The principal reason I reiterated those sentiments was because I felt in placing that same resolution before the House I was asking the gentlemen who voted for it before to confirm what they voted for in 1882, and, sir, I was doing more; I was ensuring the passage of my amendment, which was of equal and, according to Home Rule organs, greater value than Mr. Blake's motion by double the majority he could reasonably expect, as leader of the Opposition, to have his carried by. Well, sir, the amendment was carried and then the work began, the work of slander, misrepresentation and falsehood. A howl was raised at once and echoed around the country that Costigan and the other Irish supporters of the Government were all traitors, that we had played into the hands of the Government on this question and were deserving of nothing but supreme contempt. Before Mr. Blake moved his resolution, with the concurrence of the Irish members of both Houses, I sent Mr. Parnell directly a cablegram congratulating him upon the progress that was being made in the public mind on the question of granting Home Rule to Ireland, and here is the answer sent by Mr. Parnell himself:\n\n\"Dear Sir—I desire to express to you and also to the Irish representation in the Canadian Parliament the cordial thanks of my colleagues and myself for the lengthy and important message which you cabled to us on the 4th inst. This expression of sympathy on the part of yourself and our friends in the Canadian Parliament is of the utmost importance to our cause, as it will do a great deal towards strengthening our position in the Imperial Parliament.\"\n\nNow, I may be wrong in this matter. I know there are warm friends of Ireland in Canada. I know there are men who would make great sacrifices to see Ireland enjoying the same system of Government we are enjoying here. But I do not believe that any of these men, especially those who have criticised me severely, know more about Home Rule than Mr. Parnell and his associates in Ireland do, and I am quite satisfied, as far as the Irish question is concerned, and with the kindly assurances that I have confirming the thanks of these men for having rendered great service to them, while at the same time they thank the Canadian Parliament for the generosity that made them support that motion, I say I am quite satisfied that I can afford to let the demagogues talk a great deal and still not be uneasy in my conscience for the course I have pursued. (Applause.) After the resolution was passed some of the newspapers raised the cry, and one-half the Irishmen in the country were led to believe that I and my Irish friends had voted against Home Rule. Why? Because we voted against Mr. Blake's motion. So we did. But if we did we all voted for the amendment which I introduced. They say my amendment was nothing like Mr. Blake's motion. Well, I think the Irish people themselves ought to be as good judges on that point as anyone in the country. If you had read the leading organs of Mr. Parnell in Ireland you would have seen that they\nsay the difference between the two motions—Mr. Blake's and mine—was as between tweedledum and tweedledee, a difference in construction only, the advantage being on the side of Irish liberty, because it was carried by the responsible Ministry of the day and not by the irresponsible minority. (Applause.)\n\nBut I have better proof than that. Do these men know that Mr. Blake did not stand so firmly and determinedly by his own motion? Mr. Blake did not consider that there was such a great difference after all between his and my motion, because he and his party swallowed my motion and voted for it to a man, except Mr. Mitchell, who would not vote either way. It could not have been so bad or Mr. Blake would not have voted for it. The only difference was that mine succeeded in carrying a larger vote than he could have succeeded in carrying, because I made it almost word for word with the motion we voted on in 1882. I say that Mr. Blake, in introducing that motion, was not influenced by the desire of promoting Home Rule. If he had been desirous of promoting Home Rule would he have sprung his vote of want of confidence without consulting the Irish members in the House? He knew he would not have carried that motion, but what he wanted was to try and bring it in and have it voted down without any amendment such as I moved.\n\nIt is not merely because it is an Irish question that I have dragged this subject in this evening. It is because it will be discussed in the election here more than the National Policy itself. The Irish people of Canada feel deeply interested in the cause of Ireland. They are ready to make a sacrifice to obtain a system of Home Rule, and if they can be persuaded that we have been traitors to them, we will lose their support, and the object of the Liberal party is to gain sufficient strength through detaching the Irish party from us, and enough supporters out of Quebec, to give them the reins of power. There is where they expect to get their majority and not from any platform they have been able to construct, and I trust you will excuse me for confining my remarks to this subject, which will, I trust, place our friends in a position to understand what did really take place, and then they will be able to judge for themselves as to who was right and who was wrong. (Hearty applause).\n\nMr. Costigan has given a very fair and impartial account of the resolutions of 1882 and of those of 1886, in the foregoing speech. It may, however, interest the Irish people of \"this Canada of ours\" to know that \"Home Rule\" not being quite so popular in 1882 as it has since—thanks to God—become, the attendance of the Liberal side of the House at the meeting in 1882 alluded to by Mr. Costigan was just four—and at the adjourned meeting held subsequently just two—including Senators and Members of Parliament of the \"Irish\" (Catholic or Protestant)\n\"persuasion.\" His reference to the effervescing anxiety of the Liberals in 1886—who were so very conspicuous by their absence in 1882—is particularly well told.\n\nHere it may be well to introduce a chapter or two from Mr. J. K. Foran's pamphlet. The following tells in succinct language what would assuredly have been the fate of Mr. Blake's resolutions had his motion of want of confidence in the Government been allowed to go before the House, even with the support of Messrs. Costigan and the other Irish Catholic members. Mr. Foran says:\n\n\"In this chapter I will put the question in a new light, and do so as simply as I can. After the resolutions were forced into the House, despite the dangers to which they were going to be exposed, Mr. Blake seized upon the opportunity and moved them. Mr. Mills then moved an amendment to the effect 'that the name of Parnell be added to that of Gladstone, in the original resolutions.' To prove their sincere desire to aid in the work, and their real wish to have Ireland's great leader honoured, the Irish-Catholic members (Conservative), one and all, voted with the opposition upon this amendment. Costigan, Curran, Daly, &c., all cast votes with the Liberals in order to express their admiration of Parnell and devotion to Ireland. What was the result? The amendment was lost by 87 to 69. By a majority of eighteen the name of Parnell was left out, showing that it was not to honor him, to serve Ireland, but to praise the Liberal leader, and for party purposes that the resolutions were taken up by the Grit faction. Then arose the danger. Had Costigan, Curran, Bergin, Daly, &c., voted with Mr. Blake on the original motion, the result would necessarily have been the same; the Blake resolutions would have been defeated by a majority of eighteen. Then would these Irish Catholics have stultified themselves! They would have given a powerful weapon to Salisbury, Chamberlain and Churchill. These men could have pointed to Canada and said, 'four years ago the Dominion was in favour of Home Rule, but since it has changed its opinion and it must have good reason for so doing.' Mr. Blake would have reaped the benefit of having taken them up; while their defeat would have suited all his other political purposes. What remained for Mr. Costigan and others to do? Save at all hazards the defeat! Mr. Costigan, then, seeing that the vote would run on party lines, despite his and his colleagues' efforts and their votes for the Opposition, and that certain defeat stared them in the face, and knowing that the Conservative vote was the stronger, he grasped in a statesmanlike manner, the situation and moved an amendment which had the effect of tiding the resolutions over the shoal, and saving them from being swamped. And for this amendment he is condemned. Men come out to condemn, in no measured terms, the very action which was the salvation of the cause.\"\nBut let it be always borne in mind that the movement of 1882 was a spontaneous one on the part of the whole Irish population of the Dominion. Every Irish Society from the Atlantic to the Pacific who could be reached was consulted. What was that of 1886? Was there a single Irish Society, a single Irishman outside of Ottawa consulted in the matter? Let those who\n\nPULLED THE WIRES\n\nin the City of Ottawa answer; and on their heads lie the odium of having endangered the\n\nSACRED CAUSE\n\nof Home Rule for Ireland—in so far as in them lay—in order that they might achieve a passing triumph in Dominion Politics.\n\nMr. Costigan and his fellows are accused of abandoning the cause of Home Rule. Well, let Mr. Foran again speak, and he speaketh as follows:\n\n\"It has been stated that Mr. Costigan ceased to take an interest in the Irish cause after the passing of the Home Rule resolutions of 1882. It is true he did not go about crying from the house-tops his Irish sentiments; but unknown to the public, in secret and in the quiet sphere that lies beyond the din of public tumult he unceasingly labored for that cause. Did some Irish-Canadians but know the one-half of his actions and movements to aid and further the Home Rule cause, they would blush with shame with having treated the quiet worker so disgracefully. Because he did not parade his every act before the public gaze they think he was silent and inactive. In 1883, before any definite plan of Home Rule was adopted by the Irish party at home, and when the Marquis of Lorne was about to leave Canada, he wrote to Mr. Costigan asking that Mr. Costigan should point out measures he deemed necessary for Ireland, in order that these suggestions might be used on the other side of the Atlantic to Ireland's benefit. Before Gladstone favored Home Rule, before Parnell's platform was completed, here is what Hon. John Costigan sent to the Marquis of Lorne. As Minister of the Crown, and as an Irishman, this so much abused man placed the following powerful statement in the hands of Her Majesty's representative.\"\n\nAnd it may be added:—Did some Irish Canadians know but one-half of his (Mr. Costigan's) actions and movements to secure to them a just representation in every walk of life, \"they would blush with shame with\nhaving treated the quiet worker so shamefully.\" But men's good deeds live after them, and when John Costigan will have passed away, many who now—if they do not revile him at least join in the parrot-like cry \"He made a mistake\"—will say in the bitterness of their remorse, \"When shall we look upon his like again?\"\n\nNow here is Mr. Costigan's letter to Lord Lorne, alluded to by Mr. Foran, written with a full knowledge of his responsibility, as the sworn adviser of the Queen—the Queen of Canada as well as she is the Queen of England—and mark the date (1883), years before Mr. Gladstone had adopted Home Rule, when, in fact, by no word or sign had he given the world to understand that he favored the measure; and mark also, the remarkable coincidence between its opening words and those of Mr. Gladstone in his memorable speech, when he introduced his Bill into the House of Commons to place \"Local Legislation and administration in the hands of the Irish people.\" Such were the very words he used. Is it an unfair deduction to assume that when he was drafting his bill he had Mr. Costigan's letter to Lord Lorne under his eyes; and is it not fair to assume that Mr. Gladstone followed the advice given him by one whom he had every reason to suppose was the exponent of the views of a large portion of the people in this \"the brightest gem in the crown?\"\n\n\"OTTAWA, 18th June, 1883.\n\n\"Dear Lord Lorne.—In your letter of the 8th inst. you ask me to point out what measures I deem most useful for Ireland.\n\n\"I am thoroughly convinced that Home Rule is the measure that Irishmen at home and abroad expect. I am also of opinion that no other measure, which will not place the control of Local Legislature and administration in the hands of the Irish people, will be satisfactory to them, or productive of that harmony which is so essential to the well-being of the Empire.\n\n\"I am aware of the existence of difficulties in the way of giving to Ireland a system of local government similar to that enjoyed by the Provinces of Canada; but I believe those difficulties are less numerous and less complicated than the difficulties that presented themselves to the framers of our present constitution, and should be as easy of being provided for in the case of Ireland as they were in the case of the different provinces now comprised in the Canadian Confederation. The difficulties in the way seem to be of a triple nature. The large owners of property look with dread at the prospect of entrusting vested interests in the hands of men who would be new to the responsibilities of administering a people's affairs. They seem\nto fear the teachings of Socialism, and to think that if Ireland were free from her present moorings, confiscation of all existing proprietary rights would follow. Then English pride revolts at the danger of disintegrating the Empire. It views with alarm the proposal to establish what it considers might be a hostile Parliament in Ireland, and even moderate Englishmen fancy that such an experiment would be dangerous. Again the religious minority in Ireland appear to think that its liberties would be in danger, and they question the propriety of entrusting their future to the keeping of men with whom they have had long and bitter feuds.\n\nThose are, in my opinion, among the prominent difficulties which the Imperial Government have to overcome, and if they can be satisfactorily guarded against the experiment of granting Home Rule to Ireland might be attempted without arousing the fears of the landlords, the dread of Imperial shipwreck, or the terror of religious persecution. If the Imperial Government reserved to itself the right of veto over all Irish Legislation, as the Government of the Dominion has over all Acts of Provincial Legislatures, the dangers of Socialism, Confiscation or Persecution would at once vanish. With such a power vested interests would be as safe as they are now, the integrity of the Empire just as secure, and the liberties of the minority just as free from the danger of extinction. The Irish Parliament would have no power to successfully assail either one or the other. The chances are that the desire for doing so would not exist. The past history of Ireland, as well as current events go to strengthen this supposition, for it is a well-known fact that, in all their struggles, men differing in religious belief from the majority, have always been among the most trusted leaders of the people. In the East, South and West, gentlemen holding religious views contrary to theirs enjoy to-day the highest representative offices, legislative and municipal within their gift, and there can be no just reason for anticipating that the conduct of the majority in the future would differ from their action in the past; but, assuming the worst, the people of Ireland would be powerless in view of the safeguard which the veto would ensure. But there could be a still greater safeguard. These difficulties could be finally settled before Home Rule were granted at all. The land question could be settled now. In fact I believe no system of Home Rule would succeed in Ireland unless that question were first settled. No matter how that question is disposed of at present, the ultimate solution of it must be a radical one. Ireland must have a peasant proprietary sooner or later, and it should be far more satisfactory to the landlords and better for the Empire to have the difficulty ended by an Imperial enactment than risk the success of Home Rule by leaving so difficult a problem to be solved by the first Local Legislature. And the integrity of the Empire would be secured in the same way; everything affecting that integrity might be reserved for Imperial Administration and Ireland would have no\nmore power to break away from Great Britain than any Province in\nthe Dominion would have to break away from the Confederation.\nWith our power of veto and the control of the militia, the danger of\nsecession is removed and there is no reason, that I can see, that Great\nBritain could not guard her interests in a similar way.\n\nNor do I see any danger which might threaten the minority in\nIreland that could not be guarded against. Your Lordship may\nremember that at the time of Confederation the Protestant minority\nof Quebec asked for certain guarantees. They rightly wished that\ntheir interests should in someway be guarded in order that they should\nhave a fair share of representation in the House of Commons as well\nas in the Local Legislature of their Province. What was done? In\nthe Eastern Townships there was a Protestant minority, and twelve\nconstituencies were so arranged as that they would have Protestant\nmajorities, thus securing Protestant representation to the minority of\nQuebec. This arrangement stands good to this day. Why could not\na similar arrangement be made in Ireland in arranging the constitu-\ncies for the Local Parliament? The North could be so divided that\ncertain constituencies would have Protestant majorities, thus securing\nto the minority fair representation. In fact the chances are that the\nminority would hold the balance of power. There would be, as there\nnow is, a large portion of the Irish Catholics who would defend\nProtestant liberties as readily as they would defend their own, and\nany attempt to interfere with these rights would end as disastrously\nas if an attempt were made to extinguish the rights of the Protestant\nminority in the Province of Quebec, or of the Roman Catholic\nminority of the other Provinces. Thus, my Lord, it appears that the\nthree great difficulties in the way could be removed by surrounding\nthe proposed Constitution with safeguards which in a great way have\nalready been adopted with marked success here. When Confedera-\ntion became a living factor in Canadian politics the leading men\nfrom the different parts of the country were brought together, and\ninterests and special cases of each locality were considered.\n\nThere is another\nserious aspect of the Irish question which a careful student of the\nEnglish press cannot fail to notice. That press is continually pointing\nout the difficulties in the way of Home Rule, but never tells us of the\nadvantages such a change in Ireland would be to the Empire at large.\nNo thought seems to be given to the security and peace that a satisfac-\ntory solution of the difficulties in Ireland would bring to Canada alone.\n\nHome Rule would\nbeyond a doubt, consolidate, not weaken, the Empire. It would\nmake the Irish at home as loyal as the Irish in Canada and the\nColonies, and it would remove all causes of serious agitation on the\npart of extremists. That loyalty would be cheaply purchased by the\nsurrender to the Irish people of the management of their local affairs.\nEngland should accept the national aspirations of the Irish people as\n\"a burning fact, and instead of decrying it, utilize it for her as well as\nIreland's benefit. How strong that national aspiration is, the attempt\nof the Pope to interfere with the Parnell testimonial fully proves.\nFancy a people who have suffered so much for their Religion as the\nIrish have in the past. Century after century the persecution went\non and yet the Irish remained firm upholders of their Faith. They\nmight be exterminated but they would not change; but yet the instant\nthat the visible Head of their Church—the man whom they look upon\nas the most important Personage on earth—tempts to run counter\nto the National will, that instant sullen silence or open anger find\nplay, and they give him to understand that not for him will they\nswerve from the line of duty.\n\nThe War Office conceded to the Irish regiments the right to wear\nthe Shamrock, and I am confident that that little concession to their\nnational sentiment did more to touch the hearts of the Irish soldiery\nthan did the disestablishment and disendowment of the English Church\nin Ireland. That sentiment should be accepted as a factor in the pre-\nsent struggle, and it would be wise if the English Government allowed\nit generous and legitimate play.\n\nWith reference to the Franchise, I see no reason why the English\nlaw of household suffrage with a larger Franchise should not be applied\nto Ireland. It would not do to have a more restrictive Franchise in\nIreland than in England, and to us in this country it appears an\nanomaly that the poorer country should have the larger assessment in\norder to qualify for the electorate.\n\nAs to Provincial Legislatures, I can see no reason for their adop-\ntion. They would add materially to the burdens of the people without\ncorresponding advantages. One Parliament would be sufficient with\nCounty Boards and such a Municipal system as we have here. If that\nParliament were vested with power enough to control local affairs,\nstrong enough to develop the resources of the country, and prudent\nenough to expend advantageously its share of the revenue, peace and\ncontentment would reign once more in Ireland. All this can, I be-\nlieve, be easily accomplished, and if it be done within a reasonable\ntime, I am convinced we will witness an outburst of Irish loyalty that\nwill be an additional guarantee of the stability of the Empire and the\nsecurity of the Throne.\n\nHaving now, my Lord, given you an idea of my opinion on the\nIrish question, I avail myself of the opportunity of congratulating your\nLordship and Her Royal Highness on the pleasing fact that in sever-\ning your official connection with them, you carry with you the best\nwishes of the Canadian people, for your prosperity and happiness, and\nto assure you that no portion of them wish that prosperity and hap-\npiness to yourself and Her Royal Highness more fervently than do\nthe Irish. Believe me to be, &c., &c.\n\nDear Lord Lorne,\n\nYours very truly,\n\nJOHN COSTIGAN.\"\nRemember it was in the summer of 1833 that this was written. It came from a Minister of the Crown to the representative of England in Canada, and was to be conveyed by that representative to England and to be placed before the English Government.\n\nReviewing Mr. Foran's pamphlet, the Dublin Freeman's Journal of 30th November, 1886, says of Mr. Costigan's letter to Lord Lorne:\n\n\"Our readers are not unfamiliar with the name of the Hon. John Costigan, the mover of the celebrated series of resolutions in favour of Home Rule for Ireland which the Dominion Parliament of Canada adopted by a unanimous vote. Mr. Costigan is a type of the transplanted Celt—bold, fearless and uncompromising, with a passionate attachment for the Old Land and an unshaken faith in her ultimate triumph. His ability is sufficiently testified by his rank as Minister of Inland Revenue in the Cabinet of Sir John Macdonald.\n\nMr. Costigan has recently been in communication with the Marquis of Lorne, who, when Viceroy of Canada, formed a high opinion of the Minister of Inland Revenue. The letter which Mr. Costigan addressed to the ex-Viceroy, and which is published in a pamphlet by Mr. Foran on 'Irish Catholic Representatives,' is a powerful plea for Home Rule. He discusses the question at considerable length, viewing it in its relation to religious tolerance, to the position of the Imperial to the subordinate Legislature, and to its effect upon the general prosperity of Ireland. For all three considerations Mr. Costigan supplies satisfactory proof of the value as well as the necessity of some such measure as Mr. Gladstone proposed.\" With respect to the position of the minority under any condition of self-government, Mr. Costigan writes:\n\n\"I see no danger which might threaten the minority in Ireland that could not be guarded against. Your Lordship may remember that at the time of confederation the Protestant minority of Quebec asked for certain guarantees. They rightly wished that their interests should in some way be guarded in order that they should have a fair share of representatives in the House of Commons as well as in the Local Legislature of their Province. What was done? In the Eastern Townships there was a Protestant minority, and twelve constituencies were so arranged as that they would have Protestant majorities, thus securing Protestant representation to the minority of Quebec. This arrangement stands good to this day. Why could not a similar arrangement be made in Ireland in arranging the constituencies for the Local Parliament. The North could be so divided that certain constituencies would have Protestant majorities, thus securing to the minority fair representation. In fact the chances are that the minority would hold the balance of power. There would be, as there now is, a large portion of the Irish Catholics who would defend Protestant liberties as readily as they would defend their own, and any attempt...\"\n\"to interfere with these rights would end as disastrously as if an attempt were made to extinguish the rights of the Protestant minority in the Province of Quebec, or of the Roman Catholic minority of the other Provinces.\"\n\nMr. Costigan has no fancy for the Chamberlain conception of Home Rule, and his views upon this phase of the question are especially valuable, seeing that the member for Birmingham drew his inspiration mainly from Canada. As to Provincial Legislatures says Mr. Costigan:\n\n\"I can see no reason for their adoption. They would add materially to the burdens of the people without corresponding advantages. One Parliament would be sufficient with county boards and such a municipal system as we have here. If that Parliament were vested with power enough to control local affairs, strong enough to develop the resources of the country and prudent enough to expend advantageously its share of the revenue, peace and contentment would reign once more in Ireland. All this can, I believe, be easily accomplished, and if it be done in a reasonable length of time I am convinced we will witness an outburst of Irish loyalty that will be an additional guarantee of the stability of the empire and the security of the throne.\"\n\nWith the grasp and sweep of a statesman, Mr. Costigan, scouting mere parochial issues, considers the effect of Home Rule upon the Empire at large. No thought, says Mr. Costigan, seems to be given to the security and peace that a satisfactory solution of the difficulties in Ireland would bring to Canada alone.\n\n\"Home Rule would, beyond a doubt, consolidate, not weaken, the Empire. It would make the Irish at home as the Irish in Canada and the colonists, and it would remove all causes of serious agitation on the part of extremists. That loyalty would be cheaply purchased by the surrender to the Irish people of the management of their local affairs. England should accept the national aspirations of the Irish people as a burning fact, and instead of decrying it, utilize it for its own as well as Ireland's benefit. How strong that national aspiration is, the attempt of the Pope to interfere with the Parnell testimonial fully proves. That sentiment should be accepted as a factor in the present struggle, and it would be wise if the English Government allowed it generous and legitimate play.\"\n\n\"Mr. Costigan's letter might be read with profit even by so great a man as Sir Michael Hicks-Beach.\"\n\nSuch is the opinion of the oldest Irish National paper in existence of the services rendered to the cause of the Old Land by Mr. Costigan.\n\nImmediately after the passage of Mr. Costigan's Home Rule reso-\nlutions of 1886, the following appeared in the Irish papers; and inasmuch as the utterances of the Irish National newspapers and of Ireland's great leader have been either entirely suppressed or shamefully garbled by a certain portion of the press of the Dominion, they are submitted in the following shape:\n\nThe following is from the editorial columns of Mr. Parnell's own organ, United Ireland, which is edited by Mr. Wm. O'Brien, M.P., but it falls into an error in saying that the \"snub\" alluded to came from the \"Tory\" Government in 1882. On the contrary, it was the act of Earl Kimberley, the then Colonial Secretary in Mr. Gladstone's government of that time. Here is, verbatim et literatim, what the United Ireland says in its issue of the 15th May, 1886:\n\n\"Great capital is sought to be made by a couple of English Tory papers out of the fact that the Dominion House of Parliament has by a large majority rejected the resolution of Mr. Blake, leader of the Opposition, in favour of self-government. On looking at the telegraphed report of the debate on the question we are opaque enough to fail to discern any particular ground for Tory delight. The debate, we perceive, lasted until five o'clock in the morning, and in the result an amendment of Mr. Costigan, a member of the Ministry, was adopted. The amendment differed very little in substance, though it did in construction from the proposed resolution. It expressed a cordial interest in the welfare and prosperity of the Irish people, and adhered to the sentiments expressed in the former address to the Crown on the subject of granting a measure of self-government to Ireland. While declining to forward any fresh Address, having regard to the snub then administered by the Tory(!) Government, the Canadian Parliament reiterates its good wishes for Ireland, and 'earnestly hopes' that some measure satisfactory to its people may be passed. Now, where is the cause of our contemporaries' unholy joy? Between amendment and resolution it is all but a case of tweedle-dum and tweedle-dee. The advantage, if any, is on the side of Irish liberty; for it is from the responsible Ministry these good wishes emanate, not from the irresponsible Opposition.\"\n\nThe Dublin Freeman's Journal, one of the oldest—if not the oldest—paper in Ireland, owned and edited by Mr. E. Dwyer Gray, M.P., reproduces Mr. Costigan's cable message to Mr. Parnell, which is given below, and, speaking of the numerous congratulatory messages received by the latter gentleman, says:\n\n\"The most notable of these is the long and deeply earnest communication of the Minister of Inland Revenue in Canada. The Hon.\n\"John Costigan, who speaks on behalf of the Irish representatives in\nthe Dominion Parliament, is, we need hardly remind our readers, the\nmover of the celebrated series of resolutions in favour of Home Rule\npassed in 1882, and which was the first expression of its kind in favour\nof the Irish National demand. Mr. Costigan also moved the amend-\nment to the resolutions in the Dominion Parliament a few days ago,\nand the purport of which was so ludicrously misinterpreted by several\nof our home journals, as well as some across the Channel.\"\n\nThe always faithful and unflinching Dublin Nation also wrote\neditorially as follows:\n\n\"The Irish people must feel grateful to the Dominion Parliament\nof Canada for the resolution of sympathy with Home Rule passed by\nthat body, we might say unanimously, a few days ago. A division\nwas taken on the resolution, but the question lay between that form\nof words and one still stronger which had previously been proposed,\nso that both parties voted in favour of the principle of Home Rule\nfor Ireland.\n\n\"A similar resolution was passed by the Canadian Parliament four\nyears ago. On the 20th April, 1882, the Hon. Mr. Costigan moved\nthat an humble address be presented to Her Majesty in favour of\nextending to Ireland some such system of Home Rule as had made\nCanada prosperous and happy, and expressing a hope that the time\nhad come when Her Majesty might extend her clemency to persons\nin Ireland undergoing imprisonment for political offences. This\nmotion was advocated by the hon. gentleman in a very able and\ntemperate speech; it was supported by the Hon. Mr. Blake, who had\non a former occasion in the same House made reference to the subject:\nthe Prime Minister, Sir John Macdonald, expressed his approval of\nthe motion, several hon. members spoke warmly and eloquently in\nfavour of it, and no one opposed it, and it was carried without a\ndivision.\"\n\nThe Nation then refers to the fact that the address of 1882, hav-\ning been forwarded to Her Majesty, a reply was sent by the then\nColonial Secretary of the Liberal Administration to the effect that, \"in\nmatters relating to Ireland, Her Majesty would be guided by her\nresponsible advisers, and the Parliament of England,\" and continues:\n\n\"It speaks well for the spirit of the Canadian Parliament that\nthey have not been discouraged by this rebuff from again, and at this\nopportunity moment, making a pronouncement in favor of Home Rule\nfor Ireland. On the fourth of the present month the Hon. Mr. Blake\nmoved: 'That this House hails with joy the submission to the Parlia-\nment of a measure recognizing the principle of local self-government\nfor Ireland, and expresses an earnest hope that the principle of said\nmeasure may be affirmed, forming the basis of settlement of a great\nquestion; and conducing to the peace, happiness and prosperity of the Empire.\n\n\"The Hon. Mr. Blake is leader of the Opposition in the Dominion House of Commons, and it would seem as if the government did not wish that he should have the credit of carrying this resolution. The Hon. Mr. Costigan, Minister of Inland Revenue, moved as an amendment a slightly watered down edition of it, which was carried on a division by a large majority. But substantially both motions meant the same thing. The Parliament of Canada has declared for a Parliament for Ireland; the fact must have weight with English statesmen; it will for ever be gratefully remembered by the Irish people.\"\n\nThe Western People, the leading Nationalist paper in the West of Ireland, reproduced Mr. Costigan's cablegram to Mr. Parnell and said:\n\n\"The distinguished Canadian Minister, John Costigan, sends from Ottawa a message of sympathy and encouragement to Mr. Parnell.\"\n\nMR. COSTIGAN AND MR. PARNELL.\n\nOn the 23rd of May, Mr. Costigan, acting on behalf of the Irish representatives in the Canadian Parliament sent the following cable message to Mr. Parnell:\n\n\"OTTAWA, May 4th, 1886.\n\nTo C. S. Parnell, Esq., M.P., London, England.\n\n\"As mover of the Irish resolutions in the Canadian Parliament in April, 1882, and on behalf of the Irish representatives in Parliament, I desire to convey through you to our fellow subjects in Ireland an expression of our deep sympathy in their struggle for Home Rule.\n\n\"We re-affirm the sentiments contained in those resolutions, and without presuming to pronounce an opinion on the details of any particular measure propounded, we desire to declare to the people of Ireland our gratification at the general recognition of those views, which has taken place since 1882, and to express our hope that the time has come when without injury to the interests of the United Kingdom, or to any section of it, such a system of self-government may be given to the Irish people as will meet their reasonable demands, and fulfil the anticipations which have been so highly cherished in their behalf by many of Her Majesty's subjects in this portion of the Empire.\"\n\n\"JOHN COSTIGAN.\"\n\nTo the foregoing Mr. Costigan received the following reply:\n\nHOUSE OF COMMONS LIBRARY,\nLONDON, May, 1886.\n\nDEAR SIR,—I desire to express to you, and also to the Irish representatives in the Canadian Parliament, the cordial thanks of my colleagues and myself for the lengthy and important message which you\ncabled to me on the 4th instant. This expression of sympathy on the part of yourself and our friends in the Canadian Assembly is of the utmost importance to our cause; and it will do a great deal towards strengthening our position in the Imperial Parliament.\n\nI am, with much respect,\n\nYours very truly,\nCHAS. S. PARNELL.\n\nHon. John Costigan, M.P.,\nCanadian Parliament,\nOttawa.\n\nRESOLUTIONS APPROVING THE CONDUCT OF THE IRISH-CANADIAN REPRESENTATIVES.\n\nThe following Address was presented to Mr. J. J. Curran at a meeting held at Rawdon, Que., during last December, presided over by the Mayor of the Municipality:\n\n\"To Mr. J. J. Curran, M.P.:\n\nDear Sir,—We, the undersigned Irishmen of Rawdon, electors of the County of Montcalm, wish to thank you for having visited our county in the present electoral contest on behalf of the Hon. L.-O. Taillon, who has all our sympathies. We were particularly desirous of hearing you on account of the violence of the charges launched against the Hon. John Costigan, yourself and our trusted member for the Dominion, Mr. Dugas, on the Riel and Home Rule questions. Your speech, supported by the proofs you have given us, is an overwhelming answer to the slanders that have been preached and published against you, and we pray God may give you health and long life to fight the battle of the good cause which you have done for so many years.\"\n\nAt a meeting of the Irishmen of North Middlesex held recently for the purpose of sending funds to the National League in Ireland, an unanimous resolution was passed thereat fully endorsing the conduct of their representative, Mr. T. Coughlin.\n\nAN OPINION OF MR. COSTIGAN.\n\nAbout a year ago the following letter appeared in the Irish Canadian. It is a true appreciation of his character and of his efforts on behalf of his fellow Irishmen:\n\n\"Your patriotic journal brings the name of the Hon. John Costigan before its readers, and enlarges on his worth and usefulness as an Irish Catholic representative. As a member of the Cabinet, and Minister of Inland Revenue, the public are conversant with the\nable manner in which the duties of his office are discharged. His\ncandor and urbanity of manner have endeared him to every person\nwho, in a public or private capacity, has a necessity to approach him.\nThere are many other ways besides in which he has been a benefit to\nhis fellow-countrymen which have not been brought before the public,\nand which so far have escaped the observation of your correspondents.\nHe has made himself not only useful but beneficial to many an Irish-\nman, particularly to those connected with the Civil Service. *\n* *\nIt is, then, a matter of the utmost importance that the Honorable\nthe leader of the Government should see the necessity of appointing\nin the cabinet one who would truly and faithfully represent the\nCatholic element of the country, and the mantle could not have fallen\nupon one more suited by nature and sentiment to fill the position\nthan the Hon. John Costigan.\"\n\nOne of his characteristics is, that he is easily approached—in\nitself a charm. Another is the faculty which few possess, and which\ncannot be assumed or acquired, but must be implanted by nature—of\nmaking one feel at home in his presence. If an Irishman seeks an\ninterview with him he will hear him out patiently, and if he sees his\nway of removing any grievance and undertakes to do so, he may rest\nassured that matters will be put to rights if it is possible to accomplish\nit. The practice with him is to make no promise which he is not pre-\npared to carry out, and there can be no better evidence of his superior-\nity and gentlemanly bearing.\n\n\"Since his appointment he has removed many a grievance of long\nstanding in improving the position of many a deserving and industrious\nofficer, who without his intervention would remain without redress\nuntil the end of time.\"\n\n\"COSTIGAN IS AN IRISHMAN.\"\n\nMr. Costigan represents the united counties of Victoria and Mad-\nawaska in the Dominion Parliament. And what do you think is the\ncry that is being raised against him, particularly in the latter county:\n\"Oh, Costigan is an Irishman; the Irish papers claim him as such;\nand didn't he put his hand into the Canadian treasury in 1880 to send\nOne Hundred Thousand Dollars to his starving people in Ireland.\n\nIrishmen of the Dominion! ponder over this latter part and pic-\nture to yourselves what must be Mr. Costigan's feelings under such\ncircumstances. Emissaries of the Liberal party from the Province of\nQuebec are at this moment in the county of Madawaska raising this\ncry amongst their compatriots.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001418.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 27, "total-input-tokens": 38334, "total-output-tokens": 15943, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 259, 1], [259, 259, 2], [259, 2001, 3], [2001, 4561, 4], [4561, 7780, 5], [7780, 10979, 6], [10979, 14080, 7], [14080, 17265, 8], [17265, 20377, 9], [20377, 23534, 10], [23534, 26678, 11], [26678, 29842, 12], [29842, 33024, 13], [33024, 35903, 14], [35903, 38809, 15], [38809, 41081, 16], [41081, 43698, 17], [43698, 46836, 18], [46836, 49887, 19], [49887, 52826, 20], [52826, 55766, 21], [55766, 58414, 22], [58414, 61058, 23], [61058, 63828, 24], [63828, 66308, 25], [66308, 68387, 26], [68387, 70894, 27]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]