[{"id": "e618288bb22b68ecb032fdd71162252a156c3747", "text": "THE NORTHWEST REBELLION.\n\n1857\nLETTER FROM SIR D. L. MACPHERSON.\n\nCHESNUT PARK,\n\nTORONTO, 1ST JANUARY, 1887.\n\nDear Mr. White,—\nI am exceedingly obliged to you for an advance copy of a pamphlet on the Northwest rebellion.\n\nThe extracts given from documents of record in the Department of the Interior clearly prove that neither by acts of omission nor commission did the Government of Sir John Macdonald do ought to provoke just discontent, much less rebellion among the half-breeds.\n\nI need hardly say that during the time I was Minister or Acting-Minister of the Interior, no half-breed was disturbed or threatened with disturbance in the occupation of his land.\n\nThe story circulated by the Opposition that I had urged the Prince Albert Colonization Company to eject the half-breeds from the Company's allotment of land, is one of those slanders of which so many are fabricated by those writers for the Grit press who are well described by the Presbyterian Review as men who \"write lies to earn bread and butter.\"\n\nBelieve me,\n\nDear Mr. White,\n\nYours very truly,\n\nD. L. MACPHERSON.\n\nThe Honorable Thos. White,\nMinister of the Interior,\nOttawa.\nFACTS FOR THE PEOPLE.\n\nTHE NORTHWEST REBELLION.\n\nThe Question of the Half-breeds and the Government's treatment of them.\n\nIt is charged against the Government that it is responsible for the outbreak which recently occurred on the banks of South Saskatchewan, and for all the consequences of that outbreak. A few facts will show how unjust is this accusation.\n\nFIRST, AS TO MANITOBA.\n\nWhen the Government of Canada took possession of the Territories and organized the Province of Manitoba, provision was made for settling the claims of the half-breeds resident in the country. As a preliminary step, Governor Archibald was requested to make an enumeration of them. This he did, and upon his report, 1,400,000 acres of land were set aside by Act of Parliament to satisfy the claims. All this was done before the change of Government in 1873. If the policy had been carried out, the Manitoba claims would at once have been adjusted. Unfortunately, when Mr. Mackenzie took office, he re-opened the question, and appointed Mr. Matthew Ryan and Mr. Macar, of Kingston, to make a further enumeration. They found fewer half-breeds than had been reported by Governor Archibald, and a larger area was, therefore, given to each, out of the 1,400,000 acres. The consequence of this has been to greatly embarrass the settlement of the whole matter, as the results have shown that Governor Archibald's enumeration was rather under than over the mark, that of Mr. Mackenzie's commissioners being grossly inaccurate.\n\nIn 1876, treaties were made with various bands of Indians throughout the Northwest, by which their Indian title was extinguished, they receiving reserves of lands and certain other concessions in consideration of it. It would have been wise to have settled at the same time the whole Indian title in the Northwest, that of the half-breeds as well as of the Indians themselves. Instead of doing this, Mr. Mills, then Minister of the Interior, appointed Mr. Matthew Ryan, who had been named a Stipendiary Magistrate and a member of the North-west Council, to make an investigation of the half-breed claims. On the 3rd of March, 1877, Mr. Ryan addressed the following letter to the Agent of the Dominion Lands at Winnipeg:\n\n\"Swan River, 3rd March, 1877.\n\n\"Dear Sir,—In the matter of my continuing the half-breed lands investigation, as the only official communication I hold on the subject is a telegram authorizing me to take evidence of claimants who may come before me in the North-west Territory, would you kindly inform me, as soon as possible, whether it was the intention of the Department that I should put myself in communication with half-breed claimants by visiting the localities in which they reside, or that I should act in their behalf as they might casually come before me in the course of the discharge of my magisterial duties? If the latter were the intention, I fear that no early practical good can be effected. The greater number of the half-breeds of the different settlements...\"\ncan only be met at certain periods, before their departure to hunt, and after their return, and I am not aware at present at what period or periods I am likely to be engaged as a magistrate at these respective places. My apprehension is, that to trust to the coincidence of our thus meeting, would be to defer the investigations indefinitely, and ultimately to cause many of the half-breeds and others in the territory the loss of the benefits intended for them by law. Would it not be well, therefore, for me to make special endeavours in their behalf during the coming seasons of spring and autumn? I can conveniently go to Lac Qu'Appelle in May, where, as I am advised by Mr. MacLean, Agent of the Hudson Bay Company, and by the Catholic curé, the bulk of the half-breeds can be met between the middle of that month and the 10th or 15th of the next. And later I may be able to visit the Scotch settlement of Prince Albert, and the French of St. Laurent, and so on. I am not informed, either, as to the matter of expenses, but presume they are to be paid under authority of the Department of the Interior. Will you please instruct me on this head, and generally on the subject of this letter, at your earliest convenience, and believe me to be,\n\n\"Very truly yours,\"\n\n\"D. Codd, Esq., Winnipeg.\"\n\nThat was a most reasonable letter, and yet the suggestion was not only not acted upon, but the refusal to act upon it was couched in terms which may be taken as indicating the spirit in which all the Northwest matters were dealt with by Mr. Mills. On the margin of the letter, in Mr. Mill's own handwriting, appear these words:\n\n\"It is not necessary to look up parties who have claims. If they care for their interests, they will themselves come forward and establish their claims.—D. M.\"\n\nMr. Ryan, notwithstanding this refusal on the part of the Minister, to permit him to take reasonable measures to perform the duty with which he has been charged, went to Qu'Appelle. He sent in his bill for $75, and Mr. Mills was so indignant at his instructions being disregarded that he refused to pay it. That bill was paid by Sir John McDonald, when he came into office.\n\nNothing really was done until the 24th of June, when Mr. David Laird, Lieutenant-Governor of the North-west Territories, telegraphed as follows:\n\n\"Observe Mr. Ryan's authority to investigate Half-breed claims under Order 14th June, 1876. Lapsed. Recommend time be extended one year. He is now here. Applicants waiting. Answer.\"\n\nOn the 28th of June, Mr. Ryan himself telegraphed from Battleford:\n\n\"Half-breeds pressing me. Will time be extended?\"\n\nto which the following reply was sent:\n\n\"Minister has an object under consideration, and will probably authorize Mr. Duck, who has been appointed Dominion Lands Agent for Saskatchewan, to investigate such claims.\"\n\nThat was the last thing done by Mr. Mills. The view of the Department at the time, however, may be gathered from a memorandum by Mr. Dennis, then Surveyor-General and chief of the land branch of the department, in which he says:\n\n\"The question raised by His Honour the Lieutenant-Governor as to the manner in which the claims of settlers may be adjusted, who located upon the lands in the Northwest Territories previous to the transfer, involving as it does a question of policy, is for the Minister to consider. The undersigned would, however, in reference thereto, venture to express the opinion that land so settled on, without the same may possess exceptional value, owing to its situation, or had been taken up with a view to speculation, if the claimant shall have been constantly residing upon and cultivating it to a reasonable extent, should be granted free to the occupant. To give effect to such a policy, however, legislation would be required.\"\n\nIt will be seen from this, that the solution of this question in the opinion of the Department at that time was to be found in the granting to the Half-breeds of the lands upon which they were settled. It may be stated that they have never been deprived of those lands, and that this Government has given them free grants of the lands upon which they were settled to the extent of 160 acres; so that this policy, which was suggested by the Department as a settlement of the whole question in 1877, has been the invariable policy of the present administration.\n\nThe action of the Mackenzie administration in dealing with Half-breed claims may thus be summed up:\n\n1. They ignored the action of the previous government, looking to settlement of claims in Manitoba, by which they would have been settled ten years ago, and by the appointment of new commissioners, they postponed the settlement, and increased the opportunity for fraudulent claims being presented.\n\n2. They appointed Mr. Ryan to investigate claims, and then refused him the opportunity of visiting the districts where half-breeds had settled, thus rendering valueless his appointment.\n\n3. Two years after his appointment, nothing having been done in the meantime, they refused to extend his commission, stating that the matter was under the Minister's consideration, and that he would probably appoint Mr. Duck, the land agent at Prince Albert, to investigate the claims of those who might present themselves.\n\n4. The letter of the Surveyor-General\nshows that the thought of the Department was simply to settle claims of half-breeds by confirming them in their holdings, in which they have never been disturbed by the present Government.\n\nIt is stated that\n\nNUMEROUS PETITIONS,\n\nwere sent to the government, and that these were not favourably acted upon. It is quite true that petitions were sent, of various kinds. They were sent as far back as 1873. One of the most important, because the most elaborate, was sent on the 5th of April, 1875, by the Right Reverend Bishop Grandin, of St. Albert, and this petition may be taken as an illustration of the general claims made. What was asked by Bishop Grandin, as he himself summarizes the petition, was:\n\n1. —Some encouragement for the settlers.—On this point he stated:\n\n\"The Catholic missionaries have done almost impossible things in this direction. They have, at different places, three mills. For the third time we have tried to erect one in the colony of St. Albert—behold, more than £900 sterling which we have sacrificed for it, and we are still uncertain whether we shall succeed. That the Government may on their part design to do something to encourage agriculture.\"\n\n2. —Aid for a hospital—at least to construct it, and put it in condition to receive the sick.\"\n\n3. —Aid for schools.—The Government makes large outlay for education in all Canada; is our Northwest to be alone withheld assistance? It cannot be said that we require help less than other parts of the country.\n\n4. —Aid for orphan asylums, that we may increase their establishments so as to be able to take in a greater number of little savages.\n\n5. —Concessions of land for each orphan asylum or model farm.\n\n6. —Reserves of land for the children thus brought up; and aid to help them on to a little farm once they are married.\n\n7. —And lastly—that the reserves to be made over to the Indians be of arable land, and situated near fishing lakes.\"\n\nIn the answer from the Lieutenant-Governor, David Laird, written under the authority of the Superintendent-General, Mr. Mills, these requests are thus disposed of:\n\n\"As to the first, namely, the encouragement of agriculture among the settlers, the Superintendent-General cannot but congratulate your Lordship upon the efforts made by the mission, especially by the establishment of mills to enable the settlers to utilize the grain raised in your diocese.\n\nThe Superintendent wishes to remind you that this is a subject which will properly come within the province of the Local Government soon to be inaugurated in the Northwest. He thinks, however, that it is obvious that the measures now being taken by the Dominion Government to carry a railroad and telegraph line through the territories, must have the effect of opening up the country and of facilitating transport throughout it, and in this way cannot fail to give an impetus to the agricultural interest of the territory.\n\n\"The 2nd, 3rd and 4th heads referred to by you are all matters which come especially within the province of the Local Legislature.\n\n\"With regard to the third head, however, I may remark that the Dominion Lands Act makes provision by a liberal land grant to aid general educational purposes in the Territories, and so far as the Indians are concerned, the Dominion Government will, no doubt, be prepared when the territory is surrendered, to make the same provision there as elsewhere, by treaty for Indian schools. In the meantime, I am directed by the Minister to transmit to your Lordship an official cheque for the sum of $300, in aid of the school at St. Albert, authorized by Order in Council of the 22nd October, 1873, as it is assumed from your Lordship's report that the average attendance of Indian children at this school is not less than the number required by the Order in Council, namely, 25.\n\n\"Any one of the other schools which your Lordship may think proper to select, will be entitled to a similar amount for the current year, provided, of course, the average attendance of Indian children throughout the year is not less than 25.\n\n\"As the fifth head, namely, concessions of land for orphan asylums and model farms, the Superintendent-General is not prepared at present to make any definite promise on behalf of the Government. On this point the Superintendent-General will be able to speak more definitely after a treaty has been made, and when the question of the extent of land asked for, for the purposes above-mentioned, is more accurately known.\n\n\"The sixth head refers to a large question of public policy, on which it would manifestly be premature at present to pronounce an opinion. The settlers in the North-west have good grounds for believing that the Dominion Government will deal liberally with them. There is a sufficiency of land in the Territories for all of them and their children, and it is earnestly to be hoped that they will cultivate as much of it as possible, and secure to themselves comfortable homes in the country to which they belong.\n\nAs regards the seventh head, namely, the reserve for the Indians: this matter has hitherto been fully provided for in all treaties made with the Indians, by which assistance in money and agricultural implements has always been secured to them, and there can be no doubt that these matters will be dealt with in a similar spirit of liberality in future treaties.\n\n\"The reservations secured to the Indians will no doubt have a fair proportion of arable land, and will include, when it is practicable, any fishing lakes which the Indians may desire to avail themselves of.\"\n\nThis petition and the reply to it, are quoted for this purpose: the subjects referred to by Bishop Grandin were, as to many of them, embodied in subsequent petitions, and it is important, therefore, to point out that when presented thus in detail to Mr. Mills, the Minister of the Interior of Mr. Mackenzie's Government, they were met with a blank refusal.\n\nIndeed, it may be worth while to cite one other in proof of this.—It was a petition of certain half-breeds, transmitted to Ottawa by Governor Laird, on the 13th February, 1878. The petition had refer-\nence to matters of public policy, one of its prayers being for seeds and implements to enable the people to commence farming operations. In reply to this, in a letter signed by himself, and dated 18th March, 1878, Mr. Mills said:\n\n\"The application of the petitioners to be aided by the Government with seeds and agricultural implements in their farming operations, I confess I am not disposed to view favourably. I do not see upon what ground the half-breeds can claim to be treated in this particular differently from the white settler in the Territories.\n\nThe half-breeds who have, in some respects, the advantage over new settlers in the Territories, should be impressed with the necessity of settling down in fixed localities, and directing their energies towards pastoral or agricultural pursuits, in which case lands would, no doubt, be assigned to them, in the same way as to white settlers. But beyond this, they must not look to the Government for any special assistance in their farming operations.\n\nSome of the other petitions referred to the position of settlers in advance of survey. We take, for instance, one from Gabriel Dumont and 45 others, addressed to the Minister of the Interior on the 4th of September, 1882. In this petition, after referring to the fact that the half-breeds had been compelled to abandon the chase, the petitioners go on to say:\n\n'The surveyed lands being already occupied or sold, we were compelled to occupy lands not yet surveyed, being ignorant, for the most part, also, of the regulations of the Government respecting Dominion lands. Great, then, was our astonishment and perplexity when we were notified that when the lands are surveyed we shall be obliged to pay $2 an acre to the Government, if our lands are included in odd-numbered sections. We desire, moreover, to keep close together, in order more easily to secure a school and a church. We are a poor people, and cannot pay for our land without utter ruin, and losing the fruits of our labour, and seeing our lands pass into the hands of strangers, who will go to the Land Office at Prince Albert, and pay the amount fixed by the Government. In our anxiety, we appeal to your sense of justice as Minister of the Interior and head of the Government, and beg you to re-assure us speedily, by directing that we shall not be dispossessed on our lands, and that the Government grant us the privilege of considering us as occupants of even-numbered sections, since we have occupied these lands in good faith. Having so long held this country as its masters, and so often defended it against the Indians at the price of our blood, we consider it not asking too much to request that the Government allow us to occupy our lands in peace, and that exception be made to its regulations, by making to the half-breeds of the Northwest free grants of land.\"\n\nNow, this request had already been complied with. In so far as the price was concerned, it was fixed by the reply to certain resolutions passed at a largely attended meeting held at Prince Albert on the 8th of October, 1881. The second of these resolutions was as follows:\n\n\"Whereas the price of land for pre-emption and purchase was largely increased in May, 1881, and many persons had settled in the District of Lorne, in the Northwest Territories, previous to that date, resolved, that the Right Honourable the Minister of the Interior be requested to grant to such settlers their land at a price in accordance with the Order-in-Council existing at the time of settlement.\"\n\nIn a letter sent by Mr. Lindsay Russell, Acting Deputy of the Minister of the Interior, and dated at Ottawa the 22nd of November, 1881, this resolution was made to the resolution:\n\n\"Resolution No. 2—The request in this resolution will be granted, so far as concerns quarter sections which have been actually settled upon and improved, on evidence being furnished of the nature of such settlement and extent of improvement, satisfactory to the Minister, being required in each case, and the privilege being granted or withheld as the facts may warrant.\"\n\nThat is, where persons had settled in advance of survey, they were entitled to get their land at the price at which it was at the time of settlement, if that settlement had been bona fide. As to their right to a free homestead, if on an odd-section, as Gabriel Dumont and his fellow petitioners had declared many of them had settled, the following paragraph from a letter of Mr. Burgess, the Secretary of the Department, of the 16th of June, 1882, and addressed to His Honor Lieutenant-Governor Dewdney, will show that the request had been favourably entertained three months before the date of Gabriel Dumont's petition:\n\n\"Squatters who went into occupation of unsurveyed lands previous to May 1880 and the Act 43 Victoria, chapter 26, came into force, will get their homesteads, provided they can show they have been continuously in occupation and cultivating the same up to the time of survey.\"\n\nSo that it will be seen that this petition, which embodied the same prayer as a number of others, had met with a favourable response from the Department, the request not only being granted in the case of the particular petitioners, but the policy involved in it being made the general policy of the Government. As a matter of fact, it may be mentioned that no half-breed has ever been dispossessed of the land upon which he had settled, or to which he had, by virtue of settlement, a claim.\n\nAnother question raised in this petition was as to the right of\n\nPERSONS TO GET PATENTS\n\nwithout performing their full settlement duties after the date of entry. Under the\nrulings of the Department as they originally stood, no patent could be issued unless the settlement duties were performed after entry; but in order to meet the case of those going in before survey, this was changed, and an Order-in-Council, dated the 19th of October, 1882, states:\n\n\"The Minister recommends, under the 125th section of the Dominion Lands Act, that he be authorized, when finally acceding homestead entry in such cases, to ante-date the entry in such manner as to cover the time after application, and before giving the entry, during which the applicant may have been a bona fide settler on the land.\"\n\nSince that time, the commencement of the performance of the settlement duties has always been dated from the time of settlement upon the land, whether formal entry had been made in the Land Office or not.\n\nThere remain really in these petitions but two questions, in relation to which there has been some discussion, and in connection with which the Government is charged with having been remiss in its duty. The first is that the people had asked for and had been refused\n\nSURVEYS ON THE RIVER LOT PRINCIPLE, as distinguished from the rectangular system; and next, that they were entitled to scrip in extinguishment of their Indian title in the same way as the Half-breeds of Manitoba had received it. As to the first, the policy of the Government was as follows:—Where settlers were found along the banks of the rivers, in advance of survey, the instructions to the surveyors were to survey on the river lot principle, so as to preserve to each settler his improvements, if he had any. Where, on the other hand, there were no settlers, the ordinary principle of survey obtaining all through the Territories and authorized by the Act of 1871, was adopted. On the 16th of January, 1883, the Reverend Father André sent in a petition, complaining that these instructions were not being carried out, and as indicating the view of the Minister of that day, the following may be published:\n\n\"Ottawa, 23rd April, 1883.\n\n\"Dear Mr. Russell.—I enclose a communication from Father André, Superior of St. Lawrence, N.W.T., upon the question of surveys.\n\n\"How is it these difficulties recur so often, when it is the rule of the Department to survey around the old surveys, without disturbing the occupants? Were the surveyors properly instructed?\n\n\"Yours very truly,\n\n\"D. L. MacPherson,\n\n\"Lindsay Russell, Esq.\"\n\nIt should be stated, however, that the land referred to in this case had all been surveyed on the rectangular system before the complaint of Father André was made, and at a time when, as is shown by the surveyor's plans, there were but two settlers between the St. Laurent settlement and the Indian Reserve, on the south-east side of the river. What was asked, therefore, was that land already surveyed in advance of settlement, should be resurveyed on a different plan, because settlers going upon them, after survey, preferred that different plan. The unreasonableness of this demand is too apparent to require argument to point it out.\n\nThis matter was the subject of further correspondence, among other letters there being one from the Reverend Mr. Vegreville asking for the river lot surveys. This letter was referred to Mr. Deville, the Chief Inspector of Surveys, who, in a report by him on the 14th of February, 1884, made the following suggestions:\n\n\"The wishes of the settlers could easily be met, without inconvenience or prejudice to the Government, by adopting the following course:\n\n\"1st. If the Inspector of Agencies, when on the ground, should be satisfied that the great majority of settlers in a township desire river lots, then he should have power to direct that every homestead fronting on the river in that township shall be composed of four quarter-quarter sections, forming a lot of twenty chains in width by one mile in depth.\n\n\"2nd. Except when all the occupants of a section prefer having it allotted into quarter sections, in which case their request should be complied with.\n\n\"3rd. Except when all the occupants of two sections desire that the lots shall be ten chains in width, and should extend two miles to the depth of two sections, in which case their request should also be complied with.\n\n\"A lot twenty chains wide by one mile deep would be described in the patent as composed of four quarter-quarter sections.\n\n\"A lot ten chains wide by two miles deep would be described as the western, eastern, northern or southern halves of eight quarter-quarter sections.\n\n\"The areas could easily be found by reference to this office.\"\n\nThis letter of Mr. Deville's was acknowledged in one from the Secretary of the Department, on the 20th of March, 1884, stating the approval of the Minister of the suggestions, and informing Mr. Deville that the Inspector of Dominion Lands Agencies had been instructed in accordance with them. This, as will be seen, was more than a year before the rebellion broke out, and some months before Louis Riel came into the country. As showing to what an extent this system of river lot surveys had been carried out, the following letter from Mr. Deville may be given:\n\"Technical Branch, Ottawa,\n28th Nov., 1883.\n\n\"Sir:—In reply to your letter of the 23rd inst.,\nin which you ask the names of the rivers in the\nNorthwest Territory, the frontages of which have\nbeen surveyed into river lots, I beg to state that\nthe standing instructions are to lay out river lots\nalong the Saskatchewan, Battle, Bow, Red Deer\nand Belly rivers.\n\n\"Special instructions have also been given to lay\nout river lots along the shores of Lake Winnipeg\nand of the islands in it, and also in three townships\nfronting on Old Man's River.\n\n\"I have the honor to be, sir, your obedient servant,\n\nE. DAVIES, Chief Inspector of Surveys.\n\n\"J. R. Hall, Esq., Sec'y Dept' of the Interior.\"\n\nIn a word, the policy of the Government\nwas, where settlers were upon lands in ad-\nvance of survey, to survey the land in ac-\ncordance with their wishes. Where, on\nother hand, the surveys were commenced\nbefore there were any settlers on the\nland, the surveys were conducted on the\nrectangular principle, as in all other parts\nof the Territories, but even in such cases,\ninstructions were issued to give to the\nsettlers, if they so desired it, on entering\nfor lands, their entries by legal subdivi-\nsions instead of by quarter sections, which\npractically gave them the river lot system.\nIt should, however, be stated that this\nmatter of surveys cannot in any way be\ncalled a claim or right. The law fixed\nthe system of surveys for the Northwest,\nand no one could be justified in rebelling\nagainst the Government because it refused,\nhad it, indeed, refused, to depart from that\nsystem to meet the wishes of individuals\nor communities. The granting of a dif-\nferent system was purely a matter of grace\non the part of the Government, dictated\nby a wise policy, and it was carried out in\nthe interests of the Half-breeds.\n\nThere remains, therefore, now only.\n\nTHE QUESTION OF THE INDIAN TITLE.\n\nThe Government has been blamed for\nnot having granted to the Half-breeds of\nthe Territories the same treatment as was\nextended to those in Manitoba, and refer-\nence has been made to the petitions and\nsuggestions sent to the Government, espe-\ncially those of Archbishop Taché, of the\nBishops of Rupert's Land and of Saskatche-\nwan, and of the Northwest Council. As a\nmatter of fact, unless in the case of the lat-\nter, in their second report to the Govern-\nment, in 1883, no one of the authorities\nagreed in the view that the Half-breeds\nshould be dealt with in the same way as\nthose in Manitoba had been dealt with,\nand even the suggestions of the North-\n\nWest Council of 1883, which was to the\neffect \"that those Half-breeds in the Terri-\ntories who have not participated in the\narrangement to extinguish the Half-\nbreed claim, in Manitoba, and who\nenjoy the same right as accorded to the\nHalf-breeds in that Province,\" must be\nread in the light of the more elaborate\nrecommendations of the same body a cou-\nple of years before. Let us look at these\nrecommendations. That of Archbishop\nTaché was embodied in the memorandum\nof the 29th of January, 1879, and was as\nfollows:\n\n\"(a.) I esteem the Half-breed population actually\nin the Northwest to number about twelve hun-\ndred families. LET THE GOVERNMENT MAKE TWELVE\nRESERVES FOR THEM, in the very places the Half-\nbreeds themselves will like to have them.\n\n\"(b.) Such reserve should be for one hundred\nfamilies at least, and contain an area of twelve\nsquare miles of available land—that is to say, the\nextent of four townships.\n\n\"(c.) All the Half-breeds, men, women and chil-\ndren, residing in the Northwest on the 1st of Jan-\nuary 1879, ought to receive two non negotiable scrips\nfor eighty acres of land each, to be located by them\nin any one of the twelve above-mentioned reserves\n\n\"(d.) Said lands COULD NEITHER BE SOLD, MORT-\nGAGED NOR TAXED BEFORE THEY SHOULD HAVE PASSED\nTHROUGH THE HANDS OF AT LEAST THE THIRD GENERA-\nTION OF THOSE WHO RECEIVE THEM, OR OF THEIR\nREPRESENTATIVES.\"\n\nHis Grace elaborated considerably these\nrecommendations, suggesting the manner\nin which the reserves should be laid out\nand utilized. He also recommended that\naid in farm implements and seed grain\nshould be granted, and that schools should\nbe established on every reserve, but both\nthese points, as has been shown, had\nalready been dealt with by Mr. Mills.\nThe Protestant Bishop of Saskatchewan, in\nhis letter to Mr. Dennis, also opposed the\nadoption of the Manitoba plan. He said:\n\n\"The result of the plan pursued in Manitoba,\nof giving land to the parents and children\nrespectively, has not been such as to justify a\nrepetition of it in the North-west Territories.\nThis, I think, is generally admitted, and therefore\nneeds no argument.\"\n\nAs to the suggestion that scrip should be\nissued, he says:\n\n\"The second alternative, that of giving an abso-\nlute issue of scrip to each individual, and then leav-\ning him to his fate, would, I feel sure, end in disas-\ntrous failure as regards the end that the Govern-\nment would have in视. The only class of persons\nlikely to be benefited by the course would be the\ntraders'and land speculators, who would soon obtain\nthe scrip of the inexperienced Half-breed at a low\nor merely nominal price, and thus leave him poorer\nas he was before, but probably not so well affected to\nthe Government, and therefore more likely to be\ndangerous in relation to the Indians.\"\nThe Bishop then points out that the true plan is \"to give the Half-breeds inducements to settle on lands, and practical help in doing so,\" and he proceeds to say, referring to Mr. Dennis' memorandum, to which his letter was a reply:\n\n\"I am glad to see that it is the one that is recommended by yourself. Coming now to the details of what the practical measure of help should be, I notice that the North-west Council recommend two things: (a) a grant of non-negotiable scrip to each Half-breed, under certain conditions; (b) a certain amount of help, in the shape of implements and seed grain. You appear to think their proposal good, as far as it goes, but you are of opinion that something more is required. You suggest (1) that the Half-breeds should be settled in bands; (2) that schools and teachers should be provided, with the view of training them in farming, stock-raising and the mechanical trades, as well as the ordinary branches of knowledge suitable to their condition in life. In these recommendations you have my hearty concurrence.\"\n\nThe Protestant Bishop of Rupert's Land, in replying to Col. Dennis, expresses his fear that his knowledge of the Half-breeds is too limited to give much value to anything he may say, and then he goes on to point out:\n\n\"I suspect the great difficulty will be actually to bend their minds to the taking of farming as their life work. They will be inclined always to choose a location rather for its opportunities for hunting and fishing than for good soil or farming capabilities. They need then, above all, at the Fort, a wise and trusted adviser to guide them right in their choice of settlement. Still I should be adverse to any setting apart of reserves for them, either on their own account or that of the Government. I think they are as entitled to a free choice of the whole land as any other settlers, but not to the tying up of choice land to suit their whim.\"\n\nThe recommendation of the Northwest Council, of which so much has been said, was embodied in resolutions passed on the 2nd of August, 1878. The resolutions were passed in answer to a petition sent by 278 petitioners, asking that a section of land be set apart \"for a special reserve, perpetual and inalienable, upon which they would settle themselves in a permanent manner and fix their families, to the exclusion of all whites, except such employees as the Government shall find proper to send there, according to the needs of the population.\" The extent of this reserve was to be 150 miles by 50 miles along the International boundary line, about west of the point crossed by the Pembina River. They also asked that this reserve might be given to them in such a way that they could live there free of taxes, whether forever or for a sufficient term of years that they might be able to pay at the end without detriment to their families. They asked secondly that they should be allowed school-houses, school masters and school mistresses, whose expenses were to be defrayed by the Government, also churches and priests of their religion, and, in addition to this, that they should be allowed mechanics, to whom they could apply in time of need, and by whom they might be taught the various necessary arts of civilized life, as blacksmiths, a carpenter, a shoemaker, etc. The recommendation of the Council in reference to this petition was as follows:\n\n\"1. That it would be judicious to set apart reserves of land for the Half-breeds of the North-West Territories, or give them negotiable scrip.\n\n\"2. That in view, however, of the fact that the grants of land or issues of scrip were made to the Half-breeds of Manitoba towards the extinguishment of the Indian title to the lands of that Province, there will undoubtedly be general dissatisfaction among the Half-breeds of the said Territories unless they receive some like consideration.\n\n\"3. That this consideration would most tend to the advantage of the Half-breeds were it given in the form of a non-transferable location ticket for, say, one hundred and sixty acres to each Half-breed head of a family and each Half-breed child of parents resident in the said Territories at the time of the transfer thereof to Canada, the ticket to be issued immediately to any Half-breed eighteen years of age or over, on furnishing evidence of claim, and to every child on arriving at that age, and furnishing the necessary evidence.\n\n\"4. That each Half-breed holding such a location ticket should be allowed to locate it upon any unoccupied Dominion lands, but the title of the land so entered should remain in the Crown for ten years; and if, at the expiration of three years after such entry, the Half-breed locates have made no improvement on the land, his claim thereto shall be subject to forfeiture.\n\n\"5. To induce those Half-breeds, who now procure their livelihood by hunting on the plains, to abandon their present mode of life and settle on their locations, by which course it alone appears possible to arrest the great destitution with which they are threatened, owing to the imminent early extinction of the buffalo: that aid in agricultural implements and seeds be allowed them for three years, but only once for each family that may settle within that time.\n\n\"6. That Half-breeds who have shared in the Manitoba distribution of lands and scrip should not be entitled to receive location tickets in the Territories, though now resident therein.\"\n\nIt will thus be seen that of all these authorities, not one recommended the granting of scrip to the Half-breeds in the same way as had been done in Manitoba. The Archbishop's proposal for a reserve was condemned by the other authorities mentioned, and all the recommendations assumed the character of wardship for these Half-breeds that the Government could hardly have accepted. This conflict of recommendation was really what caused the delay. Notwithstanding this, how-\never, the Government was not remiss in its duty. By an Order in Council dated the 7th of June, 1883, Mr. Lindsay Russell, then Deputy Minister of the Interior, was appointed to make a thorough enquiry into all matters affecting settlement in the Northwest, and to finally settle, on the spot, all unsettled claims of any kind in that region, in which, of course, the claims of the Half-breeds were included. Mr. Russell was exceptionally well qualified for a duty of that kind, being thoroughly familiar with the country, with many of the Half-breeds personally, and understanding and speaking the French and Cree languages. Unfortunately, before he could start on his mission, he met with an accident, breaking his leg, which laid him up for many months, and, as a matter of fact, he has never since been able to resume official duties. The Government, despairing of being able to meet the conflicting views of those who were urging the claims of the Half-breeds, resolved at last to treat them as the Half-breeds of Manitoba had been treated, and on the 28th of January, 1885, an Order-in-Council was passed, appointing commissioners to make the necessary enumeration, with a view to the granting of land or scrip. The following is a copy of this Order-in-Council:\n\n\"Certified copy of a Report of a Committee of the Honorable the Privy Council, approved by His Excellency the Governor-General in Council on the 28th January, 1885\n\n\"On a memorandum, dated 29th January, 1885, from the Minister of the Interior, submitting that it is desirable, with a view of settling equitably the claims of Half-breeds in Manitoba and the North-West Territories who would have been entitled to land had they resided in Manitoba at the time of the transfer and filed their claims in due course under the Manitoba Act, and also of those who, though residing in Manitoba and equitably entitled to participate in the grant, did not do so, to ascertain the number of such Half-breeds, and recommending that he be authorised to obtain an enumeration of them, and to employ three persons to make such enumeration.\n\n\"The Committee concur in the foregoing recommendation, and they advise that the requisite authority be granted.\"\n\nJOHN J. McGEE,\n\"Clerk Privy Council.\n\nInformation was at once sent of the appointment of this commission, and Father André, in his evidence at the Regina trial, stated under oath that that information had been communicated to the people on the 4th of March, more than a fortnight before the fight at Duck Lake. Here is the evidence on that point:\n\n\"Q.—Will you state if, since the arrival of the prisoner in the country, up to the time of the rebellion, the Government have made any favourable answer to the demands and claims of the Half-breeds?\" A.—Yes. I know they have acceded to certain demands in regard to those who did not have any scrip in Manitoba. A telegram was sent on the 4th of March last, granting the scrip.\n\n\"Q.—Before that time?\" A.—Yes, regarding the alteration of survey of lots along the river, there was an answer from the Government saying they would grant it, and that was an important question.\n\n\"Q.—What question then remained to be settled?\" A.—The question of patents; that has also been settled in a certain way, because Mr. Duck was sent and I went with him as interpreter.\n\n\"Q.—What other question remained?\" A.—Only the question of wood, and timber.\n\nThe question of wood and timber referred to the ordinary regulations, applicable to all settlers, by which they were required to pay dues upon wood obtained by them on government lands, over what they required for their own use, and for purposes of trade. In the case of these Half-breeds the amount collected for dues on wood and timber did not exceed an average of five cents for each settler per annum! Then Charles Nolin, in his evidence at the trial, after reciting the claims made by Riel for a money grant for himself from the Canadian Government, thus referred to the action of the Government, the Mr. Macdowall referred to being the representative of the Saskatchewan district in the Northwest Council:\n\n\"The next day I received an answer to a telegram from Macdowall; the telegram said that the Government was going to grant the rights of the Half-breeds, but there was nothing said about Riel's claim.\n\n\"Q.—Did you show the answer to Riel?\" A.—I showed the reply I received next Sunday.\n\n\"Q.—That was in the month of?\" A.—February.\n\n\"Q.—In the beginning of the month?\" A.—Yes.\n\n\"Q.—What did the prisoner say?\" A.—He answered that it was 400 years that the English had been robbing and that it was time to put a stop to it; that it had been going on long enough.\n\n\"Q.—In the beginning of March was there a meeting at the Halcro settlement?\" A.—Yes.\n\n\"Q.—Were you present when that meeting was organized by him?\" A.—The meeting was not exactly organized by the prisoner; it was organized by me, but the prisoner took advantage of the meeting to do what he did. The object of the meeting was to inform the people of the answer the Government had given to the petition they had sent in.\n\nIt will thus be seen that it is entirely wrong to say, as has been so frequently said upon the platform and in the press, that the Government did nothing until the rebellion had broken out and lives had been lost.\nReferring to\n\nTHIS MATTER OF SCRIP,\n\nit is worth while pointing out that the rebellion broke out and, so far as the half-breeds were concerned, was confined to the neighbourhood of St. Laurent and Batoche, on the south Saskatchewan. As a matter of fact, 92 per cent of the half-breeds in that district had already had their Indian title extinguished in Manitoba, and had therefore no claim whatever to consideration in respect of that title. But three petitions came to the Government from that particular neighbourhood. Of these, one was sent by Gabriel Dumont and 45 others; 36 of the signers had obtained their scrip in Manitoba, and had no claim to scrip in the territories. Another was from settlers in the parish of St. Louis de Langevin, and was signed by 32, of whom 24 had obtained their scrip in Manitoba. The other was from the parish of St. Laurent, signed by 78, of whom 60 had obtained their scrip in Manitoba. It will thus be seen that where the rebellion broke out there was no reasonable claim for scrip.\n\nTHE COLONIZATION COMPANIES.\n\nIt has been charged that the Government precipitated the outbreak by granting the lands of the settlers in the parish of St. Louis de Langevin, on the south of Saskatchewan river, to the Prince Albert Colonization Company. It is quite true that the Prince Albert Colonization Company asked for these lands in exchange for some which they already had, and that the Government consented to the exchange, but in the agreement with the Government was the following clause, which amply protected the settlers from being disturbed:\n\n\"Should any portion or portions of the lands forming the subject of this agreement be now occupied by any person or persons who may have settled thereon, such persons and those claiming through them shall not be disturbed in their possession by the company, unless with the consent in writing of the Minister of the Interior; and the Minister of the Interior may, if he think it expedient so to do, from time to time, give the company written notice that the lands in possession of such persons respectively, and such adjoining lands as he may think proper (but not exceeding in the whole 320 acres for each separate settler) are withdrawn from the operation of these presents, and thereupon such lands shall become withdrawn, and this agreement shall thereupon cease and determine with respect thereto.\"\n\nThe Company, however, never accepted the change, and the land never went into the possession of the company, nor was a single settler disturbed in his holding by the company. As a matter of fact, the settlers did not know of the correspondence which had been going on between the Prince Albert Colonization Company and the Government, looking to the exchange of a portion of the tract, as is shown by the affidavits of all the settlers. These affidavits have been submitted to parliament. It is only necessary here to give short extracts from them. William Bremner swears:\n\n\"That I never was told, nor do I believe my sons or son-in-law were, or I should have heard of it, that we could not obtain entry for the land as we desired it. Riel once told me possibly we would not obtain it. Had we believed him we would then have abandoned it, and not continued to make further improvements as we have done.\"\n\nMagloire Boyer swears:\n\n\"That I most emphatically state I never was told by anyone that entry could not be obtained by settlers in this township, or that the Government had sold the land to any corporation.\"\n\nJonas Laviolette swears:\n\n\"I never heard the Government had sold or given this land, or any land in this township, to any person or corporation. Never heard that any of the settlers in this vicinity had been told by anyone that they would not obtain their claims, and believed that, eventually, entry would be granted in 10 chain claims, fronting on the river.\"\n\nElzevir Swain swears:\n\n\"Never applied for entry, nor was I told the land belonged to anyone except the Government. Never was told my claim had been sold by the Government to anyone, or corporation, or colonization company.\"\n\nElizabeth Richard swears:\n\n\"Never applied at the land office for entry, always thought we would obtain it as desired, but did not expect to obtain entry till we asked for it. Always supposed that the Government would give it us when we applied for it.\"\n\nWilliam Bruce swears:\n\n\"Never was told, nor did I ever hear, that the Government had granted this land to anyone, or corporation, nor did I ever believe we would not obtain entry.\"\n\nJ. Baptiste Boyer swears:\n\n\"Have lived in township 45 since 1883, and know thereof. I state, and I most emphatically state I never was told by anyone that entry could not be obtained by the settlers in townships 45-27 W 2, for the lands claimed by them.\"\n\nAlexander Bremner swears:\n\n\"For my part I always believed that I would have to treat with the Government and no one else, and I believe all the other settlers thought likewise, the only delay we anticipated being in obtaining entry as we desired, in 10 chains, not in quarter sections as surveyed before I took it up.\"\nAlade Légaré swears:\n\n\"Never was told that the Government had granted any portion of township 45-27 W. 2nd meridian to any person or corporation; and that entry therefore could not be obtained; nor did I ever hear anyone state he or she had been told the same, or anything to that effect, and always thought entry would be granted in 10-chain claims.\"\n\nModeste Laviolette swears:\n\n\"Never was told I could not obtain entry for this. Other people wishing to have their claims in 10-chain lots, concluded I would also have one. Never was told the Government had sold or granted this land to any individual, corporation or colonization company, and always thought that eventually entry would be given as the other settlers in this township desired. Never was told by Riel that I would not obtain entry for this land as claimed.\"\n\nMarguerite Boyer swears:\n\n\"Never was told by anyone that my husband would not obtain entry, or since his death myself. I always supposed we would get this land in 10 chains fronting on the river. If my husband or myself imagined we would lose the land, we would have abandoned it long ago, and not gone on to make improvements.\"\n\nAlexander Lamirande swears:\n\n\"Never was told by anyone that this land had been sold or granted in any way by the Government to any corporation, individual or colonization company. Never was told by Riel that entry could not be obtained for this land or any of it, in township 45, range 27, West 2nd meridian, nor did I hear any of the settlers in said township state they could not obtain entry for these lands.\"\n\nAlex. McDougall swears:\n\n\"That I never was informed that any portion of this township belonged to a colonization company, and have not been to this day notified to that effect.\"\n\nPaul Grezaud, trader, and late a Brother, swears:\n\n\"These people, among whom I am living, are all Half-breeds. I have not heard them complaining of any one injuring or molesting them in any way, or depriving any of them of their property, before the rebellion. I have lived here for many years, know all the settlers; and have never known or heard of the Government or any speculators giving them notice or taking their lands from them; never heard of any such thing.\"\n\nA correspondent of the Toronto Globe made the statement that these affidavits had been obtained by threats, and that the people did not understand them. Mr. Duck, who accompanied Mr. Pearce when the affidavits were obtained, makes the following sworn statement on that point:\n\n\"That I also read over the affidavits of the several Bouchers, Swains, Fiddlers and others relating to the same matter, that I was personally present at the execution of the several affidavits made by them, that I read personally each and every one of them, that the said affidavits were carefully read over to them and explained to them in the language with which they were most familiar, that they fully understood the same in every particular, and that they executed such affidavits without inducement of any description whatever, but freely and voluntarily, and without coercion or fear of coercion, on the part of any person whatever.\"\n\nAnd Mr. Marion, a half-breed, also puts in the following affidavit:\n\n\"I, Louis Marion, farmer, of the settlement of Duck Lake, in the electoral division of Lorne, Prince Albert, Saskatchewan, do solemnly declare:\n\nThat I am a French Half-breed, and have resided continuously at Duck Lake since 1879. That I can speak and understand thoroughly the English, French, Cree and Saulteaux languages. That last December, I accompanied Mr. William Pearce on his visit to the French settlements at Batoche and St. Louis de Langevin and their vicinity, and, acting as interpreter, explained thoroughly to the settlers, in every case, the meaning of all papers they signed for him, and that they understood the meaning of all affidavits they signed for him. That frequently I explained matters to the French half-breeds in both the Cree and French languages, and asked them whether they were sure they thoroughly understood the papers they signed, and that this was done before their signatures were appended, and also that they declared before signing any of the affidavits that they were satisfied and willing to sign the affidavits. They have never heard any of these settlers complain of being disturbed in their holdings either by the Government or by any person authorized by the Government, or by any other person whatever.\n\nThese show clearly that the people who made these declarations perfectly understood what they were doing, and made them without the slightest inducement or threat being offered.\n\nTHE QUESTION OF PATENTS.\n\nIt has been charged against the Government in some quarters that the Half-breeds were unable to obtain their patents. Upon this point, a letter from Mr. Duck, which was submitted to Parliament last session, is a sufficient answer. That letter was addressed to Mr. Pearce, a member of the Land Board, and the following are extracts from it:\n\n\"Upon receiving your instructions in March, 1884, to investigate these claims, I consulted with the Reverend Père André, the superior of the district, as to the best time to carry out the investigation and obtain the information desired. He told me that as many of the claimants were then away from home engaged in farming, I'd better postpone my visit until after Easter, when they would all be at home putting in their crops. I did so, and left here for Batoche early in May. On my way up, I called in at Grandin, where I met Père André, who told me that he had been waiting for me to tell me that the people had been holding a series of meetings throughout the settlement, and they had decided among other things that they would make no applications for entry for their lands in the office here. After consultation with him I thought it advisable to secure his services to explain fully and clearly the nature of my mission, and to show to the people the futility of any such resolution on their part. He went with me to Batoche, and at an interview held in...\"\nthe house of Emmanuel Champagne explained fully my object and advised them to file affidavits in support of their claims.\"\n\n\"It was reported to me as long ago as 1882 that these people, even those who had settled and claimed their lands in accordance with the existing survey, had been advised by certain interested parties not to make entry for their lands, for what reason I am unaware, unless to coerce the Government into another system of survey on the banks of the river. From the schedule prepared, you will see how few were then settlers, on the river, some 45 in all, of whom 25 could have obtained entry if they so desired at that time.\"\n\n\"In accordance with your instructions to Mr. Gauvreau, the assistant agent here, in August, 1883, that gentleman visited the different parts of the districts in lists numbers 1, 2 and 3, and explained to them fully the Lands Act as bearing upon their claims. Upon his return he informed me that the chief reply that he had received from the people he visited was that they were poor, and had not the money to make entry. There were no other complaints of any nature.\"\n\nIt will thus be seen that so far from the Government having impeded the issue of patents, they took every means to induce settlers to make the entry, which is a condition precedent to the granting of a patent. In fact, the whole history shows that the Government, in relation to these Half-breeds, who, after all, were settlers from Manitoba, and who, as such, according to Mr. David Mills' contention, were entitled to no more consideration than other settlers, received far greater consideration, and that every effort was made to assist them in the work of settlement.\n\nIt should be borne in mind, that Louis Riel did not induce the Half-breeds to rebel because of any of the claims which were embodied in their petitions, and which are made the subject now of public discussion. After his arrival in the country he set up much larger pretensions. No resolution or document of any kind was sent by the Half-breeds to the Government after Louis Riel's arrival. All that was received was a draft of a petition, which Mr. Jackson, Riel's secretary, sent down, stating that it was about to be signed by the Half-breeds, and that as soon as it was signed it would be sent to the Secretary of State. This draft petition, however, with the single exception of the reference to the children of the Half-breeds being entitled to 240 acres of land, as were those of Manitoba, dealt entirely with questions of public policy. For instance, it referred to the price of pre-emptions; to the method of dealing with cancelled homesteads; to the policy of charging dues on timber, rails and firewood; to the Customs' duties levied under the National Policy; to the question of breaking and cropping being allowed on the pre-emption in lieu of the homestead; to the propriety of allowing purchasers of claims of squatters to be credited with the time spent by the squatters on the land; to the method of letting contracts for public works and supplies in the Northwest; to the proper sites upon which public buildings should be erected; to the importance of the Hudson's Bay Railway; to the absence of the system of vote by ballot; to the permit system in connection with intoxicating liquors; to the action of the Government in 1870 in respect to the delegates who went down from Manitoba; to the necessity for responsible Government in the Territories, as well as representation in the Parliament of Canada; and a number of other subjects which certainly cannot be regarded as in any sense constituting claims or rights, but are mere questions of public policy. It is a significant fact that the question of surveys, about which so much has been said, was not even referred to in this draft petition. Outside of this draft petition, no document of any kind ever came to the Government, and the petition itself, of which this was a draft, was never sent down, if indeed it was ever signed. Louis Riel evidently learned that he must adopt other means to provoke disturbance. He accordingly, recognizing the superstitious character of the people, started a new religion. Bishop Grandin, in a sermon delivered by him in the parish church of St. Rochs, Quebec, last summer, thus stated the action of the leaders of the revolt:\n\n\"The leaders of the revolt, in order to arrive more surely at their end, and to prevent the Half-breeds being influenced by the missionaries and diverted from their sinister design, imprisoned four priests, six religiousmen, and some lay brothers, and placed sentinels at the door of their prison to prevent communication between the Half-breeds and the missionaries. We had good reason to tell them: 'You will gain nothing by this; on the contrary, you have everything to lose. If you kill one soldier, he will be replaced by a hundred others. You have to fight against a powerful Government, while you are only a handful of men, and you cannot replace your dead.' But the leaders acted in such a way that our counsels were despised, and the rebellion took place, with all its terrible consequences.\"\n\nThe following statement, signed by all the priests in the district, is also evidence of the manner in which Riel found it necessary to secure the following of the Half-breeds:\n\"PRINCE ALBERT, June 13, 1866.\n\n\"We, the priests of the districts most particularly affected by the rebellion, to wit: St. Laurent, St. Antoine, Grandin, Duck Lake and Batoche,—for it was there, in the midst of our people, that Louis 'David' Riel had established his headquarters, desire to draw the attention of our fellow-countrymen in Canada to these facts:\n\n\"Louis 'David' Riel does not merit the sympathies of the Roman Catholic Church or the members of that Church, having usurped our mission as priests, and robbed our people of the benefits and consolations it was our duty to render to them. He has done all this in his purely personal interest.\n\n(Signed) \"Père André,\n\"Turge,\n\"Moulin,\n\"Vesteyville,\n\"Lecoq,\n\"Fourmond,\n\"Curé of Batoche.\"\n\nHere are further statements, which were submitted in the debate in the House of Commons on Mr. Landry's motion of censure on the government for permitting Riel to be hanged.\n\nBishop Grandin says:\n\n\"It is well known by all who have closely studied this movement that a miscreant, abusing a certain amount of knowledge, making use of a false and hypocritical piety, and by menaces and threats of inevitable destruction, deceived the half-breeds and forced them to take up arms against the Government. The ascendancy which he had gained over them was such that the greater part could not and dared not resist him.\"\n\nFather Fourmond said in a deposition:\n\n\"Louis David' Riel in his strange and alarming folly fascinated our poor half-breeds as the snake is said to fascinate its victims, abusing for his own ends, the great confidence that all the half-breeds reposed in him, a confidence founded upon his influence over their minds through his great and impassioned language and above all by the appearance of his profound religious feeling and devotion, which he displayed in the most glaring and hypocritical manner, which was rendered so convincing to their minds by his public proclamation of his mission as an inspired prophet, which he forced upon their imagination in the most insidious and most diabolical manner. To impress the people and keep them in his power this man Riel resorted to all kinds of trickery.\n\nFather Fourmond further states:\n\n\"Oh, my poor people, I could not restrain them. They were under the infatuation of this arch traitor and trickster till he got them committed by the effusion of blood, then they were in his power, and he used that power without any feeling of mercy. I also declare that during the trouble I had conversations with several of the persons who were in the rebel camp, and I found a large number of them there against their will, and only remained there because of the fear of being shot down, did they try to escape or desert.\"\n\nFather André, in his deposition in the case of Joseph Arcand, says:\n\n\"I most solemnly declare from my own personal knowledge, that with the exception of Gabriel Dumont, Napoleon Nault and Damase Carrierre, now deceased, not one of the half-breeds had the least idea or suspicion that there was any probability of danger or rebellion until they were so completely involved in the toils of Riel, and he led them on until they were so compromised that there was no escape for them.\n\n\"They were made to religiously believe that they had no mercy to expect at the hands of the soldiers, police, or from the Government of Canada—if they were taken prisoner or wounded, they were told nothing but death and unpitying torture awaited them at the hands of the soldiers and police, and their daughters and sisters would be dishonored before their eyes, their children hacked to pieces, and all their earthly property utterly destroyed, and their whole nation exterminated by the brutal soldiery.\n\nAs to Joseph Pilon he says:\n\n\"He was ordered by Riel to come into camp, or he would force him to come. Pilon, when he was threatened by Riel, came to the priest and cried when telling what was wanted of him. Riel, by force and threats against his life, compelled him to serve his purpose.\"\n\nFather André thus refers to the case of the Tourond brothers:\n\n\"The crafty Riel tried every way to induce the boys to join him, but without success. Riel went day after day to their poor widowed mother and with devilish cunning played on her superstition and credulity. He told her of his holy visions, etc., and the poor woman, in her simple faith in his divine mission, prayed of her fine young sons to go forth and fight under the banner of heaven.\"\n\nReferring to the prisoners generally, he says:\n\n\"They were misled by one who thoroughly knew their weak minds and their hearts. They were called on in the name of God and of the Holy Saints by one who declared himself ordained by God to do a great and good work. They were blinded by pretended visions as messages from the Holy Ghost; poor people, in their trusting confidence they were led on to desolation, misery and death.\n\nHaving started a new religion, Riel got up a ceremony at a church at Batoche, which was to consist of the baptism of his secretary, Jackson, into the new faith. He sent out scouts to bring in the Half-breeds to this ceremony, urging them to bring their guns with them, to fire a salute, and, as will be seen by the affidavits, he had in some cases, great difficulty in inducing them to come. When they had arrived at Batoche, he told them the Government was sending in troops to kill them, to take from them their properties and to destroy their families, and, under the influence of this threat, brought about the fight at Duck Lake which committed his unfortunate dupes, and led to the sad consequences which followed. These facts are obtained from the sworn testimony of a number of the people themselves. It is only necessary to give a few of the affidavits:\"\nJean Baptiste Laplante, farmer, swears:\n\n\"I was on a trip, when the rebellion broke out, to Troy, with freight for merchants at Batoche called Walters & Baker. I went no place else; after I delivered my freight, I went home. I staid home only one day, and a man named J. B. Deschamps came and looked for me. Deschamps had a gun, and said he would take me by force if I would not come, and we will take all you have. There were two of them, both armed. They brought me with them, but I had no gun. They brought me to Batoche, and said I must serve like the others. Riel told us our families would be killed by the troops, and that they must be all brought together.\"\n\nGabriel Parenteau, farmer, swears:\n\n\"I was here to buy goods, and staid two days; when I got back, I heard that they had raided the stores and were gathering in parties at Batoche. When I went to the church on Sunday, I was taken prisoner [at the St. Laurent church] by Philippe Guardupin and some one else—I do not know his name. They told me they would either shoot or lock me up if I did not go. They took me over the river and put me in a house, and kept me two days. On the third day I escaped and went home. About three days after they came for me; Gabriel Dumont came for me, and told me that if I did not come, they would take me up, put me in the cellars and tie all my cattle from me. I told them they might take my cattle, but he made me go, and after four days I began escaped house and staid there five days with my horses in the prairie, only coming home at night. John Ross, junior, came again for me, and took us all—our families, women and children—and kept us there all the time, until in the end, I was afraid to try it to get away again.\"\n\nJean Carron, farmer, swears:\n\n\"I was at Batoche during the Rebellion and took part with the rebels in the Rebellion. I was not a councillor. I was invited to the baptism of Jackson to bring my gun, for fear we would be arrested by the police there. I had no gun then and went for twenty days without one. I was not forced to go, but was deceived by Riel himself. I told him I had much work but he asked us to assist at the ceremony and so was led into the Rebellion. When I came to the church at St. Antoine, Riel told us that there were five hundred police coming to fight us, that Clark of the company had told him so, he then had all the men of Batoche around him and Riel said this before all the people.\"\n\nLouis Marion, farmer, swears:\n\n\"I know that Mr. Ness was taken prisoner by the rebels. When I was taken, I was brought into the same room with him and he was still a prisoner when I was released. Mr. Ness was a farmer and had cows and horses around his place. I heard them, the rebels, in the church where he was taken say they that they were to go Ness's house and take his gun and anything else that would be useful to them. On the 13th March I was at Walter's store at Batoche and a young man came and told us there was going to be trouble. Next morning we were removed to the church and they had a meeting and Riel told me that I had ten minutes to consider if I would join them or else he would have to do something. I promised to join but first chance I escaped. Once, Riel had passed sentence on Charles Nolin and William Boyer because they had not joined them. After that he asked the people what they thought of what he had done in sentencing these men the people all approved of it by a loud noise. He then turned around and told some of the prisoners what he had done, when he saw me, and he then said, God help you. I laughed at him when he said it is not too late yet, and then turning to the people he said he had forgotten me, but he would give me ten minutes to consider my position. That afternoon they went to Batoche's store and took out bales of blankets and clothing and served them out to those who were going to take Carleton. At this time the so-called Provisional Government was organized and had its sittings there, Riel nominated the members to the people, and if the people approved, the one named was taken into the Council. I think that sixteen captains joined him then that were named by Riel and voted in by the crowd in the church. I heard Riel say is the life of our merchants of this place of more value than ours, we will go and bring them with their arms. I saw a son of George Fisher and a son of Solomon Venne and young Garneau who had been brought in this way. I saw a number of Indians there, some of One Arrow's band, some of Beardy's band and some Sioux Indians. I heard that many were forced to join, the people fearing Riel threatening us so much, it made them afraid to oppose him, his threats were made to intimidate his people and bring people more to his side, he and his chief men could not be opposed, his threats against us succeeded in keeping his people together.\"\n\nNorbert Turcotte, farmer, swears:\n\n\"I was at Batoche during the Rebellion. I was invited with the others to the christening of Jackson, and, after that, we crossed the river and they would not let me return. I did not remain all the time. I was taken to Duck Lake, but did not take part in the fight and deserted that night and returned home for about a week, when two armed men came for me and took me again to Batoche where I remained all the time. I was there when the stores of Batoche, Boyer and Fisher were pillaged and the goods distributed and Venne's store as well, at the same time there were about two hundred and sixty men there then. I took nothing and took no part in the pillage. It was offered me, but I refused. I took no part in any of the fights. They had a guard at different places and had passed a law that if any deserted they should be shot.\"\n\nPierre Tourond, farmer, swears:\n\n\"I was present at Batoche with the Rebels, was forced to go by Riel, and was present at the battle of Fish Creek under arms and was wounded. My mother at times told us not to go, but Riel told us so many lies that we thought we had to go and fight, and he had too many men for us. All the time from the 17th of March, when he sent for us to come to the baptism of Jackson and bring our guns with us to salute the ceremony, when any of us would attempt to go home they would stop us and tell us that if we left, our cattle and goods would be taken, and if we were taken we would be shot.\"\n\nMaxime Lepine, farmer, swears:\n\n\"When Riel came that night of my arrival at home he said to me that five hundred police were coming to exterminate us and our families, and that he had called all the people together to see the baptism of Jackson and that the five hundred police were also coming to stop the ceremony. Riel, by the way he had acted for some months, had got the people to believe that anything he would say would be sure to happen. He had such an amount of influence among the people that they thought that anything they were told by Riel would happen. Riel by his ceremonies and misstatements about the outrages to\nbe perpetrated by the troops or police held the people together at Batoche and kept his influence over the people. After the whole fight was over the Half-breeds and I for one saw then that all the sayings of Riel were untrue about our families or women being injured or hurt. I after inquired about the 500 men Riel said were coming and I found it to be untrue, that none were coming as he had said and we then saw that we had been deceived by Riel into a trap. This was the only reason we had for taking up arms against the Government. I never saw any other reason, except as stated, to protect our wives and families from outrages, and Riel always told us there that when we took up arms we did so not against the Government but against the police. Riel said the outrages were, that we were to be massacred with our families and our race extinguished, and I am unable to tell half the lies he told us.\"\n\nPierre Paranteau, farmer, swears:\n\n\"They told me—Riel told me—that the soldiers were coming to kill our families, and when I got to the church it was full. Riel deceived us. Riel told the people that the soldiers were coming to destroy us, and that was the reason we fought; I am not aware of any other reasons. I am under oath, and I know what I say: we fought only to save our lives and the lives of our families, as Riel told us. Charles Nolin ran away from Duck Lake when the fighting commenced, before that he had been one of the leaders. If we had not been deceived as we were, our men would not have taken arms at all.\"\n\nIt will be seen that these sworn statements of leading half-breeds, give a vastly different history of the Rebellion and of the causes of it, than the stories current upon the opposition platforms and in the opposition press throughout the Dominion.\n\nThey might be multiplied almost indefinitely; but the extracts given serve to show the methods which Riel adopted to entrap his simple-minded followers into overt acts of rebellion.\n\nPerhaps the most complete answer to the alleged causes of the rebellion, as set forth in the Opposition press and upon Opposition platforms, is contained in the report of Mr. Pearce, laid before Parliament at its last session, in which he shows that of the 258 settlers at the outbreak in the disturbed districts, 238 had no claims whatever to scrip, having already had their claims extinguished before leaving Manitoba. Mr. Pearce reported as follows:\n\n\"Prince Albert, N.W.T. Dec. 14, 1885.\n\n\"Hon. Thomas White, Minister of the Interior, Ottawa, Ont.\n\n\"SIR.—In accordance with instructions received from you during your late visit to the Northwest, that I should, during my present visit to this district, collect all possible information regarding the alleged causes of the recent unfortunate outbreak in the Northwest, I have the honor to report as follows. The six alleged causes are the following:\n\n1. That the half-breed settlers did not receive patents for their lands through delays, the fault solely of the Government, which rendered it impossible for them to obtain entry for the lands settled upon;\n\n2. That owing to the system of surveys, these parties were unable to obtain the lands they had settled on and improved prior to survey;\n\n3. That they were entitled to the same right as had been accorded to the half-breeds of Manitoba;\n\n4. That the lands on which they had for years resided had been sold over their heads to others, chiefly speculators;\n\n5. That the timber dues have proved very onerous to them, and were a grave cause of dissatisfaction; and\n\n6. That the dues for cutting hay on Government lands were also onerous, and a cause of great dissatisfaction.\n\nAfter giving full details of the investigation and its results, Mr. Pearce summarized and concluded his report as follows:\n\n1. This report shows that of all the 258 settlers at the time of the outbreak, not one was unable to obtain patent for his land through the action—or rather non-action—of the Government, and even in March, 1884, there were only ten cases of delay, which delay was caused by the conflicting surveys of One Arrow's reserve and the St. Laurent parish.\n\n2. That not one man of the 258, or any one else who ever resided in the district, ever lost one inch of land through the system of survey, when such survey was made subsequent to his settlement therein.\n\n3. That 92 per cent. of the 258 had no rights as Northwest half-breeds. Of that 92 per cent., those who were half-breeds had participated in all the rights accorded those people in the province of Manitoba.\n\n4. That not one settler in the district had an acre of land sold over his head to which he had any claim, or had even preferred one.\n\n5. That the timber dues were not onerous, amounting only to 5 cents per settler per annum.\n\n6. That the hay permit question never affected them in the remotest degree.\n\nWhat was the real motive of the leader of the rebellion may be learned from the following testimony of Father André, given at the trial of Riel. It presents the man who is held up by the rouges of Quebec as a hero-martyr, and by the grits of Ontario as one whom it was a crime to have permitted to be hanged, in the light of a mercenary adventurer, attempting to levy black-mail from the Government:\n\n\"Q. I believe, in the month of December, 1874 you had an interview with Riel and Nolin with regard to a certain sum of money which the prisoner claimed from the Federal Government? A. Not with Nolin. Nolin was not present at the interview.\n\n\"Q. The prisoner was there? A. Yes.\n\n\"Q. Will you please state what the prisoner asked of the Federal Government? A. I had two interviews with the prisoner on that subject.\"\n\"Q. The prisoner claimed a certain indemnity from the Federal Government, didn't he? A. When the prisoner made his claim, I was there with another gentleman, and he asked from the Government $100,000. We thought that was exorbitant, and the prisoner said, 'wait a little, I will take at once $35,000 cash.'\"\n\n\"Q. And on that condition the prisoner was to leave the country if the Government gave him $35,000? A. Yes; that was the condition he put.\"\n\n\"Q. When was this? A. This was on the 23rd December, 1884.\"\n\n\"Q. There was also another interview between you and the prisoner? A. There has been about 20 interviews between us.\"\n\n\"Q. He was always after you to ask you to use your influence with the Federal Government to obtain an indemnity? A. The first time he spoke of it was on the 12th December, he had never spoken a word of it before, and on the 23rd December he spoke about it again.\"\n\n\"Q. He talked about it very frequently? A. On these two occasions only.\"\n\n\"Q. That was his great occupation? A. Yes, at those times.\"\n\n\"Q. Is it not true that the prisoner told you that he himself was the Half-Breed question? A. He did not say so in express terms, but he conveyed that idea, he said, if I am satisfied the Half-Breeds will be. I must explain this. This objection was made to him that even if the Government granted him $35,000 the Half-Breed question would remain the same, and he said, in answer to that, if I am satisfied the Half-Breeds will be.\"\n\n\"Q. Is it not a fact he told you he would even accept a less sum than $35,000? A. Yes, he said, 'use all the influence you can; you may not get all that, but get all you can, and if you get less we will see.'\"\n\nAnd yet this is the man who is lauded throughout the Province of Quebec as a hero-martyr, whose name has become an important factor in the politics of the Dominion, and through whose execution, Mr. Blake and his party hope to ride into power. The facts stated in these pages show that so far from there having been any justification for the rebellion, there was nothing even to palliate it. It was a wanton outbreak, provoked for the meanest of objects, the hope of pecuniary gain, by a man who has justly expiated his crimes on the gallows. And the fair-minded, loyal people of Canada may be depended upon to see that the Government will not suffer because it did its manifest duty in allowing the law to take its course in his case.\n\nIn brief then the facts connected with North-West administration are as follow:\n\n1. Petitions were sent as far back as 1873, which were ignored during the five years of the Reform administration.\n\n2. In 1876, Mr. Mills telegraphed Mr. Ryan to investigate half-breed claims, but peremptorily refused to permit him to take the necessary steps to make the investigation of any value.\n\n3. In 1878, nothing having been done in the meantime, Mr. Mills refused to extend Mr. Ryan's commission, stating that he had matter under consideration and would probably appoint the local land agent for the Saskatchewan district to make the enquiries.\n\n4. During Mr. Mills' term of office, petitions were sent by Bishop Grandin and others, asking aid in different forms for half-breed settlers, all of which were rejected.\n\n5. After the present Government came in, petitions were sent in, asking that settlers in advance of survey should (a) have their lands at price ruling when they went on the land; (b) should be allowed time spent and improvements made in advance of survey, in estimating claim for patent; (c) should be confirmed in their holding, even when it turned out, after survey, that they had squatted on odd sections, or on school or Hudson Bay Company's lands. Each of these requests was promptly granted in 1881 and 1882.\n\n6. Requests for surveys on the river lot principle, when made by settlers in advance of survey, were always granted and surveyors instructed accordingly. Requests for re-surveys from persons who settled after survey were properly refused, but in these cases, settlers were offered their land by legal subdivisions, which gave them practically the river lot system, and the land agent was sent to inform them of this and to urge them to make their entries.\n\n7. As to the matter of scrip, all the leading authorities of the North-West, Archbishop Taché, the Bishops of Rupert's Land and Saskatchewan and the North-West Council, advised that scrip should not be granted. But finally, on the 28th January, two months before the outbreak occurred, Government yielded to the requests of the half-breeds themselves, and authorized by Order-in-Council, the appointment of a commission to make the enumeration asked for with a view to the issue of scrip.\n\n8. No half-breed was ever deprived by the action, or inaction of the Government of an acre of land upon which he had settled, or to which he had even colorable claim by virtue of settlement.\nAPPENDIX.\n\nMR. LAURIER'S STATEMENT IN ONTARIO.\n\nSince the preceding pages were written, the Honble. Mr. Laurier has visited Ontario, and has addressed a number of meetings. In answer to the challenge to name a single Half-breed who had ever been deprived of an acre of land, upon which he had settled, or to which he had a claim by virtue of settlement, he has cited two cases, the first being a dispute between Father André and a Mr. Kelly, and the second, the case of a Mr. Salter, who made an entry for a quarter section of land in the parish of St. Louis de Langedvin. In support of the first, he said there was a letter of Father André's complaining that one Kelly had jumped his claim and had put up a frame building upon it. It happens that Mr. Kelly is at this moment residing in Ontario, and seeing the statement of Mr. Laurier, he addressed a letter to the London Free Press, as to the correctness of the statements in which he has made affidavit, giving the following particulars of the dispute:\n\n\"Mr. Laurier, it seems, can find only one outrage to justify the rebellion, but that one it also appears is such a very bad case that no population in the world would have stood it. Now, Mr. Editor, it happens to be the J. Kelly who is mentioned, and I propose, with your permission, to let the country see how utterly Mr. Laurier fails to justify the rebellion by quoting my case as a case of grievance. In 1879 I went from Sarnia to Duck Lake, N.W.T., where my brother, Henry Kelly, had been settled for some years. Father André, of Duck Lake Mission, held 200 acres of land, on which the mission was built. Alongside the mission land lay 320 acres which had for two years been held by a French-Canadian named Thibault, a member of Father André's flock, who claimed 160 acres as homestead and 160 acres as pre-emption. Father André also laid claim to the pre-emption land, on the ground that it belonged to the mission property, though the survey did not show it so. Thibault would not admit Father André's claim, and broke up four acres of the land to make his pre-emption title good. I was looking for land, and in March, 1881, Thibault came to me and said that as he was a member of Father André's congregation, he did not wish any trouble with the priest, and offered to sell me his claim to the pre-emption lot for a dollar an acre for the improvements. I paid him the money, and went to work to make improvements, and hired a yolk of cattle and began ploughing, and put up the frame of a house. Father André came and threatened that 'I must leave the land or he would fix me.' But I could not see that his title was as good as Thibault's, and I refused to go. Father André went to the agent at Prince Albert, then to Lieutenant-Governor Laird at Battleford; but both told him he had no case. Then he got up a petition among his parishioners to the department at Ottawa, but his claim was not allowed there either. In the meantime, I went on with my improvements until the beginning of May, when Mr. Owen E. Hughes, manager of Stobart, Eden & Co.'s business at Duck Lake, came to me and said he had an offer for me from Father André of $100 for my claim. I refused to take it. Mr. Hughes talked the matter over with my brother, who advised me to accept, as it might not be pleasant for me to continue a quarrel with Father André, and there was plenty of land as good to be got close by which nobody claimed. I told Mr. Hughes I would sell. A day was appointed, and Father André came to the office, paid Mr. Hughes the $100, which he handed to me, and accepted a receipt which Mr. Hughes drew out, and which I signed, transferring my right and title to the lot to Father André. That is a plain and true statement of the whole case, and your readers can judge how far that 'outrage' goes to justify the murder of the policemen, the shooting of poor Skeff Elliot, the Frog Lake murders and all the other ghastly incidents of the rebellion. Mr. Laurier holds the lives of loyal Canadians cheap, if he thinks two hundred people were justly murdered because my land cost Father André one hundred dollars.\"\n\nThe second was\n\nTHE CASE OF MR. SALTER.\n\nMr. Laurier's statement was that Salter had obtained an entry for a quarter section of land at St. Louis de Langedvin, which was already in the occupation of a Half-breed, thus dispossessing the Half-breed of his holding. The record in the Department of the Interior on this subject, as furnished by the Deputy Minister, is as follows:\n\n\"Neither the Registrar of the Department nor the Chief Clerk of the Patent Office has been able to find anything to indicate that the lands at one time entered in the name of Thomas Salter, or Richard Thomas Salter, which is the proper name, have ever been claimed in any way by a Half-breed, or anyone other than Salter himself. His entries were for the south-east quarter of section 12, township 45, range 27, west of the 2nd Meridian, and they have since been cancelled at his own request.\"\n\nSo that whatever may have been the original quarrel in this matter, the land has passed out of Salter's possession long ago, and there has been no further dispute about it. These are the only two cases mentioned by Mr. Laurier, and it will be seen that they utterly fail to meet the challenge given to name a Half-breed who had been dispossessed of his land by the action or inaction of the Government.\n\nMr. Laurier, as an evidence of the want of good faith of the Government, referred to the mission of the\n\nRev. Father Leduc and Mr. Maloney to Ottawa. His statement is that those gentlemen came to Ottawa in the interests of the Half-breeds generally; that they\nwere promised a re-survey of the lands of St. Louis de Langevin, and that the promise, although given in writing, has never been carried out. The facts in this case are as follows:—In the first place, the mission of Father Leduc and Mr. Maloney had no reference whatever to the claims of the Half-breeds or to the surveys in the District of Prince Albert. They came as representing the inhabitants of St. Albert, Edmonton and Fort Saskatchewan, which are between 400 and 500 miles away from the South Branch of the Saskatchewan, where the rebellion broke out. As explained by the report of the Deputy Minister, the action of the Government in ordering Mr. Michael Deane, the surveyor to whom had been given certain specific work in the Edmonton District, and who had commenced other surveys without authority, to discontinue these other surveys, led to the fear that the Government did not intend to proceed with the surveys, and Father Leduc and Mr. Maloney were sent to Ottawa on the subject. Their memorial, presented to the Government on the 10th of March, 1883, addressed on behalf of \"the inhabitants of St. Albert, Northwest Territories,\" asked for certain specific things, as follows:\n\n1st. That a river survey be allowed to them, with the two miles limit, as in Prince Albert, Northwest Territories, and Manitoba.\n\n2nd. Their claims having been occupied for many years, some of them before the transfer, they asked for the recognition of their titles by the Government and for their patents.\n\n3rd. They asked on behalf of the settlements of St. Albert, Edmonton and Fort Saskatchewan, that the river lot survey be extended from Edmonton to Fort Saskatchewan, both colonies included, \"as elsewhere on the Saskatchewan at Prince Albert, the Assiniboine and Red Rivers.\"\n\n4th. They asked for a Land Office at Edmonton, so that entries might be made and patents issued on the completion of their duties by the settlers.\n\n5th. They asked that persons who had settled in advance of survey should be protected in their rights as if they had settled after survey.\n\n6th. They asked for representation in the Parliament of Canada.\n\n7th. They asked for the abolition of timber dues.\n\n8th. They asked for the appointment of a Registrar at Edmonton or its vicinity.\n\n9th. They asked that the road between Edmonton and St. Albert should be confirmed by a public highway.\n\n10th. They asked for scrip, as had been given to the Half-breeds of Manitoba.\n\nIt will thus be seen that so far from Father Leduc and Mr. Maloney asking for surveys at Prince Albert or in the neighbourhood of Prince Albert at St. Louis de Langevin, their prayer was confined entirely to the Edmonton District, and had no relation whatever to the Parish of St. Louis de Langevin and to the applications which had been made for a re-survey of that parish. On the 12th of April of the same year (1883) the Minister caused a written reply to be sent to the representatives, as follows:\n\n1st. The lands were promised to be surveyed into river lots as requested.\n\n2nd. Patents were promised to be issued as soon as the field notes and plans of the surveyor were sent into the Department.\n\n3rd. The request of the people of St. Albert, Edmonton and Fort Saskatchewan to have their holdings surveyed into river lots and the right of pre-emption given to them, was promised.\n\n4th. A land agent was promised.\n\n5th. The time spent by settlers on lands in advance of survey it was promised should apply in their application for patents as if spent after survey.\n\n6th. The question of the representation of the Territories in Parliament, it was said, would engage the attention of the Government.\n\n7th. The Government declined to abolish timber dues, holding that they were in the interests of the country, and necessary for the preservation of the timber.\n\n8th. It was promised that a Registrar for the Edmonton District should be appointed.\n\n9th. The regulation of public highways being within the purview of the Lieutenant-Governor in Council, it was promised that the attention of the Governor should be called to that paragraph of the Memorial.\n\n10th. It was stated that the Government would consider the question of the claim of the Half-breeds of the Northwest Territories to scrip.\n\nIt will thus be seen that, substantially,\nevery request made by Father Leduc and Mr. Maloney on behalf of the inhabitants of the Edmonton District was granted,—excepting representation in Parliament, which of course was a matter of public policy, the abolition of timber dues, which applied to every part of the Territories; and the matters of scrip, explanations concerning which are given in the preceding pages.\n\nMr. Laurier states that when Father Leduc returned to the Northwest, he found that these promises had not been carried out. Father Leduc did write to the Government, saying that he learned that instructions had not been sent to the Surveyor, as had been promised, but the answer of the Department to that statement sufficiently meets that charge.\n\nThat answer was as follows:—\n\n\"Department of the Interior,\n\nOttawa, 3rd Sept., 1883.\n\nSir,—I have the honour, by direction of the Minister of the Interior, to acknowledge receipt of your letter of the 26th July last, and to request that you will be good enough to state in what respect, on your return to St. Albert, you found that the promises contained in the letter of the 18th April, 1883, which were the promises made verbally to Mr. Maloney and yourself when in Ottawa, had not been fulfilled by the Government. I am to call your attention to the fact that not only was Mr. Michael Deane instructed in regard to the survey, but a portion of his return of survey has already been received, and is at the present time being examined with a view to confirmation by the Surveyor-General. I am also to remind you that, until the survey has been completed and approved, the other steps in respect to the claims of settlers at Edmonton, Fort Saskatchewan and St. Albert, cannot be proceeded with. It is the intention of the Minister, however, that no unnecessary time should be lost, and the required action has so far been taken with as much promptitude as possible.\n\nI have the honour to be,\n\nSir,\n\nYour obedient servant,\n\nJOHN R. HALL,\n\nActing Secretary.\"\n\nAs a matter of fact the instructions had been sent to Mr. Michael Deane to proceed with these surveys as soon as information was received at Ottawa that the people of Edmonton were under a misapprehension concerning the action of the Government, and before the arrival in Ottawa of the Rev. Father Leduc and Mr. Maloney; and more specific instructions were sent before the letter in reply to their memorandum was handed to them. Here is a telegram from the Surveyor-General, Mr. Deville, addressed to the Minister of the Interior at Ottawa, on this subject:\n\n\"To Hon. Thos. White.\n\nInstructions to Michael Deane for survey of St. Albert Settlement are 29th February, 1883. He was further instructed on 9th April, 1883, to give this survey precedence over any other work.\n\nE. DEVILLE,\nSurveyor-General.\"\n\nThese surveys were promptly completed; a Land Agent was appointed, Mr. Gauvreau, a French Canadian, being named to that position; a Registrar was appointed, Mr. Roy, also a French Canadian, being named the Registrar, and the claims of the people have all been satisfactorily settled. It is worth while to state that the people, on whose behalf Father Leduc and Mr. Maloney visited Ottawa, so far from complaining, or taking part in the rebellion, enlisted as volunteers in the service of the Government during the rebellion to maintain the authority of the Crown.\n\nHALF-BREED CLAIMS SETTLED.\n\nA popular argument used by Mr. Laurier with the object of showing the number of half-breeds who were interested in the distribution of scrip, is the statement that the Government settled with two thousand of them. This statement is most misleading. The claims recognized covered the cases of children, of deceased persons represented by heirs, and of half-breeds who were formerly dealt with as Indians, but have now withdrawn from treaty. In the case of the latter, the annuities formerly paid to them as Indians, will be no longer paid to them. The following is an analysis of the claims recognized by the commission during 1885 and 1886:—\n\n| Category                  | 1885 | 1886 Total |\n|---------------------------|------|------------|\n| Treaty heads of families  | 51   | 25         |\n| Treaty children           | 131  | 377        |\n| Non treaty heads of families | 325 | 78         |\n| Non treaty children       | 750  | 212        |\n| Deceased heads of families| 108  | 83         |\n| Deceased children         | 251  | 182        |\n\nSo that the number of heads of families in the Northwest, who were at the time of the outbreak entitled to scrip, was 403, instead of two thousand as is usually stated, and of these, only about a score were in the disturbed district or took part in the outbreak.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001559.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 29704, "total-output-tokens": 22122, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 31, 1], [31, 1146, 2], [1146, 4149, 3], [4149, 9444, 4], [9444, 15561, 5], [15561, 21206, 6], [21206, 26349, 7], [26349, 31667, 8], [31667, 37563, 9], [37563, 42864, 10], [42864, 47962, 11], [47962, 54032, 12], [54032, 59339, 13], [59339, 65088, 14], [65088, 72066, 15], [72066, 77722, 16], [77722, 82593, 17], [82593, 88246, 18], [88246, 92533, 19], [92533, 97219, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]