[{"id": "9f8a36e87224e694ce6e18812e88ed9dd7ea8d4e", "text": "THE GENERAL RAILWAY ACT.\n\nSTATEMENT TO THE GOVERNMENT RESPECTING IT.\n\nOTTAWA, 12th February, 1884.\n\nSir,—\nI have the honor to submit for the consideration of the Government, the following statement in support of my proposed General Railway Act for the North-West, and to request the assistance of yourself and your colleagues in securing the passage of the measure during the present session of Parliament:\n\n1st.—A general or uniform system of local or subsidiary railways is imperatively demanded in the interests of the people of the North-West. In support of this proposition I beg to call your attention to the fact that the fertile belt, west of the Red river, extending westward and north-westward for about fifteen hundred miles, is, on an average, over one hundred and fifty miles wide. Supposing the main line of the Canadian Pacific Railway to run through the centre of the greater portion of this belt, and, admitting that the farmers can successfully haul the products of the soil fifteen miles to avail themselves of this railway, we find that the main line can be made available only to the settlers in a narrow strip of country, say thirty miles wide, or less than one-fifth of the Agricultural lands now open for settlement. To make the great transcontinental line serviceable to the whole North-West, or to the fertile belt generally, a system of side-lines is requisite, by which the settlements distant from it may be accommodated.\n2nd.—A General Railway Act applicable to the North-West is necessary to promote the construction of such a system of railway.\n\nThe history of railway legislation for the North-West, during the past five years fully sustains this proposition. The getting of charters from Parliament has served little beyond purposes of speculation, while Railway Acts granted by the Manitoba Legislature have, for the most part, been disallowed. When we consider the number of charters which have been granted, and the almost entire failure of the companies thus favored, one is forced to look upon further legislation of this kind with disfavor. A General Act is therefore needed to take the place of further special legislation, since, by its provisions paper railway schemes may be abolished, and only bona fide enterprises encouraged. The conditions of the organization of companies under the Act, while sufficiently liberal to afford every opportunity for the investment of capital in North-West railway undertakings, may, at the same time be framed so as to prevent incapable companies holding the exclusive right, for any length of time, to a projected line of railway, to the exclusion of capital available for its construction. Such an Act will establish confidence in local railways as a profitable investment. It will settle the question as to what authority shall shape and control the system of North-West lines, and afford permanent protection, as far as Federal legislation can properly grant protection, to foreign capital that may find its way into such undertakings. In short it is the only suitable means for the construction of a much-required system of local railways in the North-West.\n\n3rd.—Such an Act should be passed during the present session as it is exceedingly important that the work of constructing the lines should be commenced the present year.\nIt is now quite certain that the Canadian Pacific Railway will be completed and in operation from the Atlantic to the Pacific within two years from this fall. With such a result accomplished, what will be the position of Manitoba and the North-West in respect thereto, provided little or nothing is done meanwhile by way of building subsidiary roads. Simply that of being unable to make the line available, except to a few settlements. Nearly four-fifths of the fertile belt would still be without railway communication, and the most productive sections of Manitoba, while almost within hearing of the sound of the Pacific Railway cars, would be excluded from their advantages. Provided the Act is passed this session and the work of construction under it should immediately follow but a few hundred miles of road could be made ready for operation by the close of 1886, and for these reasons I urge immediate action.\n\n4th.—There is a strong probability that the passage of the Act which I propose will be the means of facilitating railway construction in the North-West.\n\nI am not in a position to state positively, but from representations made to me, which I cannot but accept as trustworthy, I regard it as very probable, that immediately following the Act which I propose, a strong company will be formed, representing English, United States and Canadian capital, sufficient to construct, at least five hundred miles of local railways in the North-West during the next four years. With sufficient encouragement to the enterprise on the part of the Government, I have but little doubt that such a result will be accomplished.\n\n5th.—The operation of the roads which I ask Federal legislation to authorize will be a profitable business for the companies which may control them, and a decided advantage to the settlements which will thereby obtain connection with the Canadian Pacific Railway.\nI do not think it necessary to advance anything in support of this proposition, except to refer you to the vast system of purely local roads now in successful operation in the State of Illinois. It is estimated on the evidence contained in the Report of the Railway Commissioner of that State, that two-thirds of the farmers in the great cereal districts there have to haul their produce on an average of but eight and one-quarter miles, while the other third have to perform the same service on an average of but ten miles. In the same report it is shown that these railways are operated with fair returns, in most cases, to their owners, and upon a schedule of tariff rates unoppressive to the farming community. I submit that the fertile belt of the Canadian North-West is vastly more productive than the best portions of the State of Illinois, and that a system of local roads in the latter is as necessary and will be as valuable to shareholders and farmers as it ever has been in the past, or ever can be in the future, in any portion of the United States.\n\n6th.—The system of local or subsidiary roads which I propose is necessary in the interests of the trans-continental line as well as to the advantage of the settlements in the North-West.\n\nSuch local roads will serve as the great source of traffic supply to the Canadian Pacific. They will be to that trunk line as tributaries to a mighty river, ever swelling the volume of its business. I may say that the Canadian Pacific Railway Company fully recognize this important fact. In an interview on Saturday last with Mr. George Stephen, the President of the Company, and Mr. W. C. Van Horne, General Manager, I was assured by both that they were in hearty sympathy with my proposed measure. They expressed the belief that such a system of roads under a General Railway Act should have been undertaken at least a year ago.\n7th.—The Canadian Pacific Railway Company are not in a position to go forward with the construction of these needed branch lines.\n\nThis is clearly shown by the record of the past. While they have pushed forward work on the main line at a most commendable pace, they have not been able to meet the wishes of the people of the North-West in respect to branch lines. Aside from this inactivity regarding side lines in the past, we have the assurance that the next two years will afford us but little improvement; by the fact that the company is now asking Parliament to strengthen their hands in the work of the main line; and that the aid which it is proposed to grant is for the main line only. We must therefore look to some other source than that of the company for the immediate construction of local railways in the North-West.\n\n8th.—The Government in my opinion should take power from Parliament to aid the construction of these proposed local railways by way of cash subsidies.\n\nIt will require, at least five thousand miles of local railway lines in Manitoba and the North-West to make the country anything like available for settlement and successful agricultural pursuits. At the rate of two hundred and fifty miles a year it will require twenty years to complete a system of this magnitude, or, perhaps the more reasonable calculation would be the construction of say five hundred miles by the end of 1886, one thousand five hundred more by the end of 1888, fifteen hundred miles more by the end of 1890, and fifteen hundred miles more, or the whole five thousand by 1892. If Parliament would undertake to grant, in aid of these roads, say five millions two hundred and fifty thousand dollars, at the rate of about one million dollars annually on a progressive plan of say three thousand five hundred dollars a mile, it would I have no doubt, secure the construction of fifteen\nhundred miles of the most urgently required branches in the course of the next five or six years. With the construction of fifteen hundred miles by this proposed assistance the North-West would be placed in such a position that our people could, without further aid, if necessary, go forward with the work of local railway construction on their own account, probably at the rate of progress which I have indicated. If land grants instead of cash subsidies be urged, I reply that there is no serious objection to such a proposition from the standpoint of the railway companies which would be created by the proposed Act. From this quarter I take it that land grants would be most acceptable on the grounds that the assistance received in that way would likely be much greater in the end, but looking at the whole question I am in favor of cash subsidies. I look with disfavor at any measure to further tie up the lands of the North-West. These should be left as far as possible open to settlers on the most favorable terms. Grants to different railway companies have a great tendency to confuse the minds of emigrants. The intending settler has already met with too great a variety of land regulations. There are the Government's terms of sale and settlement, the Hudson's Bay Company's regulations, the Canadian Pacific Railway Company's rules, the Colonization Company's plans, and also regulations of sale, differing more or less, of each landed railway company. I have always regarded this cutting up of the public lands as a necessity much to be regretted, and hope that should the Government see fit to encourage railway construction such as I have proposed, they will do so by cash subsidy rather than by land grants. Notwithstanding all that has been said against the Government's land regulations, I hold that the lands thus administered will be more rapidly settled upon and developed than the grants that may be given to railway companies, no matter how stringent the rules made for their ad-\nministration. However, as assistance to local railways in the North-West is all important, I leave the Government to decide, with these suggestions, in what form that aid can be given.\n\nIt is hardly necessary, I think, to detain you with any arguments in support of our claims for assistance to local railways. The principle has already been adopted. There are those, I know, who say that the Canadian Pacific, which is costing the country so many millions, is to the advantage, chiefly, of the North-West. I would be the last to under-rate the value of that line to our section of the Dominion, but I hold that it is of equal importance to Eastern Canada. Moreover, the lands in the Great North-West will, in the end, liquidate much or nearly all, of the cost of the national work, so that in view of the fact that the Government of Canada have repeatedly assisted lines of a local character in the other provinces, having granted over $2,000,000 in that way two years ago, I do not hesitate to press the claims of Manitoba and the North-West to an equal proportion of public aid in this respect. Besides the public lands in the North-West that will remain to be administered by the Central Government, after all present demands are satisfied, will yield vastly more than the amount of the assistance required to encourage the building of the roads in question.\n\nIn view of all the circumstances, therefore, I respectfully request the co-operation of the Government to secure the passage this session of a General Railway Act to Encourage the Construction of Local Railways in Manitoba and the North-West. —An Act that will provide\n\n1st.—Just and equitable facilities for the organization of railway companies authorized to construct and operate railway and telegraph lines in the North-West.\n\n2nd.—Reasonable cash or land subsidies in aid of such railways.\n3rd.—Such other provisions in respect of Government approval of proposed lines before construction; accepting municipal aid; issuing mortgage bonds; powers to acquire from the Canadian Pacific Railway Company uncompleted branch lines; authority to make proper connection with the main or branch lines of the Canadian Pacific Railway, etc., etc., as it may seem wise and prudent to grant.\n\nShould the Government see fit to encourage my proposals, I desire to know as soon as possible their views in regard to the question of assistance—whether they will favor cash or land grants, as the proposed Bill cannot well be introduced until that point has been settled. As the work of the Session is now rapidly progressing, I beg respectfully to urge this matter upon the consideration of the Government, so that should the proposed measure be agreeable to the Ministry, the Bill which is now in course of preparation, may be completed and submitted to Parliament.\n\nI have addressed circulars to the various municipalities in Manitoba asking for an expression of opinion on the question. In reply resolutions are coming in from all quarters urging upon the Government prompt action in favor of the proposed measure. These, as soon as a sufficient number to be representative of the Province arrive, I will enclose to you for consideration.\n\nMeanwhile, permit me to say that the people of the North-West are exceedingly anxious to see the measure carried, believing as they do, and as I do, that by it much relief will be obtained and discontent removed.\n\nI have the honor to be, sir,\n\nYour obedient servant,\n\nThe Honorable\n\nTHOS. SCOTT.\n\nSir Charles Tupper,\nMinister of Railways,\nOttawa.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001287.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 11, "total-input-tokens": 16052, "total-output-tokens": 3197, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1451, 3], [1451, 3313, 4], [3313, 5207, 5], [5207, 7090, 6], [7090, 8977, 7], [8977, 10980, 8], [10980, 12839, 9], [12839, 14520, 10], [14520, 14520, 11]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false]}}]