[{"id": "3011ae76923ad37e4e53e28b2006d2fad0470bcb", "text": "Question Riel\n\nLa mort de Riel et la voix du sang,\npar un comité de collaborateurs\nPRÉFACE\n\nEn vous offrant cette modeste brochure, lecteurs, au lendemain d’un jour néfaste, s’il en fut jamais un dans l’histoire de notre pays depuis 1837, nous n’avons qu’un but, celui de rallier tous les Canadiens-Français sous un même drapeau, sous le drapeau de la nationalité et du patriotisme, pour combattre le bon combat, pour flétrir l’orangisme, le fanatisme qui triomphe en ce moment sur le cadavre de l’infortuné supplicié de Régina, en qui s’était incarnée la cause de la province de Québec, la cause de tous les Canadiens-Français dignes de ce nom ; autour duquel se grouperont de ce jour, dans une même et indissoluble union, tous les descendants de Montcalm et de Lévis jaloux de conserver au nom français, sur la terre d’Amérique, le respect, la considération qui lui est due ; autour duquel s’évanouiront les anciennes divisions, se fusionneront les anciens partis, s’uniront tous les Canadiens d’origine française pour présenter désormais à l’ennemi commun un front compact, une ligne impénétrable contre laquelle devront se briser tous les projets, toutes les combinaisons machiaveliques des ennemis de notre race. Puissions-nous l’atteindre, ce but, et voir enfin cette grande faute de notre gouvernement tourner au plus grand bien de la nationalité canadienne-française et de son avenir sur la terre bénie du Canada, sur cette terre qui vient de boire le sang d’un de nos frères, qui en est encore toute chaude, qui proteste de toute sa puissance, de toute son énergie, contre ce forfait révoltant, contre ce crime et ce meurtre politique.\nRiel est Mort\n\nOui Riel est mort, bien mort. Canadiens-Français une trop juste colère fait bouillonner notre sang dans nos veines ; mais contenons-nous un moment ; le jour de la vengeance est proche. L'émeute, le désordre ne sauraient que nous discréditer sans profit, le scrutin portera au sein du Parlement une députation toute unanime à voter contre le lâche ministère qui nous a trahi et qui choira alors dans la honte, le scrutin nous vengera. En attendant, Canadiens, conservateurs, libéraux, patriotes sans distinction de couleur ni de parti, préparez-vous à entendre de dures vérités, puisées aux sources officielles, qu'il faut que tout le monde connaisse et qui sont consignées dans cet humble opuscule par une plume conservatrice ou plutôt canadienne-française.\n\nRiel est mort et la ville maudite qui a bu son sang, les hordes de sectaires qui l'ont demandé à bouche rageuse, à cris sinistres, exécrables, en sont encore tout plongés dans une infernale orgie de fanatisme et de haine contre le nom français, contre la province française qu'ils s'imaginent êtreindre et fouler aux pieds, en étouffant et en foulant aux pieds le cadavre livide de l'infortuné chef des Métis, désormais l'immortel supplicié de Régina.\n\nIls étaient là cent cinquante sbires, gardant les abords de sa prison, le sabre au côté, la carabine au poing, le pistolet à la ceinture et pardessus tout le cœur felleux, débordant d'insultes et d'imprécations pour tout ce qui aime la France ; la gorge, les entrailles dévorées par une inconcevable soif de sang français. Nuit et jour ils rôdaient autour de son cachot. Dans leur sommeil troublé Dumont accourait, à la tête d'une armée de Métis et de Sauvages, délivrer son ancien chef ; ils redoublaient alors de vigilance pour prévenir l'évasion de l'innocent prisonnier. Pareils aux tigres dans l'arène, leurs yeux étaient rivés sur cette proie qu'ils craignaient de voir s'échapper, qu'ils brûlaient de contempler sur le gibet, qui s'élevait à côté d'eux, dont chaque clou qui s'enfonçait trouvait un écho jusqu'au plus profond de leur être, faisait briller dans leurs regards les étincelles d'une joie farouche, d'une sauvage volupté.\n\nEnfin arriva le sombre messager de la mort ; l'ordre d'exécution était rendu ; l'iniquité commencée par la sentence d'un juge aveuglé, le gouvernement du Canada en décrétait la consommation ; il la jetait en pâture à ses farouches partisans de l'Ontario et de la secte.\n\nEt Riel est mort ; Riel est mort sur le gibet de l'ignominie. La corde qui l'a étranglé étrangle et garotte la Province de Québec dans l'esprit des milliers de spectateurs qui ont savouré son dernier râle ; elle étrangle, elle garotte les Canadiens-Français dans l'esprit des fanatiques d'Ontario qui célèbrent en ce moment leur victoire sur nous, sur nos ministres, sur nos députés. Mais le jour de la rétribution ne tardera guère. Et pour qu'il soit à\njamais mémorable, pour que nous ne puissions oublier ce que nous devrons à notre pays au jour du vote, au grand jour de la rétribution, rappelons ici la mort héroïque et les derniers moments du martyr de Régina.\n\nLe Testament de Riel.\n\n\"Testament de Louis David Riel.\n\n\"Je fais mon testament, conformément au conseil qui m'a été donné par le R. P. Alexis André, mon charitable confesseur et très dévoué directeur de conscience.\n\n\"Au nom du Père, du Fils et du Saint-Esprit, je déclare que ceci est mon testament, que je l'ai écrit librement dans la pleine possession de mes facultés mentales.\n\n\"Les hommes ayant fixé le 10 novembre prochain comme la date de ma mort, et comme il est possible que la sentence soit exécutée, je déclare d'avance que ma soumission aux ordres de la Providence est sincère, que ma volonté s'est rangée avec une entière liberté d'action, sous l'influence de la grâce divine de Notre Seigneur Jésus-Christ, du côté de l'Eglise catholique, apostolique et romaine. C'est en elle que je suis né et par elle aussi que j'ai été régénéré.\n\n\"J'ai rétracté ce que j'ai dit et professé de contraire à sa doctrine, et je le rétracte encore. Je demande pardon du scandale que j'ai causé. Je ne veux pas qu'il y ait de différence entre moi et les prêtres de Jésus-Christ, gros comme une tête d'épingle. Si je dois mourir le 10 de ce mois, c'est-à-dire, dans quatre jours, je veux faire tout en mon pouvoir, avec le secours de mon divin Sauveur, pour mourir en harmonie parfaite avec mon Créateur, mon Rédempteur et mon Sanctificateur en même temps qu'avec la sainte Eglise catholique. Si Dieu veut bien m'accorder le bienfait inestimable de la vie, je veux de mon côté monter sur l'échafaud et me résigner à la volonté de la Providence en me tenant dégagé, comme je le suis aujourd'hui, de toutes les choses terrestres; car je comprends que le plus sûr moyen de bien faire est de mettre ses desseins en pratique d'une manière entièrement désintéressée, sans passion, sans excitation, sous le regard de Dieu, en aimant son prochain, ses amis et ses ennemis comme soi-même, pour l'amour de Dieu.\n\n\"Je remercie ma bonne et tendre mère pour m'avoir aimé d'un amour si chrétien. Je lui demande pardon pour toutes les fautes dont je me suis rendu coupable contre son amour, le respect et l'obéissance que je lui dois. Je lui demande aussi pardon pour les fautes que j'ai commises contre mes devoirs envers mon bien aimé et regretté père et envers sa mémoire vénérable.\n\n\"Je remercie mes frères et sœurs pour le grand amour et la grande bonté qu'ils ont eus pour moi. Je leur demande aussi par-\ndon pour mes fautes de toutes sortes et pour les erreurs dont j'ai pu me rendre coupable à leurs yeux.\n\n\"Je remercie mes parents et ceux de ma femme pour l'affection et la bienveillance qu'ils m'ont toujours montrées—en particulier mon affectionné et bien aimé beau-père, ma belle-mère, mes beaux-frères et belles-sœurs. À eux aussi je demande pardon pour tout ce qui dans ma conduite n'a pas été bien et aurait été mal.\n\n\"Je donne une franche et amicale poignée de main à mes amis de tout âge et de tout rang, de toute classe et de toute condition. Je les remercie pour les services qu'ils m'ont rendus. Ma reconnaissance, je la témoigne particulièrement à ceux de mes amis, tant de ce côté-ci de la frontière que de l'autre côté, qui ont daigné s'occuper de mes affaires en public, aux Oblats de Marie Immaculée, à la société de Saint-Sulpice et aux Sœurs Grises, pour tous les bienfaits que j'ai reçus d'eux depuis mon enfance. Je leur offre mes remerciements.\n\n\"J'ai des bienfaiteurs de l'autre côté de la frontière, des amis dont la bonté pour moi a été au-delà de toute mesure. Je leur demande d'accepter mes remerciements, d'excuser charitalement mes défauts. Si ma conduite a pu en quelque façon offenser quelqu'un soit dans les grandes choses ou dans les petites, je leur demande de pardonner en tenant compte des excuses qui peuvent être en ma faveur; et quand à la somme de mes véritables fautes, mei culpabilitates, j'espère qu'ils auront la bonté de me les pardonner devant Dieu et devant les hommes.\n\n\"Je pardonne de tout mon cœur, de tout mon esprit et de toutes mes forces, et de toute mon âme à ceux qui m'ont causé du chagrin, qui m'ont fait de la peine, qui m'ont causé du dommage, qui m'ont persécuté, qui sans raison m'ont fait la guerre pendant quinze ans, qui m'ont fait un semblant de procès, qui m'ont condamné à mort, et s'ils désirent réellement me vouer à la mort je leur pardonne entièrement, comme je demande à Dieu de me pardonner entièrement toutes mes fautes au nom de Jésus-Christ.\n\n\"Je remercie ma femme pour sa bonté et sa charité à mon égard, pour la part qu'elle a prise si patiemment dans mes pénibles travaux et mes difficiles entreprises. Je la prie de me pardonner la peine que je lui ai causée volontairement ou involontairement. Je lui recommande d'avoir soin de ses petits enfants, de les élever d'une manière chrétienne, avec une attention particulière pour tout ce qui a rapport aux bonnes pensées, aux bons discours, aux bonnes actions et aux bonnes compagnies.\n\n\"C'est mon désir que mes enfants soient élevés avec grand soin en tout ce qui touche à l'obéissance à l'Eglise, leurs maîtres et leurs supérieurs. Je leur recommande de montrer le plus grand respect, la plus grande soumission et la plus complète affection envers leur bonne mère. Je ne laisse à mes enfants ni or ni argent, mais je supplie Dieu, dans son infinie miséricorde, je supplie les entrailles de la miséricorde de Dieu de remplir mon esprit et mon cœur de la vraie bénédiction d'un père que je désire leur\ndonner : Jean, mon fils, Angélique, ma fille, je vous bénis au nom du Père, du Fils et du Saint-Esprit, pour que vous vous appliquiez à connaître la volonté de Dieu et soyez fidèle à l’accomplir en toute piété et sincérité : pour que vous pratiquiez la vertu fermement et simplement, sans parade ni ostentation ; pour que vous fassiez le plus de bien possible sans manquer aux autres dans la limite d’une juste obéissance au clergé constitué, prêtres et évêques, surtout à votre évêque et à votre confesseur. Je vous bénis pour que votre mort soit douce, édifiante, bonne et sainte aux yeux de l’Église et de Jésus-Christ Notre Seigneur.—Amen.\n\n“Je vous bénis, enfin, pour que vous cherchiez et trouviez le royaume de Dieu et pour que vous puissiez de plus reposer en Jésus, Marie et Joseph. Priez pour moi.\n\n“Je laisse mon testament au Rév. Père Alexis André, mon confesseur. Je prie mes amis de partout de tenir le nom du Père André côte à côte avec le mien. Je l’aime le Père André.\n\nLOUIS DAVID RIEL.\n\n“fils de Louis Riel et de Julie\n“de La Gimodièrre.”\n\nLes derniers moments de Riel\n\nLe messager spécial apportant l’ordre d’exécution arriva à Regina le dimanche 15 novembre à 3 heures du soir. Ce fut une surprise, même pour plusieurs des fonctionnaires qui, vu l’heure avancée et les délais précédents, avaient prétendu qu’un nouveau sursis serait accordé.\n\nRiel reçut la nouvelle à neuf heures du soir, dans la partie de sa cellule qui servait de chambre aux gardes, dans les casernes de la police montée de la ville.\n\nCette nouvelle lui fut donnée par le shérif Chapleau. La scène fut remarquable sous bien des rapports.\n\nLa porte de la cellule du condamné s’ouvrit à l’arrivée du shérif Chapleau et du commandant de la police montée. Riel qui jusque là avait conversé avec le médecin du poste se leva et souhaita la bienvenue au shérif d’une façon tout à fait cordiale et avec aisance. Les inflexions de sa voix n’indiquaient aucune excitation, “eh bien, dit-il, comme cela, vous venez avec la grande nouvelle? J’en suis bien aise. Je suis heureux d’apprendre qu’enfin je vais être débarrassé de mes souffrances.”\n\nLe malheureux condamné remercia ensuite affectueusement, en français, le shérif de ses bienveillantes attentions. “Je désire, ajouta-t-il, que mon corps soit remis à mes amis pour être enterré à St-Boniface où il y a un cimetière français.”\n\nAvez-vous quelques papiers à me confier touchant la disposition de vos biens, lui demanda le shérif?\n\n“Mon cher, répondit-il, je n’ai pour tout bien que ceci (et il toucha sa poitrine dans la région du cœur) et ceci je l’ai donné à\nmon pays, il y a quinze ans ; et c'est tout ce qui me reste maintenant.\n\nInterrogé sur l'état de son âme, il répondit : \"Il y a longtemps que j'ai fait ma paix avec mon Dieu ; je suis aussi bien préparé maintenant que je puis l'être en aucun temps. Vous trouverez que j'avais une mission à remplir, je vous prie de remercier mes amis de la province de Québec de tout ce qu'ils ont fait pour moi. Dites-leur que je suis content de quitter ce monde ; que je sentirai, lorsque le moment viendra, des ailes qui m'enlèveront là-haut.\"\n\nRecommençant alors à parler français, sur un ton persuasif d'une douceur inimitable pour laquelle il a toujours été célèbre, il dit l'affectueux souvenir qu'il gardait pour ceux qui avaient épousé sa cause personnelle. \"Adieu, mon ami ; adieu,\" disait-il en tendant la main au shérif Chapleau. Et son œil était clair, serein ; son assurance absolue était telle qu'elle faisait naître l'admiration par l'absence de toute crainte et de tout frémissement d'excitation. Jamais homme ne fut plus maître de lui-même devant la mort.\n\nLa Mort de Riel.\n\nEnfin, le jour, l'heure funeste sonna. Riel s'était confessé. Il avait reçu les dernières consolations de l'Eglise. Un peu avant huit heures le shérif vint lui annoncer que le moment solennel était venu, qu'il fallait marcher à la mort. Cet ordre terrible, l'admirable martyr le reçut sans s'émouvoir, avec le même sangfroid qu'il avait montré la veille en apprenant que son sort était scellé.\n\nLa scène qui se présenta l'instant d'après fut celle de Riel sur l'échafaud, avec le père André et le frère McWilliams à ses côtés. La messe fut célébrée sur l'échafaud. Riel était agenouillé ; il portait d'amples pantalons gris et une chemise en laine. Il était chaussé en mocassins, et c'était là le seul article de sa toilette qui tînt du sauvage.\n\nSa figure rayonnait et il paraissait parfaitement maître de lui. Il répondait d'une voix forte et calme aux prières qui se disaient pour lui. Ce ne fut qu'un instant avant de mourir qu'il se décida à ne point faire de discours, à la pressante sollicitation des deux Pères qui l'assistaient. Il parut, cependant, au dernier moment, vouloir parler, mais le Père André lui rappela sa promesse ; il se leva et marcha vers l'exécuteur, en répondant aux prières jusqu'au dernier moment. Ses dernières paroles ont été : \"Merci, Jésus.\"\n\nIl est mort sans résistance. 20 personnes avaient reçu des permis d'assister à l'exécution à l'intérieur des casernes. L'affaire fut faite avec dignité et d'une façon expéditive. Le cadavre fut ensuite remis au coroner et le jury rendit le verdict ordinaire en pareil cas.\n\nDès que le Conseil Privé eût refusé de renverser le verdict prononcé contre Riel, la garde était devenue plus stricte, tant pour\nempêcher l'évasion du prisonnier d'État que pour prévenir une tentative d'enlèvement par ses compatriotes du Canada, ou des États-Unis. Quatre-vingt-dix hommes furent postés aux abords de la prison.\n\nCe nombre fut même augmenté. Des vedettes occupaient les points culminants à un mille des casernes, et un double cordon avait été placé autour du camp.\n\nLa prison de Riel, à proprement parler, consistait en un long bâtiment en bois, à un étage, avec un long toit mansardé et de petites fenêtres sous les rebords du toit, barrées de fer. Deux corps de garde se relevant l'un l'autre occupaient des chambres sur le front du bâtiment, tandis que six sentinelles arpentaient le terrain continuellement en dehors du bâtiment.\n\nUne autre sentinelle passait devant la cellule du condamné et les précautions étaient telles que l'officier de la garde était forcé de visiter la cellule et de certifier qu'il avait visité son prisonnier tous les quarts d'heure. Jamais prisonnier ne fut soumis à une surveillance plus sévère et jamais peut-être prisonnier n'eut moins besoin d'être surveillé, durant tout le temps de sa captivité. Quelle qu'ait pu être sa conduite sur le champ de bataille comme commandant de ses compatriotes, il s'est conduit comme un religieux dans sa cellule.\n\nSes jours entiers, il les consacrait à des pratiques de dévotion, à la prière, même lorsqu'on lui permettait de se promener à l'extérieur. Une heure durant chaque matin, il se promenait les mains jointes, la tête inclinée, pendant que de ses lèvres s'échappait la prière, tantôt en français, tantôt en langue sauvage.\n\nPeu après sa capture par les troupes canadiennes, il professait avoir mis de côté son allégeance à l'église catholique romaine et il prenait les allures d'un prophète, prétendant avoir des visions et se réclamait le don de prophétie.\n\nMais en dernier lieu, son sort se scellant de plus en plus, il revint à la foi catholique, et son compagnon, deux semaines avant sa mort fut le révérend, Père André, du Fort Albert, poste situé presque sur le théâtre de la rébellion. Le Père André le visitait constamment deux fois par jour, et en son absence Riel s'agenouillait fréquemment au chevet de son lit et priait avec ferveur.\n\nIl passait le reste de son temps à écrire des prédications pour l'avenir et la défense de sa conduite en entraînant ses frères à la guerre. Ces documents ont tous été confiés au Père André et seront sans doute publiés dans quelques temps, mais le Père André refuse de les faire connaître à présent. Personne, de quelque qualité qu'il fut, pouvait passer par la salle de garde pour voir le prisonnier dans sa cellule, les amis immédiats du condamné ne pouvaient pas même l'aborder. Quelques jours avant son exécution il reçut une lettre de sa vieille mère qui l'affected grandement, mais c'est la seule fois qu'il montra des signes de faiblesse pendant toute la durée de sa longue incarcération.\nLa stricte réclusion du prisonnier ne cessa que la veille de son exécution alors que les représentants de la presse associée reçurent la permission de visiter le prisonnier en compagnie du shérif et du commandant de la police montée. Ce fut lorsque le shérif vint lui annoncer officiellement que le mandat d'exécution était arrivé. Il n'y a pas à nier le charme qui se dégageait de toute la personne du condamné. Il anticipait ce qu'allait dire le shérif, lorsqu'il le salua de ces paroles : \"Ah, vous venez avec cette grande nouvelle. Eh bien, je suis content.\"\n\nCes mots furent prononcés lentement, mais très distinctement, regardant le shérif d'un œil ferme et sans la moindre apparence de forfanterie. Il sourit lorsque le shérif lui recommanda de ne pas parler trop longtemps. \"Vous craignez que je parle trop longtemps : que je sois énervé. Oh non ! au dernier moment, je serai ferme.\" Alors il parla français, son langage était entremêlé de patois canadien, qui ne faisait qu'augmenter le charme de sa conversation. Sa barbe était d'un brun foncé taillée avec soin et ses cheveux étaient relevés en arrière de son large front ; l'on pouvait voir quelques boucles sur le front, ce qui contrastait avec les cheveux droits qu'il tenait de sa provenance sauvage. Son nez était légèrement romain et sa peau brune. En le regardant, en observant ses manières, il était facile de se rendre compte de l'influence qu'il exerçait sur son peuple, Riel était un orateur dans toute la force du mot, et il s'est toujours ressenti de son éducation de collège ; ses paroles sont marquées au coin de la perfection et de la grâce la plus parfaite, ce qui établit un grand contraste entre lui et ses frères Métis. Ceux qui l'ont vu la veille de sa mort sont loin de croire à l'accusation qu'on a lancée contre lui, d'avoir manqué de présence d'esprit sur le champ de bataille ou en présence du danger, car rien ne peut donner l'idée de son calme, de sa suavité et de sa nonchalance en recevant la dernière nouvelle.\n\nLe stoïcisme inhérent à la race sauvage, et la bravoure inhérente à la grande race française ne se sont pas démentis un seul instant. À part le Père André qui le visitait constamment, Riel n'a pu voir aucun de ses anciens compagnons, soit politiques, soit de guerre, et si ce n'est ce qu'il a eu sous les yeux, il n'a pas eu le moindre renseignement sur ce qui se passait à l'extérieur.\n\nSes dernières heures furent passées en compagnie de son confesseur qui récitait des prières pour lui, après quoi Riel se coucha et parut dormir d'un profond sommeil. Il s'éveilla de bonne heure le matin et se remit à prier avec ardeur.\n\nÀ huit heures le P. André administra à Riel les derniers sacrements. Il répondit d'une voix calme aux prières, et bien qu'un peu pâle, il était ferme. Il était vêtu d'un habit noir, de pantalons de tweed brun et de souliers sauvages.\n\nEn ce moment parut le bourreau tenant les courroies qui devaient le lier. Il portait un masque sur sa figure. Riel se leva et fut lié par le bourreau.\nLes deux prêtres se tenaient en avant; il marcha alors d’un pas ferme vers l’échafaud en répétant: “Je repose ma confiance en Dieu.” Il marcha la tête haute et le pied ferme sans le moindre tressaillement. Pendant qu’il priaît, en articulant chaque mot; un demi-sourire illuminait sa figure.\n\nAprès avoir franchi quelques degrés, l’infortuné se plaça sur la trappe la figure tournée vers le nord. Le père André et le père McWilliams continuèrent à prier et Riel prononça en anglais les paroles suivantes: “Je demande pardon à tout le monde et je pardonne à tous mes ennemis.”\n\nIl pria quelques temps en français, le moment était venu, le bonnet blanc descendu sur sa figure; chaque prêtre tenait un cierge allumé et récitait les prières des agonisants. À 8.30 heures précises, la trappe tomba, un frissonnement courut dans l’assistance. La corde pendant un moment fut violemment agitée, allant de l’avant à l’arrière puis vibrant.\n\nLa chute fut de 8 pieds.\n\nEn tombant, le corps resta immobile, les genoux se contractèrent violemment deux ou trois fois.\n\nLe corps se balança ensuite quelques instants et Riel était mort. Deux minutes après la chute de la trappe le corps était complètement immobile. Riel était mort, bien mort.\n\nNotes biographiques.\n\nLouis Riel.—Nous n’entreprendrons pas de donner une biographie de Louis Riel, dont les faits et gestes sont bien connus de nos lecteurs, et qui serait trop longue pour le cadre restreint de ce volume. Nous donnerons une simple chronologie, aussi complète que possible. Riel est né à St-Boniface en 1844. Il entra au collège de Montréal en 1856. Il étudia le droit à Montréal en 1865. Il retourna au Manitoba en 1866.\n\nEn 1867 on le retrouve commis dans un magasin de St-Paul, Minnesota. L’année suivante il retournait chez lui à St-Vital, pour s’y livrer à la culture.\n\n1869\n\n29 juillet.—Ce jour fut marqué par le premier meeting des métis et autres citoyens, au Palais de Justice de St-Boniface, pour demander une part de l’argent que la Cie de la Baie d’Hudson allait recevoir du Canada.\n\nLe 19 octobre l’hon. Wm McDougall fut averti de ne pas mettre les pieds au Manitoba et le 20 octobre les partisans de Riel s’assemblaient sur les bords de la rivière Salle pour s’opposer au passage de McDougall, ce dernier retraitait au-delà de la frontière, à Pembina.\n\nLe 3 novembre, les insurgés prenaient possession du fort Garry et le 16 et 17 novembre, 23 délégués s’assemblaient à St-Boniface pour arrêter un programme dans l’intérêt de Riel.\n1er déc.—Proclamation de McDougall contre les insurgés.\n6 déc.—Le gouvernement lance une proclamation d’amnistie.\n7 déc.—Le Dr Shultz et 44 Canadiens faits prisonniers par les hommes de Riel.\n8 déc.—Formation du gouvernement provisoire de Riel.\n\n1870\n\n7 janv.—Le gouvernement canadien demande la médiation de Mgr Taché.\n11 janv.—L’archevêque consent à intervenir.\n14 au 16 fév.—Le major Boulton tente d’organiser une force pour marcher contre Riel. Sir John MacDonald autorise Mgr Taché à proclamer l’amnistie générale et à garantir aux insurgés la protection du gouvernement.\n17 février—Le major Boulton avec 47 autres tombe aux mains de Riel.\n4 mars—Thomas Scott mis à mort.\n9 mars—Arrivée de Mgr Taché à la rivière Rouge. (Dans une lettre du 9 juin, Mgr Taché dit qu’il promit alors au nom des gouvernements impérial et fédéral, aux insurgés en général et à Riel et Lépine en particulier, pleine et entière amnistie pour tout acte illégal par eux commis, y compris la mort de Scott).\n11 mars—L’archevêque rencontre Riel, Lépine et autres et leur promet l’amnistie au nom du gouverneur-général.\n24 mars—Départ du Père Ritchot, du juge Black et de M. A. Scott pour Ottawa comme délégués chargés de dénoncer les réclamations du gouvernement provisoire devant les autorités fédérales.\n11 avril—Leur arrivée à Ottawa.\n17 juin—Leur retour au fort Garry. Le Père donne à Mgr Taché l’assurance que le gouverneur-général et Sir Clinton Murdoch au nom de la Reine avaient promis amnistie pleine et entière.\n24 juin—Rapport des délégués de la rivière Rouge aux représentants de cette région ; le gouvernement provisoire informe le secrétaire d’Etat que le peuple du pays consent à entrer dans la confédération canadienne.\n12 juillet—Lettre de Sir George Etienne Cartier à Mgr Taché, confirmant les déclarations du P. Ritchot relativement à la promesse d’amnistie.\n24 août—Arrivée des troupes du colonel Wolseley au fort Garry\n\n1871\n\n3 octobre—Proclamation du lieutenant-gouverneur Archibald demandant des volontaires pour marcher contre les Fenians.\n4 octobre—Riel, à l’assemblée de St-Vital, exhorte ses amis à aider le gouvernement contre les Fenians.\n7 octobre—Lettre de Riel, Lépine et Parentean à M. Archibald annonçant l’organisation de plusieurs compagnies de Métis pour faire le service contre les Fenians et donnant des assurances de loyauté.\n8 octobre—Le lieutenant-gouverneur accepte leur service et, par l’entremise de son secrétaire d’État, adresse une lettre officielle à Riel et à Lépine, les complimentant sur leur loyauté et leurs bons services. Il passe en revue les troupes de Riel, Lépine et autres et échange publiquement des poignées de mains avec eux. Dans une lettre qu’il adresse à Sir John en cette occasion, il dit que si le gouvernement a une province à défendre et non plus à conquérir, c’est dû à la tolérance ; qu’en poussant à bout les Métis français, O’Donoghue aurait eu contre lui toute la population du pays situé entre l’Assiniboine et la frontière, le fort Garry serait tombé aux mains d’une populace armée et les colons anglais auraient été pillés et massacrés.\n\n27 décembre—Lettre confidentielle de Sir John à Mgr Taché annonçant qu’il avait fait un arrangement au sujet de Riel et contenant une traite à vue pour $1,000 sur la banque de Montréal pour l’aider à quitter le pays.\n\n1872\n\nFévrier—Départ secret de Riel et Lépine, sous la protection de plusieurs hommes envoyés par le chef de police Plainval.\n\n14 septembre—Riel décline la nomination comme candidat à la chambre des communes pour Provencher, et résigne en faveur de Sir Georges Cartier. (Télégramme collectif de Louis Riel, Joseph Royal, A. Lépine et Jos. Dubuc à Sir Georges.)\n\n1873\n\n4 juin—Le gouvernement impérial saisi de la question de l’amnistie de Riel sur ordre en conseil approuvé par Lord Dufferin.\n\n24 juin—Lord Kimberley, secrétaire des Colonies, répond que le gouvernement impérial y consent.\n\nOctobre—Election de Riel à Provencher par acclamation.\n\n1874\n\n22 janvier—Réélection de Riel à Provencher.\n\n28, 29 ou 30 mars—Il signe la feuille d’inscription dans la chambre du greffier de la chambre des communes.\n\n15 avril—Son expulsion de la chambre sur un vote de 25 contre 68.\n\n3 septembre—Il est de nouveau réélu à Provencher.\n\n15 octobre—Riel déclaré hors la loi par la Cour du Banc de la Reine de Manitoba.\n\n1875\n\n12 février—Riel et Lépine amnistiés à condition de passer 5 ans en exil et de perdre leurs droits politiques.\n\n1876—Riel réside à Suncook (N. H.) sous le toit du curé.\n\n1877—Riel à Beauport, où il passe plusieurs mois ; à son départ c’est M. J. A. Langlais qui le conduit en déguisé aux États-Unis.\n1879—Il va se fixer dans la colonie de la rivière du Soleil, au Montana, où il se place comme professeur dans une école industrielle.\n\n1881—Il épouse une métisse, Marguerite-Bellehumeur, fille d'un métis du fort Elliot.\n\n1884\n\n4 juin—James Isbister, Gabriel Dumont, Moïse Ouellette, Michel Dumas, font un voyage de 1,400 milles pour aller à la mission St-Pierre, au pied des Montagnes Rocheuses, pour conjurer Riel au nom des Métis et des colons de la vallée de la Saskatchewan, de revenir avec eux et de leur prêter main-forte pour amener le gouvernement à s'occuper de leurs réclamations. Riel consent, mais après beaucoup de résistance.\n\nJuillet—Il parcourt la région de la Saskatchewan, portant la parole dans des assemblées publiques dans le sens des réclamations des Métis.\n\nSeptembre—Adoption d'un \"exposé de griefs\" à l'assemblée de St Laurent.\n\n1885\n\n20 mars—Dépêche de Prince Albert disant que la révolte est inévitable.\n\n21 mars—Les organes du gouvernement nient la chose.\n\n23 mars—On annonce que la révolte a éclaté.\n\n24 Les organes du gouvernement et le ministre de la Milice nient la chose.\n\n25 mars—Le 90e bataillon et la batterie de Winnipeg reçoivent ordre de marcher.\n\n26 mars—Combat du lac au Canard,\n\n30 mars—Premier convoi de troupes de Toronto.\n\nLe même jour le gouvernement nomme une commission pour les Métis.\n\n31 mars—Meurtre d'un instructeur des Indiens par des Indiens près de Battleford.\n\n1er avril—Départ de M. Royal pour le Nord-Ouest en mission semi-officielle.\n\n2 avril—Massacre des blancs au lac à la Grenouille.\n\n24 avril—Combat de l'Anse au Poisson.\n\n25 avril—Le colonel Otter à Battleford.\n\n2 mai—Combat de Couteau Couplant.\n\n9 au 11 mai—Combat de Batoche.\n\n15 mai—Riel fait prisonnier.\n\n23 mai—Riel logé en prison à Regina.\n\n20 juil.—Procès à Regina devant le juge Richardson et 6 jurés.\n\n1er août—Riel condamné à être pendu le 18 septembre.\n\n10 sept.—L'appel de Riel est rejeté par la Cour du Banc de la Reine de Manitoba.\n\n18 sept.—Un premier sursis est accordé à Riel jusqu'au 16 octobre.\nPourquoi Riel est-il mort ?\n\nPourquoi il est mort ? Parce qu’il était Français. Celui qui écrit ces lignes était un conservateur, mais avant tout un Canadien Français, jaloux du respect dû à son origine et à ses affections. Voilà pourquoi il ne craindra pas de dire la vérité, la vérité nue et toute entière.\n\nTout le monde admet que le vieux chef, Sir John A. Macdonald, s’est trouvé dans une position excessivement critique et embarrassante. D’un côté les députés de la Province de Québec—nous ne disons pas les ministres, on saura bientôt pourquoi ;—d’un côté les députés de la Province de Québec lui déclaraient qu’ils ne pourraient plus le supporter s’il prenait sur lui la responsabilité de l’exécution du prisonnier de Régina ; de l’autre les députés d’Ontario, les amis personnels de Sir John, ses co-nationaux, ses co-religionnaires, ses co-séctaires le pressaient, le harcelaient sans cesse, ne lui laissant ni trève ni repos. “Si Riel n’est pas pendu, lui criaient-ils, nous serons tous battus aux prochaines élections ; il nous faut sa tête ; rien moins que sa vie n’est capable de nous sauver du naufrage.”\n\nEt le vieux tory, qui n’avait jamais encore été aussi embarrassé, ne savait que faire, quelle décision prendre ? Il demandait conseil à ses ministres, particulièrement aux trois ministres français. Ces derniers voulaient épargner Riel ; mais ils paraissaient indécis sur les moyens à prendre pour arriver à cette fin, ils n’osaient, dans leur lâche attachement au pouvoir, prendre une attitude tranchée, décisive ; Sir John comptait sur leur appui même après l’exécution de Riel.\n\n“S’il faut mourir dans la disgrâce, s’est-il dit, après ces longs mois d’indécision et de cruelle attente pour le malheureux prisonnier ; plutôt emporter dans ma tombe la disgrâce et l’exécration de la province de Québec que la disgrâce et le mépris de la province d’Ontario, que la disgrâce et la colère de mes co-nationaux et de mes amis personnels.” De ce moment fut résolu la mort de Riel, l’ordre d’exécution signé et confié à un messager chargé de le remettre lui-même au shérif de Régina en personne.\n\nAprès cela qui osera prétendre que Riel n’a pas été exécuté parce qu’il était français ? Le fanatisme orangiste aurait-il demandé sa mort à si hauts cris si au lieu de s’appeler Riel, le chef des Métis eut porté le nom de Jackson, ou quelqu’autre nom anglais ou écossais ? L’aurait-il réclamé avec cette tenacité de bull-dog, avec cette rage de cannibale si ce n’eût été une partie engagée entre Ontario et Québec, si les Canadiens-Français ne l’eussent réclamé\néomme un des leurs, s'ils n'eussent si instamment demandé qu'on épargnât sa vie au nom de la justice, au nom de l'honneur du Canada, que cette exécution barbare souille à jamais ; au nom de l'humanité, au nom des promesses mêmes du général Middleton qui ont déterminé la victime de Régina à se rendre et à se livrer, quand rien ne lui eut été plus facile que de suivre sur le territoire américain son brave, son intrépide lieutenant, Gabriel Dumont ?\n\nEn un mot le chef de la rébellion serait-il exécuté aujourd'hui s'il eut été un Anglais dans le même état mental que Riel ? Non, il ne serait pas mort ; il ne serait plus même question de sa mort, si jamais personne l'eut réclamée. Il ne serait pas mort, parce que le même jury, le même juge inique, qui a condamné Riel, l'aurait sauvé ; il ne serait pas mort, parce que les mêmes fanatiques enragés qui se gorgent aujourd'hui du sang encore tout chaud de Riel auraient fait commuer sa sentence, si sentence de mort il y eut eu contre lui ; enfin, et surtout, il ne serait pas mort parce que la province de Québec, parce que les Canadiens-Français n'auraient jamais arraché à l'exécutif l'ordre d'exécution d'un aliéné ; parce que les Canadiens-Français n'auraient jamais trempé leurs mains dans le sang d'un condamné politique pour la féroce jouissance de boire du sang anglais, pour la honteuse et avilissante volupté d'assouvir un méprisable instinct de haine et de jalousie nationales ; il ne serait pas mort parce que les Canadiens-Français sont des hommes et que les sectaires d'Ontario sont des bêtes fauves à figure humaine.\n\nMais Riel est mort ; il est mort et il sera vengé. Il sera vengé par la ruine politique de celui qui est en premier lieu responsable de ce meurtre social ; il sera vengé par la ruine politique du chef du gouvernement actuel, Sir John A. Macdonald.\n\nPourquoi Riel est-il mort ?\n\nUne seconde fois, pourquoi Riel est-il mort sur l'échafaud ? Il y est mort, parce que les ministres, sir Hector Langevin, sir Adolphe Caron et M. Chapleau, qui représentaient la province de Québec dans le cabinet — mais qui ne la représentent plus — se sont montrés trop lâches pour le sauver, lorsqu'ils pouvaient le faire.\n\nQuelqu'un nous demandait pourquoi les députés, pourquoi le peuple avait attendu le dernier moment pour signifier au premier ministre qu'il lui retireraient leur appui si Riel était pendu ? Pourquoi ? Mais c'est que députés et commettants se reposaient sur les ministres français et qu'ils attendaient d'eux le signal du mouvement. Si ces ministres n'avaient point tendu leur démission, c'était que Riel ne devait pas être pendu. Mais non. Nos ministres nous avaient trahis ; ils avaient accepté l'exécution du prisonnier, la honte de Québec, sans déposer leur portefeuille et ce n'est que\nle mercredi, 12 novembre, cinq jours avant la consommation du forfait, que les députés, que le peuple apprit qu'il était trahi. Et comment l'apprit-il ? \"Son Excellence le Gouverneur-Général a signé l'ordre d'exécution de Riel, un messager spécial part à l'instant pour Regina où il le doit remettre au shérif en personne.\" C'est le télégraphe qui parlait; c'est le courant électrique qui éclatait comme un coup de foudre sur la tête de Québec, étonnée, stupéfaite d'abord; mais en un moment soulevée, bouleversée du Nord au Sud, de l'Est à l'Ouest, dans une commune explosion d'indignation, dans une même et éloquente protestation.\n\nVingt députés accouraient à la hâte à Montréal; vingt autres à Québec; ceux qui ne pouvaient se rendre protestaient d'avance par le télégraphe. Le vendredi 13 novembre la dépêche suivante partait du Windsor, où s'étaient assemblés les députés conservateurs:\n\nMontréal, 13 novembre 1885.\n\n\"A Sir John A. Macdonald, K. C. B.\n\nOttawa.\n\n\"Dans les circonstances, l'exécution de Louis Riel serait un acte de cruauté dont nous repoussons la responsabilité.\"\n\nAu bas de cette dépêche les signatures suivantes représentant tous les députés du district de Montréal et des districts voisins:\n\nJ. C. COURSOL, Député de Montreal-Est.\nALPHONSE DESJARDINS, Député d'Hochelaga\nD. GIROUARD, Député de Jacques-Cartier.\nF. VANASSE, Député de Yamaska.\nL. H. MASSUE, Député de Richelieu,\nF. DUPONT, Député de Bagot.\nA. L. DESAULNIERS, Député de Maskinongé.\nJ. B. DAOUST, Député des Deux-Montagnes.\nJ. G. H. BERGERON, Député de Beauharnois.\nJ. W. BAIN, Député de Soulange.\nP. B. BENOIT, Député de Chambly.\nED. GUILBAULT, Député de Joliette.\nG. A. GIGAULT, Député de Rouville.\nS. LABROSSE, Député de Prescott.\nL. L. L. DESAULNIERS, Député de Saint-Maurice.\nF. DUGAS, Député de Montcalm.\nH. HURTEAU, Député de l'Assomption.\n\nEt sait-on ce que disait l'un de ces députés le soir même, en parlant des ministres ? \"Si les ministres français, affirmait-il, fussent allés trouver Sir John il y a quinze jours encore, et lui eussent\nsignifié leur sortie du cabinet dans le cas où Riel serait pendu, la sentence eut été commuée. Aujourd'hui il est trop tard ; les députés ne peuvent que protester pour dégager leur responsabilité, en attendant qu'ils renversent le gouvernement par leur vote unanime.\n\n\"Si, à cette heure, la sentence était commuée, cette commutation, Sir John se la serait laissée arracher au dernier moment par l'attitude menaçante de la députation française ; or, le vieux tory n'est pas homme à se rien laisser arracher. Riel sera pendu ; mais aussi Sir John sera battu, et il mourra dans la disgrâce ; car la province de Québec a toujours tenu la balance du pouvoir et elle la tiendra aussi longtemps qu'elle le voudra. C'est ce que le vieux chef semble avoir oublié en prenant la funeste résolution de livrer Riel au bourreau de Régina, ou plutôt aux mille bourreaux d'Ontario qui demandaient sa mort. Sa sureté de coup-d'œil l'a abandonné cette fois ; une terrible expiation lui est réservée : cette faute lui vaudra la disgrâce contre laquelle il se débat depuis trois longs mois.\"\n\nRiel sera vengé ou mieux Québec sera vengé ; vengé par les conservateurs, vengé par les libéraux ; vengé constitutionnellement ; car toute autre vengeance ne le punirait qu'à demi.\n\nMais si la province de Québec veut être vengée comme elle doit l'être, qu'elle surveille ses ministres qu'elle surveille ses députés ! D'abord qu'elle apprenne que les trois ministres français qui sont censés la représenter à Ottawa ne résigneront pas d'eux-mêmes, qu'ils ne résigneront que s'ils sont absolument forcés de le faire. Et si la province de Québec veut les y forcer, il lui faut veiller de ses deux yeux sur chacun de ses députés.\n\nNous rougissons vraiment d'être forcé par l'expérience du passé d'écrire les quelques lignes qui doivent faire la conclusion de ce chapitre. Mais l'intérêt de la cause nationale, la tyrannie des circonstances l'exigent et nous les écrivons :\n\nLes ministre ayant failli à leur devoir en ne résignant pas, quand il était encore temps de sauver Riel par cette démarche, se sentent aujourd'hui perdus irrémédiablement ; ils comprennent qu'en ce moment leur tardive démission ne saurait les racheter qu'à demi.\n\nIls ne résigneront donc pas ; au contraire ils joueront du bâton ; ils tenteront tout pour baillonner une aussi grande partie de la députation de la province de Québec qu'il leur sera possible de circonvenir. Pour cela ils ne reculeront peut-être même pas devant la corruption ; Sir John, les Anglais leur fourniront tout l'argent, les faveurs dont ils auront besoin pour sauver l'administration du naufrage, en d'autres termes pour consommer la honte de la province de Québec.\n\nMais, si, à Dieu ne plaise, une telle ignominie nous était réservée, électeurs de la province de Québec comptez-les bien les indignes représentants du peuple qui oseraient à votre face voter pour conserver, encore quelques temps, le pouvoir à d'aussi méprisables\nministres; comptez-les bien une fois pour ne plus jamais les compter au sein du parlement du Canada. Le jour de la rétribution est proche.\n\nRiel sera vengé.\n\nCanadiens-Français, ne laissons point éclater notre colère maintenant; notre sang s'échauffe et bouillonne dans nos veines; c'est vrai; mais contenons ses ardeurs; toute scène de violence ne pourrait enfin tourner qu'à notre discrédit. Le sang de notre frère crie vengeance; mais le jour de la vengeance ce n'est pas encore arrivé; l'émotion, le désordre, la révolte ne puniraient personne. Au contraire, ils nous ravaieraient aux yeux de nos concitoyens et fourniraient un prétexte de crier contre nous; de proclamer qu'ils ont eu raison de ne point tenir compte du sentiment d'une province de démagogues et de révolutionnaires.\n\nLe jour des élections, voilà le jour de la vengeance; malheur, en ce jour, au candidat qui osera se présenter devant nous avec le titre infâme de ministériel; il aura la honte de ne voir sortir de l'urne pas même un seul bulletin portant son nom. Se trouverait-il un seul canadien français capable de souiller un bulletin du nom d'un homme qui ferait ainsi la honte de notre race. Non; pensons plutôt que la disgrâce de voir un des nôtres endosser la responsabilité de cette ignominieuse exécution ne nous est point réservée, ni aujourd'hui ni au jour des élections.\n\nNi aujourd'hui, disons-nous; on persiste à se demander si nos ministres, qui ont eu la lâcheté de consentir à l'exécution de Riel, ne comprendront pas enfin leur faute et ne tâcheront pas de la réparer autant que possible en retirant à l'instant leur appui au gouvernement, en s'unissant au reste de la députation pour renverser l'indigne administration.\n\nS'ils refusent de le faire; s'ils poussent le mépris de leur race ou l'attachement au pouvoir jusqu'à vouloir retenir des portefeuilles qui font notre honte, qu'ils soient anathèmes; qu'ils tombent anéantis sous le mépris accablant de tous leurs concitoyens; qu'il restent à jamais cloués au pilori de la nation et qu'ils y meurent dans la honte et l'infamie.\n\nQuant à nous, électeurs, encore une fois, restons calmes, mais souvenons-nous, si nous voulons que notre vengeance soit digne de nous. Ce qui frappera au cœur le vieux chef qui a fait pendre Riel, sera de se voir choisi du pouvoir au plus beau jour de sa puissance, de mourir dans l'exécration ou l'oubli, après avoir rêvé d'emporter dans sa tombe l'admiration de tout un peuple, de tous ces concitoyens, Français ou Anglais, partisans ou adversaires. Au jour des élections la voix du sang!!\nLOUIS RIEL.\n\nVox sanguinis fratris nostri clamat ad nos.\n\"La voix du sang de notre frère crie vengeance.\"", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001415.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 19, "total-input-tokens": 26894, "total-output-tokens": 13105, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 83, 1], [83, 1645, 2], [1645, 4539, 3], [4539, 7141, 4], [7141, 10167, 5], [10167, 12765, 6], [12765, 15521, 7], [15521, 18429, 8], [18429, 21444, 9], [21444, 23936, 10], [23936, 26280, 11], [26280, 28559, 12], [28559, 30588, 13], [30588, 33161, 14], [33161, 35940, 15], [35940, 37977, 16], [37977, 40926, 17], [40926, 43492, 18], [43492, 43597, 19]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]