[{"id": "6e7c11f3e3da4e2d35805be5895fc57351697bf4", "text": "MARSH, PUGSLEY & CO.\nLAND BROKERS,\nRegina, N.W.T.\n\nREGINA\nDIRECTORY FOR\n1885.\n\nTHE LAND CORPORATION OF CANADA.\n(Limited.)\n\nThis Company has for Sale\n\n30,000 ACRES OF CAREFULLY SELECTED LANDS,\n\nLOCATED NEAR REGINA.\n\nMany of the Sections are intersected by Buggy and spring Creeks and the Wascana and Qu'Appelle Rivers, which render them most desirable for Mixed Farming.\n\nAlso about 160,000 Acres of Very Choice Railway Lands in\n\nBEAUTIFUL LONG LAKE COUNTRY.\n\nAll the above Lands will be sold in small or large quantities at very Low Prices, and on terms extending over a period of years.\n\nA Railway is now being constructed from Regina to Long Lake, which place is rapidly filling up with a most desirable class of settlers.\n\nFor Information as to prices, etc., apply to the Head Office, Parkwood House, 9 New Broad Street, London, England.\n\nOr to the Office of the Company at Regina, N.W.T.\n\nG. R. PUGSLEY.\nLand Commissioner for the Company.\n\nREGINA LEADER STEAM PRINT.\nLUMBER.\n\nJ. A. MacCAUL,\n\nDEALER IN\n\nLumber,\nLaths,\nShingles,\nSash,\nDoors,\n\nBUILDING, ETC.\n\nSouth Railway Street,\n\nRegina, N. W. T.\nAT THE SIGN OF THE\nBIG PADLOCK\n\n38 and 39 Cornwall Street,\nis the Cheapest and Best Place in Town to buy\n\nSTOVES, TINWARE, SHELF AND HEAVY HARDWARE, BAR LEAD, FENCE WIRE, LAMPS AND LAMP FIXTURES, NAILS, PUTTY, GLASS, PAINTS, OILS, VARNISHES, BRUSHES, GUNS, POWDER, SHOT, CARTRIDGES, etc., COAL OIL AND MACHINE OIL.\n\nROOFING and EAVETROUGHING\nA SPECIALTY.\n\nRepairing Promptly and Neatly Executed. Our Motto is Small Profits and Quick Returns.\n\nSETTLERS' OUTFITS\nAT LOWEST REMUNERATIVE PRICES.\n\nS. SHANNON,\nREGINA, ASSA.\nW. G. PETTINGELL,\nDruggist and Stationer.\n\nTHE FINEST ASSORTMENT OF\nDrugs, Stationery, Patent Medicines, Toilet Articles, &c.\nPERFUMERY\nAnd Sundries in Regina.\n\nSIGN OF THE GOLDEN MORTAR,\nOPPOSITE PALMER HOUSE, BROAD STREET,\nREGINA, N. W. T.\n\nLAFFERTY & SMITH,\nBankers and Financial Agents.\n\nREGINA AND CALGARY.\n\nTransact a General Banking Business. Issue Drafts on and make Collections at all Available Points.\n\nBuy and Sell Sterling and Domestic Exchange.\n\nSpecial Attention given to Collections, and Prompt Returns made by Exchange on Winnipeg.\nSouth Railway Street, Regina\n\nA\nAlmon, G. T. R.\nAldrous, Geo., Teamster,\nArkle, Geo.\nAnson, Bishop,\nAnderson, Robt., Engineer,\n\nBroad Street\nLorne Street\n11th Avenue\nSouth Railway Street\n\nB\nBarton, Alfred, Clerk\nBEACH SAMUEL, Livery Stables,\nBarton, Thos., Inspector of Public Buildings\nBenson, Jas. H., Barrister\nBAYNE, C. H., Merchant, (see card)\nBLACK, Chas. H., Bookseller and stationer, (see card) Broad St.\nBole, D., Druggist\nBonneau P.,\nBishop, Samuel, Carpenter,\nBeirns, Thos., Saddler,\nBell, John, Brewer,\nBranchaud, A. L., Banker,\nBourget, L. O., Dept. Clerk, N. W. C.,\nBrown, Jas.,\nBrown, Geo., Musician,\n\nCornwall Street\nLorne Street\nVictoria Street\nDewdney Street\nBroad Street\n10th Avenue\n\nC\nCovington, Edwin Jos.,\nClark, S. A., Contractor,\nColonization Store Co.,\nCRACK, JAMES, Butcher, (see card)\nChristie, Thos. N., Banker,\nCHATWIN, JAMES N., Tailor, (see card)\nCOTTON, R. B., M.D., (see card)\nCook, Samuel,\nCampbell, J. J.,\nCampbell, J. A.,\nClarke, W. C., Auctioneer,\nCampbell, David F.,\nClarke, Edward,\nCrapper & Co., Painters\nChesterfield, Thos., Clerk,\n\nSouth Railway Street\nBroad Street\n11th Avenue\nHamilton Street\nCornwall Street\nBroad Street\n\nD\nDAVIN N. F., Barrister,\nDoig, Mrs., Windsor Hotel,\nDODD, Henry, M. D.,\n\nSouth Railway Street\nBroad Street\nWILLARD BROS.\n\nSADDLERS.\n\nManufacturers and Dealers in Harness, Saddles, Trunks, Valises, &c.\n\nA LARGE ASSORTMENT OF WHIPS.\n\nSouth Railway Street, Regina, N.W.T.\n\nDr. R. B. Cotton,\n\nSurgeon, Accoucheur, &c.\n\nOffice on Broad Street,\n\nREGINA, N. W. T.\nSouth Railway Street, Regina.\n\nDuncan, Wm., \" \"\nDawson, John, Druggist, \" \"\nDowdney, Edgar, Governor, N.W.T., Dewdney Street\n\nEddy, W. F., Plaster, Scarth Street\nErskine, David, Carpenter, Cornwall Street\nEden, R. G. R., Indian Office, Dewdney Street\n\nFisher, Henry, South Railway Street\nFERGUSON, R. B., Furniture, (see card) \" \"\nFraser, Alex., Dominion Lands Office, Broad Street\nFleetham, Thos. J. Livery and Feed Stables Lorne Street\nFitzsimmons, Thos. J., Painter, Smith Street\nForget, A. E., Clerk, N.W. C., Dewdney Street\nFowler, W. C., Station Agent, C. P. R.\n\nGreenwood, — Land Office, Broad Street\nGibson, F. R., Deputy Sheriff, Victoria Street\nGregg John, South Railway Street\nGrass, John, carpenter, \" \"\nGordon, Robt., blacksmith, Rose Street\nGrassick, George, Scarth Street\nGeorge, John H., Brick Mason, Cornwall Street\nGellispie, D. H., Livery and Feed Stables \" \"\nGilroy, Charles, Albert Street\n\nHarley, Chas., Broad Street\nHANNAM, GEO., Butcher, (see card) \" \"\nHill, John, \" \"\nHunt, William, Tailor, South Railway Street\nHardy, Thos., carpenter, 11th Avenue\nHAMILTON, W. C., Barrister, (see card), South Railway Street\nHamilton, Harry, Cornwall Street\nHoskin, Leslie H., Lorne Street\nHUNTER, FRANCIS J., Manager Bank of Montreal, Victoria St.\nHoskins, Frank, merchant, South Railway Street\n\nIrvine, Jos. C., Postmaster, Victoria Street\nChas. H. Black,\nBookseller and Stationer.\n\nDEALER IN\nWall Paper, Fancy Goods and Musical Instruments\n\nOur Stock Always has Been and will be\nThe Largest, The Best Selected\nand the Cheapest in Town.\n\nMowat's Block - Broad Street.\n\nBank of Montreal.\n\nPaid up Capital $12,000,000. Rest $6,000,000\n\nREGINA, N. W. T.\n\nSTERLING EXCHANGE Bought and Sold.\nCABLE TRANSFERS Made with all Points through the London, England, Branch.\nDRAFTS ISSUED Payable at all Banking Towns in the United States.\nCOLLECTIONS MADE Through our Branches at all Points in the United States, Ontario, Quebec, Manitoba and the Maratime Provinces.\nCURRANT ACCOUNTS OPENED, Deposits Payable on Call.\nFACILITIES OFFERED for the Safe Keeping of Deposits and Transaction of Business by all Classes of Settlers.\nDOMINION GOVERNMENT AND POLICE CHEQUES Cashed at Par.\nSPECIAL ATTENTION To the Collection of Indian Vouchers.\n\nF. J. Hunter, Manager, Regina.\nJames, Charles, Surveyor,\nJohnstone, T. C., Barrister,\nJames, Richard, Carpenter,\nJackson, Jos., Ontario House,\nJamison, Samuel, Carpenter,\nJeffreys, Robert, Teamster,\nJenner, T. A., Merchant,\nJennings, Robt., Well Digger,\n\nKennedy, Henry G., Merchant,\nKERR, J. A., Hardware Merchant,\nKaine Charles, Carpenter,\nKearns, James, Auctioneer,\n\nLaird, James, Clerk,\nLAFFERTY & SMITH, Bankers,\nLambert, J. K.,\nLAMONT, P., Books and Stationary,\nLally, Frank,\nLeJunne, Henry, Merchant,\nLunnan, A. L.,\nLaidlaw, John P.,\nLEADER, THE, (Proprietor, N. F. Davin)\n\nMitchell, Robt., butcher,\nMARTIN, T. E., Lumber Merchant,\nMartin Robt., Druggist,\nMartin, Andrew, Brickmaker,\nMARSH, G. T., C. P. R. Lands Co.,\nMOWT BROS., Merchants,\nMorrison John, Contractor,\nMarshall, John, Waggon Maker,\nMontgomery, Colonel,\nMartin, C. W.,\nMurphy, Daniel, Contractor,\nMelette, Napoleon, Contractor,\nMolson,\n\nMcLellan, J. L.,\nMcCAUL, J. A., Lumber Merchant,\nMcNicol Bros., Flour and Feed,\nCHAS. H. BAYNE,\nDEALER IN\n\nGroceries, Crockery,\nProvisions, Glassware,\n\nSOUTH RAILWAY STREET,\nREGINA, N.W.T.\n\nCHAS. MCCUSKER,\nGENERAL BLACKSMITH.\n\nRepairing in all its Branches. Particular attention paid to Horse Shoeing.\n\nIMPLEMENTS Toronto Light Cord Binder an Mower, Verties' Plough, Back settler and Breaker, Celebrated Chatham Wagon, Light and Heavy Buggies and Buckboards constantly on hand.\n\nHamilton Street, REGINA.\nMcCormick, W. P., Palmer House,\nMcCARTY BROS., Shoemakers,\nMcLachlan, Mrs. S. A., Boarding-house,\nMcCannell, John, Boarding-house,\nMcCannell, D. S., Schoolteacher,\nMcCannell, Arch., Carpenter,\nMcDougall, Donald, Carpenter,\nMcKenzie, Malcolm, Carpenter,\nMcGilvary, Hector, Carpenter\nMcDonald, D. A., Blacksmith,\nMcCrea, John, Contractor,\nMcBrayen, Arch.,\nMcCUSKER, CHAS., Carriage Works,\nMcFarlane, Daniel,\nMcGregor, Rev. D.,\nMcInnes, Alex.,\nMcLeod, Wm., Operator,\nMcLellan, Farquar,\n\nNay, John,\nNUGENT, JOHN, Pacific Hotel,\nNeiley Albert J., Blacksmith,\nNeelands, George, Teamster,\n\nPETTINGELL, W. G., Druggist,\nPATMORE, J. E., Merchant,\nPope, J. C., Asst.-Postmaster,\nPaget, Fred. H.,\nPirrett, Thos.,\nPooley, Rev. J.,\nPUGSLEY, G. R., Land Corporation of Canada, Scarth Street\nPugsley, Charles, Teamster,\n\nROADLEY, JOHN, Merchant,\nReid, D. D.,\nRIDDALL, J. K., Painter,\nREILLY, J. R., Sash and Door Factory,\nRobson, Robert, butcher,\nReid, E. B. Tinsmith,\nRice, George, Plasterer,\nRoss, Hector, Printer,\nRoss, Robert,\nRoss, John, Contractor\nBOOTS AND SHOES\n\nMcCarthy\n\nis the man for Boots and Shoes. Having a thorough knowledge of the trade in all its branches, and having facilities to buy largely in the Ontario Markets, direct from the Manufactories and by securing all discounts by cash purchasers, can retail at almost wholesale prices, also Boots and Shoes made to order.\n\nRepairing Neatly and Promptly Executed.\n\nSIGN OF THE BIG BOOT,\n\nBROAD ST.,\n\nREGINA.\n\nQUEEN CITY\n\nTAILORING HOUSE.\n\nThe Only First-class Tailoring House in the Territories. Noted for Newest Designs and Latest Fashions.\n\nSMITH & CHATWIN,\n\nBROAD STREET,\n\nREGINA, N. W. T.\nSouth Railway Street, Regina.\n\nRoberts, A. R., Watchmaker,\nReid, James, Painter,\n\nSharp, W. P., Barrister,\nSPRAGUE & SCARLETT, Merchants,\nSing Jim, Laundry,\nSteady, Frank,\nSmith, J. W., Merchant,\nSMITH & FERGUSON, Merchants,\nSmith, Edward, Billiard Hall,\nSMITH, A. P. Tailor,\nSelby, J. W.,\nSmith, John, Livery and Feed Stables,\nSmith, Rev. H. Havelock,\nSmith, Gilbert, Blacksmith,\nSCOTT, D. L., Barrister,\nSheppard, Alex, Merchant,\nSoule, Cornelius, Photographer,\nSecord, Sohn, Barrister,\nScorrer, Harry, Teamster,\nSIBBALD & LINDSAY, Merchants,\nSHANNON SAMUEL, Hardware Merchant,\nSLINN, S., Baker,\nSwan, Thos., Land Inspector,\nStephenson, Wm., Dominion Land Agents,\nSteele, M. D., Carpenter,\nSpringett, A. R., Indian Office,\nSellick & Blake, Plasterers,\n\nTinning & Hoskins, Merchants,\nThomas, G. H.,\nThornton, Charles, Carpenter,\nThompson Peter, Carpenter,\n\nUrquhart, Rev. A.\n\nWaldron, Thos. Harness-maker,\nWilliamson, John, Merchant,\nWilson, Charles, Teamster,\nWestbrooke & Fairchilds,\nWILLIARD BROS., Saddlers\n\nBroad Street\nSouth Railway Street\nSouth Railway Street\nSouth Railway Street\nSouth Railway Street\nBroad Street\nLorne Street\nScarth Street\nMcIntyre Street\nSouth Railway Street\nBroad Street\nSouth Railway Street\nCornwall Street\nScarth Street\nLorne Street\nAlbert Street\nSmith Street\nDewdney Street\nLorne Street\nSouth Railway Street\nCornwall Street\nBroad Street\nSouth Railway Street\nCornwall Street\nSouth Railway Street\nD. L. SCOTT,\nBarrister, &c.,\nBROAD STREET,\nREGINA, N.W.T.\n\nREGINA [?] PLANING [?] MILLS.\n— MANUFACTORY OF —\nSASH, DOORS, BLINDS,\nMOULDING, ETC.\nBUILDERS' AND CABINET MAKERS' TURNING.\n\nOrders by Mail or Otherwise receive Prompt Attention.\n\nJ. R. REILLY,\nPROPRIETOR.\n\n1691.\n\nJ. K. RIDDALL,\nCARRIAGE, SIGN AND ORNAMENTAL PAINTER.\nSOUTH RAILWAY STREET, REGINA, N.W.T.\nSouth Railway Street, Regina.\n\nWEBB, GEO. M., Broad Street\nWebb, Ard., \" \"\nWilliams; Richard, Carpenter, \" \"\nWallace, Geo., Scarth Street\nWatson Dixie, Clerk of Court, \" \"\nWhite, Wm. M., N.W.C., Broad Street\nWatkinson, A. J., Lorne Street\nWatson, John, \" \"\nWilliamson, Wm., Confectioner, Broad Street\nWhite, Edward, Brewer, Albert Street\n\nY\nYoung, Thos., \" \"\nYoung, John, Well Digger, \" \"\nYoung John J., Piano Tuner, \" \"\n\nZ\nZindord, M. P., Contractor, Broad Street\n\nBEER DEPOT.\n\nICE CREAM AND FRUIT\nIN SEASON.\n\nWe keep constantly on hand a first-class assortment of Confectionery, Pound and Sponge Cakes, and Pies. Parties desiring Lunches will do well to call.\n\nMRS. J. E. PATMORE,\nBROAD STREET, NEAR WINDSOR HOTEL.\nGENERAL AGENTS\n\nFOR\n\nTHE ONTARIO PUMP CO.\n\n(LIMITED), AND\n\nJNO. ELLIOTT & Son's\n\nCelebrated Machinery and Agricultural Implements. A full line of Pumps, Windmills, Grain Crushers and Agricultural Implements always on hand. We also carry a full stock of Grain, Flour, Chop, Feed, Bran, Shorts and Seeds, which we are prepared to furnish the trade and customers at Bottom Prices. We make a specialty of Ogilvie's Strong Bakers and Patent Process Flours.\n\nSOUTH RAILWAY STREET, REGINA, N.W.T.\nPOSTAL GUIDE.\n\nLETTERS.\n\nRegister all valuable letters.\nIn addressing letters add the name of the County in which the Post Office addressed is situated, if to a city add street and number.\nLetters for the United States should be addressed to the State as well as to the Post Office.\nA letter once posted becomes the property of the person to whom it is addressed, and must be forwarded according to its direction. On no application, however urgent, can be delivered back to the writer, or to any other person.\nLetters containing gold or silver money, jewels or anything liable to Custom duties, cannot be forwarded by post beyond the Dominion, except to the United States.\n\nPRESENCE AND REQUEST.\nCorrespondents to preserve envelopes of delayed letters.\n\nPOSTAGE.\nLetters addressed to Canada and the United States.\n3 cents per ½ oz. or fraction thereof.\nNewfoundland and Great Britain (by Canadian or New York Mail Steamers).\n5 cents per ½ oz. or fraction thereof.\nLetters addressed to Canada and the United States must be prepaid at least one full rate (3 cents), otherwise they will be sent to the Dead Letter Office.\nLetters addressed to places in Canada weighing over ½ oz. and prepaid one full rate, will be forwarded to destination, subject on delivery to double the amount of postage remaining unpaid.\n\nRE-DIRECTED LETTERS.\nLetters re-directed to places in Canada and the United States, without being taken out of the Post Office, are not liable to any additional postage. Send renewal at the end of six months, such being acted on during that length of time.\n\nREQUEST LETTERS.\nLetters addressed to places in Canada and the United States, when sent in envelopes having printed thereon a request from the sender, that the letter if not delivered at the office addressed within a certain time specified in the request, may be returned to his address as printed in the said request, will be returned to the sender by the Postmaster of the office addressed on the expiration of the time specified.\n\nPOST CARDS.\nPost Cards are issued at one cent each, and may be sent to any address in Canada or the United States. Post Cards Cards are also issued at two cents each for transmission to Great Britain, Newfoundland and to all Postal Countries.\nNothing must be attached to a Post Card, nor must the card be cut or defaced in any way.\nReply cards are now ready for the public at two cents each.\n\nPOST BANDS AND STAMP-ED ENVELOPES.\nOne cent post bands for newspapers or book packet wrappers, and one and three cent stamped envelopes are issued by the Department, and may be had at the stamp vendors at a trifle above the face value.\n\nNEWSPAPERS AND PERIODICALS.\nA newspaper or periodical must have no cover, or a cover open at both ends, which can easily be withdrawn. It must contain no enclosure. It must have no writing thereon but the name and address of the person to whom it is sent.\nTransient Newspapers within the Dominion, the United States or Newfoundland, 1 cent per 4 oz. or fraction thereof. A single paper weighing less than one oz. will be forwarded for ½ cent. Newspapers posted for city delivery must be prepaid 1 cent each.\nTo the United Kingdom and all European countries, 1 cent for each newspaper not exceeding 2 oz. A single paper weighing more than 2 oz. will be subject to two or more rates of postage.\nDR. HENRY DODD,\nM.R.C.S., LONDON, ENG.\nLATE SURGEON\nFirst East York Artillery,\nOFFICE:\nOPPOSITE PALMER HOUSE,\nREGINA, N.W.T.\n\nCITY SHAVING PARLOR,\nHAIR DRESSING, SHAMPOONING, ETG.,\nG.M. WEBB, ARTIST,\nBROAD STREET, REGINA, N.W.T\n\nSAMUEL BEACH,\nLivery, Sale and Feed Stable.\n\nFIRST-CLASS HORSES AND RIGS\nALWAYS ON HAND.\nOffices and Stables:\nSouth Railway Street,\nREGINA, N.W.T.\nBOOKS, CIRCULARS, &C.\n\nA Book Packet must be left open for inspection, it must not contain any enclosure, nor must it exceed 24 inches in length nor 12 inches in breadth or depth. The limit of weight of a Book Packet addressed to any place within the Dominion, (except British Columbia) the United States, Newfoundland and Great Britain is 5 lbs., To British Columbia, 2 lbs. 3 oz. Postage to places in Canada, the United States and Newfoundland, 1 cent per 4 oz.; to Great Britain, and other European countries, 1 cent per 2 oz. Circulars are subject to book post rates.\n\nCommercial Papers and Legal Documents may be sent to Great Britain at 5 cents for the first 1 oz., and 1 cent for every additional 2 oz. None of the above mentioned articles can be registered to places in Canada, unless prepaid at letter or parcel post rates.\n\nPARCELS.\n\nParcels are sent to places within the Dominion of Canada (only) and should be plainly addressed, marked \"By Parcel Post.\" The sender's name should be written on the lower left hand corner. A parcel must not contain a letter or any correspondence—postage 6 cents per 4 oz. or fraction of 4 oz.; limit of weight 8 lbs., except to British Columbia, and the North-West, which is 2 lbs. 8 oz. Parcels may be registered—fee 5 cents.\n\nPATTERNS AND SAMPLES.\n\nBona fide Patterns and Samples of Merchandise, not exceeding 24 oz. in weight, may be sent to any place in Canada and Newfoundland at 1 cent per 4 oz. Goods sent in execution of an order, however small the quantity may be, or articles sent by one private individual to another, not being actually Trade Patterns or Samples, are not admissible as such. Samples addressed to places in the United States are subject to a rate of 10 cents each package, which must not exceed 8 oz. in weight. The limit of weight to England, France, Germany, and all other countries in Europe, is eight ounces—postage, 2 cents for the first 2 oz., and 1 cent for every additional 2 oz.\n\nREGISTRATION.\n\nEvery letter and packet intended for registration must be handed in at the window, and a receipt obtained therefor. On no account must it be dropped into a letter box. The registration fee must be paid by registration stamp; the registration fees on letters to places in Canada and Newfoundland is 2 cents; to Great Britain and the United States, 5 cents.\n\nThe sender of a registered letter addressed to any Postal Union Country may entitle himself to a certificate as to the disposal of said letter by the Postmaster at the office addressed, on prepayment of an additional fee of 5 cents.\n\nAll classes of matter may be registered to Postal Union Countries.\n\nRegistration Stamps cannot be accepted in prepayment of postage.\n\nMATTER WHICH CANNOT BE FORWARDED BY POST.\n\nAny explosive, dangerous or destructive substance or liquid, or any matter or thing likely to injure any letter or any other mailable matter, or the person of any officer or servant of the Post Office.\n\nA glass bottle, or glass in any form (except eye-glasses; microscope slides and spectacles when properly put up); liquids, matches, leeches or fruit.\n\nMONEY ORDER OFFICE.\n\nIn sending money by mail it is always best to transmit by Money Order, if possible. If sent by letter, it should always be registered.\n\nMoney Orders issued and paid from 10 a.m. to 4 p.m.\n\nCOMMISSION ON MONEY ORDERS.\n\nOn Money Orders drawn by any Money Order Office in Canada or any other Money Order Office in the Dominion, is as follows:\nSPRAGUE & SCARLETT.\n\nGENERAL SUPPLIES.\n\nSouth Railway St., Regina, N.W.T.\n\nW. C. HAMILTON,\nBarrister, Attorney at Law, Conveyancer, Notary Public, etc.\n\nAGENT FOR\nTHE ONTARIO AND QU'APPELLE LAND COMPANY (Limited.)\nOffice Corner South Railway and Scarth Streets, Regina, N.W.T.\n\nJOHN ROADLEY,\nDEALER IN\nFruits Confectionery and Vegetables etc., etc.\n\nChoicest of the Season Always on Hand.\n\nSouth Railway Street Regina, N.W.T.\n\nREGINA BAKERY,\n\nS. SLINN\n\nAll Kinds of Plain and Fancy Baking Executed.\n\nOrders Receive Prompt Attention.\n\nScarth Street - Regina, N.W.T.\nIf not exceeding $4... 20c.\nOver $4... 10... 60c.\n\" 10... 30... 10c.\n\" 90... 40... 20c.\n\" 40... 60... 30c.\n\" 60... 80... 40c.\n\" 80... 100... 50c.\n\nNo single Money Order, payable in the Dominion of Canada, can be issued for more than $100; but as many of $100 each may be given as the remitter requires.\n\nOn Money Orders payable in the United Kingdom, Newfoundland, the United States, German Empire, Belgium, Norway, Sweden, Denmark, (including Iceland) The Netherlands, (Holland) Italy, Switzerland, Austria, Hungary, Roumania, Jamaica, Barbados, Victoria (Australia), New South Wales, Tasmania, New Zealand and British India, France and Algiers, Egypt, South and West Africa, West Indies, China, Gibraltar, Japan, etc.\n\nIf not exceeding $10... 10c.\nOver $10... 20... 20c.\n\" 30... 30c.\n\" 40... 40c.\n\" 50... 50c.\n\nN. B.—The public are cautioned against doing up book packets in Envelopes notched at the ends or corners. The contents of a book packet must be so tied or fastened up as to permit of being withdrawn for inspection.\n\nDo not place a registration stamp and postage stamps in the same corner of the envelope.\n\nLegal and commercial papers generally (including bank pass-books) are liable to letter rate of postage, except when sent by parcel post. Deeds and insurance policies may, however, be sent at book-post rates.\nTHE PACIFIC HOTEL,\nCorner Broad and South Railway Streets.\n\nNEAREST HOUSE TO O. P. R. STATION.\n\nMeals at all Hours.\nFirst-Class in Every Respect.\n\nBILLIARD ROOM IN CONNECTION.\nTERMS MODERATE.\n\nChoicest Brand of Cigars Ever Smoked, Always on Hand.\n\nJohn Nugent, Prop.\n\nCALL AND EXAMINE\nSHANNON'S\n\nEnglish, German and American Breech Loading Shot Guns.\nThe Finest Guns Ever Brought into the Territories.\n\nSMITH & FERGUSON,\n\nDirect Importers of Hardware, Stoves, Paints, Oils,\nLamps, Sporting Goods, Ammunition, &c.\n\nWRITE FOR QUOTATIONS. SOUTH RAILWAY STREET.\n| Names                  | S. | T. | R. |\n|-----------------------|----|----|----|\n| Anderson, Agustus     | 16 | 15 | 20 |\n| Anderson, George      | 16 | 15 | 20 |\n| Anderson, Fred        | 36 | 15 | 20 |\n| Anderson Robt.        | 36 | 15 | 20 |\n| Arkle, George         | 34 | 17 | 20 |\n| Alexander Wm.         | 24 | 19 | 17 |\n| Anderson, Donald      | 28 | 16 | 18 |\n| Atchinson, Alex.      | 6  | 18 | 18 |\n| Anticknap, Simon      | 18 | 18 | 18 |\n| Allen, John           | 18 | 19 | 18 |\n| Anticknap, Job        | 14 | 18 | 18 |\n| Alexander, Robt. Li.  | 2  | 19 | 19 |\n| Alexander, Robt.      | 22 | 18 | 20 |\n| Amey, James N.        | 18 | 19 | 20 |\n| Amey, Jones           | 18 | 19 | 20 |\n\n| Names                  | S. | T. | R. |\n|-----------------------|----|----|----|\n| Brown, Thomas         | 14 | 19 | 20 |\n| Barker, Charles H.    | 24 | 19 | 20 |\n| Broder, Richard       | 6  | 20 | 20 |\n| Brown, Daniel         | 12 | 20 | 20 |\n| Brown, Thomas         | 12 | 20 | 20 |\n| Broder, George        | 16 | 20 | 20 |\n| Burpee, T. C.         | 20 | 20 | 20 |\n| Boyd Andrew           | 10 | 15 | 20 |\n| Beacon, Henry         | 24 | 15 | 20 |\n| Beach, Solomen        | 28 | 16 | 20 |\n| Benson, Jas. H.       | 28 | 16 | 20 |\n| Beach, Samuel         | 34 | 16 | 20 |\n| Beringer, G. R.       | 14 | 17 | 20 |\n| Bailey, Lavinia       | 6  | 18 | 20 |\n| Burney John           | 14 | 18 | 20 |\n| Brown, James          | 32 | 17 | 17 |\n| Brown, George         | 32 | 17 | 17 |\n| Brown, James Henry    | 32 | 17 | 17 |\n| Boldick, Robt. M.     | 36 | 17 | 17 |\n| Blair, Elsprit        | 4  | 18 | 17 |\n| Bailey, Wm. E.        | 2  | 19 | 17 |\n| Barton, Thos. sr.     | 28 | 19 | 17 |\n| Barton, Thos. jr.     | 28 | 19 | 17 |\n| Bell John             | 30 | 19 | 17 |\n| Beacon, Hamilton      | 4  | 17 | 18 |\n| Briggs, Samuel        | 20 | 17 | 18 |\n| Betteridge John       | 32 | 17 | 18 |\n| Birnie, John          | 28 | 19 | 19 |\n| Boyd, Wm. R.          | 6  | 17 | 19 |\n| Blair, John           | 6  | 18 | 19 |\n| Barton, James         | 12 | 18 | 19 |\n| Boulding, Geo. T.     | 14 | 19 | 19 |\n| Bole James            | 24 | 19 | 19 |\n| Bole Walter           | 24 | 19 | 19 |\n| Brice Wm.             | 32 | 19 | 19 |\n| Brice, S. J. C.       | 16 | 20 | 20 |\n| Bonella, David        | 30 | 20 | 19 |\n| Bonneau, Paschal      | 30 | 15 | 19 |\n| Bonneau, Truffe       | 30 | 15 | 19 |\n| Blyth, David          | 32 | 19 | 18 |\n| Blyth James           | 32 | 19 | 18 |\n| Boyd, Joseph          | 10 | 15 | 20 |\n\n| Names                  | S. | T. | R. |\n|-----------------------|----|----|----|\n| Bruce, Andrew         | 16 | 18 | 20 |\n| Brues, Thomas         | 16 | 18 | 20 |\n| Burns, George         | 28 | 18 | 20 |\n| Brown, J. W.          | 2  | 19 | 20 |\n| Brown, Geo. W.        | 2  | 19 | 20 |\n| Bredin, Thomas        | 12 | 19 | 20 |\n\n| Names                  | S. | T. | R. |\n|-----------------------|----|----|----|\n| Cutforth, Charles     | 2  | 16 | 20 |\n| Campbell, J. J.       | 24 | 16 | 20 |\n| Creamer, J. P.        | 4  | 18 | 20 |\n| Crawford, Wm. M.      | 6  | 18 | 20 |\n| Cornish, T. O.        | 10 | 18 | 20 |\n| Chesterfield, Thomas  | 24 | 17 | 17 |\n| Chesterfield, Goner   | 24 | 17 | 17 |\n| Chesterfield, Wm.     | 24 | 17 | 17 |\n| Cameron, Hugh         | 14 | 19 | 17 |\n| Cooledge, Ann         | 30 | 16 | 18 |\n| Collins, Samuel       | 36 | 17 | 18 |\n| Cowan, Robert         | 32 | 19 | 18 |\n| Chapman, James        | 30 | 14 | 19 |\n| Chatwin, James N.     | 26 | 16 | 19 |\n| Campbell, John        | 36 | 16 | 19 |\n| Campbell, John        | 2  | 17 | 19 |\n| Campbell, David       | 2  | 17 | 19 |\n| Campbell, John        | 12 | 17 | 19 |\n| Child, Wm. M.         | 32 | 17 | 19 |\n| Child, John           | 32 | 17 | 19 |\n| Cown, Jas.            | 36 | 17 | 19 |\n| Collins, J. W.        | 4  | 18 | 19 |\n| Chambly, Johni        | 4  | 19 | 19 |\n| Clark, S. A.          | 22 | 19 | 19 |\n| Covington, Edwin Jos. | 34 | 19 | 19 |\n| Cookwill, Thos.       | 4  | 18 | 19 |\n| Christie, Joseph N. H.| 18 | 17 | 19 |\n| Cameron; Henry Taylor | 24 | 18 | 18 |\n| Cameron, Malcolm G.   | 32 | 12 | 20 |\n| Condie Robert         | 30 | 18 | 20 |\n| Cullum, William C.    | 4  | 19 | 20 |\n| Cullum, Charles E.    | 4  | 19 | 20 |\n| Cooper, Robert        | 28 | 19 | 20 |\n| Catley, Mark          | 14 | 20 | 20 |\n| Clapp, Joel           | 18 | 20 | 20 |\n| Currie, Samuel        | 12 | 21 | 20 |\n\n| Names                  | S. | T. | R. |\n|-----------------------|----|----|----|\n| Debbie, Wm. jr.       | 32 | 20 | 19 |\n| Donaldson, W. H.      | 12 | 17 | 20 |\n| Dickson, Andrew R.    | 28 | 17 | 17 |\n| Downey, Artlur        | 22 | 19 | 17 |\n| Dunfield, James       | 14 | 18 | 18 |\n| Dowd, George          | 16 | 18 | 18 |\n| Duncan, Wm.           | 28 | 16 | 19 |\n| Dunnett, Alex         | 32 | 16 | 19 |\n| Dunnett, Alex. Budge  | 32 | 16 | 19 |\n| Doyle Thomas          | 24 | 17 | 19 |\n| Daymond, Thomas J. S. | 18 | 18 | 18 |\n| Davis, Thomas         | 24 | 18 | 20 |\n| Davis, William        | 24 | 18 | 20 |\n| Draper, Joel          | 24 | 19 | 20 |\n| Doull, George         | 34 | 20 | 20 |\nFOUND AT LAST.\n\nThe Cheapest and Best Selected Stock of Books, Stationery and Fancy Goods. Also pure Confectionery, Green and Dried Fruits, and the Choicest Brands of Cigars.\n\nWHERE?\n\nAT\n\nP. LAMONT'S,\n\nSign of the BIG BOOK, South Railway Street, Regina, N.W.T. The News Department is replete with all the Leading Canadian and American Newspapers, Magazines, etc., etc. Particular care taken to accommodate customers and every article required by the great reading public, if not on hand, furnished at the shortest notice.\n\nFURNITURE\n\nR.B. FERGUSSON\n\nOffice and saleroom, South Railway Street, Regina. The Largest and Best Assorted stock of Furniture in the Territories, consisting of bedroom and parlor suites, sofas, easy chairs, mattresses, spring pillows and chairs of every description from 70c. up. Beds, ash panel, $3.25. Cheapest and best bed in the west. Also a well assorted stock of carpets, Brussels, tapestry, stair, oil-cloth and rag carpet, made of new rags, expressly for this trade, 75c. per yard. Parties requiring furniture will save money by writing for price list and catalogue before purchasing elsewhere. All letter orders receive prompt attention. Goods for shipment carefully packed. Our motto is\n\nSmall Profits & Quick Returns.\n| Name                  | Code |\n|-----------------------|------|\n| Ewing, John           | 20   |\n| Ewing, W. G.          | 30   |\n| Ewing, Charles        | 30   |\n| Elliott, Thomas       | 32   |\n| Evetta, F. W.         | 32   |\n| Eden, R. G. R.        | 10   |\n| Edgar, Samuel         | 22   |\n| Edgar, Martin R.      | 28   |\n| Elliott, Wm.          | 18   |\n| Evoy, William         | 4    |\n| Evoy, Matthew         | 34   |\n| Edwards, George D.    | 4    |\n| Elliott, Samuel       | 10   |\n| Evoy, Matthew sr.     | 34   |\n| Ewing, John L.        | 30   |\n| Erskine, David M.     | 2    |\n| Fleetham, Thos. J.    | 12   |\n| Fisher, John          | 10   |\n| Fisher, John          | 18   |\n| Fizard, John A. F.    | 34   |\n| Freebotn, Andrew W.   | 30   |\n| Forsyth, Henry G.     | 28   |\n| Forbister James       | 36   |\n| Ferguson William      | 2    |\n| Flemming George       | 16   |\n| Freathy William       | 6    |\n| Foulton, Albert       | 12   |\n| Fox, C. F.            | 28   |\n| Fitzsimmons Thomas    | 2    |\n| Furnise, William      | 34   |\n| Fisher, James W.      | 23   |\n| Fisher, Peter         | 30   |\n| Gore, William J.      | 4    |\n| Gregg, Samuel B.      | 18   |\n| Gordon Benjamin       | 6    |\n| Greenwood, J. F.      | 24   |\n| Grubbe, W. C.         | 16   |\n| Gilroy, Charles       | 30   |\n| Groh, Henry           | 34   |\n| Griffin, Aaron        | 18   |\n| Gilbert, Josiah       | 34   |\n| Gilbert, Herbert      | 2    |\n| Gillies, Hugh         | 4    |\n| Gillies, Wm. G.       | 10   |\n| Gillies, Donald       | 12   |\n| Gillies, Alexander    | 12   |\n| Grassick, George      | 92   |\n| Gellispie, D. H.      | 10   |\n| Gore, Thomas A.       | 32   |\n| Gore, David           | 4    |\n| Gregg, Thomas         | 18   |\n| Gore, T. S.           | 18   |\n| Green, Robert         | 20   |\n| Gregg, William        | 18   |\n| Hamilton, Wm.         | 13   |\n| Horton, Henry         | 28   |\n| Helm, Henry P.        | 14   |\n| Hopekirk, William     | 18   |\n| Howson, J. H.         | 36   |\n| Hamilton, W. C.       | 10   |\n| Haverty, Michael      | 14   |\n| Hants, William        | 20   |\n| Hawks, John H.        | 22   |\n| Hamilton, Wm. Henry   | 32   |\n| Hyland, Daniel        | 18   |\n| Hay, Arthur           | 28   |\n| Hugheson, William     | 30   |\n| Hugheson, George L.   | 28   |\n| Herring, Walter       | 23   |\n| Hall, Chas.           | 36   |\n| Henry, Frederick      | 34   |\n| Hall, Charles jr.     | 36   |\n| Head, F. G.           | 4    |\n| Healy, F. Benemer     | 20   |\n| Ingersoll, Marshall   | 18   |\n| Johnstone, Alexander  | 34   |\n| Johnstone, David F.   | 2    |\n| Jolly, David F.       | 4    |\n| Jennings, Robt. A.    | 30   |\n| Jarvis, Thos. H.      | 30   |\n| Jamison, Samuel       | 4    |\n| Jones, Arthur         | 16   |\n| Johnstone, T. C.      | 20   |\n| Johnstone, David      | 12   |\n| Jeffrey, Donald       | 6    |\n| Killen, John          | 18   |\n| Kelly, Peter B.       | 22   |\n| Kennedy, George       | 2    |\n| Kennedy, J. D.        | 20   |\n| Kirby, William J.     | 32   |\n| Kitely, Benjamin W.   | 32   |\n| Keirl, Thos.          | 18   |\n| Kerr, John            | 16   |\n| Kincaid, James        | 20   |\n| Kerr, Thomas C.       | 14   |\n| Kerr, Robert          | 32   |\n| Kerr, J. A.           | 14   |\n| Kerby, Charles        | 36   |\n| Kerby, Robert         | 36   |\n| Kerby, William H.     | 2    |\n| Lambert, Richard J.   | 34   |\n| Lambert, Geo. M.      | 10   |\n| Lambert, William      | 12   |\n| Lambert, W. A.        | 10   |\n| Name                  | Quantity |\n|-----------------------|----------|\n| Lambert, H. R.        | 16       |\n| Laird, James G.       | 18       |\n| Lineham Angus         | 36       |\n| Lambert, Charles P.   | 12       |\n| Leepoit, Robert N., Jr.| 12      |\n| Louis, Thomas H.      | 34       |\n| Lytle, John Shields   | 14       |\n| Lytle, John           | 12       |\n| Lytly (George Lowery) | 16       |\n| Lewtas, William       | 22       |\n| Lowery, George        | 22       |\n| Lennox, William       | 30       |\n| Lytle, Thomas J.      | 28       |\n| Lauder, James         | 14       |\n| Lambert, J. K.        | 20       |\n| Lennox George         | 34       |\n| Lambert, Margaret     | 26       |\n| Lucas, George         | 30       |\n| Mitchell, Robert      | 24       |\n| Mitchell, James       | 24       |\n| Manning Edward        | 32       |\n| Minty James           | 10       |\n| Morrison, John        | 4        |\n| Mann Matthew          | 10       |\n| Moran, James P.       | 34       |\n| Middleton, Alexander  | 16       |\n| Morton, William Charles| 10    |\n| Martin, Andrew        | 32       |\n| Montgomery John A.    | 16       |\n| Malcolm, Hector       | 14       |\n| Morton, Alva          | 34       |\n| Moore, Robert         | 34       |\n| Moore, James          | 34       |\n| Martin, T. E.         | 36       |\n| Mallory, John C.      | 26       |\n| Montgomery, James     | 2        |\n| Montgomery, W. F.     | 10       |\n| Montgomery, W. H.     | 16       |\n| Mollard, George S.    | 30       |\n| Mollard, Wm. T.       | 32       |\n| Macintosh, Kenneth    | 30       |\n| McLean, Alexander     | 2        |\n| MacCaul, Jno. H.      | 20       |\n| McLean, Thomas F.     | 10       |\n| McTaggart, John       | 34       |\n| McNichol, Thomas      | 34       |\n| McKell, Robert        | 4        |\n| MacCaul, J. A.        | 10       |\n| McLeod, Laughlin      | 16       |\n| McDonald; Duncan      | 38       |\n| McLennan, R. R.       | 14       |\n| McCrea, John          | 30       |\n| McIlveen, Jane        | 6        |\n| McCallum, D. A.       | 12       |\n| McInnes, Malcolm      | 14       |\n| McLachlan, Sarah Ann. | 6        |\n| McMichael William     | 36       |\n| McCarthy, Edward      | 6        |\n| McFadyen, Donald      | 12       |\n| McDougall, Daniel     | 12       |\n| McDonald, Malcolm     | 12       |\n| McKay, Donald         | 16       |\n| McClure, Andrew W.    | 18       |\n| McFarlane, Matthew J. | 18       |\n| McLaren, Donald       | 20       |\n| McLen, Donald         | 24       |\n| McLan, Hugh           | 24       |\n| McDermid, Malcolm     | 30       |\n| McLean, Roderick      | 12       |\n| McLachlan, James C.   | 20       |\n| McInnes, Sarah        | 22       |\n| McFadyen, John        | 16       |\n| McFadyen, Hector      | 22       |\n| McBrayen, Arch        | 12       |\n| McDonald, Allen       | 22       |\n| McCannel, Arch        | 10       |\n| McCannell, Donald     | 14       |\n| McCannell, Neil       | 16       |\n| McCannell, Jno        | 10       |\n| McDougald, Donald     | 14       |\n| McGilvary Hector      | 16       |\n| McKay, Hugh           | 20       |\n| McCusker, Charles J.  | 22       |\n| McCormick, W. P.      | 4        |\n| McCallum, John        | 22       |\n| McFadyen, Daniel      | 24       |\n| McCallum, Arch        | 23       |\n| McEwan, Wm.           | 38       |\n| McFadyen, Malcolm     | 34       |\n| McElree, Henry        | 36       |\n| McIntosh, Peter       | 20       |\n| McLennan, Farquhar    | 6        |\n| McNiece, George W. A. | 20       |\n| McGregor, James       | 20       |\n| McEwan, Duncan        | 22       |\n| McNeice, Thomas J.    | 34       |\n| McLennan, Alexander   | 36       |\n| McLeod, John J.       | 36       |\n| Nugent, John          | 6        |\n| Napper, James R.      | 4        |\n| Neily, James Alburn   | 6        |\n| Neison, William       | 16       |\n| Napper, Robt. A.      | 18       |\n| O'Connor, John        | 34       |\n| Ovmiston, Andrew      | 32       |\n| Park, William         | 34       |\n| Patton, Geo. C.       | 20       |\n| Pitbladc, William     | 28       |\n| Portice, Richard      | 10       |\n| Pollock, William      | 28       |\n| Phelen, Walter        | 30       |\n| Pumphrey, Rebt.       | 10       |\n| Pugsley, Charles R.   | 18       |\n| Palmer, Warden        | 18       |\n| Palmer, Lewis         | 18       |\n| Parlow, William M.    | 20       |\n| Purdy David, A.       | 22       |\n| Petty James G.        | 26       |\n| Name                  | Price |\n|-----------------------|-------|\n| Purdy, R. E.          | 28    |\n| Pepper, Harriet       | 30    |\n| Pepper, William       | 32    |\n| Petrie, John E.       | 34    |\n| Paisley, David        | 23    |\n| Ross, John            | 24    |\n| Robertson, David J.   | 6     |\n| Ruthven, Ed. S.       | 20    |\n| Roadley, John         | 30    |\n| Richardson, W. A.     | 16    |\n| Ross, John L.         | 32    |\n| Russell-W. E.         | 2     |\n| Riddell, Frederick    | 14    |\n| Rouson, Henry         | 30    |\n| Russell, James        | 34    |\n| Russell, Wm.          | 34    |\n| Robertson, Peter      | 30    |\n| Rodgers, Robt.        | 4     |\n| Rodgers, Thomas       | 4     |\n| Rice, James           | 34    |\n| Reid, David D.        | 6     |\n| Rose, Robt., J.       | 4     |\n| Rigby, Jonathan       | 18    |\n| Robertson, James      | 28    |\n| Rolson, Robt.         | 30    |\n| Ruthven, Henry        | 30    |\n| Rigby, Robert         | 12    |\n| Rice, George B.       | 24    |\n| Reid Duncan           | 6     |\n| Reid, E. B.           | 20    |\n| Rigley, Edward        | 32    |\n| Stewart, James N.     | 22    |\n| Scorrer, K. Henry     | 12    |\n| Sinton, Robert        | 34    |\n| Shera, John           | 26    |\n| Skelding, George      | 2     |\n| Sturgeon, Robert      | 18    |\n| Surgeon, Jane E.      | 18    |\n| Simpson, John         | 10    |\n| Smith, Thomas B.      | 16    |\n| Somers, John          | 22    |\n| Smibert Wm. W.        | 32    |\n| Sturgeon, Joseph J.   | 36    |\n| Smibert, George H.    | 2     |\n| Smyth, John           | 10    |\n| Smith, Edwy, Lincoln  | 10    |\n| Stewart, John         | 30    |\n| Southerland Daniel    | 10    |\n| Smith, Geo. P.        | 6     |\n| Smith Albert P.       | 6     |\n| Strain, William       | 28    |\n| Strain, Joseph H.     | 34    |\n| Strain, Herbert       | 34    |\n| Smith, John F.        | 32    |\n| Stinson Thomas        | 34    |\n| Sprague, James E.     | 24    |\n| Sheppard, Alex        | 14    |\n| Safrey, William       | 24    |\n| Stibbing, Thomas, B.  | 28    |\n| Snibert, James        | 10    |\n| Simpson, Charles      | 32    |\n| Stewart, Charles      | 6     |\n| Stewart, Daniel       | 6     |\n| Stewart, Peter        | 10    |\n| Secord, John          | 16    |\n| Smyth, Thomas         | 26    |\n| Steele, Alexander     | 30    |\n| Steele, Anthony       | 30    |\n| Southerland, Kenneth  | 24    |\n| Smith, Archibald      | 18    |\n| Smith, Jonas H.       | 2     |\n| Steady, Francis H.    | 28    |\n| Stewart, David M.     | 36    |\n| Stewart, Charles E.   | 36    |\n| Sneiby, James         | 6     |\n| Seed, Moses           | 2     |\n| Seed, Johnston        | 4     |\n| Scott, William M.     | 4     |\n| Smith, J. W.          | 10    |\n| Smith, George K.      | 10    |\n| Seed, W. A.           | 14    |\n| Sutton, Isaac H.      | 16    |\n| Shields, Richard      | 30    |\n| Thomas, Philip        | 24    |\n| Terry, Richard        | 16    |\n| Todd, William         | 20    |\n| Trotter, Lewis H.     | 36    |\n| Trotter, Albert J.    | 36    |\n| Thompson, Peter       | 22    |\n| Thompson, Joseph      | 30    |\n| Taylor, Alfred        | 22    |\n| Taylor, F. H.         | 28    |\n| Traynor, Adam         | 10    |\n| Valentine, Edward     | 4     |\n| Whitaker, F. A.       | 20    |\n| Whitaker, R. J.       | 20    |\n| White, Edward         | 24    |\n| Wait, Thomas          | 16    |\n| Waite, William        | 28    |\n| Woodward, D.          | 36    |\n| Woodward, Elwin       | 36    |\n| Wilson, Thomas        | 20    |\n| Watts, James Philip   | 28    |\n| Waters William        | 32    |\n| Woodward, Jos. W.     | 36    |\n| Williamson, William   | 16    |\n| Williamson, John      | 28    |\n| Williamson, David     | 28    |\n| Williard, Geo. W.     | 10    |\n| Whitney, William H.   | 12    |\n| Whitney, Charles L.   | 12    |\n| Name               | Age | Height | Weight |\n|--------------------|-----|--------|--------|\n| Waldron, Thomas A  | 36  | 16     | 19     |\n| West, William      | 16  | 18     | 19     |\n| Watson, Thomas     | 30  | 19     | 19     |\n| Wylie, Joseph      | 32  | 19     | 20     |\n| Weeks, Edward G    | 12  | 16     | 18     |\n| Whitaker, Henry J  | 30  | 16     | 19     |\n| White, William     | 16  | 19     | 18     |\n| Young, Thomas      | 28  | 17     | 20     |\n| Young, Frederick   | 34  | 19     | 19     |\n\nAt Smith & Ferguson's you will find any Article of Hardware to be had at Best City Stores.\nProgress of the Queen City of the West.\n\nREGINA.\n\nBY A. S.\n\n(Communicated to the Leader.)\n\nIn the Summer of 1882 His Honour Lieutenant Governor Dewdney fixed on the spot where the railway would intersect Pile of Bones Creek as the site of the capital of the North-West. Many persons had been anxious to find out where the capital would be and a number of enterprising gentlemen, known in history as the Regina Squatters, had pitched their tents here and taken up land. We utterly disapprove of the policy, endorsed by both parties, of a Government trying to make the last penny out of town sites. This is strengthening the head at the expense of the extremities. We think it a pity the Squatters were not allowed to have their land. In the end the Government would have had as much and more, a number of intelligent and enterprising men would have been saved two or three years suspense and Regina would have more substantial citizens than she has.\n\nThe moment the site was fixed on the pioneer trader appeared with tent stores and tent hotels. For some time Regina was the end of a division and there was not less than twenty mile of siding north of the present track. In addition to the trader and the genuine settler there was a large fluent population of a speculative class. In the Autumn of 1882, Mr. W. B. Scarth, and his brother; Sir Roderick Cameron of New York; the Honourable Mr. Vernon (Son of Lord Vernon); Dr. Rae the Arctic explorer; the Lieutenant Governor of Ontario, and the present proprietor of the Leader, came up to the North-West in a special car for the purpose in part of holiday, and when they looked out in the morning on Regina they saw a lot of tents, some on what is now known as South Railway Street, others on the present gore. The Criterion which was run by \"Major Granville,\" a scion of the English nobility, was considered the leading hotel and in this tent the visitors had dinner, and invited the principal inhabitants to be present. The nephew of an Earl waited on that occasion and when one of the visitors said:—\"These seem very gentlemanly waiters,\" the reply was, \"I should think they are. Those are the nephews of the Earl of ———.\" At the dinner it was suggested in fun that Mr. Davin should start a paper here, and the suggestion was thought a good joke. However, he grew fascinated with the country and considered the proposal and the result was that on the 1st of March 1883 the Leader was started, a seven column paper with a circulation to begin with of 7,000. An elaborate plant for job and newspaper work—the finest in the North-West—had been put in and the presses were run by steam. Owing to the removal of the end of the division to Moose Jaw that circulation was not kept up but the paper has at present a larger circulation than all the other papers in the North-West put together. There is no paper in the Dominion of Canada better established or more widely quoted. It is a power. It was owing to its advocacy that the Capital was not moved away from Regina; that the mill Belt was thrown open for settlement; that Southern Manitoba was reopened; that the settlers around Regina and the other town sites along the line were fairly and liberally dealt with; that an appeal was secured from the decisions of ignorant magistrates; that the doubt on the power of municipalities in the North-West to levy and collect taxes was removed. The Leader has led the agitation for representation. Its criticisms on the Mounted Police have greatly tended to bring that body into a state of efficiency; nor is there a wise measure in the interest of the North-West, that it has not advocated. It has been the fearless exponent of settlers rights and every man who has felt aggrieved\nno matter by whom has had its columns open to him, and, if wronged, its advocacy at his command. It was owing to its exertions that the land was obtained from the Government for the Railway north from here to Long Lake, without which the money could not have been had, and therefore to the Leader we are in part indebted for that north-going Railway. Thousands of volumes have been printed and bound by the Leader Company. During the war a special edition was published daily with full telegrams from the seat of war. During the recent trials a full report of them was given daily. A paper with the same recognized influence was never before issued from so young a place as Regina or from any city with ten times its population.\n\nIn those early days the largest tent was that of Mr. J. J. Campbell. Mr. McCormick, who now keeps the Palmer, kept an hotel on South Railway Street; and the hotel now known as the Windsor faced the Station and was known as the Royal.\n\nAmongst the very first merchants were Mowat Bros., the \"Pioneer Store,\" now, one of the most prosperous firms in the city. Smith and Ferguson, whose hardware business has become so extensive as to require several new buildings for the accommodation of their immense stock, are now one of the leading wholesale firms in the North-West. John Dawson's City Drug Store is one of the finest in the Dominion. A visitor shown through the extensive buildings by the gentlemanly manager, Mr. David Bole, is at once impressed with its extent and prosperity. Near it in the same block and in the same line is the handsome store of Mr. Pettingell. Next we have Mr. Samuel Shannon, of the \"Famous Padlock,\" whose excellent workmanship and steady attention to business rank him amongst our leading firms in his line. Mr. J. A. Kerr is one of the first hardware merchants in Regina. Mr. Charles Black has steadily come to the front and is perfectly satisfied as to the future prosperity of Regina—and his business. McCarthy Bros. have been forced to enlarge their boot and shoe manufactory, to meet the demands of our rapidly increasing population. Messrs. Smith and Chutwin, of the Queen City Tailoring House, are kept only too busy. Our old friend the \"Pioneer watchmaker of the North,\" Mr. W. R. Roberts, came, but went again, and his place is well filled by Mr. John Stemshorn. Mr. J. J. W. Smith, in the hardware line, has prospered beyond his most sanguine anticipations. Sprague and Scarlett have found it necessary to enlarge their store, which, taken with the numerous customers seen daily issuing therefrom, is a sure token of prosperity. Mr. James R. Riddal is meeting at every turn with the success his skill as a painter richly deserves. The Colonization Store Co. wears that happy and radiant countenance, which is always expressive of pleasing results. Mr. P. Lamont, finding his former store somewhat small for his rapidly increasing business, removed to more spacious buildings. The new sign which overhangs his door has an air of prosperity in its gentle swinging to and fro, which is corroborated upon entering his exceedingly well furnished store.\n\nWillard Bros., who have kept steadily along the path of fortune, have now the finest harness emporium in the North-West. Sibbald and Lindsay are thorough business men, and upon reviewing their business prosperity, we cannot fail to see their successful enterprise on every hand. Mr. R. B. Ferguson's furniture department is unsurpassed by any west of Winnipeg. McNicol Bros. are our latest acquisition, and from the confident air worn by them it is evident they have no cause to regret opening a business in our midst. Nor must we forget our celestial friends, who on Saturdays may be seen meandering along the streets with a bundle of linen and a smiling countenance, in anticipation of the shekels to come.\n\nRegina has grown beyond anything that\ncould have been anticipated a year ago. Scarth street is well filled up with resident houses and a new post office. On Hamilton street Mr. McCusker's establishment was some time ago the only one. Now Mr. Glass is building and Mr. McKay will be doing so in a few days. Mr. Reid, Mr. Fraser, and Judge Richardson have built handsome houses to the south of Victoria street. A footpath up Hamilton street will soon follow.\n\nRegina is a great legal camp and has already been the scene of a great state trial—that of Riel. It is also the seat of a bishop of the English Church, while the other Christian bodies flourish. A beautiful Church has been erected by the Presbyterians in Scarth street. The jail on the north shore of the Wascana is now practically complete—a fine building.\n\nTHE COUNTY SURROUNDING REGINA.\n\nThe country for forty miles around Regina, is now widely known, to be one of the richest wheat growing countries in the world. The soil which is so admirably adapted to the raising of crops, is from six to fourteen feet in depth, slightly undulating, and of a nature that retains the heat. The water supply is abundant. To the south is the Wascana river, and to the north is the clear and sparkling Boggy Creek which is a stream of pure spring water. Water can also be obtained anywhere on the prairie at a depth of from 24 ft. to 100 ft. Wheat and oats can be sown in some places in the beginning of March, and by the 15th of April seeding is universally completed. The yield of wheat is from thirty to forty-five bushels to the acre on broken and backset land. Oats will yield seventy-five bushels to the acre. The land to the north is well adapted for the raising of all root vegetables. We have frost in September, and farmers who through negligence or otherwise sow their grain late are the only ones who suffer. The nature of the soil is such, that, even if the crop is sown late, it is bound to grow, yet it leaves it too late for ripening, and this is the only chance for grain to get frozen in the field. Now that the Long Lake and Prince Albert branch of railroad is under rapid construction—the starting point being from the Queen City of Regina—we may look forward to a fast development of the great stretch of country to the north. In a very short time we shall see flourishing industries on all sides. Farmers may rest assured of a home market for their produce.\n\nThe troops—which were drawn from every part of the Dominion—have returned to their respective homes, and around the fireside tell strange and wonderful truths of the beauty, fertility prosperity and future greatness, of the vast North-West. We have now a living advertisement throughout the length and breadth of the land. Doubts—if any were entertained—are dispersed, and confidence dwells in the heart of every man as regards the future prosperity of our land.\n\"THE LEADER.\"\n\nA Family Paper,\n\nTHE\n\nFarmer's Friend,\n\nThe Stout Advocate of North-West Interests!\n\nThe Foremost Paper in the TERRITORIES!\n\nOne of the Best Written Papers on the Continent.\n\nThe Leader Office has three Presses constantly at work. The finest Book and Job Office west of Winnipeg. All the Latest and best Machinery.\n\nSUBSCRIPTIONS $2.00 PER ANNUM IN ADVANCE.\nT. MARTIN,\n\nDEALER\n\nIN\n\nall Kinds\n\nOF\n\nBUILDING\n\nMATERIAL\n\nCor. South Railway\n\nand Cornwall Streets,\n\nRegina, . . . N. W. T.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001530.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 33, "total-input-tokens": 49168, "total-output-tokens": 16492, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 971, 1], [971, 1102, 2], [1102, 1621, 3], [1621, 2169, 4], [2169, 3443, 5], [3443, 3693, 6], [3693, 5045, 7], [5045, 5960, 8], [5960, 6918, 9], [6918, 7342, 10], [7342, 8381, 11], [8381, 8988, 12], [8988, 10415, 13], [10415, 10779, 14], [10779, 11496, 15], [11496, 11986, 16], [11986, 15310, 17], [15310, 15686, 18], [15686, 19144, 19], [19144, 19709, 20], [19709, 21036, 21], [21036, 21594, 22], [21594, 26687, 23], [26687, 27940, 24], [27940, 31438, 25], [31438, 35876, 26], [35876, 39718, 27], [39718, 40327, 28], [40327, 44052, 29], [44052, 47919, 30], [47919, 50771, 31], [50771, 51144, 32], [51144, 51268, 33]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, true, true, true, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]