[{"id": "d0dde3065f6fff174c616373e419ac80d88255d9", "text": "\"I consider it the best and purest Fife Wheat to-day in the Northwest. No such milling wheat has been received at our mills since we have been in the milling business.\"\n\nCHAS. A. PILLSBURY\nOf the Pillsbury Flouring Mills, Minneapolis.\n\nTHE SASKATCHEWAN FIFE WHEAT\n\nA History of this Remarkable Grain from its First Importation from the Saskatchewan Valley in Manitoba, till the present time.\n\nBY ITS ORIGINATOR,\n\nW. J. ABERNETHY.\n\n\"In my judgment, the yield on all our wheat farms can be increased from five to fifteen bushels per acre by its use for seed.\"\n\nE. D. PORTER,\nProf. of Agriculture, Minnesota State University.\n\nBefore me personally came T. S. Edison, of Larimore, Grand Forks County, Dak., who deposes and says that during the past season of 1884 he raised upon his farm at Larimore, Dak., from 125 bushels of Saskatchewan Fife Wheat, bought of W. J. Abernethy & Co., upon one hundred acres of land, four thousand two hundred and twenty-five (4,225) bushels of No. 1 hard wheat, being an average of 42½ bushels per acre.\n\n(Signed), T. S. EDISON.\n\nSubscribed and sworn to before me this 12th day of December, 1884.\n\nA. P. HENDRICKSON,\nNotary Public.\n\nW. J. ABERNETHY & CO., Propr's.\n\nNo. 42 Third Street South, Union Building, MINNEAPOLIS.\nA STOOL OF THE\nSASKATCHEWAN FIFE WHEAT\nContaining 168 Stalks.\n\n[Engraved from a photograph by Rugg, of Minneapolis.]\n\nCOUNTY OF FILLMORE,\n\nSTATE OF MINNESOTA.\n\nPersonally appeared before me Dennis Halloran, of Chatfield, Fillmore county, Minn., and says that he raised one stool of the Saskatchewan Fife Wheat the past season containing 168 stalks of wheat, all raised from one kernel. This stool was taken to Chatfield, where it was examined and counted by several citizens, then sent to Mr. J. M. Cussons, proprietor of the Elmira flouring mills at Chatfield, who sowed the wheat there, where it has been on exhibition for several months. The yield of the grain was 30% more than from one bushel of seed sown. It was splendid wheat with stiff straw of fine bright color, which stood up well and did not crinkle down. Mr. Cusson's wheat was obtained from W. J. Abernethy & Co. of Minneapolis, who furnished him, I understand, with 120 bushels, all of which was sown around here the past season. [Signed] DENNIS HALLORAN.\n\nSubscribed and sworn before me this 23rd day of December, 1884.\n\nR. McNEILL, Justice of the Peace.\nA STOOL OF THE\nSASKATCHEWAN FIFE WHEAT\n\n[Signature]\nDennis Halloran.\n\nSubscribed and sworn before me this 23rd day of December, 1854.\n\nR. McNally, Justice of the Peace.\nThe Saskatchewan Fife Wheat.\n\nFOR THE SEASON OF 1884-'85.\n\nA Brief History of this Remarkable Grain from its First Importation Seven Years ago till the Present.\n\nBY ITS ORIGINATOR, W. J. ABERNETHY,\n\nOF MINNEAPOLIS.\n\nThere probably has never been a variety of grain introduced into the Northwest about which so much has been said as of the Saskatchewan Fife Wheat. What is it? Where did it come from, and what are its merits above the common fife?\n\nWe answer, that it is an improved variety of the old Scotch Fife—or rather a renewed variety of it, that it possesses all the vigor which that grain was so remarkable for in the early days of wheat growing in the Northwest; that for productiveness, purity, and high milling qualities it far surpasses any variety in existence, as the subjoined testimonials will show. Its whole history from the time of its first importation by Mr. Abernethy from Canada and its subsequent development here is given, in detail for the benefit of the reader.\n\nFAR NORTHERN WHEAT CONTRASTED WITH OUR OWN.\n\nThe idea of going to the far North and of bringing down to Minnesota some of the hard wheats raised at the Hudson Bay Company's frontier posts and other points in that vast region lying north of Minnesota, originated with the writer of this pamphlet. His attention was first called to it by a sample of wheat grown in those high latitudes which had been brought down to Winnipeg, and from there to Minneapolis, by a gentlemen visiting that city. Investigation led to the discovery that this far northern section, in the great Valley of the North and South Saskatchewan, and even beyond, along the great system of rivers which empty into the Arctic ocean was the home of this cereal. Here was its natural climate; here disease had never weakened it, or noxious insects sapped its life. It grew luxuriantly, was hard and glutinous, and produced the good old fashioned yield of 25 to 40 bushels to the acre of grain, often weighing 65 pounds, and in some cases 68 pounds to the bushel. It was of splendid color and its milling qualities were of the highest order. Why not send there and procure some of it, and thus lay the foundation for a renewal of the run-out seed of our State?\n\nOUR OLD SCOTCH FIFE WHEAT.\n\nRight here a word about the old seed wheat which goes under the name of the \"Scotch fife,\" which is now generally sown in this State and Dakota. Once it was a splendid variety. Once it yielded immensely. Once it was healthy and pure,—but that was many years ago. The fatal mistake was made of sowing it over and over again without change, and the result has been what might have been expected. Continued use of the same seed on the same farms without change has led to its utter degeneration, and meagre yields and diseased growth has followed as a natural consequence. In place of 25 bushels to the acre, the production in many sections has dropped to 8 or 10. In place of bright,\nstiff, healthy straw, there is now a short; feeble growth, which crinkles and falls before maturity. In place of vigorous and prolific stools and well-filled heads, we have two or three, or perhaps half a dozen weak shoots with stinted heads from a kernel, so that in order to get even a decent stand, it is necessary to sow from \\( \\frac{1}{4} \\) to 2 bushels of seed to the acre. Neither does the trouble end here. During the 28 years since its introduction, it has been gradually getting mixed, first with one variety and then with another until the original Scotch fife has become lost in a mixture of Club, Tea, Odessa, Lost Nation, and a dozen other kinds—all of them soft. Hence, in many sections the farmer finds it impossible to obtain a grade higher than No. 2 soft, or even \"rejected.\"\n\nWhat a contrast this to the Saskatchewan Fife with its bright, stiff, yellow straw, its great, vigorous stools, its long, heavy heads, and its hard, amber-colored berry. What a contrast in yield, too, as well as in grade, as a further reading will show.\n\n**ORIGIN OF THE SASKATCHEWAN FIFE.**\n\nIn the fall of 1883, Mr. Abernethy visited Winnipeg for the purpose of securing some of this far northern grown wheat for propagation. His plan was made known to the United States Consul there—Mr. Taylor; to the chief factor of the Hudson Bay company at Fort Garry; to Mr. Alexander Begg; Minister of Agriculture for Manitoba; to Messrs. Stobart & Eden, heavy fur traders; and others. \"Could they aid him in getting down some wheat from the Saskatchewan Valley?\" There was already considerable of it grown there, for as long ago as 1812 Lord Selkirk, a Scotch nobleman, planted a Scotch colony in Manitoba, and we have authentic accounts that one of the colonists there raised shortly after 12½ bushels from 4 quarts of wheat; or at the rate of 100 bushels from one. All of the gentlemen named above, very cheerfully rendered all the service required. The names of a number of the best farmers in that section were furnished, while some of them kindly volunteered to procure some at their own expense, and forward it to Minneapolis. Among the latter were Mr. Eden, of the firm of Stobart, Eden, & Co., who procured a sample grown at Duck Lake Trading Post, latitude 52 degrees, 50 minutes; longitude, 103 degrees; and also Mr. Begg, who forwarded a number of specimens grown by the most careful farmers he had knowledge of. Letters had also been written by Mr. Abernethy to different parties whose names had been furnished, residing in the Valley, requesting them to send samples by mail, which in almost every case met with a favorable response, one being sent from the north fork of the Saskatchewan. These samples were taken one by one to the millers of Minneapolis where they received almost unbounded commendation.\n\nThere was one package—sent, if we remember aright, by Mr. Begg of the Department of Agriculture, which was so superior to all others that it attracted the greatest attention. The berry was large and plump, and the color a deep amber. Cut in two, it showed a very dark interior, indicating a large amount of gluten. The husk was thin and the weight of the little package showed that it would test in the neighborhood of 65 pounds to the bushel. With the advice of the millers, to whom Mr. Abernethy had stated his intention of propagating a new variety, this specimen was chosen. He named it the \"Saskatchewan,\" from the great Saskatchewan Valley, and took steps at once towards its propagation.\n\n**HOW IT WAS PROPAGATED.**\n\nAnxious that the sample should be sent to a locality where soil and climate were favorable, he placed it in the hands of Mr. D. Wellman, Sr., an old and careful farmer, living in Becker county, on the line of the Northern Pacific railroad, with the request that it should be sown by itself and the greatest care shown in its propagation. Mr. Wellman complied, and selected a new and clean piece of land on which the seed was placed. This was in the spring of 1879. The growing blades as soon as they were out of the ground showed their vigorous parentage. Each kernel threw out a large number of glossy green stalks which at length developed into long heads filled with plump, amber-colored grain. The straw was stiff and strong, and ripened a bright yellow color with no trace of rust and no indication of crinkling down. It stood from six inches to one foot higher than the common fife around it, and was conspicuous for healthfulness, vigor of growth, freedom from all disease, and great productivity. As there was only a small package of the seed, the yield was therefore limited to a few bundles, and these Mr. Wellman took into his house, and laying them on his table, went over them each, straw by straw, throwing out whatever heads there were of varieties other than the Scotch fife.\n\nIn the spring of 1880, the second year of its growth here, Mr. Abernethy hired Mr. D. L. Wellman, son of D. Wellman, above referred to, to continue its propagation until the stock should be large enough to place it on the market. He was instructed to sow it on clean land and to use the utmost care to free it from whatever impure seed there might be left in it. Again it showed its superiority. It pushed clear ahead of the other wheat around it and the crop was ready for cutting a week in advance of it. The yield this year was, by careful measurement, at the rate of 87½ bushels to the acre of 62 pound grain. On being shown to the wheat inspector for the Minneapolis Millers Association, of Minneapolis, he pronounced it \"the finest sample of Scotch Fife wheat he had seen since he had been connected with the Miller's Association!\"\nTHE SASKATCHEWAN FIFE WHEAT.\n\nIn the year 1881 the seed had multiplied sufficiently to sow several acres. Mr. Wellman's farm being small and containing but little plow land, an arrangement was made with a son-in-law of D. Wellman, Sr.—Mr. I. Collins—to take a portion of the wheat, which he sowed on a piece of clearing. As in years before it grew most vigorously. The leaves and stalk were a glossy green, the latter standing up stiff and strong, and being entirely free from any evidence of disease. The hot suns and rains of July brought with them no blight, although a continuous drought of six weeks before harvest shriveled the grain badly; yet, notwithstanding this, it yielded 25 bushels to the acre, and showed up so well that at the great Northwestern Fair at Minneapolis, samples elicited from the committee on grains a highly commendatory notice.\n\nThe wheat was not entered for a premium, but it was declared by all who saw it to be the most promising among all the 300 or more specimens on exhibition.\n\nThis brings us to the year 1882. The little handful of seed, which, in 1879 had been cast into the ground had now multiplied many thousand fold, and it was decided for the first time to place it on the market. A careful inspection of the wheat grown in the Red River Valley, had convinced Mr. Abernethy that that strong alkali soil was better adapted to the growth of hard wheat than the soil in Becker county. Consequently in the spring he sent the crop raised the year before by Mr. Collins, to Carmon, in Polk county, where the Hon. E. S. Corner, of Minneapolis, owns one of the largest and finest farms in the Valley. He sowed it on a piece of new breaking which had been well backed. From a report which he made of his experience with it, we extract the following: \"I find it to be the purest specimen of the Scotch Fife wheat I have ever seen.\"\n\nAnxious that the wheat should be examined by experts, Mr. Abernethy invited the Chamber of Commerce of Minneapolis to send a delegate from their number to make a personal examination of it in the field. The Chamber gave the request a respectful hearing and appointed as a representative Mr. E. D. Bowen, one the most experienced dealers in wheat in the State. For twenty years he had been handling wheat, and for seven of that time had been a wheat inspector for the Milwaukee & St Paul railroad. An invitation was also extended to the Professor of Agriculture of the Minnesota State University, Mr. E. D. Porter, who accepted and went. These gentlemen spent an entire day examining the different fields of the Saskatchewan, and to say the least, were amazed at what they saw. On their return, Mr. Bowen filed with the Secretary of the Chamber of Commerce the following report:\n\nMR. BOWEN'S REPORT.\n\nCHAMBER OF COMMERCE ROOMS, MINNEAPOLIS, Aug. 10, 1882.\n\nTo the President and Members of the Chamber of Commerce, Minneapolis:\n\nGentlemen: In obedience to your instructions, I have made a careful examination of the fields of Scotch Fife wheat now being grown under the name of the Saskatchewan Fife, and beg leave to submit the following report:\n\nI find it to have originated from seed procured five years ago by Mr. Abernethy, Minneapolis, from the Minister of Agriculture for Manitoba, the Hon. Alexander Beeg. Various samples of the best Scotch Fife growing in Manitoba and further beyond in the Saskatchewan Valley, were obtained, and from the best of these the selection was made. The Scotch Fife kernels were carefully picked from the others, and were grown from the crop raised on a selection of the best seed again last fall. For three years this process has been pursued, until today the wheat looks healthy and in a state of purity and perfection unsurpassed by any that I have ever seen growing in Minnesota. After a most thorough examination of it, I would recommend it to the consideration of this Chamber for their endorsement, for the following reasons:\n\n1st. Its PURITY. It has been so thoroughly separated from other varieties that it is now nothing but pure Scotch Fife, free from cockle or any foul seeds, and in its appearance and growth reminded me strongly of the field of this variety I used to see in the State seventy years ago.\n\n2nd. ITS THIRIFTINESS OF GROWTH. It has a bright, healthy stalk, stands up stiff and strong, and is from six inches to one foot taller than the common Fife growing in the adjoining fields and sown at the same time.\n\n3rd. EARLIESTNESS OF MATURITY. The Saskatchewan, Fife was fully a week, and possibly ten days, in advance of the common Fife sown on the same ground at the same time. This is certainly an important quality in its favor.\n\n4th. ITS PROLIFICNESS. I examined four fields of this variety, and in all of them the promise for a heavy yield was very apparent. Some parts of them I know would yield forty bushels to the acre. The heads were filled clear up to the very tips, while the berry was remarkably large and plump. I should judge that the yield would be twice that of the common Scotch Fife grown side by side with it.\n\nTo sum it all up, the Saskatchewan Fife is but another name for one of Scotch Fife of a quarter of an acre, and is reported in all its purity and prolificness. It can be relied upon and cultivated. Its general dissemination would be an untold blessing to both farmers and millers. I understand that the propagators intend to dispose of their present crop for seed, and I would recommend to this Chamber, and to the millers and commission men throughout the hard wheat district, that they interest themselves to help scatter it in small quantities as widely as possible throughout the Northwest.\n\nRespectfully submitted,\n\nE. D. BOWEN\n\nProf. E. D. PORTER'S REPORT.\n\nUNIVERSITY OF MINNESOTA, COLLEGE OF AGRICULTURE, Aug. 12, 1882.\n\nTo whom it may concern:\n\nIt was my privilege recently, to make a careful examination of several fields of the improved Scotch Fife Wheat now being grown by Messrs. W. J. Abernethy & Co., in Becker county, on the line\nof the Northern Pacific Railroad, under the name of Saskatchewan Fife. After a thorough inspection of the standing grain as regards its purity, its healthfulness its early maturity and productivity, I am free to declare that it exceeded my utmost expectations. It was particularly noticeable for its broad stiff straw; its large, well-filled heads; its plump, amber-colored grains; its freedom from all varieties of pests; its magnificent vigor of growth; its early maturity and great productivity. I regard it as by far the most promising variety of hard wheat I have ever seen in Minnesota, and one which our farmers will, if they are wise, propagate from at as early a date possible. In my judgment, the yield on all our wheat farms by its use for seed will be increased from five to fifteen bushels per acre.\n\nIn behalf of the College of Agriculture of Minnesota, and of the farmers generally throughout the hard wheat growing districts, I desire to extend thanks to Messrs. Abernethy & Co., for their efforts to renew the old Scotch Fife variety of wheat. It gives me pleasure to recommend it for general cultivation in those localities where spring wheat is grown.\n\nYours truly,\n\nEDWARD D. PORTER,\nProfessor of Agriculture, University of Minnesota.\n\nIT TAKES THE FIRST PREMIUM AT THE FAIRS FOR 1882.\n\nIt was determined to make a grand display of the grain at the great Northwestern Fair, which was to be held in Minneapolis in September, and also to exhibit it at the Minnesota State Fair, which was to be held in Rochester the succeeding week. The managers of both of these organizations granted an abundant space, and a most elaborate display of the wheat in the straw and grain was made. It was entered for the premium at both fairs as the best sample of Scotch Fife on exhibition, and at the former fair for the two special premiums of a French clock and a silver tea set, each valued at $100. It was the winner in every case, taking the highest premiums at Minneapolis, and also the grand silver medal, the highest award of the State Agricultural Society. The committee making the award at Minneapolis consisted of the following distinguished gentlemen: Hon. C. A. Pillsbury, of the Pillsbury Flouring Mills, Minneapolis; Hon. William G. Le Duc, ex-Commissioner of Agriculture, Washington, D.C.; Hon. William R. Marshall, ex-Governor of Minnesota, St. Paul, and Hon. C. M. Loring, proprietor of the Minnetonka Flouring Mills, Minneapolis. In making their report, they added the following unsolicited endorsement:\n\nThe committee, in awarding this premium for the best individual display of grain, do so not only on account of the taste displayed in the collection, but also for the excellence and purity of the grain. Your committee desire to make special mention of the Saskatchewan Fife wheat exhibited, which is a strictly pure Scotch Fife. The yield of this wheat—forty bushels to the acre—without loss of the straw, the length of the head and size of the berry controvert the idea that the Scotch Fife will no longer be wheat for the farmers to grow in Minnesota. The committee believe that if the farmers in getting fresh seed, would obtain a pure article from the northern section of the State, they would have a good success with the hard varieties, as some of them now claim to have with the soft kinds. By growing a variety like the Saskatchewan, they would obtain a better price for their product, and also help to sustain the good reputation which Minnesota has gained for strong, white, glutinous flour. The committee believe that the thanks of both the farmers and millers of the Northwest are due the propagators for their efforts to reproduce in such purity and vigor the Scotch Fife variety of wheat.\n\n[Signed]\n\nC. A. PILLSBURY, Chairman.\nWILLIAM R. MARSHALL,\nWILLIAM G. LE DUC,\nC. M. LORING.\n\nAt Rochester the committee consisted of Hon. J. G. Bass, of Shakopee, formerly Vice-President of the Minnesota State Agricultural Society; Hon. John S. Harris, of La Crescent, President of the State Horticultural Society; Prof. E. D. Porter, Professor of Agriculture at the Minnesota State University; Hon. James McHench, of the executive committee of the State Agricultural Society, and Hon. Adam Bohland, also of the executive committee of the State Agricultural Society. After making the award, the committee filed with the Secretary the following most commendatory endorsement of the wheat.\n\nYour committee in awarding the highest gift of the State Agricultural Society for this remarkable display of Saskatchewan Fife wheat, do so with a deep sense of gratitude to the propagators for the efforts they have made to improve our standard variety of milling wheat. When the fact is considered that the reputation which our State has attained for its superior flour, has been built up on the Scotch Fife wheat, and that of late years it has become greatly deteriorated in quality and productivity, and to a large extent mixed with other varieties, then the question of restoration to its former standard becomes a matter of general interest to every farmer. On the Saskatchewan Fife, which is nothing more than the Scotch Fife, all the conditions necessary to its renewal seem to have been met. From the numerous specimens on exhibition, both in the grain and stalks taken from different fields, and from all the information your committee could gather from others, this wheat possesses the following points in its favor:\n\nFirst—Vigor of Growth.—The seed was first brought from a far northern climate, five years ago, from the vicinity of the Saskatchewan Valley, in Manitoba, nearly 4,000 miles above this locality, where the most prolific hard wheat in the world is produced; hence it possesses all the qualities of its vigorous parentage.\n\nSecond—Productiveness.—Its productiveness is remarkable. As reported to us by not only the propagators, but by Prof. E. D. Porter, of the State Agricultural College of Minnesota, and by the\nTHE SASKATCHEWAN FIFE WHEAT.\n\nspecial committee sent out by the Chamber of Commerce of Minneapolis, both of whom saw it in the field at harvest time, it has yielded, in localities, the present season, as high as forty bushels to the acre. This showing was hardly ever excelled in the early history of wheat growing in the State.\n\nTHIRD—PURITY.—This variety is undoubtedly the purest specimen of the hard Scotch Fife wheat to-day in the Northwest. By beginning with a small handful, and by thoroughly picking it over, and selecting none but the Scotch Fife kernels, the propagators have been able to secure an absolutely pure variety.\n\nFOURTH—MILLING PROPERTIES.—The wheat has the dark amber-color which denotes that it is rich in gluten, a property which is now greatly lacking in much of our common wheat.\n\nFIFTH—EARLIESTNESS OF MATURITY.—By bringing any grain from the far north to a more southern latitude, it will mature more quickly than in its original location. This has been true in this case, the Saskatchewan Fife ripening fully a week in advance of the common Scotch Fife grown here.\n\nSIXTH—HEALTHFULNESS.—Every indication points to the perfect healthfulness of this variety. The straw is brittle and stiff, the heads are long, and the grain plump and well developed. It shows no evidence of blight or rust, or any form of disease.\n\nWith all these points in its favor, your committee are of the unanimous opinion that it would be to the interest of every wheat grower in our State to renew their seed by securing some of this variety. Not only is it always desirable to change seed, but especially is it needed in our State to-day, when so much of the grain is mixed and run out. We desire, therefore, not only to commend this wheat for its evident superiority, but also to the farmers generally for trial.\n\n[Signed]\n\nJ. G. BAAS, Chairman,\nJOHN S. HARRIS,\nADAM BOHLEN,\nJAMES MCEHENCH,\nL. D. PORTER.\n\nTHE MINNESOTA STATE FAIR OF 1883.\n\nThere were four samples of the Saskatchewan Fife wheat in the grain entered for premiums at the Minnesota State Fair of 1883, besides a large number of specimens exhibited in the straw. The first sample of one-half a bushel was exhibited by Jacob Hurley, of Ortonville, and was accompanied by the following sworn statement:\n\nSTATE OF MINNESOTA, ss.\nCOUNTY OF BIG STONE.\n\nWe, the undersigned, residents of Ortonville, Minn., having examined the Saskatchewan Fife grown by Jacob Hurley, at this place, find the ground to be a rich black loam, comprising one-eighth of an acre, and the yield to be three bushels from one quart of seed, or at the rate of fifty-four bushels per acre, of a fine quality of red, hard wheat, weighing sixty-three pounds to the bushel. We also find, in some instances, seventy-three stalks from a single kernel. The wheat was sown on the 15th of April and harvested the 15th of August, and matured as early as ordinary wheat in the same locality. It was grown on Section 18, Township 122, Range 46, five miles north of Ortonville.\n\n(Signed) C. M. McEwen,\nC. R. Orion.\n\nSubscribed before me this 29th day of August, A. D., 1883.\n\nA. J. PARKER,\nNotary Public for Big Stone County, Minn.\n\nThe second specimen was shown by William C. Hawley, of Hammond, Wis., and was accompanied by this statement:\n\nHAMMOND, WIS., Sept. 3, 1882.\n\nMr. W. J. ABERNETHY, Dear Sir,—I send you by express a half bushel of the Saskatchewan Fife wheat. I don't think I sowed over three pints of wheat. I let a good many of the grain fall spilling, and they all had to have some. The three punts yielded me three and a half bushels. The land that it grew on had raised twenty-two crops of wheat before this. You could see that the Saskatchewan was a great improvement on the common Fife. The heads were nearly twice as long. I lost four large bundles before it was threshed. Please to see that this wheat does not get wasted, for I do not want to lose any of it.\n\nYours truly,\n\nWM. C. HAWLEY.\n\nThe third sample was exhibited by J. T. Grimes, of Minneapolis. His statement was as follows:\n\nThe quart of Saskatchewan wheat I got of you last spring was sown on good ground, composed of sand, loam and clay. The crop the year previous was potatoes. No manure had ever been applied. I plowed in the spring and sowed broadcast by hand, and then put it in with cultivator and harrow. It ripened about the same time as my other Fife. The following estimates of results are as nearly correct as possible.\n\nGround sown, 14 square rods; yield from one quart, 63 pounds; estimate yield per acre, 43 bushels; increase from one quart, 33.6; length of stem, 3 feet, 8 inches; greatest number of stalks from one grain, 50; weight per bushel, 60 pounds.\n\nRespectfully,\n\nJ. T. GRIMES.\n\nThe fourth and last specimen was from G. Hattenberger, of Shakopee, Minn., He said:\n\nSHAKOPEE, Aug. 23.\n\nMr. W. J. ABERNETHY, Sir,—I send you this day half a bushel of the Saskatchewan Fife wheat. I raised from the one quart 45 pounds of the kind I send you. I had one stool of 25 straws from one kernel. The wheat was sown on sandy, gravelly land. It stood better than the surrounding wheat, and was much healthier and stronger in straw, besides better to yield. It stood about six inches higher than the surrounding wheat.\n\nYours truly,\n\nGEORGE HATTENBERGER.\nThe committee to award premiums consisted of Col. John H. Stevens, of Minneapolis, the veteran agriculturist; Hon. Mark H. Durnell, of Owatonna; Hon. Seth H. Kenney, of Morristown; and Capt. A. H. Reed, of Glencoe. The first premium was awarded to Jacob Hurley, of Ortonville. In making the award they reported as follows:\n\nThe yield of this wheat is simply extraordinary, being greatly in excess in all instances, over all other varieties incident to this soil and climate, in many cases doubling, and in others trebling the general average. This is more gratifying from the fact that it is a hard wheat, such as our Northwestern millers require to manufacture their choicest and best varieties of flour from. Aside from all of these considerations, it is a pure wheat, unmixed with other varieties. It is a dark amber color, reaches maturity early, is healthy, vigorous, with a bright and stiff straw, free from blight or rust, with a heavy, full filled, well plumped grain, rich in starchy matter, plump in growth, and the most desirable variety to come into common cultivation. The proprietors, who introduced this wheat into the State, are public benefactors, and the benefit they have bestowed on the agricultural industries in this inheritance will be of great moment to the future farming interests of the Upper Mississippi Valley.\n\nWe notice by the reports of the different gentlemen who placed samples of their wheat on exhibition, that one bushel to the acre is ample seed to sow. It is claimed three pecks will suffice by others. It stood out in a remarkable manner. Mr. Hurley informs us that he found, in some instances, 73 stalks to the product of one seed. Mr. Grimes had 80 stalks from the same source, and Mr. Hammond 35, all of which, considering what might be expected, is no necessity with this variety.\n\nAnother item we find by the reports of those who competed for the premiums, that it does not require our rich lands to produce the wheat. For instance, Mr. Grimes says that the ground on which he raised his specimen had never been manured, but the soil was good, and his wheat (estimated) at the rate of 48 bushels to the acre. Mr. Hammond, of Wisconsin, informs us that 22 crops of wheat had been previously raised before this one. His estimated yield per acre is over 60 bushels. We find the same estimate by A.G. McConnell, of Belle Plaine, Scott county, Minn., while H.G. Lein, of the Racine farm, Dakota, near Canby, Minn., goes considerably over that yield. It seems to your committee that this variety of wheat will, when it shall come into general cultivation, revolutionize the wheat growing interests of the Northwest.\n\n(Signed)\n\nJOHN H. STEVENS,\nChairman of Committee.\n\nTHE OPINION OF EXPERTS.\n\nIn order that the opinion of millers and grain dealers might be obtained, the grain had been frequently shown to them for their judgment, and among a large mass of testimonials the following selected:\n\nFrom C. A. Pillsbury, of the Pillsbury Flouring Mills.\n\nOFFICE OF C. A. PILLSBURY & CO., MINNEAPOLIS, AUG. 20, 1882.\n\nMR. W. J. ABERNETT. Dear Sir—It affords me pleasure to give my emphatic endorsement as to the value of the Saskatchewan Fife Wheat. I have been entirely familiar with its history from the day the first package of seed came to the present. Each year I have made an examination of the grain, and have become more and more convinced of its great value. As it is to-day, I consider it the best and purest Fife wheat in the Northwest. No such grain has been received at our mills since we have been engaged in milling business. You may be sure crop ought to be all sold for seed, and our firm, as well as the firm of Pillsbury & Hurblot, will gladly assist in every way we can consistently in inducing the farmers to sow it. You have done a good work, the results of which will grow more and more apparent as the years go by. The propagation of wheat like this will add millions to the value of the wheat crop of our State when its cultivation becomes general.\n\nC. A. PILLSBURY.\n\nFrom Washburn, Crosby & Co.\n\nThe milling firm of Washburn, Crosby & Co., proprietors of the Washburn mills, make this statement:\n\nTo Whom it May Concern:\n\nOFFICE OF WASHBURN MILLS, MINNEAPOLIS, AUG. 23, 1882.\n\nAfter a careful inspection of the samples of Saskatchewan Fife Wheat, as they have been exhibited to us for three years, we are convinced that this is a vastly superior wheat to any now in the market. It is remarkable for its purity, and also its excellent milling properties. We are glad to add our endorsement to that of the universal opinion among millers here as to its value.\n\nWASHBURN, CROSBY & CO.\n\nFrom Mr. Leonard Kinsell, Wheat Inspector at Minneapolis for the Millers' Association.\n\nMR. W. J. ABERNETT. Dear Sir—In answer to your inquiry, I will say that I saw the original package of the Saskatchewan Fife when you first exhibited it among the millers several years ago, immediately on its receipt from Canada. It struck me as the finest hard winter wheat ahead of the wheat grown in Minnesota, but I had no idea that careful cultivation and selection would improve it to such an extent as has been done. I find it to-day as near perfect for our use as seems possible to grow it. The berry is of a clear amber color, and rounded out into a beautiful plumpness, which indicates that it is rich in gluten—a quality absolutely necessary in making patent flour, in addition to which it greatly exceeds in hardness of kernel the common fife wheat grown about here, which also provides its excellent milling qualities. I pronounce it a pure variety of Scotch Fife, and a most valuable acquisition. Indeed, I have no hesitation in saying that the specimens I have seen surpass anything in the wheat line which has come under my observation since I have been connected with the Millers' Association.\n\nTruly yours,\n\nLEONARD KINSELL,\nInspector for Millers' Association.\nTHE SASKATCHEWAN FIFE WHEAT.\n\nFrom G. D. Rogers, former Secretary of Chamber of Commerce, Minneapolis.\n\nCHAMBER OF COMMERCE ROOMS, MINNEAPOLIS, OCT. 12, 1883.\n\nMr. W. J. Abernethy. Dear Sir:—I have seen the product of the Saskatchewan Fife wheat for several years. In my judgment it is superior to a good milling wheat of any I ever saw. It is hard, plump, rich in gluten, and will make a No. 1 flour. If the farmers who now millers want for the new process method, and the propagation of this variety will not only be hailed with satisfaction by them, but it will prove an excellent investment for the farmers themselves. I remember the original package, just as it came from Manitoba, and you will recall the fact that I told you then that it was a remarkably fine specimen of the pure Scotch Fife. I am free to say, that as it is today, I never saw a purer, cleaner, or finer quality of the Hard Scotch Fife.\n\nRespectfully yours,\n\nG. D. ROGERS.\n\nFrom the President of the Minneapolis Millers' Association.\n\nOFFICE OF THE GALAXY MILLS, MINNEAPOLIS, Aug. 25, 1882.\n\nMr. W. J. Abernethy. Dear Sir:—In answer to your inquiry regarding my opinion of the Saskatchewan Fife Wheat, which you are about to introduce for seed, I will say that it comes the nearest to my idea of what a good Scotch Fife should be, and is a variety which seems to me very promising. It is hard, plump, rich in properties which are due to the making of a fine quality of flour. I have for years seen the very great necessity for a renewal of our seed wheat, not only on account of its admixture with soft varieties, but also for the reason that it had become, to a large degree, run out—lost the vigor which distinguished it when first introduced. I think you have gone to the right locality to procure fresh seed, for all the wheat that I have seen from the Saskatchewan Valley has been remarkable for its milling qualities. By the present importation you have brought into our State a hard, plump, rich variety which will not only improve our milling, but will also be an improvement on the original seed. I shall take great pleasure, as a miller, and also as an officer of the Millers' Association, in doing all I can to help introduce it among the wheat growers of the Northwest.\n\nW. F. CAHILL,\nPresident Minneapolis Millers' Association.\n\nFrom Mr. E. B. Andrews.\n\nThe following is from a gentleman widely known throughout the Northwest—Mr. E. B. Andrews, former General Secretary of the Minneapolis Millers' Association, the largest corporate body of millers in the world:\n\nOFFICE OF THE MINNEAPOLIS MILLERS' ASSOCIATION,\nMINNEAPOLIS, MINN., AUG. 23, 1882.\n\nTo Whom it May Concern:\n\nI have been familiar with the efforts of Mr. Abernethy to introduce a new and pure variety of Scotch Fife wheat into our State from the time of its first importation five years ago. He brought to this office and submitted to my inspection the various samples he had secured from Canada, and among them I remember some of very great promise. Have seen the product of the variety he has named the Saskatchewan Fife, and so far as I can judge it has preserved its identity fully each season and now possesses all the vigorous characteristics of the old Scotch Fife of twenty years ago. I must be very much mistaken if this wheat cannot stand, and the public at large rely on this Association doing all it can to help disseminate it. Its general cultivation would, in a short time revolutionize the wheat industry of our State. I cheerfully commend it. It is the purest and most uniform specimen of the hard Scotch Fife I have seen anywhere.\n\nE. B. ANDREWS,\nSecretary Miller's Association.\n\nFrom the President of the National Millers' Association.\n\nI have examined the Saskatchewan Fife wheat; and pronounce it the pure Scotch Fife. The advantages to both farmers and millers from such a variety as this cannot be over estimated. The salvation of the flour-making industries of the State, indeed, depends upon it. We like the Saskatchewan is worth ten cents more per bushel, to begin with, than wheats like the Lost Nation, Blue Stem, Odessa, Rio Grande, Red River, Golden Drop, Tea, Black Sea, and other soft wheats. A change of seed all over the State is desirable, and will bring the farmers largely increased yields. If they are wise they will sow the pure Booth Fife, such as the Saskatchewan.\n\nMinneapolis, Minn.\n\nJ. A. CHRISTIAN.\n\nFrom G. S. Barnes, General Manager Northern Pacific Elevator Company.\n\nGentlemen—I have examined the sample of your Saskatchewan Fife wheat, and I pronounce it the purest in quality of any sample I have ever seen. I trust you may be able to scatter some of it along the Northern Pacific Railroad where we have elevators, as we are highly interested in the farmers raising nothing but Hard Fife, and that of the best quality.\n\nYours truly,\n\nG. S. BARNES.\n\nFrom G. S. Holmes, Proprietor of the Northwestern Flouring Mills.\n\nMINNEAPOLIS, MINN., JAN. 15, 1883.\n\nI have examined the variety of wheat called the Saskatchewan Fife with great care. In order to better determine its flour-making qualities, I submitted it to the test of a powerful microscope. Under its focus the grain seemed almost transparent, proving that it is largely composed of glutinous matter. In every test which I made, it came up to my highest standard of first-class milling wheat. It is the finest specimen of the pure Scotch Fife I have ever seen, and it ought to be scattered throughout the State for seed this coming spring. You are at liberty to refer any parties wishing it to me.\n\nYours truly,\n\nW. H. HOLMES.\nTHE SASKATCHEWAN PIPE WHEAT.\n\nFrom the Oldest Miller in Minneapolis.\n\nOffice of Cataract Mills, Minneapolis, Dec. 5, 1883.\n\nMr. W. J. Abernethy.—Dear Sir,—You ask from me an opinion of the Scotch Pipe wheat, the seed of which you brought from the far Northwest several years ago, and which you have named the Saskatchewan Pipe. I cheerfully answer that it is the best milling wheat I have seen for fifteen years; indeed, I do not remember, even in my early experience here, when the Scotch Pipe was pure and vigorous, to have seen anything better. It has the right color to it, and cannot fail to make the highest grade of flour. What is more, it is pure, which is a very important thing in its favor, as so much of our wheat nowadays is mixed and soft. If you can persuade the farmers to buy this variety for seed, you will be doing the State an incalculable benefit, and every miller will wish you the greatest success. This wheat is similar to the old Scotch Pipe for productiveness or milling qualities, and you should have the pure article.\n\nYou are at liberty to refer any one to me desiring further information about it.\n\nVery truly yours,\n\nM. WALSH,\nHead Miller.\n\nTHE SEASON OF 1884.\n\nDuring the winter and spring of 1883-4 the firm of W. J. Abernethy & Co., filled over 9,000 orders for the Saskatchewan wheat. This was sent all over the country—as far west as Washington territory, and as far east as New Hampshire. It was sown on every kind of soil and under every variety of conditions. Nineteen out of twenty of those who tried it, so far as heard from, are enthusiastic in its favor. The twentieth man who bought the seed expecting to harvest 50 bushels to the acre from careless and late seeding, met with only average success and reports the wheat no better than the common pipe. We will leave the general public to judge from the reports of the other nineteen good farmers who have given it a fair trial, as to which of the witnesses is the more reliable. Every man's address is given and the reader is at liberty to write to any of them for verification of the truthfulness of their reports.\n\nTHOS. S. EDISON, Larimore, Dak.: Before me personally came T. S. Edison, of Larimore, Grand Forks County, Dak., who deposes and says that during the past season of 1884 he raised upon his farm at Larimore, Dak., from 125 bushels of Saskatchewan Pipe wheat, bought of W. J. Abernethy & Co., upon one hundred acres of land, four thousand two hundred and twenty-five (4,225) bushels of No. 1 hard wheat, being an average of 42½ bushels per acre.\n\n(Signed), T. S. EDISON.\n\nSubscribed and sworn to before me this 12th day of December, 1884.\n\nA. P. HENDRICKSON,\nNotary Public.\n\nHENRY ZIEMER, Brownsville, Minn.: The wheat has given excellent satisfaction. I sowed one bushel on three-quarters of an acre, and got 80 bushels of No. 1 hard, which weighed two bushels over machine measure. The yield was double that of common pipe. The straw was a bright gold color and stood up well till it was ripe, while common pipe crinkled down to the ground. I heartily commend it and think it would pay every farmer to try it and become convinced for himself of the great difference there is between this and common wheat.\n\nC. D. SHATTUCK, Faribault, Minn.: My Saskatchewan was the nicest of any I had on a farm of 80 acres sown to different kinds of wheat. We sowed 25 bushels of clear Scotch Pipe, which I got from Aberdeen, Dak., which did well, but not so well as the Saskatchewan. Shall sow nothing else next year but the latter. I got 33½ bushels from an acre and am satisfied if it had not been for a storm which beat it flat to the ground when it was breast high, I would have had 40 bushels, as where it did not straighten up the heads did not fill. I measured heads six inches long and counted over 50 kernels in some of them.\n\nALBERT WARNKE, Twin Lakes, Minn.: It looks like the old Scotch Pipe of twenty years back. The straw is stiff as wire, and it stands much longer overripe than other grain. It yielded me seven bushels more to the acre than other wheat. All my neighbors are well pleased with it and want to buy some for seed, but I would not sell a bushel of it.\n\nT. A. BENNETT, Black Earth, Wis.: It was much more vigorous than other kinds of spring wheat grown around here. The straw was stiff and tall and of a beautiful color; yield greatly in excess of all other kinds. It is certainly a great improvement over any kind I have ever grown.\n\nJOHN G. SAUTER, Waconia, Minn.: Every one who saw my wheat in the field said it was the best they ever saw, and I myself say the same. It is the clear Pipe wheat such as I sowed twenty-seven years ago, and from which I used to get twenty-five bushels from an acre when I had it. But the land I sowed this on this year was the poorest piece of land on my farm. So I think it is a great improvement over the common Pipe. The color of the straw is as yellow as gold, and so clear that I can recommend it to every farmer—I don't care whether they sow it in rich or poor, warm or cold land. I believe that in good land every one can get from thirty to thirty-five bushels to the acre.\n\nA. L. HYBERG, Dassel, Minn.: \"I sowed one quarter of the Saskatchewan on the 12th day of April and harvested it the 16th of August. I got four bushels and 38 pounds and had it not been for the gophers eating it, would have got five bushels. It weighed 82 pounds to the bushel and is the best wheat I ever raised.\"\n\nGEORGE BAKER, Grassville, Minn.: \"The wheat I got of you was sown by me and, my neighbors. From 2½ bushels I got 72 bushels of splendid wheat weighing 62 pounds to the bushel. It was sown broadcast and made a splendid growth. Everybody admired it. The stalks were large and heads long and the grain weighed 62 pounds to the bushel. Common Pipe wheat only averaged 14 bushels to the acre. I shall sow nothing but Saskatchewan next year.\"\nTHE SASKATCHEWAN FIFE WHEAT.\n\nWm. Oker, Lake Benton, Minn.: \"My Saskatchewan yielded to the acre, 8 bushels better than my common wheat. I shall save it and sow all mine for seed next year, although my neighbors all like it and want to buy some of it bad, but I have none to sell.\"\n\nJ. W. Novotny, Angus, Minn.: \"Gentlemen—Last spring I purchased of you one quart of the celebrated Saskatchewan Fife Wheat. I sowed the same on five square rods of land where no crop had been grown before. I threshed four bushels and forty-four pounds of very fine, hard, strong, tough kernels. I found some stalks that contained as many as 80 stalks of bearing size from one kernel. Most of the stalks contained from 40 to 50 stalks. This was more than I expected; more than ever was raised and I think more than ever will be raised again from a like amount of seed. I am sure when every farmer will start to raise it, it will be a great thing for the country.\"\n\nL. W. Scott, Durgin, Dak.: Gentlemen—I sowed one hundred and sixty (160) pounds of Saskatchewan Fife Wheat bought of you last spring, on soil which was less than 3½ acres of broadcast seeder. The crop was remarkable from its first appearance above ground for its strong and vigorous growth. The yield from the harvestor was simply magnificent and excited the enthusiastic admiration of all who saw it. The yield from two bushel and forty pounds of seed was one hundred and thirty-three bushels of splendid wheat—such wheat as is found only in the Red River Valley. I sold a few bushels at $1.00 per bushel for seed to my neighbors and friends who knew from personal observation what the crop was. We found one stool with 75 fully developed heads. I will say further, with reference to yield, that myself and men estimated that the rice birds destroyed from 12 to 15 bushels on the end of the piece of ground bordering on the Maple River where the birds flocked by the thousands.\n\nE. M. Upton Cummings, Dak.: I sowed 17 bushels on 16 acres and got 29 bushels to the acre. I think the wheat is superior in all respect to the ordinary fife sown in this vicinity. The growth is more vigorous, the straw longer and the field larger. We sowed for experiment ¼ bushel and 3 pecks per acre broadcast, and some 3 pecks per acre drilled in, but I cannot give you the exact results per acre. The seed sown broadcast, one bushel per acre, gave the best result.\n\nC. R. Cryderman, River Falls, Wis.: I sowed nine pounds at the rate of a bushel to the acre. It stood splendidly; I found stools with 36 stalks on. It grew 4 feet high and was as even a piece of wheat as I ever saw. The yield was at the rate of 40 bushels to the acre. It grew larger and stronger than the Blue Stem along side of it, and my neighbors who saw it growing, thought it was the \"boss hard wheat,\" and that farmers would do better to get seed of this kind than to grow soft wheat.\n\nLOREN WILLIAMS, Physian, Le Sueur Co.: I raised one and one-half bushels from one quart of the Saskatchewan sown, weighing 65 pounds to the bushel. It is a great improvement over the common fife. The straw is large and vigorous in growth, the color excellent, and quality of grain good.\n\nA. M. Noble, Swedesboro, Iowa.: I sowed one peck of the Saskatchewan Fife and raised 7¼ bushels from it. The yield was about two and one-half times that of common fife and the quality better than any Island White Russian or any other kind. My neighbors all pronounced it the finest thing they had seen. Wheat growing here in Southeastern Iowa is nearly a thing of the past, but with a variety like this it may come back again.\n\nJames B. Whetstone, Dassel, Minn.: Gentlemen—I sowed two bushels of Saskatchewan and harvested nine-eight bushels from it.\n\nJohn Higgins, Brookville, Wis.: My Saskatchewan stood five feet high; straw bright yellow; yield, about double the common fife. I think it to be a great improvement over other grades and kinds of spring wheat and just the kind best adapted to our soil here. All who saw it growing admired it, and think it decidedly the best for our farmers to grow.\n\nGideon E. Clark, Plankinton, Dak.: I regard it as a great improvement over any common wheat, and believe it will pay any thrifty farmer to sow it. I sowed 4½ bushels on 56 acres. It stooled so well that no ground was fairly well covered. It looked fine when I arose on the morning of July 11, but before I sat down to breakfast it was utterly ruined by hail. It spoiled every growing thing for me on my farm of 400 acres. My loss I estimated at $2,500. I tried the wheat last year and can say that the berries are of uniform size, shape, color, and hardness, thus indicating a pure variety. Held up to the light, they are of a clear, translucent color denoting abundance of gluten. I shall sow no other wheat next season.\n\nClement Halvorson, Linden, Brown Co., Minn.: I sowed two quarts of the Saskatchewan got of you last spring, and determined to give it a fair trial. It was sown broadcast on 32 rods of land with a Hoosier Seeder, my idea being to give it the greatest possible chance to stool. For a time I feared I had made a mistake—as the weeds came up and made such enormous strides as to out-strip the wheat, but when it began to stool it showed its great vigorosity, and soon the entire piece was covered with a dark green verdure. It stood splendidly. Stools of 25, 30, and 40 were a common sight. The highest number of stools found from the lowest kernels was 45. This wheat was near a field of common Scotch fife and stood a little taller. The straw was thick and stiff, which is a natural result of hard wheat plant. The heads were very even in length, a little longer than those of the Scotch fife, and much plumper and fuller. The greatest contrast between the two was in color. The Saskatchewan had a fresher, healthier, and a darker green color than the Scotch—so much so, that the difference could be seen at a distance. I reaped the wheat in a Minneapolis binder and got 103 middle size, hard bound bundles. In the bundles the wheat showed to advantage, for the good length, and especially the evenness and fullness of the heads. I threshed it with a Pride of the West threshing machine, and got 4 bushels good measure measure.\n\nIt weighed 63 pounds to the bushel, uncleaned, even measure, (not machine measure), while the Scotch fife raised on the same field, weighed 56 pounds uncleaned.\n\nIt is certainly an improvement over the common fife in being purer and cleaner, and the farmers about here who have seen it, like it, and say it produces a phenomenal yield.\n\nNelson Halton, Mazeppa: My yield from one quart of wheat was 124 pounds of 60 pound grain.\nTHE SASKATCHEWAN FIFE WHEAT.\n\nF. J. SCHMAYSS, Lake City, Minn.: The Saskatchewan is ahead of any other kind of wheat sown here. My yield was 25 bushels to the acre on land that has been cropped 24 years. Without a doubt it is the best and purest variety ever introduced into the country. The extra hardness and density of the kernel enables it to resist excessive wet and warm weather so that there was hardly a grain of it damaged last fall, notwithstanding the bad rains. In that item alone it would have paid the farmer big to have had his ground sown with this variety.\n\nDAVID D. JONES, Grand Forks, Dak.: The straw was just what a farmer would wish—about 4 feet high and none of it lodged. I sowed 7½ quarts which produced about 12 bushels of grain. The berry is excellent and I intend to sow it altogether on my place next year.\n\nCHRISTIAN BONNES, Hudson, Wis.: I sowed one-half a bushel and one quart on three-quarters of an acre, broadcast. It stooled enormously, and when ready to cut stood thick enough. The straw was stiff, heads long. I lost 5 or 6 bushels—yet, notwithstanding, I harvested 23 bushels from the 17 quarts sown. My brother sowed a half bushel and got 28 bushels. Some of my neighbors who have tried it say it has turned out big.\n\nJ. P. HOWE, Cresco, Iowa: Sowed four quarts and harvested four bushels. It made a vigorous growth. The straw was stiff and bright, stood up well and grew tall—some of it was 5 feet high. I found heads 5½ inches long—in fact the heads grew longer than any wheat I ever saw.\n\nC. C. WILLIAMS, Galva, Iowa: It grew stronger with me than the common fife and the straw was a darker green. I, with the majority of my neighbors, think it an improvement over the common fife, and that it would be the best wheat to sow on new land as first crop after breaking.\n\nJARED BENSON, Anoka: Sowed two bushels broadcast. It grew and stooled finely, and yielded me 40 bushels. Had it not been for a hail storm the product would have been much greater. I think it first-class wheat and all who have seen it say so too. Shall keep it all for seed.\n\nNELS CLEMMSON, Zumbrota: Blue Stem was nothing to compare with this kind. From one quart I raised 75 pounds of No. 1 Hard. It will pay any farmer around here to try it.\n\nCHRISTIAN AMOS, Jr., Dover Center, Minn.: I sowed 3 quarts of the Saskatchewan. It grew very thrifty, throwing up strong, healthy straw in big stools; The heads were long and the yield was 6 bushels from the 3 quarts, of No. 1 Hard grain. It was the nicest, thriftiest growing grain I ever saw and both myself and neighbors were astonished at its growth. The straw was a bright, healthy color, and in its vigor of growth it is far ahead of the old fife. A few witnesses of my crop were C. S. Amos, T. Britzins, G. M. Schmidt, and G. Stevens.\n\nMATTHIAS HANDEL, Chatfield, Minn.: The Saskatchewan is the best wheat ever raised here—so say all the farmers who have tried it. Mr. James M. Quisen is my neighbor and he introduced it here. A good many farmers have tried it and the result is that in a few years there will be no other wheat grown here. It beats the common fife from 3 to 10 bushels to the acre.\n\nWM. H. BUCHANAN, Gray, Dak.: The growth and development of the Saskatchewan is superior to the common fife. The berry is larger and plumper and the yield greater. I sowed two quarts and but for cattle breaking in should have had a fine yield. As it was I got from 2 quarts, 1½ bushels weighing 62 pounds to the bushel.\n\nPHILLIP WILLIAMS, Beaver Falls, Minn.: From 3 quarts I got 5 bushels. It is a vigorous growing wheat with dark green straw, and it will pay every farmer to try it.\n\nE. A. HEWITT, Barnesville, Minn.: It is the best wheat I ever saw. Mine yielded at the rate of 43 bushels to the acre. My neighbors all agree with me as to its superiority over the common wheat. I found 40 stalks from one kernel, while some of the heads were from six to seven inches long. It yields better and grades higher than the other fife, and the farmers will do well to sow it altogether and stop growing the common fife.\n\nW. R. MCLELLAN & Co., Greeley, Colorado: We sowed 9 bushels of the Saskatchewan on barren. It grew tall and the heads were very fine. The ground was rather soddy, but it came up and stooled well and was a very fine piece of wheat. The straw was very stiff and healthy and we thought it would go 50 bushels to the acre, but it hardly made the 40 in measure, but will in weight. The weight per bushel was 61 pounds. We are very much pleased with it.\n\nJOHN SAMON, Decornh, Iowa: I feel thankful to you for introducing the Saskatchewan fife wheat. It is the best we ever had around here. The straw is very stiff and the heads long. My yield was nearly 2 bushels from the one quart you sent.\n\nWM. CARLETON, Angus, Minn.: I overdid the thing on Saskatchewan—sowed it too thick. I put a bushel and a half on a little over an acre. It stooled so thick that it looked before it headed and then turned up its stem and headed far better than I expected. I sowed 23 bushels. Those who saw it grow all say \"I want some of it.\" I could sell what I have at a good price, but shall keep it all for my own use.\n\nD. PUMPELLEY, Lake Benton, Minn.: I am delighted with it. Mine did not have a fair chance being sown on a knoll in the middle of a field sloping either way on the poorest ground I had. The straw at the bottom of the slope was bright and strong with fine heads all well filled with round plump grains.\n\nE. W. STOCKING, Hutchinson: I sowed one peck of the Saskatchewan on one third of an acre, on new land, broken the year before, and not thoroughly rotted, so it did not have a fair chance. It grew well from the start, and stooled as well as any wheat I ever saw, and there was no indication of blight or crinkling down. The yield was 7½ bushels, weighed 61½ pounds. It is a very superior variety of hard wheat.\nEDWARD OEBTLIE, Grant, Dak.: The Saskatchewan is good for 80 bushels to the acre. Mine grew very vigorously, having a very dark green color and stooling well. It was cut fully one week after it was ripe and yet it stood up remarkably well.\n\nPHILIP TOBIN, Emsly, Dak.: \"I sowed one quart of wheat received from you on eight square rods of land. You can imagine some of its stooling qualities and growth and length of head when I tell you that I raised three and one-half bushels of first grade wheat, weighing sixty-two pounds to the bushel from it. This, if figured right, would be seventy bushels to the acre from two-thirds of a bushel of seed sown. Of course between this and common wheat there is no comparison. Judging from my experience with it, I think it is the wheat for this country.\"\n\nLUCAS BROS., Castalin, Dak.: \"We had one-third of an acre in Saskatchewan, sown by hand and harvested sixteen bushels of No. 1 hard wheat, weighing sixty-four pounds to the bushel. It excelled any wheat grown in the county.\"\n\nF. A. HEUBNER, Northwestern Seed Farms, Manitowoc, Wis.: I sowed five acres to the Saskatchewan and harvested 102½ bushels of hard No. 1 wheat. It grew slowly on the start, and was of dark blue color, but finally started up and grew to five feet in height. The straw was clean and stood our second better than common wheat in fact, it is more desirable in every way. The field when ripe was as yellow as gold, and when given a bushel to bind, I had but little loss in screenings because the berry was of uniform size. It is more productive than White Russian, and yields at least 35½ per cent more than common wheat. I have experimented with twenty-six varieties this season, and this beats them all.\"\n\nTERRITORY OF DAKOTA, COUNTY OF GRAND FORKS\n\nLARIMORE, Dak., December 12, 1884.\n\nBefore me personally came A. P. Hendrickson and deposes and says that this season he raised 3,647 bushels of Saskatchewan Fife wheat upon ninety acres of land, the same being an average of forty and one-half bushels per acre.\n\nA. P. HENDRICKSON.\n\nSubscribed and sworn before me this 12th day of December, 1884.\n\nM. W. SCOTT,\nNotary Public.\n\nYOUNG & INGALLS, Blue Earth City, Minn.: We had very satisfactory results from our crop, although the drought injured it some, yet it did first rate. The farmers about here think it is first-class. Our crop is even better than the seed sown, as it weighs 63 pounds to the bushel.\n\nH. C. DEAGER, Stillwater, Minn.: The Saskatchewan will produce at least ten per cent more than common wheat and of a much better quality. It is of a more vigorous and healthy growth, stools better and surpasses it in every way. I am perfectly satisfied with my trial with it.\n\nR. L. MERO, Diamond Bluff, Wis.: From seven quarts of the Saskatchewan, I got 23 bushels. This is at the rate of 100 bushels from one. It stooled excellently well and the heads were from four to five inches long. The growth was very vigorous and rank, and the color of the straw a rich golden yellow. The weight was 61 pounds per bushel of No. 1 hard.\n\nEUGENE W. WILLARD, Vilas, Dak.: The Saskatchewan has a dark, strong, healthy habit, and for vigor of growth I never saw its equal. It is a grand improvement over the common fife. I have great faith in it and I think it will pay all farmers to try it who want to raise No. 1 hard wheat. It takes less seed to the acre—if the ground is nice and clean, only 3 pecks, for it stools better than any wheat I ever saw.\n\nE. J. RAYMOND, Chippewa Falls, Wis.: I tried one quart of this wheat as an experiment. It grew rank and stiff and stood about 6 feet high. The straw did not crinkle down as my other wheat did. I got 122 pounds from the quart, but did not save it all. Am sorry now that I did not get more of it, for it will certainly pay farmers if they want to raise wheat to sow Saskatchewan in place of the common fife.\n\nEDWIN S. BECK, St Paul: I sowed two acres of the Saskatchewan. It was sown broadcast, stooled and headed well and yielded 26 bushel to the acre, thresher's measure. This, I think tells the whole story.\n\nTHOS. EDISON, Larimore, Dak.: I sowed one hundred acres of the Saskatchewan, broadcast. It stooled the best of any wheat on my farm and was the most vigorous wheat I ever saw growing. The straw was stiff, bright, and strong. It did not crinkle and fall down like other wheat. I harvested 4,225 bushels from the 100—an average of a little over 42 bushels per acre. It weighed 63 pounds to the bushel, which graded No. 1 hard.\n\nWM. H. RIDGEMAN, Bay City, Wis.: I tried a small quantity of the Saskatchewan last spring. It averaged over 30 bushels to the acre, notwithstanding it was not sown till the 8th of May, and stock got in and destroyed a part of it. It is well liked in this neighborhood.\n\nJOHANNES PETTERSON, Vasa, Minn.: I sowed 1¼ acres to Saskatchewan, broadcast. It was sown on clover breaking and the wild buckwheat choked it down, yet I got 54 bushels from the piece, weighing 63 pounds to the bushel. The wheat was even in height, and the straw bright and stiff. My common wheat went 20 bushels to the acre on the same field. My neighbors want to get some of mine, but I won't sell it—I want to buy some more. Common wheat had smut in it, the Saskatchewan none. I shall sow nothing but the Saskatchewan next year if I can get it.\n\nC. REIBSAMKEN, Wesley, Iowa: It is a great wheat to stool—found one stool of 63 stalks. It headed well, filled well, straw strong and tall. I want to purchase a few bushels more in the spring.\nTHE SASKATCHEWAN PIPE WHEAT.\n\nT. J. STEWART, Northfield, Minn.: I sowed one bushel and 2 quarts of the Saskatchewan on an acre. It stoolled splendidly—in fact, I had no trouble to find 25 to 40 stalks in a stool. It grew and headed splendidly and was far ahead of my other wheat from the time it was out of the ground until harvest. The straw stood 12 inches higher than my other wheat, and the yield was about 25 per cent better. I would not sell my crop for $100. The grain weighed 64 pounds to the bushel and graded No. 1 hard. I shall still sow one bushel and four quarts to the acre next year. Too much cannot be said in praise of this wheat for it was better in every way than my common wheat from the time it was out of the ground.\n\nWM. WERHAM, Miller, Forest Mills, Iowa.: I sowed sixteen acres, broadcast. The land was poor but I harvested a very good crop of wheat for this section, considering everything. I found the seed the newest and cleanest of any I ever saw. It stoolled better than other wheat here and produced 900 bushels from the 16 acres. It stools wonderfully and has very stiff straw. If mine had been sown on good land I am sure it would have produced double the crop. It will be a blessing to Iowa and Minnesota farmers to sow it.\n\nF. G. THIESEN, Independence, Wis.: I sowed my Saskatchewan where the ground was in poor condition, but it yielded 24 bushels to the acre of 62 pound grain. We had a bad storm here in July which beat down the other grain, but the Saskatchewan had such stiff straw that it stood up straight through it all.\n\nS. B. SWEEZY, Walla Walla, Washington Territory: The wheat obtained from you did not arrive until too late for sowing; yet I concluded to try it. I put it on what we consider poor land—dry and sandy, not expecting to have much of a yield—but I thought I would give it a thorough test and find out what it would do under unfavorable circumstances and on poor soil. I am fully satisfied it is the best grain that can be sown in Washington Territory. Mill men say they can well afford to pay at least 3 cents more a bushel for it than for common wheat. I have an offer of $1.00 a bushel for my whole crop as against 85 cents for common wheat, but of course will not sell. It weighs 61½ pounds to the bushel. The only fault I have to find with it is that it shatters if left in the field. We usually let our grain stand from 30 to 60 days after it is ripe. My yield from ¼ acres under the unfavorable conditions named above, was 27½ bushels.\n\nPATRICK HOLLAND, Kellogg, Minn.: The Saskatchewan yielded with me 10 bushels to the acre better than common wheat; in growth it was far ahead of it. The straw was strong, and bright as a crystal, and the grain had a better color than common wheat. I think it can’t be beat, and my neighbors say it was the best they ever saw.\n\nHENRY MOORE, Anarwink, Minn.: My Saskatchewan Fife wheat was by far stronger in straw and growth than the common fife. Its yield more than doubled the latter and both had the same care. It threw out from 20 to 30 stalks to stool, and stood about a foot higher than common wheat. I have been raising wheat for eleven years and never saw anything to equal it. All who have seen it say it is the purest wheat they ever saw. I would not take $5 a bushel for it.\n\nW. H. PLATT, Milnor, Dak.: The Saskatchewan that I bought of you last spring has done exceedingly well for the chance it had. It was sown late. Part of the land was broken in August and not backed up, yet it yielded one third better than common fife raised not 90 yards from it. There has been no wheat to compare with this section, with it, I have seen thousands of acres the past season—It will pay any farmer to sow his entire crop with it, even if he has to pay $3 per bushel for the seed. It was admired by every one who saw it. The straw was fully as long, and the heads much higher than the wheat about it, and stoolled much better. Neither did I find a kernel of smut in it. I desire to repeat here what I have said before, that if it was not for the Saskatchewan, I would not raise another bushel of wheat in Dakota. I never can thank you enough for persuading me to buy it for seed last spring, for it has proved a perfect God-send to me.\n\nASA OWEN, Alma City, Minn.: I sowed seven quarts of the Saskatchewan. I sowed it broadcast on a long narrow strip of land, and when it came up it looked so thin I thought it would not amount to anything, so paid no more attention to it. But it soon began to stool and beat anything I ever saw. It grew more vigorously than common wheat, had a better color, longer heads, and stiffer straw. Some of it was mixed with my other wheat in threshing, but I estimate the yield from the seven quarts at 9 or 10 bushels.\n\nJOHN THOMPSON, Westfield Center, Minn.: Sowed one quart and got a bushel of clean wheat weighing 62 lbs. to the bushel. It is a great improvement over any other kind of wheat. If it continues to do as well as it did last year it will supercede everything else. Several of my neighbors got seed of you last spring and had the same results.\n\nEUGENE J. WOODBRIDGE, Stewartville, Minn.: Sowed 10 quarts and harvested 14 bushels. It grew and headed finely—stalks long and filled clear to the top. The berry was nicer than any other wheat I ever saw, and the straw stood up stiff and strong. I am highly pleased with my investment and wish every farmer would try it.\n\nWALTER S. KNAPP, Big Lake, Minn.: My Saskatchewan yielded at the rate of 30 bushels to the acre of No. 1 hard. It was a great deal better than any other of our wheat.\n\nO. E. LAIRD, Mountain, Dak.: The Saskatchewan is just splendid. It was far superior in comparison with other wheat sown in this neighborhood. It had a vigorous growth, straw of a bright nice color. I took my neighbors out one day to show them a stool of 80 straws from one grain. I have taken a great liking to it, and think it a great improvement over all other sorts sown here.\n\nJ. GIFFORD, Lakewood, New York: I tried the Saskatchewan here in New York for experiment. It was badly injured by drought, but still it proved itself the best spring wheat ever grown around here. The straw is stiff and of a bright yellow; no sign of rust. The yield from one quart sown on 6 rods of land was close to one bushel. I weighed a half a bushel, and found we had 31½ pounds of wheat of splendid quality.\nTHE SASKATCHEWAN PIPE WHEAT.\n\nA. S. Van Patten, Courtland, Minn.: I sowed one quart of Saskatchewan on breaking of old pasture land with common rye on each side, so there was a good chance to compare it in growth, etc., with the other. It showed a stronger growth all the time, and at least was eight or ten inches taller with heads nearly as long again. It stood up well, nice bright straw, but ripened a little later. The grand harvesters, which were used on the wheat, could be brought to the machine and readily pull through. All eyes were on the half-bushel to see what the crop would be. Only twice, three times the machine had to go under the spout to the astonishment of all—and that too, after my disrespectful cows had given the shocks an airing one Sabbath day.\n\nGeorge Goodrich, Norwood, Minn.: The Saskatchewan is the best wheat ever raised on my farm. I sowed 2 quarts on 16 rods, drugged it twice over and thrashed from the feet; 3½ bushels, or at the rate of 35 bushels to the acre. Found some stools with 50 stalks in. It grew fast and had heads on from 3 to 7 inches long.\n\nGeo. H. Ball, Hazleton, Dak.: I think just enough of the Saskatchewan to say that it is the nicest wheat I ever saw. It grows vigorously, stands up well and has long even heads.\n\nJonas Granstand, Marine Mills, Minn.: Sowed one bushel on one acre, and got 35 bushels of No. 1 hard. If it keeps on at this rate it will be a great improvement.\n\nW. E. Crawford, Denver, Dak.: The Saskatchewan grows rank and has a good healthy color, and is from 6 to 8 inches taller than common rye. Just as mine was going out of the milk the hail struck it and cut it so badly that I cannot say much for it, but I am confident it would have gone 40 bushels to the acre. It will pay any man to raise it in place of common wheat. It is better and I know it.\n\nLester Wakeham, Akron, Iowa: I sowed the Saskatchewan on a low rich piece of land and the weeds came up so thick that I had to mow them down, but they injured the crop greatly. I think it is better than common rye; I would have got double the crop. But it did well for the chance is bad. The yield was 25 bushels from two bushel of seed. It stalked better than any seed I ever saw, and I have sowed nine different kinds.\n\nPatrick McKenna, Shieldsville, Minn.: For fine appearance and color of straw, it is second to none, and for vigor of growth and productivity I doubt much until the right kind of cultivation, there is any other kind of wheat now grown that can equal it. I would recommend all farmers to give it a fair trial and I think they will not be sorry for it; for I am sincerely of the opinion that it is far ahead of all other kinds of wheat known to me.\n\nJohn F. Falley, Hamilton, Minn.: The straw is stronger and of a better color and head larger than the largest of common rye. It is great wheat to stool, averaging from 15 to 50 stalks.\n\nLucius Byington, Ellin, Wis.: From one quart I raised 40 quarts. It is splendid wheat to stool, and better than any wheat I have ever grown.\n\nGeo. Weaver, R. Ripley, Minn.: It is a long ways ahead of common rye. I had stools of 40 stalks from one kernel. My yield from one quart was one hundred pounds of No. 1 hard wheat. I want to get some more of it next spring.\n\nF. Briggs, Stillwater, Minn.: Your Saskatchewan wheat is nice. A great many favorable remarks were made about it last year by those who saw it growing. It headed better than any wheat I ever raised. I am going to sow what I have and wish I had more of it. My yield was one bushel from one quart.\n\nJ. M. Powers, Sparta, Wis.: I sowed one bushel of Saskatchewan with a seeder, and the thing got to hulling, and instead of getting it on an acre we only got it on a half an acre. It was sown May 3d and harvested August 5th. Where it did not lodge and where the chinch bugs did not hurt it, it averaged from 40 to 60 bushels to the acre.\n\nA. L. Dore, Huntley, Minn.: The Saskatchewan is the best sown in this part of the State, or any other. It stools a No. 1, and heads better than any other wheat.\n\nErie Jonason, Stark, Minn.: The Saskatchewan is a splendid wheat. One thing that I noticed about it—that the straw appeared to be very sound after a rain storm. The old kinds are liable to rust after a rain. This wheat will \"increase like stars in the firmament\" in this section.\n\nOle Johnson, Bird Island, Minn.: I like the Saskatchewan better than any wheat I ever saw. It is a great improvement over the common rye. Every one who saw it remarks the same. The straw is nice and bright, and the kernels big and plump. Mine weighed 63 pounds to the bushel.\n\nO. R. Hamer, Oldenberg, Dak.: The Saskatchewan is the wheat for this country. That's what I and my neighbors think of it. It did splendidly for me.\n\nJames Hamarz, Castlewood, Dakota: It is conceded here by our best farmers, far superior to anything we have ever raised here. The average here now of common wheat is about 34 bushels per acre. The yield of the Saskatchewan with 35 to 100 bushels from 4 bushels of seed. It is very vigorous growing wheat, some stools having as high as 50 stalks. The land was not in as good condition for a crop as we wanted it, yet still we are well satisfied with the results.\n\nIsaac Waldron Dean, Rice County, Minn.: I raised two bushels from one quart. It was sown on new land, and the straw and heads were large. I think it will prove to be the best kind of wheat for farmers to raise in this section.\n\nC. Battey, Owatonna: I sowed one bushel on one acre broadcast. I tried it by the side of common wheat, sowing of the latter one bushel and ten quarts to the acre. The yield of the Saskatchewan was 25 bushels; of the other 18. The straw was coarser, and taller, and the heads longer. The weight was 61 pounds to the bushel.\nC. F. AGETON, Lake Benton, Minn.: The Saskatchewan double discounts the common fife. If any of those who have always raised soft wheat, will take my advice and raise the Saskatchewan, it will put them on the way to prosperity, and the buyers will not smut them as they do now.\n\nL. BRUITH, Marine, Minn.: Those who availed themselves of the opportunity to try the Saskatchewan have done themselves incalculable benefit. It is a splendid variety. My yield from one quart was 2¼ bushels of No. 1 hard, weighing 61 pounds to the bushel.\n\nSPENCER HAWLEY, Barnesville, Minn.: My wheat did not have a fair chance. Mr. Wm. Barton, my nearest neighbor, living in Section 10, Township 139, Range 45, raised from one quart of the Saskatchewan, he sent his son last spring, three bushels. I cannot tell the amount of land he sowed it on, but the yield was at the rate of 90 bushels from one.\n\nC. P. JONES, Sabin, Minn.: My average on 05 acres was 81 bushels to the acre, as against an average of 18 bushels for common wheat. It is the best wheat in existence today.\n\nWM. FAULKNER, Colgate, Dak.: The Saskatchewan is certainly superior to any variety grown here. I tried 70 acres of it, and although it was sown very late, yet it surpassed other wheat about here, both in yield and quality. My average on one piece was 25 bushels to the acre which I am confident would have run over 50 bushels if it had been in season.\n\nJ. N. BRUNDAGE, Dawson, Dak.: I sowed 50 acres of the Saskatchewan got of you last spring, and the yield was 1,800 bushels of beautiful No. 1 hard wheat. Had the blackbirds let it alone, I would have had at least 2,000 bushels from the field. I find it to be a superior wheat in growth of straw, vigor of growth and productiveness, yielding from 50 to 100 per cent better than the run of fife about here, and what is better still, it seems to be smut-proof. It is a great improvement over all other wheat.\n\nIn a table published in our last year's pamphlet of this wheat, we endeavored to make some comparisons as to the relative yield of the Saskatchewan and common fife. We based the increase of the former at 25, and of the latter at 15 fold. The tables were as follows, for five years, from one quart sown:\n\n| Saskatchewan Fife | COMMON FIFE |\n|------------------|-------------|\n| Amount Sown      | Production  |\n| First year       | 1 quart     |\n| Second           | 1 bushel    |\n| Third            | 25          |\n| Fourth           | 625         |\n| Fifth            | 15,025      |\n\n| Amount Sown      | Production  |\n|------------------|-------------|\n| First year       | 1 quart     |\n| Second           | 20          |\n| Third            | 15 bushels  |\n| Fourth           | 225         |\n| Fifth            | 8,375       |\n\nMr. J. F. Houston of Bathgate, Dak., completely upsets the above estimate by the following report:\nIn 1883 I sowed one quart. It grew well and ripened immense heads. The yield was three bushels and 38 pounds. I sowed that amount on 3¾ acres, broadcast, and harvested 300 bushels of splendid wheat. It grew stouter and headed much better than the common wheat grown alongside of it under the same conditions, and all who saw it grow are anxious to get some of it for seed. It is certainly a great improvement over the common fife.\n\nTaking the report of Mr. Houston as a basis for estimate, and the production at the end of 5 years from a single quart is almost beyond belief. His yield was 37-1/7 bushels per acre the second year from the 3¾ bushels sown. Next year at the same ratio he will have 4,827 bushels, and the fourth year 179,288; while the fifth year his product will amount to the enormous figure of 6,659,268 bushels, as against 50,000 bushels from the common fife.\n\nThe following testimony is from an old resident of Minnesota, who is engaged in milling—Mr. James M. Cussons, proprietor of the Elmira Flouring Mills at Chatfield, Minn. Two years ago Mr. Cussons purchased one bushel of the Saskatchewan of us, paying therefor $20. He resides in a section of the State—Southeastern Minnesota—where wheat growing has largely been given up owing to decreasing yields each year. From 25 bushels to the acre 20 years ago, the average production has dropped to about one-half that—hence the greater importance of his statement. His experience with this first bushel was given to the public last winter, and was as follows:\n\n\"The wheat is the best I have any knowledge of. It has yielded one-third more to the acre with one-third less seed, than my common fife under the same cultivation, and is worth 10 cents more per bushel for flouring than soft wheat. It stood from two to three times as well, the straw being bright yellow. It stood uniformly well, averaging five feet in height. The heads were one-third longer, many measuring upward of six inches. From one bushel sown I got 30 bushels of No. 1 hard wheat, of a beautiful amber color, weighing 59½ pounds in the \"brass kettle.\" I am well satisfied with the investment I made last spring, and shall buy some more for next season's sowing, as what I have is not enough to occupy me. I am convinced of this wheat is the best investment a farmer can make, and the State could not do as much for the prosperity of the people in any way I know of, as it would by distributing one quart free to every farmer who would sow it.\"\n\nFor last season's sowing, Mr. Cussons purchased of us at various times 120 bushels. This he distributed among the farmers of Fillmore and Olmsted counties in small lots, with the design of getting it disseminated as widely as possible. After ordering 30 bushels out of the 120, and letting it out, he sent in a second order for 80 bushels and accompanying it was the following private letter:\n\nELMIRA MILLS, CHATFIELD, MINN., Dec. 14, 1883.\n\nThe thirty bushels of Saskatchewan Fife wheat you shipped me December 6th has arrived. I compared it with the sample sent in November—the two are identical. I tried it with the tester—it weighed 61½ pounds to the bushel. I weighed it in bulk—down weight had been given sufficient to cover all ordinary loss in shipping. The wheat is equally pure with the bushel I bought of you last spring.\nI have disposed of the thirty bushels I raised last fall, and shall soon have this last lot engaged; then you will receive another order from me. I have made arrangements with thirty-two farmers, (all of them tributary to our mill) to take this wheat and expect to double their profits. All who say it grudgingly or threadbare must come, as it beats the best crop in any other part of the eight bushel variety. If seeds have been sown when known to be worthless, as a business investment, millers do not take heed and help introduce it. There is more money made by devoting their time in that way, than studying how to get yields and quality out of the soft wheat, they are now either compelled to grind or lie idle. I figure as follows: Sixty bushels distributed among forty farmers, at the low estimate of twenty bushels to the acre (one-third less than I got,) is 1200 bushels. If all who sow the new season at the same yield per acre acquire 46,000 bushels. The \"Canada\" variety, from the soil of January, will command no grinding on a crop of wheat that will insure sixty cents more for flour out of half a hundred bushels. So much for the millers. The farmer is still ahead, viz.: By sowing, next spring, sixty bushels, and the ensuing spring its product, the ten cents premium it is worth for milling, over soft wheat, will bring him $2,400—saving nothing about the extra five to eight bushels per acre he is almost sure to raise. He cannot afford to lose the chance of sowing Saskatchewan Fifo Wheat this coming spring.\n\nYours in sober earnest for the benefit of the whole people.\n\nJAS. M. CUSSONS.\n\nMr. Cusson's success the past season was equally satisfactory. Under date of January 14, 1885 he writes: \"I have reports from 23 of the farmers who sowed the Saskatchewan—none of whom had less than one bushel of seed. The total yield was 675½ bushels from 35¼ bushels of seed sown, or an average of nearly 25 bushels to the acre. I, myself, raised 178 bushels from 6 bushels of seed sown.\"\n\nHe is as confident as ever of its great value and looks forward to the near future when that section will once more begin producing an average yield of twenty-five bushels to the acre.\n\nTHE EVIDENCE SUMMED UP.\n\nIt would be useless for us to multiply further proof. The fact must now be pretty conclusively established in the mind of the reader that the Saskatchewan Fifo Wheat is an improved variety of grain; that it is possessed of unusual vigor and healthfulness, and that for productivity it has not its equal in the country, even among the soft wheats. It has certainly exceeded the expectation of its originator who had not hoped for anything better than an average production from it to the acre, of from 20 to 25 bushels, while it has actually ranged all the way from 25 to 50. Sown side by side with common wheat, under the same conditions, it has doubled and trebled it in its stooking qualities and yielded from 50 to 100 per cent more of grain of much better quality. This propensity of the wheat to stool is one of the most remarkable things about it. From several hundred letters lying before us referring to this quality of the wheat, we extract the following in the order in which the letters lie: \"It stooled splendidly,\" Charles Allen, Charles City, Iowa. \"Stooled from 15 to 75 stalks to a kernel,\" Chas. Hoey, Denver Dak. \"It stooled very heavy,\" E. H. Gates, Redwood Falls, Minn. \"Stooled good,\" J. S. Fountain, Frontenac, Wis. \"From 25 to 20 large stalks to a kernel,\" Amos Cushman, Montevideo, Minn. \"Stooled very well,\" Wm. Ramage, Northfield, Minn. \"Stooled very good,\" J. M. Armquest, Star Prairie, Wis. \"It stooled wonderfully,\" P. Hessman, Belle Plaine, Minn. \"It stooled heavy,\" J. H. Tny, Canton, Minn. \"Stooled very good,\" J. A. Bride, Jr., Augusta, Wis. \"Stooled good,\" John Wright, Silver Creek, Minn. \"Stooled very heavy,\" T. S. Edison, Larimore, Dak. \"Stooled 25 stalks to a kernel,\" L. Chellin, Alexandria, Dak. \"Stooled better than any wheat I ever saw,\" L. Livingston, Farmington, Minn. \"Stooled immensely. I send you by this mail a stool containing 108 bearing stalks;\" C. J. Johnson, Brandon, Minn.\n\nBut if it stooled well, what shall we say of yields. Many are so large as to almost surpass belief. One man says \"I will not report it for, it was so large that I know my statement would be doubted.\" But let us again at random run over this pile of letters and make a few more extracts. They are nearly all from men who took the wheat from us for a premium through the Pioneer Press last winter, and if anyone wishes to verify their statements they have only to write them and enclose stamp for reply. \"From 2 quarts I raised 290 pounds,\" L. Livingston, Farmington, Minn. \"From one quart I raised 2 bushels and 20 pounds,\" Robert Grice, Mankato, Minn. \"From 5 quarts I raised 10 bushels of grain, struck measure, weighing 66 pounds to the bushel. It is the best wheat I ever saw for quantity and quality,\" T. S. Everett, Clayton, Minn. \"From one quart I raised 1¼ bushels. It is far ahead of common wheat,\" A. E. Ten Eyck, Wayzata, Minn. \"From one quart I raised 3½ bushels,\" George Loyd, Killkenny, Minn. \"From one quart I raised 2 bushels,\" H. A. Aldrich, Medo, Minn. \"From one quart I raised 2 bushels and 2 quarts on 8 rods, or at the rate of over 40 bushels to the acre, against 22 for the common fifo. My neighbors could scarcely believe the extraordinary turn-out,\" P. Smith, Jr., Albion, Minn. \"From an eighth of an acre I raised 5 bushels. It is the wheat to raise over all other kinds. The heads were so heavy that they fairly lopped over,\" O. W. Tiffany, Norwood, Minn. \"My famous Saskatchewan Fifo turned out splendidly and is the finest and purest seed now in the country,\" Geo. J. Longfellow, Buxton, Dak. \"From 1 bushel and 20 pounds I raised 30 bushels and 25 pounds,\" C. Hanson, Hammond, Wis. \"From one quart I raised 1¾ bushels. It yielded better than any wheat I ever saw,\" O. M. Townsend, Charles City, Iowa. \"From one quart I had 140 pounds. It beat anything I ever saw,\" E. Bowen, Mapleton, Minn. \"From 2 bushels I raised 4 837 pounds. I goes ahead of anything I ever saw,\" Samuel Speakman, Everett, Dak. \"From one quart I got 4 patent pails full. It is the 'boss wheat' for this country,\" Alex Dodds, Sheldon, Dak. \"My wheat yielded\nat the rate of 35 bushels per acre. It is the best I ever saw,\" L. Chilling, Alexandria, Dak. \"From one quart I raised 2 bushels. Everyone who saw it said it was the nicest they ever saw. I shall sow nothing else as soon as I can get enough seed,\" J. H. Burns, Bartlett, Dak. \"From 2 quarts I got 2 bushels and one peck. It is a big improvement over all other kinds. Anyone wanting a new variety cannot do better than to sow it,\" J. A. Bridgman, Augusta, Wis. \"It is far ahead of all other wheat. I raised 1½ bushels from one quart,\" J. M. Armquest, Star Prairie, Wis. \"It is the best wheat in the United States. It yielded 50 per cent better than common wheat. My neighbors want to get some of mine for seed, but I can't spare a bushel,\" O. G. Veldy, Billiards, Minn. \"My Saskatchewan went just double my common wheat. It is a big improvement,\" Amos R. Cushman, Montevideo, Minn. \"From one-fourth of a bushel sown on one-fourth of an acre I raised 11 bushel of choice wheat. It was far ahead in growth, color of straw, yield and quality of all other grain I have ever seen. It went 10 bushels better per acre than common wheat,\" E. H. Gates, Redwood Falls, Minn. \"My yield from one quart was 1½ bushels. In growth it beats all the wheat I have ever sown. I shall try 3 pecks to the acre next season. I had my neighbors come and see it, and they pronounced it the finest wheat they had ever seen,\" C. Hoey, Denver, Dak.\n\nWe have on file a great mass of similar testimony, which we should be glad to show any one who desires to look it over, and might go on multiplying endorsements here, but it is unnecessary. We will, however, give the following which is the most remarkable of all:\n\n\"A REMARKABLE YIELD.\"\n\nIn our last year's catalogue we made the following statement: \"We expect another year to hear that there have been those who have sown this grain by the acre and have obtained fifty bushels of No. 1 hard wheat in return. This can only be accomplished on new strong land and by thin seeding.\"\n\nTo Mr. Charles Le Vesconte, of Hastings, Minn., belongs the credit of having actually accomplished this prediction. Mr. Le Vesconte, we will say, is a prominent citizen of Hastings, and thoroughly reliable, as we know by many years acquaintance. \"I sowed,\" he says, \"one bushel and a peck of the Saskatchewan on one and a half acres of land. It grew luxuriantly and stooled immensely, many stools ranging from 25 to 75 heads. The chinch bugs began to work on it quite early and I expected very little from it. Still it got so heavy that a good deal of it went down before I could cut it, so that I reckon there must have been at least one-fourth wasted. Judge of my astonishment then, when we threshed, to find we had 7½ bushels of wheat, which I feel sure will weigh out 75 bushels, from the bushel and peck of seed sown on one and a half acres of land.\"\n\nNow what do these reports, gathered from every quarter, mean? They mean that within 3 years from this date all Minnesota, and in fact the whole Northwest will be growing the Saskatchewan fife, instead of from 12 to 20 bushels to the acre being raised, there will be a general average of from 20 to 40 bushels grown. It means that the farmer who now raises wheat at a cost of 50 cents a bushel and sells it at 75 cents, actually making a profit of but from two to three dollars from an acre, will make twice or three times that sum. Supposing, for instance, that he has a hundred acres in common wheat. The yield we will say is 1,500 bushels. Supposing the cost of raising to be, as generally estimated by wheat growers, 50 cents a bushel. This makes a total cost of $750. It sells, we will say, for 75 cents a bushel, making a total of $1,125. Deduct the cost of raising, and it leaves a profit of $375 from the one hundred acres.\n\nA hundred acres of Saskatchewan fife ought safely to yield 2,500 bushels of hard wheat. The cost to raise it will be, at 50 cents a bushel, $1,250. Selling at 75 cents a bushel it brings $1,875. Profit on the crop, $625, or nearly double that of the other. Which will it pay to sow?\n\nSMUT.\n\nFrom the facts before us it would appear that the Saskatchewan is a smut proof wheat. Being a hard wheat and full of vigor, it, of course, is less liable to attacks of the disease than the soft and run out wheats are. \"But it is no guarantee against smut,\" says a former Commissioner of Agriculture, \"to use seed which has been entirely free from it during its growth, for it is a fungous plant which exists even in the air itself and may at any time be brought into contact with your grain. But fortunately there is a safe and sure remedy against it in the use of blue vitriol.\" Now, what is smut? It is a blasted kernel which turns to a black powder when ground and discolors the flour. It is caused by a fungous growth which flies from field to field and fastens itself on the growing wheat. It is communicated also by threshing machines which break up the smut balls and scatter the black spores over the grain. It can be prevented by the use of blue vitriol. For 25 bushels of wheat take 5 pounds of blue vitriol, costing in Minneapolis, 15 cents a pound. Dissolve it in hot water and dilute with water to three pails full. Put your wheat in a pile on the floor six inches deep and pour the water over it. Take a shovel and shovel it all over so as to get the water on every kernel. After standing a day, take dry slacked lime and sprinkle over it and shovel over again. The total expense to fix 25 bushels will not be over $2, while it may save you two grades on wheat. The blue vitriol—or blue stone, as it is called—can be obtained by sending to Pabody & Whittaker, in Minneapolis, in 5 pound lots at 15 cents.\nTHE SASKATCHEWAN FIFE WHEAT.\n\nper pound, or in 10 pound lots at 12½ cents per pound, if you cannot get it in your own town. It is a sure preventive against this disease.\n\nIn some localities in this State and Dakota the smut was so bad in fields of common wheat that they were not cut at all, everything in the locality being contaminated.\n\nTHE FIRM OF W. J. ABERNETHY & CO.\n\nTwo years ago the firm of W. J. Abernethy was organized, consisting of W. J. Abernethy, of Minneapolis, and Hendrickson Bros., of Larimore, Dakota. The firm has raised on their own land nearly 25,000 bushels of the Saskatchewan Fife. On one field at Larimore, of 90 acres, as will be seen by Mr. Hendrickson's sworn statement, the average yield was 40½ bushels to the acre. On this farm the wheat weighed 61½ pounds to the bushel, and grades No. 1 hard. All the Larimore wheat was caught in the storms which generally prevailed in that section after harvest, and is not quite so high a color as year.\n\nOUR TERMS, AND HOW TO ORDER.\n\nOur terms are cash in advance. The fact that our customers are scattered all over the whole Northwest makes this decision necessary. Send money by draft, money order, express order, or registered letter. Parties desiring car lots had better come to Minneapolis and see us.\n\nPRICES FOR 1883.\n\n| Lots                  | Per Bushel |\n|-----------------------|------------|\n| In single bushel lots, Sacks included | $3.00      |\n| \" lots of from 2 to 10 bushels, Sacks included | 2.50       |\n| \" 15 to 25            | 2.25       |\n| \" 50 to 100           | 2.00       |\n| \" Car lot in bulk     | 1.50       |\n\nParties ordering over 25 bushels may ship sacks to us by freight at our expense.\n\nThese prices are net. Freight charges must be at the expense of the purchaser. All small orders will be filled from Minneapolis. Large ones from our farms in Northern Dakota. In ordering, state distinctly how you wish it sent, whether by freight or express; and over what roads.\n\nOUR BUSINESS REFERENCES.\n\nIf any one wishes to know about us, we refer them to the banking house of V. G. Hush, Minneapolis or Bank of Minnesota, St. Paul; to Hon. Jno. S. Pillsbury, ex-Governor of Minnesota; Geo. A. Pillsbury Mayor of Minneapolis; C. A. Pillsbury & Co., Millers; Washburn, Crosby & Co., or in fact any millers of Minneapolis; to Prof. E. D. Porter, professor of Agriculture, State University, or to any of the parties named in this circular who have furnished testimonials.\n\nSEND FOR CIRCULARS.\n\nIf you want this pamphlet sent to any of your friends we will mail it to them free, on receipt of their address. When you have finished reading this one, please pass it to your neighbor. Address us at 42 Third Street South, 'Union Building,' Minneapolis Minn.\n\nW. J. ABERNETHY & CO.\n$200.00 IN CASH PREMIUMS\nFOR THE LARGEST YIELD OF\nPearl of Savoy Potatoes.\n\nThis new variety is the earliest in cultivation, and offered by us for the first time. It is the result of a Hybridization of the two favorite sorts, Clark's No. 1, and Extra Early Vermont. It retains the good qualities of both, and is a great improvement over either sort. The tubers are oblong, fair and of large size; the flesh is of a most beautiful pearl white, and its hardy vigorous habit exempts it from disease when many old varieties succumb. It frosts ten to twelve days earlier than the Early Rose, and is very productive, yielding from 450 to 500 bushels per acre, under favorable conditions. We have but a limited quantity of this superior new seed, and would advise early orders from all wishing to try it this year. Orders will be filled in rotation as soon as weather will permit.\n\nSTRONG TESTIMONY.\n\nThe Rural New Yorker, the highest American authority, says in its issue of August 30th, 1884, \"The Pearl of Savoy yielded in the Rural trial grounds at the rate of $99.09 bushels to the acre, and was the Best Potato out the 77 Different Varieties Tested.\" Price—per peck, $1.00; per bushel, $3.00; per barrel, $6.00.\n\nCAUTION.\n\nThe extreme earliness, wonderful productivity and superior quality attending the introduction of the Pearl of Savoy Potato may induce unprincipled parties to sell other potatoes under the name of Pearl of Savoy. We hereby caution those desiring to compete for premiums, that the potatoes must be obtained direct from us or our agents. Be sure the barrels containing the Potatoes are STENCHED with our name and address, Northrup, Braslan & Co., 22 Bridge Square, Minneapolis, Minn., who have decided to offer premiums to the amount of\n\n$200.00 FOR THE LARGEST CROP\nProduced from One Bushel of Pearl of Savoy Potatoes,\n\nTHE PREMIUMS TO BE DIVIDED AS FOLLOWS:\n\n$100.00 for the largest yield. $50.00 for the second largest yield.\n$35.00 for the third largest yield. $15.00 for the fourth largest yield.\n\nAll competitors for the premiums mentioned above must send us a certificate on or before November 1st, 1885, of the amount of Potatoes planted, an average sample of the crop, of whom procured, and the number of bushels produced, a certificate to be sworn to before a Justice of the Peace residing in the town where the Potatoes are grown, and witnessed by two citizens. The prizes will be awarded on or before November 15, 1885.\n\nOur catalogue for 1885, containing all the new and choice varieties of Vegetable, Field and Flower Seeds, will be mailed free to all applicants.\n\nNORTHRUP, BRASLAN & CO.,\nSEEDSMEN,\n22 Bridge Square, Minneapolis, Minn.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001192.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 27, "total-input-tokens": 39024, "total-output-tokens": 25370, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1252, 3], [1252, 2374, 4], [2374, 2374, 5], [2374, 2543, 6], [2543, 5469, 7], [5469, 11136, 8], [11136, 17139, 9], [17139, 23094, 10], [23094, 28366, 11], [28366, 34275, 12], [34275, 39857, 13], [39857, 45747, 14], [45747, 52406, 15], [52406, 58291, 16], [58291, 63809, 17], [63809, 70187, 18], [70187, 75957, 19], [75957, 82122, 20], [82122, 88417, 21], [88417, 94118, 22], [94118, 94118, 23], [94118, 94118, 24], [94118, 96891, 25], [96891, 99561, 26], [99561, 99561, 27]], "primary_language": ["en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]