[{"id": "1978a0ef1eb9a2f4036eee7ecadc983e9293543c", "text": "RIEL CONTRE L'ÉGLISE CATHOLIQUE.\n\nUX CANADIENS-FRANÇAIS.\n\nIl y a quinze mois que la Province de Québec est bouleversée par la pendaison de Riel. Sans entrer dans le mérite de la question, on peut et on doit se demander si la cause des Métis catholiques et la cause de Riel se confondent tellement qu’elles ne font qu’une. Ceux qui veulent blâmer l’exécution de Riel parce qu’il était fou rendent un mauvais service aux Métis, en laissant croire qu’ils se faisaient conduire par un lunatique. Ceux-là sont donc obligés de faire une distinction entre la cause des Métis et celle de Riel.\n\nCeux qui veulent poser Riel comme un héros et une victime, n’ont aucun égard pour la cause et les intérêts des Métis ; car il a été prouvé que Riel a été un apostat et a rudoyé les religieuses et emprisonné les prêtres de sa paroisse. Afin que personne ne puisse douter de cette affirmation, voici un document écrit de la main même de Riel et trouvé dans ses papiers. Il est en anglais ; mais nous en donnons la traduction.\n\nQuand on y aura vu la manière dont il traite le pape et les prêtres, on comprendra que c’est faire injure aux Métis que de persister à glorifier cet homme comme leur chef. Les Métis, qui ont élu l’Hon. M. Larivière, par acclamation, M. Jolly (Joly), conservateur, par acclamation, et qui viennent d’élire M. Ross, par acclamation, nous donnent une leçon.\nJustice a été depuis rendue aux Métis, qui ne se plaignent plus. Qu'avons nous donc à crier nous-mêmes. Dites-nous, si après avoir lu ceci, vous pouvez encore faire l'éloge de Riel et si vous serez bien pressés d'appeler cet homme \"votre frère.\"\n\n(Traduction)\n\nLes membres Métis français du gouvernement provisoire de la Saskatchewan\n\nSE SONT SÉPARÉS DE ROME\n\net la grande masse du peuple a fait la même chose. Si nos prêtres voulaient nous aider ! Jusqu'à ce jour, nos prêtres se sont montrés opposés à abandonner Rome. Ils veulent nous gouverner d'une manière opposée à nos intérêts et ils veulent continuer à nous gouverner selon les dictées de Léon XIII. Chers Frères en Jésus-Christ, veuillez, pour l'amour de Dieu, venir à notre secours, afin que l'entreprise contre Rome soit un succès. Et en retour, nous ferons tout en notre pouvoir pour assurer nos droits politiques.\n\nVotre,\n\nLouis \"David\" Riel.\nEx-Ovide\n\nS'il y a eu des injustices dans le Nord-Ouest, voici la preuve que le gouvernement conservateur du jour a su les réparer. Le tableau suivant montre ce que l'on a fait pour les Métis dans les Territoires du Nord-Ouest.\n\nQuantité de réclamations des Métis des Territoires du Nord-Ouest reconnues par le gouvernement.\n\n| ANNÉES       | RÉCLAMATIONS |\n|--------------|--------------|\n| De 1874 à 1878 | Aucune       |\n| De 1878 à 1883 | Aucune       |\n| De 1884 à 1886 | 2,845        |\n\nToutes ces réclamations ont été réglées depuis le 1er janvier 1885.\nThe French Half-breed members of the Provisional Government of the Saskatchewan have separated from Rome and the great mass of the people have done the same.\n\nWe do not reject our priests if they are willing to leave Rome.\n\nIf our priests were willing to help us and to\n\nup to this time, our priests have shown themselves unwilling to leave Rome. They wish to govern us and in a manner opposed to our interests, and\n\nThey wish to continue and govern us according to the dictates of the Shorthands\nDear Brothers in Jesus Christ, please come and help us for the sake of God and for the cause and help us so that enterprise against Rome may be a success and in return we will do all in our power to secure our political rights.\n\nYours, Louis \"David\" Kel. Exodus.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001416.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8442, "total-output-tokens": 1193, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1367, 3], [1367, 2835, 4], [2835, 3332, 5], [3332, 3594, 6]], "primary_language": ["None", "None", "fr", "fr", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]