[{"id": "7a91eec1153fc10fcff6a414df4d752ac6ec2c7a", "text": "COPY OF OFFICIAL DIARY OF LIEUT.-COL IRVINE\n\n1835.\n\nLieut.-Col. Irvine. Inspector W. Fraser.\n\n18th March, Wednesday.—The detachment of the North-West Mounted Police, consisting of the commissioner, three inspectors, seven sergeants, three corporals and 79 constables, with 66 horses, left the barracks at Regina en route for Fort Carlton shortly after 6 a.m., and proceeded to Pi-a-pot's reserve, camping there for dinner. The morning was cool, with light breeze from the N.W. Roads very good but snow going fast; prairie generally bare of snow; only frozen snow on the trail. In afternoon proceeded down the Qu'Appelle Valley to Musquopeton's place, and camped there for the night. No water could be got for the horses at noon, as the Qu'Appelle River was frozen solid to the bottom.\n\n19th March, Thursday.—Reveille at 3:30 a.m. Broke camp and left Musquopeton's place at 5:30 a.m. and went into Fort Qu'Appelle. Roads good, but country generally pretty bare of snow. Arrived at Fort Qu'Appelle at 9:45 a.m., and remained there for dinner. The commissioner got three more teams of horses and sleighs, also took one team and sleigh from the Qu'Appelle detachment. Started out again at 4 p.m., and travelled over good roads, nine miles, to O'Brien's, and camped for the night there.\n\n20th March, Friday.—Reveille at 3:30 a.m. Broke camp and started at 5 a.m.; proceeded to House's place, 26 miles over good roads; weather cold and cloudy in morning. After halting for dinner, proceeded to Touchwood and camped at the mail station, about a mile behind the Hudson Bay Company's post. Road still good. Had a slight fall of snow today.\n\n21st March, Saturday.—Reveille at 3:30 a.m. Broke camp and started at 5:30 a.m.; morning cold and cloudy; roads good through the Touchwood Hills. Having got water for the horses, camped for dinner shortly before coming on to the Salt Plains. In the afternoon moved across the plains to the mail station, where we arrived at sunset and camped; weather bright and fine in the afternoon, with cold wind from the N.E. While in camp at Salt Plains, 21st March the commissioner received the following letter—the first notification of difficulties ahead.\n\n\"CARLTON, 19th March 1835.\n\n\"Sir,—I have the honor to inform you that the half-breeds seized the stores at South Branch today.\n\n\"Mr. Smith, Indian agent, Walters, merchant, two telegraph repairers and Mr. Mitchell, of Dufferin Lake, are prisoners.\n\n\"Beardie's Indians joined the rebels this afternoon; the wire is cut. The rebels are assembled on south side of river; prisoners are held in the Roman Catholic church, about a quarter of a mile up stream from crossing.\n\n\"All One Arrow's band of Crees joined the rebels this afternoon; many of Beardie's also joined them; all Beardie's will probably follow tomorrow; number of rebels assembled this afternoon estimated at from two to four hundred men; they will rapidly increase in numbers.\n\n\"My impression is, that many of the Indian bands will rise. The plan at present is to seize any troops coming into the country at the South Branch, then march on Carlton, then on Prince Albert. The instructor leads One Arrow's band; he is a half-breed.\n\n\"(Signed), L. N. F. GROZIER.\n\n\"COL. IRVINE, Commissioner.\"\n22nd March, Sunday.—Broke camp early, as usual; weather bitterly cold crossing the Salt Plains. One constable (Pocock) got both feet badly frozen, and Serg. Nobbs was off duty snow-blind. Halted for dinner when across the Salt Plains; in afternoon proceeded on to Humboldt mail station and camped for night there. It was very windy all night. The officer's tent was blown down before midnight.\n\n23rd March, Monday.—Intelligence arrived this morning, after we had started, that Hoodoo mail station was attacked by the rebels and sacked by a party of from 12 to 20 men. All the provisions and grain there were carried off by the rebels, but the hay was left untouched. We overtook a freighter with oats, whom the rebels had stopped; owing to their being in cutters, they could not take his oats along with them, and we got them. Broke camp, and started early, as usual. Bitter cold wind, with driving snow from the N.E., all morning, which made travelling very difficult. Halted for dinner, as usual, but extra precautions against surprise were taken, videttes being thrown out and a strong party kept under arms during the halt. Proceeded to Hoodoo, which we found plundered by the rebels. This morning the men's kit-bags were left behind, to lighten the loads of the teams; also five saddle horses were left behind at Humboldt. Last evening the commissioner inspected the party at Humboldt, and told off a party of 24 constables to act as dismounted riflemen. At the camp at Hoodoo, shortly after midnight, the sentries reported that parties were prowling around the bush near the camp. The dismounted men were kept under arms from the time the moon set till daylight, in preparation for attack by rebels, but nothing happened.\n\n24th March, Tuesday—Broke camp, breakfasted and started at 6 a.m. The commissioner determined to move on to Prince Albert, so we moved along rapidly, being kept well closed up and ready for immediate action, carbines loaded, magazines full. The roads through the Birch Hills were good, and we made Agnew's (Pritchard's) Crossing of the South Saskatchewan about 2 p.m. After crossing, we halted for dinner. News came that Riel, with about 500 men, was furious at our having outflanked him, and was coming to attack us at once. We moved on to Prince Albert and arrived there about 8 p.m., and found all the people there on the qui vive. They had been organized quickly by Inspector Moffatt, North-West Mounted Police, and about 75 men, all armed, sent on to Fort Carlton, under Capt. Moore. People here seem to be greatly excited over the rebellion; they fear the Indians more than the half-breeds. By our arrival, confidence seemed completely restored.\n\n25th March, Wednesday.—Our men and horses last night were quartered at and around the police barracks here and at Goschen, and passed a very comfortable night. The civilians found a guard for the night, so that all our men got a full night's rest. Riel is reported to be gathering his men together to attack Prince Albert. Reveille sounded at 7 a.m. The horses' shoes were examined and attended to by local blacksmiths. Parade at 11 a.m., for inspection of arms. Ball firing in afternoon under Inspector Drayner. (Horses also were taken out for exercise in afternoon). The practice was on the river. The men fired fairly well, but several carbines were found to be out of working order, and some of the ammunition was bad. A number of civilians (28) were enlisted as special constables, and taken on to go with us to-morrow to Fort Carlton. Last post at 8 p.m. Men called out at 11:30 p.m., and all arrangements completed as to distribution of men for trip.\n26th March, Thursday.—Got all ready, and started for Fort Carlton at 2:45 a.m., and travelled over very good roads to Wallace's Creek, where we halted for dinner. When we were about nine miles from Fort Carlton the commissioner received the following despatch:\n\n\"CARLTON, 26th March, p.m.\n\n\"To the Commissioner North-West Mounted Police.\n\n\"Superintendent Crozier with 100 men started out at 10 a.m. on Duck Lake road to help one of our sergeants and small party in difficulty at Mitchell's store. I have here 70 men, and can hold post against odds. Do not expect Crozier to push on further than Duck Lake. Everything quiet here.\n\n\"(Signed), SEV. GAGNON, Superintendent.\"\n\nWhen on the top of the hill above Fort Carlton, the commissioner received the following despatch:\n\n\"CARLTON, 26th March, 2:30 p.m.\n\n\"Commissioner North-West Mounted Police:\n\n\"Crozier exchanged shots with rebels at Duck Lake. Six men reported shot. Crozier retreating on Carlton. Everything quiet here, but ready for emergency.\n\n\"(Signed), SEV. GAGNON, Superintendent.\"\n\nJust before our arrival at Fort Carlton, about 3 p.m., Major Crozier returned with his command from his unsuccessful attack on the rebels, at Duck Lake. There had been a sharp action, lasting at least fifteen or twenty minutes. The half-breeds and Indians in the bush and under cover had the advantage of our men, and we lost one of the Mounted Police (Constable Gibson), killed on the field; several others severely wounded; two fatally. The volunteers lost heavily, nine being killed and the bodies being left on the field. The rebels pursued the retreating party for some distance. Large parties were kept under arms all night at Fort Carlton, and the greatest precautions were taken against surprise. Over 100 men of \"D\" division North-West Mounted Police are now at Fort Carlton.\n\n27th March, Friday.—The day broke fine, bright and spring-like, though the night was cold and frosty. The extra sentries in the bastions (five in number), and on the temporary stockade platforms, were kept on their posts for some hours after daylight. The night passed quietly, and there was no appearance of the rebels. The mounted patrols, who were out all night, saw nothing. In morning things generally were straightened out around the fort, and made to look orderly. After dinner the dismounted men of our party were paraded for inspection of arms, 52 men being in the ranks, with five non-commissioned officers and one inspector. Preparations were made to evacuate Carlton in the evening. Some flour belonging to the Indians was sent across the river, and flour and oats loaded in our sleighs. There was no sign of any move on the part of the rebels. The commissioner sent a telegram to Lieutenant Governor Dewdney, by messenger, to Battleford, to send troops in by way of Swift Current to Battleford. Constable Arnold died of his wounds about 1:30 a.m. this morning, and Constable Garrett about 3 p.m. this afternoon. Their bodies, together with that of Constable Gibson, killed yesterday, were buried with military honors, in one grave, a few hundred yards to the north-west of the gate at Fort Carlton. Col. Irvine read the burial service at the grave, but there was no firing. The funeral took place just before 6 p.m.\n\n28th March, Saturday.—While getting ready to leave Fort Carlton, about 3 a.m., a fire caused by the accidental explosion of a lamp in Sergt.-Major Dann's quarters,\n\n*It has been subsequently ascertained by a board of officers who sat by order of the commissioner, on the 9th April, that the cause of the fire was the accidental taking fire of some loose hay scattered on the floor of Sergt.-Major Dann's room when filling a mattress for wounded men to lie on in the sleighs during removal.\nstarted in the building at the gate, and was beyond control from the start. The teams and men were got out at once and the place abandoned to the flames. Some of the men's bedding (blankets, etc.) and effects not yet loaded on the sleighs, were necessarily left behind. The greater part of the buildings were on fire before we left finally. Coming up the hill from the fort was hard work for the horses, but it was quickly done. The march commenced before daylight and was rapid. We halted to water the horses at Wallace's Creek, but only stayed a short time. Nothing was seen of the rebels. We reached Prince Albert about 5 p.m. A stockade had been built of cordwood round the Scotch Church and manse, and many women and children were there for protection. The Carlton detachment and volunteers held the stockade. The Prince Albert detachment and our men lay in the barracks at Goschen. There was a night alarm; 40 men were sent from Goschen to town, but returned about midnight, all being quiet.\n\n29th March, Sunday.—At the Goschen barracks the men were paraded and arms inspected under Superintendent Gagnon and Inspectors Moffatt and Drayner. A quantity of ammunition was taken into store, sixty rounds being left with each man. The commissioner fixed his office in Sergeant Keenan's house, on the main street, facing the river, with his quarters and private office upstairs. The commissioner sent a cipher despatch by way of Humboldt, to Lieutenant-Governor Dewdney, Regina, explaining state of matters here. People still continue to flock in from the country for protection. The stockade is full of our men and volunteers; the women and children are in the houses round about. In the evening there was a meeting of volunteer officers at the commissioner's office, and some arrangements were made, about carrying on the duties of the garrison. There was a thaw the greater part of the day and a little wet snow in the evening, but it got cold as the night wore on. Roads still good for sleighing.\n\n30th March, Monday.—The forces here, as now organised, consist of part of \"D\" division, North-West Mounted Police (123 of all ranks); detachments of \"B\" and \"E\" division, North-West Mounted Police, (91 of all ranks); No. 1 or Captain Moore's company of volunteers (42 of all ranks), and No. 2, or Capt. Hoey's company of volunteers (50 of all ranks). The volunteers are quartered in their own private barracks; \"D\" division chiefly at the stockade barracks; \"B\" and \"E,\" with a few of \"D,\" are in and at the barracks at Goschen. In general orders to-day, the commissioner published the following appointments: Acting staff officer, Lieut. Col. Sprott; acting brigade major, Mr. Hayter Reed; supply officer, Hon. L. Clarke; quartermaster, Superintendent Gagnon; chief of scouts, Mr. Thomas McKay. The bodies of the volunteers killed in the action of the 26th instant, were brought into Prince Albert this morning, together with Nowell, the wounded man, Riel having surrendered same to the citizens here. Varying reports (N.B., all unfounded) are going about, as to an action at Batoche on Saturday last, but nothing definite can be ascertained as to origin of same. Despatches were sent by the commissioner to Regina, urgently demanding support, and representing state of affairs as being very critical. Messages have to be sent up to Battleford for transmission to the East. In the evening a message to Lieutenant-Governor Dewdney was also sent by way of Humboldt. Much coming in of people to see the commissioner and Mr. Thomas McKay, the chief of the scouts, all day long.\n\n31st March, Tuesday.—Morning broke fine, but still cold. The roads about the town (Prince Albert) are getting very bare of snow, and sleighing is fast coming\nto an end. The following proclamation was issued by the commissioner today:\n\n\"NOTICE.\n\nPRINCE ALBERT, 31st March, 1885.\n\n\"To all loyal citizens of Prince Albert and vicinity:—Owing to the troublous times which now beset us, it behoves every loyal subject of Her Majesty the Queen to enrol himself immediately, with a view of aiding in putting down the present rebellious spirit now about us, and securing the quiet and peace of the country.\n\n\"I have therefore to request that all able-bodied men not already enrolled proceed forthwith to Lieut.-Col. Sprott, who will be found at Mr. Macleish's office, and give their names and be sworn in and enrol themselves in companies, in order to the raising of those already mustered in.\n\n\"(Signed) A. G. IRVINE,\n\n\"Commissioner North-West Mounted Police.\"\n\nThe people in town appear to join readily and willingly; they are to be told off in companies, and duties assigned to them at once. The funeral of the dead volunteers (nine in number) took place this afternoon. \"D\" division North-West Mounted Police, furnished a firing party of 30 men under Inspector White-Fraser; a large number of volunteers and citizens, all with arms in their hands, attended the funeral. Good news came in this afternoon, both by way of Battleford and by a courier from Humboldt, with despatches for Col. Irvine, informing him of General Middleton's presence at Troy and of his intended movements. Every one much gratified at the receipt of the tidings this evening.\n\n1st April, Wednesday.—Sharp frost last night, and morning very cold for the time of the year. Sky dull and overcast all day; thawing only slightly. Drills going on twice a day for the volunteers. The town (Prince Albert) is quite quiet, and hardly anything is heard of the movements of Riel and the rebels. It is reported that Riel has gone down to Batoche's, to oppose the entrance of General Middleton's command, and has only left a few men at Duck Lake. It is also reported that a large part of the buildings at Fort Carlton escaped the flames on the 29th March last, and that the half-breeds are now occupying the ruins of the fort. The amount of Winchester carbine ammunition in our possession here is about 30,000 rounds, over 12,000 rounds Snider-Enfield, and about 6,000 revolver cartridges, besides nearly 80 rounds for the 7-pounder mountain gun. There is also a good deal of powder and shot, besides paper cartridges for shot guns. Despatches to General Middleton and Lieutenant-Governor Dewdney were sent out by way of Humboldt and Battleford, Hourie taking the former and Poitvin the latter.\n\n2nd April, Thursday.—Thawing all day; streets getting very sloppy; pools of water everywhere. The scout that started out with telegram for Lieutenant-Governor Dewdney, last Sunday night, returned, not having been able to go on to Battleford, as he could get no guide and did not know the country beyond Carlton. Col. Irvine saw and examined him. The stockade round the Scotch Church has been considerably enlarged and bastions made anew. There is much more room to move about inside than before, and things are more orderly. One Monkman, said to be hand-in-glove with Riel for months past, was apprehended in town here and brought before Col. Irvine, who examined him, and ordered him to be detained, pending further examination. Monkman pretended to be guiltless of all share in the rebellion.\n\n3rd April, Friday.—Nothing unusual occurred during the night. The morning broke fine and clear; still thawing, and a good deal of water and slush on the road;\nsledding is nearly gone, though sledges are still used around town, with an occasional waggon in sight. In morning Mrs. Monkman got leave to see her husband, who was made prisoner yesterday. One Thomas Scott, said to be deeply involved with Riel, having come into town, was arrested by order of the commissioner, and is held over for further examination. Scott denies having had anything to do with the rebellion. Two Indian chiefs, Star Blanket and Big Child, came in with the Rev. J. Hynes from Sandy Lake. Their bands are quite loyal; they came in owing to the disquieting rumors they heard about the doings at Fort Carlton. Honorable L Clarke took charge of them for the night. Water appeared over the ice on the river this afternoon. Arrangements are being made to have the troops ready to move at a moment's notice. The scout Hourie returned with despatches, not having been able to cross the South Saskatchewan, as that river has broken up and the ice is running freely.\n\n4th April, Saturday.—Morning fine and sunny, with brisk drying breeze from the north-west. Water still coming up on ice in river. Ducks and crows were seen today for the first time this spring; it is said that wild geese have been flying north for the last day or two. The scout Hourie made a fresh start this morning with the despatches for General Middleton; he has a boat with him to cross the river with. The commissioner and Mr. Hayter Reed had a long conversation with the Indian chiefs who came in last night—everything satisfactory. A large number of settlers got leave to go out to their respective farms, with a view of bringing in hay, grain and waggons for use of the force and people here. The commissioner this afternoon received through the Honorable L Clarke, of the Hudson's Bay Company, a copy of the cipher telegram previously received from General Middleton at Troy, of the date of the 30th ultimo, also a letter from Inspector Morris, commanding at Battleford, saying that the Indians had risen in rebellion there, had taken possession of the industrial school, and were going to attack the place, but that with the Mounted Police he had with him and the volunteers at his disposal he hoped to be able to successfully defend the fort, which was full of women and children, who had flocked there for protection. He also stated that \"A\" and \"B\" Batteries, the \"Queen's Own,\" from Toronto, and other volunteers were coming up by the Canadian Pacific Railway sid the north shore of Lake Superior. That at Calgary an attack was looked for from the Blackfoot Indians, and that Col. Herchmer not yet reached Battleford, but was expected there with 50 men and one gun. All is apparently quiet around us here at Prince Albert.\n\n5th April, Sunday.—Nothing unusual occurred during the night, but the water in the river continued steadily to rise, and this morning was running freely along both banks; the ice in the centre continues firm, though it shows signs of soon breaking up. A number of settlers near here got passes this morning to go home to their farms, with the intention of staying there and going on with their usual work, others again, went out to bring in waggons, &c. The Mounted Police here were inspected by the commissioner at 11 a.m. There was a parade of the Prince Albert volunteers at 2 p.m., when they were inspected by the commissioner. There were four companies present, two with arms and two without arms. In afternoon arrangements were made to transfer suitable men from the unarmed to the armed companies, so as to fully utilize the arms on hand. An order appeared in General Orders urging every householder to keep all buckets and barrels full of water, to be ready in case of fire, as the rebels might try to burn the place. The whole day was fine and spring like. The citizens here generally seem to begin to feel quite secure.\n6th April, Monday.—All quiet during the night; the morning was dull and chilly. About 8 a.m., it commenced to blow hard from the east, with drifting snow, and it grew very cold and wintry. All day long it was very stormy, and a severe day for both men and horses to face. A man named Diehl, who lives near Fort Carlton, and has been there ever since it was burnt and abandoned, came in, and the commissioner examined him. He says the half-breeds got into the fort soon after we left and found considerable plunder, which they took away. They set fire to and destroyed all the remaining buildings. He believes at present none of half-breeds are at Carlton or Duck Lake, but are south of the river. The commissioner procured sixteen ponies today for the use of the patrol. Alexander Honie came in and reports that his brother Thomas crossed the South Branch with his despatches this morning at Agnew's Crossing, the river there being all clear. Thomas Honie's horse had been taken away by the half-breeds, and he had to proceed on foot.\n\n7th April, Tuesday.—Very cold night, sharp frost; morning bright and fine, but cold all day. A scout named Scanlon started off to Battleford with despatches to Hon. E. Dewdney from the commissioner and Hayter Reed, also a letter from Mr. Hayter Reed to Poundmaker and other Indians who have lately risen near Battleford. One Diehl, a settler six miles west of Fort Carlton (mentioned yesterday), was ordered to bring in his cattle to Fort Carlton, and actually did so the very day we left there; he had to take them back again to his own place. He lost one cow and two calves. He went back home today and is to make a careful reconnaissance of the country up to Duck Lake, so as to ascertain the whereabouts of the rebels. The commissioner sent a despatch by Johnny Brass, the scout, to the Lieutenant-Governor at Humboldt, that he was in need of oats at once, and for same to be sent in at once by way of Medicine Hat. Mr. Hayter Reed also sent a message at the same time by Johnny Brass to the Lieutenant-Governor, to send in seed grain for the use of the farmers here at once. Later in evening there was a remarkable display of aurora borealis, extending all over the sky.\n\n8th April, Wednesday.—Morning dull and cool; windy but not cold in afternoon. One Bird, a half-breed, who has lately been with Reil and the rebels, was arrested in town here by order of the commissioner. Bird states that there are no rebels at Carlton or Duck Lake, only thirty at Batouche's, on this side of the river, and that the main body are with Reil, on the other side of the river with the prisoners in their charge there. The day passed quietly, as usual. In evening two men came in from Humboldt with cipher despatch from General Middleton, who said that he was leaving Qu'Appelle with his 350 men on Monday, 6th inst., and would be at Humboldt about Friday; that he had troops coming in by way of Swift Current. It is reported that the rebel Indians have taken and burned the town of Battleford and killed four of our people (farming instructors on the reserves).\n\n9th April, Thursday.—Early this morning the commissioner sent a despatch to Humboldt for General Middleton by the scouts George McBeth and Robert Tait, who came in last night. The morning was fine and warm; there was a stiff breeze blowing all morning from the west, with a slight hail and rain storm about 10 a.m. Water still rising in river, but ice in centre remaining firm as yet. Information was received in afternoon through Father André, whose man servant had been sent out to find out what was going on, that one hundred Santee and Sioux had joined Reil. The commissioner sent word to that effect to General Middleton, in a despatch forwarded by one\nDrane, a scout, also suggesting that the General and his force should first come in here and make Prince Albert the base of operations; as the departure of the police from here to meet General Middleton's command would be but the signal for the Indians to come in here and sack and burn the place. The nuisance caused by the howling of the town dogs at night was referred to in a notice issued today by the commissioner. Chief John Smith got a lot of supplies from Mr. Hayter Reed, and left today. The Commissioner is still buying transport and horses for the police. Diehl, of Carlton (before mentioned) on his return home found his cattle had been taken away by the rebels, and a letter left for him as follows (in pencil—badly written and spelled):\n\n\"Batoche's Crossing, 5th April, 1885.\n\n\"Mr. Deal, Sir—It has been decided by the council that your cattle be brought here at once, so please let them go without any trouble. Send us the number you deliver to the men going for them.\n\nYours truly,\n\nALBERT MONKMAN.\"\n\n10th April, Friday.—All quiet during the night. Morning cool, but fine and spring-like. A little hail and rain in afternoon. The water in the river kept rising all the forenoon, and about 2 p.m. the ice commenced to move out quietly. It was stopped by a jam for about two hours, but moved on again about 5 p.m., and was rapidly running down all evening, the water continuing to be very high. One Thomas Hoirie was arrested on a warrant issued by J. Campbell, J.P., for shooting an ox belonging to an Indian named Bear, and pleaded guilty to the charge, and was remanded by the commissioner till to-morrow. The four volunteer companies here were formed yesterday into a provisional battalion, under Lieut.-Col. Sproat. The Mounted Police are held in readiness to move at once. The commissioner bought some more transport today and settled for some horses killed in the Duck Lake affair of the 26th March last.\n\n11th April, Saturday.—It was cold during the night; the ice in the Saskatchewan was running freely all night, in the morning the river was almost clear of ice, and the water still very high. Philip Atkinson, a scout from Battleford, brought in a despatch from Inspector Morris, announcing the murder of several white people at or near Battleford and Fort Pitt (Frog Lake). The fort at Battleford is besieged, but Mr. Morris seems confident of being able to hold out against considerable odds for some time; he asks for the steamer to be sent up to take away the women and children (400) that are there for protection. George McLeod and James Fraser, two scouts, left for Humboldt with cipher despatches for General Middleton, and enclosing a copy of Mr. Morris' despatch, and urging the General to come here at once. There was a full dress parade (marching order) of both the mounted and dismounted men of the North-West Mounted Police this afternoon at 3 p.m., when the commissioner inspected them. The water in the river commenced to fall again and went down considerably in the course of the day. It got quite cold towards evening. There is a good deal of excitement among the citizens here over the news from Battleford and Fort Pitt. The following is a copy of Mr. Morris' despatch:\n\n\"Battleford, 7th April, 1885.\n\nSir,—Telegraph received, but regret to have to inform you that wire has been down since Thursday, 2nd inst., and that I have no possible way of getting them cut as you desire, as we are virtually prisoners, and have been ever since Monday, 31st ult. These tribes have risen and surrounded us on every side: \"Poundmaker,\" \"Little Pine,\" \"Sweet Grass,\" \"Mosquito,\" \"Red...\"\nPheasant,\" \"Grizzly Bear's Head,\" \"Lean Man,\" \"Napahose.\" They have plundered all the stores on the south side of Battle River and burnt some of the houses. All settlers stock driven off and corralled at Poundmaker's. The Stonies have killed Payne, Fremont, Chilchignan and Goo, Applegarth. Big Grizzly Indians at Fort Pitt have killed Mr. Quayle, Mrs. Porter, Mrs. Redfern, Mrs. Redfern, two boys, Mr. Williscraft, Gowin, Gilchrist and Mr. and Mrs. Gowenlock. I believe it is their intention to exterminate the whites in this section. While feeling I have taken every means of safety and can cope with them, yet I would beg of you to push on in this direction as soon as you can, so we shall in all likelihood remain prisoners until you do come to our assistance.\n\n\"I have been expecting Herchmer for several days with fifty men and one gun, but I fear he will have to fight his way through the Stonies, and may possibly be overpowered. I have sent two couriers out to meet and warn him of his danger. We occupy a very precarious position, as does also Fort Pitt; the latter has been calling for help, but I am powerless to render any assistance.\n\n\"I would urge by all means that the other fort be opened forthwith, that I may send the women and children off. I have about 400 women and children in barracks, and their situation is anything but pleasant.\"\n\n12th April, Sunday.—Morning cool but fine; weather all day dull and cloudy; river pretty clear of ice, but water still falling fast. The volunteers were employed building a bridge over the slough between the stockade and the front of the town. There was religious service held in the Scotch Church (inside the stockade) in the afternoon. An order was issued for the North-West Mounted Police to wear side arms at all times when outside of stockade or barracks. The detachment at Goschen was employed last night and today building a stockade of cordwood round the Hudson Bay Company's premises, where the provisions &c., are stored, at Goschen. A party went out yesterday to build a scow at the Hudson's Bay ferry on the south branch of the Saskatchewan.\n\n13th April, Monday.—A fine spring-like day; water in the river still falling; ice not yet all gone by; streets drying up fast, and the nuisance of mud being everywhere gradually abating. Parade of mounted men at 3 p.m., for drill and exercise. Owing to the stress of duty, all staff non-commissioned officers and men, servants, attached men, &c., were ordered to do picket duty at night in addition to their other duties. Public notice was given by posters that more team and saddle horses are needed for the use of the police. No passes hereafter to be given to citizens from 16 to 60 years old unless enrolled in some of the volunteer companies here, and rations stopped of all families whose able-bodied male members refuse to enrol. Shortly before 9 p.m., a fire broke out in Gordon's blacksmith's shop, which was burnt to the ground; the next building, a stable in which the commissioner's horses were, was cleverly saved.\n\n14th April, Tuesday.—Fine, warm day; the croaking of frogs heard last night for the first time this season; water still falling in river. In morning two scouts, Joseph Poitvin and Jas. Atkinson, came in from Battleford with a cipher despatch from General Middleton to Col. Irvine, dated the 8th instant, from Touchwood Hills, stating that he was so far on the way and moving as fast as possible, and disclosing his then present intentions and wishes as to ours. It is learned from the scouts that Battleford was holding out well up to the 11th instant. Judge Rouleau and party got through safe to Swift Current and George Applegarth, previously reported killed, was safe at Swift Current. The party sent out to build the scow at the Hudson's Bay ferry over the south branch of the Saskatchewan returned, having completed their work there. A party of men was sent out today to work on the steamers which have been laid up for the winter at Shell River, a few miles from here. Wm. Scanlon, a scout from Battleford, came in about 10 p.m., with despatch from General Middleton, who was at 20 miles east of Humboldt at 2:15 p.m., on the\n12th instant Scanlon left Battleford on Sunday last. All well there up to then.\n\n15th April, Wednesday.—Rainied a little during the night; morning damp and cold; day generally dark and chilly, with raw wind from the northeast. Some of the chief Indians from John Smith's reserve in to see Mr. Hayter Reed, and to get supplies. A scout named John Linklater left in the afternoon about 5:30 for Humboldt, to meet General Middleton with despatch from the commissioner. A gate was erected at the entrance to the stockade barracks, strongly made of heavy planks. Suspicious movement of some Sioux on the north side of the river here reported to the commissioner, and steps were taken to have them looked after by friendly Indians. The Sioux are forbidden to cross over to Prince Albert, except to bring in news, and then only one at a time.\n\n16th April, Thursday.—Last night was very cold, with snow and wind; all day long it was quite wintry again, and towards night it froze hard, and the high, cold wind continued to blow. Thomas Hourie, the scout, returned from Humboldt with an autograph despatch from General Middleton, dated the day before yesterday, as follows: \"Shall cross over at Clarke's and more to—by west bank. Fear cannot fight until Sunday, but shall try Saturday. If steamer could be got ready, try and get women and children from Battleford.\" Hourie reports that the General has a large force with him. In evening Messrs. Bedson and McDowell arrived from General Middleton's camp, with despatch from him to the commissioner; also scouts Sanderson and Drane, who left the General's camp at the same time.\n\n17th April, Friday.—Very cold day; winter again, in fact. A good deal of ice still floating by in river. Father André's man servant, Antoine LeCris, who had been boasting that he was one of Riel's scouts, was arrested in afternoon by order of the commissioner; also one Labister, who is said to have brought Riel into the country, was arrested and sent to the guard room. All day the commissioner, with his staff, was busy making arrangements for a move to morrow. Cartridge belts to sling across the shoulder, holding 40 rounds, and made of brown duck, have been made, and are issued to the men. Slings have also been provided for the carbines. The commissioner had a copy made of all the despatches and messages received since leaving Regina. Two of the Hudon's Bay Company's 2-pounder guns were mounted at the stockade barracks. Hon. L. Clarke was ordered by the commissioner to get a steamer ready at once, and send same round to the south branch to General Middleton; also another steamer to be got ready at once to go up to Battleford.\n\n18th April, Saturday.—All day long snowing a little; by evening the ground covered an inch deep with snow; roads very dirty, and sticky. Not cold and no wind, but weather very gloomy. Commissioner in the morning went with Hon. L. Clarke to see the steamers lying six miles up the river, and found both of them sunk, and not available for use for some time, or till the water went down in river. The commissioner sent despatch to General Middleton, stating this, also telling him that there are four life-boats here and one York boat, which will be transported overland to wherever he (the General) may choose to cross the south branch. Parade of all the police on commons east of the Scotch Church at 3 p.m. Field movements, skirmishing, corralling, wagons, &c., practised. Constable Bossio, of \"B\" division, was found guilty of stealing from a comrade, and sentenced by the commissioner to twelve months' imprisonment with hard labor.\n19th April, Sunday.—Fine and spring-like weather all day. At 2:30 p.m. the commissioner marched out from Prince Albert with about 200 of the Mounted Police. Strong mounted parties were out as advance and rear guards, under the command of Inspectors Drayner and White-Fraser respectively, with numerous scouts still further to the front and on the flanks, under the command of Mr. Thomas McKay. The party proceeded over pretty bad roads, which, however, will be worse before they are better, as the frost is not yet out of the ground, and advanced twelve miles along the Duck Lake trail to the ridge and camped at Thomas Scott's (suspected rebel—a prisoner at Prince Albert). While in camp, about 10 p.m., the commissioner received the following despatch from the Hon. L. Clarke and Lieut.-Col. Sproat, who had been left in command of the volunteer garrison at Prince Albert.\n\n\"PRINCE ALBERT, 19th April, 1885.\n\n\"To the Commissioner North-West Mounted Police, en route to the Front.\n\n\"Sir,—Having heard that two refugees from Riel's camp were seen at a house next to mine, a guard and scouts were sent out by Col. Sproat to have them arrested and brought in; on the arrival of the guard at the house, they had disappeared; they were followed up, and arrested and questioned before Col. Sproat and myself, with the following result: Their names are C. R. Swain and Frederick Fiddler, the latter was spokesman, and in reply to questions gave the following information: They left Riel's camp two days ago, passing through Riel's lines, which extend to the south bank of the South River, fifteen miles south of Prince Albert. They passed the rebel scouts by showing forged passes. They state that they were part of Riel's force at the battle of Duck Lake, but took no part in the fight. They say that before they saw the battle they met a man named the Red Indian, who attempted to beat Newett's brains out with the butt of his gun. That the rebel force consists of 800 men, 300 of whom are Indians—White-Cap being in command of the Indians. That 200 men are camped on this side of the river, opposite Batoche, in command of Albert Monkman. That Riel was at Batoche with the balance of the rebels, out ready to move to either bank of the river at short notice. That Riel expected Big Bear's band to join him when they left. That Riel's scouts are on the Winnipeg road, as far as Houda, and on this side of the river to the fires. That they had heard of the advance of the troops. That they were not entrenched, but ready to move at any moment. That all the Indians were armed with repeating rifles, and the remainder of the rebels with rifles and shotguns. That they had good store of provisions and ammunition. That Monkman's party are encamped in Walter's and Baker's store. That the prisoners were safe, and lodged under guard at Batoche, in Boyer's store.\n\n\"I have the honor etc.\n\n\"(Signed,) A. SPROAT, Lieut.-Col.\n\n\"L. CLARKE, S. O.\"\n\n\"DEAR IRVINE.—Have sent those fellows to prison. Riel is on his guard, and evidently will not wait for the General's attack.\n\n\"Yours,\n\n\"(Signed), L. CLARKE.\"\n\nHaving accomplished his purpose of thoroughly examining the country in front of us, and ascertained the proximity of the rebel scouts from the tracks of rebel Indians in the fires, and being anxious as to the security of Prince Albert in his absence, the commissioner decided to return to Prince Albert, and broke camp at once and commenced the return march shortly after 11 p.m.\n\n20th April, Monday.—The night was cold and dark, though there was a considerable display of aurora borealis. The commissioner, with his command, reached Prince Albert shortly before 3 a.m., and the Mounted Police returned to their respective barracks. The commissioner examined the two prisoners made yesterday separately, and listened to their statements, among which was one\nto the effect that Riel had dug some entrenchments and rifle pits at Batoche, on the south side of the river. Joseph McKay, the farm instructor at Sweet Grass' reserve, west of Battleford, arrived by boat, having come down the river with his wife and two children, and having been twelve days on the way, travelling by night and hiding by day. He tells a most thrilling tale of the disturbances among the Indians west of Battleford, and had a narrow escape for his life, and suffered much hardship on his trip, both from the weather and from want of provisions. He passed Battleford last Friday night, and saw lights at the barracks there, whence he concluded that the fort there was safe yet. Today was fine and warm, and the mud about town dried up a good deal. The commissioner received a dispatch from General Middleton via Humboldt, by a scout, Jno. Linklater, asking for the telegraph wire to be watched, as he had field instruments with him, and would try to establish direct communication. Linklater started back at 10 p.m. with a message from the commissioner to the General.\n\n21st April, Tuesday.—The fine weather still continues, but towards evening a cold wind sprung up, and it looked like rain, which, however, is not wanted, as the roads around here are only beginning to dry up nicely. One Sinclair, supposed to be a rebel spy, was arrested in town this morning, and sent to the main guard, who now occupy the Scotch Church; the prisoners being confined in one end partitioned off from the rest. In the afternoon Mr. Hayter Reed drilled Nos. 1 and 2 companies' volunteers at skirmishing drill, and expressed himself as satisfied with their proficiency. The commissioner visited Goschen in the morning, and inspected the arrangements for defense there in case of an attack. The commissioner received a telegram from General Middleton at 10:50 p.m. to-night, dated Clarke's Crossing, 20th inst., at 6 p.m., via Humboldt. W. Drain and Robert Tait were the scouts that brought in the message. The General wishes a steamer to be sent round to the south branch, to be ready at or near Batoche next Thursday.\n\n22nd April, Wednesday.—Bright and clear weather all day, but with a cold wind blowing very hard from the north-west all day, making it feel quite wintry and disagreeable. The telegraph line was run into the commissioner's office this morning, and an instrument set up. There has been an operator watching all day long to catch any message, in case General Middleton should succeed in opening communication with us by wire, which is supposed to be cut somewhere beyond the Firs, or about 25 miles from here. Mr. Hayter Reed again drilled the volunteers at light infantry work in the afternoon. The steamer \"Marquis,\" which has wintered in Shell River, being ready at last, got up steam today and passed down the river to Goschen about 7 p.m. The commissioner was busy today doing everything in his power to have the steamer \"Marquis\" get ready to send round to Batoche, as desired by General Middleton, but it was found that there must be a delay of a day or two to enable the necessary repairs to be completed before the steamer could leave here.\n\n23rd April, Thursday.—The morning broke fine and clear, but it soon clouded up and grew cold and wintry again. All day snow was falling lightly and the surface of the ground is again sticky with mud. There was a general parade of the North-West Mounted Police at 9 a.m., when various field movements were practised, especially throwing up and using shelter trenches. Thomas Hourie, the scout, returned from General Middleton's camp, at Clark's Crossing, with a letter from the General for the commissioner. The General having been delayed by want of forage will not attack Riel until Sunday, or perhaps Monday at the earlier of which days he now wishes the steamer to be at\nBatoche's. Hourio reports that Big Bear, with 400 Indians, has joined Riel. In the morning a number of Sioux from the north side of the river here had an audience of the commissioner, who gave them some provisions. They do not belong to White Cap's band, but the \"Leaf\" band, or tribe of Sioux, and are peaceably disposed.\n\n24th April, Friday.—Dull and gloomy all day; quite cold for the time of year; fall of wet snow in evening. \"B\" division North-West Mounted Police were moved up to town from Goschen this afternoon, leaving there only the Goschen detachment proper. They are camped east of the stockade and close to it. A strong force of men on fatigue has been employed all day on the steamers. Every exertion is being made to get them ready for use at the earliest possible moment, but fresh difficulties seem to arise daily.\n\n25th April, Saturday.—Early this morning there was fully 6 inches of snow on the ground all over, but the sun came out strong, and by evening it is almost all thawed away, leaving the roads and ground generally in a very muddy condition. The commissioner was down this morning to see how they are getting on at the steamer \"Marquis.\" A guard of twenty men is to be kept at the Hudson's Bay Company's stores at Goschen, in addition to the detachment of North-West Mounted Police quartered at Goschen barracks. Work still going on at the mission stockade, strengthening and improving same. A gate in rear has been made.\n\n26th April, Sunday.—Cold weather still; high winds in afternoon, with showers of rain, making mud worse than ever. Weather looks quite unsettled yet. The officers of the North-West Mounted Police and volunteers were called together this morning at the commissioner's office to receive certain instructions from him. In afternoon all available men employed in throwing up earthworks round the stockade at the mission, to strengthen the position there, and to afford a secure refuge to the people in case of an attack by the enemy in force. One Geo. McLeod started off in the morning for Humboldt with some of the mail contractor's horses, taking a letter, with enclosures, from the commissioner to the Comptroller North-West Mounted Police. Although a party of 25 men have been working day and night on the steamer \"Marquis\" for the last three days, and everything has been done to expedite matters, the steamboat people seem to be bound to find fresh difficulties in the way of getting her ready, and now say it will be four days before she can be ready.\n\n27th April, Monday.—Fine weather today, which has considerably dried up the mud on the roads. A line of defense has been established, enclosing the most thickly built-up section of the place, extending on the arc of a circle from No. 1 company's volunteers barracks on the west, round to the south of the Scotch Church, and on round to the bank on River street to the east. The houses along the line have been loop-holed and rifle pits dug in between them, and the men are told off to their several stations in case of an attack. Thus protection can be given more effectually and to a larger number of families than the stockade alone can hold. A telegraph operator (Tomkins) has been sent out with an instrument to Cameron's, about 20 miles from here, at the forks of the road. This will save the scouts coming in so far with any news. The provisions heretofore stored down at the Hudson's Bay Company's premises at Goschen have been moved up to the quarter-master's stores, inside the stockade here.\n23rd April, Tuesday.—Fine bright day, which has had a great effect in drying up the roads about the town and making moving easier. Work still going on at the rifle pits, to extend and complete the line of defence round the central part of the town, spoken of yesterday. Townspeople very anxious for news of General Middleton's movements, and all sorts of unfounded rumors flying about as to the state of affairs. Owing to the evenings getting longer, the duties for the night are paraded now a good deal later than they have been hitherto, it not being desirable for the outlying picket to be posted till dark, which is now close on to 8 p.m. No news from the scouts down beyond Cameron's, though a party of them went out about twelve miles down towards Batoche's to-day, and saw nothing.\n\n29th April, Wednesday.—Dull, raw weather, with a cold wind blowing nearly all day; looking like rain in evening. Nothing much doing in Prince Albert, beyond the usual round of garrison duties. No news from outside at all—every one weary of waiting for news that does not come. First appearance of greenness in the grass by the roadsides noticed to-day. Water in the river is now very low, and still falling, but slowly. The commissioner sent a telegram via Humboldt to General Middleton by the scouts, Wm. Drain, and Robt. Tait, who left here about 9 p.m.\n\n30th April, Thursday.—Cold in early morning with some rain and snow. Very raw and chilly all day; occasional slight showings of cold rain, making it very disagreeable. John Linklater, the scout, got back here by way of the Birch Hills and Carrot River from General Middleton's camp near Gabriel's Crossing on the south branch, having left there the day before yesterday. He brought a cipher despatch from the General for the commissioner, telling him that he had had an engagement with the rebels on the 24th inst. near Gabriel's, our loss was ten killed and forty-three wounded; the rebel loss great, but not given; a lot of horses and cattle were captured by the General's forces. In the evening a party of twenty-five men of the North-West Mounted Police and volunteers were got ready to protect the scows and boats at the Hudson's Bay ferry, on the south branch, and Lieut. Campbell, of the volunteers, put in charge of same. Also, a party was got ready to go out on the \"Marquis\" round to the south branch.\n\n1st May, Friday.—Very cold and gloomy weather for May-day, but at sun-set there are indications of the weather changing for the better. Wells have been dug inside the mission stockade, so that in case of attack water may be handy. The party spoken of yesterday started early this morning for the Hudson's Bay ferry, on the south branch, under command of Inspector White-Fraser, with the four life-boats. The steamer \"Marquis\" got off to-day, and went down the river, on her way round to the south branch. Diehl, the scout, got in this afternoon from General Middleton's camp, which he left on Wednesday, but he was so closely pursued by Riel's scouts that, in accordance with his orders, he destroyed his despatches. Philip Atkinson, another scout who was with him, got separated, and has not yet made his appearance. Diehl brought in several newspapers of late dates, and reports of the action of the 24th instant, in much the same terms as Linklater did yesterday. Mr. White-Fraser reported in evening his safe arrival at the south branch, with his party of fourteen North-West Mounted Police and twelve volunteers under Lieut. Campbell. He found the scows there all right.\n\n2nd May, Saturday.—Weather fine and pleasant; strong breeze from the north-east in afternoon, making it cool enough towards evening. One Fraser, a scout,\nreported yesterday that he had been np to Duck Lake and saw no one there; all the buildings, with a few exceptions were burned; he saw no one on Beardy's reserve. The scouts out at Cameron's were out as far as Grandin about noon; saw nothing there. They were ordered to come in to the ridge at Scott's; they had the telegraph instrument with them, and sent word in from Grandin, beyond which the wire is broken down and removed. People out at Red Deer Hill assert that they heard firing last evening, and saw a big fire over in the direction of Batoche's. The statement seems to be confirmed by the evidence of others. (N.B.—Nothing in the story). The men of the North-West Mounted Police got some pay on account today, the commissioner having succeeded in obtaining some money from the Hudson's Bay Company.\n\n3rd May, Sunday.—Warm weather at last; a very fine day; would have been hot, were it not for a brisk breeze from the north-west. Sheet lightning in the south and west in the evening. The river is rising again, slowly but steadily, gaining a few inches every day. Linklater, the scout, started out in the morning for General Middleton's camp with a despatch from the commissioner. Inspector White-Fraser reports all quiet at the Hudson's Bay ferry, on the south branch, but no sign as yet of either the steamer or the General. The rebels, from the reports of the scouts, seem to be all gathered together on the south or east side of the south branch; at any rate, there is a noticeable absence of them and their scouts on this side of the river. Early in evening Mr. McDowall and McLeod, the scout, both came in from General Middleton's camp; they bring but little news. Fort Pitt was taken by the Indians; two of the Mounted Police killed, and Mr. McLean and family (of the Hudson's Bay Company) taken prisoners.\n\n4th May, Monday.—Another fine day, but still keeping quite cool. A little fire in stove, both morning and evening, quite acceptable yet. Leaves coming out on poplar trees across the river. The steamer \"Marquis,\" which left here last Friday, got round to the south branch, but, in trying to get up the first rapid broke her rudder, and had to return to the forks to repair. The commissioner sent a despatch about the steamers to General Middleton by Thos. Hourie and Diehl, the scouts, also a despatch informing the General of the action of the Hudson's Bay Company in sending, with his consent, a party of twenty men to protect the stores at Green Lake. Considerable stir among the farmers who are volunteers, they wishing to go out to work their farms, but the commissioner judged the present state of affairs too precarious to admit of their doing so with safety to themselves or Prince Albert, and refused to sanction their departure.\n\n5th May, Tuesday.—Very cold today; quite a return to winter; high wind from the north, with some snow in afternoon. River still rising gradually. The scout, Linklater, who left here on Sunday with a despatch for General Middleton, returned, having \"lost heart,\" to go on, and brought back his papers. Donaldson, the scout, in from Red Deer Hill; no news. Provisions sent out to Carrot River Settlement, where a company of fifty men are enrolled and a stockade built.\n\n6th May, Wednesday.—Still colder than yesterday, a very raw and chilling wind blowing all day from the north, making it feel very disagreeable. Two scouts, George McLeod and Armstrong, started off about noon with a despatch from the commissioner to General Middleton, and a telegram for F. White, the comptroller of the North-West Mounted Police, the latter to be forwarded from Humboldt, for which point the scouts were to make first, before going to\nthe General's camp. The men of the Mounted Police were out at target practice this afternoon, but the practice had to be discontinued, owing to the high wind, which rendered accurate shooting almost impossible. A report comes in to-night that Col. Otter, at Battleford, has had a fight with the Indians and chased them 30 miles, losing 7 killed and 13 wounded. The Indians lost at least 30 killed.\n\n7th May, Thursday.—The cold spell still continuing; a dull, cold day, with a good deal of wind from the north. River still rising and water now pretty high. William Drain, the scout, arrived with a despatch for the commissioner from General Middleton, dated on Tuesday last, mentioning the arrival of the steamer \"Northcote\" from Medicine Hat, and disclosing his intended movements. Capt. Moore, of the Prince Albert volunteers, who was shot below the knee at the Duck Lake fight on the 26th March last, though doing well for a long time, has had at last to suffer amputation of the leg above the knee. He is considered to be in a critical condition. The operation was performed by Surgeon Miller, North-West Mounted Police, and Dr. Bain, of Prince Albert. The scouts, with three additional men, have been moved out again to the forks of the road on the Carlton trail. They have the telegraph instrument with them, and report everything there the same as when they left the other day.\n\n8th May, Friday.—Weather somewhat warmer, and more genial today than it has been since last Sunday. In morning a meeting of farmers and others from different sections of the country was held in the commissioner's office to fix the price which the Government should pay to farmers, who are deprived from farming, for their grain, as they may bring it in. It was agreed that $3 a bushel, all round, for first quality of wheat, barley and oats, and $2 a bushel for second quality, would be satisfactory, and that Mr. A. G. Sutherland should inspect and grade the grain as it is brought in. The scouts on the Batoche trail, this morning, moved forward to near the Roman Catholic church (six miles from Batoche), saw some of the enemy's scouts there. Reported the fact by telegraph, having made connection with the wire there, and were ordered at 2 p.m. to watch around, retire and report again, which they did about 6 p.m., having returned to Cameron's, near the forks of the road, without being followed. They also went down to Gardopuis' Crossing, but saw nothing of moment. The ball firing begun on Wednesday last was continued today. The practice was good, in spite of the high wind.\n\n9th May, Saturday.—Warm and pleasant today; fine weather seems at last to have set in. William Drain and Robert Tait, the scouts, were sent out in the afternoon to meet General Middleton and guide him here by way of Hudson's Bay Crossing. Joseph McKay, of the Indian Department, lately from Battleford, reported that he had seen the Indians on the north side of the river, and that they were going back to their reserves tomorrow. They belong to Mistawasis and Ahtakakoop's bands. Capt. Moore, of the Prince Albert volunteers, is reported today as in much pain and suffering after the operation of last Thursday. The scouts on the Batoche trail report that firing was heard this morning in the direction of Batoche; they were also out to Duck Lake, and saw about 150 bushels of wheat in the mill there. There are no half-breeds on this side of the river, apparently, now. They thought they heard the steamer whistling below Batoche's. There was no one at the Roman Catholic church, where the rebel scouts were yesterday.\n\n10th May, Sunday.—Another fine day; warm and pleasant, with cool breeze from the north-west. The water in the river has ceased rising, and has fallen quite a\nlittle since yesterday morning. The cold weather of last week is probably the cause. The steamer \"North-West\" was launched last night and is now, at last, safely afloat. There is nothing new today reported by the scouts down at the forks of the road; they are taking a rest today, after their hard work of the last two days. There was service by Bishop of the Saskatchewan at 3 p.m. today inside the stockade, which was well attended.\n\n11th May, Monday.—Very fine and summer-like weather today. The grass is beginning to grow at last. Quite a large bush fire raging all day and yesterday on the north side of the river here, a little way above the town; the origin of the fire is supposed to be accidental. George McLeod, the scout, returned, having come down from General Middleton's camp by the steamer \"Northcote\" past Batoche, where they were heavily fired on, the rebels being in rifle pits dug row after row in the river banks on both sides; they had three men wounded. The \"Northcote\" has come down with two barges in tow and bringing the mails for Prince Albert, our kithags, and general stores for this place. An ambulance for the wounded and a strong armed escort was sent over to the Hudson Bay ferry to bring in the wounded, mails &c. The steamer \"Marquis\" reported at Hudson's Bay ferry today; an armed party of twelve men was sent over to go up in her to Batoche's. Preparations were made to receive the wounded into hospital here. Capt. Moore reported to be doing well. General Middleton was heavily engaged with the rebels on Saturday, but the scout could give no particulars, as he was on the \"Northcote\" at the time. A party of twelve men, under one Stansfield went over from here at 11 p.m. to man the steamer \"Marquis,\" in place of the former crew, who were discharged.\n\n12th May, Tuesday.—Very fine day, but clouding up in evening, apparently for rain. A quantity of mail matter was brought in from the Hudson's Bay ferry on the south branch and was distributed during the day, but there were no letters, or anything for the party from Regina. The kithags left behind at Humboldt, 23rd March last, arrived. They had been generally gone through and various articles, especially boots and underclothing, stolen. The garrison sports took place today and a good deal of interest was taken by everybody in them. The three wounded men from the \"Northcote\" arrived here in morning, and were received into hospital; all are but slightly wounded, and are doing well. Chamber was sent over to-night to build a storehouse at the Hudson's Bay ferry for the stores coming in by the river route. Sergt. Lescoube, \"D\" division, North-West Mounted Police, and party of eleven men, were sent over this morning to go up the south branch on the steamer \"Marquis.\" Good news from General Middleton's command continues to be reported. He seems to have surrounded the rebels and to be pounding them at leisure. The scouts on the Batoche trail report that the steamers \"Northcote\" and \"Marquis\" both fastened together passed up the river this afternoon.\n\n13th May, Wednesday.—Fine warm day; strong breeze from north-east in the afternoon, raising clouds of dust everywhere. The bush fire on the north side of the river has spread considerably and burnt up large quantities of firewood, which will be a great loss to the people here. A number of teams out today for hay, which is becoming very scarce and hard to get within a reasonable distance. The steamer \"North-West\" is being fitted out for service as quickly as possible. The party that left here about a fortnight ago for Green Lake has returned; the stores at that place, except the ammunition and arms which were sent to Isle la Grosse, having already, before they got there, been sacked by marauding Indians from the neighborhood of Fort Pitt, Loon Lake and\nEnglish River. Philip Atkinson, with despatches for General Middleton from Battleford, having come down the river on a flatboat with eighty sacks of barley to within a few miles of Carlton, came in here, with news also of the last fight near Battleford, in which corporals Lowry and Sleigh were killed. The Indians seems to have been badly routed by the forces under Cols. Otter and Harchmor, at Cut Knife Creek, forty miles south of Battleford.\n\n14th May, Thursday.—Fine cool day; stiff breeze from the north-east all day, bringing rain in evening—the first since the 30th ultimo. Drain, the scout, was sent off to General Middleton with despatches about noon, but was recalled in consequence of the receipt of a dispatch from the General, informing the commissioner that he had routed the rebels at Batoche's, and that they were surrendering themselves, and that he would come on to this place by to-morrow. Great joy among all the people here at the receipt of these tidings, and especially that Riel's prisoners are all safe and released at last. Our loss was but light, five only being killed in the last attack. Major Crozier was notified to-day of his appointment as Assistant Commissioner of the North-West Mounted Police.\n\n15th May, Friday.—Very chilly all day, with cold wind from the north-east. General parade of all the dismounted men in the garrison. Teams were sent over in morning to the Hudson's Bay Ferry to bring in the prisoners (21 in number) that the General was sending in here. General Middleton and his command crossed the river at Gardopu's Crossing with the steamer \"Marquis,\" and camped on this side for the night. Hon. Mr. Clarke received orders to hold the steamer \"North-West\" here, cancelling Capt. Street's previous order to take her round to the south branch. News came in evening that Riel and Gabriel Dumont have been captured about four miles south of Batoche. This, of course, causes unbounded joy in Prince Albert, as it entirely completes the General's victory to perfect satisfaction.\n\n16th May, Saturday.—Cool and cloudy weather, but no rain, though looking much like it all day. The river has fallen considerably during the last day or two, and is still going down slowly. The commissioner started out in afternoon to go to General Middleton's camp, but turned back on getting as far as the ridge, having learned that the General was not yet across the river. The number of guards, pickets and patrols has been somewhat reduced for to-night, in view of the complete success of General Middleton's late operations at Batoche's, and the need for same being consequently lessened. News comes in to-night that Gabriel Dumont is not captured yet. Communication by telegraph with the General direct is established this evening.\n\n17th May, Sunday.—Fine, though cool all day. Everything very quiet in Prince Albert all day. It is published in General Orders to-day that in consequence of the success of General Middleton's late movements it is now safe for the farmers to go back to their farms, and that, therefore, those now serving here as volunteers can leave as soon as they like. Most of them have decided to avail themselves of the opportunity. By telegraph from the front it is learned that the General will not finish crossing his forces until to-morrow, and so cannot be in here till Tuesday next. The list of names of the prisoners coming in was sent in to-day. It does not include that of Riel, who is sent to Winnipeg. The number of our killed in the late actions near Batoche's is now given as 18; wounded, 80. There are said to have been buried 150 rebels.\n\n18th May, Monday.—Chilly enough in morning; a slight thunderstorm in the afternoon, after which it grew very warm. Large numbers of swallows here to-\nday for the first time this season. The river is still falling, and is now lower than it has been since the ice was firm. News from the General's camp that he had started for here this morning and had camped near Cameron's for dinner and would be in here by to-morrow. Many farmers and others coming in all day to get their claims for grain, &c., settled; a good many cases disposed of. Accounts of all kinds continue to come in freely. The commissioner went out in evening to the General's camp.\n\n19th May, Tuesday.—A fine, warm day; a fresh breeze in afternoon from the southeast. Towards evening clouding up and looking very like rain. The commissioner returned from the General's camp about day-break. General Middleton, with his command, scouts, artillery, rifles and infantry (volunteers) and waggon train, marched in about 11:30 a.m., and were received by the local volunteers with their band and by a mounted party of police under Major Crozier, drawn up in front of the commissioner's office. The citizens here presented an address to General Middleton in the afternoon at 6 p.m., to which the General made a suitable reply. Wm. Drain, the scout, was sent to Humboldt with despatches from the General and the commissioner. He started about 4 p.m. The prisoners from the south branch came in and are lodged in the Scotch church, which has been used as a prison for some time, with the greater part divided off into cells and the front for a guard room. Leviellie, the interpreter, who was sent yesterday to Duck Lake, brought in Lucio Arcand as a prisoner. He says that Poundmaker has twenty prisoners, having captured a train of forty waggons going from Swift Current to Battleford, loaded with flour and bacon. Beardy and his councillors, who have no arms now, are to come in to-morrow. Leviellie also met and disarmed three Sioux.\n\n20th May, Wednesday.—Some rain during the night and early morning; all day cloudy, and weather very unsettled; strong wind from the east. There are 33 prisoners today in charge of the North-West Mounted Police, and eight are now moved down to the log building next the commissioner's office where a strong guard is also stationed. James (or Charles) Bird, one of the prisoners, was discharged this evening. General Middleton's troops rested today in camp, and everything was very quiet. The local volunteers were relieved from duty today, and such as wished it, sent back to their usual avocations. Very busy in the commissioner's office straightening up accounts incurred during our occupation of Prince Albert. Inspector White-Fraser, with a detachment, of 37 men of the North-West Mounted Police, started out to repair the telegraph line. The party was composed of 1 inspector, 1 sergeant, 1 corporal, 35 constables, 19 horses and 7 waggons, going down to Batoche, in the first place, and working thence onwards.\n\n21st May, Thursday.—Rained heavily off and on all day, making the roads very muddy and everything very dirty. Prince Albert, in rainy weather, is much like Winnipeg for mud. General Middleton and his command rested quietly in camp all day owing to the rain. All the steamers from the south branch are ordered round here to go up to Battleford with the General. The rates of pay for the local volunteers were fixed by the General at maximum police pay, with $25 added for outfit. The same rush of people to get accounts settled as yesterday. \"One Arrow\" ordered to bring in his medal and arms and meet the General at Carlton on Sunday.\n\n22nd May, Friday.—Warm and bright all day. Mud dried up wonderfully, under the hot sun, and by evening the roads were quite passible. In morning General Middleton, with one gun and the Gatling and the Midland Battalion, went up\nthe river by steamer \"North-West.\" Mr. Hayter Reed, late acting brigade-major, went up with the General. Accounts to be settled still coming in freely; settlement of same going on as fast as possible. Mrs. Jackson, mother of the Jackson—Riel's late secretary—had an interview with the assistant commissioner, in which she asked for the release of her son on bail. Major Crozier declined to accede to her request.\n\n23rd May, Saturday.—Very fine, but still quite cool; in evening cloudy and looking like more rain. Settlement of accounts still progressing and much progress made in winding up business transactions of the last two months at Prince Albert. The five prisoners, Scott, Moukman, Nolan, Isbister and Anderson were released by order of the commissioner. A mail from Regina came in this morning, and we got letters for the first time for over two months. The telegraph line is now repaired and there is full communication to Qu'Appelle, and thence to everywhere else. Athletic sports in the volunteer camp this afternoon. Arrangements being made to pay off the local volunteers, scouts &c., early next week. The steamers \"Baroness\" and \"Alberta,\" arrived from the South Branch this evening, and are to take troops up to Battleford to-morrow.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001467.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 25288, "total-output-tokens": 16829, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3234, 1], [3234, 6874, 2], [6874, 10622, 3], [10622, 14359, 4], [14359, 17908, 5], [17908, 21757, 6], [21757, 25504, 7], [25504, 29124, 8], [29124, 33298, 9], [33298, 36896, 10], [36896, 40748, 11], [40748, 44589, 12], [44589, 48100, 13], [48100, 51791, 14], [51791, 55474, 15], [55474, 59224, 16], [59224, 63039, 17], [63039, 66797, 18], [66797, 70521, 19], [70521, 71770, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]