[{"id": "6db847039a7deb7d74ebeb46c045f31598489a28", "text": "REPORT\n\nOF\n\nMAJOR GENERAL LAURIE,\n\nCommanding Base and Lines of Communication, upon matters in connection with the suppression of the Rebellion\n\nIN THE\n\nNORTH-WEST TERRITORIES\n\nIN\n\n1885.\n\nOTTAWA:\nPRINTED BY MACLEAN, ROGER & CO., WELLINGTON STREET.\n1887.\nREPORT\nOF\nMAJOR GENERAL LAURIE\nCommanding Base and Lines of Communication upon matters in connection with the suppression of the Rebellion IN THE NORTH-WEST TERRITORIES.\n\nOAKFIELD, N.S., 26th August, 1885.\n\nSir,—In accordance with your appointment and instructions, I proceeded by light waggon, on morning of 13th April, from Wise Station, only getting across the Salt Plains that day as the trail was very miry; and, travelling from daylight till dark, could only reach Fort Qu'Appelle at sundown, on the 15th, but pushing on reached Troy about midnight. I took notes of the actual quantity of forage and supplies at each depot on the trail, and compared them with the statements of quantities estimated to be on hand, which I obtained before leaving your head quarters; also of the number of teams moving upon the trail, with particulars of the loads carried, and reported to you at each telegraph station the results of my enquiries.\n\nAt Troy I at once discussed matters with Captain Swinford, the Principal Supply Officer; but as Major Bell, the Transport Officer, was absent, I could not obtain any particulars as to transport; and as the Hospital Corps, under Deputy Surgeon General Roddick, reached Troy at 3 a.m., I proceeded immediately with them to Swift Current.\n\nAt Moosejaw, I ascertained that some survey carts and ponies belonging to the Department of the Interior were unemployed, and at once telegraphed to Ottawa for permission to employ them in our transport service.\n\nOn arrival at Swift Current, I found that under Colonel Otter's instructions, two companies of 35th had left for Saskatchewan Landing to protect stores and ferry; but as orders were almost immediately received to concentrate 35th and 12th at Fort Qu'Appelle, Colonel Tyrwhitt's detachment 35th was ordered to return on 18th, being relieved by two companies of Midland Battalion, under Major Smith, who exchanged tents, &c., and so saved transport. With your approval, I appointed as Staff-Adjutant, Lieutenant Leonard, graduate Royal Military College, who had resigned a lucrative appointment on construction of Canadian Pacific Railway, to resume military duty. I proceeded on morning of 17th to Saskatchewan Landing, to concert arrangements with Colonel Otter, as to forwarding his supplies. The Hudson's Bay Steamer \"Northcote,\" had reached the Landing from Medicine Hat, with two large barges, and was engaged in ferrying Colonel Otter's column, and transport train of 230 loaded teams to the north side of the river. As the ferry was not in working order, it was then arranged that as the loads of forage and provisions were consumed, the unloaded teams should stand fast, resting their horses until fresh loaded teams from the rear reached them, when they would become relays, so as to expedite the forwarding of supplies, and so more promptly overtake the column; but this arrangement was not carried out, as the waggons were entitled to carry the\ninfantry, and so enable the column to proceed more rapidly. As a first reserve of field gun ammunition for both columns was at the Landing awaiting transport by the \"Northcote,\" I handed over one-third to Colonel Otter's column for the use of \"B\" Battery, but unfortunately the boxes were incorrectly labelled, and although the selection was made by an experienced Artillery officer, Major Short, the division was subsequently found to be uneven, the fuze not being in proportion to the projectiles. Colonel Otter and Colonel Herchmer urged that I should engage some more scouts; and some ex-Mounted Policemen offering almost immediately, who, from their training and knowledge of the Indian language and ways, were specially qualified, I sent them forward to report to Colonel Otter; but as I could obtain no information as to terms, I engaged these men on same rate of pay as allowed by you to scouts in your column, and to serve under and be subject to discharge by Colonel Herchmer.\n\nCaptain Sheets, of the \"Northcote,\" was very sanguine as to the practicability of using the river for transport, and guaranteed its navigation till nearly the end of August; but the want of land transport delayed completion of loading the steamer, and meantime the river became too shallow to float her over the rapids; but he at this time insisted that Commissioner Wrigley wished him to leave for Prince Albert to bring out the steamer \"Northwest,\" and he even drove to Swift Current with that intention, and I had considerable difficulty in persuading him to return; but, as he was the only captain who had experience in navigating the river, I telegraphed and obtained authority from Mr. Wrigley that he should go down the river with the \"Northcote,\" and drove him back with me to the Landing.\n\nAscertaining that only 20,000 rounds Gatling ammunition had been received, I at once telegraphed for 50,000 additional, but could only get an order issued for this quantity after considerable correspondence, and the supply did not arrive till a month later.\n\nFinding that the available land transport would not admit of my loading the \"Northcote\" promptly and despatching her as you desired, I submitted a proposition to hold back Colonel Otter's column for, possibly, five days (it would actually have been only three days) and to transfer part of his supplies to steamer, and to send her off to you with Colonel Williams' half battalion, establishing with remainder of supplies a depot north of the river, and using all of Colonel Otter's transport train for one trip to Swift Current, which would thus have given 230 tons of stores (additional) at river, and facilitated the forwarding further supplies both to your column and Colonel Otter's; but, as you considered the delay might have resulted in danger to Battleford, and desired that Colonel Otter should not be delayed, he moved forward on 18th April, and a transport train of about 30 teams was left to load the \"Northcote,\" as well as provision detachment at Landing, and forward necessary supplies to the Battleford Column and garrison.\n\nMr. White, the Assistant Transport Officer, who had, I believe, been selected by Major Bell, was a lawyer from Regina, and had no previous experience of such work or executive training, and, of course, no knowledge of details, but was untiring in his efforts to get the work done, and, fortunately, had some very practical and energetic subordinates, but the whole service was utterly inadequate for its duties, so I at once sent out notices in every direction that all suitable teams would be taken on, and notified the Transport Officer that 100 teams would be required to provide load for the \"Northcote\" every ten days, and 150 for the Battleford route; and in this estimate I calculated on obtaining, in addition, the use of the 230 teams which accompanied Colonel Otter; but, as the farm waggons, which were the only class obtainable, were unfitted with racks or nets for conveyance of forage, in addition to regular load, it became necessary to appropriate some waggons, at the rate of one in ten, for a three days' stage, to carry forage and supplies for the convoy, and this again materially reduced the general transport.\n\nBy your instructions, I recalled one Gatling from Colonel Otter, and this was brought back with some men of the Winnipeg Field Battery and Captain Howard, of the Connecticut National Guard, as Instructor, and placed on \"Northcote\" in readiness to join your column.\nThe Battleford Column, whilst delayed at Saskatchewan Landing through breakage of ferry, had consumed so much forage and supplies, that Colonel Otter very judiciously filled up his waggons from supplies at Landing, and in so doing carried off all the stores provided for the \"Northcote;\" and forage for horses as well as rations for Detachment 35th were wanting, and had to be hurried from Swift Current.\n\nAs already reported, the ferry was useless, and the owner could not repair it, as he was deficient of appliances, and the \"Northcote,\" after ferrying Colonel Otter's Column across, had blown out boilers for an overhaul, preparatory to her trip down the river, so that communication with Colonel Otter's Column did not exist; I therefore induced Captains Sheets and Saggar to employ their men in making the ferry passable, which was temporarily accomplished, but the teamsters now refused to leave for the north unless either escort or arms were furnished; and as I had learnt from Colonel Herchmer that 250 Snider carbines were in store at Regina Police Barracks; I telegraphed the Lieutenant-Governor, Mr. Dewdney, requesting they might be sent to Swift Current; that I might arm the teamsters; but he replied that there were none there, and when I replied quoting Colonel Herchmer as my authority, he replied that Colonel Herchmer was in error, there were only 100 in store, and that he would send me 50, which, after some delay, arrived; I at once telegraphed Captain Swinford to obtain 200 rifles for teamsters, and meantime, to satisfy the men going north, and until the arms were received, I detailed a corporal and three men of the Midland Battalion as an escort, to accompany the teams till Colonel Otter's first empty teams were overtaken.\n\nAs there was only one passenger train weekly at Swift Current, I arranged with Post Office Inspector McLeod, of Winnipeg, and with authorities of Canadian Pacific Railway, that daily mails should be forwarded from Winnipeg, and that all freight items, Canadian Pacific Railway, should carry bags to and from Swift Current; and I at once established a Military Post Office, where letters for all portions of the Field Force were received and sorted, and mails made up and forwarded by every opportunity, and a line of couriers, with relays of ponies, was established on the Battleford Trail, as Colonel Otter advanced, and letters and despatches were sent by these mounted couriers, whilst the heavy mails with the newspapers and parcels were sent by team waggons; and I was glad, as a small return for the courtesy the Militia received from the Post Office authorities, to carry the Civil Mail to Battleford with our Military Mail.\n\nI also notified the Supply Officer that, in connection with the transport service, it was desirable a Veterinary Surgeon should be obtained for Swift Current as soon as possible; and the necessity for this was soon manifested, as symptoms of glanders appeared among the transport horses, and under advice one was shot.\n\nAs there was no resident Magistrate at Swift Current, and it was possible that cases might arise affecting the large number of civilians brought together as transport employés and camp followers, I received a commission as Justice of the Peace for the North-West Territory.\n\nWhen it was understood that the South Saskatchewan would be utilized for transport, General Superintendent Egan, of Canadian Pacific Railway, constructed a telegraph line to the Landing, which was finished on the 18th April, and at once commenced working; but, as the operator had no means of obtaining subsistence, I authorized his drawing rations from the Government Stores, subject to re-payment as might be afterwards arranged. In the construction of this telegraph line, and in every way in which it was possible to render assistance, Mr. Egan offered every aid in his power, and the service owes much to his courtesy and readiness to facilitate all movements, as well as to the spirit which his example infused in all ranks of the employés of the Canadian Pacific Railway.\n\nAs early as the 20th April, I satisfied myself and represented that it would be much cheaper to deliver goods to Saskatchewan Landing by contract at a rate per 100 lbs., but was met with the objection that it was essential that full control of teams must be retained by the Commanding Officer, so that he could use them for\nmovement of troops in any direction, and this could only be carried out with teams hired by the day. However, I entered into a small contract with a local storekeeper who controlled some half-breed teams, to deliver 2,500 lbs. daily, on north side Saskatchewan River, at $25 per ton, whereas by day work the cost to the Government was, in delivering on south side, considerably over $32 per ton.\n\nThe ferry at Landing had been faultily constructed and insufficiently equipped, and broke down almost daily, giving constant trouble and anxiety, and the men of the Midland Detachment were constantly employed to row or pole the ferry scow across, and sometimes not more than one team daily was got across; but provisions and forage were unloaded from wagons and taken over by the men, who worked almost continuously, and were also engaged in cutting wood for the steamers as well as for fuel for cooking.\n\nThe Intelligence Corps, composed of Surveyors and their Assistants, arrived and reported on 20th. They were reported to you by Colonel Strubenzie, who I left in command whilst absent at Landing but, as no reply came, although other telegrams were coming in from you, I ordered half, under Lieutenant Beatty, to proceed immediately to Elbow, and patrol the banks of river, and report the progress of \"Northcote,\" and render any assistance either by protection or otherwise; and Lieutenant Beatty was also to report the most accessible line for a road from the main line of the Canadian Pacific Railway to the river, and on arrival of the \"Northcote\" at Clark's Crossing, confer with Captain Sheets and prepare a joint report on the river navigation, whilst Captain Dennis, with main body, was instructed to proceed on the Battleford trail, scouting to both flanks for a considerable distance, and if necessary leaving detachment to protect any threatened point, as Captain Howard, who had occupied his leisure, while waiting on the \"Northcote,\" in scouting, reported that he met traces of Indians on all sides, and that considerable numbers had been in the immediate vicinity of the camp and of the Battleford trail, and the mail couriers reported to same effect; but on the 22nd the telegraph line which had been broken was repaired, and your instructions were received and immediately communicated to Captain Dennis, to proceed to and patrol between Old Wives Lake and Cypress Hills to watch for fugitives. Captain Dennis at once moved across country from the Battleford trail to the Elbow, joining Lieutenant Beatty and establishing a chain of posts on the indicated line, which daily communicated by patrols; and I connected them with my headquarters by sending a courier daily to his nearest post, and thus brought in daily intelligence of all that passed on this line; and Captain Dennis was further instructed to give me immediate advice of any bodies of men moving south, by sending despatch to the nearest telegraph station, indicating probable points where they would cross the Canadian Pacific Railway, and keeping touch of them with remainder of force for further information, whilst I would move with the force held in hand at Swift Current and intercept them on the line of railway, for which purpose I arranged with the Canadian Pacific Railway officials to keep locomotive with her fires banked and ready to move at shortest notice.\n\nOn consultation with Dr. Roddick, Deputy Surgeon General, it was decided to send Deputy Surgeon General Douglas, late Royal Artillery, with a field hospital staff, and equipments, to Calgary, to join General Strange's column, whilst Surgeon Major Bell was detailed with a suitable staff and necessary medical outfit for the headquarter column; and as the Red Cross Ambulance Corps, fitted out by citizens of Toronto, was daily expected, and Dr. Roddick knew it would be the wish of the subscribers that this ambulance should accompany the Toronto troops, for which purpose it was considered to be well suited, notification was sent to Brigade Surgeon Strange (with the Battleford Column) of this intention.\n\nImmediately on the arrival of Dr. Natrass, with the Ambulance Corps, arrangements were made to despatch them; and, as transport was so scarce, Dr. Natrass was requested to store, with the Supply Officer, all articles that could be temporarily dispensed with, and to take only the most pressing requisites, which amounted in all to about 3,500 lbs., and were sent forward with him, and the party started with\nCaptain Dennis' division of the Surveyors' Corps; but, on that corps being ordered to the Elbow, there was some little delay in their proceeding, as well as subsequently at Saskatchewan Landing, and another detachment of the Medical Staff was sent forward by light team, and the Toronto Ambulance Corps followed very shortly afterwards.\n\nFinding it was absolutely necessary to place an officer on the Battleford line of communications, to keep me informed as to the actual transit of supplies, and to see that the departments worked in harmony, and that the troops gave necessary assistance in loading steamers and furnishing fuel, as well as ferrying supplies across the river, and to report on the state of the depots, I appointed Lieutenant Leonard, pending your approval, as Staff Officer on the lines of communication, with headquarters at Landing, and Lieutenant Weller, of Midland Battalion, who was recommended by Lieutenant-Colonel Williams, and was also a graduate Royal Military College, to be Staff Adjutant at the base.\n\nAs it was your wish that the \"Northcote\" should complete her load before leaving for Clarke's Crossing, and as you gave me to understand forage was your principal want, I instructed the Transport and Supply Officers to push on oats and hay for the steamer. Captain Sheets at first estimated he could take about 350 tons in steamer and barges, but on the 21st changed his mind and proposed to go with a light load on steamer, so as to test the river, and make a quick trip; and, knowing your desire that the Midland half Battalion should join you, and the burning desire of the troops to be in time for the fighting, after consultation with the late Lt.-Col. A. Williams, I called up the captains and enquired as to the men's capacity to march the 32 miles in one day, and they volunteered to accomplish it, so the right half battalion, under the late Lt.-Col. Williams, M.P., started on the 22nd, and accomplished the march of 32 miles in 12 hours. I also sent Dr. Bell's detachment of the Medical Staff Corps, with full appliances for a field hospital. And to complete the cargo offered an addition to the wages of all the teamsters who, starting from Swift Current that morning, would deliver their loads the same evening at the steamer; but, through some misunderstanding, 38 teams did not arrive till the morning of 23rd, when their loads were at once taken on board, and the \"Northcote\" started, taking in all about 200 men of Midland Battalion and the Medical Staff, also a number of Staff Officers, all with instructions to report to you, on arrival at Clarke's Crossing, for further orders, as well as Captain Howard, with one Gatling and 10,000 rounds ammunition; also three tons of artillery and rifle ammunition, and about 200 tons food and forage in steamer and barges. Captain Sheets expected to reach Clarke's Crossing in four days, but, unfortunately, the water had fallen so much whilst \"Northcote\" was waiting for her load, that he only arrived after 14 days' hard work, transferring cargo from steamer to barges, or the reverse, as it became necessary to lighten each in turn in passing the shallows. As this was expected beforehand, and it would thus mix up the cargo, and as with the limited staff available it would have caused serious delay to have detained steamer whilst regular bills of lading were made out, I considered it was advisable simply to check all freight passing from waggons to steamer and ascertain that none had been removed while on the trail, for, otherwise than by falling overboard, none could be lost from steamer whilst in transit; so simple accounts of the total quantity shipped were kept for reference.\n\nAs it was desirable to obtain fresh meat for the troops, I discussed the question of change of rations with the Principal Supply Officer, but concluded that with the limited amount of transport available forage could not be carried for beef cattle, so it would be well not to send cattle after the troops on the Battleford trail until the grass had grown sufficiently to furnish subsistence; but early in May urged they should be pushed forward, and meantime I pressed for the supply of fresh meat for troops in stationary camps. Also, as the Medical Officers reported cases of dyspepsia arising, in their opinion, from indigestible food, I urged the issue of soft bread and potatoes and onions, and the police Medical Officer supported my recommendation; but through some blunder the beef contractor delivered his cattle at Moosejaw instead of Swift Current, so that the troops in that district did not receive any fresh meat till about\n15th May, when, in passing Moosejaw, I found the cattle had been placed there, and at once gave instructions to deliver the meat at Swift Current.\n\nA very limited quantity of potatoes was available and compressed vegetables had not arrived; fresh bread could not be obtained from contractors, and a difficulty arose in obtaining sufficient supply of fuel, which was brought by Canadian Pacific Railway from the Rocky Mountains. So I pressed on the Regimental Officers to exercise their skill in constructing proper field cooking places for their companies.\n\nCaptain Harrison, of the Midland Battalion, first undertook an improved kitchen, and Captain Tracy and Lieutenant Hesketh, of the 7th Fusiliers, afterwards constructed one which economised four-fifths of the fuel, and which was again improved on by Captain McCrow and Lieutenant Fiske of the Halifax Battalion; and as I was informed in reply to telegram that no field ovens could be got either at Winnipeg or Ottawa, I called on the same officers to build ovens suitable for baking bread for their corps; and the 7th Fusiliers erected a very successful oven with capacity for baking for the whole Battalion, and which was later on completed by the Halifax Regiment, and worked well; but it was found later that in some places it was possible to contract locally for supplies of fresh provisions, and I authorised this arrangement, and believe that in each case there was no increased charge to the public, whilst the troops benefited materially.\n\nLater on, after consultation with the Principal Medical Officer, it was considered advisable to furnish oatmeal and molasses to the troops that were stationary, in lieu of some other portion of the rations, and I instructed the Supply Officer to furnish these articles to the several corps so situated, and notified the Commanding Officers, that instructions had been given to this effect. However, only a small quantity was sent; and as the breaking up of the force was evidently imminent I did not press for further supply.\n\nOn the 27th April the \"Minnow\" arrived at the Landing, and as the \"Northcote\" was reported aground in the river, and as drawing thirty-three inches, and the \"Minnow\" only eleven inches, and the water still falling, I ordered her to proceed at once, to take from the \"Northcote\" the Gatling gun, the 9-pr. ammunition, and the Hospital Corps and Staff Officers, and proceed to join you without delay. But the Captain was most anxious to obtain the assistance of a half-breed named Gun, who was going down the river with a scow, and I allowed him to tow the scow, and placed ten tons of oats in it, as you advised me you were badly in want of them.\n\nI have fully reported on the services rendered by the Galt steamers, in the memorandum marked A which accompanies, so will only further report here, that \"Baronesse\" with barge in tow, arrived late on 5th May, and \"Alberta\" with barge, at noon on 6th at Landing; and on 7th, the two companies of the Midland Battalion under Major Smith had completed loading about 350 tons in steamers and barges, and had embarked for passage, and left on morning of the 8th; the \"Baronesse\" casting off her tow barge and arriving on 14th, and the \"Alberta\" with her barge, reaching the Crossing on 17th. Captain Davis of the \"Baronesse\" fell on her icy deck on morning of the 6th May, and broke his collar-bone, which explained the delay, as it undoubtedly interfered with his activity and energy, and he had been sanguine of making a more rapid passage down stream.\n\nAlthough Captain Davis claimed an escort, I did not consider there was any real need of the Troops going on the steamers for protection, but it was necessary to cut wood for fuel for the steamers, and as time was of extreme importance I considered it desirable to send men who would assist the crew; and thus shorten the delays.\n\nI reported at the time, that when the crews of the two barges cast off by \"Minnow\" \"struck,\" Lieutenant Weller, graduate of R.M. College, my Staff Adjutant at once zealously volunteered to take the loaded barges to Clarke's Crossing, and, with ten experienced raftsmen, volunteers from Midland Battalion, drove during the night to the Landing, and started down the river on arrival on the 1st May, leaving the Landing before the striking crews, who were holding out for higher wages, knew that any steps had been taken to fill their places. Unfortunately one barge was\nwrecked in the rapids, at the mouth of Swift Current River, but he transferred the uninjured cargo to the other barge, and arrived at Clarke's Crossing on the 16th May. I had instructed Lieut. Weller to furnish a report on the possibilities of utilizing the river for our regular transport service, and in his report, which I immediately forwarded to you, he was strongly of opinion that with proper appliances and trained men, no serious difficulty need be experienced.\n\nShortly after arrival, finding some of the supplies unsatisfactory, and having regard to the enormous cost of transport to the front, which only justified our forwarding really good articles, I ordered a Board of Survey to assemble to report on some hay that had been received which I considered of inferior quality; and one earload was condemned, and I notified the Principal Supply Officer so that he might deal with the consignor.\n\nOn receiving news of the action at Fish Creek, and of non-arrival of \"Northcote\" with Hospital Corps, the Principal Medical Officer, Dr. Roddick, after consultation with me, decided to proceed at once to supervise the hospital arrangements, and accordingly started with ten Medical Staff, Surgeons and Assistants, proceeding by Moose Jaw, thence by trail, to Clarke's Crossing, which he reported as the most convenient route accomplishing the distance in light waggons without change of horses in sixty hours.\n\nWhen passing through Winnipeg on my way to the front, I had discussed with Mr. Wrigley, Commissioner of Hudson's Bay Company, the possibility of forwarding supplies down the river on rafts, if it should be found too shallow to navigate with steamers, and on 30th April I received a telegram from Mr. Wrigley stating that you had approved his proposal to construct ten flat-bottomed boats, drawing about 13 inches of water, and each to carry about twenty tons and twenty men, and that train would leave Winnipeg that evening with lumber and workmen, and asking me to arrange for immediate transport to Saskatchewan Landing for eighty tons; and that Messrs. Boyd & Crowe, the contractors had undertaken to have boats ready to transport one hundred tons to Clarke's Crossing in twenty-four hours after material was landed at river, and they confidently expected to land freight in from four to six days. I accordingly met Mr. Boyd on his arrival, on morning 2nd day of May, with 90 teams, and by giving a small extra allowance to the teamsters, the whole of the material and the workmen were delivered at Landing on morning 3rd May.\n\nMr. Boyd had omitted bringing caulking iron or caulkers with him, but (as an illustration of the handiness and usefulness of our Militia I mention this) Lieut. Anderson of Halifax Battalion, an experienced machinist, at once volunteered and made what caulking irons were required, and Major Smith furnished some caulkers from the Portsmouth Company of the Midland Battalion. The barges would have been completed very nearly within the contract time, but as the Galt steamers arrived just then, and could move more rapidly on the river, I ordered them to be first loaded, and Mr. Boyd's workmen assisted in erecting shoots to expedite this loading.\n\nOn the completion of the ten barges, Mr. Boyd had some surplus material; and as there had been some delay in completing the cargo, I sanctioned the construction of two additional barges, and by the night of the 10th of May the twelve were loaded and ready to start down the river. The delay referred to was owing to inability to deliver supplies more rapidly at the Landing, although the land transport was worked to its utmost capacity, and during the week then ending, 105 tons of supplies had been ferried across the river, 115 tons had been loaded on and gone north on waggons, 354 tons had been loaded on Galt steamers, and 249 tons of supplies on Boyd's barges, in addition to the baggage, camp equipage and ammunition, of over 400 men. In all about 800 tons, had left the depot, in addition to the forage consumed by the transport teams at both sides of the river.\n\nThe contractor now claimed that he had stipulated that twenty soldiers should go in each barge, to assist in working them and for protection. So I telegraphed Mr. Wrigley, who replied that his contract was to build the boats and find the crews to take them to Clark's Crossing, and the soldiers were only to be sent as a guard, if considered advisable. So I ordered an issue of rifles to the crews for their protection;\nbut the contractor maintained that his was the correct view, and that his men had only hired on the understanding that the troops would go, and they would refuse to go unless soldiers were sent with them.\n\nJust then your telegram arrived, conveying instructions to send the Midland detachment and the 7th, via Moose Jaw, and I communicated with Major Bell, who advised that he could not furnish transport via Moose Jaw, and no forage was obtainable there, and recommended sending the troops back to Qu'Appelle; and thence by trail; but as meantime the river had risen several feet, and Captain Davis expressed confidence in making the run to Clarke's Crossing in three to four days, and Mr. Boyd still expected to take the barges down in four to six days, I considered that serious litigation and trouble would be saved, and your supplies would not be retarded, and the troops, whose early arrival was desirable, and who were burning to get to the front, would, from all these assurances, reach you more rapidly than by any other means. So I sent forward the 7th Fusiliers to the Landing, arranging that the headquarters and three companies and the detachment of the Midland Battalion should accompany the barges, and that two companies should remain at the Landing to load and accompany steamers on the next trip. This would have allowed about 20 men to each barge; but as I knew it was your wish that the whole battalion should join you as early as possible, I ascertained from Mr. Boyd that he claimed no remuneration for carrying men, but expected 200 men for aid and protection, and could carry 400 men. So I assembled the Captains of the 7th at the Landing. On their arrival and after they had seen the barges, asked whether their men would put up with the crowding so as to avoid being broken up into detachments, and if so, I would send the whole regiment. They were unanimous and most urgent in their desire to go, offering to put up with any inconvenience and do all the work of the barges if permitted to go together. Under these circumstances Mr. Boyd offered to make more room by discharging his civilian hands, keeping only one for each barge as navigator, and this was finally so arranged; and proposed to give $100 to the regiment if this were permitted, but I did not think this latter desirable.\n\nI directed the senior officer, Colonel Deacon, to assume command of the troops, desiring that they should keep together for mutual assistance, and to this end placed the rations on one barge; the troops accordingly embarked early on morning of 11th May, companies being kept intact as much as possible, and the flotilla started under Mr. Boyd's orders, in close succession, about 8 a.m., on that day.\n\nColonel Deacon was instructed to forward me a report on arrival at Clarke's Crossing; but I first heard from Major Kirwan, on 18th inst., that three barges had arrived, and had thrown portions of load overboard. So I at once notified Major Kirwan to keep an account of all shortage on delivery of cargo, as their contract was a fixed rate per ton on what they delivered, and the contractors were responsible for what they received; also to obtain all particulars in his power, and after enquiry he reported he had ascertained all particulars about the supplies left in river, and I urged him to try and recover them; but he found he could not approach them with teams, and at that time could not reach them with barges. I also telegraphed to Colonel Deacon to call upon officers commanding the troops embarked in the several barges, stating that reports to this effect had reached me, and requesting an explanation by whose orders this had taken place. I forwarded to you a copy of his report when received, and now attach a copy marked B.\n\nColonel Deacon appears to have been under a misapprehension that he had control of the barges and the navigation, whereas his orders were simply to command the troops for military purposes, the control of the movements of the barges remaining with Mr. Boyd, who was responsible for the safe delivery of the cargo. Mr. Boyd, in his telegraphic report of arrival, made no mention of cargo thrown overboard; but when I met him at Moose Jaw, on his return journey to Winnipeg, he informed me he had reported his arrival to you, and that you had expressed yourself well satisfied and greatly pleased with his work, and had given him a receipt on which voucher he was to draw his pay, including extra allowance for the troops taken down the river; and as he did not apply to me for any vouchers beyond those for the quantity loaded.\non the barges at the Landing, I concluded his statement was correct and took no further action, as I felt sure he should not obtain payment without receipts from you or me.\n\nIt was constantly necessary for me or some other officer to proceed to the Landing at a moment's notice, or to send across on some special duty; and the hired teams were unsuited for this purpose, and teamsters objected to their horses being used, and no teams were locally obtainable. So I instructed the Supply Officer to purchase two pairs of active ponies and two light wagons, which could be kept severally at Swift Current and the Landing for any emergent communication; and as the expected ambulances did not arrive, also for moving sick and wounded, who it was intended should be brought up the river in the steamer. And although there was considerable delay in obtaining these, still they paid for themselves several times over whilst they were maintained, as they were almost continuously employed between Saskatoon and Moosejaw hospitals, and when not employed on courier or ambulance duty, they did all the camp transport work, and saved taking transport teams off the trail, and eventually the horses sold for fair prices when the base was finally broken up.\n\nLieut. Beatty had strongly recommended Chaplin Station as the best point at which to leave the railway, with a good trail of 45 miles to the Elbow, and Rush Lake was also recommended as being only 15 miles from the Saskatchewan below its confluence with the Swift Current stream, where are situated the worst rapids on the river, and where our navigators had experienced the most trouble. I was, however, assured that the railway facilities were not sufficient at either point, and that the Canadian Pacific Railway management would not increase the accommodation; an assurance which I have since had reason to believe was erroneous—but it was difficult to obtain precise information, and I had no available officer to send out to examine the country, nor could I obtain the reasons which had influenced the selection of Swift Current as the railway base; and as I now had a strong transport train at work between Swift Current and the river, and had, I knew, from the quantity recently shipped to your column and Colonel Otter's, satisfied all immediate requirements, I considered it was now proper I should ascertain the next steps to be taken, what steamers I might rely upon to move the stores I was accumulating, and whether it was likely the same route would be maintained throughout the summer for the supply of the Headquarter and the Battleford column, as I felt that by a system of contract such as I had proposed on the 20th April, the cost of transport might be materially reduced. Therefore, as you had referred the matter to Mr. Wrigley, I consulted him by wire, and it was mutually decided that an interview would enable us to settle all these questions more satisfactorily. So after spending some hours with Capt. Swinfodd and Major Bell at Qu'Appelle, discussing supply and transport questions, I proceeded to Winnipeg, and found Mr. Wrigley most anxious to give all advice and assistance; and ascertained that I could only rely on the Galt steamers, as the Hudson's Bay Company would require all their own boats on the north branch for their own and our service. So saw the necessity of shortening the river route, and after consultation by wire with Colonel Otter, recommended that Moose Jaw, which had considerable railway facilities, should be the new base, with steamer from the Elbow to Clarke's Crossing carrying supplies for both columns; the Battleford supplies going across the neck from Clarke's Crossing to Telegraph Coulee, which Colonel Herchmer advised as the most practicable route, and thence by North River to Battleford; this would reduce the number of bases and of intermediate depots, as well as of land transport, concentrating the stores for both columns and rendering the line so much easier to guard, which could be done by one military post at Clarke's Crossing controlling the land-trail to the North Branch, and thus avoiding the risk of capture of teams on the Swift Current and Battleford trail, where the line was partly through dangerous country in the immediate neighborhood of Indian reserves, and without military protection for 170 miles.\n\nOn 8th May, Colonel Otter telegraphed that he required artillery and rifle ammunition, and some more scouts, and that unless escorts were furnished the communication might be stopped at any moment. I advised him that I had sent off a large\nquantity of supplies as soon as the ferry was put in order, and could send off ammunition next day, but had positive instructions not to send any escorts, and, in any case, had none available, and enquired if he could not send out to meet convoy and accompany it through doubtful country. He replied he was sending to edge of woods to meet 30 incoming wagons, and would send escort to meet ammunition.\n\nI at once reported Colonel Otter's wants, and that large parties of mounted Indians were reported on trail by couriers and teamsters; but, under your instructions, I could not send escort; and, as your information was that the road was quite safe, and you instructed that some ammunition should be sent, I arranged for the despatch of a moderate supply and availed myself of the opportunity of the departure of the contract outfit carrying the contributions from people of Toronto to the Queen's Own Rifles, which was going forward under charge of Lieutenant Blake of that corps, as I preferred that in any emergency an officer should be in charge who would act with discretion. I requested the Principal Medical Officer to examine all convalescents and report such as were fit for duty; and as Colonel Otter had asked me to send him some more scouts, I accepted several men who offered, agreeing to provide them with rations and transport to Battleford, where they were to report to Colonel Herchemer for service, and furnishing them with arms, on the understanding that they would act under Lieutenant Blake's orders for the defence of the convoy whilst on the road; and thus, without withdrawing any of the troops from the stations you had selected, I was enabled to furnish an escort of an officer and about 12 men for the ammunition, and relied upon Colonel Otter's assurance to send out a force to meet it at the edge of the woods.\n\nIf this convoy had left when first arranged and announced by telegram, it would have been near the locality where Poundmaker captured the 31 teams on the 14th May; and later investigation may show that he had in some way received the information of the valuable convoy in transit, and had gone out to meet it, expecting it would be unprotected. Fortunately, the causes above named had delayed Lieutenant Blake's departure; and he had only proceeded a few miles north of the river whence he was at once recalled by courier and the ammunition brought to south side and placed under the protection of the detachment stationed there. Immediately on receipt of Colonel Otter's report of the capture of 31 supply teams near Battleford, on the 14th May, 11 of which were reported to be loaded with provisions and 20 with forage, and his request to stop all transport by the Swift Current route, I asked him to clear the northern end of trail, and prepared 150 teams to move in one body, considering that the 150 teamsters would be sufficient protection through the open country; but the officer commanding troops at Landing reported that teamsters openly stated they were not engaged to fight, and if attacked would cut loose their horses and gallop off; and the Transport Officer informed me they also objected to being placed under orders of the Assistant Transport Officer, who had accompanied them on a former occasion. But it became necessary to take some decided steps to get supplies forward, as Colonel Otter telegraphed that his supplies were getting short, and when matters were explained a number of the teamsters volunteered to go to the front, accepting my proposition that some mounted scouts should be sent with them to examine the country in advance, and give them time to form corral if threatened with attack. So I instructed the Transport Officer to retain in service those well-disposed men and dismiss the remaining teams, and to engage a number of scouts and, if possible, purchase the horses of the captured wagons, as reasonably as possible, to mount the scouts. But all trouble was removed when Colonel Otter telegraphed that Poundmaker was asking for terms and had sent in the captured teamsters, who reported that they had been well treated. However, I still considered precaution necessary and arranged with Colonel Otter to meet the convoy at the edge of the woods, and on the 25th May sent forward 158 teams, accompanied by Mr. Tims' contract outfit, under charge of Lieutenant Blake, and an escort of 27 convalescents and scouts.\n\nAs early as 28th April, the Staff Officer at the Landing, reported that teams returning from the north required shoeing, and were generally short of tents, cooking\napparatus, &c. On enquiry I ascertained that a 'blacksmith' had been sent with the transport train accompanying Colonel Otter; but the teamsters stated positively that he had not put a shoe on a transport horse, being occupied when at work with the police and scout horses. I at once applied to the Supply Officer for blacksmiths and forges, but he replied that he had notified the Transport Officer, in whose department the matter would be. I then notified the Transport Officer repeatedly that blacksmiths must be sent, but great delay ensued, and I regret to say that at one time it was reported to me that 68 teams were idle (although, I fear, drawing pay) on the north side of the river; and the mail couriers reported teams laid up all along the road with horses so crippled that some actually died on the prairie. I ascertained that some shoeing smiths were in the ranks of the Halifax Battalion, and applied for some portable forges, and would have put these men to work, but just then some blacksmiths arrived but without forges; so were unable to do any work until these arrived.\n\nThe first few teams going out were fairly supplied, and the newly arriving teamsters recognising the emergency, were willing to put up with discomfort on the assurance that their wants would soon be supplied; but the Transport Department did not appear to show foresight, or to make adequate provision for the requirements of this important service. Tents, cooking kit, waggon covers, axes, &c., were wanting, and were only supplied when repeatedly asked for, and then in insufficient quantity. Axle grease was so deficient that all available tallow and coal oil from Canadian Pacific Railway workshop was requisitioned and utilized, and when this was exhausted it was more than once feared the teams would be unable to move.\n\nWhilst in consultation with Captain Swinford at Qu'Appelle I was invited to assist at the magisterial investigation of a charge made against a firm of storekeepers at Indian Head, of selling ammunition to Half-breeds and Indians; and I was surprised to learn that, although a law had been enacted forbidding such sale, it required to be put in force by proclamation, and no evidence was obtainable that this had been issued; consequently action under the Statute was not taken; but to check such dangerous practices the magistrate decided to adjourn the case; holding the accused to come up for further hearing when called upon, and meantime they undertook not to sell to doubtful persons and to keep a record of all to whom they sold ammunition.\n\nOn 25th May I forwarded to you copy of a contract made by me with Mr. John Stewart, for conveyance of supplies from Moose Jaw to Elbow or Clarke's Crossing, together with memorandum explaining the conditions under which the contract was let, and my reasons for thus acting, and showing a saving to Government of at least 50 per cent, on all goods delivered at Clarke's Crossing. I attach copy of this correspondence, marked C. I at once authorized Mr. Stewart to commence work, but regret that considerable difficulties were interposed to the carrying out this contract and the final settlement with the contractor. Mr. Stewart requested permission to insert an offer for moving supplies to Clarke's Crossing via Qu'Appelle, as an alternative route if the Moose Jaw trail should be found impracticable, as the advocates of the Qu'Appelle route asserted; but I had not originally asked for such an offer, and I explained that there was no objection to his embodying his proposal, but you wished the Qu'Appelle route should not be interfered with, and I told him I should take no action in that direction.\n\nI received your approval of my recommendation to transfer base to Moose Jaw on 22nd May, and at once gave orders to discharge all hired transport, and on 23rd moved the Headquarters with the Troops and the Field Hospital to Moose Jaw, arranging that one month's supplies should be left with the detachment Halifax Regiment at Saskatchewan Landing, although I hoped that the returning steamers would clear off the supplies at that point, and that the detachment could be withdrawn in a few days.\n\nWhen first you established the base at Swift Current, plans were drawn, and preliminary negotiations entered into for the erection of a wooden building as a Hospital; but the unsatisfactory progress of the \"Northcote\" and the good state of the Moose Jaw trail, led to the removal of the base; and on his way to Saskatoon,\nDr. Roddick, Principal Medical Officer, had ascertained that a vacant hotel could be obtained at Moose Jaw; and on my return from consultation with Mr. Wrigley, I examined all the available buildings, and rented the hotel he selected, and obtained the refusal of several other large buildings, if increased accommodation or isolated treatment should be necessary; also cottage for the lady nurses expected, and at once had the principal buildings put in order and the necessary alterations made; which was done at very small expense, chiefly in increasing ventilation, and throwing rooms together, and providing proper storage and provision conveniences, rough tables, shelving, &c., for the reception of the first party of wounded, who were expected on 24th, but arrived on 26th, when 29 came in from the Elbow, to which point the \"Northcote\" had brought them. And some were so far recovered that I at once ordered a Medical Board, and on 28th forwarded ten invalids to their homes, accompanied by some of the surplus Medical Staff, requiring, however, in each case, an assurance that the man to be invalided had a comfortable home, in which he would be properly cared for, so that he would not be a charge to the community to which he belonged. Whilst for the men of the permanent corps and for those who were reported as fit for active duty, I established a convalescent depot, placing them under charge of Lieutenant F. J. Dixon, a graduate of Royal Military College, who had thrown up his civil employment, and come to Winnipeg at his own expense, to offer his services; and who, in addition to this duty with the convalescents and invalids and as my Aide-de-Camp, was otherwise fully occupied in the Brigade Office.\n\nOn the 1st June, seven lady nurses arrived, under the charge of the Mother Superior of the Society of St. John the Divine of Toronto, and I placed them in the comfortable cottage already engaged, which afforded them the necessary privacy, and yet was conveniently situated for their work.\n\nThe services rendered by these ladies were of great value, and the hospital details were properly attended to, and the patients made thoroughly comfortable, in a manner that an improvised male hospital staff, however willing and well disposed they might have been, could not have accomplished. The ladies, one and all, evidently came with the determination to devote their whole time and energies to their soldier countrymen; and their single regret appeared to be that the wounded recovered too rapidly, and that the health of the remainder of the force was so exceptionally good; and the lay sisters kindly gave their assistance in any amusements got up to vary the monotony of camp life.\n\nOn 13th June, 15 more invalids arrived from Saskatoon by trail, and Medical Boards were from time to time held, after consultation with Principal Medical Officer, and convalescents sent direct to their homes. But it was considered expedient to depart in some measure from the Militia Regulations, and to hold a merely interim board, obtaining professional opinion that the invalid was not at present fit for active service, but leaving open until final recovery, the question whether any permanent ill effects had resulted from the injury. The documents were in each case forwarded to the Adjutant-General of Militia.\n\nOn receiving your instructions that there were plenty of supplies at front, and that no more should be forwarded, and that you wished the transport and other staff discharged, and that you would send the remainder of wounded by river and lake to Winnipeg; and as the acting Principal Medical Officer received instructions from the Surgeon-General at Ottawa, to close the hospital and send home the staff, I arranged with him to remove all patients and furnished transportation for them and the nurses and the staff, and gave up the building to the owners. And the nurses, staff and patients left on the 26th June for their homes.\n\nThe wounded men taken up on the field where they fell, had only the clothes they were wearing at the time, and these were usually blood-stained, or cut up in the first dressing of the wound. I therefore ordered a complete supply of clothing from Winnipeg, but only received some uniforms. I was able to supplement this, by obtaining from the Purveyor-General a considerable amount of underclothing kindly sent by the various Ladies' Aid Societies for distribution. And where the supply ran short I unhesitatingly took the responsibility and purchased on the spot what-\never was urgently needed, for the health and respectable appearance of the men returning to their homes, or rejoining their regiments. Difficulties were made as to some supplies, as of boots, because the regulation quantity had been issued; but these men had been compulsorily parted from their kits, and I considered they must be supplied, even if not in strict accordance with regulations, as they could not be permitted to go through the country barefoot, or barebacked.\n\nIn my report of 24th May, of change of base, I mentioned my hope that the \"Northcote\" could, in two trips, remove to Clarke's Crossing the 500 tons supplies stored at Landing, by using the large Galt barge lately sent there; and could bring invalids to the Elbow on each trip. And on 26th and 26th May, in reporting departure of convoy, stated that mail couriers and depot clerks, had left the route where Poundmaker raided the teams. So I had now closed depots on the Battleford route, and repeated my proposal to clear up the depot by steamer, which could at the same time pick up the goods left along the river; but on the 27th your message that you had given over the \"Northcote\" to the Hudson's Bay Company, necessitated fresh arrangements; and as Major Bell had come to Moose Jaw in connection with Mr. Stewart's contract, he agreed with me in submitting to you a proposal to obtain tenders to move the supplies direct by trail from the Landing to Battleford, as although the cost would be somewhat higher than water carriage, we should save it in the value of the goods, as it was reported they were deteriorating from exposure to weather; and on obtaining your approval, I communicated with Major Bell, who sent Mr. J. Stewart to me, who tendered to move all supplies by trail to Battleford within two weeks; and although I received an offer at a lower rate, the latter tender did not name a time limit; and as I was most anxious to withdraw the detachment Halifax Battalion stationed at the Landing, I recommended the acceptance of Mr. Stewart's tender. But for some reason there was considerable delay in dealing with this offer, which was to be accepted if Mr. Stewart would himself go to Qu'Appelle to make the arrangements, and this Mr. Stewart refused to do as he stated he wished to be on hand to secure the requisite teams. And meantime the teams he depended on were being shipped to their homes. I then telegraphed to Colonel Whitehead, who replied that he had instructed Major Bell to arrange with me and Mr. Stewart as recommended; finally Major Bell, after keeping the matter opened for three days stated that he had a much lower offer than Mr. Stewart's, and repeated the request that Stewart would go to Qu'Appelle, but eventually wired me, that he had made arrangements to move the supplies, and that teams would leave Qu'Appelle that day, although there had been plenty available on the spot. I was unable to obtain the name of the contractor or the terms, but the clerk from Major Bell's Transport Office arrived at the Landing, and announced himself as the Contractor, and the name of the firm of Bell and Lewis was again mentioned in connection with this contract. But I finally ascertained from Mr. White that the contract was being filled by a Mr. Howard, and that time was not a condition of contract, whilst your telegrams informed me that he was receiving the same rate for one hundred miles at which Mr. Stewart had offered to move the goods the whole distance of 170 miles, i.e. $6.75 per hundred pounds. Mr. Stewart also guaranteeing to take all stores off our hands at once, and release the troops, and to move all within a fortnight from date of acceptance. But under Mr. Howard's contract the troops were not relieved till the 26th June—nearly a month after the original proposal.\n\nShortly after arrival at Moose Jaw the Mounted Police Sergeant stationed there, seized some alcoholic liquor for use of hospital, marked Hospital stores, and consigned to the Purveyor-General; and, I was informed, stated that he had positive orders to seize all liquors in Purveyor's stores. I at once telegraphed the Lieutenant-Governor, requesting that orders might be given to stop this interference with Government property. But he declined to interfere and stated that the parties who imported must take the consequences. I then furnished him with list of quantities actually in store, and requested permit, so as to comply with provisions of law, which, however, he refused, as he stated the quantity was too large and also wrote me to same effect, but finally instructed Police to accept my certificate as to quantity in store.\nI proposed that all liquor seized by Police from private parties should be handed over to the Purveyor-General for hospital use, instead of being destroyed, but Mr. Dewdney would not consent to this as it was not in accordance with the law.\n\nThe bulk and weight of supplies for men, and of ammunition and stores, would have been comparatively trifling; but horses consumed over 40 lbs. each per day, and allowing for waste and damage probably 100 lbs. per day for each team; and to reduce, as much as possible, this heavy tax on the transport service, I urged the teamsters to graze their horses whenever possible, and in some cases when desired I provided herders. And after 10th May gave orders not to send any hay on through teams for Battleford, but only to furnish hay to way depots on trail. But when Major Bell was at Moose Jaw about end of May, he specially urged that hay should be sent on to Clarke's Crossing, as he insisted that the teamsters' horses required it. And in accordance with his urgent requisition I recommended sending it, until I received a telegram from Captain Hudeon, Supply Officer at Clarke's Crossing, not to send any more hay, as teamsters would not use it.\n\nMy time and attention were so fully occupied at Moose Jaw, that I was unable to visit Swift Current and Saskatchewan Landing, as I intended and wished; but it appeared to me that there was very serious delay in shipping off from Swift Current the teams which I instructed the Transport Officer, on 21st May, were no longer required and should be dismissed. I endeavoured to obtain some explanation of their employment, but could not obtain any; nor could I learn whether they drew pay, whilst waiting there and at Saskatchewan Landing, although I know that they received forage and rations.\n\nOn 1st June, some scouts who I had sent forward, as already reported, about the middle of April, to join Colonel Otter's column, and serve under Colonel Herchmer, reported themselves at Moose Jaw for discharge, but without any documents whatever. I ascertained they had come from Battleford under Captain Neale of the Mounted Police, from whom I received a letter some days later, and telegraphed him and Colonel Otter for explanation, also to the Paymaster to pay them off as Colonel Otter advised me their pay was $5 per day. Colonel Forrest referred to Colonel Jackson, who stated the Mounted Police must pay them. I then wired Captain Neale who referred the matter to the Comptroller of Police at Ottawa, who advised that the Militia Department had decided that Colonel Jackson would pay them; but as the Paymaster still received no authority, I personally pressed Colonel Jackson to deal with the matter, and finally on his request wired the Department at Ottawa, whence I was informed that the matter had been referred for your consideration. So I wired Colonel Otter to explain the case to you; but I understood afterwards you were away from the telegraph line after Big Bear, and the case was evidently not explained to you, as in reply to further telegram you replied that the pay of scouts was to be left for the Department to settle.\n\nI was most desirous to stop further expense, and as the men could not leave for their homes without funds, I took the responsibility of discharging them, and adopted the method of accounts used by the Mounted Police, and issued certified accounts which pass at the Hudson's Bay Company's stores as cash. But the Militia Paymaster refused to accept these. So the men remained at Moose Jaw, and having no funds, I issued rations to them; but on the distinct understanding that this should constitute no claim to pay. And I periodically called the attention of the Paymaster to this matter until on 6th July, he wired me he had received authority to pay the men.\n\nThere was some difficulty and delay, also, in the settlement of the accounts for the scouts hired, and for the horses and saddles purchased to form the escort for the provision and ammunition convoy sent to Colonel Otter on 25th May; but the pay for these men was also authorized on the above-mentioned date.\n\nI had received reports that settlers had taken out teams to remove and appropriate the supplies, reported to have been landed from Boyd's barges, and left by the steamers along the river. So I twice sent out intelligent officers to search the river banks for waggon tracks and to follow them up; but they reported they could not find any wheel marks in that direction, and, as Mr. Kerr, late foreman to\nBoyd & Crowe, informed me he was going to build some more barges and take freight from Swift Current or Rush Lake to Prince Albert. I agreed with him to save any of the supplies he could find and deliver them to the Government officers at Prince Albert, for which he was to receive at the rate of $1 per hundred lbs.\n\nYour telegram of 19th June, from Fort Pitt, which was delayed in transit, instructing me to dismiss all staff, was immediately acted upon, and on 24th I reported all civilians but one had been discharged, and that I was temporarily carrying on all the duties with assistance obtained from the troops; and, in reference to your instructions to have all Government horses and other goods taken to Winnipeg and handed over to the Storekeeper, I consulted with the Government auctioneer as to the locality where the Government horses and other property which could not be stored, could be most advantageously disposed of; and he urged that, in consideration of the expense of freight to, and maintenance of horses in, Winnipeg, a larger return would be realized by local sales. So I recommended to you that these articles should be auctioned at the same time as the hospital stores, which were to be sold under orders from the Surgeon-General, and this was accordingly carried out.\n\nOn 18th June Captain Swinford was reported sick at Qu'Appelle, and wired asking that I would allow Major Rickards to proceed to Qu'Appelle for a few days to assist him. So I gave Major Rickards leave to go and undertook to supervise the duties of his office during his absence; but appointed Lieutenant Dixon to take charge as Supply and Transport Officer in addition to his other duties. Major Rickards, however, never returned for duty, but paid one or two visits and informed me he had so arranged matters with Colonel Whitehead. Hence I did not interfere, as Major Rickards had been a most energetic and useful officer, uniting in his efforts to forward the public service, working at any hour of the night, if I required his service, and setting an example to his assistants and to the fatigue parties sent to handle supplies by putting his own hands to the work to expedite it. But his absence just at a juncture when work was being closed up and information was constantly required, was singularly inconvenient.\n\nThe Saskatoon Hospital was established to meet a sudden emergency, at a time when the river was too low to admit of its use to transport the wounded, and appliances and supplies for a standing hospital of every kind were deficient. So the Medical Staff took from the settlers whatever was wanted for the use of the sick, and received many other services from them in the shape of baking bread and cooking, use of houses and furniture, milk, eggs, &c.; and during the whole period of our occupancy of Saskatoon issued provisions of all kinds to the settlers, consequently cross accounts had become very complicated. Deputy Surgeon-General Roddick brought this to my notice, and further informed me that he had explained it to you, and that it was your wish I should send an officer to examine and put in order these accounts. I therefore instructed Lieutenant Leonard, who had shown himself clear-headed and accurate, to proceed to Saskatoon to undertake this duty, meeting Dr. Roddick there and receiving explanations from him; and as the settlers at Saskatoon were stated to have placed all their property at the disposal of the Medical Officers, to treat them liberally in closing the account. Lieutenant Leonard had not returned when I left Moose Jaw, and I did not receive any detailed accounts from him, which, however, it is possible he furnished to Dr. Roddick. I received from him the simple statement that he had scheduled and balanced the accounts, showing, after all credit to the Government for provisions supplied, a cash balance of $1,000 due to the settlers. His report, marked D, is attached.\n\nAccounts of all kinds were now presented, and claims for services rendered poured in; and as all pay matters had to be referred to Winnipeg for settlement, and vouchers strictly in accordance with Militia Regulations were required, which it was next to impossible to induce the claimants to furnish, there was considerable delay and dissatisfaction in the settlement of outstanding claims, which, however, I endeavored to close up as far as possible, as, being on the spot, I could more readily obtain and furnish explanations; but, learning from you it was your wish to unite the whole force under your immediate command, and that Lieut.-Col. Bremner could\nwind up any unfinished business at Moose Jaw, I handed over the command to him, with all the correspondence of the Brigade Office, books, letters, telegrams, sent and received, for which I took his receipt, and finally left for Winnipeg on the 7th July, hoping to meet you there, and afford you any information you might desire, especially in reference to transport matters. But when I arrived there I found you were not expected for a week, and as I had no duties to perform in Winnipeg, I left for home next day, reporting myself to the Minister of Militia at Ottawa, in case he wished to be informed on any matters which might have been referred to him, or brought to his notice.\n\nThe regulations defining the duties of the position to which I was appointed—Commandant of Base and Lines of Communication—were not well known here, and a copy was unobtainable. Hence it was at times difficult to make clear to the superior officers of the several departments their responsibilities, and the method by which harmonious action could alone be ensured. The instructions I received from you when leaving the Headquarter Column near Humboldt were very brief: \"To go back to the line of railway and act for you.\" In doing this it was necessary to act upon one's own judgment, after as full as practicable a consideration of the circumstances, and above all, to act promptly. Our means of communicating were limited to the one telegraphic wire, via Qu'Appelle, which was constantly occupied, and often not in working order; and from what came to my notice, as to the making public of messages, it was not desirable to communicate too freely, and impossible to communicate fully; hence, no doubt, action taken by me may have, in some cases, appeared inexplicable to you.\n\nAs a rule, my first consideration was to furnish the Column at the front with what was urgent, as economically as possible; but no effort was spared, and in emergencies, economy gave way to urgency; and the immediate requirements being met, my attention was given to systematizing the work of supplying the front and reducing expenses.\n\nThe next consideration, almost equally important, was to accumulate, and hold in hand, a reserve of ammunition of all kinds, a moderate supply of arms, tools, provisions, and some clothing, which could be sent out on a sudden demand, on the existing lines—or in any new direction in which a force might be required to operate; and for these I had considerable difficulty in getting my requisitions filled.\n\nWhen practicable, I strove to carry out the regulations of the service. But when such a course would have been prejudicial I unhesitatingly assumed the responsibility of deviating from regulations, knowing that it was the wish of the Government and people of Canada, that no reasonable expense should be spared to ensure and increase the comfort of her soldiers in the field.\n\nI feel it my duty to mention the very valuable advice and assistance received from Mr. Wrigley, Commissioner of the Hudson's Bay Company; both personally and by wire Mr. Wrigley was always ready to afford counsel and obtain local information from his efficient staff. His office was usually kept open till after midnight, and the clerical staff of the Hudson's Bay Company emulated their Chief in their desire to attend to our wants.\n\nCaptain Swinford was the very type of a Supply Officer, sparing no trouble in his efforts to meet requirements, and ignoring red tape if it stood in the way of the Service.\n\nI have already mentioned Mr. White, Transport Officer at Swift Current, who, as already reported, was assisted by an exceptionally efficient subordinate staff; and Major Rickard's, Supply Officer at Swift Current and at Moose Jaw, whose services were of great value, and who also had a most hardworking assistant.\n\nThe Deputy Surgeon-General, Dr. Roddick, was frequently absent from Headquarters, as he was much occupied at Saskatoon with the arrangements for housing and moving the wounded; but his heart was in his work, and he hesitated at no personal fatigue in order to give personal attention to the more serious cases.\n\nIn Dr. Roddick's absence the Purveyor-General, Honorable Dr. Sullivan, first at my request, and later by the Surgeon-General's appointment, acted as Principal Medical Officer, which imposed on him an enormous amount of work, as the supplies\nof medical stores were very liberal and the demands from different portions of the force required to be promptly filled, and the various relief committees throughout the Dominion consigned all their contributions to his care, thus materially increasing his work and responsibilities.\n\nAs I found it necessary to obtain assistance, I availed myself of the services of Royal Military College graduates, who loyally came forward at this crisis, resigning lucrative employments in civil life.\n\nLieutenant Leonard, first as Staff Adjutant at Swift Current, and later on as Staff Officer on line of communication at Saskatchewan Landing, was most precise and firm in his discharge of a duty requiring great tact and discretion.\n\nLieutenant Weller, as Staff Adjutant, and Lieutenant F. J. Dixon, attached to Convalescent Depot, who assisted in the Brigade Office, as previously stated, were with me at work long after midnight every night. I found them active, intelligent and indefatigable, and of the greatest assistance in dealing with the press of work.\n\nLieutenant Weller, as already reported, showed great readiness of resource in taking down the Galt barges when the crews struck, and during his absence Captain Hudson, late of 7th Fusiliers, acted as Staff Adjutant and was most untiring in assisting me both by day and night.\n\nThe Regiments being numerically weak, I abstained from taking men from their ranks, for work in the Brigade Office and Supply Department, but utilized the services of convalescents discharged from hospital and waiting opportunity to rejoin their corps.\n\nAs the several Battalions were inspected by you, I do not give any detailed account of inspections held or state of efficiency of corps, but simply forward a record of their movements.\n\nOn my arrival as already reported I found, at Swift Current and Saskatchewan Landing, the half-Battalion 35th, which rejoined the half-Battalion 12th at Fort Qu'Appelle on the 18th April.\n\nSurveyors' Corps arrived on 20th April, and proceeded on 22nd to Elbow and Battleford trail, changing destination on 23rd to chain of posts between Old Wives' Lake and Cypress Hills, and thence on 5th May proceeded to join Headquarter Column.\n\nThe Midland Battalion was also at Swift Current, and four companies, under the late Lieut.-Colonel Williams, M.P., embarked at Saskatchewan Landing on 23rd April in steamer \"Northcote\" for Clarke's Crossing.\n\nTwo companies Midland Battalion, under Major Smith, proceeded to Saskatchewan Landing on 18th April, remaining there on fatigue duty till 8th May, when they embarked in \"Alberta\" and \"Baroness\" for Clark's Crossing.\n\nTwo companies Midland Battalion, under Lieut.-Colonel Deacon, proceeded to Maple Creek on 2nd May, under requisition from the Lieutenant-Governor, in aid of the Mounted Police, and returned on 7th May, proceeding at once to Landing, and thence on 11th May, by Boyd's barges, to Clarke's Crossing.\n\nThe 7th Fusiliers arrived on 24th April, and on 9th May proceeded to Landing, embarking on 11th for Clarke's Crossing, in Boyd's barges.\n\nThe 9th Voltigeurs arrived on 24th April, and on 28th proceeded to Calgary.\n\nThe Halifax Battalion arrived on 30th April, and on 6th May Lieut.-Colonel Bremner, with three companies, proceeded to Medicine Hat, where they remained until July 1st, when the Battalion was concentrated at Moose Jaw.\n\nTwo companies, under Major Walsh, proceeded on 11th May to Landing, taking place of 7th on embarkation, and remaining until June 27th, discharging constant and heavy fatigue duties, when they rejoined the Battalion at Moose Jaw.\n\nThree companies, under Lieutenant-Colonel Macdonald, remained at Swift Current until 23rd May, when they accompanied the District Headquarters on change of base to Moose Jaw, and were continuously employed in heavy fatigue work in addition to guard duty.\n\nThe Winnipeg Light Infantry, under Lieutenant-Colonel Osborne Smith, passed through on 16th April, but did not disembark from train.\nThe 91st Battalion, under Lieutenant-Colonel Scott, reported arrival at Qu'Appelle on 18th, and I instructed the Commanding Officer to request instructions from you as to his further movements, and under your orders moved to Fort Qu'Appelle.\n\nUntil the fatigue duties became so arduous, and even during their continuance, whenever an opportunity offered, the Commanding Officers were instructed to practice their men in attack formation, outpost duty, and moving in extended order over broken ground, and through underbrush when within easy access. I also directed every attention to be given to rifle practice, not merely to develop superior shooting amongst men who were already good shots, but to give most attention to the poorest shots, taking them up closer to the target, and giving them instruction in aiming and position, until they acquired the proper use of the rifle.\n\nAt first the supplies were loaded directly on the transport teams from the railway car, but as they poured in faster, it became necessary to unload the cars and pile up the stores, and fortunately this was the dry season, so there was small risk of damage from the weather, although no tarpaulins had yet been furnished. But the handling of stores necessitated the detailing of strong fatigue parties from the troops at the base, and the strain came more heavily on the small detachment at Saskatchewan Landing, where the constant breakage of the ferry made it necessary to take the ferry boat across the river by hand, with the supplies, as well as the horses and wagons for the north; and the varying height of the river necessitated the removing, more than once, of hundreds of tons of stores, piled in readiness to load the steamers and barges.\n\nThe first detachment on whom this duty devolved found it very arduous, and some dissatisfaction was shown, and Major Henry Smith commanding the detachment showed considerable tact in dealing with it; he at once telegraphed requesting me to come over, and asked me to send him some handcuffs, which latter, with leg-irons, I obtained on loan from the Mounted Police. One man who had been rather unwisely permitted to join the battalion near Lake Superior, to fill up a vacant place, was the instigator of this trouble; he was from the Old Country, and from his knowledge of the ways of the service had evidently served in the army, although he denied having been a soldier; and as he continued insubordinate Major Smith very properly tried him by court-martial and he was sentenced to 42 days' imprisonment with hard labor, at Regina, and to be dismissed the service with ignominy; the latter part of the sentence I cordially approved, as a man of that stamp was quite unfit to associate with the honorable men who filled the ranks of our regiments. I had the detachment paraded, and explained that the duties they were discharging were as honorable and as important as if they were actually in the fighting line, that we could not choose the work we liked, but must as soldiers do whatever fell to our lot and obey our orders; and the detachment more than responded and showed the good spirit that was in them by loading 350 tons supplies on Galt steamers on that and the following day, the 6th and 7th May, as well as cutting wood for use as fuel on the steamers. I felt that this work was so exceptional that I recommended a small allowance of working pay should be issued for this place, but you decided that no distinctions should be made between the different portions of the force.\n\nVery heavy work subsequently fell to the detachment, Halifax Regiment, at same place. The ferry utterly broke down, and this small party worked for several weeks from daylight till dark, non-commissioned officers, as well as men, ferrying discharged teams from the northern side, and contractors transport from the southern bank, as well as putting across over 400 tons supplies, which had to be carried for considerable distance over the dry bed of the river on both sides of the actual stream. Had the contract I recommended been accepted, this would have devolved on the contractor, but I could not obtain from the Transport Officer the terms of the contract actually awarded.\n\nThe men were sadly disappointed that the continuous discharge of this duty should have fallen to their lot instead of being brought face to face with the enemy, but like good soldiers faced their work zealously.\n\nAt Swift Current and at Moose Jaw the detachment, Halifax Regiment, about 100 strong, were also continuously employed on fatigue, and the cheerfulness with\nwhich they worked all day, and one day following another, at really heavy manual labor, reflected the greatest credit on the men themselves and the officers who inspired such a good spirit; and during this time Lieut.-Colonel Macdonald, not wishing his men should lose soldierly smartness, had an all present parade and drill from 5.30 to 7.30 a.m. daily, and the fatigue duties commenced at 8.30 a.m.\n\nThe spirit shown by all ranks of the 7th Fusiliers was most commendable. The Officers, speaking for their men, said they came to do whatever was ordered, and although they would have preferred fighting, I never heard a grumble from any man in the Regiment, although the Colonel, shortly before the breaking up of the Station at Clarke's Crossing, wrote me asking if he could get some relief from work as his men had been so continuously employed they had had no drill for three weeks, and they wanted to keep in practice to appear creditably on their return home.\n\nI forward tabular statements, marked E and F, of the supplies sent forward by the Transport Service, respectively from Swift Current and from Moose Jaw, until these lines of supplies were closed, but I regret they are not uniform.\n\nThe statement given for the Swift Current route being according to a return I originally drew up and required to be furnished daily, and is the only one I have received, although, I furnished blank forms like that on which the Moose Jaw statement is given, requesting they might be filled up; but these have not been returned to me.\n\nThe transport system was not satisfactory; the head teamsters of each subdivision received the same pay as the other drivers, and did not care to exercise any authority or carry out orders if not palatable to his fellows; and although nominally responsible for the safe delivery of the whole load carried on the ten waggons of his subdivision, there really was no method of enforcing the responsibility. And as the drivers were largely hired by the waggon owners at fixed wages, the discharge of the team was no penalty to them, and there really was no means of enforcing discipline; but taken as a body, they were a very well-behaved, willing set of men, anxious to give satisfaction, and crime was almost unknown, and when outfit was short, they put up uncomplainingly with deficiencies.\n\nAs already reported, I found that one waggon of each subdivision was employed to carry the teamsters' outfit and the forage, and this load hardly lasted much over two days. I endeavored to make each team start from the depot carrying three days' forage; but the teamsters made many difficulties and assured me this would involve the unloading of each waggon daily, as bulky forage must be bound with the load, and would not ride on top; and as no Transport Officer appeared to have given consideration to these details, and I was too much occupied to take in hand the interior economy of any one department, I had reluctantly permitted this arrangement to be continued. Moveable forage racks or nets could easily have been supplied from Winnipeg or the Eastern Provinces and attached to the waggons, which would then have carried three days' forage without interference with the load, and thus one-tenth more work could have been done with the same transport train.\n\nAs already mentioned, I obtained from the Department of the Interior the use of some survey carts and ponies, and the Surveyors' Corps composed of men thoroughly acquainted with the country, applied for this class of transport in preference to two-horse waggons. I urged that our Transport Service should use the so-called prairie carts and native ponies, more largely on the lines of communication, as, although possibly not suitable to move with the field column, they would have been much more economical, as they would have required no hay, as they feed on the prairie grass, and use comparatively small quantity of oats, a matter of extreme importance when it is borne in mind that each man of the force only required 3½ lbs. of supplies. But, as already mentioned, each pair of horses required at least 80 lbs. forage daily, and as forage is easily damaged and wasted, and it is hard to check the issue, probably 100 lbs. a day would be the amount used, for each pair of horses; thus, our transport was mainly employed in carrying its own forage.\n\nIn the small contract let by me to Mr. Tins, at Swift Current, for hauling, at a fixed rate per 100 lbs., I permitted him to employ French Half-breeds, and even\nIndians, with their pony outfits, and the work was economically and expeditiously done, and the drivers were more advantageously employed carrying stores for our use, instead of possibly swelling the numbers arrayed against us.\n\nIt would have been more satisfactory if the Transport and Supply, and indeed all Officers in responsible positions, could have been drawn from the Militia Service, and required to provide and appear in uniform; it would have given them greater authority both with the Transport Service, as well as with the Troops, who would then have understood their position. Military training and habits of discipline would have facilitated the working out of a satisfactory organization, and thus have rendered these important branches more efficient; and if the Military College graduates had been employed in this Department, they would have rendered good service, and repaid the country for their education by effecting large savings.\n\nThe absence of uniform was felt among the Surgeons and Staff in the Field Hospitals, in which it was difficult to enforce anything like military order or regularity where the signs of rank and authority were wanting.\n\nI have alluded to these points, because I cannot but feel there were many shortcomings and much left to be desired, and that they furnish some explanation of the enormous expenditure on these services; but the weakness of our organization would have been much more noticeable and detrimental in its effects, but for the goodwill, and I would almost say, self-sacrifice, that was displayed by the officers and employees, who showed themselves animated by the same spirit that prevailed amongst the troops, and never spared themselves when hard work would promote the interests of the service; and it is a great pleasure and source of pride to me, to have been associated with a body of men who so earnestly devoted all their energies to the performance of their duty.\n\nEver since my return home, I have been under treatment for inflammation of the eyes, and was positively forbidden to read or write, and although I have not rigidly attended to the prohibition, I was unable to work continuously, and this has caused the delay in forwarding the report, part of which I found it necessary to dictate.\n\nWith much regret for this unavoidable delay,\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nJ. WIMBURN LAURIE,\nMajor-General Commanding Base and Lines of Communication.\n\nThe Major-General Commanding\nThe North-West Field Force.\n\nMemorandum.\n\nMOOSE JAW, 20th June, 1885.\n\nSir A. T. Galt requested me to furnish you with a report on the services rendered by the \"Galt Coal and Navigation Company's\" steamers and barges. The \"Minnow\" arrived P.M. on 27th April, under Captain Maloney, having left her barges in river; reported she could not carry freight or tow barges up stream, and although could tow them down stream, they could get along quicker without her. I reported her arrival, but not receiving any special orders for her, on 31st I sent her down the river with instructions to board \"Northcote,\" supposed to be aground, and take off Gatling, and Surgeons, and 9-pr. ammunition; but she did not reach Clarke's Crossing until night of 10th, when Captain Maloney reported arrival and asked orders, and was ordered on by me to join General Middleton. But he did not move, but\nremained unemployed at the Crossing until the 15th when Captin Davis ordered him to lay up at Saskatoon and transfer crew to \"Alberta.\"\n\nThis steamer practically rendered no service whatever, but caused great trouble, as I fully relied on her to get the Medical Staff, and the Gatling and ammunition from the \"Northcote,\" a service which she was well qualified to render, as she only draws 11 inches water, and \"Northcote\" draws 33 inches. But she delayed till the \"Northcote\" reached the Crossing, and the Captain was, in my opinion, quite unfit for his position; and I ascribe her uselessness mainly to his incapacity.\n\nThe \"Minnow\" was thus actually under orders of the Militia authorities from the 27th April to 15th May, but did no service beyond towing a barge containing ten tons oats and carrying a few parcels addressed personally, and some mails from Landing to Clarke's Crossing.\n\nThe \"Baroness\" arrived late on 5th May from Medicine Hat, and fatigue party at once commenced to load her, men being promised they should go to the front as soon as steamers were loaded. May 6th, steamer \"Alberta\" with barge, arrived at noon, and at once commenced loading.\n\nMay 7th, two companies Midland Battalion embarked on steamers for passage to Clarke's Crossing, and to assist in wood-cutting and loading.\n\nMay 8th, \"Baroness\" and barge left at 6 a.m., with cargo of 204 tons supplies. \"Alberta\" and barge left at 10.30 a.m., with 150 tons supplies, the latter being detained to enable a party of Artillery under Captain Curran to open some Artillery stores en route for Battleford, and forward them in response to a pressing requisition from General Middleton, received late on evening 7th, at Swift Current.\n\n\"Baroness\" arrived on 14th May, at Clark's Crossing. Captain Davis reported left barge sixty miles below Swift Current as steamer would not handle, but that barge was securely covered.\n\n\"Alberta\" with barge, arrived at Clark's Crossing on 17th, but lost her barge below that point, and unloaded with help of one of Lieutenant Weller's barges.\n\nTwo barges cast off by \"Minnow\" and subsequently brought by crews to Landing, where crews \"struck\" and refused further work, were loaded with 45 tons stores, and started on 1st May with a crew of ten experienced craftsmen, under Lieutenant Weller, Midland Battalion. One of these was carried by the eddy-on-to rock at mouth of Swift Current, where she was partially unloaded and left, pending opportunity for repairs; the other was delivered by Lieutenant Weller at Clark's Crossing.\n\nA barge arrived at Saskatchewan Landing on 5th June, and I recommended she should be employed in carrying stores down river, taking sufficient number of men to repair wrecked barge at mouth of Swift Current, pick-up barge left by \"Baroness,\" and load the two latter with stores landed along river from Boyd & Crowe's barges.\n\nUp to date the recommendation has not been accepted, and I much fear that many of these stores have been injured by exposure to weather or rising of water in river.\n\nI consider that the Steamers \"Baroness\" and \"Alberta\" were capable of rendering valuable service both in carrying, and towing barges; and, although not as well fitted up for passenger traffic as the \"Northcote,\" could render equal service. But local knowledge and river experience are required by the Officers placed in charge; the barges also were very useful and much increased the cargo capacity of steamers, besides admitting of lightening by transfer of cargo when aground.\n\nI believe if the \"Minnow\" had been properly commanded she would also have been very serviceable as a tow and despatch boat, moving sick, &c.; but with a thoroughly incapable Captain she rendered no service whatever.\nB\n\n(Extract from Brigade Orders.)\n\nHEADQUARTERS, Moose Jaw, 9th May, 1885.\n\nBrigade Morning Order: By Major General Laurie, Commanding Lines of Communication.\n\n4. Referring to No. 3, Brigade Orders of yesterday's date, the 7th Fusiliers, on arrival at Saskatchewan Landing, the Headquarters, and these companies, will embark in Mr. Boyd's barges for conveyance to Clarke's Crossing. Two companies, and Major Smith, will remain on duty at the Larding until further orders. The detachment, Midland Battalion, under Lieutenant-Colonel Deacon, will also embark on board the barges for Clarke's Crossing; the Senior Officer assuming charge of the whole force embarked, and the men will be distributed under arrangements with Captain Boyd, but will proceed with the utmost expedition to their destination, and on arrival he will report to the Major-General Commanding.\n\nBy order,\n\n(Signed) WM. HUDSON, Captain,\nStaff Adjutant.\n\n(Extract from Brigade Order Book, by Lieutenant-Colonel Deacon, Commanding Saskatchewan Brigade, en route Saskatchewan River, May 16th, 1885.)\n\n1. Officers commanding barges are requested to send in, for the information of the Officer commanding, immediately on arrival at Clarke's Crossing, a detailed report showing their daily progress as far as can be ascertained, and particularly as to the amount of Government Stores unloaded or abandoned by them, and giving their reasons for such unloading or abandonment. They will, also, endeavor to report as accurately as possible the circumstances attending, together with the number of times that their men were obliged to take to the water to facilitate the progress and insure the safety of their barges.\n\n2. The Officer in charge of the barge in which the rations of the 7th Fusiliers were embarked, will send a separate statement, in writing, explaining the reasons why he left that Battalion for the greater part of the time upon short rations. As these statements will be sent to the General Commanding the North-West Field Forces, it is requested that the same be prepared with the greatest accuracy and promptitude.\n\n3. \"Reveille\" will sound at 4 o'clock to-morrow, Sunday; breakfast at 4.30 a.m., and the advance at 5 a.m.\n\nBy order,\n\n(Signed) EDWARD HARRISON, Captain,\nBrigade Orderly Officer.\n\nCamp, Clarke's Crossing, 19th May, 1885.\n\nSir,—I have the honor to report, with reference to the trip of the double barge, the \"Major Smith\" and \"Capt. Evans,\" as follows: We left Saskatchewan Landing on Monday morning, 11th inst., at about 8 o'clock, and arrived here on Sunday following, at about 6 o'clock, p.m. On the second day after leaving we stranded, and after working vainly for about four hours, I ordered the oats to be carried on shore. Ac-\ncordingly, about 250 sacks were left on the north shore, I should think about 60 or 70 miles from place of embarkation. About 50 miles, as near as I can judge, from here, having become very badly stranded again, and being too far from shore to land the oats, I ordered sacks to be thrown overboard, and about 51 were dumped into the river. We stranded, on the average, two or three times a day. The oars on the barges were very weakly constructed, and after the second day out had to be constantly repaired, and as we had not the proper appliances, great difficulty was experienced in doing so. We had strong head winds for about three days, and the constant battling with wind and wave was all the more unfortunate on account of the defective oars. I consider it would have been almost impossible to have taken the barges through with the heavy cargo on board, and the oats were not removed till every effort had been made to move the barges without doing so.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\n(Signed) S. FRANK PETERS,\nCaptain No. 5 Co. 7th Fusiliers.\n\nTo the Commanding Officer,\nCamp Clarke's Crossing.\n\nREPORT of run down the Saskatchewan River from Saskatchewan Landing to Clark's Crossing, by Capt. T. Tracy, commanding part of \"C\" Company, on board \"Sir John McD.\"\n\nSir,—Left the Landing on Monday, the 11th May, four boats being in company containing \"A\" and \"C\" Companies. During the afternoon all struck a sand bar, and the boats had to be separated before getting off, the men and officers having to jump into the water and work very hard to do so.—The trip from that out was a succession of good runs and bad sticks on sunken sand bars, and our boats being very heavily loaded, it sometimes took us hours to work into deep water again, some of the men suffering rather severely from being forced to work so long in the water. We managed to keep all our load on till about the south end of the \"White Cap\" Indian Reserve, when we stuck very badly, and if Capt. Dillon's boat had not happened to be fast in the same place, so that we could unite our forces in getting the boats off separately, we could not possibly have got away. We labored for over six and one-half hours in the water attempting to move the boat, and at last were forced to leave part of our cargo piled on the beach, and place some more in Capt. Dillon's boat after we got his free. I was sorry to have to do this, but as we were getting short of provisions it could not be avoided. All the men worked very hard throughout, and deserve great praise, as our day's work lasted from 4 a.m. to 8 p.m. But owing to the shifting nature of the channel and the great number of sand bars, we were unable to reach Clark's Crossing till Wednesday, the 20th inst., being in all nearly ten days on the way.\n\nI have the honor to be, Sir,\n\nYour most obedient servant,\n\n(Signed.) THOS. H. TRACY,\nCaptain C Company, 7th Fusiliers.\n\nTo Lieutenant-Colonel Deacon,\nCommanding at Clarke's Crossing.\nClarke's Crossing, N.W.T., 20th May, 1885.\n\nSir,—I have the honor to report that on the 10th inst., I left the \"Saskatchewan Landing in charge of barge 'Captain Leonard,'\" having on board thirty (30) officers, non-commissioned officers and men, as follows: 5 officers, 4 non-commissioned officers, 21 men, being part of Companies 2 and 4, 7th Fusiliers; also their necessaries and a large cargo of oats. At 9 a.m., we got stranded, our men having to take to the water; and after two hours' hard work succeeded in floating her. At 3 p.m., we again grounded and laboured until 6.30 p.m., in the water, without any effect; we then rested for the night and tried it again early the following morning, without any hope of success. About 6 p.m., a small boat arrived from Major Smith, 7th Fusiliers, asking the trouble. I informed him by letter, stating that unless he sent help to take me off I would have to unload on the following morning. I received a message to save the cargo if possible, but if I could not, to unload. After working until 10 a.m., I decided to unload, and in order to save the oats as much as possible I made a base of hay bales and piled the oat bags on top, leaving them high and dry, about 20 miles from the Landing, on the right side. We continued getting stranded from four to six times each day, our men having in most cases to strip and remain from half to two hours each time, until Saturday. On that day, about 10 a.m., I noticed the \"Capt. J.A. McDonald\" stuck fast with all men in the water, although far in advance. I thought it proper to snub up and wait, on account of her being the last boat. She got loose about 2 p.m., and we sailed in company until about 5 p.m., when both got stranded. The men of both boats got out and worked on my boat but could not free her until we unloaded, which we did and cleaned her out. When cleaning her out we found a quantity of oats and water (8 inches) in the hold. It took us until Sunday, 9 a.m., to get her loaded and floating again. During the entire time that we were separated from the flotilla, the reveille was sounded at 3.30 a.m.; and ran till dark, making every effort to counteract our difficulty.\n\nBefore closing this report, I beg leave to draw your attention to the helpless condition my boat was left in. Our rations were so limited that I had to limit my men to three, and afterwards two hard tasks per day, while I understand some of the flotilla had plenty and to spare. And I assure you if it had not been for the timely aid given us by your boat our men might have suffered from hunger.\n\nI beg leave also to state the absence of any medical assistance; a number came from the water attacked with cramps, &c., and we were perfectly helpless. We met with several accidents to the boat, and found no tools for repairs on board, which also caused delay.\n\nI have the honor to remain, Sir,\n\nYour obedient servant,\n\n(Signed) R. Dillon,\nCaptain.\n\nLieutenant-Colonel Deacon,\nCommanding the \"Flotilla.\"\n\nClarke's Crossing, 20th May, 1885.\n\nSir,—I have the honor to report that I was in command of the barge \"General Middleton;\" left the Landing at 9 a.m., on Monday, May 11th; arrived here at 10 a.m., Wednesday, May 20th.\n\nThe third day out, on account of high winds and swift current, we ran into a long creek about 4 miles in length, coming into shallow water, where we found it totally impossible to get out, and after trying every means in our power, digging in the water with spades, &c., men being in the water from 3 p.m., to 9 p.m., and from daylight to 9 a.m., we were under the necessity of dumping out sixty bags of oats.\nThe sixth day we took over from Colonel Deacon's barge twenty five bags. Our men were in the water repeatedly every day and acted splendidly, their conduct being worthy of the highest praise, arriving without further loss of cargo.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\n(Signed) EDWARD McKENZIE,\nCaptain 7th Fusiliers.\n\nLieutenant-Colonel Deacon,\nCommanding the \"Flotilla.\"\n\nLieutenant-Colonel Deacon:\n\nSir,—After leaving Saskatchewan Ferry on the morning of Monday, May 11th, the barge \"Capt. Kelly,\" of which I was in command, ran along for some hours attached to your own barge, but the two running aground we separated from you for the time, and went on our way by ourselves. During the day my men had to get into the water four times to lift the barge off the sand bars on which she had struck, and they were frequently in the water for fifteen minutes or more. Towards evening we again lay alongside your barge, and were together during the night, having tied up for the night on the left bank of river.\n\nTuesday, May 12th.—Reveille went at 4 a.m., and before 6 a.m. we were moved away from our halting-place. Capt. Harrison was on this barge all day, and was untiring in his efforts to push the barge along. But our luck today was very bad, and we were compelled to take to the water eight times during the day. Capt. Harrison and myself also went in when it was necessary. Finally we drew up on the right bank of the river for the night, as it was unable to get our barge on the side you selected for your stopping place. Having got possession of a small boat for the time, I paddled across to your headquarters, getting your orders for the night, and returning, conveyed them to the senior officer of the 7th Battalion, Capt. Peters, who was on my side of the river. We put out a guard of three men, and a corporal, the 7th doing the same. I first examined the ground for some distance round the camp, and placed my sentries in the most advantageous positions I could select.\n\nWednesday, May 13th.—Capt. Harrison left me this morning, taking with him two men, consequently my crew consists of myself and twenty-four non-commissioned officers and men. I am the only officer left on the barge, but have received invaluable assistance from Color-Sergt. Nyles, who has been exceedingly assiduous in the discharge of the duties devolving upon him in the barge. According to orders, I waited till the \"Advance\" was sounded before pushing forward from my camping place; and during the forenoon ran along quite smoothly, but about 3 p.m., we ran down into a bay, and had to draw the barge back up stream against a strong current before we could again get into clear water. It will be noticed that since leaving the ferry I have had no small boat, though the other barges all possess them I believe; and consequently we only find the sand bars and shoals by running aground on them, and thus my men are working at a much greater disadvantage than the crews of the other barges. As darkness approached it became very difficult to find our way. Still, as I had received orders to overtake the leading barge before halting, I endeavored to do so, and consequently had to go into the water after dark with my men to get my barge off a bad shoal. We succeeded in doing so, but a few minutes later we again ran aground, and in spite of every effort persisted in till after 10 o'clock p.m., were compelled to remain all night in the middle of river. I had a watch set, and ordered the rest of the men to turn in for the night, which they did, going supperless to bed, as I had no tea, sugar, &c., on my barge at the time. I mist\nmention particularly Private M. Seevy for the manner in which he performed his work, not only today, but throughout the whole trip thus far. On him has rested principally the navigation of the barge, and he has done his work so well as to gain special mention, and I should like to recommend him for special working pay for the time.\n\nThursday, May 14.—As soon as day broke, I went into the water with some of my men, and we succeeded in getting off the bar, and ran down a couple of miles to where your barge was tied up. Here my men got some breakfast, and I got a supply of tea, &c., and gave you from my cargo 10 boxes of biscuit and 15 boxes of canned meat, and to Mr. Yeomans I gave 4 boxes of biscuit and 11 boxes of meat. I also got a side of bacon for my barge. After starting out we ran along quite smoothly for some time, and though my men were in the water three times during the day, still they did not suffer as they did on former occasions, as the weather was not so inclement. I passed the Elbow about 3 p.m., and stopped shortly after 6 p.m. to allow the barges to catch up, but they did not, and so we remained alone. I posted my sentries as usual, after carefully examining the ground in the vicinity, and my men early retired to rest.\n\nFriday, 15th.—I awaited the arrival of the other barges before pushing off from my camping place, and as Col. Williams, of the 7th, was short of provisions, I gave him from my cargo one box biscuits and two boxes meat. We made but little progress during the day; owing to the heavy head winds which prevailed, and finally drew up for the night on the left bank of the river. Three times during the day my men were in the water, and owing to the cold winds these forced baths were anything but pleasant. Capt. McKenzie, of the 7th, lay near me during the night, and got from me two boxes of meat for his men.\n\nSaturday, 16th.—Got off very early in the morning, and soon overtook and passed the other barges, but they signalled to stop; did so, and on your barge coming up I gave you six boxes of meat. Had a nice day's run, and halted near the other barges for the night. Gave Major Smith a box of biscuit to-night from my cargo.\n\nSunday, May 17th.—Got off with the other barges and ran near them all day, only once during the day had we to take to the water, and we drew beside you according to orders received, and remained for the night.\n\nMonday, May 18th.—Got off at 3 a.m., but soon after starting we ran aground, and it was only after an hour's hard labor that my men succeeded in getting the barge off the bar. During the morning we ran on twice, and had to take to the water twice again; and about 12 noon, for the fourth time, we were in the water. This time we had to draw the barge up stream, against the current and a heavy wind, for nearly 400 yards, before we could get it clear; but after a delay of three hours we again proceeded on our way, and about 7.30 p.m., stopped on the left bank of the river for the night. I managed to select a good camping place, and posted my sentries very advantageously.\n\nTuesday, May 19th.—Got off early this morning, and reached Saskatoon at 12.30, where I drew up for a time beside the other barges, where I remained till an advance was made. Proceeded then down the river until 6 p.m., where I was unable to proceed owing to the wind, and consequently lay up for the night on the left bank, beside two of the 7th barges.\n\nWednesday, May 20th.—Left my camping before 5 a.m., in the face of a strong head wind, which continued blowing for the rest of our journey, and a couple of hours after starting ran on a rock near the right bank of the river. My men had to take to the water again and get the barge off, which we did after much labor. Proceeding we reached Clark's Crossing at 10 a.m. During the whole time we were on the water my men worked well; but I must specially mention Color-Sergeant Myles and Private M. Seevy, of my (G) company. At no time during our trip was my barge supplied with a small boat, as were the other barges, and consequently we had not this means of discovering a suitable channel, and only found the shoals by running upon them. Nearly thirty times had we to take to the water, and it was frequently necessary to employ every man, myself included, to draw the barge off the shoals.\nEvery one of us had to take to the water at times, and remain in longer than an hour in some cases; and taken altogether we had a very fatiguing trip.\n\nDuring my trip I gave the following supplies to officers requiring them:\n\nLieutenant-Colonel Deacon, ten boxes biscuit, twenty-one boxes meat; Lieutenant Yeomans, four boxes biscuit, eleven boxes meat; Lieutenant Colonel Williams, one box biscuit, two boxes meat; Major Smith, one box biscuit; Captain McKenzie, two boxes meat. I threw none of my cargo overboard. On landing I gave to Mr. Hanwell, Transport Officer, the following:—One barrel, twenty-two large boxes and four small boxes biscuit, one hundred and forty-seven boxes meat.\n\nI am, Sir, your obedient servant,\n\n(Signed) FRED. BREMNER, Lieutenant,\nOfficer Commanding Barge \"Captain Kelly.\"\n\nRiver Barge \"Lt. Nelles,\" May 20th, 1885.\n\nSir,—I have the honor, as senior officer on this boat, (having on board Major Gaitshore, Surgeon Fraser, Acting Assistant-Surgeon Campbell, myself and 28 non-commissioned officers and men of No. 4 Company, 7th Fusiliers,) to report, that when we started from Saskatchewan Landing, on the morning of the 11th inst., the barge \"Captain Leonard\" (having on board Captain Dillon, with the remainder of No. 4 Company, and Captain Butler with a section of No. 2 Company) was tied to this barge. We stranded on a sand bar within sight of the Landing and were obliged to separate. The \"Captain Leonard\" got off first, but this barge did not get off until 12.30 p.m., after great exertions, shifting cargo from one side to the other. Men out in the water using levers, &c. This was now the last boat, all the others having been a long time out of sight; it is the smallest barge and was the most heavily loaded in proportion. We were stranded three other times during the day. About dusk we sighted the \"Captain Leonard,\" stranded in an exceedingly bad place. We put into shore as soon as possible—about three miles further down to see if they could get out—but did not succeed in communicating with them. Not thinking it wise to leave the last boat behind, especially as I knew that they were short of provisions (as we were ourselves, nor had we any tools, lumber or nails for repairs) we waited for them next morning until 11.30, when they came up, having found it necessary to discharge part of their load. We again tied together, but were obliged to separate the first time we struck a sand bar, the \"Captain Leonard\" getting away first, ours was again the last boat. We got off this sand bar with great difficulty, but stranded again several other times the same day. I now estimated that we were a day's run behind the main body. On approaching what appeared to be a very bad spot, I pulled into shore and sent the small boat forward to examine it, and found it would be impossible to take the barge through with its load. So after consulting the officers on board, decided to put some of the cargo on shore in preference to throwing it overboard when stuck in the sand. We therefore piled 138 bags of oats on the left bank, say 35 miles from the Landing. After starting again we got badly stuck in the sand and got off with the greatest difficulty, even with the lightened barge, nearly all hands having to get into the water. We had the same experience every day since, the men having to get out several times a day, but we got on faster and my anxiety was relieved by having come up with the main body; we had no one on board who had any experience in river navigation. Major Gaitshore proved to be the\nnavigator, and he was invaluable, assisted by Sergeant Jacobs, whose services are worthy of special mention.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\n(Signed) A. M. SMITH,\nMajor 7th Fusiliers.\n\nTo Lieutenant-Colonel Deacon,\nCommanding at Clarke's Crossing.\n\nCLARKE'S CROSSING, 19th May, 1885.\n\nSir,—I beg to report that on the morning of the second day out I took command of barge \"Boyd & Crowe.\" That on the third, late in the afternoon, after having all the men in the water for from five to six hours; I was compelled to throw from 40 to 50 bags of oats in the river, in order to float the barge. That thereafter we found the barge floated all right, although it was repeatedly necessary for the men to get out and work the boat off sand-bars. Arrived at Clarke's Crossing about 4 p.m. Sunday; without further loss of cargo.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\n(Signed) GEORGE M. REID,\nLieutenant and Adjutant, 7th Fusiliers.\n\nTo Lieutenant-Colonel Deacon, Clarke's Crossing.\n\nCAMP, CLARKE'S CROSSING, 20th May, 1885.\n\nSir,—I have the honor to report that I was in charge of the barge \"Gen'l Laurie,\" which left Saskatchewan Landing at about 8 a.m., on the 11th instant, and arrived here at 1 p.m., on the 18th, having on board sections 1, 3 and 4 of No. 2 Company, 7th Fusiliers, making a total, including myself, of 32 souls. We experienced considerable difficulty in navigating the river, and each day frequently ran aground on shoals, the men at such times having to undress and jump into the river in order to push the barge into the proper channel, which the men invariably did willingly and with great energy. We succeeded in bringing in our full cargo, with the exception of two bags of oats which burst in several places, owing to the inferior quality of the canvas. From the same cause a small quantity of oats were spilled, and are now lying in a loose state amongst the bags. Our oars were broken several times; and, having no tools on board with which to repair them, we were put to great inconvenience and delay, and were finally obliged to put ashore and construct new ones as best we could, lashing the several timbers together with ropes. Had it not been for these mishaps we should have arrived much earlier.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\n(Signed) N. R. GREIG,\nLieutenant No. 2 Company, 7th Fusiliers.\n\nTo the Commanding Officer,\nCamp Clarke's Crossing.\nClarke's Crossing, 20th May, 1885.\n\nSir,—In accordance with orders, we left Saskatchewan Crossing at 8 a.m., Monday, the 11th instant, on the barge \"Hard Tack,\" the crew being made up of two officers and 29 non-commissioned officers and men, and the cargo consisting of oats and regimental baggage. During the day the barge was stuck four different times, and three times the men had to go into the water and push the barge off. The halt having been sounded, we tied up for the night—about 7.30 p.m. Next morning a start was made at 6 a.m., and we were very fortunate up to about 3 p.m., when the barge ran aground, and after the men had spent three hours in the water trying every possible way to move the barge, I ordered them to remove enough of the cargo to float the boat. There were about 75 bags taken off, all of which were piled on the shore. We caught the remainder of the boats at 9 p.m., and I at once reported, and, as you ordered, took on 100 bags from the stranded barge to replace portion of cargo left behind. The morning of the 13th inst., we started at 10 a.m., and had a clean run for the day, tying up at 5 p.m., as per orders. On the 16th inst. we started at 8 a.m., and at 5 p.m. ran aground; but as the strong wind, then blowing, made it impossible to get off, we remained where we were for the night. Friday morning we started at 4 a.m., and at 10 a.m. halted, awaiting the arrival of other barges. Left again at 1 p.m., and had another clean run, tying up at 5 p.m. Saturday morning we started at 5 a.m., and at 10 ran aground, causing a delay of almost two hours, the men being in the water all the time. After this we had a good run for the remainder of the day, and tied at 5.30 p.m. Sunday we started at 5 a.m., and halted at 12.15, as we had received orders to that effect. The trip was not continued that day. Monday morning we started at 5 a.m.; but at 7 a.m., again at 8 a.m., we struck, and the men were in the water about three hours. We got a long lead on the other boats by 12 o'clock. So to allow the others to come up we tied up for three hours, starting again about 3 p.m., and after two hours' run tied up six miles from Saskatoon for the night. On the 19th inst. we started at 5 a.m., and on arriving at Saskatoon we tied up, and there waited for the arrival of barges, and these having come in, the journey was continued at 2 p.m.; and after a seven hours' run we arrived at Clarke's Crossing at 9 p.m., having been 9 days making the distance. Too much cannot be said in praise of the men who, during the whole trip, were ready for anything. Some days the water would be very cold, but there was not a complaint from one. The trip was most laborious, the barge sticking many times on sand and clay ridges. The day we were forced to remove a part of our cargo we had run in a pocket formed by three sand bars on the three sides of a square, and on these bars not a foot of water could be found. Other barges in the same place, had to unload almost all their cargo. After lighting up the barge somewhat we had to tow it up the river about 500 yards; and as we were about 8.0 yards from the shore then, it was not possible to take the bags on again. The barge was not itself properly equipped, as we were not given any nails and no tools, and had anything gone wrong it would have been impossible to have repaired it; in fact we broke a sweep one day, and as a result had to run the barge on a sand bank, and take nails out of boxes to fix it so as to overtake the other boats. Cold tea was supplied to the men in quantity, by the cooks, as you ordered, so as to prevent the use, as far as possible, of the water.\n\nI have the honor to be, Sir,\n\nYour obedient servant;\n\n(Signed) HORACE A. YEOMANS, Lieut.\n\nTo Lieutenant-Colonel Deacon, in command, Clarke's Crossing.\nCamp, Clarke's Crossing, May 20th, 1885.\n\nSir,—I have the honor to report that I was on board the barge \"Captain Kerr\" which left the Landing about 9.15 a.m., 11th May, being attached to three others; after a few hours, however, we were disconnected to release us from a sand bank, and continued the trip alone. On the second day out Captain Kerr and Mr. Boyd came on board, the clerk and cook being already there; this made a total of 35 souls on board. We had considerable trouble in navigating the river, men having to strip and jump into the water many times in order to get back into the proper channel, in many cases which looked hopeless. After working hard for hours we invariably succeeded, the men working cheerfully and with energy; we had trouble also from the oats breaking often at critical times. We succeeded in bringing in our cargo entire with the exception of one bale of hay which slipped overboard as Captain Kerr was endeavoring to move it to another part of the boat. We should have arrived sooner at our destination if we had not waited for stragglers.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\n(Signed) HARRY BAPTY,\nLieutenant 7th Fusiliers.\n\nTo Lieutenant-Colonel Deacon,\nCommanding Saskatchewan River Brigade.\n\nC.\n\nMoose Jaw, N.W.T., 25th May, 1885.\n\nSir,—I have the honor herewith to forward copy of contract (marked A) made with Mr. John Stewart, which was concluded after considerable notice given both locally and otherwise.\n\nI enclose copy of the memorandum of conditions, which I considered should be fulfilled in the contract, marked \"B.\" I enclose also a memorandum, marked \"C,\" showing advantages which I believe are obtained by this contract over the system formerly followed.\n\nI have every reason to believe that this contract will insure a considerable saving in the cost of transport, but it was necessary to act promptly, as you instructed me that the base was to be changed to Moose Jaw; but the proviso that the contract may be closed any time, on ten days' notice being given, enables you to adopt any other system that, after full consideration, you may prefer.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\n(Signed) J. WIMBURN LAURIE,\nMajor-General Commanding Base and Lines of Communication.\n\nThe Major-General,\nCommanding North-West Field Force.\nI, John Stewart, agree to a contract on the terms and conditions hereinafter mentioned:\n\n(1) To convey any class of supplies from Moose Jaw to the Elbow of the Saskatchewan, for the sum of forty-five dollars ($45.00) per ton;\n\n(2) Or from Moose Jaw to Clark's Crossing, for the sum of one hundred and ten dollars ($110.00) per ton;\n\n(3) Or from Qu'Appelle to Clark's Crossing, for the sum of one hundred and fifty dollars ($150.00) per ton;\n\n(4) Any teams required to be furnished for other than contract work to be at the rate of five dollars ($5.00) per day, forage and rations to be found by Government;\n\n(5) Government to hand over to the Contractor, on his giving sufficient notice if practicable, a sufficient quantity of supplies for teams and men at cost;\n\n(6) Government to make good any losses sustained by Contractor through acts of enemy, provided proper precautions were taken by the Contractor;\n\n(7) Government to furnish camp equipage as heretofore;\n\n(8) The Government of Canada agrees to pay John Stewart, the Contractor, money due under this contract as carried out through the Hudson's Bay Company at present;\n\n(9) Contractor agrees to carry, free of cost, either to Government or other parties, on return trips, sick or wounded men, wood sufficient for cooking purposes for transport men, luggage or light articles; the teams not thereby to be unnecessarily delayed for that purpose;\n\n(10) Contractor to use all due diligence in forwarding supplies, and to make not less than twenty miles per day on the average;\n\n(11) Contractor further binds himself to furnish good and sufficient bonds for the due fulfilment of this contract;\n\n(12) In the event of the Contractor failing to provide teams sufficient to convey the quantity desired by the Transport Officer, the Government shall have the power and authority under this Contract to engage any number of teams necessary for conveying the supplies in excess of the Contractor's teams, but due notice shall be given the Contractor of such intention;\n\n(13) This contract shall hold good until terminated by the Government, giving ten (10) days' notice;\n\n(14) Should any teams be delayed from work by lack of supplies the Government to compensate the Contractor at the rate of four dollars ($4.00) for each day's detention, per team.\n\n(Signed) JOHN STEWART,\nMoose Jaw route contract accepted.\n\n(Signed) J. WIMBURN LAURIE,\nMajor-General Commanding Base and Lines of Com.\n\nWitness:\n(Signed) F. JOSEPH DIXON,\nLieut. C. M.\n\nMoose Jaw, May 19, 1885.\nB.\n\nThe Major-General Commanding \"the Base and Lines of Communication,\" is prepared to receive tenders for the following service, viz.: The conveyance of any class of supplies from Moose Jaw to the Elbow, and from Moose Jaw to Clarke's Crossing, and from Qu'Appelle to Clark's Crossing, on the following conditions:\n\n1. Price per ton to be stated for hauling any class of supplies from Moose Jaw to the Elbow;\n2. Or at option of military authorities, from Moose Jaw to Clark's Crossing;\n3. From Qu'Appelle to Clark's Crossing;\n4. In each case to be delivered along side river for shipment;\n5. Returning waggons to bring back free, sick or wounded men, light baggage, wood sufficient for cooking for transport men, or any light articles;\n6. Probable quantity when in full blast about 30,000 lbs. per day;\n7. Notice will be given from day to day of increase or decrease, but in case of material alteration as long notice as possible will be given;\n8. Teams liable to be called off and be available for general transport service at rate per day, in such cases forage and rations to be provided by Government;\n9. Contractor to be responsible for safe delivery, except in case of capture or destruction by enemy in superior numbers;\n10. Contract liable to be terminated on delivery of goods actually loaded;\n11. Goods to be moved not less than twenty (20) miles per day on an average;\n12. If desired; forage and rations may be obtained at actual cost (including charges) on sufficient notice being given if forage is available.\n\nFurther information may be obtained on application.\n\nMoose Jaw, May 19, '85.\n\nC.\n\nMemorandum.\n\nFinding the transport under the system of hiring by day too expensive, I proposed to move goods by contract, and discussed the matter with several local people; and when at Swift Current contracted and moved goods at rate of $25 per ton, which were by day's work costing $36.44. And when it was proposed to move base to Moose Jaw, I made enquiries and ascertained that parties would be willing to tender for contract to transport by ton either to Elbow or Clark's Crossing. So I wired Mr. Wrigley to know if this arrangement were permissible, and he advised we should meet and discuss the transport question. I then considered the conditions I had laid down as giving ample latitude for the work, and I further explained my views to Major Bell and Captain Swinford at Qu'Appelle, in order to hear and consider objections. I also discussed the matter at length with Colonel Whitehead, who had told me he had been appointed by the Minister of Militia \"Chief Supply and Transport Officer,\" and he considered the step I was taking most desirable, and that it was quite what the Minister desired; and meeting Major Bell on the return journey, he recommended Mr. Stewart to me as a suitable man to take the contract. I accordingly remained a day at Moose Jaw and called for tenders, prescribing the conditions, and finally accepted Mr. Stewart's tender, a copy of the agreement being enclosed.\n\nBy this arrangement the river can be utilized from the Elbow when the water is high, and goods conveyed for steamer can be forwarded by land if river falls. Taking similar mileage in the Battleford route, the contract price is not half the amount paid under the old arrangement. Teams draw a much larger quantity under the personal supervision of Contractor than under paid Superintendents. Forage and supplies for journey are furnished by Contractor, who allows no waste.\n\nThe Staff can be much reduced, as the clerks at the several depot stations along the road will not be required.\nAll responsibility is devolved on the Contractor, who delivers his full load and is responsible for any deficiency.\n\nThe use of the empty teams on the return journey is obtained to move the sick or wounded or light baggage of men coming from the front.\n\nThe teams are at all times available and can be taken off the contract to move with troops or in any work that the Commanding Officer may consider of paramount importance.\n\nThe contract can be at any time terminated by giving the contractor ten (10) days' notice, which practically means that he ceases to load goods as soon as notice is given, merely continuing till he has delivered those actually on road.\n\nJ. WIMBURN LAURIE,\nMajor-General,\nCommanding Base and Lines of Communication.\n\nD.\n\nFrom Lieutenant R. W. Leonard to Major-General Laurie:\n\nWINNIPEG, 13th July, 1885.\n\nSir,—I have the honor to report that, in accordance with your orders, I proceeded to Saskatoon to adjust the claims of settlers against the hospital, and arrived there on June 19th. I found it impossible to make out the claims fully until the wounded were all removed and the hospital closed—hence the delay. The claims of the settlers were all fairly reasonable, and there was no difficulty in making a satisfactory settlement. The hospital was closed on July 3rd. In accordance with orders from Deputy Surgeon-General Roddick, I disposed of all stores remaining as part payment of claims. After disposing of the surplus stores, we found that the claims for supplies advanced and work done in service of the hospital, aggregated about four thousand dollars ($4,000).\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nR. W. LEONARD.\nE.\n\nTRANSPORT SERVICE N.W. F. F.—BATTLEFORD COLUMN.\n\nSHIPPING Account of Supplies, &c., From Swift Current.\n\n| Date | Teams | Oats | Supplies | Sundries | Total |\n|------|-------|------|----------|----------|-------|\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n|      |       |      |          |          |       |\n\nContractors teams and carts took supplies.\n\nABSTRACT OF ABOVE.\n\nForage—1,783 sacks oats, 178,300 lbs.\n8,262 bags do 704,270 do = 442 tons.\nchop, 2,000 do\n2,879 bales hay, 287,900 do = 144 do\n\nAdd 10 p.c. teamsters forage, not in above, 88 do\n\n674 do or 2,210 lbs. per team.\n\nForage ........................................... 610 teams.\nSundries ........................................ 118 do\nSupplies ......................................... 188 do\ndo by contractors .................................. 4 do\n\n920 do\n51 carts.\n### N.W.F.F.—BATTLEFORD COLUMN—TRANSPORT SERVICE.\n\n#### SHIPPING of Supplies, &c., from Swift Current.\n\n| Date | Teams | Oats | Supplies | Sundries | Total |\n|------|-------|------|----------|----------|-------|\n|      |       |      |          |          |       |\n| 1885 |       |      |          |          |       |\n| May  | 7     | 3    | 96       | 20       | 28    | 8     | 11   | 2   | Capt Weller's outfit... | 20 |\n| do   | 87    | 6    | 20       | 250      | 1,439 | 264   | 8    | 24  | Lumber for scows, &c... | 188 |\n| do   | 3     | 9    | 4        |          | 240   | 16    | 16   | 1   | Rope, grease, &c...     | 40 |\n| do   | 23    | 1    | 8        | 65       | 3,186 | 43    | 22   | 27  |                             | 165 |\n| do   | 132   | 1    |          |          |       |       |      |     |                             | 8  |\n| do   | 7     | 43   | 7        |          | 1,067 | 254   | 2    | 2   | Ammunition, &c...        | 65 |\n| do   | 8     | 140  |          |          | 1,806 | 1,125 | 204  | 20  | Baggage 7th...           | 140 |\n| do   | 9     | 41   |          |          | 1,018 | 6     |      |     |                             | 61 |\n| do   | 10    | 46   | 5        |          | 920   |       |      |     |                             | 71 |\n| do   | 11    | 48   | 14       | 19       | 705   | 306   | 218  | 22  | Halifax Battalion and Q.O.R. luxuries... | 82 |\n| do   | 12    | 104  |          |          | 1,830 | 52    | 42   | 42  | Stoves, &c., &c...       | 147 |\n| do   | 13    | 41   |          |          | 380   | *447* |      |     |                             | 41 |\n| do   | 14    | 60   |          |          | 460   | 926   | 40   | 40  | Forges, &c...            | 102 |\n| do   | 15    | 51   |          |          | 884   | 18    | 18   | 18  |                             | 69 |\n| do   | 16    | 20   |          |          | 209   | 175   | 5    | 5   |                             | 25 |\n| do   | 17    | 76   |          |          | 536   | 783   |      |     |                             | 76 |\n| do   | 18    | 9    |          |          | 1234  |       | 8    | 8   | Coal                      | 19 |\n|      | 937   | 40   | 47       | 8,241    | 10,232| 1,982 | 2114 | 252 | 138                        | 1,324 |\n\n* And 14 tons chop. † Bags chop.\n\n#### ABSTRACT OF ABOVE.\n\nForage—8,241 sacks oats ........................................... 412 tons.\n10,232 bags do ...................................................... 439 do\n314 do chop.......................................................... 15 do\n1,982 bales hay..................................................... 99 do\n\nAdd 10 per cent. for teamsters' forage; not in above........ 128 do\n\n1,091 do or 2,370 lbs. per team.\n\nForage ........................................................................ 937 teams.\nSundries ....................................................................... 138 do\nSupplies ......................................................................... 211½ do\nContractors .................................................................... 40 do and 47 carts.\n\n1,324½ do\n\n47 carts.\nNORTH-WEST FIELD FORCE—BATTLEFORD COLUMN.\n\nTRANSPORT SERVICE.\n\nABSTRACT of Supplies, Forage, &c., forwarded North from Swift Current.\n\nSupplies.\n\n| Month | Date   | Teams | Carts | Beef, Biscuits, &c. |\n|-------|--------|-------|-------|---------------------|\n| April | 12-30 | 192   | 51    | 218 tons            |\n| May   | 1-18  | 242   | 38    | 252 do              |\n\nTotal: 434 teams and 89 carts, 470 tons beef, biscuits, &c.\n\nForage.\n\n| Month | Date   | Teams | Tons |\n|-------|--------|-------|------|\n| April | 12-30 | 610   | 674  |\n| May   | 1-18  | 937   | 1,091|\n\nTotal: 1,547 teams, 1,765 tons, oats, hay and chop.\n\nTotal: 2,335 do being an allowed average of 2,100 lbs. per load.\n\nSundries.\n\n| Month | Date   | Teams | Lumber, Baggage, Ammunition, &c., &c. |\n|-------|--------|-------|-------------------------------------|\n| April | 12-30 | 118   |                                     |\n| May   | 1-18  | 136   |                                     |\n\nTotal teams left Swift Current—April, 920 teams and 51 carts.\n\nMay, 1,324 do 47 do\n\nTotal: 2,244 do 98 do\n\n(True copy)\n\nJ. WIMBURN LAURIE,\nMajor-General,\nCommanding Base and Lines of Communication.\n### F.\n\n**NORTH-WEST FIELD FORCE.**\n\n**Supplies taken North from Moose Jaw, by teams hired by day.**\n\n| Date   | Teams Started | Oats | Sundries | Gross Tonnage |\n|--------|---------------|------|----------|---------------|\n|        |               | No.  | Lbs.     | Lbs.          |\n| May 24 |               | 3    | 5,000    | 2,500         | 7,500         |\n| June 15|               | 4    | 10,000   |              | 10,000        |\n| do 17  |               | 1    | 2,000    |              | 2,000         |\n| do 18  |               | 3    | 7,500    |              | 7,500         |\n| do 19  |               | 1    | 2,500    |              | 2,500         |\n| do 20  |               | 2    | 5,000    |              | 5,000         |\n| do 24  |               | 1    | 2,500    |              | 2,500         |\n| **Total** |             | **15** | **5,000** | **32,500** | **37,500** |\n\n### NORTH-WEST FIELD FORCE.\n\n**Supplies taken North from Moose Jaw by Contract—J. Stewart, Contractor.**\n\n| Date   | Teams Started | Pony Carts | Hay | Oats | Provisions | Sundries | Gross Tonnage |\n|--------|---------------|------------|-----|------|------------|----------|---------------|\n|        |               | No.        | No. | Lbs. | Lbs.       | Lbs.     | Lbs.          |\n| May 24 |               | 35         | 20  | 22,440 | 71,354 | 17,600 | 111,394       |\n| do 25  |               | 47         |     | 36,720 | 13,801 | 67,500 | 118,021       |\n| do 26  |               | 22         |     | 12,886 | 46,375 |        | 59,261       |\n| do 27  |               | 26         | 1   | 6,500  | 62,250 |        | 68,750       |\n| do 28  |               | 28         |     | 28,500 | 39,600 |        | 68,000       |\n| do 29  |               | 16         |     | 8,300  | 35,250 |        | 43,550       |\n| do 31  |               | 12         | 8   | 7,000  | 22,625 | 6,800  | 36,425       |\n| June 1 |               | 13         |     | 3,400  | 29,400 |        | 36,300       |\n| do 2   |               | 73         |     | 33,800 | 105,840| 49,230 | 182,170      |\n| do 3   |               | 4          |     | 600    | 1,800  | 7,600  | 9,900        |\n| do 4   |               | 22         |     |        | 20,160 | 38,155 | 59,315       |\n| do 7   |               | 40         |     | 13,200 | 91,290 |        | 104,490      |\n| do 8   |               | 32         |     | 1,800  | 39,360 | 48,355 | 86,215       |\n| do 9   |               | 29         |     | 6,000  | 74,970 | 5,460  | 86,430       |\n| do 11  |               | 18         | 1   | 54,840 |        |        | 54,840       |\n| do 13  |               | 2          |     |        |        | 3,885  | 3,885        |\n| **Total** |             | **419** | **20** | **121,566** | **682,820** | **233,440** | **90,000** | **1,127,826** |\n\n**J. WIMBURN LAURIE,**\n\n*Major-General,*\n\n*Commanding Base and Lines of Com.*", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001479.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 40, "total-input-tokens": 59592, "total-output-tokens": 32702, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 254, 2], [254, 254, 3], [254, 3197, 4], [3197, 7682, 5], [7682, 12070, 6], [12070, 16538, 7], [16538, 21163, 8], [21163, 25593, 9], [25593, 30084, 10], [30084, 34669, 11], [34669, 39249, 12], [39249, 43810, 13], [43810, 48299, 14], [48299, 52823, 15], [52823, 57453, 16], [57453, 61957, 17], [61957, 66542, 18], [66542, 70904, 19], [70904, 74884, 20], [74884, 79454, 21], [79454, 83961, 22], [83961, 87322, 23], [87322, 91050, 24], [91050, 93779, 25], [93779, 96758, 26], [96758, 100372, 27], [100372, 104011, 28], [104011, 108329, 29], [108329, 111880, 30], [111880, 114313, 31], [114313, 118120, 32], [118120, 120436, 33], [120436, 122947, 34], [122947, 126541, 35], [126541, 128210, 36], [128210, 130144, 37], [130144, 133301, 38], [133301, 134468, 39], [134468, 137353, 40]], "primary_language": ["None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, true], "is_diagram": [true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]