[{"id": "e103dd1a47a6598c58080c8021b0ab6af0515105", "text": "LOUIS RIEL\n\nAND THE\n\nNORTH-WEST REBELLION\nLOUIS RIEL\n\nAND THE\n\nNORTH-WEST REBELLION\n\nA REVIEW\n\nCOMPILED FROM\n\nPUBLIC RECORDS AND OTHER AUTHENTIC DOCUMENTS.\n\nQUESTION AND ANSWER.\nLOUIS RIEL\n\nAND THE\n\nNORTH-WEST REBELLION\n\nA REVIEW\n\nCOMPILED FROM\n\nPUBLIC RECORDS AND OTHER AUTHENTIC DOCUMENTS.\n\nQUESTION AND ANSWER.\nTHE NORTH-WEST REBELLION.\n\nCOMPILED FROM AUTHENTIC RECORDS.\n\nRIEL IN 1870\n\nWhen did the Riel question begin?\nIn 1869-70, in Manitoba, by his rebellion against the Dominion authorities.\n\nWas there bloodshed then?\nYes; Thomas Scott, a patriot, was cruelly shot, by Riel's order, after a sham trial by Court Martial.\n\nWhat was thought of that crime in Ontario?\nThe people here were greatly indignant. The Local Legislature offered $5,000 reward for his arrest for the crime.\n\nWho moved the resolution?\n\nTHE HON. EDWARD BLAKE.\n\nIt was as follows:\n\n\"That the cold-blooded murder (for his outspoken loyalty to the Queen) of Thomas Scott, lately a resident of this Province, and an emigrant thence to the North-west, has impressed this House with a deep feeling of sorrow and indignation, and in the opinion of this House every effort should be made to bring to trial the perpetrators of this great crime, who as yet go unwhipt of justice.\"\n\nDid Mr. Blake make a speech in moving that motion? If so, what did he say?\nYes. He complained that Riel,\n\n\"THIS MURDERER,\"\n\nas he called him, was living in the States, and said that his extradition should be demanded. \"But,\" Mr. Blake went on to say (Feb. 3, 1871):\n\n\"It is a son of ours that he has murdered. It is our justice that he has violated; it is our duty to see, as necessary, that this justice is vindicated. This person Riel is living a little way outside the boundaries of the North-west, in the United States. He is receiving deputations from the people of that country, asking him to stand as a candidate for the Great Legislature and for the Parliament of Canada. We find him declaiming for the good of the country and from patriotic motives to allow himself to be nominated. But, sir, I say that unless this Province speaks out it will not be long that he will act thus, and we may yet undergo the humiliation and disgrace of seeing\n\nTHE MURDERER OF ONE OF OUR PEOPLE\n\nelected to the Parliament of Canada, and representatives from Ontario sitting in council on the affairs of the country with one guilty of murder. I warn this House and this Province that unless we act in this matter the murderers will go unpunished.\"\n\nA MURDERER-REPRESENTATIVE\n\nWas Louis Riel afterwards elected to Parliament?\nYes; he was elected for Provencher in 1874.\nDid he take his seat in the House?\nNo; but he went to Ottawa for that object, and remained in the city and vicinity for seventeen days. During that time he visited the Clerk's room, attended by Mr. Fiset, Grit-Rouge member for Rimouski, and signed the roll as a member of the House of Parliament.\n\nWhat party was in power at that time?\nThe Mackenzie-Blake Government.\n\nHow long had they been in power?\nFor nearly one year, Sir John Macdonald having resigned office in November, 1873.\n\nWere any steps taken regarding Riel, and by whom?\nA motion was made for Riel's expulsion by Mr. Mackenzie Bowell, which was carried by a vote of 124 to 68.\n\nWas any one tried and convicted of the murder of Thos. Scott?\nYes; Lepine was sentenced to death by the Manitoba Court, Chief Justice Wood presiding.\n\nWas Lepine executed?\nNo.\n\nWhy was not Lepine executed for the murder of Thomas Scott?\nThe Mackenzie Government commuted the death penalty to two years imprisonment. This reprieve was kept secret for some time pending the Ontario elections. After the Ontario elections it was announced, just as the Quebec election was brought on, for the supposed purpose of influencing that election.\n\nDid Parliament take any further action regarding Riel?\n\nRIEL'S BANISHMENT.\n\nYes. A resolution was carried granting him amnesty conditional upon his banishment for five years.\n\nWhere did Riel then take up his residence?\nIn Montana, where he remained from 1874 until 1884.\n\nRIEL IN 1884.\n\nWhy did he come to the North-west in 1884? Was he honestly invited by the Half-breeds to assist them to get certain claims settled?\n\nHOW RIEL INVITED HIMSELF TO CANADA.\n\nNo. He took the initiative himself. Mr. Maclise, defending Parenteau and 25 other half-breeds, in addressing the court at Regina, said:\n\n\"Now with regard to Riel's coming amongst them, it has been alleged against these people that they sent for him. It could be proved in evidence that Louis Riel met Neault here in Manitoba in 1883, that he arranged with him, that he and Gabriel Dumont should go about and incite the people to send for him. A subscription list was hurriedly gotten up, a few meetings were held before any...\"\nbody in the country knew he was being sent for. He had been sent for. Now, with regard to the object of the people in bringing him here, and as stated by himself afterwards, the ostensible meaning of the message was to persuade Riel to come and advise them and to assist them to obtain in a constitutional manner their rights. Now, from the first of the meetings held by Mr. Riel, his position towards them, coming into a peaceful country, was a repetition of the sentiment of peace—peace—peace—peace, and the other sentiment of union among the Half-breeds. He also referred to his own claims against the government, indefinitely at first. That was about the middle or first of July. During the month of August he held some conversations with the Reverend Fathers of that district, and he stated to them that his object in coming to the country was either money or revenge.\n\nTo whom in particular of the Reverend Fathers did he make these communications?\n\nFATHER ANDRE ALARMED.\n\nTo Father Andre. The Father had heard that Riel had been passing tobacco among the Indians—the Crees and Sioux—to get them on his side. He sent for Riel and asked him what he wanted. He (Father Andre) told him that he should leave the country, that he was a firebrand among the people. Riel stated to Father Andre that he was willing to leave the country for $2,000. Father Andre said to him, \"But you have stirred up the people, and how will they be after you leave?\" It is in evidence that he stated that he himself was the Half-Breed Question.\n\nWhat was the argument used by Riel to gain over the Half-breeds?\n\nTHE HALF-BREED \"CLAIMS.\"\n\nHe made them believe that compound interest to which they should be entitled, as he argued it, on the amount they should have received in 1870, would make them independently rich; and also his own claim would make him independently rich. He also told them he had been persecuted by the police.\n\nWhat other plan did he follow?\n\nHe started a religious movement, proclaiming himself a prophet. This was a part of the general design to win the Half-breeds, who are credulous, superstitious, and always ready to follow and trust the educated amongst them.\n\nHe prayed for the people in the open air, extending his hands and arms in the form of a cross, and shouting for assistance from the All Wise. He spoke of visions he had had, and conversations with the Holy Ghost. In this way he\n\nDELUDED THE PEOPLE.\n\nAre people to be so easily deluded?\nO, yes! In Utah there are thousands of people who were brought from Christian countries to follow Joe Smith, a pretended prophet. And in England, Johanna Southcote, a pretended prophetess, had thousands of followers and worshippers. In the same way the credulity and superstition of the Half-breeds were worked upon by the superior cunning and trickery of Louis Riel. In fact, the people have been so often led astray by \"false prophets\" that it might be said that history teems with illustrations of the ease with which they can be duped and played upon, particularly with reference to matters concerning their interests or on matters appertaining to religion. Says Father Fourmond, \"Louis 'David' Riel fascinated our poor Half-breeds as the snake is said to fascinate its victim, for his own ends.\"\n\nRIEL THE SOLE CAUSE OF REBELLION.\n\nWhat evidence is there that Riel was the sole cause of the rebellion, and personally inspired it?\n\nThe solemn declaration of Father Andre, who said from his own personal knowledge that, excepting Gabriel Dumont, Napoleon Neault and Damase Carriere, not one of the other Half-breeds had the least idea or suspicion that there was any danger of rebellion until they were so completely involved in the toils of Riel, and he led them on until they were so compromised, there was no escape for them. He promised them peace and plenty if they would follow him; and he told them they had no mercy to expect from the soldiers, the police or the Government. He told them that if taken prisoners they would be put to torture and die a horrible death, and their wives and daughters outraged. And he told them that death awaited any one who deserted from himself. Father Andre gives many instances of how the Half-breeds, before happy and well-to-do, were forced to join Riel:\n\n1) Emmanuel Champagne, a respected man, was worth $25,000. He had lived at Batoche. He at first refused to join. Persuasion of all kinds failed, when threats were used instead of sweet words. \"Unless you become a member of the Council your whole property will be pillaged, your life will not be safe,\" said Riel.\n\n2) Maxime Lepine was positively opposed to violence of any kind, and it was only by compulsion that he was kept among the Riel people.\n\n3) Pierre Gariepie, aged 55, was a plain hunter; Riel made him believe there would be no trouble or violence, and he followed him, and when the wounded at Duck Lake were about to be brutally massacred by Indians, it was this old man who saved them.\n\n4) Philip Garnot—day after day Riel ordered him to take part in the movement; at last Riel ordered him to be dragged to the camp, where, overpowered by terror for his life and fear of loss of his property, he consented to act as secretary, but refused to fight.\n(5) Alexander Fisher was always opposed to the Riel movement, and it was only abject fear of death that made him remain in the camp.\n\nAnd so on with regard to many others who took part under compulsion by Riel.\n\nHOW THE HALF-BREEDS WERE FOOLED INTO HOSTILITIES.\n\nHow did the Half-breeds first come to take up arms?\n\nThey were led into it by an ingeniously contrived trap. It is related by Mr. Maclese, in defending the Half-breed prisoners at Regina, as follows:\n\n\"The feast of St. Joseph is a great feast with the French Half-breeds. It occurred in 1884 on the 19th of March. The baptism of a person named Jackson was set for that day. The rank and file of the people were requested simply to bring their guns and fire a volley. That was the first of it. On the 11th March, Riel went to the upper or southern settlement, south of Batoche. Gabriel Dumont went to the north of Batoche. All the people were told to gather at Batoche, to go from there to the Church of St. Laurent, and there attend the Baptism. They were to take their guns with them and fire a feu de joie. They were, however, to remain at Batoche till all had gathered together. They met at Batoche. The rumor was then circulated by Riel that 500 police were just coming down upon them. They were also told that 100 police were coming from Prince Albert to tear down the Church and prevent the baptism. They so believed their leaders; that was how they came together armed. Captains were at once appointed to send out to bring all the rest of the people that hadn't come to the Church of St. Laurent, and from that the reign of hostilities spread.\n\nThen these Half-breeds had no grievances that they had deemed worth fighting about?\n\nNo; the whole scheme was of Riel's concoction as a means of extortion, revenge or conquest. He spoke of creating an Independent Republic, of which he would be Dictator.\n\nHow is this shown?\n\nBy his conduct towards the Half-breeds, whom he had induced to invite him over.\n\nDid they offer him any plan of action?\n\nRIEL'S PLAN OF ACTION.\n\nYes; but he told them it was useless; he would not act upon their plan. He said they must assist him to carry out his own plans.\n\nWhat were his plans?\n\nHe said it was to raise a rebellion among the Indians and Half-breeds. He told Dr. Willoughby that his plans were to have a proclamation at Pembina, Minnesota, and that as soon as he struck\nthe first blow in Canada, that proclamation would go forth, and he was to be joined by Indians and Half-breeds, and that the United States was at his back.\n\nWas he in earnest in that?\n\nHe said so. He said his past history, and the murder of Thos. Scott in 1870, was a guarantee that he meant what he said. He said also that the time had come now when he was to rule the North-west or perish in the attempt.\n\nDid he say anything more of his plans?\n\nA POLICY OF BLOODSHED.\n\nYes; he said the rebellion of 1870 would not be a patch upon this one. He said to Thos. Mackay, in a very excited way, \"You don't know what we are after—it is BLOOD! BLOOD! We want BLOOD! It is a war of extermination.\" Everybody that is against us is to be driven out of the country.\"\n\nWhat other evidence is there of Riel's policy of bloodshed?\n\nThe sworn testimony of Roger Goulet, who says that Louis Riel came to the church where the people were assembled, and said: \"You will go to Garnot's and get the prisoners, and give them over to the Indians to kill them to-night.\" But see that the Indians do not torture them.\"\n\nAny further evidence of this kind?\n\nYes. That of Chas. Nolin, who states that Riel advised a night attack upon Fort Carlton and the massacre of innocent people, in revenge, as he said, of the death of Goulet, who was drowned in 1870 in the Red River while escaping from the volunteers.\n\nDID NOT COMMUNICATE WITH THE GOVERNMENT.\n\nDid Riel, after his return in 1884, send any letter, petition or request to the Government for the adjustment of any pending questions?\n\nNo; none whatever.\n\nThe Hon. J. A. Chapleau had been a friend of Riel and his people, had he not?\n\nYes; a staunch friend throughout the previous troubles.\n\nMr. Chapleau was so great a friend that he went to Winnipeg at his own expense to defend Lepine?\n\nYes; that is so.\n\nDid Riel ask his advice or aid by letter or statement in 1884?\n\nNot—not at all.\n\nWhy did he not seek the aid of French friends in the Government?\n\nBecause he did not want any settlement save the settlement with himself on a money basis. His policy was to stir up trouble, and raise the Indians, in the hope that the Government would \"Come down handsomely\" for the sake of peace, and to save the white people from the scalping-knives of the Indians.\nAROUSING THE INDIANS.\n\nWhat were his dealings among the Indians?\n\nHe sent messengers with tobacco among the Cree and Sioux savages. In a letter of exhortation, he said: \"Be on your guard. Be ready to face all events. Take with you all the Indians. Gather them from all sides. Seize all the munitions, in every store where it is; grumble, growl, and threaten—RAISE THE INDIANS.\"\n\nIn another letter he said: \"The Indians are coming to join us on all sides. Buy all the munition you can.\"\n\nAnother letter said: \"If you see the police passing by, attack them and take away their arms. Justice commands to take up arms. Afterwards notify the Wood Indians to take munitions from all the stores at Nut Lake, Fish Lake.\"\n\nRiel sent a letter to Chief Poundmaker about April 13th. It was read in a big tent where 50 warriors were gathered, by one Delorme, Riel's messenger. After reading, Delorme expounded at great length. The letter, as the witness at Poundmaker's trial stated, was only an introduction to what he said. It said that Riel was going to get help from \"the Americans.\" He meant the Fenians. He told the Indians that \"the Americans\" (Fenians) were going to hold the Pacific Railway, and no soldiers could come in, and they (the Americans) would have broken the railway, but they were going to use it. Delorme told the Indians that if they did not join Riel, the Americans would take everything from them, and they would lose all their land. It was then agreed to kill all the soldiers that had red coats on. The young braves danced in the big tent every night. The Stoney tribe of Indians came to join Poundmaker's braves. They had been roused by messengers from Riel. \"Some of them,\" said the witness, \"were what you could call blood-thirsty.\" The old men were anxious to get out of it, but the young men (braves) \"had control of THE BLOOD AND MURDER SORT OF BUSINESS, but the management of the Riel business was in the hands of older men. The young men did not care who was killed, or who they were for. It was just 'kill anybody, and take what you can catch.'\"\n\nWhat reply did Poundmaker's Indians send to Riel?\n\nFive Chiefs joined in a letter in answer to Riel's letter, saying: \"Tell me the date when the Americans will reach the Canadian Pacific Railway. Tell me all the news you have heard from all the places where your work is in progress. Big Bear has finished his work. He has taken Fort Pitt. They took twenty prisoners, including the massacre at Fort Pitt. They killed eleven men, including the agent, two priests and six white men. The Blackfeet have killed sixty police. Here we have killed six white men. We have here (at Cut Knife) guns and rifles of all sorts, but ammunition is short. We want you to send us ammunition.\" This letter was\naddressed \"To Mr. Louis Riel,\" and signed by Poundmaker and five other Chiefs.\n\nBy this time, then, the \"blood and murder business\" had extended from Riel to the distant Indians?\n\nYes. They had taken up the same cry raised by Riel and Dumont the Sunday before Duck Lake, viz., that \"I will take the Lt.-Governor prisoner, and if necessary, wash my hands in his blood.\"\n\nWas this the feeling of all the Half-breeds?\n\nNo Father Cochin testified that Joseph Arcand was warm in protecting prisoners from being killed, maltreated and robbed by the savages. He also said that Alex. Cadieux, who had great influence with the savages, was enabled to save the lives of the teamster prisoners, who were on the point of being killed by the Indians, who were very furious and determined.\n\nBut Riel was all this time bloody-minded, was he not?\n\nYes. Vital Fourmond, director of Catholic Missions at St. Laurent, testified: My poor people were under the infatuation of this arch actor and trickster (Riel) till he got them committed to the effusion of blood, then they were in his power, and he used that power without any feeling of mercy. I heard him proclaim, \"Death, death, death, to any one who tries to desert,\" and many of the poor people had guns pointed at their hearts by Riel's orders, because he suspected them of wishing to get away. Philip Garnot was one of these. \"What can I do?\" said he, \"I am forced to be here. My life would be taken did I refuse to appear to act at least.\"\n\nThis Philip Garnot had no grievance?\n\nNo; nor neither had the Tourond family. They were seven sons and a widowed mother. These were fine young men. They had the finest kept farm. They were opposed to Riel in all his movements (Pere Andre's evidence). The crafty Riel tried every means to induce the boys to join him, but without success. They were well off, had a fine farm, plenty of cattle and horses, and were worth a great deal of money. They had no grievance. Riel went day after day to the poor widow, and with his devilish cunning played on her superstition and credulity. He told her of his holy visions. How he saw himself surrounded by seven glorious stars of extraordinary brightness. These bright stars, he told her, are your seven glorious sons, and the poor woman, in her simple faith, prayed her sons to go forth to battle, not for any secular \"rights,\" but \"under the banner of heaven.\"\n\nWhile Riel was praying and thus acting the hypocrite, what were his views about\n\nTHE HALF-BREED CLAIMS?\n\nOh, that idea had been given up. The claims were talked of at the public meetings, but what Riel wanted was \"blood\" money.\nHe said it was blood and a war of extermination he was after, but confidentially he said he would take money, and leave matters in quiet. But meanwhile he raised the Indians to massacre the white settlers, threatened to get \"Americans\" (Fenians) to fight the soldiers, and then set up an independent government, free from Anglo-Saxon interference. After bringing blood and murder into the country, and seeing that he could not succeed by fighting, he wanted to make terms with Gen. Middleton for himself.\n\nWhat is the testimony as to this?\n\nThe sworn affidavit of John W. Astley, C.E., of Prince Albert, who says: On the 12th of May I talked to Louis Riel about the rebellion and its results to himself. I said to him, \"You escaped from the consequences of your first rebellion through politics.\" \"Yes,\" said he, \"but I have three chances of escape this time; first, through politics; second, through the papers of the Council. I have arranged all the papers of the Council so that everything will show that the Council did everything, and my name will not appear as doing anything. My third chance is in being head of this new religion. If you will mention that to Gen. Middleton it will give me the greatest chance.\" I said to him, \"What will I say to the General about the French half-breeds' claims?\" \"O,\" said Riel, \"that is a very secondary consideration; I think of myself first.\" Again I said, \"if there are any conditions to be made for the claims of the Half-breeds, a word now might be of great advantage to them, as the General will not forget to report it.\" Again Riel replied, \"I assure you their claims are of a VERY SECONDARY IMPORTANCE—MY OWN SAFETY IS OF THE FIRST IMPORTANCE.\"\n\nSo it seems that Riel's first demand on coming into the Northwest was for \"Boodle,\" and the last for his personal safety?\n\nYes.\n\nWhen did Riel first mention about the Boodle?\n\nIn December, 1884, Father Andre had two interviews with Riel in regard to the sum of money which he (Riel) claimed from the Federal Government. He first asked from the Government $100,000. We thought, says Father Andre, that was exorbitant, and the prisoner said, \"wait a little, I will take at once $35,000 cash.\" The condition he put was that if the Government gave him $35,000 he would leave the country. The following evidence of Father Andre is in the report of Riel's Trial, page 113:\n\nQ. He was always after you to ask you to use your influence with the Federal Government to obtain an indemnity?—A. The first time he spoke of it was on the 12th of December, he had never spoken a word of it before, and on the 23rd December he spoke about it again.\n\nQ. He talked about it very frequently?—A. On these two occasions only.\n\nQ. That was his great occupation?—A. Yes, at those times.\n\nQ. Is it not true that the prisoner told you that he himself was the Half-breed question?—A. He did not say so in express terms, but he conveyed\nthat idea; he said, if I am satisfied the Half-breeds will be. I must explain this. This objection was made to him that even if the Government granted him $35,000, the Half-breed question would remain the same, and he said in answer to that—If I am satisfied the Half-breeds will be.\n\nQ. Is it not a fact he told you he would even accept a less sum than $35,000?—A. Yes, he said: \"Use all the influence you can; you may not get all that, but get all you can, and if you get less we will soo.\"\n\nRiel also made statements to the same effect to Mr. McDowell, member for the North-west Council for the district in which the rebellion took place, as detailed in December, 1884, before the outbreak. He stated that if a certain sum were paid him in cash he would at once leave the country. He says that he has such influence with the Half-breeds that any rights they have or claims upon the Government would be at once dropped by them if he advised them to do so. As soon as the Government gives him what he asks for, he will, he says, give up all connection with the other Half-breeds, in fact, throw them over and pledge himself not to return to this country.\"\n\nCOMING DOWN IN PRICE.\n\nTo resume: Did he afterwards agree to take $5,000 and leave the country?\n\nHe did. But the Government would not grant him anything.\n\nAnd there being no Boodle, he sought for Blood?\n\nYes. He massed his deluded followers on pretence of a religious festival, with guns in their hands; then alarmed them with a false tale that the police were coming down upon them, and thus induced them to rob the stores of ammunition and supplies, and in this way brought the police upon them in earnest, when the bloodshed began.\n\nWho began hostilities?\n\nAn Indian, at Duck Lake, who sought to disarm a policeman, according to Riel's directions previously given in letters to the tribes.\n\nWhat were the results of this outbreak in loss of life?\n\nAt Duck Lake nine white men were killed, and several wounded. The Indians began to kill the wounded. After one Newett was shot through the leg, an Indian hammered him on the head with his musket. Newett threw up his hand, when the Indian struck him again, smashing his hand and fingers with the butt end of his musket.\n\n\"PAINTED DEVILS.\"\n\nHow did Riel's Indians appear at Duck Lake?\n\nOne witness says \"they were painted up like demons.\"\n\nWas there much alarm on account of the Indian rising?\n\nYes. All the white settlers were in the utmost terror, afraid of a general massacre, as Riel had proclaimed, when he said, \"it was a war of extermination,\" meaning the clearing out of the white settlers.\n\nWas there any general massacre?\n\nYes, at Frog Lake, where Quinn and Delaney and the two Catholic\nmissionaries were treacherously shot down by Indians, after news reached them of the Duck Lake fight. Then came the sacking of Fort Pitt, and the siege of Battleford, where the white inhabitants were in terror of the Indians, and, lastly, the battle of Batoche.\n\nA VIEW OF THE FRUITS OF RIEL'S INDIAN POLICY.\n\nWhat were the particulars of the Frog Lake massacre?\n\nAs related by Mrs. Theresa Delaney, widow of John Delaney, one of the murdered whites, they are as follows:\n\nThe first we knew of the uprising was on the 2nd of April, at 5 o'clock in the morning. Two of Big Bear's tribe came into our house and told us our horses were stolen by the Half-breeds, and at the same time it was they themselves who had stolen the horses and hidden them. Soon after the arrival of these two Indians, some thirty more—all armed, and most of them mounted, came to the house and forced their way in. They took all the arms and ammunition they could find, telling us they were short and wanted oil. They required us to go with them, because they said they wished to save us from the breeds. We were taken first to the agent's (Mr. Quinn), and the Indians also demanded his arms\n\nand ammunition, and had a long talk about all keeping together to keep back the breeds when they came to take the provisions. I am satisfied now they were not sincere in this, and it was all to deceive us, for there were no breeds to come. From Quinn's we were taken to the priest's house. The priests were named Father Esnard and Father Marchand, who were both subsequently killed. We were not at all ill-treated so far, but there was every outward appearance of friendly feeling towards us. When we reached the priest's house mass was going on, the attendants being some Half-breeds who had previously been taken prisoners by the Indians and detained with the priest, in the latter's residence. The Indians would not let the priests finish mass, and ordered them, with the breeds and ourselves, back again to our own house. We were all left for about an hour, the Indians surrounding the house. The priests did not anticipate any danger, supposing that the Indians intended having a feast of the cattle that had been given them by Mr. Quinn, the agent. By this time it was about 9 30 in the morning. During our last detention at our house Big Bear came in and told my husband that he was fright-\n\nened some of his young braves\n\nINTENDED SHOOTING THE WHITES,\n\nbut that he, my husband, would be safe anyway. At this time the only place they had plundered was Mr. Dill's store, which they had gutted, but, while waiting, the Indians told Mr. Cameron, also a prisoner in our house, that they wanted him to accompany them to open the Hudson's Bay store, and Mr. Cameron did so, thus, in my opinion, saving his life. After opening the store the Indians sent him to their camp, about a mile and a half away. After securing everything in the latter store, they came to our house, and ordered us all up to the Indian camp. We departed, my husband and I, as well as all others, only taking with us what we had on our backs, not supposing we would be long away. At this time nothing of consequence had been taken from our house. It was not very cold. Before we had gone far from our house the Indians\n\nBEGAN TO SHOOT DOWN THE WHITES.\n\nMr. Quinn was shot first, though I did not see him shot. All who were killed were behind my husband and me, but I heard several shots fired, and until otherwise informed supposed the firing was into the air. At this time, how-\nover, Mr. Dill was killed, also Mr. Willscroft, Mr. Gouin, Mr. Gilchrist and Mr. Gowanlock, the latter of whom I saw fall. Mrs. Gowanlock was beside her husband when he fell, and as he dropped she leaned down over him, putting her face to his, and as two shots had been fired at her husband some supposed that she had fallen from the second shot. When I saw Mr. Gowanlock fall I saw also some hideous object, an Indian got up in frightful costume, took aim at my husband. Before I could speak my husband staggered away, but came back and said to me,\n\n\"I AM SHOT.\"\n\nHe fell then, and I called the priest and told the latter what had happened. While he was praying with my husband the same hideous Indian fired again, and I thought his shot was meant for me, and I laid my head down upon my husband and waited; it seemed an age, but it was for my poor husband, and he never spoke afterwards. Almost immediately another Indian ran up and ordered me away. I wanted to stay, but he dragged me off, pulling me along by the arms through the brush and brier and through the creek, where the water reached to my waist. I was put into an Indian tent and left there until nightfall, without anything offered me to eat, though I could not have eaten any way. I was not allowed outside of the tent, and so had no opportunity of returning to my dead husband, and have never seen him since. At nighttime two half-breeds, John Pritchard and Adolphus Nolan, came and purchased our release\n\nby giving horses to the Indians, the only two horses they had. These breeds were prisoners also, so that I was virtually still a prisoner with Big Bear; but John Pritchard and all the breeds were most kind, and I wish to state that I believe both Mrs. Gowanlock and I owe our escape from terrible treatment and at last massacre, to John Pritchard and other friendly breeds, prisoners like ourselves.\n\nThis ends Mrs. Delaney's story, which is corroborated by Mr. Cameron and others.\n\nWere all these atrocities prompted solely by Riel?\n\nYes. That was what he meant when he sent messengers among the Indians with tobacco. The Indians were told to clean out the whites, and have the land to themselves, and this was the beginning of a general slaughter that was to be carried all over the country.\n\nWhy did it cease with these murders?\n\nBecause word reached the Indians that the Americans and Montana Indians were not coming to their help, as Riel had promised. This led Poundmaker to say to Trottier (page 286, State Trials) that if it had been known that the Americans were not coming they (the Indians) would not have started the row. It was because they had expected the Americans that the row was started. Poundmaker found fault with Riel for misleading the Indians in telling them the Americans were coming. At this point he tried to keep the braves from going to Riel's camp, and, failing to do so, resigned his Chiefship.\n\nTRANSPORTATION OF TROOPS.\n\nWhen Riel said the Americans would prevent the soldiers from entering Manitoba, by seizing the railway, what did this mean to the people of Ontario?\nIt meant that he relied upon his American allies to intercept the trains bearing our volunteers, as they passed through Minnesota over the St. Paul, Minneapolis & Manitoba R. R., and do some kind of violence.\n\nWhat particular violence was then apprehended?\n\nThat by the use of dynamite, then the declared policy of the Fenians of the United States.\n\nWhat did concerted this plan, if it really existed?\n\nThe advanced state of the C. P. R. route north of Lake Superior, whereby our volunteers were transported through upon Canadian soil in absolute safety.\n\nWas this (Canadian) route condemned by Hon. Mr. Blake?\n\nYes. He said that the volunteers should be sent through American territory at the risk of violence by dynamite or any other means.\n\nA JUST JUDGMENT.\n\nWhat was thought of Riel's conduct in arousing the Indians?\n\nMr Justice Richardson, in sentencing Riel at Regina, said:\n\n\"You have been found guilty of high treason. You have been proved to have let loose the flood-gates of rapine and bloodshed; you have, with such assistance as you had in the Saskatchewan country, managed to arouse the Indians, and have brought ruin and misery to many families whom, if you had simply left alone, were in comfort, and many of them were on the road to affluence. For what you did, the remarks you have made form no excuse whatever; for what you have done the law requires you to answer.\"\n\nRIEL NO PATRIOT.\n\nThen Riel was no patriot, after all, but simply a selfish, scheming rascal, and firebrand among a peaceful and generally contented and happy people?\n\nThat was his character, exactly.\n\nOne who plunged the North-west in a fury of agitation, blood and fire, simply as a mode of extorting a few thousands of dollars from the Government at Ottawa?\n\nYes, for the purpose of\n\n\"MONEY AND REVENGE.\"\n\nBut what of the Half-breed Grievances? Was there no such thing in reality?\n\nThe best answer to this question is the Official Report of Mr. Wm. Pearce, who investigated all the alleged grievances of the settlers of St. Laurent, and evidence was taken under oath. The report is summarized, as follows:\n\n1. Of the 258 heads of families in the revolted district, not one had failed to obtain a patent for his lands through the neglect or inaction of the Government. There were in all but ten cases of delay, and these were caused by conflicting surveys.\n\n2. Not one Half-breed had been injured in his property by the surveys.\n\n3. Only 21 of the whole number were entitled, of right, to grants of land in the North-west. Some of the remaining 237 were strangers, having no\nclaims upon the Government, but most of them were Manitoba Half-breeds, who had already received their full rights in that Province.\n\n4. Not one settler had suffered in any way by the operations of any speculator or land company.\n\n5. The timber dues complained of amounted to 5 cents for each settler per annum.\n\n6. The only remaining \"grievance\" alleged, the hay \"grievance,\" did not affect these settlers at all.\n\nRIEL'S CHAMPIONS.\n\nAnd yet the French Rouges of Quebec maintain that Riel was a hero, and martyr, and that he was fighting only for the \"rights\" of his people?\n\nYes, but the Catholic Clergy on the Saskatchewan declare that Riel was a trickster and firebrand, a designing, selfish knave, a rebel to the Church as well as an outrager of the laws.\n\nM. LAURIER TO THE RESCUE.\n\nYet M. Laurier, leader of the Quebec Rouges, declares that he has sympathized with Riel throughout, and that \"had he been on the banks of the Saskatchewan in 1884 he would have been found with a musket in his hands, shoulder to shoulder with Riel?\"\n\nYes, he so declared at the Champ de Mars meeting in Montreal, and repeated the same sentiment at the nomination at Chambly.\n\nHas M. Laurier since repeated that sentiment on any public occasion?\n\nYes. At Windsor, on the 14th Dec., 1886, addressing his French compatriots, M. Laurier said, as reported in the Detroit Free Press of Dec. 15th: \"I will say that had I been a Half-breed living in the North-west during the trouble in 1885, I would have shouldered a musket and used it, too, in fighting for the cause for which Riel was hanged.\"\n\nMR. BLAKE ASSISTING.\n\nAnd Mr. Blake, leader of the Reform party, brings M. Laurier to Ontario to champion the cause of the man whom Bishop Grandin, Father Andre, Father Fourmond and Father Cochin had denounced as an arch trickster, rebel, firebrand, knave, actor, hypocrite and selfish, designing conspirator?\n\nYes, that is true.\n\nWherefore are Messrs. Blake and Laurier joined in this attempt to whitewash Riel, and condemn the Government for refusing to grant him a reprieve of the sentence of death?\n\nWell, Mayor Beaugrand, of Montreal, explained it to a Chicago reporter when he said, \"It was all POLITICS.\"", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001314.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 19, "total-input-tokens": 29792, "total-output-tokens": 9245, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 42, 1], [42, 178, 2], [178, 314, 3], [314, 314, 4], [314, 2607, 5], [2607, 2607, 6], [2607, 4771, 7], [4771, 7228, 8], [7228, 9993, 9], [9993, 12370, 10], [12370, 14654, 11], [14654, 17415, 12], [17415, 20028, 13], [20028, 22935, 14], [22935, 25639, 15], [25639, 29159, 16], [29159, 32235, 17], [32235, 34799, 18], [34799, 36989, 19]], "primary_language": ["en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]