[{"id": "4de5551df1a24c1ddc9c6e4cdf7e3afe201e9a28", "text": "MESSAGE\nFROM THE\nPRESIDENT OF THE UNITED STATES,\nTRANSMITTING,\n\nIn response to Senate resolution of February 11, 1889, a report upon the case of Louis Riel.\n\nMARCH 12, 1889.—Read and laid upon the table.\nMARCH 19, 1889.—Ordered to be printed, omitting the printed inclosures.\n\nTo the Senate of the United States:\nI transmit herewith, in answer to the Senate resolution of the 11th ultimo, a report of the Secretary of State, with accompanying papers, in regard to the case of Louis Riel, otherwise known as Louis David Riel.\n\nEXECUTIVE MANSION,\nWashington, March 11, 1889.\n\nTo the President:\nThe Secretary of State, to whom was referred the resolution of the Senate of February 11, 1889—\n\nThat the President be requested to communicate to the Senate such knowledge or information as may be in his possession or under his control relating to the case of Louis Riel, otherwise Louis David Riel, with copies of all documents, papers, correspondence, and evidence bearing upon the subject—\n\nreports as follows:\n\nCompliance with the resolution in its broadest sense would involve the transmission of a voluminous mass of correspondence with the British minister to this country, with the Secretary of War, and with our consuls at Montreal and Winnipeg, in regard to the preservation of neutrality along the border between the United States and Canada, and the prevention of the participation of American Indians in the rebellion against the British Government, and also communication of a great mass of newspaper clippings relative to the military operations in the Northwest Territory of the Dominion connected with the suppression of the insurrection there in 1885, which it is impossible to have copied with the present force of the Department, and which it is believed is not intended by the Senate resolution.\n\nThat resolution is understood to refer to the personal claim of Riel to protection as an American citizen. Accordingly, copies of the dispatches from the United States consul at Winnipeg, inclosing the petition of Riel to the President and two letters to the consul, with the peti-\ntions of certain citizens of Canadian-French origin, the Department's reply to Mr. Ambrose Choquet, and the Dominion Blue Book, containing a full account of the trial and condemnation of Riel, are herewith transmitted. The reports made by the consul at Winnipeg during the course of the trial, it has been deemed unnecessary to send, as they consist merely of extracts from newspapers giving an account of the proceedings.\n\nThe position of this Department in regard to the alleged American citizenship of Riel, and his request for diplomatic intervention by the Government of the United States to prevent the execution of the sentence pronounced upon him by the Canadian courts, was fully stated verbally to some of his friends who presented in person one of the petitions above referred to. They were informed that his alleged United States citizenship did not give him any immunity from Canadian laws for offenses committed within their jurisdiction, and that it had been definitely certified to this Department that the offense had been wholly committed within British jurisdiction.\n\nRespectfully submitted:\n\nT. F. BAYARD.\n\nDEPARTMENT OF STATE,\nWashington, March 2, 1889.\n\nLIST OF INCLOSURES.\n\n1. Mr. J. W. Taylor to Mr. Porter. No 432. July 25, 1885.\n2. Same to same. No. 433. August 5, 1885.\n3. Mr. J. E. Marier to Mr. Bayard. August 17, 1885.\n4. Mr. J. W. Taylor to Mr. Porter. No. 441. September 12, 1885.\n5. Petition of the citizens of Wayland, Mass. August 18, 1885.\n6. Mr. A. Choquet to Mr. Bayard. October 15, 1885.\n7. Mr. Bayard to Mr. A. Choquet. October 27, 1885.\n8. Report of the Department of Militia and Defense of the Dominion of Canada upon the suppression of the rebellion in the Northwest Territories in 1885.\n9. Epitome of Canadian Parliamentary documents in connection with the Northwest rebellion.\n\nNo. 1.\n\nMr. Taylor to Mr. Porter.\n\nNo. 432.]\n\nUNITED STATES CONSULATE,\nWinnipeg, July 25, 1885. (Received July 30.)\n\nSIR: I received by the mail of yesterday a letter from Mr. Louis Riel, dated the 21st and posted at Regina on the 23d instant, a copy of which is herewith inclosed.\n\nIn reply I have informed Mr. Riel that his communication and full details of the proceedings at Regina will be furnished by me to the State Department at Washington.\n\nI inclose a letter of Riel to a wealthy friend, of Quebec, who has generously secured the services of counsel for defense; and also more detailed reports of the trial at Regina.\n\nI am, sir, your obedient servant,\n\nJAMES W. TAYLOR.\nMr. Riel to Mr. Taylor.\n\nCOMMON JAIL AT REGINA, July 21, 1885.\n\nSIR: I am in the painful condition of being brought before the court at Regina, under charge of high treason.\n\nI have the honor to let you know, to inform you that I am not guilty.\n\nI have the highest respect for the stipendiary magistrates before whom I have to answer; but their court is not the one to try my case, as that case had its origin long before the stipendiary court of Regina existed.\n\nAs American citizen, I humbly appeal to the Government of my adopted land for help through you. I assure you my request is not inspired by any of those feelings which might have a tendency to create difficulty between the United States and England.\n\nI am small, and my humble condition prevents me from being heard by the British dignitaries of the Dominion. I am confident that if you would deign write to the American Government in my behalf, they would not refuse to say a good word in my favor; that good word would secure me a fair trial, and a fair trial would save me.\n\nWhile in Montana, I have exerted myself to be a good citizen, and I have worked in harmony with the United States authorities in the Territory. I have even had the honor to be appointed several times United States special deputy marshal. If I mistake not there are in the Department of Justice at Washington documents which speak favorably of me.\n\nIn God I trust that a friendly word to the British minister would go far to protect me from inattention.\n\nAlso, I have no means to defray the expenses of a trial such as the one I have to stand. I beg the American Government to help me that way too. Please transmit my humble petition, if it is not altogether out of place.\n\nThanking you for all the favors you have done me in the past, and praying that you may be fully rewarded, I hope the Providence of God will spare me, through as generous a consul as you, and through as good a Government as that of the States.\n\nI have the honor to be, very respectfully, your humble servant,\n\nLOUIS RIEL\n\nNo. 2.\n\nMr. Taylor to Mr. Porter.\n\nUNITED STATES CONSULATE,\nWinnipeg, August 5, 1885. (Received August 11.)\n\nSIR: The trial of Louis Riel for treason terminated on Saturday, August 1, by conviction with a strong recommendation to mercy by the jury, and a sentence of death to be executed on the 18th of September.\n\nI forwarded in dispatch No. 432 a telegraphic summary of the proceedings of the first two days of the trial, July 20 and 21, which were followed by adjournment to Tuesday, July 28. I now inclose a fuller report of the opening arguments of counsel upon the constitution of the court and the competency of a stipendiary magistrate, with a jury of six virtually of his own selection, and without the intervention of a grand jury, to try a person charged with a capital offense.\n\nIt will be a hideous mockery of justice to execute Riel before his counsel can submit their argument on questions of such magnitude and doubt to the tribunal of last resort.\n\nI also inclose a more succinct but sufficiently minute report of the testimony subsequently given and the closing proceedings of the trial.\n\nRiel has addressed me a second communication, a copy of which, and also a copy of my note of July 27, informing him of the receipt and transmission to the State Department of his letter of July 21, are here-with forwarded.\n\nI am, sir, your obedient servant,\n\nJAMES W. TAYLOR.\n(1) Mr. Taylor to Mr. Riel.\n\nUNITED STATES CONSULATE,\nWinnipeg, B. N. A., July 27, 1885.\n\nSIR: Your letter of July 21 was received by me on the 24th of July and has been carefully considered.\n\nI have forwarded a copy to the State Department at Washington, accompanied by your communication to Dr. R. Fiset of July 8, and a full report of the proceedings in your case before the stipendiary magistrate at Regina.\n\nI shall promptly advise yourself or your counsel of any action upon your communication by the Washington authorities.\n\nI am, sir, your obedient servant,\n\nJAMES W. TAYLOR.\n\n(2) Mr. Riel to Mr. Taylor.\n\nPRISON DE REGINA,\n(no date) since August 1.\n\nSIR: I have received your true favor of the 24th ultimo. The number of my thanks to you is equal to that of our stars; and the sincerity of my acknowledgment shines out of my heart during my misfortune, trying to harmonize with the gentle bright colors of the American flag.\n\nI have the honor to send you, as best I can, a part of my address to the court on Friday, the last of July. I have not presently under my hand copy of my observations as to the imperfection of the jury, as to the strange mode of their selection by an officer of the Crown, neither as to the incompetency of the court. Perhaps you will be able to see it in public print.\n\nSaturday, August 1, I asked the court for the appointment of a commission to give me opportunity to produce all the circumstances of my case, and for the formation of a special tribunal before which I could appeal. My view is this: The troubles of '65 in the Saskatchewan are the continuation of the troubles of '69-'70, which the Ottawa government have never duly settled; and I wish that a thorough investigation be made on the question of those troubles from '69 to the present time.\n\nThe Ottawa government have adopted concerning the half-breed and Indian title to lands an altogether different view and principle than those adopted by the American Government on the same question. The annuities paid by the United States to their Indians are distributed to them as donations. That principle leaves the administration of Indian affairs at liberty to adopt a course of action such as circumstances direct best. But on this side of the line a fixed Indian policy has been adopted, and its principle has been made constitutional, thereby giving the Indians and the half-breeds a constitutional platform. The government of the Dominion, by its treaty with the delegates of the Northwest, agreed that a certain proportion of the lands be granted to the half-breeds throughout the territory, and to inaugurate the principle in Manitoba. One million four hundred thousand acres were guaranteed to them by the thirty-first clause of the constitution of that province. As its area contained at that time only about 9,500,000 acres, the land grant was about one-seventh of the whole superficie.\n\nThe half-breeds of the Northwest want that the same proportion be guaranteed to them; that their seventh be valued and understood to represent a capital in the hands of the government, and that an interest be paid to them every year on that capital.\n\nAnd as the half-breeds of Manitoba have had the constitutional guaranty of that seventh of the land on account of their Indian title, the Indian tribes of the Northwest are naturally dissatisfied that the Indian title should carry less for them than for the half-breeds. Besides, the terms of the thirty-first clause of the Manitoba act state that the half-breed land grant is made toward extinguishing the Indian title, which give the Indians to understand that when the Federal Government will have given as much to the pure Indians as it gave the half-breeds, then only will the Indian title entirely be extinguished. The matter at stake is not a small one, considering the Northwest to have a superficie of about 1,195,000,000 acres of land.\n\nThe Ottawa government disregards most openly the very views which they have so bound themselves by constitution to follow. On the other hand, the half-breeds and Indians, being unwilling to give their constitutional rights, have petitioned until the Ottawa Government resolved to silence them by force, as they are just now doing.\n\nMr. Consul, this contradictory policy, it seems to me, ought to be modified seriously, either by repealing altogether the thirty-first clause of the Manitoba constitution or by fulfilling it. Otherwise the Indian and half-breed question, as it stands on this side of the line, may react fearfully amongst the American Indians and half-breeds. For that reason I have thought that inasmuch as that reaction may disturb\none day the peace of the American Territories the Indian question was not exclusively a matter of interior administration for North British America, and that perhaps it was reasonable to consider it as a question of international interest between the United States and this part of British Possessions.\n\nIt is why I ask humbly that a commission be jointly appointed by the two governments, and of which I earnestly wish you to be a member, to investigate the matters constituting the claims of the half-breeds and Indians on one side, and to investigate thoroughly whether the Federal Government have prominently inaugurated some principle which they have afterwards conspicuously disregarded, thereby occasioned themselves and caused the late war in the Saskatchewan.\n\nMr. Consul, if God's goodness and humanity do not come to my aid the sentence against me is that the 18th of September next I shall cease to live.\n\nMay God preserve you and help you in all things. And receive my deepest gratitude.\n\nVery respectfully, your humble servant,\n\nLOUIS RIEL.\n\nNo. 3.\n\nMr. J. E. Marier to Mr. Bayard.\n\nLAWRENCE, August 17, 1885. (Received August 19.)\n\nSir: At a meeting held yesterday by citizens of Canadian-French descent I was directed as their secretary to send you the inclosed petition.\n\nAs the present government has at heart the judicious redress of all wrongs and proper dispensation of all American citizens' rights, I beg to call your attention as to the position taken of late by our vice-consul in Winnipeg; so much so as to insure him a position as a Dominion official if he was recalled, showing in many occasions his rather unbounded interest to the representatives of the British power. As such actions may be detrimental to the cause we are submitting to you, I deem it my duty as an American citizen to give you knowledge of the fact, of which I have reliable information from Winnipeg and elsewhere.\n\nRelying on the wisdom and impartiality of our Federal Government, to which you belong, we are assured in advance that the cause we are advocating will be justly dealt with.\n\nI am, Mr. Secretary, your most obedient and humble servant,\n\nJ. E. MARIER,\nSecretary of Canadian-French Citizens and Residents of Lawrence, Mass.\n\n[Inclosure.]\n\nPetition of the Canadian-French citizens of the United States of Lawrence, Mass.\n\nSir: Considering the partiality shown in the proceedings in the trial of Louis David Riel, in which the accused was sentenced to death for high treason towards Her Majesty, the Queen of Great Britain, for the more or less active part he has taken in the recent northwest Canadian troubles, and claiming that the said Louis David Riel is a citizen of the United States, we hope that the American Government will have him equitably treated.\n\nIn consequence, Mr. Secretary, we beg of you to be our interpreter to His Excellency the President of the United States, requesting him to assist in preventing this abuse of justice, and that the Stars and Stripes, which are our safeguard, shall shield under its noble folds the unfortunate, who is the apparent victim of fanaticism.\n\nHoping that our request will be favorably considered, we are, Mr. Secretary,\n\nYour most humble servants, citizens and residents of Lawrence, Mass.,\n\nJOSEPH BLANCHET,\nMAGLOIRE BOLDUC,\nJAMES L. BOLDUC,\nERNEST A. DEMARS,\nHECTOR DUCHESNE,\nand four hundred and five others.\n\nHon. T. F. BAYARD,\nSecretary of State, Washington, D. C.\nMr. Taylor to Mr. Porter.\n\nNo. 441.]\n\nUNITED STATES CONSULATE,\nWinnipeg, September 12, 1885. (Received September 17.)\n\nSIR: Inclosed is a petition of Louis Riel to the President.\nI forward the original, thinking that such a course may be expected under the circumstances.\n\nI am, sir, your obedient servant,\n\nJAMES W. TAYLOR.\n\n[Inclosure in dispatch No. 441 at Winnipeg.]\n\nPetition of Louis Riel to the President.\n\nJésus, sauvez nous.\nMarie, intercédez pour nous.\nJoseph, priez pour nous.\n\n[Note.—Above on first page, reverse page blank.]\n\nTo His Excellency —— CLEVELAND,\nPresident of the United States and to His Excellency's Cabinet:\n\nMr. PRESIDENT: The undersigned, your humble petitioner, a foreigner by birth, became American citizen about the 16th day of March, 1883, at Helena, Lewis and Clark County, Montana.\n\nHe is a native of the Northwest Territory, in British North America.\n\nHe has the honor to submit that the British Government gave, two hundred years ago, to a company of adventurers, the monopoly of the fur trade in the Northwest, thereby depriving the Northwest of its right and of the advantages of trading with the world, and depriving the world of its right, and of the benefits of trading with the Northwest.\n\nThat the giving out of such a monopoly over the Northwest left that country, new as it was, altogether at the mercy of the Hudson's Bay Company; the more so that, from its having been constituted at first as a magistrature over its own servants, the same company was made, in the course of time, by imperial authority, to grow up as the government of the Northwest.\n\nThat this measure kept the Northwest confined to a strict \"block\" during six or seven generations; was a cause of continual calamity to the Territory itself; of damage to the adjoining countries, an insult as well as an injustice to the world at large.\n\nAnd that, having been resorted to without reason whatever, consequently without justice at all, it constitutes the British Government guilty of an extraordinary crime against humanity.\n\nThe undersigned, your humble petitioner, submits that therefore the British Government have forfeited long ago all title and right of governing the Northwest.\n\nThe undersigned has the honor to submit that in '69 the Ottawa government envying the lands of the Northwest, bought them (so to speak of the transaction) from the Hudson's Bay Company, which did not own them; that the Hudson's Bay requested one-twentieth of the Territory for the perpetration of the sale, and was granted it; that the transaction, all against probity, as it was, received the sanction of the British Government, and was carried out under its careful attention; that in so doing the British Government replaced the oppressive calamitous fur-trade monopoly by one completely ruinous, as it gave the Hudson's Bay Company a still greater hold on the resources of the country than before, and as it established the government of another colony and of different interest master of the whole land, and at liberty to dispose of it, as of its own soil, as of its own property, without advantages in return, without any compensation.\n\nThat the Dominion began immediately to survey the Northwest, to cut the old surveys and ignore them, to cut roads through private properties;\n\nThat the Canadian surveyors at that work were soldiers under disguise and numbering some four or five hundred;\n\nThat the Dominion having at the same time in view to usurp the rule of the Northwest, made up a group of men, gathered from the vicinity of Ottawa, furnished that group with five hundred carbines, called it the Northwest Council, exported it, and\nattempted to seat it at the Fort Garry, when the five hundred surveyors turned out to be a squadron of militia;\n\nThat the Hudson's Bay Company endeavored then to hand over to the invaders that government of the Northwest which England had so constantly neglected and so obstinately kept at the disposal of trading adventurers;\n\nThat the people of the Northwest resisted energetically the Hudson's Bay Company's iniquitous designs and the Ottawa dreadful scheme, and never failed to dignify the defense of their cause with expressions of loyalty to England;\n\nThat the British Government answered their magnanimous fidelity by promptly appointing as governor of the Northwest the Ottawa governor himself—that is to say, the very man in the empire whose position, whose advisers, and consequently whose whole interest were more certainly against the Northwest; appointment conspicuously partial and unjust, which threw at once all the chances on the strongest side, in oppressing the weak as much as possible;\n\nThat the British Government then left the Northwest without administration, exposed to the many perils of anarchy and invasion;\n\nThe undersigned, your humble petitioner, submits and respectfully claims that by committing this other remarkable series of outrages against the Northwest, the British Government have again forfeited all title and right of governing it;\n\nYour humble petitioner submits that the people of the Northwest, left to themselves, had to organize and to constitute a state of their own, to take care of public affairs, and for their protection;\n\nThat the honorable William McTavish, then still governor, in name, of the Northwest, having been asked by a convention of the people's representatives if he could approve of the new state, entreated them to push on their work; and his answer to the Hon. John Sutherland and Mr. Frazer, the two members waiting on him, was \"For God's sake, form a government.\"\n\nThat when the convention sat, Hon. John Black, governor ad interim and judge of the H. B. Company, was one of the members elected by the people and consented to act as chairman of the convention;\n\nThat the people's representatives, numbering forty, being in session at Fort Garry, then formed a government and elected your humble petitioner as its highest employee, February 11, 1870;\n\nThat more than two-thirds, thirty-two out of the forty, voted the new government into existence and elected your humble petitioner at the head of it;\n\nThat the eight other members were in favor to that extent that they abstained from offering any opposition;\n\nThat immediately after, Hon. Judge Black, H. B. Company governor ad interim and chairman of the convention, left his seat and gave it courteously to the president of the provisional government, according to the convention's vote;\n\nThat, on the same occasion, Hon. John Black, H. B. Company's governor ad interim and judge, having been chosen by the president of the Northwest as one of the delegates to Ottawa, accepted the appointment, with the company's approval;\n\nThat some days later the Hon. D. A. Smith, a commissioner sent by the governor-general to the Northwest, went in company with Reverend Archdeacon McLean, now Bishop of the Saskatchewan, and persuaded the districts whose eight representatives had remained neutral to join and to acknowledge your humble petitioner as president of the provisional government; and Hon. D. A. Smith's advice having been acceded to, the undersigned, your humble petitioner, received then the unanimous support of the people.\n\nAs a result the new state of the Northwest, in '70; its government were legally constituted, and the election of its president was carried out according to regular constitutionality.\n\nYour humble petitioner respectfully submits that as soon as the new state was organized, its government formed, and its president elected, four commissioners, Reverend J. B. Thibault, Vicar-General, Colonel de Salaberry, Hon. D. A. Smith, and his lordship, Archbishop Taché, appointed by the Crown, invited the undersigned to send delegates to Ottawa, and there to negotiate the terms of the federal pact between the East and the Northwest.\n\nThat such invitation was a recognition by the Crown itself, of the state, of the government, and of the president of the Northwest.\n\nYour humble petitioner submits, that he appointed in his official capacity a delegation according to the repeated and pressing invitation received; that his delegates proceeded to Ottawa, were received by the Crown on his credentials and admitted to treat on his instructions, which was another irrevocable official recognition of the state, of the government, and of the president of the Northwest; by whom? By the Crown.\n\nYour humble petitioner respectfully submits that his delegates having, at the outset, set forth that they could not begin to treat without the guarantee of a general and complete amnesty, and having required it as a condition sine qua non, the\nVice-King of Canada answered most favorably that the Crown was going, for certain and sure, to amnesty all the past troubles, after the conclusion of the treaty, and that the federal regime in the Northwest would be inaugurated by the proclamation of that amnesty complete and general. And the governor-general, Lord Lisgar, gave his Vice-Kingly parole as security. A third very positive recognition by the Crown of the state, of the government, and president of the Northwest.\n\nThe undersigned, your humble petitioner, respectfully submits that his lordship, Archbishop Taché, then appointed by the governor-general of Canada as pacifier of the Northwest, gave your humble petitioner his official word of honor that the amnesty in question would be proclaimed at the time specified; that is, at the very opening of confederation in the Northwest;\n\nThat the archbishop owed his commission as much to the pleasure of the British Government as to the governor-general's choice; consequently, besides being a fourth remarkable recognition of the state government and president of the Northwest, his word of honor is the word of honor not only of the governor-general but of the British Government itself concerning the sine qua non condition of amnesty.\n\nYour humble petitioner could here review the whole treaty as it took place: point out the many ways in which it has been broken; and show by facts that the present government of Manitoba and of the Northwest is a perfect chaos of illegality, unconstitutionality, and arbitrary legislation; but for the sake of brevity will confine to the one article of the stipulations on which the breach of faith has been acknowledged and established beyond all possibility of discussion and doubt.\n\nThe undo resigned has the honor to refer your excellency and your most honorable ministers (1) to a pamphlet entitled \"Amnesty,\" written by Archbishop Taché in the year 1874, whereby his lordship proves his commission, his illimitated instructions, his word of honor, and that such word of honor has been repudiated by the Crown.\n\n(2) To the report of a committee appointed by the house of commons of Canada, in the year 1874, for the purpose of enquiring into the causes of the Northwest troubles and the reasons which had delayed the proclamation of amnesty; wherein more than a dozen of highly respectable witnesses prove that an amnesty general and complete has been guaranteed and that it has not been fulfilled.\n\n(3) To a series of resolutions adopted by the Canadian government in '75 read during the session, on or about the 12th of February, and endorsed by a large majority of the house of commons, such resolutions showing with all conclusiveness that the general and complete amnesty in question had not only been promised and guaranteed, but that it had even been made a sine qua non condition of alliance with the Northwest.\n\nYour humble petitioner respectfully calls, however, your excellency's and cabinet's attention to the fact that the Hon. A. MacKenzie, then premier of Canada, his whole ministry and his large majority in the house, instead of logically concluding by petitioning the Queen to fulfill the promise, the Vice-Kingly parole, the word of honor, the condition sine qua non of the amnesty general and complete on the Northwest troubles, committed the fault of continuing and perpetuating the breach of faith.\n\nI. By decreeing against your petitioner a banishment of five years.\n\nII. By offering my adjutant-general, A.D. Lepine, the alternative of a banishment for the same period of time or the loss of his political rights forever.\n\nIII. By issuing themselves an amnesty to the rest of the Northwest people, such an amnesty being in itself a mockery of justice; in the first place because the secretary of the Dominion was but the secretary of a mere colony and had no more sovereign power to amnesty us than the Northwest would have had to amnesty Canada; and in the second place, the provocation having come from Ottawa, the fact of an unjust aggressor amnestying his victim was nothing else but the height of injury, and may be taken as the worst of our grievances against the Federal Government.\n\nThe Imperial authorities have allowed all this to take place while perfectly aware of the outrage.\n\nN.B.—In '69, during the month of December, Lord Granville, minister of the colonies, in one of his dispatches to the governor-general, accuses the Dominion government of having been a cause of troubles in the Northwest.\n\nN.B.—And the Dominion committed these wrongs against us, after having officially confessed that we were in the right, as can be seen by the following: In the same month of December, '69, Hon. Joseph Howe, secretary of state for Canada, states plainly in a dispatch to Hon. W. McDougall, concerning the way he (McDougall) and Col. S. Dennis had acted in the Northwest; that they had compelled the people of that Territory to form a government of their own; that such a government on account of the circumstances and of necessity was legal; that the responsibility of the troubles, even the shedding of blood, if it took place, rested on the Canadian government's officials, and bitterly complains of their imprudence and temerity.\n\nN.B.—In the month of May, 1870, Sir George E. Cartier, one of the ministers who had treated with my delegates and minister of militia for Canada, acknowledges in\na memorandum to the Crown that the Canadian government have caused the Northwest troubles, and that the people of that Territory had only kept on the defensive.\n\nThus the reasons which England and the Dominion have given afterwards to try and justify their not complying with, and their derogating from, the treaty obligations, will never amount to anything else than pretextus.\n\nYour humble petitioner respectfully submits to your excellency and cabinet the following as the prominent fact of the whole situation—the sine qua non condition of an alliance with the Northwest, the general and complete amnesty has not been fulfilled.\n\nConsequently the British Government has had neither the right of introducing the confederation in the Northwest, as they did in 1870, neither the right of maintaining it there since.\n\nConsequently, that confederation which the British Government supports between Lake Superior and the Rocky Mountains is an immense fraud and a dreadful tyranny.\n\nConsequently, again, the state and the government of the Northwest are mine, such as they were intrusted to me by the people's voice, at Fort Garry, the 11th of February, 1870, and such, as recognized to me by the four commissioners of the Crown who have invited me to treat, and by the Crown itself, which has treated with my delegates through the Vice-King of Canada.\n\nYour humble petitioner begs leave to submit that he has a right to denounce the breach of faith in so important a matter, to reject the pact which England has made with him and she has never fulfilled, now principally, that your humble petitioner has been persecuted, has exhausted all means and patiently waited during the long period of fifteen years, principally now that, instead of executing her obligations toward me, England is trying to execute me.\n\nBefore God and before men, the undersigned, your humble petitioner, declares his native land free, and has the honor to ask your excellency and most honorable ministers for the advantage of annexing the Northwest to the great American Republic.\n\nYour humble petitioner respectfully asks, as American citizen, for your kind and powerful protection. In the event of your excellency and most honorable cabinet granting my request as American citizen, I, the undersigned, have the honor to ask that the international line between the United States and the Northwest be blotted out from Lake Superior to the Pacific Ocean, that the Hon. James W. Taylor, United States consul at Winnipeg, be appointed governor-general of those vast territories, and with the merciful help of God's providence, if such would be the disposition of your good will and the favor of your government, I, the undersigned, humbly ask you to appoint me as first minister and secretary of the Northwest under Hon. James W. Taylor.\n\nYour humble petitioner respectfully submits that he has no ill will whatever against his enemies; that his great wish is to save his friends and as well to better, all he can, the condition of those against him. Therefore I respectfully submit that, in the case of such a providential event, your excellency and most honorable ministers may be pleased to introduce and inaugurate the United States institutions in the grand Northwest, without changing, for the present, the local officials and employés of all sorts, so as to avoid a commotion; so as to satisfy and please all classes and all parties and so as to secure more surely the success of the national institutions in this large portion of the world, for the glory of your administration, and for the happiness of this my native land.\n\nYour humble petitioner thanks your excellency and your government for the good they have already so generously conferred upon him.\n\nI have the honor to be, of your excellency and of your cabinet, the very respectful and humble servant and petitioner.\n\nLOUIS \"DAVID\" RIEL.\n\n---\n\nNo. 5.\n\nPetition of the citizens of Wayland, Mass:\n\nAUGUST 18, 1885.\n\nThe undersigned, citizens of the town of Wayland, State of Massachusetts, respectfully represent that Louis Riel was born at St. Vital, Manitoba; that he was duly naturalized a citizen of the United States of America at Helena, Mont., on the 16th day of March, 1883; that he was arrested in Canada, tried and condemned for treason, and sentenced to be hung upon the 18th day of September next; that we think he was\ndenied the rights to which he was entitled as an American citizen, and we would most respectfully petition you in your official capacity to inquire into the matter of said trial, and if said Riel has been denied his rights as an American citizen, that you will use your utmost power, with due regard to the honor and integrity of the United States, to secure him his rights.\n\nJOHN LAMARINE,\nMEDDIE SCOTT,\nFRANK LOVELY,\nM. R. BROWN,\nW. C. SMITH,\nALPHONSE ALLAIRE,\nC. E. BRUMMETT,\nand fifty-eight others.\n\nHon. THOMAS F. BAYARD,\nSecretary of State.\n\nNo. 6.\n\nMr. A. Choquet to Mr. Bayard.\n\nROCHESTER, N. Y., October 15, 1885. (Received October 16.)\n\nSIR: I have the honor to transmit to you the petition of the French Canadians, citizens of the United States, residing in the city of Rochester, N.Y., praying for the interference of the United States Government in favor of the poor and insane Louis David Riel, now languishing in jail at Regina, Northwest Territory of Canada, under sentence of death. I have delayed the transmission of this petition until I received an authentic copy of the certificate of naturalization of Riel, which came to me only a few days ago.\n\nBy my former personal acquaintance with Riel, and with the recent information received from reliable parties, I am convinced that Riel is now insane.\n\nI would therefore humbly suggest that this fact be ascertained by the United States Government to prevent, in case of failure of the appeal now pending before the privy council of England, the hanging of an unfortunate insane citizen of the United States.\n\nVery respectfully, your obedient servant,\n\nAMBROSE CHOQUET,\nCounselor at Law, 11 and 12 Elwood Building, Rochester, N. Y.\n\n[Inclosure 1.]\n\nPetition of French-Canadian citizens of the United States residing at Rochester, N. Y.\n\nTo the Hon. T. F. BAYARD,\nSecretary of State of the United States:\n\nThe undersigned, citizens of the United States and of French-Canadian nationality, respectfully represent, as they are credibly informed and verify believe:\n\nThat Louis David Riel is, and was at the time of his trial, a naturalized citizen of the United States, and had for many years and up to the time of the troubles in which he became involved in Canada, resided at Montana, in the United States, where he was engaged as a teacher;\nThat whilst residing there he was prevailed upon to go to Canada to intercede for the oppressed inhabitants of the Canadian northwest territory;\nThat while residing temporarily there he was arraigned and indicted for high treason against Her Majesty the Queen of England;\nThat during the month of July last he was put upon his trial, which resulted in his conviction and sentence of death;\nThat, as your petitioners are credibly informed, his trial was not only not impartial, but that he was deprived of giving evidence which might have shown him entirely innocent of the offense of which he was accused;\nThat under the then existing political excitement in Canada, resulting in a measure from questions bearing upon the rights of the people for whom he was contending, he was deprived of the means of making his best defense, and that his trial was unfair, partial, and unjust;\nThat, as your petitioners are advised and believe, the court before whom he was tried was without jurisdiction, and that his conviction was unsupported by the evidence and contrary to law.\nYour petitioners therefore ask such interposition on the part of the United States Government as may seem reasonable and just for the relief and protection of one of its adopted citizens, now languishing under the sentence of death by a foreign court.\n\nRochester, N. Y., August 29, 1885.\n\nA. E. MANSEAU,\nPIERRE GAGNIER,\nLOUIS G. LA FONTAINE,\nand sixty-six others.\n\n[Inclosure 2.]\n\nCopy of the naturalization certificate of Louis David Riel.\n\nIn the United States district court of the third judicial district of the Territory of Montana.\n\nPresent, Hon. D. S. Wade, judge.\n\nIn the matter of the application of Louis David Riel, an alien, to become a citizen of the United States of America.\n\nIn open court, March term, A. D. 1883, this 16th day of March, A. D. 1883, as yet of said term.\n\nIt appearing to the satisfaction of this court, by the oaths of E. L. Merrill and Lem Jerome, citizens of the United States of America, witnesses for that purpose, first duly sworn and examined, that Louis David Riel, a native of Canada, has resided within the limits and under the jurisdiction of the United States five years at least, last past, and within the Territory of Montana for one year last past; and that during all of said five years' time he has behaved as a man of good moral character, attached to the principles of the Constitution of the United States, and well disposed to the good order and happiness of the same; and it also appearing to the court, by competent evidence, that the said applicant has heretofore, and more than two years since, and in due form of law, declared his intention to become a citizen of the United States: and having now here, before this court, taken an oath that he will support the Constitution of the United States of America, and that he doth absolutely and entirely renounce and abjure all allegiance and fidelity to every foreign prince, potentate, state, or sovereignty whatever, and particularly to Victoria, Queen of Great Britain, it is therefore ordered, adjudged, and decreed, that the said Louis David Riel be, and he is hereby, admitted and declared to be a citizen of the United States of America.\n\nD. S. WADE,\nJudge.\n\nSignature: LOUIS DAVID RIEL.\n\nOffice of the clerk of the United States district court of the third judicial district of the Territory of Montana, ss:\n\nI, B. H. Tatem, clerk of the United States district court of the third judicial district of the Territory of Montana, said court being a court of record having common law jurisdiction and a clerk and seal, do certify that the above is a true copy of the\nact of naturalization of Louis David Riel, as the same appears upon the records of said court now in my office.\n\nIn testimony whereof, I have hereunto set my hand and affixed the seal of said court this 27th day of July, in the year of our Lord one thousand eight hundred and eighty-five and in the year of our Independence the 109th.\n\nB. H. TATEM, Clerk.\nC. G. REYNOLDS, Deputy Clerk.\n\nNo. 7.\n\nMr. Bayard to Mr. A. Choquet.\n\nDEPARTMENT OF STATE,\nWashington, October 27, 1885.\n\nSir: Your letter of the 23d instant was duly received, as well as that of the 15th instant, in regard to the intervention of this Government in favor of Louis David Riel, under sentence of death at Regina, in Canada.\n\nI need not assure you that the petition of certain American citizens of French origin, which accompanied your first letter, received such careful attention as the importance of the subject required.\n\nThe friends of Riel had already made personal application at this Department to know how far the United States Government could properly interfere with the execution of the sentence of the Canadian court. They received a full verbal reply, which took into consideration Riel's alleged American citizenship. Such citizenship, however, it must be remarked, even if beyond doubt, would not secure the possessor any immunity from Canadian law, when, as it is definitely certified to this Government in the case in the present instance, the offense was committed within the territory of the Dominion.\n\nIt shall always be my first duty to see that the rights and liberties of American citizens are jealously guarded, and that they receive such treatment at the hands of foreign governments as our treaties, international law, and the claims of humanity require.\n\nI am, sir, your obedient servant,\n\nT. F. BAYARD.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001824.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 18268, "total-output-tokens": 9558, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2093, 1], [2093, 4597, 2], [4597, 8015, 3], [8015, 12658, 4], [12658, 16093, 5], [16093, 19738, 6], [19738, 24717, 7], [24717, 30103, 8], [30103, 34470, 9], [34470, 36778, 10], [36778, 40422, 11], [40422, 42224, 12], [42224, 42224, 13]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false]}}]