[{"id": "0348d4008575a0abf0bfafb3ab702f1df1442c96", "text": "DISCOURS\n\nPRONONCÉ PAR\n\nMONSIEUR F. X. LEMIEUX M.P.P.,\n\nDÉPUTÉ DE LÉVIS\n\nÀ\n\nL'ASSEMBLEE LEGISLATIVE DE QUÉBEC\n\nLE\n\n30 AVRIL 1886\n\nSur la question Riel\n\nQUÉBEC\nIMPRIMERIE DE LA JUSTICE\n1886\nDISCOURS\n\nDE\n\nM. F. X. LEMIEUX, M.P.P.\n\nPrononcé le 30 avril à l'Assemblée Législative\n\nSUR LA QUESTION RIEL.\n\nM. L'ORATEUR,\n\nLa question qui est maintenant devant le fauteuil mérite d'être discutée devant ce corps législatif. Et j'aime à joindre ma voix à celle des députés de cette chambre, qui se sont faits les fidèles interprètes des justes sentiments d'indignation et de réprobation, éprouvés et manifestés par la presque unanimité des citoyens de la province de Québec, depuis le 16 novembre dernier, jour où un drame sanglant s'est déroulé dans les immenses prairies du Nord-Ouest, jour où le sang de l'infortuné Louis Riel, qui avait été coupable du grand crime d'avoir trop aimé son pays, a rougi le gibet de Régina (très bien).\n\nIl est inutile de se le dissimuler, le 16 novembre fut un jour de deuil et de tristesse nationale ; un long cri d'effroi fut poussé par nos populations, car il semblait qu'on avait piqué au vif dans nos sentiments et qu'on avait touché brutalement à nos cœurs.\n\nLe soir du 16 novembre, et les jours qui l'ont suivi, les citoyens bien pensants ne se contentaient pas d'exprimer de simples regrets au sujet de la pendaison de Riel. Non, à cette époque, tous, le député comme l'électeur, le journaliste comme son abonné, le riche comme le pauvre, le grand comme le petit élevaient conjointement et bien fort, leur voix pour protester contre le crime judiciaire commis à Régina. Et la voix haute mais solennelle du peuple se faisait entendre pour dénoncer l'atrocité commis aux droits des nations. Oui, tous d'un commun accord, nous nous sommes faits les dénonciateurs d'un acte de barbarie et de cruauté sans précédent dans l'histoire des peuples civilisés.\n\nDepuis ce temps, nous avons bien vu des âmes timorées, nous avons bien entendu des voix timides, et disons-le, il y a eu des déceptions.\nQui, des hommes de talents remarquables, qui devaient avoir du cœur, et dont la plume et la parole pouvaient être d'un si grand secours à leurs compatriotes, ont, je ne dirai pas, trahi, mais abandonné le mouvement national qu'ils avaient commencé et encouragé. Et depuis, ces hommes se sont donnés la mission d'être alarmistes, d'effrayer le sens populaire, de tromper nos populations et de les empêcher d'être occupées, fermes et unies au moment où un ennemi commun, l'orangisme, est à nos portes. Si ces hommes sont réellement coupables, le jour de la rétribution n'est pas éloigné, car la main de la Providence des peuples, s'appasant de temps à autre, d'une manière bien lourde, sur ceux qui font le triste métier de tromper et d'égarer les consciences publiques (M. Marchand, oui, ils seront châtiés).\n\nMais pourquoi toutes ces manifestations populaires, telles que nous n'en avions jamais vues depuis 1837, jours de tribulations nationales pour les Canadiens-français, mais jours glorieux, puisque alors a été consigné l'octroi de nos libertés, civiles et religieuses, politiques et constitutionnelles ?\n\nPourquoi ces démonstrations si unanimes et si spontanées de tout un peuple, pour un homme qui lui était presque inconnu ? Pourquoi la charité publique s'exerce-t-elle en faveur de la femme d'un homme trouvé coupable de haute trahison ? Pourquoi nos églises et nos temples s'emplissent-ils de fidèles qui viennent offrir au ciel une dernière prière pour un homme qui a subi la peine capitale, qui est monté au bout d'une corde ?\n\nCet homme était-il digne de nos sympathies, était-il un héros ? Avait-il défendu une cause quelconque, et cette cause était-elle belle, grande, patriotique et nationale ? Et nous, mandataires des citoyens de la province de Québec, avons nous droit, dans cette assemblée parlementaire, de continuer le mouvement commencé par le peuple, et de dire que le sang qui a coulé sur l'échafaud de Régina a été versé pour satisfaire une rancune et une vengeance quelconque ?\n\nPour répondre à toutes ces questions, je crois être obligé de jeter un rapide coup-d'œil sur les événements des quinze dernières années et dans le Nord-Ouest et dans le Manitoba.\n\nL'idée qui a présidé à l'entrée dans la Puissance du Canada, des territoires du Manitoba et du Nord-Ouest, en 1869-1870, a été une idée de persécution et de destruction contre l'élément métis et catholique dans ces territoires. Et depuis ce jour, la politique de presque tous nos gouvernements a été une politique de provocations constantes et continues contre les propriétaires naturels du sol.\n\nEn effet le gouvernement de 1870 a pris possession des immenses territoires du Manitoba, sans aucun droit et sans aucune autorité, ni décret législatif quelconque, et avant qu'aucun traité n'ait été signé à cet effet par les parties intéressées. \"C'est une maxime de notre constitution,\" disait un grand homme d'État, que la maison de tout sujet anglais est sa forteresse, protégée qu'elle est, non par des remparts et des créneaux, mais par la majesté de la loi.\nLe plus pauvre des citoyens peut, dans sa chaumière, défier les forces de la Couronne, quelque humble qu'elle soit, elle peut trembler aux souffle des vents, l'orage, la pluie peuvent y entrer, le Roi ne peut pas ; et sa toute-puissance doit expirer et s'évanouir devant l'humble castel.\" Le juge, le roi doivent s'arrêter devant le seuil de la maison du plus pauvre homme ; mais le gouvernement de notre pays, au mépris de toutes les lois, s'empare de territoires considérables et soumet, sans les consulter, des milliers de citoyens à des lois à eux inconnues.\n\nCette cruelle politique ne fut pas oubliée, et a toujours été la cause d'un grand malaise.\n\nÀ l'appui de ce que j'avance, j'aimerais à citer l'opinion de l'illustre archevêque de St-Boniface telle qu'exprimée dans une brochure publiée en 1874, mais l'opinion de ce grand prélat pourrait paraître partielle aux yeux de quelques-uns vu que le vieux missionnaire a toujours été considéré comme le constant et généreux défenseur des pauvres métis. L'opinion de ce digne homme fait pourtant autorité pour moi, mais je citerai, pour faire plaisir aux plus exigeants, un ouvrage publié par un homme dont la langue n'est pas la nôtre et dont les croyances religieuses nous sont aussi étrangères. [V. Leggo, History of the administration of the Earl of Dufferin in Canada.]\n\n\"On the 29th September, 1869, a Commission passed under the great seal of Canada appointing the Hon. Wm. McDougall, C.B., to be Lieutenant-Gouvernor of the North West Territories, the appointment to take effect on the transfer. In October, he set out for Red River, having with him several gentlemen ready to receive some of the highest offices under the new Government.\n\n\"While on his way, the indignation of the people of Red River burst forth. It is an almost incredible fact that all these proceedings had been taken to transfer twelve thousand intelligent and comparatively wealthy people from one Government to another without the slightest communication with them. None of them had been consulted. They had been treated with contempt. The author of the transfer looked upon them as so many sheep who had neither feelings to be hurt, nor interest to be respected. A Government had been framed for them by the Dominion Act of May, of which they knew nothing until they saw it noticed in the public prints. A Governor had been appointed for them without the slightest intimation to them; he was on his way to assume their rule; surrendered by officers whose seats in and about the Provincial Cabinet and Courts had already, as they believed, been settled upon.\n\nA system of Government had been established for them, in the formation of which they had been denied all voice, and surveyors had invaded their country sent by a power really as alien to them in this respect as the American Government would have been.\n\n\"Mr. McDougall arrived on the frontier on the 30th October, but nine days before, a barrier had been raised across the road leading to\nWinnipeg by a party of armed men headed by Riel. This man was and then for some time after cordially supported by the great mass of the people. The English and Scotch Half-breeds joined with the French \"Metis\" in their determination not to permit Mr. McDougall to enter the country until their rights were secured. All creeds and all classes, excepting a few of the pure white population, were loud in their denunciation of what they declared to be the tyrannical conduct of the Dominion Government, of which Mr. McDougall was the exponent. Had this gentleman even now, when the country was full of armed men, determined to defend their rights by force, understood the real state of the public mind, the difficulty might have been overcome, for even Riel did not then desire to oppose the authority of the Crown. His opposition was confined to the arbitrary proceedings of the Dominion Government, but as Mr. McDougall attempted to raise an armed force among the people by which to crush the opposition, he really added strength to his enemies. Riel and his associates up to this point were unquestionably in the right, and had Mr. McDougall candidly admitted his error, it is more than probable that the wretched North West troubles of 1870 would never have arisen.\" (Ecoutez, écoutez).\n\nCette politique de spoliation de nos gouvernements de 1869-1870, fut secondée et encouragée par une horde et bande de fanatiques de la province voisine, qui avaient envahi le Manitoba et qui s'y étaient installés non pas avec l'idée d'y vivre comme des citoyens paisibles et respectables, mais avec une idée d'hostilité et d'agression. En effet, ils se constituèrent les insulteurs les provocateurs constants de l'élément français et catholique. De ce moment, le métis ne fut plus libre chez lui; il n'avait plus le loisir de passer dans la rue publique, sans être méprisé; la femme, le vieillard étaient insultés, et l'on se rappelle les assauts meurtriers, commis sur les citoyens paisibles, par ces gens au nombre desquels était le fameux Scott, dont le fanatisme était de la fureurs.\n\nJe dis que ce ne serait qu'à tire d'ailè que je passerais sur ces événements.\n\nOn se rappelle la formation du gouvernement provisoire dont l'autorité fut plus tard reconnue par le gouvernement fédéral; je ne mentionnerai pas l'exécution trop malheureuse de Scott; nous avons encore présent à la mémoire le célèbre débat sur l'amnistie et le décret du parlement fédéral, qui avait ordonné le bannissement de Riel, et la privation pour toujours des droits politiques de cet homme qui était le chef de la nation métisse.\n\nCe n'est pas par respect pour ce décret législatif, que Riél quitta son pays, mais bien par obéissance à la voix si pleine d'autorité de l'illustre archevêque de St-Boniface, ce boulevard de l'élément catholique et français dans le Manitoba et le Nord-Ouest, oui, par obéissance à la voix de ce saint homme qui le priait de partir, vu que son départ pouvait peut-être ramener le calme dans les esprits et la tranquillité dans le pays. (Applaudissements à la gauche).\nRiel partit, mais ce ne fut pas sans douleur, car il avait du cœur, il aimait son pays, il aimait ceux dont il était le chef, le soutien, le protecteur et le talisman national. Il partit l’âme et le cœur brûlés par le chagrin, il en sortit à Riel de laisser ses vieux amis, son village natal, sa vieille mère et tout ce qu’il avait aimé jusqu’alors. L’horizon qui s’offrait à lui était un horizon bien triste, et les pays vers lesquels il se dirigeait étaient des pays inconnus, et il partait victime d’une vengeance, d’une persécution, et désigné aux balles de ses ennemis.\n\nOn m’accusera peut-être d’employer des termes un peu sympathiques pour celui dont j’ai été constaté indignement l’humble défenseur, mais vous reconnaissiez, M. l’Orateur, les liaisons qui s’établissent entre l’avocat et le client ; je suis peut-être plus avocat que député, et c’est pour cela que, ayant vu de près cet homme qui a tant souffert, je me suis identifié avec sa cause que j’ai épousée avec toute l’ardeur dont j’étais capable. (Très bien).\n\nOù trouve-t-on Riel ? Il avait longtemps pleuré, il avait souffert, il avait été persécuté et il n’était pas surprenant que son cerveau ait été affaibli et détraqué, et de le voir dans un asile d’aliénés. C’est à la Longue-Pointe, à Montréal, que l’on retrouve l’ancien chef des métis, où il est retenu dix-huit mois, comme fou furieux ; il en sort pour être interné de nouveau dans l’asile de Beauport, où pendant deux ans, il est soigné et traité comme un véritable aliéné. Riel retourne aux États-Unis et de nouveau, il a pour refuge un asile d’aliénés à Washington, où il subit des traitements pendant l’espace de dix-huit mois.\n\nNe suivons pas Riel partout, mais où était-il au printemps de 1884 ? Dans l’état de Montana, exerçant les simples fonctions d’instituteur, et y vivant paisiblement avec sa femme et ses enfants.\n\nMais que s’était-il passé dans le Manitoba et dans le Nord-Ouest, pendant que l’ancien chef d’une nation avait été errant de pays en pays, trouvant à peine un asile pour pouvoir reposer sa tête ? De graves événements, qui appartiennent maintenant au domaine de l’histoire, s’étaient déroulés. Les métis avaient souffert, et dans leurs souffrances ils avaient été patients, ils avaient longtemps prié, sollicité, tourmenté les autorités fédérales d’apporter un remède quelconque à leur position, à leur situation politique, mais leurs demandes avaient été écartées et méprisées et l’on était resté sourd à leurs légitimes prières.\n\nTous se rappellent ce ministre coupable qui se prit à dormir et à ronfler au moment où une députation d’hommes importants faisaient valoir auprès de lui les griefs et les droits de la population métisse, (honte, honte).\n\nPétitions sur pétitions, requêtes sur requêtes avaient été adressées à nos gouvernants et, les unes après les autres, avaient pris le chemin du panier.\n\nQuels étaient les droits des métis ?\n\nJe ne puis en faire un meilleur exposé qu’en citant les paroles d’un vieux missionnaire, d’un homme capable de dire la vérité que bien des gens n’aiment pas à entendre, d’un homme au-dessus de tous les gou-\nvemants, d'un homme dont le courage et la vertu sont au-dessus de tout éloge et qui depuis trente ans enseigne dans les lointaines prairies du Nord-Ouest, aux métis et aux sauvages, qu'il y a un Dieu à aimer et à adorer ; voici ce que dit le bon père André dans ce document écrit par lui et que je tiens maintenant dans ma main :\n\n\"La population du Nord-Ouest, sans distinction de religion et de nationalité, et je puis le dire avec, l'affirmer, en toute vérité, que dans le procès de Riel vous avez mis le doigt sur la plaie en représentant le système anormal qui nous gouvernait dans le Nord-Ouest ; blancs et métis s'accordaient à demander la cessation de ce système et à nous donner un régime qui nous donna les privilèges du gouvernement constitutionnel. Il est temps qu'il finisse, le système qui a produit de grands malheurs et qui est de nature à en produire de plus grands dans l'avenir, si on n'y porte remède. C'est cette centralisation à Ottawa qui a produit la rébellion du Nord-Ouest.\n\n\"Si nous avions eu un gouvernement responsable dans le Nord-Ouest, avec autorité et pouvoir de remédier aux griefs dont les métis se plaignaient depuis si longtemps, pensez-vous que nous eussions eu la rébellion dont nous déplorons tous les suites funestes ? Les demandes des métis étaient bien simples et raisonnables ; ils demandaient reconnaissance : 1° de leurs terres qu'ils occupaient sans être obligés de payer pour leur préemption ; 2° ils demandaient le privilège, comme aborigènes, d'avoir du foin et du bois pour leurs besoins sans payer aucune taxe à la Couronne ; 3° ils demandaient d'avoir leurs terres divisées en lots de rivières de 26 chaînes de front sur 2 milles de long ; 4° ils demandaient d'avoir une école industrielle dans chaque grand centre de métis, entretenue par le gouvernement, pour initier leurs enfants aux connaissances nécessaires à leur situation ; 5° ils demandaient du secours pour aider les métis pauvres à s'établir sur des terres, comme une paire de bœufs, une charrue et herse, la semence pour 3 ans. Le conseil du Nord-Ouest, avait joint ses instances à celle des métis, mais sans résultat ; 6° ils demandaient des scapis pour les métis du Nord-Ouest qui n'avaient pas reçu leur part des terres accordées par l'acte de Manitoba ; 7° ils demandaient que le gouvernement, dans la distribution des emplois dans le Nord-Ouest, eût plus d'égards à accorder aux métis les emplois qui convenaient à leurs aptitudes comme agents et fermiers pour les sauvages ; 8° ils demandaient que vu le grand nombre des métis français répandus sur les territoires du Nord-Ouest, tous les employés publics fussent obligés de connaître le français avant d'être employés par le gouvernement ; 9° avec tous les blancs, ils demandaient des représentants dans la chambre des communes à Ottawa, et un gouvernement représentatif et responsable dans le Nord-Ouest.\n\n\"Pétitions sur pétitions, lettres sur lettres, sur les questions importantes, ont été adressées à Ottawa par les personnes influentes du Nord-Ouest et en état d'apprécier les besoins du pays ; mais le gouvernement fermait l'oreille à toutes représentations et soulevait l'indignation...\"\ngnation par son obstination et son refus à accorder les plus justes\ndemandes, et quand il a fait droit à quelques-unes de ces demandes\nce n’est que comme dominé par la peur et effrayé des conséquences\nterribles de sa négligence, qu’il a ouvert les yeux et qu’il s’est rappelé\nqu’il y avait une population métisse dans le Nord-Ouest qui demandait\njustice.” — (M. Mercier : Ah ! ils aimeront mieux croire les orangistes.)\n\nIl n’y a pas que le saint missionnaire qui se soit prononcé ainsi sur\nles justes réclamations de ces populations ignorées et oubliées : le Mail\nde Toronto, l’organe officiel du gouvernement, et surtout de Sir John\nA. MacDonald, a admis les justes réclamations de ceux dont Riel devait\nêtre encore une fois le guide et le chef. La Minerve, encore un journal\nofficiel, s’exprime ainsi :\n\n“Certes, nous blâmons les hommes qui suivent Riel et qui menacent\nde sortir des voies légales et constitutionnelles. Mais encore, doit-on\ntenir compte des impatiences, des aigreurs de ces pauvres gens,\ndepuis si longtemps négligés, oubliés, méprisés, bafoués. Le\ndépartement de l’Intérieur l’ont ils relèvent, a beau dire, c’est lui qui\nest la cause de ces perturbations. Il ne dépendait que de lui,\nque toutes ces difficultés fussent réglées depuis longtemps. Il\na préféré traiter les métis en parias, leur préférant même les Mennonites,\nà eux, premiers colons du pays. Que le département de l’Intérieur\nporte la responsabilité de ses actes !”\n\nEt un autre journal dont l’importance ne peut pas être niée, le Manitoban\nde St-Boniface, écrivait ce qui suit :\n\n“Quand un gouvernement s’est rendu coupable de la négligence qui\na eu lieu dans le Nord-Ouest, au sujet du règlement de la question des\ndroits des métis, ce gouvernement a perdu le droit d’être sévère : la\nclémence est le seul moyen de réparer ses fautes et de rétablir la confiance.\n\nLa commission nommée pour régler les réclamations des métis, a\nconstaté la justesse de près de 2,000 réclamations qui étaient négligées.\nComment, en face d’un pareil résultat, les autorités pourront-elles se\ncroire justifiables d’user de rigueur !”\n\nDans cette triste position, le souvenir du passé se présenta à l’esprit\ndes métis, qui dirigèrent leurs regards vers celui qui, depuis dix ans,\nétait séparé d’eux, mais qui pendant tout ce temps n’en était pas moins\nresté leur chef. Car il ne faut pas l’oublier, depuis 1874, Riel, bien que\néloigné de ses compatriotes, était considéré par eux comme ayant été\nleur ancien sauveur, et jamais on n’oubliait de mentionner avec enthousiasme\nson nom dans les grandes réunions publiques, lors des fêtes\nnationales dans le Manitoba et le Nord-Ouest. Alors les métis comme\nles anciens Romains qui au temps où la France était en danger allèrent\nchercher le vieux Cincinnatus à sa charue, partirent en députation et se\nrendirent au Montana, où Riel vivait avec sa femme et ses deux enfants\net dont l’humble fonction était celle d’être l’instructeur de petits enfants.\net le prièrent de venir sur les bords de la Saskatchewan pour aider et soulager un peuple qu'il avait aidé et soulagé dix ans auparavant sur les bords de la rivière Rouge.\n\nRiel accéda à la demande de ses compatriotes et l'agitation qui se fit dans le Nord-Ouest depuis le mois de juin 1884, jusqu'en janvier 1885, fut une agitation purement politique et constitutionnelle. Pendant tout ce temps, les métis dirigés par Riel, se réunissaient en assemblée publique pour discuter, comme la chose se fait dans tous les pays où la liberté de la parole est reconnue, les meilleurs moyens à adopter pour faire avancer leur cause et reconnaître leurs droits. Des enquêtes furent préparées et désignées par les évêques, les prêtres et les missionnaires, et les hommes les plus renseignés sur la condition du pays et adressés aux autorités fédérales, mais ces dernières ne répondaient pas, ou ne donnaient que des réponses évasives.\n\nLes agents, les employés du gouvernement, par leur conduite indigne, leur précaution et leurs refus constants de rendre justice aux métis et aux sauvages, furent pour beaucoup la cause de l'excitation des esprits à la fin de l'année 1885 ; on disait au métis que le gouvernement répondrait à leurs requêtes en envoyant un plus grand nombre d'hommes de la police montée, pour les tenir en respect. Et les paroles malheureuses du fameux Lawrence Clarke, à St-Antoine, le jour de la St-Joseph, fête presque nationale des Métis, lorsqu'il disait que le major Crozier, s'avancait à la tête de au-delà de 200 hommes pour faire Riel et les autres chefs métis prisonniers, furent le premier signal de la rébellion.\n\nLes métis naturellement militaires, s'organisèrent par bandes, et ils allèrent à la rencontre du major Crozier, à qui ils firent défense de s'aventurer sur leurs réserves et leurs propriétés. Le major Crozier, se moqua de leurs sommations et il crut que, une balle suffirait pour faire prendre la fuite à des gens qui étaient braves, qui avaient du courage et du cœur. Il se trompa, car il fut obligé de fuir, laissant derrière lui ses morts.\n\nCette première victoire des métis, fut peut-être un malheur pour eux, car elle les engagea à tenir plus ferme l'étendard de la révolte. Un deuxième avantage les attendait à l'Anse aux Poissons, où ils firent la rencontre du général Middleton, à la tête d'un grand nombre de combattants, bien aguerris et pourvus de canons et de munitions. Enfin nous devions être enfin témoins de la plus grande farce militaire de notre siècle : pendant quatre jours, une poignée d'hommes dont la plupart n'avaient pas d'armes et qui pour faire balles, se servaient de cailloux de la plaine, résistèrent au commandant en chef des troupes du Nord-Ouest, qui avait sous ses ordres 1500 soldats lesquels promenèrent sur un parcours de 20 milles dans les environs de Batoche, l'incendie, la ruine et le pillage.\n\nAu milieu du combat une correspondance fut échangée entre le général Middleton et Riel ; ce dernier comprenant que c'en était fini de ses hommes épuisés, connaissant les excès auxquels s'étaient portés les soldats du gouvernement, sachant que la vie des femmes et des\nenfants métis étaient en danger, écrivit au commandant en chef, une note par laquelle il le priait de ne pas tirer sur un certain établissement dans lequel étaient réunies les femmes et les enfants des métis.\n\nLe général eut l'humanité d'accéder à cette demande et c'est alors qu'il écrivit à Riel un billet dont je tiens en ma main l'original, dans lequel il lui disait : que s'il se rendait avec son conseil, il les prendrait sous sa protection jusqu'à ce que le gouvernement fédéral décidât de leur sort. Ceci établit au moins la présomption que Riel s'est constitué plus tard prisonnier. Riel, en effet, lorsqu'il fut arrêté par les Scouts de Middleton, se dirigeait vers le champ de bataille de ce dernier.\n\nOn a accusé Riel d'avoir été lâche, parce qu'il s'était rendu et qu'il n'avait pas, comme Dumont, dépassé les lignes américaines et cherché un refuge aux États-Unis. J'aurais aimé, M. l'Orateur, que vous et tous mes honorables collègues auriez entendu les paroles si touchantes et si éloquentes, dont Riel se servait pour répondre à ces reproches : \"Je me suis rendu, disait-il, pour arrêter le carnage et pour sauver la vie des femmes et des enfants métis, car je savais que les soldats du général en chef étaient avides de sang ; j'aurais bien pu m'exempter d'être fait prisonnier d'État ; j'aurais bien pu ne pas traîner à mes pieds le boulet qu'on y a attaché ; j'aurais bien pu ne pas subir un procès pour haute trahison, et surtout j'aurais bien pu ne pas monter sur l'échafaud hideux que l'on ne manquera pas d'ériger pour moi. Mais si je dois mourir, j'aurai au moins avant de partir de ce monde, une suprême consolation, c'est que j'ai été fidèle à mes compatriotes, et que les femmes que j'ai sauvées prieront le bon Dieu pour moi, et que mon nom aura une place dans le cœur des enfants métis qui vivront pour me venger.\" (Bravo, applaudissements dans les galeries. Vive sensation dans la chambre).\n\nLe procès de Riel devait commencer et s'instruire devant le magistrat stipendiaire Richardson. Il a été dit que ce juge avait été nommé par les libéraux. Qu'il ait été nommé par les libéraux ou par les conservateurs, cela importe peu. Ce dont il s'agit, c'est de savoir et de connaître si ce procès a été légal, juste et équitable.\n\nIl a été dit de plus que ce procès avait été fait en vertu de lois passées par l'administration libérale de l'hon. M. McKenzie, c'est une erreur. Si Riel avait subi son procès en vertu du statut de 1875, il aurait dû être jugé par une cour présidée par un juge de la cour du banc de la Reine de Manitoba, assisté d'un magistrat stipendiaire, tandis que par la loi de 1880, faite par le gouvernement de Sir John A. Macdonald, la cause devait s'instruire devant un simple magistrat stipendiaire, assisté d'un juge de Paix.\n\nSi le procès eût eu lieu en vertu de la loi de 1875, les jurés auraient été au nombre de huit, tandis qu'en vertu de l'acte 1880, ils n'ont été que six.\n\nLe magistrat stipendiaire Richardson n'avait pas à mon sens, ni l'expérience, ni la compétence pour juger et entendre une cause de cette importance, et je pourrais citer à l'appui de ce que j'avance la correspondance remarquable publiée dans le Monde, par laquelle on ridiculise.\nLa présence de cet homme au tribunal de Régina. Il n'avait été qu'un simple subalterne dans le département de la justice à Ottawa, et lors de sa nomination, la population dans le Nord-Ouest était peu considérable et les affaires judiciaires qu'ils était appelé à juger étaient peu importantes.\n\nLe procès a-t-il été juste et légal ? Strictement parlant, il a, peut-être, été légal. Mais juste, jamais. D'après la loi de 1880, le magistrat stipendiaire a le droit, même dans le cas de haute trahison de choisir lui-même les membres du jury, et d'après cette loi, ces derniers n'ont besoin d'aucune qualification. Le juge peut prendre le premier venu dans la rue, l'étranger, l'aubain, comme l'habitant du pays. Le jury était composé de gens qui ne partageaient pas les croyances religieuses de Riel et qui n'appartaient pas à sa nationalité. Était-ce légal ? Oui. Était-ce juste ? Non, car les juges naturels de Riel devaient être au moins en partie des catholiques, des Canadiens ou des Métis. Pourquoi cette exclusion du jury des coréligionnaires et des compatriotes de Riel ? Il y avait pourtant un bon nombre de Canadiens français dans les environs de Régina et à Régina même, et les métis se comptaient par milliers, et les catholiques étaient aussi très nombreux. Pas un seul n'avait été assigné pour participer à ce grand drame judiciaire. Je me trompe, un catholique faisait partie du jury, mais lorsque l'appel de son nom fut fait, les avocats de la Couronne, moins un, mirent tous tant d'empressement à le récuser que l'un de nous ne put s'empêcher de s'écrier : \"No Irish catholic need apply here.\"\n\nSi le procès d'un orangiste, accusé de haute trahison se faisait dans la province de Québec, et que tout membre de sa nationalité et de sa croyance religieuse fut exclu du jury, ces fanatiques ne crieraient-ils pas de suite à l'infamie ? Et nous Canadiens-français et catholiques, nous aurions vu le sang d'un des nôtres couler inutilement sur un échafaud, sans pouvoir faire entendre de justes protestations. Il n'y avait aucun décorum dans la Cour. On n'avait pas même songé à se procurer des interprètes pour traduire les témoignages français en anglais, et comme on peut le constater, dans le livre bleu publié par le gouvernement, on fut obligé de changer, dans le cours du procès, quatre fois les interprètes, à tel point qu'une des séances de la Cour fut levée, parce que les témoignages français ne pouvaient plus être traduits en anglais d'une manière décente.\n\nMais quelle justice pouvait-on attendre dans ce débat judiciaire, après qu'un des ministres de la Couronne eut cherché à préjuger l'opinion publique par une lettre inqualifiable, écrite par lui, en réponse aux vives sollicitations de certains Canadiens des États-Unis qui avaient imploré la clémence de l'Exécutif en faveur de l'infortuné Riel, lettre publiée avec le consentement de ce ministre et dans laquelle Riel était représenté sous les plus noires couleurs ? La plus simple convenance devait imposer silence à ce ministre de la Couronne, lorsque cette dernière devait être la partie poursuivante dans la cause de Riel. Pareille indignité ne se trouve pas dans les annales judiciaires et parlementaires. (Honte-Honte).\nDeux questions se sont soulevées au procès : 1° La question de la constitutionnalité du tribunal et 2° la folie de Riel. Une troisième question aurait pu se présenter : les causes de la rébellion et sa justification, si toutefois, en loi, une rébellion peut-être justifiable ; mais ce dernier moyen de défense fut promptement écarté par la poursuite et par le magistrat Richardson, lui refusa la production de tous les papiers trouvés sur Riel, lorsqu'il fut fait prisonnier à Batoche, et de tous les documents publics, pétitions, requêtes, etc., etc., produits au département de la Justice et de l'Intérieur, à Ottawa, et en la possession des ministres fédéraux.\n\nLa question de la constitutionnalité du tribunal a été discutée dans la presse et par des hommes éminents des barreaux de Québec, d'Ontario et du Manitoba. Sur cette question, nous n'avons pas profité seulement des conseils d'avocats appartenant au parti libéral, mais nous avons eu les avis et les conseils d'hommes de loi les mieux posés dans le parti conservateur. Et un grand nombre d'hommes distingués s'accordaient à dire que le tribunal de Régina, n'avait pas juridiction dans la matière.\n\nNéanmoins les différentes juridictions par lesquelles nous avons passé se sont prononcées contre nous et nous avons dû nous soumettre avec respect à leurs décisions.\n\nLa question dominante du procès, qui devait prévaloir en faveur de l'accusé, fut donc le plaidoyer de folie. Riel était-il fou et quel était le caractère de sa folie ? Riel n'était pas un dément, ni un idiot, ni un fou, d'après le sens vulgaire de ce mot. Riel était un maniaque, un monomane ; sa maladie mentale était celle connue en médecine sous le nom de mégalomanie.\n\nIl y avait deux hommes dans Riel ; à côté d'une brillante intelligence, d'un esprit éclairé, d'une grande éloquence, il y avait le maniaque qui sur certains sujets ne pouvait pas raisonner, et qui était irresponsable de ses actes, lorsqu'il agissait en rapport avec certaines questions, telle que la politique et la religion.\n\nLe plaidoyer de folie est un de ces plaidoyers dont on a souvent abusé dans les cours de la justice, dans les cas désespérés. Mais dans l'affaire Riel, ce plaidoyer était non seulement vraisemblable, mais encore vrai, et a été appuyé par des médecins experts et par des témoins et des personnes dont les témoignages ne pouvaient pas être mis en doute.\n\nIl y avait au moins une forte présomption que Riel fut fou. Dans le cas de maladies mentales, les mêmes causes produisent généralement les mêmes effets. Or, en 1874, Riel était devenu fou à la suite de grandes excitations et de grandes souffrances morales, sa maladie mentale consistait alors dans des illusions et hallucinations, il se croyait prophète, appelé à devenir roi, voulait établir une nouvelle religion. Cette maladie prenait quelquefois un caractère tellement développé que Riel devenait fou furieux. Pendant l'espace de dix ans, il avait été interné trois fois dans des asiles d'aliénés, et chaque fois les symptômes caractéristiques de la mégalomanie aiguë se manifestaient chez lui. Les aliénistes et auteurs qui ont traité de la médecine légale s'accordent à dire\nque l'individu qui est frappé d'une telle maladie, n'est pas responsable des actes qu'il fait en rapport avec les sujets qui sont l'objet de sa folie.\n\nMalgré tous ces antécédents de Riel et de l'abondance de preuves on n'a pas réussi à porter la conviction dans l'esprit des jurés de Régina. Si une semblable cause se présentait devant aucun tribunal à Ontario ou à Québec, et que telle preuve de folie fut faite dans de semblables circonstances, qui peut douter pour un instant que l'accusé n'échappe pas à la rigueur de la loi et ne serait pas acquitté ? Si Riel était devenu fou en 1874, à la suite de grands troubles et d'une grande excitation, et à la suite d'une rébellion, était-il surprenant de présumer et de croire qu'il fut de nouveau devenu fou, à la fin de l'année 1884, ou au commencement de l'année 1885, puisqu'alors il avait passé par les mêmes circonstances que celles de 1874 ? Au procès, des témoins oculaires et auriculaires de la conduite, des paroles, des actes de Riel, ont juré positivement qu'à cette époque Riel était fou.\n\nDes missionnaires catholiques, qui l'avaient vu, qui l'avaient entendu, et qui par là même avaient été en état de pouvoir apprécier son état mental, ont déclaré sous serment, de la manière la plus positive, qu'à cette époque, Riel était privé de ses facultés mentales surtout lorsqu'il parlait de politique et de religion, ou lorsqu'il agissait en rapport avec ces sujets. Deux témoins experts, le Dr Roy, de Québec, qui avait connu Riel à l'asile de Beauport, a découvert chez ce dernier, lors du procès, les mêmes signes d'aliénation mentale que ceux de 1876. Le Dr Clarke, de Toronto, un aliéniste distingué, a parlé dans le même sens.\n\nCette preuve n'a pas été détruite et ne pouvait pas être détruite, et la Couronne s'est contentée de produire des témoins qui déclarèrent ne pas s'être aperçus que Riel était fou, pour la bonne raison qu'ils n'avaient jamais parlé ou causé avec lui, sur les sujets sur lesquels son cerveau était détéquillé. Cependant, ce plaidoyer de folie, aussi fortement soutenu par une preuve irréfutable, fut écarté par le verdict du jury. Mais je le demande de nouveau à tous mes honorables collègues, de vouloir me dire, la main sur la conscience et sur le cœur, si un tel plaidoyer de folie fait dans nos cours de justice, dans notre province, ne serait pas maintenu par le verdict de douze jurés, auxquels serait soumis une accusation quelconque contre un criminel.\n\nOn ne fut pas aussi sévère, ni aussi exigeant dans la cause de Jackson, le secrétaire de Riel qui fut acquitté pour cause de folie, qui fut loin d'être établie comme celle de Riel, par les Pères André et Fourmond, témoins si dignes de respect. Mais voyez-vous, Jackson, portait un nom anglais, il n'était pas catholique. Et chose assez curieuse, ce même Jackson qui fut interné dans un asile d'aliénés, trouva quelques mois après, la facilité de pouvoir s'échapper de cette maison de santé; et maintenant, il parcourt les États-Unis, donnant des lectures intéressantes sur les événements du Nord-Ouest, démontrant par là qu'il n'était pas fou et qu'il ne l'avait pas été.\n\nRiel fut donc condamné ! Le verdict de culpabilité rapporté contre\nlui fut accompagné d'une recommandation à la miséricorde du tribunal et de l'exécution. La sentence de mort fut prononcée par le magistrat. Richardson, qui fut assez impitoyable pour dire à Riel que, en effet, les jurés l'avaient recommandé à sa miséricorde, mais qu'il ne devait rien attendre des hommes, et qu'il devait se préparer à mourir.\n\nC'était bien là le langage qu'on devait trouver dans la bouche d'un juge, qui ne tient pas son office durant bonne conduite, comme les juges dans la province de Québec, mais suivant le bon plaisir, c'est-à-dire suivant les caprices des autorités fédérales ! Ce langage était bien naturel à cette créature du gouvernement, dont l'un des ministres avait déjà déclaré publiquement et avant le procès, que Riel n'était pas digne des sympathies des canadiens-français et des catholiques !\n\nRiel fut donc condamné à mort ! Et de ce moment une grande commotion se fit sentir dans tout le pays, et particulièrement dans la province de Québec, parce que les gens bien pensants croyaient que la cause que Riel avait servie était une cause nationale, et que la condamnation à mort de ce chef de tout un peuple était injuste. Les citoyens de la province de Québec, élevèrent la voix pour implorer la miséricorde de nos gouvernants, mais la voix de tout un peuple qui criait pitié, ne se rendit pas au cœur des ministres, ces derniers fermèrent l'oreille et restèrent sourds aux protestations parties de toutes parts. Elle est pourtant grande et solennelle la voix émue de tout un peuple qui demande et prie au nom de la justice, que le sang ne coule pas inutilement, que l'échafaud ne s'érige pas et qu'on ne donne pas une victime au fanatisme. Cette voix du peuple qui est la voix de Dieu, vox populi, vox Dei, devait s'élever dans le désert, et Riel fut sacrifié et dut mourir tel qu'il l'avait promis, avec la foi du martyr et le courage du héros. Il dut mourir, pauvre et délaissé, n'ayant plus rien, pas même son cœur \"qu'il avait déjà depuis longtemps donné à son pays\" il dut mourir, éloigné des siens, de sa vieille mère, séparé de son épouse et privé des tendres baisers de ses chers enfants. (Très bien, très bien).\n\nLe peuple de la province de Québec s'est naturellement ému, un mouvement national s'est formé, et il s'agit de savoir M. l'orateur, si nous les mandataires de la province de Québec, nous avons droit de continuer dans cette enceinte parlementaire le mouvement national, commencé par le peuple ; et de plus si nous avons le pouvoir d'exprimer des regrets au sujet de la pendaison de Riel, et si nous devons blâmer les autorités fédérales pour avoir sacrifié Louis Riel, au fanatisme orangiste. (Une voix : C'est là la question).\n\nL'honorable sollicitateur général nous a dit que la question avait été jugée par les deux autorités qui pouvaient la juger, par l'autorité judiciaire de Régina, et par l'autorité parlementaire d'Ottawa, que le parlement de cette province n'avait pas pouvoir de s'occuper de cette affaire, qu'il y avait chose jugée, et que par conséquent, ce jugement devait avoir le respect que l'on doit à la chose jugée. Mais je soumets M. l'Orateur, que cette chose jugée n'a pas été exécutée comme elle a été jugée. Le jugement dans la cause de Riel était un verdict de coupable\navec recommandation à la miséricorde de la cour, et partant de l'exécution.\nOr, il n'y a qu'une partie du verdict qui a été exécutée et l'autre partie\na été méconnue. Si les jurés, qui étaient les juges de Riel, ont pu sous\nserment recommander ce dernier à la miséricorde de la cour et de l'exécu-\ntion, il nous faut une explication pour connaître pourquoi cette partie\ndu verdict n'a pas été exécutée. Or, cette explication n'a pas été\ndonnée.\n\nIl n'y a pas que des citoyens de ce pays qui ont demandé l'exécu-\ntion de la chose jugée ; mais encore les voix les plus autorisées tant en\nFrance, en Italie, en Espagne, en Angleterre qu'aux États-Unis, se sont\nfait entendre et ont prié les autorités fédérales d'exercer leur clémence\net leur miséricorde en faveur de Riel, comme les jurés sous serment\nl'avaient demandé.\n\nNous avons des précédents qui permettent notre intervention en\npareille cas. N'avons nous pas le précédent de 1874, établi par l'Hon.\nM. Chapleau, défenseur de Lépine, et alors ministre de la couronne et\net aussi par l'Hon. M. Ross, alors conseiller législatif et maintenant\nPremier ministre de la province de Québec ? Ces deux hommes politi-\nques firent adopter unanimement par le parlement de la province de\nQuébec des résolutions par lesquelles on priait le gouvernement fédéral\nde ne pas exécuter la sentence de mort prononcé contre Lépine, et tout\ncela, disait-on, dans le but de rétablir la paix publique dans le pays.\nMais l'on, Solliciteur général a soutenu que nous avions bien le droit\nde prier, mais non le droit de reprocher et de blâmer. (Rires). Voilà une\ndoctrine pour le moins curieuse, car le droit de prier comporte bien sou-\nvent le droit de reprocher. Lorsqu'on demandait en 1874 la commu-\ntation de la sentence portée contre Lépine, ce n'était pas une simple\nprière, mais encore un reproche. Car pourquoi demandait-on la com-\nmutation de cette sentence ? Parce qu'alors, comme dans le cas de Riel,\non voyait dans Lépine une victime, on comprenait que le verdict du jury\nde Manitoba avait été dicté par le fanatisme ; on croyait que, dans la\ncause de Lépine comme dans le cas de Riel, justice n'avait pas été\nrendue.\n\nCette prière comportait un blâme, un reproche, on disait ni plus ni\nmoins : \" Ne pendez pas Lépine, parce que ce serait injuste et cruel \";\net aujourd'hui les mêmes hommes, MM. Ross et Chapleau, nous disent\nà dix années d'intervalle à peu près : \" Vous n'avez pas droit d'exprimer\ndes regrets \". (Très bien.)\n\nSi nous avions droit de prier, comme Parlement, comme ministres,\ncomme députés ou comme citoyens que Riel ne fût pas pendu, pourquoi\nles ministres de la province de Québec, n'ont-ils pas avant la réunion\ndes chambres et avant la pendaison de Riel, prié le gouvernement de\nne pas exécuter cet homme ? \" Nous ne l'avons pas fait, ajouteron\nceux qui siègent sur les banquettes ministérielles, parce que nous ne\ndevons pas intervenir dans le domaine fédéral.\" Mais l'intervention\nfédérale ne se manifeste-t-elle pas tous les jours dans les affaires locales ?\nN'est-il pas connu publiquement que les ministres fédéraux font le beau\ntemps et le mauvais temps dans nos affaires locales, et qu'ils n'ont besoin que de cligner de l'œil pour faire tourner et retourner les ministres locaux ? L'hon. Solliciteur Général, nous a dit que le parlement Anglais avait avec hésitation, adopté en 1861 des résolutions de condoléance pour la famille du président Lincoln qui était tombé sous les balles de Booth, je n'ai pas référé à ce précédent, mais, tout ce que je sais, c'est que nous n'avons pas hésité ici, dans ce parlement Provincial, de faire un article d'un document ministériel, et d'insérer un paragraphe dans le discours du Trône de 1882, par lequel on exprimait des regrets à l'occasion de la mort du président Garfield, qui lui aussi était tombé sous la balle d'un assassin, et voici quel était ce paragraphe du discours du Trône en 1882 : \"La république voisine a été moins heureuse, et je dois exprimer à l'occasion du crime qui a fait disparaître de ce monde un grand citoyen le président des États-Unis, des condoléances d'autant plus vives, que nos relations avec ce pays, ont été des plus amicales.\" Les mêmes condoléances, ne les exprimons-nous pas lorsque quelque malheur vient frapper la famille royale ou la mère patrie ?\n\nMais M. l'Orateur, se contenterait-on de prier, si le parlement fédéral voulait déclarer l'Union Législative, si on voulait abolir notre langue ou enlever à nos autorités provinciales, les pouvoirs qu'elles ont en vertu de l'acte d'Amérique Britannique du Nord ?\n\nSi un pareil cas se présentait, quel est celui qui mettrait en doute notre droit d'élever la voix dans cette enceinte parlementaire et de protester de la manière la plus vigoureuse contre de pareils attentats ?\n\nJe me demande M. l'Orateur, si le parti libéral eût été au pouvoir, l'hon. Solliciteur Général, serait-il aussi scrupuleux, serait-il partisan aussi dévoué de la non intervention ? Non, en 1874, c'étaient les libéraux qui tenaient le pouvoir à Ottawa, et on pouvait alors intervenir, maintenant ce sont les conservateurs qui siègent sur les banquettes ministérielles et pour sauver et blanchir les ministres fédéraux, il faut absolument devenir partisans de la non intervention. (Très bien; approbation)\n\nCette intervention nous est imposé par une raison nationale et si nous avons une raison nationale, nous avons droit de soutenir la proposition de l'honorable député de Québec ; car nous formons une \"Assemblée nationale,\" qualification donnée à notre chambre par le Solliciteur général lorsqu'il parlait des résolutions adoptées par ce Parlement pour féliciter l'hon. M. Gladstone sur sa politique concernant l'Irlande.\n\nOui, il s'agissait, en prevenant la mort Riél, de prévenir surtout la victoire et le triomphe d'une secte fanatique, ennemie de l'ordre dans la société, ennemie de la nationalité canadienne française et de tout ce qui porte un nom catholique, (vifs applaudissements). Laisser pendre Riél, c'était donner de la force et du courage aux orangistes, à ces gens détestés et détestables non seulement pour nous Canadiens-français, mais pour tous les loyaux sujets de Sa Majesté, car depuis la bataille de la Boyne, ils ont toujours été une cause de troubles constants dans l'Empire\nBritannique. Jamais leur société n’a été reconnue par une loi et ils ont même été répudiés par les autorités royales.\n\nOn se rappelle en effet qu’en 1861, le Prince de Galles, lors de son voyage au Canada, refusa de recevoir leurs hommages et de passer sous une arche de triomphe élevée à Toronto, en son honneur, et sur lequel se trouvaient hissées les couleurs orangistes ; c’étaient ces hommes qui, en 1837, assistés des bureaucrates, tenaient sous leurs talons notre nationalité ; c’étaient encore eux qui en 1849 venaient, poussés par la vengeance, brûler les bâtisses du parlement à Montréal ; c’étaient ces dignes partisans de Sir John A. Macdonald qui incendiaient les maisons de Blake, de Baldwin et Lafontaine parce que ces patriotes distingués, avaient eu le courage, malgré toutes sortes de menaces, de faire adopter le bill de l’indemnité ; ce sont ces mêmes hommes qui à cette époque, assaillaient le représentant de la Reine Victoria, au Canada, Lord Elgin qui avait eu la grandeur d’âme de sanctionner le même bill de l’indemnité ; ce sont ceux-là qui à Winnipeg en juillet dernier, faisaient passer le glorieux général Middleton, sous un drapeau représentant Riel à genoux, une corde au cou. (Honte, honte). Voilà les ennemis qu’il s’agissait de combattre, et que les ministres actuels n’ont pas voulu et ne veulent pas encore combattre. Riel a été sacrifié à leur rage, des cris de joie sont partis de toutes les loges orangistes après que Riel eut monté les gradins de l’échafaud, à Régina. De ce moment des promesses furent faites à Sir John qu’il pouvait compter sur ces fanatisques, lors des prochaines élections. Riel a donc été une victime, une victime sanglante ; c’est pour calmer et flatter une partie infâme de l’électorat, que Sir John et ses collègues ont décidé l’exécution de Riel, qui ne pouvait pas avoir lieu sans qu’un ordre en conseil fut passé. Mais malheur au gouvernement d’un pays qui sacrifie le sang humain pour satisfaire une politique odieuse, et comme l’a dit un grand penseur : “Quand un pouvoir enjambe ne fut-ce qu’un cadavre pour monter au Trône, ce pouvoir est maudit. Sacer esto. La victime est tombée, et sur la place du sacrifice, une main invisible a mis une croix noire pour la marquer. La terre a bu le sang, mais le sang fermenté dans l’ombre, et un jour, le passant entend sortir de terre d’abord un faible soupir ; le passant marche toujours, ensuite un léger murmure ; le passant marche encore, enfin un cri terrible, comme un coup de tonnerre, et le passant voit sortirdu sol le spectre d’une nouvelle révolution.” (Applaudissements prolongés-Bravos.)\n\nIl n’y a pas eu en Canada de révolution, mais un mouvement national, grand, unanime et enthousiaste, comme notre pays n’en avait pas vu depuis 1837. On a qualifié ce mouvement national de feu de paille, c’est une erreur ; au contraire, c’est un immense incendie et un brasier ardent, entretenu par la chaleur du sentiment populaire, et à la lueur de cet incendie, on pourra longtemps reconnaître ceux qu’on a justement qualifiés de Pendarcs, reconnaître les ministres prévaricateurs et leurs dignes et tristes acolytes. (Très bien, très bien).\nL'hon. Solliciteur Général nous a dit que ce mouvement national était fait dans un but politique ; mais quels sont donc ceux qui ont parti ce mouvement ? Ce sont des conservateurs comme des libéraux, des conservateurs indépendants, respectés et respectables, et jouant dans leur parti un rôle important. Quels sont ceux qui ont proposé la motion de regrets et les résolutions blâmant les ministres fédéraux ? L'honorable député du comté de Québec, appuyé par l'hon. député d'Hochelega, deux conservateurs, l'un ayant été ministre, et l'autre Président de cette chambre. L'honorable député des Trois-Rivières, est-il un de ceux qui appartiennent vraiment au parti libéral ?\n\nJe trouve dans les paroles de l'hon. Solliciteur général une contradiction flagrante. Il nous a dit que ce mouvement était un mouvement politique fait par les libéraux, et cependant il nous a cité une partie du discours éloquent prononcé à Londres, par le chef des libéraux dans la puissance du Canada, qui disait : \"Je ne veux pas arriver au pouvoir, au moyen d'un échafaud, et je ne veux pas ouvrir les portes de l'avenir avec une clef maculée de sang.\" Si l'hon. M. Blake a déclaré qu'il n'entendait pas monter au pouvoir au moyen d'un échafaud et qu'il ne voulait pas ouvrir les portes de l'avenir avec une clef maculée de sang, comment pouvez-vous prêter aux libéraux l'intention de faire de la question de Riel une question de politique ? (Applaudissement). Puis, ne se rappelle-t-on pas la démarche faite par l'hon. chef de l'opposition de cette province auprès de l'hon. M. Ghapleau, lorsqu'il le sollicita de bien vouloir se mettre à la tête du mouvement national et qu'il était prêt à lui céder le pas ? N'est-ce pas là un signe manifeste, une preuve évidente du désintérêt de l'hon. M. Mercier ? (Oui, oui).\n\nL'honorable Solliciteur général, nous a dit qu'un certain nombre de conservateurs avaient été séduits par ce mouvement national. Cette séduction est grande, elle est belle, comme elle est naturelle ! Ce n'est pas un grand crime de céder quelquefois à son cœur. S'ils ont succombé à la séduction, ils ont cédé devant un sentiment de pitié et de miséricorde, devant un sentiment généreux et patriotique. (Très bien).\n\nÀ ces conditions, ce n'est pas un crime d'être séducteurs ou d'être séduits. Plaise au ciel que toutes les séductions politiques s'accomplissent dans des circonstances semblables, car on se rappelle tous que, il y a quelques années, un certain nombre de politiciens de cette province ont été séduits, ont succombé à la tentation, mais devant des sentiments moins généreux que ceux auxquels ont cédé nombre de conservateurs, sur la question Riel ! (Vires approbations, rires).\n\nComment avons-nous pu séduire les conservateurs ? Quel moyen de séduction avons-nous, pour leur faire abandonner leurs chefs qu'ils avaient suivis dans la bonne comme dans la mauvaise fortune ? Avions-nous des faveurs et des avantages à leur promettre ? Non, la seule promesse qui nous pouvions faire, c'était de marcher avec eux la main dans la main, le cœur près du cœur ; le seul engagement que nous pouvions prendre, c'était de flageller et de mépriser les noms de ceux qui avaient\nérigé le gibet de Régina. Et les conservateurs qui sont entrés dans le mouvement national ont droit non seulement à nos félicitations et à la reconnaissance des citoyens de la province de Québec, mais ils ont droit à la reconnaissance de l'histoire.\n\nNous avons passé par une circonstance triste et lugubre ; ces événements étaient pleins de deuil, mais au moins, ils nous ont donné l'occasion de constater qu'il y avait parmi les Canadiens-Français des hommes généreux et de véritables patriotes. Ce sont des hommes de cette nature qu'il nous faut dans les grands événements de la vie des peuples, de ces hommes qui ont l'esprit de l'indépendance, et au cœur desquels l'éca de la corruption ne peut pas se coller. Et en terminant, je me servirai des paroles remarquables de Crémazie :\n\n\"Que Dieu veuille nous donner comme à nos pères, dans ce siècle d'abaissement, avec les sentiments sublimes de l'honneur, l'exaltation du dévouement, la folie du sacrifice, qui font les héros et les saints.\" (Bravos-applaudissements prolongés et repétés. On fait ovation à M. Lemieux. L'hon. M. Mercier et tous les membres de l'opposition félicitent vivement M. Lemieux.)", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001485.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 30578, "total-output-tokens": 15413, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 189, 1], [189, 189, 2], [189, 2022, 3], [2022, 5070, 4], [5070, 8054, 5], [8054, 11118, 6], [11118, 14227, 7], [14227, 17394, 8], [17394, 20354, 9], [20354, 23490, 10], [23490, 26702, 11], [26702, 29909, 12], [29909, 33072, 13], [33072, 36264, 14], [36264, 39519, 15], [39519, 42614, 16], [42614, 45794, 17], [45794, 48953, 18], [48953, 52126, 19], [52126, 53284, 20]], "primary_language": ["fr", "None", "fr", "fr", "en", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]