[{"id": "5ef441d918a1081d9c25f936d6749bb7e1f4a3d6", "text": "RIEL\n\nDRAME HISTORIQUE\n\nEN\n\nQUATRE ACTES ET UN PROLOGUE\n\nCINQ TABLEAUX\n\nPAR\n\nCH. BAYER ET E. PARAGE\n\nMONTREAL\n\nIMPRIMERIE DE \"LE TENDARD\", 37 RUE SAINT-JACQUES\n\n1886\n\nReproduction et traduction réservées\nHOMMAGE\n\nÀ LA\n\nMÉMOIRE DE LOUIS RIEL.\n\nO mon Dieu, s'il faut encore des victimes, prénez-moi pour le salut de mon peuple.\n\nCHATEAUBRIAND.—Les Martyrs, L: III.\nRIEL\nDRAME HISTORIQUE\n\nEN\n\nQUATRE ACTES ET UN PROLOGUE\n\nCINQ TABLEAUX\n\nPAR\n\nCH. BAYÈR ET E. PARAGE\n\nMONTRÉAL\nIMPRIMERIE DE \"L'ETENDARD\", 37 RUE SAINT-JACQUES\n\n1886\n\nReproduction et traduction réservées\nRIEL\nEPISODE DE L'INSURRECTION MÉTISSE\nDrame Historique en quatre Actes et un Prologue.\n\nPROLOGUE:\n1er TABLEAU...........Le Fort Prince de Galles au Nord-Ouest en 1873.\n\nLE RAPT.\n\n1er ACTE.\n\n2me TABLEAU...Le Camp des Pieds-Noirs au Lac-aux-Canards en 1885.\n\nL'INSURRECTION.\n\n2me ACTE.\n\n3me TABLEAU................................................La Bataille de Batoche.\n\nLA TRAHISON.\n\n3me ACTE.\n\n4me TABLEAU................................................La Prison de Régina.\n\nUN MARTYR.\n\n4me ACTE.\n\n5me TABLEAU................................................La Tribu des Pieds-Noirs.\n\nLA JUSTICE DE DIEU.\nPERSONNAGES DU DRAME.\n\nLOUIS RIEL ........................................... Chef de l'insurrection.\nGEO. MACKNAYE ...................................... Commissaire du Gouvernement.\nGEO. FRANCETTE ..................................... Journaliste Américain.\nGABRIEL DUMONT ...................................... Lieutenant de Riel.\nABRAHAM .................................................. Colporteur Juif.\nSTEWARD .................................................. Journaliste Anglais.\nL'ESPRIT ERRANT ....................................... Chef Indien.\nLA NUÉE ORAGEUSE .................................... Chef Indien.\nNOLLIN .................................................... Secrétaire de Riel.\nLE LIEUTENANT RICHARDSON ......................... Parlementaire du Général Midleton.\nUN SOLDAT ................................................ De service au Fort Prince de Galles.\nLE SHÉRIF CHAPLEAU .................................. De la Prison de Régina.\nLE BOURREAU .............................................. Personnage muet.\nELISABETH MACKNAYE ................................ Femme du Commissaire du Gouvernement.\nNELLY ....................................................... Sa fille, enfant de cinq ans.\nKAIRA ....................................................... La même, douze ans plus tard.\nTAKOUAGA ................................................ Nourrice de Nelly.\n\nGUERRIERS Peaux-Rouges et Mélis—TRAPPEURS—SOLDATS ANGLAIS, etc.\n\nLa scène se passe au Nord-Ouest.\nRIEL\n\nDRAME HISTORIQUE EN QUATRE ACTES ET UN PROLOGUE\n\nCINQ TABLEAUX\n\nPREMIER TABLEAU.\n\nPROLOGUE.\n\nLE FORT PRINCE DE GALLES.\n\nLE RAPT.\n\nLa scène représente un salon du Fort ; des panoplies, des fourrures, des cornes d'orignal, tapissent les murailles. Porte au fond ; à droite deux portes donnant accès aux chambres à coucher d'Elisabeth et de Takouaga ; à gauche, au fond, une fenêtre et sur le premier plan, une petite porte de sortie. Il fait nuit.\n\nSCÈNE I.\n\nELISABETH\n\n(En peignoir blanc et à demi-couchée sur un divan. Un cri lugubre et prolongé se fait entendre au loin.)\n\nELISABETH (tressaillant.)\n\nToujours ce cri lugubre qui me glace le sang et me met la mort dans l'âme !... Voilà bientôt un mois qu'il trouble le silence des nuits !... De quel malheur est-il le funèbre présage ?...... Quel le jour tardé à...\nparaître !... (Après un soupir.) Allons, essayons de dormir... Les songes affreux, qui troublent mon sommeil, valent encore mieux que des réalités... (Cri lugubre au loin.) Encore? ah! j'en deviendrai folle! (Nouveau cri prolongé.) Ce cri l... toujours ce cri l... (Elle se lève effrayée.) Ne serait-ce pas le cri de ralliement des Indiens?... des Pieds Noirs, dont le Gouvernement vient d'acheter le territoire à la Compagnie de la Baie d'Hudson?... J'en ai comme un pressentiment. Pourquoi le Gouvernement veut-il s'obstiner à demeurer sourd à leurs plaintes?... Pourquoi vouloir leur enlever cette terre où ils sont nés et où dorment leurs ancêtres l... Quelle terrible vengeance ces guerriers méditent-ils contre-nous?... Peut-être qu'à cette heure ils se préparent à attaquer le Fort, à nous massacrer sans pitié...... et ma fille l... (Elle tombe à genoux.) Seigneur! si ce malheur doit arriver, prenez ma vie, mais épargnez les jours de mon enfant! (Nouveau cri lugubre.) Ah! à moi.\n\nSCÈNE II.\n\nTAKOUAGA, ELISABETH.\n\nTAKOUAGA (entrant précipitamment.)\n\nLa maîtresse a appelé à son secours?... qu'y a-t-il?... quel danger la menace?\n\nELISABETH (se remettant de sa frayeur.)\n\nRien, Takouaga,... un rêve, un rêve affreux... j'ai eu peur... ces rêves sont absurdes.\n\nTAKOUAGA.\n\nLe Grand-Esprit se sert souvent des rêves pour parler aux hommes.\n\nELISABETH.\n\nSuperstitieuse! Quelle heure est-il?\n\nTAKOUAGA.\n\nTrois fois déjà l'oiseau qui annonce le lever du soleil a fait entendre son chant.\n\nELISABETH.\n\nOuvre ces rideaux (Takouaga obéit.) Maintenant, va me chercher ma fille... (Takouaga sort. Il fait jour.)\nRIEL.\n\nSCÈNE III.\n\nELISABETH\n\n(Va à la fenêtre et regarde dans la plaine d'un air anxieux.)\n\nIl fait jour enfin !... Quelle affreuse nuit !... Rien !... Rien sur la plaine,... nulle trace d'Indiens aux alentours !... Je me suis effrayée sans raison... Non ! pourtant... Ce cri lugubre, qui résonne encore à mon oreille... La lumière du jour me donne du courage... Comme la nature est belle, éclairée aux premiers feux du soleil !... Comme tout est calme et tranquille dans cette riante vallée... et cependant mon cœur bat plus fort qu'à l'ordinaire... Pourquoi donc ? (Apercevant sa fille.) Ah ! ma fille !\n\nSCÈNE IV.\n\nELISABETH, NELLY, TAKOUAGA.\n\n(Nelly est entrée avec sa nourrice, elle se jette au cou de sa mère.)\n\nNELLY.\n\nBonjour, maman !\n\nELISABETH.\n\nBonjour, Nelly.—As-tu bien dormi, ma chérie.\n\nNELLY.\n\nOh ! oui, maman !... J'ai fait un rêve... Oh ! un rêve !... Un beau rêve !\n\nELISABETH.\n\nVoyons, conte-moi cela.\n\nNELLY.\n\nJ'ai rêvé que tu étais au ciel, là-haut, bien haut, bien haut !... assise auprès du bon Dieu. Tu avais une belle robe blanche, mais là, belle, belle !... Tu me souriais et tu m'envoyais des baisers, comme ça, tiens !... (Elle envoie des baisers.)\n\nELISABETH (à part).\n\nCiel ! serait-ce un avertissement ?... Allons, décidément, cette superstieuse Takouaga m'a troublé l'esprit.\n\nNELLY.\n\nMaman, quand est-ce que papa va revenir ?... Voilà déjà bien longtemps qu'il est parti.\nPROLOGUE.\n\nELISABETH.\n\nTu sais bien que ton père est allé à Ottawa, où l'appelaient les devoirs de sa charge.\n\nNELLY.\n\nQuelle charge, maman?\n\nELISABETH.\n\nCelle de gouverneur du Fort. C'est bien loin d'ici, Ottawa ; mais je pense qu'il reviendra bientôt.\n\nNELLY.\n\nMais, pourquoi papa a-t-il été si loin?\n\nELISABETH.\n\nMa chère petite, je te dirai cela plus tard.\n\nNELLY.\n\nNon, non, tout de suite.\n\nELISABETH.\n\nTu ne comprendrais pas.\n\nNELLY.\n\nSi, si, je veux, moi ; pourquoi faire?\n\nELISABETH.\n\nEh ! bien, ma chérie, il est allé exposer au gouvernement les souffrances des Indiens et des Métis ; il est allé là-bas parler de leur misère, démontrer la nécessité qu'il y a de venir en aide à tous ces pauvres gens qui meurent de froid et de faim...\n\nNELLY.\n\nAh!\n\nELISABETH.\n\nEt qui ont des petites filles, comme toi, qui pleurent et qui sont malheureuses. Ces pauvres Indiens, tous ces Métis ont été chassés de leurs terres, où il y avait du gibier en abondance... Ici, ils ne peuvent plus rien trouver, et les voilà sans ressources et sans pain... On entend un bruit de pas; Elisabeth aperçoit Macknave.\nRIEL\n\nSCÈNE V.\n\nLES MÊMES, MACKNAVE.\n\nMACKNAVE\n\n(C'est entré par le fond; il a écouté les dernières paroles d'Elisabeth.)\nVous êtes en veine de sensiblerie, à ce qu'il paraît.\n\nNELLY (courant à son père).\nPapa!... (Macknave l'enlève brusquement, l'embrasse et la pose à terre.\nNelly, effrayée, se réfugie auprès de sa mère.\n\nELISABETH.\n(faisant un mouvement vers lui.)\nToi, mon ami, que je suis heureuse de te revoir!... as-tu réussi dans ta démarche auprès du gouvernement?\n\nMACKNAVE.\nAu-delà de mes espérances; seulement pas dans le sens que tu crois.\n\nELISABETH.\nEt comment?\n\nMACKNAVE.\nCette race rouge est maudite... Rebelle à toute civilisation, son amour de la liberté l'empêche d'accepter aucune loi. Elle est un danger permanent pour la société. C'est une race condamnée à disparaître.\n\nELISABETH.\nQue dis-tu?\n\nMACKNAVE.\nEn exagérant la situation, j'ai montré au gouvernement ces Indiens, les armes à la main, prêts à se ruer sur nous, à promener la torche incendiaire dans nos champs, à suspendre à leurs ceintures le scalpe sanglant de nos colons.\n\nELISABETH.\nComment?... Mais cela est faux!\n\nMACKNAVE.\nQu'importe!... Enfin, j'ai obtenu carte blanche, liberté pleine et entière pour traiter ces misérables comme ils le méritent.\nPROLOGUE.\n\nELISABETH.\n\nEt que comptes-tu faire ?\n\nMACKNAVE.\n\nCe que je compte faire?... C'est bien simple : établir de larges impositions de fourrures... les affamer pour les forcer à acheter dans nos comptoirs à des prix fabuleux un peu de lard pourri, qui les empêchera de mourir de faim. Vous voyez, Milady, les immenses bénéfices que je retire de ma politique.\n\nELISABETH, (supplante).\n\nAh ! George, ayez pitié de ces pauvres gens, qui sont nos frères.\n\nMACKNAVE.\n\nEux ?... des chiens !\n\nELISABETH.\n\nGeorge, Dieu nous punira.\n\nMACKNAVE, (ricanant).\n\nIl nous en saura gré, au contraire.\n\nTAKOUAGA, (intervenant.)\n\nLa maîtresse a raison, Le maître a déjà commencé à attirer sur lui la colère du Grand Esprit... qu'il prenne garde !\n\nMACKNAVE, (avec colère).\n\nHolà ! vieille sorcière, que veux-tu dire?... Parle ou gare le fouet.\n\nTAKOUAGA.\n\nTakouaga ne craint ni le fouet, ni la colère du maître ; s'il lui plaisait que sa langue restât muette, le fouet du maître ne la forcerait pas à parler...\n\nMACKNAVE, (à part.)\n\nElle me cache quelque chose...\n\nTAKOUAGA.\n\nMais (se reprenant) je n'ai rien à vous dire.\nRIEL.\n\nMACKNAVE, (haut.)\nJ'ai été trop vif, Takouaga ; parle, que sais-tu ?\n\nTAKOUAGA.\nEh bien, depuis deux lunes, mes frères, les Indiens Pieds Noirs, se réunissent sur la montagne des Pins ; ils attendent le retour du maître en chantant leurs chants guerriers. Des nouvelles que tu leur apportes dépend le paix ou la guerre.\n\nMACKNAVE, (vivement).\nComment sais-tu cela ?\n\nTAKOUAGA.\nPar mon fils, l'Esprit Errant.\n\nMACKNAVE.\nVa dire à ton fils, pour qu'il le répète à sa tribu, que le gouverneur Macknavé méprise les Peaux-Rouges et les Sang-Mêlés ; que tous ces chiens réunis ne l'effrayeront pas avec leurs aboiements.\n\nTAKOUAGA.\nLe maître ne tiendrait pas un pareil langage, s'il savait le nom de celui qui protège mes frères, de celui qui est appelé à les conduire dans le sentier de la guerre.\n\nMACKNAVE, (ironiquement).\nEt quel est donc ce terrible guerrier ?\n\nTAKOUAGA, (avec emphase).\nLouis Riel !\n\nMACKNAVE.\nAh ! tant mieux ; c'est l'enfer qui me l'envoie. Cette fois, je le tiens, malheur à lui !\n\nELISABETH.\nQue t'a fait cet homme, George ?\n\nMACKNAVE.\nRien !... je le hais ; voilà tout.\nPROLOGUE.\n\nELISABETH.\n\nPour haïr, il faut une raison, et si tu n'en as pas, je ne puis te comprendre.\n\nMACKNAYE.\n\nEh ! bien, oui ; c'est vrai, j'en ai une.\n\nELISABETH.\n\nEt laquelle ?\n\nMACKNAYE.\n\nAh !... c'est toute une histoire... Ecoute et juge ! c'était en 1849, mon père se trouvait alors commissaire de la baie d'Hudson, à l'époque où il était défendu aux métis et aux sauvages, sous les peines les plus sévères, de tuer des bêtes à fourrure sur toute l'étendue de l'immense territoire de la compagnie, à laquelle appartenait le gibier. Or, les Métis Français, au mépris de cette défense, chassaient et vendaient pour leur compte. Un jour, un Métis Français, Guillaume Sawer, fut pris et traduit devant mon père, qui exerçait le droit de justice. Onze Métis, ayant à leur tête le père de Riel, envahirent le tribunal, et déclarant illégale cette arrestation, délivrèrent Sawer. Riel obligea mon père à lui rendre son butin et ses armes qui avaient été confisqués, et déclara qu'à l'avenir les Métis français se considéraient comme affranchis de la domination de la baie d'Hudson.\n\nPendant cette tirade, Elisabeth est allée s'asseoir sur un fauteuil.\n\nELISABETH.\n\nEt que fit votre père, George ?\n\nMACKNAYE.\n\nMon père fut destitué. Impuissant devant un pareil adversaire, il tomba en disgrâce et reçut son congé. Nous étions ruinés... ma famille vint habiter Terrebonne; mon pays de naissance... vous le savez.\n\nELISABETH.\n\nJe le sais.\n\nMACKNAYE.\n\nAu collège de Montréal, ou l'on m'envoya à l'âge de douze ans, je rencontrai Louis Riel, le fils de notre ennemi. Je lui vouais d'instinct la haine que mon père avait voué au sien. Un jour, nous nous trou-\nRIEL.\n\nvions dans une réunion d'amis, d'étudiants. Nous discutions sur l'avenir du Nord-Ouest. J'en vins à dire que le gouvernement devrait traiter sans pitié cette race de bandits et de voleurs, peaux-rouges et sang-mêlés. Riel s'élança sur moi et me frappa au visage... je voulus riposter... on nous sépara. Je quittai la ville... voilà dix ans de cela. Riel ? je ne l'ai pas revu, mais ma haine a grandi par l'attente. Aujourd'hui, il se trouve sur ma route, à la tête de ces rebelles... malheur à lui !... ma vengeance ne sera satisfaite que le jour où je l'aurai attaché moi-même à la potence qui l'attend. (Entre un soldat de la police montée.) Qu'est-ce ?\n\nSCÈNE IV.\n\nLes mêmes, LE SOLDAT.\n\nLE SOLDAT.\n\nUn chef métis et un guerrier Indien demandent à parler à votre honneur.\n\nMACKNAVE.\n\nLeurs noms ?\n\nLE SOLDAT.\n\nLouis Riel et l'Esprit Errant.\n\nMACKNAVE.\n\nLui !\n\nTAKOUAGA.\n\nMon fils !\n\nMACKNAVE.\n\n— Introduisez-les dans cette pièce... Ah !... faites fermer la porte du Fort : que personne ne puisse entrer ni sortir de l'enceinte. (Le soldat sort, suivi de l'enfant ; à Takouaga.) Vous, rentrez-là. (Il lui montre la chambre, où Takouaga se retire ; à part.) Et pour plus de sûreté... (Il l'enferme.) Mais assurons-nous si mes ordres sont exécutés. (À Elisabeth.) Venez, madame.\n\nELISABETH.\n\nOù est Nelly ?\n\nMACKNAVE.\n\nSans doute dans la grande cour, où nous la rencontrerons. Venez !\nSCÈNE VII.\n\nNELLY, RIEL, L'ESPRIT ERRANT.\n\nNELLY (entre suivie de Riel et de l'Esprit Errant):\nSoyez le bienvenu, M. Riel ; asseyez-vous là. (Elle lui indique un siège.)\n\nRIEL:\n(s'assied et prend l'enfant).\nTu sais mon nom, mon enfant ?\n\nNELLY:\nJ'ai entendu le soldat le dire à papa et alors je suis vite accourue au-devant de vous.\n\nRIEL:\nTu avais donc déjà entendu parler de moi ?\n\nNELLY:\nOh ! oui ; nourrice me parle souvent de vous ; elle me fait dire tous les soirs votre nom dans mes prières,\n\nRIEL:\nQui est ta nourrice ?\n\nNELLY:\nTakouaga.\n\nL'ESPRIT ERRANT:\nMa mère !\n\nRIEL:\nAh ! (Il serre la main de l'Indien. À Nelly): Et toi, comment t'appelles-tu ?\n\nNELLY:\nNelly.\n\nRIEL:\nChère Nelly, les prières sorties de ta bouche vont droit au ciel. Prie tous les jours pour moi, et afin de ne pas l'oublier, accepte ce petit souvenir d'un homme qui t'aime bien. (Il lui passe au cou une petite croix d'or et l'embrasse.)\nRIEL.\n\nNELLY.\n\nMerci, Monsieur Riel !... Maintenant je vais retrouver nourrice.\n(Elle saute à bas des genoux de Riel et va pour ouvrir la porte.)\nTiens, la porte est fermée !... Voulez-vous me l'ouvrir ? L'infini va ouvrir. Sort Takouaga.)\n\nSCÈNE XIII.\n\nL'ESPRIT ERRANT, TAKOUAGA, RIEL, NELLY.\n\nL'ESPRIT ERRANT.\n\nMa mère !\n\nTAKOUAGA.\n\nMon fils ! (Ils se jettent dans les bras l'un de l'autre). Silence !... Le temps est précieux. Ecoute ! (à Riel) Un danger vous menace, frère. Le gouverneur, après m'avoir enfermée, pour que je ne puisse vous avertir, est allé donner l'ordre de vous retenir prisonnier au fort.\n\nRIEL.\n\nPrisonnier ?\n\nTAKOUAGA.\n\nOui !\n\nRIEL.\n\nQue faire ?\n\nTAKOUAGA.\n\nEcoutez !... cette fenêtre est peu élevée du sol ; elle donne sur le talus des fortifications ; à chaque coin du fort est une tour armée d'un canon. Tâchez de gagner la tour du Nord ; vous trouverez attachée à l'affût du canon une longue corde, à l'aide de laquelle vous descendrez dans les fossés et vous pourrez ainsi gagner les prairies.\n\nRIEL.\n\nMerci ! merci ! ma brave et digne femme !\n\nTAKOUAGA.\n\nQuant à toi, mon fils, fût-ce au prix de ta vie, protège la fuite du sauveur de notre race.\nPROLOGUE.\n\nL'ESPRIT ERRANT.\n\nJe vous le promets, ma mère. Vite, on vient. (Takouaga sort précipitamment par la petite porte de gauche.)\n\nSCÈNE IX.\n\nRIEL, MACKNAVE, L'ESPRIT ERRANT, ELISABETH, NELLY.\n\n(Riel tient Nelly par la main. Macknavé rentre avec sa femme par le fond; il arrache Nelly des mains de Riel et la remet à sa mère en lui disant.)\n\nMACKNAVE.\n\nRentrez dans votre appartement, madame.\n\nNELLY.\n\nMaman, nourrice n'a donc pas été sage que papa l'avait enfermée ?\n\nELISABETH (d'une voix étouffée).\n\nTais-toi, mon enfant. (Elle emmène sa fille.)\n\nSCÈNE X.\n\nMACKNAVE, RIEL, L'ESPRIT ERRANT.\n\nMACKNAVE (à Riel, hautainement).\n\nQue me voulez-vous ?\n\nRIEL.\n\nVous revenez d'Ottawa; où vous avez vu le gouverneur. Nous désirons savoir si on est enfin disposé à faire droit à nos justes réclamations.\n\nMACKNAVE.\n\nLe gouvernement sait à quoi s'en tenir là-dessus. Vos Métis ne sont que des mendicants. Plus on leur donnerait, plus ils deviendraient exigeants.\n\nRIEL.\n\nAlors, rien !... à toutes nos plaintes, on reste sourd? C'est un parti pris? La famine décime les populations du Nord-Ouest; nous en\nRIEL.\n\nsommes réduits à la dernière extrémité. Après avoir dépouillé les indigènes, on veut les tuer pour étouffer leurs plaintes.\n\nMACKNAVE.\n\nPensez-vous? (Il ricane.)\n\nRIEL.\n\nAh! misérable!... (RIEL montre le poing à Macknave.)\n\nMACKNAVE.\n\nEh! quoi, tu oses me menacer? Enfant de chienne, je te ferai fouetter.\n\nRIEL.\n\nFouetter?... Tiens, lâche! (Il lui jette son gant de fourrure à la face.)\n\nMACKNAVE* (avec fureur)\n\nAh j'aurai ta vie, brigand!... à moi!... à moi! (Il sort par le fond pour aller chercher du renfort.)\n\nSCÈNE XI.\n\nRIEL, L'ESPRIT-ERRANT.\n\nRIEL,\n\nNous n'avons pas de temps à perdre; vite, fuyons à la tour du Nord; viens! (Il s'étance.)\n\nL'ESPRIT ERRANT.\n\nJe reste.\n\nRIEL.\n\nPourquoi?\n\nL'ESPRIT ERRANT\n\nIl est trop tard pour moi. Ecoute; on vient; fuis seul.\n\nRIEL (revenant).\n\nJe ne t'abandonne pas.\n\nL'ESPRIT ERRANT.\n\nJ'ai juré de protéger ta fuite au risque de ma vie. (Il tire son toma-\nPROLOGUE.\n\nweak de sa ceinture et va se placer devant la porte du fond.) Ta vie à toi doit-être-sauvée, pour le salut de nos frères! (Riel lui serre la main et saute par la fenêtre. À ce moment la porte du fond s'ouvre. Une troupe de soldats de la police montée ayant à leur tête MacKnavé s'élancent. L'esprit Errant leur tient tête, frappant furieusement avec son toma-\ntok. Dans la lutte, deux soldats tombent, le crâne ouvert par la hache du sauvage. Cependant le jeune chef est forcé de reculer devant ses agres-\nseurs. Arrivé auprès de la fenêtre il tombe, accablé par le nombre. Le passage libre, MacKnavé court à la fenêtre et y arrive juste au moment où Riel qui a gagné le talus des fortifications, saisit la corde attachée par Takouaga à l'assiet du canon, et se laisse glisser hors du Fort.)\n\nSCÈNE XII.\n\nMACKNAYE, L'ESPRIT ERRANT, SOLDATS.\n\nMACKNAYE.\n\nSauvé!... Ah chien, tu es cause qu'il m'échappe; tu paieras pour lui. Soldats, emparez-vous de cet homme... qu'on le fusille.\n\n(Pendant que les soldats entraînent l'Esprit Errant, Takouaga entre par la porte de gauche; elle a entendu l'ordre fatal.)\n\nSCÈNE XIII.\n\nTAKOUAGA, MACKNAYE.\n\nTAKOUAGA.\n\nGrâce!... grâce pour mon fils, maître; aie pitié d'une pauvre mère, qui se traîne à tes genoux.\n\nMACKNAYE.\n\nPas de grâce pour ce chien. (Il cherche à sortir.)\n\nTAKOUAGA (s'accrochant à lui).\n\nMaître, rends-moi... rends-moi mon enfant.\n\nMACKNAYE (la repoussant).\n\nLâche-moi, mais lâche-moi donc. (Il la jette à terre, sort par le fond et ferme la porte.\nRIEL.\n\nSCÈNE XIV.\n\nTAKOUAGA, puis NELLY.\n\nTAKOUAGA.\n\n(se précipitant pour le suture.)\n\nIl m'a enfermée... enfermée... je suis enfermée !... Et ne pouvoir courir vers mon fils !... le couvrir de mon corps, le sauver ou mourir avec lui !... (montrant la fenêtre.) Cette fenêtre !... (Elle court à la fenêtre; au moment d'y atteindre, une fusillade éclate.) Takouaga tombe à genoux.) Mort !... il est mort !... (Elle se relève.) Homme sans cœur, tu as tué mon fils... oh ! je te tuerai à mon tour... Mais non, insensée... la mort serait trop douce pour lui,... non ! je veux qu'il souffre... qu'il souffre longtemps... jusqu'à sa dernière heure... car, moi, je vais pleurer mon enfant jusqu'à mon dernier jour. (Nelly entre.) Ah !... ch bien, lui aussi. Elle s'empare de Nelly, l'enlève dans ses bras malgré ses cris. Elisabeth apparaît. Takouaga se précipite vers la fenêtre, poursuivie par Elisabeth.)\n\nSCÈNE XV.\n\nELISABETH, TAKOUAGA, NELLY.\n\nELISABETH.\n\nTakouaga ! Takouaga !\n\n(à la fenêtre, tenant l'enfant suspendue dans le vide.)\n\nSi tu fais un pas, un seul pas... je la précipite.\n\nELISABETH (attérée.)\n\nQue vas-tu faire, malheureuse ?... (Elle s'arrête, épuisée au milieu de la scène.)\n\nTAKOUAGA.\n\n(montée sur l'appui de la fenêtre.)\n\nLe maître a pris mon fils, je lui prend sa fille... œil pour œil, dent pour dent... Adieu ! (Elle saute avec l'enfant dans ses bras. Elisabeth pousse un cri et tombe à terre anéantie.)\nPROLOGUE.\n\nSCÈNE XVI.\n\nMACKNAVE, ÉLISABETH.\n\nMACKNAVE (arrivant précipitamment.)\nQu'y a-t-il? (Apercevant Élisabeth.) Grand Dieu! Élisabeth!\n\nÉLISABETH (se relevant à demi.)\nMon enfant!... ma fille!... Nelly... perdue, prise... enlevée par Takouaga.\n\nMACKNAVE.\nQue dis-tu? Nelly?\n\nÉLISABETH\n(d'une voix faible et entrecoupée.)\nAh! George!... George!... Je te l'avais bien dit que Dieu te punirait... tu n'as plus... de fille... et moi... moi... je suis morte!... Ah!\n(Elle pousse un cri et retombe.)\n\nMACKNAVE\n(qui s'est agenouillé près du corps de sa femme, lève le poing vers le ciel.)\nMalédiction!\n\nFIN DU PROLOGUE.\nSECOND TABLEAU.\n\n1er ACTE.\n\nLE CAMP DES INDIENS PIEDS-NOIRS AU LAC AUX CANARDS\nEN 1885, 27 MARS.\n\nL'INSURRECTION.\n\nUne forêt ; dans le fond, le lac. À droite, au fond, la tente du chef; à droite, au premier plan, la tente de Kaïra. Les indiens sont occupés au fond de la scène à faire sécher le poisson. Takouaga, au premier plan à gauche, raccommode des filets; à droite, Kaïra, devant sa tente et couchée à demi sur un banc de gazon.\n\nSCÈNE I.\n\nTAKOUAGA, KAÏRA.\n\nTAKOUAGA\n\n(regardant la jeune fille à la dérobée.)\n\nToujours triste et rêveuse!... D'où peuvent venir ces nuages, qui assombrissent son front?... Quelle douleur profonde lui fait ainsi pencher la tête?... Peut-être en suis-je la cause? N'ai-je pas, il y a douze ans, arraché cette frêle enfant au bras d'une mère éplorée?... depuis ce jour, ne l'ai-je pas condamnée à vivre de notre vie rude et vagabonde? La fleur de serre chaude ne peut s'épanouir sur le rocher neigeux... Tôt ou tard le vent du Nord la flétrit et la brise. Pourtant, j'ai reporté sur elle tout l'amour que j'avais pour mon fils... Je l'aime..., mais elle, reste indifférente à mes caresses. Combien de fois n'ai-je pas songé à lui révéler le secret de sa naissance... à la rendre à son père... (avec colère) à son père! à Macknave!... Macknave, l'assassin de mon fils!... Non!... non!... Ma haine pour lui est plus forte que mon amour pour toi, o Kaïra... Devrais-tu en mourir et moi expirer de douleur... non, non... jamais!... Le cœur de l'Indien est ainsi fait: il\npeut se briser, mais il ne pardonne pas. (Elle s'approche de Kaïra et l'appelle.) Kaïra !\n\nKAÏRA\n\n(comme réveillé d'un rêve.)\n\nC'est toi, Takouaga ?\n\nTAKOUAGA.\n\nQuelles tristes pensées assombrissent le front de ma fille bien-aimée ?\n\nKAÏRA.\n\nJe ne sais !... un sentiment indéfinissable de tristesse s'est emparée de moi. Cette vie errante, ces courses sans fin à travers l'immense solitude des prairies, les dangers, les souffrances de chaque jour énervent mon courage... Je me sens au cœur un vide immense. Il me semble qu'aucune affection véritable ne veille sur moi.\n\nTAKOUAGA.\n\nC'est mal, Kaïra, de douter de l'amour de Takouaga pour sa fille... Kaïra n'aime donc pas sa mère ?...\n\nKAÏRA.\n\nPardonne-moi, Takouaga, si je t'offense ; j'ai pour toi une grande affection... mais, il me semble... que je ne t'aime pas... comme une fille devrait aimer sa mère.\n\n(Françeur arrive en canot. Bruit au fond.)\n\nSCÈNE II.\n\nKAÏRA, TAKOUAGA, FRANÇEUR, MÉTIS.\n\nTAKOUAGA.\n\nVoilà notre hôte qui revient de la chasse.\n\nKAÏRA\n\n(surprise et comme troublée.)\n\nFrançeur !...\n\n(Françeur, au fond de la scène, serre la main aux Métis.)\n\nUN MÉTIS.\n\nBonjour, frère !\nRIEL.\n\nFRANCEUR.\n\nBonjour, frères !\n\nUN MÉTIS.\n\nLa chasse a-t-elle été bonne ?\n\nFRANCEUR.\n\nAssez ! Voyez !... (Il montre le canot.) Mais à part du gibier, je rap-\nporte encore une bonne nouvelle.\n\nUN MÉTIS.\n\nQuoi donc ?\n\nFRANCEUR.\n\nJ'ai rencontré, de l'autre côté du lac, les deux guerriers que vous\naviez chargés d'un message pour Louis Riel ; ils reviennent accom-\npagnés du grand chef ; je les ai laissés contourner le lac avec leurs\nchevaux et j'ai aussitôt traversé pour vous prévenir ; ils seront ici\navant une heure.\n\nUN MÉTIS.\n\nFrères, notre protecteur Riel arrive, allons tous à sa rencontre.\n(Ils sortent. Franceur descend sur le devant de la scène.)\n\nSCÈNE III.\n\nFRANCEUR, TAKOUAGA, KAÏRA.\n\nFRANCEUR (à Takouaga).\n\nBonjour, mère ; vous trouverez dans le canot tout ce qu'il faut pour\ndiner. Je vous préviens que j'ai une faim de chasseur.\n\nTAKOUAGA.\n\nTakouaga ne vous fera pas attendre longtemps. (Elle va au canot, y\nprend le gibier et rentre dans la tente. Franceur dépose son fusil près de\nla tente de Kaïra, en s'approchant de la jeune fille.\n\nFRANCEUR.\n\nBonjour, petite sœur Kaïra !\nKAÏRA (Emue.)\n\nBonjour, frère !\n\nFRANCEUR.\n\nEh, mais, d'où vient cette pâleur ? Pourquoi ces jolis yeux sont-ils voilés de larmes ? Vous souffrez, Kaïra ?\n\nKAÏRA.\n\nNon !\n\nFRANCEUR.\n\nQu'avez-vous alors ?\n\nKAÏRA.\n\nJe ne sais.\n\nFRANCEUR\n\n(faisant le geste d'un homme qui a une idée.)\n\nQuel âge à Kaïra ?\n\nKAÏRA.\n\nSeize fois déjà j'ai vu l'érable rougir et la neige couvrir la terre.\n\nFRANCEUR.\n\nSeize ans... (à part, en mettant la main sur son cœur.) La maladie est là. (Haut.) Ma sœur aime un jeune guerrier de sa tribu, qui n'a sans doute pas eu l'esprit de s'en apercevoir ?\n\nKAÏRA (confuse.)\n\nNon !\n\nFRANCEUR (à part.)\n\nElle a rougi !... C'est cela. Le jeune guerrier peut dire qu'il a de la chance. (Haut.) Allons ! petite sœur. Kaïra, chassez ces vilains papillons noirs... vite un joli sourire... là, à la bonne heure !... maintenant que vous voilà plus gaie, je vais, avant le dîner m'occuper de mes préparatifs de départ.\n\nKAÏRA (se levant, émue.)\n\nVous partez ?\n\nFRANCEUR.\n\nSans doute ! Je ne puis pourtant pas me faire naturaliser Peau-Rouge et passer ma vie à chasser le buffle ou l'orignal.\nRIEL.\n\nKAÏRA (chancelante.)\n\nAh!...\n\nFRANCCEUR.\n\nMes vacances sont finies ; mon journal me réclame ; je pars demain.\n\nKAÏRA.\n\nAh ! (Elle tombe sur le banc de gazon.)\n\nFRANCCEUR\n\n(se penchant sur elle et l'enlaçant de ses bras.)\n\nCiel ! aveugle que j'étais !... Kaïra, chère Kaïra !...\n\nKAÏRA (revenant à elle.)\n\nGeorge !...\n\nFRANCCEUR.\n\nMa bien aimée !\n\nKAÏRA.\n\nJe t'aime !...\n\n(Francceur pose un baiser sur le front de Kaïra.)\n\nSCÈNE IV.\n\nABRAHAM, FRANCCEUR, KAÏRA.\n\nABRAHAM.\n\nAh ! ah ! oh ! oh ! Barton, si che fous téranche !... che ne fous afais bas fu. (À part.) Che afais pien fu ; ch'ai l'œil et le pon !...\n\nFRANCCEUR.\n\nTiens ! ce vieux Juif d'Abraham. D'où viens-tu, vénérable fils d'Israël ?\n\nABRAHAM.\n\nChe fiens ?... Che fiens du fort Galgary, où ch'ai été renouvelé mes brovisions de marchandises ; ch'ai tu pon gin ; te la boudre, peaucoup de boudre... Foyez-fous, il se manigance ici quelque chôse... ch'ai l'œil et le pon, voui !... c'est un article qui se fendra bien, voui ! (Jetant un regard oblique à Francceur,) ch'ai aussi de cholis pichoux ! hein ! hein ! (Il rit bêtement.) Bas cher, hein ! hein ! (Il pousse Fran-\nPREMIER ACTE.\n\ncour du coude, ouvre sa boîte et en exhibe quelques articles.) Hein !...\npour les cheunes chens faire gâteau aux chôlies filles. Hein !\n\nFRANCOEUR (riant.)\nAllons ! c'est bon, vieux malin donne moi ton plus joli collier.\n\nABRAHAM.\nLe plus choli, c'est cher !... vingt biastres !\n\nFRANCOEUR.\nJe ne t'en ai pas demandé le prix ; donne.\n\nABRAHAM (à part.)\nLes amoureux, ça ne marchante jamais !... Ponne affaire !... ch'ai l'œil et le pon !... voui !... (Il donne son collier contre argent comptant,\nqu'il examine attentivement, puis, satisfait, il se met à ranger dans sa boîte ses bijouteries.)\n\nFRANCOEUR (à Kaïra.)\nChère Kaïra, accepte ce collier comme un gage de mon amour pour toi ; c'est mon cadeau de fiançailles.\n\nKAÏRA.\nMerci, mon ami et en retour, voici le mien. (Elle enlève de son cou,\nla petite croix que Riel lui avait donnée et la présente à Francoeur.)\nPuise cette petite croix te porter bonheur. (Bruit : Tous les guerriers rentrent avec Riel.)\n\nSCÈNE\n\nRIEL, LA NUÈE ORAGEUSE, MÉTIS ET SAUVAGES.\n\nMÉTIS ET SAUVAGES.\nHurrah ! Hurrah ! Vive Riel !...\n\nRIEL.\nFrères ! j'ai reçu votre message il y a quatre jours ; quel nouveau danger menace mes frères ?\nRIEL.\n\nLA NUÉE ORAGEUSE.\n\nEh ! quoi, ignores-tu ce qui se passe ?\n\nRIEL.\n\nQue mon frère, la Nuée Orageuse, parle d'abord.\n\nLA NUÉE ORAGEUSE.\n\nSoit !... Mais avant que des paroles amères ne sortent de ma bouche, permet que suivant l'usage, le calumet circule parmi nous. Le sage ne parle qu'après avoir apaisé la colère, qui agite son âme ; la précipitation rend la langue fourchue.\n\n(Pendant cette tirade, Indiens et Métis se sont assis à terre en demi-cercle. La Nuée Orageuse et Riel sont au milieu. Le calumet passe de bouche en bouche lorsque que la cérémonie est terminée.)\n\nRIEL.\n\nMaintenant, chef, je t'écoute.\n\nLA NUÉE ORAGEUSE.\n\n(Parlant avec calme et lentement)\n\nDepuis que le grand Esprit fit la terre qui nous porte, et qu'il alluma le soleil qui nous éclaire, nous vivions libres, heureux et tranquilles dans nos solitudes. Un jour, jour maudit sur le grand lac salé, qui borne nos côtes, nous aperçûmes d'immenses maisons flottantes ; des arbres entiers servaient de support à de grandes voiles, que le génie du mal et des tempêtes ensuitait de son souffle. De ces grandes barques descendirent des hommes d'une autre race et d'une autre couleur que la nôtre. Ils vinrent s'asseoir à nos feux et demandèrent à partager notre nourriture et nos wigwams. Il acceptèrent de fumer avec nous le calumet de paix et furent reçus en frères.\n\nBientôt, ces faces pâles ne demandèrent plus à partager ; ils parlèrent en maîtres et voulurent tout avoir : nos pêcheries, nos territoires de chasse et jusques à nos squaws. Ils avaient des armes aussi terribles que la foudre et que nous ne connaissions pas alors. Que pouvaient contre elles nos arcs et nos tomahawks ? Ils furent les plus forts. Alors, ils nous chassèrent devant eux, comme de vils troupeaux, tuant ceux de nos frères qui résistaient ou restaient en arrière. Ah ! ils pouvaient tout nous prendre, même notre vie !... ils ne frappaient que nous seuls. Mais, ils ont pris la terre qui nous a vu naître, et que le grand Esprit nous avait donnée : la terre où sont enfouis les ossements de nos aïeux ; la terre, cet héritage sacré, qui nous a été confié\nPREMIER ACTE.\n\npar nos pères pour être transmis à nos enfants. (Pendant la fin de cette tirade, il s'est excité peu à peu—se levant exalté): Ah ! la porte du sol cheri de sa patrie a fait au cœur de l'Indien une plaie profonde, que rien ne cicatrisera, qui saignera à travers les âges et dira à chaque génération nouvelle : \"souviens-toi ! souviens-toi !\"\n\nRIEL.\n\n—Est-ce là tout ? Et mon frère, le vaillant chef des Pieds Noirs n'a-t-il contre l'usurpateur que ces anciens griefs, à peu près oubliés aujourd'hui ?\n\nLA NUÈE ORAGEUSE.\n\nLorsque la Compagnie de la baie d'Hudson nous a vendus comme un vil bétail au gouvernement anglais, nous avions espéré trouver dans nos acquéreurs sinon de la justice, du moins de la pitié. Notre espoir a été déçu ; on nous a chassés du territoire que, depuis le commencement du monde, nous parcourions en liberté ; on nous a relégués dans un pays stérile ; que traverse bien rarement un troupeau de buffles égarés ; notre seule nourriture est un peu de lard pourri, que l'on nous donne en échange de nos plus belles fourrures ; on nous affame pour mieux nous voler. La mesure est comble.\n\nRIEL.\n\nFrère, les paroles qui viennent de sortir de ta bouche ne m'apprennent rien de nouveau ; je connais vos griefs et depuis longtemps je travaille à vous faire obtenir justice. Cependant, malgré le mauvais vouloir du gouvernement, je vous supplie, dans votre intérêt, de ne pas encore lever l'étendard de la révolte. Verser le sang, c'est offenser Dieu. Je vais faire à Ottawa une dernière tentative. Jurez-moi que jusqu'à mon retour vous ne ferez pas parler la poudre.\n\nTOUS.\n\nMais... (Bruit confus de voix contradictoires.)\n\nRIEL.\n\nJe le veux... Vous le jurez ?\n\nLA NUÈE ORAGEUSE.\n\nFrères, puisque le chef l'ordonne, nous le jurons !\n\nTOUS: (se levant).\n\nNous le jurons !...\nRIEL.\n\nSCÈNE VI.\n\nLES MÊMES—GABRIEL DUMONT.\n\nGABRIEL DUMONT. (Entrant.)\n\nTrop tard !\n\nTOUS.\n\nGabriel Dumont !\n\nRIEL.\n\n(S'avançant vers lui.)\n\nQue veut dire mon fidèle ami ?\n\nGABRIEL DUMONT.\n\nVous espériez justice ou pitié?... Eh ! bien, on a trouvé que la misère ne nous tuait pas assez vite; on a chargé des gens de nous assassiner.\n\nRIEL.\n\nParles-tu sérieusement ?\n\nGABRIEL DUMONT.\n\nHélas ! il n'est que trop vrai ! jugez-en. Ce matin nous nous rendions avec quelques trappeurs à la pointe Nord du lac pour y relever nos trappes; lorsque, tout-à-coup, nous nous voyons entourés d'un fort détachement de la police montée commandée par le major Crozier. Nous ignorions ses intentions, quand il fit un signe à ses hommes. Immédiatement, sans sommation aucune, une fusillade épouvantable est dirigée contre nous.\n\nTOUS.\n\nVengeance !\n\nRIEL.\n\nContinue !\n\nGABRIEL DUMONT.\n\nLa précipitation à obéir à cet ordre odieux empêcha les soldats de bien viser. Mes amis et moi, nous nous jetons à terre, et grâce à la fumée de la poudre qui nous cachait à nos ennemis, nous rampons sur les mains et nous parvenons à gagner le taillis, qui borde la route. Nous étions sauvés.\nRIEL.\n\nEt alors ?\n\nGABRIEL DUMONT.\n\nAlors, avant de nous disperser, mes douze amis et moi, nous déchar-\ngeons nos carabines, et quatorze hommes de la police, le front troué\nd'une balle, roulent dans la neige.\n\nLA NUÈE ORAGEUSE.\n\nQuatorze ?... Mais vous n'étiez que treize.\n\nG. DUMONT (montrant sa carabine).\n\nJ'ai une carabine à deux coups. Eh ! bien, Riel ?\n\nRIEL (s'exaltant).\n\nOui ! la mesure est comble !... Puisque, les premiers, ils ont versé le\nsang, que ce sang, et tout celui qui va couler, retombe sur leurs têtes.\nMes amis, le sort en est jeté ! allons, mes fidèles Métis, fourbissez vos\narmes ; et vous, braves guerriers Indiens, déterrez la hache de guerre.\nC'est Riel qui marchera à votre tête. Aux armes !\n\nTOUS.\n\nAux armes !\n\nLA NUÈE ORAGEUSE.\n\nQu'ordonne notre chef ?\n\nRIEL.\n\nQue le grand conseil, composé des douze principaux chefs, se réu-\nnisse à l'instant dans ton wigwam, afin d'y discuter notre plan de cam-\npagnée. (Il passe devant Francœur, qui le salue). Quel est ce jeune\nhomme ?\n\nUN MÉTIS.\n\nUn journaliste américain en vacances.\n\nRIEL.\n\nMonsieur ? (Il le salue.)\n\nFRANCŒUR.\n\nGeorge Francœur, reporter du Courrier des États-Unis.\nRIEL.\n\nRIEL.\n\nÀ quelle nationalité appartenez-vous?\n\nFRANÇEUR.\n\nJe suis Canadien-Français.\n\nRIEL.\n\nUn Canadien-Français? Béni soit Dieu qui vous a amené parmi nous, mon jeune ami; témoin impartial des événements qui se préparent, vous plaiderez notre cause devant l'opinion publique. Vous serez l'historien de nos batailles......\n\nFRANÇEUR.\n\n......Et le chantre de vos victoires.\n\n(Il se donnent la main, puis Riel, suivi des chefs, entre dans la grande tente du fond. Bruit dans la coulisse à gauche; Steward entre avec des Indiens qui l'entourent).\n\nSCÈNE VII.\n\nSTEWARD, FRANÇEUR, INDIENS puis ABRAHAM.\n\nSTEWARD (entouré d'Indiens.)\n\nJe disais encore une fois de cesser cette familiarité et de respecter moâ; je étais sujet anglais et de plus journaliste.\n\nFRANÇEUR.\n\nUn confrère!\n\n(Il va au devant de Steward et lui tend la main).\n\nSTEWARD, (froidement.)\n\nMonsieur, présentez d'abord vô à moâ.\n\nFRANÇEUR.\n\nFrançeur, du Courrier des Etats-Unis.\n\nSTEWARD.\n\nEt moâ, mister Steward, reporter du Pall-Mall Gazette of London.\n\n(Présentation faite, ils se serrent la main).\nPREMIER ACTE.\n\nFRANCEUR, (gairement.)\n\nEt quel bon vent vous amène, cher Mr Steward, dans ce pays des sauvages?\n\nSTEWARD.\n\nCe était une mission spéciale de la plus haute importance:\n\nFRANCEUR.\n\nAh!\n\n(Entré Abraham avec ce qu'il lui faut pour monter un bar.)\n\nSTEWARD.\n\nLe Pall Mall Gazette, le journal de mœurs, il avait entrepris de régénérer le Angleterre et les colonies de elle, en dévoilant les vices, les tourpitiouées qui infectent les populations de elle.\n\nFRANCEUR.\n\nC'est une noble tâche!\n\nSTEWARD.\n\nAoh! yes, et qui augmentait beaucoup fort le tirage du Pall-Mall Gazette. Je avais été... désigné, aoh... désigné pour diriger le enquête dans le Dominion. Je étais pris terre à Québec, et je avais tout de suite commencé le... comment pelez-vous en français?...aoh! yes, le fonctionne!\n\nFRANCEUR.\n\nEh! bien, et les mœurs à Québec?\n\nSTEWARD, (hochant la tête.)\n\nHeu! Heu!\n\nFRANCEUR.\n\nEt à Montréal?\n\nHi Hi! (Il rit).\n\nSTEWARD, (jeu de scène.)\n\nFRANCEUR.\n\nAh! Ah!\n\nSTEWARD.\n\nAlors, comprenez-vous, je étais parti immédiatement pour le pays des Sauvages.\nRIEL\n\nFRANÇEUR.\n\nY a-t-il de l'indiscrétion à vous demander ce que vous avez appris à Ottawa sur les moeurs des Sauvages ?\n\nSTEWARD.\n\nAoh !... je dirai bien à vô... des horreurs. (il l'entraîne, et tire son carnet). Tenez, je avais commencé une rédaction que je vais lire à vô. [Il lit] Au Nord-Ouest, les Indiens, pour obéir aux lois de l'hospitalité, ils livrent en pâture à la bestialité de leurs hôtés leurs femmes et leurs filles. (parlé). C'est abominable !... (Il ferme son carnet et aperçoit Kaira.) Aoh ! quelle était cette jolie petite sauvagesse ?... Hé ! Hé ! on dirait que je lui fais impressionné.\n\nFRANÇEUR.\n\nC'est Kaira, la fille adoptive d'un chef, la Nuée Orageuse.\n\nSTEWARD.\n\nDrôle de nom, la Nuée Orageuse... By God ! je voudrais bien loger chez la Nuée Orageuse... hé... hé... !\n\nFRANÇEUR (à part.)\n\nJoli moraliste ! (haut). Est-ce tout ?\n\nSTEWARD.\n\nAoh ! no... il paraît que les Indiens, ils étaient des ivrognes... ils étaient des... (il aperçoit Abraham en train de monter son bar). Que faisait cet homme ?\n\nFRANÇEUR.\n\nIl va débiter son gin aux Indiens.\n\nSTEWARD.\n\nDu gin ?... J'en prendrai une verre.; by God... venez avec moi ; je païais le traite.\n\nFRANÇEUR.\n\nNon ! merci.\nPREMIER ACTE\n\nSCÈNE VIII.\n\nLES MÊMES ABRAHAM, INDIENS; entrant peu à peu.\n\nSTEWARD.\n\n(Il s'approche d'Abraham en train de dresser une table pour servir de bar.)\n\nOù est le milieu du désert, ce était, mon foà, original, aoh yes, original ! (Il examine, en tournant autour de toutes façons. S'arrêtant étonné.) Aoh ! qu'est-ce que c'est que cette petite trou ?\n\nABRAHAM.\n\nÇa ?... c'est pour mettre l'archent. Foyez-pien. Il tombe dans le dîroit, qui est vermé avec ce crôs, gadenas... Foyez pien ?... che gonais mes bratiques !... ch'ai l'œil et le pon, voui !... Foulez-fous un ferre-te gin ?\n\nSTEWARD.\n\nAoh ! yes, volontiers.\n\nABRAHAM.\n\nBien !... Bayez d'afançé, if you please. (Steuard sans aucune marque de surprise, jette cinq cents sur la table. Le Juif les ramassant.) Qu'est-ce que c'est ?\n\nSTEWARD (naturellement.)\n\nFive cents.\n\nABRAHAM.\n\nOh ! oh ! sous foulez rire, c'est : 25 cents... Twenty-five. Groyez-vous qu'on se brocure tu gin aussi facilement ici qu'à Montréal ?\n\nSTEWARD.\n\nCe était perfectly vrai !... aoh ! yes. (Il donne 25 cents qu'Abraham fait disparaître dans le trou percé dans le bar, pendant ce colloque un indien s'est glissé sous la table et a enlevé la planchette du fond ; les 25 cents lui tombent dans la main.)\n\nABRAHAM.\n\nÀ qui le tour ? (Un Indien s'approche, et pendant qu'Abraham, remplit le verre, l'Indien qui est sous la table passe à son ami les 25 cents. Cette pièce, par le même jeu, sert à tour de rôle à tous les Indiens. Pen- cette scène, Steuard s'est approché de Franceur.)\nRIEL.\n\nFRANCEUR.\n\nLe diner est servi. Je ne vous le garantis pas aussi bon que chez Victor de Montréal, mais il vous est offert de tout cœur. Venez-vous?\n\nSTEWARD.\n\nJe voulais bien. (Ils entrent dans la tente de Kaira. Les Indiens, qui ont tous bu, se sont éloignés. Abraham reste seul.)\n\nSCENE X.\n\nABRAHAM.\n\nABRAHAM.\n\nAllons ! là, recette a été ponctuelle... ch'ai l'œil ; che barie pour touze biastres !... (Il ouvre le tiroir et reste stupéfait.) Rien ! barbleu ! je sois bien qu'il n'y a rien !... ch'ai l'œil ! (Il cherche...) Ah ! un drou. L'archent sera tombé sous la table. (Il se baisse sous la table pour chercher ; pendant ce temps, un sauvage vient voler le tonneau.) Rien ! bas d'archent,... ch'eu suis fôlé,... ah ! les pandits !... (Il se relève et s'aperçoit de la disparition du tonneau.) Mon, donneau !... mon donneau !... (Il court vers la coulisse de gauche à la poursuite du voleur et disparaît après lui ; pendant ce temps un Indien vient voler le bar. Abraham, essoufflé, repartait à la coulisse en criant :) Il court plus vite que moi ; ch'eu n'aurai jamais pu le rattraper, le prigand !... ch'ai l'œil. (Il s'essuie le front avec une vieille loque rouge en guise de mouchoir. N'apercevant plus son bar.). Ah ! ma bar qui est fôlée aussi !... ah ! les chiens !... les fêleurs !... les Juifs !... (se reprenant,) non, bas les Juifs,... les Beaux-Rouges !... (Sur ces derniers mots, MacKnavé est entré.)\n\nSCENE XI.\n\nMACKNAVE, ABRAHAM, puis KAIRA.\n\nMACKNAVE.\n\nIl paraît que les Peaux Rouges ne sont pas de vos amis.\n\nABRAHAM (Exaspéré.)\n\nIls m'ont fôlé tout mon archent, ma bar, mon gin !...\nPREMIER ACTE.\n\nMACKNAVE.\nAn ! vous leur vendez du gin malgré la défense du gouvernement ?\n\nABRAHAM.\nQu'est-ce que cela nous fait, à nous ?\n\nMACKNAVE (consterné.)\nJe suis MacKnavé, commissaire du gouvernement, et je vous arrête.\n\nABRAHAM.\nJe souis berdu !... Je le fois pien... ch'ai l'œil !\n\nMACKNAVE.\nPas encore, si tu veux m'être utile.\n\nABRAHAM (vivement.)\nOh ! voui, Monsieur, voui !... Tout ce que vous foudrez !\n\nMACKNAVE.\nNous soupçonnons les Indiens et les Métis de fomenter une révolte. Toi, qui vis au milieu d'eux, veux-tu être notre agent secret et nous tenir au courant de ce qui se passe ?\n\nABRAHAM.\nEt che bourrai gontinuer à fendre de l'alcool ?\n\nMACKNAVE.\nOui !\n\nABRAHAM.\nEh ! pien, à l'heure qu'il est la guerre est déclarée. Tous les chefs sont en train de délibérer sur le plan de campagne... là (Il montre la tente.)\n\nMACKNAVE (vivement.)\nDis-tu vrai ?\n\nABRAHAM.\nPar le dieu d'Abraham.\nRIEL.\n\nMACKNAVE.\n\nBien !... en cas, il faut s'éloigner à plus vite ; ma vie est en danger ici... As-tu ton sleigh ?... aux environs ?\n\nABRAHAM.\n\nOui !\n\nMACKNAVE.\n\nAttelé et prêt à... (À ce moment Kaira sort de la tente et se dirige vers le lac pour y puiser de l'eau. Macknave l'aperçoit.) By Joel... la belle fille !\n\nABRAHAM.\n\nQu'avez-vous ?\n\nMACKNAVE.\n\nSa vue m'a porté un coup au cœur. La connais-tu ?\n\nABRAHAM.\n\nVoui ?... C'est Kaira la fille du chef la Nuée Orageuse.\n\nMACKNAVE (à part.)\n\nSi cependant !... Et pourquoi pas ?... (Haut.) Écoute !... Il faut que tu m'aides à enlever cette jeune fille.\n\nABRAHAM.\n\n(stupéfait et tremblant.)\n\nY pensez-vous ?... vous foulerez me faire scalper.\n\nMACKNAVE.\n\nSois sans crainte. Ne m'as tu pas dit que là guerre était déclarée ? La fille d'un chef, c'est une-excellente prise ; elle pourra servir d'otage. Prépare ton cheval et va faire le guet.\n\n(Kaira redescend avec sa cruche pleine d'eau.)\n\nSCÈNE XI.\n\nMACKNAVE, KAIRA, ABRAHAM.\n\nMACKNAVE.\n\n(Allant au devant de Kaira.)\n\nLa belle Kaira voudrait-elle rendre un service à son frère ?\nPREMIER ACTE.\n\nKAÏRA (étonnée.)\n\nVous me connaissez ?\n\nMACKNAVE.\n\nQui ne connaît la jolie fille de la Nuée Orageuse ?\n\nKAÏRA.\n\nQue désirez-vous ?\n\nMACKNAVE.\n\nUne longue course m'a desséché la gorge ; vous plairait-il de me laisser boire ?\n\n(Pendant ces paroles, Abraham a traversé le fond de la scène et fait le guet à droite. Kaïra lève sa cruche à la hauteur des lèvres de Macknavé. Celui-ci d'un brusque mouvement, saisit Kaïra par la taille et l'emporte ; la cruche tombe ; Kaïra pousse un cri. À ce cri Franceur accourt, mais Macknavé décharge son revolver sur lui et fuit en emportant Kaïra ; on entend les grelots du sleigh, qui s'éloigne. Le coup de feu fait accourir les chefs et les Indiens.)\n\nSCÈNE XII.\n\nRIEL, FRANCEUR, DUMONT, ABRAHAM, STEWARD, MÉTIS, INDIENS.\n\nRIEL.\n\nQuel nouveau malheur ?\n\nFRANCEUR (blessé.)\n\nKaïra enlevée !... là, vite, courez.\n\nTOUS.\n\nCourons !\n\nDUMONT (faisant un signe.)\n\nArrêtez !... (Il met en joue son rifle.)\n\nFRANCEUR.\n\nMais, vous pouvez la tuer.\n\nDUMONT (froidement.)\n\nLa balle de ma carabine n'a jamais manqué son but. (Il tire.)\nRIEL.\n\nUN MÉTIS.\n\nBravo ! le cheval roule dans la neige.\n\nUN AUTRE MÉTIS.\n\nL'homme saute à bas de son sleigh et se sauve dans la forêt.\n\nFRANÇOEUR.\n\nKaira est sauvée !... Merci !... (Il donne une poignée de main à Dumont et pousse un cri de douleur.)\n\nDUMONT.\n\nVous êtes blessé ?\n\nFRANÇOEUR.\n\nCe n'est rien... une balle dans le bras.\n\nRIEL.\n\nConnaissiez-vous cet homme ?\n\nFRANÇOEUR.\n\nNon... (Il sort au devant de Kaira.)\n\nABRAHAM (vivement.)\n\nChe le gonnais, moi !... Celui qui foulait me fôler mon draineau et qui est la gause que mon cheval est tué, c'est le gommissaire du Cou- vernement, Macknave.\n\nSTEWARD (à part.)\n\nAoh ! bienne !... une enlèvement !... bonne affaire ! Voilà mon pre- mier article trouvé ; aoh ! yes !... (Il rédige.)\n\nRIEL.\n\nAllons, frères, le sort en est jeté. Allumez les feux sur vos mon- tagnes, dans vos prairies, au bord de vos lacs ; que des émissaires soient envoyés à tous vos chefs de tribu. Rendez-vous général à Batoche. C'est là qu'il faudra vaincre ou mourir. Aux armes !\n\nTOUS.\n\nEn avant !... Hurrah ! hurrah !\n\nFIN DU 1er ACTE.\nTROISIÈME TABLEAU.\n\n2me ACTE.\n\nLA BATAILLE DE BATOCHÉ.\n\nLA TRAHISON.\n\nOn est au troisième jour de la bataille de Batoche. La scène représente une caravane ; entrée par le fond.\n\nSCÈNE I.\n\nKAÏRA, FRANCŒUR,\n\n(portant le bras en écharpe.)\n\nKAÏRA\n\n(pansant la blessure de Francœur.)\n\nLà, voilà qui est fait. Dans quelques jours, il n'y paraîtra plus.\n\nFRANCŒUR.\n\nMerci ! chère petite Kaïra... que de reconnaissance... Comment pourrai-je jamais?\n\nKAÏRA\n\n(lui mettant le doigt sur la bouche)\n\nNe parlons pas de cela ; n'est-ce pas du reste mon devoir ; n'est-ce pas à cause de moi, pour me sauver, que vous avez reçu cette vilaine blessure?\n\nFRANCŒUR.\n\nOh! j'ai peu fait pour te sauver, et sans l'adresse de Gabriel Dumont, Dieu sait ce que tu serais devenue aux mains du misérable qui t'enlevait. Chère âme, si j'avais dû te perdre, je serais mort de douleur.\nRIEL.\n\nKAIRA:\n\nMon George!\n\nFRANCEUR.\n\nAussi désormais je veux veiller sans cesse sur toi, ne plus te quitter un seul instant.\n\nKAIRA (malicieusement.)\n\nMême si le devoir l'exigeait?\n\nFRANCEUR.\n\nComment veux-tu que le devoir m'oblige à me séparer de toi, ne fût-ce que pour peu de temps?\n\nKAIRA (même jeu.)\n\nOn ne sait pas, George; l'avenir est gros d'imprévus.\n\nFRANCEUR.\n\nVoyons, méchante, pourquoi veux-tu m'attrister à l'idée d'une séparation impossible?... Laisse-moi plutôt au bonheur d'être tout près de toi, près de ma jolie fiancée... je suis si heureux!... si heureux!\n\nKAIRA (avec une sérieuse comique.)\n\nSavez-vous, monsieur George, que vous avez un bien grand défaut et que vous méritez que je vous gronde.\n\nFRANCEUR.\n\nTu m'effrayes, Kaira; voyons ce grand défaut.\n\nKAIRA.\n\nVous êtes, monsieur, un profond égoïste. Comment êtes-vous (parodiant Franceur) si heureux!... si heureux!... lorsque tout est en deuil autour de nous,... lorsque la mort plane sur nous,... lorsque nos frères (devenant sérieuse) versent en ce moment même leur sang pour la défense de leur liberté?\n\nFRANCEUR.\n\nTu es un ange, Kaira; pardonne-moi, mais vois-tu, je t'aime tant!... Mon amour pour toi, est si grand que tout s'efface devant lui... je ne pense qu'à toi... je ne vois que toi, l'univers pour moi, c'est toi.\nDEUXIÈME ACTE.\n\nKAÏRA:\n\n— Allons, il faudra bien vous pardonner, vous avez une si jolie façon de vous excuser.\n\nFRANCŒUR.\n\nAh ! que tu es gentille, Kaïra ; laisse-moi prendre un baiser (Kaïra fait un geste de refus. Francœur suppliant.) Un seul, tout petit.\n\nKAÏRA (se défendant faiblement.)\n\nNon pas, monsieur, plus tard... lorsque je serai votre femme.\n\nFRANCŒUR.\n\nEh ! bien, donne-moi un à-compte.\n\nKAÏRA\n\n(Entendant du bruit, tend vivement la joue à Francœur.)\nAllons, méchant, dépechez-vous, on vient.\n(Francœur l'embrasse. Entrent Riel, Dumont, guerriers. Francœur, abandonnant Kaïra, va au devant de Riel.)\n\nSCÈNE II.\n\nKAÏRA, FRANCŒUR, RIEL, DUMONT, GUERRIERS.\n\nFRANCŒUR.\n\nEh ! bien, chef, est-ce la victoire définitive que vous venez nous annoncer?\n\nRIEL.\n\nPas encore, mon ami, mais bientôt, je l'espère. Pendant deux jours et deux nuits nous avons combattu sans relâche ; si cette troisième journée est aussi heureuse que les deux autres, la campagne sera terminée.\n\nDUMONT.\n\nOui, et il y aura de beaux faits d'armes à raconter dans les veillées d'hiver ; l'histoire du siège de Batoche aura surtout du succès... ah ! ah ! ah ! (Il rit.)\n\nKAÏRA.\n\nQue veut dire mon frère?\nRIEL.\n\nFRANÇEUR.\n\nEst-ce que vos guerriers?...\n\nDUMONT.\n\nÉcoutez!... Figurez-vous qu'avant hier nous étions retranchés dans Batoche, lorsque Middleton vint nous attaquer. Une heure après, les boulets pleuvaient. Riel, s'apercevant que la place n'était attaquée que d'un seul côté, nous donna l'ordre d'évacuer. Voilà deux jours que Middleton s'amuse à canonner des maisons, où il n'y a plus personne. Pendant ce temps, nos frères embusqués dans les buissons, font tomber sous leurs balles meurtrières les tireurs anglais. Middleton croit avoir affaire à cinq mille hommes et nous sommes à peine trois cents.\n\nFRANÇEUR.\n\nTrois cents qui en valent trois mille; j'ai vu vos chasseurs à l'œuvre... il ne gaspillent pas leur poudre.\n\n(On entend à l'entrée de la caverne un signal d'appel.)\n\nRIEL.\n\nAlerte!... (Nouveau signal.) C'est un guerrier rouge!\n\n(Un guerrier rouge apparaît, tenant un homme prisonnier.)\n\nSCÈNE III.\n\nLES MÊMES, MACKNAVE (déguisé,) LE GUERRIER.\n\nRIEL:\n\nQui t'amène et quel est cet homme?\n\nLE GUERRIER.\n\nUn visage pâle que nous avons surpris rôdant autour de nos retranchements.\n\nRIEL (à Macknave.)\n\nQui es-tu, toi?\n\nMACKNAVE.\n\nUn ami.\n\nRIEL.\n\nQue veux-tu?\nDEUXIÈME ACTE.\n\nMACKNAVE.\n\nTe parler en particulier.\n\nRIEL.\n\nQui m'assure de tes bonnes intentions ?\n\nMACKNAVE.\n\nJe suis seul et sans armes.\n\nRIEL.\n\nParle.\n\n(Les guerriers sur un signe de Riel s'éloignent.)\n\nSCÈNE IV.\n\nRIEL, MACKNAVE.\n\nMACKNAVE.\n\n(A part.) Allons, jusqu'à présent, tout marche à souhait... oh ! Riel, si tu peux tomber dans le piège, je serai bien vengé. Non seulement ta vie sera entre mes mains, mais ton honneur : je veux une vengeance complète.\n\nRIEL.\n\n(Après que les guerriers ont disparu).\n\nAllons, parle, j'écoute.\n\nMACKNAVE.\n\nLouis Riel, j'arrive d'Ottawa, chargé d'une mission de confiance auprès de toi.\n\nRIEL.\n\nJe ne comprends pas.\n\nMACKNAVE.\n\nTu vas comprendre. Le gouvernement commence à voir qu'il a fait une folie, en restant sourd à vos plaintes et en laissant s'allumer une guerre fratricide. Il redoute d'entendre sonner l'heure des responsabilités et donnerait beaucoup pour voir cette guerre finie. Malheureusement son prestige l'empêche de faire le premier des ouvertures de paix ; ce serait reconnaître ses torts et son impuissance.\n\nRIEL. (sardonique).\n\nAh ! ah !\nRIEL.\n\nMACKNAVE.\n\nTrente cinq mille piastres seront le prix de ce service...\n\nRIEL.\n\nDis : de cette trahison.\n\nMACKNAVE.\n\nJe ne chicanerai pas sur les mots... acceptes-tu ?\n\nRIEL.\n\nRetourne dire à ceux qui t'envoient qu'ils ont tort de croire que Riel leur ressemble. Un vrai Canadien-Français ne sait pas trahir.\n\nMACKNAVE.\n\nAinsi, tu persistes à continuer cette guerre fratricide ?\n\nRIEL.\n\nCe n'est pas moi qui l'ai voulue.\n\nMACKNAVE.\n\nMais, le gouvernement possède des forces supérieures aux tiennes ; tu seras sûrement vaincu... ruiné... songe donc ! Trente-cinq mille piastres !\n\nRIEL.\n\nJe préfère encore une glorieuse défaite à votre honteux marché.\n\nMACKNAVE.\n\nTu peux être tué... alors ta femme... tes enfants...\n\nRIEL.\n\nNe prends pas soin de mon existence... la balle qui doit me tuer n'est pas encore fondue.\n\nMACKNAVE.\n\nMais, il n'y a pas que les balles qui tuent... il y a aussi... la corde.\n\nRIEL.\n\nAssez, misérable... sors d'ici... ou prends garde que mes guerriers ne te mettent à toi-même la corde au cou.\nDEUXIÈME ACTE.\n\nMACKNAVE (à part)\n\nAh ! je ne puis te déshonorer, mais au moins je te tuerai. (il lui lance un coup de poignard.)\n\nRIEL.\n\nAssassin !... (Il a évité le coup et saisi Macknave ; dans la lutte la perruque de Macknave est tombée. Riel le reconnaît.) Macknave !... (à ce mot prononcé fortement, tous les guerriers rentrent.)\n\nSCÈNE V.\n\nRIEL, MACKNAVE, NOLLIN, GUERRIERS.\n\nDUMONT.\n\nQu'y a-t-il ?\n\nRIEL.\n\nMacknave, qui après m'avoir proposé de trahir notre sainte cause, a voulu m'assassiner.\n\nDUMONT.\n\n(s'approchant de Macknave).\n\nA mort ! Nous allons le pendre.\n\nRIEL.\n\nNon ! nos ennemis diraient que nous tuons nos prisonniers ; ne leur donnons pas cette satisfaction ; au reste, sa vie peut nous être utile. Garrottez cette homme. Toi, Nollin, je le confie à ta garde ; tu m'en réponds sur ta tête. (à Macknave) La guerre terminée, nous réglerons ce compte d'homme à homme. (aux guerriers) Maintenant, mes amis, profitons de l'erreur de Middleton, qui croit toujours Batoche occupé, et allons nous assurer de la victoire.\n\n(Ils sortent en laissant Nollin et le prisonnier que des Métis ont garrotté.)\n\nSCÈNE VI.\n\nMACKNAVE, NOLLIN.\n\nMACKNAVE.\n\nMon ami, une seule question.\nRIEL.\n\nNOLLIN.\n\nParle.\n\nMACKNAVE.\n\nPourrais-tu me dire le sort qui m'est réservé?\n\nNOLLIN.\n\nNotre chef est juste; tu as mérité la mort, tu mourras.\n\nMACKNAVE.\n\nIl me semble que c'est ce qui peut m'arriver de pis.\n\nNOLLIN.\n\nTu oublies que souvent d'horribles supplices précèdent la mort des ennemis, qui tombent entre les mains des guerriers rouges; tu es le captif des indiens; mais rassure-toi, le chef ne permettra pas ces horreurs.\n\nMACKNAVE.\n\nEt, quand ma dernière heure sonnera-t-elle?\n\nNOLLIN.\n\nIl te l'a dit: lorsque sonnera l'heure de la victoire.\n\nMACKNAVE.\n\nTu es donc bien certain de la victoire?\n\nNOLLIN.\n\nNul n'est certain de l'avenir.\n\nMACKNAVE.\n\nEt qu'espères-tu, si la victoire est de ton côté?\n\nNOLLIN.\n\nManger tous les jours et dormir sous un toit.\n\nMACKNAVE.\n\nTes goûts sont modestes... N'as-tu jamais rêvé que tu devenais riche... très riche?\n\nNOLLIN.\n\nOui, mais ce sont des rêves.\nDEUXIÈME ACTE.\n\nMACKNAVE.\n\nDes rêves, qui, si tu le veux, deviendront des réalités. Ecoute, détache mes liens et suis-moi au camp du général ; là, tu recevras dix mille piastres, c'est-à-dire l'abondance, la richesse pour toute ta vie.\n\nNOLLIN (hésitant)\n\nQui me dit que ta bouche n'est pas menteuse ?\n\nMACKNAVE.\n\nDécouds la doublure de mon habit ; il y a là deux mille piastres ; prends-les en à compte. Le service que tu vas rendre au gouvernement sera payé au poids de l'or.\n\nNOLLIN.\n\nSoit ! (Il découd le vêtement, prend l'argent et coupe les liens de Macknave.) Tes liens sont coupés. Dépêche-toi ; on vient.\n\nMACKNAVE.\n\nFuyons ! (Macknave s'échappe.)\n\nSCÈNE VII.\n\nNOLLIN, ABRAHAM, STEWARD.\n\nNOLLIN.\n\nFuyons ! (Abraham arrive sans faire attention à lui.)\n\nABRAHAM.\n\nTécitément le métier va bien... ch'ai eu l'œil. (Apercevant Steward, l'air consterné.) Vous êtes bien triste, mister Steward ?\n\nSTEWARD.\n\nMister Abraham, je étais déshonoré !... je avais fait savoir au Pall Mall Gazette, que je avais beaucoup... beaucoup de scandales au Nord-Ouest à écrire dans le journal de moâ, aoh ! et rien, rien, pas le plus petite tiourpitoude !... Mister Abraham, vous être mon ami... Commettez, s'il vô plait, un attentat aux moeurs... si petit que vô vodrez pour le reporter dans le journal de moâ.\n\nABRAHAM.\n\nTemandez-moi blitôt de faire bartie te la salvation army. Hi...\nHi !... Allons, Mister Steward, brenez pour nous consoler une petit verre de gin.\n\nSTEWARD:\n\nVous payez le traite?\n\nABRAHAM:\n\nAvec votre argent, vous!\n\nSTEWARD:\n\nAllo! (Il prend le verre d'une main et boit, après avoir jeté 50 cents au juif, qui les empoché. Pendant qu'Abraham boit à son tour, Steward lui prend les 50 cents dans la poche de son gilet, puis il tire tranquillement son carnet et rédige) \"Les habitants du Nord-Ouest ont un tel penchant à l'ivrognerie, qu'ils n'hésitent pas à détrousser les voyageurs qui traversent la contrée. Moi-même, j'ai été victime de la rapacité d'un vieux juif, nommé Abraham.\" (À ce moment, Steward aperçoit les guerriers Métis et Indiens rentrer à reculons dans la caverne, le fusil à l'épaule et l'air désespéré. Il cache prestement son carnet derrière lui et va se diriger dans un coin écarté de la grotte, où il continue à rédiger son article.)\n\nSCÈNE VIII.\n\nRIEL, ABRAHAM, DUMONT, STEWARD, FRANÇOEUR, KAIRA.\n\nDUMONT:\n\nL'ennemi aura perdu nos traces; il a cessé de nous poursuivre.\n\nRIEL (abattu.)\n\nVaincus!... Nous sommes vaincus!...\n\nFRANÇOEUR:\n\nMais, ce matin encore?...\n\nDUMONT:\n\nNos plans ont été découverts ou livrés à l'ennemi.\n\nRIEL (d'une voix brève)\n\nOù est le prisonnier?\n\nDUMONT (cherchant)\n\nIl n'est plus là!\nDEUXIÈME ACTE.\n\nRIEL.\n\nEt Nollin ?\n\nDUMONT.\n\nDisparu !\n\nRIEL (d'une voix courroucée.)\n\nTout s'explique... Cela sent la trahison... Le misérable, lui en qui j'avais placé ma confiance, mon secrétaire intime... Pourquoi n'ai-je pas su découvrir sur son visage la noirceur de son âme. Sot que je suis !... Ne suis-je pas la cause involontaire de notre désastre. Malheur à moi !... (Il veut sortir.)\n\nDUMONT.\n\nOù vas-tu frère ?\n\nRIEL.\n\nMourir ! (La trompette anglaise sonne. Arrive par le fond de la grotte un Métis, suivi d'un officier anglais.)\n\nSCÈNE XI.\n\nLes mêmes, UN MÉTIS, UN PARLEMENTAIRE\n\nUN MÉTIS.\n\nUn parlementaire :\n\nDUMONT. (s'avançant vers lui.)\n\nQui est-tu ?\n\nRICHARDSON.\n\nLe capitaine Richardson.\n\nDUMONT.\n\nQue veux-tu ?\n\nRICHARDSON.\n\nParler au chef des insurgés.\n\nRIEL (s'avançant.)\n\nC'est moi.\n\nRICHARDSON.\n\n(lui présentant un pli cacheté.)\n\nUne lettre du général Middleton.\nRIEL\n\n(dépliant le papier et lisant :)\n\n\"Louis Riel, je suis prêt à vous recevoir, vous et votre conseil et à vous protéger, jusqu'à ce que le gouvernement ait pris des mesures à votre égard.\"\n\nDUMONT.\n\nMais, nous n'avons pas demandé à nous rendre.\n\nRICHARDSON.\n\nVotre retraite est découverte ; vous êtes cernés. Épargnez à tous une nouvelle émission de sang bien inutile.\n\nRIEL.\n\nMe rendre !... [Il réfléchit.] Après un moment de réflexion. Ecoutez ; M'assurez-vous que si je me rends, l'insurrection aura cessé de faire des victimes ?\n\nRICHARDSON.\n\nVous avez la parole du général.\n\nRIEL.\n\nC'est bien ! Partons, je vous suis.\n\nDUMONT.\n\nArrête, frère, cette lettre est perfide et cache encore une trahison.\n\nRIEL.\n\nJe connais les lois de la guerre. Du moment que le général vient lui-même nous demander à capituler, nous aurons la vie sauve.\n\nDUMONT.\n\nUn pressentiment me dit que tu te trompes. Refuse.\n\nRIEL.\n\nNon !... Je suis décidé. Si je suis victime de la perfidie de nos ennemis ; si au lieu de pardon, c'est l'échafaud qui m'attend, mon martyr sera utile à notre cause ; il servira à démasquer leur politique de fourbes, et mon sang répandu sur leurs têtes les couvrira d'opprobre. Du reste, dans tout pays civilisé, on ne condamne pas sans jugement. Ma soumission désarmera mes ennemis. Je subirai mon procès devant\ndes juges impartiaux. La grande publicité des débats, où la légitimité de notre révolte sera discutée, où tous nos griefs seront mis à jour, fera peut-être plus de bien à notre cause qu'une lutte désespérée... Viens, frère.\n\nDUMONT.\nMe rendre à l'anglais?... jamais !...\n\nRIEL.\nEt que comptes-tu faire?\n\nDUMONT.\nComme le buffalo, cerné par les chasseurs, je veux fondre sur l'ennemi avec ma poignée de braves; je m'ouvrirai dans leurs rangs une trouée sanglante et je gagnerai alors, à travers la prairie, un pays libre et ami.\n\nRIEL.\nAlors, adieu frère, et que Dieu te protège.\n\nDUMONT.\nMalheur à eux, s'ils trahissent; malheur à eux, s'ils touchent un cheveu de ta tête!... Un jour ou l'autre, ils entendront parler de Gabriel Dumont, et cette fois, il ne trouveront pas plus de grâce ou de pitié chez nous, qu'ils n'en auront montré envers toi. Le Canadien-Français d'aujourd'hui se souviendra de ses ancêtres. Nous voulons un gouvernement ami, nous ne supporterons jamais un maître.\n\nRIEL.\nAdieu, frère, adieu!\n\n(Ils se jettent dans les bras l'un de l'autre, puis Riel s'éloigne avec l'officier anglais.)\n\nDUMONT.\n(le regarde s'éloigner, et quand il a disparu, après un dernier signe d'adieu.)\n\nParti!... il est parti!... quelque chose me dit que je ne le reverrai plus (à ses compagnons, d'une voix forte, mais calme.) Maintenant, mes braves, la liberté ou la mort!...\n\nFIN DU 2ème ACTE.\nQUATRIÈME TABLEAU.\n\n3me ACTE.\n\nLA PRISON DE RÉGINA.\n\nUN MARTYR.\n\nUn cachot; deux escabots; une petite table. Il fait nuit. Une lumière est allumée sur la table.—La scène se joue au premier plan, devant le rideau d'acteur.\n\nSCÈNE I.\n\nRIEL.\n\n(assis, appuyé sur la petite table).\n\nQue de nuits j'ai passées ainsi dans l'insomnie !... Vain espoir, sans doute !... maintenant tout doit être fini !... Voilà trois mois que, confiant dans leurs promesses, j'ai mis bas les armes... ah !... Dumont !... tu es libre, toi ; tu vois en liberté la lumière du soleil... Que ne t'ai-je écouté ? (après un moment de silence.) Allons ! Résignons-nous. Que puis-je d'ailleurs ?... Dans un procès sans nom, odieux, ils ont fermé la bouche à la défense. Au mépris de toute loi et de toute justice, des juges sans pudeur, des jurés sans entrailles, misérables instruments d'un ministre sans foi, m'ont condamné à mort !... à mort !... et depuis vingt-cinq jours, j'attends dans une horrible incertitude une grâce bien problématique... Chaque fois que s'ouvre la porte de mon cachot, je me demande si c'est la vie ou la mort qui va entrer... Tout me dit pourtant d'espérer... Le jour où je suis né, j'étais sans force et sans appui, mais ma mère était là, qui veillait sur moi... Aujourd'hui, je suis de même, sans appui et sans force, mais le Nord-Ouest est ma mère, et ma mère ne me tuera pas... mon pays se souviendra et saura disputer ma vie à nos maîtres. Tous mes fidèles\nTROISIÈME ACTE\n\namis du bas-Canada, tous mes vieux camarades de la province de Québec seront assez puissants pour imposer leurs volontés à un gouvernement qui m'a condamné. N'avons-nous pas au pouvoir des ministres Canadiens-Français?... des ministres, qui sont mes frères, Langevin, Chapleau, Caron?... le même sang ne coule-t-il pas dans nos veines? Ils savent bien, ceux-là, que lorsque j'ai pris les armes, je me suis battu pour la défense de nos droits, avec le courage de mes convictions, mais avec des mains pures. Le saint évêque Bourget ne me disait-il pas que j'avais une mission à remplir? Il ne se trompait pas. C'est Dieu lui-même, le soutien des opprimés, qui m'a dicté ma conduite. Dieu, qui m'a protégé à la bataille de la Saskatchewan, alors que les balles pleuvaient autour de moi, Dieu qui n'a pas voulu que je meure alors, ne le permettra pas à présent... Ma grâce!... Mais, si mon martyre peut-être utile à mon peuple du Nord-Ouest, je lui donne ma vie... (après un moment de silence) Si tel est votre dessin, ô mon Dieu; si ma mort est décidée, par pitié, tirez-moi au plus tôt de cette cruelle incertitude, plus terrible que la mort même... Faites que je l'apprenne... Faites que je le sache... Cependant, que votre volonté soit faite, et non la mienne. (Il s'accoude à la table, pensif.)\n\nAPOTHEOSE.\n\n(A ce moment, la toile du fond s'ouvre doucement par le milieu, laissant voir à l'arrière plan le Sosie de Riel, à genoux, tête nue, la chemise entr'ouverte sur la poitrine, la corde au cou; au-dessus, sur un piédestal, la Liberté, vêtue d'un péplum blanc, tient suspendue sur la tête du supplicié une couronne d'immortelles. À droite et à gauche du piédestal, des sauvages et des Métis donnent la main à des Canadiens et à des officiers du 65ème; entre eux, des instruments d'agriculture, des charrettes, des gerbes de blé, etc. Cette scène-tableau est illuminée au feu de Bengale. Au premier plan, Riel, relativement dans l'ombre,—l'illumination sortant des portants d'arrière plan, et n'éclairant que le tableau—apothéose,—Riel, la tête appuyée sur une main, l'œil fixe, croit voir cette vision comme dans un rêve.—La musique joue en sourdine et lentement la \"Marseillaise.\"—La toile du fond se referme doucement, reformant les murs de la prison de Riel.—Quand la vision a disparu, Riel reprend:\n\nMerci, mon Dieu, vous avez eu pitié de moi... je connais maintenant le sort qui m'est réservé... Je marcherai calme et tranquille au supplice. L'avenir est désormais assuré à mon peuple du Nord-Ouest, et les marches de l'échafaud me rapprocheront du ciel.\nRIEL.\n\nSCÈNE II.\n\nUN SOLDAT (l'arme au bras), LE SHÉRIF, RIEL.\n\nRIEL (se levant)\n\nLe shérif!... Eh ! bien, Monsieur, vous venez avec la grande nouvelle?... J'en suis bien aise.\n\nLE SHÉRIF.\n\nLouis Riel, j'ai le pénible devoir de vous apprendre que votre grâce est rejetée.\n\nRIEL.\n\nEt moi, je suis heureux d'apprendre qu'enfin je vais être débarrassé de mes souffrances.\n\nLE SHÉRIF.\n\nL'exécution doit avoir lieu demain à huit heures du matin. Avez-vous quelques dispositions à prendre pour après votre mort?\n\nRIEL.\n\nJe désire que mon corps soit remis à mes amis, pour être enterré à Saint Boniface, dans le cimetière Français.\n\nLE SHÉRIF.\n\nCeci est pour votre corps... mais pour vos biens?\n\nRIEL.\n\nMon cher monsieur, je n'ai pour tout bien que ceci, (il montre son cœur) et ceci, je l'ai donné à mon pays il y a quinze ans; c'est tout ce qui me reste maintenant.\n\nLE SHÉRIF.\n\nFaut-il vous envoyer un prêtre?\n\nRIEL.\n\nIl y a longtemps que j'ai fait ma paix avec mon Dieu. Je suis préparé à mourir.\n\nLE SHÉRIF.\n\nC'est bien!... (Il va pour sortir. Riel l'arrête.)\nRIEL.\n\nAh! j'oubliais; faites savoir à mes amis de la province de Québec que je les remercie du fond du cœur de tout ce qu'ils ont fait pour moi.\n\nLE SHÉRIF.\n\nCe sera fait!\n\nRIEL.\n\nUne dernière demande...... Pourrai-je dire quelques mots sur l'échaud?\n\nLE SHÉRIF,\n\nVous le pourrez.\n\nRIEL.\n\nMerci, monsieur. Vous verrez que je ne faiblirai pas; je sentirai, lorsque le moment viendra, que j'aurai des ailes, qui m'enleveront là-haut.\n\nLE SHÉRIF.\n\nAdieu, Riel!\n\nRIEL.\n\nAdieu, mon ami! (Le shérif sort, suivi du soldat.)\n\nSCÈNE III.\n\nRIEL.\n\nEncore quelques heures et j'aurai vécu... Allons, il me reste juste le temps de faire mes adieux suprêmes à ceux qui m'ont aimé. (Il se met à une petite table et écrit). \"Ma chère mère, tout est fini pour moi sur la terre; je viens vous faire mes adieux et vous demander votre bénédiction. À ma chère femme, à mes pauvres petits enfants, à mes frères et aux autres personnes, qui me sont chères, dites leur pour moi un adieu suprême. J'ai demandé au ciel qu'il vous donne la force de supporter ce coup funeste; pour moi, je suis calme; Dieu me tient par la main. Je vous embrasse tous avec les sentiments d'amour dont mon cœur de chrétien est capable.\"\nRIEL.\n\nSCÈNE IV.\n\nUN SOLDAT, RIEL, FRANÇOEUR.\n\nFRANÇOEUR (Entrant dans la prison suivi d'un soldat.)\n\nRiel !\n\nRIEL.\n\nFrançœur !... (Ils se serrent la main.)\n\nFRANÇOEUR.\n\nCe n'est pas sans peine; mon ami, que j'ai obtenu la permission de vous voir.\n\nRIEL (au soldat.)\n\nPouvez-vous nous laisser un moment seuls? (Le soldat se retire.)\n\nFRANÇOEUR.\n\nAh! mon ami, que viens-je d'apprendre? Les misérables !...\n\nRIEL.\n\nRemettez-vous, Françœur; voyez, je suis calme, moi, et presque joyeux.\n\nFRANÇOEUR.\n\nVous avez plus de courage que moi, vous. Ah! que les hommes sont de méchantes bêtes, et combien d'actes insensés qui m'en dégoutent; plus ils se disent civilisés, plus ils sont sauvages, en vérité; j'ai presque l'envie d'aller m'établir chez mes amis les Pieds-Noirs avec ma femme Kaira.\n\nRIEL.\n\nMon ami, je n'ai que peu de temps à vivre; apprenez-moi le but de votre visite.\n\nFRANÇOEUR.\n\nJ'ai voulu vous voir une dernière fois et vous dire... et vous assurer que votre souvenir... (émot) que le souvenir de Louis Riel, nous le garderons, comme on garde un trésor. Il passera d'âge en âge à nos enfants, comme une relique sacrée, qui, s'il en est besoin un jour, leur donnera du courage à l'heure de l'épreuve. Voici moment son comptes; je n'ai pas le droit de vous les prendre. Vous qui verrez bientôt Dieu, bénissez-moi; je pars.\nTROISIÈME ACTE.\n\nRIEL.\n\nDans mes bras, mon ami. (Ils s'embrassent. Dans ce moment la croix de Kaïra, que Françoise portait sur lui, apparaît suspendue à une ganse de soie noire sur sa poitrine. Riel laperçoit.) D'où vous vient cette petite croix ?\n\nFRANÇOEUR.\n\nJe la tiens de ma fiancée Kaïra, la fille de Takouaga.\n\nRIEL.\n\nKaïra, fille de Takouaga ?... C'est une chose étrange !... Je ne souviens avoir donné cette croix, il y a douze ans, à une enfant, la fille de notre plus mortel ennemi, MacKnave !... Vraiment, c'est bien étrange ! (Il examine la croix.) MacKnave ! ah ! je me souviens... je me souviens maintenant : Takouaga était la mère d'un chef qui m'accompagnait, et qui fut tué ce jour-là... ou plutôt assassiné chez MacKnave... C'était la nourrice de la petite Nelly... Kaïra et Nelly seraient-elles la même personne ?\n\nFRANÇOEUR (vivement.)\n\nQue dites-vous ? Si Kaïra est la fille de MacKnave, mieux vaudrait pour elle ne jamais retrouver son père.\n\nRIEL.\n\nLes voies de la Providence sont impénétrables. Si le ciel a voulu que la lumière se fasse sur le sort de Kaïra, ce serait offenser Dieu que d'aller à l'encontre de ses desseins. Interrogez Takouaga, et faites ce qu'honneur vous commande.\n\nFRANÇOEUR.\n\nJe vous le promets... On frappe.\n\nRIEL.\n\nC'est sans doute le père André, mon confesseur.\n\nFRANÇOEUR.\n\nAdieu, frère, je vous laisse avec lui, adieu ! (Ils s'embrassent une dernière fois. Françoeur sort. Entre MacKnave.)\nRIEL\n\nSCÈNE V.\n\nRIEL, MACKNAVE.\n\nRIEL (étonné.)\n\nVous ?...\n\nMACKNAVE.\n\nMoi !... (raillant.) Vous ne m'attendiez pas sans doute?... Ah !... ah !... je tenais à vous faire ma petite visite de condoléance et m'assurer par moi-même, si ce qu'on dit de vous est vrai... que la nouvelle de votre supplice n'avait pas abattu cet orgueil, qui vous seyait si bien,... cette fierté, qui vous allait à ravir.\n\nRIEL (très calme.)\n\nDites plutôt que vous teniez à venir insulter un homme qui va mourir,... Ce n'est pas très brave !\n\nMACKNAVE.\n\nMisérable !... ton courage a disparu, il paraît ; je t'ai connu plus emporté.\n\nRIEL.\n\nC'est que je n'ai plus aujourd'hui dans le cœur que de la pitié. Que vous ai-je fait, à vous, pour que vous me poursuiviez de votre haine, jusque dans ma prison ?... à la veille de ma mort ?\n\nMACKNAVE.\n\nCe que tu m'as fait?... Ton père n'est-il pas cause de la ruine des miens ?... Toi même, ne t'es pas trouvé constamment sur ma route ?... N'est-ce pas cause enfin de mes malheurs ?... de la ruine de mes espérances : ma femme morte de douleur, ma fille enlevée par une indienne et aujourd'hui, sans doute, la femme d'un de ces diables rouges ?... Malédiction ! j'aimerai mieux la savoir morte.\n\nRIEL.\n\nJe pourrais vous laisser dans l'ignorance de ce qu'est devenue votre fille ; mais à votre conduite indigne, je répondrai par un bienfait. Ras- surez-vous, Macknave, votre fille vit, et va bientôt devenir la femme, non pas d'un de ces diables rouges, comme vous le disiez tout-à-l'heure, mais bien d'un homme d'esprit et de cœur, estimé de ses concitoyens, à femme d'un des premiers journalistes de New-York.\nTROISIÈME ACTE.\n\nMACKNAVE:\n\nTu mens!\n\nRIEL.\n\nSur mon salut éternel, je dis la vérité.\n\nMACKNAVE (suppliant.)\n\nAh! Riel, dis-moi où je pourrai retrouver mon enfant. Il serait trop cruel, maintenant que tu as parlé, de ne pas achever. Pardonne-moi je suis un misérable qui demande grâce à tes genoux... aie pitié de moi. Riel, si tu te taiais, ta vengeance serait trop horrible!\n\nRIEL.\n\nLa vengeance n'est point dans mon cœur. Votre fille se trouve au camp des Indiens Pieds-Noirs, sur les bords du lac aux-Canards. Son nom est Kaïra.\n\nMACKNAVE (très ému)\n\nKaïra! Ciel! je me souviens!... ah! quel crime plus atroce ai-je failli commettre? Le ciel ne l'a pas permis, et il s'est servi de cet homme pour l'empêcher. Noble cœur, sois béni tous les jours de ta vie... ah! j'oublie!... la mort!... Misérable, que je suis!... que ne puis-je racheter ta vie au prix de la mienne!... Pardon, pardon!\n\n(Entrent le shérif et le bourreau, accompagnés de deux soldats.)\n\nSCÈNE VI.\n\nRIEL, MACKNAVE, SHÉRIF, LE BOURREAU, SOLDATS.\n\nRIEL (En les voyant entrer.)\n\nSeigneur, pardonnez-moi mes offenses, comme je pardonne à ceux qui m'ont offensé.\n\nMACKNAVE.\n\nAh! Riel!! Riel!!... (Il tombe à genoux.)\n\nRIEL.\n\nJe vous bénis, mon frère.\n\nLE SHÉRIF (à Riel.)\n\nEtes-vous prêt?\nRIEL.\n\nRIEL.\n\nJe suis prêt.\n\nLE SHERIF.\n\nN'avez-vous plus rien à dire ?\n\nRIEL.\n\nJe n'ai plus rien à dire.\n\nLE SHERIF.\n\nMarchons !\n\nRIEL.\n\nMon Dieu ! je me confie à vous. (il monte vers la porte. Maeknave est à genoux et sanglotte).\n\nFIN DU 3me ACTE.\nCINQUIÈME TABLEAU.\n\n4me ACTE.\n\nLE CAMP DES INDIENS PIEDS-NOIRS.\n\nLA JUSTICE DE DIEU.\n\nLes bords du lac aux canards. Même décor qu'au second tableau, premier acte. Au premier plan, Steward et Abraham, à droite. À gauche, au deuxième plan, Kaira et Takouaga. Kaira, assise, rêve. Takouaga s'occupe à un travail de filets.\n\nSCÈNE I.\n\nSTEWARD, ABRAHAM, KAIRA, TAKOUAGA.\n\nSTEWARD.\n\nJe stiais stioupide!... Je aimais beaucoup... beaucoup... cette petite Kaira!... aoh! yes. Voilà trois mois que mon... que mon... aoh! yes, mon rival il était parti pour faire le redactionne du procès de Riel!... yes, il était parti, et moa, il était resté... Je stiais beaucoup... beaucoup cette petite Kaira... et il aimait pas, moa du tout. Trois mois, yes!... et cette petite sauvagesse il pensait toujours à loui... Je stiais stioupide... véritablement stioupide.\n\nABRAHAM (qui s'est approché doucement).\n\nQu'est-ce que vous barbodez entre vos dents?... Est-ce que vous brébarez un article pour votre journal?... Foyons, là, entre amis, vous êtes bas goûtent, che le fois, ch'ai l'œil... Est-ce que c'est votre enguête, qui fus truble la cervelle?... Foyons, là, entre amis... Hé?\n\nSTEWARD.\n\nMon journal?... je ne pensais pas à loui, pas à loui beaucoup fort en ce moment... mon journal! Eh! je n'ai pas encore envoyé à loui\nune petite article, depuis que je souis au Canada. Moa, je voulais partir,... trouver rien à faire dans le dominion.\n\nABRAHAM.\n\nA brobos... foulez sous quelque chose te trôle? de drôles trôles pour le Pall Mall Gazette?... Vouï?... Eh! bien, enfoyez-lui la dernière dépeche du général Middleton; tenez, foyez l'... (Il se fouille.) Attendez, où l'at-je mise?... ah! foïla!... (Il déplie une feuille de papier qu'il a fini par trouver au fond d'une de ses poches.) \"Insurrection vaincue, restent trois sauvages\" (à Steward.) Vous-comprenez, trois sauvages; ah! ah! (Lisant) \"trois sauvages sur une montagne, leurs meilleurs tireurs.\" (Parlé) Che grois bien. (Lisant) \"leurs meilleurs tireurs; mon armée les cèment.\" (Parlé) ah! ah! c'était bien chôli!... che foudrais foir ça... ah! ah! (Lisant) \"attendons qu'ils aient épuisé munitions pour nous emparer d'eux.\" (Parlé) Eh! Eh! qu'en bensez-vous? drôles trôles... Eh! Eh! drôles trôles!\n\nSTEWARD.\n\nMoa, by God, je aurai bien fait autant...\n\nABRAHAM.\n\nFous auriez bien aussi douché, comme Midleton, les vingt mille piastres dont le gouvernement de Sir John lui a fait cadeau?\n\nSTEWARD.\n\nCorrect! (Il rit froidement.) Vous êtes très drôle, oh! yes, très drôle. (Il baille à se décrocher la machoire.) Mister Abraham, je voulais touer le temps!... Quoi, il faut faire pour touer le temps!... Vo savoir jouer au cousino!\n\nABRAHAM.\n\nUn peu!... Vouï.\n\nSTEWARD.\n\nJouons... Vôlez-vô?\n\nABRAHAM.\n\nJe veux bien; pour vous oplicher.\n\nSTEWARD.(à part.)\n\nAh! yes, il fallait perdre rien, non! (Il tire son carnet et rédige.) \"Les peuplades du Nord-Ouest ils s'adonnaient avec frénésie. (Parlé) ah! chôlie expressionne. (Ecrivant) avec frénésie à la funeste pas\nTROISIÈME ACTE.\n\nsionne. (Parlé) ah ! de plus chôli en plus chôli !... (Ferivant) funeste passionne du jeu.\" (Parlé) 1er article, very well ! (Il remet son carnet dans sa poche.)\n\nABRAHAM\n\n(après avoir tiré un jeu de cartes, qu'il a cherché dans toutes ses poches.)\n\nY êtes-vous?... Foyons !\n\nSTEWARD.\n\nJ'y souis. (Il s'assied en face d'Abraham.)\n\nABRAHAM.\n\nGommençons. À qui te faire ?\n\nSTEWARD.\n\nÀ tout seigneur tout honneur, je donne.\n\nABRAHAM.\n\nBas di tout !\n\nSTEWARD.\n\nAlors, très bienne. (Il donne à qui fera en nommant tout haut les cartes qui passent. Arrivé au premier as.) Premier as, à moa, je savais bienne, coupez.\n\n(La partie s'engage ; scène de mine.)\n\nKAÏRA. (soucieuse.)\n\nComme George tarde à revenir ! M'aurait-il oubliée. Oh ! s'il en était ainsi, je ne pourrais survivre à l'oubli de celui, en qui j'ai mis tout mon amour... Mais non, c'est impossible !... Je l'aime tant, et son image, de jour en jour plus vivante en mon cœur, me fait prévoir son retour avant peu.\n\nTAKOUAGA.\n\nMa fille est triste ?\n\nKAÏRA.\n\nOui, Takouaga !\n\nTAKOUAGA.\n\nPourquoi Kaïra ne m'appelle t'elle jamais sa mère ?\n\nABRAHAM. (vivement.)\n\nDix ! che pâtis !...\nRIEL\n\nSTEWARD (froidement.)\n\nPatissez, moâ, je prend vô, aoh l'yes.\n\nKAIRA (après un soupir)\n\nSi tu étais ma mère, Takouaga, il y a longtemps que tu m'aurais parlé de mon père que je n'ai point connu.\n\nTAKOUAGA (embarrassée.)\n\nTu étais si jeune, quand il est mort...\n\nKAIRA.\n\nEtait-ce un guerrier ?\n\nABRAHAM (triumphant.)\n\nDix ! je repâtis.\n\nSTEWARD (froidement.)\n\nRepâtissez, moâ, je reprends vô ; aoh, yes.\n\nABRAHAM (en colère.)\n\nGod fertom ! (Il continue à jouer.)\n\nTAKOUAGA (après un moment d'hésitation).\n\nNon... c'était un trappeur... un visage pâle...... Mais, il est temps de faire sécher et boucaner la viande que nos chasseurs ont rapportée. Viens-tu ?... (Kaira fait un signe négatif; Takouaga rentre dans sa tente.)\n\nABRAHAM (se levant subitement.)\n\nFous drichez... che le fois pien, ch'ai l'œil... et le pon... voui !\n\nSTEWARD (impossible.)\n\nMoâ, c'être faux !\n\nABRAHAM.\n\nChe ne chôue blus afec fous. (Il jette ses cartes et sort.)\n\nSTEWARD.\n\nSoit !... mauvais joueur. (Il tire son carnet.) Voyons ! (Il rédige) Funeste passionne du jeu... (Parlé) bienne. (Ecrivant) leur mauvaise foi est proverbiale !... (Parlé) Proverbiale, très bien, aoh ! very well. (Ecrivant) Ils trichent tous effrontément... (Parlé) Ce était étonnant comme je 'avais des chôlis expressionnnes. Effrontément, allo ! je 'avais assez pour envoyer ma première article. (Il rentre dans sa tente.)\nQUATRIÈME ACTE.\n\nSCÈNE II.\n\nMACKNAVE, KAÏRA, (pensive au pied de sa tente.)\n\nMACKNAVE (entrant ; à la vue de sa fille, il s'arrête ; à part.)\nMa fille ! c'est ma fille !... comme le cœur me bat !... quel accueil va-t-elle me faire ? Me croira-t-elle ?... Consentira-t-elle à me suivre ?\nVivre près d'elle toujours !... quelle heureuse vieillesse !... il me semble que je ne mérite pas tout mon bonheur. (haut) Kaïra !\n\nKAÏRA (se levant brusquement.)\nCiel !... Vous ? Je vous reconnais, misérable, que venez-vous faire ici ?... (criant) À moi ! à moi !... (entrent Takouaga et les Indiens.)\n\nSCÈNE III.\n\nMACKNAVE, KAÏRA, TAKOUAGA, LA NUÉE ORAGEUSE, MÉTIS ET SAUVAGES,\n\nLA NUÉE ORAGEUSE.\n\nQu'y a-t-il ?\n\nKAÏRA (frémissante.)\nVous voyez cet homme, c'est celui-là qui a voulu m'enlever, il y a trois mois ; c'est lui qui a blessé Franceur d'un coup de revolver.\n\nLA NUÉE ORAGEUSE.\n\nJe le reconnais. C'est le traître qui a voulu assassiner Riel et qui nous a vendus aux anglais, après avoir acheté sa liberté à Nollin.\n\nTOUS (se précipitant sur lui.)\nÀ mort ! À mort !\n\nKAÏRA.\n\nÀ mort !\n\nMACKNAVE.\n\nArrêtez !... Kaïra, vous allez commettre un crime. Si odieux que je vous paraissiez, ne faites pas verser mon sang, vous seriez maudite.\n\nKAÏRA (indignée).\nLâche, qui a peur de la mort !\nRIEL.\n\nMACKNAVE.\n\nJe n'ai point peur de mourir depuis que Riel m'a montré comment on marchait à la mort.\n\nKAÏRA.\n\nMalheureux ! Ne prononce jamais le nom de celui dont tu as causé la perte.\n\nTOUS.\n\nÀ mort ! À mort !\n\nMACKNAVE (aux Indiens et aux Métis).\n\nArrêtez ! (à Kaïra) Kaira, je suis ton père !\n\nKAÏRA (avec indignation).\n\nQu'oses-tu dire ? À quel odieux mensonge as tu l'audace d'avoir recours pour sauver ta vie ?\n\nTOUS.\n\nÀ mort ! À mort !\n\nMACKNAVE.\n\nTu ne veux pas me croire ? Eh ! bien... (à Takouaga). Parle, toi.\n\nTAKOUAGA (impassible).\n\nQui es-tu ? Que veux-tu ?\n\nMACKNAVE.\n\nNe reconnais-tu pas ton ancien maître ?... Réponds ; n'est-ce pas là ma fille, que tu m'as enlevée il y a douze ans ?... Mais, réponds donc ; dis donc que c'est ma fille.\n\nTAKOUAGA (froidement).\n\nTakouaga ne sait pas ce que tu veux dire ; elle ne sait qu'une chose, c'est qu'elle avait un fils. Il était à peine homme que déjà sa chevelure était ornée de trois plumes d'aigle, insigne que les chefs seuls ont le droit de porter. Tu l'as fait assassiner. (Montrant Kaïra.) Mais il me reste ma fille, Kaïra, la fille de Takouaga et non celle d'un lâche imposteur, d'un vil assassin.\n\nTOUS.\n\nÀ mort !... À mort !...\n\nMACKNAVE (accablé).\n\nJe suis perdu !...\nQUATRIÈME ACTE.\n\nTAKOUAGA\n(s'approchant de Macknave et lui parlant à l'oreille.)\n\nOui, perdu ! mon fils enfin va être vengé... et bien vengé... Kaïra ignorerait toujours qu'elle est ta fille,... elle ne se rappellera de son père que pour le maudire.\n\nMACKNAVE (attiré.)\n\nDémon !...\n\nSCÈNE IV.\n\nLES MÊMES, FRANÇŒUR.\n\nFRANÇŒUR\n\n(Arrivé par la gauche, a entendu les dernières paroles de Takouaga ; il se jette au milieu des sauvages et des métis prêts à entraîner Macknave. À Takouaga.) Que dis-tu ?... C'est donc sa fille ? (Takouaga fait un mouvement de surprise et ne répond pas. Aux Indiens.) Arrêtez, frères ! au nom de Kaïra et au mien, je demande la grâce de cet homme.\n\nLA NUÉE ORAGEUSE.\n\nNous n'avons rien à te refuser, frère, cet homme aura la vie sauve.\n\nKAÏRA (surprise.)\n\nQue veut dire ceci ?\n\nFRANÇŒUR (gravement.)\n\nEcoute !... Il y a un mois à peine, tandis que la potence se dressait sur la place de Régina, attendant le glorieux martyr canadien, j'obtins la permission de dire un suprême adieu à notre bien aimé Riel. En me serrant pour la dernière fois dans ses bras, la noble victime reconnut sur ma poitrine la petite croix dont tu m'as fait présent le jour de nos fiançailles. Cette croix, c'est lui-même qui l'avait donnée, il y a douze ans, à une jeune enfant, la fille du gouverneur du fort Prince de Galles. L'enfant, qui s'appelait Nelly, fut volée le jour même par une indienne, dont le gouverneur avait assassiné le fils, et élevée par le chef d'une tribu indienne, qui lui donna le nom de Kaïra.\n\nKAÏRA (émue.)\n\nCiel !... Moi !... et mon père ?...\nRIEL\n\nFRANCEUR (montrant Macknave.)\nL'ancien gouverneur du fort... ton père?... le voilà...\n\nKAÏRA (douloureusement.)\nMon père!... Dieu!... c'est mon père! (Elle se cache la figure dans ses mains. Tous les Indiens métis font place à Macknave.)\n\nMACKNAVE (s'avançant vers Kaïra.)\nEh! bien, Kaïra, ma Nelly d'autrefois, me crois-tu maintenant? Je suis bien misérable!... Pardonne!\n\nKAÏRA\nJe n'ai pas à vous juger.\n\nMACKNAVE.\nConsens-tu à me suivre?\n\nKAÏRA (avec énergie.)\nQuitter mes frères, jamais!... je ne puis... je ne puis!...\n\nMACKNAVE.\nAu nom de ta mère, qui est morte de douleur.\n\nKAÏRA.\nMa mère!... (Elle s'attendrit.)\n\nMACKNAVE.\nAie pitié de ma vieillesse et de mon malheur. J'étais resté seul sans femme et sans fille... allons! Nelly!\n\nKAÏRA\n(avec un grand effort, mais calme.)\nMon devoir est de vous obéir. (Elle se tourne vers Franceur, qui baissant la tête, regarde à terre, n'osant la conseiller. Se retournant vers Macknave.) Je vous suivrai, mon père.\n\nTAKOUAGA\n(d'une voix sombre et étouffée.)\nEnfer! (Elle glisse la main sous son corsage et en retire un couteau.)\n\nMACKNAVE (La figure radieuse)\nAllons, chère enfant, fais tes adieux à tes compagnons, moi, je vais préparer le départ.\nQUATRIÈME ACTE.\n\nKAÏRA (allant servir la main à ses compagnons.)\n\nGeorge !... mes amis !...\n\n(Pendant que Kaïra fait ses adieux en pleurant à sa tribu et à Francaur, Takouaga s'approche de Macknavé, l'arrête au moment où il allait sortir et le ramène au premier plan.)\n\nTAKOUAGA (la figure contractée.)\n\nAinsi, tu pars, tu m'enlèves mon enfant ?\n\nMACKNAVE.\n\nC'est ma fille !... elle ne peut rester ici !\n\nBAKOUAGA.\n\nTu nous séparés ?\n\nMACKNAVE.\n\nJe ne puis t'emmener avec elle.\n\nTAKOUAGA.\n\nAinsi, après tous tes crimes, tu t'en irais joyeux avec Kaïra, pendant que moi seule, je resterais dans ma vieillesse à pleurer mon fils assassiné par toi ?\n\nMACKNAVE (impatienté.)\n\nAllons, vieille, laisse moi. (il la repousse de la main.)\n\nTAKOUAGA (avec dégoût.)\n\nIl y a du sang sur tes mains !\n\nMACKNAVE.\n\nLaisse-moi !\n\nTAKOUAGA (s'exaltant.)\n\nPrends garde ; le sang veut du sang.\n\nMACKNAVE.\n\nDieu ordonne de pardonner.\n\nTAKOUAGA.\n\nPardoner ! quand tu m'enlèves ma vie entière !... pardonner ! C'est le Dieu des chrétiens qui dit cela ; tu t'en rappelles aujourd'hui. Le nôtre dit : Venge-toi.\nRIEL.\n\nMACKNAVE.\n\nMe laisseras-tu partir?\n\nTAKOUAGA (au paroxysme de l'exaltation.)\n\nEh bien, puisque tu le veux, va-t-en maintenant. (Elle le frappe au cœur d'un coup de couteau.)\n\nMACKNAVE (étendant les bras.)\n\nAh! je suis mort!... (Il tombe; on l'entoure.)\n\nTAKOUAGA.\n\nSois content, mon fils!...\n\nMACKNAVE (d'une voix entrecoupée par les affres de l'agonie.)\n\nDieu, en me refusant le bonheur au moment où j'y touchais, m'a puni de mes crimes!... que son nom soit béni. (Il meurt.)\n\n(Kaira s'agenouille et prie à côté de son cadavre.)\n\nSCÈNE V.\n\nLES MÊMES, moins MACKNAVE mort.\n\nFRANCŒUR.\n\n(s'approchant de Kaira et lui touchant doucement l'épaule.)\n\nLa Providence a ses desseins, ma chère Kaira; c'est maintenant ton mari qu'il faut suivre. (Il la relève et la tient par la main.)\n\nUN MÈTIS.\n\nTu nous abandonnes, frère?\n\nFRANCŒUR.\n\nNon!... car ma tâche à moi commence. Maintenant que la sanglante tragédie du Nord-Ouest est terminée, je veux l'écrire au livre de l'histoire, pour la gloire des uns et la honte éternelle des autres.\n\nUN MÈTIS.\n\nQuand te reverrons-nous, frères?\n\nFRANCŒUR.\n\nLorsque pour vous sonnera l'heure de la justice et de la liberté.\n\nFIN DU QUATRIÈME ET DERNIER ACTE.\nERRATA\n\nPrologue, page 23, Scène XV :\n\nTakouaga ! Takouaga !\n\nELIZABETH.\n\nTAKOUAGA.\n\n(à la fenêtre, tenant l'enfant, etc., etc.)\n\nPremier Acte, page 41, 1ère ligne :\n\nMACKNAVE.\n\nBien !... En ce cas; etc.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001571.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 78, "total-input-tokens": 110114, "total-output-tokens": 29959, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 204, 1], [204, 204, 2], [204, 363, 3], [363, 363, 4], [363, 565, 5], [565, 565, 6], [565, 1170, 7], [1170, 1170, 8], [1170, 2662, 9], [2662, 2662, 10], [2662, 3484, 11], [3484, 5095, 12], [5095, 6502, 13], [6502, 7603, 14], [7603, 8842, 15], [8842, 9951, 16], [9951, 11050, 17], [11050, 12706, 18], [12706, 14098, 19], [14098, 15017, 20], [15017, 16196, 21], [16196, 17298, 22], [17298, 18207, 23], [18207, 19720, 24], [19720, 21145, 25], [21145, 21764, 26], [21764, 23267, 27], [23267, 24412, 28], [24412, 25511, 29], [25511, 26612, 30], [26612, 27750, 31], [27750, 28931, 32], [28931, 31046, 33], [31046, 32852, 34], [32852, 34013, 35], [34013, 35170, 36], [35170, 36240, 37], [36240, 37302, 38], [37302, 38502, 39], [38502, 40022, 40], [40022, 41635, 41], [41635, 42542, 42], [42542, 43624, 43], [43624, 44699, 44], [44699, 45767, 45], [45767, 46622, 46], [46622, 47928, 47], [47928, 49109, 48], [49109, 50283, 49], [50283, 51387, 50], [51387, 52409, 51], [52409, 53594, 52], [53594, 54496, 53], [54496, 55868, 54], [55868, 57137, 55], [57137, 58026, 56], [58026, 59350, 57], [59350, 60743, 58], [60743, 62200, 59], [62200, 64781, 60], [64781, 65839, 61], [65839, 67030, 62], [67030, 68359, 63], [68359, 69801, 64], [69801, 71429, 65], [71429, 72683, 66], [72683, 72933, 67], [72933, 74240, 68], [74240, 75937, 69], [75937, 77091, 70], [77091, 78471, 71], [78471, 79752, 72], [79752, 80994, 73], [80994, 82568, 74], [82568, 83770, 75], [83770, 84857, 76], [84857, 86050, 77], [86050, 86253, 78]], "primary_language": ["fr", "None", "fr", "None", "fr", "None", "fr", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]