[{"id": "21e0c1d5678c7a4288ce9754d733815ea54fc2e0", "text": "A PSYCHO-MEDICAL HISTORY\n\n—or—\n\nLOUIS RIEL.\n\nBy DANIEL CLARK, M.D.,\nMedical Superintendent of the Asylum for Insane, Toronto.\n\n[From the American Journal of Insanity, for July, 1887.]\nA PSYCHO-MEDICAL HISTORY OF LOUIS RIEL.*\n\nBY DANIEL CLARK, M.D.,\nMedical Superintendent of the Asylum for Insane, Toronto.\n\nLouis Riel was about forty-four years of age when he was executed. He was born in the Red River country when it was in the possession of the Hudson Bay Fur Company. Riel was a \"half-breed,\" so-called, but was only one-eighth Indian. The rest of the personal unit was French-Canadian. He was educated at St. Boniface Roman Catholic School and Seminary, near Winnipeg, until he grew up to manhood. He proved to have more than ordinary aptitudes and intelligence, and applied himself with great diligence to take advantage of his opportunities, as his parents were poor. These seminaries of learning were conducted under the auspices of Archbishop Taché. The lad Riel attracted his attention, and ever afterward he took a kindly interest in him. The archbishop found that the young man was anxious to become a priest. Seeing in him talents which would fit him for the sacred office, when his education would be completed, he sent him to Montreal to finish his studies. A French lady, also, took more than a passing interest in the young man, and extended to him her aid and encouragement. While at college he behaved very well and studied hard, but being somewhat retiring and taciturn, he made few companions. This quiet disposition was in striking contrast to his history in after years. As was natural, he kept a regular correspondence with his benefactor, the archbishop. It was not long, however, before his letters showed that strange and Utopian ideas were taking possession of his mind. The writer had an opportunity to examine a number of these letters, and it was evident from the tenor of their contents that the young man had imbibed the idea of carrying out schemes which would make him the head centre of a religious movement, which would, in his estimation, astonish the world. Money was necessary, and the rich must be forced to bestow on him such amounts as he thought necessary. This was the main idea he elaborated in the letters. So to quote any of them would be wearisome. During the latter part of the five years he attended college in Montreal, those letters\n\n* Read before the Association of Medical Superintendents of American Institutions for the Insane, at Detroit, Mich., June 14–18, 1887.\nshowed to Archbishop Taché that Riel's mind had become so erratic and full of delusions as to incapacitate him from becoming a priest. The project was abandoned, as he lacked that judgment and discretion so requisite of any man about to enter holy orders.\n\nAbout this time he did some strange things, which he states in one of his letters. He boldly entered the private residence of a wealthy French Canadian, in Montreal, who was a stranger to him, and peremptorily demanded $10,000, to assist him to go among the heathen and establish churches in his own name. This freak is corroborated by the citizen of whom he made the demand.\n\nAbout the same time he wrote to his mother, in Winnipeg, ordering her to sell all her effects and bring the money to him at St. Paul, Minnesota. The funds were to be used by him in the Lord's service, as He would dictate. The silly woman, who was a widow at this time, and whose intellect, at best, was of a low order, did as directed, and started with a horse and cart to meet her son and deliver to him her small savings. At this time there was no railroad between her home and St. Paul, so the journey meant a weary travel of more than four hundred miles over the prairie. After three weeks' travel she reached her destination. Her son did not appear, so she went back, sad and disappointed, to her lonely home on the banks of the Assiniboine river. Riel did not leave Montreal, and wrote to his mother excusing himself for breaking his promise, as he was commencing to put into operation a great mission of some sort or other, of which he gave no particulars. This was in 1867, and for years previously he had been leading a wandering and purposeless life. At the end of this year he returned to Winnipeg, poor and proud. For some years after this he remained quiet, and lost, for a time, or suppressed, his grandiose ideas. He behaved himself as a citizen, and gave no trouble to his kindred. He married a respectable and intelligent Cree \"half-breed,\" and settled down to till the soil. All his friends testify that work of any kind was irksome to him, and he was what a Scotchman would call \"a ne'er-do-weel.\" He was well educated, but applied his knowledge to no good purpose. He seemed to lack stamina of mind, and was open to engage in any enterprise which would feed his latent ambition. His mental composition was unstable, and, as a consequence, its equilibrium was easily disturbed by any circumstance, which would evoke its bias, or give rein to the forces of passion which had found lodgment therein. Such minds are like a magazine of dynamite, which only need a shock of a mental or moral nature to cause an explo-\nRiel was constantly building castles in the air, and in his visionary schemes he was always to be the leader. In this ideal his fancy gloried in anticipation, and he would brook no opposition. The grand opportunity came from a direction he little dreamed of at the time.\n\nIn 1868 the vast \"Lone Land,\" whose wheat area is equal to six States like that of Minnesota, was turned over to the Canadian government by the British Crown cancelling all charters giving occupancy thereon for hunting, fishing and trading. The \"half-breeds\" were not consulted, although that was their native land. They could not be looked upon as aliens, nor as the nomadic Indian tribes, who had no abiding interest in any one part of the soil. These Scotch and French mixed races were settlers, and large numbers were farming, as their fathers had been before them. To them the transaction was a bargain and sale of their homes and country to a foreign power. The paternal rule of the Hudson's Bay Company was to be followed by a government of which they knew little, and which was fifteen hundred miles away. There were over twenty thousand of these people, and many of them had been well educated at the Protestant and Catholic schools and colleges. No wonder they became rebellious, when no provision had been made guaranteeing to them even squatter rights.\n\nIn the murmurings and discontent Riel saw his opportunity. He was eloquent and crafty, and fanned the flame into a burning fire of rebellion. By ingenious reasoning, he showed his countrymen and compatriots how unjust it was to have their country ceded to Canada, without their consent, or even consultation and guarantee as to their rights and privileges as owners of the soil. Many of his followers were ignorant and impulsive, but on account of Riel's religious fervor and intense earnestness, they looked up to him as a fit leader to have their grievances redressed by the establishment of an independent government. Riel was educated and had travelled. He knew what rebellion meant, were his mind in a wholesome state. He could not hope to succeed against the Canadian forces, and—if need be—against those of Britain, with a few hundreds of untrained volunteers. The former ideas of power and glory came back upon him, and he \"lost his head,\" as the saying is. He strutted about with the airs of a pompous conqueror, when he found himself at the head of an armed force, defying his foes. He was dictator and high priest combined. At this time Canada was about to send a lieutenant-governor to take possession of the country. The Provisional Government of\nRiel determined to meet him at the boundary line and resist his approach. Riel, with his armed force, seized Fort Garry without resistance, as it was only held by a few Hudson Bay employés. In this way the rebels procured ample supplies of food, clothing and arms. This was in October, 1869. A band was sent to the boundary line to resist the entrance of the Canadian governor. They succeeded in this respect. During the following winter the whites and Scotch \"half-breeds\" began to rebel against the arch-rebel. A counter-movement was made, but it was weak, and was crushed out of existence by Riel's followers. A white, of the name of Scott, was sentenced to be put to death because of his indiscreet utterances against this Provisional Government. After a summary trial, by a sort of court martial, he was shot for treason and using seditious language against the insurgents.\n\nThe cruel death of Scott caused intense feeling in Canada. When spring came a force was organized in the east, composed of British regulars and Canadian volunteers. They tramped the wilderness of six hundred miles, between Port Arthur, at the head of Lake Superior and Winnipeg, under extreme difficulties. This force was commanded by General Woolsey. When it reached Fort Garry, and the bugle notes of the advance guard were heard by Riel, he fled to the United States, and his followers scattered to their homes. Good flowed from this uprising, and the many wrongs of the early settlers were redressed. Louis Riel was looked upon as having been instrumental in bringing about this improved condition of things. So popular was he that in 1872 he was elected a member of the Canadian Parliament by acclamation. He went to Ottawa and took the oath of allegiance. His life was threatened by some super-loyal roughs, because of the murder of Scott. So he thought it safer to leave the capital, to which he never returned. Strange to say, Riel resigned his seat for Cartier, a prominent French Canadian, of Quebec, and a member of the government which Riel had rebelled against. The ex-rebel's seat was occupied, and he was given money by the government, through the hands of a church dignitary, to leave the country. After this time he wandered through the United States for several years, quiet in manners, well behaved, and giving utterance to no delusions. This is the testimony of those who knew him, and met him at St. Paul, Montana and other places.\n\nIn 1876, Riel found his way to Montreal, and one Sunday he interrupted religious services in one of the churches by declaring he was superior to any priest or bishop, and should himself conduct\nthe service. He was arrested and was examined by two medical men as to his sanity. He was declared insane, and was legally committed to Longue Pointe Asylum. After a few months' incarceration there, he was transferred to Beauport Asylum, near Quebec, as a dangerous lunatic. Dr. Roy, medical superintendent of Beauport Asylum, gave sworn testimony to this effect at the trial of Riel. He recovered, after having been insane over a year and a half, and again began to wander over different parts of the United States. He went to Washington in the hope of inducing the American government to appoint him to some responsible position over the \"half-breeds\" and Indians of Montana. He failed in this, but acted so strangely in the street that he was arrested. His prophecies, visions, and feeling of greatness again possessed him. After a short time he was liberated, and found his way back to his family in Montana.\n\nIn 1884, discontent again broke out among the \"half-breeds\" and Indians in the Saskatchewan valley, because of the encroachments of the whites, and their threats made to dispossess these early settlers and aborigines of their country. This fertile valley lies over five hundred miles northwest of the country in which was the rebellion of 1870. This primitive people had petitioned the government for years to redress their grievances, but a deaf ear had been turned to their appeals. In their extremity they naturally bethought themselves of Riel, who had been the means of obtaining redress for their kindred in Manitoba. A deputation was sent to see him, at his home in Montana. The mission was successful, and Riel once more became an agitator among his kindred. At first constitutional means were adopted, and Riel, at this time, kept his head level. At the different meetings held Riel showed no signs of insanity, and all his actions were those of a sound leader. As the agitation went on, and feeling began to run high, the former form of mental alienation began to manifest itself. The leadership gave him importance and notoriety. The quiet man and prudent counsellor began to show undue excitement, regardless of consequences. His religious zeal, his praying night and day, his carrying and holding aloft a crucifix, his fervid appeals aroused his ignorant and deluded followers to a dangerous pitch of frenzy. He now defied not only the mounted police, but also the Roman hierarchy. He drove priests from the altars and chapels, and desecrated them for common purposes. He was a supreme pontiff himself, and could make and unmake popedoms.\n\nRiel, in one of his paroxysms of fury against the priests who\nwould not second his efforts, drove them from the chapel, and assumed in their stead sacerdotal functions. He baptized a number of children, he confessed and gave absolution to over forty persons, he held confirmation at the altar and in public, and in order to transmit to the congregation the breath of the Holy Spirit, he uttered three cries so loud and penetrating that they caused the windows of the building to vibrate. Whoever would go to the spot could collect from the lips of eye and ear witnesses many particulars of this nature in respect to Riel at this time.—[Cor. Minerve, Quebec.]\n\nAbout this period Riel always wrote after his signature the addition \"Exovced,\" which he interpreted to me to mean, \"Chief of the flock,\" or \"Head of the people.\" All the documents I have seen or heard of during the rebellion, had this affix, except those sent to General Middleton, during the engagement at Batoche.\n\nIn 1865 he wrote to a clerical friend in the northwest, that he was not Louis Riel, but somebody else. He claimed that he was David Mordecai, a Jew, and was born in Marseilles, France. He came over to Canada when he was only a mere child. His appearance was so like that of Louis Riel that they might be taken for twins. The Louis Riel was thrown overboard from a steamer on the Mississippi and he was put in his place. So alike were they that even those in charge of the child did not detect the deception. His guardians did the foul deed, because his parents had left him immense wealth, and they wished to secure the property for themselves. He was not Louis Riel, and not the rightful heir of an immense estate, which had been acquired in this way. Being a Jew, it was his duty to redeem the race, and rectify the wrongs which had been done. He was a second Saviour, sent in these latter days to not only succor Jews but also Gentiles, from temporal, political and spiritual bondage.\n\nThe writer saw a letter written by Riel to a church dignitary, at the time he was a patient in Beauport Asylum. It is rambling and nonsensical, but natural to any one who has to read the superlative ideas of the conceited insane. It is signed \"Louis David Riel, by the grace of Jesus Christ, Prophet, Pontiff, Infallible and Priest-King.\" This letter is dated July 30, 1876. In a postscript he gives a reason for adding \"David\" to his name. It was on account of the King of Israel having been chosen by him as his patron saint, and who had delivered him out of the hands of his enemies. The Spirit which spoke to Moses out of the burning bush had often spoken to him. Why? Because he was\nabout to liberate his brethren in somewhat the same way out of their bondage. On the Sunday before his execution, when he was sure the death sentence would be carried out, he told his confessor that he had a visit the previous night from the prophet Jeremiah. The Hebrew seer had a long conversation with him on the merits of the Book of Lamentations. He was a greater potentate than Queen Victoria, and defied all the military resources of Canada or the British Empire. He saw armies of men in the heavens. Fire and tumult and chariots and angels were everywhere apparent in the air. All were portents of coming victory to his followers against their oppressors. He heard the voice of God speaking to him, and commending his ways. He had daily conversations with the Almighty. By the means of visions, dreams and voices he was able, not only to foretell future events, but also to command thunderbolts to destroy armies. These are some of the delusions which I found in his diaries. The whole of his writings in this strain would make a large book if printed, and the veriest trash as a whole. Now and then some passages would be vigorous and sensible, but ever and anon would crop up his visions and prophecies and greatness.\n\nThe following extracts of evidence elicited at the trial give us glimpses of the prisoner's mental condition at and after the outbreak of the rebellion:\n\nCharles Nolin was cousin of the prisoner, and assisted him in the legal agitation, but refused to be drawn into rebellion. He stated that Riel went into the northwest in July, 1884. The prisoner showed him a book, in which he had expressed a determination to destroy Canada and England. Prisoner told him he was a prophet, and one evening when Riel was at house of witness a noise escaped from Riel's stomach which he said was an inspiration. Riel showed witness a sheet of paper, on which he had written in blood, his plans for the campaign. Ontario was to be given to Ireland, Quebec to Germany, and the northwest territories to be divided, the Hebrews getting a share. The prisoner's character changed remarkably about the time of the outbreak. The very word \"police\" made him furious.—[The Toronto Mail.]\n\nFather Andre, Superior of the Oblat Fathers, had lived in the country since 1865; knew Riel well, and had watched his conduct; frequently spoke with him of the situation and on religious matters; on questions of politics and religion he lost all control of himself, and was not the same man; told the prisoner he was a fool on these subjects, not having his mind. Prisoner often said\nthings that frightened me. Once all the priests met together, and\nthe question was discussed and unanimously decided, that he was\nnot responsible. In discussing those questions with him it was\nlike showing a red rag to a bull. I do not think that every man\nwho has strange ideas on religion is a fool; it depends on his con-\nduct in expressing them. The prisoner never had any principles,\nexcept that he was an autocrat in religion and politics, but his\nideas changed—to-day he admitted one thing, to-morrow he denied\nit.—[Toronto Globe.]\n\nDr. Roy, medical superintendent of Beauport Asylum, testified\nthat Riel had been a patient of his in the asylum. Prisoner\nwas discharged from the asylum in January, 1878, after a residence\nof about nineteen months. Had an opportunity of studying the\ndisease prisoner was suffering from; had conversations with him\noften. The particular disease of the prisoner was the mania of\nambition, called by eminent authors \"Megalomania.\" The symp-\ntoms of the disease are sometimes found in ordinary maniacs.\nThese maniacs are sometimes very clever in arguing from a false\nidea, and are very excitable when opposed, because they hold the\nfalse idea strongly, and are perfectly sane on all other questions.\nPride occupies a place in the symptoms of the disease. The vic-\ntims are very egotistic, and forget their best friends. The diffi-\nculty is to make them believe they will have no success in their\nschemes. Very rarely are they cured, though there may be inter-\nmissions. There is more or less difference in each case. Heard\nthe witnesses in the court describe the conduct of the prisoner during\nthe agitation and rebellion. I am perfectly positive prisoner was\nnot of sound mind when he was under my care, and I believe the\nactions described by the witnesses were done when he was laboring\nunder the disease; do not believe prisoner had control of his ac-\ntions at these times. The symptoms of this malady, disclosed in\ncourt yesterday, are the same he suffered from when he was under\nmy care. A feature of the disease of \"Megalomania\" was a fixed\nidea, incapable of change by reasoning, and which is beyond the\npatient's control. Such have lucid intervals, intermissions for\nweeks and months. The evidence of the clergy shows in a posi-\ntive manner, that the prisoner manifests the same symptoms he\ndiscovered when he was under my care. A man laboring under\nthis disease might desire to obtain money to carry out his false\nidea. The facts brought out in evidence in regard to prisoner's\nactions, were, in his opinion, inconsistent with skilful fraud, as\ncould be said of all human conduct in the sane.\nFather Tourmand said he was well acquainted with Riel. He was present at the meeting of priests at which Riel's sanity was questioned. Often conversed with him on religious and political subjects. I knew the facts upon which the question of his insanity arose. Before the rebellion Riel was a polite and pleasant man to me. When he was not contradicted about political affairs he was quiet, but when he was opposed he was violent. As soon as the rebellion commenced he lost all control of himself, and threatened to burn all the churches. He denied the real presence of God in the Host. It was a man of six feet. Riel said he was going to Quebec, France and Italy, and would overthrow the pope, and choose a pope or appoint himself. We finally concluded there was no other way of explaining his conduct than that he was insane. When the fathers opposed him he attacked them. Witness was brought before the rebel council to give an account of his conduct. He called me a little tiger, being very much excited. Never showed me a book of his prophecies, written in buffalo's blood, although I heard of it. The prisoner was relatively sane before the rebellion. Could better explain prisoner's conduct on the ground of insanity than that of great criminality. Witness naturally had a strong friendship towards prisoner.—[Toronto Globe Report.]\n\nPhilip Garriot, a prisoner, said Riel often stopped at his house. The prisoner would pray all night; never heard such prayers before; prisoner must have made them up. Heard him say he was representing St. Peter. Heard him talking of the country being divided into seven provinces, and he was going to bring in seven distinct nationalities to occupy them. He expected the assistance of the Jews and other nationalities. Riel said he was sure to succeed. It was a divine mission, and God was chief of the movement. Only met him once before the trouble. I thought the man was crazy.\n\nAt a wedding which took place at Batoche in April, 1885, Riel carved for the wedding party and set apart some of the food and also a chair, which he said were for Jesus Christ, who was to be present. Nolin, a cousin of the prisoner's, who gave testimony against him, said that in an interview he had with Riel, he set an empty chair between them, as the Saviour was to be present at the interview. This witness is an intelligent man, and thought Riel \"acted like a fool.\"\n\nThe following declarations made by half-breeds is taken from the government organ of December 17, 1886, (Toronto Mail):\nAntoine Ferguson says: \"I believe that Riel was insane during the rebellion.\"\n\nNeil Jervais says: \"I thought sometimes that he was not quite sane during the troubles.\"\n\nMaxime Colin says: \"He acted sometimes as if he had wished to be taken for an insane man.\"\n\nJohn Sanserequet says: \"During the trouble I thought that Riel was not quite sane.\"\n\nCyrille Lafond says: \"I thought at certain moments during the trouble that Riel was not quite sane.\"\n\nCharles Lavallee, Sr., says: \"I had known Riel in Manitoba, and I thought he was not quite the same man during the troubles.\"\n\nPierre Vaudal says: \"I have said sometimes during the trouble that Riel seemed not quite sane.\"\n\nIsadore Lafontaine says: \"I thought at certain moments that Riel was not speaking like a sane man.\"\n\nIt is true a number of half-breeds also stated that they thought Riel was not insane. It is to be remembered, however, that their pride revolted against the idea of being influenced by an insane man. At the same time, it is not to be forgotten that these ignorant men may never have seen an insane man, and of necessity must have had hazy ideas of what insanity really meant. The more masked and subtle forms of it would be beyond their ken. This being the case positive statements like the above have more than ordinary value.\n\nOn July 28, 1885, the writer made a first visit to Riel in the prison at Regina, Northwest Territory. He was found to be a stoutly built man and of splendid physique. He was in good health, about forty-two years of age. He had a swarthy complexion and black eyes of great brilliancy, restless and searching. His movements were nervous, energetic and expressive as are so characteristic of the French. This was evidently a normal condition and not from apprehension as to his fate. He was very talkative, and his egotism made itself manifest, not only in his movements, but also in his expressed pleasure in being the central figure of a State trial, which was likely to become historic. The writer stated to him that his lawyers were trying to save his life by proving that he had been insane. At this statement he got very much excited, and paced up and down his cell like a chained animal until his irons rattled, saying with great vehemence and gesticulation, \"My lawyers do wrong to try to prove I am insane.\"\nI scorn to put in that plea. I, the leader of my people, the centre of a national movement, a priest and prophet, to be proved to be an idiot. As a prophet, I know beforehand, the jury will acquit me. They will not ignore my rights. I was put in Longue Pointe and Beauport Asylums by my persecutors, and was arrested without cause when discharging my duty. The Lord delivered me out of their hands.\"\n\nI questioned him very closely as to his plans in the past, but he did not seem to be communicative on these points. He said he would insist on examining the witnesses himself. He did not feel disposed to allow his lawyers to do it for him, if they were determined to try to prove he was insane. During the trial he made several attempts to take the case into his own hands, as in the questioning of witnesses, his importance seemed to be ignored by his counsel. I asked him if he thought he could elicit more on his own behalf than men expert in law could. He proudly said: \"I will show you as the case develops.\" During a long conversation with him, I found him quite rational on subjects outside of those connected with his \"mission\" and personal greatness. He walked about a good deal as he talked, at the same time putting on his hat and taking it off in a nervous way. His fidgety way, his swagger, his egotistic attitudes, his evident delight at such a trying hour—in being so conspicuous a personage—impressed me very strongly as being so like the insane with delusions of greatness, whether paretics or not. A hundred and one little things in appearance, movement and conversation, which can not be described in writing, are matters of every day observation by asylum medical officers. I may say they are almost intuitions in this respect. Such knowledge as this, which we acquire by every day acquaintance of the insane, would be laughed out of court by the legal profession, who can not discern any valid evidence that does not tally with a metaphysical and obsolete definition.\n\nIt was evident to me that Riel was concealing to some extent the inner workings of his mind, and that he had an object in view in hiding his thoughts. I endeavored to make him angry by speaking contemptuously of his pretensions. He only shrugged his shoulders and gave me a smile of pity at my ignorance. I touched upon his selfishness in asking $35,000 from the government, and on receipt of it, to cease agitation. He smiled at my charge, and said that the money had been promised to him and was due to him. Had he received it he would\nhave established a newspaper to advocate the rights of his kindred. It would have been a glorious work for him to be able to control a newspaper, and to promulgate in print his mission to the world.\n\nDr. Roy and myself had a second examination of Riel at the Police Barracks, on the evening of the 28th of July. He was closely catechised by Dr. Roy in French, and by me in English. He evaded giving direct answers to our questions, although he knew we were to give evidence for the defense, if his insanity were a fact. He thanked us for our kindly interest in him, but repudiated our plea with scorn. We took that ground to possibly put him off his guard, but in this he was consistent with himself and his record. We elicited little from him except that great developments, of a national character, were near at hand, according to his prophecy, and he was to be the central moving power. The insanity plea was abhorrent to him, and he scorned to take that ground, even to save his life. Friends and foes were convinced of his honesty and candor in his repudiation of this defense. He would rather die as a deliverer than live as a lunatic.\n\nI had a third visit alone with Riel, in his cell, on the 29th of July. He was very much excited, and paced his narrow enclosure like an enraged tiger would, yet in this mood he said nothing. I accused him of hiding his motives to his own hurt, and told him that his friends from Quebec could do nothing for him because of his obstinacy. Suddenly he calmed down and with great self-possession said: \"His legal friends had mistaken his mission. At present he was an important State prisoner, and he was suffering, not only for himself, but also for others.\" He also told me that he wrote a book which was still in existence. In it he clearly proved that he was a great prophet, and as a prophet he knew beforehand that a verdict would be given in his favor. I closely questioned him as to why he thought so, but his only reply was in putting his hand over his heart and saying pathetically, \"It is revealed to me.\" I informed him that there was a bitter feeling hostile to him outside, and that so far the evidence was strongly against him and that he would probably be hanged as a felon. He smiled cynically at my ignorance, but the alternative did not seem to affect him. I told him the feeling had not subsided for the murder of Scott, in 1870. In reply he said the Northwest Council sentenced Scott to death for treason. He was only one of thirteen. He suddenly broke away from this subject and began to pour out a torrent of vigorous language on the head of Dr. Steultze, of\nWinnipeg, whom he associated in some way with Scott and the rebellion of 1870. Before I left he came back to the fulcrum idea that he was yet to be a great political and religious leader, who would revolutionize the world.\n\nThese were the notes I took at the time. To me they were significant, but as legal evidence they would be considered of little value.\n\nI wish again to repeat the statement which is a truism to alienists. He had a look and movement so characteristic of insane people, which it is impossible to put in words, but known so well to us. He had that peculiar appearance, which is hard to be described, of a man who is honest and sincere in his insane convictions and statements. There could be no doubt he was stating what he himself believed to be true. In acting as he did he was not a pretender, and did not assume those feelings to his own hurt for the occasion. The most cunning deceiver could not simulate the appearance and actions which he presented. A malingerer would never utter so much wisdom, mixed with so much that showed insanity. Riel's great aim, even at the trial, was to falsify the charge of insanity, and to show by his words his mental capacity to be a leader of men. Anyone who has read his letters and addresses to the jury will see that a great deal of shrewdness, and irony, and sarcasm, of rather an intelligent kind, were mingled with his delusions of greatness. This is perfectly consistent with his form of insanity. Every asylum could produce men and women just as clever, cunning, and able to write as good letters as Riel did, and even hide their delusions when it suits their purpose so to do. His frowns, facial disgust and depreciatory shakes of the head when evidence was given to prove his insanity, and his egotistic walking up and down the dock, with swinging arms and erect head when his sanity was witnessed to, were no actor's part. His actions and speeches carried conviction of their genuineness even to the minds of many who were bitterly hostile to him. Much evidence was given by the Crown after mine was rendered. His two speeches made to the jury and much of his excited conduct in the dock towards the end of his trial impressed me very strongly as to the prisoner's mental unsoundness. His whole aim was to show that he was responsible in all his conduct, and not demented. He was a saviour and leader of his people, and this glorious position was to be taken from him by his friends trying to prove his insanity. He repudiated the plea with scorn.\n\nRiel, in his address to the judge, after a verdict had been ren-\ndered, said, with an honesty which carried conviction to every one who heard him, \"I suppose that now, having been condemned, I will cease to be called a fool, and for me it will be a great advantage. If I have a mission—I say 'if' for the sake of those who doubt—but for my part, since I have a mission, I can not fulfil my mission as long as I am looked upon as an insane being.\" Again: \"Should I be executed, at least, if I were going to be executed I would not be executed as an insane man. The recommendation to mercy by the jury shows me to be a prophet. So my career is cleared of the charge of insanity.\" After giving an outline of what he intended to do, in dividing the country into ten nationalities, he gives vent to the following delusion: \"My ancestors were among those who came from Scandinavia and the British Isles over a thousand years ago. Some of them went to Limerick, and when they crossed to Canada they were called Riel. So there is in me Scandinavian, Irish, French, and some Indian blood.\"\n\n\"I thank the glorious General Middleton for the testimony that I possess my mental faculties. I felt that God was blessing me when those words were pronounced. Even if I have to die, I will have the satisfaction to know that I will not be regarded by all men as an insane person. I was in Beauport and Longue Pointe Asylums, but was not insane. I thank the government for destroying the testimony of Dr. Roy, who says I was insane.\"\n\nThere is much of these denials in his two speeches, mixed with sarcasms against the government, and with declarations of his great mission as a prophet and deliverer of his people. Some of his statements were very pathetic and even eloquent. All this medley of sense and nonsense, shrewdness and want of judgment, cunning and honesty, are no new features in an insane character. The metaphysical and theoretical lawyer can see such in any asylum at any time were he looking for light.\n\nRev. Mr. McWilliams, Roman Catholic priest, was with Riel a good deal before his execution. He believed the prisoner to be insane. I quote from the government organ, which urged his execution, (Toronto Mail,) \"Riel has had another 'manifestation,' consisting of entirely incoherent rubbish. Riel took advantage of the Rev. Mr. McWilliams' presence on Friday night to declare his divine mission. 'I am,' said the prisoner, 'a prophet; I have been ordained, not as a priest, but as the prophet of the northwest, to preach a reformation to you and every minister of the church, and will continue to fulfil my mission until I mount the scaffold.'\"\nWhile delivering himself of this little oration he paced his cell like an infuriated maniac. He thundered his anathemas on the policy and principles of the nineteenth century churches, gesticulating almost all the while. When he came to the word 'scaffold' he faced his visitors. With the veins of his throbbing temples distending with convulsions, he pointed towards the scaffold, and fixing his wild, haggard eyes on the Rev. Mr. McWilliams, continued: 'To that scaffold will I walk boldly, preaching this mission of church reformation so much needed throughout the world.'\n\nI have given part of the evidence of these non-professional people, because it is recorded in law books, and was asserted by a learned Queen's Counsel at the trial, that any ordinary common sense man could detect an insane man as easily as could an expert. Had this sweeping assertion been made of cases of acute mania, there might have been some force in it; but any one who has even a limited experience of the insane knows that there are many phases of insanity in all our asylums which in their subtility and masked form, would baffle the common sense but inexperienced man, and even the legal theorist, with his ethical and antiquated absurdities of definition. I have seen judges, lawyers, and members of grand juries trying their mental acumen at selecting the sane from the insane in our wards, with most ludicrous results.\n\nOnly a few days before his execution he wrote to his clerical friend in Winnipeg a farewell epistle. It is closely written in French, and contains fourteen pages of foolscap. He knew that his day of doom had come, yet it is full of the old delusions of prophecy and other rubbish concerning his power and greatness. One sentence will suffice as a specimen. He says: \"The pope of Rome is in bondage and is surrounded by wicked counsellors. He is, however, not infallible, and the centre of the hierarchy should be located on this continent. I have elected Montreal as its headquarters. In a year of weeks after this change the Papal See will be centred in St. Boniface, Manitoba. The new order of things will date from December 8, 1875, and will last four hundred and seventy-five years.\"\n\nThen again: \"Archbishop Bourget told me of my supernatural power on the 18th of December, 1874. I felt it on that day, while I was standing alone on a high hill, near Washington, D. C. A spirit appeared to me and revealed it out of flames and clouds. I was speechless with fear. It said to me, 'Rise, Louis David Riel. You have a mission to accomplish for the benefit of humanity.' I received my divine mission with bowed head and uplifted hands.\"\nA few nights before this the same spirit told me that the apostolic spirit which was in the late Archbishop Bourget, and who was the pope of the new world, had taken possession of Archbishop Taché. It is to remain with the latter until his death, and then will re-enter the archbishop of Montreal. It will remain in him and his successors for one hundred and fifty-seven years. At the end of that time it will return to the ecclesiastical head of St. Boniface and his successors for 1,876 years.\"\n\nSuch delusional and egotistic nonsense could be quoted to any extent. Enough has been transcribed, not only to show the groove in which his mind ran when these frenzies took hold of him, but also to indicate how consistent throughout his whole career of over a quarter of a century, his mental activity was in respect to the uniformity of these vagaries.\n\nArchbishop Taché, in speaking of Riel and his condition, said: \"For many years I have been convinced beyond the possibility of a doubt, that, while endowed with brilliant qualities of mind and heart, the unfortunate leader of the Metis was a prey to what may be termed 'megalomania' and 'theomania,' which alone can explain his way of acting up to the last moments of his life.\"\n\nThe prosecution brought forward a number of witnesses to show that such had known Riel and had conversations with him, but saw no signs of insanity. It need scarcely be said that such negative evidence is worthless. A person may be insane and yet rational. Such having delusions can mask them with a great deal of shrewdness in ordinary conversation. All asylums have this experience, until some pertinent remark or favorable condition evokes and brings into prominence and activity the abnormal and diseased mental bias. A thousand persons may see no insanity in a patient, but one reliable witness who has seen indubitable evidence of mental alienation, will cancel the whole negation. Leaving out the evidence for the defense altogether, the witnesses for the crown gave facts enough to establish the prisoner's mental unsoundness, at least in the estimation of the writer.\n\nThere is no doubt that Riel was responsible for some years, up to the time of the Duck Lake fight. The excitement of that fight caused another attack of insanity, and from that time there is no evidence that he was accountable for what he did. While he was suffering from these attacks he was not responsible for anything he did. I spoke to some of the half-breeds who were in all the engagements with Riel, and they uniformly said he was not the same man after the first fight. He seemed to have changed en-\ntirely, and became frenzied. He organized no opposition after this time, did no fighting, but was looked upon as inspired by his deluded followers, and ran about from rifle pit to rifle pit, holding aloft a crucifix, and calling upon the Trinity for aid. The military organizers, leaders and fighters were Dumont and Dumais. These sane, shrewd and brave rebels have been amnestied by our government, but the mental weakling was hanged.\n\nA few days before the execution two medical gentlemen were sent to Regina by the government to enquire into and report upon the prisoner's mental condition. It is just to them to say that they were servants of the government. One was a chemical analyst and the other was warden of Kingston Penitentiary. On their knowledge and judgment and skill as experts hung the fate of Riel, at least so it was said officially. They examined the prisoner and reported in cipher to the government. This report has never been published, although it was an official document, but on the contrary it was returned to the authors. A new report was made out when the examiners had returned to the capital, and after the prisoner had been executed. Such is the parliamentary record. It must be a satisfaction to these estimable gentlemen to know that their report did not seal the fate of the insane rebel.\n\nThe writer challenged the government to hold a post mortem on Riel's brain, and submit it to the examination of any competent pathologist. He was prepared to abide by the opinion and verdict of such an expert. This challenge was made through the press, and especially through the government organ. The writer was sure that organic changes would be found in Riel's brain, even of a gross nature, after such mental storms of a life-time. The footprints of disease were there, and within that skull was evidence of the prisoner's aberrations. Two medical men were present at his execution, but they also were government officers, under instructions. No post mortem of the brain was made. He was buried beside the scaffold where he bravely died. His body was kept under military supervision for about four weeks, and at the expiration of that time it was delivered up to friends. Decomposition had set in, and so the brain records were forever destroyed.\n\nThe facts set forth in this man's eventful history are not denied by his executioners. The plea is that he was a religious fanatic or \"crank\" such as are described in all ages of the world's history, that his delusions were normal to his mind and used by him to accomplish his selfish and ambitious designs. The answer\nto this plausible excuse is, that his strange conduct was intermittent, and that during the many years of mental health he was quiet, unassuming, showing no delusions, and even supporting his family by engaging in humble employments, such as came to hand. In short, he was a well disposed and law abiding citizen. There is no parallel between him in any respect and those sane religious enthusiasts who found sects and carry on religious wars. Such adapt means to ends which have in them the probabilities of success, and have no intermissions such as Riel had in his life.\n\nA crank has a mental twist from childhood upwards. He has mental peculiarities without intermissions and eccentricities throughout the whole course of his life. He is a naturally odd and hobby-riding man who is unchangeable in his possession of whims and fancies. The insane man becomes so synchronously with brain disease. These peculiarities come and go with the invasion of disease and departure of the corporeal abnormal condition. The intermissions of freedom from delusions or from mental deprivation are the insane man's normal condition. He then comes to himself in his words and conduct. The crank has no such intervals, because his mental condition is natural, uniform and continuous as known in all his doings. His being is saturated congenitally with all kinds of visionary projects or psychical obliquities, yet he will use ordinary methods and reasonable instruments to acquire power towards an end however absurd that goal may seem to mankind.\n\nLet us drop the name and person of Riel out of our thoughts, and put in their place an algebraical symbol to equal an unknown mental condition of an equally unknown person. Let us then predicate of this symbol all that is known of this man's tragic, erratic and unaccountable history. Let all the facts be written in a medical certificate as reasons for putting this unknown person into an asylum. Let these recorded facts be closely scrutinized by legal and medical experts and properly authenticated, and there is not any asylum in Christendom but would commit him as a lunatic. In fact, there are few lunatics who have such a pronounced record of mental alienation and of periodic brain disease. In this way, we do not consider the sad mischief Riel has done, nor the cruelties of which he has been the instrument nor the grievous loss of life he has occasioned. We look at the man apart from all extraneous circumstances, and we judge of him only as a man.\nIt will be seen that I have avoided quoting authorities to bolster up my belief. I have thought it best to give a synopsis of this man's mental life, including the testimony of those who were his enemies as well as of those who had sympathy for him, and to let any candid mind say, if this man had always a sound mind in a sound body. Since his execution up to a few months ago his death was made to do duty as a political war-cry. It was felt that the recommendation to mercy by a Protestant and English speaking jury; that the strong evidence of the prisoner's insanity, which was adduced at the trial and after it; that the repeated postponements of the day of execution; that the fact of his having been only the nominal head of the rebellion should have had due weight with the executive. A living lunatic in an asylum would soon have been forgotten, but a dead Riel has roused into unwonted activity, influences which will not easily be allayed.\n\nIt may be interesting to American medical jurists to notice in connection with the trial of this unbalanced man the following points:\n\nFirst. Under Canadian law a question of life and death was decided by a petit jury of only six persons, and selected by the magistrate who tried the case.\n\nSecond. There was no grand jury empanelled to examine the positive evidence against the accused.\n\nThird. The magistrate who tried the offender for high treason was not a judge in the legal sense, being only a stipendiary magistrate, yet he presided over a State trial.\n\nFourth. It is customary in such cases in the territories to select a jury composed of half English and half of the countrymen of the prisoner. This jury was not so chosen. No half-breeds nor French—however loyal—were taken.\n\nFifth. The charge was treason, although the prisoner was an American citizen, and legally an alien and invader. He virtually led a rebellion against a foreign power.\n\nSixth. The question should not have been the prisoner's mental condition during the trial, but only when the overt acts were committed.\n\nSeventh. The jury recommended the prisoner to mercy either (a) because the rebellion was justifiable, or (b) because his mental condition made him less responsible.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001409.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 28324, "total-output-tokens": 11211, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 184, 1], [184, 2523, 2], [2523, 5189, 3], [5189, 7787, 4], [7787, 10415, 5], [10415, 13044, 6], [13044, 15637, 7], [15637, 18214, 8], [18214, 20852, 9], [20852, 23367, 10], [23367, 25683, 11], [25683, 28212, 12], [28212, 30833, 13], [30833, 33419, 14], [33419, 36000, 15], [36000, 38647, 16], [38647, 41268, 17], [41268, 43864, 18], [43864, 46360, 19], [46360, 48567, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]