[{"id": "f15871ebea6ac8d85f7961f86b573708db3c4467", "text": "DOMINION ELECTION.\n\nCAMPAIGN OF 1886.\n\nHon. Edward Blake's Speeches.\n\nNo. 14, (First Series).\n\nNorth-West Affairs. Neglect, Delay, and Mismanagement. Race and Creed Cries.\n\nNOTE.—See Inside Cover for List of Mr. Blake's Speeches in first Series. Apply to W. T. R. Preston, Reform Club, Toronto, for Copies of these Speeches.\n\nToronto:\nHUNTER, ROSE & CO., PRINTERS.\n1886.\nLIST OF SPEECHES IN THIS SERIES.\n\nNo. 1.—(LONDON): General Review of Situation—Riel Question.\n(OWEN SOUND): North-West Maladministration—Riel.\n\nNo. 2.—(BEAVERTON): Independence of Parliament—The Boodle Brigade.\n\nNo. 3.—(CHESLEY): Public Finances—Taxation and Deficits—Farmers.\n\nNo. 4.—(SIMCOE): Federal and Provincial Rights—Ontario—Nova Scotia.\n(GUELPH): Elections near—Tory Dodges—Nova Scotia.\n\nNo. 5.—(OWEN SOUND): Principles of Liberalism—Duty of the Leader.\n(WELLAND): Policy of the Party—Functions of an Opposition.\n(OAKWOOD): Sir J. Macdonald on Functions of an Opposition.\n\nNo. 6.—Extracts—(GUELPH): Home Rule for Ireland.\n(BERLIN): Firebrand Tory attempts to excite Germans.\n(GALT & ORANGEVILLE): Indian Starvation Policy.\n(PEMBROKE): Maladministration felt at Cut Knife Hill.\n\nNo. 7.—Extracts—(KENDALL): Business Methods required in Public Affairs—Degradation of Parliament—A few Boodlers.\n(HAMPTON): Civil Service Reform.\n(GALT): Burden of Public Debt.\n(ORANGEVILLE): Burden of Public Debt.\n(BELLEVILLE): Burden of Public Debt—The Interest on Debt.\n(OAKWOOD): Burden of Public Debt—Our Public Expenditure.\n\nNo. 8.—(NEWCASTLE): Canadian Pacific Railroad Matters.\n(LISTOWEL): Canadian Pacific Railroad Matters—The last Sacrifice of $10,000,000—Collapse of Tory \"Boom\" Policy.\n(ST. THOMAS): North-West Lands.\n(HUNTSTONVILLE): R.R. Policy—Sir John's Subsidies to \"Guinea-Pig\" Directors—Assisted Immigration and Railway Frauds.\n(PARRY SOUND): Railway Policy of Liberals.\n(ORANGEVILLE): Railway Policy of Liberals.\n(BRANTFORD): The Kansas Slander.\n(LISTOWEL): The Sea of Mountains.\n\nNo. 9.—(WINGHAM): Blake's Tribute to Mackenzie.\n(STAYNER): Blake's Tribute to Sir Richard Cartwright.\n(BRANTFORD): Blake's Tribute to Paterson—Duty of Young Men.\n\nNo. 10.—(WELLAND): Liberal Party, Creeds and Classes.\n(ORILLIA): Leaders and Newspapers—The \"Mail\" Crusade.\n\nNo. 11.—(AYLMER): Prohibition and Politics.\n\nNo. 12.—(TORONTO): Interests of Labour—The Tariff.\n(WELLAND): To Knights of Labour.\n(BELLEVILLE): Legislation for Labour.\n(DESERONT): Workingmen and Parties.\n(HAMILTON): Workingmen and Parties.\n\nNo. 13.—(HAMILTON): Provincial Issues—The Religious Cry—Liberals and Catholics.\n\nNo. 14.—(LINDSAY): North-West Affairs—Neglect, Delay and Mismanagement—Race and Creed Cries.\nADMINISTRATION OF THE NORTH-WEST.\n\nCAUSES OF THE REBELLION.\n\n\"Had there been no neglect, there would have been no rebellion; if no rebellion, no arrest; if no arrest, no trial; if no trial, no condemnation; if no condemnation, no execution.\"\n\nHon. EDWARD BLAKE closed his speech at Lindsay with a summary of some phases of the North-West question. He said:\n\nI turn to the North-West. I wish to call your attention to the condition of that country when the present Government assumed office in the fall of 1878, and to their responsibility in this regard then and since. I think it is impossible to conceive, I am certain it is impossible to point to, a condition of things elsewhere, involving on the part of those entrusted with government, a responsibility so heavy, a duty so imperative, a necessity so absolute, for the exhibition of the great virtues of statesmanship—foresight, breadth of view, tact, justice, generosity, faithfulness, wisdom, prudence, energy, liberality, promptitude, and activity, as existed at this epoch in respect of the administration of North-West affairs. That is a grave statement. How do I make it good? I refer you first to the\n\nCIRCUMSTANCES OF THE TERRITORY,\n\nand the character of its rule. The region was an enormous expanse, almost all unsettled, but, so far as it was settled, inhabited by different races. It was to be ruled for a time, not through representative institutions, the great British safety-valve against wrong, and security for good government, but, of necessity, paternally, autocratically, in effect despotically. Now, I need not tell you that on this continent, across whose wide expanse the very winds of heaven seem to waft from one ocean to the other the breath of freedom, the democratic air, it is with difficulty that men can be found long patient, or even tolerant of paternal, or autocratic, or despotic rule; and therefore, those entrusted with that rule are bound to exercise redoubled vigilance, to avoid all possible cause\nof complaint, to exhibit the practical blessings of their régime, to make their yoke easy and their burden light, at the least and lowest to beware of and to eschew neglect, delay, mismanagement, and mistakes. (Cheers.) Then there was the condition of distance. That vast territory, stretching for thousands of miles towards the north and west of the continent, was, even at its nearest practicable eastern point, over a thousand miles from Ottawa, whence it was, to be governed. It was thus to be governed by letters and telegrams, through agents and subordinates. This element of\n\nDISTANCE VERY MUCH ENHANCED THE DIFFICULTIES,\n\nand correspondingly enlarged the responsibilities of government. They knew the resultant dangers, and were bound to exercise all the greater care, promptitude and energy, in order to overcome them. Then consider the magnitude of the task. What was its character? Upon the development of this enormous country Canada had, under the auspices of this Government, staked to a very great extent her national and also her financial future. They told us to hope, to expect, to believe, that under their lead we should exhibit to the world at large the spectacle of this nation in the east building itself up as a nation of the centre and the west as well. They told us to hope, to expect, to believe; they boasted vainly, as though they were taking off, rather than putting on, their armour, that, enlightened by the traditions and enriched by the experiences of the past, both in the Old World and the New, of Europe, of Australia, as well as of North America, they, with their unsurpassed gifts of statesmanship, would set an example, and give an instance, such as had never been seen in the wide world before, of rapid, wise and orderly development.\n\nWe were to have a better system of survey, a better system of settlement, a better system of emigration, a better system of territorial government, a better management of Indians, than had been witnessed elsewhere. Again, we were to have a finer system of railway development than had ever before been known. And the Government called upon the toilers of Old Canada, they called upon our neighbours to the south, they called most loudly upon the labouring masses of our British Isles, and of continental Europe, to move forward, to settle upon and develop, to their own advantage, and to ours, the great area to which they pointed of free and fertile land. \"Make new homes here,\" they said. \"Build your houses and your barns; cultivate your fields; by your labour draw forth the resources of the soil; take the benefits we offer, secure that you will enjoy these great advantages. We offer you a ready, easy, speedy, sure and certain road to advancement, progress and\nprosperity, beyond what you can gain elsewhere. We offer you peace, order, right, justice, and security, under the British flag and the British system.\" Then, as to our financial future. We were called on by our rulers, in the furtherance of their North-West policy, to stake day by day, and year by year, very largely,\n\nOUR FINANCIAL FUTURE.\n\nMillions upon millions each year were being expended under their system of development. Enormous sums for Mounted Police, Indians, immigration, surveys, territorial government and administration, were being paid, as they are being paid, year after year, out of the taxes of the East. And beyond all these, scores of millions more were being paid, in part taken out of the taxes, and in part raised by mortgaging our future, involving heavy yearly interest payments, for the construction of the great railway, whose chief object, as its main justification, was the development of the North-West. Near ninety millions of capital expenditure, and about seven millions of yearly charge, may represent the drain on us for these various expenditures. Am I not right then in saying, that having regard both to our national future and to our financial outlook, we were putting at stake, in reference to the North-West, more, far more, than in any other single object, I might almost say than in all other objects combined? Now, have I not made good, even without going further, the statement that no question coming within the range of executive action can be likened, in respect of the urgent and imminent character of the duty and responsibility it imposed upon the Government, to this question of the management of the North-West? (Cheers.) But I go much further. There was yet much more. We must consider the character of the sparse, yet divided populations, their tempers, their conditions, and the previous unhappy incidents in the history of the Canadian connection with the North-West, incidents which had rendered the task of government more difficult, but also indicated the dangers, and pointed out the path of safety. The populations may be divided into, at any rate,\n\nTHREE DISTINCT CLASSES\n\n—the Indians, the Half-breeds, and the white settlers. As to the Indian, consider his condition. For uncounted ages he and his ancestors had roamed and hunted over those vast southern prairies and northern hills and forests; had voyaged upon and fished in those great lakes and rivers; had carried on their perpetual feuds and warfare, had lived the lords of the land. In later days, it is true, there were scattered over the region, in\npossession of a few posts, a few whites, servants of the Hudson's Bay Co., who did not pretend to dominate the Indian, or to interfere with his lordship, whose presence was thought a benefit, as giving the Indian a market, some employment, and some of the white man's goods; while leaving him still, in effect, monarch of all he surveyed. But after 1869 all began to change. The white man intruded in increasing numbers; the Indian found the white asserting his claim to govern the country, to control and occupy the lands. The Indian was\n\nCALLED ON TO SURRENDER THE SOIL,\n\nand to accept stipulated payments and limited reserves, in lieu of his former unbounded enjoyment. On these reserves he was to be pent, he was to be put under the control of white agents, officers and instructors. He saw the choicest spots, the well-known places, taken up by the whites. He saw the old things passing away. And he saw in their most odious form—he saw and suffered from some of the degradations and barbarisms of civilization. Drink and immorality infested his lodge, and vice and crime and disease, as too often happens under like circumstances, marked the earlier steps of the white man's advance over the inferior race. Alas, that it should be so! But, being so, you will see that, naturally and inevitably (the Indian being a man), there was engendered a temper of unrest, suspicion, jealousy and aversion, a condition alternating between hope and despair, a consuming desire on the part of many to re-establish the old regime, and at any rate to prevent the further encroachment of the whites. And, unhappily, just at this time, appeared another unfortunate factor. The sorest calamity that can befall our poor, frail humanity, overshadowed and impended upon the Indian—\n\nTHE PLAQUE OF FAMINE.\n\nJust at this time, with miraculous rapidity, almost as in a dream, almost as in a night, the buffalo vanished—the buffalo which had supplied to the Indian in large measure his food, his clothing, aye, even the covering of his lodge, and his very fuel—the buffalo vanished, and vanished largely, owing to the reckless slaughter induced by the advent of the whites. And so starvation was added to all his other misfortunes. Such was the state of these wild and savage tribes, proud and hereditary warriors, who thought themselves abased, humbled, despoiled, degraded, demoralized, defiled, starved, and doomed to destruction by the white. Then, let me ask you whether the management of the Indian did not imperatively demand, in the interests of\njustice and humanity, and also in the interests of true policy, the highest measure of vigilance, promptness, prudence, foresight, and liberality, on the part of the rulers of Canada? (Loud applause.) Did not it imperatively demand that the very best men, the men best suited for the task, and these alone, should be chosen to conduct Indian affairs, to act as intermediaries, as Indian superintendents, agents, farm instructors, to do the business to be done with the Indians? (Cheers.) Was that a place for political hacks—for ignorant men, for arbitrary men, for unsuitable men, for men not adequate to the delicate and difficult duty of dealing with an inferior and savage, but still a jealous and high-strung, and also a suspicious and hostile people? (Cheers.) Not so! (Loud applause.) I say it was the prime and imperative, the absolute, duty of the Government to take into consideration nothing but the question,\n\n\"WHO IS THE BEST MAN?\"\n\nin making the Indian appointments. (Renewed applause.) And, having made them, it was their duty to watch them constantly, and to deal with failure, unfitness, neglect, unfaithfulness, immorality, arbitrary conduct, with promptness and firmness. Does this describe their conduct? No! You have heard the voice of those best qualified to speak raised a hundred times in condemnation, because the conduct of the Government was so far removed from this. (Cheers.) Now, I cannot pause longer on this element. I turn to the next element of the population—\n\nTHE HALF-BREEDS.\n\nBy the common consent of every man in that region whose experience and ability render his opinion valuable, it was of the last consequence that the Government should, in view of the difficulties to be encountered in managing the Indians, keep the Half-breed population on the side of Canada—on the side of the Government. Why? Because the Half-breed having in him a strain of Indian blood, there was thus a tie of friendship and kinship and confidence between him and the Indian—an invaluable bond. He had also an influence over the Indian, due to his strain of white blood, and to his acquisition of some portion of our civilization and education, and to his more or less intimate connection with the white. So the Half-breed was the means sent to us, as it seemed, in the order of Providence, by which we might hope most peacefully, with the least chance of disturbance, with the least disadvantage, with the minimum of risk and loss—which the situation would admit, to intervene between the Indian\nand ourselves, to effect the necessarily difficult and painful transition from the old order of things to the new, to lead the Indian most successfully into the path of submission to his destiny, and to accomplish the tranquil settlement of the North-West. Therefore it was an object of the highest policy to secure to Canada the friendship, the confidence, the power, and the influence of the Half-breed. (Cheers.) Now, God forbid that I should for an instant put the claims of justice and equity below those of policy and expediency. I do not do so. Justice comes first in importance. (Cheers.) I have mentioned policy first only in order of time, from the natural sequence of thought in passing from the Indian to the Half-breed problem; but I say that second only to the imperative claims of justice and equity were the claims of policy and expediency in this regard. (Cheers.) And, mark you, it was not only a question whether by wise management we should secure the benefit of this influence for good, but there was the danger,\n\nTHE PRESSING DANGER,\n\nthat by mismanagement we should turn the possible power for good into a power for evil. Because if the Half-breed were to be set against instead of on our side, if his sympathies were to be opposed to instead of in favour of Canada, that influence and control which he had over the Indian would probably be used to create difficulty and to arouse hostility, and this, unhappily, with much greater ease than it could be used in the promotion of peace and friendship; for, as I have shown you, the natural impulse of the Indian was towards hate, and resistance, and war, rather than towards love, and submission, and peace; and so the task of the agitator would be easier than that of the tranquilizer. I have, then, established that the obvious and imperative duty of the Government with reference to the Half-breeds was, on grounds of the highest expediency and policy, apart from equity and justice, to be liberal and generous, prompt and vigilant, conciliatory and active, and so to win them to our side. (Loud cheers.) Well, now, I come to the question of\n\nTHE CLAIMS OF THE HALF-BREEDS.\n\nI cannot even touch them all; I will deal briefly with one only. There are other and very serious matters of complaint besides. You know that there is a dark blot upon Canadian North-West history, of earlier date than the deep stain of 1885. You know that there was a rising in the North-West in 1869, largely due to the rash and precipitate steps which were taken by the then Government in their surveys of the territory without proper intimation to the\ninhabitants as to their future, and in their despatch of a Government to take possession of the land and to rule over the people, without the proper precautions of previous explanations and understandings and assurances as to the régime which was to be established, and the security therounder for the possessions and liberties of the inhabitants. The rising was followed by a wise though late effort to conciliate the people, and to do what should have been done before. A negotiation took place between Sir John Macdonald's Government and the inhabitants; ending in an arrangement which was ratified by Parliament at the instance of that Government. Among their demands in this negotiation a claim was set up by the Half-breeds based upon this ground: They said, the British and the Canadian people have always recognized in the Indians a certain equitable claim, as lords of the territory of which the whites were about to take possession, to consideration, a claim which has resulted in the Indian treaties. We, they said, are of Indian blood, and along with the Indians enjoy and possess the territory. As such, we claim.\n\nA RIGHT TO CONSIDERATION,\n\nin respect of the region at large; apart from the claims of some of us to our individual holdings, which are to be, and which were, dealt with independently. Now, this Half-breed claim, known as the HALF-BREED CLAIM FOR THE EXTINGUISHMENT OF THE INDIAN TITLE, was conceded by the Government of Canada; it was conceded by the Parliament of Canada; it formed one of the bases in the settlement of the North-West, and a large area of land was set apart to be distributed amongst these Half-breeds by means of scrip in satisfaction of that claim. At that time we were dealing only with that part of the territory embraced within the original limits of Manitoba. No Half-breeds outside of these limits were being dealt with; there had been no late intrusion of the whites on them; they were, as were the Indians of those parts, as yet undisturbed; their condition was practically unchanged at the moment; they took no part in the rising; nor were they concerned in the settlement. It was only the east of the territory that was under disposition. But I need not point out to you that their claim, when the occasion should arise, was precisely the same as that of their brethren in the east. As I said when this rebellion broke out, justice is the same on the banks of the Saskatchewan and the Qu'Appelle as on the banks of the Red River and the Assiniboine—(cheers)—and it was impossible, it was utterly impossible, to deny to the Half-breed in the rest of the territory the recognition of a right similar to that which had been conceded to his brother in the east. It was\nfounded on the same principle precisely; and, even had it been disputable once, it had ceased to be disputable in the west once it had been yielded in the east. It was, or ought to have been,\n\nIN PRINCIPLE A SETTLED QUESTION.\n\nHow could we deny to a part what we had granted to the rest? (Cheers.) For a time, while their condition remained unchanged, the claim was not asserted by the western Half-breeds; but about 1878, the white man having begun to intrude upon the western portion of the territory, and the buffalo having largely diminished, the conditions changed. At once starvation, and the white intruder, stared the western Half-breeds in the face. They grew anxious as to their future, even as to their existence; they saw that they must make up their minds to a new order of things, and they desired the recognition of their rights in the soil, and of their right to live. They looked to the claims and concessions to their brethren in the east. They asserted the same rights. They called for the same concessions. And I think you will agree with me that\n\nTHEY HAD JUSTICE AND REASON ON THEIR SIDE.\n\n(Cheers.) Some of them petitioned the lately established North-West Council for redress.\n\nThe North-West Council, by resolution, strongly urged that the matter should receive the early and earnest attention of the Government; and represented that in view of the Manitoba grants there would undoubtedly be general dissatisfaction among the Half-breeds of the Territories unless they received some like consideration; and they recommended grants with certain conditions to prevent improvident alienation, conditions which they thought would be beneficial to the Half-breeds.\n\nThese documents reached Ottawa in the fall of 1878, and it devolved on Sir John Macdonald to take up the question. I am heartily glad to be able to say that\n\nHIS EARLIER COURSE\n\nshould receive your approval. He acted promptly and judiciously. He obtained the report of his chief officer, Col. Dennis. That officer reported that the claims should be disposed of with the least possible delay; that some uneasiness was felt by the Half-breeds in consequence of no steps having been already taken towards recognition of their demands; that they had a claim to favourable consideration; that to satisfy them would place the whole of that element in sympathy with the Government in dealing with the\nplain tribes of Indians, and that thus we would attract to our side a moral power which, in the critical relations of the various tribes of Indians towards each other and towards the Government, would prove of the greatest value to the Dominion.\n\nCol. Dennis also reported that the state of affairs in relation to the Indians and Half-breeds called for the serious consideration of the Government in view of additional probable complications owing to the presence of Indian refugees from the States; and he added that further measures should be adopted to cultivate and maintain relations with the Indians and Half-breeds calculated to attach them to us, and to convince them that the Government was desirous of fulfilling its obligations to them with the utmost good faith. He then proposed a plan for the issue of non-negotiable scrip to the Half-breeds, and for considerable aids of various kinds; and he recommended that a plan should be devised with a view to legislation during the coming session.\n\nThe next step taken by the Government was also prompt and judicious. They consulted great dignitaries of the Territorie. The replies were in the same sense. The Archbishop's answer showed that the Half-breeds had a\n\nCLAIM TO FAVOURABLE CONSIDERATION;\n\nthat great uneasiness was felt by them in consequence of no steps having been yet taken in their behalf; that a liberal policy on the part of the Government would attract to its side a moral and physical power which, in the critical relations of the various Indian tribes towards each other and towards the Government, would prove of the greatest value to the Dominion; that on the other hand, the Half-breed element, if dissatisfied would become a standing menace to peace and prosperity; that the state of affairs touching the Indians and Half-breeds called for the serious consideration of the Government; that measures should be adopted to cultivate relations with the Half-breeds calculated to attach them to us; that the formidable Indian question had not yet arisen amongst us, owing largely to the influence of the Half-breeds; that the disappearance of the buffalo, and the extension of settlement in the Indian country, were preparing difficulties which might, he hoped, be avoided, but which would otherwise involve such terrible and expensive results that it was a duty to do everything possible to prevent such misfortune; that the result would depend in a great measure on the treatment of the Half-breeds; that, friendly disposed, they would mightily contribute to the maintenance of peace, while, dissatisfied, they might render settlement difficult, or almost impossible. He added that\nTHE HALF-BREEDS WERE A HIGHLY SENSITIVE RACE,\n\nkeenly resenting injury or insult. He pointed out the importance of making appointments of the very best character, and in some cases of Half-breeds; he suggested a scheme of settlement embracing conditions as to the non-aliability of the grants; and he concluded by declaring that it was desirable that the Half-breed question should be decided without any further delay; that the required legislation should be passed at the coming session; and that the difficulties would no doubt increase with delay.\n\nNow, at that time, had the advice of early settlement been taken, it might, perhaps, have been possible to apply, in principle, such conditions as were proposed, or some restrictions; it might have been possible, in the then more compliant and better temper of the Half-breeds, before they were stung to exasperation by long neglect, to have dealt with them in that way, and to have preserved and secured their good-will; but the absolutely essential conditions for the accomplishment of this were promptness, diligence, and tact. Every month's delay increased the difficulty. All then pointed to the need of speed; and the Government seemed to realize, for a moment, this vital fact. They decided to settle the claim; they decided to settle it at once; they looked into their powers; they found they had not, under the law, power to settle it executively; and so they took their fourth step.\n\nThey came down to Parliament in the Session of 1879, and asked us to clothe them with\n\nFULL POWER AND AUTHORITY\n\nto settle this claim. Parliament gave them that authority in the words they chose; gave them full power to make such grants of land and on such conditions as they thought expedient to the Half-breeds of the Territories, in satisfaction of their claim, for the extinguishment of the Indian title. That Act was assented to on the 17th of May, 1879. And this closes the first period of their action.\n\nI have shown you that the claim was pressed on them, that they investigated it, that they obtained reports on it; that its justice, its urgency, its importance were demonstrated; that they decided that it should be settled, that they determined to settle it executively themselves; that they asked Parliament to invest them with full power, and so to clothe them with full responsibility for its settlement, that Parliament did so; and thus at the prorogation of 1879 I leave them.\n\nAnd here, Mr. Chairman, my\nand my words of condemnation must begin. Sir, from that hour to which I have brought you, to wit, from that 17th day of May, 1879, all through 1879, 1880, '81, '82, '83, '84, and into the winter of 1885, the Government took not one single step, did not one single act, made not one single move towards the settlement of that claim. (Cheers.) It stood, so far as they were concerned, in the winter of 1885 as it stood in the spring of 1879. (Cheers.) And I maintain that, if I had not one word more to say, I have by these words made a strong, a conclusive case for the condemnation of the Government. (Great applause.) I ask you how it is possible to defend or excuse men who, having obtained this power and undertaken these duties, did, during these many long years, literally, absolutely, emphatically nothing at all towards the use of that power and the discharge of that duty? (Cheers.) Do you suppose it was because the people did not clamour? Do you suppose it was because they after a while gave up disheartened, thinking that their voices could not reach Ottawa and that they must perforce cease their requests for justice? That would, were it the fact, be a poor excuse indeed by powerful guardians for the long neglect of poor and weak and distant wards! It would be a poor excuse by judges and rulers for the delay, which is the denial of justice! (Cheers.) But\n\nEVEN THAT POOR EXCUSE IS WANTING!\n\nthe people did not cease! they did not for years lose heart and hope! they petitioned still, they assembled still, they appealed still, they applied to the local magnates, they wrote, they sent deputations, they did all that men could do to obtain their rights.\n\nLocal authorities added the weight of their words; the white settlers joined in the demand; the North-West Council spoke once and again, and pressed the question as demanding the early and earnest attention of the Government.\n\nThe time, if there ever were a time, for conditions of non-alienation, passed away; the state of things changed, the discontent grew, the demand became fixed and formulated for like treatment as the Half-breeds of Manitoba, and its concession in this form was pressed on the Government by everyone in the North-West, including the Council. But all in vain! The Government was deaf; the Government was blind; the Government was dumb; indeed for all they did in this matter the Government might as well have been dead! Nay better! for had they been dead, I do not believe another baker's dozen of Tories could have been found to succeed them who would have been as deaf, and dumb, and blind, and dead as\nthey; (cheers and laughter) and Canada might have been saved\nthe blow, the dreadful blow, which they caused, if they did not\nactually inflict upon their country! (Cheers.)\n\nAt length, in June 1884, after five years of total, of absolute\ninaction in this pressing matter, occurred an event so marked that\nit might have made the deaf to hear; the dumb to speak, the blind\nto see, nay, might almost have waked the dead—(applause)—for\nthen it happened that these poor people, despairing at last of\nreaching otherwise the ears of their rulers at Ottawa, sent a dep-\nutation on foot to tramp the prairies, cross the rivers, and pene-\ntrate the forests, 700 long miles into Montana, to find, and to coun-\nsel with their old chief and leader, Louis Riel. They reached him;\nthey invited his help; he agreed to return in their company, to\nlead his people in an agitation for the rights which they had so\nlong asked in vain; he returned on this demand, on this errand, in\nthese relations to his kinsmen; and he was triumphantly and en-\nthusiastically received by a large assembly of the half-breeds on\nthe banks of the Saskatchewan; and all these ominous and por-\ntentous facts were known to the Government. (Cheers.) Now\nwhat at this juncture was the relation of Louis Riel to the dis-\nturbed populations of the North-West? That is a most important\nquestion to be answered, when you are measuring the situation\nand awarding its due responsibility to the Government. For I\nask you, having answered that question, to decide, as I believe\nyou will unhesitatingly decide, I ask not you Liberals only, but\nthe most compassionate, the most faithful Tory, the blindest, the\nmost party ridden Tory here, to decide—(even if he can find, what\nI cannot find, in the loving kindness of his nature, in the softness\nof his heart, some, I will not say justification, I will not say ex-\ncuse, but some palliation for that five long years of inaction)—yet\nI ask you all, with absolute confidence, to agree with me, that for\nthe inaction after June, 1884, there is, under heaven, no palliation\nwhatever. (Loud and prolonged cheers.) What was the relation\nof Riel to those amongst whom he came? I will not give you my\nown comparisons—I will give you those of the First Minister him-\nself, used in reply to me in Parliament (Cheers.)\n\nHe said that Riel was\n\nTHE EL MAHDI OF THE METIS;\n\nthe El Mahd—you know him—the Arabian priest, and prophet, and\nusurping chief, who excited in the breasts of the wild tribes of the\ndesert such a convinced belief in his supernatural powers, such\na devoted and fanatic affection to his person, such a des-\nperate fidelity to his cause, that at his bidding, ill-armed and\nundisciplined as they were, they flung their naked bodies in\nferocious fight against the better drilled and more numerous forces of their lawful sovereign, the Khedive; nay, they hurled those naked bodies once and again against the serried ranks of the British battalions; and boldly encountered at once all the old British valour, and all the modern dreadful appliances of war; and the sands of Africa were wet with brave English blood, and English wives and mothers wept bitter tears, for the deeds done, under these influences, by the wild followers of El Mahdi! (Cheers.) He said that Riel was the La Rochejacquelein of the Metis—La Rochejacquelien, the young French noble, who, when all France almost beside had submitted to the Republic, raised again the white flag of the legitimate monarchy, roused the peaceful peasantry of remote La Vendce, led them in successful attack against strong places held by the forces of the Republic, and by virtue of the spirit he infused, the confidence they reposed, the affection and fealty they bore towards their feudal chief, kept at bay for a while the great armies of the State (Cheers.) He said he was THE CHARLES STUART, the Pretender, the leader of the lost cause of the Half-breeds! \"Bonnie Prince Charlie, the King o' the Hieland hearts,\" who, after the lowlands of Scotland, after all England, after all Ireland, had submitted to the new rule, yet raised the clans; marched into Edinburgh; held court at Holyrood; made a descent on England itself; and, when pressed back into the North, fought with his irregular and ill-equipped liege-men in unequal, but obstinate and glorious, and sometimes successful conflict with the disciplined troops of the new dynasty! (Cheers.) The Stuart, who found and proved for the hundredth time the stern valour and the enthusiastic love of his Highland followers—who found and proved it, not only in the fleeting hour of victory, but in the dark season of distress; when, with broken fortunes, and a lost cause, with thirty thousand pounds offered for his head, and death assigned as the penalty for his harbourer, he was safely guarded, and loved, and cherished, and sheltered by his clansmen in the caves and glens and bothies of the Highlands, as safe as if he had been in command in the centre of a British square! (Loud cheers.) Yes! they scorned the base reward, they contemned the dreadful penalty; they kept him safe, and at length helped him to escape to other climes, to wait for the better days that never came. (Loud cheers.)\n\nSUCH WERE THE MEN\n\nto whom the First Minister compared Riel, in his relation to the Metis. And, such being his relation, I ask you was not his coming an ominous and portentous event? (Loud cheers.) He came, with all that power and influence over that ill-educated, half-\ncivilized, impulsive, yet proud and sensitive people, living their lonely lives in that far land; he came amongst them at their request, he who had led the Half-breeds of the east in '69, and had achieved for them a treaty and the recognition of their rights; he came to lead his kinsmen of the west in the path by which they were, as they hoped, to obtain their rights as well! Had the Government been diligent before, they should have been roused by this to further zeal! But he came after five years of absolute lethargy on the part of the Government, when they knew that they had not been diligent, and when, therefore, they had a double duty to repair, in the time God gave them still, the consequences of their sloth! (Cheers.) Surely, surely, such a coming should have made the deaf to hear, the blind to see, the dumb to speak; surely it might have almost waked the dead! (Loud cheers.) But, you may say to me, why should there be alarm? These were, after all, but a feeble folk; there were in the whole of that vast territory, scattered over its thousands of miles, less than five thousand of them, men, women, and children from the little infant in arms to the old grandfather tottering towards his grave—they were but a feeble folk—why should the Government be alarmed? That again is a poor excuse—the voice of conscience should have alarmed them. The record of duty neglected, of justice denied, should have shamed them into action. (Cheers.) Fear should not have been the only impulse towards the performance of their duty. But remember, though the Half-breeds were few, the settlers also were few and unprotected; and even 4 or 5,000 of such a population as the Half-breeds could inflict much damage. And remember too that\n\nTHEY WERE NOT ALONE.\n\nThere were also their Indian kinsmen. (Hear, hear.) These numbered many thousands; they were trained warriors, and unhappily their condition was largely that of discontent, jealousy, hostility, semi-starvation and desperation. They would have been more than human if they had not felt hostile to us, though well and wisely managed—and—I am sorry to say—they were not managed well or wisely. (Loud cheers.) I need not describe their condition in my own words. LET ME STATE IT IN THE WORDS OF THE PRIME MINISTER, when we charged him with so conducting affairs as to provoke dissatisfaction. He said speaking sometimes of the Indians and sometimes of the Metis, whom he seemed to confound together, that we had no right to expect that we would be so successful in governing the country in peace and quiet as we had been; that the country was occupied by savages or semi-savages, by men then driven to desperation, through the\ndisappearance of the buffalo; that hungry men were desperate, starving men were ready to grasp at anything, ready to charge those in power with being the cause of their starvation; that when Louis Riel was sent for that summer, he was sent for by these poor people, suffering from hunger; and that Louis Riel listened too readily to the invitation of the poor starving people, the Metis in the neighbourhood of Duck Lake. Thus you will see he knew the condition, and that there was great danger of an Indian rising; indeed there had been armed resistance to the authorities and open insubordination during the season; and it was obvious that peril was in the air. But if a rising was to be apprehended, even under good government, I leave you to imagine what the chances were under such a government as that which ruled at Ottawa. (Cheers.) However, good government or bad government, the danger was there before Riel appeared. How greatly that danger was increased by his appearance, you can judge. (Cheers.) Thus you will see that the question was not one simply of a Half-breed rising; it was one of a Half-breed and an Indian rising; and no graver, no more alarming conjuncture can be conceived.\n\nSurely then, at any rate, the Government should have acted! (Cheers.)\n\nThere were in the Territories that summer several Ministers, among them Sir Hector Langevin, who met the Half-breeds at Qu'Appelle, received the complaint, agreed in its reasonableness, and promised the attention of his colleagues. He was there at the request of Sir John Macdonald, to spy out the grievances. This one he learned, but he forgot the lesson; no record is to be found of his pressing the matter at Ottawa, and nothing was done. (Cheers.)\n\nMr. Burgess, the Deputy Minister of the Interior, was there that summer; he knew of the grievances; but nothing was done.\n\nOther Ministers were there; but nothing was done.\n\nIT WAS NOT FOR WANT OF WARNING.\n\nThe North-West Council felt that the danger was imminent and in July passed a resolution, that it recognised absolutely the justice of the claims of the Metis, so far as concerned the grants of land which they demanded.\n\nThe resolution was telegraphed to Sir John Macdonald, as first Minister, and also acting Minister of the Interior.\n\nSir John telegraphed in reply, that the Minister of the Interior on his return from Europe, \"would take into his serious consideration\" (loud laughter), the questions relating to the Half-breeds; and he did nothing at all.\nThe Minister of the Interior was in England; he was there on important business—on business of the State, deeply affecting the public welfare—he was there—he was there—getting knighted. (Roars of laughter.) He returned later, honoured by his Sovereign, who honoured Canada in his person; decorated for his great public services; standing, if that were possible, a step higher in the general estimation; ready, we may presume, at last to dispose of the public business which he was paid and sworn to settle.\n\nWhether he considered this matter at all, whether he considered it seriously, I cannot tell—but this I know that unhappily nothing was done; it is still the same sad and incomprehensible story of absolute inaction. (Cheers.)\n\nNo one did anything. Was it for lack of still more pressure? No. Bishop Grandin wrote a letter to Sir H. Langevin, pointing out the grievances, the disturbed condition, the danger of delay, the importance of action, and imploring redress.\n\nHe might as well have implored the dead! (Cheers.) Bishop Grandin wrote a like letter to Sir John Macdonald, in still greater detail—he might as well have implored the dead! (Renewed cheers.)\n\nThese letters are so damaging, that though repeatedly called for, and sometimes promised, the Government has not dared to bring them down, and lay them before you.\n\nThey are in the mass of concealed and suppressed papers, which these criminals hold in the public vaults, dreading the condemnation which their production would ensure! (Cheers.)\n\nI have made many efforts to get you these papers; I have laboured long and hard to secure for you the knowledge which is your due; but\n\nONLY THE CORNER OF THE VEIL HAS BEEN LIFTED;\n\nonly a fraction of the mass of incriminating papers has been dragged out of their reluctant hands; the rest they hold; and the task of obtaining them has, I believe, passed out of my hands. It has fallen into yours; you must perform it at the polls. (Cheers.) Send men to Parliament who will force the production of these further materials for a judgment, and then, and not until then, will you obtain them. (Loud cheers.)\n\nThere were letters and telegrams from various important quarters; there were newspaper accounts too. But there were other warnings. There were GREAT MEETINGS at various points, some of Metis, and some of whites, speeches were made, resolutions were passed, the agitation increased, redress of the grievances, recognition of the claims was loudly called for. There were PRIVATE MEETINGS too,\nmore dangerous than the public ones—the whole district was in an obviously feverish and excited state. No man knew what was going to happen, or how soon; every man thought that the Government should act at once and redress the grievance.\n\nBut nothing was done. (Cheers.) Yet I do not tell you that the Government was stone deaf, or quite blind, or wholly dumb. There did penetrate those dull ears some faint echo of the clamours rising on the banks of the Saskatchewan! There did pierce those dim eyes some flickering glimmer of the lurid light reflected from the waters of that mighty stream! There did come at last some confused and imperfect utterance from those long-sealed lips! But, alas, the ears did not hear aright, the eyes did not see true, and the lips spake not the fitting words! (Cheers.)\n\nMr. Chairman, there are two great and fundamental duties of Governments, a primary and a secondary duty.\n\nThe primary duty, the most blessed and happy, the most God-like duty, that which nearest approaches, at a distance, however infinite and awful, the divine attributes, is the duty of faithfully doing full justice, of\n\nPROMPTLY REDRESSING ALL GRIEVANCES,\n\nof dealing in a broad and generous and merciful and liberal spirit with the claims of the poor and weak and humble and distressed. (Cheers.)\n\nThe secondary duty, a stern and painful duty, a duty which in these later and happier days seldom, thank God, or never, arises, unless the first has been shamefully neglected, is, if unhappily the public peace be broken, the public order disturbed, the public authority defied, firmly and effectually to restore peace, to re-establish order, to vindicate authority.\n\nThere would have been no need in the North-West for the performance of that duty but for the shameful neglect of our rulers as to the other. (Cheers.) But they did apprehend danger—they did fear a rising—they did move, though in a bungling and foolish way, towards the discharge of the duty of suppression.\n\nWHAT WAS THEIR FIRST SIGN OF LIFE.\n\nwas their first sign of life?\n\nIn July they sent Col. Houghton to the Saskatchewan to collect the arms of the old volunteer companies, to remove them from the district, and to put them in a place of safety. Why? For fear they might be seized by insurgents, and the muzzles might be pointed against the wrong breasts.\n\nCol. Houghton reported to Sir A. Caron on the danger of a ris-\ning, the condition of discontent and agitation, the need of prompt measures of redress. His report is suppressed—they dare not bring it down; but the fact is as I have stated. Yet nothing towards redress was done! And this other sign of life they gave:—They obtained from the Hudson's Bay Company the post of Carlton, which was within \"striking distance,\" as soldiers say, of the centre of the agitation; and this post they occupied with Mounted Police, so as to be ready to strike the blow, and to suppress the insurrection, when it should come. Thus I show you that they—even they—had grasped the idea of danger and were preparing for the resort to force.\n\nBut while they took these steps, ill-advised and inadequate as they were, in the discharge of their duty to restore the peace by arms, they were yet blind and deaf and dumb as to the evidences of that first and highest duty of preserving the peace by doing justice and dispensing equity, removing grievance and redressing wrong, and so taking away the weapons of the agitator, the reasons for revolt. They made ready to suppress, they did nothing to prevent! (Cheers.) And so all through June, July, August, September, October, November, December, and into January; all through those long months of summer, fall, winter—for now the crisis nears, now we come to count by months, not years—all through those invaluable months still allowed them for redress, they did in this regard literally and absolutely nothing. (Renewed applause.) Now was the accepted time, now was the eleventh hour, still the lamp held out to burn; the time was passing, the lamp was flickering; all called for action but nothing was done! (Cheers.) There they reclined in their luxurious couches, there they transacted their political intrigues, there they concocted their plans for enjoyment of the sweets of office and the partition of the public treasure and estate, but they were wholly indifferent to the call of duty.\n\nThey remind me of Tennyson's description of the old gods—they seemed\n\n\"To live and lie reclined:\nOn the hills like gods together, careless of mankind;\nFor they lie beside their nectar, and the bolts are hurled\nFar below them in the valleys, and the clouds are lightly curled\nRound their golden houses, girdled with the gloaming world;\nWhere they smile in secret, looking over wasted lands,\nClanging lights, and flaming towns, and sinking ships, and praying hands,\nBut they smile, they find a music centred in a doleful song\nStreaming up, a lamentation and an ancient tale of wrong,\nLike a tale of little meaning, though the words are strong;\nChaunted from an ill-used race of men that cleave the soil,\nStore the seed and reap the harvest with enduring toil;\nTill they perish and they suffer.\"\n\n(Applause.) Such seemed to be the demeanour of the Government.\n(Renewed applause.) Through all these long months the agitation grew, and the remonstrances doubtless increased, and at length—at length—the Ministers awoke. They woke in January, they woke late, they woke but for an instant; and then they took a step—a step on which they now rely for defence. No step then taken could atone for their previous neglect. (Cheers.)\n\nBut\n\nWHAT WAS THIS FAMOUS STEP?\n\nAt the very end of January, 1885, they decided that, with a view to settle these claims equitably, three men should be appointed to ascertain the number of the Half-breeds. (Laughter.) That was all! No recognition of their rights; still less any statement of the extent or principle of settlement; still less any machinery for effectuating a settlement! Only a numbering of the people! (Laughter.) Whether few or many, their rights were the same; nor was the number of any consequence to the settlement. (Cheers.) But, at any rate, this was all! And, having made the order, they slept again. (Cheers and laughter.) They did not wake even long enough to put the abortive order into execution—THEY SLEPT AGAIN. Whether it was the sleep of the just, judge ye! (Cheers.) And so the time passed, and the sands ran out of the glass—so slipped away valuable days and weeks—for the period of grace was now shortened, and only days and weeks remained—so slipped away the short remaining time, unused and wasted, till the day of grace had passed, till the people rose, till blood was spilt, till Duck Lake fight was fought! (Cheers.) Yes, at length revolt raised its horrid head, and the sounds of the firing, and the groans of the wounded, and the laments over the dead, and the cry of alarm from the North-West reached the ears of the Ministers; and they woke again! (Cheers.) Waked again, they took another step. In the end of March they made what they declared for a few days was a recognition of the claims, and they appointed commissioners to settle them on the basis they fixed. Then for the first time, did they propound a solution; then, after the rising. But, even then, can you believe it, so ignorant, or dull, or obstinate were they, that their so called settlement\n\nWAS NO SETTLEMENT AT ALL;\n\nthat, for a large number of the cases, it allowed in truth nothing at all for this claim! (Cheers.) I need not go into details to prove this astounding statement. It is admitted. Their commissioners went in hot haste to Winnipeg, saw the chief men, looked into the matter, and telegraphed and wrote to the Government demonstrating this amazing fact, and asking further powers. And the Minister, on\n6th April, telegraphed agreeing to the change—then, and then for the first time, agreeing to do justice. (Loud applause.) Now, indeed, they acted with energy; the Government notified every postmaster, every telegraph operator, every station agent, every Government official, every missionary, every one they could think of, that the Commission was going to work; they proclaimed far and wide the coming, at long and at last, of the messengers of the gospel of peace, on their errand of mercy and of justice. (Cheers.) They ordered the commissioners not to stand on forms or ceremonies. \"If you meet a Half-breed on the trail,\" said they, \"stop him; set up at once the staff of justice; open your court forthwith; ask him whether he has a grievance; if it comes within your powers, decide it at once, and satisfy him; if it is beyond your powers, take his evidence, send it down to us, and tell him he will be well treated.\"\n\nWHY ALL THIS HASTE?\n\nWhy this spasm of energy, of liberality, of beneficence? Why? Ladies and gentlemen, it was because there were Half-breeds scattered all over the North-West, because all were kinsmen of those who had risen, because many had grievances of their own, because the trails led to Batoche, and the Half-breeds knew the trails! (Cheers.) Government realized the danger! It was not from the few men who had actually risen; they could not, standing alone, cause a moment's serious anxiety. It was from their kinsmen and fellow-Metis all over the North-West, and from the Indian tribes; it was from a general North-West rising, that the danger was to be feared. That danger was pressing, as pressing as the grievances were widespread; and this it was they were averting by the vigorous action of the Commission. (Cheers.) In the course of a very few weeks it was found that there were about two thousand of this class of claims, beside many in regions unvisited, and apart from all the other grievances. That is a great number—\n\nTWO THOUSAND SEPARATE CASES\n\nof long-standing grievance unredressed. But it is greater even relatively than absolutely; for there were less than five thousand souls of that population, so that nearly half the whole population—men, women and children—laboured under this sense of personal wrong and injustice. Just suppose that over two-fifths of the people of Ontario had long-standing personal claims neglected and ignored for years by Mr. Mowat's Government, and tell me whether you think there would not be amongst our people an agitation and discontent\nwhich would ensure redress! (Loud cheers.) But some apologists for the Government say:\n\n\"OH, BUT THE GRIEVANCE DID NOT CAUSE THE REBELLION.\"\n\nIf that were so, it does not lessen the guilt of the Government. (Cheers.) Had the people been patient still, had they not been led into the unfortunate step of rising, yet the Government would have been guilty of that neglect, delay, and mismanagement which I have this night charged and proved against them! It is not the Half-breed rising that makes the Government guilty, it is their own misconduct. (Cheers.) But the excuse is false. These apologists say this grievance did not cause the rising, because only 200 or 300 rose, and out of these only a few had claims of this particular nature. The argument is absurd. It was not the only grievance; there were others, it was one of several. (Cheers.) But did you ever hear or read of a rising which was confined to those who had in their own individual cases suffered from grievance? No! The brothers, the fathers, the sons, the kinsmen rise, the neighbours, the friends, the sympathisers rise! (Cheers.) Man sympathises with his fellow man, and this, even when it leads to his joining in the fight for his fellow's rights, is not a low or base characteristic of humanity! (Cheers). But again, do you suppose the insurgents and their leader did not count when they rose on being joined by the others? They did; and there was great danger of it too! And this assurance and this danger was due to the fact that there was a large body of aggrieved Half-breeds to appeal to. (Loud cheering.) But the Government have lately published Half-breed declarations which prove the case. They have this long time been engaged in getting whitewashing papers from the Half-breeds; they have demeaned themselves by sending their powerful agents to these poor people, some wounded in battle, some imprisoned under the law, some exiles from their country, all ruined, starving, and despairing, dreading they know not what further horrors, uncertain of their future, doubtful of amnesty, doubtful of their poor holdings, absolutely dependent on the good-will of the Government, feeling it vital to gain that good-will, and taught that the easiest road to it was to say what the Government wished should be said as to the rebellion; they have sent their agents to get papers from these poor Half-breeds. (Cheers.) I do not attach the greatest weight to acquittals of the Government, to condemnations of Riel, to excuses for themselves put forth by the Half-breeds on this pressure, and at this instance; at any rate so far as their sentiments are such as their rulers require at their hands. (Cheers.)\nBut I do say that when, even in statements so obtained and so put forward, you find\n\nPROOFS OF THE GUILT OF GOVERNMENT,\n\nthat evidence is of the highest value. (Loud cheers.) And I find that in a fresh batch of declarations, published by the Mail, at the instance of Government the other day, and said to come from twenty-four of the principal insurgents, about one half of them declare that this grievance of the neglect to make the grants for extinguishment of the Indian title was their ground for rising; extinguishment of the Indian title was their ground for rising; not that all of them had personal claims; but this wrong to their people was their ground. (Cheers.) But I need not waste time in arguing it. I can prove it out of the adversary's mouth. Mr. White, the Minister of the Interior, before he saw the fatal effect of his statement, in his futile efforts to rebut the charge of delay, declared on several platforms that the action of the Government, in ordering the numbering of the Half-breeds, had actually precipitated the rebellion. So far from their delay having caused it, their action hastened it. How? Because, said he, Louis Riel, when he heard that at last the Government was about to take steps towards redress, raised the people some weeks before he had intended, knowing that if, even at that twelfth hour, the people should learn that the Government was really moving towards redress, they would refuse to rise, he would lose his power to move them, his game would be spoiled. And, that being so; it being so, that, even then, those hearts so sick with hope deferred, those spirits so angered by neglect and delay, those wills so controlled and excited by the influence of Riel, would all be calmed and soothed by the news, the joyful news, of a step towards justice—it being so, that this joyful news would even then have prevented a rising, I ask you how can the Government escape condemnation for having left unhealed for years this festering sore, for having delayed for years that redress, which they now admit would have rendered impossible a rising, which \"would have spoiled the game?\" (Loud and prolonged applause.) If by action even then, known to the people, if by doing, even then, the justice which a little later they were compelled to grant, the rising would have become impossible, the staff of the agitator would have broken in his hands, his power for evil would have ceased.\n\nHOW SHALL THE MINISTERS ESCAPE\n\nthe judgment of an indignant people for their long months and years of absolute inaction? (Great cheering.) I have\ntold these men to their faces on the floors of Parliament that I hold them responsible before God and man for every dollar of the five millions of our lavished treasure; for every drop of blood shed, whether on the field or on the scaffold; for every pang of suffering, sorrow, or anxiety borne by the lone settler in the North-West, his wife, and children, or by us his kinsmen in the east; for the stain on the fair name of Canada, tarnished by two rebellions within fifteen years, both due to misgovernment; for the check to the prosperity of Canada, injured, deeply injured, by the North-West troubles! (Thunders of applause.) For all this I hold them responsible, and ask you to condemn them by your votes! (Renewed applause.) Well, the rebellion broke out; and no man could tell how far the flame might spread, or what might be the end. The duty of public men then was to take steps to restore order, and provide security. That duty devolved on the Government whose neglect had caused the rising; but none the less was it the part of the Opposition to assist, to aid them by our counsel, to strengthen their hands in the task, to spur them forward in the work; and we performed our part. (Cheers.) We gave them all the money, and munitions, and men they asked for; we suspended, at their request, wholesome rules, though the need resulted from their neglect; we did all that men could do to promote the restoration of peace, even by the stern means of war. (Renewed cheers.) We were charged, nevertheless, most unjustly and ungenerously charged, with creating and fostering and sympathizing with the rebellion. It was the old game of the robber, running down the street, crying out \"stop thief.\" (Cheers and laughter.) Why, they would almost persuade you that the volunteer force was a Tory institution, not manned or favoured by the Reformers! (Cheers.) And indeed they did their best, by the appointments of commanding officers and otherwise, to use the force and the war to the profit of the Tories. (Cheers.) But, sir, the Reformers have always sympathized with the volunteers; our effort has been to secure greater consideration for the rank and file; we felt for them, we cheered them, we encouraged them, we did all men could do to lessen the toils and dangers of our brave defenders. (Loud cheers.) And we sympathized with them all the more because we felt that they, whose appropriate duty was to risk their lives in defence of Canada against foreign foes, were called on to endure toils and wounds and death in a struggle against Canadian citizens, on Canadian soil, due to Canadian misgovernment. (Loud cheers.) We knew what their feelings must naturally be, and we saw, and rejoiced to see, how\nNOBLY THEY DID THEIR HARD DUTY.\n\n(Loud cheers.) We not sympathize with the volunteers! Why, in their ranks are to be found today, I venture to affirm, the full proportion of Reformers; there you would find our political friends, our personal friends, our sons, our brothers, our kinsmen, our connexions. (Cheers.) Take the case of the humble individual who speaks to you. Of the Ontario Law Society, of which I have the honour to be head, twenty-one members served in the Queen's Own and the Royal Grenadiers in the North-West. Out of the twenty-one, seven, one-third of the whole, were out of my office. (Cheers.) Of the commissioned officers in the Grenadiers on North-West service, one was from my office; of those in the Queen's Own no less than four, one-fifth of the whole number on the strength, were from my office. Not only did seven men go out of my office,\n\nTWO WENT OUT OF MY OWN HOME.\n\n(Loud cheers.) Let them point to any other case in Canada like this, before they ask you to believe that we Reformers could be so unnatural as not to feel and show the deepest anxiety to quell the rebellion, and the deepest sympathy with our gallant volunteers! (Cheers.) Our wives and daughters helped at home, and did all that women could to diminish the hardships of the men abroad, and of the dear ones they had left behind. (Cheers.) And yet we are to be told by these Tory monopolizers of loyalty, and public spirit, and patriotism, and sympathy, that we fostered the rebellion, and wished success to those who rose, and wounds and death to our own people! (Tremendous cheers.) But you understand the object; it is by any means, however vile, to avert your judgment on themselves; and for that they resort to these base attacks on us. (Cheers.) The rebellion over, the time came for judging our rulers for their conduct: They have used every means to prevent that trial. As I have told you they have suppressed the papers. As I have told you, they have cast the blame on us. They have repeatedly cast it on the white settlers. But they determined to make a supreme effort to cast it wholly on Riel, not only to his condemnation, but also, and that is a very different thing, to their own exoneration. Order restored, they put the law in force, they proceeded to the trial, the conviction, the sentence, and the execution of Riel. And they have since proclaimed that their actions in that regard is the question to be tried—that, they say is the great issue! (Cheers and laughter.) I cannot to-night discuss that question. You know my views.\nam ready to maintain them; and I believe they are such as history will record as sound. I did not, and do not believe, that according to the settled principles of the administration of criminal justice, the Government in that respect did its duty. But whether I be right, or they, on that question, matters not one whit as to your verdict on the true issue, their responsibility for the rebellion. (Loud cheers.) I have never denied that there was treason on the banks of the Saskatchewan, amongst those half civilized, illiterate, misguided, but also much abused people. There was treason under the law. Nor have I ever contended that the circumstances afforded even a moral justification for a resort to arms, whatever palliation may exist by reason of their ill-treatment. But I tell you that treason was not confined to the banks of the Saskatchewan. (Cheers.) There was treason on the banks of the Ottawa as well. (Loud and prolonged applause.) There was treason there, not amongst poor, half-savage, uneducated, misled men, stung to madness by contempt, neglect, and the long denial of justice, starving and desperate, led astray, if you please, by agitators;\n\nTHERE WAS TREASON AT OTTAWA\n\nagainst the Queen's majesty, against the Canadian people, on the part of men in the highest place, men of the widest knowledge, men of the largest experience, men living at ease upon the people's taxes in order that they might do the people's work! (Loud cheers.) I charge it on the pledged councillors of the Queen, on the men who wear her honours, on the men solemnly sworn so to advise Her Majesty, so to conduct the public affairs, as that her people should be well and wisely ruled, that justice should be done, that harmony and peace should mark her happy reign.—I charge it on these men that they unjardonably violated that solemn oath, that they wantonly neglected their prime duty, that they left just claims unheeded for long years, that they gave the opportunity for rebellion, and so tarnished their sovereign's honour and betrayed their country's welfare! (Tremendous cheering. Voices, \"We will turn them out!\") Aye, turn them out! I have told them that in older and sterner days men far higher placed than they, peers of the British realm, have been attainted at the bar of the House of Lords, have stood in peril of life and limb, of freedom and estate, have been dishonoured and disgraced, and declared incapable of ever serving the Crown again; for neglects of duty, and betrayals of trust, and violations of obligation far less flagrant! (Cheers.) I have told them that our modern and milder age provides for crimes like theirs no adequate punishment; that their only punishment will be the people's withdrawal of the power they\nhave abused! (Tremendous cheering.) Thus far only you can go. This only you can do. And this,\n\nIF YOU ARE WORTHY OF YOUR FREEDOM.\n\nthis you will surely do! (A chorus of voices, \"We will!\" and thunders of applause.) But they have their plea. They plead, as an ample expiation for all their blunders and all their crimes, they plead the blood of Louis Riel! Let me recall to you a sequence of events. Had there been no neglect, there would have been no rebellion; if no rebellion, no arrest; if no arrest, no trial; if no trial, no condemnation; if no condemnation, no execution! (Loud cheers.) They, therefore, who are responsible for the first are responsible for every link in that fatal chain! (Renewed cheering.) And yet they tell you, \"Because in the last event we have done our duty, because we have executed the man who headed the rebellion, you are not merely to sanction that last act, you are to do far more, you are to cast the mantle of oblivion over all our prior crimes, you are to give us that mercy and favourable consideration which we denied, you are to welcome us as innocent and worthy men, whose sins have been all washed white in the blood of Louis Riel.\" (Loud and prolonged applause.) But\n\nEVEN THIS WAS NOT ENOUGH.\n\nAn effort has been made for more than a year past to divide Canadians on lines of race and creed, to the expected gain of the Tory party. For more than a year the fires of race hate, the fires of creed hate, have been assiduously fed and blown; and it has been proclaimed that the dividing lines must be found in origin and faith. In the fall of '85 we were told that the French and the Catholics were about to unite in solid column against the Government because of the execution of Riel; and that it was the bounden duty of us, English-speaking Protestants, to unite in solid column to oppose the Catholics and French. I shall not easily despair of my country; but if aught could fill me with despair as to its future, it would be such a situation as was described. That would, indeed, leave but little to hope for in the land we love. (Cheers.) We could not prosper or grow on such conditions; we must inevitably wither and die. (Renewed cheers.) Then, if this would be the deadliest blow to Canada, what is the measure of their guilt who invented the situation, in order to provoke it into existence? (Cheers) It was not the real situation. In January, '86, at London, I explained the truth. I pointed out that there was no such union of French and Catholics, as pretended; I pointed out that the Government was in no danger whatever on\nthe question as pretended. Knowing, as I do, something of the political map of Canada—(cheers)—I declared not merely that the French and Catholics would be divided, but that the Liberals themselves,\n\nTHE OPPOSITION WOULD BE DIVIDED.\n\nI declared that on this question, as one involving the administration of justice, and also as one into which an effort had been made to introduce issues of race and creed, I would see that the Liberal party should take no party line; should maintain no party connection, should act and vote entirely regardless of party, as each man, after hearing the evidence and argument, should for himself, guided by his own conscience decide to be right and just. (Cheers.) And the events verified my predictions; the French were divided; the Liberals were divided; the Government obtained a large majority; and then, forsooth, the Tories turned round and said, \"How disappointed Mr. Blake must feel that he did not beat the Government on this Riel question.\" (Cheers and laughter.) Of course, I was very much disappointed that my predictions had come true, while all theirs were falsified. (Laughter.) But they had their reasons for the cry, and in one shape or another they have kept it up ever since. You find them declaring next that the Local Government of Quebec would be swept out of existence at the polls; and exciting Protestant alarm at such a result. And now they say that the Local Government has been sustained. (Laughter.) Then you find them saying that French Quebec would go solidly against the Dominion Government at the polls; and exciting the English speaking Protestants of all the Provinces to band together in revenge. And now some of them say the Ottawa Government will have a majority of Quebec. (Laughter.) Then you find a persistent attempt made to create odium in the minds of the English Protestants against the religious institutions of Quebec, institutions within her exclusive control, and with which we have no more right to meddle than they have with ours. (Cheers.) Then you find\n\nA CRUSADE AGAINST THE FRENCH\n\na dominating over the English speaking Protestants of that Province, and a call to all Protestants everywhere to do something forcible, I know not what, for the relief of their brethren; once again, a thing beyond our control, a thing impossible to be achieved, save at the expense of the Confederation, impossible, even so, to be achieved. (Tremendous applause.) What we in Ontario value most in Confederation is our uncontrolled power to manage our local affairs—our measure of Home Rule. (Cheers.)\nWe cannot take that power from Quebec without surrendering it ourselves. (Renewed cheers.) The charter of our liberties is a common charter; it grants to all, it guards for all. Hold it as a sacred thing! Do not rashly propose to surrender to Ottawa any liberty you now enjoy uncontrolled! (Cheers.)\n\nThe very agitation is dangerous—dangerous to that minority in whose professed interest it is started. Others are like ourselves; ill-disposed to yield to threat or force what we might gladly concede to kindly representation. I tell you, as I have said elsewhere, that this is our best, our only way of helping minorities elsewhere; this, and the influence of a good example, shown by ourselves in our treatment of the minorities of race and the minorities of creed amongst ourselves. (Great applause.) But that is not what these champions propose! Their further programme is one of—\n\nJEALOUSY AND SUSPICION, HOSTILITY AND RESTRICTION,\n\ntowards our own Ontario minorities, against whom for the last many months they have been endeavouring to arouse the latent bigotry and intolerance which they hope still subsists within our breasts. I trust in God that they will fail! (Cheers.) I trust that we Liberal Protestants will hold firm to the doctrines of civil and religious liberty, of equal rights, of fair play, tolerance, and liberality from the strong towards the weak. (Great cheers.) So may we speak trumpet-tongued, if need there be, for minorities elsewhere! So may we truly hope to help the weak of other Provinces, should they need our aid! I hope that the people of my native Province will rise to the occasion; that they will give on the 28th of December a decisive verdict on the tendered issues; and I believe that such a verdict will be the precursor of a righteous judgment to be soon delivered against the Government at Ottawa—(cheers)\n\n—A JUDGMENT ALL THE MORE SEVERE, A PUNISHMENT ALL THE GREATER, BECAUSE OF THE SHAMEFUL EFFORTS WHICH HAVE BEEN MADE TO AYERT THE JUST DOOM OF THE OFFENDERS; EVEN BY THE RUIN OF THE STATE THEY RULE. (Thunder of applause.)\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001574.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 43506, "total-output-tokens": 17443, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 371, 2], [371, 2645, 3], [2645, 4637, 4], [4637, 7382, 5], [7382, 9960, 6], [9960, 12494, 7], [12494, 15009, 8], [15009, 17613, 9], [17613, 20336, 10], [20336, 22716, 11], [22716, 25376, 12], [25376, 27844, 13], [27844, 30445, 14], [30445, 33181, 15], [33181, 35917, 16], [35917, 38600, 17], [38600, 41092, 18], [41092, 43601, 19], [43601, 46000, 20], [46000, 48814, 21], [48814, 51407, 22], [51407, 53928, 23], [53928, 56605, 24], [56605, 59178, 25], [59178, 61891, 26], [61891, 64437, 27], [64437, 67180, 28], [67180, 69761, 29], [69761, 72331, 30], [72331, 74404, 31], [74404, 74404, 32]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]