[{"id": "49d6f16f886279cb2fafb4664b49a9a61e33dfee", "text": "FACTS FOR ELECTORS\n\nREFORM, RACE and REVENGE\n\nTHE RISE AND PROGRESS OF THE RIEL MOVEMENT IN QUEBEC AND ONTARIO\n\nDuring the progress of the Riel Rebellion and for months after, the Reform press clamored for the punishment of the chief rebel. He was not mad, so it was said; his crime was entirely without justification; nothing but death would expiate his crimes. In evidence, let us take the opinion of some Reform organs BEFORE the execution:\n\n\"This morning at a late hour,\" says the Globe of May 16, 1886, \"the glorious news was flashed over the wires that Riel had been 'captured. . . . A soldier's death would have been far too good for the traitor-agitator.' In June the same paper said, 'We want Riel and the other ringleaders brought to immediate justice;' and in July the same organ opined that 'the public believe Riel and his associates guilty of the highest crime known to the law. And public indignation would be excited did any of them escape punishment.'\n\nIn August the same journal said: 'The crime of which Riel has been convicted is one of the most dreadful that can be imagined. It was of the essence of Riel's crime that he knew what the Indians are capable of, and what atrocities they would probably commit, when their savage nature was thoroughly excited.' Still more: 'As to the prisoner's guilt there has been no shadow of doubt since his letter to Poundmaker was produced. Nor as to his sanity has there been any doubt since the jury, having heard the experts' evidence, decided that Riel was responsible.' The London Advertiser was equally clear: 'Why should the Province of Quebec come to the rescue of Riel? Why should it overlook the murders of men and women, clergymen and laymen, and the consequences of Riel's appeal to the Indians?' The same authority goes on to say at another time: 'The law makes treason a crime. The law has pronounced Riel guilty of that crime. The duties of the Executive are clear and simple.' In May the Globe went on to say: 'It will occur to\n\"everybody that this is the right moment for the Government to\nstep in and offer a heavy reward for the rendition of the persons\nor bodies of Riel and the other ringleaders of the rebellion.\" The\nOttawa Free Press, a stalwart Blakeite, was of opinion that \"when\nRiel conspired with the Indians he opened the gates of rapine and\nmurder, and for that offence deserved the severest penalty possible.\"\nThe Guelph Mercury was clear that \"Riel deserved the murderer's\nfate:\" and the Huron Expositor thought that \"he certainly deserved\nto be hanged, if ever a man did.\" \"The life of Riel is a small matter\nin the presence of the law,\" thought the St. Catharines News. The\nSt. Thomas Journal was at that time equally outspoken. \"Riel had\nbeen sentenced to be hanged,\" said that authority; \"now we wait\nthat hanging. Riel's trial was short, his condemnation swift. May\nhis fate be sure.\" The Brantford Expositor thought that \"if Riel\nescapes the hanging, it will be a miscarriage of justice.\"\n\nA NOTABLE CHANGE OF FRONT\n\ntook place along the whole line of the Reform press after the execu-\ntion of Riel, showing that it was not for love of justice, but for\nparty purposes that the Globe, its satellites and the Grit party had\nhounded down Riel and his dupes. Then it was suddenly discovered\nthat Riel's course was justifiable—at any rate that he was insane, and\nhad been unfairly tried. It was ascertained that he had fallen a\nvictim to the Orange thirst for blood, and that his execution was a\n\"judicial murder.\" On the 26th of March the Globe was clear that\nthe Government is now on trial for having executed the leader of\nthe insurrection;\" that \"the execution was a cruel, a barbarous, an\nimpolitic, an unstatesmanlike, and a totally unnecessary act.\" Mr.\nBlake declared in the House of Commons, on March 15th, that he\nwas \"unable honestly to differ from the view that it is to be deeply\nregretted that this execution should have been allowed to take place.\"\nCommenting on this, the Port Hope Times said: \"We extend our hearty\nsympathies to our Quebec brethren, and we assure them in the name\nof the Liberal party that they have hosts of friends in Ontario.\"\n\nTHE CRY WAS AT ONCE RAISED\n\nin the Province of Quebec that Riel had been executed because he\nwas a French-Canadian, a Catholic, and vengeance upon the Dominion\nGovernment was resolved upon. On the afternoon of November\n16th, 1885, the Montreal City Council met, and strongly protested\nagainst the execution. After the adjournment the city hall flag was\nraised to half mast, and a mass meeting was held outside the building.\nAmong the speakers was Mr. Mercier, Ald. Prefontaine, now President\nof the Dominion Young Liberals' Association, followed with a violent\nspeech, in which he asserted that \"the hanging of Riel was virtually\nthe sacrifice of the French race to fanatical prejudice, and that it\nwas the duty of all faithful Canadians to see that Sir John was\ngiven a terrible lesson.\" In the evening an immense crowd gathered\non the Champ de Mars, where effigies of Sir John Macdonald, Sir\nHector Langevin, Sir Adolphe Caron and Hon. M. Chapleau, were publicly burned. An English newspaper office was visited, stones were sent into the windows of the editorial rooms, and the proprietor narrowly escaped a serious wound. In Quebec the same evening, 15,000 people met in a gathering which was \"exceedingly violent in its expressions and resolves of antipathy to the Orangemen of Ontario.\" The windows of the Chronicle, the only Quebec paper which approved of the execution, were smashed.\n\nRACE AND REVENGE.\n\nOn the following day the organizers of the so-called National Party met in Montreal for the purpose of laying out their plans. An executive committee was appointed. Among the members of that committee were Mr. Mercier and Mr. Prefontaine, now President of the Young Men's Dominion Liberal Association. On the same day a mass meeting was held in the Champ de Mars, and the following sentiments were embodied in the resolutions then passed:\n\n\"That the execution of Louis Riel is an outrage to justice and humanity, that the French-Canadian Ministers, and those who endeavor to justify their conduct, be looked upon as traitors; that Louis Riel be placed among the political martyrs of the French-Canadian nationality.\"\n\nThis was the first general announcement of the National Party of the policy of \"Race and Revenge.\" On the following day the alliance between the National Party and Ontario Liberals was arranged, and to-day Mr. Blake stands at the head of the former, with Mr. Mercier on one side and Mr. Mowat on the other. Then\n\nMR. EDGAR CAME IN.\n\nOn November 20th, 1885, the confidential agent and general factotum of Mr. Blake arrived in Montreal for the purpose of arranging an alliance between the leaders of the Liberal Party in Ontario and the promoters of the \"Race and Revenge\" movement in Quebec. At the previous night's meeting Mr. David had declared that \"at the head of the new National Party should stand the Hon. Edward Blake.\" The arrangement then made has so far been faithfully carried out by Mr. Blake and his Lieutenant, Mr. Mowat.\n\nOn November 21st the Globe announced, on behalf of Messrs. Blake and Mowat, that those gentlemen had determined to ally the English-speaking Reformers with the Nationalist Party, joined for the purpose of avenging the death of Riel. In the course of the article announcing this, the Grit organ said: \"We ask all fair-minded English-speaking citizens to put themselves in the place of the men of Riel's race, before charging them with offensive sympathy.... A hearty union of both Provinces to punish the malefactors in office is the only course by which Canada can be saved.\" About the same time Mr. Anglin declared in his own paper that the execution of Riel was \"a foul political murder.\"\n\nOn Sunday, November 22, a great meeting on the Champ de Mars, Montreal, was held. Riel was then held up as a patriot, a\nmartyr, a hero, and a saint. The \"hangmen of Ontario\" were held responsible for the \"crime.\" Mr. Laurier declared that the execution was a \"judicial murder.\" He said that \"if he had been living on the banks of the Saskatchewan when the revolt broke out, he would himself have taken up arms against the Government.\" He said further: \"Henceforth there is to be but a united nationality, which will receive the support of their Liberal allies of the Province of Ontario and of the great statesman, Edward Blake.\"\n\nTHE \"NATIONALIST\" PRESS\n\ncame out hot and strong upon this question, as might have been expected, after the lead given to it by firebrand and interested politicians, French and English.\n\nSaid L'Etendard: \"As to the affairs of the North-West, is it not evident that the highest sense of justice would have avoided the rising and the civil war? . . . and the arson, the thefts, the robberies, the murdering of the wounded by the volunteers—was not all this persecution?\" Le Nord burst forth: \"Glut yourselves, Orange brothers, with the spectacle of the hanged Riel. You have vindicated the majesty of the law, but you have also dug beneath the scaffold a pit in which may be buried all your dreams of tyranny and domination over the North-West.\"\n\nMR. JOLY'S LETTER\n\nwas a thunderbolt to the conspirators. Formerly Premier of Quebec, and a Rouge at that, rather than join the \"Race and Revenge\" crusade for party purposes, he declared in his letter of November 28th, \"I cannot approve of the agitation which is now carried on in the Province of Quebec. . . . I cannot see how the formation of a new party, the National Party, would better their position (the French-Canadians), but I think I can see how it would endanger the future welfare of the Dominion.\" Another letter, breathing a very different spirit, but equally indicative, though in another way, of one spirit that was permeating the Quebecians, was sent to the Mail by \"a Montreal French-Canadian.\" It was dated December 8th, 1885, and opened: \"Messieurs les Orangeistes,—You are nothing but vile scoundrels. You have hanged Riel, the brave French-Canadian Metis. . . . But the crime which you have committed at Regina will not remain unpunished.\" And so on, et cetera.\n\nTHE ONTARIO RIELITES\n\nDuring the last session of the Ontario Legislature an amendment to the address was moved by Mr. Meredith, expressing appreciation of the conduct of the permanent military forces of Canada, and of the volunteers. An amendment to this was moved by Mr. White, as follows: \"And we must, now that peace has been restored, the supremacy of the law vindicated, and just punishments inflicted upon the principal participants in the rebellion, it may be consistent with the public interests to extend the merciful consideration of the Crown.\"\n\"to the cases of those who are now undergoing imprisonment for offenses committed during or arising out of it.\" The amendment was most bitterly opposed by the Government, and was voted down. During the debate Mr. Fraser likened Riel to Sir George Cartier, and said that at no distant date a monument would be erected to the rebel's memory.\n\nThe following are the names of the gentlemen who voted against Mr. White's amendment, and who practically thereby denied that justice had been done, and cast a slur upon the volunteers. Mr. Fraser's speech was especially virulent. Here are the \"Nays:\" Awrey, Ballantyne, Baxter, Bishop, Blezard, Cascaden, Chisholm, Connee, Cooke, Dill, Dowling, Drury, Dryden, Ferguson, Ferris, Fraser, Freeman, Gibson (Huron), Gillies, Gould, Hagar, Harcourt, Hardy, Hart, Hawley, Laidlaw, Lyon, McIntyre, MacKenzie, McKim, McLaughlin, McMahon, Master, Morin, Mowat, O'Connor, Pardec, Phelps, Rayside, Ross (Huron), Ross (Middlesex), Sills, Snider, Waters, Young.\n\nPACAUD'S CASE\n\nThe sympathy which the Government side of the House then displayed with the \"Race and Revenge\" movement was even more strongly brought out by the Pacaud episode. The people of Ontario are not likely to forget that Mr. Mowat not only took into his employment, but energetically defended, a man who had made it his business both to insult the volunteers and to espouse the cause of Riel after the fashion of the rebel's most rabid friends in Quebec. Pacaud is editor of Le Progres, published in Detroit, and, favored by patronage from the Ontario Government, undertook to introduce the \"Race and Revenge\" cry into Essex. Pacaud afterwards went to Toronto, and told the people to watch for his letters from the Press Gallery. This is how he wrote of the rebellion and of the volunteers: \"The Government troops were the first to fire; the volunteers assassinated the wounded Metis, insulted the women, burned and pillaged their houses; Riel was indirectly promised his life by General Middleton; the trial at Regina was specially contrived to condemn Riel to death; the jury was picked out, and Richardson either was an Orangeman or was the stipendiary tool of the Government.\" This and much more of the same sort. Mr. White asked whether it was right that a man so misrepresenting and abusing the Opposition should be allowed to sit in the gallery. Mr. Mowat energetically defended his protege, who is now a candidate in his interest in the county of Essex.\n\nRACE AND REVENGE AT OTTAWA\n\nDuring the last session of the Commons, Mr. Landry moved a resolution expressing strong regret that Riel had been executed. In the following debate Mr. Blake advanced every possible argument in justification of Riel and of the rebellion. The rebel was likened by\nMr. L'Angelier, M.P. for Quebec, to our Saviour. The motion was defeated, the voting analysis showing that Ontario went 18 for it and 65 against, Quebec supporting it by 28 votes and 36 being cast against it. Only one English-speaking representative from Quebec voted for Mr. Landry's motion. The Reformers voting with the Government numbered 24. The Ontario Reformers who supported Mr. Landry were Messrs. Allen, Armstrong, Blake, Cameron (Huron), Cameron (Middlesex), Campbell, Casey, Cooke, Edgar, Glen, Hawley, Landerkin, Lister, Mills, Somerville, Trow and Wells.\n\nTHE CHAMBLY ELECTION\n\ncame on about the end of July, the sole issue being the Riel question, Mr. Prefontaine being the Rielite candidate. He was successful, one of the first to congratulate him being Mr. D. E. Cameron, a prominent Young Liberal, who telegraphed: \"Accept our sincerest congratulations on your magnificent victory, which I regard as preceding a still greater triumph.\" Another telegram began: \"The Liberals of Toronto congratulate you on your splendid victory.\" It ended as follows:\n\n\"WELCOME TO OUR (RIELITE) COLLEAGUE.\"—J. D. EDGAR\n\nReferring to this extraordinary document, the Huntingdon Gleamer, the leading Liberal paper of the Eastern Townships, and the organ of the English-speaking Reformers in Quebec, said: \"Mr. Edgar is a member of the House of Commons, and reputed to be Mr. Blake's adviser in party movements. Whether he has authority to speak on behalf of the Toronto Liberals, we cannot say. If he has, are we to understand that they endorse the late rebellion; that they consider their gallant fellow-citizens, Col. Otter and his brave regiment, fought on the wrong side, ought to be punished, and Big Bear, Dumont and his brothers in arms, rewarded? Is it their private opinion that, instead of having honorable sepulture, the bodies of Lieut. Fitch, Private Moor, Bugler Foulkes and others, should have been hung in chains, and that a monument should be erected to Riel in Queen's Park?\" * * *\n\nIf it really be the case that the Liberals of Toronto regard the triumph of treason at Chambly as a 'splendid victory,' we are dumfounded, and we warn them that they and the Liberals of this Province part company. If the Liberals of Ontario cannot defeat Sir John at the polls on the broad issue of his general policy, we are not going to share in their disgrace in\n\n\"UNITING WITH BIGOTS AND REBELS\n\n\"to drive him from office for an act we unanimously approve—his permitting Riel to receive the punishment the law adjudged.\"\n\nAs at Chambly, so at Quebec, the sole question at the recent elections was the Riel business, and the avowed aim of the Nationalists was revenge for the murder of their hero. At a meeting in Montreal, in connection with the\nQUEBEC ELECTIONS\n\nSenator Thibaudeau said: \"The choice of the meeting should be a 'Nationalist. It does not matter so much as to his profession.' At the same meeting the following preamble to a resolution was passed: 'Considering that the Liberal and Conservative National electors of Montreal at last hold it to be necessary to oppose the re-election of the Hon. Mr. Taillon, in order to avenge the national cause,' etc. As is now known Mr. Taillon was defeated, and\n\nMR. MOWAT, FULL OF JOY AT THE RIELITE SUCCESS,\n\ntelegraphed as follows to Mr. Mercier, \"Have just received here the joyful news of your great triumph. I congratulate you and all your friends on your important victory.\" That is, he triumphed in the fact that the men who are seeking to avenge Riel by destroying both the Quebec and Dominion Governments had succeeded. He and Mr. Blake have now called upon their friend and ally, Mr. Mercier, to send Rielite speakers into Ontario to help fight their battle here.\n\nIn view of this compact between the Mowat Government and what is known as Nationalism in Quebec, it is important to comprehend the full meaning of that term. L'Union des Cantons de l'Est, a Nationalist paper published at Arthabaskaville, on Nov. 13th thus discoursed upon Nationalism: \"The Conservative Nationalists, breaking with Sir John and the sect, join their natural allies in Hon. Mr. Blake and the party which marches behind him. Mr. Blake and his followers in Ontario are the men to whom we must tender our hands. They are fighting our enemies; our enemies are the Orange-istes and all who favor them.\"\n\nIt is impossible to misunderstand this, or to avoid the conclusion that it thoroughly explains the close relations confessedly now maintained between Mr. Mowat and the Rielites. No wonder that the people of Ontario, both Liberal and Conservative, have taken alarm at the unholy alliance between the Provincial Government and the rebellious Quebecians for the sake of retaining power. No wonder that the\n\nGHOSTLY POLICY\n\nof taking the stump on Riel's grave in order to embarrass Sir John Macdonald's Government and purchase Mr. Blake's support for the Local Government, has given offence. Was it for this that our gallant volunteers leapt to arms and underwent untold privations in order to suppress the rebellion and avenge the cold-blooded murder of defenceless men, innocent women and children? Was it that Riel might be elevated from his real position as a cruel, mercenary adventurer, to that of a canonized hero that Canada gave of her heart's blood? Was it for this that the gallant men whose names follow laid down their lives? The blood of every soldier who gave his life for his country cries aloud from the grave at such a suggestion. What say the friends of the\nKILLED AT DUCK LAKE\n\nConstable T. J. Gibson, N.W.M.P.\n\n\" G. P. Arnold, \"\n\nKILLED AT FISH CREEK\n\nPrivate A. W. Ferguson, 90th Battalion.\n\n\" Jas. Hutchins, \"\n\n\" Geo. Wheeler, \"\n\n\" W. Ennis, \"\n\nGunner G. H. Demanolly, A Battery.\n\n\" W. Cook, \"\n\nKILLED AT CUT KNIFE\n\nPrivate John Rogers, Gov.-Gen. Guards.\n\n\" Osgood, \"\n\n\" Arthur Dobbs, Battleford Rifles.\n\nBugler H. Foulkes, \"C\" Comp. I.S. Corps.\n\nCorporal W. H. Lowry, N.W.M.P.\n\n\" R. B. Sleigh, \"\n\nConstable P. Burke,\n\nTeamster Chas. Winder.\n\nKILLED AT BATOCHE\n\nCaptain E. J. Brown, Boultos Infantry.\n\n\" John French, Scouts.\n\nLieutenant W. Fitch, 10th Grenadiers.\n\n\" A. W. Kippen, Ind. Corps.\n\nPrivate T. Moor, 10th Grenadiers.\n\n\" R. R. Hardisty, 7th Batt.\n\n\" Jas. Fraser, \"\n\nGunner W. Phillips, \"A\" Battery.\n\nAll this is to say nothing of the sufferings of the wounded, and of the death and suffering brought upon civilians by the arch-traitor in whose behalf Ontario Rielites or Mowatites—for the terms are interchangeable—have raised their voices and are now exerting their influence.\n\nThe foregoing are facts, and require no comment. It is only necessary that the electors of Ontario should see them in their true light to get an expression of opinion during the pending elections which will forever set at rest the idea that it is a justifiable political course to flirt with treason.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001321.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11394, "total-output-tokens": 4995, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2001, 1], [2001, 5050, 2], [5050, 7934, 3], [7934, 10731, 4], [10731, 13484, 5], [13484, 16233, 6], [16233, 19001, 7], [19001, 20336, 8]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]