[{"id": "1e8ac8ee6808404c176a1a858f33fbd28320273e", "text": "LA CROISADE\nANTI-FRANÇAISE\nET\nANTI-CATHOLIQUE\nDIRIGÉE PAR\nSIR JOHN A. MACDONALD\n\nImp. de L'ÉTENDARD, 37 rue Saint-Jacques, Montréal.\n\nSALLE GAGNON\nЗАСТОЕ\nЗАУНАЯЯ-ИТИА\nАНЦОНТА-ИТИА\nЦАНОДОМ АИНЮГ\nLA CROISADE\n\nANTI-FRANÇAISE et ANTI-CATHOLIQUE\n\nDIRIGÉE PAR\n\nSir JOHN A. MACDONALD.\n\nLE GOUVERNEMENT D'OTTAWA PROVOQUANT OUVER-\nTEMENT UNE GUERRE DE RACE ET DE RELIGION.\n\nLe 'Mail' et les Canadiens-Français.\n\nTout le monde sait aujourd'hui que le MEURTRE DE LOUIS RIEL n'a pas été un crime isolé, un simple acte de vengeance, de stupidité ou de colère.\n\nCe MEURTRE LONGUEMENT ET FROIDEMENT MÉDITÉ ETAIT LE POINT DE DEPART, DÉLIBÉRÉ À L'AVANCE PAR SIR JOHN A. MACDONALD, D'UNE MONS-\nTRUEUSE CAMPAIGNE CONTRE LES CANADIENS FRANÇAIS, CONTRE LA PRO-\nVINCE DE QUÉBEC ET CONTRE LES CATHOLIQUES EN GÉNÉRAL.\n\nCe n'est pas seulement par ce qu'on faisait fi des supplications de tout un peuple qu'on nous a refusé la grâce de Riel.\n\nC'est parce qu'au moyen de cette tête pendue au gibet, on espérait et on prétendait changer l'axe politique de la Confédération.\n\n\"On regagnera dans Ontario ce qu'on perdra dans Québec et nous serons débarrassés de ces Canadiens-français qui ne compteront plus pour rien dans la majorité\" avait dit sir John A. Macdonald à l'un des ministres, ses complices. Et ce mot a été confirmé par les trois ministres canadiens-français traîtres à leur race, le jour où pour expliquer leur honteuse déflection, ils ont prétendu que s'ils avaient\ndonné leur démission, on les aurait remplacés par trois ministres anglais sans tenir compte de leurs protestations ; et où ils ont essayé de soutenir qu'ils n'avaient gardé leur portefeuille que pour éviter que le Canada français ne fût désormais privé de toute représentation dans le gouvernement fédéral.\n\nDu reste, les sentiments de sir John A. Macdonald sont suffisamment connus depuis la publication de la lettre qu'il a adressée à son fils à Winnipeg six semaines avant le meurtre de Riel et qui a été reproduite par le Winnipeg Siftings du 8 octobre 1885 :\n\n\"Si les Canadiens-français, disait-il, mettent à exécution la menace qu'ils ont faite de se révolter si Riel est pendu, les gens de langue anglaise de la puissance et le gouvernement devront les rencontrer les armes à la main........\"\n\nEt prévoyant une nouvelle conquête de la province de Québec, il ajoutait :\n\n\"Le 90e bataillon d'infanterie légère de Winnipeg et les autres régiments de Manitoba, seront prêts à se rendre en Ontario ou ailleurs lorsqu'ils en recevront l'ordre et à faire leur devoir aussi fidèlement qu'ils l'on fait par le passé.\"\n\nOn a essayé de démentir cette lettre. C'est l'habitude de ces éternels menteurs toutes les fois qu'ils se trouvent en face d'une révélation compromettante. Mais ici, le fait était tellement patent qu'on n'a pas osé le nier dans son entier. On s'est borné à se retrancher derrière des équivoques. On a dit qu'il y avait bien eu une lettre, mais que le Winnipeg Siftings n'avait pas pu en prendre copie et que les termes n'en avaient pas été reproduits exactement par ce journal.\n\nPasse pour ces termes. Dans tous les cas le fond y était, c'est la seule chose qui importe au peuple canadien-français.\n\nComment d'ailleurs démentir sérieusement la lettre publiée par le Winnipeg Siftings lorsque le Mail, organe officiel de sir John A. Macdonald (il n'avait pas encore imaginé de le désavouer !) publié sous sa direction et le plus souvent sous sa dictée, imprimait vers la même date une série d'articles qui sont la paraphrase pure et simple de la lettre de sir John A. Macdonald à son fils.\n\nC'est ainsi que le Mail du 23 novembre 1885 écrivait :\n\n\"Déclarons-leur [aux Canadiens-français] encore une fois et solennellement, que, plutôt que de subir un tel joug, Ontario briserait la Confédération, et préférerait voir s'évanouir à jamais le rêve d'un Canada uni, etc.\"\n\nLe lendemain 25 novembre, il complétait sa pensée de la façon suivante :\n\n\"Comme Anglais, nous croyons que la conquête devra être faite de nouveau ; et les habitants du Bas-Canada peuvent être convaincus qu'il n'y aura pas de traité de 1763.\"\n\"La prochaine fois, les vainqueurs ne capituleront pas..............\nMais le peuple canadien-français perdrait tout. La perte de leurs biens et de leur bonheur serait rapide, complète et irrémédiable.\"\n\nEt le 7 décembre de la même année, il disait :\n\n\"LES CANADIENS-FRANÇAIS DOIVENT COMPRENDRE QUE DE TOUS LES PEUPLES VAINCUS, ILS SONT LES PLUS HEUREUX. En vertu du principe que l'on doit rendre aux autres le bien qu'on nous a fait, ils devraient au moins, en obéissant aux lois de l'Angleterre, montrer leur reconnaissance pour les faveurs et la liberté que la loi leur a accordées. Et pour en arriver à des arguments plus grossiers, leur propre intérêt devrait leur indiquer qu'ils doivent être justes s'ils désirent que nous continuions à être généreux.\"\n\nÀ la même époque les patrons du Mail avaient déjà spéculé sur l'achat des consciences et sur les tristes défections qui devaient se produire dans le parlement et dans la presse et qui ont mis la rougeur au front de tous les patriotes.\n\nIl faut voir comment il traitait par avance ces renégats serviles, fustigés, payés et contents.\n\nLe Mail du 3 décembre disait :\n\n\"Si jamais les Canadiens-français reviennent à la raison ils seront plus qu'étonnés de leur propre folie........ Quand ce jour arrivera, nos anciens amis, les bleus, reviendront, sans doute, au parti conservateur; mais ils peuvent être certains d'un chose, ON NE TUERA PAS LE VEAU GRAS.\"\n\nEt le 11 décembre, sachant qu'aucune injure n'arrêterait les consciences vénales, il renouvelait dans les termes suivants l'expression de sa haine et de son mépris :\n\n\"S'ils veulent (les bleus) renouveler leur allégeance, ils sont libres de le faire; mais ils ne recevront de nous aucun compliment et ce journal ne pourra JAMAIS LES CONSIDÉRER COMME DES HOMMES D'HONNEUR, DES HOMMES DIGNES DE CONFIANCE.\"\n\nAu mois de janvier 1886, quelques tories d'Ontario s'émurent de l'imprudente jactance avec laquelle le Mail lançait le cri de guerre anti-catholique et anti-français. À une réunion tenue dans les bureaux du Mail, un tory important, maire d'une ville d'Ontario et candidat tory, se leva et s'adressant à M. Bunting, le gérant du Mail, le supplia de faire cesser la campagne anti-catholique du journal.\n\nOr, écoutons bien la réponse de M. Bunting, telle que reproduite dans le Globe, ET QUE NI M. BUNTING, ni Sir John, ni personne autre n'ont jamais contestée :\n\n\"Oh ! n'ayez pas peur de la ligne de conduite du Mail, en cette affaire. Soyez sûr qu'il n'y aura pas de sang versé et que cela peut\nnous faire beaucoup de bien. Nous avons bien pesé le pour et le contre et examiné la question sous toutes ses faces, nous en sommes arrivés à être convaincus que c'est une bonne affaire pour nous de soulever une difficulté entre catholiques et protestants justement maintenant que la question Riel a tout mis en ébullition.\n\n\"La où nous perdons un vote catholique, nous en gagnons deux protestants.\"\n\n\"C'est l'avis arrêté de notre chef que le cri du \"Protestantisme en danger\" nous amènera une aussi grande Victoire en 1886, que celui de \"Protection\" en 1878.\"\n\nCe compte rendu publié dans le Globe du 27 septembre dernier n'a jamais été démenti. Et comment l'aurait-il été alors que toute la campagne électorale de M. Meredith et des Tories d'Ontario s'est faite au mois de décembre dernier sous la direction et avec le concours de Sir John A. MacDonald à l'aide du cri anti-français et anti-papiste.\n\nLE BUT DES CONSPIRATEURS.\n\nOn est stupéfait de penser que des ministres de la Reine, des membres du gouvernement d'un grand pays, des hommes qui ont été investis pendant de longues années de dignités et de charges publiques travaillent ouvertement à attiser le feu de la guerre civile.\n\nLe fait n'est malheureusement que trop certain, les trois ministres canadiens-français dont le nom restera marqué d'un stigmate.\n\nMM. CHAPLEAU,\nCARON,\nSir HECTOR LANGEVIN,\n\nOnt assisté à cette campagne et l'ont laissée se poursuivre avec leur complicité, dans le misérable but de garder quelques mois de plus leurs places et leurs traitements.\n\nQuel était donc le but poursuivi par les Conspirateurs ?\n\nLeur plan n'était que trop simple.\n\nOn sait que Sir John A. Macdonald a été de tout temps le fanatique ennemi de notre race ; sa carrière politique a commencé à Montréal aux lueurs de l'incendie du Parlement, il était d'accord avec les bandes de forcenés qui assaillaient alors le représentant de la Reine pour cette seule raison que son gouvernement venait de rendre justice aux Canadiens-français.\"\nDepuis lors, il a paru changer de tactique. En minorité presque permanente au milieu des libéraux anglais de sa province, il a eu besoin pour gouverner et pour assouvir sa soif de domination du vote canadien-français et il est parvenu à persuader à quelques-uns de nos hommes politiques qu'en s'alliant à eux, il avait renié ses erreurs de jeunesse.\n\nIl n'en était rien.\n\nPendant les trente dernières années, Sir John A. Macdonald a, sauf de rares interruptions, gouverné le Canada à l'aide du vote canadien-français. Mais il l'a constamment gouverné contre ses alliés. Il n'a renoncé à nous vaincre par la violence que pour nous vaincre plus sûrement par le ruse et l'hypocrisie.\n\nTous ses actes depuis le plan de la Confédération jusqu'au meurtre de Riel ont été déterminés par un double but :\n\n1. Garder le pouvoir à tout prix et par n'importe quel moyen.\n2. S'efforcer par tous les moyens possibles de substituer à la majorité dans laquelle l'élément canadien-français avait une part prépondérante, une majorité exclusivement anglaise.\n\nLors de la confédération, il était déjà parvenu à substituer au régime dans lequel Québec balançait Ontario, une constitution aux termes de laquelle le vote canadien-français est noyé dans le vote anglais des autres provinces. Mais l'énergique résistance de Sir George Étienne Cartier l'avait empêché de compléter son œuvre. Au moment du meurtre de Riel, Cartier n'existait plus, il avait été remplacé par des valets.\n\nSir John A. Macdonald a pensé que l'heure était propice.\n\nLes orangistes lui ordonnaient de pendre Riel.\n\nIl s'est dit qu'en déférant à leurs vœux et en surexcitant le fanatisme anglais, il trouvait là une occasion inespérée de grossir sa majorité dans Ontario et anéantir la province de Québec dans le gouvernement de la Puissance et dans les délibérations des chambres.\n\nNous assistons depuis quinze mois aux efforts faits par un gouvernement criminel et corrupteur pour annihiler notre province en la divisant et en tournant nos concitoyens les uns contre les autres.\n\nPendant ce temps, nos concitoyens anglais d'Ontario ont assisté aux efforts parallèles qu'on voudrait bien nous dissimuler si cela était possible et qui ont eu pour but d'ameuter le fanatisme protestant et orangiste et de provoquer contre nous une guerre de race et de religion.\n\nHeureusement ces ennemis de la paix publique se sont trompés deux fois.\n\nSe fiant sur l'exemple de MM. Chapleau, Caron et Langevin, ils avaient cru trouver dans le peuple canadien-français, un peuple à vendre et le peuple canadien leur a répondu en élisant au 14 octobre dernier une majorité patriotique.\n\nIls avaient cru rencontrer dans Ontario une majorité de fanatiques et nos concitoyens anglais leur ont répondu aux élections du 28 décembre dernier par un vote écrasant, prouvant que la province\nd'Ontario est composée d'anglais libéraux et pacifiques qui veulent travailler à la prospérité du pays avec un gouvernement honnête et qui ne sont pas prêts à démembrer le Canada et à partir en guerre contre la province de Québec.\n\nLA CAMPAGNE DU \"MAIL.\"\n\nPendant 14 mois le Mail, qui était alors l'organe officiel de Sir John A. Macdonald a continué sans interruption sa campagne contre les Canadiens-français, contre l'église catholique et contre le vénérable archevêque de Toronto Mgr Lynch.\n\nLa lutte des tories contre le gouvernement Mowat a été basée exclusivement sur les complaisances coupables que le gouvernement libéral de M. Mowat aurait eues pour Mgr Lynch et pour les catholiques de la province d'Ontario dans la question des écoles.\n\nOn trouvera ci-dessous les extraits d'un certain nombre d'articles du Mail qui sont de nature à mettre dans tout son jour le caractère audacieusement criminel de la nouvelle croisade, entreprise par le parti tory contre l'Eglise catholique et contre nos concitoyens de race canadienne-française.\n\nPour apprécier toute la gravité de cette campagne, il importe avant tout de noter ici que ces attaques outrageantes contre les catholiques n'ont commencé qu'à partir du jour où les Tories ont été amenés à se convaincre qu'ils avaient cessé de tenir dans leur main le vote catholique, à la suite du traitement tyrannique qu'ils ont fait subir aux Métis et de l'opposition forcée qu'ils ont faite au Home Rule : ces deux faits qui ont aliéné au parti Tory les Canadiens-Français et les Irlandais sont des faits de politique purement laïque. La question religieuse n'a rien à y voir ; et ce n'est point en tant que catholiques, qu'ils affectent une partie des électeurs du Dominion.\n\nCes attaques ont commencé immédiatement après l'exécution de Louis Riel, après qu'une assemblée eut été tenue à Montréal, pour condamner l'exécution, comme un acte cruel et injustifiable.—Tant que Sir John A. Macdonald a cru pouvoir compter sur l'appui des Canadiens-français, jamais on n'a entendu dire à ses amis que l'Eglise catholique eut rien à se reprocher, ni qu'elle fit courir le moindre péril au pays. Mais quand il a vu que les Canadiens-français l'abandonnaient, il s'est tourné contre eux et contre leur religion avec la haine venimeuse et la passion qu'eût pu y mettre, il y a trois siècles, un sectaire convaincu et un fanatique ennemi de la liberté de conscience.\n\nLa brèche avait été ouverte le 7 décembre 1885 par un long\narticle dans lequel le Mail représentait les privilèges prétendus de l'Église catholique comme une monstruosité odieuse et oppressive.\n\nCet article expose \"LES PRIVILEGES ENORMES ET EXCEPTIONNELS DONNÉS JOINT L'ÉGLISE CATHOLIQUE A QUÉBEC\" et les droits reconnus au peuple canadien-français à la suite de la capitulation. Parmi ceux des droits qui ont été reconnus à l'Église catholique et dont le Mail demande la suppression, figurent les suivants :\n\n\"L'Église catholique romaine, qui est celle des Canadiens-français a été mise par le gouvernement britannique en pleine et libre possession de l'exercice du culte.\"\n\n\"L'Église jouit, en vertu des lois canadiennes, de pouvoirs plus étendus qu'elle n'en jouissait sous la domination française. Par exemple, la nomination des évêques était faite avec l'approbation du roi de France, tandis que maintenant l'Église désigne elle-même ses évêques sans aucune approbation ni intervention du gouvernement anglais ou des autorités canadiennes.\"\n\n\"L'Église possède, en vertu des lois canadiennes, un pouvoir supérieur à celui qui lui est reconnu dans aucun autre pays civilisé, même y compris l'Espagne. En fait, la suprématie de la loi ecclésiastique sur la loi civile est tacitement reconnue dans Québec, toutes les fois que la loi ecclésiastique se trouve en opposition avec le droit civil ou en conflit avec les lois de l'état.\"\n\nLe 3 août dernier le Mail se livrait à une violente attaque contre ses anciens amis les Castors, qui ont été pendant si longtemps les alliés et les appuis du parti Tory. Voici en quels termes enflammés il les dénonçait :\n\n\"Les Jésuites se sont efforcés depuis longtemps d'obtenir la direction du haut enseignement dans la province........... Quoique présentement battus, les ultramontains sont pleins de confiance dans le succès final........... Leurs opinions politico-religieuses sont tirées du syllabus........... Un des plus absurdes énoncés de leur doctrine est que le prêtre a non seulement le droit mais, dans une certaine mesure, le devoir d'intervenir dans les élections ; par cette raison qu'il est le représentant de Dieu, et que l'église est intéressée aux questions de politique et de législation, comme concourant grandement au bien-être du troupeau dont elle a la garde. En fait, LES ULTRAMONTAINS RÊVENT UNE SUBORDINATION COMPLÈTE DE L'ÉTAT À L'ÉGLISE, ET LEUR BUT EST DE SUPPRIMER RADICALEMENT, COMME AUTANT D'ERREURS DEFINIES ET CONDAMNÉES PAR LE SYLLABUS, LA LIBERTÉ DE PAROLE, LA LIBERTÉ DE PENSER ET LA TOLÉRANCE ACCORDEE À CEUX QUI SONT CONSIDÉRÉS COMME DES HÉRÉTIQUES. EN DEUX MOTS : L'ULTRAMONTANISME EST L'ENNEMI DE LA LIBERTÉ HUMAINE.\"\n\nLe 12 août le Mail contenait un autre article, dans lequel l'attitude de la population catholique de Québec était dépeinte de la façon la plus incendiaire et il terminait par cet appel aux passions les plus fanatiques :\n\"La prétention de créer aux Canadiens-Français et à l'Eglise catholique un monopole dans le Nord-Ouest, est maintenant un rêve dont nous sommes débarrassés. Libre à l'Eglise catholique de chercher à se consoler en renforçant sa situation dans Québec et en arrêtant l'action de la loi civile dans tous les cas où elle serait contraire aux prétentions ecclésiastiques. La minorité anglaise ne sait que trop ce que signifient les menées ultramontaines, et ce qui résulterait pour elle du triomphe des ultramontains. Le P. Braun, jésuite de Montréal, dont les écrits sont acceptés par le sénateur Trudel et les coryphées de l'ultramontanisme comme le plus pur succ de l'orthodoxie, ne nous laisse pas de doutes sur ce point. \"Le Protestantisme,\" dit le Jésuite, dans son livre sur la loi du mariage \"n'est pas une religion, c'est une rébellion, c'est l'erreur triomphante. Elle n'a pas de droits, car son existence est un crime et elle doit être traitée comme on traite le crime.\"\n\n17 août 1886.—Il a paru, à cette date, dans le Mail un article des plus violents. Si les protestants se laissaient influencer par cet écrit-incendiaire, tout le pays pourrait être plongé dans la guerre et la désolation. Voici quelques passages de l'article:\n\n\"La carte d'atout de l'Eglise est sa loyauté intéressée. Elle a laissé l'habitant dans la paix pendant la révolution américaine et pendant la guerre de 1812, et elle l'a même rangé du côté des Anglais pour lesquels il a combattu avec la bravoure particulière à sa race. Chaque fois qu'elle a voulu empiéter sur les droits de ses sujets ou faire reconnaître par la Couronne quelques-unes de ses réclamations du moyen-âge, elle s'est empressée de rappeler aux Ministres Anglais qu'elle a sauvé le Canada deux fois pour eux, et la reconnaissance les a fait céder. C'est ainsi que l'Eglise a obtenu le contrôle absolu de la population française dans les affaires temporelles et spirituelles et qu'elle a pu envahir les établissements anglais.\n\n\"La Législature, sous prétexte de coloniser la province, emploie chaque année des sommes considérables pour placer des habitants sur les terres incultes des districts anglais ; et en très peu de temps, Jean-Baptiste est en état de supplanter le colon anglais, tant est remarquable la fécondité de sa race. Il peut lui refuser les crédits pour les chemins et les écoles, le taxer cependant autant que possible, et, enfin, obtenir la complète possession de l'établissement. Dans ces circonstances, l'Eglise étant toute puissante dans la Législature et dans les conseils municipaux et employant contre lui toutes ses ressources, le cultivateur anglo saxon se trouve assiégé, et sa capitulation finale n'est qu'une question de temps.\n\nL'agitation Riel a amené une solution. Les cultivateurs anglais ont gardé leurs terres, (bien qu'un grand nombre se soient retirés battus), dans l'espoir qu'un jour LA MAJORITÉ ANGLAISE DES AUTRES PROVINCES VIENDRAIT À LEUR SECOURS. Ils ne demandent pas de faveurs. Ils ne veulent pas priver les Canadiens-\nFrançais de la moindre de leurs libertés religieuses. ILS DEMANDENT SIMPLEMENT QUE L'EGLISE SOIT ABOLIE, OU AU MOINS QU'ELLE SOIT PRIVÉE DE QUELQUES-UNS DE SES PRIVILÈGES EXORBITANTS QUI SONT INCOMPATIBLES AVEC LA LIBERTÉ POPULAIRE ET LE PROGRÈS ; QU'ON EMPÊCHE LA LÉGISLATURE D'EMPLOYER LES IMPOTS PUBLICS DANS L'INTÉRÊT DE QUELQUE CLASSE EN PARTICULIER ; EN UN MOT, ILS DEMANDENT QUE L'ÉTAT OCCUPE LA POSITION ET QU'IL EXERCÉ LES FONCTIONS USURPÉES PAR DES ECCLÉSIASTIQUES RAPACES ET ENCLINS À L'AGRESSION. ILS ATTENDENT CES RÉFORMES EN COMPTANT SUR LEURS FRÈRES DE SANG, LES ANGLAIS D'ONTARIO ET ILS OBSERVENT AVEC LA PLUS VIVE ATTENTION CE QUE NOUS ALLONS FAIRE AU SUJET DE L'AFFAIRE RIEL.\n\n\"Il est vrai qu'en renversant simplement les Rielistes, nous ne pouvons pas espérer résoudre ce problème compliqué et attristant qu'offre la présence dans cette petite société anglo-saxonne d'un million et demi de gens qui répudient notre langue, qui se glorifient d'appartenir à une race différente et de chérir des institutions autres que les nôtres. Mais si nous réussissons dans cette occasion à faire taire cette prétention arrogante, que la loi canadienne ne doit pas prévaloir contre un criminel canadien français quand il lui arrive de représenter l'idée nationale, les Français pourront commencer à comprendre qu'ils sont allés assez loin et que nous ne sommes pas d'humeur à permettre davantage l'effacement des droits anglais et des intérêts anglais dans cette province.\"\n\nLe 23 août 1886, le Mail disait : En matière d'éducation, l'Eglise catholique, par sa toute puissance dans la Législature est en situation de faire aux parents protestants, une existence insupportable.\n\nDe nouveau, le 5 octobre, l'organe tory déclarait : Les privilèges dont jouit l'Eglise catholique en matières de législation et d'éducation sont un obstacle au progrès moral, intellectuel et matériel du peuple.\n\nLe 4 octobre, le Mail renouvelant ses attaques, disait :\n\n\"S'il est vrai, comme l'ont dit le révérend M. McVicar et d'autres, que l'Eglise retire dix millions par année sous formes de dimes et de cotisations obligatoires de la part d'un million et un quart de cultivateurs, sans parler des pertes directes qu'entraîne l'exemption des taxes municipales des vastes propriétés de l'Eglise, nous n'avons pas besoin d'aller plus loin pour prouver que dans la province de Québec comme ailleurs la \"pauvreté est un privilège.\" Les sommes mentionnées représentent une taxe annuelle de huit dollars par tête dans chaque famille française ; et s'il en est ainsi, N'avons-nous pas là une cause suffisante pour expliquer l'état arriéré de\nla province et le manque d'initiative et d'esprit public qui caractérise sa population ?\n\n\"N'est-ce rien pour la Confédération que la deuxième Province soit appauvrie par les idées du moyen âge ? Ne donnerons-nous aucune attention aux cris de la minorité protestante dont les intérêts sont en péril ? Ne devons-nous pas attacher d'importance au fait que la législation fédérale est entravée, que l'on pille le Trésor fédéral de temps à autre et que l'on rend impossible un gouvernement d'égalité pour tout le Canada à cause des privilèges et immunités dont jouit et des usurpations que pratique sous la protection de notre loi une Église qui cherche à établir une société française mais non britannique ?\"\n\nLe 5 octobre 1886, le Mail disait à propos des contributions ecclésiastiques :\n\n\"L'expérience de l'humanité nous enseigne que des privilèges du moyen âge, comme ceux dont l'Église jouit dans la province de Québec, sont un obstacle à l'avancement moral et intellectuel aussi bien qu'au progrès matériel du peuple.\"\n\nLe 11 octobre, le Mail attaque de nouveau l'Église en disant :\n\n\"La loi établit des punitions contre les prêtres qui pratiquent l'influence indue, mais cette loi est lettre morte. Aucun juge catholique ne se soucie de la mettre en vigueur.\n\n\"Le système tire sa force de l'abus sinistre que l'Église en fait. Elle peut facilement faire voir à l'habitant qu'ils ne peuvent tous deux espérer garder la balance du pouvoir dans les affaires fédérales que s'il se soumet aveuglément à ses règlements et s'il lui permet d'employer ses représentants comme des pions dans le jeu de la politique. Après les épouvantails spirituels, cet appel à l'amour propre et à la cupidité des Canadiens-français est le meilleur argument avec lequel elle soutient son empire. Et c'est précisément pour cela que l'existence de l'Église comme Église d'État est remplie de dangers, non seulement pour la province de Québec, mais pour tout le pays.\"\n\nEt le Mail ajoutait à la même date :\n\n\"TOUTE INDÉPENDANCE D'ESPRIT EST ANÉANTIE, ILS (les prêtres catholiques) ONT FAIT LE VIDE DANS LES ESPRITS ET ILS APPELLENT CELA LA PAIX DES CONSCIENCES.\"\n\nLe 18 octobre 1886, le Mail terminait comme suit un article sur les élections de la province de Québec :\n\n\"Mais lorsqu'il est manifeste, comme dans le cas présent, que l'Église de la province de Québec, vu la souveraineté temporelle et les privilèges dont elle jouit—soit par droit de traité ou par usurpation, la chose importe peu—a le pouvoir de soulever un million et un quart d'habitants d'abord contre un parti et ensuite contre l'autre, et de faire et défaire les ministères non seulement à Québec, mais à Ottawa, et même de défier l'autorité de la loi anglaise, quand ses\nsujets ont causé l'effusion du sang, il devient alors nécessaire de faire l'une ou l'autre de deux choses : ou bien nous devons admettre sa supériorité sur l'Etat, ou bien nous devons à n'importe quel prix la renverser comme institution d'Etat. Les politiciens réformistes ou conservateurs aiment mieux faire des arrangements avec elle ; elle joue son va-tout. Les chefs des deux partis ont adopté cette manière de procéder, mais nous croyons que le temps est arrivé de faire un soulèvement général de la race anglaise en Canada contre un système de gouvernement si dangereux et si dégradant.\"\n\nLe 6 novembre 1886 le Mail disait :\n\n\"Dans une autre sphère du gouvernement local, l'Eglise catholique a trouvé moyen de rejeter sur l'Etat le soin de ses ordres religieux.\n\n\"POUR NE PAS ALLER PLUS LOIN, SON HABILETÉ A VENDRE ET À LIVRER SON VOTE COMME CORPS ET L'EMPRESSEMENT DES POLITICIENS DES DEUX PARTIS À L'ACHETER LUI PERMETTENT D'OBTENIR UNE REPRESENTATION SPÉCIALE ET DISTINCTE DANS LES CABINETS PROVINCIAUX ET LE CABINET FÉDÉRAL, ET DE METTRE SES SUJETS DANS LE SERVICE CIVIL SANS QU'ILS SOIENT TOUJOURS COMPETENTS, MAIS SIMPLEMENT PARCE QU'ILS SONT CATHOLIQUES.\"\n\nLe 15 novembre 1886, le Mail attaque l'Eglise Catholique comme suit :\n\n\"La politique de l'Eglise depuis un temps immémorial a été d'obtenir le plus possible et de ne rien donner. Elle échange son vote comme corps contre tout ce qu'elle peut avoir des réformistes ou des conservateurs, sous forme d'empiétements sur la liberté de l'individu ou sur les attributions de l'Etat. LA VENTE DU VOTE CATHOLIQUE a été depuis des années une des choses les plus humiliantes et en même temps les plus dangereuses et les plus démoralisantes de la politique fédérale ou provinciale.\"\n\nLe 13 octobre 1886, le Mail publiait un article incendiaire pour soulever les craintes des protestants à cause de l'établissement des Canadiens-français dans Ontario. Cet article se terminait par ces mots :\n\n\"Le Cultivateur, un journal de Québec, qui donne une attention spéciale à la question, prétend que dans vingt ans il y aura un demi million de Canadiens-français dans la partie nord d'Ontario et que, comme conséquence, la balance du pouvoir sera assurée. Ce calcul est probablement exagéré, mais il est bon que les citoyens anglais d'Ontario sachent ce que l'avenir leur réserve. Si l'Eglise établissait le système des dîmes dans les districts français de la partie est et de la partie ouest d'Ontario, et comme nous l'avons dit l'autre jour,\nelle a toujours prétendu que la loi lui donnait le droit d'exiger des dimes des catholiques du Haut-Canada—sa position dans cette province serait grandement fortifiée, ET NOUS CONNAITRIONS NOUS-MÊMES CE PROCÈDÉ INTÉRESSANT PAR LEQUEL ON DÉPEUPLE LES ÉTABLISSEMENTS ANGLAIS DE LA PROVINCE DE QUÉBEC. LA FÉCONDITÉ PRODIGIEUSE ET LA FORCE DE COHÉSION DES CANADIENS-FRANÇAIS AINSI QUE LEUR ENTIÈRE SOUMISSION À L'ÉGLISE, DONC LA DIRECTION EST TOUJOURS JUDICIEUSE, FONT DE JEAN-BAPTISTE UN CONCURRENT REDOUTABLE SUR LE SOL D'UN PAYS NOUVEAU.\"\n\nLes meneurs du parti tory continuant à essayer de remuer dans les cœurs, la cendre mal éteinte des passions religieuses; le Mail, fidèle à cette astucieuse tactique, définit de la façon suivante la politique qu'il cherche à inaugurer contre l'Eglise catholique :\n\n\"Nous disons qu'elle ne peut justement réclamer le titre d'Eglise établie, ni prétendre au droit de prélever des dimes, d'imposer des charges de fabrique, de diriger la presse, de contrôler l'éducation et de garder un million et quart de Canadiens dans un état d'ignorance et de rêve extatique, puisqu'aucune autre Eglise ne jouit en ce pays de semblables privilèges.\n\n\"Plus loin, pour réveiller la vieille animosité entre protestants et catholiques, il ajoute que l'Eglise \"n'attend que le moment opportun pour restreindre les libertés reconnues aux protestants.\"\n\nLe 21 août 1886, le Mail menaçait encore la Province de Québec d'une invasion des habitants de l'Est et de l'Ouest :\n\n\"Cet article est une espèce de résumé des attaques du Mail contre l'Eglise Catholique. Il représente l'Eglise comme nuisible à la minorité protestante de la province de Québec; il dit qu'elle est \"l'institution la plus oppressive de ce genre sur la terre;\" qu'elle \"force l'état à reconnaître la suprématie de ses lois ecclésiastiques et canoniques;\" qu'elle \"interdit l'opération de la loi civile sous des peines pires que la mort;\" que la \"Province de Québec sous la règle de l'Eglise est pire que tous les autres pays;\" que \"même en Espagne et en Belgique le fait d'infliger des peines cléricales contre les morts est regardé comme une offense criminelle;\" que l'Eglise méconnaît complètement la loi interdisant l'exercice d'influences indues dans les élections; que \"le code civil de la province de Québec repose sur le principe que les lois ecclésiastiques sont au-dessus de la loi civile.\"\n\nTelles sont les opinions de Sir John A. Macdonald dans Ontario. Peut-on supposer quelque chose de plus brutalement révolutionnaire ? N'est-ce pas chercher à allumer une guerre de race et de religion ?\nMais ces attaques ne sont pas particulières au *Mail*. Elles n'ont pas un caractère isolé.\n\nVoyez plutôt : \"UNE CONVENTION DU PARTI CONSERVATEUR A EU LIEU À TORONTO LE 14 JANVIER 1878. ON ADOPTA UNE SÉRIE DE RÉSOLUTIONS à la fin des travaux le 16 du même mois. Le 17 janvier, le *Mail* reproduisait ces résolutions et disait à la fin de ses commentaires :\n\n\"La convention a eu la bonté de passer la résolution suivante au milieu d'une démonstration assez chaleureuse. Nous offrons nos sincères remerciements aux membres de la convention, et nous nous empressons de leur déclarer que notre intention est de rendre ce journal digne du parti et de la cause qu'il a soutenu comme par le passé :\n\n\"QUE LES REMERCIEMENTS DU PARTI LIBÉRAL—CONSERVATEUR SONT DUS AU JOURNAL LE *Mail* QUI A TOUJOURS DÉFENDU LES PRINCIPES CONSERVATEURS ; ET CETTE CONVENTION DÉSIRE EXPRIMER SON ENTIÈRE CONFIANCE EN LA DIRECTION ACTUELLE DU JOURNAL ET L'ESPÉRANCE QUE L'AVENIR LUI RÉSERVE DES SUCCÈS.\"\n\n---\n\n**Le Programme de Mr. Meredith.**\n\nLe programme de Mr. Meredith que Sir John A. Macdonald a appelé \"Mon lieutenant\" dans la dernière élection locale d'Ontario n'a été qu'une répétition pure et simple du programme anti-français et anti-papiste du *Mail*.\n\nLe *Mail* le déclarait lui-même à la date du 27 novembre 1886 dans les termes suivants :\n\n\"L'adresse de M. Meredith à ses électeurs de London, publiée ce matin, est un programme clair, ferme et qui ne trompera personne. Et il ajoutait :\n\n\"LE PALAIS DES PAPES EST LA SEULE PLACE SUR LA TERRE OU LE MEURTRE EST PUBLIQUEMENT GLORIFIÉ.\n\n\"Ne sommes-nous pas justifiables de ne permettre aucune licence à l'Eglise de Rome et a-t-elle le droit de se plaigndre, elle qui nous refuse toute liberté ?\n\n\"NOUS PROCLAMONS QUE L'ÉGLISE CATHOLIQUE N'A PAS, DANS AUCUNE PARTIE QUELCONQUE DE LA PUISSANCE DU CANADA, LE DROIT DE SE PRÊTENDRE UNE ÉGLISE ÉTABLIÈ, DE SE FAIRE PAYER LA DIME, D'IMPOSER DES TAXES DE FABRIQUE, DE GOUVERNER LA PRESSE, DE CONTROLER L'ÉDUCATION OU DE LAISSER CRUIPER UN MILLION ET QUART DE CANADIENS DANS LES TÉNÈBRES...\"\nNous ajoutons aussi que, pour les mêmes raisons et pour d'autres non moins évidentes, elle (l'Eglise de Rome) N'A AUCUN DROIT DANS CETTE PROVINCE à une loi qui force les siens et aussi les protestants, qu'ils le veulent ou non, à SUPPORTER DES ÉCOLES SÉPARÉES QUI FORMENT, TOUT AUTANT QUE LE CONFESSIOINAL, PARTIE INTÉGRANTE DE SON ORGANISATION ECCLÉSIASTIQUE, qu'elle n'a aucun droit à retirer comme elle le fait, des argents du trésor public POUR SOUTENIR DANS LES COMTES DE PRESCOTT ET DE RUSSELL, (où les Canadiens-Français catholiques sont en grande majorité,) SOIXANTE-DIX ÉCOLES où elle enseigne UNE LANGUE ÉTRANGÈRE (la langue française) QU'ELLE N'A PAS LE DROIT D'ÊTRE SPÉCIALEMENT PRÉSENTÉE DANS NOS GOUVERNEMENTS ET QUE PARDESSUS TOUT, ELLE N'A PAS LE DROIT D'IMPOSER SES IDÉES EN MATIÈRE D'ÉDUCATION.\"\n\nLe World de Toronto qui n'est pas suspect de tendresse pour les Canadiens-français et qui a accepté franchement la politique de M. Meredith s'exprimait de son côté comme suit :\n\n\"LE MANIFESTE DE M. MEREDITH ACCENTUE DISTINCTEMENT LE CHANGEMENT DE PROGRAMME RÉCEMMENT ADOPTÉ PAR LE PARTI CONSERVATEUR.\"\n\n\"Ce n'est plus simplement un journal qui parle, c'est LE CHEF DU PARTI CONSERVATEUR DANS LA CHAMBRE. Ceux qui croyaient que la nouvelle attitude du Mail n'était qu'un truc pour le temps des élections DOIVENT MAINTENANT ÊTRE CONVAINCUS QUE LA NOUVELLE POLITIQUE CONSERVATRICE EST ÉTABLIE.\"\n\nTous les journaux tories d'Ontario sans exception, le Hamilton Spectator, le Peterboro Review, le Stafford Herald, le Belleville Intelligencer, le London Free Press, etc., etc., sans parler de l'Orange Sentinel ont suivi exactement la même campagne.\n\nTous ces journaux qui vivent des largesses de Sir John A. Macdonald et des commandes d'impression aux frais du trésor fédéral ont obéi au même mot d'ordre.\n\nD'un bout à l'autre de la province d'Ontario toute la presse religieuse s'est répandue en un long cri contre les Canadiens-français et contre l'Eglise catholique.\n\nEnfin, pour qu'il ne reste aucune équivoque, on peut citer les propres paroles de M. Meredith, posant nettement la question contre la province de Québec et reprochant comme un crime d'Etat à M. Mowat de s'être montré favorable aux défenseurs de l'infortuné Riel.\n\nVoici ses paroles :\n\n\"Je regrette que le gouvernement provincial d'Ontario, pour des motifs indignes, ait prêté son concours à une agitation dangereuse dans la province de Québec, agitation dont le succès est de nature à rendre l'application de la loi impossible et constitue une menace\npour la paix et le bonheur des habitants du pays. Si le gouvernement d'Ontario devait être soutenu aux prochaines élections, ce serait, je crois, donner une NOUVELLE FORCE à cette agitation.\"\n\nAinsi, il est bien entendu que, même dans le langage voilé et diplomatique du principal représentant du parti tory dans Ontario, c'est la province de Québec qui est l'objectif de la lutte. C'est l'annulation de l'influence canadienne-française qu'on poursuit per fas et nefas.\n\nLa campagne de l'Orange Sentinel\n\nL'Orange Sentinel publié à Toronto mérite une place à part.\n\nIl n'est pas comme le Mail l'organe officiel de sir John A. Macdonald, mais il est l'organe officiel des loges orangistes qui, par l'intermédiaire de M Bowell dictent leur volonté à sir John et au gouvernement fédéral.\n\nDans son numéro du 21 octobre, The Sentinel enregistre le résultat des élections de Québec. Après avoir constaté que la cause nationale a remporté au moins une victoire morale, l'organe orangiste ajoute :\n\n\"Les électeurs anglais des autres province devront voir aux prochaines élections fédérales, à ce qu'il soit envoyé à Ottawa un nombre suffisant de députés pour contre-balancer les nationaux canadiens-français qui seront envoyés de Québec et qui seront aidés par une fraction du parti libéral des autres provinces. Si cette combinaison n'est pas écrasée immédiatement, nous aurons à Ottawa une répétition des tactiques des nationaux irlandais à Westminster. M Laurier deviendra le dictateur du parlement fédéral—Un Parnell français de qui notre Gladstone canadien (M. Blake) acceptera le pouvoir, bien que la domination française, qui s'en suivra nécessairement, ébranlera la Confédération jusque dans ses fondements.\"\n\nDans le numéro du 4 novembre, nouvel appel aux Anglais contre les Canadiens-français qui se termine ainsi :\n\n\"Les Canadiens-français sont maintenant les ennemis déclarés de la suprématie anglaise et des lois anglaises, et il faut les traiter en conséquence. Mais nous avons au milieu de nous des hommes qui, pour l'amour du pouvoir, sont prêts à sacrifier tous les principes, peut-être à détruire la Confédération pour obéir aux ordres de leurs alliés de qui ils attendent le pouvoir. Ce sont-là les pires ennemis que les Canadiens loyaux ont à combattre. Leurs paroles sont douces, mais leurs actes sont des actes de traîtres ; la voix est la voix de Jacob, mais la main est celle d'Esau.\"\nNous ne voulons pas multiplier les citations.\n\nL'organe officiel des orangistes déclare que les libéraux anglais et leur chef, M. Blake, doivent être répudiés à titre d'amis des Canadiens-français et il ajoute que les hommes à soutenir, les vrais et sincères ennemis du Canada français ne sont autres que Sir John A. Macdonald et ses complices.\n\nL'aveu est caractéristique.\n\nAux Canadiens-français, aux catholiques, aux patriotes d'en prendre honte et d'ariser.\n\nLa campagne Prussienne et anti-française de Haldimand.\n\nOn sait qu'une élection partielle au parlement fédéral a eu lieu au mois de septembre dernier dans le comté de Haldimand, (Ont.)\n\nLe gouvernement de Sir John A. Macdonald y a été royalement battu, comme il l'est d'ailleurs dans tous les comtés et dans toutes les provinces où le peuple est successivement appelé à se prononcer.\n\nMais cette élection qui précédait les élections locales et qui était la première dans la province d'Ontario depuis le meurtre de Riel, offrait aux yeux de Sir John A. Macdonald et ses complices, un intérêt considérable.\n\nFidèle à son programme qui est de provoquer partout le cri anti-français, Sir John A. Macdonald remarquant que le comté de Haldimand compte parmi ses électeurs un nombre assez considérable d'allemands, imagina d'évoquer le spectre de la guerre de 1870 et de 1871 et d'essayer de soulever le fanatisme allemand contre la province de Québec au nom de la lutte de race qui existe en Europe entre la France et l'Allemagne.\n\nLe Free Press de Berlin (Ont.) qui doit son existence au parti tory et à un riche contrat d'impressions du gouvernement fédéral, fut chargé de la campagne.\n\nS'adressant aux Allemands dans leur langue, le Free Press publia l'article que voici :\n\nLes Allemands du Canada se laisseront-ils tyranniser et humilier par les Français ?\n\n\" Il n'y a pas sur la surface terrestre de peuple plus ambitieux, plus agressif, plus insupportable, plus tyrannique que le peuple Français. Ce n'est pas là une proposition en l'air, mais un fait historique avéré. L'histoire, même à cette heure, a des frémissements quand elle fait le récit des actes de dévastation perpétrés par les Français avec tous\nles raffinements de la cruauté, il y a plus d’un siècle, dans la région allemande de l’Alsace et de la Lorraine, de même que dans tout le pays arrosé par le Rhin. Napoléon I a parcouru toute l’Europe, promenant partout l’incendie, le pillage, le carnage, jusqu’à ce qu’enfin son esprit de conquête soit allé s’éteindre à Ste. Hélène. En 1870, Napoléon III, avec une effronterie inouïe, déclara la guerre à l’Allemagne, parce que celle-ci refusait de danser sur la musique française. Ces Français oubliaient comment l’Allemagne avait su porter l’épée dans les guerres de sa liberté. En 1870, l’Allemagne fut de nouveau invitée à les remettre à leur place. À chaque page de l’histoire, on constate que depuis des siècles la France a été la pire ennemie de l’Allemagne ; que le peuple français a voué à l’Allemagne une haine sans bornes, et qu’il n’a qu’un désir, c’est de la détruire et de l’anéantir. Tel est la situation de l’autre côté de l’océan. Mais l’Allemagne n’a pas peur de la France.\n\n“LES FRANÇAIS SONT LES MÊMES DANS LE MONDE ENTIER. PARTOUT, ILS ASPIRENT À COMMANDER ET À TYRANNISER LES AUTRES.” L’ambition d’un Français ne connaît pas de bornes ; il voudrait voir le monde entier à ses pieds.\n\n“ICI, AU CANADA, NOUS LES RETROUVONS AVEC LEURS VIEILLES MANIES. Ils veulent que tout marche à leur caprice. Ils s’attendent à voir toutes les autres nationalités s’incliner devant leurs désirs. Ils veulent être maîtres au Canada : Anglais, Écossais, Irlandais, Allemands, doivent être leurs obéissants serviteurs et se soumettre humblement aux exigences de messieurs les français.\n\n“Eh bien ! nous vous le demandons, Allemands, avez-vous quitté votre patrie, avez-vous franchi l’océan pour être les valets des Français de Québec ? Nous vous le demandons, les Allemands du Canada se soumettront-ils honteusement à la tyrannie des Français du Canada ? Nous disons : Non ; nous crions : Non, de toutes nos forces, et nous espérons que ce “non” trouvera un écho dans le cœur de chacun des Allemands du Canada.”\n\nLe lecteur se demande sans doute ce que Napoléon Ier et Napoléon III, ainsi que l’Alsace et la Lorraine, ont à faire dans la politique canadienne. Mais ce n’était là qu’une entrée en matière. Un second article du Free Press berlinois dessine de plus en plus nettement la pensée de ses inspirateurs :\n\n“Nous voudrions voir, dit encore le Free Press, la physionomie du parlement si M. Kranz lui adressait la parole en allemand. Cependant, les Français peuvent parler leur langue au parlement. C’est leur impudence ordinaire qui leur a valu l’acquisition de ce droit. Mieux que cela, le Canada anglais paie annuellement des milliers de piastres pour faire imprimer tous les papiers d’État et les documents officiels en français aussi bien qu’en anglais. Le premier document public imprimé en allemand est encore à venir, mais les Français, eux, font tout imprimer dans leur langue aux dépens du pays. Pourquoi ? Parce qu’ils sont Français, c’est-à-dire agressifs et dénués\nDE TOUTE PUDEUR. L'Etat paie même les frais de l'éducation française de leurs enfants........\"\n\nDans un troisième article du Free Press, l'idée tory se fait de plus en plus jour. Cet écrit est intitulé :\n\nComment les Allemands du Canada peuvent contribuer à arrêter l'œuvre aggressive des Canadiens-français. Nous en détacherons quelques passages.\n\n\"L'élection de Haldimand se fait sur Riel. Ordinairement, il y a dans les luttes, quelques questions politiques ou économiques en jeu, mais à Haldimand il y a Riel et Riel tout seul. Les français et leurs amis prétendent que le parti conservateur n'aurait pas dû laisser pendre Riel ; les conservateurs répondent qu'ils ne pouvaient faire autrement et que le bien du pays exigeait sa mort. Les électeurs de Haldimand sont appelés à décider si le parti conservateur doit être condamné pour avoir permis l'exécution de Riel, ou si les français et leurs amis doivent être entravés dans leur œuvre d'agression. Les Réformistes, s'étant alliés aux français, doivent accepter le verdict qui sera prononcé contre eux. Que ceux qui approuvent l'agression française, qui sont satisfaits de voir les français dominer et tyranniser ce pays—nous tyranniser, nous, Allemands—que ceux-là, dieux-nous, votent pour le parti réformiste. Mais que ceux qui croient que l'exécution de Riel a été juste, qui ne veulent pas donner aux français plus d'autorité en ce pays que les Anglais, les Ecossais ou les Allemands, et qui croient le moment venu de mettre un frein à l'ambition française : que ceux-là votent pour le parti conservateur.\n\n\"Nous parlons sans esprit de parti ! Mais, puisque les réformistes ont fait alliance avec les Français parce qu'une vile canaille (arch-scoundrel) a été pendue ; puisque les uns et les autres veulent faire du capital politique avec l'exécution de Riel, il ne nous reste plus, à nous autres Allemands, d'autre alternative que de voter conservateurs, et de déclarer par notre vote pour les candidats conservateurs que Riel avait richement mérité la mort et que nous, Allemands, nous ne nous soumettrons pas à la domination française.\n\nPuisque les réformistes nous jettent dans les jambes le spectre de Riel et veulent nous imposer le joug des Français de Québec, nous n'avons plus de secours à attendre que des conservateurs et nous devons les maintenir au pouvoir en dépit de ces Français. Si les Français entendent gouverner ce pays, les Allemands doivent donner signe de vie. La seule chose que nous ayons à considérer est celle-ci : Si nous voulons être pour Riel et les Français, votons pour les réformistes ; mais sommes-nous contre Riel et contre les Français ? ALORS DONNONS NOTRE VOTE AUX CONSERVATEURS.\" Nous demandons à tous les Allemands du Canada, à Haldimand, Welland, Waterloo, partout où il s'en trouve, de voter contre Riel et contre les Français, c'est-à-dire pour le parti conservateur. LES ALLEMANDS NE VEULENT PAS DE LA DOMINATION FRANÇAISE EN CANADA.......\nCes appels aux passions prussiennes, sur le sol américain, dans un pays dont les habitants de race française sont politiquement séparés de la France depuis plus d’un siècle sont certainement le comble de ce que peut amener chez un homme imbue de l’esprit de guerre civile, la perversité politique la plus noire.\n\nCette fois encore le forban doublé d’un saltimbanque que nous avons trop longtemps laissé à la tête de la Confédération, avait commis une lourde erreur.\n\nNon seulement ces Allemands n’ont pas répondu à l’appel du fanatisme ; mais il paraît (on ne saurait songer à tout) que la majorité d’entre eux est d’origine alsacienne et a pris pour une insulte personnelle les outrages publiés contre la race française par ordre du gouvernement du Dominion.\n\nCette odieuse manœuvre n’en reste pas moins à la charge de sir John et de son gouvernement.\n\nC’est dans la même campagne de Haldimand qu’un collègue de sir John, l’honorable Thomas White, ministre de l’intérieur, exhiba dans une réunion publique un portrait de Riel avec un corde autour du cou, en s’écriant aux applaudissements des orangistes :\n\n“VOICI LE NOUVEAU SAINT DE L’ÉGLISE CATHOLIQUE ROMAINE !”\n\nConformément à la tactique de son parti, M. Thomas White a essayé de nier dans Québec où elle pouvait être nuisible, l’infamie qu’il avait dite dans Ontario où il la croyait profitable ; mais cette dénégation n’a servi qu’à le mettre en flagrant délit de mensonge. En effet, il résulte d’une lettre du révérend Gardon, curé de Cayuga, et d’un affidavit de Thomas Anthony que M. White a bien réellement tenu les paroles déniées par lui.\n\nPersonne ne s’en étonna.\n\nM. Chapleau, un Canadien-français en a dit bien d’autres contre ses compatriotes que la sténographie n’a pas relevé dans le comté de Windsor.\n\n---\n\n**UNE MYSTIFICATION**\n\n**LE PRETENDU DESAVEU DU “MAIL”**\n\nLa campagne anti-française et anti-catholique du *Mail* commencée au mois de novembre 1885.\n\nElle s’est continuée pendant tout le cours de l’année 1886 et pendant toute la durée des élections d’Ontario sans qu’aucun des chefs Tories qui s’en servaient y trouvât à redire.\nComment y auraient-ils trouvé à redire : c'était sir John A. Macdonald qui inspirait et qui dictait la campagne ?\n\nMais, depuis cette époque, il s'est passé un fait important.\n\nLes élections d'Ontario ont eu lieu et la campagne anti-papiste a complètement échoué.\n\nLe ministère Mowat qui disposait dans la dernière chambre d'une majorité de 16 voix est rentré avec une majorité de 26 voix.\n\nLes électeurs d'Ontario, suivant l'exemple déjà donné par les électeurs de la Nouvelle Écosse, du Nouveau-Brunswick et de l'Île du Prince-Édouard, se sont prononcés à une écrasante majorité contre les corrupteurs, contre les sycophantes, contre les artisans de guerre civile ; en un mot contre tout ce qui constitue le programme de la politique tory.\n\nA une déclaration de guerre contre les Canadiens-français et contre les catholiques, ils ont répondu en élisant, comme représentant du parti libéral à la Chambre législative de Toronto un plus grand nombre de Canadiens-français et d'Irlandais catholiques qu'il n'en a jamais figuré dans aucune Assemblée du Haut-Canada.\n\nDevant cette éclatante démonstration des sentiments de nos concitoyens de race anglaise, les ministres d'Ottawa ont changé d'avis. N'ayant plus rien à attendre des Anglais d'Ontario, ils ont voulu tenter une dernière chance en se jetant sur les Canadiens-français de la province de Québec.\n\nOn l'a dit au début, Sir John A. Macdonald est prêt à user de tous les moyens pour annihiler l'influence canadienne-française, mais il préfère à tout l'intérêt de sa propre domination et il aime encore mieux continuer à tromper les Canadiens-français que de s'exposer à perdre le gouvernement.\n\nC'est pourquoi on a fait semblant de désavouer le Mail. Ce désaveu venant après la campagne d'Ontario dans laquelle Sir John, M. Merédith et le Mail ont fait cause commune, ne saurait tromper personne.\n\nLe peuple canadien-français est composé d'hommes intelligents ; il ne faut pas les traiter comme des imbéciles.\n\nTout le monde sait que le Mail a toujours été à la discrétion de Sir John A. Macdonald.\n\nTout le monde sait que Sir John A. Macdonald y possède encore actuellement pour plus de $70,000 d'actions.\n\nTout le monde sait qu'un simple mot du chef du gouvernement eut suffi pour transformer la ligne politique du Mail.\n\nEt comment Sir John A. Macdonald pourrait-il désavouer la ligne politique du Mail, alors que tous les journaux conservateurs d'Ontario sans exception ont soutenu la même ligne politique ?\n\nOn peut prétendre que le Mail vit de ses propres ressources, mais il est de notoriété publique qu'à Ontario comme ailleurs les autres organes républicains ne vivent que des largesses du gouvernement.\n\nLa vérité est que Sir John A. Macdonald après avoir mené la campagne orangiste, voudrait aujourd'hui en laisser la responsabilité à ses agents les plus compromis et TENTER DE TROMPER DE NOUVEAU\nLES CANADIENS-FRANÇAIS.\n\nIL N'Y REUSSIRA PAS.\n\nLe Chronicle qui, certes ne brille pas par ses sympathies pour les catholiques et les Canadiens-français a fait à la date du 30 décembre 1886 la déclaration qui suit :\n\n\"Le Mail a mis les Canadiens-français et les catholiques romains dans la rigoureuse impossibilité de donner leur appui aux candidats conservateurs, mardi dernier, à moins d'abdiquer tout sentiment d'honneur.\"\n\nCanadiens-français, nous n'avons rien de plus à vous dire.\n\nUn organe anglais et orangiste a été obligé de reconnaître que le devoir et l'honneur vous interdisaient de donner vos suffrages au gouvernement qu'il reconnaissait être celui de sa prédilection.\n\nCanadiens français, vous avez été injuriés et bafoués. On ne s'est pas contenté de prendre pour programme votre annulation politique. On a déclaré par la voix de la presse que vous étiez une race destinée au servage, que votre religion devrait être proscrite, que vos lois devraient être abrogées ; et ce qu'on a déclaré, c'est la volonté longuement réfléchie de Sir John A. Macdonald et de ses complices.\n\nVoulez-vous que le Canada Français soit respecté ?\n\nVoulez-vous qu'il tienne dans la Confédération la place qui lui est due ?\n\nVoulez-vous l'union de tous les braves gens qui, sans distinction de race ou de religion, se proposent de travailler ensemble à l'union, à la pacification des esprits et à la prospérité politique et économique du pays ?\n\nSi vous voulez tout cela, relisez les articles du Mail, étudiez de près la perversité de la campagne suivie par Sir John A. Macdonald et votez pour le chef du gouvernement qui a juré de défendre l'autonomie des provinces et qui s'est fait le défenseur de la pacification entre les races.\n\nCe chef de gouvernement c'est\n\nL'HON. EDWARD BLAKE,\n\nle fils de l'homme qui a défendu les patriotes de 1837, l'orateur qui a protesté à la Chambre des Communes contre l'organisation orangiste, l'ennemi déclaré des francs-maçons et de toutes les sociétés secrètes, le chef politique qui s'est toujours prononcé pour les droits des provinces, pour l'union des races et pour le respect de toutes croyances religieuses.\nAPPENDICE.\n\nLe serment des Orangistes prêté par Sir John A. Macdonald, en qualité de membre de la loge No. 352.\n\n\"Je jure que je tiendrai toujours sacré le nom de notre glorieux libérateur, le Roi Guillaume Prince d'Orange, en souvenir reconnaissant duquel je promets solennellement (si c'est en mon pouvoir) de célébrer sa victoire sur Jacques, à la Boyne, en Irlande, en me réunissant à mes frères dans leur salle de Loge, le 12 juillet de chaque année ; JE JURE QUE JE NE SUIS PAS ET QUE JE NE SERAI JAMAIS UN CATHOLIQUE ROMAIN OU UN PAPISTE ; et que je ne suis pas et ne serai jamais marié à une catholique romaine ou à une papiste ; que je n'éleverai pas mes enfants, et que je ne permettrai pas qu'on les élève dans la foi catholique romaine, si je puis l'empêcher ; QUE JE NE SUIS PAS ET NE SERAI JAMAIS MEMBRE D'UNE SOCIETE ET D'UN CORPS D'HOMMES QUI SONT ENNEMIS DE SA MAJESTE et de notre glorieuse constitution ; que je n'ai jamais été à ma connaissance suspendu ou expulsé d'aucune loge orangiste.\"\nUN NOUVEAU MENSONGE.\n\nTentative de démenti de la \"Minerve.\"\n\nL'affiliation de Sir John A. Macdonald aux loges orangistes était connue de tout le monde. Sir John, lui-même, l'avait admis et s'en était glorifié. Cela n'a pas empêché la Minerve d'essayer, l'été dernier, avec son impudence habituelle, de nier ce fait de notoriété universelle.\n\nMal en a pris à l'organe pendard, car ce démenti audacieux n'a servi qu'à faire apporter des preuves irréfutables de l'affiliation de Sir John à l'orangisme.\n\nTEMPOIGNAGES ACCABLANTS\n\nLe 23 juillet dernier, le British Whig de Kingston, disait :\n\n\"Nous sommes informés de très haute autorité que Sir John, quoiqu'il en ait sans doute perdu la mémoire, a été régulièrement assermenté comme orangiste dans le Loyal Orange Lodge numéro 352 de la cité de Kingston ; que Ogler R. Gowan était présent en cette occasion ; que le Past Grand Master John Flanagan et le grand Marshall Thomas Robinson connaissent les faits et ont siégé dans la Loge aux côtés du F.*.* Sir John Macdonald ; que le Fr.*.* Jas. Shannon, aujourd'hui maître de poste de Kingston, et ci-devant scribe de confiance de Sir John Macdonald pendant plusieurs années, a payé les contributions de Sir John à l'ordre, afin de le maintenir sur un bon pied dans la loge.\"\n\nCe témoignage était peu après corroboré par la lettre suivante :\n\nM. le Rédacteur,\n\nMon attention a été attirée sur le fait que, dans une occasion récente, Sir John Macdonald a affirmé en public qu'il n'avait jamais été orangiste.\n\nJe vous informerai que dans l'automne 1854, Sir John Macdonald et moi, nous avons été initiés le même soir dans la loge orangiste de Kingston. C'était peu après l'achèvement de la bâtisse de la cité de Kingston dont j'étais charpentier entrepreneur, et M. Henry H. Benson était grand maître de la loge. M. Ogler Gowan était alors Grand Maître de la loge orangiste du Haut-Canada, et présidait la réunion au cours de laquelle nous avons été initiés. Je suis très\npeiné de voir que Sir John ose nier qu'il ait jamais été orangiste et j'espère qu'on me permettra de lui donner un démenti formel.\n\nVous pouvez faire ce que vous voudrez de cette lettre dont je suis prêt à attester le contenu sous serment.\n\nROBERT FISHER.\n\nSeaforth, 5 août 1836.\"\n\nLa comparaison entre Sir John A. Macdonald et l'honorable Edward Blake.\n\nSir John A. Macdonald est orangiste et franc-maçon. L'honorable Edward Blake a pris la parole en 1834 à la Chambre des Communes pour protester contre le bill d'incorporation des orangistes, et ce bill a été rejeté par une majorité formée des libéraux d'Ontario réunis aux Canadiens-français.\n\nTout récemment encore l'honorable Edward Blake a déclaré qu'il était opposé à toutes les sociétés secrètes quelles qu'elles fussent et qu'il n'avait jamais consenti à faire partie d'aucune d'elles.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001474.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 27, "total-input-tokens": 39806, "total-output-tokens": 16849, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 147, 1], [147, 194, 2], [194, 1452, 3], [1452, 4080, 4], [4080, 6594, 5], [6594, 8588, 6], [8588, 11401, 7], [11401, 13868, 8], [13868, 16726, 9], [16726, 19741, 10], [19741, 22362, 11], [22362, 25080, 12], [25080, 27572, 13], [27572, 30157, 14], [30157, 32223, 15], [32223, 34754, 16], [34754, 37156, 17], [37156, 39328, 18], [39328, 42314, 19], [42314, 45259, 20], [45259, 47367, 21], [47367, 50230, 22], [50230, 52373, 23], [52373, 53383, 24], [53383, 55348, 25], [55348, 56194, 26], [56194, 56194, 27]], "primary_language": ["fr", "ru", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]