[{"id": "7ede3990cac2308383dbe1b80fca4324782e73ee", "text": "SKANDINAVISKA NATIONAL FÖRENINGENS\n\nHÖGE BESKYDDARE\n\nHANS EXC. PREMIER MINISTERN AF DOMINION\nAF CANADA\n\nSIR JOHN A. MCDONALD\n\nK. C. B. ETC. ETC.\n\nTILLEGNAS DENNA BOK\n\nVORDSAMLIGEN\n\nAF\n\nSKANDINAVISKA NATIONALFORENINGEN\n\nI WINNIPEG.\nINLEDNING.\n\nDenna bok är ämnad att blifva till nytta och vägled-\nför skandinaver, som ämna söka sig ett hem i Nord Western\nCanada, som numera och detta med rätta har ådragit sig stor\nuppmärksamhet för de stora fördelar och de oändliga land-\nsträckor, som här stå nybyggaren till buds.\n\nDen \"gyllene tiden\" i Amerika med dess guldgruvvor och\ngröna skogar har haft sin ände och här likasom allestädes san-\nnas ordspråket \"hvar och en är sin lyckas smed\".\n\nVi meddela här, jemte en kort beskrifning öfver landet i\nsin helhet, några erfarenheter från skandinaviska kolonister i\nhopp om att desamma må blifva till någon nytta för anlän-\ndande landsmän.\nCANADA.\n\nDen ofantliga utvecklingen af de Förenta Staterna i Nordamerika och de senare årens stora folkvandring från Europa, huvudsakligen till det stora Nord Vestern, måste naturligtvis leda uppmärksamheten på de landsträckor, som ligge i den nordliga delen af det Amerikanska fastlandet och som tillhöriga England, benämns, Britiska Nord Amerika eller Canada. Canadas yttreinhåll är större än Förenta Staternas, Alaskas undantagen.\n\nLandets beskaffenhet och dess ofantliga utsträckning blefvo derföre föremål för uppmärksamhet af nybyggaren och regeringen lät anlägga en jernväg till att genomskära hela Canada från öster till väster och sätta hamnarne vid Atlantiska Oceanen i direkt förbindelse med dem vid Stilla havet.\n\nDenna jernväg, som benämnes Canada-Pacific jernvägen, är den längsta jernväg i världen, 3,047 engelska mil lång; den blef fullt färdig och öppnad för trafik i Juli månad 1885.\n\nCanadas östra provinser Prins Edvards ö, Nova Scotia, Ny Brunswick, Quebec och Ontario hade redan länge varit bebodda, men under de senare åren haft folkvandringen allmänneigen vändt sig till Nord Vestern och sålunda uppkommo snart nya provinser, bland hvilka Manitoba, som inträdde som provins i Dominion 1870, intager ett framstående rum.\n\nNord Vestern är indelad i distrikter, benämnda Keewatin, Assiniboia, Saskatshewan, Alberta och Athabasca.\n\nMANITOBA OCH NORD VESTERN.\n\nProvinseren Manitoba ligger emellen 49:de och 50 ½ grad nordlig bredd och 89:de och 102:dra graden vestlig längd lika långt från Atlantiska och Stilla haven som från Ishafvet och Mexikanska viken, således midt i sjelfva hjertat af Nord Amerika. Sydgränsen ligger ungefärliken på samma breddgrad som Paris och delar af Syd-Tyskland.\n\nManitoba är omkring 135 engelska mil långt och 250 mil bredt och innehåller omkring 86,700 kvadratmil.\n\nFolkmängden i provinsen Manitoba är omkring 100,000.\nWinnipeg är provinsens huvudstad, och har omkring 25,000 invånare, och säte för guvernören.\n\nVester och norr om provinsen sträcker sig det Nord Vestra Territoriets som innehåller i runt tal 2,500,000 eng. qv.-mil och över 200,000,000 acres brukbart land, som ännu ligger orördt.\n\nREGERINGEN OCH DE SOCIALA FÖRHÅLLANDENA.\n\nInvandraren möter här den friaste regeringsform i verlden. Ingen ärftlig aristokrati finns i Canada. Källan till all makt och allt välstånd ligger hos sjelfva folket modererad och ledd af moderlandets konstitutionella former, hvilka hafva slagit djup rot i Canada. Med hänsyn till de sociala förhållanden, må påpekas, att här icka råder en sådan klasskilnad som man i Europa finner öfverallt. Arbetaren är lika god som arbetsgifvaren och den fattiga är lika väl ansedd som den rike.\n\nRegeringen är grundlagd på principen af ministrarnas ansvarighet inför parlamentet eller folkets representanter.\n\nHvarje provins har en guvernör och en ansvarig sjelfstyrelse efter samma princip som sjelfva staten.\n\nDistrikter och städer hafva äfvenledes sina egna styrelser, som beslutat om skatter till skolorna, vägarne o. s. v.\n\nCanadiska regeringen har sitt säte i Ottawa.\n\nKLIMAT.\n\nFastän Manitoba ligger på samma breddgrader som Central Europa, är klimatet dock till en del annorlunda på grund af provinsens belägenhet midt inne i det stora fastlandet. Den kan närmast sägas hafva en sydfransk sommar och en hård skandinavisk vinter. I följd af den starka värmen är vegetationen särdeles hastig; såd som säs i Maj höstas redan i Augusti.\n\nVintrarna likna som ofvan nämndt de skandinaviska. De äro understundom kallare än Sveriges, men äro icke så kännbara tillfölje af den alltid torra och klara luften.\n\nI Manitoba och Nord Vestern är mycket sundt. Allmänna febrar äro nästan okända. Snöfallet är mindre än i östra Canada och öfverstiger sällan 2 fot. På det hela taget är klimatet godt och just passande för skandinaver.\n\nJORDMÅNEN.\n\nJordmånen består af en kolsvart lös mylla, som dels hvilar på ett segt, svartblått lerlag, dels på ett sandigt underlag. Det är en utomordentlig kraftig och rik jordmån och egnar sig hufvudsakligast till hveteodling. Näringskraf-\nten för växterna är så stark, att den, när prärien första gången är uppriven, kan besås flera år å rad, utan att man behöver frukta för ringare skörd och jorden behöver ej gödas de första åren.\n\n**LAND.**\n\nLandmätningssystemet i Manitoba och det Nord Vestra Territoriets är ganska enkelt. Hela landet är uppdelat i kvadrater, townships. Hvarje township är åter indelad i 36 sectioner, af vilka hvar och en är af 1 engelsk qvadratmils storlek och omfattar 640 acres. De särskilda sectionerna i hvarje Township äro numererade på sätt, som i närmastande figur visas.\n\n|   | 31 | 32 | 33 | 34 | 35 | 36 |\n|---|----|----|----|----|----|----|\n| 30 | Skol 29 land. | 28 | 27 | H.B. C:s 26 land. | 25 |\n| 19 | 20 | 21 | 22 | 23 | 24 |\n| 18 | 17 | 16 | 15 | 14 | 13 |\n| 7  | H.B. C:s 8 land. | 9 | 10 | Skol 11 land. | 12 |\n| 6  | 5  | 4  | 3  | 2  | 1  |\n\nSectionerna 11 och 29 i hvarje township har regeringen reserverat till bestridande af skolutgifterna, och de försäljas genom auktion åt den högstbjudande.\n\nSectionerna 8 och 26 i de flesta townships tillhöra Hudson Bay Companiet, hvilket förrom innehade landsrättigheten i Manitoba och Nord Vestern, men afstått densamma till rege-\nringen. De försälja sina land till varierande priser från $2,50 per acre till högre priser.\n\nSectionerna med jemina nummer bortgivvas af regeringen fritt till nybyggarna.\n\nHvarje huvud för en familj, såväl som hvarje man öfver 18 år erhåller af regeringen gratis ¼ section eller 160 acres (omkring 128 svenska tunnland).\n\nVid öfvertagning af land skall kolonisten betala 10 Dollars (37 Kronor) i inskrifningsafgift och förpligta sig att taga landet under odling.\n\nHan skall första året, efter inskrifningen, uppbruta minst 10 acres af sitt land och besä dem.\n\nAndra året måste han inhösta af de första 10 acres och uppbruta och besä andre 15 acres.\n\nTredje året måste han inhösta af 25 acres och uppbruta andre 10 acres så att efter tredje årets förlopp tillsammans 35 acres skola vara uppodlade.\n\nKolonisten måste bo på landet i minst 6 månader i hvardera af de 3 första åren.\n\nDå har fullgjort dessa skyldigheter erhåller han efter tredje årets förlopp egendomsbevis för sitt land och kan sedan göra dermed huru han behågar.\n\nCanada Pacific jernvägen innehår sectionerna med udda nummer med en utsträckning af 24 engelska mil på båda sidor om jernvägen. De sälja sitt land på goda vilkor till pris af $2,50 per acre till högre priser. De stora fördelar som Manitoba bjuda nybyggaren hafta också föranledt folk af alla möjliga nationer från alla världens trakter att i de sista åren tillströmma så att redan nu det i närheten af jernvägen belägna landet är bortgivet långt vest om Winnipeg.\n\nKYRKOR OCH SKOLOR.\n\nKyrikan är fri och sjelfständig. Alla religiösa bekännelser äro representerade i Manitoba och Nord Vestern. Kyrkor finnas öfverallt, hvarast befolkningen är nog talrik att kunna uppföra en kyrkobyggnad. I annat fall göra besökande missionärer täta och regelbundna resor. Bland bekännelser representerade i alla delar af Nord Vestern, må nämnas: Episcopal, Methodister, Baptistér, Romersk och Grekisk Katolske, Preßbyterianer, Lutheraner, Missionsvänner och Congregationalister. Regeringen har som nämndt är reserverat 1,280 acres land i hvarje Township, som i samma mån jordförsäljningen fortgår, användes till uppstående af goda skolor.\n\nUpplysningen i Manitoba står mycket högt. De obemedlade klasserna kunna sända sina barn till de fria skolorna, der en utmärkt undervisning meddelas, och vägen till de högre skolorna står öppen för hvar och en.\nSÄDES-, FRUKT- OCH GRÖNSAKSODLING.\n\nAlla sädesslag trifvas godt i Manitoba. Hafre, korn, hvete och majs är de vanligaste sädesslagen. Hvete gifver i Manitoba sedvanligen 25 bushels per acre.\n\nAlla vanliga småfrukter finnas, såsom vinbär, smultron, hallon, krusbär, äpplen, vindruvor o. s. v.\n\nDe vanliga trädgårdsgrönsakerna trifvas även väl. Paradisäpplen och meloner växer i fria luften; spritkål och blomkål uppna ochhöra storlekar.\n\nHumle växer vilt på prärien. Lin trifves väl. Potatis odlas i stor utsträckning och är synnerligen gynnad af klimatet och jordmånen, i det der icke endast uppnås en betydlig skörd, utan den blir även ofantligt stor.\n\nSAMFÄRDSELSN.\n\nAf stor betydelse är naturligtvis för nybyggaren de samfärdsmedel som står honom till buds. Genom byggandet af den Canadiska Pacific jernvägen är nu hela landet öppnat och talrika bibanor är under byggnad eller redan färdiga.\n\nManitoba har jernvägsförbindelse med Atlantiska och Stilla havets och hela Amerikanska fastlandet. Ett tåg som afgår från Halifax eller Quebec vid Atlantiska kusten kan nu köra tvärs igenom Manitoba och Nord Vestra Territoriet genom Britisk Columbia till Stilla havskusten. Även med Förenta Staternas hamnar såsom New-York, Baltimore, Philadelfia, Boston och Portland står Manitoba i förbindelse.\n\nManitoba och Nord Vestern jernvägen som genomska Mani-\ntoba fortsätter genom Nord Vestra Territoriet till Prince Albert i Distriktet Saskatschewan.\n\nEn jernväg som skall förbinda Manitoba med Hudson Bay viken är nu under byggnad. Den blir omkring 750 engelska mil lång, utgår från Winnipeg och kommer att betydligt förminka frakterna på spannmål, kreatur m. m. till England och Europa.\n\nFlere sjöar och floder såsom Manitoba och Winnipeg sjöarne samt Red River, hvilka är segelbara och mycket trafikeras bidraga även till samfärdselsn underlättande.\n\nJAGT OCH FISKE.\n\nJagt och fiske gifva god lön för mödan. De rådande jagtlagarna är enkla och alldeles icke stränga. Rådjur, rävar, harar, uttiar, bärfar, björnar, vargar, elgar, renar m. m. samt morkullor, vaktlar, duvför, änder, rapphöns, tjäder,orre, präriehöns, vildgäss och tranor m. m. jagas. De talrika sjöarne och floderne är rika på fisk af hvarjehanda slag.\nSKOG OCH BRÄNSLE.\n\nSkog växer längs med floderna och i floddalarne etc. De vanligaste trädslagen är ek, ask, gran, poppel, alm, tamarac och Canadisk fur. På prärien måste träd naturligtvis först planteras, dock föröka sig skogarna der betydligt, efterhand som kolonisation tilltager, i det den rika jordmånén förmår de unga plantorna att hastigt tillväxa.\n\nI Nord Vestern finnas rika kolgruvor. En af dem, Galt-gruvan, är nu genom Dunmore—Lethbridge järnvägen satt i förbindelse med Canada Pacific järnvägen och kan derföre skaffa sina produkter ytterst billigt till Winnipeg. Under året har priset på stenkol varit omkring $7 per ton.\n\nWINNIPEG.\n\nManitobas huvudstad, var 1870 endast en liten by med 250 invånare. Nu har den 25,000 invånare, har breda, vackra gator, stora butiker för affärshus, praktfulla privathus och vackra regerings- och järnvägsbyggnader. Staden belyses av elektriskt ljus, spårvagnar genomkorsa den, 20 kyrkor af olika samfund m. m. Winnipeg anses med rätta som stapelstad för Manitoba och Nord Vestern, dertill föranledd af dess läge och de 10 järnvägslinjer, som utmynta i Winnipeg.\n\nAndra städer\n\ni Manitoba såsom Brandon, Portage la Prarie, Emerson, Stonewall, Öst- och Vest-Selkirk m. fl. äro i starkt framåt-skridande.\n\nREGINA.\n\när huvudstaden i Nord-Vestra Territoriet med säte för Guvernören och parlamentet. Derifrån utgår Long Lake järnvägen, som är under byggnad upp till Prince Albert, 200 engelska mil.\n\nDer finnas och andra städer såsom Moosmin, Moose Jaw, Medecine Hat, Calgary m. fl. alla utmed den Canadiska Pacific järnvägen.\n\nRÅD FÖR UTVANDRARE.\n\nEn hvar, som har i sinnet att utvandra till Manitoba eller Nord Vestern, måste föresätta sig att icke sky arbete der och städse gå till det med lif och lust. Dryckesbröder och lättingar skola icke utvandra dit; de gå förr under der än i Europa.\n\nDe bästa utsigter äro der för praktiska jordbrukare och drängar. De ofantliga landsträckorna vanta endast på arbetare för att göra dem fruktbara. Tjenstflickor kunna komma huru många som helst, och städse finna platser med god lön. Vanliga arbetare och handtverkare finna sysselsättning, om de utom\nsina yrken också förstå sig något på jordbruk och alltså kunna taga arbete på farm om de icke strax finna något arbete i sitt vanliga yrke.\n\nExpediter, kontorister och bokhållare kunna icka anbefallas att resa till Manitoba, då den infödda befolkningen har ungt folk tillräckligt för att fylla de lediga platserna. Om de för öfrigt hafta lust och förmåga att åtaka sig farmarbete, hafta de naturligtvis samma utsigter som alla andra. Der finnas icke få farmare i Nord Vestern som före detta arbetat som kontorister.\n\nKolonisten borde om möjligt inrätta sig så, att han är på platsen i slutet av April eller början av Maj, då plöjningen af jorden börjar. Personer, som villja taga arbete på farm, finna då strax sysselsättning. Sommar- och höstmånaderna kunna likaledes anbefallas till invandring. Vintermånaderna börja helst undvikas, emedan det då överallt i Amerika faller sig svårt för den nyanländande att finna lönande arbete.\n\nAlla slags kläder, böcker och värdefulla mindre husgeråd börja medtagas, deremot icke lösebrebo, åkerbruksredskap eller andra tunga föremål.\n\nAlla pengar börja vexlas i Canadiska Dollars hemma, emedan Skandinaviska pengar här endast kunna utbytas med förlust.\n\nPersoner, som medföra större summor, göra bäst uti att hemma köpa en vekel eller kreditiv på bank i Amerika, då det alltid är obehagligt att resa med en stor penningsumma i fickan.\n\nResan till Manitoba, Winnipeg, från Skandinavien räcker ungefär 20 dagar.\n\nFör undvikande af många obehagligheter är bäst att köpa en direkt genomgående biljett till Winnipeg, Manitoba.\n\nSåväl i England, Liverpool och Hull, som i Canada, Quebec, Montreal, Ottawa och Winnipeg m. fl. ställen har Canadiska regeringen tjenstemän anställda, som beredvilligt bistå med råd och upplysningar alla anländande emigranter.\n\nDer finnas äfven skandinaver i Canadiska regeringens tjenst, särskilt tillsatta för att bevaka och tillgodose de skandinaviska kolonisternas intressen.\n\nDe gifva beredvilligt kolonisten alla möjliga upplysningar och i synnerhet är dem behjelpliga med valet af kolonisationsort och jord. Äfven handverkare och vanliga arbetare anvisas sysselsättning och arbete, der sådant finnes.\n\nHittills är följande skandinaviska tjenstemän anstälde i regeringens tjänst för att bistå emigranter med råd och upplysningar i allt som kan ifrågakomma vid kolonisering här i landet:\n\nW. Andersson, Quebec,\nAlfred Åkerlindh, Ottawa, Ontario, samt\nEmanuel Öhlén, Winnipeg, Manitoba.\nARBETSLÖNER.\n\nArbetspriserna hafva under årets lopp varit som här nedan synes:\n\nTimmermän per dag $1,50 — 2,50\nSågarbetare per månad med kost $25,00\nJernvägsarbetare per dag $1,25 — 2,25\nJordbruksarbetare per månad med kost $10,00 — 25,00\nTjensteflickor $8,00 — 20,00\n\nMYNT OCH MÅTT.\n\nMyntet i Canada är Dollars och cents.\n1 Dollar delas i 100 cents och är lika med 3 kronor 75 öre i svenska pengar.\nMan har papperspengar på 1, 2, 4, 5, 10, 20, 50, 100 och 1,000 Dollars, silfverpengar på 5, 10, 25 och 50 cents samt kopparpengar på 1 cent.\n\nMåttet rör spannmål är bushels, hvaraf 1 motsvarar 36 liter (8 kappar) och för flytande varor gallons, hvaraf 1 är ungefär lika med 4 liter (1 ½ kanna). För ved gäller cord, hvaraf 1 är ungefär lika med 1 svensk famn.\n\nLängdmåttet för vägsträckor är engelska mil, hvaraf ungefär något öfver 6 gå på en svensk.\nAndra längdmått är yards, hvaraf 1 är lika med 1 ½ svensk aln och som indelas i 3 engelska fot.\n\nLand måtes i acres hvaraf 1 är lika med fyra femtedels svenskt tunnland. Landet är uppmätt i regelbundna kvadrater, som äro 1 engelsk mil på hvarje sida och kallas en section, denna innehåller 640 acres och indelas återigen i 4 lika stora delar eller quart-sectioner, hvar och en innehållande 160 acres (128 svenska tunnland). För öfrigt hänvisas till förutnämnde figur under rubriken land.\n\nSKANDINAVERNAN.\n\nSkandinavernas antal i Canada belöper sig till ungefärliken 14,000. Af dem komma 4,000 på Manitoba och Nord Vestern.\nDe åtnjuta i allmänhet godt anseende i Amerika och äro ef tersökta arbetare. I fråga om jernvägs- eller skogsarbete hafva de skandinaviske arbetarne äfven stort företräde framför andra nationer.\nRegeringen haf under senare åren äfven vinnlagt sig om att söka få dem att mera allmänt bosätta sig och gått deras önskningar så mycket som möjligt tillmötes.\nDeras framåtskridande hafva också framhållits af den Canadiska pressen och den har flera gångar rekommenderat de Skandinaviska folken som en af de bästa hvarmed landet kunde koloniseras och befolkas.\nFlere af de mera framstående Canadiensarne hafva flere gånger bistått dem till det bästa och i synnerhet ha Skandinaverna af Chefén för Canadiska regeringens Landtbruks Departement i Winnipeg, herr Kapten W. C. B. Graham, rönt många bevis på sann vännaskap.\n\nDe fleste af härvarande Skandinaver är kroppsarbetare och mestadels sysselsatte med jernvägs- skogs- eller annat allmänt arbete. Icke så få är farmare, hvari bland flere innehafva vackra egendomar och är oberoende män.\n\nFlera hafva skaffat sig en oberoende ställning som affärsmän, och några innehafva anställningar vid jernvägarna eller i regeringens tjenst.\n\nTjensteflickor från de Skandinaviska länderna åtnjuta godt anseende och är mycket eftersökta hvarföre och deras löner är bland de högsta som betalas här.\n\nAllt tyder på att det Skandinaviska elementet har stor framtid för sig i Canada genom sin allmänt kända arbetssamhet och idoghet.\n\nNågon sammanslutning af Skandinaverna har ej ästadkomits förr än år 1885 då den första kolonien uppstod, uteslutande befolkad af Skandinaver.\n\nRedan långt förut hade ett fåtal bosatt sig vid Öst Selkirk norr om Winnipeg, vid Oak Lake, Minnedosa samt flerestädse i Manitoba och Nord Vestern påträffar man Skandinaviska nybyggare men icke sammanslutna till uteslutande Skandinaviska kolonier.\n\nKOLONIEN NYA STOCKHOLM\n\nbelägen utmed Canada Pacific jernvägen, 250 engelska mil vest om Winnipeg har hastigt gått framåt. Den är belägen 13 engelska mil (14 sv. mil) från närmaste jernvägsstation, Whitewood. Den består af 3 townships hvaraf ännu ungefär 40 sectionsr stå oupptagna. Landet har ett utmärkt vackert lige på båda sidor om Qu'appelle floden och innesluter 2 ne fiskrika sjöar. Jorden består mestadels af lös svartmylla på ett underlag af blålera eller sand. Skog finnes tillräckligt till byggnadsbehof och bränsle dessutom finnes det godt höland, hvarföre det lämpar sig väl både för jordbruk och boskapsskötsel. En ny präktig väg med bro öfver Quappelle floden har blifvit byggd upp till kolonien. Manitoba Nord Vestern samt Nord Vestern Central jernvägarna komma inom kort att om icke genomskära passera tätt förbi densamma. Godt dricksvatten erhåles på ringa djup.\n\nDer finnes öfverflöd på vildt af alla slag. Skola skall byggas nästa år och åfven kyrka. Kolonisterne hafva gjort stora framsteg och är nöjda med sitt val af land och se framtiden tillmötes med godt hopp. Goda boningshus hafva blifvit uppförda och\nlandet har delvis uppbrutits. Koloniens styresman är herr Nils Johanson, adress: Whitewood N. W. T., Canada.\n\nEfterföljande aftryck af brev utvisar hvad nybyggarna sjelfva säga om sina nya hem.\n\nB R E F.\n\nNew Stockholm den 7 September 1886.\n\nTill Skandinaviska Nationalföreningen i Winnipeg.\n\n—Som det kommit till min kännedom, att Skandinaverne i Winnipeg bildadt en Förening, med ändamål att så mycket som möjligt bistå och arbeta för våra landsmäns erhållande af en obe- roende ställning, och dervid fåstat särskild uppmärksamhet vid landtbruket, så beder jag härmed att för min del få uttrycka min stora tillfredsställelse deröver och önska eder allt förtfa-rande lycka, enighet och visdom i edert ädla verk.\n\nHvad särskilt landtbruket beträffar, så är det min fulla öfvertygelse, att ingen ung man, som har mod och kraft att arbeta bör försumma att i tid förvärvs sig land. Jag som är gammal och utarbetad har likväl börjat att nybygga, och jag taccar min Gud att allt synes gå bra. Som det endast är några månader sedan jag kom hit, så har jag ännu icke kunnat er-hålla någon skörd, men jag har bräckt cirka 8 acres af mitt land och byggt mig ett 20 fot långt och 15 fot bredt bonings-hus, i hvilket jag ämnar flytta in om en veckas tid. Jag har äfven slagit tillräckligt med hör för vintern samt dessutom vid-tagit försigtighetsmätt mot möjliga skogseldar. Landet här är af god beskaffenhet; tillräckligt hö finnes, godt drickesvatten och god tillgång på bränslle.\n\nOnskande alla välkomna som bestämma sig för inflyttning här tecknar\n\nEder ringe vän\nNILS JOHANSON,\nfrån Ströms socken, Jemtland, Sverige.\n\nNew Stockholm den 7 Sept. 1886.\n\nTill Skand. Nationalföreningen i Winnipeg.\n\nUndertecknad vill härmed i all korthet uppmana alla skan-dinaver, som tänka taga land här i Vestra Canada att icke gå förbi oss här i svenska settlementet New Stockholm; ty vi som redan är bosatte här, finna oss mycket belåtna med lan-\ndetta egenskaper. Här finnes icke blott en eller två fördelar, utan kort sagt — alla.\n\nHär finnes alla de i mitt tycke för en jordbrukare vigtiga egenskaper hos landet: god jordmån, höland, tillgång på godt vatten, skog och betesmarker; dessutom många nyttiga bärsorter och vildt.\n\nAktningsfullt\nZ. N. BERGMAN,\nfrån Ströms socken, Jemtland, Sverige.\n\nNew Stockholm den 6 Sept. 1886\n\nTill Skand. Nationalföreningen i Winnipeg.\n\nFör tvänne månader sedan kommo vi hit till New Stockholm för att upptaga land, och utvalde åt oss detsamma i Townships 18, Range, 2, Section 30, vester om 2:dra huvudmeridianen och vi finna oss högst belåtna med vårt val. Här finnes godt höland, betesmarker och flera skogsduningar. De senare ha dock varit svåra att bevara, emedan en skogseld under några dagar farit fram med stor häftighet, men den är nu lyckligt överstånden. Vi hafta gräft en 18 fot djup brunn och påträffat godt vatten. Den jord, som vi uppljöt består av djup svartmylla. Vi hålla nu på att timra upp våra boningshus. Bra timmer finnes att tillgå i närheten af floddalen.\n\nOm några skandinaver önska sig land, så kunna vi rekommendera den svenska kolonien New Stockholm för dess goda läge och många andra förmåner.\n\nHögaktningsfullt\nJohan Olsson och Olaus Olsson\nfrån Åmål, Dalsland, Sverige.\n\nNew Stockholm den 31 Sept. 1886.\n\nTill Skandinaviska Nationalföreningen i Winnipeg.\n\nUndertecknad, som hitkom för en liten tid sedan och öfvertog den nordvästra kvarten af section 20, belägen inom Township 18, Range, 2, vester om 2:dra huvudmeridianen, har uppljöt en del af min mark och funnit jordmån af god beskaffenhet, så kallad svartmylla och tyckes hela mitt land vara af samma beskaffenhet. Riklig tillgång på aspskog finnes. En liten sjö ligger i mitt land omgivna af godt höland och betesmarker. Sjö- och\nqvistfågel finnes i stor mängd, likaså hare hvaröfver jag är mycket glad. En praktisk väg, nyligt reparerad leder upp till vårt nybygge från jernvägsstationen Whitewood vid Canada Pacific banan. Jag har även byggt mig en rymlig ladugård och håller nu på med ett boningshus, hvilket jag hoppas snart få färdigt.\n\nOm några Skandinaver ämnar sig hit till Canada för att egna sig åt jordbruk, så vill jag rekommendera dem att komma hit till New Stockholm, för här ser jag att framtidsutsigterna är goda.\n\nHögaktningssamt\nWILHELM SÖDERBERG\nfrån Över Orans socken, Upsala län, Sverige.\n\nPasqua, N. W. T. den 7 November 1886.\n\nTill Emanuel Öhlén, President af Skandinaviska Nationalföreningen i Winnipeg.\n\nHärmed tager jag mig friheten sända eder några rader för att låta eder veta hvar jag nu är. Det är vid jernvägsstationen Pasqua i Nord-Westra Territoriet, 390 engelska mil vester om Winnipeg och jag har jernvägspreparationsarbete mot en aflöning af $1,25 om dagen. Jag får härmed tacka eder för all den hjelp som jag erhållit från eder allt sedan jag kom hit till landet. Då ni stälde om att jag fick arbete genast, nämligen jernvägsarbete, hvilket hela tiden varit min sysselsättning och har min aflöning vexlat mellan 1½ och 1¼ dollars per dag; vidare får jag tacka för eder hjelp att utse land åt mig. Jag är mycket nöjd med min ¼-section. Jorden består af svartmylla hvaraf ¼ är uppländad med kalk. Vidare finnes der god och riklig löfskog, växt i dungen, hvaremellan finnes godt hör- och äkerland, samt en liten treflig sjö, hvadom ingen vattenbrist behöfver befåras. Nu är jag som man säger i Sverige, riktig bonde, och hade jag ej rest så hade jag icke egt ett öre nu, ty jag tjena de dräng på flera ställen i Sverige; men det blef aldrig något öfver; — nu har jag både land och pengar, och likväl har jag ej varit här i Canada längre än sedan i Juli, och jag önskar att några af mina landsmän måtte komma hit och taga upp land. Jag anser att mindra bemedlade personer som bo i Sverige aldrig kunna göra, bättre än komma hit och taga land. Vår svenska koloni är icke långt afläggen från staden, genom hvilken den stora jernbanan går fram, så att man har ej långt att frakta hvad man behöfver.\n\nHögaktningssamt\nF. E. LINDQVIST\nfrån Elfsborgs län, Kinds härad, Dalstorps pastorat, Nitarps s:n.\nUndertecknade få härmed om Canadas förhållande i allmänhet, af egen erfarenhet, under vår vistelse i och omkring Winnipeg, afgriva följande utläsande:\n\nKlimatet är mycket sundt, luften torr och ren, visserligen stark kold om vintern och mycket varmt om sommaren, men ej skadligt för människans halsa, temperaturen ungefär som i norra Sverige med den skillnad att ingen fuktighet finnes i den nästan alltid klara luften.\n\nFör jordbrukare lämpar sig landet bra emedan, dels, att jorden erhålls fritt, dels, att matjorden på vissa ställen är ½-1-2 fot djup på lerbotten och kan plöjas och besås flera år utan att behöva gödas och ända erhållas goda skörder.\n\nFör kroppsarbetare är landet även passande, alldenstund arbete ständigt finnes att erhålla dels vid nya jernvägsanläggningar dels vid farmar och kan för denna klass sigas, arbeta strängt, få god kost och god betalning.\n\nI följd häraf, är vår övertygelse att nyktra och arbetsamma såväl skandinaver som andra nationer kunna här med ringa kapital skaffa sig god utkomst och erhålla en fri och obeboende ställning.\n\nBalgonie den 13 Nov. 1886.\n\nGUSTAF LÖMAN\nfrån Stockholm.\n\nK. E. ENGELBERG\nfrån Arbrå, Gestrikland.\n\nÖversättning af Manitoba & Nord Vestern jernvägens Land Departement rapport angående kolonien Scandinavia.\n\nWinnipeg den 16 Nov. 1886.\n\nKolonien Scandinavia\n\nPostkontor, Scandinavia.\n\nTownships 17 & 18, Ranges 17 & 18.\n\nDenna koloni, hvilken är den första i hela Canada, hvartill regeringen reserverat land blef stiftad sommaren 1885 och har sedan dess gjort hastiga framsteg för att blifva ett framstående settlement.\n\nDer är nu 68 kolonister af hvilka flera hafva präktiga hus uppförda och land färdigt för nästa års skörd.\n\nCanadiska regeringen anslog, när eldsvåden vid Ottersjön inträffade förriden höst, en summa af $1,200 att användas till\nÅteruppbyggnade av Emigranthus, som hade brunnit, och på annat sätt understödja kolonisterna, som hade förlorat genom elden.\n\nProvinssens regering anslog sistligen år $500 för öppnande av vägen till Ottersjön och detta år hafva ytterligare $350 anslagits till vägens förbättring, på hvilken svenskarne nu arbeta.\n\nKolonien är belägen 12 mil norr om staden Minnedosa utmed Manitoba och Nord Western jernvägen och derifrån leder nu en god väg upp till Ottersjön, en distans af 18 mil.\n\nLandet är väl skogbeväxt och vattnadt och jordmånen är den ypperligaste.\n\nVid Ottersjön har en stad planlagts, som kallas Scandinavia, där är en säg med takspånsfabrik i full verksamhet i byn och en af nybyggarna herr Hemmingsson har bygt ett stort hus 45 fot långt och 30 fot bredt som han begagnar till postkontor och handelsbod.\n\nARBETE.\n\nUnder år 1886 har funnits godt om jernvägs- och farmarbete, samt hafva anländande Skandinaviska emigranter nästan allmänt genast vid deras ankomst erhållit sådant arbete. Äfven kommande år synes blifva godt för arbetare. Ty flera jernvägar och allmänna byggnader är under arbete eller ämna uppföras. För tjänstflickor är alltid platser lediga med ganska goda löner.\n\nSKANDINAVISK FÖRSAMLING.\n\nI Januari månad 1885 bildades den första Kyrkoförsamlingen i Winnipeg. Den började med ett ytterst ringa ledemotsantal men flere hafva under senare tiden slutit sig till densamma. Församlingen inköpte först ett helt litet trähus att användas som kyrka, men det visade sig snart vara alltför litet, hvarför Församlingen beslöte att ändamålsenligare och större skulle uppföras. Arbetet påbörjades genast och den nya kyrkan blef färdig och invigdes i Juni månad 1886. Den är ganska prydlig och rymmer ungefär 200 sittplatser och har en vacker orgel. Kyrkan der den nu står kostar $1,200 lika med 4,700 kronor och är belägen vid No. 18 Catherine Street, Winnipeg.\n\nSöndagsskola hålls der, hvarje söndags eftermiddag och gudstjenst söndagsmorgon och afton samt tisdags och fredagsaftnar.\n\nFörsamlingen står i stor tacksambetsskuld till sin nitiske Ordförande herr M. P. Peterson, som kraftigt bidragit till dess framåtskridande. Herr P. F. Moström har allt sedau dess stif-\ntande varit församlingens predikant, men även andra predikanter hafva som oftast gjort besök och stannat längre eller kortare tid. Församlingen har i ecclesiastikt hänseende anslutit sig till Nord Western Missionsföreningen i Minnesota, som åter tillhör Svenska Missionsförbundet i Förenta Staterna med säte och styrelse i Chicago.\n\nSKANDINAVISKA-FÖRENINGAR.\n\nSkandinaviska Föreningen, vars huvudsakligaste ändamål är inbördes sjukhjelp, stiftades 1884 af herr Emanuel Turner. Den sammanträder på Svea Hotell, Main Street, Winnipeg.\n\nSkandinaviska Nationalföreningen i Winnipeg stiftades den 22 Juli 1886. Dess ändamål är bland annat att bistå anländande landsmän vid arbetes anskaffande, val af land m. m., lempa alla skandinaviska kolonier den hjelp som är möjlig, medverka till skolors bildande och om möjligt en Skandinavisk tidning, nyttiga föredrags hållande samt att bevaka skandinavernas intresse i allmänhet.\n\nFöreningens lokal, som är belägen i hörnet af Alexander & King Streets, Winnipeg är öppen fvarje afton för besökande och alla är välkomna. Svenska, norska, danska och Canadiska tidningar tillhandahålls att läsas fritt på stället.\n\nAlla brev med frågor och svar om land, arbete m. m. torde adresseras till Ordföranden, som pr omgående vill besvara dem.\nSkandinaviska National Föreningens Styrelse.\n\nBeskyddare:\nThe most Hon. Sir JOHN A. McDONALD, K. C. B.\nCanadas Premier Minister etc.\nOttawa, Ontario.\n\nFörste hedersledamot: Kaptenen W. C. B. GRAHAM, Winnipeg.\nHedersledamot: Stadsfullmäktig G. H. Campbell, Winnipeg.\n\nStyrelse:\n\nEMANUEL ÖHLEN, ordförande.\nJ. W. WENDELBÖE, M. P. PETERSON, N. A. WINBERG,\n1:e, 2:e och 3:e vice Ordförande.\n\nG. AXELSON, C. A. EDSTRÖM,\nsekreterare. bitr. sekreterare.\n\nA. G. HAMPEL, JAN ANDERSSON,\nskattmästare. bitr. skattmästare.\n\nBROR ENGGREN,\nbibliotekarie.\n\nR. PETERSON, C. J. CARLSON, K. ENGELBERG,\nmarskalkar.\n\nKorresponderande ledamöter:\n\nALFRED ÅKERLIND, Ottawa, Ontario,\nW. ANDERSON, Quebec,\nO. GRÖNLUND, Halifax, N. S.\nA. J. FREDER, Göteborg, Sverige.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001642.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 31046, "total-output-tokens": 11774, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 231, 3], [231, 231, 4], [231, 879, 5], [879, 879, 6], [879, 2749, 7], [2749, 4928, 8], [4928, 6108, 9], [6108, 8470, 10], [8470, 10682, 11], [10682, 12818, 12], [12818, 15272, 13], [15272, 17301, 14], [17301, 19729, 15], [19729, 21654, 16], [21654, 23462, 17], [23462, 25760, 18], [25760, 27576, 19], [27576, 29764, 20], [29764, 31035, 21], [31035, 31776, 22]], "primary_language": ["None", "en", "sv", "None", "sv", "None", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv", "sv"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]