[{"id": "6c0056d8c5c739fe4949af0cc044c37bffc1e3ba", "text": "RIEL\n\nTRAGÉDIE EN QUATRE ACTES\n\nPAR LE\n\nDr ELZEAR PAQUIN.\n\nTOUS DROITS RÉSERVÉS.\n\nMONTRÉAL\nC. O. BEAUCHENIN & FILS, LIBRAIRES-IMPRIMEURS\n256 et 258, rue Saint-Paul.\nEnregistré conformément à l'Acte du Parlement du Canada, en l'année mil huit cent quatre-vingt-six, par le Dr Elzéar Paquin, au Bureau du Ministre de l'Agriculture à Ottawa.\n\nEntered, according to the Act of Congress, in the year 1886, by Dr. Elzéar Paquin,\nIn the Office of the Librarian of Congress. All rights reserved.\nPERSONNAGES DU 1ER ACTE :\n\nPierre (un canadien), ...............\nEsprit-Voyageur,\nOiseau-Roi,\nLe Jongleur,\nMauvais-Esprit,\nMestnapeco,\nEsprit-Errant,\nAnsuk,\nWapistan,\nOtchimaskueo,\nRiel (le grand Patriote martyr), ......\nScott (le bandit.), ....................\nAmbroise Lépine,\nGoulet,\nParisien,\nPère André (missionnaire.) .......\nDr. Schi tz ..............................\nDenn ..................................\nUn jeune métis ..........................\nLe Président de la Cour Martiale ......\nQuelques soldats armés ...............\nRIEL\n\nACTE IER\n\nMœurs des sauvages, leur conversion au catholicisme. Causes et principaux aperçus du soulèvement de 1869-70, faussement appelé insurrection ou rébellion.\n\n(Au lever du rideau, un tableau représentant bois et prairies ; une douzaine de sauvages assis sur le plancher, les uns paraissant dormir, d'autres fumant, d'autres mangeant, d'autres regardant en haut avec un air indifférent ; trois sauvagesses, dont l'une paraîtra laver, l'autre faire la cuisine, l'autre s'occuper de sa toilette ; un canadien, ami des sauvages, faisant semblant d'entrer.)\n\nSCENE I:\n\nOISEAU-ROI, ESPRIT-VOYAGEUR, LE JONGLEUR, PIERRE, WAPISTAN (marle), ANSUK (loutre), OTCHIMASKUEO (reine).\n\nPIERRE (faisant semblant d'entrer).—Tiens ! Vous v'la encore après faire les paresseux !... et vos femmes... elles travaillent tant qu'elles peuvent, font tout l'ouvrage ! Eh !... mon Dieu, c'est ben toujours vous autres.\nOISEAU-ROI.—Ben Pierre ! As-tu des nouvelles aujourd'hui ?\nPIERRE.—Oui !... une bonne...\nOISEAU-ROI.—Quoi donc ?\nPIERRE.—Eh ben ! une chose que vous ne savez pas, c'est que là-bas on dit que vous êtes des rangés-bon-tmps.\nOISEAU-ROI.—N'importe que ça les dérange !... nous, ça fait notre affaire, ça nous arrange. Et pis ça l'arrange-ti, ça Pierre :\nPIERRE.—Il faut ben... d'ailleurs vous savez ben que je suis votre ami, et que je suis content quand vous l'êtes tous ensemble, comme à cette heure. Ecoutez !... j'ai une autre nouvelle.\nOISEAU-ROI.—Eh ben !\nPIERRE.—C'est une grande peur que j'ai eue, ce matin, lorsque je passais à la tête du grand rapide, là-bas.\nOISEAU-ROI.—Oui ! c'est du nouveau... nous avons jamais peur. Mais qu'est-ce qui t'a fait peur ?\nPIERRE.—J'ai vu toutes ces provisions que vous avez laissées là-bas, et je me suis dit : pourquoi ont-ils laissé cela là ? ben certain que ça va être volé ! et j'ai eu peur qu'en effet ce malheur vous arrive, et j'ai encore peur.\nOISEAU-ROI.—Ah ben, par exemple, tais-toi, Pierre... Vraiment tu ne connais pas une chose.\nPIERRE.—Quoi ce que c'est ?\nOISEAU-ROI.—Sais-tu pourquoi nous pas avoir de troubles là-dessus ?\nPIERRE.—C'est ce que je veux savoir.\nOISEAU-ROI.—Eh ben ! dans cette place-là, il ne passe que des sauvages, jamais on n'y voit\nde blancs, excepté toi qui nous as toujours paru bon garçon.\n\nPIERRE.—Beau compliment pour les blancs !\n\nOISEAU-ROI.—En effet, ce sont eux qui nous volent et qui font toutes sortes de mauvaises choses que nous ne connaissons pas.\n\nPIERRE.—T'as ben raison, Oiseau-Roi.\n\nWAPITAN (pendant le dialogue précédent, elle aura été occupée à laver. Elle court vers Mauvais Esprit, qui fume).—Hé !... Mauvais-Esprit, (Elle le pousse, et il continue à fumer comme si rien n'était), viens donc aider à moi à retordre ce linge-là, moi être ben fatiguée, moi n'en peut plus. (Les regardant tous) vous êtes ben chanceux, vivre comme ça.\n\nMAUVAIS-ESPRIT.—Wapistan, viens pas me tanner, hen !... (Il continue à fumer.)\n\nANSUK (faisant sa toilette).—Otchimaskueo, as-tu quelque chose à donner à moi pour manger ?... j'ai faim !\n\nOTCHIMASKUEO.—Ansuk, si t'as tant faim pourquoi ne te mets-tu pas en train de m'aider, (Elle aperçoit des gibiers venir, elle saute vers Esprit-Voyageur, qui fait le dormeur, et elle le pousse.) Eh ! Esprit-Voyageur... de gros oiseaux viennent de là-bas !... vite ton fusil !... vite les tirer. Dépêche-toi donc, paresseux,... oh ! qu'on va faire quelle chose de bon à manger !\n\nESPRIT-Voyageur (faisant semblant de se réveiller).—Laisse-les donc aller... on vain de bien manger là !... On a ti encore pour demain ? Si alors pas assez, eh ben ! nous irons à la chasse... C'est bon dormir hen !... (Il fait encore semblant de dormir.)\nPIERRE.—Ah ! Ah ! Ah !... mais c'est-ti vrai que vous laissez tous passer cette chance-là ?\n\nOISEAU-ROI.—Cela ne fait rien !... Dans les temps durs, on est ben accoutumé à la misère. Les blancs qu'Ottawaouis envoient ici sont loin, allez, de nous donner le strict nécessaire.\n\nPIERRE.—Ils doivent vous nourrir comme il faut.\n\nOISEAU-ROI.—Au contraire, c'est du bœuf pourri, du pain noir et mouzi qu'ils nous donnent pour que nous ne crevions pas de faim.\n\nESPRIT-VOYAGEUR (se réveillant).—C'est pas encore toute !... nous trouvons qu'il est ben dur d'avoir du tabac.\n\nMAUVAIS-ESPRIT.—Et pis !... comme c'est difficile aussi d'avoir l'eau de feu !... hou... le whisky.\n\nESPRIT-VOYAGEUR.—Oh ! toi, pas parler à moi de bouisky,... moi avoir la gorge sèche !... c'est si bon !\n\nLE JONGLEUR (il se frappe le bras, il dit qu'il appelle le Matshimanitou (le mauvais-esprit); il produit un certain son avec sa bouche et affirme que Matshimanitou lui apparaît.)\n\nTOUS LES AUTRES SAUVAGES (remplis de frayeur).—Qu'il nous tue pas ! Oh ! qu'il nous tue pas ! prenez garde !\n\nLE JONGLEUR (paraissant mystérieux).—Wapistan, croyez-moi, Matshimanitou me dit de vous dire que vous devriez aller chercher dans le lac, là-bas, un peu d'eau et en boire, pour vous guérir, si demain vous êtes malade à cause de la dure journée que vous faites aujourd'hui. Matshimanitou me dit de vous dire, à tous vous autres, qu'il va arriver un malheur à notre chef et que les blancs vont nous causer ben des misères.\nPIERRE (se tournant comme pour parler à l'auditoire seul).—Mon Dieu ! qu'ils sont bêtes ! ils croient tout ça ; et quand ça s'adonne ils croient ces folies encore ben plus fort ! (Il sort.)\n\nSCENE II.\n\nLES MÊMES, à part Pierre.\n\n(Le chef, Mestnapeo entre habillé comme le sont les chefs des tribus sauvages.)\n\nMESTNAPEO (grand homme).—Mes braves,... remercions le grand Manitou pour m'avoir préservé d'un grand malheur. Je suis content de me trouver encore au milieu de vous. Vos enfants que vous aimez, j'espère qu'ils n'ont pas souffert de la faim !\n\nOISEAU-ROI.—On s'est pas forcé, mais ça ben été. Quel malheur donc vous a poursuivi, chef ?\n\nEh bien ! Une branche bien grosse d'un arbre a tombé à deux pouces de moi, pendant que je m'avançais tranquillement sur ma route.\n\nLE JONGLEUR.—Je vous l'avais ben dit.\n\nOISEAU-ROI.—Vive le Manitou, parceque vous êtes encore vivant.\n\nMESTNAPEO.—J'ai une chose agréable à vous annoncer, maintenant.\n\nOISEAU-ROI.—Est-ce vrai ?\n\nMESTNAPEO.—Vous savez que les officiers en habit rouge n'ont pas la permission de nous vendre ou de nous donner des boissons fortes...\n\nESPRIT-VOYAGEUR.—Quoi, on va avoir du bouisky !...\n\nMESTNAPEO.—Ecoutez !... En échange de tous ces terrains riches, là-bas, où nous étions la\nsemaine dernière, j'ai reçu d'un officier du gouvernement canadien une bonne quantité de lard, de farine et plusieurs gallons de whisky.\n\nESPRIT-VOYAGEUR.—Vive notre chef Mestnapeco!... Brovo!... vive le bouisky! pas besoin d'autres choses.\n\nMESTNAPECO.—Mes amis, puisque nous l'avons, cette eau de feu, nous allons tous en boire et nous réjouir. Mais je viens d'ouvrir les yeux sur des jours sombres qui approchent! ce sont des jours d'afflictions!...\n\nESPRIT-VOYAGEUR.—Ah!... n'importe... vite le bouisky!... moi peut plus avaler tant j'ai la gorge sèche.\n\nMESTNAPECO.—Je viens de comprendre que ces officiers envoyés du Canada sont des malfaiteurs; ils sont ici pour notre ruine, et nous, pour le plaisir de boire du whisky, nous allons mettre des bornes à notre liberté. Avant longtemps nous serons refoulés dans le fond des forêts, bientôt les métis fuiront poursuivis par toutes sortes de fléaux; plusieurs d'entre eux mourront sous le couteau de tous ces gens qui parlent l'anglais. J'ai appris avec bonheur que le brave Riel a déjà jeté un cri d'alarme, dont les échos retentissent jusque dans les profondeurs de nos bois. Avant d'aller nous amuser, prions le Manitou, pour qu'il nous conserve Riel (alors lamentations, toutes sortes de mouvements, de contorsions, etc.\n\nSCENE III.\n\nLES MÊMES ET LE PÈRE ANDRÉ.\n\n(Il apparaitra en avant du théâtre, aussitôt que les sauvages précédents commenceront à se lamenter, les\nregardera faire à peu près une minute et se tournera du côté de l'audience.\n\nPÈRE ANDRÉ.—Quel pitié de voir de nos semblables plongés dans ces ténèbres d'ignorance et d'idolâtrie ! Eux créés et mis au monde, comme nous, pour connaître Dieu, l'aimer et le servir !... J'ai, mon Dieu, et par le secours de notre grâce, j'ouvrirai à la lumière les yeux de ces pauvres infidèles. Seigneur, que votre règne arrive, que votre volonté soit faite sur la terre comme au ciel, délivrez-nous du mal et attirez-nous tous vers vous ! (Se laisse voir par le chef qui le reçoit poliment).\n\nMESTNAPEO.—Vous devez être l'homme de bien dont on me parle souvent.\n\nPÈRE ANDRÉ.—Je suis le Père André, et je suis très heureux de vous connaître.\n\nMESTNAPEO.—Soyez avec nous, acceptez cette pipe et fumons le calumet de la paix. (Alors les sauvages en rond autour du missionnaire et du chef, et assis à terre.)\n\nPÈRE ANDRÉ (prend le calumet et fume une touche).—Je trouve votre tabac bien bon (puis il passe la pipe au chef qui tire une touche et donne ensuite le calumet aux sauvages qui tous fument chacun son tour).—Permettez-moi de vous dire, braves amis : que sur cette terre nous ne pouvons rien trouver qui puisse nous rassasier complètement. Il faut à notre cœur quelque chose qui s'appelle l'Infini : cet être infini, c'est Dieu, le créateur du ciel et de la terre. C'est lui qui nous a donné la vie, nous permet de respirer à chaque instant ; nous donne notre pain quotidien, nous oblige à nous aimer les uns et les autres, nous défend de faire du mal à notre prochain ; c'est\nlui qui nous enseigne comment le connaître et le servir pour avoir le bonheur de le voir, toute l’éternité, après notre mort.\n\n*MESTNAPEO.*—Où est-il ce grand Esprit-là ?\n\n*PÈRE ANDRÉ.*—Il est partout et remplit le ciel et la terre !\n\n*MESTNAPEO.*—Nous avons notre Manitou pour notre maître.\n\n*PÈRE ANDRÉ.*—Chef, ce manitou n’est pas le Maître absolu, que vous devez adorer. C’est le démon, le chef de tous ceux qui se sont révoltés, dans le ciel, et que le Tout-Puissant a précipités dans les flammes de l’enfer. Ce sont tous ces mauvais esprits qui, pour se venger, font tomber, depuis le commencement du monde, tant de malheureux égarés dans les profondeurs brûlantes des abîmes éternels. Ce sont eux qui vous tiennent dans l’erreur et vous font marcher dans le chemin aboutissant à ce gouffre épouvantable où ils brûlent toujours avec ceux qu’ils ont perdus, toujours avec ceux qu’ils entraînent encore à leur suite; où ils brûleront toujours avec ceux qu’ils égareront dans l’avenir.\n\nMais le bon Dieu nous a envoyé Jésus-Christ, son fils, pour nous éclairer, pour nous mettre en état d’éviter tous les pièges que les damnés nous dressent à chaque instant ; il nous a envoyé ce Sauveur pour nous fournir tous les moyens de nous sauver, si nous voulons en profiter. Comme un des envoyés de ce Sauveur plein de miséricorde, je viens aujourd’hui vous apporter la nouvelle de votre rédemption.\n\n*MESTNAPEO.*—C’est bien, oh homme de bien ! . . . Il vient ici d’autres gens que ceux qui sont en robe noire. Ils nous enseignent leur religion,\nqui nous paraît sans vie, qui nous a l'air d'un corps sans âme, qui ne nous touche pas du tout. Mais, vous autres, vous nous mettez comme sur un ressort qui nous enlève là-haut vers ce grand Maître dont vous nous parlez. Vive votre Dieu ! Nous voulons vous écouter et vous suivre. Que votre Dieu éloigne de notre tribu tous les maux qui la menacent ! Maintenant qu'allez-vous faire de nous ?\n\nPÈRE ANDRÉ.—Je vais vous préparer à recevoir le baptême qui vous fera naître à la vie des enfants de Dieu. Alors vous ne vous sentirez plus les mêmes.\n\nESPRIT-VOYAGEUR.—Mais avant, on va aller boire notre bouisky !\n\nPÈRE ANDRÉ.—Ecoutez-moi ; repoussez cet ennemi-là. Suivez-moi, et vous allez devenir plus forts, pour lutter contre le mal !... notre religion fait des hommes et des saints.\n\nESPRIT-VOYAGEUR.—Je me meurs, chef, je ne peux plus souffler, je veux du bouisky. Où est-il ? Est-il en cruche ? S'il est dans des barils, allons les voir, puis on mettra ce bon bouisky dans chacune de nos cruches,... la mienne est prête ; (montrant sa bouche) il n'y a rien dedans ; ensuite je me ferai baptiser ! N'est-ce pas, la robe noire ?... secourez-moi.\n\nPÈRE ANDRÉ.—Sans la mortification, on ne peut être aimé du bon Dieu. Allons, Esprit-Voyageur, buvez de l'eau, et ne buvez jamais cette eau de feu, car vous en mourrez.\n\n(Ils sortent tous, à la suite du chef et du missionnaire, excepté Esprit-Voyageur.)\nSCENE IV.\n\nESPRIT-VOYAGEUR seul.\n\n(Il marche, se retire en arrière, fait semblant de ne pas être vu des autres qui sortent).—Je l'aime bien, cette robe noire-là !... c'est un si bon homme,... il a l'air si respectable !... je pense bien qu'il dit la vérité ; ça sent bon dans tous les cas, tout ce qu'il dit ; mais j'ai cette odeur de bouisky dans le nez, qui fait affreusement souffrir mon gosier. Ah !... je vais me rendre aux barils, qui ne sont pas loin, et, pas si bête, je vais prendre une ribote, qui s'appelle... (Il s'arrête tout à coup en apercevant Goulet et Parisien qui entrent.)\n\nSCENE V.\n\nESPRIT-VOYAGEUR, GOULET, PARISIEN.\n\nGoulet (en entrant).—Allons ! Allons, voilà bien Esprit-Voyageur. On le voit partout, ce gaillard-là.\n\nEsprit-Voyageur.—Eh oui !... jusque dans les barils de whisky.\n\nGoulet.—C'est une bien bonne liqueur, pour en tuer plusieurs. Nous ne sommes pas en train de badiner, pour le moment.\n\nEsprit-Voyageur.—Non !... vous verrez tout à l'heure que je vous mettrai bien en train.\n\nGoulet.—Ca dépendra... Ecoute, Parisien, parlons sérieusement. Si tous ces étrangers.\npleins de haine contre nous, ne s'introduisaient pas au milieu de nos frères métis, combien nous serions heureux dans notre immense pays !\n\nPARISIEN.—C'est bien vrai ! Que de plaisirs nous donnent nos belles forêts remplies de tant de sortes d'oiseaux et d'animaux !\n\nGOULET.—Oui, tous ces animaux à fourrures, comme la loutre, le castor, l'hermine, la marte, nous permettent de réaliser des revenus qui nous aident à faire face aux misères de la vie.\n\nPARISIEN.—Toutes ces verdoyantes prairies où opèrent encore des buffles, où nous respirons un air si pur, et où nous avons tant de liberté ; tous nos saints missionnaires avec leurs crucifix, leurs églises, leurs autels, leurs chants, leurs touchantes cérémonies religieuses, combien toutes ces choses nous font trouver la vie douce et agréable ! Sans compter tout cela, il nous est permis de choisir les terres que nous voulons cultiver. N'est-ce pas vrai que nous sommes à même d'avoir toutes sortes de satisfactions ?\n\nGOULET.—Je l'avoue bien, et nous devons en remercier la divine Providence. Mais lorsque je vois tous ces étrangers profaner nos prairies vierges, dont ils ont l'audace de se considérer comme les maîtres ; lorsque je regarde ces immigrants du Haut-Canada qui se croient plus intelligents et plus forts que nous et qui n'hésitent pas de nous maltraiter de la façon la plus révoltante, je ne peux m'empêcher de penser que nous ne serons pas longtemps heureux.\n\nPARISIEN.—Goulet, il n'y a pas à se dissimuler. Ces gens-là se conduisent si mal par rapport à nous, ils affichent une arrogance si opposée à la paisible possession de nos propriétés,\nque fatalement nous achevons les beaux jours de notre existence.\n\nESPRIT-VOYAGEUR. — C'est bon pour vous autres !... Vous nous macanez trop des fois, vous ne tenez pas assez à ce que nous restions avec vous autres.\n\nGOULET.—Allons, Esprit-Voyageur, tu es réellement parti sur le train de radoter aujourd'hui. Pourquoi êtes-vous tous ensemble si paresseux ? Vous ne voulez que la chasse ; et, encore, quand vous avez de quoi vous nourrir pour une journée, vous ne pensez pas au lendemain. Vous êtes trop fainéants pour vivre avec nous autres. Lorsque vous avez sous vos pieds un sol si riche, pourquoi n'en prenez-vous pas, comme nous, une certaine étendue pour y travailler et vous faire un bon petit chez-vous ? C'est ainsi que font les hommes de cœur. Vous ne cherchez que les bois et vous ne vous y plaisez qu'à dormir à l'ombre des arbres. C'est bien ! allez et restez-y ! Nous écoutons nos missionnaires. Nous nous faisons baptiser d'abord, nous tâchons ensuite de cultiver et d'améliorer les terres que nous nous choisissons. C'est ainsi que nous formons des paroisses, des villages, des villes, dominés par le clocher de nos temples ; oui, c'est ainsi que nous nous agrandissons et que nous nous mettons au rang des nations civilisées.\n\nESPRIT-VOYAGEUR.—Vous parlez ben pour un métis... Mais, avant que les blancs nous chassent tous, je me rendrai auprès des barils qui sont là-bas, et soyez sûrs que je les viderai avant de partir.\n\nGOULET.—Continue encore sur le ton de plai-\nsanter, si tu veux, Esprit-Voyageur. Mais saches que tous nos persécuteurs ne nous feront pas comme cela désertier nos foyers et abandonner notre patrie pour la défense desquels nous avons encore assez de cœur. De plus, n'avons-nous pas des frères instruits qui sauront anéantir tous les mauvais plans de tous ces étrangers venus de la province d'Ontario. Il ne faut pas oublier le brave Riel qui saura imposer le respect de nos propriétés à tous ces brigands, dont les actions paraissent avoir la plus grande perversité. Ce chevaleresque compatriote n'est pas un homme de paille. Il sera avant longtemps le chef des métis de la Rivière-Rouge! Lui, prendra en main la cause du droit et de la justice! Lui nous défendra! Tous ces méchants-là s'en iront bien, je vous en assure.\n\nESPRIT-VOYAGEUR.—Arrangez-vous, comme vous voudrez. Moi, essayer à prendre un bon coup, s'il y a moyen, puis ensuite aller à la chasse, et après dormir. (Il sort.)\n\nSCENE VI.\n\nGoulet, Parisien, Riel et Ambroise Lépine.\n\nRIEL.—Vous voilà, mes bons amis! D'où venez-vous donc? Êtes-vous bien avancés dans les travaux de vos champs.\n\nGOULET.—Nos travaux vont bien jusqu'aujourd'hui. Mais, écoutez, Riel, le découragement semble s'emparer de presque toute la colonie les métis français. Il faut que vous les rassuriez. Vous êtes notre homme. Depuis plusieurs\nannées, ils ont bien vu, comme nous, le petit groupe d'émigrants d'Ontario se conduire bien mal à l'égard de la compagnie de la Baie d'Hudson et des métis canadiens-français. Il n'y a pas longtemps, plein d'indignation, vous nous avez fait voir la haine implacable que ce groupe d'émigrés anglais portent contre nos lois, nos mœurs, notre croyance et nos zélés missionnaires. Ces beaux messieurs, nous disiez-vous, arrivent ici comme chez eux, ne voulant pas tenir compte de la compagnie de la Baie d'Hudson parce qu'elle ne leur convient pas, et se montrant incapables de nous endurer parce que nous sommes catholiques et de sang français. Le North-Western nous en fournit bien la preuve : ce journal, lu et supporté par toutes ces têtes chaudes-là, et dans lequel écrit le fanatique Dr. Schultz, débite toutes sortes d'insultes contre les métis, nos frères, contre nous tous. Cela n'a pas empêché que tous nos compatriotes les ont endurés avec la plus grande patience jusqu'aujourd'hui !\n\nRIEL.—C'est ainsi qu'il faut faire, parce que nous sommes de véritables chrétiens. C'est le creuset de la souffrance qui nous rend bons, justes et réellement grands.\n\nGOULET.—C'est vrai, Riel. Mais ce qui nous fait craindre plus que jamais, c'est de voir comme ce parti d'arpenteurs fait cause commune avec ce Schultz et tous ses amis. J'entends partout dire que tous ces habits rouges d'Ontario, de concert avec tous ceux qui nous haïssent, se proposent de diriger contre nous les plus effrayantes persécutions. Nos frères les métis sentent le besoin de s'organiser et de se mettre en état de\ndéfense; et ils se découragent en voyant que personne ne se montre en avant, pourtant il n'y a pas de doute qu'unis comme un seul homme, nous pouvons chasser du bout du pied tous ces intrus dont la mine et la manière d'agir sont si choquantes et si insupportables.\n\nRIEL.—Goulet, j'ai découvert le dessein pervers que nourrissent, depuis un certain nombre d'années, tous ces émigrants et tous ces arpenteurs d'Ontario. Tous, ils ont la même idée, les mêmes intentions; tous, ils veulent nous exterminer ou nous chasser de nos maisons. Ces étrangers sont des envahisseurs pleins d'hypocrisie et d'audace. Au nom d'un gouvernement sans droit sur notre pays, ils se constituent en autorité contre nos privilèges, notre liberté, l'ordre établi qui nous garantit ce que nous avons de plus cher. Oui, je le répète, avec cette prétendue autorité, ils veulent se faire les spoliateurs de nos biens, les démolisseurs de nos autels et les exterminateurs de notre race. Voilà les projets sataniques que tous ces ambitieux criminels commencent déjà à mettre à exécution.\n\nGoulet.—Ce serait affreusement pénible, si après avoir tant forcé, tant sué pour défricher et améliorer nos terres, tous ces nouveaux-venus avaient la prétention de nous les enlever au nom d'un gouvernement voleur.\n\nRIEL.—Goulet, n'êtes-vous pas plus brave que cela? Que nos paisibles compatriotes ne se laissent pas abandonner au découragement, parce que ces belles provinces souriraient à l'envie, à la jalouse, à l'ambition, à la canaille. Quand bien même nos magnifiques prairies et nos riches\nforêts auraient pour les méchants des charmes irrésistibles, cela ne veut pas dire qu'ils n'auraient qu'à tendre la main pour les avoir. Ne sommes-nous pas capables de leur faire l'offensive ?\n\nLÉPINE (AMBROISE).—Vous avez raison, Riel ! Vous nous faites la lumière devant ces noirs complots que tous ces canadiens anglais trament dans l'ombre pour nous faire disparaître. Déjà leurs conspirations diaboliques pèsent sur nous d'une manière à nous causer bien des déboires et bien des appréhensions. Au milieu des actes les plus révoltants, ils ne se gênent pas de dire qu'avant longtemps, ils vont rosser et balayer tous les colons catholiques et d'origine française.\n\nRIEL.—Oui ! mais encore une fois, nous ne les laisserons pas faire sans leur offrir la résistance d'un sang français. Autrement ces anglais et ces orangistes sans foi ni principes, entraînés par l'appât des richesses naturelles de notre sol, des ressources immenses que renferme notre pays au point de vue industriel et commercial, et sous l'impulsion de la haine des sectes contre la religion catholique, chercheraient à nous anéantir ou à nous reculer de plus en plus dans les forêts jusqu'à ce que nous périssons de froid, de toutes sortes de privations, ou jusqu'à ce que nous nous en allions nous noyer sur les bords de la mer Glaciale ou du Pacifique. Car plus le diable en a, plus il veut en avoir. Nous ne pourrions jamais trouver de places, d'endroits, de cantons qu'ils ne convoiteraient pas et ne chercheraient pas à avoir par les moyens les plus malhonnêtes et les plus honteux !... Voilà le doux rêve de tous ces rapaces dangereux comme\ndes vampires, qui se sont échappés de la province d'Ontario ! J'ai sondé toute la profondeur des projets les plus iniques et les plus exécrables, qu'ils entretiennent dans leurs esprits, comme des scélérats. J'ai vu qu'ils sont soudoyés par un gouvernement dominé par la secte orangiste, et qu'ils servent d'instruments à tous les spéculateurs, à tous les contracteurs fanatiques d'Ontario et d'ailleurs, qui voudraient arriver à la réalisation des spoliations les plus infames, et créer ainsi une terre anglaise, une autre province d'Ontario par sa langue, sa croyance et ses institutions. Il n'y a que des anglais orangistes pour commettre de telles abominations en plein dix-neuvième siècle !\n\nLÉPINE.—Oui ! les pires hommes que l'on puisse rencontrer sur la terre ! Avec eux il faut maudire le Christ et marcher dans le sang de nos frères ! secte fanatique ! secte sanguinaire ! secte francophobe surtout !\n\nRIEL.—Mes chers amis, il importe avant tout de relever le courage de nos compatriotes. Accomplissons des actes d'héroïsme pour leur montrer que nous pourrons toujours neutraliser les intentions criminelles que tous ces aventuriers d'Ontario nourrissent contre nos brillantes destinées. De plus, allons de suite nous rendre compte de toutes les opérations des arpenteurs du gouvernement canadien et réduisons à néant toutes leurs iniques prétentions. (Ils sortent tous.)\n\nSCÈNE VII.\n\n(Pendant que les personnages précédents sortent par un côté, on enlève le tableau antérieur pour un autre plus au fond du théâtre et qui présente une forêt. En même\ntemps, des sauvages au nombre d'une douzaine et quelques sauvagesses entrent en criant, chantant, dansant, etc.)\n\nESPRIT-VOYAGEUR.—Nous sommes des hommes nous autres! Oui!.. nous sommes des hommes (se frappant la poitrine), nous ne sommes pas des poltrons, nous n'avons pas peur d'aller en guerre. (Alors on se met à danser autour d'un feu, et Espt. Voy. chante : Napewinam nilan, nilan napewinam. (Tous ensemble) : Napewinam nilan, nilan napewinam (bis). (Ensuite, les sauvagesses chantent : Eskeuwinam nilan, nilan Eskeuwinam (bis). Enfin ils sortent tous tambour battant, excepté Esprit-Voyageur.\n\nSCENE VIII.\n\nESPRIT-VOYAGEUR \"seul\".\n\n(Pendant que les précédents sortent, il fait semblant d'entendre venir et de voir des officiers en habit rouge, et se tourne du côté de l'auditoire) : Oh!.. la curiosité m'emporte... il faut que je sache ce qu'ils viennent faire ici et ce qu'ils vont dire. (Il se cache sur un des côtés du théâtre.)\n\nDu. SCHULTZ. (entre seul, il marche, fâché).—Je ne peux plus contenir mon indignation! Ah les gueux de métis français!.. Ah!.. mon serpent de Riel... Comment l.. ils viennent de former un gouvernement provisoire!... Ah! ce maudit Riel va nous donner du fil à retordre... je le vois bien... car il paraît que son gouvernement est approuvé par le gouverneur McTavish, reconnu par Lord Granville du parlement\nimpérial, et que les autorités canadiennes, ayant reçu l'ordre d'Angleterre de traiter avec lui, vont être obligées de le considérer comme légitime. Ah ! ça va mal (il marche vite). Pourtant ce damné de Riel et les siens n'auront pas le dessus.\n\nSCENE IX.\n\nLES DEUX PRÉCÉDENTS \"Dennis entre\".\n\nDENNIS.—Allons, allons, docteur!... vous êtes bien de mauvaise humeur! qu'avez-vous donc sur les nerfs?\n\nDR. SCHULTZ.—Riel, tonnerre!\n\nDENNIS.—Riel contre nous! oubliez-vous que nous sommes la race supérieure?\n\nDR. SCHULTZ.—Si incontestablement, qu'il importe d'avoir recours aux moyens les plus extrêmes pour éloigner de nous toutes ces bandes d'indiens et tous ces métis catholiques et de race française, qui ne sont que des lâches et des ignorants! Que nous reste-t-il à faire pour nous rendre maîtres enfin de tout le Nord-Ouest? Vous connaissez les événements du jour?\n\nDENNIS.—Je sais que tous les métis sont très excités, depuis que la compagnie de la Baie d'Hudson a transféré tout le Nord-Ouest à la Puissance du Canada. Ils disent qu'ils ont été vendus et achetés comme du bétail, et sont en fureur. De plus, sur l'avis et le consentement du gouverneur McTavish, Riel a organisé un gouvernement temporaire, dont tous les membres ont été élus à l'unanimité par une convention de 40 députés, 20 d'origine anglaise, 20 de sang français.\nDr. SCHULTZ.—Et Riel en est le président !!\nDENNIS.—C'est le cas, mais cela ne fait rien à l'affaire.\n\nDr. SCHULTZ.—Je ne peux m'expliquer comment il se fait qu'un catholique comme lui occupe une telle place dans un gouvernement quelconque. Ce qui me choque souverainement c'est de voir que la plupart des membres de ce nouveau gouvernement sont des métis anglais.\n\nDENNIS.—Eh bien ! pas de mal à cela !\n\nDr. SCHULTZ.—Et ce document qu'ils appellent liste de leurs Droits et qu'ils viennent d'envoyer à Ottawa, qu'en dites-vous ?\n\nDENNIS.—Ce n'est toujours pas le canon Gatling !\n\nDr. SCHULTZ.—Non ; mais écoutez !.. Dans ce document ils ont eu bien soin d'exposer clairement tous les droits de la nation métisse et les conditions de l'entrée de cette province dans la Confédération canadienne. De plus, ils se proposent d'envoyer des délégués à Ottawa pour s'entendre amicalement de part et d'autre, par rapport à ces droits et conditions dont la garantie seule les fera consentir à l'annexion de ce pays à la Confédération. Le gouvernement fédéral pourrait avoir la faiblesses d'accéder à leurs demandes et faire justice à leurs réclamations. Ils soutiennent que la transaction faite entre la compagnie de la Baie d'Hudson et le gouvernement canadien est une insulte à leur nationalité, est une violation du droit des gens, et qu'elle ne les oblige pas à se livrer comme un lot d'animaux vivants. Ils affirment qu'ils sont un peuple sur lequel tombent les rayons du soleil de la civilisation. Ils proclament que le gouvernement\nd'Ottawa n'a pas plus de droit sur eux que le roi de Chine.\n\nDennis.—Tout cela ne m'effraie pas.\n\nDr. Schultz.—Pourtant qu'en serait-il de notre parti, si le Cabinet d'Ottawa écoutait leurs prétentions ? Qu'en serait-il de la proclamation du gouverneur McDougall et de la commission incendiaire dont il nous a chargés ? Il me semble que nous reculerions beaucoup au lieu d'avancer. C'est cette perspective qui m'irrite et me met hors de moi-même.\n\nDennis.—Docteur, est-ce que réellement votre bravoure s'évanouirait ainsi devant une poignée de métis insurgés et absolument incapables d'enrainer les ministres d'Ottawa dans les faiblesses que vous appréhendez ? Vous faites-vous ainsi illusion sur les dispositions du gouvernement et la Puissance ? N'avez-vous pas assez de preuve que, comme nous, il veut l'extinction de la race canadienne dans le Nord-Ouest et l'accaparement de tout cet immense territoire ? Perdez-vous de vue que nos amis, les orangistes, tiennent le pouvoir à Ottawa ? Dans le fait qu'il nousvoie le gouverneur McDougall, ne constatez-vous pas la preuve consolante que nous sommes déjà les vainqueurs et les maîtres sur les bords de la Rivière-Rouge et partout dans ces vastes régions pleines de fécondité ? Maintenant que nous sommes ici les représentants de l'autorité, et nous sommes chargés de mettre tout à feu et à sang là où nous rencontrerons des rebelles, avons-nous à craindre ? Depuis plusieurs années à venir jusqu'aujourd'hui, nous avons eu grandes difficultés à surmonter, nous avons de sérieux problèmes à résoudre, et néan-\nmoins n'avons-nous pas réussi ? Tous ces métis, la honte de la civilisation, ont bien été obligés de subir toutes les paroles dures que vous leur avez adressées par la voie de votre journal. Considérant que le Nord-Ouest serait mieux exploité par la race anglaise, Thomas Spence a organisé, l'année dernière, un gouvernement provisoire et arboré le drapeau de la république. N'est-ce pas un magnifique coup d'État ? Former un gouvernement démocratique au défi du gouvernement légitime du Nord-Ouest, et en contravention à l'allégeance due à la Reine d'Angleterre ? M. Walter Robert Bowan, qui vous a succédé dans la rédaction du North-Wester, ne continue-t-il pas à adresser aux métis français catholiques des choses qui ne sont pas des compliments ? N'avons-nous pas réussi à arpenter des terrains dont les métis se considèrent les propriétaires ? Vous, Dr. Schultz, ne vous êtes-vous pas emparé, avec M. Snow, chacun un mille carré des meilleures terres qui appartiennent aux métis ? Et moi, ne me suis-je pas accaparé cinq milles carrés des terres les plus fertiles et réclamées par les colons de la Rivière-Rouge ? Des émigrants d'Ontario ne sont-ils pas venus s'établir à la rivière des Ilots-de-Bois, sur des terrains considérés par les métis français comme leurs propriétés ? Ne se sont-ils pas immortalisés là par une témérité, sans exemple dans toutes ces contrées ? Ils ont changé le nom de la rivière aux Ilots-de-Bois en celui de Boyne, comme pour jeter l'insulte à la religion catholique. Après avoir été les auteurs de tels exploits, nous avons cru devoir nous faire appeler Loyaux et, partout dans la province d'Ontario, on nous décerne ce beau titre.\nDr. SCHULTZ.—C'est vrai ! je sais bien tout cela ? Bravo ! Nous avons là le gage des succès qui nous attendent dans l'avenir !\n\nDENNIS.—En effet ! Qu'ont fait les métis en face de tant de persécutions ? Ils ont poussé leurs cris de protestations et toutes leurs réclamations n'ont abouti qu'à prouver leur impuissance !\n\nDr. SCHULTZ.—Mais oubliez-vous que Riel et sa bande, au nombre de 18, ont eu le courage et la force d'arrêter les opérations de l'arpenteur Webb que vous aviez envoyé à la Pointe-du-Chêne ? Ils ont mis leurs pieds sur les chaînes des arpenteurs et les ont forcés de se retirer.\n\nDENNIS.—C'est parce qu'en prévision d'une telle éventualité j'avais donné à Webb instruction de ne pas résister. Il en aurait été bien autrement, si j'avais voulu fournir à lui et à ses hommes les moyens de pousser plus loin leurs travaux d'arpentage. Ne sont-ce pas autant de triomphes que nous avons remportés contre la nation métisse française et catholique ? En avons-nous eu peur, quand l'enlèvement de ses plus belles terres l'a poussée à la plus extrême indignation ?\n\nAu contraire, nous lui avons affirmé que nous étions les représentants de l'autorité, nous l'avons traitée de rebelle, de révoltée, d'insurgée, et il lui a fallu nous laisser arpernter les terrains occupés par elle !\n\nDr. SCHULTZ.—Dennis, je n'ai jamais nié que la valeur et l'influence de notre parti se soient agrandies considérablement depuis un certain nombre d'années, et les métis connaissent bien les griefs qui les ont portés à tant se plaindre.\n\nDENNIS.—Toutes sortes de persécutions ont\nété dirigées contre eux, pour les priver de leurs emplacements et pour leur enlever l'honneur. On nous dit que le souffle empesté de l'immoralité a été déchaîné contre eux, ainsi que contre les sauvages. Ils ont dû dépérir sous l'action délétère de cette immoralité immonde.\n\nDr. SCHULTZ.—Parbleu ! qu'on ait fait subir aux métis toutes sortes de misères et toutes espèces d'infamies, je n'ai pas à sympathiser avec eux. Je ne désire qu'une chose : c'est d'arracher les richesses de ce sol aux métis canadiens-français surtout, qui ne sauront ni ne pourront jamais les exploiter comme il faut. Écoutez, Dennis ! La réflexion sur tout ce que vous venez de me raconter, change mes idées. Poussé par les seides orangistes qui le soutiennent, grâce à l'aplatissement des chefs conservateurs de la province de Québec, le ministère d'Ottawa forcera quand même tout le Nord-Ouest à entrer dans la confédération.\n\nDENNIS.—Certainement ! peu importe au Cabinet, si c'est son droit ou non ! Il faut que l'acquisition d'un aussi grand pays couronne tous les expédients politiques auxquels il est obligé d'avoir recours constamment.\n\nDr. SCHULTZ.—Dans tous les cas, nous avons à nous féliciter pour avoir choisi les meilleurs terrains.\n\nDENNIS.—Oui ! mais il faut bien se l'avouer : les métis ont été réellement traqués comme des bêtes sauvages. Victimes de tant d'extorsions, accablés d'insultes et d'outrages, indignés contre la compagnie de la Baie d'Hudson qui les avait livrés pieds et poings liés au Canada, excités au suprême degré lorsqu'en réponse à leurs repré-\nsensations et à leurs demandes, la chambre fédérale leur a envoyé 300 carabines, 30,000 cartouches et un lieutenant-gouverneur canadien sans droit sur eux, il n’est pas étonnant qu’ils aient organisé un gouvernement provisoire, qu’ils se soient mis sous les armes en aussi grand nombre, qu’ils se soient emparés de Fort-Garry et qu’ils parlent d’envoyer à Ottawa le Père Ritchot, John Black et Alfred Scott. Mais tout cela ne m’épouvante pas. Ils n’obtiendront rien dans la capitale de la Puissance.\n\nQuant à nous, nous n’avons pas de temps à perdre pour réduire tous ces métis insubordonnés. Nous allons bien les contraindre à venir avec nous acclamer l’arrivée du premier lieutenant-gouverneur. Bien que comme moi vous détestiez les sauvages, prenez encore tous les moyens d’en ranger autant que possible de notre côté. Ce sera autant d’alliés qui nous serviront à soumettre les métis.\n\nDr. Schultz.—J’ai déjà gagné l’alliance des sauvages Chippeways et des Sioux, grâce à l’aide de Shermann et de Monkman.\n\nDennis.—Très bien ! quant à moi, j’ai l’amitié des sauvages Swampies ou Muskegon, que j’ai déjà réunis au Fort-de-Pierre. De plus, j’ai envoyé à Webb l’ordre de former quatre compagnies au Portage-de-la-Prairie. Avec le major Boulton comme lieutenant, je prendrai le commandement de toutes ces forces. Vous remonterez la rivière avec tous vos hommes, et notre jonction étant opérée près de Fort-Garry, nous nous emparerons de la cathédrale de l’évêque Taché, nous attaquerez les familles des soldats de Riel pour forcer ces derniers à se débander,\npuis enfin nous ferons prisonniers tous les rebelles. Allons, docteur, hâtons-nous ! Réprimons ces troubles ! Rien à craindre du côté du gouvernement fédéral, toujours appuyé par l'orangisme et toujours content des actes de notre loyauté ! Marchons donc contre Riel. A bas la compagnie de la Baie d'Hudson ! A bas l'évêque Taché ! A bas la croix des missionnaires ! A bas les métis catholiques. Vive les anglais ! Vive les orangistes ! Vive McDougall ! (Ils sortent tous les deux.)\n\nSCENE X.\n\n(Ésprit-Voyageur seul. Il regarde aller les officiers et paraît indigné, il marche).—Ah ! bande de scélérats ! Ah ! les chétis ! les renégats ! les voleurs ! Ah ! je vous connais ben à cte heure. Après nous avoir fait boire beaucoup de whisky, il y a quelque temps, et après nous avoir embêtés avec toutes vos belles promesses, après avoir raconté toutes sortes de mensonges sur le compte de Riel, vous nous avez fait consentir à aller nous battre contre lui, Ah ! mais... c'est que je n'entends plus ça à cte heure ! J'aime la guerre, mais pas contre Riel. Je n'ai pas peur d'aller me battre ! Oh ! non ! pourvu que ce soit contre tous ces habits rouges qui nous trompent pour tout nous ôter et nous laisser ensuite en de mauvais draps. Moi, je suis pour Riel maintenant, moi je ne boirai plus de bouisky, j'écouterai les conseils de la robe noire. Allons, j'entends du bruit (il écoute), c'est peut-être des habits rouges qui me cherchent pour m'emmener me battre contre Riel. Oui.. j'ai un plan, je vais me\ncacher et ils ne me trouveront pas. (Il va se cacher, pendant une minute on change de tableau, pour un autre représentant un bois.)\n\nSCENE XI.\n\n(Esprit-Voyageur se tiendra caché pas loin. Esprit-Errant entre.)\n\nESPRIT-ERRANT.—Pourtant ce doit icite que Esprit-Voyageur se tient caché depuis quelques temps. Si nous avions tous nous autres répondu à l'appel des habits rouges, ben certain qu'ils n'auraient pas été battus et faits prisonniers en si grand nombre. Ah! ben,... je m'en fiche à cte heure,... j'ai laissé le camp de Schultz et me suis sauvé tant que j'ai pu. Esprit-Voyageur es-tu icile? Réponds à moi. (Il fait semblant de chercher.)\n\nESPRIT-Voyageur (il se montre).—C'est toi Esprit-Errant ! pas mort, moi, comme tu vois. Aussi j'ai tiré comme un bon.\n\nESPRIT-ERRANT.—Tais-toi, menteur !... On a tiré un peu sur les soldats de Riel, on ne s'est presque pas battu ; Riel et les siens ont eu la victoire de suite et ont pris beaucoup de prisonniers ; ben certain que tu n'étais pas avec nous autres (tout à coup un métis entre.)\n\nSCENE XII.\n\nLES DEUX PRÉCÉDENTS ET UN MÉTIS.\n\nUn Métis (il entre vite).—Maintenant, vous autres, prenez garde ! Vous avez cru faire un bon\ncoup en vous rangeant du côté des habits rouges ! Vous n'avez rien gagné !\n\nESPRIT-VOYAGEUR.—Je ne suis pas aller là, pan tout ! j'ai resté icite !\n\nESPRIT-ERRANT.—Pas vrai, toi venir me dire avoir tiré ben gros contre les soldats de Riel.\n\nESPRIT-VOYAGEUR.—Eh ben ! moi, à mon tour, te dire pas vrai ?... toi venir me dire que tu n'as pas vu moi là-bas tirer—chique.\n\nUN MÉTIS.—Ecoutez ! cessez cette chicane qui m'ennuie. Je vous avertis de faire attention à vous autres. C'est mieux de vous en allez dans le fond du bois. Dans le moment, si je voulais, je pourrais vous mettre en charpie !... Mais j'ai pitié de vous autres !... (Les sauvages font des menaces.) Ne faites pas de menaces, et apprenez qui je suis. Vos habits rouges, au commencement, m'ont pris comme prisonnier. Je me suis défendu comme un lion, pour me débarrasser d'eux, et j'ai tant fait des pieds et des mains que j'ai pu m'enfuir. Alors ils m'ont poursuivi pour me tuer. Mais je leur ai riposté si courageusement qu'une de mes balles a flambé la cervelle à Sutherland, un jeune métis écossais plein de valeur. Pensez-vous maintenant que je serais effrayé de vos menaces ?\n\nESPRIT-ERRANT.—Vous êtes un brave, nous sommes à vos ordres.\n\nUN MÉTIS.—Allez dire à tous ceux que vous rencontrerez que Riel leur ordonne de se tenir tranquilles, de ne plus écouter les persides conseils des habits rouges. Allez leur apprendre que les soldats de Riel ont amené comme prisonniers le major Boulton avec 48 de ces hommes. (Esprit-Errant et Esprit-Voyageur sortent.)\nSCENE XIII.\n\nUn Métis (il marche). — Quel massacre effrayant auquel le major Boulton s’est exposé avec sa bande d’extravagants ! Le projet barbare qu’ils tentèrent de mettre à exécution, a été déjoué par les soldats de Riel qui eurent la plus belle occasion de tous les exterminer ! Combien de pertes de vie ont été évitées, grâce à la noble modération du magnanime chef du peuple métis ! Condamné à mort par la cour martiale, le major Boulton obtint encore sa grâce par les sollicitations des personnes les plus influentes dans ce pays. Pour moi, il me semble que ce pardon n’est pas conciliable avec la cause sacrée pour laquelle nous combattons. Ah ! si nos ennemis pouvaient mettre la main sur nous, ils ne nous feraient pas miséricorde, ils se feraient un plaisir et une gloire de tous nous massacrer ! Pas de clémence pour tous ces pirates qui nous ont tant fait souffrir !... Aussi je me réjouis en voyant approcher l’heure de l’exécution de Thomas Scott, de ce bandit qui a commis tant de crimes et qui a tant exaspéré les autorités. Allons ! j’entends du bruit !... je crois que des soldats s’amènent dans cette cour, en arrière d’ici... Oui ! ce sont eux qui viennent. (Il sort.) (On change de suite de tableau, pour un autre représentant une cour et quelques maisons.)\nSCENE XIV.\n\nLE PRÉSIDENT DE LA COUR MARTIALE, TROIS SOLDATS ARMÉS, ET THOMAS SCOTT entrent.\n\nLE PRÉSIDENT (il lit la condamnation).—Thomas Scott, vous connaissez les accusations portées contre vous et fondées sur les preuves les plus écrasantes ! Il est prouvé que vous êtes d'une nature dangereuse, un fauteur de désordres, que vous avez failli assassiner M. Snow pour lui extorquer des sommes d'argent, que vous avez été pris deux fois les armes à la main ; il existe des preuves de vos tentatives d'assassinat contre le digne président de notre nouveau gouvernement ; enfin il est établi que, dans la prison, vous avez eu recours à toutes sortes de violences, et que vous vous êtes conduit de la manière la plus brutale à l'égard des surveillants ; voilà pourquoi le conseil de guerre vous a condamné à être fusillé et m'oblige en ce moment à remplir cette tâche la plus pénible de ma vie. Réconciliez-vous avec le juge souverain devant lequel vous allez apparaître, et qu'il ait pitié de votre âme. (Scott est garrotté et placé de manière à n'être presque pas vu de l'auditoire.)\n\nLE PRÉSIDENT (quand tout est prêt).—Feu ! (Tous sortent, le fusillé est entraîné hors du théâtre.)\n\nLE PRÉSIDENT (seul).—Fasse le ciel que l'âme de ce malheureux rencontre là-haut la miséricorde infinie. Ici-bas, il a bien mérité le châtiment extrême que le maintien de la paix publique nous obligeait de lui faire subir.\nSCÈNE XV.\n\nLE PRÉCÉDENT, RIEL.\n\nRIEL.—Mon cher ami, quelque misérable que Thomas Scott ait été à mes yeux, j’ai tout fait pour le sauver. Réellement si son sort eût été entre mes mains seules, je l’aurais épargné. Mais la majorité a décidé autrement. Il faut croire que la sécurité publique l’exigeait. Que l’âme de ce pauvre malheureux repose en paix. Quant à nos difficultés, j’espère qu’elles vont se résoudre à notre avantage. L’entrevue que je viens d’avoir avec le gouverneur McTavish et Mgr Taché, me rassure complètement. Je suis heureux de vous annoncer aussi que nos trois délégués pourront être entendus à la capitale de la Puissance et y traiter en notre nom de l’admission de notre pays à la confédération.\n\nSCÈNE XVI.\n\nLES MÊMES, LÉPINE entre.\n\nLÉPINE.—Mon cher Riel, je reviens à la mission de paix que les ministres d’Ottawa ont confiée à notre infatigable archevêque. Je n’ai pas doute que Monseigneur y met toute sa grande âme d’apôtre, tout le dévouement dont il est capable, mais pensez-vous que les ministres seront fidèles à leurs promesses ?\n\nRIEL.—Il me semble qu’il est impossible à Sir John A. McDonald et Sir George Cartier de\nfausser leurs paroles. Comme, malheureusement, tous les ministres canadiens subissent sans cesse la funeste pression du fanatisme orangiste, il y a lieu d'entretenir beaucoup de crainte au sujet des promesses qu'ils ont faites à Mgr Taché. Ils pourraient bien avoir la témérité d'abuser d'un aussi haut personnage.\n\nLÉPINE.—Lorsqu'en route pour Rome, cet apôtre, si grand et si vénérable, a eu la bonté d'arrêter à Ottawa pour éclairer les ministres sur notre situation véritable et pour leur indiquer les moyens d'arriver sûrement et pacifiquement à l'acquisition de tout le Nord-Ouest, comment ont-ils tenu compte de ses précieux renseignements et de ses sages conseils ? Ils répondirent qu'ils n'avaient pas besoin de ses avertissements comme base de leur politique par rapport à leur installation au Nord-Ouest. Vous savez ce qui en est résulté ?\n\nRIEL.—C'est que le soulèvement prédit par Sa Grâce n'a pas tardé à se faire.\n\nLÉPINE.—En effet ! à peine Monseigneur était-il arrivé à Paris que nos troubles éclatèrent, et le noble et vaillant apôtre ne fut pas aussitôt dans les murs de Rome que des dépêches d'Ottawa le demandaient en toute hâte pour la pacification de notre pays. Ne reculant pas devant les plus pénibles travaux et les plus grands sacrifices, notre illustre prélat apparaît à Ottawa et se présente au Cabinet. Pour apaiser les troubles, le ministère l'autorise de proclamer l'amnistie et de régler toutes nos difficultés. Maintenant, Riel, j'ai cette question à vous faire. Pensez-vous que les autorités canadiennes ont enfin ouvert les yeux pour nous rendre justice ? Ne présumez-\nvous pas plutôt qu'elles abusent de notre bien-\naimé archevêque pour avoir le temps d'organiser\nles plus méchants complots en vue d'arriver à\nl'anéantissement de tout élément français et\ncatholique dans le Nord-Ouest ?\n\nRIEL.—Ah ! cher Lépine, l'avenir va nous le\ndire. (Le rideau est descendu.)\nPERSONNAGES DU 2ME ACTE :\n\nMarguerite (fiancée de Riel) ......\nRiel ...........................................\nAmbroise Lépine .............................\nParenteau ......................................\nL'assassin .....................................\nLe Dr. Howard ...............................\nLa Soeur .......................................\nDumont ........................................\nDumas .........................................\nACTE IIÈME.\n\nEXIL DE RIEL, SA FOLIE, CAUSES DU SOULÈVEMENT DE 1885.)\n\nSCENE I.\n\n(Le théâtre représente un salon où Marguerite est assise près d'une table, la tête inclinée et appuyée sur ses mains.)\n\nMarguerite (au lever du rideau, se lève et marche).—Mon Dieu!... que mon cœur est brisé!.. J'aime Louis, mon cher Louis, et la fureur de l'orangisme et la trahison nationale vont me le ravir!... Après lui avoir fait subir les plus affreuses persécutions, les méchants qui en veulent à ses jours, ont dirigé contre lui tous les moyens les plus indignes et les plus atroces pour le contraindre à s'expatrier!.. Aujourd'hui, le chemin de l'exil s'ouvre devant lui, et il faut absolument qu'il le prenne!.. Ah!.. que les hommes le poursuivent encore plus par les traits mortels de leur malice et de leur perversité,... plus je m'attacherai à lui! Que je serais désolée de ne plus jamais le revoir!.. j'ai la douce conviction que son cœur brûle d'amour pour moi, et il est persuadé que j'éprouve pour lui l'affection la plus ardente et la plus profonde. Si depuis 1870, la liberté eût été rendue à Riel, je sais que notre union n'aurait pas tardé à se faire aux pieds de nos autels, et que j'aurais été depuis\nlongtemps mise au nombre des femmes les plus heureuses. Mais... oh cruel destin !... un avenir sombre, plein de déchirements tombe encore sous mes yeux : lui en exil et moi dans l'abandon et l'ennui... je sens que la vie me devient insupportable! (Elle pleure, ensuite voyant entrer Riel elle s'essuie les yeux et cherche à dissimuler ses émotions.)\n\nSCENE II.\n\nMarguerite, Riel. (Il entre.)\n\nMarguerite.—Oh ! Louis ! c'est vous ! je ne vous attendais pas ce soir ! Que je suis heureuse de vous voir ! Ce ne sera pas la dernière fois, je l'espère !\n\nRiel.—Ma chère Marguerite, ne me cachez pas ces larmes, qui m'expriment votre douleur. Puisqu'il faut nous laisser, armons-nous de courage et sachons nous résigner.\n\nMarguerite.—La vie, oh Louis ! me paraît comme une séparation continue !... Chaque jour nous demande à faire de nouveaux sacrifices !\n\nRiel.—Sur cette terre, partout se dressent des croix qu'une loi impitoyable nous met sur les épaules.\n\nMarguerite.—Oh, Louis ! je sais combien sont nombreux les malheurs qui sont appesantis sur la colonie des métis français, et je n'ignore pas tout ce que vous avez souffert pour la défense de nos compatriotes depuis si longtemps opprimés.\n\nRiel.—Aujourd'hui, la main cruelle de la persécution me pousse violemment sur la route\nde l'exil, et mon ami Ambroise Lépine est sous le coup de la même infortune.\n\nMarguerite.—Oh Louis ! combien cela doit être dur pour vous et votre compagnon de malheur !\n\nRiel.—Mes lèvres n'ont pas d'expressions pour vous communiquer ce que mon âme, si profondément attristée, ressent au fond d'elle-même.\n\nMarguerite.—Laisser notre patrie, lorsque la Providence vous permet de lui être si utile et où vous êtes entouré de tant de respects et comblé de tant d'honneurs ! Oh Louis !...\n\nRiel.—Oh, ma bonne amie ! mes ennemis acharnés ne me causent pas plus de peine que s'ils m'enfermaient dans le plus sombre des cachots !\n\nMarguerite.—Peut-être qu'ils me permettraient d'y entrer pour avoir le bonheur de vous voir... Mais l'exil qui vous attend va mettre entre nous deux une distance qui sera pour moi un poignard enfoncé dans le cœur !\n\nRiel.—Marguerite, vous et ma patrie ! vous êtes la palme pour laquelle j'ai combattu !... Ce cher pays, ces chers compatriotes ne pourront plus compter sur ce patriotisme ardent, qui me dévore. Ne perdant pas espérance, ils se figureront qu'avant longtemps je pourrai revenir vivre au milieu d'eux... Quant à vous, Marguerite, les yeux de mon cœur vous regardent encore comme ma future épouse. Aujourd'hui, la main implacable du destin nous éloigne l'un de l'autre, mais jamais elle n'arrêtera l'impulsion de cette poitrine enflammée qui toujours se porte vers vous ! Lorsqu'il me sera possible de vous faire\nla compagne de ma vie pour partager avec moi les jouissances et les afflictions de la terre, il me semble que vous me rendrez plus fort pour présider courageusement et noblement aux destinées de la nation métisse. Pour le moment, soumettons-nous à la Providence !.. qui sait si elle ne me permettra pas bientôt de vous engager dans les liens de l'hyménéée, qui est le rêve le plus suave de votre jeunesse vénérable ?\n\nMarguerite.—Oh, Louis ! vous êtes doué de qualités trop nobles pour que vos plus légitimes aspirations ne se réalisent pas ! Je sens intime-ment que mon pauvre cœur contristé va languir dans l'ennui et la peine. Mais je suis certaine que Louis Riel ne saurait périr sous le poignard des assassins ! Dans cette conviction je trouve ma plus forte consolation... Mais, puisque vos ennemis sont trop lâches pour vous attaquer en face, allez chercher votre salut en exil. C'est ainsi que vous suivrez le courant de la volonté divine !.. Fuyez, oh cher Louis ! ces traits de haine et de vengeance dont vos ennemis vous poursuivent avec plus d'acharnement que jamais... partez ô grand et magnanime héros dont la présence fait les délices de mes jours !..—La faiblesse de vos misérables persécuteurs est un indice des triomphes qui couronneront bientôt vos sacrifices ! Lorsqu'après tant d'orages le beau temps viendra, c'est mon espérance que le ciel nous unira et nous fera marcher ensemble dans les sentiers où nous goûterons les joies les plus innocentes et les plus pures de ce monde. Votre départ plonge mon cœur dans la plus profonde tristesse. Mais en voyant avec quel courage vous vous conformez à votre malheureux sort, je me\nsens plus forte. Je veux vous imiter, aimant à vous seconder au milieu des déboires sans nombre qui empoisonnent nos jours... Allez donc, Louis, et que le ciel veille sur vous... Oh, Louis ! (elle écoute) j'entends les pas précipités des assassins qui courent à votre poursuite... (Elle prend la main de Louis comme pour l'amener dehors se cacher.)\n\nRIEL.—Non!... c'est mon ami Lépine qui doit venir ici me rejoindre pour vous faire ensemble nos derniers adieux. (Ils se tiennent par la main.)\n\nLÉPINE (il entre).—Eh bien ! mon cher Louis, je souhaite que sur la route de l'exil vous puissiez toujours avoir à la main cette rose qui contribuerait à dissiper les cruels ennuis qui vous sont réservés, comme à moi.\n\nRIEL.—Ah ! cher Ambroise, la main de la haine orangiste nous arrache aujourd'hui à notre patrie, mais jamais elle ne lui arrachera notre cœur ! Quant à cette rose dont vous me parlez, (montrant Marguerite), le sort lui empêche de m'accompagner, mais elle peut avoir l'assurance qu'un jour je la trouverai encore aussi fraîche et qu'elle deviendra le plus bel ornement de mon existence.\n\nLÉPINE.—C'est bien vrai de dire que deux bons et grands esprits et que deux nobles cœurs savent toujours se rencontrer.\n\nMARGUERITE.—Mes chers amis, en ce moment si douloureux de notre séparation, je ne peux m'empêcher de vous dire un mot d'encouragement. Vous avez été l'objet de persécutions bien infâmes à venir jusqu'à présent, et vous n'avez jamais cessé de vous montrer courageux. Conti-\nnuez encore à offrir à vos insatigables oppresseurs des preuves indéniables de votre énergie indomptable, de votre courage invincible, de votre magnanimité incomparable, et je crois fermement que de telles dispositions ouvriront devant vous la porte des succès les plus brillants et des triomphes les plus beaux. Allez, bons et nobles amis, et apportez avec vous la certitude que la pensée et le cœur de vos compatriotes vous accompagneront partout où vous vous dirigerez et partout où vous vous trouverez. (Ils reçoivent Parenteau.)\n\nParenteau (il entre).—Vous partez donc, braves compatriotes. Pour le crime de nous avoir trop aimés, vos agresseurs pleins de fanatisme et de mensonge vous obligent de nous laisser !... Eh bien !... que la Providence guide vos pas dans les voies les plus sûres et les moins remplies de ronces et d'épines. Je vous serre la main pour la dernière fois.\n\nRiel.—Mon cher Parenteau ! Oui, enfin, nous quittons le sol de notre patrie ! C'est la volonté des potentats effrénés qui tiennent les rênes du pouvoir à Ottawa ! Soyez mon interprète auprès de mes bien-aimés frères, les métis canadiens français. Allez leur dire qu'avant de me séparer d'eux, je vous ai chargé de leur faire connaître toutes mes protestations contre la politique barbare et odieuse que le gouvernement d'Ottawa a adoptée et suivie jusqu'aujourd'hui par rapport au Manitoba et aux territoires du Nord-Ouest. Cette politique est une série des crimes les plus honteux, est assise sur une fourberie la plus tortueuse, sur une hypocrisie la plus effrontée et sur des mensonges les plus pervers ! Vous\npouvez affirmer et démontrer à mes chers compatriotes que, dans la poursuite d'une politique aussi inhumaine, le ministère fédéral n'a eu qu'un but : c'est l'écrasement de toute une race. Quels sont les éléments qui l'ont poussé à réaliser un résultat aussi effrayant et aussi détestable aux yeux des peuples réellement imbues des principes d'humanité ? L'histoire impartiale dit que c'est le fanatisme protestant et la haine orangiste, secondés par l'ineptie ou l'avilissement des principaux chefs de la représentation canadienne française.\n\nQue nos frères se rappellent, d'abord, les prétentions hostiles et arrogantes de tous ces aventuriers anglo-saxons et de tous ces orangistes qui vinrent d'Ontario et d'ailleurs s'établir dans le Manitoba, les uns après les autres. Ces étrangers insolents se considéraient comme des gens de race supérieure, s'imaginant que leur présence réduirait à néant tous les droits des métis et les plongerait dans l'esclavage ! Tous nos compatriotes étaient traités par cette horde mécréante comme des rebus de la société. Ce n'était pas assez pour tous ces êtres malfaisants de se faire les insulteurs des habitants respectables et paisibles de ce pays, ils ont cru qu'ils pouvaient se constituer les usurpateurs de la seule autorité légitime alors reconnue ! Cette usurpation les mettait en révolte ouverte contre Sa Majesté la reine d'Angleterre ! N'importe ! Voulant s'affirmer dans leur révolution, ils ont eu l'incomparable audace d'arborer le drapeau de la république ! Eh, bien ! Les loges de l'orangisme, dominant dans la capitale de la Puissance, regardaient tous ces émigrants per-\nturbateurs de l'ordre public, comme les précurseurs devant préparer les voies à la venue et au règne de la plus infernale spoliation et de la plus cruelle extermination de la race métisse ! Tous nos concitoyens sont convaincus de cette triste vérité. Veulent-ils démontrer aux autres tout ce qu'elle renferme d'horrible ? Qu'ils leur fassent analyser les faits, qu'ils leur montrent comment les a enchaînés la secte orangiste ! secte sanguinaire ! maudite par la civilisation et le christianisme ! Ils ont en belle de mettre à profit les preuves qui leur sont fournies par cette alliance faite entre tous les émigrés et les arpenteurs du gouvernement d'Ottawa ! Ils n'oublieront jamais, il n'y a pas de doute, comment ils se sont unis pour nous déclarer une guerre de vendales. Eh bien ! qu'ils ne se figurent pas que le gouvernement canadien ignorait tous ces forfaits commis dans le Nord-Ouest par tous ces émigrants et tous ces officiers spoliateurs et exterminateurs ! Oh, non ! Qu'ils examinent de plus près la suite des événements : ils verront avec quel acharnement épouvantable le tigre orangiste, incarné dans le cabinet d'Ottawa, a fait descendre des hauteurs du pouvoir la trame ourdie pour la ruine de notre existence nationale ! Croyant que la compagnie de la Baie d'Hudson avait pu réussir à nous livrer pieds et poings liés sous ses dents meurtrières, il a essayé de nous dévorer ; mais, par une résistance héroïque, nous avons eu le bonheur de nous en échapper ! Oh, ciel ! Pendant près d'un siècle, le gouvernement impérial d'Angleterre nous a abandonnés à la féroce rapacité et à la tyrannie incroyable des fonctionnaires de cette compa-\ngnie! N'était-ce pas assez de persécutions? Bien que mon vénérable père ait proclamé, au nom du peuple, la liberté du commerce, devant le tribunal despotique de tous ces aventuriers de la fière Albion, il nous a fallu encore être en butte aux coups terribles de l'orangisme, qui, voulant nous détruire et faire de notre patrie une terre anglaise, a eu l'appui et l'encouragement d'un certain protestantisme fanatique et d'une lâche défection ou d'une malheureuse impuissance de ceux appelés à défendre et honorer la race canadienne-française! Ne pouvant s'emparer de nous au moyen d'un complot tramé dans l'ombre, comment le monstre orangiste va-t-il s'y prendre pour saisir sa proie et la tenir sans la perdre? Jeté dans une fureur indescriptible par le spectre de Thomas Scott, il communique au ministère d'Ottawa son astuce et la rage de son instinct barbare contre tout élément catholique et français, et le détermine à avoir recours à un expédient politique flétri par l'histoire impartiale. Il dit au gouvernement: nous n'avons pu, comme nous voulions, réaliser nos plans dans le Manitoba et y anéantir la nation métisse; eh bien! faussons nos promesses par rapport à l'amnistie, retardons l'accomplissement des clauses du traité, de manière à contraindre les métis à laisser cette province, poursuivons-en les chefs jusqu'à faire tomber leur tête, et dirigeons nos exploits dans les plaines de la Saskatchewan.\n\nVoilà pourquoi ces brigands politiques, perdant tout sentiment de dignité, trompèrent publiquement un archevêque aimé et respecté par tout le monde civilisé! Voilà pourquoi tant de nos\npauvres concitoyens souffrent encore ! Voilà pourquoi ma tête a été et est encore sous le poignard des lâches et des traîtres assassins ! À côté de cette haine implacable de nos persécuteurs, que n'avons-nous pas fait par patriotisme et par respect à l'autorité ? Appelés contre une invasion de féniens, nous n'avons pas hésité à aller exposer notre sang pour le salut de la patrie, et, grâce à Dieu, nous avons pu mettre l'ennemi en fuite ! Comment le gouvernement fédéral nous a-t-il récompensés pour l'héroïsme de notre dévouement ? Nous avons subi un procès ! Mon brave ami Lépine fut condamné à mort !... et moi !... Je fus déclaré hors la loi !... ma tête fut mise à prix !... Oh malice et ingratitude humaines ! Alors la question de l'amnistie fut débattue plus fort que jamais ! Que de voyages ! que de sacrifices et de fatigues ! Ô infatigable archevêque de Saint-Boniface, ne vous êtes-vous pas imposés pour empêcher Lépine de monter sur le gibet ! Malgré que toutes vos tentatives étaient frustrées par l'orangisme, vous ne persévériez pas moins à insister pour obtenir l'accomplissement d'une promesse qui vous avait été faite si solennellement !\n\nPendant ce temps-là, notre ami Lépine était entre la vie et la mort jusqu'à ce qu'enfin la peine capitale portée contre lui, fût commuée en deux ans d'exil.\n\nQuant à moi, je n'ai pas craint de montrer l'attitude que me dictaient le devoir et l'honneur, jusqu'au jour néfaste où on a statué et ordonné que pendant cinq ans je ne pourrais vivre sous le ciel de ma patrie !... ma patrie que j'ai tant aimée !... ma patrie que j'ai délivrée des bri-\ngands, des arpenteurs, des spéculateurs, des mains sales et dégoûtantes de la secte sanguinaire !... ma patrie pour la défense de laquelle je fais, ainsi que mes nobles et vaillants compagnons, un bouclier de mon corps pour la mettre à l'abri du plomb, des balles et de l'épée des fénians ! notre patrie sur l'autel de laquelle nous faisons aujourd'hui le sacrifice de partir pour un ciel étranger ! Ah ! vous tous, hommes politiques, à qui le peuple confie l'autorité pour son bien et sa liberté, comment nous traitez-vous ? Tous les chefs de nos ennemis, qui ont été les premiers à prendre les armes pour nous chasser de nos foyers et nous exterminer, qu'en faites-vous ? Ils étaient les vrais rebelles, des agitateurs, des agresseurs, des bandits, et vous les avez récompensés en leur donnant les meilleures situations. Quant à nous, pour avoir été de vaillants défenseurs de notre sol, pour avoir, dans l'intérêt de la Couronne, exposé jusqu'à la dernière goutte de notre sang, vous voulez nous faire monter sur l'échafaud ou nous envoyer en pays étranger ! Oh ! laissez-moi vous dire qu'à mes yeux vous êtes de grands criminels et vous n'avez d'humain que l'apparence ! C'est pourquoi l'histoire vous couvrira d'infamie et de honte, tandis qu'elle nous glorifiera ! Parenteau, allez porter à ma patrie mes derniers adieux ! (Ils tournent la main à Marguerite, Riel l'embrasse ; ils sortent, excepté Marguerite.)\n\nSCENE V.\n\nMarguerite seule.\n\n(Elle se met à genoux).—Oh ! mon Dieu ! qu'il y a donc sur la terre des hommes méchants !\nCombien sont grands les sentiments qui leur sont réservés ! Ayez pitié d'eux, ô Dieu de toute bonté, Accordez-moi la grâce d'être toujours vertueuse. Oh ! que j'admire ces âmes généreuses et dévouées jusqu'à l'héroïsme. (Elle se lève et marche. Pendant ce temps on change de tableau pour un autre représentant un bois et une petite rivière.)\n\nSCENE VI.\n\n(Marguerite, Parenteau sur un des côtés du théâtre, et qui fera comme s'il n'était pas vu d'elle.)\n\nMarguerite.—Je vais aller me promener dans le bois. L'ennui m'accompagne partout ! Oh ! quelle belle et charmante petite rivière ici ! J'entends le doux murmure de ses eaux ! Cette brise fraîche qui caresse le feuillage ! ce chant mélodieux de tous ces oiseaux, qui volent de branches en branches ! ce beau firmament bleu et cet astre brillant du jour ! que j'aime à contempler toutes ces beautés de la nature et à écouter ses harmonies qui charment mes oreilles. Oh ! que je trouve bonne la mélancolie qu'elles réveillent en moi ! L'ennui que j'éprouve pour mon cher amant exilé semble s'y reposer.\n\nParenteau (il s'avance vers Marguerite).—Mademoiselle Marguerite, vous me paraissiez bien rêveuse aujourd'hui. Avez-vous eu des nouvelles de Louis dernièrement ?\n\nMarguerite.—Non, pas depuis quelques semaines. Pourtant il avait coutume de m'écrire souvent.\n\nParenteau.—J'ai la douleur de vous annoncer que notre pauvre ami Riel est à l'asile de la\nLongue-Pointe, près de Montréal. Je vous assure que cette nouvelle me cause beaucoup de peine.\n\nMarguerite.—M. Parenteau, je n'en suis pas surprise : je m'y attendais. Ses lettres m'ont souvent dénoté une si grande surexcitation de son cerveau qu'il n'est pas étonnant qu'elle lui ait fait perdre l'équilibre de ses facultés mentales. Mais je suis certaine que ce jeune héros sortira avant longtemps tout à fait guéri. C'est le repos qui lui faut.\n\nParenteau.—Vous avez raison, et c'est ce que je souhaite pour vous d'abord et pour nos frères. Mademoiselle Marguerite, j'ai vu, tout à l'heure, un homme qui m'a l'air d'un mauvais garnement. J'ai lieu de croire que cet inconnu, désireux d'avoir les 5,000 piastres promises et ignorant encore l'exil de notre valeureux chef, cherche à le rencontrer pour le tuer. (Il regarde.) Eh ! je le vois venir. Cachons-nous afin de nous assurer qui il est... il parle... écoutons et ne nous laissons pas voir. (Ils font semblant de se cacher.)\n\nSCENE VII.\n\nLES MÊMES ET L'ASSASSIN.\n\nL'Assassin.—Ah !... (Il écoute et regarde) c'est une belle place ici. Peut-être que Riel se cache dans ces lieux pectoresques !... Eh !... si je pouvais mettre la main dessus ! que je lui logerais vite une balle dans la cervelle... dire qu'ensuite j'aurais 5,000 piastres... que je serais riche ! que j'aurais du plaisir. (Parenteau et Marguerite se montrent.)\nParenteau.—Misérable! trahisse! brute! tu as la forme humaine, mais tu es plus bas que toutes les brutes! tu as l'âme assez dégradée pour vouloir faire tomber 5,000 piastres dans ton gousset en mettant tes pieds avilis sur le cadavre d'un brave comme Riel! ton avilissement n'atteindra jamais les hauteurs où ce héros s'est élevé! Éloigne-toi de ces lieux, vil assassin! Apprends qu'il y a longtemps déjà que ta proie n'est plus à ta portée. Tu n'auras jamais les moyens, ni le courage, ni la force de franchir la distance qui te sépare de ta dégoûtante cupidité. Disparaîs d'ici! Le fait seul de te regarder nous abaisse!\n\nL'assassin.—M. Parenteau, je me rappelle de vous avoir vu... je vous reconnais! vos paroles sont dures, mais elles me font monter la honte au front!\n\nParenteau.—Tant mieux! On peut vous ramener au repentir.\n\nL'assassin.—La passion m'a aveuglé et a étouffé en moi les plus nobles sentiments; mais vous me faites revenir à moi-même!... je vous confesse mon péché et je demande pardon à Dieu et à ma patrie.\n\nParenteau.—À tout péché miséricorde! Votre repentir vous rétablit dans notre considération. Venez avec nous au Fort. Là, vous allez briser cette arme qui est votre opprobre, et vous jettez au vent ce plomb et ces balles qui proclameront au monde leur impuissance d'atteindre le libérateur de notre patrie aujourd'hui en pleurs. Ensuite vous nous révélerez toutes les circonstances qui vous ont entraîné dans un tel égarement. (Ils sortent tous.)\nSCENE VIII.\n\n(Au moment où on enlève le tableau précédent, Riel sera assis plus en arrière et écrira. Le fond du théâtre représentera l'asile de la Longue-Pointe. Il se lève et marche.)\n\nLe règne du pape est fini. Il faut une autre religion dans l'Amérique, et j'ai à sauver mon peuple. Jésus-Christ m'a choisi pour opérer cette réforme religieuse et faire du Nord-Ouest le plus grand empire du monde. Je remplirai ma mission en dépit de tous les obstacles! Que le pape et les évêques s'écartent de ma voie! J'ai eu la visite des anges, ce matin, et ils m'ordonnent d'aller en Orient et en Occident pour prouver que je suis le vrai prophète de Dieu et que tout le monde doit m'obéir. (Il continue à marcher.)\n\nSCENE IX.\n\nLE MÊME, UNE SOEUR ET LE DR. HOWARD.\n\nDR. HOWARD.—Bien, M. Riel, vous ne vous portez pas plus mal, ce matin! (Ils se donnent la main.)\n\nRIEL.—Non, mon docteur? j'attends des ordres que les anges doivent encore bientôt m'apporter. Ils m'ont dit de regarder dans les veines de mon bras pour y voir la mission qui m'est imposée par Jésus-Christ. Je suis prêt à me lancer dans la voie où Dieu me veut!\n\nDR. HOWARD.—C'est bien, mon cher et brave Riel. Mais n'oubliez pas que vous m'avez chargé de rétablir votre santé. Je vais prendre encore\nquelque temps pour fortifier votre système affaibli. Ensuite, vous serez en état de répondre convenablement aux exigences de la mission que vous vous croyez obligé de remplir.\n\nLa Sœur.—M. Riel, vous ne nous laisserez pas si vite que cela! Vous êtes si bien sous le bon traitement du docteur et sous les soins dont nous vous entourons tous les jours! C'est la volonté de Dieu que vous passiez encore un certain temps en cette sainte solitude, pour retremper vos forces et mettre toutes choses en bon ordre.\n\nRIEL.—Oui!... mais,... ces murs commencent à me fatiguer, et Mgr Bourget m'a averti de me tenir dans le calme, prêt à tout événement. J'ai des études sérieuses à faire, dans le moment. (Il s'assied.) Veuillez me laisser seul pour rédiger un document de la plus haute importance, (il se met à écrire). Vous pouvez être sûrs que mon nom va retentir par toute la terre. (Le docteur et la sœur sortent, et on descend un tableau qui cache Riel et représente un bois et des maisons.)\n\nSCENE X.\n\nDUMONT et DUMAS entrent.\n\nDUMONT.—Croyez-vous, Dumas, que le gouvernement de la Puissance va écouter enfin nos plaintes, va considérer nos pétitions et se décider à s'occuper du redressement de nos griefs?\n\nDUMAS.—Je vous avoue franchement que les Communes d'Ottawa ne pensent pas plus à nos misères et à l'indigence des sauvages que si nous étions à 100 pieds sous terre!\nDUMONT.—Est-il donc vrai qu’il ne veut pas faire justice à nos réclamations ?\n\nDUMAS.—Je le crois. Pourtant n’avons-nous pas insisté assez sur l’urgence de nous donner satisfaction ? Il est bien évident qu’il veut continuer à exercer contre les métis de la Saskatchewan, les mêmes cruautés dont le Manitoba a eu tant à souffrir !\n\nDUMONT.—72 pétitions, depuis environ une quinzaine d’années, ont été adressées au gouvernement d’Ottawa.\n\nDUMAS.—Avons-nous eu une réponse à une, au moins, de ces suppliques ?\n\nDUMONT.—Jamais, morbleu !\n\nDUMAS.—Après avoir exposé tous nos griefs à Mgr Taché, le 29 janvier 1879, Sa Grandeur s’est donné le trouble d’écrire à Ottawa une longue lettre dans laquelle elle fit un exposé clair des droits que nous avons toujours réclamés. Est-il croyable que le gouvernement n’ait tenu aucun compte des supplications et des preuves de nos griefs contenues dans ce brave document ?\n\nDUMONT.—Nous le savons tous, jamais il ne s’en occupera !\n\nDUMAS.—Le 14 avril 1882, M. Clarke a bien reçu d’Ottawa une réponse plus ou moins propre à nous donner de l’espoirance : “Votre lettre, lui disait-on, a été réservée pour la considération spéciale du ministre.” Dire que le ministère n’a pas encore donné suite à cette considération, c’est incroyable !\n\nDUMONT.—Ce n’est pas tout ! En 1883, le conseil supérieur du Nord-Ouest est intervenu et a renouvelé toutes nos demandes, et on ne connaît pas encore ce qu’il a obtenu.\nDumas.—Sir Hector Langevin a bien eu la bonté de nous déclarer que nos demandes étaient parfaitement raisonnables et qu’il serait bon de les consigner par écrit. Eh bien ! avons-nous été plus exaucés ?\n\nDumont.—Point du tout ! c’est effrayant ! je ne peux m’expliquer une si criminelle négligence !\n\nDumas.—Ah ! c’est plutôt la plus infernale conspiration ! Pendant que le gouvernement fait ainsi le mort, nous sommes constamment à la merci des griffes du monstre orangiste qui prend tous les moyens de nous dépouiller et de nous faire endurer le plus long martyr avant que nous rendions le dernier soupir !\n\nDumont.—Ah ! cher Dumas, il est indéniable que la politique canadienne renouvelle ici les persécutions dont elle a ensanglanté tout le Manitoba à venir jusqu’à ces dernières années. Croyant avoir le champ libre dans cette province, après avoir rejeté Riel par-dessus bord, elle s’est appliquée violemment à nous mettre le pied sur la gorge ! Je vous le demande, qu’allons-nous faire ?\n\nDumas.—Dumont, pour moi, je suis déterminé à combattre jusqu’à la mort, plutôt que de voir ma famille sans maison et privée de toutes les choses nécessaires à la vie.\n\nDumont.—J’admire votre courage et votre bravoure ! mais nos femmes et nos enfants !...\n\nDumas.—Comment !... nos femmes et nos enfants n’en seront pas plus mal ! Qu’avons-nous à attendre de l’orangisme qui en veut à l’existence de la race métisse française ?\n\nDumont.—Vous connaissez mon tempérament ! Je ne sais pas si mon indignation me\nsiendra toujours calme !... J'achève de supporter cette horde affamée de spéculateurs qui s'acharnent à notre ruine, pendant que des arpenteurs figurent des lignes qui coupent nos champs, nos maisons, même nos cheminées, en tous sens, de manière à permettre à dame la spéculation de moceler nos emplacements suivant les intérêts de sa cupidité.\n\nDUMAS.—Si tous ces envahisseurs de nos foyers se bornaient à ces tentatives de vol !... mais non !... Il y en a qui apparaissent avec un plan à la main, qui pénètrent dans nos maisons et qui, nous déclarant audacieusement qu'ils sont chez eux, nous ordonnent de déloger !\n\nDUMONT.—Ecoutez ! Dumas, lorsque je pense à toutes ces abominations, je me sens porté comme vous, à aller massacrer tous ces voleurs publics, au risque de ma vie ou de ma liberté ! Ne vaut-il pas mieux mourir, nous, nos femmes et nos enfants, en luttant corps à corps pour la revendication de nos droits les plus sacrés, plutôt que de tant souffrir et de vivre dans la crainte mortelle d'être forcés de quitter nos maisons, du soir au matin et du matin au soir ? Vraiment ! Dumas, je suis à bout de patience et de résignation.\n\nDUMAS.—Puisque le gouvernement persiste toujours dans sa criminelle complicité, nous n'avons qu'une chose à faire : repoussons, arrêtons par nos balles, tous ces pirates qui désolent notre pays. Que je meurre pour ma patrie, plutôt que de la laisser prendre par une organisation politique en arrière de laquelle se cachent les voleurs orangistes !\nDUMONT.—Ecoutez, Dumas ! Il me vient une idée : ne sortons pas encore de la voie constitutionnelle ; faisons un suprême effort sur le terrain de la légalité. Vous savez que Riel est dans le Montana, depuis quelques années. Eh bien ! envoyons chercher ce vaillant compatriote, qui a sauvé le Manitoba ; allons réclamer son assistance. Il est plus instruit et plus influent que nous. Je crois que ses conseils et sa prudente direction couronneront de succès toutes nos requêtes.\n\nDUMAS.—Bravo ! Dumont vous avez une inspiration du ciel ! Convoquons immédiatement une assemblée de tous les métis anglais, écossais et français, afin de nommer la délégation que vous suggérez. Munissions-la de lettres officielles qui assurent Riel d’une chaleureuse et patriotique réception sur les bords désolés de la belle rivière Saskatchewan. (Ils sortent. Le rideau se baisse.)\nPERSONNAGES DU 3ÈME ACTE\n\nRiel ..........................................\nMarguerite ....................................\nJean,\nAngélique,\nDumont ........................................\nOuellette ......................................\nJackson ........................................\nIsbester .......................................\nMaxime Lépine ................................\nVendal ........................................\nLangevin ......................................\nCrozier, ses soldats ......................... .\nSoldats de Dumont ...........................\nMauvais-Enfant,\nEsprit-Voyageur,\nGros-Ours,\nCou-Nu,\nPère Fafard,\nPère Marchand,\nQuinn, Agent des indiens ...............\nDelaney ......................................\nCharles Gouin ...............................\nCameron, Agent de la Compagnie ......\nGowanlock ...................................\nMad. Gowanlock ...........................\nWilliscroft ....................................\nUn Courrier de Riel .......................\nUn Messager Métis .......................\nUn Messager Anglais .....................\nAmstrong,\nHourie,\nenfants de Riel ...\nsauvages.\nmartyrs...\nDeux éclaireurs de Middleton.\nACTE IIIÈME\n\nRIEL DANS LE MONTANA, AU FORT ST-IGNACE.\nDUMONT ET AUTRES VONT LE CHERCHER. DÉPART DE RIEL POUR LES TERRITOIRES DU NORD-OUEST. LE SOULÈVEMENT DE 1884-85. RIEL FAIT PRISONNIER.\n\nSCÈNE I.\n\nTableau représentant le Fort St-Ignace. Sur le théâtre, un salon meublé un peu médiocrement. Au lever du rideau, Riel et sa femme sont assis ; près d’eux, leurs enfants s’amusant ensemble.\n\nMarguerite.—Nous ne sommes pas riches !.. mais, dis donc, Louis, n’avons-nous pas tout ce qu’il faut pour être heureux ? Ton amour et tes tendres caresses pour moi et nos petits enfants me disent que tu n’as plus rien à désirer ! Si nous sommes le trésor, qui, en réalité, remplit ta poitrine ardente, n’ai-je pas raison de croire que sous ce ciel étranger, tu dois éprouver beaucoup de bonheur ?\n\nRiel.—Oh ! chère femme, tu sais vraiment que tu es l’objet de mes plus tendres affections !.. et ces beaux petits anges dont tu m’as rendu le père,.. combien je les aime et chéris ! Sans toi, tout me paraît sombre et ennuyeux ! Avec toi, tout à mes yeux s’embellit et me sourit ! J’admire les brillantes qualités de ton esprit et de ton cœur. Je ne peux me lasser de contempler ces épouses qui me représentent la femme forte\nde l'évangile : elles font le bonheur de la famille et entretiennent la société à se les proposer comme des modèles dont elles se glorifient. Quant à ces aimables petites créatures élevées sous les ailes de ta prudente vigilance, elles sont déjà tout mon orgueil, et je me flatte dans l'assurance que tu vais en faire de bons chrétiens et de bons citoyens.\n\nMarguerite.—Que je suis heureuse d'être ta femme, ô Louis ! Je trouve que rien ne me manque. Il est vrai, n'est-ce pas, que tes jouissances sont indépendantes de la richesse ?\n\nRiel.—Oh ! douce et chère compagne, je te le déclare franchement, dans cette maison où le luxe ne brille pas, je possède plus que toutes ces choses appelées la somptuosité dans le monde.\n\nMarguerite.—C'est donc toujours toi, cher mari ! mais écoute ! laisse-moi aller droit au but. Il est certain que, depuis quelque temps, tu cherches à me cacher une grande affliction. Qu'est-ce donc qui te cause du chagrin ? Si je suis ta moitié, j'ai droit à ce que tu me fasses participer à tes peines. Vois ce cœur qui ne bat que pour toi. Eh ! bien, verses-y cette amertume qui t'accable.\n\nRiel.—Je te l'ai dit, Marguerite : dans cette chaumière, j'ai tout ce qui peut me contenter. Mais il m'y est impossible d'être exempt de la souffrance.\n\nMarguerite.—Je vois bien que nous marchons dans cette vallée de larmes, ayant tous une croix à porter. Quelle est ta croix, Louis, ici au milieu de nous ?\n\nRiel.—Ma croix ! c'est d'être loin de ma patrie !... c'est d'être séparé de tout ce qui m'est\nle plus cher, après toi et mes enfants! Ma croix! c'est de voir la persécution de mes compatriotes dans les riantes plaines de la Saskatchewan! On les insulte et on les injurie de toutes façons, on enlève leurs propriétés, on s'empare même de leur honneur qu'on sacrifie sur l'autel de l'im-moralité! Voilà ce qui me saigne le cœur et me fait mourir de douleur! Dire que cette série d'atrocités dépend d'un gouvernement qui prétend être la tête d'une nation civilisée! c'est inconcevable!\n\nMarguerite.—Je partage, mon cher Louis, les peines que te causent tous ces malheurs de nos frères du Nord-Ouest! Si c'était possible, je voudrais les subir toute seule. Dis-moi, qui t'a fourni ces renseignements par rapport aux misères incroyables au milieu desquelles sont plongés nos amis de là-bas?\n\nRiel.—Depuis plusieurs mois, Gabriel Dumont m'écrivit pour me tenir au courant du brigandage et des ignominies dont la population métisse est victime. Il n'y a pas de doute qu'il désire me voir à la tête des démarches que lui et les autres chefs font pour se mettre sur la défensive et arrêter la marche des voleurs.\n\nMarguerite.—S'il te demandait, cher Louis, ne pars pas: laisse faire encore le cours des événements. (Elle écoute)... je crois que quelqu'un frappe à la porte. (Elle va ouvrir.)\n\nSCÈNE II.\n\nDumont, Ouellette, Jackson et Isbester entrent.\n\nRiel.—Dumont! c'est vous! comment êtes-vous ainsi que nos amis Ouellette, Jackson et Isbester? (Ils se donnent tous la main.)\nDUMONT.—Très bien, Riel, comme vous le voyez, et mes braves compagnons de voyage ne sont pas plus mal que moi. J'espère que madame Riel et vous, êtes en parfaite santé. (Ils donnent tous la main à Madame Riel, et réponses suivant l'usage.)\n\nRIEL.—Plaise à Dieu ! nous ne sommes pas malades, et va sans dire que nous sommes très heureux de vous voir arriver ici.\n\nOUELLETTE.—Si tout allait bien, comme nous nous portons, tout le monde serait content.\n\nMARGUERITE.—Vraiment, votre visite inattendue nous réjouit. Soyez les bienvenus et veuillez vous considérer comme chez vous, et agir en conséquence. (Tous s'assègent, Riel et sa femme, déposent chapeaux et pardessus, etc.)\n\nMARGUERITE.—Vous allez causer un instant ensemble, pendant que je vais vous préparer quelque-chose de chaud, pour vous réconforter un peu, en attendant le souper.\n\nDUMONT.—S'il vous plaît, mad. Riel, ne vous donnez pas de troubles. Nous accepterons ce que vous avez de prêt sous la main : il nous faut absolument partir ce soir.\n\nRIEL.—Quoi ! Etes-vous sérieux ?\n\nMARGUERITE.—Vous venez de trop loin, pour nous faire une si courte visite !\n\nRIEL.—Vous avez trop de choses à nous raconter pour que vous puissiez nous laisser si vite que cela.\n\nOUELLETTE.—C'est vrai, Riel ! mais nous pouvons tout vous dire en bien peu de mots, et déjà vous devinez les raisons qui nous amènent ici.\n\nMARGUERITE.—Dans tous les cas, il vous faut\nprendre quelque nourriture et un peu de repos. Je ne vous ferai pas attendre longtemps, ensuite, j'espère que vous me laisserez mon mari ! (Elle sort.)\n\nDUMONT.—Comment se fait-il que madame Riel nous demande une telle faveur ?\n\nRIEL.—C'est qu'elle vient de saisir les motifs qui vous conduisent ici. Quant à moi, je vois bien que vous êtes venus me chercher.\n\nDUMONT.—Eh ! bien... Oui ! Riel. Nous venons vers vous implorer votre secours, voici la lettre officielle. (Il la passe à Riel.) Votre présence est absolument requise dans le Nord-Ouest. Vous êtes le père du peuple métis, dans le Manitoba c'est vous qui avez établi, en 1870, les bases inébranlables sur lesquelles repose l'édifice de son existence nationale. Eh bien ! dans des districts plus reculés et surtout sur les bords de la Saskatchewan, il y a un autre groupe de la nation métisse, qui doit vous être aussi cher. Cette population lève les mains vers vous et vous appelle à grands cris pour la revendication de ses droits outragés, et pour une résistance efficace à l'extermination dont elle est menacée. Elle voit en vous, son libérateur, et vous attend avec impatience pour l'arracher des mains de ses implacables ennemis.\n\nQUELIFETTE.—Je comprends que madame Riel va tout naturellement prendre les moyens de vous retenir ; mais, après tout, elle a un cœur noble et généreux, et finira bien par consentir à votre départ.\n\nRIEL.—Mes bons amis ! que voulez-vous que je fasse ? Je sens que j'appartiens à ma famille dont je suis le seul appui.\nSCÈNE III.\n\nLes mêmes, Marguerite entre.\n\nMarguerite.—Allons ! messieurs, venez, s'il vous plaît, par ici et tâchez de réparer vos forces. Vous serez assez bons pour m'excuser quelques instants : j'ai à rester ici avec mes enfants. (Ils sortent tous, excepté Marguerite.)\n\nSCÈNE IV.\n\nMarguerite, ses enfants.\n\nMarguerite (Elle s'assied, prend son mouchoir et se met à pleurer, elle se lève).—Mon Dieu ! quel triste sort m'est encore réservé ! Voir partir mon mari pour si loin !... exposé à tant de dangers ! peut-être aux balles de ses plus cruels ennemis !... peut-être à la mort sur l'échafaud ! Il prend bien en main la cause la plus sublime !... la défense d'un peuple opprimé. La Providence pourrait bien le seconder et le conduire à la victoire !... tout cela n'est pas impossible !... mais je ne sens pas moins mon cœur se déchirer ! (Elle pleure.) Mon mari va partir !... mon époux, mon seul appui, va nous laisser pour une expédition si lointaine et si périlleuse !... non !... je ne me sens pas la force de faire le sacrifice de lui permettre de l'entreprendre.\n\nPetit Jean.—Non, maman, papa ne partira pas ! Le soir, nous serons seuls et plus de papa pour nous prendre sur ses genoux.\n\nMarguerite.—Mes chers enfants, vous vous trouvez heureux parce que le bon Dieu vous a\ndonné un bon père et une bonne mère. Priez bien le petit Jésus pour qu'il vous conserve votre cher papa (Elle pleure.)\n\nSCENE V.\n\nLES MÊMES : RIEL, DUMONT, JACKSON, OUELLETTE, ISBISTER entrent.\n\nRIEL.—Allons, chère femme, je m'imagine pourquoi tu verses de si abondantes larmes ! Ne pleure donc pas. Écoute-moi ! je ne suis pas encore parti pour le Nord-Ouest. Je comprends combien ce départ te serait pénible ! Une telle séparation s'accompagne de déchirements !.. Mais, je t'en prie, examinons la question.\n\nMARGUERITE.—Je sais qu'un noble devoir t'appelle et qu'il t'est difficile de ne pas y répondre. Mais ne dépendons-nous pas de toi ? Si tu t'éloignes de nous, qui va nous tenir à l'abri de tant de misères ? Si, là-bas, tu succombes sous les traits de l'ennemi, qui pourra alors nous consoler et avoir soin de nous ?\n\nRIEL.—Chère femme, nous ne voulons pas nous mettre sous les armes pour anéantir ou chasser cette vermine qui porte son travail destructeur jusqu'aux racines de l'arbre de notre nationalité. Notre intention est seulement d'adresser, plus solennellement que jamais au gouvernement d'Ottawa, des pétitions par lesquelles il verra que nous sommes franchement décidés à nous faire respecter et à obtenir les titres que nous sollicitons depuis tant d'années.\n\nMARGUERITE.—Il est clair que je ne gagnerais rien à vouloir t'empêcher de te rendre dans le\nNord-Ouest. Le patriotisme t'emporte! tu te fais illusion sur les écueils auxquels tu t'exposes. Je ne veux pas t'accuser de témérité. Oh! non; puisqu'il ne s'agit que d'intentions de paix. Mais écoute, Louis : te voyant à la tête d'une nation en butte à l'iniquité, sachant qu'elle compte sur toi pour sa délivrance, tu deviendras terrible comme un lion et ton ardeur belliqueuse pourrait entraîner ton peuple aux armes et le faire marcher contre ses oppresseurs. Qu'adviendrait-il si, en cas de guerre, tu tombais entre les mains des ennemis? Ceux qui gouvernent à Ottawa te haissent tant et sont si injustes à l'égard de tous nos pauvres compatriotes, qu'ils se serviraient du vain prétexte de haute trahison pour terminer tes jours sur la potence. N'est-ce pas qu'il en serait ainsi, mon cher Louis?\n\nRIEL.—Tu veux donc que je laisse ensevelir notre patrie sous les flots dévastateurs des injustices les plus affreuses? tu veux donc que je reste sourd aux gémissements de nos frères en détresse? Entraînés dans l'abîme, ils me tendent la main pour les sauver! puis-je leur tourner le dos ou les regarder périr sans faire le moindre mouvement pour les secourir?\n\nMARGUERITE.—C'est bien triste et lamentable de voir ceux de notre race terrassés par les méchants! Mais puis-je souffrir que tu cours le danger de devenir victime de cette secte enragée qui, comme une panthère, attend l'occasion la plus favorable pour se précipiter sur toi et te dévorer? Si, pour opposer une barrière inéchappable aux torrents destructeurs de la perfidie orangiste, qui inondent les belles prairies du Nord-Ouest, tu plonges ta femme et tes enfants\ndans la plus grande des infortunes et la douleur la plus cuisante, ne vaut-il pas mieux que tu demeures avec nous ? Les lamentations des métis parviennent à tes oreilles, et ton cœur te porte à voler à leur secours ; c'est magnifique ! mais n'as-tu pas mes pleurs pour te retenir ici ?\n\nRIEL.—Ma femme !... Embrasse-moi (Ils s'embrassent.) Que puis-je faire? j'éprouve un déchirement qui m'entève toute liberté d'action !\n\nDE MONT.—Madame Riel, je ne peux nier que c'est déchirant pour vous de voir partir votre mari pour une entreprise aussi grave que celle de venir donner la liberté au petit peuple de la Saskatchewan. Laissez-moi vous avouer sincèrement, néanmoins, que vous vous exagérez notre situation. Venant du théâtre de nos troubles, nous connaissons la portée des événements et pouvons vous affirmer et vous garantir qu'aucun de nous n'aura à se compromettre aux yeux de la loi. Soyez convaincue que, dans l'accomplissement de la mission importante qui lui est imposée, votre époux, votre soutien ne perdra pas la vie. Nous vous promettons que nous aurons bien soin de lui et que nous saurons le préserver de tous malheurs. En face de cette assurance, lui refuseriez-vous de vous resigner au sacrifice de le laisser courir à la défense de nos foyers si abominablement maltraités ?\n\nRIEL.—D'ailleurs, chère Marguerite, ne nous faisons-nous pas les défenseurs d'un peuple odieusement persécuté? N'avons-nous pas, alors, Dieu avec nous? Supposant que je succomberais pour la patrie, ne penses-tu pas que le bon Dieu te prendrait sous sa protection toute-puissante? Vive Dieu et la patrie!\nTous chantent :\n\nMourir pour la patrie\nC'est le sort le plus beau ;\nLe plus digne d'envie.\n\nRIEL.—Ecoute, ma chère femme, nous allons arranger les choses comme des gens sages. Vu que les événements se corsent dans le Nord-Ouest, je vais partir dès ce soir, si tu le veux. Dans quelques semaines, tu t'en viendras avec les enfants à St-Vital. Tu seras là beaucoup plus près du théâtre de nos travaux. Je vais donner des ordres pour les préparatifs de ton départ et pour que le voyage se fasse de la manière la plus heureuse.\n\nMARGUERITE.—Eh bien ! Louis, je correspond aux éclats de ton patriotisme. Vos protestations ne me font pas renoncer à la conviction que là-bas tu mourras victime de ton dévouement. Cependant, ta cause étant celle d'un héros, je souhaite que tes aspirations atteignent leur but... Pars, Louis, et que Dieu aide ton chemin. S'il faut ta mort, pour planter l'arbre de la liberté dans le Nord-Ouest, ce sera un sacrifice qui me fera gémir tous les jours de ma vie. Fasse le ciel qu'un tel héroïsme soit pour moi et les enfants une source de bénédictions. (Elle pleure)... Nous vivions si tranquilles et si heureux... mais il importe de sauver la patrie... ce mot si doux, la patrie !... Allons ! cher Louis, courage et au revoir. (Elle se jette au cou de Riel et l'embrasse.)\n\nRIEL (il embrasse sa femme).—Eh bien ! chère femme, je vais te laisser !... (prenant sa main) mais je me console !... Ce ne sera pas pour bien\nlongtemps. Bonjour, ma chère, et que le bon Dieu te protège avec mes chers petits enfants. (Il prend ses enfants qui pleurent avec leur père et leur mère.)\n\nDE MONT (regardant Marguerite).—Le courage ne vous manquera pas, chère amie ! Une belle récompense suivra avant longtemps cet acte sublime de générosité. (Tous les délégués lui donnent la main et sortent avec Riel.)\n\nSCENE VI.\n\nMarguerite seule avec ses enfants.\n\n(Elle s'assied et tient ses enfants, pendant que Riel et les délégués sortent. Ensuite elle se lève).—J'étais si heureuse ! Louis se trouvait éloigné de toutes les causes qui pouvaient l'exciter, par rapport aux troubles du Nord-Ouest. Combien la vie humaine est instable ! Hier pleine de tranquillité et de jouissances ! aujourd'hui sous le manteau de la tristesse ! Mon Dieu ! tout vient de vous et tout doit retourner vers vous. Depuis quelques années, vous avez voulu que je sois heureuse, et je dois vous en remercier. Maintenant votre main s'apresantit sur moi, et je la bénis. Que votre volonté soit faite !\n\nSCENE VII.\n\nLes mêmes, Riel entre.\n\nRIEL.—Me voilà, ma bien-aimée !\nMARGUERITE.—Louis, mais c'est toi !\nRIEL.—Oui chère ! (attention aux enfants) Réflexion faite, nous avons cru qu'il vaut mieux\nde retarder notre départ, afin d'avoir le temps de régler toutes nos affaires. Toi et les enfants allez faire route avec nous.\n\nMarguerite.—Que je suis contente, pourvu que là-bas tu ne te fasses pas tuer. (Ils sortent et on enlève tout sur le théâtre.)\n\nSCÈNE VIII.\n\n(Un tableau représentant le bois et la campagne.)\n\nMaxime Lépine et Baptiste Vendal entrent.\n\nMaxime Lépine.—C'est épouvantable ! Comment faire pour endurer toutes ces tracasseries révoltantes dont ces protestants et ces orangistes se plaisent à remplir le pays ?\n\nVendal.—Le mécontentement de nos concitoyens augmente à vue d'œil ! L'agitation des esprits est si croissante, qu'il me semble qu'un recours à une prise d'armes est inévitable !\n\nMaxime Lépine.—Hélas ! les jours de notre existence comme peuple sont-ils comptés ?... Pourtant nos ennemis ne peuvent pas réussir à nous assujétir et à nous faire mourir ! Ne sommes-nous pas revêtus de l'armure invincible du droit ? Nos mains ne sont-elles pas armées du glaive de la justice ?\n\nVendal.—La justice ! Le droit pour nous, Maxime ! Il n'y en a plus aux yeux de nos misérables et barbares tyrans.\n\nMaxime Lépine.—Quand donc Briel va arriver ? Il ne doit pas être loin, maintenant. Il va juger s'il nous devons prendre les armes ou si, par une agitation constitutionnelle, nous pouvons obtenir une solution pacifique des graves pro-\nhièmes qui lui seront soumis, concernant la déchéance ou la liberté d’un peuple tyrannisé par un pouvoir servant d’instrument à la secte la plus vile et la plus détestable aux yeux du monde chrétien.\n\nVENDAL.—C’est ce que j’espère ! sans plus de retard, ce serait mieux que nous irions à la rencontre de ce grand patriote. (Ils sortent.)\n\nSCENE IX.\n\nUn jeune garçon entre.\n\n(Pendant qu’il époussete).—Vive Riel ! Vive la liberté ! Je n’aurais pas peur, je vous l’assure, de braquer mon pistolet sous le nez de tous les mouchards orangistes.\n\nSCENE X.\n\nRIEL, DUMONT, OUELLETTE, MAXIME LÉPINE ET UN BON NOMBRE D’AUTRES MÉTIS entrent. RIEL dans le milieu.\n\nDUMONT.—Compatriotes, nous avons enfin à notre tête le héros du Manitoba ! Ce vaillant défenseur de la patrie et de la liberté ! Ce magnanime et immortel patriote, extraordinaire par son admirable désintéressement et qui a “toujours tout sacrifier, même ses intérêts les plus chers, même le bien-être de sa famille à ce qu’il considère ses devoirs publics ! ” Cet homme d’état incomparable à qui le Manitoba doit sa constitution actuelle, la charte de ses libertés civiles et politiques ! O illustre patriote, chevalier sans peur et sans reproche ; l’histoire dira que, dans le Manitoba, “vous avez conservé à vos\nfrères leur héritage paternel, que vous avez fait reconnaître et proclamer les droits des enfants du sol, que vous avez doté votre pays natal d'institutions égales par l'ampleur des libertés et par la perfection de la forme, à celles de la métropole.\" (Paroles de \"L'Étendard\" de Montréal.)\n\nDe plus, elle dira que, dans cette œuvre mémorable, vous avez été aidé par les apôtres de la foi, qui ont droit à ce qu'on les appelle, eux aussi, les \"principaux artisans des libertés civiles et des franchises politiques du Manitoba.\" (Et. de M.)\n\nAujourd'hui, nous comptons sur votre sagesse et votre habileté pour obtenir d'Ottawa l'octroi de notre charte politique. Si pour nous faire monter au sommet de la plénitude de nos droits civils et politiques, vous jugez nécessaire de nous engager dans la voie de l'effusion du sang, nous sommes prêts à répondre à votre appel. D'un autre côté, si, à l'encontre de notre extrême indignation, vous croyez devoir nous donner une impulsion nouvelle dans la voie des pétitions, nous sommes à vos ordres.\n\nMAXIME LÉPINE.—Quelles concessions pouvons-nous obtenir d'Ottawa ? À quoi vont nous servir de nouvelles requêtes ? Depuis 15 ans, des pétitions collectives sont expédiées au gouvernement, et nous n'avons pas encore de réponse. Presque tous les colons sont allés individuellement porter leurs plaintes et adresser leurs demandes aux employés des bureaux du gouvernement canadien, dans cette province. Comment nous ont-ils invariablement répondu. Si nous leur parlions en français, ils nous tournaient le dos en laissant tomber de leurs lèvres britan-\nniques et dédaigneuses, ces mots caractéristiques de la race supérieure : I don't understand. Si un de nous s'adressait à eux dans leur langue officielle, ils lui disaient : Il nous est regrettable de vous annoncer qu'il est impossible de donner suite à vos demandes, attendu qu'une application antérieure a été faite à Ottawa pour le même terrain, par une autre personne. Ainsi donc, à Ottawa et ici, à côté de nos réclamations, silence, mutisme, despotisme et dénis de justice constants. Nous avons demandé aux ministres de la capitale de faire arpentner nos lots tels qu'ils sont et ils ne nous ont pas encore accordé ces arpentages. Les terres qui nous appartiennent en vertu de tout droit, ils nous obligent à les acheter... et... à conspiration infernale !... lorsque nous nous présentons aux officiers subalternes du gouvernement, pour nous mettre en sécurité contre toute dénégation de nos droits les plus inviolables, ils examinent sur le plan, la condition de nos terrains, et, s'ils la trouvent trop avantageuse, ils ont l'audace de nous déclarer qu'une application antérieure a été faite par une autre personne.\n\nNous avions des places à soin, des communes et des endroits de pacage pour nos chevaux et nos bestiaux, et les tyran d'Ottawa se sont permis de nous en priver ! Nous avions des terres à bois, et ces criminels représentants de l'autorité canadienne nous les ont ôtés, et nous imposent un impôt spécial ou nous coutraignent à acheter un permis pour nous procurer le bois dont nous avons besoin. Je me borne là à lever un peu le coin du rideau, en arrière duquel se cachent les atrocités sans nombre, qu'un gouvernement pré-\nvaricateur laisse et fait accumuler pour notre ruine.\n\nJe pose maintenant cette question pratique. Qu'avons-nous à attendre d'Ottawa ? Comment voulez-vous qu'un gouvernement qui a forfait à l'honneur en venant s'installer au Manitoba, au mépris des engagements les plus solennels, n'ait pas tout intérêt à se montrer sourd à nos prières ? Se rappelle-t-on les arrangements qu'en 1870, il a conclu avec les délégués métis du Manitoba ? A-t-il rempli les obligations du traité, lorsque la proclamation d'une amnistie qu'il nous avait promise est encore dans le domaine des choses futures ? A-t-il observé les clauses du traité, lorsqu'après avoir expulsé du Parlement ce grand patriote, il a eu assez de bassesse pour le bannir ? N'a-t-il pas foulé aux pieds l'inviolabilité du traité, lorsque, n'ayant pas réussi à faire monter sur l'échafaud mon frère Ambroise, il l'a envoyé en exil, privé pour toujours de ses droits politiques. Ne s'est-il pas moqué du traité, lorsque les scrips, les titres, les lettres patentes qui devaient être accordés dans le Manitoba, ont été traînées si longtemps en langueur.\n\nOUELLETTE.—C'est le temps de dévoiler aussi comment la Puissance du Canada a tenu compte, par rapport à moi, des stipulations de 1870. J'ai demandé à Ottawa et aux bureaux de ses agents, les scrips d'un de mes enfants défunt et de mes vieux parents, et on s'est toujours obstiné à me les refuser, me disant qu'ils avaient été volés.\n\nMAXIME LÉPINE.—Voilà encore une preuve de la malveillance insurmontable du ministère fédéral !\nRIEL — Mes bien-aimés compatriotes, je vois bien que nos ennemis ont déjà porté des atteintes mortelles à la sécurité de nos demeures. Nous sommes réellement traités comme des parias. Qu'avons-nous fait ? Est-ce un mal pour nous, de respirer et de vivre ? Est-ce un mal pour nous d'avoir une patrie qui nous a vus naître, grandir, prospérer dans la voie de la justice ? Non, puisque la justice mène les peuples au sommet de la grandeur. Pourquoi donc nos ennemis, sous la tutelle d'un gouvernement égoïste, persistent tant à nous disputer nos droits, nos privilèges, notre liberté ? Est-ce parce que nous ne sommes pas nombreux ? Mais la force de nos droits ne se mesure pas sur la faiblesses de notre nombre ! Courbés sous le poids des iniquités et des calamités, qu'avons-nous à faire ? Répondant à votre appel, j'assume une charge dont la responsabilité me paraît terrible ! C'est pourquoi, dès maintenant, je vous conseille de ne pas renoncer aux éléments de l'ordre. Croyez-moi, je suis venu \"passer quelques mois parmi vous, dans l'espérance qu'à force d'envoyer des pétitions, nous obtiendrons du gouvernement, le redressement de tous nos griefs.\" Mes bons amis, réfléchissez et vous serez convaincus qu'il vaut mieux pour nous tous de ne pas penser encore à la guerre. C'est dans cette conviction que \"j'ai traversé les lignes, sans armes et sans munitions, emmenant avec moi ma femme et mes enfants.\" Allons ! bon courage et mettons nous à l'œuvre. (Ils sortent tous)\nSCENE XI.\n\nLANGEVIN (il entre).—Partout il y a apparence de guerre ! Mais je me le promets bien, personne ni d'un côté ni de l'autre ne sera capable de me rejoindre pour m'entêter. Oh !... je frémis, quand je pense comme c'est effrayant d'être au milieu de tous ces coups de fusils; de ces balles, de cette épaisse fumée ! Ah ! non, je ne serai pas assez bête pour aller m'exposer comme ça ! Me faire tuer ! Serai-je plus riche ensuite ?\n\nSCENE XII.\n\nLE MÊME, VENDAL.\n\nVENDAL.—Bien, mon brave Langevin, prépare-toi ! La guerre me semble inévitable ! Non pas que Riel veut que les premiers nous commençons l'attaque, mais il s'attend que les soldats du gouvernement vont ouvrir le feu !\n\nLANGEVIN.—C'est-i vrai, oh mon Dieu !\n\nVENDAL.—Depuis des mois, Riel nous fait pétitionner sans succès...\n\nLANGEVIN.—Tiens ! il faut espérer !\n\nVENDAL.—Et il attend en vain la commission officiellement chargée de venir régler nos réclamations.\n\nLANGEVIN.—Tu vois ben, il faut attendre !\n\nVENDAL.—Oui ! et, pendant que les ministres diffèrent-le départ de cette commission, ils vendent à des spéculateurs appartenant à une société de colonisation la paroisse de St-Louis de Langevin.\n\nLANGEVIN.—C'est pas moué, ni toué, laissons faire !\nVENDAL.—Terrain de l'église, chapelle, terre de l'école, 35 propriétés ont été arrachées aux familles métisses de cette paroisse, et ça te touche si peu !\n\nLANGEVIN.—Ça me frotte pas comme du plomb, toujours ben !\n\nVENDAL.—Ces pauvres familles se sont toutes soulevées, dans leur indignation.\n\nLANGEVIN.—Bon ! elles veulent se faire casser la mâchoire !\n\nVENDAL.—Ce soulèvement a gagné tous les environs de Prince Albert.\n\nLANGEVIN.—Mais sont-ils sérieux !\n\nVENDAL.—Un grand nombre de métis sont déjà réunis dans ce fort ; ils font des assemblées pour protester contre le gouvernement qui tarde toujours d'envoyer la commission, nommée officiellement le 28 janvier dernier. Déjà ils sont sous les armes.\n\nLANGEVIN.—C'est ça ! ils vont finir par être causé qu'il ne faudra aller en guerre !\n\nVENDAL.—Mgr Grandin, le père André et Riel ne cessent de leur recommander la modération.\n\nLANGEVIN.—Ah ! que c'est ben ça ! pourquoi pas les écouter ?\n\nVENDAL.—Oui, mais Lawrence Clark vient de nous assurer que la police à cheval, connaissant ce qui se passe dans Prince Albert, se propose de s'y rendre pour faire des arrestations. Riel a jugé opportun de nous tenir sur la défensive. Il croit que nos démonstrations armées vont empêcher la police montée d'entamer les hostilités. C'est pourquoi il nous ordonné de tous nous unir comme un seul homme.\nLANGEVIN.—Ça va aller loin, je le vois ben...\nVENDAL.—Pour moi, je crois que nous allons nous battre! (Il prend Langevin par le bras.)\nOh! viens te montrer homme.\nLANGEVIN.—Ne fais donc pas le brave!\nVENDAL.—Vite! avance! nous avons appris, de plus, que le major Crozier, rouge de colère parce que Dumont a forcé McKay de rebrousser chemin avec ses provisions, s'en vient à la tête d'une centaine d'hommes, à la rencontre de ce brave qui n'en aura pas peur, sois-en sûr.\nLANGEVIN (il résiste).—Laisse-moi aller!\nVENDAL.—Tu vois que nous sommes en quelque sorte poussés sur le champ de bataille. Oh! viens avec moi! (Langevin fait un bond et prend la fuite, il sort; Vendal court pour le rejoindre.)\n\nSCENE XIII.\n\n(Dumont avec quelques-uns de ses 20 cavaliers apparaît sur un des côtés du théâtre)\n\nDUMONT.—Mes braves amis! Voyez Crozier!\nIl vient avec une centaine de soldats en uniforme.\nS'ils veulent nous arrêter ou s'ils nous attaquent,\ndéfendons-nous jusqu'à la mort. Le voilà!\nÉcoutez ce qu'il dit. Couchons-nous!\n\nSCENE XIV.\n\n(Crozier avec une partie de sa police montée et de ses militaires, se montre sur l'autre côté du théâtre.)\n\nCROZIER.—Dumont, au nom de Sa Majesté, je vous ordonne de mettre bas les armes!\nDUMONT.—Au nom de notre Souveraine, je vous avertis que, si vous ne vous en allez pas,\n\"ce sont nous qui allons faire mettre bas les vôtres.\"\n\n(Alors un sauvage saute sur un homme de la police montée, pour lui arracher son arme. Celui-ci le jette à terre, et au moment que ce sauvage se relève, il le tire et tue instantanément. Alors les braves de Dumont se lèvent et lancent une décharge, qui fait tomber plusieurs militaires et un officier de la police montée. Les hommes de Crozier en font autant. Personne ne tombé du côté de Dumont.)\n\nDUMONT.—Eh ! bien, Crozier, est-ce assez bon pour 20 métis ?\n\n(Encore quelque fusillade).\n\nDUMONT.—Vos balles, Crozier, silencent à nos oreilles et ne nous écorchent même pas la tête ! Oh ! utiles braves !\n\n(Une autre fusillade, Crozier retombe.)\n\nDUMONT.—Honte aux anglais ! 30 métis de sang français repoussent 100 balles de la race supérieure ! Fuyez, bande de peureux, de poltrons ! Que vous avez l'air brave ! (Il s'avance sur le théâtre avec ses braves.) Vaillants compatriotes ! vous avez combattu comme des héros ! Nous ne sommes pas plus nombreux que les doigts de la main, et nous avons vaincu Crozier à la tête de militaires prétendant être bien disciplinés. Ces lâches-là ne sont braves que devant de pauvres sauvagesses et d'infortunées femmes médisées. Ils viennent, aujourd'hui, de s'immortaliser comme les héros de la peur ! Quelques-uns de nos hommes sont blessés, et nous n'en avons que quatre de tués. Enterrons ces héros, morts pour la patrie, et prenons soin de nos frères blessés. (Pendant ce discours, quelques-uns\nauront soulagé les blessés.) Ainsi de permettre à nos ennemis d'enregistrer leur défaite, allez compter le nombre des morts qu'ils ont laissés sur le champ de bataille. (Deux vont de l'autre côté du théâtre, regarder par une coulisse comme pour faire voir que des soldats morts se trouvent là.) Notre bravoure invincible va-t-elle vaincre tous ces habitants rouges que ne n'empêchent pas pour causer du trouble que nous revendiquons le droit de vivre tranquilles dans notre pays ? (Les deux métis reviennent.) Eh bien ! Combien en avons-nous culbutés de ces pirates de savane ?\n\nUN SOLDAT.—Il y en a 14 de tués, 14 volontaires et 3 hommes de la police montée.\n\nDUMONT.—Bravo ! pour les défenseurs de la patrie ! Rappelons-nous toujours de cette victoire remportée près du Lac au Canard. (Ils sortent tous.)\n\nSCENE XV.\n\n(Vendal entre aussitôt tenant en avant de lui Langevin.)\n\nVENDAL.—Ah ! là je te tiens ! tu ne m'échapperas plus ! Ne viens-tu pas t'apprendre la victoire de Dumont contre Crozier ?\n\nLANGEVIN.—Je n'étais pas là, bonne chance !\n\nVENDAL.—La guerre est commencée. Le ministre de la milice, à Ottawa, vient d'appeler en service actif et d'expédier au Nord-Ouest tous les volontaires répartis dans les différentes villes de la Puissance.\n\nLANGEVIN.—Bonjour de la vie ! ils vont ben tous nous assommer !\n\nVENDAL.—Comprends-tu maintenant, pourquoi le gouvernement fédéral a mis en force, le\n1er de janvier dernier, une loi défendant de nous réunir, même de nous trouver deux ensemble?\n\nLANGEVIN.—Ah! c'est vrai! Ben, va-t-en et laisse-moi aller de mon bord.\n\nVENDAL.—Ah! tout le monde voit, maintenant, que c'est la guerre que les autorités canadiennes ont toujours voulue.\n\nRiel déplore ce malheur, il vient de se donner une autorité absolue, il veut que tout le monde lui obéisse, il organise un conseil pour l'aider, et il ordonne de mettre à mort tous ceux qui, en état de porter les armes, refusent de répondre à l'appel. Oui! il nous appelle tous à la défense de la patrie! Pour nous prouver sa puissance, il obscurcit le soleil et opère d'autres miracles. Donc rien à craindre avec lui et marchons à la victoire! (Il tire Langevin.)\n\nLANGEVIN (il se laisse tirer un peu).—Oh! écoute, Vendal, c'est effrayant, comme j'ai peur!\n\nVENDAL.—Es-tu de la même pâte dont est fait cet homme niais et lâche, qu'on appelle Sir Hector?\n\nLANGEVIN.—Je sais pas; dans tous les cas, je me sens trop faible pour aller à la guerre. (Il tremble.)\n\nVENDAL.—Avance, ou je te flamble la cervelle! des hommes poltrons ne méritent pas de vivre quand le pays est en danger! (Ils sortent.)\nSCÈNE XVI.\n\n(Au lever du tableau visible jusqu'à cette scène, apparaîtra une chambre où l'agent des sauvages T. P. Quinn est couché sur un lit. Au fond de cette chambre un tableau représentant une église et quelques maisons.)\n\nMAUVAIS-ENFANT (il entre furtivement, tient son fusil prêt à tirer, s'approche du lit.)\n\nLOVEMAN (il suit Mauvais-Enfant par derrière, l'arrête en criant).—Que voulez-vous faire ? (Il se met entre le lit de Quinn et Mauvais-Enfant.) Vous ne tuerez point cet homme.\n\nMAUVAIS-ENFANT.—Pourquoi pas ! tous nous autres haïr lui ! lui... faire souffrir nous depuis trop longtemps.\n\nT. P. QUINN (il se lève).—Comment ! tu veux me tuer ! y penses-tu, Mauvais-Enfant ? tu aurais été pendu par le gouvernement si tu avais tiré sur moi !\n\nSCÈNE XVII.\n\nLES MÊMES ET ESPRIT VOYAGEUR.\n\nESP. VOY. (il se tient à la porte du théâtre comme en bas d'un escalier).—\"L'homme qui parle le sioux, descends.\"\n\nLOVEMAN.—Quin, je vous avertis, ne descendez pas !\n\nQUINN.—Je n'ai pas peur d'eux, et je veux le leur montrer. (Il sort en faisant semblant de descendre un escalier, Loveman le suit avec Mauvais-Enfant.)\n\nESP. VOY. (seul).—Je suis ben content à cte heure ! nous enfin avoir le dessus. Moué faire mener tous les blancs à la maison de Delaney ; moué avoir le plaigir de commander Quinn ; moué lui dire : là-bas, allez vous aussi chez Delaney. (Il sort.)\nSCENE XVIII.\n\n(Des munitions auront été emportées sur le théâtre,\nainsi que des marchandises, chapeaux, couvertes, etc.)\n\nCAMERON (seul).—En entrant) J'ai le pressentiment que d'effreux malheurs vont nous arriver aujourd'hui...\n\nSCENE XIX.\n\nLE MÊME, ESP. VOY., MAUVAINS-ENFANT ET QUELQUES AUTRES SAUVAGES.\n\nMAUVAINS-ENFANT.—Cameron, \"avez-vous des munitions dans le magasin ?\"\n\nCAMERON.—\"Oui, un peu.\"\n\nMAUVAINS-ENFANT.—\"Je veux que vous me les donniez. Simon, nous nous en empaterons.\"\n\nCAMERON.—\"Si vous tenez à les avoir, je vais vous les donner, plutôt que de vous voir piller le magasin.\"\n\n(Ils se mettent à prendre des munitions, et aussitôt Gros-Ours entre.)\n\nGROS-OUPS (faisant tourner sa canne).—\"Ne touchez à rien ici, dans le magasin de la Compagnie, si vous avez besoin de quelque chose, demandez-le à M. Cameron.\" (Ils sortent tous n'apportant rien avec eux, Cameron disparaît par une autre issue et on enlève tout sur le théâtre!)\n\nSCENE XX.\n\n(Le père Hasard, le père Marchand, Quinon, Delaney et les autres blancs du Lac aux Grenouilles entrent et paraissent comme rassemblés dans la maison de Delaney. De plus, Esprit Voyageur et quelques autres sauvages.\n\nESP. VOY.—\"Je veux savoir quel est le chef des blancs dans ce pays. Est-ce le gouverneur de la compagnie de la Baie d'Hudson, ou qui?\"\nQUINN (en riant).—\"Il y a un nommé Sir John MacDonald à Ottawa, qui est à la tête des affaires du pays.\"\nEsp. Voy.—\"Voulez-vous nous donner du bœuf?\"\nDELANEY.—Oui? nous pouvons vous en donner un ou deux. (Ils sortent tous.)\n\nSCENE XXL\n\nCHARLIE GOUIN SEUL (en entrant).—Mon Dieu! qu'allons-nous devenir? Les sauvages nous ordonnent de nous rendre tous à leur camp! Ils nous font prisonniers! Nos pauvres femmes, quelles ignominies et quelles cruautés les attendent de la part de ces êtres barbares!\n\nSCENE XXII.\n\nLE MÊME ET QUINN.\n\nQUINN (en entrant).—Etes-vous décidé, Charlie, de vous rendre au camp de Gros-Ours? Esp. Voy. vient de m'ordonner de faire comme les autres, d'aller au camp. Mais il ne me dérange pas fort.\n\nSCENE XXIII.\n\nLES MÊMES, ESPRIT VOYAGEUR.\n\nEsp. Voy. (en entrant).—\"Vous avez la tête dure; quand vous dites non, c'est non, et vous êtes fidèle à votre parole. Eh bien, si vous tenez à votre vie, vous allez faire ce que je vais vous dire.\" Allez au camp.\"\n\nQUINN.—Pourquoi irai-je?\"\nEsp. Voy.—\"Ne t'en inquiète pas\" (faisant un geste de menace).\n\nEsp. Voy.—\"Je t'ai dit d'aller\" (il lève son fusil et tue Quinn raide).\n\nGouin.—(Il marche vers la porte du côté opposé, un sauvage entre et le tue.)\n\nWilliscroft.—(A peine est-il entré, que Petit-Ours, le suivant de près, le tue.)\n\nAussitôt entrent Delanay, mad. Gowanlock, mad. Delaney, le père Fafard et le père Marchand, suivis par plusieurs sauvages. Des sauvages se jettent sur Delaney.\n\nPère Fafard.—Je vous en prie, mes pauvres frères, calmez-vous et ne lui faites aucun mal.\n\nCou Nu.—Il faut feu sur le père et abat ensuite Delaney.\n\nPère Marchand.—Il vole au secours du père Fafard et lève la main pour l'administrer.\n\nEsp. Voy.—Vous mourrez tous (il tue le père Marchand.)\n\nGowanlock.—Il s'en va en avant en entrant et prend la main de sa femme.\n\nEsp. Voy.—Il court vers Gowanlock et le tue.\n\nGowanlock.—Il s'affaisse dans les bras de sa femme (aussitôt le rideau est rabattu rapidement.)\n\nSCENE XXIV.\n\n(Batoche et ses environs représentés.)\n\nRiel et Maxime Lépine.\n\nRiel.—Pauvres compatriotes ! Combien nous coûtent cher la liberté et la tranquillité sur le sol de notre pays cheri ! Ah ! Dieu le sait : ce n'est pas l'ambition ni la vengeance qui nous ont\ndéterminés à combattre, devant le feu de l'ennemi, mais c'est l'amour de la patrie, de notre patrie qu'on veut nous ravir ! (Il marche la tête basse, et s'essuie les yeux.)\n\nMAXIME LÉPINE.—Riel, combattons et mourons les armes à la main, si nous ne pouvons pas remporter la victoire.\n\nSCÈNE XXV:\n\nLES MÊMES ET UN COURRIER.\n\nUN COURRIER (en entrant).—Bonne et mauvaises nouvelles !\n\nRIEL.—Eh bien ! expliquez-vous.\n\nUN COURRIER.—Gros-Ours et sa bande se sont rendus maîtres de la mission du Lac aux Grenouilles, peu après la bataille du Lac au Canard. Malheureusement ils ont massacré la plupart des blancs et deux missionnaires, le père Fafard et le père Marchand !\n\nRIEL.—Quel malheur irréparable ! Quelle honte s'attachera à l'histoire du Nord-Ouest ! Heureusement que nos ennemis ne pourront pas dire que ce sont nous qui avons porté ces sauvages à commettre ces meurtres ! Il est établi que ces indiens rêvaient depuis longtemps contre les agents du gouvernement, les crimes qu'ils viennent de consommer. Il n'y a pas de doute que ces missionnaires aient été tués en essayant de calmer ces sauvages et de protéger les blancs. Ensuite...\n\nUN COURRIER.—Gros-Ours et ses farouches guerriers, après avoir recommencé leurs danses de guerre, se sont dirigés vers Fort Pitt, dont ils se sont emparés. Ils ont avec eux des prison-\nniers, hommes et femmes, et fasse le ciel que ceux-ci aient la vie sauve ! Avez-vous appris que Poundmaker et sa tribu ont infligé une terrible défaite au colonel Otter, à la montagne du coup de Couteau ?\n\nRIEL.—Nous le savons...\n\nUN COURRIER.—Avez-vous entendu dire aussi qu'un grand nombre de tribus sauvages, sur les frontières, se préparent à entrer dans le sentier de la guerre ?\n\nRIEL.—Nous sommes au courant de ces événements. Les troupes du Canada doivent sapercevoir, maintenant, que, dans les métis, ils rencontrent des patriotes capables de défendre ce qu'ils ont de plus cher au monde !\n\nSCÈNE XXVI.\n\nLES MÊMES ET UN ÉCLAIREUR.\n\nUN ÉCLAIREUR (en entrant).—Le général Middleton apparaît avec sa brillante armée, beaucoup plus forte que nous !\n\nMAXIME LÉPINE.—Vaincre ou mourir ! (Ils sortent tous.)\n\nSCÈNE XXVII.\n\n(Des soldats métis remontent le théâtre, faisant la parade, et on entend des coups de canon, de fusil, de côté et d'autre, en arrière du théâtre.)\n\nSCÈNE XXVIII.\n\nLES MÊMES SOLDATS ET GABRIEL DUMONT.\n\nDUMONT.—Soldats ! Nous avons à répondre à des canons, à des mitrailleuses, à des ennemis.\nbeaucoup plus nombreux que nous. Mais notre cœur, notre patriotisme, notre ardeur, seront plus puissants que ces terribles agents de destruction. Allons en face des boulets et sauvons la patrie, qui fait appel à notre bravoure et à notre héroïsme. En avant donc et marchons comme des braves, qui savent vaincre ou mourir ! (Ils sortent tous et une forte fusillade se fait entendre.)\n\nSCÈNE XXIX.\n\n(De chaque côté du théâtre entrent deux messagers, un du camp de Middleton et l’autre du camp de Riel.)\n\nLE MESSAGER MÉTIS (tenant un drapeau blanc). — Tenez ! voici une lettre de notre chef Riel, dans laquelle il demande au général de protéger la maison où se trouvent les femmes et les enfants.\n\nLE MESSAGER ANGLAIS (il sort.)\n\nLE MESSAGER MÉTIS.—Ah ! maudits orangistes !... Ah ! les traîtres de notre sang ! si nous pouvions vous faire prisonniers !\n\nLE MESSAGER ANGLAIS entre. — Le général promet de respecter les enfants. De plus, le général me charge de vous donner cette lettre pour votre chef. Il lui demande de se rendre, lui promettant qu’il sera bien traité jusqu’à ce que le gouvernement ait décidé de son sort. (Ils sortent, et pendant ce temps-là, des fusillades plus ou moins fortes auront été entendues.)\n\nSCÈNE XXX.\n\nRIEL (il entre lentement et fait un tour sur le théâtre, ensuite il s’appuie sur une souche et paraît réfléchir. On entend une autre fusillade.)\n— Vais-je me rendre?... tout ce sang versé déjà, à cause d’un gouvernement voleur!... C’est lui qui nous entraîne dans cette guerre! Je n’ai engagé mes compatriotes dans le combat qu’à la dernière heure, lorsque nous nous sommes vus dans la nécessité de nous défendre; lorsque nous nous sommes vus attaqués et poursuivis par nos ennemis! Si réellement nous eussions voulu, depuis longtemps, nous soulever contre l’autorité, nous aurions pu faire prisonniers ou tuer tous ceux qui sont entrés dans notre pays avec des intentions de guerre! Dispersés de côté et d’autre, dans nos immenses prairies, comme ils l’ont été et le sont encore depuis le commencement de cette campagne, ils n’auraient pas aujourd’hui un souffle de vie, si nous avions la dixième partie de leur énorme méchanceté! La victoire de Dumont, les désastres des sauvages, d’autres triomphes encore qui seraient si faciles contre l’armée canadienne, ne le prouvent-ils pas? Nous sommes ici 50 métis patriotes contre les forces de Middleton quarante fois plus considérables! nous sommes un contre quarante! et depuis huit jours nous leur tenons tête! N’y a-t-il pas là un fait qui proclame notre valeur et atteste ce que nous aurions pu opérer?\n\nSi je me laisse faire prisonnier, l’Angleterre et le Canada vont considérer Middleton comme un héros et le décorer de tous les plus beaux titres. Oh! folie du siècle! Un général qui s’est couvert de tant de ridicule dans une échauffourée aussi humiliante!\n\nN’importe! Pour mettre fin aux horreurs de la guerre, pour le bonheur de mes semblables et la gloire de mon pays, ce serait peut-être\nmieux de répondre à l'invitation du général Middleton. (Une fusillade.) Allons ! Voilà deux de ses éclaireurs !\n\nSCENE XXXI.\n\nLE MÊME, ARMSTRONG ET HOURIE.\n\nARMSTRONG (en entrant).—Riel, voulez-vous vous rendre ?\n\nRIEL.—Je désire que vous ne me fassiez aucun mal et que vous me traitiez comme votre général me le promet, dans cette lettre. (Il lit la lettre.)\n\nBatoche, 11 mai.\n\nMonsieur Riel,\n\nJe suis prêt à vous recevoir, vous et votre conseil, et à vous protéger jusqu'à ce que le gouvernement ait pris des mesures à votre égard.\n\nMIDDLETON.\n\nASMSTRONG ET HOURIE (s'avançant vers Riel).—Riel, soyez sûr que le général tiendra sa promesse.\n\n(Ils le prennent par le bras et l'amènent. Le rideau se baisse.)\nPERSONNAGES DU 4ÈME ACTE :\n\nRIEL ..........................................\nMARQUETTE ....................................\nJULIE LAGIMODIÈRE (mère de Riel) .......\nBOWELL ........................................\nCAMPBELL ......................................\nCARON ...........................................\nMACDONALD (géolier) .......................\nDUMONT ........................................\nL. O. DAVID ....................................\nDUMAS ..........................................\nL'HONORABLE TRUDEL (sénateur canadien) .............\nSHERWOOD (commandant de la police de la Puissance du Canada)\nCHAPLEAU (shérif) ..........................\nPÈRE ANDRÉ ....................................\nLE DR. FAFARD ...............................\nLE DR. JUKES ..................................\nGIBSON (député shérif) .....................\nLE BOURREAU ..................................\nLES DOCTEURS DODD ET COLTON .......\nPÈRE McWILLIAMS ............................\nREPRÉSENTANTS DE LA PRESSE ...........\nJEAN-BAPTISTE (canadien des États-Unis) ...................\nACTE IVÈME.\n\nSOUFFRANCES DE RIEL DANS SON CACHOT. PENDANT SON DE CE HÉROS POLITIQUE. AFFLICTIONS DE LA MÈRE ET DE LA FEMME DE CE MARTYR. IL PERD UN DE SES ENFANTS AVANT DE MONTER SUR L'ÉCHAFAUD. SON ÉPOUSE SUCCOMBE APRÈS LA CONSOMMATION DU MEURTRE JUDICIAIRE DE REGINA. HONTE AU GOUVERNEMENT D'OTTAWA. QUE LA RACE FRANCO-CANADIENNE CHOISISSE : D'UN CÔTÉ, L'OPPRESSION ANGLAISE ET LE JOUG ORANGISTE, DE L'AUTRE, LA POLITIQUE LIBÉRALE DU PARTI RÉFORMISTE OU L'ANNEXION AUX ÉTATS-UNIS.\n\nSCÈNE I.\n\n(Au lever du rideau, un tableau représentait la prison de Regina. Riel traînant un boulet au talon et ayant les bras chargés de chaînes, une douzaine de gendarmes montant la garde et dont les trois principaux sont Campbell, Bowell et Caron.)\n\nLE GENDARME CAMPBELL (il marche).—Caron, vous n'avez pas l'air dans votre assiette aujourd'hui : Qu'avez-vous donc ?\n\nLE GEND. CARON.—Ma foi, le gouvernement devrait bien en finir avec ce trâtre, qui nous fait trouver les journées si longues. Garder un tel renégat donne des envies insurmontables de boire du rhum. En voulez-vous un petit coup, Campbell?\nLE GEND. CAMPBELL.—Oui, buvez d'abord, ce sera mon tour ensuite.\n\nLE GEND. CARON (il prend un coup à même de la bouteille).—Ah ! sacré que que c'est bon ! un petit coup, c'est doux ! Tenez, Campbell, (il lui passe la bouteille), ah ! que ça fait du bien ! Les ministres d'Ottawa devraient en regurgiter un peu, il y a là de quoi les mettre en train de nous débarrasser, au plus coupant, de notre visionnaire.\n\nLE GEND. CAMPBELL (il ingurgite une bonne dose).—C'est vrai, Caron, cette bonne liqueur leur donnerait un peu plus de ton. (Il remet la bouteille à Caron.)\n\nLE GEND. CARON (en prenant la bouteille, il chante).—Encore un petit coup de piton, pour nous remettre à la raison (bis).\n\nLE GEND. CAMPBELL.—Reellement, Caron, vous savez aussi bien boire qu'un honorable Cauchon avait la bonne manière de manger. Mais, écoutez, vous n'apprendriez rien à Sir John sous ce rapport-là.\n\nRIEL (il s'avance un peu en avant faisant entendre le bruit de ses chaînes, il se met à genoux, les gendarmes le regardent tous).—Mon Dieu, je suis un pauvre pécheur ! Ayez pitié de moi, selon votre infinie miséricorde ! Pardonnez-moi mes péchés, comme je pardonne à tous ceux qui me font du mal. Seigneur, je me repose en vous : soutenez-moi, sans cesse, au milieu de mon abandon et de mes souffrances, donnez-moi la force de boire jusqu'à la dernière goutte, le fiel de la haine inexorable de mes ennemis. (Il se lève et marche.)\n\nLE GEND. CAMPBELL.—Cessez vos lamentations, hypocrite.\nLE GEND. BOWELL.—Oh ! ne nous occupons donc pas des lubies de ce misérable !\n\nLE GEND. CAMPBELL.—Ce visionnaire m'ennuie ; parbleu !\n\nLE GEND. BOWELL.—C'est tout son plaisir, en attendant le jour de son égorgelement.\n\nLE GEND. CAMPBELL.—Mais, quand donc, nos aristocrates animés de l'esprit britannique vont-ils le suspendre aux bras noirs de la potence ?\n\nLE GEND. BOWELL.—Bientôt, Campbell, car il a fait peur aux anglais.\n\nSCÈNE II.\n\nLES MÊMES, LE GEOLOIR MACDONALD.\n\nLE GEOLOIR MACDONALD (en entrant).—Bien, prisonnier, le temps vous paraît-il beaucoup long ?\n\nRIEL.—Mon âme est en paix avec mon Dieu !\n\nLE GEOLOIR MACDONALD.—Comme vous nous avez jetés dans la terreur, notre âme n'est pas en paix avec vous. Aussi vous allez disparaître avant longtemps.\n\nRIEL.—Pourquoi les anglais fanatiques et les orangistes ont-ils eu peur de moi et me craignent-ils encore ?\n\nLE GEOLOIR MACDONALD.—C'est parce qu'ils aiment l'ordre.\n\nRIEL.—Ce n'est pas cela ! C'est parce qu'ils sont ainsi que vous autres les oppresseurs de l'amour de la patrie !\n\nPLUSIEURS GENDARMES.—(Ils poussent Riel en différents sens.)\n\nLE GEND. CARON.—C'est le temps de l'enfermer dans sa cellule, (Riel est enfermé.\nLe Gend. Campbell.—Ce meurtrier de Scott a déjà vécu trop longtemps.\n\nLe Gend. Bowell.—Dans tous les cas, bien sûr que la prérogative royale ne sera pas exercée en sa faveur.\n\nLe Gend. Caron.—Pas de pardon pour les traîtres ! Sir John tient Riel, et ce misérable rebelle ne lui échappera pas.\n\n(Tous chantent le God save the Queen.)\n\nScene III.\n\nLes gendarmes, Père André, Riel.\n\n(Lorsque le père André entre, Riel apparaît dans sa cellule, les gardes portent leurs carabines surmontées de la baïonnette, quelques-uns marchent gravement.)\n\nRiel.—Bon père André, chaque fois que vous venez me voir, je me sens une fois plus heureux.\n\nPère André.—Tant mieux, mon cher ! et j’espère que vos forces ne s’en vont pas !\n\nRiel.—Mon père, je vais très bien, parce que je m’abandonne à la volonté du bon Dieu. Si ce n’était que ma mère, ma femme et mes enfants, je n’aurais aucune attache à ta terre et je verrais la mort approcher avec plaisir. Comment sont-ils, mon père ?\n\nPère André.—Cher enfant, votre récente réconciliation avec la sainte Eglise des a beaucoup soulagées dans leurs afflictions. Toutes les deux, ces femmes qui vous sont si chères, espèrent que la Providence va vous attirer les effets de la clémence et de la pitié des autorités canadiennes.\nRIEL.—Oh ! ma tendre mère ! Combien c'est dur pour vous de ne plus voir votre fils, votre soutien ! Toi, ma femme bien-aimée, combien ces sombres murs de mon cachot te paraissent cruels, puisqu'ils me séparent de toi ! Pauvres et chers petits enfants, vous n'entendez plus la voix de votre père qui vous aimait plus que lui-même ! Mes oreilles sont privées des caresses de vos pleurs, de vos cris, du bruit de vos ébats bruyants !\n\nPÈRE ANDRÉ.—Mon cher, ne pensez plus à eux comme cela, et n'oubliez pas que Dieu veille sur les veuves et les orphelins.\n\nRIEL.—Mon père, ne croyez pas que mon âme se trouble : elle se tient sous les regards de Dieu.\n\nPÈRE ANDRÉ.—C'est bien, mon cher. Vous pouvez donc apprendre sans trop d'émotions la perte de votre troisième enfant, à qui la Providence a permis de voir le jour, hier, et qui est mort quelques instants après avoir été ondoyé !\n\nRIEL.—Pauvre petit ! Il a connu trop de souffrances avant de naître, pour qu'il puisse vivre. Je remercie le ciel pour lui avoir accordé la grâce du baptême, et je compte sur le bon Dieu pour le prompt rétablissement de ma femme. Oh ! mon doux Sauveur, pardonnez à tous ces politiciens pervers et sans entrailles, à tous ces méchants coupables de cet assassinat d'un petit être sans défense. Epargnez-leur, Seigneur, les terribles châtiments qui les attendent dans l'autre monde.\n\nPÈRE ANDRÉ.—Mon cher, vous n'avez donc plus que quelque jours à vivre, puisque la date de votre mort est fixée au 10 de ce mois (no-\nvembre). Avez-vous fait votre testament comme je vous l'ai recommandé ?\n\nRIEL.—Oui, mon père, conformément à vos bons conseils, j'ai fait mon testament. Le voici. (Il le donne au père André.) Ce grave document atteste au monde ma foi à la véritable Église de Notre-Seigneur Jésus Christ ; apporte une nouvelle rétractation de tout ce que j'ai pu dire et professer de contraire à la doctrine de cette sainte Église catholique, apostolique et romaine ; offre mes remerciements à ma mère, ma femme, mes frères et sœurs, tous mes autres parents, tous mes amis, pour l'affection et les bontés qu'ils ont eues à mon égard et pour les services qu'ils m'ont rendus. Dans ces lignes écrites sous l'œil de la mort, je demande au monde de me pardonner tout le mal dont j'aurais pu être coupable à ses yeux et tout le scandale dont ma conscience me fait un reproche, je demande à toutes les personnes qui me sont unies étroitement, pardon pour tous les chagrins que je leur ai causés. Dans ce testament, je déclare aussi que \"je pardonne de tout mon cœur, de tout mon esprit, de toutes mes forces, et de toute mon âme à ceux qui m'ont causé du chagrin, qui m'ont fait de la peine, qui m'ont causé du dommage, qui m'ont persécuté, qui sans raison m'ont fait la guerre pendant quinze ans, qui m'ont fait un semblant de procès, qui m'ont condamné à mort.\" Ensuite je recommande à ma femme de toujours élever ses petits enfants d'après les préceptes de notre sainte religion. Enfin, n'ayant ni or ni argent à laisser à ces enfants qui me sont si chers, je les bénis au nom du Père, du Fils et du Saint-Esprit, afin qu'ils\nsoient bons et heureux ici-bas et qu'ils se trouvent ensuite dans le royaume du ciel.\n\nPère André. Mon cher enfant, je suis content de la manière dont vous vous êtes acquitté de ce devoir si important, et je ne cesserai de prier Dieu afin qu'au moment suprême les forces ne vous manquent pas. De plus, mon enfant, j'espère que vous tiendrez la promesse que vous m'avez faite de ne pas parler en public.\n\nRiel.—Oui, mon père. (Alors on descend un tableau devant eux qui représente à l'auditoire un paysage quelconque.)\n\nSCÈNE IV.\n\nDumont seul.\n\n(Il marche et paraît très fatigué et très sombre).—Depuis de longs mois, de montagnes en montagnes, de collines en collines, de vallées en vallées, nous allons à la bonne aventure. Nous sommes morts de fatigues, et, si ce n'était que les secours de quelques braves amis, nous n'aurions plus, aujourd'hui, de souffle de vie. Au milieu de nos misères, nous nous étions encore fait illusion : nous ne pouvions pas nous imaginer que le gouvernement d'Ottawa n'avait pas enfin libéré nos compatriotes déjà, alors, retenus trop longtemps dans la prison. À notre grand étonnement, ce matin, nous voyons tout le contraire sur des journaux canadiens que des amis viennent de nous passer ! Nos concitoyens ne sont pas encore mis en liberté !... et, est-ce croyable, Riel est encore dans les fers subissant\npour la troisième fois, les tortures d'une con-\ndamnation à mort. Pourquoi accorder un troi-\nsième répit à notre magnanime chef, ce grand\ndéfenseur de la patrie et de la liberté ? Le gou-\nvernement devrait savoir que tous ces sursis font\ndescendre dans l'âme de ce brave patriote les\nsupplices de la mort. Ces remises ne sont que le\nrésultat de l'intrigue et m'apparaissent comme\nla plus cruelle supercherie pour maintenir la\nprovince de Québec dans une fausse espérance.\nAh ! je remercie surtout les journaux français\net libéraux du Canada, pour l'intelligence et le\ncœur qu'ils montrent par rapport à notre cause,\nen vouant à l'exécration publique tous les bour-\nreaux politiques qui déshonorent la capitale de\nla Puissance. (Il regarde.) Allons ! Voilà mon\nami Dumas. (Il regarde encore.) Mais avec qui\nest-il ?... Dans tous les cas, cet inconnu m'a l'air\nd'un vrai gentilhomme. (Il s'avance vers eux.)\n\nSCÈNE V.\n\nDUMONT, DUMAS, L. O. DAVID.\n\nDUMAS.—Dumont, j'ai le plaisir de vous faire\nconnaître M. L. O. David, de Montréal, et dont\nnous avons entendu parler si souvent.\n\nDUMONT (il donne de chaudes poignées de main\nà L. O. David).—Que je suis heureux, honora-\nble compatriote, de faire votre connaissance.\n\nL. O. DAVID.—Mon cher M. Dumont, je vous\ndéclare sincèrement que je ne suis pas moins\nflatté d'avoir pu vous rencontrer ce soir. On m'a\nannoncé que vous n'étiez pas loin d'ici, et je me\nsuis empressé de vous rendre une visite.\nDUMONT.—Ce n’est pas tous les jours qu’en Canada, vous rencontrez sur leur route de pauvres exilés comme nous.\n\nL. O. DAVID.—M. Dumont, il y a dans notre pays, des exilés bien différents de vous deux. Nous avons des hommes d’État, dans la capitale du Canada, qui sont loin d’avoir aux yeux de la patrie autant de mérites et de gloire que vous deux et que tous vos compatriotes faits prisonniers. Ce sont des misérables beaucoup éloignés du patriotisme et d’une politique fondée sur le bien de la nation. Voilà pourquoi la plus grande partie du peuple qu’ils représentent, les a bannis, expulsés de son estime, de son respect et de sa confiance. À ce point de vue, comme vous pouvez le comprendre, ce sont des exilés qui ne peuvent s’attirer aucune considération ni aucune sympathie.\n\nDUMONT.—M. David, croyez-vous sincèrement que le ministère d’Ottawa va se faire le bourreau de Riel ?\n\nL. O. DAVID.—Oui, malheureusement, à la grande honte du pays et de tous les peuples civilisés.\n\nDUMAS.—La politique de l’administration fédérale est-elle un tissu de méfaits si révoltants ?\n\nDUMONT.—Par rapport à nous, le cabinet d’Ottawa a continuellement suivi une politique à double face.\n\nL. O. DAVID.—Mes amis, les hypocrites qui trônent sur les banquettes ministérielles à Ottawa, ont toujours cherché à nous montrer, dans la lenteur de leurs procédés, une détermination ferme de ravir au gibet la tête de votre valeureux chef. Mais la clairvoyance de La Patrie, de Montréal,\net d'un bon nombre d'hommes patriotiques, les a portés à crier bien fort pour réveiller le peuple fasciné par les séductions et endormi sous les promesses trompeuses des serpents d'Ottawa.\n\nDumont.—Je vous félicite, M. David, pour avoir inauguré ce mouvement national; destiné à sauver la vie de Riel des sicaires orangistes.\n\nDumas.—On peut dire aussi que ce mouvement généreux met en relief l'honneur du nom canadien-français.\n\nL. O. David.—Nos démarches, après avoir rencontré des dénis de justice à Regina, à Winnipeg, en Angleterre et à Ottawa, sont abouties, enfin, quoique tard, à faire sortir de la torpeur la députation franco-conservatrice de la province de Québec. Elle a enfin ouvert les yeux sur le coup que nous préparaient les agissements sombres et tortueux du ministère fédéral, traître à tous sentiments d'humanité. Elle a envoyé au vieux Sir John un télégramme lui annonçant qu'elle ne pourrait plus lui donner son support, s'il n'épargnait pas au pays l'humiliation d'une pandaison politique.\n\nDumas.—Tant mieux.\n\nDumont.—Comme de raison : mieux vaut tard que jamais.\n\nL. O. David.—C'est vrai, mais je n'en persiste pas moins à croire que le gouvernement n'adoptera pas une politique de clémence.\n\nDumas.—Comment ! le premier ministre de la Puissance du Canada ne suit-il que les instincts les plus pervers et les plus sordides ?\n\nDumont.—Est-il si peu soucieux de sa réputation d'homme d'État ?\n\nDumas.—Y a-t-il une personne raisonnab...\nqui puisse prétendre que les troubles de 1869-70 font de Riel un rebelle ?\n\nDUMONT. — Ils n'étaient que la plus noble revendication nationale contre la plus noire et la plus basse conspiration militaire.\n\nDUMAS. — C'était la patrie en état de défense ou en lutte contre des envahisseurs étrangers et pleins de crimes.\n\nL. O. DAVID. — Vous avez raison, mes amis, et je ne peux m'expliquer comment il se fait que le ministre Chapleau, qui a si éloquemment défendu Ambroise Lépine, soit devenu si avili au point de ne pas avoir encore offert sa résignation.\n\nDUMAS. — Est-il assez méchant pour affirmer que Riel s'est conduit en rebelle, lors des troubles de l'hiver dernier ?\n\nDUMONT. — Non, puisque le gouvernement a confessé sa négligence criminelle en accordant à nos compatriotes au moins 2,000 titres, au milieu des sinistres nuages de la fumée de nos combats ?\n\nDUMAS. — Pourquoi le cabinet de Sir John A. MacDonald continue-t-il ainsi à s'attirer le mépris par sa politique indéterminée, couarde, louche, mesquine ?\n\nL. O. DAVID. — Je vais vous en dire la raison la honte au front : c'est que, pour se maintenir au pouvoir, il compte sur le gibet où Riel est injustement condamné à être offert en holocauste à la loge orangiste.\n\nDUMAS. — Ignore-t-il que la composition d'un tribunal de deux juges de paix et de six jurés ne pouvait équitablement juger Riel.\n\nDUMONT. — N'est-il pas évident à ses yeux\ncomme aux yeux de tout l'univers que le verdict porté contre ce héros est une parodie de la justice?\n\nDUMAS.—Et la sentence donc prononcée par ce juge mannequin, nommé Richardson, qu'en pensez-vous, M. David?\n\nL. O. DAVID.—Oh! elle emporte une des plus graves irrégularités!\n\nDUMONT.—Pourquoi donc, alors, les ministres d'Ottawa aspirent-ils à l'exécution d'un patriote comme Riel?\n\nDUMAS.—Est-ce parce qu'ils ne connaissent pas la recommandation en grâce du jury?\n\nDUMONT.—Oh! les misérables et vils architectes de potence! Ils savent qu'ils sont cause de ce qu'ils appellent nos rébellions, et, en dépit de leur conscience, ils auraient l'audace de consommer un véritable assassinat judiciaire!\n\nDUMAS.—Ecoutez, Dumont, je ne peux me figurer que Sir John et les autres ministres seraient assez traîtres pour se couvrir de tant de déshonneur!\n\nDUMONT.—Pourquoi pas? Ne restent-ils pas impassibles devant les prières d'un million et demi de canadiens-français, qui demandent la grâce du valeureux prisonnier de Regina?\n\nL. O. DAVID.—Ne se montrent-ils pas inexorables en présence de Mgr Grandin, qui les supplie de ne pas conduire Riel à l'échafaud?\n\nDUMONT.—Les pleurs, les gémissements, les lamentations de la mère et de la femme de ce martyr de notre cause ne viennent-ils pas se briser sur eux comme sur un rocher inébranlable?\n\nDUMAS.—Ce sont donc des tigres, affamés de vengeance.\nL. O. David.—Je crois que quelqu'un frappe à la porte.\n\nDumas (il y va et apporte un télégramme à l'adresse de L. O. David).\n\nL. O. David (il ouvre la dépêche).—Mes amis, je n'en suis pas surpris !... Croyez-moi... on m'annonce que le gouvernement vient d'envoyer à Regina le commandant de la police de la Puissance, Sherwood, avec le mandat de mise à mort !\n\nDumas.—C'en est donc fait de notre ami Riel !... Riel, dont le cœur n'a battu que pour sa patrie !\n\nDumont.—Oh Riel ! Vous avez toujours tout sacrifier pour le bien de vos compatriotes, et demain la couronne du martyr va descendre sur votre tête pour sanctionner et proclamer la fécondité, la stabilité et la grandeur de vos œuvres, et pour rendre votre nom immortel.\n\nDumas.—Et vous, ô Reine d'Angleterre, vous laissez ces ministres assassins jeter un outrage aussi sanglant à la figure d'une nationalité dont tous les membres ont constamment été vos sujets les plus fidèles.\n\nL. O. David.—Mes amis, qu'est-ce que Riel peut attendre du gouvernement impérial ?\n\nDumas.—Que sir John MacDonald et tous ses complices montent sur la potence à la place de ce noble citoyen qui, pour délivrer son pays, n'a pas craint de se mettre en face de l'oppression et de la tyrannie !\n\nL. O. David.—C'est bien ce qu'ils méritent, puisqu'ils sont des oppresseurs et des tyrans. Mais n'oubliez pas que Riel a jeté la terreur dans la nation anglaise, et c'est pourquoi elle ne lui\npardonnera jamais. Jeanne d'Arc, la vierge d'Orléans, a été condamnée à être dévorée par les flammes sur un bûcher, pour avoir épouvanté une armée anglaise. Le grand Napoléon, la terreur de l'Europe, après avoir commandé aux empereurs et aux rois du monde, vient demander l'hospitalité au peuple anglais. Ennemi de la France et des Bonapartes, l'Angleterre a conduit à l'océan le potentat déchu, l'a enfermé à l'île Ste-Hélène et l'a retenu jusqu'à son dernier soupir dans cet îlot pestilentiel. Avant qu'il tombe, cet empereur avait fait trembler le trône de la sière Albion, et toute terrifiée, elle n'a pu oublier ni pardonner.\n\nDUMONT.—Malheur donc à ceux qui font peur à la nation britannique, qui se croit la race supérieure!\n\nDUMAS.—Mais, qui n'a pas honte de persécuter, d'opprimer, de tyranniser les nations plus faibles, comme l'Irlande, par exemple!\n\nDUMONT.—Le gouverneur général du Canada, de concert avec ses ministres, a certainement le droit, au moins de fait, d'exercer la prérogative royale en maintenant ou en commuant une sentence de mort portée contre un des sujets de Sa Gracieuse Majesté. Pourquoi envoient-ils tous ensemble Riel à l'échafaud, lorsque toutes les nations civilisées leur demandent de commuer la peine capitale à laquelle il est condamné si criminellement?\n\nL. O. DAVID.—Je vous le dis : les ministres fédéraux sont les suppôts des loges orangistes.\n\nDUMONT.—Quoi ! en signant l'arrêt de mort, ils savent qu'ils se font les instruments de la haine et des préjugés de ces sectaires barbares!\nDumas.—Et ils ne redoutent pas l'indignation du pays : car les orangistes ne sont pas les seuls qui constituent l'électorat.\n\nL. O. David.—Ils font leurs calculs et ils se figurent que la sécurité de leur portefeuille dépend des loges sanguinaires de l'orangisme, et voilà pourquoi le décret de mort vient d'être expédié à Regina.\n\nDumont.—Les trois ministres canadiens-français, Langevin, Chapleau et Caron, ont donc consenti à livrer leur frère et leur race à la secte la plus diabolique et la plus révolutionnaire qu'il y ait sur la terre.\n\nDumas.—Mais, pour qui prennent-ils donc les Canadiens-Français qu'ils représentent au cabinet d'Ottawa ? Comptent-ils sur l'impunité, après une trahison aussi dégradante ?\n\nDumont.—Que l'esprit et le cœur du peuple anglais soit si peu soucieux du sort de Riel, je me l'explique : il est l'ennemi séculaire de tout ce qui est français et catholique. Que sir John MacDonald et les loges orangistes veulent et ordonnent l'exécution de Riel, je peux en trouver une raison, logique pour eux, dans leur haine contre les franco-canadiens et leur sainte religion. Mais je ne peux me rendre compte comment Langevin, Chapleau et Caron ont pu se décider à livrer à l'ennemi leur sang, leur foi, leur nationalité.\n\nDumas.—Il faut qu'ils soient des traîtres et des lâches !\n\nDumont.—On peut pardonner à des ennemis, mais à des lâches, à des traîtres, jamais !\n\nDumas.—Si la province de Québec n'a pas perdu tout sentiment d'honneur et de dignité,\njamais elle n'accordera de pardon à ces trois vils et misérables politiciens, qui l'ont trahie d'une manière si humiliante et si odieuse.\n\nL. O. David.—Pourtant, ils se font illusion au point de s'imaginer que leur basse et honteuse défection va être bientôt oubliée.\n\nDumont.—Sur quels motifs peuvent-ils s'appuyer pour croire le peuple Canadien-Français ignorant et avil à ce point-là ?\n\nDumas.—Ils pensent que leurs talents et leur prestige vont leur permettre de remonter le courant de l'indignation populaire.\n\nL. O. David.—Ils comptent surtout sur la calomnie. Leur intention est de noircir la réputation de Riel tant qu'ils pourront. Pour en arriver là, leurs journaux commencent déjà à jouer le rôle de la plus perfide hypocrisie. Tout en manifestant un désir sincère de sauver la tête de Riel, ils ne cessent d'insinuer des choses propres à faire croire qu'il est un impie, un meurtrier, un révolutionnaire, un rebelle, un homme vénal, etc.\n\nDumont.—Riel ! un homme capable de se vendre ! Porter une accusation aussi infernale et aussi contraire à la vérité, c'est une infamie ! L'abnégation, le renoncement, le désintéressement, la vie de sacrifices, le patriotisme et l'héroïsme de Louis David Riel n'ont-ils pas brillé du plus vif éclat dans son refus des quatre millions de piastres que les fénians lui ont offerts, peu après le soulèvement des métis français du Manitoba ? Ces qualités qui n'appartiennent à des hommes aussi augustes que Riel, n'ont-elles pas éclaté lorsque, après avoir tourné le dos à ces millions, il n'a pas hésité d'aller en face de l'ennemi pour la défense du pays ?\nDUMAS.—Soutenir qu’un tel homme peut ou a voulu se vendre! Quelle audace! Quelle impudence! Quelle calomnie! Il m’est impossible de concevoir que la méchanceté humaine soit assez grande pour attaquer ainsi le caractère d’un patriote comme Riel!\n\nDUMONT.—Ne vous a-t-il pas prouvé qu’il est rempli de toutes ces vertus les plus sublimes, lorsqu’il a quitté le Montana à l’appel des métis de la Saskatchewan?\n\nDUMAS.—Il a été loin de nous demander de l’argent, et il a traversé les lignes sans armes ni munitions, comme il le dit lui-même.\n\nDUMONT.—Après qu’il eut été rendu au milieu de nous, n’a-t-on pas tenté de faire tomber son patriotisme devant des places, des emplois, des charges, des honneurs qu’on est venu lui offrir?\n\nDUMAS.—Rien de cela n’a ébranlé Riel dans sa ferme résolution de servir son pays comme un véritable patriote.\n\nDUMONT.—Il est vrai, qu’il s’est adressé à des personnes d’importance les sollicitant d’employer leur influence auprès du gouvernement pour lui en obtenir une certaine somme d’argent.\n\nDUMAS.—N’était-ce pas son droit, son affaire et son devoir?\n\nDUMONT.—Certainement; car le cabinet fédéral lui doit plus, à titre d’indemnité, que le montant qu’il aurait voulu avoir.\n\nDUMAS.—Les conditions qui accompagnaient les sollicitations de Riel, sont loin d’indiquer qu’il voulait se vendre ou nous trahir.\n\nDUMONT.—Riel savait que dans le ministère d’Ottawa il avait affaire à un mauvais débiteur, et il ne lui était pas interdit d’user de tactique\nou de jouer de ruse pour arriver à attraper quelque chose !\n\nDUMAS.—Riel aurait une âme vénale, à cause de cela !\n\nDUMONT.—Riel \"est un grand homme et un \"brave.\"\n\nDUMAS.—Et c'est un tel homme qu'on accuse de vénalité !\n\nDUMONT.—Est-ce que dans Riel ne se trouve pas le caractère le plus fortement trempé ? Ne nous l'a-t-il pas prouvé à venir jusqu'aujourd'hui ?\n\nDUMAS.—Un homme comme Riel n'a rien pour lui-même : tout pour sa patrie !\n\nDUMONT.—En effet, si Riel a cherché à engager le gouvernement à lui restituer ce qui lui appartenait, ce n'était pas pour lui-même. Dans cet acte, il y a une haute portée que ses calomniateurs pervertis s'obstinent à ne pas voir : c'est la substitution de la plume à l'épée ! Riel avait en horreur l'action de tremper son épée dans le sang pour en faire jaillir la justice et le triomphe de notre cause. Son rêve était le journal qui, à ses yeux, l'aurait mis en meilleure position pour combattre et repousser nos ennemis, voilà quel était son but !\n\nDUMAS.—On a l'audace d'appeler cela de la vénalité !\n\nDUMONT.—Oh ! politiciens fascinés par l'or et qui vendez votre conscience, accusez plutôt votre propre turpitude, plutôt que d'attaquer la réputation de ce brave et noble citoyen sans défense, au pied du sinistre gibet sur lequel votre honteuse lâcheté le condamne à mourir.\n\nDUMAS.—Pour le priver des sympathies de\ntous ses compatriotes, on l'accuse de plus d'être le meurtrier de Scott.\n\nDUMONT.—Prétendent-ils que Scott n'a pas été condamné et mis à mort par un conseil de guerre sous le gouvernement provisoire ?\n\nL. O. DAVID.—Ils admettent cela, mais ils nient la légitimité du gouvernement de Riel.\n\nDUMONT.—Ignorent-ils que cette légitimité a été reconnue par les autorités impériales et par les autorités canadiennes ?\n\nL. O. DAVID.—Ils le savent bien, mais il faut calomnier pour sauver les traitres qui envoient Riel à l'échafaud.\n\nDUMONT.—Ils doivent être convaincus aussi que Riel n'avait aucun contrôle, aucun droit de vote ou de sanction relativement aux décisions du conseil de guerre, sous le gouvernement provisoire. Riel n'était que le président de ce nouveau gouvernement.\n\nDUMAS.—Il doit être établi à eux comme à nous que Riel a fait de son mieux pour empêcher Scott d'être fusillé ?\n\nDUMONT.—Et après tout cela, on ose le regarder comme un meurtrier !\n\nL. O. DAVID.—Les détracteurs actuels de votre chef insinuent sournoisement qu'il est responsable du massacre du Lac à la Grenouille.\n\nDUMONT.—Responsable de ce massacre ! Comment ? Pourquoi ? Il a eu lieu à son insu ! Gros-Ours et sa bande seuls en sont les auteurs. Riel était à Batoche bien loin de ses sauvages, n'ayant aucune communication avec eux.\n\nDUMAS.—Refusent-ils de croire que ce sont certains employés du gouvernement qui doivent être tenus responsables de ce déplorable désastre ?\nDUMONT.—Est-ce que ces vilains calomniateurs ne connaissent pas que les sauvages ont été provoqués et irrités par ces employés-là qui les ont traités de la manière la plus brutale ?\n\nDUMAS.—Voilà des faits indéniables et que l'histoire proclamera pour confondre la calomnie.\n\nDUMONT.—Riel n'est donc pas un homme vénal ni un meurtrier.\n\nDUMAS.—Il est loin aussi d'être un révolutionnaire et un rebelle.\n\nDUMONT.—Ceux qui connaissent les causes de nos troubles sont bien persuadés que nous sommes défendus seulement contre les suppôts d'un gouvernement voleur et assassin.\n\nDUMAS.—On veut faire croire que Riel est un impie. N'y a-t-il pas là une malice satanique ?\n\nDUMONT.—Tant de méchanceté pourrait-il se trouver dans le cœur humain ! Il m'est impossible de le croire. Riel avec sa belle intelligence et son grand cœur a compris et senti mieux que d'autres, tout le mal que les ministres fédéraux ont fait et ont laissé faire dans le Nord-Ouest. À un moment donné, il devient surexité, et perdant l'équilibre de ses facultés mentales, il tombe dans des extravagances religieuses certainement dangereuses. Victime comme nous de tant de persécutions et d'injustices, il s'égare. Dans de telles circonstances, ne mérite-t-il pas les sympathies de tous ceux qui savent penser et aimer ?\n\nDUMAS.—Oh ! hommes méchants ! c'est donc un parti pris, pour vous, de perdre Riel ! Demain, vous allez lui arracher la vie, mais, je vous le dis, vous ne le dépouillerez pas de son honneur !\nDUMONT.—Vous accumulez toutes sortes de crimes sur la tête de Riel, et vous voulez qu’il soit pendu. Pourquoi êtes-vous si sévères pour lui, lorsque vous savez que les vrais criminels sont sir John MacDonald et tous ses satellites ? Si vous étiez des gens honnêtes, vous devriez exiger que tous ces forbans politiques montent sur la potence, pour venger le pays des abominations sans nombre et inqualifiables dont ils le déshonorent.\n\nL. O. DAVID.—Mes amis, ayez confiance ? Il y a encore des hommes de cœur, qui sauront les mettre à la place et leur infliger les châtiments qu’ils méritent. (Ils sortent.)\n\nSCENE VI.\n\n(La scène fait voir Riel dans sa prison et les gardes armés.)\n\nRIEL, LE DR. JUKES.\n\nLE DR. JUKES.—Mon cher ami, je vous trouve toujours aussi fort.\n\nRIEL.—Réallement, je ne redoute pas le lever du soleil, demain. Il me semble que le temps est nuageux, ce soir.\n\nLE DR. JUKES.—Oui, et l’atmosphère est humide.\n\nRIEL.—Que la nature pleure ! Pour moi, j’espère passer une bonne nuit. Si c’est la dernière, c’est bien le moins qu’elle m’apporte un doux sommeil.\nSCENE VII.\n\nLES MÊMES, SHERWOOD ET LE SHÉRIF CHAPLEAU.\n\nRIEL (en les voyant entrer, s'avance vers eux).—\n\"Eh bien, comme cela, vous, venez avec la\ngrande nouvelle ! j'en suis bien aise.\"\n\nCHAPLEAU.—Mon pauvre ami, il m'est pénible\nde vous annoncer que M. Sherwood vient d'ar-\nriver avec l'arrêt de mort.\n\nRIEL.—\"Je suis heureux d'apprendre qu'en-\nfin je vais être débarrassé de mes souffrances.\"\nJe vous remercie pour toutes les bontés que\nvous avez toujours eues pour moi. \"Je désire\nque mon corps soit remis à mes amis, pour\nêtre enterré à St-Boniface, dans le cimetière\nfrançais, vis-à-vis Winnipeg.\"\n\nCHAPLEAU.—Avez-vous quelque chose à nous\ncommuniquer par rapport à vos propriétés?\n\nRIEL.—\"Mon cher, je n'ai pour tout bien\nque ceci, (il met la main sur son cœur) et ceci\nje l'ai donné à mon pays, il y a quinze ans ;\net c'est tout ce qui me reste maintenant.\"\n\nCHAPLEAU.—Nous n'avons pas de doute que\nvous avez réglé, comme il faut, toutes les affaires\nde votre conscience.\n\nRIEL.—\"Il y a longtemps que j'ai fait ma\npaix avec mon Dieu ; je suis aussi bien pré-\nparé maintenant que je puis l'être en aucun\ntemps. Vous trouverez que j'avais une mis-\nsion à remplir. Je vous prie de remercier\nmes amis de la province de Québec de tout\nce qu'ils ont fait pour moi.\"\n\nCHAPLEAU.—Avez-vous peur de mourir?\nRIEL.—\"Je suis content de quitter ce monde. On me permettra de dire quelques mots sur l'échafaud?\"\n\nCHARLEAU.—Nous n'avons pas d'objection du tout, mon bon ami.\n\nRIEL.—\"Vous supposez que je pourrais parler trop longtemps et que cela me fatiguera? Oh! non, je ne me trouverai pas faible, je sentirai lorsque le moment viendra, que j'aurai des ailes qui m'envoleront là-haut. Permettez-moi de vous déclarer franchement que jusqu'à mon dernier soupir, j'aurai toujours pour mes amis de la reconnaissance et que je garderai pour eux le plus doux souvenir. Adieu mon ami.\" (Il tend la main au shérif.)\n\n(Le dialogue de cette scène est tiré, en partie, de La Presse de Montréal.)\n\nSCENE VIII.\n\nRIEL, PERE ANDRE.\n\nPERE ANDRE.—Bien, cher enfant, comment vous portez vous maintenant?\n\nRIEL.—Oh! mon père, je me vois près du ciel. Croyez moi, la mort qui m'attend, pour demain matin, ne me glace pas d'effroi.\n\nPERE ANDRE.—C'est bon, mon cher, montrez du courage jusqu'à la fin. Nous allons prier cette nuit, afin que vous soyez très bien préparé au grand passage de l'Eternité. Ensuite vers le jour, je dirai la sainte messe pour vous, je vous donnerai la communion, vous recevrez l'extrême-onction, et alors la mort pourra venir vous chercher.\nSCENE IX.\n\n(La scène fait voir la demeure de Riel à St-Vital.)\n\n(Marguerite assise sur un sofa et paraissant faible. La mère de Riel debout près d'elle. Les deux enfants semblant reposer sur chacun une chaise berçante.)\n\nMARGUERITE.—Ecoutez, maman, vous ne sauriez croire combien je serais contente si, à la place de l'arrêt de mort, on venait m'apporter, ce soir, la nouvelle que la sentence est commuée !\n\nLA MÈRE DE RIEL.—Oh ! que je serais soulagée. Pauvre Louis, demain soir, seras-tu encore vivant ?\n\nMARGUERITE.—Est-ce réellement la dernière nuit qu'il doit passer sur la terre ?\n\nLA MÈRE DE RIEL.—Au moins, si nous l'avions au milieu de nous ; il nous verrait, il nous parlerait, il nous embrasserait, et, ces pauvres petits enfants, comme il serait heureux de les caresser encore.\n\nMARGUERITE.—Ah ! maman, que je suis mal à mon aise !... je préférerais mourir plutôt que d'entendre dire que son exécution va avoir lieu demain.\n\nLA MÈRE DE RIEL.—Quelle nuit sombre pour nous ! Quelle triste matinée ! Oh ! mon Dieu !\n\n(Elle pleure.)\n\nMARGUERITE.—Maman ! que je souffre ! je suis si faible...\n\nLA MÈRE DE RIEL.—Vraiment, je voudrais savoir ce qu'on a décidé ! Louis va-t-il nous être rendu demain, oui ou non ?\n\nMARGUERITE.—On va avoir des nouvelles !\nSCENE X.\n\nMARGUERITE, LA MÈRE DE RIEL ET SHERWOOD.\n\nLA MÈRE DE RIEL.—Bien, monsieur, quelle nouvelle venez-vous nous apporter ?\n\nMARGUERITE.—Mon ami, vous nous paraissiez triste ! N'importe ! parlez sans crainte.\n\nSHERWOOD.—Mes pauvres dames, vous deviez vous y attendre ! Eh bien, sans vous surprendre, j'ai la douleur de vous informer que demain sera le dernier jour pour l'infortuné Riel.\n\nMARGUERITE.—Oh ! mon Dieu ! cela est-il donc vrai. (Elle se voile la figure et pleure à chaudes larmes.)\n\nLA MÈRE DE RIEL.—Oh ! Seigneur, donnez la force à mon fils, pardonnez-lui ses péchés, et recevez-le dans le ciel, ainsi qu'il ne souffre plus ! Quelles angoisses doivent tourmenter son sommeil dans le moment. Ah ! Ah ! Ah ! mon fils, que je voudrais être près de toi pour te consoler, pour te presser contre mon cœur désolé !... mon Dieu,... que nous éprouvons une dure épreuve. (Elle crie et se lamenté en marchant.)\n\nSHERWOOD (se cachant la figure avec son mouchoir).—Courage ! courage ! mes bonnes dames, à revoir. (Il sort.)\n\nLA MÈRE DE RIEL.—Marguerite, viens avec moi, nous allons coucher les enfants, ensuite nous prierons pour notre pauvre Louis. (Elles sortent en pleurant.)\n\nSCENE XI.\n\n(La scène précédente se lève, et plus au fond du théâtre se trouvent Riel agenouillé, tenant un crucifix, le\nPère André et le père McWilliams à genoux aussi, le premier ayant un surplis par-dessus sa soutane, et l'autre tenant un bâton allumé et portant une étoile sur ses habits de voyage. Les gendarmes pas loin de l'échafaud.\n\nPÈRE ANDRÉ (il se lève et jette de l'eau bénite sur le martyr).—“Pardonnez-vous à tous vos ennemis du fond de votre cœur?”\n\nRIEL.—“Je leur pardonne, mon père. Je pardonne à tous mes ennemis, pour l'amour du bon Dieu.”\n\nPÈRE ANDRÉ.—“Avez-vous aucun sentiment de méchanceté, de haine, contre qui que ce soit?”\n\nRIEL.—“Non, mon père, je pardonne à tous.”\n\nPÈRE ANDRÉ.—“Offrez-vous votre vie en sacrifice à Dieu?”\n\nRIEL.—“Oui, mon père.”\n\nPÈRE ANDRÉ.—“Mon enfant, la chair est faible et l'esprit est fort; vous repentez-vous de tous les péchés que vous avez pu commettre, en pensée, parole ou action?”\n\nRIEL.—“Oui, mon père. J'ai commis beau coup de péchés et je demande pardon à mon Dieu, au nom de Jésus, Marie et Joseph.”\n\nPÈRE ANDRÉ.—“Vous ne désirez pas parler au public. Vous faites ce sacrifice à Dieu?”\n\nRIEL.—“Oui, mon père. Je fais à Dieu le sacrifice de ne pas parler au public, à mes derniers moments.”\n\nPÈRE ANDRÉ.—“Dieu a été bon pour vous, mon fils, en vous donnant l'occasion de vous repentir; l'en remerciez-vous?”\n\nRIEL.—“Je remercie le bon Dieu de m'avoir permis dans sa providence, de faire ma paix avec lui et avec tout le monde, avant de mourir.”\nPÈRE ANDRÉ ET McWILLIAMS (mettant la main sur la tête du condamné).—Nous vous pardonnons tous vos péchés, au nom du Père et du Fils et du Saint-Esprit. Ainsi soit-il.\n\nRIEL.—Mon Dieu, mon bon Maître, mon doux Jésus, ayez pitié de moi, sauvez moi et attirez-moi vers vous. Répandez vos bénédictions, ô mon doux Sauveur, sur ma mère, ma femme, mes enfants, tous mes parents, tous mes amis et et tous mes ennemis. \"Mon Père, bénissez-moi selon les vues de votre providence, qui sont complètes et absolues,\" (la vue au ciel.) Voulez-vous me bénir, mon père? (regardant le père André.)\n\nLES DEUX PÈRES.—Nous vous bénissons au nom du Père et du Fils et du Saint-Esprit, Ainsi soit-il.\n\n(Alors Riel se lève et est garrotté ; il prie avec les deux pères.)\n\nPÈRE ANDRÉ.—\"Bon ! allez au ciel ! (Ils s'embrassent.)\n\n(Le bourreau monte l'escalier de la potence, Riel le suit avec les deux pères à ses côtés, le député shérif Gibson et le Dr. Jukes. En bas de la potence, le Dr. Dodd, le Dr. Cotton, et quelques autres représentants de la presse.)\n\nRIEL (en montant sur l'échafaud).—\"Je donne ma vie entière comme un sacrifice à Dieu. Remerciez madame Forget et monsieur Forget. O mon Dieu, vous êtes mon soutien. Mon soutien, c'est mon Dieu.\" (Il est sur la trappe et on lui passe la corde autour du cou.)\n\n\"Courage, mon père.\"\n\nPÈRE ANDRÉ (d'une voix étranglée).—\"Courage ! courage !\" (Les pères et le Dr. Jukes lui serrent la main.)\nRIEL (en donnant la main au Dr. Jukes).—\n\"Merci, docteur.\" \"Jésus, Marie et Joseph,\nayez pitié de moi. J'espère encore. Je crois\nen Dieu jusqu'au dernier moment.\"\nLE PÈRE McWILLIAMS.—\"Priez le Sacré\nCoeur de Jésus.\"\nRIEL.—\"Ayez pitié de moi, Sacré-Coeur de\nJésus! Ayez pitié de moi. Jésus, Marie et\nJoseph, assistez-moi dans mes derniers mo-\nments. Assistez-moi, Jésus, Marie et Joseph!\"\n(Alors le père McWilliams lui donne la croix à\nbaiser.)\nDÉPUTÉ SHÉRIF GIBSON.—\"Louis Riel, avez-\nvous quelque chose à dire pour que la sen-\ntence de mort prononcée contre vous ne soit\npas exécutée?\"\nRIEL (s'adressant au père André).—\"Faut-il\ndire quelque chose?\"\nPÈRE ANDRÉ.—\"Non.\"\nRIEL.—\"Alors, je voudrais prier encore un\npeu.\"\nPÈRE ANDRÉ.—\"Il demande à prier encore\nun peu plus.\"\nDÉPUTÉ SHÉRIF GIBSON (regardant sa montre).\n—\"Deux minutes.\"\nPÈRE McWILLIAMS.—\"Dites Notre Père. (à\nMr Gibson.) \"Lorsqu'il en sera à délivrez-nous\ndu mal, alors, dites-le lui.\"\nRIEL (paraissant tout illuminé):—Notre Père\nqui êtes aux cieux, que votre nom soit sanc-\ntifié, que votre règne arrive, que votre volonté\nsoit faite sur la terre comme au ciel; donnez-\nnous aujourd'hui notre pain quotidien; pardon-\nnez-nous nos offenses comme nous pardonnons\nà ceux qui nous ont offensé, et ne nous laissez\npas succomber à la tentation, mais délivrez-\nnous... (Alors, devant eux on descend rapide-\nment un tableau représentant une campagne. La\nscène précédente est empruntée, en partie au Leader\nde Regina.)\n\nSCENE XII.\n\nALBERT seul.\n\nALBERT.—Combien Regina va devenir remar-\nquable! Cette petite ville offre le spectacle, le\nplus émouvant! Elle est témoin d'un fait qui\nne s'est jamais produit sous le ciel de notre\npatrie! Elle voit surgir la gloire la plus écla-\ntante de l'ignominie la plus humiliante. Elle\nvoit Riel recevoir la couronne d'immortalité sur\nun échafaud élevé par les mains de l'orangisme,\nl'ennemi le plus acharné de la civilisation chré-\ntienne. La potence sur les hauteurs de laquelle\nRiel se tient debout, tout rayonnant de gloire et\nde beauté, devient toute resplendissante sous les\nflots lumineux que la sainteté de ce martyr ré-\npand sur elle. La trappe fait surgir un espace,\nqui apparaît comme un gouffre illuminé, où\nnotre chef bien-aimé est englouti! Riel vient\nde nous quitter! Riel, le libérateur de tous les\nMétis, vient de monter sur un gibet dont le\ncortège d'aspect sombre, d'horreur, de déshon-\nneur et de honte a cédé le pas au cortège de\nlumière éblouissante, de beauté éclatante, de\ngloire pure et de sainteté frappante. Oh! Riel!\nVous étiez si admirable dans toutes les vertus\nqui font de vous un si illustre patriote! Pourquoi\ndonc l'ennemi vous a-t-il arraché si violemment\ndes bras de la patrie ? Ah ! il a pu exercer sur vous la force brutale en vous privant du don de la vie ! Mais vos œuvres immortelles sont là comme des monuments impérissables qui couvriront de honte vos bourreaux, en proclamant leur impuissance et leur lâcheté.\n\nSCENE XIII.\n\nALBERT, PÈRE ANDRÉ.\n\nPÈRE ANDRÉ.—Mon pauvre Albert, consolez-vous ! Riel est au nombre des bienheureux ! Ce brave cœur s'est sacrifié pour ses frères, et aujourd'hui il a la récompense de son sacrifice. Vivant, il a combattu comme un héros jusqu'à son dernier soupir; pour la délivrance et le bonheur de ses compatriotes. Maintenant, dans le séjour des élus, il va se servir de l'arme de la prière pour le bénéfice de notre cause. Allons, cher ami, je suis heureux de vous rencontrer sur ma route, venez avec moi consoler la famille désolée de notre cher Louis.\n\nSCENE XIV.\n\n(Le tableau précédent est enlevé, et plus au fond du théâtre se trouvent Marguerite, sur un sofa, la mère de Riel, les deux enfants et le Dr. Fafard.)\n\nLA MÈRE DE RIEL (elle marche).—Oh !... Oh ! oh !... mon fils... mon fils... lui qui était si soumis !... Il me portait tant d'affections !... Il pouvait tout faire pour me mettre à l'abri de la misère ! Ah !... mon Dieu, que vais-je devenir ! Ah ! Ah ! Ah !... Non, mes enfants, je ne peux\npas croire que c'est ce matin que le Canada laisse les ministres d'Ottawa immoler mon fils, mon cher Louis, pour satisfaire la haine et la vengeance d'une secte sortie de l'enfer. Tenir si longtemps mon fils dans les sombres cachots ! Faire reluire à ses yeux l'espérance du pardon ! Lui infliger jusqu'à trois fois la peine d'une condamnation à être pendu ! N'était-ce pas assez ? je vous le demande, ô mon Dieu, n'était-ce pas une torture suffisante pour le punir d'avoir voulu repousser les pieds des voleurs, des oppresseurs et des meurtriers à la solde d'un gouvernement persécuteur et tyrannique ? Eh bien ! non ! les ministres du Canada, investis de l'autorité pour protéger les bons et châtier les méchants, se font eux-mêmes les bourreaux de mon fils ! Ils lui font mettre la corde autour du cou, sur la trappe d'une potence dressée et soutenue par la haine et la vengeance ! Oh ! douleur amère et poignante ! Pourquoi consentent-ils à la consommation de cet assassinat politique ? Pour garder leur place de ministres ! Peut-on être plus scélérat que ces misérables hommes d'État, dont le cœur et la conscience, le devoir et l'honneur, la compassion et la sympathie s'aplatissent devant une bourse remplie d'or ? Oh ! cruels assassins ! Rendez-moi mon fils, si la rage de votre féroce égoïsme ne l'a pas encore étranglé ! Rendez-moi mon fils, que vous me prenez de force contre toutes les lois divines et humaines ! Mon Dieu... oh ! mon Dieu... mon fils est-il mort maintenant ? Ah ! grand Dieu, le moment de son exécution est passé ! Fasse le ciel qu'il ne souffre plus ! Oui, mon Dieu, qu'il soit débarrassé des misères de ce monde. (Elle continue à pleurer et s'assied.)\nMarguerite (elle s'assied sur un sofa).—Maman! maman! oh! oh! oh!... j'étouffe! oh! oh!... mon Dieu... ayez pitié... de moi,... donnez-moi la force de supporter ma peine... oh! oh! non, mon Dieu... vous ne m'abandonnerez pas! Laissez-moi vivre pour mes chers petits enfants! Si je dois mourir sous l'aiguillon de cette douleur qui me va droit au cœur, faites-moi précéder de ces deux petits anges... vous venez de m'en ôter un... mon Dieu... aidez-moi! oh! oh! maman! je voudrais décharger ma poitrine et je n'en suis pas capable! oh! oh! docteur! que pouvez-vous faire pour moi? je ne peux... plus... parler... (Elle s'évanouit.)\n\nDr. Fafard (il s'avance vers elle et lui fait respirer un stimulant pour la ramener à sa connaissance).—Courage! courage! madame Riel. Prenez sur vous... pensez à Dieu qui peut vous soutenir. Résignez-vous comme une bonne chrétienne! Tenez! Voilà le père André avec notre ami Albert.\n\nSCÈNE XV.\n\nLes mêmes, Père André et Albert.\n\nPère André.—Mes bien chères sœurs! consolez-vous!\n\nLa mère de Riel.—Mon fils serait-il encore vivant?\n\nMarguerite.—Mon mari vit-il encore? Est-il sorti de la prison?\n\nPère André.—Mes bonnes amies, ce serait si doux pour vous d'apprendre que le martyr de notre cause aurait eu sa grâce! Je serais si heureux de vous l'annoncer! Mais il vous im-\nporte, aujourd'hui, de vous abandonner complètement aux mains de la divine Providence. C'est ainsi que vous trouverez la force de supporter les croix les plus lourdes et les plus dures ! En vous soumettant à la volonté de Dieu, vous rencontrez Jésus sur sa croix; Jésus qui est force des affligés, des martyrs, des pauvres, des malades, des abandonnés, des veuves et des orphelins ! Vous pauvre mère, consolez-vous : car un des plus beaux fleurons vient d'être ajouté à la couronne qui vous attend dans l'autre vie. Et vous, bonne amie, la Providence, qui règle toutes choses, vous constitue, dès à présent, la principale gardienne de ses deux jeunes orphelins. Résignez-vous, en attendant que nous allions tous rejoindre celui qui nous est si cher et que la patrie en deuil pleure en ce moment avec nous !\n\nLA MÈRE DE RIEL.—J'ai espéré jusqu'à cette heure, mais puisque mon espérance a été vaine, que la volonté de Dieu soit faite ! Mon père! oh ! oh ! oh ! je ne verrai donc plus mon cher Louis? Ah! mon père, que c'est une dure épreuve sur mes vieux jours! Ah! mon père, que ma vieillesse est malheureuse ! Je sens que la douleur va la coucher dans la tombe avant longtemps... Mieux vaut pour moi mourir plutôt que de tant souffrir jusqu'à ce que la mort ait fermé mes paupières! Pauvre Louis, je n'entendrai plus tes douces paroles ! je ne contemplerai plus la douceur de ton sourire ! Mon existence décline, et je ne l'aurai plus pour me soutenir. (Elle pleure.)\n\nMARGUERITE.—Mon père !... que je voudrais vous exprimer toute ma reconnaissance pour\nvos paroles d'encouragement. Mon père, je me résigne à la volonté de Dieu ! Je m'attendais au malheur, qui me frappe si cruellement ! Oh ! heure fatale ! elle est passée ! mon Dieu, merci ! j'espère que mon pauvre mari ne souffre plus. Je sens, mon père que votre crucifix me donne la force nécessaire pour supporter ma douleur. Mon père, Louis a-t-il souffert longtemps avant d'expirer ?\n\nPÈRE ANDRÉ.—Non, heureusement ! il est monté d'un pas ferme sur l'échafaud, et sa mort a été presque instantanée. Il avait l'air d'un saint. Je crois qu'il jouit maintenant du bonheur éternel.\n\nLA MÈRE DE RIEL.—Mon père, que cela me soulage !\n\nMARGUERITE.—Je me réjouis d'apprendre que son courage ait confondu ses ennemis jusqu'à sur la potence qu'il vient d'honorer.\n\nPÈRE ANDRÉ.—Oui, mes bonnes amies, Riel a même sanctifié l'échafaud, parce que, d'une manière vraiment chrétienne et héroïque, il a versé son sang pour le salut de sa patrie et l'éternelle honte de ses persécuteurs et de ses bourreaux !\n\nMARGUERITE.—Maintenant, mon père, veuillez nous bénir ainsi que mes chers petits enfants, que je mets sous la protection de Jésus, de Marie et de Joseph.\n\nPÈRE ANDRÉ.—Je me fais un devoir et un bonheur de vous bénir ainsi que vos enfants, afin que le bon Dieu verse en vous toutes sortes de consolations et permette à ces pauvres petits orphelins d'avancer en âge, en science et en sagesse. (Il les bénit.)\n(On descend devant eux une scène représentant une ville.)\n\nSCENE XVI.\n\nDUMONT seul.\n\nDUMONT (il marche et paraît absorbé).—Immédiatement après la lugubre exécution de Riel, il y a presqu’un an, combien était grande l’indignation de la province de Québec ! Quel bouillonnement dans le fond des cœurs de tous les canadiens-français ! Quelle violence dans les protestations qui s’élevaient de toutes parts ! Quelle noblesse et quelle véhémence dans les discours prononcés devant l’assemblée du champ de Mars de Montréal ! 60,000 personnes présentes réunies dans une même pensée et un même cœur ! Que c’était beau de voir un tel déploiement de l’esprit national ! Pourquoi le Conseil de Montréal s’ajourne-t-il en face de l’homicide politique de Regina ? C’est “en signe de protestation contre l’odieuse violation des lois de la justice et de l’humanité.” Que signifient ces drapeaux en berne et ces emblèmes de deuil dans presque toutes les villes de la Puissance ? C’est que le peuple canadien-français ressent profondément les sanglantes flagellations que lui inflige l’acte inique de Regina ! À Québec, quelle colère ! Quelle esravescence ! Les magasins sont fermés ! Des drapeaux tricolores flottent à mi-mât ! La population est turieuse et est prête à éclater comme un volcan sous les vibrations sinistres du glas funèbre qui se fait entendre dans les lointains déserts du Nord-Ouest ! Les\néchos lugubres de cette sombre voix mortuaire se répercutent jusque dans les pays étrangers !... Combien toutes ces démonstrations populaires nous soulagent !... Ah !... mais...\n\nSCENE XVII.\n\nDUMAS.\n\nDUMAS.—Mon cher Dumont, rêvez-vous ? Il s'est écoulé bien des mois depuis ce temps-là, et de grands changements se sont opérés : Sir John MacDonald s'est armé du fouet et a commandé à ses partisans. O honte !... Vous le savez, presque tous les membres canadiens-français du parti-conservateur, à l'exemple de presque tous les journaux publiés en leur langue et considérés comme organes de ce parti de la corde, ont courbé l'échine et se sont aplatis devant ce vieux chef et les loges orangistes, qui veulent les asservir et les tenir sous leur joug, comme un lot de pourceaux !\n\nDUMONT.—C'est bien trop vrai. Le 14 octobre dernier, les élections ont eu lieu dans la province de Québec et elles ne nous ont pas trouvé dix justes dans les rangs conservateurs !\n\nDUMAS.—O opprobre pour la race canadienne-française !\n\nDUMONT.—Mais honneur et gloire aux libéraux français ! Honneur et gloire surtout à La Vérité de Québec et à L'Étendard de Montréal ! Voyant cet asservissement de tant des nôtres sous le joug de l'orangisme, j'ai senti le besoin de me reporter au temps de toutes ces belles, nobles et encourageantes protestations que le crime de Regina a fait éclater dans la province de Québec.\nDumas.—Ah ! qu'il fait bon d'y penser !\n\nDumont.—Voyons donc, ensemble un instant, quelques extraits que j'ai faits alors des journaux français du Canada ? (Il sort des papiers.)\n\nAllons ! La Minerve de Montréal : \"L'exécution de Louis Riel restera dans notre histoire comme une page noircie par une tache sinistre... C'en est fait des espérances de toute une race et de la pureté immaculée de notre blason national. Il n'a pu s'écouler 20 ans sans que le grand livre de la Confédération canadienne fût maculé d'une tache de sang. C'est avoir perdu bien jeune sa beauté virginal.\"\n\nLe Monde de Montréal : \"Je proteste contre l'exécution de Louis Riel.... Sir John emportera dans la tombe le déshonneur qui s'attache à son nom... Riel a été offert en holocauste, et l'orangisme l'a pendu, par haine, pour assouvir une vengeance déjà ancienne.\"\n\nLa Presse de Montréal : \"Riel exécuté pas sera au rang des martyrs... Il n'y a que des patriotes et des traîtres. Le parti national et celui de la corde.\"\n\nLa Patrie de Montréal : \"Riel a été pendu... il paye de sa vie des haines que dix ans d'exil n'ont pu éteindre... Qu'ont donc fait les trois hommes que les canadiens avaient envoyés à Ottawa pour les représenter, pour être les défenseurs de leur nom, de leur foi et de leur race? Ils se sont donc, eux aussi, atrophiés au contact morbide de ce vieux mangeur de Français qui a nom Sir John.\"\n\nL'Étendard de Montréal : \"C'est parceque, dans la pendaison de Riel, on ne recherche ni le triomphe de la justice, ni la vindication\n\"des lois, ni l'obéissance à l'autorité, mais seulement le triomphe insolent et féroce d'une secte brutale et sanguinaire de demi-barbares, qui entendent perpétuer ici la tyrannie, les successions de crimes, les persécutions, toutes sortes d'infamies qui feront la honte éternelle des orangistes.\"\n\n*L'Électeur* de Québec : \"C'est pour nous un jour de deuil national\"\n\n*L'Événement* de Québec : \"L'échafaud de Regina est une tache sur la renommée de l'Empire britannique.\"\n\n*Le Nouvelliste* de Québec : \"Mais la rage du tigre orangiste restait inassouvie. Maintenant elle est satisfaite. L'élément français et catholique a payé son tribut à la haine des sectaires.\"\n\n*Le Canadien* de Québec : \"Le sang est un mauvais ciment, et si la Confédération n'en a pas d'autre, le coup de vent qui la culbutera n'est pas loin dans l'horizon.\"\n\n*Le Quotidien* de Lévis : \"Riel sur l'échafaud, c'est un brandon de discorde qui restera allumé aussi longtemps que l'on a fait crier le sang des Aylward et des Scott. Le crime fait la honte et non pas l'échafaud, a dit le poète... La voix de l'humanité n'a pas été entendue... la justice a les mains couvertes de sang.\"\n\n*Le Courrier du Canada*, de Québec : \"la nouvelle de l'exécution a été accueillie par une explosion de pitié et de colère. Il est clair que la province de Québec attendait une mesure de clémence.\n\n*Le Journal* de Québec : \"Nous nous trouvons en face d'une potence, qui a fait une pendaison politique, malgré les protestations de la province de Québec.\"\nL'Etoile du Nord, de Joliette : \"Le sang innocent a coulé sur l'échafaud, un cœur de patriote a cessé de battre ! Voilà pourquoi tout le Canada français est en deuil !... Riel a été la victime du fanatisme et de la haine. C'est un martyr de la liberté.\"\n\nLe Nord de St. Jérôme : \"Nous dénonçons le gouvernement MacDonald et demandons sa déchéance.\"\n\nLe Courrier de St. Hyacinthe : \"Le gouvernement, en ne commuant pas la peine, a commis un acte blâmable et dont le peuple lui tiendra compte.\"\n\nL'Union de St. Hyacinthe : \"C'en est fait, le crime le plus monstrueux du siècle vient d'être accompli.\"\n\nLe Journal des Trois-Rivières : \"Ce jour est un jour de deuil et de tristesse profonde pour la population de la province de Québec.\"\n\nLe Canada : \"Nous avons demandé grâce en sa faveur... parceque, dans certains quartiers, on semblait faire de sa tête le prix du fanatisme.\" Que de citations, je pourrais encore faire !\n\nDUMAS.—J'ai lu dans La Vérité de Québec, quelque chose d'aussi fort et d'aussi beau ! Malheureusement, j'ai perdu les extraits que j'en avais faits.\n\nDUMONT.—De tous les journaux que nous venons de nommer, combien y en a-t-il qui sont conservateurs ?\n\nDUMAS.—Il est certain que la plupart d'eux le sont.\n\nDUMONT.—Combien y en a-t-il qui n'ont pas voulu briser les liens de parti, préférant tourner\nle dos à la patrie, trahir ses intérêts les plus chers et rester dans un servilisme déshonorant.\n\nDUMAS.—Ce n'est pas croyable ! Actuellement, à part les journaux libéraux, il n'y a que La Vérité et L'Étendard qui défendent le drapeau national.\n\nDUMONT.—Tous les autres journaux conservateurs français sont en contradiction avec eux-mêmes et ne veulent plus entendre ces paroles mémorables de M. Alphonse Desjardins, député d'Hochelaga : \"Que la carrière de Sir John, qui a commencé aux reflets de l'incendie des bâtisses du parlement à Montréal, aille mourir derrière le gibet de Riel.\"\n\nDUMAS.—Ils devraient savoir, pourtant, que tous les journaux français du Canada n'étaient pas les seuls à protester contre l'inhumaine pendaison du prisonnier de Regina.\n\nDUMONT.—J'ai conservé des extraits empruntés à la presse parisienne. Voyons !\n\nL'Intransigeant : \"Bazaine n'a pas été fusillé, mais Louis Riel a été pendu. Il est vrai que l'un a essayé de livrer et l'autre de délivrer sa patrie... La férocité britannique s'accommode parfaitement de ces contradictions. L'Angleterre a menti à propos de Riel comme à propos d'Olivier Pain, qu'elle prétend être aux Indes et dont elle met la tête à prix en Égypte. On sait maintenant que l'ultima ratio de Sa Gracieuse Majesté, c'est l'assassinat... Sous-traire l'État canadien aux exactions, aux vols et aux meurtres commis par ses oppresseurs c'est accomplir une œuvre de salubrité sociale. Les anglais pousseraient des cris à l'instar, des enfants de huit ans violées par leur prince...\"\n\"de Galles ; mais comme le fond de leur tempérament est une lâcheté sans nom, ils finiraient par battre en retraite au Canada, comme ils l'ont fait au Zoulouland, au Transvaal, au Soudan, en Afghanistan et ailleurs.\"\n\nLa Justice : \"Et le Conseil Privé qui vient de décider l'exécution du Métis franco-canadien n'est que l'exécuteur des hautes-œuvres britanniques... Ce qui l'emporte aujourd'hui, c'est l'horreur d'une exécution traînant pendant des mois, le bourreau commandé puis rappelé, la potence dressée, jetée bas, et levant de nouveau ses deux bras... Le Canada et l'Angleterre dressant le gibet auquel sera suspendu Riel, la civilisation anglo-saxonne tuant froidement un condamné politique, coupable d'avoir affirmé ses convictions les armes à la main, compromettent une nation toute entière.\"\n\nLa Bataille : \"L'exécution du chef de l'insurrection du Nord-Ouest est une faute dont les conséquences retomberont lourdement sur le ministère canadien.\"\n\nLa Patrie : \"L'infortuné Riel avait du sang français dans les veines, il était destiné, par cela même, à subir, dans toute sa rigueur, la peine à laquelle il avait été condamné.\"\n\nLe Figaro : \"Rien n'a pu sauver Riel de la haine des orangistes d'Ontario... Tous les efforts se sont brisés contre un fanatisme aveugle... Le crime est odieux et la faute est lourde.\"\n\nDumas.—N'était-ce pas assez de sympathies et de protestations ?\n\nDumont.—Nous en trouvons d'autres dans les\njournaux publiés en anglais, au Canada et aux États-Unis. Voyons encore, (il sort des papiers.)\n\nLe Telegraph de Québec : \"L'exécution de Riel marque le point de départ d'une course le long d'un chemin périlleux... Ou vient de faire une blessure qui saignera pendant des années.\"\n\nLe Globe de Toronto : \"Pour emprunter les paroles de Grattan : la trahison des ministres contre les libertés du peuple était insinuement pire que la révolte du peuple contre les ministres... Il nous est facile de comprendre pourquoi l'indignation de nos concitoyens canadiens-français se manifeste sous la forme d'une protestation contre la mort de Riel.\"\n\nLe Hamilton Palladium, le Huron Expositor, le Times de Hamilton, le Free Press d'Ottawa, l'Advertiser de London approuvèrent aussi très chaudement l'attitude franche et digne du peuple canadien-français contre sir John Macdonald et ses valets.\n\nLe New York Herald : \"Eh bien ! l'acte est accompli, et le gouvernement impitoyable du marquis de Lansdowne force le monde à juger de sa sagesse.\"\n\nDe plus le Central Law Journal de St. Louis, le Post et le Republican de Washington, le Post de Hartford, le Transcript de Boston, le Globe de St. Paul, et combien d'autres journaux américains que j'ai lus sur ma route, ont imprimé une flétrissure indélébile sur le front des ministres canadiens.\n\nDumas.—Avec quel plaisir, j'ai savouré les articles si pleins d'intelligence et de cœur, publiés dans Le Canadien de St. Paul ?\nDUMONT.—Quelles belles protestations a enregistrées aussi Le Courrier des États-Unis ! Voici encore deux autres extraits :\n\nLe Freeman's Journal de Dublin : \"On a tout fait pour exaspérer ceux qui sympathisent avec Riel. Son jugement fut une parodie judiciaire dont toute nation libre devrait avoir honte.\"\n\nL'Echo de Londres : \"Le gouvernement de la Puissance serait mieux considéré aux yeux du monde, aujourd'hui, s'il avait épargné sa vie.\"\n\nDUMAS.—Je me rappelle avoir lu dans le Pall Mall Gazette que l'exécution des prisonniers politiques, comme tous les hommes d'État nous l'ont enseigné, est pire qu'une faute.\"\n\nDUMONT.—O journaux conservateurs français comment avez-vous pu descendre si bas en vous faisant chevaliers du Nœud-coulant ! Et vous, ô conservateurs franco-canadiens, vous consentez à devenir les membres du parti de la corde. La corde au cou, vous vous laissez tomber dans un abîme de déshonneur et de honte ! C'est bien ! disparaissez !\n\nDUMAS.—Oui, ô hommes dépourvus de tout patriotisme et de tout esprit public, descendez à cent pieds sous terre ! C'est là votre place, bien plus profondément au-dessous des tombes où reposent en paix Riel, un de ses enfants et sa femme que l'horreur de vos crimes politiques a jetée dans les bras de la mort.\nSCÈNE XVIII.\n\nLES MÊMES, HONORABLE SÉNATEUR TRUDEL ET JEAN-BAPTISTE.\n\nTRUDEL.—Vous paraissiez donc bien indigné, M. Dumont.\n\nDUMONT.—Oh ! Je peux bien être souverainement indigné quand je vois tant de conservateurs canadiens-français déserteur la cause nationale ! Vous avez gagné notre pari de l'autre jour. Jamais je n'aurais pensé à un tel aplatissement dans un si grand nombre de ceux de notre sang ! Se seraient-ils mis dans la tête, par hazard, que dans le mouvement du parti national il s'agit d'une guerre de race ?\n\nTRUDEL.—Point du tout ! Ils connaissent les discours éloquents que les sommités politiques des deux partis ont prononcés devant une assemblée, tenne à Montréal pour protester contre la pendaison de Riel. Ils se rappellent que l'honorable M. Beaubien a dit : \"Ce mouvement est unanime ; nous voulons la justice et la liberté pour tous, même pour les orangistes qui veulent nous en priver.\" Ils ne peuvent nier que l'honorable M. Mercier a fait cette noble déclaration : \"Il ne s'agit pas d'une guerre de nationalité ; il s'agit d'une revendication de nos droits... il faut que la manifestation projetée soit une protestation solennelle ralliant toutes les opinions et toutes les nationalités.\" Assurément ils ne peuvent prétendre que M. Edmond Lareau les a effrayés, lorsqu'il a dit : \"Nous ne voulons pas mettre en antagonisme les divers éléments nationaux du Canada.\" Ces paroles de\nM. F. A. Quinn n'ont certainement rien d'agressif : \"La question qui nous occupe n'intéresse pas seulement la race canadienne-française, c'est une question nationale dans laquelle tout canadien est intéressé, quelles que soient sa foi religieuse et son origine.\" L'honorable M. Laurier a parlé dans le même sens : \"Riel est véritablement victime d'un meurtre judiciaire, a-t-il dit, et il est du devoir des canadiens de toute nationalité de voir à ce qu'on semblable meurtre ne soit pas répété.\" M. Coursol a déclaré franchement : \"Nous ne cherchons pas une guerre de race : nous ne réclamons qu'une chose : respect à notre race comme elle respecte toutes les autres races ; justice égale pour tout le monde sur la terre du Canada.\" C'est ainsi que nous avons tous parlé. Dans tout ce que nous avons dit, il est impossible de découvrir le moindre esprit d'antagonisme contre les autres races. Il en est de même des écrits que les journaux français, appartenant aux deux partis politiques, ont publiés par rapport au mouvement national le plus légitime et le plus digne d'un peuple qui se considère libre et qui a conscience de sa grandeur.\n\nDUMONT.—Quelle est donc la cause de tant d'achetés et de défactions dans le parti conservateur ?\n\nTRUDEL.—C'est la soif de l'or, l'ignorance et l'esprit de parti qui aveugle.\n\nDUMONT.—Voilà, en effet, les causes qui dégradent le parti conservateur.\n\nDUMAS.—Oui ! voilà le cancer, le chancere, la gangrène qui tué ce parti !\n\nJEAN-BAPTISTE.—Combien donc les conserva-\nteurs nationaux ont du mérite en s'appliquant si courageusement à extirper de ce parti ces agents morbides qui le jettent dans le marasme !\n\nDUMONT. — Pour arriver à l'accomplissement de l'acte barbare de Regina, véritable honte nationale et insulte sanglante jetée à la figure de tout un peuple, les ministres fédéraux ont eu recours à tous les moyens pour détourner le courant de nos démonstrations populaires et patriotiques, pour neutraliser l'effet de notre agitation constitutionnelle et pour prévenir les protestations de toute la députation canadienne-française. Après la consommation de leur crime, Sir John et ses collègues ont pensé qu'ils pourraient encore continuer la lourde chaîne qui devait tenir dans l'esclavage, la province de Québec. Le News de Toronto considérait les canadiens-français comme des pourceaux, et Le Mail se préparait à en faire une nouvelle conquête pour les réduire à leur juste valeur et les mettre à leur place, avec la guenille de leur drapeau. Des canadiens-français du parti conservateur se sont livrés d'eux-mêmes à de tels ennemis qui les ont salis et les souillent encore avec la boue de leurs souliers, et en reconnaissance de cette bienveillante réception, ils ont donné le baiser de Judas à leur race.\n\nDUMAS. — Oh ! quelle bassesse ! quelle honte ! quel abaissement ! C'en est donc fait de la nationalité d'origine française, en Canada !\n\nJEAN-BAPTISTE. — C'en aurait été fait de notre belle patrie, si la Providence n'eût pas veillé sur elle !\n\nDUMONT. — Oui, vous avez raison, mon ami Jean-Baptiste. Dans ces circonstances critiques où le pays allait s'effondrer dans l'abîme, la Pro-\nvidence a suscité un homme qui l'a sauvé ; c'est vous, vaillant et noble compatriote, c'est vous, M. le Sénateur Trudel.\n\nTRUDEL.—Mes chers amis, depuis le jour où nous avons été si ignominieusement souffletés sur le gibet de Regina, je n'ai cessé de remplir mon journal de documents les plus écrasants, d'arguments les plus irréfutables, de preuves les plus péremptoires, pour démontrer que les fauteurs de désordres et de révoltes, que les ennemis du droit et de la justice, de la paix, de la prospérité et de la gloire de notre pays, en 1869-70 et en 1884-85, étaient le ministère fédéral lui-même et ses employés subalternes dans le Nord Ouest.\n\nJEAN-BAPTISTE.—Je proclame hautement que, grâce au concours d'un certain nombre d'hommes d'intelligence et de cœur, vous avez arrêté le parti conservateur dans son œuvre de trahison et de destruction.\n\nDUMONT.—Les libéraux ont bien fait une lutte gigantesque pour anéantir ce parti corrompu. Mais, peut-être que seuls leurs efforts n'auraient pas abouti à faire disparaître les traîtres du parti de la corde.\n\nDUMAS.—Pourquoi ?\n\nDUMONT.—C'est parce que les libéraux sont dans l'opposition et que beaucoup de conservateurs ne les auraient pas crus sincères, bien qu'ils l'étaient et le sont encore.\n\nJEAN-BAPTISTE.—Si je vous ai bien compris dans votre journal, je crois que vous ne voulez pas la disparition du parti conservateur ni le triomphe du parti libéral.\n\nTRUDEL.—Il faut bien comprendre dans quel\nsens j'ai dirigé et je déploie encore toute mon énergie et tous mes efforts. Je veux séparer du parti conservateur ceux qui le corrompent et le perdent, je ne veux pas du tout son anéantissement.\n\nDUMONT.—Vous faites précisément comme font les chirurgiens, qui, dans les cas de cancer ou de gangrène, retranchent la partie malade pour rendre la vie à leur patient.\n\nTRUDEL.—C'est cela ! le parti conservateur est comme mon patient. Je ne me tourne pas contre lui, mais je ne tends qu'à le débarrasser de sa gangrène pour le ramener à la santé.\n\nDUMONT.—Agir ainsi n'est certainement pas tourner son capot ! Il faut avoir de la force de caractère comme vous, M. Trudel, pour travailler de cette manière dans l'intérêt de votre parti.\n\nDUMAS.—Je pense que le parti conservateur est trop enfoncé dans la corruption, pour que l'on puisse dorénavant en attendre quelque chose de bon.\n\nDUMONT.—Je désire ardemment que le parti libéral le foute sous ses talons et en fasse disparaître jusqu'aux moindres vestiges.\n\nJEAN-BAPTISTE.—Quant à moi, je renonce au parti des pendards et des crampons, et je me jette corps et âme dans les bras du parti libéral. Pensez-vous, M. Trudel, qu'il soit possible de ramener le parti conservateur à ses splendeurs premières.\n\nDUMONT.—Quelles splendeurs premières ? Sir John Macdonald ! un hypocrite ! un traître ! le pire ennemi des Canadiens-Français, qu'il hait souverainement ! Les loges de l'orangisme, dont il est le suppôt le plus fidèle et le plus actif ! Les\ntrois renégats qui sont dans le ministère l'approbent de la race canadienne-française ! tous les valets qui, pour des places, des honneurs, de l'argent, vendent là cause nationale aux plus grands ennemis de notre nationalité !\n\nTRUDEL.—Que l'on mette des hommes à la tête du parti conservateur, et ce parti deviendra fort et puissant. Tout mon programme et toutes mes aspirations sont là.\n\nDUMONT.—Vos combats ont bien réussi, il est vrai, à faire élire quelques conservateurs nationaux, qui n'ont pas l'apparence d'hommes disposés à se vendre et qui vont faire tomber le gouvernement Ross. Mais sont-ils capables de reconstituer le parti conservateur sur la base de vos principes.\n\nDUMAS.—Aucune combinaison ne peut avoir lieu, à moins qu'elle soit dans le sens des conservateurs pendards et crampons.\n\nJEAN-BAPTISTE. Dans les prochaines élections fédérales, votre journal, M. Trudel, va certainement réussir à faire élire un bon nombre de conservateurs nationaux à la place de conservateurs vendus et chevaliers de la corde. C'est ainsi que vous donnerez le coup de mort à un parti qui doit être engouffré dans les ombres du passé.\n\nDUMAS—C'est très bien. Ce sera alors une ère nouvelle !\n\nJEAN-BAPTISTE.—Je soutiens, en effet, que les nationaux ne pourront pas, à Ottawa, former un ministère conservateur.\n\nDUMAS.—Pourquoi, alors, M. Trudel, ne travaillez-vous pas à faire arriver les libéraux au pouvoir ?\nTRUDEL.—Ils ont un programme politique que j'ai toujours condamné.\n\nJEAN-BAPTISTE.—On sait que vous avez été toujours opposé aux principes de la politique libérale. Mais il me semble qu'aujourd'hui, vu qu'ils combattent vaillamment à vos côtés pour la plus belle cause nationale du siècle, vous devriez vous déclarer franchement libéral.\n\nTRUDEL.—Cela n'est pas nécessaire. Je fais appel aux hommes de cœur et de bonne volonté, qu'ils viennent du parti conservateur ou du parti libéral. Je veux des hommes qui se montrent aussi bons catholiques en politique qu'à l'église, et fermement décidés à voter la déchéance de Sir John Macdonald et de ses partisans.\n\nDUMONT.—Alors il ne devrait y avoir que deux partis : le parti national et le parti de la corde ou des pendards.\n\nDUMAS.—Je crois que les libéraux consentiraient à être appelés nationaux seulement.\n\nJEAN-BAPTISTE.—Que les conservateurs nationaux et les libéraux s'unissent ensemble, comme des hommes de cœur et d'intelligence, pour former un parti national en opposition au parti des hommes avilis, perdus, vendus et pleins de basse en face de leurs ennemis, c'est bien ce que je souhaite. Mais l'annexion de la province de Québec aux États-Unis ne serait-elle pas plus avantageuse, M. Trudel ?\n\nTRUDEL.—Non, et je n'en veux pas. Je prétends que, sous la Couronne d'Angleterre, si nous le voulons, nous pourrons devenir le plus grand peuple de l'Amérique.\nJean-Baptiste.—Eh bien ! moi, j'affirme que l'annexion aux États-Unis est une question de temps. Il faut que le Canada, avant longtemps, entre dans la belle et florissante Confédération des États-Unis. Les préjugés disparaîtront, la vérité retiendra, et on comprendra que sous le rapport religieux comme sous le rapport matériel, le peuple canadien aura tout à y gagner.\n\nHYGIÈNE.\n\n\"L'Hygiène, a dit M. le Dr. J. T. Desroches, de Montréal, est une science tout à fait humaine. L'avenir de l'homme est soumis à ses lois. À cause de la multiplicité d'applications, le champ de cette science est vaste, et l'homme doit en faire une culture des plus soignées.\" Ainsi dans le but de populariser les lois de la vie, il serait à désirer que des médecins, à l'exemple de M. le Dr. Desroches, publientaient des ouvrages sur cette branche si importante de la médecine.\n\nEn s'occupant de cette œuvre si éminemment patriotique, on contribuerait largement à assurer le progrès sous le triple rapport physique, moral et intellectuel de notre peuple.\n\nJe considère cette science comme une des bases fondamentales de l'existence des nations. Voilà pourquoi, j'ai publié sur cette question deux livres :\n\nLE LIVRE DES MÈRES ;\nINSTRUCTIONS PRATIQUES AUX MÈRES,\nSUR L'HYGIÈNE ET LES MALADIES DES ENFANTS.\nDR. E. PAQUIN.\nD. BEAUDRY\nMarchand de Hardes Faites\n96, Woodward Ave., Detroit.\n\nCompatriotes de Détroit, vous n'avez, dans cette ville, qu'un seul magasin de ce genre à patroniser.\nC'est le meilleur établissement canadien-français.\nDans cette maison florissante, il y a un stock d'habilllements des plus variés et tout à fait en rapport avec les moyens des visiteurs.\nPar son honnêteté, son activité et son affabilité,\nM. Beaudry s'est acquis les sympathies et la confiance de la plus grande clientèle.\nQu'on se rende donc toujours en foule chez\n\nD. BEAUDRY\n96, Woodward Ave., DETROIT.\n\nJ. A. PAQUIN\nMarchand à Saint-Eustache\nComté des Deux-Montagnes.\n\nLe magasin de J. A. PAQUIN est un des plus grands et des plus beaux que l'on puisse voir dans la campagne.\nC'est un établissement qui peut même rivaliser avec les plus importantes maisons de Montréal.\nJ. A. PAQUIN a toujours en mains un lot de marchandises des mieux assorties pour rencontrer tous les besoins de ses clients. Voilà pourquoi ce marchand s'est acquis la plus belle clientèle de toutes les paroisses environnantes de St-Eustache.\nCompatriotes de St-Eustache, de Ste-Thérèse, de St-Augustin, de Ste-Scholastique, de St-Joseph, de St-Benoît, de Ste-Rose, de St-Martin, de l'île Bizard et de Ste-Geneviève, continuez toujours à patroniser la maison J. A. PAQUIN; c'est ainsi que vous ferez des économies profitables et que vous verrez un de nos nôtres faire honneur à notre nationalité.\nLes tweeds de J. A. Paquin ne souffrent pas de comparaison tant ils sont supérieurs par la qualité et la modicité des prix.\nLes étoffes à robes de J. A. Paquin sont incomparables.\nVoilà qu'on visite en masse cette maison de commerce si florissante.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001520.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 148, "total-input-tokens": 188962, "total-output-tokens": 61723, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 165, 4], [165, 488, 5], [488, 1024, 6], [1024, 1024, 7], [1024, 1929, 8], [1929, 3237, 9], [3237, 4682, 10], [4682, 6167, 11], [6167, 7417, 12], [7417, 8842, 13], [8842, 10405, 14], [10405, 11946, 15], [11946, 13346, 16], [13346, 14447, 17], [14447, 16064, 18], [16064, 17549, 19], [17549, 18882, 20], [18882, 20467, 21], [20467, 22025, 22], [22025, 23644, 23], [23644, 25204, 24], [25204, 26550, 25], [26550, 27888, 26], [27888, 29418, 27], [29418, 30979, 28], [30979, 32646, 29], [32646, 34219, 30], [34219, 35779, 31], [35779, 37337, 32], [37337, 38840, 33], [38840, 40020, 34], [40020, 41548, 35], [41548, 42828, 36], [42828, 44235, 37], [44235, 45389, 38], [45389, 46994, 39], [46994, 47290, 40], [47290, 47737, 41], [47737, 48942, 42], [48942, 50222, 43], [50222, 51671, 44], [51671, 53317, 45], [53317, 54812, 46], [54812, 56412, 47], [56412, 58038, 48], [58038, 59694, 49], [59694, 61298, 50], [61298, 62904, 51], [62904, 64441, 52], [64441, 65844, 53], [65844, 67226, 54], [67226, 68702, 55], [68702, 69960, 56], [69960, 71330, 57], [71330, 72769, 58], [72769, 74270, 59], [74270, 75765, 60], [75765, 76627, 61], [76627, 77806, 62], [77806, 79019, 63], [79019, 80538, 64], [80538, 82014, 65], [82014, 83416, 66], [83416, 84929, 67], [84929, 86213, 68], [86213, 87585, 69], [87585, 89218, 70], [89218, 90816, 71], [90816, 92257, 72], [92257, 93489, 73], [93489, 94846, 74], [94846, 96114, 75], [96114, 97705, 76], [97705, 99352, 77], [99352, 100887, 78], [100887, 102364, 79], [102364, 103587, 80], [103587, 104930, 81], [104930, 106238, 82], [106238, 107730, 83], [107730, 109132, 84], [109132, 110311, 85], [110311, 111677, 86], [111677, 112985, 87], [112985, 113991, 88], [113991, 115224, 89], [115224, 116551, 90], [116551, 117667, 91], [117667, 119044, 92], [119044, 120645, 93], [120645, 121354, 94], [121354, 122427, 95], [122427, 123519, 96], [123519, 124992, 97], [124992, 126177, 98], [126177, 127433, 99], [127433, 128927, 100], [128927, 130533, 101], [130533, 131873, 102], [131873, 133314, 103], [133314, 134783, 104], [134783, 136242, 105], [136242, 137649, 106], [137649, 139036, 107], [139036, 140458, 108], [140458, 141987, 109], [141987, 143465, 110], [143465, 145069, 111], [145069, 146551, 112], [146551, 147911, 113], [147911, 149365, 114], [149365, 150843, 115], [150843, 151920, 116], [151920, 153225, 117], [153225, 154461, 118], [154461, 155720, 119], [155720, 157024, 120], [157024, 158410, 121], [158410, 159833, 122], [159833, 161105, 123], [161105, 162515, 124], [162515, 163809, 125], [163809, 165492, 126], [165492, 166798, 127], [166798, 168352, 128], [168352, 169757, 129], [169757, 171149, 130], [171149, 172543, 131], [172543, 174068, 132], [174068, 175577, 133], [175577, 176896, 134], [176896, 178429, 135], [178429, 179862, 136], [179862, 181319, 137], [181319, 182589, 138], [182589, 183998, 139], [183998, 185506, 140], [185506, 187142, 141], [187142, 188598, 142], [188598, 190091, 143], [190091, 191501, 144], [191501, 192916, 145], [192916, 194217, 146], [194217, 195903, 147], [195903, 195903, 148]], "primary_language": ["None", "None", "None", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]