[{"id": "60acb1a52e0add84885030ed0abf2d88b98ca839", "text": "LOUIS RIEL\n\nASSEMBLÉE DE LACHINE,\n10 AOÛT 1885.\n\nDISCOURS DE M. GIROUARD,\nDÉPUTÉ DU COMTÉ JACQUES-CARTIER\n\nSOMMAIRE COMPLET\n\nCORRIGÉ PAR LUI-MÊME.\n\nDU MONDE, 12 Août 1885.\n\nDepuis 50 ans, la plus parfaite tranquillité a régné dans le pays ; toutes les provinces ont eu des griefs ; par exemple les réserves du clergé protestant et la représentation basée sur la population à l'Ontario ; l'abolition de la tenure seigneuriale à Québec, la question des écoles séparées au Nouveau-Brunswick. Encore dernièrement la Nouvelle-Écosse lançait le cri d'indépendance en pleine législature, mais quelques jours après elle envoyait ses soldats pour défendre le drapeau de l'Union.\n\nLa question des terres à l'Île-du-Prince-Edouard, celle des pêcheries pour toutes les Provinces Maritimes, celle de la frontière de l'Ontario et encore plus récemment la question chinoise pour la Colombie Britannique, toutes autant de questions plus brûlantes et plus pressantes que celle des Métis de Saint-Laurent, qui, avec le temps ont reçu une solution pacifique et à la fois satisfaisante.\n\nEt puis, enfin, la politique nationale que tout le Dominion souffrant d'une concurrence énorme de la part du commerce américain, ne demande à grands cris et par tant de requêtes et pendant tant d'années, n'a-t-elle pas été acquise par des moyens constitutionnels ?\n\nSi des abus, des griefs locaux, peuvent justifier un appel aux armes, le pays tout entier n'aurait-il pas eu raison de s'insurger contre l'administration libérale de 1875 à 1879 ? Non ; le peuple a patiemment mais sagement attendu les élections générales et le 20 septembre 1878, il se rendait justice à lui-même en renversant une majorité trop docile en Parlement de 75 en une minorité de 90.\n\nLe remède à tous les griefs a toujours été trouvé dans l'agitation politique, les moyens constitutionnels.\n\nRiel et les Métis de Saint Laurent n'ont eux-mêmes songé d'abord qu'au mode pacifique et constitutionnel. Mais, a-t-on dit, ce n'est que lorsque l'on a vu que les moyens constitutionnels ne produisaient rien, qu'on a eu recours aux armes. Quels étaient ces griefs ? Consultons l'histoire politique de ce pays. Le Canada a acquis le Nord-Ouest en 1869.\n\nTout y était à faire, constitution politique, organisation des tribunaux, arpentages, bureaux d'enregistrement, voies de communication, bureaux de poste, et si à cela l'on ajoute que le pays était peuplé de 33 à 34,000 sauvages et de 12 à 13,000 métis de diverses origines, plus civilisés que les sauvages, mais vivant de chasse et de pêche comme eux, était quand même grand que le reste du Canada, la Colombie Britannique compris, quatorze fois plus grand que la France, ou l'imagera à peine l'œuvre gigantesque que le gouvernement canadien entreprenait. En quinze ans, il a introduit la civilisation et l'ordre partout. La province de Manitoba a été organisée à l'image des vieilles provinces et surtout de la province de Québec. Le Nord-Ouest a aussi été doté d'une constitution politique et des institutions de la civilisation des blancs. Des bureaux de poste ont été établis, des tribunaux et bureaux d'enregistrement ouverts, enfin, l'autorité de la loi établie partout, sans même répandre une goutte de sang.\n\nLe premier Conseil du Nord-Ouest a été organisé en 1870, ayant tous ses membres choisis\nParmi la population de ces régions et surtout la population française et métisse, entr'autres MM. Girard, aujourd'hui sénateur, Dubuc, aujourd'hui juge de la Cour Supérieure à Winnipeg, Royal, plus tard premier ministre de Manitoba et député de Provencher, Pierre De Lorme et Pascal Brelan, tous deux Métis.\n\nEn 1875, l'administration Mackenzie changea la constitution du Nord-Ouest, et bien qu'elle soit admirable et éminemment dans le sens populaire, vu qu'elle donne au Nord-Ouest à peu près tous les pouvoirs des législatures des vieilles provinces, le Cabinet Mackenzie eut l'énorme tort d'ignorer toute la population métisse et blanche du Nord-Ouest dans le choix de ses nominations. Les membres du Conseil furent pris à Ontario et son lieutenant-gouverneur, Laird, à l'Île du Prince Édouard. Le shérif, le registraire, l'agent des terres, les magistrats furent tous pris à Ontario. Des plaintes furent faites à ce sujet au Parlement durant la session de 1878, et particulièrement par Sir Hector Langevin. Les Métis envoyèrent des requêtes au gouvernement vers la même époque.\n\nIls signalèrent entre autres le fait que le magistrat Richardson refusait de se servir de jurés français, parce qu'ils ne parlaient pas l'anglais et que lui ne parlait pas le français. La conséquence a été qu'au printemps de 1878 le gouvernement Mackenzie nomma M. Brelan au Conseil, et plus tard, l'administration actuelle nomma M. Rouleau, canadien-français de notre province, magistrat stipendié ; Louis Schmidt, métis, sous-agent des terres à Prince Albert, et Gauvreau, agent des terres à Edmonton ; il nomma aussi M. Dubuc juge à Manitoba et récemment M. Prud'homme juge de comté de cette même province et M. George Roy registraire d'Edmonton. À part M. Brelan, M. Mackenzie n'a fait aucune nomination parmi les résidents. La conséquence a été que les intérêts du Nord-Ouest ont été négligés. Depuis 1875 jusqu'à 1877, le gouvernement libéral a été sollicité d'adopter une loi pour protéger le buffle, la nourriture principale des Sauvages et des Métis.\n\nLe Père Lacombe recommanda d'empêcher la chasse du buffle du 1er novembre au 1er mai, et en tous temps des vaches et des veaux. M. Schultz et M. D. A. Smith, députés de Manitoba, en 1876 et 1877, ont demandé au gouvernement d'adopter des mesures de protection.\n\nDe longs débats eurent lieu alors en Parlement. On citait surtout le rapport de M. Dickinson, employé du gouvernement, envoyé tout exprès pour faire une étude de la question ; cet employé d'expérience recommandait l'adoption du plan du Père Lacombe ; il disait que si le gouvernement continuait de ne rien faire, qu'il nous faudrait bientôt faire vivre les Sauvages.\n\nLe gouvernement a répondu qu'il ne pouvait rien faire et il renvoyait la question au Conseil du Nord-Ouest, qui n'avait pas de juridiction sur le sujet à cause des traités avec les Sauvages. Aussi en 1878, le Conseil abrogea-t-il l'ordonnance qu'il avait passée en 1877, pour protéger le buffle.\n\nC'est la plus grosse bévue qui ait été commise. Lorsque le gouvernement conservateur est arrivé au pouvoir en octobre 1878, il était trop tard. On ne pouvait rien faire pour sauver le buffle, qui avait été massacré et était presque éteint. Alors il fallu songer à faire vivre les Sauvages. Outre les rations auxquels ils avaient droit, il fallut leur donner des aliments pour les empêcher de mourir de faim, piller et tuer. En 1882, il leur a été donné $563,651 à titre de charité, autant en 1883 et $499,325 en 1884. Chaque famille Sauvage, composée d'au moins 5 personnes a reçu $110, durant chacune de ces années en provisions et en argent, tant en vertu des traités qu'autrement, et cela sans parler des instruments agricoles, grains de semence etc. Les sommes suivantes que nous avons dépensées chaque année pour les Sauvages de Manitoba et du Nord-Ouest font voir jusqu'à l'évidence que les Sauvages qui y sont au nombre de 34,000, y ont été librement traités.\n\n| Année | Montant |\n|-------|---------|\n| 1872  | $35,834 |\n| 1873  | $57,455 |\n| 1874  | $92,040 |\n| 1875  | $134,339 |\n| 1876  | $203,295 |\n| 1877  | $253,036 |\n| 1878  | $371,144 |\n| 1879  | $694,612 |\n| 1880  | $621,057 |\n| 1881  | $726,737 |\n| 1882  | $1,027,216 |\n| 1883  | $1,098,798 |\n| 1884  | $1,025,675 |\n\nMais, dit-on, les sauvages ont-ils réellement reçu ce que nous avons eu à payer ? Qu'il ait pu se glisser quelques abus, c'est possible, même probable, si l'on considère les difficultés du service. L'honorable député mentionné qu'il a lu tous les journaux du Nord-Ouest, y compris le Manitoba de Saint-Boniface, l'organe des Métis et il n'a pas trouvé une seule plainte à ce sujet. Les rapports des officiers pour l'an passé sont favorables. En 1883, il y a eu quelques plaintes, mais seulement à l'égard de réserves situées bien au nord et d'un accès difficile le printemps, et encore ces plaintes n'étaient faites qu'à l'égard de quelques instruments agricoles et du grain de semence qui étaient arrivés tard, à cause des difficultés du transport. La seule plainte générale que l'on trouve dans les rapports officiels au sujet des provisions se rapporte à la dernière année de l'administration MacKenzie, 1878, mais on peut difficilement lui en faire un reproche sérieux si l'on considère l'immense territoire à parcourir et les difficultés du service. Aussi n'est-il pas remarquable que les Métis à l'assemblée du 5 septembre 1884 à Saint Laurent où ils ont énoncé leurs\ngrièces, n'ayant fait aucune mention que les rations n'avaient pas la qualité ou la quantité voulue.\n\nLe gouvernement Macdonald en voyant la destruction du buffle a compris qu'il ne lui restait qu'à habituer le sauvage à l'agriculture. Les rations extra devaient suffire pour prendre soin des vieillards et même des hommes mûrs, car on ne peut guère espérer que le sauvage, habitué à la vie nomade des prairies, à la chasse et à la pêche, puisse de suite se livrer à l'agriculture. On lui a donné des instituteurs agraires. En 1883 le gouvernement établit 16 fermes sur les réserves et en 1884 il en avait 27, dont l'entretien seul, les salaires des instituteurs compris, forme $71,130 par an.\n\nLe gouvernement s'est mis de suite à instruire la jeunesse. Comme le disait monseigneur Grandin, notre seule espérance est dans l'enfant ; on ne parviendra jamais à faire un cultivateur de l'homme sauf. Monseigneur avait plusieurs fois demandé du secours aux écoles au gouvernement Mackenzie, entr'autres en 1875 et sa Grandeur avait été renvoyée au Conseil du Nord-Ouest qui n'existait pas encore, puisque bien qu'autorisée par le Parlement durant l'hiver de 1875, le Conseil n'a été organisé que dans l'automne de 1876.\n\nAinsi en 1878, lors que Sir John A. Macdonald est arrivé au pouvoir, il n'a trouvé que trois écoles sauvages au Nord-Ouest et sept au Manitoba soutenues ou aidées par le gouvernement. Aujourd'hui il y en a 53 coûtant $12,241, par an ou $240 par école. Bon nombre de ces écoles sont sous le contrôle des pères ou des sœurs.\n\nMais il ne suffisait pas d'instruire l'enfant sauvage, il fallait aussi l'initier aux secrets de la vie domestique et pour cela lui donner une idée des diverses industries qui s'y rattachent.\n\nEn 1883, le gouvernement a ordonné l'ouverture de trois écoles industrielles, une à la Grande Rivière sous le Père Lacombe, une à Qu'Appelle sous le Père Hugonard et une à Battleford sous le Rèv Thomas Clarke, ministre anglican. De plus il a accordé $1,500 à l'école industrielle de Monseigneur Grandin à St Albert. L'installation de ces écoles a coûté $44,000.\n\nToutes ces institutions ont produit d'excellents résultats, et si les Sauvages ne se sont pas révoltés généralement, si seulement Poundmaker et Gros Ours se sont joints à Riel, avec tout au plus 4 ou 500 guerriers, ça est parce que les Sauvages ont été bien traités par le gouvernement.\n\nGros-Ours, qui a toujours été une cause d'embarras, a vu Riel le 23 juillet 1884 et malgré que lui et son voisin Poundmaker étaient sur des réserves, choisis même par le gouvernement, ils ont pris les armes sur des représentations, sinon des ordres de Riel.\n\nMaintenant voyons les griefs des Métis tels que formulés à l'assemblé de Saint Laurent le 5 sept. 1884, présidée par Riel. Disons d'abord que les Métis qui se sont insurgés, ne dépassaient pas 2 ou 300 formant les établissements de Saint Laurent distribués sur un parcours de quinze ou vingt milles carrés. Que voulaient donc ces Métis ? Ils demandaient d'abord l'inauguration du gouvernement responsable et la création d'autant de provinces qu'il y a de districts, en tout cinq nouvelles provinces et toutes les terres qui en dépendent. Constatons d'abord que les colons blancs qui ont aussi eu leurs assemblées et leurs listes de réformes ne demandent pas cela. Ils sont satisfaits de la constitution actuelle du Nord-Ouest, au moins pour le moment. We are not in favor of a division of the Territories into Provinces, disaient les habitants d'Assiniboia à l'assemblée de Mooseomin de janvier 1885. En 1875, le gouvernement McKenzie l'a doté d'une constitution. Six membres sont d'abord nommés par le gouvernement et compris les trois magistrats stipendiaires. Puis aussitôt qu'un district de 1,000 milles carrés aura une population de mille adultes, sans compter les étrangers et les Sauvages, il aura droit à un député au Conseil, et à un deuxième aussitôt que sa population sera de 2,000 habitants.\n\nDéjà le peuple élit huit députés et il a la majorité au conseil, même en comptant le nouveau conseiller Travis, que le gouvernement vient de nommer dans la personne d'un quatrième magistrat stipendiaire. Ce Conseil a tous les pouvoirs des Législatures provinciales, moins celui d'incorporer des compagnies de chemin de fer, télégraphe, bateaux à vapeur et autres de ce genre.\n\nIl peut taxer pour des fins locales, passer des lois civiles et de procédure, touchant la propriété, les prisons, le gibier et enfin légiférer sur toutes matières d'un intérêt local. Ce Conseil a été donc créé à l'image des législatures provinciales et par sa juridiction et par sa composition, La Couronne y est représentée, bien qu'en minorité, et le peuple y a aussi ses représentants, et ce corps législatif est enfin présidé par un lieutenant-gouverneur. Il forme et le gouvernement et le corps législatif et de cette façon le peuple y jouit pour les fins locales des avantages du gouvernement responsable. L'on voit de suite la différence entre la situation du peuple du Nord-Ouest et celle du Bas Canada avant 1837, entre la rébellion de 37 et celle de 85.\n\nLe peuple du Bas Canada avait fait de l'agitation politique pendant 25 ans au moins, pour avoir le gouvernement responsable. Bien qu'en grande majorité à l'assemblée législative, il était taxé par un gouverneur et un conseil non responsables. Au contraire au Nord-Ouest le peuple à ses représentants et est même en majorité au seul corps qui peut taxer, et l'on voit de suite qu'il n'y a aucune analogie entre les deux cas.\n\nLes Métis demandent cinq nouvelles pro-\nvinces, Assiniboia, Alberta, Saskatchewan, Athabasca et Keewatin qui forment les districts des territoires. Mais ont-ils jamais songé à quelles dépenses ils entraîneraient les vieilles provinces ? La province de Québec a surtout voulu la création de la province de Manitoba en 1870. Alors on nous demandait seulement $43,600 de subsides annuel. Aujourd'hui, nous lui donnons $440,000. Créez cinq nouvelles provinces et il faudra au moins leur donner $200,000 chaque par an.\n\nJe ne crois pas que les vieilles provinces consentent à se charger d’un fardeau aussi lourd et surtout à abandonner les terres publiques en sus, sans y voir aucun objet pratique, uniquement pour satisfaire un sentiment.\n\nLe Conseil du Nord-Ouest tel que constitué et il peut avoir jusqu’à 21 membres, (il n’y en a que 15) offre au peuple toutes les garanties et toutes les immunités importantes dont jouissent les vieilles provinces.\n\nLes Métis demandent en second lieu que le gouvernement leur donne des titres à leurs propriétés, que l’on appelle patentes. Il n’y a pas de doute qu’il y ait eu des délais à cet égard, mais qu’il y ait eu une part de la part du gouvernement, c’est autre chose ; ces délais ont été le résultat inévitable de la situation.\n\nD’abord, le gouvernement ne pouvait émaner de patentes sans avoir des arpentages des terres. Il a fallu commencer par Manitoba, et finir au Nord-Ouest. Toutes les diligences ont été faites.\n\nEn 1873, lorsque le gouvernement conservateur laissait le pouvoir, il avait fait arpenter 9,999,000 acres.\n\nLe gouvernement Mackenzie arriva au pouvoir et de 1874 jusqu’à 1878, il n’a fait arperter que 1,797,150 acres ; étant convaincu que ces terres ne valaient rien ou presque rien, il n’a pas cru qu’elles valaient la peine d’être arpentées ; ayant changé d’opinion depuis, le parti libéral reproche au gouvernement actuel de ne pas avoir procédé à-sez vite avec les arpentages. Or, depuis 1879 jusqu’à 1884, il a fait arperter 55,618,509 acres de terre. En 1883 seul, alors que le Pacifique traversait tout le Nord-Ouest jusqu’au pied des Montagnes Rocheuses et que l’émigration était plus considérable, il a fait arperter 27,000,000 d’acres, employant 120 arpenteurs, dont 35 Canadiens-français, à un coût total de $725,000 pour cette année seulement. En 1884, il a été arpenté 6,400,000 acres, par 60 arpenteurs dont 22 Canadiens-français. Et l’on va dire maintenant qu’on a procédé lentement avec les arpentages.\n\nAvec les arpentages, les bureaux de terre et les bureaux d’enregistrement ont été ouverts.\n\nEn 1884, quatre nouveaux bureaux de terre ont été ouverts, à Calgary, Edmonton, Touchwood et Coteau, lorsque jusqu’alors, (les arpentages n’ayant pas été poussés avec la même vigueur, bien qu’en 1881 et 1882 au delà de 9,000,000 acres aient été arpentés chaque année) il n’y avait en tout que deux bureaux de terre, l’un à Prince Albert et l’autre à Régina. Pour la même raison, il a été ouvert de nouveaux bureaux d’enregistrement et il y en a cinq aujourd’hui, Battleford, Prince Albert (situé à quelques milles de St Laurent, le siège des insurgés), Régina, Calgary et Edmonton. Avec les arpentages, les titres des anciens colons, blancs ou métis, en possession le 15 juillet 1870, date du transport du Nord-Ouest au gouvernement canadien ont pu être vérifiés. C’est ce qui a été fait en 1884 par M. Pearce et M. Duck, ce dernier parlant l’anglais, le cri et le français. L’an passé le bureau a examiné 711 de ces réclamations et la balance était en voie de règlement.\n\nQuelle différence entre la politique actuelle et celle de l’ancienne administration. Le gouvernement actuel envoie quérir auprès des intéressés sur les lieux.\n\nQuelle a été la réponse de M. Mills dans une circonstance pareille. Des métis de Manitoba avaient des réclamations contre le gouvernement. Ils avaient émigré au Nord-Ouest. Il s’agissait d’autoriser l’examen de leurs réclamations à leurs nouveaux domiciles par un officier qui était sur les lieux. Les métis prirent le gouverneur Laird de demander par le télégraphe l’autorisation nécessaire. Quelle a été la réponse de M. Mills “It is not necessary to look up parties who have claims. If they care for their interests, they will themselves come forward and establish their claims.”\n\nLe 3e grief des métis tel que formulé à l’assemblée de Saint Laurent était que le gouvernement ne les avait pas indemnisés comme ceux de Manitoba de ce que l’on appelle le titre indien, c’est-à-dire pour s’être emparé du territoire et avoir mis fin à la chasse et à leur vie nomade. Les Sauvages avaient été amplement indemnisés en vertu de traités. Les Métis de Manitoba avaient aussi été récompensés à même l’octroi de 1,400,000 acres de terre décrété en 1870 par l’Acte de Manitoba.\n\nJusqu’à 1873, il n’a pas eu de plainte de la part des Métis du Nord-Ouest à ce sujet ; ils étaient trop peu nombreux, à peu près 1000 ; ils avaient encore le buffle et ils étaient satisfaits. Mais en 1873 le buffle commençait à disparaître. Les Métis songèrent à leur indemnité et le 5 juillet 1875 ils faisaient leur première demande. Ils disaient : “Nous demandons que l’on nous donne des terres en compensation de nos droits.” Le gouvernement Mackenzie arriva au pouvoir quelques mois après ; mais ne fit aucun cas de cette remontrance. Le premier octobre 1874 le Père Facory, missionnaire à Qu’Appelle, demandait au gouvernement un octroi de terre plus étendu que le homestead ordinaire, accordé à tout colon, et il invoquait le titre indien, les Métis quoique descendant de pères blancs\nayant beaucoup de points communs avec le sauvage; il demandait aussi des secours en agriculture.\n\nPas plus de réponse qu’auparavant. Enfin, le 13 février 1873 les Métis de Saint-Laurent et de Saint-Albert envoyèrent une nouvelle requête. Cette fois, une réponse a été donnée; la voici : Les Métis seront traités comme les blancs et auront droit à un homestead comme eux, mais rien de plus. Voici le langage textuel de M. Mills :\n\nThe half-breads, who have, in some respects, the advantage over new settlers in the Territories, should be impressed with the necessity of settling down in fixed localities and directing their energies to agricultural pursuits, in which case land would no doubt be assigned to them in the same way as to the white settlers. But beyond this they must not look to the Government for any special assistance in their farming operations.\n\nEn 1873, le gouvernement Macdonald fut autorisé par le Parlement à indemniser les Métis du Nord-Ouest et à leur donner une part au titre indien. Mais alors ont surgi des obstacles et des difficultés. Monseigneur Taché, profitant de son expérience à Manitoba, où les Métis avaient vendu leurs scrips pour une chanson, voulait que ces scrips ou les cœurs de terre qu’ils pourraient avoir fussent annulables pendant trois générations. L’évêque anglican, M. Laird, gouverneur du Nord-Ouest et M. Norquay, premier ministre de Manitoba et Métis lui-même, voulaient aussi des restrictions. Le Conseil du Nord-Ouest demandait dix ans de suspension. Les colons blancs, intéressés à spéculer sur les terres des Métis au Nord-Ouest comme ils l’avaient fait à Manitoba, ne voulaient pas de restriction. Les Métis poussés par les blancs demandaient la même chose.\n\nNaturellement ces prétentions diverses causaient des représentations, correspondances nombreuses et des lenteurs. Finalement à l’assemblée du 5 septembre dernier à Saint-Laurent, les Métis demandent qu’ils soient traités comme les Métis de Manitoba, c’est-à-dire, 160 acres pour les pères de famille et 240 pour chaque enfant, et cela sans restriction. Le 25 janvier 1885, deux mois avant la rébellion, le gouvernement pour en finir, décidait de traiter les Métis du Nord-Ouest comme ceux de Manitoba, c’est-à-dire, sans restriction, ni condition comme ils l’avaient demandé à l’assemblée de Saint-Laurent; le 4 février 1885, les Métis étaient informés de cette décision; ce n’est que le 22 mars suivant qu’ils ont levé l’étendard de la révolte, et naturellement le gouvernement s’est cru devoir continuer sa politique et parachever son œuvre en nommant une commission composée de MM. Street, Goulet et Forget, pour mettre à exécution l’ordre en Conseil du 26 janvier. Voilà ce qui s’est passé au sujet des terres. L’expérience des quatre derniers mois a démontré que le gouvernement avait eu tort de céder aux instances des Métis, car à peine ont-ils eu leurs scrips qu’ils les ont vendus aux spéculateurs blancs à la moitié de leur valeur. À l’avenir, il nous faudra aviser à de nouveaux moyens de leur venir en aide. Le Métis forme une race à part, tenant le milieu entre le sauvage et le blanc et il doit être traité comme tel.\n\nIl y a eu des délais, le résultat inévitable des circonstances, nullement imputable au gouvernement. Le parti libéral devrait savoir qu’il faut de temps pour régler ces réclamations. Le principe de l’octroi aux Métis de Manitoba a été arrêté en 1870 par un statut. Le gouvernement conservateur a travaillé jusqu’en 1873 à leur distribuer.\n\nDe 1873 à 1878 le gouvernement Mackenzie a nommé commission sur commission pour terminer le règlement de cette question et enfin en 1878, lorsqu’il laissa le pouvoir, il restait encore à Manitoba tant de métis non satisfaits qu’il a fallu une nouvelle commission des juges Miller et Dubuc et un nouvel ordre en conseil du 21 février 1881; et même il faut bien le dire, tant les difficultés sont nombreuses et grandes, il reste encore des réclamations des métis de Manitoba non réglées.\n\nVoilà la liste des principaux griefs des Métis. On a bien parlé en Parlement et ailleurs que les arpentages les avaient dépouillés. Ils n’en ont pas dit un mot à leur assemblée du 5 septembre 1884; et le fait est que les cartes et mappes démontrent que partout où il y avait des établissements français le long des rivières, ou a fait les arpentages non pas d’après le système rectangulaire, comme partout ailleurs, mais d’après le système français, sur le long, comme dans la province de Québec, ainsi qu’ils ont voulu l’avoir, et notamment à St Laurent.\n\nLes métis n’ont pas demandé de représentation au parlement d’Ottawa. Ceci a été demandé par les colons blancs à leurs assemblées de l’automne dernier. Cette demande est raisonnable et pour y faire suite, plus d’un mois avant la rébellion, le gouvernement en dépit de l’opposition, faisait passer un bill pour autoriser un recensement au Nord-Ouest. Sans ce recensement, il serait impossible de savoir le nombre de membres auquel le Nord-Ouest a droit au parlement du Canada. De plus il faut demander au parlement impérial le pouvoir d’accorder cette représentation; car sans cet amendement nous ne pouvons céder à cette demande si légitime du Nord-Ouest, et il n’y a pas le moindre doute qu’elle sera accordée.\n\nVoilà les principaux griefs de toute la population du Nord-Ouest, blanche et métisse. Personne n’a jamais prétendu, pas même au procès de Riel, qu’il y avait eu éviction ou même tentative d’éviction ou violence sur la personne ou la propriété, et il n’y a que ces circonstances qui puissent justifier un appel aux armes.\n\nIl est donc évident que le gouvernement n’est pas responsable des malheurs du Nord-\nOuest. Quelle en a donc été la cause ? \n10 L'esprit de vengeance de Riel, 20 son ambition démesurée et insensée. À un moment donné, il s'est cru le roi du ciel et de la terre, pouvant disposer du monde entier et parlant comme l'envoyé de Dieu, son prophète ; 30 l'agitation de spéculateurs et agents de compagnies américaines intéressées à créer du trouble au Nord-Ouest Canadien ; 40 les cris de certains politiciens, affamés ou désappointés ; 50 le ton inflammatoire de certains journaux qui dirigent une partie de l'opinion publique, comme le Globe.\n\nLa rébellion a pris tout le monde par surprise. Sir Hector Langevin, sir Richard Cartwright, M. McLellan, M. Mackenzie et M. MacDougall ont visité le Nord-Ouest en août et septembre 1884, et pas le moindre indice d'un soulèvement quelconque n'a été signalé par eux.\n\nBien plus, le lieutenant-gouverneur Dewdney a visité St. Albert le 16 octobre 1884. Monseigneur Grandin lui présenta une adresse de bienvenue de la part de son clergé. Les citoyens en firent autant. On fait maintes démonstrations de dévouement aux institutions et au gouvernement canadien, banquet, discours, etc. Pas une plainte, satisfaction générale. Enfin le 19 mars 1885, trois jours avant la rébellion, Le Manitoba dément dans les termes les plus formels toute idée de rébellion. Il dit qu'il n'y a que de l'agitation et que toutes les rumeurs au contraire sont des absurdités.\n\nMaintenant que va-t-on faire de Riel ? J'ai demandé au gouvernement en pleine chambre clémence pour les vaincus, sans faire mention de personne et je fais encore la même demande. Riel néanmoins est dans une position exceptionnelle. Il a soulevé les sauvages et les a induit à massacrer des établissements blancs, y compris des agents du gouvernement et des missionnaires catholiques. Quelque soit l'énormité de ses crimes, Riel a droit à un procès légal.\n\nSon procès a été fait en vertu d'une loi passée en 1875 et amendée en 1877 sous l'administration Mackenzie, ne lui donnant que six jurés, sans juré français et grand juré. Cette loi est aujourd'hui citée devant les tribunaux sous le nom de \"L'Acte des Territoires du Nord-Ouest à 1880,\" parce qu'elle fait partie de la refonte faite cette année-là de toutes les lois jusqu'alors concernant le Nord-Ouest, discussion et sans autre changement que dans la phraseologie.\n\nMais par la même loi, il a de droit un appel à la Cour d'appel de Manitoba composée de quatre juges, entr'entre le juge Dubuc : Je ne veux pas être souverain vis-à-vis l'ancienne administration à propos de cette loi. La population du Nord-Ouest était tellement épaisse et claire que ça aurait peut-être été un inconvénient sinon une impossibilité d'avoir douze jurés pour chaque criminel. Quoi qu'il en soit, on dit que ce statut ne peut s'appliquer au crime de trahison. C'est l'opinion de l'hon. M. MacDougall et d'autres juristes de renom. Il faut que ce point soit établi par la Cour d'Appel de Manitoba et si c'est nécessaire par le Conseil Privé.\n\nEnfin Riel est-il fou ? La preuve est contradictoire. Des médecins disent, oui, d'autres disent non. Il a déjà été interné dans les asiles d'aliénés de notre province. Il faut une commission d'hommes de l'art.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001454.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 10704, "total-output-tokens": 8602, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3295, 2], [3295, 8726, 3], [8726, 14283, 4], [14283, 19815, 5], [19815, 25466, 6], [25466, 28660, 7], [28660, 28660, 8]], "primary_language": ["None", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, false, false, false, false, false]}}]