[{"id": "85c07b8933bfc404f2ac11056edf02a4e54bae02", "text": "NORTHWEST ADMINISTRATION.\n\nSPEECH BY THE HON. THOS. WHITE,\nIN THE HOUSE OF COMMONS, OTTAWA, TUESDAY EVENING, 4TH MAY.\n\nReview of the Policy of the Conservative Party.\n\nTHE RESULTS ACHIEVED\n\nProved to have Redounded to the Country's Advantage.\n\nCONTRAST WITH POLICY OF LIBERAL PARTY\n\nCoal Areas, Timber Limits, Grazing Leases, etc., Considered.\n\nThe following is a full report of the speech delivered in the House of Commons on Tuesday evening, May 4th, by Hon. Mr. White on the subject of the administration of Northwest lands:\n\nMr. White (Cardwell).—Mr. Speaker, before I venture very briefly to refer to the speech which the hon. gentleman has just delivered I desire to call his attention to what seems to me to have been a breach of arrangement of which he has been guilty. I owe him the duty of saying that last week he was kind enough to intimate to me that he intended to bring up this general question to-night, and it was understood at that time that we would endeavor to get into supply as early an hour as possible in order that he might make his speech and that the reply might come within a reasonable hour at all events, and if possible a vote be had on the same evening. I know the hon. gentleman was engaged to-day in connection with a duty in which he takes a great deal of interest in connection with his own church, and this afternoon I received from him the following note; which I had torn up, never imagining it was necessary to keep anything of that kind, but the pieces of which have been picked up since, after the manner of picking up another famous document that had some influence in public matters in olden times, and put together.\n\nMr. Cook—Spittoon.\n\nMr. White (Cardwell)—I shall deal with the hon. member for Simcoe before I get through with my speech—I promise him that. The note is to this effect:\n\n\"Tuesday, 4th of May, 1899.\n\n\"My dear Mr. White—I shall be unable to leave my committee this afternoon, as it would be deemed a lack of courtesy to its members and myself or any other here in the premises. I hope this will make no difference to you, and that we shall be able to proceed with the matter to-morrow.\n\n\"Yours truly,\n\n\"JOHN CHARLTON.\"\n\nI got that note this afternoon. A number of hon. members asked me whether this question was coming up to-day—gentlemen whose names have been mentioned by the hon. gentleman in speeches out of this house, and by another hon. gentleman in speeches out of this house—and I told them it was not. After dinner I saw the hon. gentleman again. I spoke to him about the matter. It was then agreed that this debate should come up to-morrow, and not to-day. I had left the chamber, and was engaged in other duties when, te\nmy astonishment, a page was sent to tell me that Mr. Charlton had commenced his arraignment of the Government.\n\nMr. Charlton—I desire to make a personal explanation. When I sent the hon. gentleman a note from Knox's church, I did not anticipate being here this afternoon, and I considered, as a matter of course, that no opportunity would occur to go on with the question until to-morrow. There is a misunderstanding between the hon. gentleman and myself as to what passed between us after dinner. I understood the hon. gentleman to express a preference to go on with the question to-morrow. The debate on the Home Rule matter was then in progress, and I did not anticipate myself there would be any opportunity to go into this subject to-night; but I asked the hon. gentleman what was his preference, but I made, as I understood, no statement of my own. I should have preferred going on with the question to-morrow, but certain circumstances render it desirable that I should leave the city. My father is very ill, and I have been detained here against my will and am anxious to leave; and for that reason, believing it would make no difference to the Minister of the Interior, not knowing that the matter could go on, when a conclusion was unexpectedly reached to the debate on Home Rule, I took the floor.\n\nMr. White (Cardwell)—All I can say is that I have very great sympathy with the hon. gentleman in the cause which is likely to lead him to leave town. But I am very glad indeed that the matter of the arrangement as to the first part is in writing, because after I had spoken to him, and it was perfectly understood since dinner that this subject would not come up to-day, the hon. gentleman approached the leader of the Opposition and spoke to him, whether on this subject or another I cannot say, but the probability is that the leader of the Opposition told him to go on to-night. That is briefly what really occurred, notwithstanding the arrangement to which I have referred.\n\nMr. Charlton—I propose a solution of the difficulty by the hon. gentleman adjourning the House, and he can go on to-morrow.\n\nMr. White (Cardwell)—I propose to do nothing of the kind. I have no objection to going on, and I would just as readily have gone on to-night if the hon. gentleman had frankly said so when he returned, because I took the trouble to go and speak to him. The only thing that I object to is that, when arrangements are made between hon. gentlemen on both sides they should be broken; the question of whether or not arrangements at all should be made is within the option of either side. In view of the fact that this is a question affecting the personal character of a number of members of this House, who had a right to some information as to when it was to be brought up, I think it was hardly fair on the part of the hon. gentleman, after having made the arrangement, that he should have gone on with the matter to-night. That is, however, a matter of no great consequence as affecting the question itself. The hon. gentleman commenced his speech by referring to what he feared was\n\nTHE CONDITION OF PUBLIC SENTIMENT in this country. He feared very much that the public conscience was being blunted and that the public estimate of wrong-doing was becoming lessened in consequence of the general corruption which prevailed in our public life. All I have to say to the hon. gentleman is this, that if that is the case in any way whatever, it is just such speeches as he delivered to-night that are producing that result. When the public find that the charges which are hurled against hon. gentlemen on this side have no better foundation than the mere fact that they write a letter to the department asking for something for a friend which that friend had a right, under the law, to get, when the hon. gentleman lays it down as a sin, as a corrupt act, as something to be denounced, and in relation to which the public conscience should be roused, that such letters as he quoted to-night are offenses against propriety, I do not wonder that the public conscience becomes indifferent to the charges which come from that side of the house, and that there is danger, as undoubtedly there is, of the public conscience becoming blunted in regard to even more serious matters. (Hear, hear.) Sir, I recognize as much as anybody can do the importance of the public conscience in relation to the conduct of public men. I recognize as much as anyone can do the importance of every public\nman feeling that upon his personal character must depend the confidence in which he will be held by the people outside; and I deplore as much as anyone can do that by the system which the hon. gentlemen opposite are pursuing and of which to-night we had a notable example, the public character, the characters of public men, are becoming of no account whatever, and that the only test of merit is the side of the house upon which an hon. gentleman may happen to sit. (Hear, hear.) There is no more dangerous condition of things than that, and when the hon. gentleman reads us, as he has read to-night, the letters of members of Parliament whose only offence is that they have done what I know hon. gentlemen on that side are doing with the most perfect propriety, writing to the Department of the Interior in relation to the interests of friends who may be affected by the department, when he reads a list of names and charges that the hon. gentlemen who wrote the letters are guilty of corruption and are to be condemned, he simply attempts to make an offence out of what every honest man, every man of common sense, knows is no offence, and he lessens to that extent the public sense of the enormity of serious charges, when serious charges may be made against gentlemen on either side. (Cheers.) Sir, it is no trifling matter, looked at in the character of our public life, that these kind of charges should be made, and that the mere incidents of our public position, the fact that we represent constituencies and that we have to write to the departments in relation to matters in which our constituents or our friends may be interested—that these are to be held to be offences to be punished by the censure of Parliament, and pronounced to be acts which are blunting the public conscience and rendering the public life of the country corrupt. Now, what are the charges which the hon. gentleman has made, and what has been the policy of this Government in relation to the several subjects to which he has referred? He referred in the first instance to\n\nTHE QUESTION OF TIMBER LIMITS.\n\nand he declared that the policy of this Government in relation to timber limits had been a policy of corruption, a policy of giving away the public domain for the benefit of the supporters of the Government, and that it had been a policy subversive of the duty of the Government to husband the resources of the country, and get from those resources the largest possible return that can be obtained for them from the people. Now, will you allow me for a moment to state what has been the policy of the two parties respectively in relation to timber limits. In the Session of 1872 the Conservative Government then in power introduced into Parliament and passed into law an act of which the following is section 50:\n\n\"The right of cutting timber on such timber limits shall be put up at a bonus per square mile, varying according to the situation and value of the limit and sold to the highest bidder by competition either by tender or at public auction.\"\n\n(Hear, hear.) That was the law passed in the year 1872, when the Conservative party began to deal with matters in the Northwest after we had acquired that territory. The Liberal party came into power in the fall of 1873, and in their very first session they repealed that section and substituted in the stead of it this:\n\n\"Provided further, that in cases where application may be made for limits on which to cut timber in unsurveyed territory, the Governor-in-council may, on the recommendation of the Minister of the Interior, authorize the same to be leased for such bonus as may be deemed fair and reasonable, such leases to be subject nevertheless to the foregoing conditions of this section, except so far as part of sub-section 1, which provides for the erection of mills, which provision in respect to limits in unsurveyed territories may, if considered expedient by the Minister of the Interior, be dispensed with.\"\n\n(Hear, hear.) So that at the very first session of Parliament after they came into power they repealed the act which they found on the statute book, which required the timber limits of the Northwest to be given by public competition, and assumed the right to give these timber limits by mere orders-in-council; and they went so far in unsurveyed territory—which at that time included practically the whole of the territory—that even the condition that a mill should be built might be dispensed with by the Governor-in-council. During the time those hon. gentlemen were in office some 605 square miles in all were granted, and not a single rood was let by public competition. Every single acre of that land was given by order-in-council, and given to gentlemen who certainly were not political op-\nponents of theirs, whatever their politics may have been. Now, sir, since this Government came into power what has been the result? The result has been that one-third of all the territory for which timber licenses have been granted was put up and disposed of at public auction, the policy being that whenever there were two applicants for the same territory it would be put up at public competition, and the highest bidder would get the grant. (Cheers.) Now, sir, let me point out another fact. The hon. gentleman says—and he is right—that the duty of the Government is to husband the resources of the country, and to obtain for the people the largest amount that can be obtained. Well, sir, during the five years his friends were in office, while they had given timber limits for 605 square miles, all the money they received for dues, ground rents, bonuses—no, there were no bonuses, because they put up nothing at public competition—was $8,160; while, during the last five years, this Government has received from timber limits in the Northwest for ground rents, bonuses, dues and royalties, no less a sum than $539,433. (Cheers.) And yet the hon. gentleman tells us that the policy of this party bears an unfavorable contrast, forsooth, to the policy of hon. gentlemen opposite; because, after the law had been altered, after they had taken advantage of it for five years, and after they had found themselves again in the cold shades of opposition, they moved a resolution that the policy of 1872 was after all the best policy—a resolution practically of censure on themselves for having repealed the act, and in favor of a policy which would have continued to be the policy if they had never occupied seats on the treasury benches. (Cheers.) The hon. gentleman has talked of this granting of timber limits as\n\nA MATTER OF PARTY ADVANTAGE,\n\nused by this Government for corrupt purposes, in order that their friends might be advantaged in return for their support. Why, sir, after they were beaten at the polls—I have referred to it before, but it is worth referring to again—when they had no longer a right to deal with the public domain, on the 7th of October, 1878, the very day before they resigned the seals of office, they passed an order-in-\n\ncouncil granting, without competition, without the suggestion of competition, but simply as a favor, to Messrs. Cook & Sutherland, gentlemen who certainly were not Tories, whatever else they were, no less than 200 square miles, not all in one block, but in areas of twenty square miles, wherever they might select them all over the northern part of the territories. And yet, sir, these hon. gentlemen rise in their places here and charge this Government, forsooth, with having used the public domain for political purposes, when their last act before leaving office, done, I suppose, on the principle on which governments in England are supposed to create peacages for their friends before they leave office, although they have been beaten—was the act I have described. (Cheers.) Yes, and they gave these gentlemen, as my hon. friend suggests to me, in the order-in-council, three years within which to make the selections of the twenty mile blocks, without any undertaking to cut timber, without, in fact, any obligation except to make all the money they could out of the timber limits they thus obtained.\n\nMr. Cook—Your statement is not true, sir.\n\nMr. White (Cardwell)—So much for the general question of the policy of the two parties. (Cheers.) Now, let me point out to you for a moment what has really been the operation connected with\n\nTHE SALE OF TIMBER LIMITS\n\nwith this Government. It is quite true that there were a large number of applications. The regulations fixed the terms upon which applications could be made, and under which grants could be given. The law fixed the lines which had been considered by hon. gentlemen opposite the proper lines on which people could obtain limits; and surely it was not an offence for anyone to make an application for a timber limit under regulations open to the world, known to everybody, and under which everybody had the opportunity of making an application. If the hon. gentleman could point out a case in which a Liberal applied for a timber limit, and a Conservative applied for the same timber limit, and the Liberal's application was set aside and the timber limit was given to the Conservative without competition, then he would have a case; but in that\nspeech of his—which exceeded somewhat his own limits of what should be a proper speech, for I believe he enjoined the hon. member for Ottawa county (Mr. Wright) to give him a gentle reminder when he went beyond an hour and six minutes—in that speech, he never ventured to make a suggestion, among all the charges he had to make, that the Government had in any one case given a Conservative a timber limit without competition for which a Liberal had applied or was applying; but, on the contrary, wherever there were two applications, the limit was given to the highest bidder, and where there was only one applicant it was given to him on condition of his fulfilling the conditions required, whether he was a Liberal or a Conservative. Let the hon. gentleman put his hand upon a single case of a Liberal having been, because of his policies, refused a timber limit by this Government. (Cheers.) Now, sir, what has been the practical result? There were no less than 2,029 applications for licenses; the time of boom brought numerous applications. But, sir, an application was not of any value; it gave no one anything except the privilege of making it, and the trouble to the department of filing it; there was no money in the application, that is quite certain. (Hear, hear.) I am speaking now of the applications up to the 1st of May of this year; and out of the 2,029 applications there were 568 orders-in-council authorizing licenses to issue. But, sir, the order-in-council did nothing; it did not authorize anyone, except under permit, to cut timber. In four cases in all, I believe, persons have been permitted to cut timber under orders-in-council. A license was required before anyone could cut timber; and, sir, we find that, before the licenses were issued, after the mere passage of the orders-in-council, the result has been no profit to the people who applied, but this remarkable fact, that for ground rents alone, which did not give anyone a right to cut one stick of timber, the country received $24,062.27. Did that look like favoritism to anyone. (Cheers.) Now, let us see what the country received for bonuses under this system under which we are told the Government gave away these timber limits in order to provide for their friends. In these cases, recollect, where no licenses were ever issued, the country received $31,226.25 from persons who were competing for the right to obtain licenses; and for royalties, in the four cases to which I have referred, in which timber was permitted to be cut, we received $3,587.92, so that for these cases where orders-in-council were passed but no licenses were issued, the country received $54,176.44; and only in relation to $8,500 of that was there a right, on the part of a single person paying the money, to cut a single stick of timber. (Cheers.) Yet that was the kind of favoritism and corruption bestowed on our friends—the corruption of letting them apply for licenses and giving them orders-in-council, compelling them to pay the ground rent; and if they did not go further, if they did not make a survey, if they did not put up a mill and get out a license, they got nothing else and the country got the money. (Cheers.) Now the total number of yearly licenses issued altogether was ninety-six, and the total number of twenty-one year leases, and of these more than one-half, I believe, were got after public competition, was eleven. So that of leases of every kind, the total number issued, of yearly licenses and twenty-one years leases, was 107. (Cheers.) The hon. gentleman had made the statement that orders-in-council were passed in favor of certain members of Parliament who applied for limits. Let me say that the question as to whether a gentleman who is a member of Parliament may apply to the department for that which is open to the world to apply for, which is embodied in public regulations, which everyone can take advantage of, is one, perhaps, open to discussion, but certainly not open to the denunciation in which the hon. gentleman indulged. Then, he tells us, there were seventeen altogether, members of the Senate and House of Commons, in whose behalf orders-in-council were passed. I presume that the $250, the first year's rental, was paid in every one of these cases, but I know, as a matter of fact, there were only three persons to whom leases were actually granted, and who, therefore, in virtue of those leases, were in a position to cut timber. (Cheers.) These were, Mr. M. K. Dickinson, who is a lumberman, and whose business is to cut timber. Are we to be told that a lumber merchant, because he\nis in this Parliament, is to be deprived of the privilege of applying to Parliament to get that which any man can get? If it be shown that advantages were given to him which were not given to others, there might be some question as to his treatment, but in Ontario nobody ever objects to members of the local Legislature getting timber limits from the province of Ontario.\n\nMr. Cook—Does that apply to other lumbermen besides Mr. Dickinson?\n\nMr. White (Cardwell)—Does what apply?\n\nMr. Cook—That he is a lumberman and has a right to get timber limits?\n\nMr. White (Cardwell)—I do not know what the hon. gentleman's point is. Mr. Dickinson was one, the other was Mr. Rykert, not acting for himself at all, but as a trustee for Mr. John Adams; and the third was Mr. Hugh Sutherland, who is certainly, as I said on a former occasion, not a friend of this Government, who is certainly a member of the party opposite, but who took the same advantage everybody could take by applying for a timber berth and operating it in the way required by the regulations. There was, undoubtedly,\n\nA LARGE NUMBER OF PERMITS\n\nissued, and a good deal has been made of their issue. No less than 6,837 permits were issued, but when I tell you that 4,581 of those were free permits issued to settlers under the regulations of settlement, to enable them to obtain cordwood, it will not be said, at any rate, that that was an act of corruption on the part of the Government. (Hear, hear.) I say 4,581 were issued to settlers free of charge. Then the number of permits issued to cut timber for railway construction purposes, by promoters and others, amounted to twenty-five. Then to cut cordwood upon berths along the line of the Canadian Pacific railway, east of Monmouth station, thirty miles east of Winnipeg, about thirty-three permits were issued, and every one was obtained after public competition. Then there were permits for the cutting of logs and manufacturing them into lumber, under a policy which enabled the person to get a permit instead of a license. There were forty-two of these permits, out of which the holders of only about thirteen cut a large quantity.\n\nOf the remainder of those 6,837 permits, 2,000 were given to settlers and others to cut cordwood, house logs, etc., when they required more than they could obtain under the ordinary free permits given to homesteaders. That is the whole history of these timber limits, these licenses and permits, and I will ask hon. gentlemen in this house to contrast the actual facts, as given to me by the officers of the department to date, to the 1st of May, with the arraignment of the hon. gentleman. (Cheers.)\n\nLETTERS FROM MEMBERS OF PARLIAMENT.\n\nHe has been good enough to refer to letters, and to one written by myself, which, I confess, had passed out of my mind until I heard it quoted either by the hon. gentleman himself or his coadjutor in this work, the member from Huron. It was a letter written on behalf of Mr. T. H. Schneider, who was formerly a resident of Montreal. Now to show how little politics there was in this application, I may say that Mr. Schneider is the gentleman in whose office was held the caucus at which the late Mr. Holton presided, when I was a candidate for Montreal West against Mr. Mackenzie, and at which the arrangement was made that I was to be beaten, by Mr. Mackenzie being made the temperance candidate. (Hear, hear.) Mr. Schneider was the gentleman who went round Argenteuil, carrying, although he was a temperance advocate, the jar which went round for the benefit of the late Mr. Cushing at the time he defeated Mr. Abbott, and who was afterwards disqualified for eight years for the conduct chiefly of Mr Schneider, who was a prominent Liberal. My connection with him arose through the friendship which springs up very often in such cases. He and I were brother vestrymen of the same church in Montreal—St. George's church—of which he was a prominent member, and when he removed to Winnipeg he wrote to me saying he was applying to the department in connection with some timber limits, and he wanted something done, and asked me to write to the department to urge action. That feeling of friendship, notwithstanding our political differences, induced me to send the letter referred to. I never knew what was done in that matter until somebody else intervened, and that was done which my letter failed to do. Among\nother names was that of Mr. R. S. White, who, I am told, got a timber limit in the Northwest, and who is said to be editor of the Montreal Gazette. I was astonished to hear this. I know Mr. R. S. White as well as most people, and the last thing I ever dreamed of his going into was timber limits or anything else outside of his ordinary business. He sticks to his desk and attends to his work, and does not bother his head very much about matters outside. I dropped him a line to the gallery to know if he had a timber limit—it was an astonishing revelation to me—and I had this letter in return:\n\n\"Mr. Magee asked me in 1882 to apply for timber limit for him. The application was granted, but not a cent was paid thereon, and the whole thing lapsed. I had no interest good, bad, or indifferent in it, and had no intention otherwise than that of promoting his object. I was informed by a notice from the department a year or thereabouts ago that application for some money was due on the file, and tore up the paper at once. I never had a word of intercourse with any member of the Government on the subject, and no interest direct or remote in the matter.\"\n\nNow, that is the result of that letter. Then we have other letters, but surely hon. gentlemen opposite are not going to say that the writing of a letter to a minister is an offence which is to be condemned, an offence which is to justify the passage of a resolution such as that which has been put in your hands. Who does not remember the very famous letter, which, I have no doubt, the gentleman who wrote it was very indignant to think got on to the file, as private letters sometimes do, the famous letter addressed to the late Premier by the leader of the Opposition, in which it was announced that \"my friend Moore\" wanted a contract for the Goderich harbor, and which recommended \"my friend Moore\" to the favorable consideration of the Minister. Now in that particular case, there was this difference. No one has pretended to say, the hon. gentleman has not pretended to say, that anyone of these letters which he has recited here produced any result, that is to say, that it secured for the applicant anything which, under the law, he was not entitled to as applying for it; but in that case we know what did occur, the giving of the contract to the person in whose interest the hon. leader of the Opposition wrote this timely and private letter, at a very much higher price than a good contractor had offered to do the work for.\n\nMr. McCallum—$30,000.\n\nMr. White (Cardwell)—Oh, no; surely not $30,000.\n\nAn hon. Member—$29,000.\n\nMr. White (Cardwell)—I think that was about it—$29,000 lost to the country as the result of a private letter written by the leader of this hon. gentleman, who is horrified that anything of this kind should happen, that members should write letters to a department in matters of this kind. So much for this matter. Then the hon. gentleman referred to\n\nTHE SUBJECT OF GRAZING LEASES,\n\nand he told us that we had given away an enormous area of land at 1 cent an acre, which, he said, was 6 per cent. on 16 cents an acre, for grazing purposes in the Northwest; and he hinted, although curiously enough he did not name the people in this case, that these must all have been given to friends of the Government. All I know is, that all the recent applications, or the great majority of the applications that I have seen are from Montana ranchmen, who are going to move their herds over to our side of the line, because they believe that our side is, on the whole, better suited for ranching than theirs. Some of them are from persons who are driven off the United States ranches in consequence of the recent action of President Cleveland in connection with Indian reserves, and they are coming over and bringing their herds to establish their range business on our side. But the hon. gentleman says we have given lands far in advance of the requirements of the country. The applications which we are receiving from ranchmen, from Americans who have nothing whatever to do with our politics, who do not care anything for our politics, are of a character which indicate that we are not going in advance of the wants of the country or of those who are disposed to establish the business in the Northwest. He tells us that we have today cattle only to the extent of one for every thirty-eight acres. That, perhaps, as a general statement, may appear to be an extraordinary fact, but, when you know that the rule is that there shall be one for every ten acres, that it requires ten acres of ranch country for the grazing of a single animal, I think you will agree with me that, in view of the fact that many of the\nleases have been granted within the last year or two years, and that these people have three years within which to complete the filling up of their ranches, tolerable progress has been made in connection with them. We have adopted the plan now, in consequence of the numerous applications which are being received, not from Canadians but from Americans, who are coming over to our side and bringing their herds, of charging two cents, and the greatest possible pressure is being brought to bear on the department by interests that are intimately connected with the Northwest, not in any sense political, but connected with the ranche business, representing that we are charging too much, and ought to revert to the 1 cent an acre. For myself, I do not think we ought, and I believe it is the intention of the Government to adhere to the policy we have adopted of charging two cents. (Hear, hear.) But the hon. gentleman says we have sold those lands—that is practically the statement—at 16 cents an acre, the 1 cent rental being 6 per cent on that. What do we give these people? We give them the right to graze their cattle upon a certain area of land, but we reserve to the settler the right of going into that country; and every even-numbered section in that whole ranche country is as open today for settlement as if there were no cattle grazing upon it. These people run the risk, therefore, if they get a good ranche, with a good deal of bottom lands upon it, of having settlers crowding in upon them; and, after they get their cattle there, they may find the settlers crowding in to such an extent that they are seriously inconvenienced in the work they have specially set for themselves. (Hear, hear.) So that we have not locked up the land from settlement, but on the contrary have reserved for the settler, that being the first consideration, the right to go in there and settle. We have received already on account of these ranche lands, an amount which would not have been received at all, of which we would not have seen a dollar, of $76,531.29. (Cheers.) But that is not all. What is the result in another sense?\n\nAs the result of this ranche business, as the result of encouraging people to come in here and bring their herds and raise cattle in the country, we are able to supply our Mounted police and our Indians at a far lower price than we could have done otherwise. In connection with the Northwest Mounted police we have the cost of beef supplied during the last three years, $95,540, and under the contract we are just letting in the Indian department to persons within the country and whose cattle are within the country, we would, at their prices, get the same supply for $54,917.52, or about $41,000 of a saving upon the three years' operations in connection with the beef supply of the Northwest Mounted police. (Cheers.) Then I find that, with regard to the Indian supply, taking the supply of last year at the price we paid for it, and taking the same quantity at the price for which we are now letting contracts as the result of this ranche business being carried on within the country, the saving to the country would be $80,500, or on these two items alone over $120,000, which may fairly be added, in the meantime to the amount we have received for the ranches themselves as showing what the advantage to the country has been. (Cheers.) Does the hon. gentleman pretend to say that we should not have adopted the ranche principle? Does he pretend to say that we should not have encouraged the herding of cattle in our Northwestern prairies, which are so well adapted for grazing purposes, so well adapted that they are attracting at this moment the attention of Americans who are bringing their cattle over from the other side? No, sir, I venture to say that if we had not done this, if we had allowed this land to lie fallow, and made no effort to utilize it to the public advantage, while not interfering with the settlement of the country, the first person to attack us would have been the hon. gentlemen opposite, who would have pointed out that we were recreant to our duty in not securing the revenue to the country from this land which a wise policy would have enabled us to realize. (Cheers.) In the United States they don't adopt this plan. There a ranchman and a number of his cowboys take up homesteads near together; they got four or five or six thousand acres in a block in that way. They make that their headquarters; it is their own land; they get it under the ordinary homestead and pre-emption system that prevails in the United States, and then their cattle graze over the whole\ncountry without their paying to the Government a sixpence of rental of any kind whatever. It seems to me we have adopted a wiser principle in dealing with ranches. (Cheers.) The hon. gentleman tells us that we are.\n\nGIVING COAL AREAS TO PEOPLE,\n\nbut he did not name the people who had got the coal areas. He made the extraordinary statement that the result of our policy was to make fuel dearer to the people of the Northwest. Why, the hon. gentleman has never been in the Northwest, I believe? The hon. gentleman who seconds his motion has been there, and has made considerable profit out of the Northwest. He was one of those land speculators, one of those men who, at the moment when a system was adopted by which land was given at $1 an acre with a payment of ten cents down, rushed in and took some 60,000 acres of land which he holds now, and which makes him a millionaire, and makes him better able to carry his election the next time on the same principle on which he has carried his elections in the past. But the hon. gentleman who moved this motion, I suppose, has never been in the Northwest, and he did not know, therefore, much about the question of fuel. I believe I am right in saying that the result of opening up those coal areas under the policy adopted by the Government has been to reduce the price of coal in Winnipeg from $17 to $7 a ton. (Cheers.) Therefore, if it be true that we have given these coal areas, even if it be to friends, we have at least the satisfaction of knowing that we have made fuel cheaper to the settlers of the Northwest, that we had, in fact, reduced the price considerably more than one-half, because, as you go further west and get nearer the coal areas, you will find that the price now is, I have no hesitation in saying, at least one-third what it was before. (Cheers.) Now, with regard to these coal areas, we have adopted precisely the same policy as that adopted by the United States; and I confess I was rather astonished when, in the one particular in which we have slavishly followed the American system, after the hon. gentleman has been parading the American system, has been calling upon us every session to take a leaf out of the book of our friends on the other side of the border, yet, when we have done it in this particular case, still the hon. gentleman is not pleased, still he thinks we should have adopted some other plan. He says we ought to offer these to public competition. Why, sir, how could we offer them to public competition? Coal underlies the whole Northwest, and you can hardly tell where it may not be found. The policy we adopted is, that where there is a coal area we fix the price, as they do in the United States under similar conditions, at $10 an acre, or, if it be anthracite coal, such as is found in the mountains, where the price was formerly $20 an acre, we have reduced it down to $12.50, upon the representation of the Inspector of Mines, that the cost of mining was so great that it was better to reduce it to $12.50 in order to ensure the development of the anthracite mines to be found in the mountains. Now, any one can go in and get a coal area if he knows where to select it. He comes to the department and pays his $10 an acre, and then he can go back and open the seam and supply the people with coal, and so ensure cheap fuel for the people of the Northwest. Then again, with regard to\n\nTHIS MATTER OF GRAZING LANDS,\n\nthe hon. gentleman has been dealing considerably with the question of members of Parliament being interested in this matter. If I may refer to a previous debate which took place last night—although I know it is not in order—a member of this house was attacked because he had ranches in Texas. But what is he to do? If he had taken a ranche in Canada and put his cattle upon it in exactly the same way, he would have been attacked just the same, because it would then have been said that he was a mere pensioner upon the Government and could not therefore give an independent vote. When he goes to Texas he is attacked because he has gone away from the country and established a ranche in a foreign country. Now, sir, as to\n\nTHE QUESTION OF COMPETITION;\n\nthe hon. gentleman has referred to an alleged fact—although it is not a fact—that some of these timber limits were sold by their holders at enormous prices to outside people. Now, there is not one of these outside people who could not have applied\nfor his timber limit and who could not have obtained it by ordinary competition, if there were two persons who wanted it. But, sir, we are to be told that the fact that people outside will sometimes purchase from a man who gets possession of a limit is an evidence that the man in the first instance has got it improperly? What shall we say, then, of a celebrated lumber company with which, if I mistake not, the gentleman from Simcoe has something to do? What are we to say of that company? It is quite true that the unfortunate people who put their money into it did not find that it was quite as valuable as they were led to believe when they invested. But, Mr. Speaker, they could have come to Canada if they had thought proper, under this magnificent Ontario system; they could have got their timber limits in the ordinary way; but they seemed to have preferred to purchase from the hon. gentleman opposite, on his representations, though God knows what there was in him to commend him to them. They seemed to prefer to take his recommendation, and they gave him an enormous sum of money for the limits he controlled. Now, that was a transaction where the money really passed.\n\nMr. Cook—I just wish to correct the hon. gentleman. The statement that he is making is false.\n\nMr. White (Cardwell)—Well, Mr. Speaker, I will not answer that. The hon. gentleman's business matters are not matters that concern me; but I do not think his statement that that is false will go down outside this house—or course here it must be accepted. (Cheers.) Then finally we had\n\nTHE COLONIZATION COMPANIES referred to. We were told those companies were an enormous source of corruption in connection with this Government; and the extraordinary thing is that we were told that those companies had actually obstructed settlement in the Northwest. The hon. gentleman ought to have known, and could have known, if he had made enquiries or had visited the country, that but for the colonization companies the settlers to be found on those tracts never would have been there. The result in connection with those companies has been this: in that case, as in the case of the timber limits, there were a large number of applications for colonization companies, a large number of applicants for the privilege—for that is all they obtained—of placing settlers in the Northwest, and obtaining payment for doing that by a grant of land at a lower price than the ordinary price. Let me say this—that hon. gentlemen opposite adopted this principle; they recognized the importance of securing outside influence in settling the country to such an extent that they actually passed an order-in-council by which they gave to people eighty acres of land for every settler they brought into the Northwest and put upon a homestead. That is the policy they adopted; that is to say, taking the land at $2 an acre, they gave $160 for every settler brought into the Northwest. There was, as I have said, a large number of applications for colonization companies, no less than 250 applications, of which only 117 were authorized by order-in-council. But, as in the case of the timber licenses and timber limits, the order-in-council did nothing. It required before anything was done that a contract should be signed by the company under which they undertook to perform the duties imposed on them; and the number of contracts entered into, that is the number of colonization companies which actually went into operation, was twenty-eight out of two hundred and sixty applications. (Hear, hear.) I do not think those gentlemen should be charged with anything wrong in having applied for the privilege of colonizing the Northwest. That certainly is not the ground of complaint made against them. The number of contracts, I say, is twenty-eight, and the number of members of the House of Commons whose names appear as incorporators or shareholders of those companies is, so far as the records of the department show, six; and curiously enough they are equally divided between the two sides of the house, three to each. And if my friends on this side will not consider that I reflect unduly on them, I venture to say that the great influence was on the other side of the house. I find that one of these members was Hon. Alexander Mackenzie; and yet the hon. gentleman, not satisfied with having turned the hon. member for East York out of the leadership, not satisfied with having brought him down to sorrow, and to what I fear is very nearly his grave, he insults him in this house to-night by intimating\nthat his joining a colonization company was an act of corruption of which no public man should be guilty. (Cheers.) Who is the next? A gentleman who is held in the highest respect by both sides of the house, an intimate friend of your own, Mr. Speaker, Mr. Gunn, of Kingston. The third was a gentleman who, I am bound to say, turns up in pretty nearly everything, Mr. Hugh Sutherland. On this side of the house, we had Mr. Small, Mr. Wallace (York), and another gentleman whose name I cannot distinctly make out, as it is written in a very small hand. These are the only members of the house in connection with the colonization companies. There were five senators. They were the late colleagues of the hon. gentleman opposite, and the present leader of the Liberal party in the Senate, Hon. R. W. Scott, the Hon. Mr. Resor, Hon. Thomas Ryan, Hon. A. W. Ogilvie and the late Mr. Gibbs. So altogether there were eleven members of Parliament, Senate and Commons, and of those six were Conservatives and five Reformers, including among the Reformers the leader of the late Government and the leader in the Senate of the late Government. That is perhaps the best answer that can be given to the charge that being connected with a colonization company unfit a man for a seat in Parliament and lays him open to the suspicion of being influenced by corrupt motives. (Cheers.) Those colonization companies, moreover, did not simply get their contracts and do nothing. The Government received from these companies $760,253 in hard cash evidence, I think, and pretty strong evidence, of the good spirit with which they went in to complete the work they had undertaken when they entered into the contract. One company alone, the Saskatchewan Homestead company, paid $166,000 to the Government. In addition to that we have the sworn statement of their auditors, after an examination of their books, that the company had expended in securing settlement; in aiding settlers, in putting them upon the land, in erecting mills in some cases, in building roads, in supplying the settlers with seed grain and in assisting them in every possible way, not less than $867,932, in addition to the amount paid to the Government. (Cheers.) Yet we are to be told that the policy which induced numbers of persons, men outside of Parliament altogether, for the number of members of Parliament was infinitesimally small, to undertake the colonization of the Northwest, is to be denounced by hon. gentlemen opposite as if it was a violation of the duty of the Government and reflected in some way upon the character of members of this house. (Hear, hear.) I do not think it is necessary I should say more in relation to\n\nTHE ARRANGEMENT OF THE GOVERNMENT by the hon. gentleman opposite. I have dealt with the several points to which he referred. I have shown you, sir, that as to the timber limits any man could come in and get them under the regulations; that the policy of competition is now the absolute policy, and that as to one-third of the cases where limits were given since 1878, they were let by public competition. As to the coal areas, I have shown that they are open to anyone to go in and take a coal area, by paying his $10, and that the result has been largely to reduce the price of fuel. (Cheers.) I have shown that as to the grazing lands, we have received an enormous amount in actual cash, and that we have the advantage of a lower price for the food supplies to the Indians and the Mounted police, (Cheers.) I have shown as to the colonization companies that we have secured through their instrumentality and the work they have done, important settlements in the Northwest country which would not have been there to-day without their exertions; that the country has received a large sum of money—over $750,000; that there has been received in connection with the settlement of the Northwest $385,000 outside of that; and that all that has been done under the operation of a policy open to everybody, which everybody can take advantage of, and that in relation to it not a single member on that side has ventured to say that a Liberal was refused what a Conservative was given; but that any man on either side can get what could be got under the ordinary public regulations of the department, adopted with a view to the development of the Northwest Territories. Under these circumstances, I believe the house will reject the resolution. (Loud cheers.)\nTHE HALF-BREED QUESTION.\n\nExhaustive Analysis of the Alleged Grievances\n\nOF THE ST. LAURENT SETTLERS.\n\nOnly Twenty in the District Entitled to Scrip-\n\nTHE TIMBER DUES AND HAY PERMITS.\n\nHiel's Council Proved to Have no Claims — Neglect of the Half-breeds to Make Entry for Lands.\n\nOn the afternoon of April 15, the Minister of the Interior presented the following report in the House of Commons:\n\nPRINCE ALBERT, N.W.T.,\nDecember 14, 1885.\n\nHon. Thomas White, Minister of the Interior,\nOttawa, Ont.\n\nSir,—In accordance with instructions received from you during your late visit to the Northwest, that I should, during my present visit to this district, collect all possible information regarding the alleged causes of the recent unfortunate outbreak in the Northwest, I have the honor to report as follows. The six alleged causes are the following:\n\n1. That owing to the system of surveys, these parties were unable to obtain the land they had settled on and improved prior to survey;\n2. That they were entitled to the same right as has been accorded to the half-breeds of Manitoba;\n3. That the lands on which they had for years resided had been sold over their heads to others, chiefly speculators;\n4. That the timber dues have proved very onerous to them, and were a grave cause of dissatisfaction; and\n5. That the dues for cutting hay on Government lands were also onerous, and a cause of great dissatisfaction.\n\nThe half-breed outbreak has been confined wholly to those living on the south branch of the Saskatchewan river, above range 26 west of the second meridian, and those in the vicinity of and immediately west of that river, in the neighborhood of Duck lake, as shown by the list enclosed, prepared with great care and from the best information possible. Louis Marion, a very intelligent half-breed, who has lived in the vicinity of Duck Lake since 1880; Louis Schmidt, a half-breed, who lived from 1881 to 1884 in township 45, range 1, west third; Baptiste Boyer, a half-breed, who, during the last ten years, has lived in the vicinity of Batoche, and George Buck, lately agent of Dominion lands, Prince Albert, are my authorities for other information than that which has been obtained from the affidavits of the parties themselves, it being necessary to obtain information from other sources than the said affidavits, as many of the claimants have not come forward, although repeatedly requested to do so, and give evidence in support of their land claims. The lists include, I think, every half-breed who is a settler or claimant to land in that district, and who, with their families, constituted probably upwards of 96 per cent.\nof the half-breeds who took an active part, as followers of Riel, in the late outbreak. The remainder were strangers who had no interest in the country or cause, but were attracted by the excitement and pillage incident to all such outbreaks; some few probably took part because their hearts were in it. During my first visit to Prince Albert, in August, 1883, I instructed Mr. Gauvreau, then assistant agent, a French-Canadian, to visit every French settler, half-breed or otherwise, in the district, ascertain what particular quarter section he was on, and urge him to make entry. This he did; but, although the Roman Catholic priest urged them in a like manner, for some reason or other they failed to do so. Some were deterred through ignorance, thinking that they would have to pay taxes; others have stated that they feared if they did so the Government might call upon them to bear arms, but against what foe does not appear to have been very clear to them. Like all ignorant people,\n\nA FEW DESIGNING, MISCHIEVOUS MEN who have their ear, can work on their ignorance and prejudices for the advancement of their own selfish ends. This is particularly noticeable in the case of those who settled subsequent to survey along the South Saskatchewan river. In spite of the fact that every Dominion Lands act which has ever been in force has contained a provision making it an illegal proceeding to settle on land subsequent to survey without first obtaining entry thereunto; the necessity of which is obvious, many of them have done so, while others have squatted on odd sections, Hudson's Bay company and school lands, knowing that they were set apart and not open for homestead entry. It is said that they were urged to settle in this manner by certain parties who for some reason or another thought it advisable to concentrate settlement along the banks of the river as much as possible. While on this point it might be as well to direct your attention to the fact that the contention has always been for ten chain lots, and that many have preferred, and all would prefer if the land were available, claims of twenty chains; whereas many of the leaders in the movement have preferred claims and entered by quarter sections, thus by their own acts protesting against the ten chain contention. Another, and the strongest point, is that except in the cases of the claimants to those portions of section 1, 2, 11 and 12, lying east of the Saskatchewan, in township 45, range 1, west 3rd, every other settler could practically obtain what he desired by taking legal sub-divisions or portions thereof, as has since been done. I explained this to the Rev. Pere Andre, in an interview which I had with him in the autumn of 1883, as I also did to the Rev. Pere Vegreville and Mr. Charles Nolin in an interview in January, 1884. In fact, whenever the question came up I urged these people to take their claims in this way if they insisted in settling in this manner, thus saving the expense of a resurvey and the delay incident to the same, stating also that the Government, having once surveyed the country, would not be justified in going to the expense of a resurvey merely to suit the ideas of those who settled subsequent to such survey, and further, that those who were there prior to the survey, would have strong grounds for insisting on entry being given as the law and system of survey required, viz., by quarter section. If the Government in these cases made a resurvey at the public expense, every other community and settlement throughout the whole country would have as good grounds for having surveys changed to suit their convenience, whims, or caprice. Other officials of the Government have also explained this to them. In all the interviews with these people they stated that they had been promised a river lot survey. They seem to have based this assertion on the promises made by the Minister of the Interior to the Rev. Pere Leduc and Mr. Maloney, of St. Albert, which was that when several had settled together prior to survey, and whose holdings could not be made to conform to the sectional system of such survey, in such cases\n\nTHE RIVER LOT SYSTEM OF SURVEY would be adopted. Attention should be particularly directed to the fact that in all the petitions and letters presented by Pere Leduc and Mr. Maloney to the Minister of the Interior, not the slightest mention is made of the settlers on the South Saskatchewan desiring river lots. They represented the settlers at St. Albert, Edmonton and Fort Saskatchewan.\nIn the petition presented by Pere Leduc and Mr. Maloney, the settlers ask treatment similar to that which has been granted the settlers in Manitoba, and also at Prince Albert in the Northwest. This treatment had been granted to the settlers on the South Saskatchewan in the river lot survey of the parish of St. Laurent. Some considerable delay in granting entry occurred owing to One Arrow's Indian reserve coming so close to the river that many of the lots could not have their two miles, which the settlers insisted on having. To this the consent of the Indians had first to be obtained and the necessary change in the survey effected and the plans prepared, so that it was not till November, 1884, that the office was in a position to grant entry.\n\nAlong the South Saskatchewan, outside the parish of St. Laurent, prior to the survey, there were only fifteen families settled, and they extended along sixty miles of the banks of the river (counting both banks.) The contention that the expense of a survey into river lots of that area should have been made to suit that number of settlers is absurd. Further, there is yet no evidence to show that such a survey was desired, in fact the actions of the majority would indicate the contrary. Every one of them could have obtained entry by a quarter or half of a half-section, covering all their improvements, without interfering with the claims of others. The lists show who those fifteen were. In March, 1884, I instructed Mr. George Duck (the plan of the parish of St. Laurent having just been received, the change in the survey of the Indian reserve, however, not being effected until the following November), to proceed to that parish to take evidence in support of those claims there, and all others above and below the same. He engaged the service of the Rev. Pere Andre to assist him in explaining to these people the object of his visit; he obtained applications from nearly all the claimants, from the upper part of the settlement down to the south limit of township 45, range 1, west third. In this township, owing to a bend in the river, there were several disputed claims, which at the time could only be arranged by making a traverse of the improvements, which is now being done. If, at the time of survey, these claimants in said portion of township 45 had furnished the surveyors with the information necessary to adjust their claims, they could have been settled as soon as this township was open for entry, viz., September, 1881; but since then, through transfers and settlement by others thereon, they have become very complicated. If, at any time since then, these parties in said portion of township 15, had united and furnished the department by means of survey, with the information necessary, the whole matter might have been arranged and entry granted long since. Below that point the settlers had taken up their claims in such a way that, with the information on the township map, the river keeping across the entire lands claimed in an almost due easterly course, it was not deemed necessary to visit them on the ground to adjust the claims; these parties, it was thought, would be able to state, on application at the office, what lands were claimed by them. Many, although notified to make their applications for entry, refused to do so, in some cases purposely leaving their houses when visited for that purpose, and acting in this manner although urged by their priests and others to do as requested. The information and evidence obtained by Mr. Duck having reached Winnipeg in June, shortly after I had started for Edmonton and Battleford to investigate and adjust the squatters' claims in those localities, your predecessor deemed it advisable they should not be acted upon by the land board in my absence. On my return to Winnipeg, late in the autumn, they were taken up, and the necessary recommendations made; and between the 27th February and the 6th March, 1885, all the claimants were notified to come forward and make entry; and those who were entitled to patent, having resided on their claims three years, were informed that, upon their applying for patent, the same would issue without delay. Only one entry has since been made, and that was by the Rev. Pere Moulin, on behalf of the corporation of the Revds. Peres Oblata. For convenience the lists have been divided into three classes, and I trust that the information contained in such lists of claimants before referred to, and the remarks thereon, will be found sufficiently full and ex-\nplight. These three classes are as follows:\n\n1. Those who settled on the west bank of the Saskatchewan and in the neighborhood of Duck Lake, who since September, 1881, have had an opportunity to make entry for their lands and apply for their patents as soon as the necessary three years residence had been completed, so that the question of surveys or patents does not affect any in this list. There are in this list seventy-five residents as claimants. Of these fourteen had settled prior to the survey having been made on the ground, two of whom have not yet made entry. Prior to the land being open for entry, and subsequent to the field work being done, the records of the Prince Albert office show that four other parties had squatted on the land, none of whom have yet made entry, although for four years they could have done so any day they applied.\n\nPersons\nIn 1881 entry was made by .............................................. 2\n1882 \" \" ............................................................... 27\n1832 \" \" .................................................................. 28\n1834 \" \" .................................................................. 9\n1856 \" \" .................................................................. 5\n\nThis makes a total of fifty-five claimants of this class who made entry, leaving twenty who have not yet made entry. Of those who effected entry twelve were natives of England, Switzerland, the provinces of Ontario or Quebec. Three claimants have land elsewhere, either entered as a homestead claimed by virtue of squatting, or having been squatted upon by others and purchased by them therefrom. Nine have made application for patent, and to eight of them patents have issued, one application not having been approved on account of insufficient improvements.\n\nANOTHER CLASS OF CLAIMANTS\n\n2. List of claimants to land along both banks of the Saskatchewan river south of township 45, range 1, section 11, W. 3rd. The line is drawn south of this township, because in it the river makes a bend of nearly 90 deg. to the east; above the bend the course of the river is very nearly due north, and below the bend nearly due east. As has been already explained, this enabled the claims to be laid out with a width of ten chains fronting on the river, and to be allotted by legal sub-divisions or fractional portions thereof without requiring a survey on the ground. This list includes the claims of 138 settlers, of whom forty-nine are on lots in the parish of St. Laurent, which parish contains seventy-one lots, and of which the survey was completed in 1879, but, owing to the dispute between the settlers and \"One Arrow\" Indians about the location of the Indian reserve, as has been already mentioned, it was not till November, 1884, that entries could be granted them. When the plan was sent to the agent in March, 1884, so much time had elapsed after the survey had been done on the ground that it was feared complication might arise, and, as the result proved, disputes over certain of the claims had arisen; therefore, I, at that date, verbally instructed Mr. Duck not to grant entry until he had gone through the entire parish, and obtained the evidence necessary to adjust such disputes. So much time had been occupied in obtaining the requisite evidence, as has been explained, that the parties were not notified till late in the following February, or early in March, none later than the 6th March, to come forward and make entry. Out of the 138 only one has done so up to this date. Of the 89 remaining claimants, 15 had settled prior to survey, 3 of whom had made entries according to sectional survey, and are as follows:\n\nJoseph Paranteau, entered 20th October, 1882; patent issued 10th November, 1884.\n\nIsidore Dumont, jr., entered 16th February, 1883; patent issued 17th May, 1884.\n\nIsidore Dumont, sr.; entered 19th November, 1883; patent issued 9th May, 1884.\n\nAbram Belanger, entered 2nd June, 1884; patent issued 8th November, 1884.\n\nPierre Garripie, entered 23rd February, 1883.\n\nRev. Pere Fourmonad, entered 28th October, 1883.\n\nAlex. P. Fisher, entered 22nd January, 1883.\n\nGabriel Dumont, entered 1st March, 1883.\n\nIsidore Dumont, sr., was the father of Gabriel Dumont (Riel's commander-in-chief), and of Isidore Dumont, jr. In what is known as the Tourond settlement,\nnear Fish Creek, twelve had made entries according to the sectional survey, as follows:\n\n- Calixte Tourond, entered 3rd March, 1884.\n- Patrice Tourond, entered 10th March, 1883.\n- Maurice Henry, entered 12th June, 1884.\n- Napoleon Vienne, entered 15th March, 1884.\n- Roger Goulet, entered 15th March, 1884.\n- William Fidler, entered 26th March, 1884.\n- Pierre Bellegarde, entered 26th March, 1884.\n- Toussaint Laplante, entered 2nd June, 1884.\n- David Tourond entered 10th March, 1884.\n- Joseph Tourond, entered, 3rd March, 1884.\n- Elzear Tourond, entered 3rd March, 1884.\n\nThese are not exactly on the river, but in the vicinity. In this list 34 had resided on their lands three years. The remaining 58 settled subsequent to survey without obtaining entry, and insisted on having the survey changed to suit their ideas. Out of the 138 claimants 36 failed to furnish any evidence as to the nature of their claims; eight had made entry, which with the addition of the 12 in the Tourond settlement, made 20 in all, any of whom when entitled to patent could have obtained it on application; leaving 74 claimants who had filed evidence of occupation in the spring of 1884, and eight who had made application, but who had made no settlement on the land. In this list those who had filed evidence settled in the following years:\n\n| Year | Within the parish survey | Outside |\n|------|--------------------------|---------|\n| 1872 | 2                        | 0       |\n| 1873 | 2                        | 0       |\n| 1874 | 2                        | 0       |\n| 1875 | 0                        | 1       |\n| 1876 | 0                        | 1       |\n| 1877 | 3                        | 1       |\n| 1878 | 1                        | 2       |\n| 1879 | 2                        | 2       |\n| 1880 | 4                        | 6       |\n| 1881 | 7                        | 18      |\n| 1882 | 8                        | 7       |\n| 1883 | 3                        | 0       |\n| 1884 | 3                        | 0       |\n\nIt will thus be seen that in the whole list 34 had resided three years on the land. If there were any more it is wholly their own fault that the department was not seized of sufficient information to know whether they were entitled to patents or not. Twenty of these were within the river lot survey, and the delay in according entry thereto has already been explained; the remaining 14 could long ere this have had entry if they wished.\n\nCLAIMANTS ALONG THE SOUTH BANK.\n\n3. List of claimants to land along the south bank, and in the vicinity of the South Saskatchewan river, below the south limit of township 45, range 1, west 3rd, which list includes 45 claimants in all. Of these patent has issued to one Michael Canny. Nine of these have had opportunity to make entry since September, 1881, but only one has done so—the said Michael Canny. Canny appeared before me in January or February, 1884, and made his application for patent by quarter sections; his neighbors, Lepine, Nolin, Dumais and others, protested, on the ground that Canny had agreed with them that he would not make entry. They stated that they had all agreed not to make entry, thinking that, by such a course, the Government ultimately would resurvey the land along the river into river lots. Four of them have preferred claims, two through purchase, the other two through their own actions; but these come within the disputed portion in township 45, range 1, west 3rd, already alluded to. Entry could not be given on account of these parties not having furnished the information required to adjust their dispute. Of the remaining 32, 4 made entry in 1883, shortly after the land was open for entry; 2 made entry in 1885. The remainder have not yet applied for entry, but have furnished this month the evidence necessary to enable the department to know what lands are claimed by them. It might be well to mention that the part of township 45, range 28, west 2nd, lying south of the Saskatchewan river, though not surveyed till 1882, had its west limit run in 1877, and the part north of the river was surveyed in 1878, so that anyone settling in the portion south of the river since 1878, which was open for entry only in 1883, could have readily ascertained upon what lands he was situated. Thir-\nteen of the 45 claimants were on the land prior to survey, or at least before the land was open for entry, and could have obtained entry at any time on application; 3 settled on the land in 1872.\n\n- 1 settled on land in 1879\n- 3 settled on land in 1880\n- 6 settled on land in 1882\n- 12 settled on land in 1883\n- 3 settled on land in 1884\n- 4 settled on land in 1886\n\nThirteen have not yet begun residence, but are merely claimants; 6 have made homestead entry, so that in March, 1885, there were only seven who by length of residence were entitled to patents and who could have obtained them if they had conformed to survey and their right not disputed by others; 4, however, were thus disputed, as has already been mentioned. Out of the 258 claimants included in the three lists, 40 had resided on their claims three years, 20 could not obtain entry on account of the disputed boundary between the parish of St. Laurent and \"One Arrow\" Indian reserve, as heretofore explained, 4 were the disputed claims in township 45, range 1, west 3rd, also explained, and the remaining 16 could have effected entry and made application if they had so desired. The 20 claimants in the parish of St. Laurent were notified not later than the 6th March, 1885 that they could make entry and obtain patents. But going back to say, 6th March, 1884, and assuming that the delay in granting entries in St. Laurent parish was wholly the fault of the Government, we find that at that date only ten, or less than 4 per cent., of the 258 claimants were entitled to patents. Out of the 258 claimants 175 are Manitoba half-breeds, 24 are enumerated as Northwest half-breeds, 20 are enumerated as doubtful whether Manitoba, Northwest, American or treaty-taking half-breeds, 39 are American treaty-taking half-breeds and others who are not half-breeds.\n\nOf the 24 enumerated as Northwest half-breeds, 8 failed to appear before the half-breed commission, and as neither descendents of them nor heirs thereto appeared, it may be safely argued that they were not entitled to any rights as Northwest half-breeds. Of the 20 enumerated as doubtful, 16 or any descendants or heirs of them, failed to appear before the half-breed commission, leaving 4 who possibly are Northwest half-breeds. Deducting the 8 who failed to appear and adding the 4 doubtful ones who possibly are genuine, gives 20 Northwest half-breeds, being less than 8 per cent. of the whole. Taking all who are enumerated as Northwest half-breeds, and assuming those considered as doubtful, if correctly placed, would leave about the same proportion, so that less than 10 per cent. are Northwest half-breeds. Taking all who are enumerated as Northwest half-breeds, and doubtful, would make 44, which is but 17 per cent. of the whole. The total number of applicants of male adults before the Half-breed commission at Duck Lake and Batoche were 15, women and children 52.\n\nNow we come to Riel's councillors and leaders in the agitation, other than Riel himself.\n\nGabriel Dumont, councillor-in-chief, a Northwest half-breed had made entry for his land on the 1st March, 1883, and if entitled to patent, could have obtained it.\n\nJoseph Delorme, second in command, a Manitoba half-breed, first made improvements on his claim in 1882 and began residence the same year; the total value of the improvements on his claim is $140. As he settled subsequent to survey, he could have obtained entry had he conformed to the survey as made.\n\nPhilip Garnot, a native of the province of Quebec, first began residence on a claim purchased from Charles Nolin in 1883; the improvements were valued by him at $900, and as he settled subsequent to survey he could have obtained entry had he conformed to survey.\n\nBaptiste Boucher, a Manitoba half-breed, first came to the Saskatchewan in 1882, and has never applied for entry.\n\nMoses Ouellette, a Manitoba half-breed, refused to appear to give evidence, so I cannot state as to his land claims, except that at the time of the outbreak he was a resident on a river lot in the parish of St. Laurent.\n\nBaptiste Paranteau, a Manitoba half-breed, has been living on his claim, a river lot in the parish of St. Laurent, since 1872.\n\nPierre Paranteau, sr., a Manitoba half-breed, first settled on a river lot in the parish of St. Laurent in 1882.\n\nEmmanuel Champagne, a Northwest\nhalf-breed, first settled on the land claimed by him in 1877, a river lot in the parish of St. Laurent.\n\nNorbert Delorme, a Manitoba half-breed, first settled on a river lot in the parish of St. Laurent in 1880.\n\nEnos Poitras, sr., a Manitoba half-breed, first settled on his claim in 1875, and could have made entry and obtained patent since early in 1884 if he had so desired.\n\nJoseph Vandal, a Manitoba half-breed, first settled on the land claimed by him in 1882, and could have made entry had he conformed to survey as made prior to his settlement.\n\nPierre Henry, a Manitoba half-breed, first settled on his claim in 1882, came to the Saskatchewan in the same year, could have made entry had he conformed to the survey as made.\n\nFrançois Fiddler, a Manitoba half-breed, settled not prior to 1882, abstained from giving evidence, could have obtained entry had he conformed to survey made at the time of his settlement.\n\nDavid Tourond, a Manitoba half-breed, had a homestead entry in township 41, range 2, west 3rd, made entry on the 10th March 1884; first came to the Saskatchewan in 1882.\n\nCalixte Tourond, a Manitoba half-breed, had a homestead entry in township 41, range 3, west 3rd, made entry March 3, 1884; first came to the Saskatchewan in 1882.\n\nMaxime Lepine, a Manitoba half-breed, settled on land subsequent to survey, but it being a school section and he knowing it was such, could not obtain entry, desired that it be given as a river lot, though from sales he has made to others he originally must have claimed at least forty chains frontage on the river.\n\nAlexander Fisher, a Manitoba half-breed, made a homestead entry, and had been told, prior to outbreak, that he could have his patent any time he applied for it.\n\nPhilip Garripie, a Manitoba half-breed, had claims on the river, one of which he sold to Hayter Reed in 1878. This claim according to the description would also cover parts of the claims of several other settlers, and contained 400 acres, another claim was also sold by him to T.J. Agnew for $2,000 in 1882, which is described as the south half-section 12, township 46, range 1, west 3rd; he then went and squatted on land in about township 4, range 27, west 2nd, but neither himself nor family have ever preferred any evidence in support of same though knowing it was surveyed.\n\nCharles Nolin, a Manitoba half-breed, at one time Minister of Agriculture for Manitoba. He left Manitoba in 1878 or 1879, and settled at Touchwood hills; after residing there for some time he sold the claim upon which he had been living, and in 1882 moved on to a claim in township 42, range 1, west 3rd, then surveyed. He lived a year on this land, and then sold his claim to Philip Garnot, the secretary of Riel's council, and in 1883 squatted on section 11, township 45, range 28, west 2nd, a school section, and then surveyed.\n\nMichel Dumas, a Manitoba half-breed, first came to this country in 1880, settled on section 11, township 45, range 28, west 2nd, and sold his claim to Thomas McKay in 1882; never applied for entry.\n\nNapoleon Nault, a Manitoba half-breed, a cousin of Riel, and who, with Lepine, is said to have, on the suggestion of Riel himself during his visit to Manitoba in 1883, started the agitation and so shaped matters that a delegation was appointed to proceed to Montana and invite him to come and head the movement on the Saskatchewan, first came to the district in 1878, had two claims—one lot 26, St. Laurent parish, and the other on the west side of the river, nearly opposite. He might have made entry for the land on the west side of the river, which has been open for entry since September, 1881; he lived on this claim for some time, and in 1882 removed to lot 26, St. Laurent, upon which he continued to reside up to the time of the outbreak.\n\nOf the twenty-one enumerated, which includes all those prominent in the movement and instigators of the outbreak, one was a native of the province of Quebec; one was a Northwest half-breed, and nineteen were Manitoba half-breeds who had received their lands and scrip under the Manitoba act in Manitoba, as either heads of families, or as minors; four had obtained entry and could have obtained patents if entitled thereto; 11 settled subsequent to survey and could have obtained entry at the date of settlement had\nthey conformed to the survey as then made; five were settled on river lots in St. Laurent parish, and early in March, 1885, they were notified to come forward and make entry and obtain patents if entitled thereto. They were assured in May, 1884, by Mr. George Duck and by myself in January and February preceding, that entry would be granted them shortly. One (Philip Garripie) had already disposed of two land claims, one for the consideration of $2,000, and had afterwards squatted on surveyed lands without applying for entry. It has been stated that the location of the land office at Prince Albert was inconvenient to these people. It has also been stated that objection to making entry was, to some considerable extent, caused by certain parties who thought that ultimately the Government would by such a course be compelled to establish a land agency at Batoche and one of themselves constituted agent.\n\nAll the half-breeds in Prince Albert district freight more or less. The headquarters for freighting is at Prince Albert, where they deliver the freight and are paid, and there is scarcely a half-breed adult in the district who does not at least once, and many of them several times, in every year, visit Prince Albert.\n\nThese people are frequently buying and selling their claims prior to survey or entry, or previous to obtaining a recommendation for patent, and no amount of explanation seems to make them understand that such transfers are illegal:\n\n**FUEL QUESTION.**\n\nThe total amount collected as timber dues, from all the settlers embraced in these three lists since the establishment of a Crown timber office, amounts to $30.25, which divided by 258, the number of claimants amounts to 31 cents each for two years; or at the rate of 15½ cents each year for each settler. Of that amount $55.25 was paid by four settlers for timber dues, for erection of stores and shacks, leaving $25 which has been paid by the remaining 254 settlers as office fees on homestead permits, known as free permits—10 cents for each settler for two years, or at the rate of 5 cents per settler per annum.\n\n**HAY PERMITS.**\n\nAs you are aware, the object of hay permits was to protect the small settler against the large stockman or speculator, and it has always been optional with settlers whether they took out permits or not. If they chose, they could continue the practice of the past by cutting hay anywhere. This has been explained to these people. They have never been asked to take out any permits or pay any dues, the hay being plenty and no large stockmen or speculators to interfere with them. The hay for the town of Prince Albert, or any large stockmen in that district, has been obtained elsewhere than in the neighborhood of these settlers.\n\n1. This report shows that of all the 258 settlers at the time of the outbreak, not one was unable to obtain patent for his land through the action—or rather non-action—of the Government, and even in March, 1884, there were only ten cases of delay, which delay was caused by the conflicting surveys of One Arrow's reserve and the St. Laurent parish.\n\n2. That not one man of the 258, or any one else who ever resided in the district, ever lost one inch of land through the system of survey, when such survey was made subsequent to his settlement thereon.\n\n3. That 92 per cent. of the 258 had no rights as Northwest half-breeds. Of that 92 per cent., those who were half-breeds had participated in all the rights accorded those people in the province of Manitoba.\n\n4. That not one settler in the district had an acre of land sold over his head to which he had any claim, or had even preferred one.\n\n5. That the timber dues were not onerous, amounting only to 5 cents per settler per annum.\n\n6. That the hay permit question never affected them in the remotest degree.\n\nAll of which is respectfully submitted\n\nhave the honor to be, sir,\n\nYour obedient servant,\n\nWm. Prasse,\n\nSuperintendent.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001651.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 19, "total-input-tokens": 28228, "total-output-tokens": 18841, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2694, 1], [2694, 7183, 2], [7183, 11948, 3], [11948, 16414, 4], [16414, 21015, 5], [21015, 25415, 6], [25415, 30113, 7], [30113, 34741, 8], [34741, 39168, 9], [39168, 43726, 10], [43726, 48168, 11], [48168, 50813, 12], [50813, 55348, 13], [55348, 59884, 14], [59884, 64223, 15], [64223, 68508, 16], [68508, 72840, 17], [72840, 77153, 18], [77153, 81089, 19]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]