[{"id": "50937622e4f29b79715b8610e2524064bb4bd6ef", "text": "DOMINION ELECTION.\n\nCAMPAIGN OF 1886.\n\nHon. Edward Blake's Speeches.\n\nNo. 1 (First Series).\n\n(LONDON BANQUET, Jan. 14th/86)—General Review—Riel.\n\n(Owen Sound) — N. W. Maladministration—Riel.\n\nNOTE.—See Inside Cover for List of Mr. Blake's Speeches in first Series.* Apply to W. T. R. Preston, Reform Club, Toronto, for Copies of these Speeches.\n\nToronto:\n\nHUNTER, ROSE & CO., PRINTERS.\n\n1886.\nLIST OF SPEECHES IN THIS SERIES.\n\nNo. 1.—(London): General Review of Situation—Riel Question.\n(Owen Sound): North-West Maladministration—Riel.\n\nNo. 2.—(Beaverton): Independence of Parliament—The Boodle Brigade.\n\nNo. 3.—(Chesley): Public Finances—Taxation and Deficits—Farmers.\n\nNo. 4.—(Simcoe): Federal and Provincial Rights—Ontario—Nova Scotia.\n(Guelph)—Elections near—Tory Dodges—Nova Scotia.\n\nNo. 5.—(Owen Sound): Principles of Liberalism—Duty of the Leader.\n(Welland): Policy of the Party—Functions of an Opposition.\n(Oakwood): Sir J. Macdonald on Functions of an Opposition.\n\nNo. 6.—Extracts—(Guelph): Home Rule for Ireland.\n(Berlin): Firebrand Tory attempts to excite Germans.\n(Galt & Orangeville): Indian Starvation Policy.\n(Pembroke): Maladministration felt at Cut Knife Hill.\n\nNo. 7.—Extracts—(Kendall): Business Methods required in Public Affairs—Degradation of Parliament—A few Boodlers.\n(Hampton): Civil Service Reform.\n(Galt): Burden of Public Debt.\n(Orangeville): Burden of Public Debt.\n(Belleville): Burden of Public Debt—The Interest on Debt.\n(Oakwood): Burden of Public Debt—Our Public Expenditure.\n\nNo. 8.—(Newcastle): Canadian Pacific Railroad Matters.\n(Listowel): Canadian Pacific Railroad Matters—The last Sacrifice of $10,000,000—Collapse of Tory \"Boom\" Policy.\n(St. Thomas): North-West Lands.\n(Huntsville): R.R. Policy—Sir John's Subsidies to \"Guinea-Pig\" Directors—Assisted Immigration and Railway Frauds.\n(Parry Sound): Railway Policy of Liberals.\n(Orangeville): Railway Policy of Liberals.\n(Brantford): The Kansas Slander.\n(Listowel): The Sea of Mountains.\n\nNo. 9.—(Wingham): Blake's Tribute to Mackenzie.\n(Stayner): Blake's Tribute to Sir Richard Cartwright.\n(Brantford): Blake's Tribute to Paterson—Duty of Young Men.\n\nNo. 10.—(Welland): Liberal Party, Creeds and Classes.\n(Orillia): Leaders and Newspapers—The \"Mail\" Crusade.\n\nNo. 11.—(Aylmer): Prohibition and Politics.\n\nNo. 12.—(Toronto): Interests of Labour—The Tariff.\n(Welland): To Knights of Labour.\n(Belleville): Legislation for Labour.\n(Desaronto): Workingmen and Politics.\n(Hamilton): Workingmen and Parties.\n\nNo. 13.—(Hamilton): Provincial Issues—The Religious Cry—Liberals and Catholics.\n\nNo. 14.—(Lindsay): North-West Affairs—Neglect, Delay and Mismanagement—Race and Creed Cries.\nTHE LONDON BANQUET SPEECH.\n\nGENERAL REVIEW OF THE SITUATION.\n\nNORTH-WEST MALADMINISTRATION.\n\nRIEL'S EXECUTION.\n\n\"I DO NOT PROPOSE TO CONSTRUCT A POLITICAL PLATFORM OUT OF THE REGINA SCAFFOLD, OR TO CREATE OR CEMENT PARTY TIES WITH THE BLOOD OF THE CONDEMNED.\"\n\nMr. Blake was in Europe at the time of Riel's execution, and for some time afterward. Upon his return a banquet was given in his honour at London, on 14th January, 1886.\n\nMr. Blake rose amid tremendous cheering and spoke as follows:\n\nI thank you, from my inmost heart I thank you, for the warmth and cordiality of your reception. I know it to be far beyond any poor deserts of mine; but it is another and most marked expression of that continuous, abiding and unbounded kindness and confidence which have been shown me by the Liberal party for these many years, and especially during those dark and trying times which have passed since I took the lead. Will you allow me to use this, my first available opportunity, to congratulate the Liberals of Ontario on the activity they are now displaying; AND PARTICULARLY TO EXPRESS MY JOY AT THE ENERGETIC CONDUCT AND SUCCESSFUL ORGANIZATION OF THE YOUNG LIBERALS—(hear, hear)—and to return my grateful thanks for the honour done me by my election to the honorary presidency of their great convention, a gathering from which I expect the best results. I declare, Sir, that it would be as impossible for my friends and supporters in and out of Parliament to surpass, as it is for me to repay their goodness. It has cheered and sustained me through many gloomy and some stormy hours, and I can never forget it while I live. You know, gentlemen, I have never concealed it from you, that it was with reluctance I accepted the lead. High and honourable as that post is, I never coveted it; it suits me in no one of its relations to my life; I am deeply conscious how inadequately I fill it; and I grow each year more anxious to return to the ranks. I am told by some Ministerial\norgans, which, of course, have very confidential relations with the Opposition—(laughter)—that my wishes are seconded by a considerable number of my friends. (No, no.) I am glad to know it, and I wish that our community of sentiment in this matter might lead that contingent to so far confide in me as to concert measures to accomplish our common end. If they would accept me as their leader for this purpose only, perhaps we might, so united, make more progress towards the desired end than we have done hitherto. (Laughter.) I am not in the habit of offering myself for office, but I make an exception in their favour, and shall expect their reply! (Laughter.) Meantime, as this is a question, not of measures, but of men, they and I, as good party men, must try and subordinate our views for the moment to those of the majority, in the hope that by continuous pressure we may convert them in good time to our opinions. (Laughter.)\n\nTo be serious, gentlemen, I trust that at no distant day you will relieve me, and meantime I will do my best, so far as health and abilities allow, to serve you in the place you impose upon me. (Loud and prolonged applause.)\n\nDuring the last few years many great struggles have taken place, and the opposing parties have developed their views on various important public questions. Let me run rapidly over the roll and recall to you some of these issues, so that you may judge of the claims of each side to public confidence and support. Try the Government, as I often told you, by their promises and their performances. There can be no fairer test.\n\nLet us look at the\n\nFISCAL AND FINANCIAL POLICY.\n\nThey declared Mr. Mackenzie's expenditures too high, and promised to reduce it. They have increased it about fifty per cent. They declared his taxation burdensome, and promised not to raise it. They have raised it about fifty per cent. They condemned his taxation as unequal, and promised to readjust it. They have redressed the inequality by imposing great sectional taxes, enormous burdens on prime necessaries of life, and rates of duty on important staples used by the poor about twice as high as those laid on the rich. They declared his deficits scandalous and disastrous, but notwithstanding the vast increase in taxes they have produced magnificent deficits of their own. (Hear, hear.) And think for a moment what those deficits would be, had you still the misfortune to be taxed as lightly as in Mr. Mackenzie's time. Think of it, and measure the failure of these men in finance! They blamed Mr. Mackenzie for proposing a modest surplus of $500,000, and declared that he had no right to levy that large\nsum in excess of the actual demands of Government, and should reduce the taxes at once. They, by their great added duties, collected surpluses of near $20,000,000, of which they boasted as evidences of statesmanship; and they refused to reduce the taxes, though we warned them of the result. The result is before you—A RECKLESS INCREASE OF THE PUBLIC CHARGE, UNTIL IT HAS REACHED AND PASSED THE CAPACITIES OF THE ENLARGED REVENUE, AND YOU ARE FACE TO FACE WITH ENHANCED OBLIGATIONS, VAST TAXATION AND AN EMPTY EXCHEQUER. They complained of Mr. Mackenzie's increase to the public debt, created in fulfilment of their own settled policy. They have enlarged that debt beyond the wildest conjectures of 1878, or even 1882, and have thus, apart from the heavy charge of redemption, absorbed all the benefit derivable from the lowered rate of interest over the world. They have drawn from the people in duties and deposits, and permanently sunk, enormous sums which would otherwise have gone into circulation; and they have thus increased the stringency and clogged the wheels of trade. They promised by a system of restriction and taxation to legislate into great and permanent prosperity the manufacturing and agricultural industries. We predicted that their system would result, as to manufactures, in the abstraction for a varying period of inordinate profits from the people, and then in an unwholesome stimulus and an unwise application of capital; that with our small population a glut would soon ensue; and that there would follow demoralization of trade, and distress alike to manufacturer and operative. Look at the main glories of their policy, the cotton industries, the woollen industries, the sugar industries, for examples, and read in their records the fulfilment of our prediction! They have regulated the flour-milling industry to death.\n\nAS TO THE AGRICULTURAL INTEREST,\nin whose leading branches we were producing a surplus, remember their dishonest attempts to gull the farmers; their declarations that they could improve prices by duties; their promises to bring a town population to every farmer's door. Remember during a brief period of high prices, their claim that it was all their doing. Remember also our declaration that their policy would hurt and could not help the farmer. Look at later prices for wool and barley, wheat and beef, and other products, and draw your own conclusions. As to the operative and the labourer, remember their promises to them, and our argument that the free competition in labour between Canada and foreign States would tend to regulate wages, and that for labour there was no protection. It has since been admitted by them that the condition of labour in the States is a main factor.\nNeed I say anything of\n\nTHE BALANCE OF TRADE,\n\nof the Minister's sage declarations that he was going to reduce imports, of his joy when one year they balanced exports; of his announcement that they were going to improve even on this; of the condition of the balances shortly after, and of the anxiety now entertained that we may import largely so as to pay more taxes? (Applause.)\n\nAfter a period of distress which culminated in 1879, there came, as was natural and inevitable, in spite of misgovernment,\n\nA GLEAM OF PROSPERITY TO CANADA.\n\nThey claimed it all for themselves. They had done it with their little acts—(laughter)—and what they had done they would continue to do. They promised us ten years of prosperity. They advised us to clap on all sail. All over Canada they promoted the boom and encouraged the expansion. They declared that it was but the foretaste of good things to come; we had had but the first inkling of the joys prepared for us. (Laughter.)\n\nHaving dissolved in 1882, at the top of the wave, a year before the time, \"Return us,\" they said, \"and we will make the good times better still. What we have done; we will do tenfold.\" Do you remember the hundreds of new manufacturers and the millions of new capital that the verdict of 1882 was to introduce into Canada? Many believed them. They got their majority. Many acted on their advice, and launched into adventures, clapping on all sail for the ten years' prosperous voyage. We warned you that it was a delusion fostered by the crime or the folly of the Ministers. Some sensible men in the walks of commerce and finance soon after raised their warning voices too. Much mischief was done, but much was thus averted. A crisis was avoided. But a period of severe distress and depression is what you have undergone, instead of the promised ten years' voyage under unclouded skies, with sails swelling before a favouring breeze. In truth, instead of helping they had hurt you. They retarded the arrival, they diminished the extent, they shortened the duration of your prosperity, and they intensified the following depression. (Loud applause.)\n\nLook, I pray you, everywhere and at everything,\n\nCONTRAST PREDICTIONS AND PROMISES\n\nwith events and results, and say whether our rulers are to be trusted more! Alas, their removal will not undo all the evil they have wrought. Their works will live after them. (Laughter.)\nThey have brought the country into such a state that we must abandon for years to come the hope of dispensing with very burdensome taxation, though I believe our condition may be greatly bettered by wise readjustments and judicious relaxation, and by honesty, economy and retrenchment in government. They promised to create a mutually beneficial interprovincial trade. They have, indeed, forced some of our Western products and trade upon the East, but they have failed to give the East a Western market, and they have produced in the Maritime Provinces a condition of irritation and ill-feeling so marked, a sense of injustice at the violation of pre-confederation promises so great, that it is my belief that the sentiment as to Confederation is less favourable, the link of union is less strong today than it was ten years ago. I regret that many in the East blame Confederation rather than misgovernment for the unhappy results.\n\nThey promised that their tariff policy would\n\nSECURE A RECIPROCITY TREATY\n\nin two years. Reciprocity was their goal; and it was to be reached by great Canada putting pressure on our little neighbours to the south. (Laughter.) They have not secured reciprocity. They have hardly tried. They have told us for seven years that it was useless to try; and unpatriotic to talk of it; and so far as they dared their press has discouraged the idea. This is for us, as well as for those of the United States near us on the south, though of course not for those more remote, the greatest material question. There is none so important on either side of the line to the neighbouring populations. But it seems to me that for many long years they have minimized the chances of a treaty. In 1872 they declined the United States offer of trade privileges in connection with the fishery relations; they accepted the principle of a money compensation for the fisheries; they left the headland question in abeyance; they abandoned the Fenian raid claims; they gave away the free navigation of the St. Lawrence; and having thus seriously damaged and complicated our interests, they refused, towards the expiration of the treaty, though pressed as well by us as by the Imperial Government, to act with regard to the new conditions shortly to arise. They took no step in time; but after Congress had adjourned, and when, as everyone but themselves knew; it was impossible to procure a mutual extension, they proposed it in language most useful to the American Secretary. They gave him an easy task. He blandly adopted their views as to the inexpediency of shutting out the American fisherman, but, to their great surprise, he told these superior diplomatists that, under the Constitution of the Republic, Congress alone could extend the freedom of the trade, and thus he used our position as a\nmeans of obtaining a one-sided extension by which we gave up all and got nothing.\n\nOUR WISE MEN,\n\ninformed at last of the Constitution of the United States, and embarrassed by their own argument, yielded, with results to the Canadian fisherman we can easily understand. Our Government does not seem to have thought about—at any rate, they made no effort to prolong—the transit arrangements, which soon after ended to the detriment of important Canadian interests. A promise was, however, given that Congress should be recommended to create a commission to consider the fishery and trade questions; and negotiations are said to be expected, let us hope to have a more prosperous issue than our past experience of the statesmanship of our representatives would warrant us in expecting. (Hear, hear.)\n\nThe Tories mourned with bitter tears over\n\nTHE EXODUS\n\nfrom Canada in Mr. Mackenzie's time, and the slow growth of population in town and country. They promised to change all that, and largely at the expense of the Canadian Pacific Railway to introduce fresh numbers to our soil. But the exodus was greater than before, and the general progress of urban and rural population has been slower than before, while they have expended enormous sums on immigration, to a considerable extent on persons who come into competition with classes already hard pressed, and on others who were but transient visitors to Canada.\n\nThey complained of our restricted foreign trade, and promised, by treaties of commerce, to open up to us new markets. To achieve these triumphs\n\nTHEY APPOINTED A HIGH COMMISSIONER,\n\nwith a magnificent furnished mansion, and large salary and allowances, aggregating, I believe, something near the salary of the United States Minister at London. Missions to France and Spain became the order of the day. In Spain we decided to stop, because for some incomprehensible reason it was supposed our advance might interfere with English negotiations, which have come to nothing. In France we lost a treaty by the delays incident to reference to the Imperial authorities. The Ministers have laboured, and have not even brought forth a mouse. (Laughter.)\n\nBut I forget. There are mysterious rumours about a second French treaty, which is said to have perished untimely before its\nbirth, which has been buried in secret, and which we must try some day to exhume for a coroner's inquest. They declared that the new office would save the cost and inconvenience of English Ministerial missions, but the missions have been more costly and numerous than before. In fact, a Minister or two generally crosses every year. But to make up, the High Commissioner spends a good deal of his time in Canada. (Laughter.) Notwithstanding the complete failure of their system, they reject the step of securing to Canada the right to make commercial treaties; the only step which will relieve us from the entanglements inseparable from the present plan, and give us a chance to advance in this direction our material interests. (Applause.) They have failed to secure the extension of extradition arrangements with the United States, which are in a condition scandalous to both countries, making each the refuge of the other's rogues, and which could be amended easily, and very soon were we in direct communication with our neighbours through an agent at Washington, as I have long since recommended.\n\nThey have always professed themselves the only successful adjusters of our relations with the Provinces.\n\nI have spoken of their trade and taxation policy. I will speak hereafter of their centralization policy.\n\nAS TO THE MONEY RELATIONS;\n\ntheirs has been a hand-to-mouth policy—(hear, hear)—not based on general principles, bad for all the Provinces, productive of local operations, demands, and expectations of the most serious character. They have brought the question, at best one of great difficulty, and touching a very grave, I hope not a fatal, defect in the Confederation scheme, into still greater difficulties. At this moment the situation of Nova Scotia is serious. That Province has made representations to Ottawa which have perhaps got into the North-West pigeon-holes—(laughter)—and discontent and irritation are aroused. The settlement with Quebec did not take into account the claims of the other Provinces, and is said not to be final for Quebec itself, which is claimed to be still in a distressed financial condition. Other Provinces are coming forward, and the whole question has reached an acute condition.\n\nWhile refusing to entertain the idea of\n\nREFORMING THE SENATE,\n\nthe Government have, by their appointments, their vacancies, and by their management of Parliamentary business, impaired its modest possibilities of usefulness and its modest share of public confidence. That body is now pretty generally recognized for\nwhat it is, a convenient reserve of Tory patronage when in office, and a powerful weapon in Tory hands after they are defeated at the polls. (Applause.) They have two chances. If you support them at the polls they have both legislative chamber; but if you defeat them they have the Senate still, and can use it to thwart the popular will. We believe that it is not consistent with the modern democratic views of free institutions, that the Executive should have power to nominate legislators for life. (Applause.) We believe that the legislative bodies should be elective, and responsible to the people for whom they make the laws. (Hear, hear.)\n\nTalk of the Senate as a revising body! Read the record of its sittings and of its revisory action on the great bills, and discard that notion forever! (Hear, hear.) The Senate contains some good men, some able and upright men, but its constitution is vicious, and should be changed.\n\nThe Government was gradually forced, in part to make, in part to accept, improvements in:\n\nTHE ELECTION LAWS\n\nTo our long-continued efforts you owe the one day and simultaneous polling and the trial by judges. (Hear, hear.)\n\nWhen the Reformers came in they gave up the right to name the returning-officers, and provided that responsible public officials should fill the posts. But the Tories, taking advantage of the change while their opponents were in office, the moment they returned to power repealed the law, and seized into their hands the appointments. They took and have abused the power. (Hear, hear.)\n\nThey have\n\nSYSTEMATICALLY GERRYMANDERED ONTARIO.\n\nThis Province was within one of an equal division at the polls in 1882. But the gerrymander took from us eight seats, and endangered many more, so that we are in a decided minority in Parliament, and the change of a few votes would have almost swept us out of the House, though still sustained by half the electorate. This was a shameful and shameless act; a high-handed usurpation; an act of despotism under the forms of free institutions. (Hear, hear.) It was an act which sapped the foundations of free and constitutional government, and outrage every notion of fair play. It is an act which we must never forget till its perpetrators are punished, and its wrongs undone. (Cheers.)\n\nThe Government has since taken from the Provinces the power which each Province had up till lately exercised of settling the Dominion franchise. It is a power which, as the neighbouring\nRepublic proves, it is more consistent with the federal spirit to leave with the Provinces. They have thus created a double franchise, a double registration, double trouble, and expense. Their franchise is less liberal than that of the late Ontario Act, and they retain the plural vote. They have conferred on the unenfranchised Indians, of whom the bulk are shown, by their own official reports, to be uneducated and dependent, who have not yet got, are declared unfit for, and do not want the other privileges and responsibilities of citizenship, who are the wards of the First Minister and Chief Superintendent, the right of voting for their guardian's candidate if they choose, and against him if they dare. They have taken from the municipal officers the preparation of the lists, and, contrary to the English system, have seized the appointment of makers and revisors into their own hands. Their use of the power has been moderated for a time by the vigorous opposition and the force of public opinion; but they have in some cases greatly abused the power by the choice of partizans whose names figure in the records of election petitions, and are embalmed in the judgments on the trials. This act should have an end.\n\nThey have, besides these indirect means of affecting the people's choice,\n\nTHEMSELVES ELECTED MEMBERS OF PARLIAMENT.\n\nThey made Sir Charles Tupper member for Cumberland by act of Parliament. By resolution they turned off the choice—the admitted choice—of the majority of the electors of Kings; they refused to take the opinion of the court; they refused to take the opinion of the people; they seated in Parliament the man whom Kings had rejected, and he now represents the people, forsooth, by grace not of the people's votes, but of the Conservative majority in Parliament!\n\nAs to\n\nTHE CANADIAN PACIFIC RAILWAY,\n\nthe question is so vast and so encumbered with details that I despair in this rapid review of giving you even a bird's-eye glimpse of its later history. In 1878 both parties were agreed that the country should not be further taxed for its construction, but leading Tories thought Mr. Mackenzie had gone too fast; they were alarmed because up to 1877 $6,250,000 had been spent, and they condemned as premature the work between Port Arthur and Winnipeg. In 1881 they proposed that we should arrange for a company to construct part and own the whole road at a cost to the public of about $60,000,000 in cash, and 25,000,000 acres; and that we should give the company vast privileges and mono-\npolicies. They rejected better terms. But they pretended that their bargain would involve no burden on the people, as it would be settled out of the sales of the public lands. They justified the enormous price, because of the expected loss in operating in the early years; and they declared that the terms were liberal because they were final, and that the contractors could and would do the work without further calls on us. They have allowed the company to enlarge enormously the sphere of its operations beyond the contract line; to apply its credit and devote its energies largely to these operations, and to expend on them out of the company's resources to the close of 1884 over $18,000,000. They have allowed the Company up to the same date to pay or set aside for dividends about $20,000,000. They have allowed it to adopt in its stock operations the water system, so that for $25,000,000 stock the original proprietors paid only $10,000,000, and for the whole $65,000,000 the company received only $29,500,000. They have since lent the company $30,000,000, and have spent or pledged in connection with the extended schemes nearly $14,000,-000 more. Taking no account of the $11,000,000 received by the company from the land grant or of the temporary loan of last session, the public expenditure in gifts and loans of cash is thus $104,000,000, or nearly $500,000 for each electoral district, or $120 for each head of a family in Canada. Of this sum about $20,000,000 has been paid out of duties costing the consumers near $30,000,000, and for the rest we borrow and pay interest, less of course the company's repayments on their loans.\n\nTO PERSUADE US ON,\n\nthey told us in 1883 that between that year and 1891 we would receive from North-West lands $58,000,000 in cash. Had they divided that sum by ten they would have been nearer the mark! Since then they have impaired the security and lowered the interest for the loan. And all this has happened while the cost of the work to be done by the company under contract cannot be more, and ought to be less, than $58,000,000. They have hastened beyond all reason and prudence the completion of the road, at enormous added cost, and in advance of any tangible necessity, or any early prospect of local traffic over the larger part of its mileage.\n\nThey have thus\n\nIMPAIRED THE IMMEDIATE PROSPECTS OF THE ENTERPRISE,\n\nand at the same time charged upon the traffic of the North-West unnecessary burdens, while for that country the vital question is cheap rates of railway. To preserve the company's monopoly,\nthey have disallowed local railway legislation in Manitoba, in defiance of the rights and to the detriment of the interests of the Province, and we do not yet see the end.\n\nLOOK AT THEIR NORTH-WEST POLICY!\n\nAt one time they encouraged speculation and promoted the boom which has caused so much misery there and here. At another time they closed large tracts to settlement. Always have they been slow, negligent, and not responsive to the calls of duty which were exacting as regards the development and administration of that vast region; and so they created discontent and retarded solid progress. They have used that country as a happy hunting ground for their supporters inside and outside of Parliament, from Lieutenant-Governor Dewdney to expectant Registrar Wilkinson. It has been one of the party resources of the Government. We have legal, medical, mercantile and broken-down politicians in the older Provinces turning up in every corner of the records, as\n\nTimber speculators, Ranch owners,\nCoal miners, Gold miners,\nRailway promoters, Land company promoters,\nLand Speculators, Office holders,\nContractors,\n\nall looking to Ottawa and begging for favours. This phase of the business has assumed in the Legislature the proportions of a public scandal. (Hear, hear.) Members have been using their parliamentary position to obtain advantages for themselves, and to procure at a price these advantages for others.\n\nI know of a member, and so do you, who, as a reward for his influence and exertions in securing advantages, got\n\nGRATUITOUS INTERESTS IN TWO COLONIZATION COMPANIES\n\n—blind shares they call them. I know of a member who stipulated for a commission on the amount of a railway subsidy he was promoting at Ottawa. I know of a member who, being a director in a railway company, demanded as his share about half the expected profits of the promoters, on the threat that he otherwise would use his influence against the company's grant, which he thought he could help or hinder.\n\nI need not go on, though I could go further and climb higher. THE STATE OF THINGS IS DISGUSTING AND ALARMING. Nor can you be surprised that men engaged in such transactions are but little open to reason and argument. Their ears are in their pockets.\nBut you ought not to be astonished at this condition of affairs. When the Canadian people returned to power the actors in the Pacific Scandal, these results were predicted. We could but suffer a degradation of the public morals. I do not intend to deal with the graver features of that transaction; but let me recall to you one minor incident. Do you remember that in '72 there was a private bargain whereby a prominent member secured a secret share in the company? On the surface he was to pose as the independent member for Blankton, arguing and voting on high public grounds for large subsidies and liberal treatment to the company. In truth, he was to be a partner in the concern, making profits out of his vote and his seat. The facts became known, but after a decorous period of retirement he was again returned by his constituents, and now fills a Ministerial office. If such a transaction is to be followed by political promotion, why should you be surprised that it is followed by still more objectionable and scandalous relations between members and the public chest? Why should you be surprised that the disease has infected electors as well as members; and that more and more openly the atrocious doctrine is disseminated that the public moneys should be appropriated, and that local claims should be regarded with reference to the political opinions of the district, and the degree of support it may accord to the Government of the day.\n\nNor is this all. The\n\nPATRONAGE IS ABUSED.\n\nThe office-holder is not free to vote as he wills. I know a case in which a member warned an office-holder that if he voted against the Government candidate he might lose his office, in which the man did so vote, and was shuffled out of his office accordingly. Thus you all see that a gigantic system of corrupt influence has been organized, by which the independent action of members and electors is checked, and the ascendancy of the Government is maintained. Our task is to break that system down! (Cheers.)\n\nIn another sphere of politics a most unfortunate line has been pursued by Ministers. They have attempted a course of centralization subversive of the federal pact. Our future depends largely on the full recognition of the\n\nFEDERAL CHARACTER OF OUR CONSTITUTION,\n\nand the preservation of our local liberties. But the Minister was from the beginning a legislative unionist on principle. If he could have had his way, all power would have been centered at Ottawa. He became a Federalist from interest, as the condition\nof keeping power; that power he has used, so far as he dared, in furthering legislative union. Both in framing and in interpreting the federal act he has minimized its federal character.\n\nHe has made many failures in his anti-provincial campaigns, but he has attained some successes injurious to his country. Of these late examples are, the extension of the power of disallowance, the seizure of the provincial railways, and the appropriation of the franchises. As to his unsuccessful attempts, he claimed the right to the issue of marriage licenses, but the Imperial authorities decided against the constitutional lawyer—(laughter)—who has boasted so vain-gloriously of his infallibility; and he was forced to abandon his prey. He claimed the right to escheats; but the Privy Council has decided against the view of the constitutional lawyer—(Laughter.) And he was forced to abandon his prey.\n\nThe Ontario Legislature by act declared that the law gave a right to run timber down certain streams, and it provided for compensation for the use of the owner's improvements. The constitutional lawyer—(laughter)—averred that this act altered, and did not declare the law; that it was a theft of the owner's property; and he disallowed it thrice as unjust. The Privy Council decided, against the view of the constitutional lawyer, that the law was such as the Ontario Legislature had declared it to be; so that they had not stolen the owner's property; on the contrary their act was his security for compensation for lawful use.\n\nSo I believe the last Streams Act has not been disallowed; we hear no more of this great outrage on the rights of property; we hear no more of theft; he has been forced to abandon his prey. (Applause.)\n\nYet the wound inflicted on the constitution is not healed; nor will be until there is at least some formal declaration and repudiation of the claim to disallow local legislation on local matters not affecting Dominion interests, simply because an Ottawa Minister may fancy the act unjust. This pretention is subversive of the chief of all provincial rights—that of effective legislation on purely local affairs.\n\nThe constitutional lawyer declared that the limits of Ontario to the West did not reach Port Arthur, and to the North were the height of land; he averred that the limits of the Lake of the Woods and the Albany River, and other waters were wrong and could not be supported by any court or tribunal in the world.\n\nHE SOUGHT TO SEIZE ON A TERRITORY, THE SIZE OF A KINGDOM,\n\nWHICH WAS THE PROPERTY OF ONTARIO.\n\nFor the paltry purpose of creating strife between Ontario and\nManitoba, he assumed to hand over this territory to Manitoba. She was encouraged to take possession, while Ontario was declared to be violent and wrong, because she claimed her own. But the Privy Council has decided against the boundary set up by the constitutional lawyer, and substantially in favour of that which he said no court or tribunal would support; he will be forced to abandon his prey. (Applause.)\n\nThe constitutional lawyer declared that even if the limits were the Lake of the Woods, yet Ontario had no right to the lands, the timber, the mines or the minerals; that these all belonged to Canada; that not a stick of timber or a lump of lead, iron or gold would ever be Ontario's; and he has tried to divide up her inheritance among his political friends. But the Chancellor has held that the constitutional lawyer is wrong; that the property is Ontario's. (Applause.) I am told that the prospect of a favourable result in the higher court is excellent; and so we may hope that he will be obliged to abandon his prey.\n\nThe constitutional lawyer, seeking in 1882 the\n\nSUPPORT OF THE LICENSED VICTUALLERS,\n\ndeclared that he had never doubted that the Local Legislatures had no right to regulate the sale of drink; that their acts were waste paper; that they would be so decided by the courts; and he advised the victuallers to test them. He declared that if returned he would pass an act taking away his power from that little tyrant Mowat. (Loud cheers and laughter.) The victuallers were pleased, and voted accordingly. They called on him to redeem his pledge. He then told Parliament that Ottawa legislation was necessary; that the local liquor laws were void; that the sale was free; that we must act at once; and all this he said was shown by Russell's case. We pointed out that Russell's case did not so decide; and that at any rate it was ill argued; the question of municipal rights was never raised; some of the reasoning was questionable; and that the proposed legislation was wrong. He insisted, and proposed a committee to frame a law. We declined to sit on his committee. He brought in their report and introduced his bill. We proposed postponement till the question he had raised should be settled by the court. He refused. We proposed action to remove the doubt in the sense of the Provincial rights acted on for fifteen years. He refused. He forced his measure through, created his offices, established his machinery, collected his fees, issued his licenses, and involved the community in turmoil, confusion and expense. Meantime the victuallers had taken his advice. They tested the local Act. The Privy Council decided—against the constitutional lawyer—that the acts he had\ndeclared waste paper were good and valid. (Cheers.) Confusion became worse confounded.\n\nNext session came. We called for the repeal of the law which it was now shown was not necessary, the ground for which had wholly failed. He refused. He declared that though the local laws were valid, the federal law was so also, and would supersede them.\n\nTHE CLOVEN HOOF APPEARED.\n\n(Laughter): It was a matter of policy now, not of necessity. He wanted to centralize. In the end we forced a reference to the courts. The Supreme Court decided that the main parts of the law were ultra vires.\n\nLast session came. We asked him to discontinue the struggle. He obstinately refused. We could obtain only a suspension, and the worry continued still. Now the Privy Council has decided that the emphatic and positive declaration of the constitutional lawyer was altogether wrong, and that the Act is ultra vires. The struggle was severe and protracted. It is ended now! His cohorts are disbanded; his licenses are torn up; his staff is off duty; his Act is waste paper. He has been forced to abandon his prey. (Loud applause.) But at what cost to the public and to citizens, it will not be easy to count up. Can you wonder that some people have actually begun to lose faith a little in the statesmanship and skill which, with such large pretensions, has produced such inadequate results? (Laughter.)\n\nNow the Government has all this time been so\n\nBUSY WITH POLITICAL INTRIGUE,\n\nwith schemes for retaining or obtaining political support, with jobs, with the regulation of our private business, with its attacks on the Provinces, that it seems to have had no time or energy for the discharge of its most obvious and important duties. IT MARKED THE EARLY PART OF ITS OLD LEASE OF POWER BY THE NORTH-WEST REBELLION OF 1869. IT HAS, I BELIEVE, MARKED THE CLOSING SCENES OF ITS NEW LEASE BY THE NORTH-WEST REBELLION OF 1885. (Applause.) I cannot go into the details tonight. I have done so in Parliament already. Remember, that Government was very specially responsible for diligence and liberality in dealing with the North-West, because of former events, and because it was an unrepresented country, autocratically governed. I have, nevertheless, shown beyond all doubt, out of the selected papers brought down under compulsion by the Government, the most scandalous neglect, delay and mismanagement. With an enormous Indian expenditure they had the Indians largely...\nin a state of hunger, insubordination and disquiet. With seven years' time for action, full power to act, full knowledge of the discontent, and of the danger of delay, with constant petitions, resolutions; representations, pressure and remonstrances, they yet did nothing to settle the claim of the North-West half-breeds to like treatment as was accorded those of Manitoba till it was too late—till the fire was in the heather.\n\nWhen they first acted, it was in a lame, inadequate and halting sense, and with a fatal pause. (Cheers.) Even their second step, after the outbreak, was unjust and unsatisfactory, and it was not till after the commission had reported the need to yield that they yielded. They showed, also, gross negligence in dealing with the claims of the Manitoba enumerated half-breeds, whose first demands, though pressed and proved for years, they refused to recognize or settle, nor were they dealt with till April, 1885.\n\nTheir action as to the land office, the opening of the land for entry, the surveys, the settlement of land claims, the recognition of early occupation, wood rights, land patents, colonization companies and reserves, and their system of dealing with letters, petitions and reports were marked by\n\nAPATHY, INCAPACITY, NEGLECT, PROCRASTINATION AND BUNGLING.\n\nIn truth, the story is almost incredible, were it not proved out of the records.\n\nThen in June, 1884, came Riel.\n\nThere was ample time that summer to settle all. All might have been even then adjusted; the grievances which were his instruments removed, and his power broken. They knew he was there; they knew he was agitating; they knew the danger; Sir David Macpherson knew it; Sir John Macdonald knew it; Sir Hector Langevin knew it; Sir Adolphe Caron knew it—the whole corps of Knights knew it. They were warned time and again; they were implored; they were threatened. Nothing moved them.\n\nThey were roused to action only on the eve of the outbreak.\n\nTOO LATE, ALAS, TOO LATE!\n\n(Applause.) They were as ineffective in measures of repression and defence as in those of redress. They, demoralized and disbanded the local forces. With three years' warning they left the guns in such an unserviceable state that they became useless at Cut Knife, to the great danger of our gallant troops. They chose a military post at Carleton, which was only tenable while there was no enemy—(laughter)—and was abandoned the first instant of the war.\nThese are but samples of their conduct. I say nothing of the cost of the war, or the management of that business. Now, you know\n\nWHAT FOLLOWED THE OUTBREAK.\n\nThe loss of many lives; many wounds; much suffering; terror and anxiety among the scattered settlers; great hardships; losses to individuals; millions drawn from the public chest; the country injured; the Indians unsettled; a state of affairs produced of which we cannot see the end.\n\nI brought the subject before Parliament at the end of last session, but the House was exhausted; the papers were unprinted, the members had not read them; Government denied the accuracy of my statements; they called on their supporters to confide in them; they declared my motion inopportune, and called on their supporters on that ground to vote it down; and voted down it was. Since then there has been time to read the papers; the objections of last session no longer apply. Some of their supporters have already declared that the Government was wrong, and I do not believe they would now repeat their vote.\n\nWHAT IS TO BE THE PENALTY FOR THE MEN WHO HAVE, BY THEIR CRIMINAL NEGLECT AND INCAPACITY, PRODUCED THESE SAD RESULTS?\n\nI have told them that in older days they would have been impeached as traitors to their trust. (Prolonged applause.) These are not our modern ways. The penalty is milder—for such an offence as theirs, too mild. It is but a withdrawal of the power they have abused, of the confidence they have betrayed.\n\nThis mild penalty we call on the people to inflict, and I will not so far despair of my country as to doubt the answer to that call. (Cheers.)\n\nSince the close of the outbreak an event growing out of it has to a great degree engrossed the public attention, and to that I now turn—I mean\n\nTHE FATE OF RIEL.\n\nAn effort has been made for obvious political purposes to colour the character and exaggerate the import of the agitation on this subject. Some Quebec supporters of the Government have, in common with some of its Quebec opponents, denounced its action in very strong language; and words have been used, suggestions have been made, things have been done, which do not commend themselves to my judgment. (Cheers.)\n\nOn the other hand, the most violent language has been used in\nthe Ontario Ministerial organ. The movement, as a whole, has, in my view, been misrepresented, and a deliberate design is apparent on the part of the Ontario Tories to create and intensify a war of race and creed, and to obscure by this means all the real issues between parties in order to raise an issue, false in itself, and which, handled as proposed by the Ministerial press, would imperil the future of our country. (Cheers.)\n\nIt is quite certain that this question must, and it is most desirable that it should, be shortly debated in Parliament, and that those who challenge the conduct of the Government should tender a definite issue. This I hold, though I entertain very strong opinions as to the reserve which should attend criticisms on the exercise in ordinary cases of the prerogative of mercy.\n\nAs Minister of Justice I have had to advise in many capital cases, and I do not forget the heavy responsibility which rests on those in whose hands are the issues of life and death, and whose task is rendered all the more difficult by reason of the large measure of discretion vested in them, and expressed in the word clemency. I know how much these difficulties are enhanced by heated partizan and popular discussion, in which distorted views and an imperfect appreciation of facts are likely to prevail. I have been falsely and wantonly accused of selling the prerogative for personal and for political gain. I deprecated then, as I would deprecate now, such attacks on Ministers unless made with good and sufficient reason. So delicate, in my opinion, is the exercise of this prerogative, that while I have sometimes been unable to reconcile my judgment to that of the present Ministers, I have felt it, on the whole, the lesser evil to be silent than to raise a debate, and I can easily conceive, in fact I have known of cases in which, though I might differ from the conclusion of the Ministers, I should yet refuse to censure them for honestly taking a line which I would not follow.\n\nBUT WE MUST BE GUIDED IN EACH CASE BY ITS OWN CIRCUMSTANCES.\n\nThe right of discussion, of advice, of censure, has been denied by a leading Ministerial organ. Yet it is unquestionable. Ministers are responsible in this as in all other cases. I was myself instrumental in procuring the reform which made this sure, and the rights which I helped to secure for my country I will help to maintain. (Cheers.) But I declare that the occasion must be special which renders discussion opportune, and the case clear which renders censure expedient.\n\nWhy, then, do I hold that this is plainly a case for Parliamentary discussion. For several reasons.\nBecause the trial was for an extraordinary political offence. A great agitation has supervened, and various questions have been raised which cannot be disposed of save after full debate in Parliament.\n\nBecause some prominent supporters of the Government declare that they have been misled, deceived and betrayed by the Government; and this charge must be investigated. (Hear, hear.)\n\nBecause those men also declare that the Government acted, not on principle, but on party considerations, to punish an old offence, and to gratify the hate of a section of their supporters, a statement which demands inquiry. (Hear, hear.)\n\nBecause unhappily at an early day, and before the trials, the Government declining the position of neutrality and indifference which as the representatives of public justice, public mercy, and public policy they should have maintained, declared that the charge which I preferred against them of neglect, delay, and mismanagement in North-West affairs was the defence of their prisoners, thus making themselves substantially private parties to the cause, and in effect resting their defence on the prisoner's conviction.\n\nI have always held that both parties might be deeply guilty, the Government for neglect, delay and mismanagement, and the insurgents for rising in rebellion, always a grave offence against the State, and in this case aggravated by the incitements to the Indians to revolt. But the Government identified their acquittal with the prisoners' conviction, and thus disqualified themselves for just judgment. (Cheers.)\n\nFor these and other reasons I deplore any attempt to evade or delay the Parliamentary discussion, and am ready to facilitate as far as I can the ventilation of the whole question, including the sentences of imprisonment, as to which I may be allowed to express the hope that Government will, without delay, deal with those sentences in a large and merciful spirit. But while I am of this opinion, I hold strong views as to the character of the discussion.\n\nMuch has been said of the conduct of the French-Canadians in raising this question, and\n\nA WICKED ATTEMPT HAS BEEN MADE,\n\ntaking advantage of some too hot and intemperate phrases, to arouse prejudices of race and creed against them because they have shown specially warm feelings in this matter. It is true that we Canadians are in a political sense one people. I could wish that, without obliterating race predictions, there were among us greater unity and love as fellow-Canadians. (Hear, hear.) To that end I have laboured in my humble way, and not long since\nwhen defending those of another faith than mine against what I believed to be unjust aspersions, I pointed out the true path of duty in a community of divers races and creeds like ours, \"where we must combine firmness in the assertion of our own rights with fulness in the recognition of the rights of others—(cheers)—we must cultivate moderation and forbearance; we must hold to the ample acknowledgment of each man's individual rights of conscience in religious matters; and, to the common citizenship of all in civil affairs if we would make of Canada a great and free country, inhabited by a happy and united people.\" (Cheers.)\n\nRace and religious feelings, however, exist, and will have their effect. It is natural that those of us who are of one Province, blood or faith, should feel more warmly than the rest in the cause of men of our own Province, origin or creed. (Hear, hear.)\n\nBLOOD IS THICKER THAN WATER.\n\nThe condition I affix is this, that they should found their appeal on the great principles of justice, mercy and policy applicable to all alike, and should demand no special favours by reason of Province, race or creed.\n\nThose of us who belong to the other elements of our nationality have also our duty to do—to make ample allowance for warmth of utterance and hasty phrase, to calm rather than to excite prejudice, and to decide on broad and general, just and generous views, such as we would wish applied to ourselves. Let us do unto others as we would they should do unto us. (Cheers.)\n\nAs to the union for political purposes of one race or creed, irrespective of political principles, I am not now to speak for the first time my mind. In 1871, when expressing the strong opinions I felt and feel on the subject of the murder of Scott, I deprecated any attempt to decide the question on the ground of nationality or religion. In 1877, when protesting against some ill-advised pretensions on the subject of undue influence, I declared that I should struggle \"to preserve to each one of my fellow-countrymen, whatever his creed, the same full and ample measure of civil freedom which he now enjoys under those laws which enable him and me, though we may be of diverse faiths, to meet on the same platform, and to differ according to our own political convictions, and not according to our religious faith, or the dictation of any other man, lay or clerical.\" (Cheers.) And during the last few years I have more than once warned my fellow-countrymen of an insidious attempt which has been made to effect a so-called political union of all the French throughout Canada in the interest of the Quebec Tory leaders. I have pointed out that this was an unpatriotic step fraught with danger to the Dominion,\nand with special danger to those who, being the minority, were asked to work together as a unit, apart from questions of opinion.\n\nBut no encouragement was given by the Tories of the other Provinces to these views. It was all right for Messrs Langevin & Co. to counsel such a union substantially in the Tory interest. But when there is a breach in the Quebec Tory ranks the cry of danger to the State at once fills the air. A united French population, united in the Tory interest, would be a public blessing. A more equally divided French population since it would weaken the Tory interest is a public danger. (Laughter.) I say a more equally divided French population, for it is not my judgment that the French are a unit on this question.\n\nFor the same base party purpose of promoting race prejudice, and giving ground for the cry of English against French, they have been so represented by the Ontario Ministerial press. But not so by that of Quebec, and I believe it to be but a dodge, and that there is there, well as elsewhere some division of opinion.\n\nSo may it be!\n\nLET US UNITE AND DIVIDE, I SAY ONCE MORE, ON GROUNDS OF REASON, ARGUMENT AND OPINION, AND NOT OF RACE OR CREED.\n\nI hope and trust that the excitement having somewhat abated, the further discussion in the press and among the people may be more tranquil; that rash and hasty language may be avoided, and that when we meet in Parliament we may engage in the debate in a temper and after a fashion suitable to our national dignity, and regardful of our national unity. (Cheers.)\n\nNow, on what lines are we to deal with this question in Parliament. Those of us who have not engaged in the preliminary discussion, who are free and unfettered, to whom it is open, unembarrassed by any prior and premature declarations, to reach unbiased conclusions, have, I conceive, very special duties. We are to help to obtain information on all points now obscure; we are to listen to the arguments of those who have taken sides; we are to consider the whole case presented, and we are to strive for the formation of a\n\nJUST AND STATESMANLIKE JUDGMENT\n\nby the House of Commons. We must endeavour to eliminate, as factors in the decision, race and creed; and cause the Commons of Canada to speak with a voice and in a sense which posterity, after these heats have cooled, and these mists have cleared, shall ratify and confirm. (Cheers.)\nI believe we cannot, if we would, make of this a party question. After full reflection I do not entertain that desire; but were it otherwise, I doubt that the result could be accomplished. (Hear, hear.) I exercise no compulsive or constraining force over the opinions of the Liberal party on this or any other question; and I entertain the impression that with us, as with the Tories, there are differences of opinion in the ranks not likely to be composed, and which I, at any rate, shall make no endeavour to control to a party end. For, after all, though at first blush one may regret party divisions yet am I glad in this case of this condition.\n\nFor the reasons I have given I do not desire a party conflict on the Regina tragedy. I do not propose to construct a political platform out of the Regina scaffold—(prolonged cheers)—or to create or cement party ties with the blood of the condemned. To apply words I have already quoted in another sense, I do not care \"To attempt the future's portal with the past's blood-rusted key.\"\n\nNow, as you know, I have been absent from Canada for some months, but since my return I have read with care such papers as I could find. While these have produced impressions on my mind as to the material issues, I have been clearly led to the conclusion that the information required for a just judgement on some points is not before us.\n\nI think we require an authentic copy of the evidence and proceedings at the trial, and also of the papers found at Batoche, the production of which was refused by the Government, but which, I think, Parliament should see, the rather that a Minister has lately made public one of these papers, of considerable importance as affecting Riel's position, and tending to contradict the allegation that he had himself procured the invitation to come into the North-West. I think we require an explanation as to why, if it was intended to execute the sentence, Riel was not put on trial for murder instead of for high treason. Was it because it was thought inconsistent with Gen. Middleton's letter to try him for aught save a political offence? It is proper also to know more as to the circumstances connected with that letter, so as to judge of the weight to be attached to it.\n\nAs to the trial itself, it must be confessed that the arrangements for the administration of justice, originally of necessity rude and primitive, had become by time less applicable to the circumstances of the country and were not well suited to the trial of such a case as Riel's. The independence of the judiciary and its high stand-\ning in fact and in public estimation are of the first importance; and in a political case, in which the Government has taken sides, this is brought home to the meanest comprehension. But the judges of the North-West hold office, not like the Superior judges of the older Provinces, during good behaviour, but at the pleasure of the Government; on, which they are thus in some sort dependent. Besides, they are also political personages as members of the North-West Council and thus less fitted for political trials.\n\nI regret that the course of legislation has been rather in the direction of reducing than of increasing the securities in these cases. By the act of '80 the presence of two magistrates besides the stipendiary in capital cases; theretofore necessary, was dispensed with, one only being made sufficient. But I do not see that the Government is censurable for having tried the prisoner before the tribunal provided by the standing laws, though I may regret that those laws did not provide a more satisfactory tribunal; and it is always to be remembered that the special provisions requiring the decision of the Executive before the execution, and the attendant responsibility of Government, have been retained.\n\nThe choice of the judge is another matter. If I rightly understand, Mr. Richardson, besides being a magistrate and a member of the North-West Council, was the paid legal adviser, the political law officer, so to speak, of the Executive of the North-West, and I think explanations are required of such a choice for such a trial.\n\nSomething I had intended to say as to the panel, but on reflection, in the absence of knowledge on one material point, I think it better not to suggest in this respect hypothetical criticism, and therefore I abstain. I think it right to say that, in my opinion, the Government acted in a very proper spirit in providing for the attendance of the prisoners' witnesses, and that from what I know of their leading counsel I should suppose it impossible that, in their management of the case, there was anything unfair to the prisoner, or derogatory to the high character they deservedly enjoy, or the responsible duties they undertook to perform. (Cheers.) I am not implying, then, any present doubt as to the justice of the trial. For all my inquiries it may have been just. But, besides justice in fact, the creation of a feeling of public confidence, of a general impression that all was fair, and that every security was taken for fairness, is important, and in that view of the duty of the authorities, I think these questions should be examined.\n\nAgain, we should have before us all the withheld and suppressed documents as to the\nNEGLECT, DELAY, AND MISMANAGEMENT OF THE GOVERNMENT\n\n—not, I repeat, as justifying rebellion, but as added proofs that Government gave the occasion and opportunity to raise rebellion by means of the feelings evoked and the materials and chances offered through their misconduct.\n\nLook in this connection at Bishop Grandin's letters lately published. Look at Col. Houghton's report still suppressed. Look at the mass of papers still confessedly withheld. The Government says that it will not now enter into this part of the case. It is reserved for Parliament. Be it so. The issue is then deferred; but we must have the evidence. And these papers may have an important bearing on the propriety of the decision, and on the question whether these were the men who should have reached that decision.\n\nI think we should have the evidence on which\n\nGOVERNMENT HAS CHARGED THE WHITES OF PRINCE ALBERT WITH BEING GUILTY,\n\nmore guilty than the Metis. If so, they should be exposed. Indians and Half-breeds should not bear the brunt while guiltier whites go free—(cheers)—and the relation of these whites to Riel may have a serious bearing on his case.\n\nWe should have further information as to Riel's demand for money. As Government states the case, his conduct was base and venal, and a strong impression has naturally been produced. But the statement is involved in contradictions, for I find in the memorandum of the Minister the following extracts from the evidence: \"He (Riel) said that if he got the money he would go to the United States and start a paper and raise the other nationalities in the States.\" He said: \"Before the grass is that high in this country you will see foreign armies in this country.\" He said, \"I will commence by destroying Manitoba, and then I will come and destroy the North-West and take possession of the North-West.\" Now, however wicked, absurd or indicative of a disordered mind may have been these words, addressed to the man he was soliciting, they are inconsistent with venality. More light is wanted here.\n\nI now come to a most important part of the case. The question of\n\nRIEL'S MENTAL CONDITION\n\nis one to which I am at present disposed to attach greater importance than as I judge does the general public. But I think all will agree that we are clearly entitled to have before us, besides\nthe papers, the instructions, and report of the so-called Medical Commission which is referred to by the Government. You will remember the conflicting statements as to the character and results of the enquiry. Though there is much on which we can and ought to reach conclusions independent of the medical testimony, yet this is a part of the case without which we should not decide.\n\nI think, also, that we should have a statement of the grounds on which the Government decided against the recommendation to mercy, a course which may have been perfectly correct, but which ought to be explained.\n\nAnd here I may say that I regret that we do not know the grounds of that recommendation.\n\nWe should also learn something of the reasons for the last respite, of which several accounts have been given, one of an extraordinary nature.\n\nFuller information seems to be required as to the grounds on which the Government thought the execution of Riel necessary. Warm supporters of the Government have alleged that it shamefully betrayed and deceived them; we want the evidence of this. They also alleged that the Government acted to gratify the thirst for vengeance, in respect of the Scott murder, of one section of their supporters, and on a cold-blooded calculation of gains and losses in the counties, rather than on general considerations of public justice, mercy and policy. (Cheers.) On this grave charge we want light.\n\nI will go no further. I have come to the conclusion that in this complicated case, where each of several branches may affect the general result, it is just that the materials for decision on every branch should be available before finally forming and announcing a general judgment; and therefore, much as I should have personally wished to communicate to you my individual impressions, I believe I shall best discharge my duty, which, as you will have seen, I consider to be as much judicial as political, by abstaining at this moment from the expression of opinions which would be, at best, but partial, *prima facie*, hypothetical, and subject to correction and review. It is with all the facts and circumstances before us, and in the presence of the Government, whose action has been assailed, and of their accusers that our deliverance may best be made. (Cheers.)\n\nTo some partisans on either side who think nothing is to be said on the other, my view may be—will be—unsatisfactory. But those who are willing to seek for the truth, and, casting aside prejudice, to strive for just conclusions, will, I hope, recognize its propriety.\n\nMuch has been said about political alliances and compacts in this connection. I know of none. To none am I a party. (Ap-\nI have had no communication with anyone outside of my own party. I have never wished for office. On the contrary I dislike it. Nor was there ever a time at which it presented in my view so little to attract: so much to deter. Beyond this I believe it to be from a mere party point of view the interest of the Liberal party that the present Government should remain in office a little longer—(laughter)—till the public have seen still more clearly the results of their past policy, results which if developed in our reign, might be, as in past times, attributed to us and not to their real authors. But were all this otherwise, I believe that a stable political alliance can be formed only on a general understanding on the substantial questions calling for early legislative and administrative action; and that it would be equally impossible and undesirable to form one based on community of sentiment, did that exist, with regard to an execution. Nor have I reason to believe that on that or any other question the Government, though weakened, will be defeated this session.\n\nFor the purpose of forwarding their design to form an anti-French alliance, the Ontario Ministerial organ has proclaimed their defeat. But the organs do not play the same tune in Quebec.\n\nIT IS ONLY A DODGE.\n\nThe Government would doubtless like to make this an issue—nay, the issue—before the English speaking populations. They would like it because they know the long calendar of their crimes. But the accused shall not be allowed to choose the matter for which they are to be tried, or to frame their own indictment.\n\nFor our part, we, too, know the catalogue of their offences. We know the counts of the indictment; and it is our purpose, apart altogether from this question of the man who is dead,\n\nTO DEAL WITH THE MEN WHO ARE YET POLITICALLY ALIVE\n\n—(laughter)—and who, for innumerable political offences, deserve a political death—(cheer)—as sure, as stern, as swift as that which has at any time heretofore been meted out to those in like case offending. I believe that in Quebec and elsewhere, in and outside of Parliament, there has been a growing feeling of uneasiness at the Tory policy; that it is being recognized; more and more as a dreadful failure; that its features of debt, taxation, restriction, extravagance, corruption, jobbery, neglect, mismanagement and centralization have made for it many opponents; that the Government is sinking in public estimation; that the people are beginning to perceive the wisdom of our counsels, the folly of our opponents; that our labours of these many years are at length bearing\nfruit; that the Government will be weakened this session; and weaker still thereafter, and will, if we do our full duty, be defeated at the polls. (Prolonged cheers.)\n\nAs in my electoral contests I have made no private canvass, but have depended on my public utterances; so as a political leader my hopes of gaining strength for my party have rested solely on our public speeches, on the policy we have propounded and the principles we have maintained. I have for some time believed that several supporters of the Government have been dissatisfied, have felt that they were on the questions of the day and of the immediate future more in accord with us than with Ministers, and have recognized the expediency of a change. They have seen that our country, which has great and solid natural resources; which even now, thank God, is showing in some quarters signs of recovery from some of the evils inflicted on it by its rulers; which is inhabited by an intelligent, industrious and progressive people, affording the main element of real prosperity; which requires only just and prudent, fair and statesmanlike government to permit its advance on both the material and moral planes, runs great risk if the present evil counsels are to endure.\n\nParty ties, the bonds of friendship, long habit and association, the consciousness of having borne a part, though reluctantly, in some things now condemned, and other considerations of various kinds have long restrained them, and may restrain them still; but I do not abandon the hope that some may shortly come out from the ranks to which they no longer in heart belong, and co-operate with us frankly in effecting a change in the public counsels. If they do not we will continue to fight the good fight with a stout heart—(cheers)—as best we can without them. But if they do, I am sure you will gladly welcome co-operation and assistance so obtained.\n\nLong have we hoped for a harvest from the seed we have been sowing! (Cheers.) The harvest has been slow of coming. Sometimes it has seemed as if the seed had perished. But it may have been dormant only. It may have germinated now. Soon may it ripen—(cheers)—and the fields grow white to the harvest!\n\nIf I could raise my feeble voice beyond the limits of this hall, and say a word in the ear of my countrymen through Canada at large, I would exhort them to come forward. Come forward, you who can cultivate and water, who can help to mature and gather in that harvest! Do your duty to your country! Take up the responsibilities as you enjoy the privileges of citizenship! Give your time, your energies, your labour to the work! Though the skies be dark, yet trust we in the Supreme Goodness! We believe our cause is just and true; we believe that truth and justice shall in God's good time prevail. It may\nBE SOON, IT MAY BE LATE. HIS WAYS ARE NOT AS OUR WAYS, AND HIS UNFATHOMABLE PURPOSES WE MAY NOT GAUGE. BUT THIS WE KNOW, THAT IN OUR EFFORTS WE ARE IN THE LINE OF DUTY. (Cheers.) WE HOPE, INDEED, TO MAKE OUR CAUSE PREVAIL. BUT, WIN OR LOSE TO-DAY, WE KNOW THAT WE SHALL RECEIVE FOR THE FAITHFUL DISCHARGE OF DUTY AN EXCEEDING GREAT REWARD—THE ONLY REWARD WHICH IS WORTH ATTAINING, THE ONLY REWARD WHICH IS SURE TO LAST. (Loud and prolonged cheers.)\nMr. Blake to the Owen Sound Reform Association.\n\nNORTH-WEST AFFAIRS.\n\nMALADMINISTRATION AND REBELLION.\n\nSTRANGE DISAPPEARANCE OF 125,000 IMMIGRANTS.\n\nTupperian Calculations—Premature Surveys—Gravestones of the Metis—Value of Half-breed Sympathy.\n\n\"FORCE IS NO REMEDY.\"\n\nREFUSAL OF INFORMATION BY THE GOVERNMENT.\n\nScandalous Treatment of Indians—\"What About Riel?\"—The \"Bunter and Smasher\" Fanatics.\n\nHon. Edward Blake, on coming forward to respond, was received with cheers and the waving of hats and handkerchiefs. The applause was renewed again and again until he raised his hand in request of silence. He said:\n\n\"Mr. Chairman and gentlemen of the Reform Associations, whose addresses I have just been privileged to receive: I give you my best thanks for the language, all too kind, and the expressions, all too flattering, which you have been pleased to use towards me. I wish I could feel myself in any degree worthy of them. I can only claim for myself that, conscious of many imperfections and failings in my public career, it has, at any rate, been animated by an earnest desire, to the best of my humble powers and to the limit of my poor ability, to do some little good to the country in which I was born, in which it is my happiness to live, and where I hope to die, and so to leave the corner of the world in which I live a little better for the life that I have lived in it.\" (Loud and prolonged applause.)\n\nEntering upon the discussion of public questions, Mr. Blake touched briefly upon the tariff, the reform of the Senate, Pro-\nvincial rights, the right of Canada to make commercial treaties, and the independence of Parliament. Dealing more at length with:\n\nQUESTIONS RELATING TO THE NORTH-WEST,\n\nhe said:—\"You remember well what hopes the people of Canada, particularly the people of Ontario, entertained for many years with reference to the North-Western country. You know that we desired earnestly to see that country filled with an industrious and law-abiding population, growing rich and strong, to their own advantage first, but also to ours, increasing the material and also increasing the political elements of Canadian strength. You know that, with that view, we have been willing, all of us, to make some pecuniary sacrifices, to add somewhat to our burdens, and to engage in the prudent conduct of enterprises which most Reformers believe have been imprudently managed, and whose management they have therefore opposed.\" You know, also, that the progress of that country has unhappily been impaired by misgovernment, maladministration, and neglect. You remember that AT THE VERY OPENING OF OUR CONNECTION WITH THAT COUNTRY, IN 1869 AND 1870, THE NEGLECT BY THE TORY GOVERNMENT of those precautions which ought to have been taken in dealing with the annexation, not of a territory merely, but of the population who inhabited it, PRODUCED A REBELLION. (Applause.) For fifteen years since that time we have gone on with full control of affairs in the administration and development of that country. You remember that from time to time statements were made of grievances, of discontent, of neglect, of delay, of maladministration. You remember also that the Government declared that those statements were entirely without foundation, they declared not only that there were no grievances, but that there was no serious complaint of grievances. Sir Hector Langevin went there in the summer of 1884, and three or four other Ministers as well. They travelled about, they saw the people, they received entertainments. Sir Hector Langevin gave an account of the result. He said that he went there at the request of the first Minister FOR THE EXPRESS PURPOSE OF FINDING OUT WHAT THE GRIEVANCES WERE; HE FOUND ONLY TWO MEN WHO HAD A GRIEVANCE, and that grievance was that there were not enough ladies in the country. (Loud applause and laughter.) Now, these all-wise governors, who claimed that they had so wisely administered affairs, also declared that their success was marvellous and unprecedented.\n\nTHE ROAD WAS \"NOT TO COST THE COUNTRY A CENT,\"\n\nthey said when they were persuading you to advance large sums in connection with the Canadian Pacific Railway (which sums\nnow amount all told, apart from the land and including the amounts for the eastern extensions, to about $87,000,000, or about $100,000 for each electoral district—which would be about $1,200,000 for the County of Grey alone). I say that they declared that this expenditure would cost you nothing, because, principal and interest, it would all be repaid at no distant day by sales of the lands of the North-West. In the year 1880 Sir John Macdonald declared that by the year 1891 we would have secured from North-West lands some $71,500,000, from which you were to deduct $2,400,000 for expenses, leaving about $69,000,000 clear gain. So late as the year 1883 Sir Chas. Tupper brought down a statement from the Department of the Interior, showing that in the years from January, 1883, to December, 1891, they would realize in cash $58,000,000. They pledged themselves to the people that every shilling, principal and interest, would be repaid out of these lands. That is all exploded now;\n\nTHE BUBBLE IS BURST.\n\nThe returns from North-West lands for the period of five years past were about four millions of dollars, and the net returns, deducting the costs of surveys and administration in the West and at Ottawa, were $370,000 only, while last year there was a balance of about $300,000 on the wrong side of the ledger, and that without deducting a shilling on account of the $1,100,000 a year we spend on Indians, $450,000 a year on Mounted Police, and other charges of hundreds of thousands on account of administration. Put these sums on one side—suppose them to be paid in some other way—and take the lands, what they produce on one side and what it costs to administer them on the other, and you find these results. I challenged these men on this subject in the House of Commons. I said:—Will you say that of the sum you mentioned only three years ago us certain to be realized, even one-tenth of it will be realized net? And they would not say me nay. (Cheers.) They said the immigrants would pour in and were pouring in rapidly. To the figures they gave of the number who had settled I added something for the natural increase of the population. And I find that, taking the official figures, showing those who were actually there, and the natural increase, there were\n\nABOUT 125,000 PEOPLE A-MISSING.\n\n(Laughter and applause.) I asked them:—Did these people come in? You said they did; is it true? If it is true that they did come in, where are they now? (Hear, hear.) Do their bones whiten the prairie? We know they don't, for the country is a healthy\ncountry. Have they gone away? Too many have, but not all these. The fact is it was all a delusion; so many people never settled there at all. They said the people there would cultivate enormous areas of the lands and produce enormous crops, to the advantage of the whole people of Canada. They made a calculation about that too. They said: The staple of that country is wheat. Sir Charles Tupper, in my hearing (at one of those times when he was persuading us to make some great grants for the railway), asked us whether the members of the House had considered what a hundred thousand farmers in that country would produce.\n\nA TUPPERIAN CALCULATOR.\n\n\"I have considered it,\" said he, \"I have made a calculation; I will give that calculation, and it will perhaps surprise some of you who have not taken the pains I have to find out the facts. The facts are that a hundred thousand farmers in that country will produce 640,000,000 bushels of wheat in a year!\" (Loud laughter.) Yes, gentlemen, it is a fact that he said that; I heard it myself. How did he reach these figures? He assumed that each farmer would crop 320 acres of land, his whole homestead and pre-emption. (Laughter.) He was to live in a balloon, for Sir Charles didn't leave him any room to build a house; he was to have his barns and stables in the air, his cattle were to pasture in the clouds, he was to have no grass, he was to have no garden, he was to have no roots, he was to have no crop of any kind but wheat; there was to be no room for fences, no room for roads through his farm, no anything, but every inch of 320 acres was to be sowed to wheat; and then he estimated that every acre would produce twenty bushels, and so he made out that each farmer would produce 6,400 bushels, and a hundred thousand farmers would, of course, produce 640,000,000 bushels. (Loud and prolonged laughter.) These are the stories with which these men tried to gull, not the farmers, because there is no rural audience that could be collected that would not laugh such absurdities to scorn, but the Parliament and the people at large. They went to work to survey the country.\n\nIMMENSE PREMATURE SURVEYS.\n\nThey said such an immigration as never was heard of before will go into the North-West; we must prepare at once for the millions about to cross the ocean and fill up that territory; we must survey acres by the tens of millions—and they did. They surveyed so far and so fast that there are hundreds of thousands of farms surveyed which will not be settled in your lifetime or mine. There\nis one block along the Canadian Pacific Railway itself—400 miles long. Take the distance from Hamilton to Montreal—it is less than 400. Think of a strip that long and forty-eight miles wide, all surveyed and ready to be occupied as farms. And how many homesteads were there on that strip on 31st December last? There were 138. (Cheers and laughter.) And this was on the line itself—but their surveys were not confined to those parts of the line for which they would have had some sort of excuse. I was telling my friends at Chosley yesterday of a gentleman who was travelling across the plains, and he caught up to an Indian or Half-breed driving along in a Red River cart. He noticed there was something out of the common in the cart. And what do you suppose? The cart had in it a lot of surveyor's pegs. (Loud laughter.) The fellow had picked them up as he went along to make his camp fire. (Cheers and renewed laughter.) We have been engaged in these surveys of all these tens of millions of acres, and meanwhile what has happened? This happened:—The government was too busy with these great schemes of bringing in millions of people from the outside, and their schemes to make friends rich out of the North-Western lands, to attend to the few who were already there. They had no surveyors to send out, and no money to spend in surveying the lands of the people already long settled in the country, and who are calling for surveys in the remote parts where they were settled, so that they might patent, sell, divide, devise, mortgage, or otherwise deal with their properties as you and I want to do. For years they called, for years they cried, for years they asked and begged for surveys, and I could read from the blue-books the reports of the Government's own officers that there was dissatisfaction and uneasiness, but that those who were dissatisfied must wait, because the grand projects of the Government left them no time to attend to the wants and demands of the people already in the country. I said to them once and again, \"The best advertisement you can have to induce people to come from abroad is a happy, prosperous, and contented population already there.\" (Loud and prolonged applause.) Get letters and statements from the settlers showing that they are satisfied and cheerful, that they have not grievances, that they advise the millions of landless folk abroad to come and join them, and these statements, giving in their own simple language the story of their trials and of their success, will do you more good than hundreds of statements by Sir Charles Tupper showing that 100,000 farmers will produce 640 million bushels of wheat in a year. (Loud and prolonged applause.) They will do more for you, because no sensible man will believe these marvellous stories you tell, while all sensible men will be inclined to believe the statements made by the actual settlers themselves.\" (Cheers.) But no, gentlemen.\nto these considerations. A few years ago we pointed out that some complaints had, as we had learned, come to Ottawa, and the cry of the settlers had reached further than the departmental pigeon-holes. Some had reached members of Parliament; myself among others. I moved for papers showing what the grievances of the settlers of Prince Albert were. I moved that in March, 1883. The House ordered that the papers should be brought down. But the papers were not brought down until after the rebellion broke out, until we were dealing with that question in 1885. Mr. Cameron, of Huron, moved that there should be a committee of the House to consider the\n\nGRIEVANCES OF THE PEOPLE OF THE NORTH-WEST.\n\n—grievances alleged to exist by the people of Manitoba, by the people of the North-West Territories, by the North-West Council; by settlers, and by missionaries. But the Government negatived the motion for a committee. Then we said:—The true safety-valve, the best thing that can be done is to apply the constitutional remedy—give these people representation in the councils of the nation; they live far off; they cannot see us; and we cannot speak to them; we have not the same means of learning their wants and grievances as in other parts of the Dominion. Give them members, men chosen by themselves, men who know the wants of the country, men to come at the bidding of these people, to be responsible to them and to Parliament; to state the condition of the country and call for redress of grievances. We brought in measures for this purpose. The Government rejected them, and declared that they would not even give these people representation. There was no hurry; the time would come! But the rebellion broke out, and AFTER THE REBELLION WAS OVER, and in the last session of Parliament, AFTER FIVE MILLIONS, to be paid out of your taxes, HAD BEEN WASTED in war, AFTER BLOOD HAD BEEN SPILT, AFTER UNTOLD PANGS HAD BEEN INFlicted upon the people, AFTER THE REPUTATION OF OUR COUNTRY HAD BEEN TARNISHED; AFTER A SET-BACK HAD BEEN GIVEN TO THE PROSPERITY OF THE NORTH-WEST, from which it will not recover for years, then—THEN AT LAST, and not till then—they brought down and passed a measure granting representation to the North-West. (Loud applause.)\n\nI am absolutely convinced that had our advice been taken and representation accorded in time, there would have been no rebellion. It should not be lost sight of that it was of the utmost importance, for high political reasons, that the Half-breeds should be kept peaceful and loyal;\nIMMENSE VALUE OF HALF-BREED SYMPATHY.\n\nThe great danger in that country was from the Indians, and the Half-breeds formed a link between us and them which should have brought us more into sympathy with them and afforded us means of controlling them, of learning their character and their wants, and how best to deal with them. Now, in 1869, when Canada assumed the Government of the new territory, the Half-breeds of the eastern part came forward with a proposition. They said:—It has ever been recognized by Britain that the Indians living in a country over which she assumes sovereignty, have certain moral rights, indefinite they may be, but not the less to be regarded, in the soil, not merely that part of the soil they happen each of them to occupy, but the soil of the region. We are partly of Indian blood, and as such, being residents of this region, we claim compensation for that right which you are now about to take away from us. On the settlement that right was acknowledged by the Government, Sir John Macdonald being then in power, and besides the title to the land they happened to occupy, certain lands or scrip for lands were given to each Half-breed, 160 acres for each person of full age, and 240 acres for each child, expressly in extinguishment of what was called their Indian title, and thus it was solemnly recognized that the Half-breeds had such a title. As settlement began to extend in the outlying North-West Territories, and the buffalo disappeared, and the Half-breeds of these parts were obliged to change their mode of life and settle down on farms, the demand for a recognition of their rights of precisely the same character arose. It could not be denied. They were in just the same position as those of the East, and the rights of their relatives had been accorded. It was in 1878 that this demand was pressed, and in the winter of that year Sir John Macdonald's officers caused inquiries to be made and reports to be obtained which showed that, in the opinion of those whom they consulted, it was not merely important that the question should be settled, but important that it should be settled without delay, because\n\nDELAYS WERE DANGEROUS\n\nand would produce sores and irritations, and render a settlement at a later date more difficult. Upon that the Government decided to ask Parliament to give them the power necessary to effect a settlement; and in May, 1879, Parliament passed an act at their request, and, in their words, giving them authority to grant such lands or such scrip, and on such conditions as they thought right in the settlement of these claims. So that at\nthat time, and by their own request, they were clothed with the fullest authority to settle this claim.\n\nCRUEL AND CALLOUS NEGLECT.\n\nFrom that time till 1885 they did towards a settlement absolutely nothing—absolutely nothing. Nor was their utter neglect palliated by the absence of remonstrances, for from year to year poured in petitions, representations, resolutions of meetings, letters, resolves of the North-West Council, all pointing to the importance of at once settling this question. But, until January, 1885, they did nothing—absolutely nothing. In that month they did something which was a half-way measure, utterly inadequate, and having taken that half-measure they stopped, and until March or April, 1885, after the rebellion had actually broken out, they did nothing more. But in March, 1885, they took the first somewhat effectual step towards recognizing the right of the Half-breeds of the North-West in respect of the Indian title; but even then the recognition was inadequate, and it was not till April that they were forced by fear to do justice. This delay took place notwithstanding that in June, 1884, the Half-breeds had called into the country as their chief and leader Riel, who had great influence over them, and in whom they had the greatest confidence, to advise and counsel them, and to direct the agitation for what they called their rights. One would have thought that even though the Government had been blind and deaf to all hints and warnings before, this, at any rate, would have awaked them. One would have thought that when the author of the old trouble had been called in again, and when he was holding public meetings, exciting the people, and calling for redress, this would have aroused them. More than this, there were remonstrances sent down from high dignitaries, bishops, missionaries, public officers, persons in authority all through the Territories, calling upon the Government to act, and to act at once. They had, even then, plenty of time and room to act, and plenty of reasons for acting early. (Applause.) I do not know what possessed them; I have been utterly unable to conjecture what it was that possessed these people with a spirit of obstinacy and apathy so great as to prevent them from taking even the first step towards the redress of these grievances until it was too late. It could not be that they were not alive to the state of affairs, for the papers show that though they took no measures for redress, they did take measures of repression. In July, 1884, they sent Col. Houghton to the district, to take away the arms of the militia, for fear they might be improperly used. They applied to the Hudson's Bay Company for and got possession of the old post at Carleton, to be used as a\nspecial station for the Mounted Police, and they put a number of men there in case of trouble.\n\nTHEY COULD INVENT MEASURES OF REPRESSION,\n\nbut toward the good old constitutional measure of remedying the grievances, of taking away the causes of offence, of removing the origin of the discontent and trouble, not the first step was taken until it was too late. (Cheers.) They say now that the rebellion was precipitated, because in January they took the first step toward settling the difficulty; that Riel rose earlier than he intended, because he found the Government was moving at last, and he felt that if he waited a few days more the causes of dissatisfaction among the people would be removed, and he would be without a cry for rebellion, and the people would not rise in his support. Does not that statement, in itself, prove that there would have been no rebellion at all had the Government acted earlier? (Loud cheers.) Could I give you plainer proof of their guilt than this—their own statement? If they had acted in 1882, in 1883, in the summer of 1884, in the fall of 1884, even if they had acted effectually in December of 1884, January, 1885, they would have acted late indeed, but yet in time enough to remove what they admit to be a main lever and help for Riel in the rising, the grievance which was left untouched in spite of petitions, but which was soon adjusted when the rebellion broke out. (Cheers.) What was the extent of this particular grievance? They say it was not very great in the district which was particularly disturbed, in which the rising took place. That has very little to do with the question. The danger never was confined to the case of the few men who rose. From them there could be no danger. The danger was great lest the Half-breeds generally should rise and join the cause led by Riel, and the danger was still greater lest the Indians also should rise. Now, the danger with reference to the Half-breeds generally was very great. How do I prove it? I prove it by the fact that this grievance to which I have referred was submitted to a Commission, and that Commission has since reported the cases of about\n\n1,700 INDIVIDUALS WHO WERE ENTITLED TO SHARE IN THIS CLAIM,\n\nor allowance for the extinguishment of the Indian title, and who had not received justice for all these years. I prove it by the further fact that there was an analogous and long-standing grievance in respect of those who were entitled to share in the grant made to the Half-breeds of Manitoba, but who were absent at the time, and were not enumerated, and of these nearly four hundred cases have been found. These two together make about two thou-\nsand cases of this class of grievance. That is a good many in itself, but when you reflect that the whole Half-breed population in the North-West, men, women, and children, was about 4,800, and of these about two thousand had long-standing and unredressed grievances of this class, the case becomes startling indeed. Take the population of Ontario, about two millions of people, and suppose that over 800,000 souls amongst our population had each one an individual grievance against the Government of a great many years' standing, and I want to know how peaceful and quiet, and contented and happy we would be. (Loud applause.) We would agitate, we would protest, we would be disturbed and discontented, and we should be unworthy of our name and of the position and liberties our forefathers won for us if we should sit perfectly quiet for years under absolute neglect without finding the first attempt made to remove the grievances of so large a portion of the population!\n\nGOVERNMENT'S GUILT PROVED FROM OFFICIAL DOCUMENTS.\n\nI can show to you from the papers and statements of these men themselves that there were grievances affecting a large portion of the Half-breed population; that the fact was known to them, and the importance of an early remedy was also known; that they asked for and received in 1879 full power to settle the difficulty; that they did not move at all until 1885; that they were asked again and again in the meantime to act; that they were warned again and again in the meantime of the danger of delay; that in June, 1884, Riel came in, and they were thus especially warned in time to have averted the danger; that they in some sort knew the danger of the situation, and thought it serious enough to justify them in taking away the militia service and establishing a special post of the Mounted Police; that notwithstanding all this, they did nothing to redress till 1885. In the Commons House of Parliament I have told these men face to face, that before God and man I hold them responsible for every drop of blood spilled, every pang suffered, every dollar of treasure spent, all our loss of reputation, all our blasted hopes, because of this rebellion; and what I said to them face to face I say to you today. (Loud and prolonged applause.)\n\nWell, Mr. Chairman and gentlemen, these are the men who come before you towards the close of their Parliamentary term and claim a renewal of your confidence. Will they ask it on the score that after you first gave them your confidence, and when they became connected with the North-West, they marked Canada's acquisition of that territory by a rebellion due to their mismanagement, and on the further score that towards the close of their second term they have by their accumulated\nmisdeeds and neglect produced a second rebellion in that country? (Cheers.) I say no more damning record of utter incapacity, absolute neglect, and complete forgetfulness of the duties and responsibilities of office can be disclosed than that which even the imperfect records we have relating to this unhappy affair sufficiently evidence. But we have not got it all! They are too wise to let us have it all. (Applause.)\n\nGOVERNMENT DARE NOT BRING DOWN THE WHOLE RECORD.\n\nThe day that news came that war had broken out in Canada, I called for papers on the subject. That call I have again and again renewed since then. From various sources I learned, on various grounds I conjectured, judging from the probable results of motives of duty and policy, I was sure there were communications from various persons pointing out the situation of affairs, particularly during the summer of 1884, and the fall of the same year. I called for these communications, but was told that at that time nothing could be given. I called again and again. At one time I was told there were not clerks enough to copy them, that it would take too much time, that I was too inquisitive, but that I would get them some later day. At another time I was told it was a monstrous request, for the rebellion would be aggravated by bringing them down. (Laughter.) Again I was told that I was a heartless, cruel man, asking that papers should be brought down when the bringing of them down would put the lives of missionaries and officials in peril. These papers, I charge, showed that the missionaries and officials had done their duty in warning the Government of the true state of affairs, and that the Government had neglected its duty in paying no heed to these warnings. I ask you, as sensible men, do you suppose that the lives of missionaries and officials would be put in peril by papers being brought down such as these? (Applause) They wrote to the Government saying:—Here is a grievance; the people feel it and are discontented; redress the grievance, and redress it quickly, or difficulty will arise. Of course, such a letter as that would strengthen, not weaken, the missionary or official who wrote it with the people, for they would say:—\"Here is a man who is alive to our situation, who admits that we have grievances, who calls for their settlement.\" Such a letter would not endanger its writer's life. I admit, however, that there would be danger in bringing down these papers, and that life would be imperilled. But\n\nTHE DANGER WOULD BE TO THE GOVERNMENT,\n\nand the life imperilled would be the political life of those untrustworthy stewards of your affairs. (Loud laughter and applause.)\nAnd so I went on asking until I was nearly as weary as they were. Towards the close of the session before last, after having made statements of many of the missing papers, I put a series of questions on the paper in which I inquired whether there were letters from this, that, and the other person. In some cases I was told there were, and in some cases that it was believed there were such letters, but the papers would be collected and laid upon the table at the beginning of the following session. When the session—that is last session—opened, I asked where the papers were.\n\nSir John Macdonald said:—\"If you will renew the question in a day or two I will in the meantime look up the report of the debates and let you know.\" (Laughter.) I asked again, but he told me that he had not yet had time to look the matter up. You see this matter was of no interest to him, and he had no doubt forgotten it. (Laughter.) I asked again, and he replied that really my demands of the previous session had been so numerous that he must ask me to go them all over again, and tell him what I wanted. I said in substance:\n\nThe record is there. Now I will tell you what I want. I want to know whether you acknowledge it to be your duty, and whether you intend to bring down any of the papers this session, having regard to the responsibility of the Government and the pledges they have made?\n\nHe replied:—\"We do.\"\n\nI asked \"When?\"\n\nHe said:—\"They are now in course of preparation.\"\n\nI waited for weeks and still could not get them. I then moved a resolution declaring that it was the duty of the Government to bring down all the papers relating to this matter without delay. They met that motion with a speech in which they pointed out all the papers that had been brought down, and suggested that no more could be expected or desired. I spoke again. I went over a large part of my own budget of the previous session, reading from the reports of the debates. Then one of them rose and said:—\n\nNow that the honourable gentleman has stated what he wants (all of which and more had been stated in the previous session) we will treat his speech as if it had been an order of the House, the papers will be prepared and brought down at the earliest possible moment.\n\nAND THEY'RE NOT DOWN YET.\n\n(Loud applause and laughter.) But they defeated my motion because a contending member on their own side of the House proposed as an amendment that, having regard to the declarations of the Government and their willingness to bring down all the papers, the House was satisfied, and the majority, composed largely of\nsuch men as the member for Gloucester (Mr. Burns), of whom I told you, carried that amendment. We moved for a committee of inquiry, I declaring in my place that I believed I could prove that there were important papers affecting the delay, neglect, and mismanagement of the Government in the North-West, and which were, or had been, in the archives, if I could get a committee to take evidence. But they voted that down, and would not give me the means of proving my words, nor would they bring down the papers.\n\nWHAT DOES ALL THIS SHOW?\n\nIf there was a dispute between two of your neighbours in which the proof afforded by certain papers in the possession of one was said to be important to make good the case of the other, and if he refused to produce those papers, would you say that that proved his innocence? (Laughter.) Not at all; you would say that was of itself strong evidence on the other side. The holder would be very glad to bring them forward if they helped his case and disproved his opponent's. (Applause.) \"Everything is presumed against him who conceals or destroys the papers.\" That is what the law says, and the principles of the law are, after all, founded on common sense. You presume the worst against the man who destroys the documents, because if they would not prove the worst he would rather have produced than destroyed them. I hope these documents, or the evidence of them, will yet see the light. I am afraid it will require great pressure, and that pressure will have to be applied by the electorate before we shall see the true inwardness of this whole matter. Partly from such reports as the Government were forced to bring down, partly from newspapers and other sources, I have gathered certain facts, and have laid them before Parliament and the people. These facts, some of which I have stated, are even now fully proven, and you can depend upon them. How much more there is to be learned, what greater mystery of iniquity is hid yet within those pigeon-holes you can only conjecture who see that in the face of all remonstrances, in the face of all their own promises, in breach of their public duty, the Government refuses to let them see the light of day.\n\nNow do not for a moment suppose that I have stated all the grievances and neglects, or even the chief grievances and neglects, affecting those who actually rose. I have not done so, nor does time allow. But grave grounds of complaint there were with reference to their surveys, their river fronts, the arrangements for their holdings, the reserves for colonization companies, and other matters; and gross neglect—the grossest neglect—there was no response to the letters, petitions, and remonstrances sent down by these poor people and their missionaries—some being never even answered,\nand the bulk shamefully delayed and ignored. The discussion of these grievances would require a speech. I pass them by for the present.\n\nNORTH-WEST INDIANS.\n\nAnother great source of danger to the North-West was the unfortunate condition of the Indian population. That population was numerous, it was warlike and trained to battle and combat of a certain kind—the Indian warfare. It was dissatisfied, irritated, discontented, because it also had been miserably misgoverned, because the liberal appropriations which Parliament had made (adequate, so far as I can judge, with the most moderate exertions on the part of the Indians themselves, to sustain them with reasonable comfort) had been so applied, or rather, so misapplied, or were so left unused, that THE INDIANS WERE IN LARGE NUMBERS STARVED, and in greater numbers half-starved. For the official reports show you the cases of numbers of those people, some mere children, people of tender years, actually dying of starvation; and others of disease engendered or accelerated by famine. It has been shown that it was the policy of the Government to coerce the Indians into such action as it thought right by reducing them from rations to half-rations; and from that to quarter-rations, and I don't know how much lower, in order to starve them into removal. The Indian is very different from the white man in many respects. The habits of his life have led him to be improvident, and he gorges himself when he has a supply of food, and abstains very patiently when he can't get it. When you reflect that these half or quarter-rations are distributed weekly, or two or three times a week, to the head of the family, you can easily see, judging from the character of the Indian; what the result was likely to be. The starvation rations given out were eaten at once, and perhaps they were eaten by the buck, and the squaw and papooses were left absolutely to starve. This was done in some cases without any cause whatever. The food supplied was also unsuitable, and produced disease and death. There were other courses pursued of immorality and wickedness, to which, before a mixed audience, I dislike to allude, but which were certain to produce the worst results. The\n\nWHOLE STORY IS HUMILIATING.\n\nA national sin has received a retribution. The Indians were so misgoverned and mismanaged that they were ripe for revolt. And the Half-breeds, who should have been our influence for good, had also, as I have shown you, been alienated by neglect, delay, and mismanagement. It was under such circumstances that Riel came\nin, and under such circumstances that the Government remained inactive during 1834.\n\n\"WHAT ABOUT RIEL?\"\n\nI shall now, with your permission, answer the question put me by a gentleman in the audience, \"What about Riel?\" I did not answer that question then, desiring to finish what I had to say upon the subject I was treating; but I am ready to reply. The Reform party, although they believed that there had been on the part of the Government great neglect, misgovernment, and delay, felt it to be their duty, while the rebellion was afoot, to assist the authorities of the country in the suppression of the revolt against law and in the restoration of peace and order. They felt it their duty emphatically to do so, having regard to the critical condition of the country, due to the Indian population. It was that fear of the Indians, the knowledge of the danger to those in isolated settlements, that induced us finally to say to the Government: \"Go on; you know the danger, you keep information on this question to yourselves, you say you can't tell us; all right, don't tell us, but take all the men you say you want.\" Take all the arms and supplies necessary. We vote them freely; we will help you as far as we can so that order may be restored and the settlers saved.\"\n\nORDER WAS RESTORED\n\nand then came the process of the law against the rebels. You remember how, during the outbreak, the Government charged the white settlers of Prince Albert with being the most criminal persons in connection with this rebellion. And when the trials came on they sent instructions to their counsel that amongst the most important things they had to do was to ferret out this matter, find those wicked whites, and bring them to trial and punishment, for they it was who incited the Half-breeds to revolt, and they deserved a severer sentence than the others. No doubt the Government employed able and trustworthy counsel. No doubt those counsel did their duty. But they were enabled to find only two or three whites who were men worthy of being brought to trial. One of them was concerned, but, being insane at the time, he was acquitted; and one was found not guilty, nothing whatever having been proven against him. There were none others fit to be even brought to trial. They put thirty or forty Indians and about as many Half-breeds on their trial, and they put Riel upon his trial also. The question whether Riel was properly submitted to the extreme penalty of the law created great excitement. I was, at that time, not in the country. When I returned I found\nI found an effort being made to create national, race, religious, and party issues upon this question. I found the Toronto Mail, for instance, declaring that the whole French and Catholic population were going one way on grounds of nationality and creed, and were to attack the Government because a Frenchman and a Catholic had been executed, and calling upon all other races and creeds to support the Government, and so, forsooth, to put down this national and religious cry.\n\nSAID THAT A QUESTION WHICH INVOLVED THE ADMINISTRATION OF JUSTICE, A QUESTION WHICH INVOLVED NATIONALITY AND RELIGION, SHOULD NEVER BY MY CONSENT OR BY MY INFLUENCE, OR IF I COULD PREVENT IT, BE MADE A PARTY QUESTION AT ALL. I want the administration of justice to be discussed, as I want all questions which may touch religious or national feelings or prejudices to be discussed apart from party bias, so that no consideration of party zeal may influence us to do things that would tend to impair the administration of justice, or to inflame religious or national passions or prejudices. (Cheers.) For myself, and for my party as its leader, I gave my pledge that when that question came up it should be considered and voted on by us as each man, after patient attention to the attacks upon the Government on the one hand, and the defence of the Government on the other, should deem in his heart and conscience it was right and proper to vote, and that we would not attempt to form any party connection. I declared that upon it we would be, as I believed, divided in opinion, and would vote according to our individual opinions. On the other hand I declared that\n\nTHE WICKED ATTEMPT OF \"THE MAIL\" AND THE OTHER TORY ORGANS TO RAISE A NATIONAL AND RELIGIOUS ANTI-FRENCH AND ANTICATHOLIC CRY,\n\non the representation that all the French and Catholic members would vote against the Government, was based on a mis-statement. I stated my conviction that with them, as with the Reform party, opinion was divided; and I assured the people that the cry of the Government in danger was only a device to entrap and excite portions of the people into a disastrous war of race and creed: As I said, so it was. The Liberal members made no party connection, gave no party vote; each man voted perfectly freely and as, in his conscience, he thought right; and we were about equally divided. It was\nA DIFFICULT AND COMPLICATED QUESTION.\n\nI would like to discuss it before you at length, but, for want of time, I am compelled to deal with only some of its phases, and in a few words. The main point in my mind was this: Was the man intellectually in such a condition that the extreme penalty of the law should be inflicted? Our law for all crimes recognizes a great distinction between the moral guilt of men, even though they commit what is known to the law as the same crime. The degrees of provocation, of premeditation, of imbecility, or insanity, are among the elements taken into consideration as affecting the moral guilt and the consequent punishment. In all crimes known to the law, except one, the weight to be given to these considerations is decided by the judge. If you have attended the assizes as jurymen or witnesses, you have probably seen two men convicted on different days of the same legal crime. At the close of the assizes the judge sentences both, and in one case he may send a man to the penitentiary for fifteen years or for life, and another guilty of the same legal crime he may send for three days to gaol. IF THEY WERE CONVICTED OF THE SAME CRIME, WHY NOT GIVE THEM THE SAME SENTENCE? Because, though the crime was the same, the moral guilt was different, and what would be only adequate punishment in one case would be far too severe in another. Out of 279 sentences which do not affect the life of the prisoner, and in which the judge apportions the punishment to the crime, only one is in practice altered by the action of the Executive. This is because the judge has apportioned the penalty; but in the capital sentence the judge, under the law, is bound to pronounce not the appropriate sentence but the extreme sentence of the law, and the duty he discharges in other cases is handed over in this case to the Executive. It cannot be contended for a moment that there may not be as many shades of guilt in murder as in assault or robbery. The consequence of this distinction is that one out of every two capital sentences instead of one out of 279, is commuted in Ontario and Quebec. In England less than half the men sentenced to death are really executed. Why? Because the Government is bound to consider each case and to decide, as the judge does on other cases, on the extent of responsibility and of moral guilt. NOW THIS MAN HAD BEEN CERTAINLY MAD. That is disputed, by no candid man. HE HAD BEEN IN THREE LUNATIC ASYLUMS. HIS DELUSIONS WERE PROVED AND KNOWN. If I had time to tell you of those delusions, you would see that they were such as no sane man could hold. He recovered and was discharged from the asylum. The rule is, as established by experience, that three persons out of four who have once\nbecome insane either continuously insane or become insane again. The probabilities were therefore that, though he had recovered, insanity would at some time manifest itself in him again. He was proved to have suffered under the same delusions, the same aberrations of intellect, in the North-West, as he had suffered under when in the asylum, and under others also. I came to the conclusion, and I believed as clearly as I believe I am standing here today, that\n\n**HIS INTELLECT WAS SERIOUSLY DISTURBED**\n\nand unbalanced, that he was insane. Having been myself a Minister of Justice, having years before been called upon to discharge perhaps the most solemn and painful duty that can be laid upon a man—practically upon my own responsibility to determine whether a fellow-creature's life should end on the gallows, or whether it was compatible with or due to the interests of justice and the good of society that he should suffer the secondary punishment of imprisonment for life—it became my duty then to consider these questions in relation to the principles which underlie them years before this case occurred. I came to the conclusion then that where a man's intellect was seriously unsettled, though he might have some responsibility, and though the interests of society might require his punishment, I ought not, as Minister of Justice, to advise that such a one should be consigned to the scaffold, that I might send him to the penitentiary, and then, according to circumstances as they developed, let him remain there or remove him to a criminal lunatic asylum for his life. I applied the conclusions thus reached years before, after careful thought and study, to the facts before me, and saw that I could not honestly vote in favour of any decision but that the **SENTENCE OF EXECUTION OUGHT TO HAVE BEEN COMMUTED**—not that the man should be pardoned as so many have wrongly declared I said. I said that the man was guilty. He had, as the jury found, sufficient intellect to be properly declared guilty, but a secondary punishment ought to have been substituted for the extreme one of death. (Applause.)\n\n**THE VERDICT DID NOT SETTLE THE QUESTION.**\n\nThe Government seem to have concluded that the verdict settled the question. It did not. Our law requires, in order to an acquittal on the ground of insanity, that the jury should be satisfied that the prisoner is so insane that he does not know right from wrong. I will not give you the other technical distinctions. This is enough for the occasion. This, then, is all the verdict proved. But the great bulk of the lunatics in the asylums do, as any doctor will tell you, have a knowledge of right and wrong, and therefore\nthere remained matter for enquiry by the Executive. Though not so insane as to be entitled to a verdict of not guilty, was he of such disordered intellect as not to be a fit subject for the gallows? To put it as a great English judge described the case of a committed murderer,\n\n\"THOUGH NOT MAD ENOUGH TO BE ACQUITTED, HE WAS OBVIOUSLY TOO MAD TO BE HANGED.\"\n\nThat is my firm belief. But the Government deliberately decided not to enter on that question, and they claim that the verdict settled it. They are wrong in law, they are wrong in justice, they are wrong in humanity, and the principle they applied cannot, as I believe, be supported. The execution, then, was on this ground, as I thought, a blow at the administration of criminal justice. Other important points there were—points of the greatest gravity, but for their discussion there is no time, and I must pass them by. I voted then to regret the execution. I never gave a vote with so much pain in my life. The vote could do us no good, so far as the man was concerned. It was not a question of saving his life, for the man was dead. I knew, also, that a large number of my own friends were inclined to a conclusion, on information, as I believed, one-sided and inadequate, different from my own. I knew that many, whose judgment I value highly, thought differently from me. I knew too, that there was a cloud of passion,\n\nA MIST OF PREJUDICE ABOUT THIS CASE,\n\nwhich was likely to prevent the formation of a sound and unbiased judgment among the masses of the population. I felt, however, that there was a principle at stake. I decided to give such a vote as would, in my belief, commend itself to the calm consideration of future years, perhaps of future generations, when that cloud of passion and prejudice should have rolled away. (Hear, hear.) I knew my conclusion would be unpopular. I was aware that it would lose me strength. I should have been glad to have done nothing which would shock the prejudices or affections, still less anything which would oppose itself to the judgment of honest, honourable, high-minded men with whom I had worked so long, and with whom it may after all be my fortune to co-operate in the future. But, as I said the other day to my own constituents, highly as I valued their mandate to represent them in Parliament, they would demand of me too high a price even for that great honour if, as a condition of continuing it, they should call upon me to sacrifice my convictions in order to satisfy their opinions. I understand that what they sent me there for was this—to act in general accordance with the great Liberal princ-\nples which they and I hold in common, and in all particular instances to endeavour to apply these principles; on every question to ascertain the facts of the case, to discover the law applicable to those facts; to strive to reach a sound conclusion as to what justice and the public interest required, and to vote accordingly, no matter whether I voted with or against their views; to take the consequences, whatever these might be, but in no case to violate my convictions. That was my duty; not from fear of incurring their displeasure, to give a vote which did not commend itself to the heart and head with which I was called upon to serve them to the best of my poor ability. (Cheers.) Knowing, then, that it would be distasteful to valued friends who were allied with me, while I would have been very glad to have given a different vote, could I have done so honestly, I GAVE, WITHOUT HESITATION, THE VOTE WHICH CONSCIENCE CALLED UPON ME TO GIVE, AND I ASK YOU NOW WHETHER IT WAS BETTER SO TO VOTE, OR TO VOTE AS SOME OF YOU MIGHT HAVE WISHED, AND AGAINST THE MONITOR WITHIN. (Loud and prolonged cheering, and voices, \"You did right.\")\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001575.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 52, "total-input-tokens": 70128, "total-output-tokens": 28128, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 393, 2], [393, 2665, 3], [2665, 4643, 4], [4643, 7291, 5], [7291, 10028, 6], [10028, 12417, 7], [12417, 15223, 8], [15223, 17506, 9], [17506, 20055, 10], [20055, 22520, 11], [22520, 25050, 12], [25050, 27612, 13], [27612, 29853, 14], [29853, 32376, 15], [32376, 34986, 16], [34986, 37691, 17], [37691, 40136, 18], [40136, 42571, 19], [42571, 44831, 20], [44831, 47473, 21], [47473, 50051, 22], [50051, 52773, 23], [52773, 55166, 24], [55166, 57751, 25], [57751, 60440, 26], [60440, 62764, 27], [62764, 65443, 28], [65443, 68056, 29], [68056, 70858, 30], [70858, 71307, 31], [71307, 72851, 32], [72851, 75497, 33], [75497, 78058, 34], [78058, 80604, 35], [80604, 83536, 36], [83536, 86069, 37], [86069, 88683, 38], [88683, 91436, 39], [91436, 94097, 40], [94097, 96850, 41], [96850, 99524, 42], [99524, 102113, 43], [102113, 104897, 44], [104897, 107466, 45], [107466, 110022, 46], [110022, 112383, 47], [112383, 115128, 48], [115128, 117813, 49], [117813, 120438, 50], [120438, 121579, 51], [121579, 121579, 52]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]