[{"id": "41aa6a8de6a339b4e1e9481f58b924248e474e1c", "text": "IMPORTANT INFORMATION\n\nFOR\n\nINTENDING SETTLERS\n\nIN\n\nMANITOBA,\n\nRESPECTING\n\nA QUARTER OF A MILLION ACRES OF SELECT FARMING\n\nAND STOCK-RAISING LANDS\n\nIN THE COUNTY OF MINNEDOSA,\n\nLITTLE SASKATCHEWAN.\n\nBY\n\nNICHOLAS DEVEREUX ENNIS.\n\nLIVERPOOL.\n\nPRINTED BY TURNER AND DUNNETT, 4, JAMES STREET.\n\nMDCCCLXXXII.\nIMPORTANT INFORMATION\n\nFOR\n\nINTENDING SETTLERS\n\nIN\n\nMANITOBA,\n\nRESPECTING\n\nA QUARTER OF A MILLION ACRES OF SELECT FARMING\n\nAND STOCK-RAISING LANDS\n\nIN THE COUNTY OF MINNEDOSA,\n\nLITTLE SASKATCHEWAN.\n\nBY\n\nNICHOLAS DEVEREUX ENNIS.\n\nLIVERPOOL.\nPRINTED BY TURNER AND DUNNETT, 4, JAMES STREET.\nMDCCCLXXII.\n## Contents\n\n**Map of the County of Minnedosa**\n\n| Topic                                                                 | Page |\n|----------------------------------------------------------------------|------|\n| Introductory Remarks                                                 | 5    |\n| What Men in Authority Have Said About the North-West                 | 7    |\n| Manitoba and Dakota—A Contrast                                        | 13   |\n| Minnedosa—Its Growth                                                 | 14   |\n| Rapid City—Its Growth                                                | 15   |\n| A Good Average—Land Office Return—Go West, Young Man                  | 19   |\n| General Hints to Settlers—Wages Paid Skilled Artisans, and Others     | 20   |\n| House Building—Management of Stock—Mixed Farming—Breaking the Land    | 22   |\n| Descriptive Catalogue of each Township in County Minnedosa, with Special Reference to Hudson's Bay Company's Lands | 25   |\n| A Year's Experience in the Little Saskatchewan, by an Englishwoman    | 35   |\n| Letters from Early Settlers                                          | 37   |\n| Correspondence                                                       | 44   |\nMANITOBA.\n\nPublic attention having been called a good deal of late to Manitoba, both as an outlet for the superfluous bone and sinew of the mother countries, and as a wheat-producing Province of unlimited capacity, this pamphlet, based on three years' personal experience, may not be unacceptable to intending emigrants and those interested in Manitoba as a farming and stock-raising country. But it is not with the whole Province I am about to deal. I have selected the County of Minnedosa from this vast territory, and purpose placing on record in the early stage of this country's life, facts certified to by disinterested men.\n\nIt is not my purpose to go into unnecessary details, but rather to recount facts concerning, and opinions held by many fully qualified to give unmistakable and reliable evidence of, the resources of this new country. The Little Saskatchewan district is eminently adapted to the support of a very large population, and capable of producing immense supplies of Wheat, and that it is also suitably adapted to the raising of Stock there can be little doubt.\n\nMr. Alexander Begg, in his \"Guide to Manitoba,\" published in 1878, condemned the idea of inducing emigrants to go to the North-West—i.e., west of the then boundary of Manitoba—in advance of civilization, and before proper means were opened up to that vast country. \"But,\" Mr. Begg says, \"It must not be understood, however, that we have any desire to belittle the Saskatchewan country, on the contrary, we are of opinion that in the near future, that great territory will afford homes for thousands of hardy and industrious farmers; and we are also aware that as far as climate, soil, and other advantages are concerned, the Saskatchewan is equal to Manitoba.\" That near future has arrived, the Little Saskatchewan district is now annexed to Manitoba, and the annexed portion is already dotted with homestead buildings and rising towns, is crossed by the Canadian Pacific Railway, and Manitoba—in this newly acquired territory—possesses the most fertile land west of the Red River Valley.\n\nThe County of Minnedosa comprises 36 townships of 36 square miles each, in block, bounded on the east by range 16; on the west by range 23; on the south by township 12; and on the north by township 19, west of the principal meridian.\n\nThe County is represented by one member in the local House of Parliament at Winnipeg, further elections follow immediately of Warden, Municipal Councillors, &c., and the election of a Member to the Dominion House of Parliament at Ottawa takes place early in the new year 1882: So that this district, which three years ago was a \"howling wilderness,\" so to speak, has now a population of nearly 2,000, is on the \"high road\" to receive those benefits from provincial and local legislation, such as the establishing of schools and colleges, the making of roads, and the introduction and enforcing of those laws so necessary to promote the peace and security of a new country.\nThe progress of this part of the Province of Manitoba must naturally be much more rapid than that of any other part of the North-West Territories. It has all the advantages of a new and magnificent country—the natural resources of which are unbounded—of a rapidly increasing population, consisting of immigrants enterprising and energetic. The rapid construction of the Canadian Pacific Railway under the Sir John A. Macdonald administration, has done much to attract settlers; one year ago there was only a few miles of railway west of Winnipeg, now it crosses the whole Province; over two hundred miles having been constructed in about six months, or at the rate of $1\\frac{1}{2}$ mile of line per day, a fact which proves the resources this country possesses in material for railway construction alone. Another year and the County of Minnedosa will probably be crossed by two railways.\n\nThe value of manure in this country is nil. Chemistry as applied to the soil is needless, geology comparatively so, and meteorology, as yet at least, can be dispensed with.\n\n\"The Indians have now vanished from their old hunting grounds,\" appearing only at certain seasons for the purpose of hunting deer, Muskrat and Mink. \"Where the Indian so recently maintained a precarious existence, there are populous villages, fast merging into towns, the clink of the hammer is heard in the forge and the rush of the stream from the mill-dam tells of agriculture and commerce. The Indians themselves have become labourers, they have been removed to large reserves, and have been raised into the dignity of cultivators, many of them have houses in place of wigwams, they have schools and churches, they have, in short, been adopted into the great family of civilized man.\"\n\nA letter written by ex-Governor Seymour, of New York, to Senator Beck, of Kentucky:\n\nMr. Seymour not long since visited Manitoba, and went about two hundred miles west of Winnipeg; and in his letter to the Kentuckian senator he relates what he there witnessed, \"I saw,\" he says, \"thousands and thousands of acres of wheat, clearing 40 bushels to the acre, weighing, 63 and 65 pounds to the bushel, and was assured by undoubted authority that on Peace River, 1200 miles north-west of where I was, wheat was being produced in, immense quantity equal to the best I saw in Winnipeg, while great herds of cattle were being fed without cost on as fine grassy lands as the world affords. In short, between our north-western line of 45 degrees and 54 degrees 40 mins. there is a country owned by England with greater grain and stock growing capacity than all the lands on the Baltic, the Black Sea, and the Mediterranean combined. The land laws of Canada are now as liberal as ours as to the homestead pre-emption and pre-claims. People are crowding there rapidly, and towns are springing up as if by magic.\" These facts are not novel to Englishmen, but they come with special force in the writing of a distinguished American, who has no interest in \"cracking up\" the resources of the British Empire.\n\nNo more prosperous and rapidly rising centre is to be found in Manitoba than Minnedosa.\n\nN. D. E.\nIMPORTANT TO INTENDING SETTLERS IN MANITOBA.\n\nThe Bishop of the Diocese of Rupert's Land, at the Meeting of the Synod on November 24th, 1880, at Winnipeg, spoke as follows:\n\n\"Let me review what has passed before our eyes in the past ten years. Then there was only one village in the country with about three hundred of a population. There was scarcely a house a quarter of a mile from Red River or the Assiniboine River. To-day we have a country 120 miles in breadth by 200 miles in length, covered with small settlements, being dotted over with homesteads—and yet this country is but the gateway to the vast region of fertile land beyond. The village of 300 people has become a city of 12,000 inhabitants, with a business that is perhaps only exceeded now by six or eight cities in the whole Dominion. A year ago the duties paid on imports made Winnipeg the eighth city as a port of entry in Canada. But a year has done much in Winnipeg. This past year has seen nearly three hundred houses wholly or partially built, at a cost of nearly a million of dollars. In 1870 there were established nineteen post offices. There are now nearly one hundred and fifty. If we measured our progress by the common schools we should find a like result. But we know the life and growth of this country are yet scarcely commenced. We have heard of many going to Dakota. Why is this? There is not better land there than here. There is not a better climate. There are not, I am certain, better—I doubt much if there are equal—educational advantages there. I believe the main reasons to be that these parts of the States have been hitherto nearer emigration and open easily to railways. But we understand that this country will shortly have the fullest railway connection. The railway to Lake Superior for over four hundred miles to the east of us is to be finished within a year from next July. In two years more the railway is to be carried across our fertile prairies for nearly eight hundred miles to the west of us, to the Rocky Mountains. We know what that means. It means that we must look for an ever-increasing emigration.\"\n\nOn the occasion of the next Annual Synod, held at Winnipeg, on the 23rd November, 1881, the Bishop addressed his hearers as follows:\n\n\"When I addressed the last meeting of Synod, I spoke of the rapid growth of the country, the changes this growth was bringing with it, and\nthe deepening responsibility of our position. But the past year has not only witnessed a greater progress still—a progress beyond our past experience—but a progress beyond all expectation. This progress has not been so much in the additional immigration, considerable as that has been, as in the rise in the value of land in Winnipeg and other places, and in the growing appreciation with which the country is being regarded by ourselves and others. The vast railway works that are being carried on have, no doubt, had most to do with these results; but other circumstances have helped. We have had an excellent harvest. We had in the past summer most enjoyable weather. The inconveniences felt by travellers during the wet seasons of the previous years have been unknown. Most visitors have been, therefore, enabled to see the land properly, and have uniformly carried away the most favourable impression. Among those visitors we had the pleasure of welcoming His Excellency the Governor-General, and it is a satisfaction to know that he and his fellow-travellers after seeing for themselves a great deal of the country, were fully convinced of its vast resources and magnificent prospects.\n\nBut great as has been the progress of the past year, we are evidently only at the opening of a great future. Winnipeg by the close of next year will be the centre of a network of railways. The great Pacific Railway, which is daily being carried further west over the fertile prairies of this land, is by the end of next year to be 600 miles west of Winnipeg, and in another year at the base of the Rocky Mountains. The coming year will also see Winnipeg connected on the east with Lake Superior by railway. Other railways are being constructed in various directions. We may well count on an immigration far beyond our past experience. How can it be otherwise? We have the finest land for the production of wheat, both as regards soil and climate—ready for the plough—practically unlimited in quantity—with railway conveniences—and obtainable for nothing or for a comparatively trifling sum. These facts need no comment. They have a deep meaning which I suspect most of us, even in the midst of them, but dimly take in. They should speak home to every thoughtful Churchman. I cannot think there has ever been in a British colony any such promise of rapid development. The circumstances can only be compared to what has happened in the Western States. We still hear of colonies of Englishmen to the United States—but when we think of the order in this country—the unquestionable supremacy of the law, equally with white and Indian—the observance of the Lord's Day—the efforts, entirely, I believe, without precedent, made by the various religious bodies to afford the opportunities of worship to the new settlements—the colleges and the educational system of the Province—I cannot but think that there will soon be an end of these colonies, and that our countrymen will be naturally drawn to our own land.\n\nI am advising the society to give the grant that has been hitherto given to Headingly, to a district of which Gladstone would be one centre. I have for years been endeavouring to obtain a grant for this district from the Colonial and Continental Church Society, but from want of\nfunds they have not been able to do this. Indeed, there grant to this diocese was reduced this year by £25. I am not, however, certain, till inquiry be made, under what circumstances the church would now enter this district. With so many districts unprovided for we must select those where we shall be met by substantial help. Failing Gladstone, there could be an important district formed partly out of the present Rapid City district with Minnedosa as one centre. I hope, however, in view of the great extent of country being settled, the society may arrange for our having another grant, so that we may have both districts. We have a clergyman in view as the missionary.\n\nThe Rev. G. Turnbull, who resides in the Rapid City district, is to have an allowance for partial services. The Rev. W. A. Burman, of the Sioux reserve, may also be able to render some help to the settlements near his reserve. A new church has been opened at Rapid City. There is a large district containing Beaconsfield and other places where there are many earnest churchmen. There have been two readers in this district deserving of our best thanks. One of them, Mr. Dobbs, has been holding services regularly at four different centres, and the other, Mr. Ashby, at two. Several visits have been paid to the district by Mr. Jukes and Canon Grisdale. A grant in aid has been guaranteed to us through the Rev. W. S. Rainsford, from St. James' Cathedral, Toronto, and it has been assigned to this district. The appointment of missionary is to be offered to a clergyman of the diocese of Huron.\n\nIt has been proposed to place a missionary at Quebec to receive the coming immigrants. I have no doubt that, if there was only one such missionary, the place of all places for him would be the new districts of the west. There will be a railway to them from Winnipeg. In the case of any large body of immigrants arriving together, he could meet them at Winnipeg or whatever place should be the end of their journey.\n\nHis Excellency, the Marquis of Lorne, Governor-General of Canada, in replying to an address at Quebec the other day, spoke as follows:\n\n\"That national life will now be confined to no narrow geographical bounds. The distant rivers and noble countries first explored by your pioneers now await you. No one that has seen that great and fertile portion of this continent can with a good conscience speak any words but those of praise of its soil, its climate, and its facilities for communication. Let the sons of each of Canada's old provinces join with the old world emigrant in going forth to possess it. Its treasures are now becoming well known, all take a deep interest in it, and none more so than our Queen.\"\n\nDuring his visit to Winnipeg, the Governor-General of Canada was entertained by the Manitoba Club on the 11th instant, before starting for Ottawa. Replying to the toast of his health, his Excellency, in the course of a brilliant speech, said:—\"We see Winnipeg now with a population unanimously going in happy concord and rapidly lifting it to the front rank among the commercial countries of the world. We may\nlook in vain elsewhere for a situation so favourable and so commanding as that of the fair regions of which we can boast, the measureless meadows which commence here and stretch, without interruption of their good soil, westward to your boundary. The province is a great sea over which the summer winds pass, with rich grasses and flowers, and on this vast extent it is only as yet here and there that a yellow patch shows some gigantic wheat field. Like a great net cast over the whole area, are the bands and clumps of poplar which are everywhere to be met, and which, no doubt, when prairie fires are more carefully guarded against, will, whenever they are wanted, still adorn the landscape. . . No wonder that under these circumstances we hear no croaking. Croakers are very rare animals throughout Canada. . .\n\nThe few letters that have appeared, speaking of disappointment, will be amongst the rarest autographs which the next generation will cherish in their museums. . . Favourable testimony as to the climate was everywhere given. The heavy night dews throughout the North-West keep the country green when everything is burned to the south, and the steady winter cold, although it sounds formidable when registered by the thermometer, is universally said to be far less trying than the cold to be encountered at the old English Puritan city of Boston, in Massachusetts. It is the moisture in the atmosphere will make cold tell, and the Englishman who, with the thermometer at zero, would in his moist atmosphere be shivering, would here find one flannel shirt sufficient clothing while working.\"\n\nMr. Laidlaw has said:—\"Just think of it, a man can earn the fee simple of an acre of land, ready for the plough, that will grow 40 bushels of wheat to the acre for every day he works next season. The settler can get about a pound sterling per day for a pair of horses and a man, as soon as he gets his tent pitched or house built, and the labouring man can get six or seven shillings per day on the railway works as soon as he can get his \"dunnage\" off the train. Compare the future prospects of the people on the shores of the St. Lawrence, in those fishing hamlets away down to the gulf, with those of the emigrants on one of the Allan ships bound up past them for land in the North-West! A man out of every house down there should start for his new homestead with the spring.\"\n\nThe following is an extract from Sir John A. Macdonald's speech, delivered at Toronto, 23rd November, this year, 1881:\n\n\"We believe the land is capable of receiving every settler we can get, and giving him a full grant, and at the same time of allowing us to sell a sufficient quantity to repay every cent, that the four old provinces of Canada ever expended, or will expend, in opening up that country and in building the railway. We are going religiously to hold to the homestead and free grant system of giving every head of a family and every man of eighteen years and upwards, upon his becoming a settler, 160 acres of as fine land as the sun ever shone upon. All he has got to do is to settle upon and work it, and after three years' occupation, if he\nbuilds a house (and we will not be particular as to the size and quality), and has cultivated a reasonable portion of the soil, he gets his patent free, and will stand one of the freeholders of this great country of freeholders. (Cheering.) We are going to aid colonization companies who show they have the capital, that they mean business, and that they do not intend to become mere middlemen and to speculate at the expense of the immigrant by holding the lands at a high price. We will, I say, assist such companies who will give the necessary guarantees to the Government that they are in earnest, and that they mean to bring the immigrant and put him on the land. (Cheering.) Then, gentlemen, we are going to sell certain portions of that land, and fund the proceeds, and out of those proceeds we are going to pay the interest, and ultimately the principal, of every dollar that the Dominion of Canada has expended or will expend in building the railway and developing the country.\n\nThe following is a summary of Mr. Biggar's opinion of Manitoba:\n\n\"As Manitoba is only the beginning of the immense extent of fertile country which extends to the foot of the Rocky Mountains, we can hardly do more than say that we have had our foot in the north-west. The British possessions in North America are larger than the whole of Europe, and larger than the United States, without Alaska; and as the wheat region through which the Canada Pacific Railway will pass is estimated to contain 160 million acres, the Canadians may well be enthusiastic over their possessions. None of the delegates went west of Rapid City, but the country south to the Assiniboine is reported good dry land, water good, and timber scarce. At Shoal Lake, forty miles north-west, the land is similar, and on to Fort Ellice and the Touchwood Hills. At Edmonton, 850 miles the land is said to be undulating and of the finest description, and those who have visited the Peace River describe it as the finest country of the whole, and say that notwithstanding its high latitude it grows wheat well, while, owing to its situation on the east slope of the Rocky Mountains, the climate is much milder than in much lower latitudes. But I may say that while it is in the same latitude as Scotland, the summer is similar to that of Belgium. The land is surveyed in sections of a mile square, or 640 acres; half of these sections, corresponding to the white squares of a draught board, are reserved as railway lands, and sold at fixed prices according to distance from the line of railway. The sections corresponding to the black squares are reserved as free grant lands, each settler receiving 160 acres on payment of a nominal sum, and with power to buy 160 more on easy terms, the price varying from $1 to $2½ per acre. On the whole, Mr. Biggar was favourably impressed with Manitoba. No one could doubt that there was a great future before the country.\"\nOUR PROSPEROUS FARMERS.\n\n*Rapid City Standard, Dec. 2nd, 1881.*\n\nA great deal has been said of the excellent crops reported on every side this year, but of course no adequate idea of the prosperous condition of our farmers could be obtained until the threshers had been their rounds. In this neighbourhood nearly all the grain has now been threshed, and the large estimates formed of the yield have been verified in almost every case. The gentlemen who went through the country on Monday and Tuesday last, in order to ascertain the feeling of the settlers in regard to the municipal election, all bring back similar accounts of the prosperity and contentment existing among our farmer friends. In every case where there has been an ordinary amount of energy put forth the return has been most encouraging. Farms that would be considered small in Ontario—that is so far as the broken or cultivated part is concerned—have yielded one thousand bushels of all kinds of grain, while there are many larger ones whose owners have two thousand bushels and upwards as the result of a season's work. In addition to all this there has been a very profitable return in vegetables, some of the potato crops running as high as six hundred bushels to the acre. The gentlemen referred to had occasion to call at a large number of houses and not one has a word of discontentment to report. Most of the people having been in the country two or three years, the first and worst hardships of pioneer life have been overcome. Instead of the low-roofed shanty we see comfortable log houses and warm stables and cattle sheds, while very frequently the forethought of the settler is shown in a belt of native trees planted around the house and garden, so as to form a partial shelter from the keen winds of winter and a beautiful shade from the sun's scorching rays in summer. To one who has had an opportunity to watch the gradual development of a new settlement in the backwoods of Ontario, the astonishing result of less than four years' work in this neighbourhood is almost incredible. It proves beyond a doubt that men possessing a very small amount of the energy and determination requisite to overcome the hardships of pioneer life in the backwoods, may come here, and for a couple of years' industry and perseverance, obtain what would cost them many years of hard labour in a country less favourably situated. There is no weary and toilsome chopping and stumping to be done here. The rich virgin soil, already cleared, yields readily to the plough, and the settler may, if he arrives early in the spring, have a crop the first year sufficient to meet a large part of his expenses. We have in the Little Saskatchewan district men who have lived in all parts of the world, and it is the opinion of one and all that no other country on the face of the globe offers such advantages to the emigrant as are offered by Manitoba and the North-West, and certainly the general prosperity and contentment prevailing in your midst leads us to conclude that they are right.\n\n*The Rapid City Standard and North-West Advocate is published every Friday, contains the latest news from the East, and is ably edited by Mr. W. Gibbons, late of the Ottawa Citizen staff.*\nMANITOBA AND DAKOTA.\n\nCOMPARATIVE ADVANTAGE FOR SETTLEMENT.\n\nIn a letter to the London Times of October 20th, a correspondent institutes a comparison of the advantages which Manitoba and Dakota offer to the emigrant from the old world. After quoting at some length from letters of settlers in the two provinces, the correspondent proceeds:\n\nGranting that both Manitoba and Dakota are equally well adapted for settlement, there is a consideration which emigrants from Great Britain and Canada to the latter ought to bear in mind. In Manitoba, any citizen of the British Empire who is the head of a family, or who, being a male, is 18 years of age, can obtain a homestead of 160 acres on paying an office fee of $10, cultivating a part of the land during three years, and erecting a dwelling upon it 18ft. long and 16ft. wide. The settler may be absent from his homestead for six months in each year out of three, while, if his family remain on and cultivate it \"to a reasonable extent,\" he may be absent during the whole term. He has a right to pre-empt another 160 acres—that is, become the absolute owner of the land at a price varying from £36 to £84, payment being made in instalments spread over six years, and he may also obtain 160 acres conditionally on paying the office fee of $10 and planting a certain portion of the land with trees during the term of three years.\n\nIn Dakota and all other parts of the United States where Government land is unoccupied a settler who is the head of a family, or who has attained the age of twenty-one, can obtain 160 acres under the Homestead Act. He must pay a fee of $20, erect a house on the land 18ft. by 16ft., cultivate a part of it during five years, and not be absent from the homestead for six months consecutively. The provisions about pre-empting an additional 160 acres are substantially the same in Canada and the United States. In both an alien must become naturalized before participating in the benefits of the Homestead Act.\n\nAn alien, if a citizen of the British Empire, who desires a homestead in Dakota begin by making the following declaration on oath:\n\n\"I, A. B., do declare on oath that it is bona fide my intention to become a citizen of the United States, and to renounce for ever all allegiance and fidelity to all and every foreign Prince, Potentate, State and Sovereignty whatever, and particularly to Victoria, Queen of the United Kingdom of Great Britain and Ireland.\"\n\nAt the expiry of five years, and before the alien can obtain a patent for his homestead, he has to take the following oath:\n\n\"I, A. B., do solemnly swear that I will support the constitution of the United States, and that I do absolutely and entirely renounce and adjure all allegiance and fidelity to every foreign Prince, Potentate, State or Sovereignty whatever, and particularly to Victoria, Queen of the United Kingdom of Great Britain and Ireland, of whom I was formerly a subject.\"\nThe alien who bears title of nobility must, in addition to taking the foregoing oath, formally renounce such title or distinction.\n\nAny alien can obtain a homestead in Manitoba on applying for it in the ordinary way, fulfilling the prescribed conditions, appearing in court at the end of three years, and taking, first, the following oath of residence:\n\n\"I, A. B., do swear (or affirm) that I have resided years in this Dominion, with intent to settle therein, without having been during that time a stated resident in any foreign country.\"\n\nand, second, the following oath of allegiance:\n\n\"I, A. B., do sincerely promise and swear (or affirm) that I will bear faithful and true allegiance to Her Majesty Queen Victoria, as lawful Sovereign of the United Kingdom of Great Britain and Ireland and of the Dominion of Canada, dependent on and belonging to the said United Kingdom, and that I will defend her to the utmost of my power against all traitorous conspiracies and attempts whatever which shall be made against her person, Crown and dignity, and that I will do my utmost endeavour to disclose and make known to Her Majesty, her heirs and successors, all treasons and traitorous conspiracies and attempts which I shall know to be against her or any of them, and all this I do swear (or affirm) without any equivocation, mental evasion, or secret reservation.\"\n\nWhether the soil and climate of Manitoba are as much superior to the soil and climate of Dakota as many persons assert them to be, may remain a matter of controversy. There is no doubt, however, that the Homestead Act, as regards both citizens of the British Empire and aliens, is far more liberal in Manitoba than in Dakota. This consideration ought to influence the decision of the emigrant from the United Kingdom who desires to obtain, under the beneficent provisions of the Homestead Act, a new home on the North American continent.\n\nMINNEDOSA.\n\nA PICTURESQUE AND FLOURISHING NORTH-WEST TOWN.\n\nSpecial Correspondence of the Toronto Globe.\n\nMINNEDOSA, OCTOBER 22.—You will probably have heard of this new, happy abode of men, women, and fine children. It is on the Little Saskatchewan, ninety miles from Portage la Prairie, and is now more conveniently approached by the Canadian Pacific Railroad to Brandon. Arriving at the latter place in the evening, you proceed north by a selected pony and buckboard, over a pleasant upland route of at least thirty miles, and after a few hours enter a little valley through which, in less than another hour, you reach Minnedosa, a Sioux word of the same meaning as the Cree word Saskatchewan: \"water flowing rapidly.\"\nIt was not adopted before last year, the previous postoffice address being Halsford. Earlier than that it was known as \"Tanner's Crossing,\" in compliment to John Tanner, and in recognition of his most considerate kindness to the traveller in erecting a bridge across the Little Saskatchewan at this point, when such a provision was more than a favour. John is a Minnesota half-breed, grandson of a missionary clergyman. He emigrated to Westbourne, a short distance from Portage la Prairie, in 1868, and advanced to this village in 1874. Here he at once secured the legal half-section of land, of which, however, he made little use, except in stock-raising, up to the spring of 1879, when an energetic and enterprising Ontario man, J. S. Armitage, purchased from him 180 acres and forthwith erected grist and sawmills, marked and registered a town site, placed \"lots\" on the market, and then originated the most picturesque and one of the most promising towns in the North-West. The mills have lately been valued at $30,000. Not less than one million feet of lumber have been sawn by the one, and 30,000 bushels of wheat ground by the other, within twelve months. Sixty-eight substantial buildings adorn our streets and suburbs, including four general stores, one hardware store, one tinsmith, two blacksmiths, a furniture store, and jeweller's shop. There are two clergymen—one of the Presbyterian, the other of the Wesleyan creed; while for the protection of the body two doctors are to be found; and for the purposes of preserving the balance between meum and tuum, two lawyers. I am informed that not less than 550 farmers reside at easy distances, north and south of the town; and you may judge of their condition and prospects by the fact that four acres of newly-broken ground produced for Mr. E. Sims, 175 bushels of wheat, or within a fraction of 44 bushels per acre! It is no wonder that in such a country the Marquis of Lorne found \"not one person who was not getting on well, and who was not glad he had come.\"\n\nTelegraphic communication with Minnedosa is being arranged—within a fortnight it will be commenced—and should present hopes as to the North-Western Railway passing through the valley be realised, my many friends here will not have cause to regret their early advent to the Little Saskatchewan.\n\nRAPID CITY.\n\nCorrespondent of the Toronto Globe.\n\nRapid City, December, 1881.\n\n\"What's in a name?\" There is much in it, and the love-lorn Juliet's sorrowful exclamation incontinently told how keenly she felt the effects upon human destiny, of the brief word Romeo. The name Rapid City was not well chosen; it is pretentious, not pleasing, slightly piques neighbours, and sometime causes the immigrants to say that he is\ndisappointed—he expected more. It is not improbable that at an early meeting of the Municipal Council, about to be elected, a change will be agreed upon, and a euphonious and significant Indian word submitted for the present commonplace compound. We should perpetuate Indian names, not only because of their meaning and beauty, but in remembrance of\n\n\"That noble race and brave,\nBut their name is on your waters,\nYe may not wash it out;\n'Tis where Ontario's billow\nLike ocean surge is curled;\nWhere strong Niagara's thunders wake\nThe echo of the world;\nWhere red Missouri bringeth\nEach Tribute from the West,\nAnd Rappahannock sweetly sleeps\nOn green Virginia's breast.\"\n\nSigourney.\n\nWhile the name may be excepted to as a little loud, it is not to be questioned that Rapid City has made good progress, and is really prosperous and promising.\n\nORIGIN OF RAPID CITY.\n\nIt owes its origin to the judgment of Duncan L. McLaren, who in the spring of 1877, in company with several previous neighbours in the county of Bruce, Ontario, started for this then distant portion of the North-West, to take part in the good work of settlement then, as now, so popular and inviting. After cautious examination of the locality at large, McLaren made choice of the site of the present town, and more, and as early as 6th September, 1879, was enabled to register a plan showing 63 blocks, 1,288 lots, 50 feet by 132, with lanes, 16½ feet, included; ten streets, 99 feet in width, eight avenues, a capacious market lot, and \"a reserve for civic purposes.\" By means of his influence and aptitude at Ottawa our worthy pioneer secured several sections for fellow-countrymen of equal enterprise, and early in '78 more than thirty hardy fellows from Wellington and Bruce were here to utilize the land thus obtained.\n\nA SATISFIED SETTLER.\n\nOne of the many whom these figures tell of accosted me rather pleasantly here yesterday. \"You will remember me sir. We met at Headingly last April. I was then looking for land, with my wife and nine children. Now myself and my three boys own two and a quarter sections, upwards of 1,400 acres, and I have one child more. I have had 90 acres under plough this season, and have had a yield of 40 bushels of spring wheat per acre, 35 bushels of oats, and 20 of barley.\" \"You are well satisfied, I should judge?\" \"Oh, yes; not one of us would go back.\" The name of this successful man is Zachary Bailey. He emigrated from Longford Mills, Lake Couchiching, Ontario, and his\nnow happy home is at Oak River, twenty miles west of Rapid City, situated more immediately in township 12, section 22, range 22. It is more than pleasing to hear such words of confidence and contentment as those spoken of by Mr. Bailey, and one hears them in all directions—on the wayside, at the fire-side, in the village store, or wherever you meet the man of bone and brain who came here, and so recently, from Huron, Bruce, Lambton, Victoria, and other counties in the gloriously advanced Province of Ontario.\n\nA GENEROUS YIELD BY THE SOIL.\n\nI could not furnish a more full and correct account of our soil and its products than is told in the following statement, handed to me by an intelligent resident whose acquaintance cannot fail to be interesting to the traveller, and with whom the Marquis of Lorne conversed at much length on the resources and prospects of the country.\n\nYield of grain, roots, and vegetables from H. C. Clay's market garden at Rapid City, Manitoba, which was visited by His Excellency the Governor-General while the crops were growing:\n\n| Crop                        | Bushels Per Acre |\n|-----------------------------|------------------|\n| White Australian oats       | 82               |\n| Black Tartanian oats        | 60               |\n| White Russian wheat         | 49               |\n| Native corn                 | 30               |\n| Swede turnips               | 850              |\n| Long white carrots          | 800              |\n| Sugar beets                 | 780              |\n| Mangies                     | 970              |\n| Potatoes                    | 440              |\n| Table carrots               | 400              |\n| Table beets                 | 500              |\n| Onions, on one-eighth of an acre | 90 bushels |\n\nCabbages as regards flavour were unsurpassed, but to ensure size and solidity must be forced under glass, or in the house, and set out in the middle of June. Celery, for flavour, tenderness, and freeness from rust, cannot be equalled, but the plants must be set out not later than the 20th of June. The want of growth in the fall necessitates the early setting of all such plants. The growth of horse-radish, rhubarb, and similar plants would astonish a non-resident of the country. Apple, pear, and plum trees, of which there are some 200, attained wonderful growth, some of them making 18 and 22 inches of new wood. But fruit trees to do well must be acclimated. The above came from Minnesota, the climate of which is like our own, with the exception of the heavy gales of wind, which, fortunately, are not so prevalent here as there. All of the above was grown upon land which has been cropped for seven years without the use of fertilizers of any kind.\n\nMILLING ENTERPRISES.\n\nThe benefit of mills to a new settlement is inestimable. To George Balkwill and Robert McIntosh Rapid City is indebted for the first mills on the Little Saskatchewan. The grist mill of Mr. Balkwill commenced\noperations early in 1879, and ground that year 8,000 bushels, last year 20,000, and it is estimated that the work of this year will not be less than 30,000. During winter not less than 700 bushels are ground each week for customers. Mr. Thomas Lee lately arrived here from Seaforth, Ontario, and has entered into partnership with Mr. Balkwill to erect a second mill on the opposite side of the river, of 50 horse-power, to be in readiness, as they expect, for the work of the next harvest.\n\nEXTENT OF THE \"CITY.\"\n\nThis tells plainly of the rapid extension of our farming interests, and promises well for the early enlargement of our \"city.\" At present the population does not exceed 400, residences 80, general stores four, stock varying from $4,000 to $7,000, one hardware store, with an excellent stock valued at $8,000; we have also two grocery stores, one jewellery shop, three blacksmiths, one butcher, one baker, two livery stables, five excellent boarding houses, bordering on the rank of hotels, five implement depots, and a pump factory. The learned professions are adequately represented—four clergymen to minister to congregations, respectively of the Church of England, Presbyterians, Wesleyans, and Baptists; one excellent medical practitioner, one shrewd lawyer, and two conveyancers.\n\nEDUCATIONAL MATTERS.\n\nThe Public School, established under the Manitoba School Act, is respectable, and promises to be highly useful. The average attendance is not less than forty, and is likely soon to increase. On the day of my visit the appearance of the school was, indeed, intelligent, happy, and healthful. The teacher is a lady from Ontario, competent, and of high character. The school district has lately been assessed at $200,000. Prairie College (Baptist) of which you will have heard, is situated in this vicinity, on an elevated and most pleasing site. It dates not further back than March, 1880, but for the brief period of its existence much has been done.\n\nA GOOD AVERAGE.\n\nMr. Hogg, who is threshing with a steam machine in the neighbourhood of the Big Bend, reports that so far the average yield of the wheat crops he has threshed out has been over thirty bushels to the acre. He says the majority of the farmers have grown more wheat than any other class of grain.\n\nTHE LITTLE SASKATCHEWAN LANDS OFFICE.\n\nWe have been furnished with the following official statement of the business done at the Dominion Lands Office, at Odanah, during the year ending 31st October, 1881, through the kindness of the agent, Mr. A. E. Fisher. The amount of land disposed of is exceedingly large and gives a good idea of the rapidly increasing settlement in this section.\nBusiness done at Little Saskatchewan office during the year ending October 31st, 1881.\n\n|                | Acres     |\n|----------------|-----------|\n| Homesteads     | 61,163    |\n| Pre-emptions   | 37,492    |\n| Sales          | 29,261    |\n| Total disposed of | 127,916 |\n\nA. E. Fisher, A. D. L.\n\nRapid City Standard.\n\n\"GO WEST YOUNG MAN.\"\n\n—Horace Greeley.\n\nTo the West, young man! To the great North-West!\nTo the land of the free and the home of the blest,\nWhere oceans of prairie and forests of pine\nStretch away far across the boundary line,\nWhere the buffalo roams in his beauty and pride,\nThere is the place for you and your bride.\n\nTo the great North-West where the Red River flows,\nIn silence and majesty onward she goes\nTill she reaches the \"Key of the great North-West,\"\nWhere the mighty Assiniboine takes her rest,\nThen quietly onward in unison flow\nTo Winnipeg Lake a few leagues below.\n\nTo the great North-West, where the soil is deep,\nAnd the fields are broad that the farmers reap,\nAnd the lands are free that the farmer tills,\nAnd the sacks are large that the harvest fills.\nThere is wealth in the great North-West, young man,\nThen waste not here your allotted span,\nNor take no sleep, nor slumber, nor rest,\nTill your face is toward the great North-West.\n\nThe English, the Scotch, the Irish and Dane,\nAnd Russians are pouring in a main,\nThe Icelander, too, from regions cold,\nAnd Canada's sons both strong and bold,\nFrom every region beneath the sun,\nTo the great North-West they run, they run.\n\nFor a home, for love, for freedom, for wealth,\nFor your peace of mind and body's health.\nFor plenty of work and plenty of food,\nFor your temporal weal and future good.\nYou can't do better than say \"good bye,\"\nAnd go to the West to live and die.\n\nSUCCESSFUL FARMING.\n\nMr. Samuel Moore has just threshed 1200 bushels of first-class grain on his farm in township 13, range 20. This is Mr. Moore's second crop. He keeps no hired help, and has accomplished this feat with one yoke of oxen.—Rapid City Standard, December 16th, 1881.\nGENERAL HINTS, &c.\n\nThe climate is spoken of as objectionable. Here it is—A wet spring, a short and hot summer, a short autumn or Indian summer, and a hard winter. Owing to the soft and spongy nature of the soil the rains of spring are quickly absorbed, the heat of the sun aiding, and farmers are little hindered in their preparations for crops. During summer the growth of cereals and vegetables is so rapid that the time of harvesting is soon round. I have seen oats sown in the latter part of May and harvested in August, having grown to a height of 5 feet 7 inches, with good cast at that; and potatoes rather carelessly put into the ground on the 24th June I saw unearthed on the 25th August large and good quality.\n\nEmigrants should provide waterproof clothing of a light material, wide-brimmed hats of common straw, covered with a light netting to pull over the face and neck when attacked by the troublesome mosquitoes. For winter wear I cannot recommend better than Scotch or Irish frieze, with strongly made double gaiters of same, covered with waterproof material—although the snow is dry and light, yet when it adheres to the legs it thaws on entering the house and becomes disagreeable. Boots are discarded in winter, and the Indian moccasin, or buskin of buckskin—soft and warm—with two or three pairs of socks or woollen stockings, are generally used. Heavy woollen blankets, woollen shirts, and underclothing of the same, a man cannot have too much of. If you have an overstock of any of these articles, an easy sale is made, or a trade \"swap\" can be made with your neighbour. This mode of doing business is quite common out here in this sparsely populated country, and much amusement is occasioned over such trading. The settler who has a good supply of buffalo robes will find in them many comforts during the long and cold winter nights either on the road or at home, and coats of buffalo robes are indispensable during the winter while on long journeys. Since there is likely to be a scarcity of these robes—for the Indians complain freely of the gradually decreasing buffalo—all settlers should strive to purchase them on their journey hither. Good robes cost from £2 to £3 each at any of the Hudson Bay Company's Stores.\n\nEvery man who can load and fire a gun and rifle should bring both with him. Ducks of excellent quality abound in every marsh, creek, and lake; and there are snipe and plover in abundance; white the prairie chickens, quite as large as domestic fowls, are constantly met with. A good dog is invaluable, and the well-trained English or Irish retriever would prove a valuable addition to a settler's home in the North-West.\nThe fencing is made of poplar, which abounds everywhere along the valley of the Little Saskatchewan River, and on the open prairies bluffs of this timber are everywhere met with. The fence rails are generally chopped in winter. Putting up snake fencing is rapid work, and is pushed forward with vigour, as the cattle roaming wild on the prairies do much damage to growing crops where there is no fencing.\n\nPrairie fires cause much damage to grainstacks and hayricks. These fires are oftentimes caused by the careless manner in which camp fires are left smouldering when travellers strike their tents. The careless casting away of a match after lighting a pipe has been known to do much damage, the soil being very dry and the grass so easily fired. The spread of these prairie fires is sometimes very rapid. The ploughing of the land around dwellings, hay and grainstacks, is a sure preventive against the damaging effects of prairie fires.\n\nIn the winter the frost penetrates very deep into the soil, particularly where there is little snow. Vegetation begins and pushes on with vigour long before the frost is out of the ground. Owing to the excessive heat of the sun, the frozen under-layer of soil causes evaporation, and helps the growth of all crops.\n\nThe rapid development of the country and the establishment of villages will for years to come cause a demand for mechanical labour. Carpenters and smiths, bricklayers and plasterers, when not working on their own lands, could get remunerative wages. There is ample room for saw-mills, grist mills, and general warehouses all over this vast continent. Those already established are getting more custom than they can attend to.\n\nI have paid close attention to old settler's statements as to the amount of money necessary to start farming in this country. Unless an old country farmer has at least £200 he will find it very uphill work for the first few years. Of course we have here, as there are in all countries, those remarkable fellows who live on the wind and seem to grow fat on it. One man, after choosing his land and paying the fee, had just ten cents (5d.) in the world. He worked on, getting small credit at the \"store;\" his shanty erected, travellers, weary, cold, and hungry, called; he provided them with food and shelter at a reasonable figure. This was two years ago. The man is now in comfortable circumstances, and being jack of all trades, has erected one of the best stables between Red River and the Little Saskatchewan. His wife, an native of Ireland, is well able to provide an excellent meal and entertain her guests with side-splitting anecdotes.\nGREAT WANT OF SKILLED ARTISANS IN MANITOBA.\n\nLand and Water, 19th November, 1881.\n\nThe following is an extract from a letter recently received from a correspondent in Winnipeg, which will no doubt interest those who have thoughts of emigration:—\"Every day in the papers, and at the employment agencies, and in the shop windows, advertisements ask for carpenters, painters, masons, labourers, etc., and they cannot be had. Only the other day a gentleman said he had paid a man 2 dollars 50 cents (10s. 5d.) per cord for sawing and splitting wood, and then could only keep him half-a-day, or a day at most. I have not the slightest doubt that if 2,000 or 3,000 labourers were to arrive here to-morrow they could all find employment inside of twenty-four hours on the various railways, on farms, and on the city works, and at wages of 2 dollars 50 cents per day. . . For lack of carpenters and masons, buildings that should have been done long ago are still unfinished, and in some cases men are now working night and day at them in order to get them done as soon as possible. . . Carpenters get 2 dollars to 3 dollars 50 cents. (12s. 6d. to 14s. 7d.) per day; bricklayers, 5 dollars to 7 dollars (20s. to 29s. 2d.) per day; and their attendants, 2 dollars 50 cents. (10s. 5d.); farm labourers get from 25 dollars to 30 dollars (£5 4s. 2d.) per month and board; servant girls, from 12 dollars to 25 dollars (£2 10s. to £5) per month and board; and cooks, from 50 dollars to 75 dollars (£10 to £15) per month and board. . . General servants can get good situations at any time; also cooks. A liberal sprinkling of mechanics will be wanted; and just to give an idea of the demand for girls, I may say that one of our city papers estimated that if 1,000 were to come here they could all be provided with situations.\" In Minnedosa, Rapid City, and Brandon, the same scarcity of help was experienced all through the months of August, September, and October this year. Expert workmen could earn on the average £1 sterling per day. While excellent board and lodging could be had for 25s. per week at Brandon, and for 20s. per week at Minnedosa or Rapid City.\n\nHOUSE BUILDING.\n\nIt should be borne in mind that all the houses in this country are occupied not by tenants, dependants, or serfs, as in many parts of Europe, but by industrious and intelligent farmers and mechanics, the bone and sinew of the land, who own the ground upon which they stand, build their houses for their own use, and arrange them to satisfy their own peculiar wants, and gratify their own tastes. Owing to the severity\nof the winter, every farmer's house or shanty should be provided with a good cellar. This cellar is entered by a \"trap-door\" in the floor of the \"every day room.\" Cellars vary in size according to the requirements of the family. A house 16 by 20 feet inside could have one 12 by 16 feet, 6 feet deep or deeper according to the soil. In this all vegetables, &c., are stored during the latter part of September or early in October. It is usual to board the sides of the cellar. The safety of all vegetables, &c., depends on the proper \"banking up\" all around the foundation, this is done with the clay taken from the cellar.\n\nAs log houses require a great deal of yearly repairs and constant use of the broom, the \"lumber\" or frame house is considered preferable, and unless the settler is located where he can cut and hew logs and call a \"Bee\" and build his own house, ready sawn lumber is the cheapest.\n\nCattle sheds are run up in a hurry, plastering the logs between with, very often, the droppings of the cattle. This shed when \"banked\" all around with about 2 feet of manure makes a good warm stable for winter.\n\n**MANAGEMENT OF STOCK.**\n\nIn this country, the absence of agricultural newspapers—those farmers' friends—which might, if they did exist, assist the incoming settler in ideas as to the best and cheapest mode of management of live stock where five to six months winter may always be calculated on, throws a responsibility on the writers' shoulders; but an attentive ear to old settlers' opinions and statements on this head, although condensed to suit the pages of this pamphlet, may give, at least, a rough idea as to the preliminary steps necessary to ensure success in the purchasing and management of live stock. When all the circumstances of the farmer are taken into consideration, when it is considered that not only the men employed on the farm but the cattle also are productive labourers, when the stimulus to industry as well as circulation of capital is taken into careful account, the capital employed in agriculture not only puts into motion a greater quantity of productive labour, but adds a much greater value to the annual produce of the land, while it increases the real wealth and revenue of its inhabitants, after all, a great source of the wealth of nations is derived from successful stock-raising.\n\nLive stock should be an object of the utmost importance to the settler in the new country. Here is, indeed, a larger field for the breeding, rearing, and management of cattle. The Devon breed of cattle has hitherto given entire satisfaction both in Ontario and Manitoba.\n\nHerds of \"carelessly\" bred cattle are driven in from the United States, all through the summer months, and although many, perhaps 50 per cent. of these are \"scallawags,\" yet a careful judge can pick out at least a few passable animals. Winnipeg seems to be the head centre for this traffic, and the settler can, after \"locating\" his land, proceed there by rail and select the stock at leisure.\nI call particular attention to the letter of Mr. John Wake, late of Dorsetshire, England, page 43. I would, however, suggest that 4 tons of hay be stowed for each head during winter.\n\nFor mixed farming, this Little Saskatchewan country offers special inducements. Some good results have been secured by settlers who, with some practical knowledge, have come in with a team of small horses, mules, or oxen, a couple of cows, and a brood sow or two, with money sufficient to pay their way until the first crop is reaped; wheat cultivation has not been the sole dependance of these men, they have cats, barley and flax, all of which are this year selling at paying rates, while the live stock are yielding remunerative and certain returns. Sheep do well, but very few farmers have tried them.\n\nBREAKING THE LAND.\n\nThe thinner the soil turned, the better. As oxen are preferable to horses or mules for breaking the land, I advise the settler to purchase oxen when an opportunity offers, great care is needed in this purchase. Oxen should be trained to waggon and plough, not \"strained\" or \"breachy.\"\n\nAfter the required quantity of acres are broken those oxen can be sold or let run on the prairie and sold in the fall or winter for beef.\n\nThere is a class of horse generally offered the incoming settler as suitable for farming purposes. These horses, long, flat-ribbed and leggy, are numerous in and around Winnipeg and Portage la Prairie. Against purchasing from this stock I would warn the settler; they are as a rule bad, \"made up,\" and do not last any cutting out here. The short and stout French-Canadian horse is the best for the North-West climate and for general utility. After the soil is first well broken and back set by oxen, a team of 14-hand cobs will easily plough that land the succeeding years.\n\nEmigrants have no occasion to join any \"organisation party,\" but when they are ready, make a start. Two or four in a party get along much better than where there are one hundred or two hundred, 75 per cent. of them perpetually grumbling.\n\nEvery emigrant should purchase a through ticket from Liverpool to Winnipeg or Brandon, if possible. Carefully avoid all and every tempting offer made by Yankee land-runners and their confederates to decoy farmers. These are everywhere along the line from Sarnia to St. Vincent, but chiefly at those railway stations in Minnesota and Dakota, avoid delay in Winnipeg and on arrival at destination, seek information from those in authority to give it. Be not tempted to drink, nor purchase any article pertaining to the farm, until you have selected your land.\nDESCRIPTIVE CATALOGUE\n\nOF\n\nEACH TOWNSHIP IN THE COUNTY OF MINNEDOSA,\n\nWITH SPECIAL REFERENCE TO\n\nHUDSON'S BAY COMPANY'S LANDS.\n\nThese lands, in the County of Minnedosa, are within marketable distance of Rapid City, Minnedosa, Strathclair, and Shoal Lake. All these, excepting Shoal Lake, are on the Little Saskatchewan River; At all these places there are grist mills, saw mills, stores where anything and everything can be purchased requisite to the settler. Agricultural implement warehouses, blacksmiths' stores, carpenters, tailors; and shoemakers' stores.\n\nThe necessaries, and even luxuries of life, can be procured at any of those well-appointed stores in Rapid City, Minnedosa, or Strathclair, at Winnipeg prices. The building of churches and schools is being pushed forward with vigor. The rapidly increasing population of this Little Saskatchewan County is marvellous. The nearer, therefore, the settler keeps to the line of settlement, the quicker will he obtain all the benefits of civilization.\n\nThe prices of agricultural implements may be quoted as follows:—breaking ploughs, $18 to $25; mowers, $60 to $110; seeders, from $10 to $50; reapers and mowers combined, $140 to $200; horse hay rakes, $30 to $50; waggon, from $75 to $100; framing mills, $30 to $45. And all minor agricultural implements are as low in price as in Winnipeg.\n\nArticles of food can be purchased at reasonable rates:—Tea, 50 cents to 75 cents per lb.; sugar, 7 lbs. for one dollar.; bacon, 15 cents to 20 cents; Flour, from $2 to $3.75 per 100 lbs., according to season. Ready-made clothing is always on hand at any of the stores.\n\nTOWNSHIP 18, RANGE 17.\n\nThis township is in the south-east corner of the County, is partly rolling and partly timbered prairie; good stock-raising land. Pond holes are not as numerous as in some of the townships immediately north. Nearly all the railway lands, or the odd numbered sections, are vacant in this township, and the Hudson's Bay lands, 1120 acres, all good, are also vacant.\nTOWNSHIP 14, RANGE 17.\n\nThis township lies north of the above township 13, and, if anything, is less adapted to farming than the township first described. However, many excellent farms are here. Is good for stock, hay being in abundance. This township corners on Minnedosa, the market town. Railway lands are vacant in this township—a few homesteads and all the Hudson's Bay Company's lands are vacant.\n\nTOWNSHIP 15, RANGE 17.\n\nThis township is well supplied with poplar, particularly the south half. Part of the town of Minnedosa joins the south-west corner (Tanner's crossing) where the Little Saskatchewan River forms an elbow, and runs west. This township is well watered by creeks and pond holes, and not a few lakes. Is excellent farming land when clear of timber and scrub. Many large farms are already in full swing in the township, the most prominent being that of Mr. Thomas Macnutt, where nearly 150 acres are under cultivation. A great deal of good railway land is vacant in this township. The Hudson's Bay Company has 1120 acres open for sale here.\n\nTOWNSHIP 16, RANGE 17.\n\nThis township is well suited for farming and stock-raising purposes. Is well watered by creeks, and many good farms are in operation, amongst them those of Messrs. Campbell, Lowry, Gibson, and Jackson. Timber (poplar) is also well and evenly distributed. Minnedosa is the market town. Nearly all the railway land, and 1120 acres of Hudson's Bay land is vacant in the townships—all good.\n\nTOWNSHIP 17, RANGE 17.\n\nThis township is nearly all \"brush;\" a great deal of poplar, and very little open farming land. This scrubby land, when once got under cultivation, is excellent land, very strong soil; very often four feet of black leaf loam, with sand and clay bottom. Unless high and well-drained, prolongs growth, and prevents early maturity, in time to escape the early frosts of autumn. For stock, this township is fairly favoured. The Hudson's Bay Company has 1120 acres open for sale.\n\nTOWNSHIP 18, RANGE 17.\n\nThis township occupies the north-east corner of the county of Minnedosa. Is well timbered with poplar and willow scrub. Few settlers have as yet ventured in here. The Hudson's Bay Company has 1120 acres open in this township.\nTOWNSHIP 13, RANGE 18.\n\nThere are no homesteads vacant in this township, and much of the railway land is taken up. May all be classed as rolling prairie, with here and there a \"bluff\" of poplar and willow. Good hay meadows everywhere. The Hudson Bay Company has 1120 acres open in this township, all excellent land.\n\nTOWNSHIP 14, RANGE 18.\n\nThe Little Saskatchewan River crosses the north-west corner of this township. Some good farms are in operation here; and although the township is very much cut up by pond holes, they do not seem to interfere much with or impede the energetic Ontario men, judging from the many straw ricks everywhere to be seen, and surrounded by a fair type of cows and oxen and general stock. In the north-west corner is the farm of Mr. Archibald Hare. Mr. Hare is one of the earliest settlers, being the first white man possessed of the courage to select a home in the valley of the Little Saskatchewan. Is known as the \"square man,\" being very scrupulous and honest in all his dealings—a rare virtue in a new country. He is the founder of Hare's Crossing, now called Rose Valley. Land prospectors should give him a call. See letter—page 40. The eastern side of this township is cut up by numerous pond holes, the constant home of the wild duck during spring, summer, and autumn. Between these pond holes and poplar and hazel \"bluffs\" the long hay grass called \"red-top,\" and the pea vine and vetch, grow thick, and pedestrians find progress difficult during the months of July and August. This description of the hay and pea vine and vetch applies to all the land in the county of Minnedosa, more or less. Here lives the \"Armagh man,\" who sent a special message to his countrymen at home not to be afraid to come and select homes here. \"He had,\" he said, \"thatched his house when the thermometer was 25 below zero, and did not feel cold!\" His Excellency the Marquis of Lorne, Governor-General, being trusted with this message. Hudson's Bay Company has 800 acres open, all good land.\n\nTOWNSHIP 15, RANGE 18.\n\nThe Little Saskatchewan's course is here turned to the eastward, crossing the lower or southern half of this township, passes Odanah and Minnedosa, and again turns to the north-west. Many excellent farms are in operation along the south side of the river, pleasantly located, overlooking Odanah and Minnedosa, two infant towns, or town sites, like Hamburg and Altona, will, it is to be hoped, ere long join hands, and form one in decidedly the most picturesque valley in Manitoba.\n\nThe district immediately north of Minnedosa is very rough, and many pond holes are met with. Excellent farms are, however, soon reached, particularly that of Mr. Cameron, the first settler in this district. He\nhas 150 acres under cultivation. There is little except railway land vacant in the township. An excellent poplar along both sides of the Little Saskatchewan, affording building material and fuel in abundance. The Hudson's Bay Company has 1120 acres open for settlement in this township, and all fair land.\n\n**TOWNSHIP 16, RANGE 18.**\n\nThe Little Saskatchewan River crosses this township from south-east to north-west corner. On the south-west side there are many excellent farms in good go-ahead hands. Amongst the early and enterprising settlers may be mentioned John McTavish and Angus McDonald. Homestead lands are scarce. Good railway lands are open for settlement. Minnedosa is the market town. On the east and north side of the river, timber (poplar) is plentiful, clear homesteading land being very scarce. There are a few farms under cultivation; that of Mr. Montgomery, situated in the valley, is well favoured for both grain and stock. Mr. Montgomery winters about 40 head of cattle. The Hudson's Bay Company has 1120 acres open for settlement in this township. Section 8 being first-class land.\n\n**TOWNSHIP 17, RANGE 18.**\n\nThere are some good farms under cultivation in the southern part of this township. The land, however, is very scrubby; willow and poplar abound. The northern part is nearly all a poplar and willow belt. Many old Scotch families are settled here, and the Gaelic tongue is in everyday use. Some English settlers have also cast their anchors here; the love of timber over that of open prairie caused them to wander so far north. The homestead of Mr. Averill, late of England, (The Cedars) is very prettily situated, the southerly aspect being particularly picturesque, disclosing the winding track of the Little Saskatchewan River for many miles, until it loses itself in the valley at Minnedosa, nearly 16 miles due south. The Hudson's Bay Company has 1120 acres vacant in this township.\n\n**TOWNSHIP 18, RANGE 18.**\n\nThis township is all open to settlement, as it is nearly all under poplar and willow scrub, and far away from civilisation, as yet at least, it remains almost in its virgin state. The Hudson's Bay Company has 1120 acres open to settlement.\n\n**TOWNSHIP 13, RANGE 19.**\n\nThe Little Saskatchewan River runs through the north-west corner of this township, passing Rapid City on section 20; forming a very picturesque crescent valley. The river is well timbered on both sides above\nRapid City. Here Colonel Martin and Mr. McClune—late of England—have erected two very neat villas. This district is thickly settled with Englishmen and their families, forming the northern border of what is now known as the English Reserve. The Hudson's Bay Company has for sale the south half of section 8 (320 acres), and the north-west quarter of section 26 (160 acres), all good land.\n\nTOWNSHIP 14, RANGE 19.\n\nThe land in this township is very fine, and for farming and stock-raising cannot be beaten. Immense quantities of excellent hay is everywhere found in the latter part of June and during the remainder of the season. Although a few less pond holes would add considerably to the value of some of the land in this township, yet these afford excellent sport in shooting seasons, the pond holes and small lakelets being literally covered with wild fowl. Prairie chickens also abound in this district, affording easy and pleasant sport all through the autumn and winter. Wood (poplar and stunted oak) is evenly and rather prettily distributed over the eastern side of the township. The Little Saskatchewan River crosses the south-east corner. This part is well timbered and deer are found here in the autumn and winter.\n\nThe Hudson's Bay Company has 1120 acres open in this township, all good land. Rapid City is the market town for those living in the south side, while those in the north side are equal distance between Rapid City and Minnedosa. Sand, gravel, and limestone are here, while the soil will average 2 feet 6 inches of leaf loam with a subsoil of clay and sand.\n\nTOWNSHIP 15, RANGE 19.\n\nThe south-west corner of this township is fairly timbered with poplar, elsewhere it is rather bare of timber but is excellent for farming and stock-raising purposes. Many of the leading farmers of the Saskatchewan are located in this township. Is within easy distance of the town of Minnedosa, or Rapid City. Is well supplied with game and wild fowl. Timber for building and fencing purposes is procured from timber lots (each settler having 20 acres allotted to him at the rate of one dollar per acre) along the river's sides. The Minnedosa and Rolling River Sawmills supply lumber sawn from spruce and poplar logs, principally the former. The Hudson's Bay Company has three-fourths of section 26 open. Excellent land.\n\nTOWNSHIP 16, RANGE 19.\n\nExcellent farming land in this township. Many large farms are in good go-ahead hands. For stock it cannot be beaten. Is well timbered with poplar. The Little Saskatchewan River crosses the north side. On Rolling River is a sawmill, owned and managed by Mr. Cameron. The river runs into the Little Saskatchewan from the north-west, is\nwell timbered with spruce and poplar; is well stocked with fish—pike and suckers—and the valley of the Little Saskatchewan, into and along which this river runs finally forming its larger neighbour, is one of the very picturesque valleys in the Province.\n\nThe Hudson's Bay Company has the whole of section 8 (640 acres), and west half of section 26 (320 acres), open to settlement in this township.\n\n**TOWNSHIP 17, RANGE 19.**\n\nThis township is a thick network of poplar and willow scrub. Many farmers are located here, amongst them a very early settler, Mr. Livingstone. Stock do remarkably well here, the breed being very good. All the railway lands and 1120 acres of Hudson's Bay lands are vacant. Timber—spruce, larch, birch, and poplar everywhere north of the river.\n\n**TOWNSHIP 18, RANGE 19.**\n\nSame quality of land as township 17. No settlers here as yet.\n\n**TOWNSHIP 18, RANGE 20.**\n\nThe land in this township is all rolling, is well settled, except the railway lands. Timber is scarce. The Hudson's Bay Company's land is all taken up.\n\n**TOWNSHIP 14, RANGE 20.**\n\nAll rolling prairie, with many excellent farms in full swing. Timber very scarce here. Nearly all railway lands vacant, and the west half of section 8 (Hudson's Bay Company) very good land. All the open land in this township should be seen.\n\n**TOWNSHIP 15, RANGE 20.**\n\nThe south-east quarter of this township is well timbered, elsewhere it is rolling prairie. Beautiful land, many large farms are under cultivation. For stock-raising purposes this township cannot be excelled. Nearly all the railway lands are open. The Hudson's Bay Company has 1120 acres open, all excellent land.\n\n**TOWNSHIP 16, RANGE 20.**\n\nThis township is rolling prairie. The little Saskatchewan River crosses the north side of this township. Here, timber is in abundance. Many farms are far advanced in cultivation. In the northern part of\nthis township, Lord Elphinstone has a large stock farm, over 200 head of cattle, all doing well. All the railway land is vacant, also 1120 acres of Hudson's Bay Company's land.\n\nTOWNSHIP 17, RANGE 20.\n\nThis township is nearly all under timber, poplar and willow. The little Saskatchewan River is crossed here by a good bridge. Four families have found comfortable homes on the north side of the river. All the railway lands are vacant here, and 1120 acres of Hudson's Bay Company's lands.\n\nTOWNSHIP 18, RANGE 20.\n\nThis township is all open, being nearly all under timber.\n\nTOWNSHIP 13, RANGE 21.\n\nThis township is all rolling prairie, is the east side of what is known as the Oak River district. Many English settlers are located here. Timber is scarce, land is good. There are homesteads open in this township. Nearly all the railway land, and 1120 acres of Hudson's Bay Company's land, all of excellent quality. This township is 12 miles west of Rapid City.\n\nTOWNSHIP 14, RANGE 21.\n\nAll rolling prairie, with here and there a poplar \"bluff.\" A few homesteads are open. Nearly all the railway lands, and 1120 acres of Hudson's Bay Company's lands, all good. Nearest timber for building and fencing purposes, 12 miles.\n\nTOWNSHIP 15, RANGE 21.\n\nAll rolling prairie. No homesteads vacant. Nearly all the railway land is open to settlement, and 1120 acres of Hudson's Bay Company's land, all good. Nearest timber for building purposes, 6 miles from north-east corner of township.\n\nTOWNSHIP 16, RANGE 21.\n\nAll rolling prairie, is thickly settled. No homesteads vacant. Nearly all the railway lands are vacant, and 640 acres of Hudson's Bay Company's lands, in close proximity to the river, where building timber can be procured.\nTOWNSHIP 17, RANGE 21.\n\nThe Little Saskatchewan River crosses this township from south-east to north-west corner. This district is called the Big Bend, as the river turns again to the eastward, forming a half-circle curve. Magnificent farming and stock-raising land on west side of river. Timber in abundance, and good water in every creek leading to the river. Few homesteads vacant. Nearly all the railway lands are open, and 1120 acres of Hudson's Bay Company's lands, all good. Section 8 excellent.\n\nTOWNSHIP 18, RANGE 21.\n\nIn the south-east corner of this township the river runs as described above, through a wide and picturesque valley. A saw and grist mill are plying their trade here, owned and managed by Messrs. Kyall and Whinmister; a large and well-stocked store owned and managed by the Messrs. Dyer; a post office and many private dwellings. Two years ago there was no house or sign of civilization here. Strathclair, as it is now named, is making rapid strides; is peopled on the west by enterprising and level-headed farmers, cultivating the best land in the County. The east side of the river being all under timber, is as yet untouched.\n\nOne mile above Strathclair is the Hudson's Bay Company's store and saw and grist mills, a church, and numerous private houses. Here is an Indian reserve, under the careful and kind management of their pastor, the Rev. Mr. Flett, these red men and their families seem quite happy. Many of these Indians live in log houses, neatly white-washed, patches of tilled prairie surrounding, growing grain and vegetables. The district north of this is all well timbered. About 12 miles north, and a little east, of Strathclair, following the course of the river, in a very lonely and picturesque part of the valley, and not many miles from Lake Odie (the source of the Little Saskatchewan), are the homesteads of Messrs. Routledge and Kyall, late of England, these gentlemen marched away ahead of the rapidly advancing army of settlers, reconnoitring so to speak, and have erected a very comfortable and neat dwelling, where the tall spruce, intermingling with the birch and poplar, the many running streams of pure water, the timber-clad hills on all sides, overlooking the silent valley. Here, at least, if these gentlemen cannot grow grain, they have peace. The Hudson's Bay Company has 1120 acres of land for sale in this township. Nearly all the railway land and many homesteads are vacant outside the Indian reserve lands.\n\nTOWNSHIP 18, RANGE 22.\n\nThis township is known as the Oak River district, is lightly timbered, rolling prairie, excellent land for farming and stock. Many English settlers are located here. A few homesteads and nearly all the railway lands are open in this township.\nThe Hudson's Bay Company has all of section 8 (640 acres), and the north-west quarter of section 26 (160 acres), vacant here, all good land.\n\nTOWNSHIP 14, RANGE 22.\n\nThe land in this township is similar to that in township 13. A few homesteads vacant. All the railway land, and 1120 acres of Hudson's Bay Company's land, all first-class.\n\nTOWNSHIP 15, RANGE 22.\n\nThe land is rolling, with \"poplar bluffs\" here and there. No large timber, however, suitable for building purposes. Many good homesteads are vacant in this township, all the Railway lands, and 1120 acres of Hudson's Bay Company's land. A good stock-raising district. Is about thirty miles from Minnedosa, twenty-four miles from Rapid City, ten miles from Shoal Lake, and twelve miles from Strathclair.\n\nTOWNSHIP 16, RANGE 22.\n\nThis township possesses many rare good qualities for both farming and stock-raising. Upper and lower Salt Lakes are in the centre of this township, extending almost the entire length of the township (6 miles), is not more than one mile wide at any part, is nicely timbered with poplar, and affords grand facilities for drainage. There are a few good homesteads vacant in this township, nearly all the railway lands, and 1120 acres of the Hudson's Bay Company's land, all good. Here Messrs. William and George Johnson, late of Scotland, have erected a large and comfortable \"lumber\" dwelling house, one of the finest in the county; and have started a grain and stock-raising farm. The Messrs. Johnson have 100 head of cattle, including 30 milking cows. Had 100 acres under grain this year. This being their first year in this farm, they intend to break and put under grain about 200 acres in 1882. Eight miles from Shoal Lake, thirty miles from Rapid City, twenty-eight miles from Minnedosa, and about ten miles from Strathclair.\n\nTOWNSHIP 17, RANGE 22.\n\nIs all rolling land, but few homesteads vacant. All the railway land; and 1120 acres of Hudson's Bay Company's land. All good and open to settlement. Is in easy reach of Strathclair mills, store, and post-office.\nTOWNSHIP 18, RANGE 22.\n\nIs well timbered on east and north sides. A few homesteads vacant. Nearly all the railway lands, and 1120 acres of Hudson's Bay Company's land. The Brothers Geikie, late of Scotland, have large and well-stocked farms here, producing large quantities of butter and cheese. Mr. Tully is also interested in the stock business, having about 20 head of milking cows. All doing well.\n\nThis township is in the north-west corner of the county of Minnedosa, is well-watered by creek and lakelets. All land north of this township is thickly timbered, only a few settlers having, as yet, gone in here. Large tracts of this timber land are leased to the lumber mill owners at Strathclair, Minnedosa, Odanah, and Rapid City. Here, during winter months, the spruce logs are cut down, cut into lengths, and \"skidded\" to the river edge, ready for rafting in the spring. This is a means of profitable employment for many men and horses all through the long winter.\nA YEAR'S EXPERIENCE\n\nIN THE\n\nLITTLE SASKATCHEWAN VALLEY, MANITOBA,\n\nBY AN ENGLISHWOMAN.\n\nFinding that agricultural prospects in England were growing very much worse, and that there seemed no prospect of regaining the large sum which each year had to go to make up the deficit in accounts, we decided to bring our family of four children to the new country, of which we had heard so much, and there expend our energies in making a home for them. Thus it was we came to be on board the \"Sardinian,\" a splendid vessel belonging to the Allan line. I am no literary character, and cannot pretend to a finished style of writing, but the comforts and luxuries experienced on board the \"Sardinian\" would require a more facile pen than mine to do justice to the good ship and her captain and owners. We left Liverpool on the 1st April, 1880, and after a pleasant voyage landed at Halifax, N.S., on the morning of the 11th. Everything had been done that could conduce to our comfort, and even to our amusement, so that it was not without a feeling of regret we said good-bye to the good ship \"Sardinian.\" Off by rail to Quebec, where we arrived all-well, and after a day's rest we continued our journey westward. The scenery in and around Quebec gave us very much pleasure; its quaintness has a charm over the modern city, and its steep streets and lofty rocks, overgrown with cedars, are very picturesque, and the freshness of the bracing atmosphere acted like a tonic after the long railway journey. Away again on our journey, we reached Montreal. Two hours delay here, so we paid a visit to the English Cathedral, and off again, arriving at Peterborough on the 17th. By the advice of friends we were induced to prolong our stay here, and have a look at the farms for sale in the district. We rented a small house in the pretty village of Lakefield, nine miles from Peterborough. I enjoyed the beauties of this quiet little place very much, but my husband could not suit himself in a farm; so, away to the West, arrived at Sarnia, we were introduced to the Customs' officers, who were not long in passing all our luggage. Port Huron reached, we were in Uncle Sam's dominions. Detroit is next reached, then Chicago, Milwaukee, and crossing the Mississippi, we are in St Paul. Still on to the great North-west, we were thirty-three hours passing over the Minnesota plains, which seemed like a sea of land. Far as the eye can reach it is a flat, treeless prairie. There were few houses, but the stations are numerous along this line, at each a few small houses,\nand generally waggons and farming implements for sale, and invariably\nthe words \"Billiard Saloon\" were painted on the sign of the small\nStation hotel. We saw some land cultivated, but very little compared\nto the thousands of acres unbroken. At this season much of this prairie\ncountry was under water, the train having to pass through small lakes\nwhere the grading was low and defective. Arrived at Winnipeg on the\n24th April. Finding Winnipeg much superior to what I had been led\nto believe, fine large handsome buildings, wide streets, brisk gentlemen\nwith business on the brain, fashionably dressed ladies (a little perhaps\ntoo showy to be quite in accordance with English taste), Indians walking\nabout in their many-coloured blankets amongst their stylish friends, many\nof these \"braves\" having painted faces and feathers ornamenting their\nheads, while others looked dirty and untidy, much like some of the\nswarthy gipsies at home. Having said farewell to Winnipeg, we go on\nboard the river boat and purchase tickets to Portage la Prairie,\ncharmed with the beauties of the Assiniboine, a broad and winding\nriver, with thick belt of trees on each side, with here and there a cleared\nspot with quiet homestead, garden, and the usual, &c., all looking fresh\nand warm in this Manitoba April sun. Arrived at the Portage in time\nfor supper, to which we did ample justice, as we had already found out\nthe appetising power of the North-West air. Spent ten days here looking\naround in search of suitable farms, with so much to choose from, and\nyet \"To the West!\" is the cry.\n\nPacking a waggon was something altogether new, and after many\nawkward mistakes, we get under way, oxen and waggon with cow\n\"hitched\" to behind and we start for the Little Saskatchewan. The\n\"ups and downs\" of the following few days live in my memory, bright\nand vivid, our troubles getting through the mudholes, and then our joy\nat beholding the flowers which everywhere enamelled the prairie, they\nwere as beautiful as any upon which the greatest care had been bestowed,\nwe made them into bouquets in turn; each trying to make the prettiest,\nmany of them being quite as lovely as those which grace our English\ndining tables. Wild fruit trees are in abundance, raspberries, currants,\ngooseberries, while the strawberries seem literally to cover the prairie.\nPine Creek, a hilly picturesque spot is passed, and the Big Plains are\nreached; here a few hours rest under the poplars, the heat being greater than\nwe had before experienced, the flowers and beautiful butterflies affording\nthe children great pleasure. We now travelled through one of the greatest\ngrain growing districts in the great North-West, and after contending\nwith the many difficulties of travel at this season, we arrived at Minnedosa,\non the Little Saskatchewan River, on the 20th May. We could\nnot but admire the pretty little plain, even in the thick misty rain that was\nfalling, it looked like a nest among the hills which surround it. The\nweather in this country is so much clearer and dryer than in England\nthat it seems to have an exhilarating effect upon every one, and we\ncertainly felt as happy the morning after our arrival at Minnedosa, as\nany family surrounded by every luxury. Minnedosa at this time con-\nsisted of half-a-dozen houses, and as many tents, and these divided by\nthe Little Saskatchewan River.\nIt is astonishing how much more quickly people become acquainted in a country like this than in Europe. Every one leads so much the same kind of life, our delight in making the best of everything to the new comer; not a murmur did we hear of the privations which have to be endured in this land of our adoption. The Rev. J. P. Sargent, Church of England clergyman, who has charge of the Minnedosa and Rapid City Mission, held his first service in Minnedosa the following Sunday. The service, so impressive, made us forgetful of the thousands of miles which separated us from our native land and many friends. At last a farm is selected sixteen miles north of Minnedosa. We had enjoyed our stay at Minnedosa, the pleasant rambles over the hills, the almost constant warfare carried on during calms, against the ubiquitous mosquito. During the day it was rarely too hot as there was always a cooling breeze, and the nights were cool and pleasant, and it is surprising how well we all slept during those six weeks, on the buffalo robes with only our travelling bags for pillows.\n\nLIFE IN A SHANTY.\n\nOnce more the waggon is packed. Proceeding north we travelled over a rough but picturesque country. The little Saskatchewan's winding track, on our left, on our right, prairie broken here and there by poplar and willow \"bluffs,\" and numerous lakelets teaming with wild duck. Instead of the grassy hills, we had to walk through tiny rose bushes, and wild peas and vetches, intermixed with flowers, which were growing most luxuriantly. Reaching a comfortable homestead, and on the invitation of its inmates, we decided to remain that night. This was our first introduction to a log house. It was about 16 feet square, and whitewashed inside, looking very like a cottager's home in England, flooring of roughly hewn poplar rails. These settlers had come out two years ago, when there were no saw mills in the little Saskatchewan. They had 50 acres of land ready for crop, and were preparing to build a new house. Another start and we are shortly in sight of our future home, and a small shanty, our temporary residence, kindly placed at our disposal by a very kind bachelor until such time as our own could be made ready. This shanty was 14 feet by 16 feet, small enough, still we were thankful to live in it. Many families had to live in worse when they first came out, as an old lady said, \"they had eaten the brown bread, and we were come to share the white.\" The following morning we commenced real work; my husband went mowing, and my sister and I commenced washing, cleaning, and tending. This done, my sister established herself as teacher to my children, dividing the room by a curtain; they were thus able to continue their studies without interruption.\n\nHaving selected a suitable site for our house, where to the southward is the winding track of the little Saskatchewan for many miles, to the east, west and north are plantations of poplar and birch trees, with\noccasionally a spruce, though these are scarcely noticeable until the winter, when their pretty dark green looks bright and cheerful amongst their other leafless companions.\n\nEverywhere the prairie is dotted with tiny rose bushes which bloom all summer, sweet, scented, and resemble our old English monthly rose. This was the only flower we noticed with any perfume, like the birds, their brilliant colours are their chief attraction. Eight of the neighbours assembled on the 17th of August, to help at erecting our log house, two of them bringing their wives to help in the domestic arrangements.\n\nI could not help admiring the way those hardy sons of Ontario stood on the logs and chopped with as much ease as when on the ground. These log houses are made with a gable at each end, and a ridge pole across; they look simple and in character with the country, but when well finished are warm and comfortable.\n\nOn the second week in October we moved into our new house, and now I may say,—“so far I live to the northward, no man lives north of me.”\n\nHaving bought in a large supply of vegetables, we stored them in the cellar under the house. The entrance to the cellar is through a trap door in the floor, and it seemed most curious at first to see people disappear down these queer little places whenever anything was required, as the cellar is frequently used as larder and pantry.\n\nBeavers and pigs are slaughtered in the beginning of winter, and when frozen, keep good until the spring, which is a great convenience. At this season the Indians are allowed to leave their reserves and hunt deer, beaver, muskrat and mink, wherever found. They sell the venison and poultry very reasonable. Prairie chickens are plentiful at this season, also partridge or wood grouse. The rabbits, like some of the birds, turn white in winter, are numerous, but rarely seen; they are more often heard than shot. Our Indian visitors have behaved so pleasantly that I have quite lost my fear of them, and do not in the least mind their unceremonious style in coming and going. They have, so far, been extremely well mannered, and have not the objectionable habit of spitting on the floor, so common in Canada and the States.\n\nMy husband having rented 8 acres of land ready for crop, at $2 per acre, put it under wheat this spring, and having planted sufficient vegetables he went to work breaking the virgin soil. He has now about 40 acres broken, and intends breaking 20 more in time to put all under crop this Spring of ’82. Early in April, we watched the little patches of green spring up with so much pleasure, as we sought for the violets and primroses in our hedge rows at home; and the children came in great glee to show us the first strawberry blossom one day in Easter week. The beginning of May brought marsh marigolds; these and the blue-bell violet are the only flowers exactly like our English wild flowers. A fortnight later it seemed as if the prairie was a large garden. I have this year collected large quantities of wild fruit for preserving, and my husband has reaped a bountiful harvest off those eight acres.\nOn the 12th May the cattle were feeding on the prairie, and the rich yellow cream bore testimony to the goodness of the grass.\n\nI have now given to the best of my ability a short account of the first year spent by us in this Great Lone Land. At this time so many are leaving dear old England to seek a home in other lands, and to these, at least, I hope it may be interesting; from it they may be able to understand a few of the difficulties that have to be met with by all settlers in a new country, although the experience of every family may vary, it may, too, be a satisfaction to know how happy English people really are when away from the comforts and luxuries to which they have all their lives been accustomed.\n\nIn Canada you do not so much realise that you are in a strange land, being still under the English flag, and all the people or their ancestors having come from the British Isles. And it is pleasant throughout the whole country to hear the affectionate way in which the Canadians speak of the \"Old Country.\"\n\nThere are many English people settled in the Little Saskatchewan, and I have not heard of one who dislikes the North-West. Many would naturally prefer living amongst their friends, for it is indeed a severe wrench to break up a home and leave people and places that we have been warmly attached to from childhood, still I think they agree with me, that being out here is preferable to living in England on a small income when a certain amount of \"appearance\" seems necessary to be maintained and where there is so little prospect of providing for the children, or our own old age. Here there is every probability of the difficulties and disagreeables decreasing each year. Our life compared with that of those who first took land in this settlement shows a decided improvement during the three years. Minnedosa is nearly in the centre of the County, where every necessary and even luxuries can be procured instead of going ninety or one hundred and fifty miles as those early settlers had to do. We are now able to reach Winnipeg or Portage la Prairie in as many hours as it has hitherto taken days.\n\nLiving in such small houses and the absence of servants is a thing not pleasant to contemplate when sitting in an English dining room, but before the little house is reached, there is so much to be gone through that people are only too glad to have a home of their own, and it is really a great pleasure to plan and contrive to make that little home as comfortable and convenient as possible, and that it is really your own, and that at any time you may build a more commodious dwelling when funds and time permit, help you to make the best of a small beginning, and when you see others contentedly doing the work that each day brings, and there is no one to do it for you, you naturally take a pride in doing well what in England you scarcely ever thought about. Still it does need a cheerful unrepining spirit, not to weary of the monotony, for each week brings much the same routine, and there are many things in a Colonial life totally at variance with our English ideas,\nand which it takes some time to get reconciled to. I have written this from a wife's point of view, for it is especially necessary for her to be cheerful and energetic, and to do anything and everything that comes in her way, to the best of her ability and without grumbling.\n\nMy husband strongly advocates stock-raising; the herbage is most luxuriant during the months from May to October. He says he never saw cattle thrive so quickly as the herd feeding on the prairie, no expense in keeping them, only the trouble of cutting and saving sufficient hay from the natural hay meadows for their consumption during the winter. This is often hard work—heat and the mosquitoes often make it \"hot\" for the haymakers—but breaking the land is also hard work, yet, there is the consolation that if the bodily exertion is great the mind is comparatively at rest, there being no \"pay nights,\" rates or taxes to think about, or the half-yearly rent audit to attend, which has given so many farmers such days and nights of anxious thought during the last few years. Those best suited for this country are I think the small tenant farmers, who, with their wives, sons and daughters, have all been accustomed to work; in a few years they would be independent and their children well off.\n\nI like the winter season, but last winter being an exceptionally mild one, I am not a competent judge. The summer has throughout been perfection. Many Ontario people tell me they prefer this climate to that of Eastern Canada, the heat in summer not being so sultry, and the night's always cool, and although the thermometer is several degrees lower in the winter, the air is so dry that they feel the cold less here than there, and it is certainly most healthy. Young farmers with plenty of energy and small capital cannot do better than come to the North-West. I would beg of those inclined to criticise severely this—our year's experience in the North-West—to remember that it is written from a log shanty where four children are doing their lessons, and with my attention constantly divided between baking, churning, cooking, washing, and every other domestic duty, and that which now is fast drawing to a close.\n\nI have the greatest pleasure in recommending all intending to emigrate to take their passage in the Allan Line vessels, this is not only from my own experience of one short voyage, but of all whom I have met; those who came out in these steamers were in every way satisfied and could not speak too highly of their accommodation. E. L. A.\n\nNov. 16, 1881.\n\nOwing to limited space a great number of valued letters, pointing out the unparalleled fertility of the soil of this Little Saskatchewan country, and its adaptability to farming and stock-raising, are crushed out. However, I select a few letters, written by members of each of the three nationalities, which blend so well together in this great lone land.\n\"Having travelled over a good part of Manitoba and the North-west Territory before settling here, I have come to the conclusion the county of Minnedosa is the best adapted for settlement of any part I have seen, for the following reasons:\n\n1. \"I consider the soil unsurpassed for the maturing of wheat, oats, barley, and all kinds of roots and vegetables.\n\n2. \"Wood being of vital importance to settlers in this prairie country, I think for that reason the county of Minnedosa is better adapted for settlement than any other portion of Manitoba west of Winnipeg.\n\n3. \"As good water is of great importance for the use of settlers and for manufacturing purposes, I think the county of Minnedosa well supplied in that respect, as the Little Saskatchewan River runs across the county from north to south, it being a large stream of pure water, and probably the best adapted for milling and manufacturing purposes in Manitoba or the North-west Territory. Besides this, there are numerous small streams, and many ponds of good fresh water, and good water can be had by digging from 10 to 15 feet in any part of the county.\n\n\"I had this year under crop 21 acres. Wheat averaged 35 bushels per acre, and potatoes 350. My next neighbour had 40 bushels of wheat to the acre, and another 42. I think probably about 38 bushels to the acre would be the average in this neighbourhood. Oats would average 60 bushels.\n\n(Signed) ARCH. HARE,\nLate of Ireland.\n\nRose Valley, 15th November, 1881.\"\n\n\"I am a native of Scotland. Have lived many years in Ontario, sold out and came to Manitoba the summer of 1878, with my wife, daughter, and four sons. I preferred this Little Saskatchewan country to any visited; it has all the advantages a farmer requires for successful farming and stock-raising. I took up 320 acres of land for myself, and 320 acres for each of my three sons, and an additional 80 acres of timber land, in all 1360 acres. I am well satisfied with the country, and my sons are the same. We had 75 acres under crop this year, realising 2175 bushels of first quality grain, an all-round average of 30 bushels to the acre. All kinds of vegetables do well. Potatoes and turnips produce an enormous yield when properly attended to. But the proofs I have had of stock-raising convince me beyond doubt that this country is well adapted to this pursuit. I came in three years ago with 2 cows and 2 calves. These doing well, I purchased last year 3 cows, with calves at side. I have now 20 head, 10 milking cows and 10 young stock, all in...\"\nprime condition. After supply to family of seven adults, and rearing calves, I sold $150 worth of butter, or the price of three cows in one summer. The pasture cannot be beaten for cream and butter, and for young stock this country presents superior advantages.\n\n(Signed) DONALD ROSS.\n\nCadurces, Little Saskatchewan,\n28th December, 1881.\"\n\nThe following is Mr. Hugh McNabb's testimony. Mr. McNabb is a native of Scotland, and farms 320 acres, about six miles west from Minnedosa.\n\n\"My opinion is, this county of Minnedosa will be a good district for both farming and stock-raising. The land, when well tilled, brings excellent crops. But, everything is in favour of stock-raising. Hay is in abundance; summers keep costing nothing. Chances are good, and no discount on the land.\n\n(Signed) HUGH McNABB.\n\n28th Nov., 1881.\"\n\nThe following is the testimony of Mr. George Fox, a native of Wiltshire, England, his farm is about ten miles west of Minnedosa, on the 4th Correction Line.\n\n\"I count this district, or county of Minnedosa, cannot be beaten for farming and stock-raising. I came here in April, 1879. I have a wife and three children. I have now a comfortable dwelling house, stable, and cow house. I have this year fifteen acres under crop, and intend, God willing, to have at least thirty acres under crop next year. I had of wheat this year thirty-five bushels to the acre. Potatoes from six bushels planted, I have 120 bushels of excellent potatoes. I have saved fifteen tons of hay, and could have saved 100 tons, if required. I do all my work with one yoke of oxen. I am a native of Wiltshire, England.\n\n(Signed) GEORGE FOX.\n\n23rd Dec., 1881.\"\n\"I can vouch for this Little Saskatchewan country for being first-class for stock. I am a native of Dorsetshire, England. Came to Manitoba in the spring of 1880. I have a farm six miles south of Minnedosa, having a house and shippon in town. I butcher a great deal of beef, and supply the town with beef and milk. This country has far exceeded my expectations, I find the winter not at all as severe as one is led to believe from reports in England. I find no difficulty in wintering my stock. Hay is everywhere in abundance. I find 3½ tons of hay sufficient for a milking cow during winter, and when oat-straw can be had, less hay will do. Young stock is a very profitable investment here. My young cattle, purchased in June, have all sold at double their cost price.\n\n\"The Englishman who comes to this country determined to succeed, will find prosperity awaiting him in this Little Saskatchewan country.\n\nJOHN WAKE,\nLate of Dorsetshire, England.\n\n13th Dec., 1881.\"\nMr. Joseph Price writes from Hamilton House, Upper Tooting: \"I enclose an extract from a letter, just received, in reference to the new Canadian wheat-growing territory of Manitoba. The writer has had great experience in agriculture in the best farming country on the line of the Great Western Railway of Canada; he is therefore capable of giving a valuable opinion on the subject. Hearing that he had been looking at the Hudson's Bay Company's lands, I wrote to inquire the result, and his reply is so practical that you may consider it worth insertion in the Times, as it is a matter to which public attention is very much attracted just at present.\" The following is the extract: \"I have seen a great part of the province of Manitoba, also a part of the North-West Territory, and I believe it will be the greatest grain-growing country in the world. I have seen two crops harvested, which were fully equal to the best I have ever seen in Ontario, and the sample and quality of the wheat excellent. The returns gathered from the different railway agents and postmasters show the yield to average twenty-six bushels to the acre; oats, fifty-five to sixty; barley, thirty-five to forty. In some of the settlements wheat is said to average thirty-five bushels; oats, seventy-five to eighty. The quantity of land fit for cultivation is almost unlimited, and very easy to cultivate. I have seen very good crops of wheat on land that was broken up in the fall and dragged in the spring, which was all the tilling it got; but the usual way is to plough in the spring about two inches deep, and turn back two inches deeper in the fall, and then sow next spring. In this way thirty-five to forty-five bushels per acre is often grown. The country is settling very fast. The Canada Pacific Railway is running for about 180 miles west of Winnipeg, and there are two branches under construction. Manitoba and the British North-West differ very much from Minnesota and some of the North-Western States, as the land is more rolling, and has more groves of timber, it lies lower, and is less liable to storms; but the winters are very cold. Those who have wintered there say the weather is much pleasanter than in Ontario, although colder. I am satisfied there is no better field for the British agriculturist than Manitoba. If one-half of the land was under cultivation, it would supply more wheat than would be required in all Great Britain. It is also a splendid grazing country—having plenty of grass and hay for any quantity of cattle. Winnipeg is growing very fast; there are over 1000 buildings being erected this summer, and building lots are advancing in price very rapidly. Some people think it will be as large as Toronto within ten or fifteen years.\"\nANNANDALE, SALT LAKE, SHOAL LAKE, P.O.\n\n3rd January, 1882.\n\nN. D. ENNIS, Esq.\n\nDear Sir,\n\nA paragraph in the Rapid City Standard has just reminded me that your letter has been till now unanswered. I must plead election business as an excuse for my delay, and, if not too late, will be happy to give my experiences now as a settler in the Saskatchewan district.\n\nAs you know, it is not yet two years since I came to this country, and I may here state I never had any reason to regret the impulse which led me to settle here. Going into figures is going into dangerous ground, so I will keep out of them at present, and merely state that for a first grain crop I was more than satisfied, the total yield of about 50 acres being over 2000 bushels, oats and wheat. Barley a failure, owing to being sown on spring breaking.\n\nCrops must be got in early owing to summer frosts, to which this country is more or less liable, and it must be admitted that this matter is rather significant.\n\nFor those who do not care to risk the summer frosts there is abundance of scope in stock-raising, a branch which in my experience is much more profitable. Against this branch the long winter has been held up as a serious objection, and the quantity of hay it takes to winter each head; but as hay is very plentiful, and easily saved, this is indeed a very small item. The winter, though cold, is not severe, in fact, is preferable to the summer, and to an \"old country\" winter. I am sure you will get plenty of opinion more qualified than mine on the subject, though I am sure all will agree with me in that the Little Saskatchewan district can speak for itself, and only requires one to look over its prosperous and happy homes to be convinced that crops can be raised as heavy off the rolling prairie as they can off the dismal flats.\n\nNo one can wish you more prosperity than I in your endeavours to bring the Little Saskatchewan district more prominently before the great influx of settlers which we are sure to have next spring.\n\nYours very truly,\n\nW. PRINGLE JOHNSTONE,\n\nLate of 6 Mayfield Terrace, Edinburgh.\nBy the kind permission of Mrs. E. Sargent, wife of the English Church clergyman at Rapid City, I abstract the following paragraphs from her correspondence to \"The Church Guardian,\" published at Halifax, N.S. \"We are charmed in every way with the country; and once we get the railways, which will soon be now, this will be a most flourishing place. That this is already a rapidly growing place is proved by the fact that since our arrival in May, thirty-seven new houses have been built in the town, to say nothing of the numberless houses put up this summer on homestead lands. In Minnedosa, fifteen miles from here, which is also in charge of my husband, a church is to be built directly; and again, in the \"English Reserve,\" twelve miles in another direction. Besides the three stations I have mentioned, my husband has regular services fifteen miles north of Minnedosa, and a station twenty miles west of this. Then he is to make occasional visits to Shoal Lake, the Indian Reserve, and other out-stations. As the country grows the number of missionaries will increase.\n\nThe country far exceeds our expectations: the capabilities are wonderful; there is none of that isolation we were rather afraid of. Every available homestead has been taken up for miles round, and the railway lands are beginning to be bought up:\n\nThe size to which potatoes grow here, always without manure, is wonderful, and still not in the least coarse, but delicate, white, and floury. My husband calculates that our little patch has yielded at the rate of from 700 to 800 bushels to the acre. This country is extremely interesting to me, and I cannot help liking to interest our dear friends at home, too, in it.\n\nYours very truly,\n\nE. SARGENT.\n\nRapid City, November, 1880.\nALLAN LINE\nRoyal Mail Service to Canada.\n\nTHE SHORT ROUTE\nFROM\nGREAT BRITAIN TO CANADA, MANITOBA,\nAnd the Great North-West.\n\nPassengers bound to any part of CANADA or the GREAT CANADIAN NORTH-WEST should, in the first place, take care to secure their Passage in a STEAMER BOUND DIRECT FOR\n\nQuebec or Halifax.\n\nThe Steamers of this Line afford the greatest amount of comfort to all classes of Passengers being furnished with every modern improvement.\n\nThe Voyage to Quebec has distinguished recommendations as compared with the other routes to the American Continent. From land to land the average passage is not more than six days. Once within the Straits of Belle Isle, ocean travelling is over, and for hundreds of miles the Steamer proceeds, first through the Gulf and then through the magnificent River St. Lawrence. This is an immense advantage.\n\nThe ALLAN LINE is under Contract with the Canadian Government for the Conveyance of ASSISTED PASSENGERS to Canada.\n\nApplication for Assisted Passages to be made upon the Special Forms which are provided for the purpose.\n\nFull particulars of Passage Rates, Dates of Sailing, &c., can be obtained from the Agents of the Line,\n\nALLAN BROTHERS & CO., James Street, Liverpool.\nALLAN BROTHERS & CO., Foyle Street, Londonderry.\nJ. & A. ALLAN, 70, Great Clyde Street, Glasgow.\nJAMES SCOTT & CO., Queenstown.\n\nOR ANY OF THEIR LOCAL AGENTS.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001064.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 49, "total-input-tokens": 68276, "total-output-tokens": 26698, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 303, 1], [303, 303, 2], [303, 603, 3], [603, 603, 4], [603, 1824, 5], [1824, 1824, 6], [1824, 4809, 7], [4809, 7955, 8], [7955, 10342, 9], [10342, 13619, 10], [13619, 16729, 11], [16729, 19874, 12], [19874, 22791, 13], [22791, 26027, 14], [26027, 28960, 15], [28960, 31587, 16], [31587, 34325, 17], [34325, 36808, 18], [36808, 39776, 19], [39776, 42447, 20], [42447, 44490, 21], [44490, 47155, 22], [47155, 49783, 23], [49783, 52368, 24], [52368, 55371, 25], [55371, 57979, 26], [57979, 59986, 27], [59986, 62211, 28], [62211, 64939, 29], [64939, 67366, 30], [67366, 70053, 31], [70053, 71941, 32], [71941, 73666, 33], [73666, 76410, 34], [76410, 78467, 35], [78467, 79439, 36], [79439, 81990, 37], [81990, 85349, 38], [85349, 88316, 39], [88316, 91431, 40], [91431, 94536, 41], [94536, 97439, 42], [97439, 99969, 43], [99969, 101622, 44], [101622, 102589, 45], [102589, 105338, 46], [105338, 107436, 47], [107436, 109189, 48], [109189, 110571, 49]], "primary_language": ["en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]