[{"id": "94384481166adb596c1b9c7164391faf010a51c9", "text": "ASSEMBLÉE LÉGISLATIVE\n\nLE\n\nCHEMIN DE FER PROJETÉ\n\nDES COMTÉS DU SUD\n\nDORCHESTER BELLECHASSE MONTMAGNY\nL’ISLET\nKAMOURASKA\n\nDiscours de MM. Faucher de Saint-Maurice, Marcotte et autres députés faits à ce propos à l’Assemblée Législative le 19 mai 1886\n\nDISCOURS\n\nDE\n\nM. FAUCHER DE SAINT-MAURICE\n\nSUR LA QUESTION RIEL\n\nQUÉBEC:\nDE L’IMPRIMERIE DE L. J. DEMERS & FRÈRE,\nEditeurs-Propriétaires du Canadien.\n\n1886\nASSEMBLÉE LÉGISLATIVE\n\nLE CHEMIN DE FER PROJETÉ DES COMTÉS DU SUD\n\nDORCHESTER BELLECHASSE MONTMAGNY L'ISLET KAMOURASKA\n\nDiscours de MM. Faucher de Saint-Maurice, Marcotte et autres députés faits à ce propos à l'Assemblée Législative le 19 mai 1886\n\nDISCOURS DE M. FAUCHER DE SAINT-MAURICE SUR LA QUESTION RIEL\n\nQUÉBEC:\nDE L'IMPRIMERIE DE L. J. DEMERS & FRÈRE,\nEditeurs-Propriétaires du Canadien.\n\n1886\nL'article suivant publié sous le titre de \"Un projet important\" dans le Quotidien du 20 mai 1886, servira d'introduction à cette brochure où nous avons cru faire notre devoir envers la population de certains comtés de la rive sud du St-Laurent en réunissant en quelques pages, la plus importante discussion qui ait eu lieu en Parlement, depuis la Confédération, sur l'avenir et les progrès de Dorchester, Bellechasse, Montmagny, l'Islet et Kamouraska.\n\nLe Quotidien de Lévis s'exprime ainsi :\n\n\"On a discuté hier soir, le 19 mai, en Chambre un projet très important de voie ferrée qui partant de Lévis traverserait Dorchester et l'arrière des comtés de Bellechasse, Montmagny, l'Islet et Kamouraska pour se rendre jusqu'à Edmundston dans le Nouveau-Brunswick. Des explorations nombreuses ont déjà été faites pour étudier les régions par où passerait cette voie ferrée, et tous les rapports des ingénieurs s'accordent à dire que ces régions sont très fertiles et capables de donner place à plus de cinquante paroisses nouvelles.\n\n\"On comprend l'importance qu'il y aurait pour la rive sud à voir réaliser ce projet.\n\n\"M. Faucher de Saint Maurice, député de Bellechasse, qui s'est fait le champion de cette nouvelle ligne a parlé d'une façon fort habile de l'avenir qui est réservé à cette région du pays. Tous les députés de la rive sud l'ont secondé. Le député de Bellechasse aurait voulu former un comité spécial pour rassembler tous les documents et entendre tous les témoins qui pourraient donner à la Chambre des informations qui appuieraient une demande d'aide auprès des gouvernements. Il a été éloquemment suivi par M. Marcotte. Malheureusement, à cette époque avancée de la session, il était difficile d'accorder cette demande. Le gouvernement a promis cependant qu'une exploration complète serait faite de cette partie du pays. C'est un bon point de gagné.\n\n\"Nous félicitons les députés de Bellechasse, Dorchester et l'Islet de l'initiative qu'ils ont prise en cette circonstance. Les députés de Montmagny et de Kamouraska n'ont pu s'empêcher de déclarer, quoique cette proposition vint d'un adversaire, que le projet était magnifique et digne de l'attention de nos hommes publics.\n\n\"Cette question intéresse vivement toute la rive sud en général et la\nville de Lévis d'une façon particulière puisqu'elle est destinée à devenir le terminus de cette nouvelle voie ferrée.\"\n\nNous sommes certain qu'elle aura une solution dans un avenir très rapproché.\n\nUn ministre, l'honorable M. Flynn l'a laissé entendre d'une manière formelle.\n\nAu cours de cette importante discussion qui intéresse si vivement des milliers et des milliers de colons, le soliciteur-général a dit :\n\n— \"Le gouvernement prend le plus grand intérêt à la construction des chemins de fer et la question posée par M. le député de Bel-lechasse s'impose. Tôt ou tard la chose devra être réglée dans le sens de M. Faucher de Saint Maurice.\"\nASSEMBLÉE LEGISLATIVE\n\nLA\n\nLIGNE DES COMTÉS DU SUD\n\nSur motion de M. Faucher de Saint-Maurice, il est émis un ordre de la Chambre, pour copie de la correspondance échangée entre le Révérend M. Boulet, curé de St-Magloire, M. Faucher de Saint-Maurice, M. P. P. et plusieurs autres personnes et le gouvernement de Québec, au sujet d’une voie ferrée qui passerait à travers les terres qui s’étendent sur les confins de Dorchester, de Bellechasse, de Montmagny, de l’Islet et de Kamouraska.\n\nM. Faucher de Saint-Maurice propose aussi que, le 2 juin 1884, la résolution suivante a été acceptée unanimement par l’Assemblée Législative :\n\n“ Résolu, Que la frontière sud des comtés de Beauce, Dorchester, Bellechasse, Montmagny, L’Islet et Kamouraska, se prête à la construction d’une voie ferrée, allant se raccorder à Edmunston au chemin de fer du Nouveau-Brunswick.\n\n“ Que, d’après les renseignements donnés officiellement, il est impossible de trouver ailleurs de meilleures terres pour la culture.\n\n“ Qu’il faudrait peu d’efforts pour diriger la colonisation vers cette région fertile et l’ouvrir à l’industrie et à l’agriculture.\n\n“ Que des paroisses pourraient s’ouvrir sur la frontière sud des comtés de Beauce, Dorchester, Bellechasse, Montmagny, L’Islet et Kamouraska, où des milliers de nos compatriotes trouveraient, sinon l’abondance, au moins l’existance fière, honnête et indépendante.\n\n“ Que la Province de Québec faciliterait ainsi le repatriement de nos\n\"compatriotes actuellement aux États-Unis et empêcherait une émigration qui est une cause d'affaiblissement.\n\n\"Qu'il est de l'intérêt de la Province de Québec d'ouvrir au commerce et à l'agriculture, la frontière sud des comtés de Beauce, Dorchester, Bellechasse, Montmagny, L'Islet et Kamouraska, et que le meilleur moyen d'y parvenir serait la construction d'une voie ferrée, allant se raccorder à Edmundston, au chemin de fer du Nouveau-Brunswick.\n\n\"Que l'Assemblée Législative présente une adresse à Son Honneur le Lieutenant-Gouverneur l'assurant que cette construction est d'une importance vitale pour le développement commercial et agricole de la frontière sud des comtés de Beauce, Dorchester, Bellechasse, Montmagny, L'Islet et Kamouraska.\n\nQue le discours du trône renferme le paragraphe suivant :\n\n\"Un projet de loi vous sera présenté pour permettre au gouvernement de faciliter la construction plus prompte de certaines voies ferrées destinées à donner une grande impulsion à la colonisation, à l'agriculture et au commerce dans les régions qu'elles devront parcourir, et cela sans augmenter les responsabilités ou obligations de la Province.\"\n\nQue l'Assemblée Législative de la Province de Québec a admis unanimement le 2 juin 1884, qu'il était de l'intérêt de la Province de Québec d'ouvrir au commerce et à l'agriculture la frontière sud des comtés de Beauce, Dorchester, Bellechasse, Montmagny, L'Islet et Kamouraska et que le meilleur moyen d'y parvenir serait la construction d'une voie ferrée.\n\nQu'un ordre de la chambre a été voté unanimement le 12 avril cou rant demandant,—copie de la correspondance échangée entre M. Henry O'Sullivan, ingénieur et arpenteur provincial, et le département des chemins de fer de la province de Québec, à propos de l'inspection d'une route plus avantageuse que celle déjà inspectée pour relier le réseau des chemins de fer du Nouveau-Brunswick aux chemins de fer de l'Intercolonial; le Grand Tronc, le Pacifique Canadien, à Québec.\"\n\nQu'il soit résolu :—Qu'un comité spécial soit nommé pour s'enquérir de tous les faits se rapportant au projet d'une ligne courte de chemin de fer passant par un ou par les comtés mentionnés dans la résolution voté unanimement le 2 juin 1884 par l'Assemblée Législative de la Province\nde Québec avec mandat et pouvoir d'envoyer quérir personnes, papiers et documents ou rapports se rapportant aux études faites par divers arpenteurs et spécialistes sur une ligne courte passant à travers le ou les comtés mentionnés dans les résolutions acceptées unanimement par l'Assemblée Législative le 2 juin 1884 ; que le comité fasse un rapport complet des témoignages entendus et de la procédure sur le référendum et que MM. Audet, Bernatchez, Marcotte, Gagnon, Deschênes, Asselin et le moteur composent ce comité.\"\n\nM. Faucher de Saint-Maurice.—En faisant ces deux propositions je n'ai pas la prétention de découvrir à l'Assemblée Législative un pays nouveau. Non : la zone fertile qui s'étend en arrière de Dorchester, de Bellechasse, de Montmagny, de l'Islet, de Kamouraska est connue maintenant du public, grâce aux rapports des spécialistes et des arpenteurs.\n\nL'un d'eux disait :\n\n\" Au sud du fleuve Saint-Laurent, en avant de Québec, depuis la Rivière du Sud jusqu'à la Rivière du Loup, le long du chemin de fer Intercolonial, l'étendue des terrains cultivables est très limitée.\n\n\" On peut dire que sur tout ce parcours, il y a des rangées de montagnes de 500 à 1000 pieds de hauteur qui courent parallèlement au fleuve Saint-Laurent et n'en sont éloignées que de deux à six milles.\n\n\" On trouve ici et là des rochers escarpés, séparés par des vallées unies, mais, en général, les rangées de montagnes ne sont interrompues que par les lits profonds des cours d'eau qui coulent pour la plus grande partie au nord et au sud et n'offrent aucun accès facile à la région de l'intérieur.\n\n\" Ces rangées de collines et de montagnes sont pour la plupart rocheuses, incultivables, et on les garde comme terres à bois pour les habitants des vieux établissements qui bordent le fleuve Saint-Laurent.\n\n\" En arrière et au sud de ces montagnes, il y a une région fertile qui s'étend vers la frontière des États-Unis et qui traverse le chemin Taché à une distance de 20 à 25 milles du Saint-Laurent.\n\n\" On a ouvert en partie cinq ou six routes qui font communiquer ce chemin avec le Saint-Laurent ; mais, en dépit des sommes considérables dépensées par le gouvernement sur ces chemins, la grande difficulté de les entretenir en bon état de réparation, ou même passables, à travers les rangées de montagnes plus hautes décrites, a toujours été et sera toujours un obstacle sérieux à la colonisation des terres fertiles de cette région, à moins qu'on ne leur donne des facilités de communication aux\nmoyen d'un chemin de fer passant dans les vallées de la rivière du Sud et de la rivière Noire, plus haut décrites.\n\n\"Des colons se sont rendus dans cette région à maintes et maintes reprises depuis une vingtaine d'années, mais à raison des difficultés d'accès exposées plus haut, il n'y a été établi que quatre paroisses : Armagh, Saint-Magloire, Saint-Paul et Saint-Pamphile.\n\n\"Je suis informé de bonnes sources qu'au bout du chemin de l'Islet, il y a quarante-six érablières d'établies. Le long du chemin Taché, à portée de cette endroit et allant vers l'ouest jusqu'à Saint-Paul, il y a un bon nombre de colons qui parlent dans les termes les plus encourageants du sol et du climat de cette région. Quelques-uns des colons, les plus anciens et les plus dignes de foi, m'ont assuré qu'ils ont fait successivement sans fumure, jusqu'à quinze, seize et dix-sept récoltes payantes dans le même terrain.\n\n\"Le terrain est indubitablement rocheux en beaucoups d'endroits ; mais, il n'y a que très peu de gros cailloux et d'effeulements de roc solide : les hautes futaises d'épinettes blanches, de merisiers, d'érables, etc., indiquent un sol sèche. Il y a du cèdre en abondance dans les terrains bas, ainsi que du frêne et de l'orme le long des cours d'eau. Le plus beau bois de pin a été enlevé, mais il y a en abondance de l'épinette propre à faire des billots de sciage et du bois de construction. Le bois nécessaire à la construction d'un chemin de fer se trouve en quantité le long de la ligne.\n\n\"Sur le lot numéro 6 du canton de Patton, à une distance d'un mille et demi,—et à une élévation d'environ 300 pied au-dessus des terrains environnants—du plus haut sommet de la ligne de partage des eaux coulant vers le Saint-Laurent et la baie de Fundy; un nommé Michel Bernier m'affirme qu'il a récolté 76 minots d'orge de la semence de 4½ minots et que sur le même lot il a fait d'excellentes récoltes, d'avoine, de blé, de foin, de pommes de terre, etc.\n\n\"Le 24 février, j'ai mesuré l'épaisseur de la neige et j'ai trouvé 18 pouces dans les forêts de bois mou, et 2 pieds dans les forêts de bois dur.\"\n\nVoilà ce que disent les rapports d'arpenteurs.\n\n\"Est-ce qu'à son tour, l'an dernier, le curé Boulet—et cet apôtre est pour la colonisation du sud de Bellechasse, ce que le curé Labelle de St-Jérôme est pour le nord—est-ce que le curé Boulet en m'écrivait pas la\nlettre suivante que j'ai eu, dans le temps, l'honneur de communiquer à la chambre ?\n\nEn la lisant, je la faisais précéder des remarques suivantes :\n\nUn pays riche, connu que des missionnaires, des trappeurs et des bûcherons, s'étend en arrière des comtés de Beauce, de Dorchester, de Bellechasse, de Montmagny, de l'Islet, de Rimouski. Tous les rapports officiels que nous possédons s'accordent sur la fertilité du sol, sur la richesse des essences forestières. On y a trouvé des gisements minéraux de la plus grande richesse, entr'autres des indices de cinabre.\n\nPuis je lisais aux applaudissements de la chambre cette lettre du curé Boulet. Elle disait :\n\nSt-Magloire, 10 Mars 1884.\n\nMonsieur,\n\nJe vois par les journaux que vous travaillez vous et vos amis, à la future construction d'un chemin de fer qui devrait passer sur la frontière sud des comtés de Beauce, Dorchester, Bellechasse, Montmagny, l'Islet et Kamouraska. C'est une belle œuvre patriotique, une heureuse idée qui aurait dû trouver sa réalisation depuis des années.\n\nEt voici pourquoi :\n\nEn arrière des comtés nommés plus haut, il y a une vallée magnifique qui se prête admirablement à la construction d'une voie ferrée ; il n'y a ni côtes, ni rochers. Partant de Metgermette en descendant vers Edmunstone, on trouve toujours la plaine unie et fertile. La compagnie qui voudrait y construire un chemin de fer trouverait tous les matériaux sur les lieux. Partout, il y a des beaux cèdres, de l'épinette rouge.\n\nIl est impossible de trouver ailleurs de plus belles terres ; je suis certain d'après ce que j'ai vu moi-même et ce que j'ai pu visiter avec l'intention d'y diriger la colonisation, qu'il n'y a pas de différence entre cette belle vallée de Daaquam et celle de la Beauce. Partout on trouve des rivières et des lacs, partout on rencontre de beaux pouvoirs d'eau pour manufactures et moulins. Il faudrait bien peu d'efforts, il me semble, pour diriger la colonisation vers cette zone fertile.\n\nPartout sur les bords des rivières et dans la plaine j'ai vu de magnifiques terres. On peut en juger par les essences fruitières qui y croissent en abondance. Partout on cueille la gadelle sauvage ; la groseille, la cerise, les rosiers et la vigne sauvage réussissent en abondance. On dirait d'un jardin. Le foin bleu y abonde, et quelques colons vont le couper et l'enlever pour leur utilité.\nSi on laisse le bord des rivières pour s'enfoncer de un ou deux milles dans la forêt, on y rencontre les plus beaux bois. L'érable, le merisier, le frêne, l'orme, le bouleau, l'épinette-rouge et blanche, un peu de pins beaucoup de beaux cèdres, tout cela est en abondance. On ne rencontre pas de montagnes, seulement au milieu de la vallée il y a une légère élévation de terrain.\n\nPourquoi nos gouvernants ne dirigeaient-ils pas la colonisation de ce côté-là? Nous pouvons y établir de magnifiques paroisses, ou des milliers de Canadiens-Français trouveraient sinon l'abondance, du moins l'existence aisée et confortable.\n\nLe sol se prête très bien à toute espèce de culture. Tous le grains y viendraient à merveille, et le foin s'y récolterait en abondance. Le climat est plus doux que celui du Nord et du Saguenay. Nous n'aurions pas à redouter les vents froids qui désolent ces régions. De partout surgissent des points de vue admirables ; la chasse et la pêche y sont inépuisables.\n\nLe gouvernement devrait, avant tout, encourager la compagnie de chemin de fer qui voudrait passer par ce pays, qui est une des plus belles parties, sinon la plus belle et la plus fertile de la province de Québec.\n\nPourquoi par exemple, ne pas faire relever les lignes des cantons de ces régions, surtout celui de Daaquam, et cela au printemps? Pourquoi ne pas mettre quelques milliers de piastres, cet été, à la construction d'une route qui traverserait le centre de ce canton et permettrait aux colons de s'y établir de suite? Que le gouvernement se rende à ce désir : tous les curés voisins ont promis d'envoyer des colons dans ce merveilleux pays.\n\nDans quelques années d'ici, on verrait de ce côté, de belles et riches paroisses canadiennes-françaises. Il ne reste plus qu'une voie de salut pour le Canada français, s'il tient à conserver sa religion, sa langue et sa nationalité ; c'est la colonisation. Qu'on s'engage hardiment dans cette voie, et vous verrez bientôt notre chère patrie prendre du prestige et garder sa force.\n\nPartout ailleurs, on voit des étrangers s'emparer de notre pays, et nous, les enfants du sol, nous resterions inactifs ? Non. Aidons aux nôtres dans leurs travaux : ouvrons leur des chemins, et vous verrez bientôt des milliers de bras travailler pour l'agrandissement de la patrie et veiller à sa défense et à son honneur.\n\nMon cher monsieur, voici à peu près tous les renseignements que je\npuis vous donner sur cette partie du pays, que vous représentez. Tra-\nvaillez fortement en notre faveur, et Dieu fera le reste.\n\nServez-vous de ces notes si elles peuvent vous aider en quelque\nchose et excusez ce qu'elles peuvent avoir de défectueux ; je suis\nloin d'être un écrivain.\n\nLes plus sincères amitiés de votre dévoué,\n\nJ. B. G. BOULET, Ptre\n\nAprès la lecture de cette lettre si belle, si patriotique, si touchante,\nles commentaires sont superflus. Elle résume en peu de mots toutes les\nressources agricoles, minérales et forestières que Québec pourrait\nretirer de ce pays laissé à lui-même, de cette terra incognita.\n\nEmparons-nous du sol ! Telle était la devise de nos pères ; telle doit\nêtre la nôtre.—Un homme distingué avec qui je causais dernièrement\nde la colonisation canadienne, M. Achintre, du Monde, faisait à ce\npropos des remarques fort logiques. Entr'autres choses, il disait, en\nparlant de nos pères et des temps reculés de la colonie : \"Pour qui\nconnaît aujourd'hui la topographie des lieux, la nature du pays, les\ndangers à prévenir, les ennemis à combattre, les établissements à créer,\ntous les obstacles qu'il fallait vaincre en ce Canada alors inconnu,\nlequel de ceux-là oserait mettre en doute les qualités des colons,\nl'aptitude de la race, l'habileté de l'administration française à cette\népoque.\n\n\"Que l'on jette un coup d'œil sur la carte du Bas-Canada, et que\nl'on y suive, depuis l'origine jusqu'à nos jours, le développement de\nl'idée qui présida à la création des groupes, au choix des localités, des\npremiers villages, à cette disposition savante de lignes d'établissem-\nments, courant parallèlement au fleuve et gagnant les profondeurs par\nsérie de rangs, disposés en échelons, comme les régiments d'un corps\nd'armée à la veille d'une grande bataille.\n\n\"Assurer ses derrières et ses ailes, et prendre le fleuve comme base\nd'opération ! telle fut l'idée de jadis.—Elle reste encore de nos jours,\nla meilleure des tactiques, soit au point de vue de la guerre ou à\ncelui de la colonisation.\n\nCette tactique, notre devoir est de la continuer en étendant la coloni-\nsation des rives du Saint-Laurent à la frontière du Maine.—Représen-\ntant du Sud, je fais mon devoir en attirant l'attention du gouvernement\nsur cette belle partie de la province. Une voie ferrée suffirait pour donner à l'agriculture, au commerce, à l'industrie une région merveilleuse où le climat est plus doux qu'au Nord et au Saguenay. En préconisant le Sud, je suis loin de vouloir nuire aux efforts fait pour coloniser la Lièvre, la Rouge, la Matawan, le Nord, le lac Témiscamingue et le lac Saint-Jean. Non, dans notre beau pays, il y a place pour tous.\n\nLa province de Québec a une superficie de 120,764,651 acres. Sur ce grand total il y a 12,625,877 acres de terrains occupés : 6,410,264 acres de terrains améliorés ; 4,144,984 acres de terrains cultivés ; 2,207,422 en paturages et 54,858 en jardins. Reste comme grand total 108,138,774 acres de terres qui sont inexploitées !\n\nEn face de ces richesses latentes que nous avons sous la main, il est bien permis de se demander avec Doudan :\n\n\"La terre se repose terriblement chez nous. Reste à savoir si quelque moisson gigantesque sortira de ce grand loisir.\"\n\nCes moissons gigantesques, le Gouvernement peut les faire germer et il peut les forcer à pousser hors du sol.—Qu'il encourage la construction d'une voie ferrée en arrière des comtés de Dorchester, de Bellechasse, de Montmagny, de l'Islet, de Kamouraska, et Dieu et la race canadienne-française feront le reste.\n\nLe jour où l'Assemblée Législative acceptait unanimement ma résolution, je lui donnais aussi communication de cette importante lettre du Dr. LeSage, député de Dorchester aux Communes du Canada.\n\n\"Vos résolutions de chemins de fer, m'écrivait-il, expriment un désir qu'entretenaient depuis longtemps ceux qui réellement ont à cœur l'avancement de la colonisation de nos belles terres situées dans ces vallées admirables et malheureusement si peu connues.\n\n\"Vous faites bien de les soumettre à l'Assemblée Législative, dès cette session. Il y a urgence : il faut attirer l'attention des gouvernements fédéraux et locaux sur la localisation de cette ligne courte par la voie que vous indiquez, via Québec aux provinces maritimes.\n\n\"Toutes nos ressources financières, notre crédit même sont engagés au parachèvement du Pacifique, à son passage à Québec et à sa construction entière sur le territoire canadien.\n\n\"Voici d'après moi, le tracé que devrait suivre cette ligne projetée, pour atteindre ces résultats. Vous pouvez d'ailleurs suivre facilement ce tracé sur la carte des chemins de fer et en arriver à mes conclusions.\"\n\"De Lévis vous suivez la rivière Etchemin, puis faisant sud-est, le\nchemin de fer projeté poursuivrait sa course le long de la rivière\nFamine, de là il rejoindrait la rivière Daaquam, atteindrait bientôt la\nrivière Saint-Jean qu'il suivrait constamment jusqu'à Saint-Jean du\nNouveau-Brunswick, traversant ainsi dans sa course les comtés de\nBeauce, Dorchester, Bellechasse, Montmagny, l'Islet, Kamouraska,\nTémiscouata, où il se soudrait au chemin d'Edmunston à Saint-Jean.\n\nLa distance calculée est d'environ 340 milles en tout. Sur ce, il y\naurait à déduire les chemins déjà construits, tant ici que dans le Nou-\nveau-Brunswick.\n\nEn acceptant ce projet, nous aurions le Pacifique entièrement sur\nle sol canadien. Il passerait à travers de superbes terres qu'il ouvrirait\nà la colonisation : il nous donnerait ainsi la ligne la plus courte pour\ngagner l'Atlantique et il assurerait en tout temps le commerce de cette\nimmense voie ferrée à Québec.\n\nLa ligne que nous indiquons tous deux est la première qui ait été\nexplorée il y a cinquante ans, et c'était réellement la direction que\nl'Intercolonial aurait du suivre. Elle est la plus avantageuse. On voit\nencore les vestiges des explorations faites par les ingénieux royaux à\ncette époque.\n\nVos résolutions comportent un but patriotique. Mon cher Faucher\nde Saint-Maurice, vous ne serez pas isolé dans ce mouvement géné-\nreux et bien pensé. Le mouvement que vous provoquez a une actua-\nlité plus qu'ordinaire. Vous devez l'agiter non comme question locale,\nmais bien comme question d'intérêt général. Il faudrait des explora-\ntions. Comptez sur mon concours.\n\nVotre ami dévoué,\n\nDr. C. Le Sage, M. P.\"\nAvec cette lettre je donnais communication à l'Assemblée Législative de la dépêche suivante :\n\n**Département des chemins de fer de la Province de Québec.**\n\n*Bureau des Ingénieurs, Québec, 7 juin 1884.*\n\nM. Faucher de Saint-Maurice,\n\nM. P. P.,\n\nQuébec.\n\nCher Monsieur,\n\n\"J'ai lu avec beaucoup d'intérêt vos résolutions concernant votre chemin de fer de colonisation, et je les approuve sous tous les rapports.\n\n\"On peut construire une ligne excellente sur le parcours général que vous indiquez, à partir de la station de la jonction de la Chaudière, sur la voie du chemin de fer du Grand Tronc, via la rivière et le lac Etchemin jusqu'à la frontière, ce qui fera en tout une distance d'à peu près cent milles.\n\nMalheureusement, à cet endroit, la ligne atteindrait le territoire américain et se prolongerait au nord de la rivière Saint-Jean, sur un parcours d'à peu près vingt milles, et la longerait sur une distance de 70 milles, comme vous le constatez en consultant la carte.\n\n\"Il est possible de construire une ligne dans les limites du territoire canadien, mais comme les cours d'eau semblent tous prendre naissance dans cette direction, je crois que le pays est montagneux. On ne pourra, du reste, s'assurer de ce fait qu'en faisant un examen du terrain.\n\n\"Je suis tout à fait de votre avis, quand vous dites qu'on peut construire un chemin de fer praticable en passant sur le territoire canadien, ce qui serait d'un grand avantage pour les comtés dont vous parlez dans votre lettre.\n\nJ'ai l'honneur d'être etc.\n\nA. L. Light.\n\nIngénieur, membre de la Société Royale des Ingénieurs de Londres.\n\nAprès la lecture de ces documents, j'ajoutais :\n\nL'avenir de la Province de Québec est intéressé dans les résolutions de chemins de fer que je soumets en ce moment au pays. De sa réussite\ndépend le sort de grand nombre de paroisses nouvelles et l'exploitation de la contrée la plus riche et la plus ignorée de notre pays.\n\nVoilà ce que je disais l'an dernier, et depuis je n'ai pas changé d'opinion.\n\nCette année, un autre apôtre de la colonisation, le curé du Cap Saint-Ignace, vient de m'écrire ce qui suit :\n\nMonsieur,\n\nPermettez-moi de vous féliciter de l'initiative que vous avez prise pour la construction d'une voie ferrée au sud des comtés de Bellechasse, Montmagny, etc., etc.\n\nCette construction est le seul moyen efficace pour coloniser les cantons avoisinant le chemin Taché. Bien des efforts ont déjà été faits pour diriger le trop plein de nos vieilles paroisses vers ces cantons et jusqu'ici le succès n'est pas très florissant. On trouve les communications trop difficiles ; et le goût trop prononcé que nos jeunes gens ont déjà pour la république voisine augmente encore la lenteur dans l'exécution de nos plans de colonisation.\n\nPourtant, monsieur le député, il y a dans ces cantons place pour plusieurs paroisses et les terres sont excellentes. Pour ne parler de ce que je ne connais, je puis dire que la mission de Sainte-Apolline, dans Patton, promet de devenir une florissante paroisse et que le canton Talon qui avoisine les lignes offre encore un établissement plus avantageux. Mais... il faut s'y rendre ; il faut en sortir de temps en temps, il faut voir devant soi un débouché pour les produits, il faut donner aux colons les moyens de profiter des bois de toute espèce qu'ils ont sur leurs lots et, n'avoir sous les yeux qu'une mauvaise route de 7 et 10 lieues : c'est une perspective peu encourageante ! De tous côtés, on entend dire :— \"Si le chemin de fer passait par là, la colonisation marcherait rapidement.\"\n\nOui, M. le député, le chemin de fer, voilà le grand engin colonisateur. Que seraient encore les Cantons de l'Est sans le Grand-Tronc ? Pourquoi tous ces réseaux de chemin de fer qu'on entreprend dans le Nord ? Dans le but de coloniser et d'enraciner sur notre sol les enfants du pays qui nous quittent pour l'étranger. Il faut aussi aux beaux comtés de la rive sud un grand chemin de colonisation. Le gouvernement est trop éclairé pour ne pas comprendre et favoriser cette entreprise patriotique. La zone d'habitations est trop retrécie sur cette rive du Sud ; il faut\nqu'elle s'étende jusqu'à la frontière des États-Unis. Il y a place pour des milliers d'enfants du sol, qui un jour formeront sa force et sa richesse. Mais pour atteindre plus vite ce but désiré : Allons y en chemin de fer !\n\nBien à vous,\n\nN. Jos. SIROIS, Ptre.\n\nA peu près vers le même temps un de nos arpenteurs les plus distingués, M. O'Sullivan, me transmettait de précieux documents à propos de la ligne de chemin de fer que tous les députés de la rive sud voudraient voir construire.\n\n\"J'ai l'honneur de vous informer, disait-il, qu'en inspectant certains arpentages dans le district de Montmagny, conformément aux instructions de l'honorable Commissaire des terres, j'ai découvert une route qui, j'en ai la confiance, devra avoir pour résultat d'assurer une immense amélioration sur toute autre ligne explorée jusqu'à ce jour pour raccorder le réseau des chemins de fer du Nouveau-Brunswick à l'Intercolonial, au Grand-Tronc et au chemin de fer du Pacifique Canadien, à Québec.\n\n\"La course de cette route suit à peu près la ligne droite entre Québec et Edmunston et traverse la ligne de partage des eaux entre le St-Laurent et la rivière St-Jean, dans une cèdrière unie, à la tête de la rivière Noire.\n\n\"Muni de deux baromètres anéroïdes rectifiés et très justes, j'ai fait un examen minutieux de cette ligne depuis Québec jusqu'à un endroit sur la rivière Noire situé à environ deux milles au-delà de la ligne de partage des eaux plus haut mentionnée; et je puis dire en toute sûreté que sur ce parcours on peut localiser un bon tracé, avec des rampes n'excédant pas 30 à 40 pieds au mille et de légers travaux de terrassement. Je crois qu'une exploration soignée aurait pour résultat de démontrer un maximum de rampes de 30 pieds au mille.\n\n\"A partir de l'endroit où j'ai fini mon exploration il ne peut pas y avoir d'obstruction, car l'eau coule avec un courant uniforme dans la rivière Noire et la rivière St. Jean jusqu'à Edmunston, et généralement en ligne droite sur une distance d'environ quatre-vingt-dix milles. Il n'y a qu'une chute d'a peu près quinze pieds dans la rivière Noire et il n'y en a pas du tout dans la rivière St. Jean. Une paire de chevaux peut remorquer un bac chargé de cent barils de farine à partir d'Edmunston et en remontant la rivière St. Jean jusqu'au confluent de la rivière Daaquam, distance de plus de cent milles.\n\n\"La nature du pays est favorable à la construction de chemin de fer, les pentes sont généralement douces, le versant des collines uniforme\net il y a peu, s'il y en a, d'affleurements de roc solide : par conséquent, on peut trouver sur ce parcours des rampes faciles, n'exigeant que de légers travaux de terrassement.\n\n\"D'Edmunston à St. Jean, comme la ligne suit la rivière sur un parcours de 233 milles qui ne présente qu'environ 500 pieds de pente, on pourrait améliorer à volonté les rampes trop raides qui peuvent se rencontrer sur le chemin de fer actuellement en exploitation, de sorte qu'on pourrait établir un chemin de fer de première classe pour le transport du fret sur toute la distance comprise entre Québec et St Jean.\n\n\"Par cette ligne, la distance de Québec à Edmunston n'excédera pas 155 milles, ou de 40 à 50 milles de moins que par la voie de l'intercolonial et de l'embranchement de la Rivière du Loup à Edmunston, et les rampes peuvent être réduites à moins de la moitié de ce qu'elles seront sur cet embranchement.\n\n\"Cette ligne rendrait accessible et ouvrirait une vaste étendue de terrains cultivables et bien boisés qui se trouvent dans les comtés de Bellechasse, Montmagny, l'Islet et Kamouraska, et en touchant à la rivière St-Jean à son confluent avec la rivière St-François, amenerait aux marchés canadiens et au port de Québec les riches produits forestiers d'environ trois milles carrés du territoire des États-Unis, égouté par la rivière St-Jean et son tributaire la rivière Allaguash.\n\n\"En construisant la ligne de raccordement de Ste-Thérèse, la distance d'Ottawa à St-Jean, par le chemin de fer du Pacifique, par la ligne en question et par les chemins de fer actuels du Nouveau-Brunswick, serait d'environ 642 milles ; ce qui n'excède que d'une quarantaine de milles la longueur des lignes les plus courtes exploitées jusqu'à ce jour, en même temps que la supériorité des rampes et de l'alignement compenserait, et de beaucoup, cette augmentation de distance.\n\n\"Au point de vue du prolongement de la ligne artère du Canada vers l'est jusqu'à Louisbourg, cette ligne, avec les 40 milles du chemin de fer du Nouveau-Brunswick, entre Edmunston et le Grand-Saut, et de ce point par une ligne directe jusqu'à Moncton, formerait une distance, d'Ottawa à Moncton et à tous les points de la Nouvelle-Ecosse, de l'île du Prince-Édouard et du Cap.Breton, de 50 à 75 milles plus courte que n'importe quelle autre ligne praticable explorée jusqu'à ce jour.\n\n\"Durant la dernière session du parlement fédéral, on a représenté la contrée située entre le Grand-Saut et Moncton, comme impraticable pour la construction d'un chemin de fer. (Voir Débats, 10 juillet 1885). Les derniers rapports et les meilleurs que nous ayons sur cette contrée,\nincorporés dans le rapport de M. Sanford Fleming sur les explorations du tracé de l'Intercolonial, prouvent le contraire. On a constaté que cette contrée est toute praticable, à l'exception de quelques milles aux sources des rivières Miramichi et Tobique, et même là, M. Fleming dit que \"il y a raison d'espérer qu'une exploration soignée aurait pour résultat de démontrer qu'on peut trouver là un tracé praticable aussi bien qu'ailleurs.\" (Voir le rapport de M. Fleming, pages 30, 32, 58, 62, 63, 64, 69, 70, 75, 76, 142 et 143.)\n\n\"Je crois réellement que cette ligne directe de Québec à Edmundston peut devenir un chaînon important de la ligne artère du Canada. J'ai étudié la question, j'ai pris quelques notes sur tout ce sujet, j'ai préparé quelques tableaux des distances, etc., que je serai heureux de vous transmettre, si vous le désirez.\n\n\"Cette ligne possède des avantages particuliers qui n'ont besoin que d'être exposés pour assurer sa construction, même comme chemin commercial ou comme chemin de colonisation.\n\n\"Le sol est riche et cultivable le long de toute la ligne. À un mille et demi de ce sommet et à une hauteur de deux ou trois cents pieds au-dessus du sommet de cette ligne, sur la ligne de partage des eaux qui vont au Saint-Laurent et à la baie de Fundy, on a fait l'automne dernier de magnifiques récoltes de blé, d'avoine, d'orge, de pommes de terre, etc. Il est donc inutile de dire que si ce chemin de fer était construit, les terres qui sont maintenant inoccupées et qui se vendent 30 cents l'acre seraient bientôt prises avec plaisir à cinq et même à dix fois ce prix, et qu'une chaîne non-interrompue d'établissements s'étendrait en peu de temps de Québec à Edmundston.\n\n\"Comme de raison, cette ligne traverserait un coin du territoire des États-Unis ; mais comme nous avons le précédent du parlement votant des millions de piastres pour construire deux cents milles de chemin de fer à travers les États-Unis, construction qui aura pour résultat inévitable de diriger la masse du trafic canadien vers les ports américains, il ne peut pas y avoir d'objection à traverser cette pointe de l'État du Maine qui se prolonge au débouché de la rivière Saint-Jean. Ce ne serait tout simplement que reprendre ce qui nous appartient, car ce territoire nous appartenait autrefois. Il reviendrait pratiquement notre propriété, car il se peuplerait indubitablement en peu de temps de Canadiens qui n'auraient pour leurs produits d'autre débouché que nos marchés. Si l'on fait passer l'embranchement de la Rivière-du-Loup par la vallée de la rivière Saint-François, qui est son tracé naturel, cela donnerait, au besoin, une\nvoie passant sans interruption par le territoire canadien, mais augmenterait la distance de Québec à Edmunston de soixante ou soixante et dix milles, comparativement à la ligne droite.\n\n\"Avec ce chemin de fer passant par la rivière Noire et un pont à Québec, la vallée de la rivière Saint-Jean deviendrait bientôt pour le commerce de Québec un séjour d'alimentation (back country) non moins important que celle du lac Saint Jean, pour laquelle cette ville a fait de si grands sacrifices.\n\n\"Quant au pont sur le Saint Laurent à Québec, quelques-uns entretiennent la curieuse idée qu'il ne ferait que nuire au commerce de notre port en entraînant tout à Halifax.\n\n\"Québec est éloigné d'Halifax d'environ 678 milles par le chemin de fer Intercolonial et d'environ 530 milles par la voie la plus courte possible.\n\nQuébec est éloigné de Liverpool de 2,900 milles.\nHalifax est éloigné de Liverpool de 2,855 milles.\nDifférence en faveur d'Halifax seulement 45 milles.\n\n\"Mais le trajet soumis est plus court à partir de Québec de sorte qu'on peut dire que Québec et Halifax sont à la même distance de Liverpool.\n\n\"Ceci étant le cas, l'idée que Québec peut éprouver du tort de la part d'Halifax ou de tout autre port des provinces maritimes, tant que son port est ouvert à la navigation, équivaut à dire que l'on peut transporter pour rien, sur un parcours de cinq ou six cents milles de chemin de fer, les marchandises et les voyageurs.\n\n\"J'ai remarqué dans les journaux de Québec quelques écrits avocassant l'établissement d'un service de bateaux passeurs pour les convois de chemins de fer. Je considère l'établissement de ce service comme un gaspillage d'argent et même comme quelque chose de pire ; car si nous perdons notre temps à causer sur cet arrangement insuffisant, le pont de Lachine ouvrira au commerce un chenal si profond le conduisant aux ports des États-Unis, qu'il faudra des efforts surhumains pour l'en faire sortir.\n\n\"Sans un pont à Québec, le réseau des chemins de fer du Canada est incomplet. Le chemin de fer Canadien du Pacifique est forcé de se trouver un terminus d'hiver dans les ports américains, et la distance de Lachine au littoral des États-Unis est comparativement si courte; que si le terminus d'hiver est là, le terminus d'été y sera aussi et les ports de l'est du Canada resteront déserts.\"\n\"Il y a des millions et des millions d'acres de bonnes terres cultivables, bien boisées et bien égouttées dans la partie orientale de la province de Québec ainsi que dans le nord et le centre du Nouveau-Brunswick qui ne sont pas habitées et n'ont pas de chemin.\n\n\"L'étendue de terrains cultivables qui serait traversée par cette ligne entre le Grand Sault et Moncton, terrains qui ne sont pas colonisés à raison du manque de voies de communication par terre ou par eau, est immense.\n\n\"Cette ligne passerait aussi à 15 ou 20 milles des vastes houillères du Grand Lac, où l'on a déjà localisé un bon tracé de chemin de fer.\n\n\"Le grand avantage de cette ligne, c'est que sur tout son parcours d'Ottawa à St. Jean, il n'y a qu'une seule ligne terminée, au lieu qu'il y en a cinq ou six sur la ligne de Sherbrooke et Mattawankisg.\n\n\"La province de Québec et le Nouveau-Brunswick ont fourni leur bonne part des cent millions et plus dépensés pour explorer, tracer et construire des chemins de fer dans Ontario, Manitoba, Assiniboia, Alberta et la Colombie Anglaise. Pourquoi ces deux provinces ne pourraient-elles pas obtenir le vingtième d'un million pour faire explorer leur propre territoire ? En 1884-85, on a dépensé environ $57,000 en explorations de la ligne directe, mais cette somme a été presque toute dépensée dans l'État du Maine.\n\n\"Le gouvernement fédéral devrait faire explorer cette ligne : il devrait la faire explorer maintenant. L'intérêt que comporte cette ligne ; les avantages qui en découlent sont communs à Québec et à toutes les provinces maritimes, et si le gouvernement fédéral ne peut pas faire faire l'exploration de cette ligne maintenant, les gouvernements provinciaux devraient intervenir et faire faire de suite ces explorations à leurs frais. Dans tous les cas, la province de Québec devrait faire explorer la partie comprise entre Québec et Edmunston.\n\n\"Nous avons nominalemen le terminus d'été du chemin de fer Canadien du Pacifique à Québec ; mais pour l'avoir réellement et pratiquement il nous faut avoir un moyen de communication directe, par chemin de fer, avec la rive sud.\n\n\"La construction de ce chemin de fer de Québec à Edmunston déterminerait la construction du pont, en un mot ferait revivre le commerce et la prospérité de Québec.\"\n\nAinsi s'exprime M. O'Sullivan.\n\nVoilà des lettres, des documents précieux, des rapports que je collige depuis des années sur une question vitale pour les comtés du Sud,\ndocuments que je voudrais soumettre à une commission nommée par l'Assemblée Législative.\n\nVoilà M. l'Orateur, les raisons qui me font faire ces deux motions qui sont devant la Chambre. J'espère que l'Assemblée Législative va se rendre aux désirs des comtés de Bellechasse, de Dorchester, de Montmagny, de l'Islet, de Kamouraska et qu'elle permettra la formation d'un comité spécial chargé de s'enquérir de la possibilité de la construction d'une voie ferrée qui permettrait aux colons de fonder nombre de paroisses nouvelles, au lieu d'aller chercher à l'étranger le pain quotidien, toujours chèrement gagné, et le plus souvent ne rencontrer dans l'expatriation que la misère et l'abandon.\n\nD'ailleurs le discours du trône ne renferme-t-il pas le paragraphe suivant ?\n\n\"Un projet de loi vous sera présenté pour permettre au gouvernement de faciliter la construction plus prompte de certaines voies ferrées destinées à donner une grande impulsion à la colonisation, à l'agriculture et au commerce dans les régions qu'elles devront parcourir, et cela sans augmenter les responsabilités ou obligations de la Province.\n\nJ'espère que ce projet de loi va s'appliquer à Bellechasse, à Dorchester, à Montmagny, à l'Islet et à Kamouraska.\n\nIl est de la plus haute importance pour Québec, Lévis et les comtés du sud du Saint Laurent que les belles terres qui s'étendent en arrière de Bellechasse, Dorchester, Montmagny et l'Islet soient ouvertes à la colonisation. Or, le seul moyen d'y parvenir c'est de construire un chemin de fer.\n\nLe comité aura sans doute à examiner les travaux de MM. Light, Sullivan, Casgrain et autres ingénieurs et arpenteurs qui ont étudié les différents tracés des voies ferrées qui pourraient être construites dans les comtés mentionnés dans l'avis de motion. Il pourrait aussi se mettre en relation avec les vaillants et saints prêtres qui ont exploré ces régions et qui sont prêts à y fonder de nouvelles paroisses. Or, les curés d'Armagh, de St. Magloire, de Buckland, de St. Lazare, de St. Nérée, de St. Philémon, de St. Damien, de St. Gervais, de St. Raphaël, de Bellechasse, ceux des autres comtés corroboreront cet avancé devant la délégation de l'Assemblée Législative.\n\nLe public suivra avec intérêt les travaux de ce comité spécial, ou celui de toute autre commission que pourra désigner la Chambre avec instruction de mener à bonne fin ces études d'économie politique,\npratique, si utiles au développement du beau pays que nous ont légué nos ancêtres. (Applaudissements)\n\nM. BERNATCHEZ—député de Montmagny, parle dans le même sens. Il dit que la question s'impose. Il est vrai que certaines parties de ce pays sont rocailleuses mais-il y existe nombre de vallées fertiles. Il cite entre autres endroits le canton d'Ashburton. Il y a dans la région où l'on demande la construction d'un chemin de fer, place pour de nombreuses paroisses. De plus on y trouve une quantité énorme de bois de commerce.\n\nM. MARCOTTE—député de l'Islet.—Je suis heureux de seconder les efforts du député de Bellechasse dans cette circonstance, car tout ce qui est dans l'intérêt des comtés Sud en bas de Québec, m'intéresse comme représentant le comté de l'Islet. Il y a deux ou trois ans, M. l'orateur, lorsqu'il me pris la parole pour faire connaître à cette chambre les avantages de la colonisation du sud, j'attirai l'attention des hommes d'affaires sur la possibilité d'un chemin de fer dans cette partie du pays : je soumis à cette chambre des renseignements fournis par le Révd. M. Pelletier, curé de Ste-Germaine, et aussi un tracé incomplet, si vous le voulez, mais fort intéressant, d'un M. Hunter, chasseur du canton Arago.\n\nAujourd'hui je suis heureux de constater que cette idée prend de la consistance et que cette chambre est prête à favoriser un projet de chemin de fer à travers ces régions négligées jusqu'à présent.\n\nDans les remarques que je fis alors je conseillais à la ligne du chemin de Fraserville de vouloir bien diriger ses efforts vers le but analysé dans cette adresse.\n\nIl me semble, M. l'orateur, que si cette compagnie comprenait nos véritable intérêt, il serait plus naturel, plus avantageux pour elle d'ouvrir des relations, de se créer un commerce qui ne serait pas disputé par d'autres compagnies. Si la compagnie persiste à se rendre à Fraserville, qu'arrivera-t-il ?\n\nFraserville n'est pas un port de mer. Le trafic n'est pas assez considérable pour alimenter ce chemin de fer ; alors, il faudra nécessairement avoir recours à l'Intercolonial pour diriger ce commerce vers un port de mer quelconque. Mais si la compagnie traverse d'Edmunston à travers la fertile région du chemin Taché et vient rejoindre le Québec Central à St-François de la Beauce ou à un autre point quelconque de ce chemin de fer, alors elle n'aura pas à craindre la concurrence, et elle ouvrira une vaste région où l'on verra surgir de nombreuses paroisses comme\ncelles créées dans les bois francs par le passage du Grand-Tronc. Ensuite, M. l'orateur, cette embranchement de chemin de fer est un anneau indispensable à ce vaste réseau de ces chemins de fer que prévoyaient d'avance les créateurs du Pacifique.\n\nJe parlais il y a un instant de la fertilité du sol de la région du chemin Taché. Pour vous en donner une idée je vous dirai que moi-même, sur une terre que j'y possède, à une première semence j'ai récolté trente-trois minots de seigle de la semence d'un peu plus d'un minot, et de la semence d'environ quatre minots de blé j'en ai récolté cinquante-six. Vous voyez par là que ces terres ne céderont en rien aux terres de n'importe quelle autre partie du pays. J'aime à faire remarquer à cette Chambre que le rapport cité par l'honorable député de Bellechasse renferme quelques erreurs à propos des paroisses s'élevant dans les environs du chemin Taché.\n\nD'abord il ne mentionne pas la paroisse de Ste-Perpétue qui est assez ancienne et les paroisses de St-Marcel et de Ste-Appoline. Ces deux dernières ne sont qu'à leur début mais je suis certain que ces paroisses avec de l'encouragement pour les communications seront bientôt au niveau des autres paroisses échelonnées le long du chemin Taché.\n\nJ'espère, M. l'orateur, que le gouvernement ne se contentera pas de bonnes paroles en faveur de cette entreprise, mais qu'il prendra l'initiative pour mener ce projet à bonne fin. (Applaudissements.)\n\nL'honorable M. Flynn—député de Gaspé et solliciteur général, dit que le député de Bellechasse a déjà donné nombre de renseignements précieux à la Chambre touchant les comtés du sud, comtés qui, vu leur richesse, méritent certainement l'attention du pays.\n\nIl mentionne aussi un rapport très complet préparé par M. l'arpenteur O'Sullivan.\n\nIl regrette que la question se présente dans des circonstances telles que le gouvernement ne peut répondre d'une manière définitive. Le fait est qu'il croit la chose un peu prématurée. Du reste il faudra, avant que le gouvernement puisse accorder des subsides en terres ou autrement, qu'une compagnie soit incorporée, compagnie qui devra donner au gouvernement tous les renseignements désirables. Dans tous les cas la chambre doit être reconnaissante à M. Faucher de Saint-Maurice d'avoir attiré l'attention du gouvernement sur cette importante question.\n\nIl espère que le député de Bellechasse n'insistera pas sur l'adoption de sa demande, touchant la nomination d'un comité spécial. Vu que la\nsession est très avancée et vu le grand nombre des comités, les députés ne peuvent assister aux séances de plusieurs de ces comités.\n\nL'honorable M. Flynn ajoute que, la construction de cette ligne n'est pas exactement du ressort de la Législature, vu que chemin ne sera pas construit en entier dans la province. Cette question est du ressort du parlement du Canada et il ne croit pas que la chambre serait justifiable en intervenant. La question a été débattue au parlement fédéral et tous les renseignements possibles ont pu être obtenus.\n\nLe gouvernement prend le plus grand intérêt à la construction des chemins de fer et la question posée par M. le député de Bellechasse s'impose. Tôt ou tard la chose devra être réglée dans le sens de M. Faucher de Saint-Maurice.\n\nM. Flynn félicite ensuite le député de Bellechasse de l'esprit patriotique qui l'anime et dont il a souvent fait preuve. Il termine en invitant de nouveau M. Faucher de Saint-Maurice à ne pas insister.\n\nM. DÉCHÈNE—député de Témiscouata, dit partager les vues de l'honorable M. Flynn.\n\nM. GAGNON—député de Kamouraska, dit que ce que demande M. Faucher de Saint-Maurice ne constitue pas une source de dépenses. Il ne s'agit que d'étudier une question très importante. Il ne voit pas pourquoi le gouvernement s'oppose à la demande du député de Bellechasse.\n\nM. DESJARDINS—député de Montmorency, dit qu'en premier lieu ce comité ne serait d'aucune utilité vu que les documents et renseignements possibles sont déjà connus et sont entre les mains du gouvernement. La Chambre n'a qu'à les demander pour se les procurer. Du reste aucune compagnie n'est autorisée à construire ce chemin. S'il s'agit d'une ligne dont le point de raccordement sera à Edmunston cela deviendrait un chemin interprovincial et international, vu qu'une partie de la ligne passera sur une partie du territoire de Maine. Ce fait seul, fait de cette affaire une entreprise qui est du ressort du gouvernement fédéral. Il espère que tôt ou tard cette voie sera construite, mais elle ne le sera qu'à la condition qu'elle soit largement subventionnée par le gouvernement du Canada. En attendant la réalisation de ce projet, important sans doute, que nous voulons tous voir réalisé dans l'intérêt de la colonisation, il faut prendre garde à ne pas prendre d'initiative de nature à nuire à la construction du chemin de Fraserville à Edmunston. Les travaux sur ce chemin seront bientôt commencés et rapidement parachevés.\nM. Desjardins dit qu'il croit qu'à l'avenir la politique la plus favorable à adopter au sujet de la construction de chemins de fer, à l'exception de cas particuliers qui se recommanderaient tout spécialement, serait qu'ils fussent subventionnés par le gouvernement fédéral qui a si heureusement mis à fin la construction du Pacifique. Il va sans dire qu'il faut avant tout terminer le grand réseau de chemins de fer provinciaux, subventionnés par la province depuis plusieurs années. Il reste encore à terminer le chemin du lac Saint-Jean, celui des cantons au nord de Montréal, celui de la Gatineau, l'extension du Québec Central jusqu'à la frontière et quelques autres.\n\nM. Desjardins termine en disant que vu qu'aucun résultat pratique ne peut découler de la formation de ce comité, il propose l'amendement suivant :\n\nQue tous les mots après \"Que\" dans la motion soient retranchés et remplacés par les suivants : Que cette Chambre ayant par devers elle des rapports et documents qui donnent les renseignements désirables, ne croit pas qu'il y ait aucun avantage ou utilité appréciable à autoriser la formation d'un comité spécial pour tenir une enquête maintenant touchant le tracé d'une voie ferrée pour laquelle il n'y a, du reste, aucune compagnie incorporée par cette législature.\n\nM. GAGNON—député de Kamouraska, appuie fortement la motion faite par M. Faucher de Saint-Maurice.\n\nM. BEAUBIEN—député d'Hochelaga, se prononce contre la motion de M. Faucher de Saint-Maurice. Il n'en voit pas l'utilité.\n\nM. FAUCHER DE ST-MAURICE—député de Bellechasse, dit qu'il ne voit pas comment on peut dire qu'adopter sa motion serait empiéter sur le domaine du parlement fédéral. Comment peut-on dire que le fait que six ou sept députés s'occupent de leurs comtés dans un comité spécial, constitue une immixtion dans les affaires fédérales. Il veut donner à ses collègues l'occasion de se renseigner sur cette partie du pays. Il veut aussi aller devant ses électeurs munis des documents nécessaires pour faire une campagne en faveur de la colonisation et aussi pouvoir, aidé de ses collègues, essayer d'enrayez le courant d'émigration aux États-Unis. Il ne veut pas toucher aux privilèges du gouvernement fédéral. Ce qu'il veut est qu'on lui permette ainsi qu'à ses collègues qui représentent les comtés intéressés, de recueillir les documents importants qui sont de nature à faire connaître les sources de richesses qui existent dans la région située au sud des comtés de Bellechasse, Dorchester, Montmagny;\nl'Islet, Kamouraska, etc. Il espère que la chambre l'aidera dans cette œuvre patriotique.\n\nM. Faucher de St-Maurice. Il est de simple logique de s'enquérir si l'affaire doit être bonne avant de venir demander à l'Assemblée Législative de passer une loi incorporant une compagnie de chemin de fer. Or pour être bien renseigné sur les ressources que peuvent offrir les comtés de Bellechasse, de Dorchester, de Montmagny, de l'Islet et de Kamouraska, au commerce et à l'industrie, il faut passer par la voie d'un comité chargé d'étudier et de s'enquérir des faits.\n\nOn vient parler d'immixtion dans les affaires du gouvernement fédéral : mais y avait-il immixion de la part de l'Assemblée législative lorsque le 2 juin 1884, elle admettait unanimement qu'il était de l'intérêt de la Province de Québec d'ouvrir au commerce et à l'agriculture la frontière sud des comtés de Béauce, Dorchester, Bellechasse, Montmagny, l'Islet et Kamouraska, et que le meilleur moyen d'y parvenir serait la construction d'une voie ferrée ?\n\nAlors il y aurait eu immixtion dans les affaires fédérales lorsque Son Honneur est venu nous dire dans le discours du trône :\n\n\"Un projet de loi vous sera présenté pour permettre au gouvernement de faciliter la construction plus prompte de certaines voies ferrées destinées à donner une grande impulsion à la colonisation, à l'agriculture et au commerce dans les régions qu'elles devront parcourir, et cela sans augmenter les responsabilités ou obligations de la Province.\"\n\nNon, soyons logiques. Ce que je demande à la Chambre c'est de réunir en faisceau tous les renseignements éparpillés dans les différents départements, renseignements qui peuvent être si utiles au développement du pays.\n\nTous, s'ils ne s'entendent pas sur le tracé à suivre, tous concluent à la nécessité de la construction d'un chemin de fer passant par les comtés mentionnés plus haut.\n\nL'Assemblée Législative sait-elle que dans les comtés mentionnés dans mes motions, il y a de cinquante à soixante paroisses à créer ? Allons-nous laisser dormir toute cette force latente ? Notre race a besoin d'expansion. Elle est forte, elle est exhubérante. L'avenir est à elle, mais notre devoir de législateur est de la pousser, de la grandir, d'assurer son avenir. Le trafic, a dit le député de Montmorency, prend les routes qui lui convient. Alors que va-t-il faire de la colo-\nnisation qui, elle à son tour, crée le trafic ? Il nous a dit : \"Commen-\ncez par le commencement.\"\n\nBien, très bien ! pour moi le commencement de la voie ferrée de\nDorchester, de Bellechasse, de Montmagny, de l'Islet, de Kamouraska,\nce sera la formation d'un comité de la Chambre chargé d'étudier cet\nimportant projet.\n\nCe que je veux c'est étendre la paroisse, la PAROISSE qui a toujours\nété le cœur de la Nouvelle-France. Faisons pour les solitudes qui courent\nen arrière de Bellechasse, de Dorchester, de Montmagny, de l'Islet et de\nKamouraska, ce que jadis, Beaumont, St-Michel, St-Valier, St-Charles,\nSt-Raphaël ont accompli ce que le révérend M. Gingras curé de St-\nGervais fait encore de nos jours, ce que les curés et les habitants de-\ntant d'autres paroisses ont fait pour la colonisation. Entendons-nous. Don-\nnons les terres aux nôtres. Plantons des croix. Érigons des clochers.\nLevis et Québec ont besoin d'un back country, d'un pays d'alimentation.\nVous l'avez sous la main en formant un comité chargé de s'enquérir de\ntout ce qui peut aider à faire passer une voie ferrée en arrière des comtés\nmentionnés plus haut. Notre devoir est-il de laisser à la stérilité les\nbelles terres qui s'étendent entre ces comtés et la frontière du Maine ?\nNon ; les hommes passent, les idées restent. Plus tard quand nous irons\ndormir à côté des ancêtres qui ont illustré notre pays, je veux que l'on\npuisse dire de nous :\n\n— Ils ont travaillé comme les anciens, comme les ouvriers de la première\nheure, comme les vrais habitants; comme les descendants des proprié-\ntaires sans peur et sans reproches du sol de la Nouvelle-France. Ceux-là\nétaient dignes d'avoir de pareils aïeux. (Applaudissements prolongés.)\n\nL'honorable M. GARNEAU—député du comté de Québec, dit qu'il ne voit\npas l'utilité de la formation du comité demandé.\n\nL'honorable M. TAILLON, député de Montréal-Est et procureur général\ndit qu'il existe un comité, celui de l'agriculture et de la colonisation, qui\nest tout disposé à s'occuper de la chose.\n\nM. FAUCHER DE SAINT-MAURICE. Et bien s'il le faut nous irons au\ncomité d'agriculture, mais il y a déjà là bien de la besogne. Dans tous les\ncas que ce soit dans ce comité là, en chambre où ailleurs, je mettrai\ntoute mon énergie à faire valoir les privilèges des colons canadiens-français,\nsurtout ceux de Bellechasse. Ils ont droit à ouvrir de nouvelles terres.\nTant que je serai en chambre, je serai l'ardent avocat d'une voie ferrée,\ntraversant l'arrière des comtés de Bellechasse, Dorchester, Montmagny,\nl'Islet, Kamouraska, Lévis et Québec y trouveront leurs pays d'alimentation, et mes collègues et moi nous aurons la satisfaction du devoir accompli vis-à-vis de notre pays et vis-à-vis de ceux qui nous envoient en Parlement. (Applaudissement.)\n\nLa motion principale, telle qu'amendée par M. DESJARDINS—député de Montmorency, est de nouveau proposée.\n\nM. GAGNON—député de Kamouraska, propose en amendement, que les mots suivants soient ajoutés à la motion principale telle qu'amendée : \"Mais cette Chambre espère que le gouvernement fera explorer l'important territoire en question pour mettre la Législature en état d'adopter toute mesure propre à développer les ressources considérables de cette région.\"\n\nL'amendement est mis aux voix ; il est adopté.\n\nM. MARCOTTE—député de l'Islet, donne avis que jeudi le 27 mai il posera l'interpellation suivante : Le gouvernement se propose-t-il de faire explorer les cantons du sud des comtés de Bellechasse, Dorchester, Montmagny, l'Islet, Kamouraska et Témiscouata à l'effet de se renseigner sur la possibilité de la construction d'un chemin de fer à travers ces cantons, depuis St-François-de-la Beauce, jusqu'à un point quelconque du chemin de fer de Fraserville, ainsi que des richesses minérales et de la valeur de ces terrains ?\n\nL'Hon. M. FLYNN—député de Gaspé et solliciteur général, lui a répondu ce jour-là : Le gouvernement a déjà recueilli de précieux renseignements sur les cantons et le pays situés au sud des comtés de Dorchester, Bellechasse, Montmagny, l'Islet et Kamouraska. Il verra aux moyens à prendre pour les compléter et en faire bénéficier au plus tôt ces riches contrées.\nASSEMBLÉE LÉGISLATIVE\n\nAFFAIRE RIEL\n\nDISCOURS\n\nDE\n\nM. FAUCHER DE SAINT-MAURICE\nDÉPUTÉ DE BELLECHASSE\n\nPour satisfaire au désir que nous ont exprimé bon nombre des électeurs de la ville, de Bellechasse et des comtés du sud, nous reproduisons ici le discours prononcé par M. Faucher de Saint-Maurice, député de Bellechasse, sur la motion présentée par l'honorable M. P. Cameron, touchant l'exécution de la sentence de mort prononcée, dans les territoires du Nord-Ouest, contre Louis Riel, accusé du crime de haute trahison.\n\nM. l'orateur, j'ai été le premier qui ait envoyé à Ottawa un télégramme en faveur de Louis Riel. J'ai été un de ceux qui ont le plus protesté. J'ai écrit sous ma signature et sous ma responsabilité des articles dénonçant cette exécution.\n\nPour moi, Louis Riel ne saurait être entouré du nimbe d'un martyr. Je l'ai vu fou dans une asile d'aliéné. Cet homme pour moi n'a jamais été qu'un malheureux, dont l'intelligence a été touchée par la main de Dieu. Cela a toujours été ma conviction et je ne suis pas le seul à la partager.\n\nJ'ai vu Louis Riel; je le répète, fou à l'asile de Beauport, et depuis, lorsque je songe à cet homme, sa figure ne se représente plus à mon imagination que comme celle d'un halluciné. Est-ce que les docteurs Lachapelle, Clarke, Désaulniers n'ont pas émis cette idée?\n\nEt Mgr. Taché n'a-t-il pas dit:\n\n\"L'infortuné chef métis était en proie à une mégalomanie et à une théomanie qui, seules peuvent expliquer tous ce qu'il a fait jusqu'au dernier moment.\"\n\nLorsque le 16 novembre 1885 s'est dressé l'échafaud de Régina, j'étais de ceux qui pensaient comme l'honorable député de Saint-Hyacinthe. Ne vient-il pas de nous dire?\n\n\"Libéraux et conservateurs se donnaient affectueusement la main. Ils avaient des larmes dans les yeux.\"\n\nOui, je croyais que le temps se prêtait à une coalition. Le chef de l'opposition lui-même montrait l'exemple. Ne tendait-il pas la main, en ces temps là, à l'honorable M. Chapleau, à celui qui, d'après les éner-\ngiques paroles du Dr. Cameron, député libéral de Huìtingdon, il avait traité de scoundrel ? Né lui offrait-il pas de se faire alors un piédestal du cadavre de Riel ? Ne le tentait-il pas sur le haut de la montagne en lui montrant toutes les richesses imaginaires, tout le prestige réel du pouvoir ? Lui son ennemi, ne lui disait-il pas ? soyez le premier ; je serai votre marche pied. Ah ! oui, en ces temps-là, nous les patriotes, nous croyions à ces larmes, à ces manifestations. Nous croyions qu'un parti national pouvait se former, lorsque tout-à-coup deux hommes qui ne partagent pas toutes nos idées politiques, mais deux hommes qui ont laissé dans cette chambre deux vides difficiles à remplir, sont venus sonner le glas d'alarme.\n\nL'un, l'honorable M. Joly, député de Lotbinière disait :\n\n— \"Je suis d'opinion que les Canadiens-français ont la libre jouissance de leurs droits. S'ils n'en ont pas tiré un meilleur parti, ils ne doivent s'en prendre qu'à eux-mêmes. Je ne vois pas en quoi la formation d'un nouveau parti, le Parti National, pourrait améliorer leur position, mais je crois voir comment elle pourrait la rendre plus mauvaise et comment elle pourrait compromettre l'avenir de la Confédération.\"\n\nL'autre un sous-chef celui-là, M. Watts, député de Drummond et Arthabaska, le même qui avoua sa résignation qualifiée de déflection par l'Électeur, l'organe de son parti, assurait à son tour :\n\n\"J'ai dit et je répète que je n'ai pas confiance dans la sincérité des conservateurs-nationaux et que je ne voulais pas m'associer avec eux. Mes amis les croient sincères, qu'ils en fassent l'expérience. Je souhaite qu'ils ne soient pas trompés. Pour ma part pour ne pas entraver l'action de mes amis libéraux, j'ai préféré m'effacer.\"\n\nVoilà comment ces chefs libéraux appréciaient le mouvement qu'encourageaient les députés de Saint-Hyacinthe, d'Hochelaga et du comté de Québec.\n\nSi je n'avais consulté alors que mon intérêt personnel j'aurais pu me retirer de la vie publique, de cette vie où nous n'avons guère d'autre consolation que celle du devoir accompli. Lors de la mort du regretté M. Oscar Dunn, est-ce que les députés de Terrebonne, de Rimouski, de Laval, du comté de Québec, de l'Islet, Bagot, Clamplain, Saguenay et Chicoutimi, Joliette, Chambly, Bonaventure, Saint-Maurice, Charlevoix-Beauharnois, l'Assomption, Montmorency, Soulange, des Deux Montagnes, Nicolet, Laprairie, Dorchester, Maskinongé, Compton, Vaudreuil, Stanstead, Montcalm, Argenteuil, Québec-centre, Pontiac, Richelieu, Richmond et Wolfe, est-ce que ces députés ne m'ont pas sollicité pour\naccepter du gouvernement la position de secrétaire de l'Instruction Publique ? Ils sont ici présents. Vous même M. le président, député d'Yamaska, ne m'avez-vous pas demandé de me rendre à la conclusion de mes collègues ? N'ai-je pas répondu ?\n\nMessieurs et chers collègues,\n\n\"J'ai donné ma parole à mes électeurs d'être pendant cinq ans leur député. Cette parole est sacrée : je n'y manquerai pas, surtout au moment où mon collègue le député fédéral est en service de guerre au Nord-Ouest. Je suis investi presque du double mandat du comté de Bellechasse. Honnête de cette consigne, je tâcherai de l'accomplir, si mes forces ne me font pas défaut.\"\n\nCette parole je l'ai tenue au détriment de ma famille et de mes intérêts, mais je l'espère à l'honneur de Bellechasse. Le député de Saint-Hyacinthe le sait mieux que personne. Dans cette circonstance tout en restant loyal à mes commettants de Bellechasse, je m'efforçais devant le beau-frère du chef de l'opposition.\n\nCes choses là, je les dis non pas pour m'arrêter au déplaisir qu'elles peuvent causer à telles ou à telles personnes, mais parce qu'elle sont l'expression de ma conscience. Je ne veux pas que la haute position de député qui m'a été confiée par mes électeurs ne me coûte plus tard ni une tristesse, ni un remords.\n\nAinsi que l'a dit le député de Jacques-Cartier, il ne faut pas avoir une manière de parler à ses électeurs et une autre de parler à la Chambre. Pour l'Assemblée législative de Québec, ma conduite sera celle que j'ai tenue à l'assemblée de St-Charles de Bellechasse, lorsque mes électeurs s'étaient donné rendez-vous dans cette belle paroisse pour protester contre l'exécution de Louis Riel.\n\nEn ce jour de deuil je leur disais :\n\n\"Des résolutions vont vous être soumises. Comme député local je n'ai rien à y voir : elles ne concernent que le mandat fédéral, mais c'est mon droit de vous dire : en les discutant soyez calmes : soyez sans colère : soyez soucieux de votre dignité. Efforcez-vous d'être justes, car vous allez vous ériger en tribunal. Vous allez exercer vos prérogatives sur les affaires fédérales. Je n'ai pas à empiéter sur le mandat que vous avez donné au colonel Amyot. Vous avez confiance en lui et c'est un homme.\"\n\nVoilà ce que je disais alors à la face de mon comté. Ai-je été contredit en ce jour-là ? Ai-je le droit de tenir à la chambre un autre langage que celui que j'ai tenu à mes électeurs ?\n\nNon messieurs.\nIl y a quelques jours, lorsqu'on a discuté dans cette Assemblée Législative l'opportunité de télégraphier au premier ministre d'Angleterre pour le féliciter sur la position énergique qu'il prend sur la question irlandaise, n'ai-je pas proclamé que l'idée pouvait être excellente, mais qu'elle n'était pas relevante de notre législature ? Je vis au milieu des Irlandais, et plus que personne je puis les apprécier. En disant que le Home Rule ne nous regardait pas, je voulais rester logique avec moi-même, logique avec les attributions que la constitution donne à cette Assemblée Législative.\n\nNous ne devons pas oublier que la Province de Québec n'est pas seule dans la Confédération du Canada. Avant d'affirmer d'une manière aussi autoritaire son ascendant sur le pouvoir fédéral, elle doit se préoccuper de l'accueil qui serait fait à cette doctrine nouvelle par les autres provinces auxquelles l'attache les liens de la Confédération. D'ailleurs si nous avons le droit de blâmer ainsi, pourquoi n'aurions-nous pas aussi le droit de nommer une commission d'enquête, pour connaître bien la folie de Riel, enquête qui serait chargée de savoir si Riel et ses partisans, avaient bien le droit de prendre les armes ? Pour êtes justes, pour être logiques il nous faudrait suivre cette procédure parlementaire, qui n'est pas de notre ressort, du moins c'est mon humble avis.\n\nSi nous assumions cette responsabilité nous en paierions la façon. Je ne suis pas député de Bellechasse au local pour juger Louis Riel et toutes les conséquences qu'entraînent sa carrière. Je suis député de Bellechasse à l'Assemblée Législative pour faire voter les sommes de la colonisation. À chacun son mandat. Je reste député local et responsable du mandat que Bellechasse m'a confié.\n\nMa position sera donc là même ce soir en chambre, que celle que j'ai prise à St-Charles de Bellechasse. Si la chambre déclare que l'exécution de Riel est de sa compétence, je ne serais pas le dernier à dire que la place de cet homme était dans un asile d'aliénés, au lieu d'avoir été poussé violemment dans l'histoire du haut des degrés d'un échafaud.\n\nL'Assemblée Législative va se prononcer. Qu'elle n'oublie pas ces paroles que Mgr Taché, l'apôtre du Nord-Ouest, a écrit à propos de Louis Riel.\n\n— \"Le gouvernement, a-t-il dit, a laissé faire l'exécution. Il endosse toute la responsabilité. C'est une indignité que de vouloir la faire peser sur d'autres qu'on s'est bien gardé de consulter à ce sujet.\" (Applaudissement).", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001439.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 46872, "total-output-tokens": 20509, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 407, 1], [407, 407, 2], [407, 809, 3], [809, 809, 4], [809, 3070, 5], [3070, 3717, 6], [3717, 5181, 7], [5181, 7452, 8], [7452, 9949, 9], [9949, 12314, 10], [12314, 14677, 11], [14677, 17089, 12], [17089, 19332, 13], [19332, 21747, 14], [21747, 23399, 15], [23399, 25187, 16], [25187, 27512, 17], [27512, 30010, 18], [30010, 32634, 19], [32634, 35275, 20], [35275, 37595, 21], [37595, 40039, 22], [40039, 42438, 23], [42438, 44917, 24], [44917, 47398, 25], [47398, 49850, 26], [49850, 52354, 27], [52354, 54719, 28], [54719, 57241, 29], [57241, 58882, 30], [58882, 60875, 31], [60875, 63459, 32], [63459, 65878, 33], [65878, 68364, 34]], "primary_language": ["fr", "None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]