[{"id": "26366db9574551d235fc90465ce085f026b91620", "text": "REMINISCENCES\n\nOF A\n\nBUNGLE.\n\nBY ONE OF THE BUNGLERS.\n\nPRICE 20 CENTS.\n\nTORONTO:\nGRIP PRINTING AND PUBLISHING CO.\n1887.\nREMINISCENCES\n\nOF A\n\nBUNGLE.\n\nBY ONE OF THE BUNGLEERS.\n\nTORONTO:\nGRIP PRINTING & PUBLISHING CO.\n1887.\nDEDICATION.\n\nTO\n\nTHE EVERLASTING CONFUSION\n\nOF\n\nRED TAPE,\n\nTHESE PAGES ARE HOPEFULLY\n\nINSCRIBED.\nPREFACE.\n\nIn writing the pages that follow, I occupy much the same position as that of the character in the \"Impressions of Theophrastus Such,\" who attacks the scientific dissertations of a certain author and is promptly squelched by him; or else I imitate the example of Don Quixote in making a charge upon a windmill. The North-West Rebellion and all connected therewith, have been so puffed by pen and pencil, and the generalship and management so eulogized, that I feel no little diffidence in having a shot at so sacred an event, or attempting to ridicule the actors therein. But I have waited for a truthful and unvarnished account of the campaign, and as no abler hand seems willing to write it, I will give my idea of what I have called our \"Bungle,\" only regretting my inability to do it justice.\n\nTHE AUTHOR.\n## CONTENTS.\n\n| Chapter | Page |\n|---------|------|\n| 1       | 9    |\n| 2       | 12   |\n| 3       | 17   |\n| 4       | 21   |\n| 5       | 27   |\n| 6       | 33   |\n| 7       | 35   |\n| 8       | 39   |\n| 9       | 43   |\n| 10      | 50   |\n| 11      | 57   |\n| 12      | 61   |\nREMINISCENCES OF A BUNGLE.\n\nCHAPTER I.\n\nBefore commencing the reminiscences that follow, it would perhaps be as well to give a short sketch of the forming of the corps of which I was a member, and I will therefore devote a few words to that purpose.\n\nSeveral members of the Association of Dominion Lands Surveyors were in Ottawa, seeking information regarding the probable surveys for the coming season of 1885 and employment theron, when news of the outbreak and fight at Duck Lake, near Prince Albert, N.W.T., reached the capital, and put an end to the hope of surveys, for that year at least. At once the thought struck these gentlemen that men who knew the country in which the disturbance occurred would be of service to the Government, and several of them waited upon the Minister of Interior with a proposal to place a corps at the service of the general commanding. The minister gave us a letter to his colleague of militia and defence, and, thus strengthened, we sent a committee to that gentleman with a memorandum of the following scheme: Each of ten surveyors was to be accompanied by four men, who had been in his service in surveys in the Territories, were conversant with plains life, and accustomed to any amount of roughing it; the corps of fifty, armed and mounted on native horses, were to be used as one troop, or divided among the different brigades, were to furnish information as to trails, etc., and generally to act as intelligence men, scouts or mounted rifles as might be required. The Hon. Mr. Caron, now Sir Adolphe, also approving the scheme, directed us to elect a captain to take charge of financial matters; so a meeting was called and the post offered to Mr. Wheeler, and then to another member, but refused by both. It was then offered to Mr. J. S. Dennis, who, being descended of martial ancestors, confident in his skill as a commander, without hesitation accepted the office. I write this to correct some reports that Mr. Dennis organized the Surveyors' Intelligence Corps,\nand to state that the evening of the meeting of which I have just spoken was his first appearance on the scene; whether the offer or its acceptance were wise, I will leave the sequel to determine.\n\nAfter a certain amount of red tape had been wound off the departmental reel we got away from Ottawa, and, travelling as civilians, proceeded by rail through the States to Winnipeg: again a few days' delay, and on April 14th we reached Qu'Appelle, then the base of supplies, and, going into camp, awaited the arrival of our horses and arms. More red tape, but at last the horses appear, and, while waiting for arms and orders, our captain proceeds to put us through our drill.\n\nThe kyuses—the local term for native horses—were a fair lot, considering how they had been scratched together, and as soon as each man was provided with a charger our first mounted parade was held. Many of us, I grieve to say, were not as familiar with the back of a broncho as could be wished, and when the order to saddle was given, some got into shape in tolerably quick time, whilst others seemed to have an infinite number of buckles and straps to arrange. However, we get the saddles on at last and are drawn up in line. More, we are drawn up in two lines, front and rear ranks, forsooth; somewhat of an innovation for mounted men, and number off and dress from the left, but probably our captain, who, like Shakespeare's Parolles, \"was a gallant militarist, and had the whole theory of war in the knot of his scarf and the practice in the shape of his dagger,\" had some deeply-hidden scheme in this that our uneducated eyes could not discover; indeed, throughout the whole campaign there was an amount of military science and skill displayed that was quite appalling to people accustomed only to common sense.\n\nBut I have left the survey corps standing waiting all this time, though, doubtless, there are still a few straps and stirrups to adjust; a little explanation as to the correct way to \"climb onto the hurricane deck of your kyuse,\" as the boys put it, from \"Parolles,\" and the commands, \"Pre-paretomount Mount!\" are given, and the variety of attitudes assumed by our bold scouts, when the last order is obeyed, would give a caricaturist subjects for innumerable cartoons. Some of the troopers get up so rapidly that they fall over on the other side; some crawl up like a boy up a greased pole at a fair; here a horse stands as if he had taken root, another pivots round and round on his own axis, and many of them signify their distaste\nfor their riders by bursting from the line like lightning from a cloud, indulging in the not ungraceful but all too energetic gambols peculiar to the broncho, known as \"bucking,\" and, alas for the riders of these latter! from embryo soldiers decked in all the pomp and paraphernalia of war, they are transformed into rough-riders, whose sole and only aim is to stick on. Carbines rattle, spurs jingle, yells of laughter, frantic curses. \"Stick in your spurs\"—\"Hold his head up\"—\"Let him go, man\"—\"Stay with him, Billy\"—\"Freeze on to him\"—\"O-o-o-oh.\" Well for us there are no onlookers, for our trimness and discipline are fled and gone, and we are about as disorderly a lot as one would care to see; but we pull ourselves together, try it again and, after many efforts, manage to get into our saddles about the same time, and, having mounted, stay so, after which we are put through some cavalry manoeuvres that would astonish even Colonel Denniston for their novelty. I do not include all of the corps in the above remarks, for some of them were really good riders and would have been a credit to any troop, one of them breaking in an old mounted police bucker and making an excellent troop horse of him; but a great many of our comrades would have felt much safer on the ground, where, indeed, several were violently deposited during the first tournaments with their chargers.\n\nThis sort of thing went on for some days and, added to the labor of evolving novel systems of drill, our transport caused poor Parolles a great deal of mental anxiety; having been once in the Rockies, and having there seen a man who knew another who had heard of some one else accustomed to that mode of travel, our captain determined upon carrying the tents and etcetera upon pack horses, and many and learned were the dissertations upon pack-saddles, the diamond hitch, and all the rest of it; but long before he had decided upon the particular saddle to use, a telegram from the Major-General commanding, who had been notified of our presence at Qu'Appelle, arrived, ordering us to proceed to Swift Current and report to General Laurie, who was in command at that point. Accordingly we embarked our outfit (anything from a wheelbarrow to a circus caravan is an outfit here) on the train, and had a pleasant little hour or two getting the ponies into the cars. \"Tom,\" the cook, was our first wounded man, being worsted in an encounter with an ill-tempered mare, who struck several square inches of skin off his cheek with a well-directed blow of her fore hoof. Tom dodged a bit or she would have broken his skull.\nReaching Swift Current early on the morning of the 20th April, we pitched our five tents a short distance from those of the Midland Battalion, and practised our extraordinary cavalry exercises until further orders. One night some of the \"new chums\" discovered sundry suspicious characters on the hills down southward, and an order was sent over for us to investigate: not a man of the corps believed there was a suspicious character within some hundreds of miles, but in a few minutes three men, armed with rifle and pistol, were off at a swift canter, prepared to attack anything bigger than a gopher; that is unless it was a redskin, and in such a case why our spurs were sharp, our horses swift, and discretion being, etc., etc., we were ready to retire at great speed—for reinforcements. However, we were much relieved, after a ride of a few miles, to find that the dusky warriors were only creations of the vivid imaginations of some of our brethren in uniform; I suppose I had better apologize here and say patrons in uniform, for we found ourselves looked upon as very small potatoes by the gold-laced and bedizened gentry of the militia.\n\nChapter II.\n\nA few days at Swift Current, to allow the regulation quantity of red tape to be unwound, and General Laurie, who, I believe, is really a soldier, divided the troop into two portions, sending one-half to the Elbow of the South Saskatchewan, to await the arrival of the steamer, then on its way down the river, conveying stores and ammunition, and protected by the Midland Battalion and a gatling, and scout the country before it to Clarke's Crossing; whilst the other half was to convey waggons of supplies in the trail of Colonel Otter's column on its way to Battleford, and, if possible, to overtake him; but before the latter division had left Swift Current twelve hours, an order from the Major-General commanding, to whom General Laurie had reported his disposal of our little troop, reached us, ordering the formation of a line of pickets to patrol the country from Cypress Hills to Long Lake. The\nonly wonder is that we were not ordered to patrol from Fort McLeod to Fort Qu’Appelle; that would have been one man to each ten miles of linear distance, and, of course, the enemy we were to round up were expected to be in such a disorganized condition, after the General had trounced them, that one man could easily run in a legion.\n\nSo we turned off the Battleford trail and struck for the elbow, with numerous curses at our ill luck in missing all the fun, for we wanted to overtake Colonel Otter and his flying column; and at noon on Friday, April 24th, our first picket was placed at the lower crossing of Swift Current Creek, and two of us sent forward with orders for the half troop at the Elbow, nearly 80 miles north-east.\n\nOur blankets are under the saddles, a feed of oats and a small tin “billy” tied on behind, a small package of tea, some “hard tack,” and corned beef in the canteeners, and we ride out of the valley at a trot. We grin at each other as we look at the sky, for we know that Parolles has not taken any wood on the carts, and we remember what he has forgotten—that there is none on the trail nearer than the northern slope of the Vermilion Hills, forty miles away. The clouds gather and thicken, and half an hour out down comes the rain, changing into snow as the cold north wind sweeps over the plain and drives it into our faces, but we have no intention of camping, cold and fireless, in the open, and, keeping the sturdy ponies’ heads in the teeth of the blast, we push on at a pace that only varies from a trot to a canter, over the gradually whitening prairie, until the southern slopes of the Vermilions rise before us, the storm clears, and, in the fading light, we see to the north-westward the tree tops in the ravines of the South Saskatchewan. The horses, feeling that there is rest before them, need the spur no longer, and before darkness closes in we find the place we seek, dry wood, water and grass, in a sheltered coulee, where the ponies are picketed and fed; a glorious fire sends its sparks up into the clear cold air, and we dry our soaking clothes before it, refreshing the inner man with draughts of that pleasant compound, yclept, Johnston’s fluid beef. And then to sleep, as only plainsmen can sleep after a day’s ride; fears of the enemy troubled not our dreams that night, and sentry go was left to the horses, if they liked to keep awake, for we only moved to throw another log on the fire, until early dawn sees us in the saddle and, after a thirty-five mile ride, we are ensconced in the camp at the Elbow.\nOur comrades of the other half of the troop are here waiting for the steamer, and our despatches elicit more groans of disgust at military discipline (?) and red tape, for this care about the protection of the rear is something new to us; but, live and learn. We had thought we knew something of the country and people therein, but it now begins to dawn upon us that the resources of the rebels had been vastly underrated and that they are really (?) about as formidable as all the Arabs in the Soudan put together: but perhaps our picket line was so disposed as to stand off Fenians from south of latitude 49°, who might be about to attack the General from that direction.\n\nThe morning after our arrival, as we sit at breakfast, the sentry reports an antelope, and, looking out, we see one a few hundred yards from camp: now, as everyone knows, antelope venison is remarkably good eating, so \"Mac.,\" as the best shot, is deputed to stalk and shoot it, and after a cautious advance we see his hat rise above a knoll, a long aim taken, elbow on knee, a puff of smoke flashes out and the game, with a little start, trots a few paces, slightly astonished but unhurt.\n\n\"Missed!—and at a hundred and fifty yards, too,\"—and half-a-dozen men, rifle in hand, join in the fun, for after one shot is fired sportsman's law says that an animal unhit is anyone's game. I ran up to the top of a hill and opened fire with my Winchester, while \"Mac.\" attacked on the right and several others support us on the left. Clink-clank goes the lever, and a cartridge flies into the chamber. Bang! and a yell of derision rises from the on-lookers as \"Cabri,\" startled by the whistling bullets, skips forward and stops again. Crack! crack! crack! go the rifles, now stirring the dust at his feet, now cutting the empty air above him, until the attacking column, with emptied magazines, retire in good order, while the cause of the disturbance, from a hill about half a mile distant, looks back at the camp, tossing his graceful head in contempt of our marksman-ship. Each man saunters into the tent, as if his mouth were not fairly watering for antelope steak, and continues his destruction of corned beef with the air of preferring it to any other delicacy.\n\n\"I was too far away!\" \"If I'd only had my own old gun!\" \"Oh, these rifles aren't sighted right!\" in tones of disgust, show that as usual the weapons, and not the men, are to blame, until last in comes \"Mac.\" with a frown on his noble brow, and, with an air of sublime resignation, lays down his rifle saying: \"Next time an antelope comes near camp someone else can go out and\nshoot it, a fellow hasn't much chance when you chase the game away.\"\n\n\"We did it for your protection, 'Mac,'\" says someone, dryly. \"Thought the infuriated animal might turn on you.\" And there is a general laugh, for \"Mac's\" miss was the worst of the lot, and, with a good deal of resolution to practise up for the \"Breeds,\" the remainder of the meal is eaten in dignified silence.\n\nOn Monday the half troop from Swift Current arrived, bringing with them news of an encounter between General Middleton and his forces and some rebels under Gabriel Dumont at Fish Creek, a small stream north of Clarke's Crossing. The troops were said to have lost eight men killed and forty wounded, and the enemy, whose numbers run from two hundred and fifty upwards, seven killed, wounded not known. We don't know how much to believe, but I hear not a few remarks, decidedly the reverse of complimentary, from the boys upon his generalship's having been \"stood off by a few breeds,\" and also a good deal of bad language at the idea of our picket line, for now the chances of our seeing fugitives are fainter than ever. But \"obedience, etc.,\" and next day the line was completed, placed as follows:\n\nPicket No. 1—Swift Current Creek, 15 miles from Swift Current, the base of supplies. Picket No. 2—Vermilion Hills, 38 miles from No. 1. Picket No. 3—Elbow of South Saskatchewan, 35 miles from No. 2. This being headquarters camp, and on the Moosejaw and Clarke's Crossing, via Saskatchewan, trail. Picket No. 4—Plain 15 miles east of No. 3. Picket No. 5—Little Arm Creek, 15 miles east of No. 4, and the same distance west of Long Lake.\n\nRiding from picket to picket daily, training horses, now and then getting a shot at a cabri, sleeping, biting our nails and exhausting our vocabulary of English at red tape in general, a break in the monotony came on the 28th in the shape of a settler from Saskatoon wanting arms or men to guard the settlement, both of which our Parolles promptly refused him. He gave us more accounts of Fish Creek, painted in all the colors rumor could suggest, and departed with a despatch for the General, being replaced later in the day by Capt. Howard, the American officer instructing our artillerists in the use of the Gatling. This gentleman had left the steamer, slowly working its way down the river, much against the advice of the red tapists on board—in whose eyes every bush on the river bank\nwas an armed and blood-thirsty savage—to pay us a visit, and stayed with us a day or two. He quite fraternized with us, at first, not a little to our astonishment, for we were rather accustomed to be sat upon by the militia, our slouch hats and varied attire not showing off very well beside their new and gaudy uniforms, but we soon found that \"Gatling,\" as he was called, was anything but a military snob, and having seen some years of service in the Western States, possessed no small savoir faire, and was a comrade after our own heart. He was in a state of fever at the delay, so anxious was he to get to the front, not that he was very blood-thirsty, or that the rebels had ever done him any harm, but it was well known that White Cap's band of Sioux from the Moose Woods were with Riel, and these gentry, now so warmly repaying us for our reception of them, being Indians from Minnesota, and proud possessors of scalps of American women and children, \"Gatling\" desired no better fun than to \"get a few turns of the crank\" at them and call it square.\n\nThe gun could have reached Clarke's Crossing by land in two days, but the officer in command of the steamer having orders to take it down in that vessel, appeared determined to carry out his instructions if it took him all summer; and there seemed to be a chance of a considerable part of the season slipping over, she got along so slowly. The captains of the boat, old river navigators both, then wished him to land a part of the stores, leaving a guard over them, so as to lighten the steamer, and guaranteed to take her down to Clarke's Crossing in a very short time, but this hardy (!) soldier aforesaid was either an extraordinary slave of red tape, or afflicted with all of his senior's caution (to put it mildly), and refused to be guided by this sensible advice. How dare they advise him?\n\nAt last, from sand bar to sand bar, the vessel worked her way down below the elbow, and as the river rose made better progress, finally disappearing northward, and our next visitors were a herd of cattle, being driven by the contractors to the front to supply the army with beef. One of the beeves was slain for our use, and two of the troop escorted the herders a few miles north, returning to camp next day (Saturday), May 2nd, which was marked by the advent of Dr. \"Tom\" Roddick, of Montreal, and a number of assistants, hurrying to the front to attend to the wounded. He arrived late in the evening, and while sitting in our tent waiting for the best our mess affords the doctor in him rises to the surface, and, noticing\nthe pale and languishing faces of the boys with his keen professional eye, he remarks that he must prescribe for us, and unslinging his water bottle he passes it round the tent. The huge phial goes from hand to hand, and as each patient takes it and raises it to his lips, instead of the grimace of nauseous \"potions and notions,\" a pleasant smile shows the revivifying powers of this wonderful elixir; the head goes back, and after the \"glug, glug.\" of the liquor over the palate there comes an \"ah-h-h\" of gratitude—the wonderful tonic is excellent whiskey, and the fact that the patients are surveyors explains their gusto, for ill-natured people say our affection for the fluid is as great as that of a Scotch parson.\n\nChapter III.\n\nOn Sunday, May 3rd, long before dawn, our slumbers were disturbed by the sharp \"Who goes there?\" of the sentry, replied to by our friend, the Saskatoon settler, bringing despatches from the General. He had handed our captain's message to the warrior, who showed his intimate acquaintance with the geography of the country and the retentiveness of his memory by demanding: \"What are they doing there; do they expect an attack?\" to which our messenger responds that he guesses we had orders to stay there, as indeed we had, our instructions being to run in all stray half-breeds and suspicious characters (he should have added tramps, organ-grinders, confidence men, etc., etc., for we had seen as many of one as the other). The said half-breeds were presumably fugitives whom the General had thrashed at Fish Creek (before he got there), he, with the usual conceit of his kind, expecting them to flee at the first sight of his Falstaffian figure; but alas for human expectations and vanity, the mighty and glorious name of Middleton, \"familiar in our mouths as household words,\" known wherever the flag of Britain spreads its folds to the breeze, and used alike by Esquimaux and Maori to hush the restless infant, had not even been heard by these rude and ignorant sons of the plains, and his name being the only part of him that was awe-inspiring they, in prairie parlance, stood\nhim off, and now he wanted more men. Fortunately our troop was the only one within reach, for the vast and stupendous intellect that had at last been penetrated with the idea that surely we were not required to protect a trail where cattle and unarmed settlers might pass unmolested, did not yet think it safe to leave his rear unprotected by bringing forward the Governor-General's Body Guard or Quebec Cavalry from the Qu'Appelle trail. However, if he could not send a request to Ottawa for \"another ten thousand,\" our fifty were better than none, so his despatch ordering us to the front was handed over by our friend the settler.\n\nAll was bustle and excitement at the news—couriers started at once to call in the other pickets, and, as nearly all the carts were absent bringing up more supplies, it was noon on Thursday, May 7th, when we struck camp at the elbow and set out for Clarke's Crossing; pickets nearly 80 miles away having been brought in in the interval.\n\nThe trip was uneventful, and had it not been for our cavalry drill would have been monotonous, but as our captain was constantly introducing new manoeuvres, his inventive genius aided vastly in whiling away the time until we reached Saskatoon on Friday evening, where we met tangible evidence of the Fish Creek fight in the shape of a number of wounded: some had their left arms amputated, and the poor lads were quite proud of the loss, not thinking how deuced inconvenient it is to be literally single-handed in ordinary every-day life.\n\nNext morning on our way to Clarke's Crossing we met a settler driving a waggon, and were rather amused at the doubtful compliment he paid our motley assembly by hauling out a rifle as long as himself, and in the most business-like manner loading her up to receive us. He told us there had been another big fight, but reports at the Crossing failed to confirm this, though the two companies of the 40th London, who were stationed here, had heard the field guns the day before.\n\nAfter leaving the Crossing the precautions taken at night were redoubled, for were we not in an enemy's country? sentries paced about the camp and an officer kept at least one eye open all night, but as the orders were that the horses should be fed and turned loose at dawn, I can scarcely see that such extreme vigilance was thoroughly carried out, for one mounted man could have stampeded every hoof, and indeed when the word to \"saddle\" was given on Sunday morning there was the deuce to pay because several chargers were missing.\nA little search, however, discovered them among the bluffs, and proceeding towards the \"seat of war,\" as Kippen called it, shortly after striking camp we reached Fish Creek, where we had an opportunity of surveying the scene of the late encounter: and thereat were rather disappointed. Educated by the highly-colored versions of the affair, our mind's eye had pictured a precipitous ravine lined with dense thickets and filled with howling savages; but we find a shallow valley, or coulee, drained by a small muddy stream and crossed by the waggon trail. The gentle slopes are wooded, it is true, but the innumerable rifle pits, boiled down, amount to only a very few, and why the enemy were not driven out puzzles our unmilitary brains not a little. Accounts of the affair are many and conflicting, and it is hard to fix upon the correct one. No doubt the official report as to how \"I pushed forward my right\" and \"brought up my supports\" and all the rest of it is very nice and interesting reading, but it is hardly reliable. That the men, raw soldiers though they were, behaved creditably, all are agreed, and one cannot but admire their pluck and firmness when one reflects that, in addition to being almost surprised and suddenly placed in a trying position, the incompetence of their commander prevented them from doing more effective service. In fact that august tactician was aghast at the temerity of these half-breeds in daring to oppose him, and so nonplussed at the manner in which they carried out their opposition, that he seems to have lost his head completely. I don't mean that he was afraid, for, as far as personal bravery goes, I believe him to be fully endowed, but that the enemy should occupy a position in a hollow, instead of on a hill, completely paralyzed what inventive resource he possessed, and he did not know how on earth to get at them. Experience was at fault in this case. He made a few random efforts to dislodge the rebels and these failed. He kept his men under fire in a most disadvantageous position, i.e., against a sky background, and firing at short range into the bush in which the half-breeds and Indians were concealed; he lost a number of men, and towards evening he withdrew his troops; yet he defeated the enemy, he says. I think most people are agreed that a dash by the volunteers would not only have determined the fortunes of the day, but have broken the back of the rebellion, and, with the loss of no more than actually fell at Fish Creek, would have spared all the lives that were spent afterward at Batoche. As a regular soldier, General Middleton may theorise as he pleases\nabout the risk and danger of charging with raw troops, and, doubtless, many wisecracks, whose opinion is as valuable as his own, will support him, but common sense recommends that he should have charged, and for these reasons:\n\nFirst—the enemy, with some very few exceptions, were not good marksmen, although it is generally supposed that they are dead shots; a number of years in the North-West have shown me that those of them who shoot at all decently, do so only at short distances, depending upon their skill in approaching game rather than on the accuracy of long shots; moreover, they were badly armed. General Middleton gave them every advantage, and played directly into their hands by placing his men as he did, for the half-breeds used their skill as hunters in keeping concealed in the brush, while their inferior arms were equal to the rifle of the volunteers at the short range at which they were used. I do not think it necessary further to urge their bad marksmanship than to point out that, with all these odds in their favor, they hit so few of our men, and will maintain that they would have killed no more, if as many, of the troops, had the latter charged them. Disciplined foes might have held their ground, but even disciplined troops, unless very old campaigners, have nerves that would not draw as steady a bead at a line of bayonets advancing at a run, and as for the undisciplined rebels, after a few shots they would have broken cover like rabbits.\n\nLastly, it was important in this first action that he should dishearten the rebels by gaining a swift and undoubted victory. But why argue the point. After defeating (?) the enemy at Fish Creek, instead of pushing his advantage, this mighty warrior proves how he deserves the encomiums lavished upon him by retiring a mile, going into camp and remaining inactive for a fortnight. Waiting for the Gatling, say some; for ammunition, say others; couldn’t leave the wounded, and a host of other whys. But, meantime, the half-breeds, who think they were victorious, are gaining courage, strengthening their position at Batoche, and patting each other on the back at having thrashed the “Shemôgonsûc” and their “Okeemâgh.”\n\nIt may be remembered that some little time after Fish Creek, Lord Melgund left the brigade and went eastward, for some reason unknown; possibly that gentleman was disgusted at the inactivity of his commander, but one explanation I have heard given for his departure and the General’s delay that is, perhaps, worthy of credence, is that the Big Gun, with a regu-\nlar soldier's contempt for our volunteers, was convinced, after his repulse, that with the latter alone he could not cope with the rebels, and had sent Lord Melgund to use his influence with the Governor-General to procure the services of regular British troops to crush the rebellion. That was his valuation of Canadians, then.\n\nCHAPTER IV.\n\nFrom Fish Creek the trail northward runs through a beautiful prairie country, well wooded and watered, and rich and fertile, with sundry farms scattered through it, and on our march we passed a number of houses, now abandoned, and many of them pretty thoroughly looted. Towards evening on Sunday we came to one that gave certain signs of life, in the shape of sundry chickens around the door, and as a surveyor has rather a weakness for the fleshpots, the four who form the advance guard began to deliberate upon the advisability of placing some of the fowl in such shape as to fit them for chicken stew, when a dozen horsemen appeared about a house some three hundred yards further on and the small game was forgotten.\n\nWere they the enemy or not? they looked quite ragged enough to be \"breeds,\" but we did not like the idea of firing in and dropping a few of them, so sent a man back to the troop and sat unperceived, rifle in hand, waiting for a shindy, of which we were disappointed as they proved to be Boulton's Mounted Infantry: so after a certain amount of fraternising we proceeded onward to the brigade camp where, even to our unsophisticated eyes, it was apparent that military science had been at work in the choice of the position.\n\nA ploughed field had been chosen as a site for part of the corral and the earth breastwork that partly surrounded it had been placed so low on the slopes that a man standing on the rising ground inside afforded a splendid mark for anyone a few hundred yards away, down to the very soles of his boots. I think the hospital tent was almost unprotected, being near the crest of the hill. Westward of the camp about seven hundred yards the wooden church of Batoche stood where the\nland fell off toward the river, and, in the slight depression, between, an occasional puff of smoke rose from the brush the clear crack that followed telling that someone had drawn a bead with more or less accuracy—generally less.\n\nThe south-west corner of the entrenchments was allotted to us, and after depositing our traps therein we amused ourselves pottering about to get an idea of the position. First we went out to where two field guns were shelling some rifle pits near the graveyard, and found a number of other men lying a hundred yards or so behind the artillery; as these latter were on a knoll so high that when walking erect among our recumbent comrades we could not even see the roof of the church, it was rather rich to be addressed first by one and then another son of Mars lying sprawling on his face, and told we \"were a d——d fool, and had better keep out of that or lie down, they were not going to be shot for us,\" and as we could see no fun in embracing mother earth where only a falling star could hit one we came away, and having recuperated exhausted nature with the evening ration of corned beef and hard tack, and revived ourselves with tea, Wheeler suggested that we should go out and occupy one of the rifle pits that had been dug along the top of the river bank a few yards from our corner of the entrenchments, and for want of better employment we did so. The sun was setting and the firing of musketry had almost ceased so we did not lie very close; Wheeler and a redcoat were sitting in the pit and the third man was lying behind it, and all chatting comfortably when there came a sharp \"pat\" and \"b-z-z-zng,\" a bullet flew past my ear, and the crack of a rifle rang out.\n\n\"Gad!\" said Wheeler, coolly, \"there's a hit anyway,\" and turning round showed where the bullet had punched a hole through the muscles of his arm near the shoulder, fortunately not touching the bone; an excellent shot, too, for the marksman must have been full five hundred yards distant, and now that there was a bull's-eye we came away, everyone else lay very close, and Wheeler put himself in the hands of the surgeons. It began to grow dusk shortly after, and beyond a few shots fired into the corral, everything was quiet: these few shots proving the vantage and scientific nature of our position by wounding some of the horses; if the enemy had been more liberal with their ammunition we should not have got off so easily. We turned in all standing, and except the sentries were soon sound asleep, for most of us were tolerably\naccustomed to fitting our ribs into little inequalities of surface. My turn on guard came about midnight, and I don't know that either Gore or myself kept a very sharp lookout for the enemy. Pacing up and down together I rather think the conversation turned more upon surveying instruments and fishing than \"ambuscades, cannon and culverin\"; for as Kippen used to say, \"It is hard to realize, boys, that we are actually up here for the purposes of war,\"—so our beat was rapidly passed and we roused out our relief and turned in. One or two of the fellows were rather of the alarmist type, and twice we were startled to our feet by hoarse whispering that a night attack was imminent, but in one instance it was only a few stray cattle, and in the other the excited imagination of the guard had seen, \"men as trees walking,\" as the \"Parson\" put it—who does not remember the \"Parson\" and his command of language, so extensive and fluent when he was riled, no broken disjointed utterance but a steady roar increasing in volume like an avalanche, poured upon the head of anyone unlucky enough to incur his wrath?\n\nEarly on Monday morning we turned out and were sent off with the Gatling and a nine-pounder and Boulton's troop to attack (?) the enemy's left, one of our carts accompanying us with ammunition for the \"Hurdy Gurdy,\" and \"Jack,\" the teamster, as driver. We rode in and out among the bluffs until we reached a small strip of prairie running north and south, the woods along whose western edge were faced with the enemy's rifle pits. Howard and his gun were a little north of us, and the two troops of horsemen were dismounted and directed to advance in skirmishing order to support the gun. Our boys were moved forward to the edge of the brush, but owing to some bungle on the part of the General, his aide or Parolles, had not reached the crest of the hill in front of us, and deuce a bit of the enemy could we see at all. Along came the General, whose hair had been rubbed up the wrong way, and wanted to know \"why the devil we didn't advance to the top of the hill,\" whereupon Parolles, to show him the independence of the free-born Canuck, answered that we'd go and stand (dance—some of the boys heard it) on the top if he liked, which was, to say the least of it, a generous offer on his part to make. Then appeared one of Boulton's men, sent for the ammunition cart, riding at full speed along the open in so tempting a manner that several shots were fired at him without effect. Jack grimly cut a small poplar about\nfive feet long, and as thick as a man's wrist, and when last seen he was kneeling in the front of the cart while the whack! whack! of the twig, as his muscular arm plies it to old Baldy's ribs, almost drowns the rattle of the Gatling.\n\nTruth compels me to state that some of our troop were as verdant as many of our uniformed comrades, as the following incident proved: While advancing through the brush \"Mac,\" in his ardor, got somewhat before the line, and as \"Mac,\" like hairy-faced Dick in the ballad, is\n\n\"Swart of hue,\nBetween a gingerbread nut and a Jew,\"\n\nhis glossy black hair and sun-browned neck showed to the excited vision of a comrade like those of a \"breed,\" though what the deuce a breed would be doing there with his back to us this deponent sayeth not, and the brilliant youth took a pot shot at him at about forty yards, but fortunately his aim was more nervous than his imagination, and beyond a certain number of naughty exclamations no harm was done. A few shots were fired, but the boys never see any enemy to fire at, and then \"the very model of a modern Major-General\" gets hungry, and we returned to camp, where we attacked our midday meal with much greater effect, and probably with more spirit, than we did the enemy.\n\nOur great Mogul appeared to think that if he got up early and pottered around a bit during the morning, he had earned his day's pay, for in the afternoon he came forth resplendent in blue and braided toggery: perhaps in the sultry climes where he has slain his tens of thousands it is so hot at noon that, like Hotspur, he \"kills me his six or seven dozen at a breakfast,\" literally, anyway we all take it rather easy in the latter part of the day.\n\nAfter lunch we took our rifles and sauntered down towards the hill, where two of the field-pieces were having a little practice at a house over the river, and learned something more of the art of war. The house, about fifteen hundred yards distant, was supposed to be a rebel council chamber, or other important post—at least there was a flag flying over it—and the two nine-pounders were turned loose upon it, with shot and shell, under the direction of all the military glory the camp could produce. \"Bang!\" goes a gun, and the puff of smoke and answering report from the bursting shell comes back across the river. \"Bang!\" goes No. 2, with a like result—and so on. Perhaps the battery men were anxious to spare life, for\nnone of the shells hit the target, and \"Common shell! Percussion fuse! Load!\" became rather monotonous after a bit, and we began to think of going elsewhere for amusement. I have heard a great deal about that shooting, the battery men and others claiming that the practice was exceptionally accurate, and I admit that it might have been so and yet left a very large margin for improvement, for everything depends on one's standard of perfection. Not being an artillerist I can only give my humble views, and if it be true, as they maintain, that seventeen shells struck the house (with our glasses we saw them burst everywhere about it, though I really believe it was hit once), well the battery must have been very well supplied with ammunition, for surely after the first bull's-eye or two no rebel would be such an ass as to stay inside of it.\n\nAfter whiling away the afternoon in this fashion for some time, the keen sight of some of the decorated warriors descried a number of waggon moving up the trail from the ferry west of the river, and a shell was fired in that direction. I won't say it was fired at them, for it hardly went into the same township, and as our field glasses showed the fugitives to be cattle quietly grazing up the slope, it is as well the shot went so wide. Then a new source of interest presented itself, for while we were all grouped about the guns, intent upon the havoc and destruction they were causing, two rebels came out on the open road across a ravine, between our position and the church, and all who did not feel bound to stand up promptly assumed the horizontal. Had the enemy fired into the flock before they showed themselves they must have bagged someone in such a crowd, but our rapidity in executing this difficult manoeuvre was so great that their bullets only cut the empty air as they sung over us. The General, who swaggered about, showing his rotund and rather corpulent figure, was quite indifferent whether they pinked him or not; but a number of the officers endeavored to reconcile the dignity of rank with a wholesome amount of discretion, and it was rather ludicrous to see them standing in line one behind the other, sheltered by a couple of very small poplars, rather thicker than a man's arm. Determined to give us precept as well as moral courage, our Commander, etc., etc., nerves himself for the occasion and shouts, \"Don't look at the gun, men—watch the road; don't it, men! don't look at the gun,\" rather unnecessarily, and rifles began to crack from our comrades in quite an alarming fashion, had their accuracy been reliable or the enemy in sight.\nThis new arrival convinced our tacticians that the house had been hit, or ought to have been hit, for they limbered up the guns and went back to camp, leaving us to do as we pleased about following. Two of us stayed with some dozen red coats to interview our friends over the ravine, and our comrades, having their pouches full of ammunition, fired innumerable shots at a dark object seen through the brush, which they declared to be the rifle-pit sheltering the two rebels, (it afterward proved to be the body of an artillery horse that had been killed in the first day's action), but as I could not find any extra bullet-holes in it, and the rifle-pit was only about forty yards to one side, many of the bullets fired at the horse may have gone so close to the pit—so well did our men shoot, forty yards in a four hundred yard shot—as to be unpleasant to its occupants, for they did not fire very many in return. Others of the corps went down the slope of the hill with Colonel Williams and the Midland Battalion on the enemy's right flank, and one of them told me that he fancied that officer was putting out a feeler both for his own men and the enemy. His own idea was that we were to stalk the enemy with as great caution as possible, so he was rather astonished at the noise that Colonel Williams encouraged and added to with his own voice during their advance, which was a short spurt, made before the retire sounded, to try his supporters' and opponents' temper for future results.\n\nAs the sun set and the troops were recalled for the night, the great superiority of the civilized over the savage method of warfare, was once more brought home to us. The camp, as I have said, was almost directly east of the church, and in the morning, and in fact all day, the troops steadily worked their way towards the latter and village of Batoche beyond it. The intervening ground being unknown to our men, and the enemy's rifle pits being well constructed and carefully hidden by the brush, the advance in skirmishing order had to be made with caution, as the red and black tunics made very good marks for their keen-sighted opponents. Our boys would gain a certain amount of ground during the day, and retire towards evening. Now everyone who has ever tried to approach game knows the greater difficulty of retiring undiscovered than of approaching, and it may be easily imagined at what a disadvantage our brave lads in their bright tunics were placed when retiring rapidly, and as rapidly followed by men as lightly clad as possible, skilled hunters and knowing every inch of the\nground; add to this the fact that the sun was low and directly in our men's faces, so that while they could see next to nothing the enemy had every object thrown out in strong light. The fierce yells of the Sioux and their half-breed allies, as they followed our retreating men, and the crackle of musketry tell us that the enemy feel their advantage, for Indians are not noisy unless successful. Only their bad marksmanship saved many of our men, but on this evening Hardisty, of the 90th, was shot through the brain, proving that there were exceptions to the rule. How many casualties occurred I cannot say, but surely there was bad generalship displayed in taking positions at a disadvantage during the day, only to abandon them at a greater disadvantage at sundown; indeed it is well known that the troops were nearer the village of Batoche the first day than on any other until the \"rush\" was made, and I have heard that General Middleton was apparently so astonished at the warm reception given him that day that he wished to retire several miles, and was only dissuaded by the urgent request of his officers.\n\nChapter V.\n\nWe spent another night in the dirt of the enclosure sleeping without disturbance, in the way of alarm, and on Tuesday again accompanied the Gatling and a nine-pounder to the enemy's left for another of those attacks (?) of ours. This time the field gun was close to us, and, dismounting, we were ordered to advance extended and support it, within a very short distance of our position of yesterday. The brush was thick, and several of us walked up an old survey line cut through the bluff. Desirous of getting a sight of the enemy whom we expected to find across the little plain, we were walking nearly erect up the line, and not knowing the ground before us must have shown our heads against the sky behind, when a dozen rifles cracked so close to us that the unpleasant b-s-s-s-st sounded simultaneously with the reports. It is rather absurd to drop at the whistle of a ball, when we think of it, for had the rifle that sped it been well-aimed, one would never hear the sound, but we all did drop. Perhaps\nthere is some sort of electric communication between a fellows' ear and the muscles of his knees, causing them to contract, for down I went at once and then began to crawl up the slope, when \"Celluloid\" called out, \"R——! Kippen is gone.\"\n\n\"Badly hurt?\" I asked, for I had not seen him fall.\n\n\"I don't know; he is right behind you.\"\n\nI crawled back at once, and though the veriest tyro a single glance showed me that all medical skill was useless here; our poor comrade was lying in the old survey line on his right side, one hand grasped the rifle he had been about to use, his broad hat was still jauntily cocked on one side of his head, and so calm was his face that had it not been for the thin stream of blood flowing from his upper lip, one would have thought him asleep; the bullet had struck him just below the nose and passed directly through the brain, producing instant death, so sudden in fact that he was dead before he fell, and suffered no pain whatever. Word was passed along the line and the ambulance men were soon on the spot, but all they could do was carry him to the rear. The General, riding up, hears of the poor fellow's death and remarks, \"What luck these men have, only a chance volley.\" His opinion apparently, but the fact is that as we had been brought to exactly the same locality as the day before, the enemy, accustomed now to our brilliant leader's method of attack, had quietly laid a little trap for us, but, owing to hurry and bad shooting, had only killed one man. Some dozen or fifteen were lying down just beyond the ridge waiting for us, and as we made plenty of noise they had warning of our approach, fired a volley into our ranks, and were seen to run across the open to their cover without a shot fired in return.\n\nWe were kept here for some time, but beyond the killing of a few cattle that we were ordered to shoot, I don't think we did much damage to the enemy, and having so got through our morning's duty rode back to camp. We are a hard and careless lot, as a rule, we surveyors; rough associates, hard work and lack of women's society causes men to grow indifferent to the feelings of others, but I noticed that the troop was quiet and less joking carried on. The first gap had been made in our ranks and we could faintly imagine how he would be missed in the little home circle down in Eastern Canada. His quaint sayings and cheerful laugh are gone from No. 1 tent, yet, though he has fallen among us, in a week he will be almost forgotten, and we cannot at all realize the sorrow of his\nparents when the first warning of their loss reaches them in the brief telegram, A. W. Kippen, Surveyors' Corps, killed. We sympathize in some degree with his relatives, but I do not think much grief is felt for him; full of life, health, strength and energy, prepared for all emergency, but untainted by a shade of fear, he meets a painless, instant death and is spared all the misery and unhappiness that might befall him later in life; we do not pity him, though we do miss him a little; he is only another victim of our Bungle, and we are fortunate in losing no more than one man.\n\nAfter our return to camp we knocked about until shortly after noon when we sat down to lunch, rather a swell name to give the scramble for tea, corned-beef and hard tack, eaten wherever a fellow could find space to sit down; it reminded one of our troopers of Dr. Watts' hymn:\n\n\"Whene'er I take my walks abroad,\nHow many poor I see,\nA-scoffin' pork without a fork,\nWhat dirty beasts they be.\"\n\nThere is such a dearth of cutlery, and he who does not carry his own fork must use his fingers; but a hungry man can worry his meal, fork or no fork, so we bolt our food and await further developments.\n\nThe day was bright and warm, and, were it not for the sight of the hospital tent and its wounded, and the crack of the skirmishers' rifles near the church, we could almost think it a survey. No orders come, and there are no prospects of any, so we stroll out to the top of the hill and watch the red tunics that show here and there among the brush, our attention being drawn to three of them who are lying on the river side of a narrow ridge they have gained, and over which they are firing at the houses of Batoche, when sundry puffs of smoke rise in the timber and a volley is fired at these three from over the river behind them. One man was hit and rolled down the slope; his comrades returned the fire and then took cover, and as shot after shot was fired at the patch of scarlet lying motionless on the hillside, our rifles answer them and the reports come thick and fast. Colonel Williams, with two of his companies, was down beyond the graveyard at his position of yesterday afternoon, and near him a strong force of Grenadiers under Colonel Grassett, and, probably feeling that now while his men were hot was the moment for the dash he had been longing for, he sent back to Colonel Grassett to ask that officer\nto support him, and calling to his own men led the way. The fire grows hotter and a cheer goes up from the Midland, the 10th have caught the fever and take up the echoes with another shout, and the great \"I Am,\" roused perhaps from his noonday snooze, wants to know—\n\n\"What's all that row about?\"\n\n\"I think they're charging, sir,\" says an artillery officer standing on a gun near him.\n\n\"Who the devil told them to charge? I never told them to charge,\" remarks the irate warrior, and then mounts his horse and, followed by his staff, rides down to the field.\n\n\"Why in —— don't he let us at them?\" is in every man's mouth, and the astonishing variety of bad language would shock a mule driver. The crackle of rifles and hoarse cheering sets each of us on fire. This really looks like business, and excitement is at its height, when out of the corral comes Howard's \"hurdy gurdy,\" bouncing along like a feather-weight behind the four powerful horses, whilst a dozen yards in front, sitting well down in his saddle, rides the Yankee captain with blood in his eye and every line of his face meaning fight.\n\n\"Three cheers for Captain Howard,\" calls a voice, and before the echoes of the shouts have well died away, the rattle of the machine gun joins in the chorus. Another aide gallops into the enclosure, and more red and black tunics go down to join in the fun, and at last our troop is sent for to support Boulton's on the right, and we leg it down the trail near the church and are halted. \"Front!\"—our peculiar drill puts us in such position that if we front we get our backs to the enemy, and many of the troop do so, whereat the aide says to Parolles, \"It is the other way I want you to go, captain.\" \"Forward!\"—the only command we require comes at last like the starter's \"go\" at a race. Let the strategic meaning of support be what it may, our rendition is that we are to get up alongside the others, and as quickly as possible we proceed to do so. Where the deuce our commander wanders off to we don't know and do not care, we are just as well off without him, and in open order, each man just feeling his next, we join in the rush. Boulton's troop seem as happy about tactics as we are, and the two corps, indiscriminately mingled, begin to sweep the enemy out of the slopes before us.\n\nHandicapped by our heavy boots and spurs and encumbered by our useless revolvers, cheering, laughing, swearing, keeping up an irregular fire into the brush, and yet advancing at a\nrapid run, we charge—if the rush of such a lot of undisciplined ragamuffins can be called a charge. Officers are needless, for we are unanimous in our intentions; there is no red tape to hold us back; the boys have their heads now, and an officer would have no breath for orders. The crack, crack, of the repeaters come thick and fast, and the whistle of bullets tell us the enemy are not idle; now and again the dull boom of a field gun sounds over the field, followed by the echo of its bursting shell, whilst the terrible skr-r-r-r of the Gatling rings like music in our ears. We are not attacking our fellow-subjects, hardly our fellow-creatures; we are attacking a set of scoundrelly Sioux and their allies, whose fierce war-whoops when a wounded or dead man was brought in still echo about us. Knowing, as we do, that whatever few contemptible grievances the half-breeds may have had, the Sioux had none, and that only their love of blood and plunder brought them to Riel's camp, for us every man is an Indian, and we feel some of the hatred that animates Howard when we remember that these Sioux now opposed to us are refugees from Minnesota, and that not only white men, but women and children, had fallen their victims before we gave them protection. But they do not stand before us long; their fire grows weaker under our own, and distrusting the shelter of their rifle-pits, they seek that of flight. Not all of them get away, though, as we sweep through the brush and come upon an open stretch, several of the enemy break cover before us, whether they were pluckier than the rest or only slower of foot no one stops to inquire, and the repugnance one might feel at killing a flying enemy dies when one thinks what the enemy is. They drop like partridges, only one of them escaping, but as he had to run the gauntlet of some hundred of bullets for as many yards, and I noticed that he staggered twice, I fancy he carried away some little mementos the reverse of pleasant.\n\nAnd now that the enemy are doing us very little damage we begin to wish that we had red jackets to protect us from our own side, for the fighting fever has so possessed some of the uniforms on our near left, that a number of them fire at us, as we rise a gentle slope and our motley crew show against the hill; in fact, only the use of certain expletives in the plainest and most forcible English, coupled with a threat to return their fire, convince them, probably from our fluency, that we are friends. Our share of the work was over, we had driven the enemy out of the slopes of the hill along the front\nof their position before the red-coats had reached the houses, and as we lay on the ridges, at what had been their left, we watched the advance of the uniforms over the open at our feet, covering their attack by using up our few remaining cartridges at the rifle-pits along the river bank.\n\nOur own troop had suffered but little: Garden was hit in the left arm, Fawcett had a buckshot in the muscles of his chest, and there were some badly wounded hats and very ragged trousers among us; and now along came Wheeler who had helped Garden back to camp and then taken his rifle and followed, not that he could use the rifle, for his left arm was in a sling, but he was in the devil's own temper because he was a little late.\n\nThe uproar and stir and rattle of firearms gradually dies away, the sun gets low and the retreat is sounded, and after killing a few chickens at a house on the hill, which house we are ordered (from—ahem!—strategical reasons) to burn, for we still feel that corned-beef and glory are inferior to chicken and glory, we saunter back to Bateche where the infantry are throwing up earthworks, making loopholes and otherwise carrying out the orders of the Great I Am, who, now that the place has been taken with scarce any help of his, begins to exercise his mighty intellect upon the correct way to prevent its being retaken by the enemy, who are, of course, very likely to attempt it, as with little ammunition and encumbered by women and children they scatter northwards beyond harm's way; but it is military formula to observe such precautions, for if the enemy are not thinking of returning they ought to be thinking of it, and so our comrades of the red-jackets wield pick and spade, while we irregulars walk quietly up to camp and turn in, thus ending May 12th, 1885.\nCHAPTER VI.\n\nCall the affair a battle or not, it had the merit of breaking the back of the rebellion, and when one thinks of the number who are anxious to claim the whole credit of having ordered and organized the rush, one really fancies that this irregular attack of a lot of irregular soldiers is fit to be placed among most of the brilliant charges in history. Let us look at the affair as an outside observer would, and not claim any extra credit for the side I belonged to merely because I did belong to it.\n\nThe largest estimate of the enemy's strength that can be made places their number at about four hundred; and for my part I do not believe there were as many opposed to us. General Middleton, I have no doubt, in his reports places them at half as many again, and says he had the four hundred, but I fancy that there were about seven hundred of us, besides teamsters who joined in just for the fun of the thing, and also two field guns and the Gatling, which latter, handled by the cool-headed artist, Howard, in supporting the advance, was worth just about two battalions of such marksmen as our average volunteer; so our victory was not such a creditable affair when all is said in point of numbers. Moreover, they were poorly armed, with one or two exceptions, with any sort of shooting iron from an old smooth-bore flint-lock to a rim-fire Winchester repeater; whereas we had Sniders, improved Winchesters and Martinis; and, further, they were a half hearted lot, without sufficient grit to make a determined stand; although, owing to their success at Fish Creek, and the General's senseless delay thereafter, they had plucked up a little spirit. A great deal has been said about the strength of the position at Batoche, \"A veritable Sevastopol,\" one wisehead called it, and so on, but I may say that all the sketches and maps in which the number of rifle-pits has been vastly exaggerated, as indeed they were in all the engagements, give one a very poor idea of its weakness.\n\nGabriel Dumont, who is said to have planned the defence, expected the attack on the old trail about the centre of his\nposition, and made his pits strongest in that vicinity, protecting his north and south flanks by only a few scattered pits; and Colonel Williams and his men had worked their way so far on the southern flank as to be really behind the main line of pits before the rush was made, and as the greater number of the rebels who occupied this main line were driven out by Boulton's Mounted Infantry and the Surveyors' Intelligence Corps, they probably fired only a few dozen shots at the troops before the rush of our scouts was on them and then they just skedaddled.\n\nOf course General Middleton, with characteristic modesty, takes all the credit of the direction of the rush and its success upon himself—how if it had not been successful?—although the brigade orders of that day say that it was entirely owing to the volunteer officers and men; and now he, no doubt, thinks the remark he is supposed to have made, but never did utter, of \"There's death or victory in that charge, let them go,\" will be placed and perpetuated with the famous \"England expects, etc.,\" signal. I, for one, do not believe he had any idea the rush would be made, and so far from ordering it, put not a little faith in the story that when he did reach the scene and the men had cleared out the first ravine, he ordered the \"Cease firing\" and \"Retire\" to be sounded, and when neither was obeyed called out: \"Why in God's name don't those men come back, they'll all be killed?\" But they did not all come back nor were they all killed, so he did the only thing he could do—supported them and now, verb sap sat, he has $20,000, a badge of knighthood, and some little kudos, and all the credit of the charge, as he has of putting down the disturbances in the Territories. As a writer in the Montreal Star put it: \"Colonel Straubenzie as much deserves the credit of ordering the Batoche charge as General Middleton does the credit of the whole campaign:\" quite so, I absolve E. J. C. of all sarcasm, but I most sincerely agree with him—he does—but as General Middleton deserves no credit for the suppression of the rebellion, and nothing but contempt for his management of the whole campaign, the few rags of credit that fall to the other officer, will in no way lessen the praise due the better of both, who originated and forced them to support him in the dash; and although the victory was not important enough to accord him any glory, yet had it not been for him we should have been kept for weeks at the work that cost the lives of Hardisty, Kippen and others, and there is many a Canadian\nhousehold that might to-day be mourning the loss of sons like them, were it not for the pluck and energy of that better, the real leader of the rush, Lieutenant-Colonel Williams, of the Midland Battalion.\n\nCHAPTER VII.\n\nWednesday, May 13th, was emblematic of the peace that had resulted from our successful arms, as the correspondents say, bright and fine; we could explore the field in an erect position without danger of coming in the track of a bullet, so took the opportunity of having a good bath in the Saskatchewan, and felt like civilized men once more. The General had shut down on looting in the most effective manner by taking charge of a good many of the furs himself, and his zeal in this direction was imitated by so many of the officers that very few privates got a share. What became of the furs afterward perhaps we had better not ask; they constituted about all the available plunder, for the lares and penates of either Sioux or half-breed do not represent much that is lootable. I got one or two horn spoons in the Sioux camp, a new bath towel and some bars of soap, and these, with a few forks and tin dishes for our mess, made up my booty. The soap was a boon, for our most excellent (?) transport service had cut us out of that luxury, and the towel was a blessing until some confounded teamster stole it out of my blankets a month afterward.\n\nIn the afternoon we paid our last poor marks of respect to Lieut. Kippen, whose body, placed in a rough coffin, we followed down to the steamboat that had arrived the evening before. It was to be sent to his father's home in Perth for burial.\n\nThursday the whole brigade moved north to Gardepuy's Ferry, thirteen miles down the river, with our comrade Wheeler once more in the saddle, in despite of his wounded arm, and reached there somewhat late that night. I fancy that the generals, whose exploits in Latin and Greek were pounded into our heads at school, were lightning expresses to our commander's slow freight—Stop, I'm wrong here—Zenophon speaks of the \"retreat of the 10,000\"; we were advanc-\ning this time, but later in the season, when we were retreat-\ning from an enemy (that was going in the opposite direction),\nwe moved about four times as fast as we advanced, and I will\nwager that in expediting' (his own) retreat our General could\nutterly paralyze Zenophon. However, we got into camp at\nlast, and next day Boulton's troop, the Gatling, and the Sur-\nvey Corps, were sent out to round up fugitives.\n\nWe left camp early in the morning, travelling towards Ba-\ntoche, and meeting numerous penitent rebels, found among\nthem one who was willing to guide us out to where Riel and\nDumont were concealed, and, under his leadership, turned off\neastward from the trail. The usual bungling was apparent here,\nfor although there were several men in the column who knew\nRiel by sight, none of them had been placed in the advanced\nguard, and to these latter and the scouts he was quite un-\nknown. We met a number of half-breeds without a speck of\nfight in them, disarmed and sent them into camp, and just as\nthe bugle sounded a halt for lunch, two men leading their\nhorses, with a third man between them, crossed the foremost\nline of scouts. Knowing one of these men to be Tom Hourie,\nthe interpreter's son, we supposed that he was bringing in a\nprisoner, and fancying that he was attached to the column and\nwould report to Major Boulton, let him pass, one of the boys\ncalling out jokingly, \"Well, Tom, have you got Riel?\" little\nthinking that the third man was the rebel chief. Hourie\ncrossed the line of scouts unchallenged, slipped through the\nbluffs in front of the column until out of reach, and took his\nprisoner into camp, whilst we went on scouring the country,\nand our lariats hung unstretched at the saddle bows. His\nreason for avoiding us was that Riel was afraid the scouts\nwould shoot him, and Hourie wanted the imaginary reward\nfor himself.\n\nThen we tumble off, picket the horses, and lunch, whilst\nBoulton and Parolles hold a council of war, which results in a\nnumber of our men being sent on, under the guidance of the\nhalf-breed, to seek Gabriel Dumont, the Gatling and Boulton's\ntroop going back to camp, while the rest of us wander on among\nthe bluffs till we strike a shanty whose owner is a French\nCanadian with a Yankee wife. Gatling Howard and this lady\nare natives of the same place, and the two persuade the hus-\nband to guide us to Reil's little retreat, and as sundry shekels\nof silver are held out as an inducement, and he may never get\nthe chance to fool such a crowd again, he consents, and off we\nstart with the Frenchman mounted on one of our horses, Gatting Howard and Parolles in the van, and the rest of the troop following like a flock of sheep.\n\nDue south from the house we move among the ponds and bluffs at a brisk walk. The western sun gets round over our right eyes as we hold grimly on; we face it, but the frown on our leader's brow tells us that no small obstacle shall hold us back; the beams of the setting sun fall on our left cheek, and we are travelling northward, when we come on a last year's cart-track in the grass, which our guide assures us was made by Riel's cart. It crosses a long marsh with a boggy creek, and even Parolles is not fool enough to follow there, so our Canadian, perhaps thinking there is a limit even to his imbecility, leads us northward again. And now old Sol throws out long shadows in front of us, and we are eastward bound, but what are such trivial matters as points of the compass to men on such a quest as ours; our captain is evidently bent on catching Riel if he describes all the figures of Euclid to do it, so we are not greatly astonished when we feel the sun on our right cheek again, and just before a long thick belt of poplar, willow, and the like, are informed that HERE is the hiding-place of the arch rebel. Orders to draw carbines and, extended in skirmishing order, to advance straight through or over all obstacles, quickly follow, and there is blood in our leader's eye as he spurs his charger and shouts \"Forward!\" I find my next man is Maddock, and as we pick our way through the brush, our rifles reposing quietly in their slings, I hear him call, \"R——! come here.\" A horrible thought flashes over my mind—was I wrong?—is the captain a confounded fool, or are all the troop?—is there really an enemy?—and I spur to the rescue.\n\n\"What?\" in a hoarse whisper with carbine loaded (and in the holster). \"Look there.\" Visions of the remorse-smitten rebel weltering in his blood stiffen my hair as I see M—— standing afoot and gazing at something on the ground before him.\n\nHorror! it is? it is? Joy! a duck's nest with six eggs in it, and the revulsion of feeling from blood and carnage to wholesome edibles, added to the discovery that they are quite fresh, so unnerves us that we almost weep on each other's necks as we pack them in our holsters and remount.\n\nOn through brake and bog once more till the open prairie stretches before us, and reunited after our hazardous but,\nalas, fruitless search, behold a sight that gladdens every heart, for there, straight in our path, directly south and scarce half a mile away lies the cabin from which we set forth; tears dim fierce, revengeful eyes, bronzed cheeks are convulsed with emotion and exclamations burst from the stern men around; exclamations of delight, too, for \"Hell,\" \"Damn fools,\" etc., show that the boys are evidently over-joyed at the feat we have just performed, viz.: described a perfect circle of about a mile radius and come back to the point we started from. I tell you it takes an old plainsman to do that.\n\nWe reach the cabin and discover that the Yankee woman is not far behind the proverbial sharpness of her people, for while her husband has been making most egregious, I should say gregarious, fools of us, she has been baking cakes which she now sells to the boys and makes in coin therefor, and as we devour these delicacies the mail courier going east with despatches arrives and conveys the pleasing information that all the time we have been describing convolutions and curves, Reil is sitting in the General's camp fifteen miles away, so there is nothing to do but mount and jog thitherward, and during the march I notice that each individual trooper is so highly pleased with the success of our day's work that he fairly bubbles over with the expressions of satisfaction that seem peculiar to the country. And so ends another of our little bungles.\n\nThe next day was Sunday and, of course, military etiquette prescribed church parade, which ceremony was attended by most of the Survey Corps with the other troops. Three of us, however, being \"little better than one of the wicked,\" and with our thoughts fixed more on the creature than on the spiritual comforts of this transitory existence, harnessed a horse in one of our carts and sallied forth on a foraging expedition, examining with due care a number of houses on the trail northward, got sundry tin dishes and other useful articles, spent quite a pleasant morning and returned to camp with our spoils, foremost among them being several bags of potatoes found in a cellar which, with half a keg of syrup, formed an addition to our diet for a few days.\n\nSundown found the greater part of the brigade on the west side of the Saskatchewan, whence on Monday we start with rather more speed than customary, for Prince Albert, reaching there the following day—a speed only explained by the fact that there are no foes between us and the people we have\ncome to succour, and our General is anxious to pose as the North-West Havelock delivering this beleaguered Lucknow. What a pity that as we enter and receive the plaudits of the assembled multitudes (?) we cannot discover any sort of Jenny Campbell episode, and how we regret having no bagpipe or jews-harp or other sweet-toned instrument to announce our arrival, for we have been so long on the way that one could almost work up a lot of heroics out of it; but alas! during these terrible and arduous marches the strain upon physical energy had been so severe that the only music that disturbs the stillness of the night is the melodious snore of a major-general or other great I Am, or the soothing voice of a transport mule calling to his mate. We have come, seen, conquered; our deeds are chronicled as those of the mighty men of old, the glorious name of our gifted leader has burst forth in brightness, now that Colonel Williams and Canadian Volunteers have kicked over the bushel that enshrouded it, and as we rest our war-worn limbs and sigh for more worlds to conquer, the Sovereign of our country prepares to heighten the brilliancy of this farthing candle whose light is all of gravy, gravy, gravy. Congratulations from real soldiers pour upon him, and while but little is said of those to whom credit is due, the well-meaning but unweighing and impetuous gentlemen who make our laws are even now about to tender a more substantial but undeserved token of appreciation to this modernized Major Monsoon.\n\nCHAPTER VIII.\n\nThe question now asked by the brigade who have not yet had a surfeit of \"guns and drums and wounds, God save the mark,\" and are not yet convinced what an utter imbecile their commander is, is whether Poundmaker and his Indians are going to show fight or not, for we had heard so much of the evil deeds of this particular band of Crees that we looked upon them as real game. However, our Warrior somewhere in the recesses of his mighty brain has stored the old whist player's maxim of when in doubt play trumps, and the mountain called\nPoundmaker giving no sign of coming to Mahomet, that gentleman decides upon going to the mountain. The lesson he has learned from the half-breeds at Fish Creek and Batoche is not quite lost, for determined that this rival star in the horizon of battle shall learn something of his mighty name in arms, and aware of the effect of a little preliminary bluster on an Indian, he despatches a note to the chief telling him that He has defeated Riel, and will serve Poundmaker likewise in short order if he does not come in and surrender. After events prove that Poundmaker is fool enough to believe the General will keep and can keep his word, but the simplicity of the Indian is excusable in one who knew so little of that officer, when I recall the fact that we ourselves who knew him better had not quite divested ourselves of the idea that there must be some determination in him.\n\nHaving sent his ultimatum (let us use polysyllables as befitting the pomposity of the sender) the General followed it in person on Friday, May 22nd, by steamer up the North Saskatchewan, guarded by the Midland Battalion and the Gatling gun, and, as there was a possibility of the boat becoming stranded on the bars, he took Boulton's Mounted Infantry on board also, doubtless to haul the vessel up the river by horse power if she stuck fast or if her machinery gave out—I can find no other explanation for his thus moving mounted men. The remainder of the brigade awaited further orders at Prince Albert, and to kill time the following day, Saturday, was observed as Her Majesty's birthday, and celebrated in addition to the customary races and games by a few delicacies such as milk and butter for dinner; but the next day we donned our armour again and Grenadiers, French's Scouts and Survey Corps set out for Carlton by trail, the 90th going by water.\n\nThe reveille sounded at the usual unholy hour and we were told that great time was to be made, in fact that Colonel Otter and his flying column would be looked upon as slow freight compared to us, but our Deputy etc., etc., etc., has a touch of his chief's complaint and it was 10.30 before we got off. The infantry were to go in heavy marching order, knapsacks and all the rest of it, and so they did and big time they made, but as they travelled in the waggons the fatigue was not severe, and as our speed was not much greater than a nursery-maid with a perambulator makes we did not exactly devour the way, only reaching a point about a mile south of the forks of the Carlton trail, and seventeen miles from Prince Albert, by\nnightfall. Monday was a repetition of the previous day, but towards evening we did make the ruins of Carlton, being a total distance of forty miles in two days; verily our speed was rapid, but I think Col. Otter beat us. Here we were to cross the river, for our troop and French's Scouts were to convoy a hundred and seventy waggons to Battleford, while the infantry embarking in the steamers were to proceed by river, and the next morning the work of ferrying began early, though we were as usual kept standing saddled until late in the afternoon, there being rather an extra allowance of the bungling that invariably accompanied the transport service in the management of this duty, and it was sunset before we camped on the top of the north bank ready for a move next day.\n\nParolles informs us he is in command of the outfit, and gives us a big dissertation as to how He (with a capital H) is going to run the affair and make these teamsters move around, but verily he reckons without his host, for Sinclair, the \"Boss\" teamster, has decided to do his own share of the running, and subsequent events prove his success.\n\nDiscipline, as far as its real meaning is known to Parolles, might be a hieroglyph and even our bug-bear, red tape, is shorn of its dignity. No attempt is made to keep the waggons in control or position, it is a race between them to see which will have the best place, and poor Parolles has to exercise all his horsemanship to save himself from being run down by the unruly waggoners; on one occasion, indeed, with his eyes sticking out like a frog's that you have stepped on, he informs a teamster who drives into our ranks, and scatters us like a bursting shell, that he will shoot him, which childish threat only provokes a hoarse guffaw from the brawny puncher of mules. Sinclair, knowing his man, camps where and when he pleases, and Parolles has to pocket his dignity and follow suit, for he dare not leave the waggons unprotected (?)—fifty odd men to protect one hundred and seventy waggons is rather good, but there is no enemy, so it matters little.\n\nThursday was a repetition of the previous day, but on Friday we had a lesson in expeditious movement that I hope was not lost on us; some of the waggons began to move before the troop had mounted, so our brave Captain, his eye in the proverbial frenzy, shouts, although many of the horses were still unsaddled: \"Prepare to mount—mount—files—left turn—forward—trot!\" and there is a delightful helter skelter. Parolles, with his spurs in his charger's ribs, starts off at a canter.\nGore, who is No. 1 rear rank, follows, and I, who am No. 5 front rank—remember our peculiar drill—ride up alongside him; as the intervening files, and nearly all the remainder of the troop, are yet wrestling with girths and buckles. The teamsters, imagining there is either a race or a panic, whip up their horses and cheer us as we pass, with such remarks as \"Bully,\" \"Go it.\" \"We're the stuff,\" for a couple of miles, and when Parolles—his anger jolted out of him—slackens his speed, I look back from the vanguard of the solitary three and see the remainder of the troop scattered over at least a mile of prairie, each man riding up with a broad grin on his face, and showing that our leader's efforts to get the corps into a good humor by temporary relaxation of our cast-iron discipline have been, in measure, crowned with success; whether the laugh is at him or not this witness is silent. We fall into our places again and the monotony of the march is resumed until, later in the morning, riding along the trail led by our Parolles, who has fallen into gentle slumber, we miss the rattle of wheels behind us, and, looking back, discover that the old Indian who drives the leading team is striking off to the westward, followed by the whole waggon train, whilst we are pointing our horses' noses to Fort Pitt; so P., pocketing his dignity once more (that poor virtue, how roughly it got handled, it was so constantly shoved out of sight) spreads out scouts, for Heaven knows what, and the rest of the troop fall in behind their copper-colored guide, proceeding in this order until about 9 a.m., when the welcome \"halt\" and \"come to the cook-house door\" are blown, and we off-saddle for breakfast, or dinner, or whatever it may be called, as we have already had one meal to-day. Saddle again, and on westward until far across a valley before us the white houses of Battleford appear, and \"Nitchi\" drops his reins and tumbles out of his waggon, a movement that, executed under P.'s eye and without his orders, ruffles his plumage and renews his slumbering ire. He can't speak Cree, and our friend's English is not intelligible, so, still mounted on his war-horse, he seizes the reigns of our guide's team and attempts to urge the animals forward—he couldn't get lost now. That was an excellent sketch Gore made of the \"troubles of a commanding officer in the N.W.T.,\" representing P., with his long stirrups trying to stick in his saddle, his elbows over the top of his head, making ludicrous and ungainly efforts to drive the very small mules, whose enormous ears are all we can see over the seat of the waggon, but, like most of P.'s praiseworthy but\nmisdirected zeal, it proves a failure, and progress is delayed until our guide remounts—even his nutmeg-colored phiz wrinkled into a grin at this display of equestrian skill. So onward as before to the Saskatchewan, which we reach at about 2 p.m., and across which we are ferried by steamer next day, camping near the barracks of Battleford.\n\nChapter IX.\n\nEvery one knows, at least through the medium of the papers, what Battleford is like, so a description of the place is superfluous. There is a fort there, too, built on the ridge of land between the Battle and Saskatchewan rivers. Who built it I don’t know, or for what purpose I also plead ignorance; but the strategist who placed it where it stands must have been sadly misled as to the theoretic amount of rainfall, if he intended the defenders of the post to obtain all their water supply from that source in event of a siege, as there is no well in the fort and no water. Luckily the Indians did not press the place too closely. Fancy building a fort on a hill and having to send water carts down some five or six hundred yards to the river under an enemy’s fire. Hurrah for military science (?).\n\nHere we found Colonel Otter’s brigade and some old chums among them, and here we began to think of getting back to earning our bread and butter again, for Poundmaker had been frightened by the General’s “bluff” and come in and surrendered; but late on Saturday night we received orders to be in readiness to move to Fort Pitt next day, as a courier had arrived from General Strange with the report of his fight with Big Bear and his Crees at “Stand Up Coulee,” and a request, ça va sans dire, for reinforcements, and accordingly early morning saw the Prince Albert Brigade again on the move, leaving Colonel Otter’s division at Battleford.\n\nGeneral Middleton’s alleged reason for this disposal of his forces is that he knew and could depend upon his own brigade, thereby inferring that he couldn’t trust the other: it looks very much as if his real reason was a contemptible wish to snub Colonel Otter and his command, as that officer had fore-stalled his chief and gained some kudos at Cut Knife Hill,\nabout which fight and the wisdom of Colonel Otter's march, battle and retreat, much has been said and written. Not much value can be placed upon the criticisms or opinions of such red tape tacticians as the generals in this campaign, for such opinions cannot weigh against common sense, and emanate probably, in the case of the General commanding, from a feeling of envy towards many of his subordinates; but I believe that Colonel Otter's attack, and the pluck and determination of his men at the fight of Cut Knife, broke Poundmaker's back and prevented him from joining Riel, and that Cut Knife and one other fight were the pluckiest of the season, as in both of these our men were outnumbered by the enemy.\n\nIn support of what I have said of General Middleton's wish to tie Colonel Otter's hands and prevent him from taking any more wind out of his sails, I will only say that Colonel Herchmer's Police and Major Short's Gatling, which had formed part of Colonel Otter's division, were now attached to the Prince Albert column, leaving Colonel Otter with scarce one mounted man: comment is unnecessary.\n\nThe greater part of the brigade went up the river by steamer and Herchmer's Police, Boulton's Mounted Infantry, French's Scouts and the Survey Corps by the south trail to Fort Pitt early on Sunday morning. Noon on Tuesday, two days later, finding the whole brigade on the north side of the Saskatchewan about five miles below Fort Pitt, where once more, under the baton of red tape, the consequent Bungling (with a big B) became prevalent.\n\nGeneral Strange had attacked Big Bear at a small creek near Frenchman's Butte, and as the Indian chief had held the position and General Strange had retired, the creek and valley were promptly named, \"Stand Up Coulee.\" I have seen the report (\"ahem! official,\" as Sir Joseph Porter would say) of the affair, but as it and all the official accounts of actions in this campaign partake of the nature of that written by the old sea captain in one of Marryatt's novels, it is hardly worth remembering. I daresay General Strange defeated Big Bear—the enemy were always licked—but why did General Strange retire fourteen miles to Fort Pitt? Strategy, I suppose? He leaves the Indians in their position, retires to Fort Pitt, waits there a day or so, moves out again, camps a mile north of Big Bear's position, and then sends word to his commander that he has \"corralled\" the Indians; after a bit he concludes that it would be advisable to find out where the Indians are and\ndiscovers that the \"degraded and undisciplined savage, you know,\" has disregarded the courtesy of war, cut a road through the bush east and north-east, eluded the vigilance of the militarist, and may be on his way to the North Pole for all our general knows to the contrary. That whole manoeuvre, like the other scientific military tactics of the campaign, is something one needs a rare amount of education to understand, appreciate or applaud, so I won't attempt it, but I may say, in justice to General S., that I have been told by certain of his command that he was justified in not feeling confidence in the \"Johnny Canuck\" part of the brigade under him and that he had reason for distrusting their steadiness in action—perhaps so!\n\nHowever, General Strange was camped at the Coulee, Big Bear, et al., had vanished, and General Middleton was at the river near Fort Pitt on Tuesday, June 3rd, early in the morning, and one would suppose that a march towards General S.'s camp would be begun at once, but as that would require due consideration, and an immediate move would be undignified, none was made.\n\nWe were directed to camp, and a number of the infantry—who were by trade mechanics—forthwith set to work to manufacture pack-saddles, although there is an excellent waggon trail. About sixty of these so-called pack-saddles were turned out during the day, though what use they were no one knew, certainly not for packing, as out of the lot probably not one was fit for the purpose for which it was intended.\n\nThe next morning the mounted men proceeded to General Strange's camp, reaching it before noon, and shortly afterward that officer struck his tents and moved in a north-westerly direction towards Onion Lake, his camp ground being occupied by General Middleton, who, with fifty men of each of the 90th, 10th and Midland Battalions, arrived during the afternoon.\n\nAbout midnight on Wednesday a courier arrived and reported the fight between Major Steele's command and Big Bear's Indians at a lake placed from thirty-five to fifty-five miles distant, and at four a.m. on Thursday we were on the move following the trail, mounted men, infantry, Gatlings and all: the pack-saddles? Oh! yes! we did not forget the pack-saddles, they were brought also—in the waggons.\n\nI suppose the idea of waggons following an Indian trail through a thickly-wooded country is rather startling to civilized people, whose acquaintance with the noble red man is derived chiefly from the works of Fenimore Cooper or Park-\nman, but the Indian has sadly degenerated since the days of Pontiac, and the trail left by Big Bear was no faint and indistinct track made by men with moccasined feet in single file or any such absurdity, it was a broad road cut through the woods, better than many a Canadian bush road, beaten by the feet of some hundreds of men and horses and the wheels of nearly a hundred carts, for General Bear had carried off sundry spoils from the unfortunate settlers at Frog Lake, and over it horsemen could easily travel six miles an hour.\n\nA mile or two out we found a relic of the Coulee fight in the shape of an Indian killed by the fragments of a shell; he was, I believe, coming out with a flag of truce when the brilliant youth in command of the gun made a target of him. I have further heard that he was the only Indian killed by the troops that day, so their shooting did not rise above the average.\n\nAbout five miles from camp we hit upon an old cart trail from Fort Pitt, leading in a north-easterly direction, and a halt was called, for deliberation very likely, as it was evident that the Indians had followed this old road, and \"such an extraordinary thing, you know, must be considered, by Jove.\" Saddles were taken off and the boys were rubbing down and looking to their horses, for it was understood that fifty miles were to be covered before camping, in fact that we were to reach Loon Lake, the scene of Steele's fight, when up go the infantry tents and ours were ordered to follow their example.\n\nThe astonishment on every face and the curses, \"not loud but deep,\" heaped on the General's head, could be understood and appreciated only by those present and, indeed, had I not actually been there I could hardly believe that a man calling himself a soldier and a general, could dawdle and delay in such a ridiculous, senseless and childish manner. When one remembers that he had some two hundred men in his command and that forty miles distant, along a cart trail, Major Steele with forty-six men had the previous morning attacked probably thrice that number of Indians, driven them out of their camp and was at that moment waiting for us; that each horseman could carry from three to five days' provisions and reach the scene that night; that supplies and forage could be rapidly pushed along the trail after us, and that had even half the horses been killed by the journey their loss would have been as nothing compared with the value of a decisive blow, and the Indians were so demoralized by Steele's attack that\nwe should have been able to demand their surrender and the delivery of the prisoners, some of whom were women and children, or to obliterate the whole tribe.\n\nAnd what is done? The camp is turned into a factory for \"travails,\" as if the idiocy of useless pack-saddles were not enough, and from about ten a.m. on Thursday until Friday night, nearly two days, we are in camp pottering over these primitive conveyances. What is a \"travail\"? As many people have never seen a \"travail\" or \"travoie\" I will try to describe one. Suppose a couple of long poles between which a horse is harnessed as between the shafts of a cart, the rear ends of the poles trail on the ground, and the load is carried on a framework of cross-bars just clear of the horse's hind legs and you have a travail; but do not think you can imagine how small a load can be transported on one, or what antics a horse accustomed to the civilized harness of a double team would perform when he found himself saddled with this primitive style of go-cart.\n\nOn Friday night the infantry were sent back to Fort Pitt, and next morning, after this very necessary halt in our rapid forced march (?), we moved forward again, mounted men, Gatlings, waggons—oh, yes! waggons—and the travails? packed on top of the waggons.\n\nA few miles on we found Steele and his command—that officer not having been able to follow up his advantage from lack of supplies and ammunition—and at once notice the genius and forethought required to make a forced march with due regard for the proprieties. What a vast advantage education confers on a man; here is Steele, a poor ignorant devil of a Canadian, with his seventy men away up in this blawsted, howling wilderness, you know, and no waggons, no tents, no comforts; positively nothing, you know. We come upon a little open patch and see drawn up and waiting for us Major Steele's troop of mounted men, bronzed by sun and wind and toughened by hardship and exposure; led by a MAN, and unencumbered by red tape, they had pushed rapidly after these Indians, fought and beaten them, and, after waiting vainly for support for two days, were now ready to show us the way. Truly they are like the scouts one used to read about, and yet, beyond some few lines barely mentioning the fight, I have seen nothing written of this plucky officer and his command.\n\nWe feel a conscious superiority in our great leader's method\nof procedure when we contrast the victorious march of our host with that of Steele. With us everything has been done with regard for dignity and thought and the eternal fitness of things. Travails, pack-saddles, waggons, Gatlings, supplies, surgeons and hospital comforts, and all that is the correct thing where speed is required. Orders are issued at night with unfailing exactness, and the start in the morning is never more than an hour or two behind time. Couriers take dispatches southwards and special war-correspondents chronicle our advance, and describe the terrible nature of our many hardships, in such glowing terms that all Canada stands amazed at the marvellous determination of our gifted commander, and if the fact of there being prisoners in Big Bear's hands, who are every day getting further from us, comes to our remembrance at times, we are so satisfied with our own greatness that they trouble us but little. Who dare judge us?\n\nThe Survey Corps formed the pioneer troop, and although delayed by \"brushing up\" some of the mudholes of this impassable (?) trail, we cover nearly twenty miles in a short day. Now and then we crossed soft mudholes, and occasionally horses and indifferent riders parted company therein; once, indeed, his generalship, the commander-in-chief, afforded us some little amusement by sliding over his horse's quarters and coming down in a most undignified sitting posture in the rich black mud. He did not fall with grace, either, being somewhat of the build of Falstaff, and of a very much brighter complexion—and I regret to say that the respect due his rank did not smother the laughter of the boys as he climbed into the saddle again. How we wished that the mudhole had been bottomless, and that he had sunk out of sight, but there was no such luck; like the Old Man of the sea he rides his Canadian Sinbad and we cannot so easily get rid of him.\n\nNext day (Sunday) was a repetition of the former. The dense and impenetrable forest is small poplar, averaging the thickness of a man's arm, growing over a gently-rolling country, with occasional small ponds and marshes, and the faint trail is a good bush road; there are very few mudholes of any account, and scarce one black-fly or mosquito to worry men or horses; Nature, too, is aiding us as she best can, for brighter or more delightful weather is seldom seen. We have left our tents at the camp of Sunday morning, and so our flying column continues its forced march into the trackless wilderness. We halt for noon near One-Horse Lake and the waggons overtake\nus; his generalship lunches near us and we remember that song of the Major-General in the \"Pirates of Penzance,\"\n\n\"And when I know precisely what is meant by 'commissariat,'\" as we look over our hard tack and corned beef and see him tucking into marmalade, jam, etc.—(oh! we're a hardy lot, we are, we are, we are!) Then we remount and forward again, and the monotony is broken by the sight of a sorrel horse across the valley in which lies One-Horse Lake. A horse does not count for much, particularly as it is one lately belonging to Steele's command, but of course some bright youth, in his vivid imagination, sees two men, and we thirst for gore as we handle our rifles and send back word to the Great Mogul, who tells us to \"keep a couple of men dismounted ahead,\" and otherwise provides for our safety.\n\nHere the country becomes a little more uneven, and a mile or so further on we ford a small rapid stream, and shortly afterwards strike probably the same stream, now sluggish and deep. A single-track bridge crosses it, and the axes of the pioneer corps soon make this large enough for our waggons, so that nightfall sees us reach the hill overlooking the scene of Steele's encounter with the Indians at Loon Lake, the immense distance of about eighteen miles from the morning start-point. That was a plucky fight, and one for which Major Steele and his troop deserve real credit. If one believes General Strange's report of the \"Stand Up Coulee\" affair, Steele must have here attacked six hundred Indians, and even putting their numbers at one hundred and fifty (it is probable that these are the six hundred) it was the most dashing skirmish of the whole campaign. Major Steele's available men were forty-six in number, making the odds three to one, and yet our great I Am, with over two hundred and fifty men and two Gatlings, seems afraid to overtake these same Indians.\n\nAll along the trail, wherever an abandoned Indian camp was passed, there was a rush for loot and trophies, and as the general and his aides could not always be first in, he had issued orders on Sunday that no one was to go ahead of the advance guard or leave camp after halting, for somehow Gatling Howard, who was with the column, always managed to get before the commander; and now when we camped on the hill at Loon Lake, his generalship and aide proceed down into the Indian camp on a tour of inspection, the Mogul flattering himself that at last he is successful and the first man in. Visions of furs, better than those he got at Batoche, fill his mind's eye,\nwhen he sees a figure moving about among the tepee poles and begins to wish for his body guard and Gatlings, for may it not mean Indians and scalping?—and what a prize the chief of the soldiers would make for Big Bear! Why, the army would be lost without all that skill to direct it! But the figure saunters out into full view, and instead of the dirty blanket of an Indian it wears a neat dark blue jacket with brass buttons, riding breeches, into the pockets of which its hands are thrust, and immense boots, and a forage cap is tipped carelessly on the back of its head. Doubt and dismay fill the general's mind; nearer it comes, whistling a quickstep, unarmed, save for a pistol in its right boot, kicking over and examining abandoned stores, as though there were not an Indian in the country; and the General, his fears replaced by offended dignity, as he sees the very man his orders were aimed at, shouts out:\n\n\"D——n it! can't I get anywhere before you?\" for the tune is \"Yankee Doodle,\" and the man is the Yankee Captain.\n\n---\n\n**Chapter X.**\n\nThis turning in, prepared to start with three days' provisions, is getting a little tiresome, but the sight of the battleground has livened us up a bit, and we lay our heads on our saddles on this Sunday night, hoping that at last our commander is going to show his energy, and that the early move tomorrow really means business. The waggons are to be left behind, guarded by the Gatling batteries and French's scouts, and the rest of us, with three days' provisions, are in the saddle at six a.m. It is our turn to form the advance guard, and we move forward to take the lead, when Captain Haig meets us and crushes our hopes with orders to move back to our ground as new information has arrived, so we mentally swear at the general as we gloomily obey.\n\nWhat the information is the Lord only knows, but we wait until 9.30, and then again, followed by the waggons, ford the lake and continue on the trail. As we leave camp, alongside the path we come upon another and more ghastly sign of the enemy—the first Indian killed by Steele's band—and I guess that if ever there was a Nitchie astonished that was the one.\nBig Bear had so poor an opinion of white men after his brushes with General Strange that he scarcely dreamed of being followed, and when Steele reached the hill overlooking his camp at Loon Lake on Wednesday morning he was totally unexpected by the Indians, who, in fancied security, were striking their lodges below. While moving his men forward to the attack on foot through the brush, the Indian picket starts back along the trail to scout for signs of the soldiers. He probably does it only as a matter of form, and he feels uncommonly fit after his \"tuck in\" of pork and etceteras—spoils of his bow and spear at Frog Lake such as he never got from the Indian Department—as he rides up the hill where the scouts lie; for his heels joggle Indian fashion against the horse's ribs, and he hums the monotonous \"Hi-hi-yah, hay-hi-yah, hi-yah-hi-yah, hay-hi-yah,\" that is war song and every other song for him: but he is waited for, a scout hears him, and with cocked rifle stands ready to help him sound the alarm. The dusky warrior, riding at a trot, appears over the crest of the hill; the low chant rises into an astonished yell, cut short by the crack of the repeater, and the riderless horse gallops back to camp, whilst the savage lies shot through the heart on the slope, and before the echoes of his voice have died away they are drowned by the rifles of Steele's men as they begin the pluckiest fight of the season.\n\nSteele, as I have said, had forty-six men against probably one hundred and fifty, and yet he attacked them, drove them out, and was only prevented from pushing his advantage by the arm of the lake, which he would have been obliged to cross under fire. After the affair the Indians had come back and picked up their comrade, and were probably taking him away when some alarm caused them to drop him, and there he lay; the scouts had cut open the bundle to find out who he was, and our friend has nothing but the blanket fastened to his neck as we pass him. He is a disgusting object, but we think of the Frog Lake settlers and feel rather glad—you see he is a good Indian now. Our general, reminded by the sight of Steele's success and jealous of it, remarks that \"some of our men are worse than the savages,\" but never issues any orders for the funeral of the dear departed; nor did he at Batoche, I may add, leaving the dead rebels lying about the field; he did not at Fish Creek either, at least not immediately after the affair, but that was for a deuced good reason—he never got near enough to the field to see if there were any of the enemy killed or not.\nWe have no scruples about the Indian scout, and leaving him by the roadside, we ford the arm of the lake and proceed; up and down among the hills the trail winds northeastward, past another camp ground and numbers of abandoned carts about three miles on, turns westward, and comes upon the lake where it discharges its waters northwards towards the Beaver River. Another stoppage, more orders, more confusion; the river is not forty yards wide, and the bottom is hard sand, with only a dozen feet where a horse would have to swim, but it is quite enough to stop us. A lot of timber, cut by the Indians for houses, lies along the shore, and after some of the usual delay for consideration, definite orders are issued to Colonel Herchmer's Police to make rafts, ferry the saddles and accoutrements, and swim the horses. Two rafts are in time put together, but the timber is green and heavy, and each will hold only one or two saddles and two men, so it is likely to be a tedious process. We find an old canoe, leaky and nearly going to pieces, but a little heat applied to the seams of the birch bark makes it serve, and we begin to ferry the Survey Corps' saddles until ordered to desist, as they might get mixed with those of the Police, so we ferry policemen instead, nearly getting swamped by some of them, and when they and their horses are on the west side we are very close behind them. All the mounted troops are across by nightfall, and we camp in the woods close to the ferry, thus concluding another of our big days and forced marches by a distance of about six miles.\n\nThe road ends east of the ford, and the waggons can really come no further by this trail, so once more we begin to hope for a push along the well-beaten horse track before us; but our hitherto unshaken faith in the skill (?), energy (?) and untiring determination (?) of our chief is failing a little, and the hope is a faint one. A stretch of marshy land lies west of us, and close by our camp, at the edge of this marsh, we found the body of an Indian woman; the poor creature was in a sort of kneeling position, her body hanging forward so as to throw its weight on the slender cord with which she had strangled herself; a small collie dog, with poor Delaney's name on the collar, was keeping guard over her, and the faithful little brute was at first quite vicious when we came near. From this it was supposed that she had been a servant of Delaney's, but some of the half-breeds said that her husband was the surprised scout, that being a very heavy woman she had been left\nbehind by the tribe, and, hearing our approach, had committed suicide in preference to falling into our hands.\n\nThat night there was a grand council-of-war held in the great man-of-war's tent, and again the three days' provisions and early start were on the bill of fare, and we roll ourselves up in our blankets by the fire and think this really looks like business; no tents, no waggons, no encumbrances; surely we are off in earnest now. We have had our supper of tea, hard tack and corned beef, our horses have had a good feed of oats, and with revived hopes of a shot at the noble red man, we glide off into dreamland and oblivion, when \"crack!\" goes a loud report in the middle of the sleeping men, and every one is awake in a moment. Startled from the arms of Somnus to the reality, the hardship (?) and the danger (?) of our position, we behold by the flickering light of the fire our Parolles, who had been giving us a lecture about lying still in event of a night attack, tucking his shirt into his trousers, with enough martial ardor in his eye to burn a hole through a blanket, and then—\"crack!\" rings out another shot. We reach out for our rifle, leaning against a tree at our head, and wait for something to turn up. But nothing turns up; there is no such luck as a night attack, if any of us are green enough to expect one, and the shots prove to have been a couple of cartridges falling out of a policeman's belt into the fire over which it was drying; and grumbling and disappointed we go off to sleep again.\n\nPerhaps the sound of a rifle shot, unheard for so long a time, brings back to our noble commander a remembrance of all the lives that are in his charge; perhaps he thinks there is too much risk in pushing forward and leaving his waggons and supplies; perhaps—the Lord knows what; but after turning out at some unholy hour, and making all preparations for an advance, our wretched horses are kept saddled, standing in the camp ground—which, by the way, is a spruce bush, and every one knows what an excellent pasture for horses that must be—for about three hours, and then we are told that the muskeg before us is quite impassable, etc., etc., and that we cannot go on.\n\nUnfortunately we must obey, so after exploding a certain number of strong expressions, we turn the ponies out to feed in the marsh, and set out to examine this terrible and insurmountable obstacle. We find that a stretch of wet land, probably a mile across, lies between us and the high ground to the west—low and marshy, it is true, but covered with a thick growth of willows; and although it is somewhat soft above,\nthe frost is still in the ground a foot below the surface, and horses can cross; there might be some bad spots, but it would never stop a Canadian. However, our disposer is not a Canadian (thank Heaven), so we walk south, along the point on which our camp lies, and confirm the opinion formed on the previous day. Big Bear knows that he is pursued by an old woman, and the crossing and re-crossing of the lake is just a little dodge of his to throw the avenging angel off the scent, and very effectively he has done it. From the south extremity of the point we get a clearer and better view of the west shores of the lake than when riding up east of it yesterday, and are now certain that the whole column, waggons, Gatlings and all could be easily moved up the west side, through the small scattering timber, until we hit the Indians' trail west of and beyond the marsh, thus avoiding lake, ford and muskeg, and encountering no difficulties whatever, for the timber is small and scattered, and the land unbroken by ravine or valley from Steele's battle-ground to opposite our camp. There is some little satisfaction in knowing this as regards ourselves, but it only makes us think less of our commander than ever, and we sulkily turn back to camp, where we find that, with the aid of the old canoe and a trolling spoon, \"Gatling\" and one of the troop have secured some fish, so we sit down to supper and drown sorrow and disgust in copious draughts of tea.\n\nOh! Tea; thou sublime and blessed infusion of sloe leaves, brown paper, bark, old rags and general refuse! how flat would life be without thee! How often hast thou disguised the nauseous flavor of alkaline water in the summer heat of the plains, and revived our shivering bodies when the mercury is shrivelled up until it is solid! What zest dost thou lend to the ubiquitous pork and beans of our native land, and now, as we follow our hardy and indefatigable leader far into the impenetrable forests of the frozen north, fighting, and bleeding, and suffering, and swearing, and all the rest of it, for our beloved and grateful country. How thankful do we feel that the idiots who manage the transport and commissariat services have not succeeded in robbing us of thee! They may take our beans and our dried apples, our bacon and our sugar, our molasses and our flour, and they have done so; but with thee, as we dissect the dark and bloody mystery that bears the name of Armour, and break our last set of teeth on the biscuits of Portage la Prairie; with thee we can forget even the imbecility of our leaders, and suffer and be strong.\nThose were pleasant evenings round the camp fire; \"Gatting\" Howard, full of amusing anecdote and reminiscence, made one of us; we all had roughed it in bush and plain, and again we stalked deer and antelope, brought down the strong winged bird, or hooked our biggest salmon, over our game of cribbage, as if we were out on a picnic, not a single black-fly or mosquito, and such delicious cool nights; verily old dame Nature is showing us the pleasant side of her face, and were it not for the glint of the firelight on pistol or rifle, or the bad language of some hot-tempered comrade, impatient at our delay, we could almost forget our errand and the skilful tactician commanding us.\n\nAnd whilst we chaff and spin yarns and score up the points around our fire, at the general's tent is gathered a solemn conclave, considering the weighty responsibility of risking our valuable lives in attempting this bottomless morass, over which some hundreds of Indians and ponies have crossed within two days. And a brilliant and most intelligent lot they are: a major-general, a captain of Royal Engineers, an infant lieutenant, an Indian Department official and a major of militia, each knowing less than the other, offers suggestions and advice ad nauseam. Herchmer and Steele are not asked for opinions, for our disposer does not admire the Police, and the council, after much deliberation, having little brains to guide them, evolve the following plan:\n\nMore early starting, rationed for the usual three days, and to-morrow morning we are to cross the muskeg in the following order: Boulton, Steele, Surveyors and, lastly, Herchmer's Police. That looks all right, but there is a philosophy in such order of going that may be thus translated: Boulton is Steele's senior and therefore will be in command, and Boulton, who is all red tape, will wait until ordered to go on and keep Steele also, had Herchmer gone first—well Herchmer is Boulton's senior, and with him in command their respective guardian angels would need to look sharp after Big Bear's skin and the general's credit, for the devil a rag of either would be left. I may add that Boulton told me afterwards that it would have been very risky to leave the guns and waggons. Had Herchmer with the mounted men once got across that muskeg, as he could have crossed, he would have been on top of the Indian camp while his commander was wondering whether there was any jam for dinner or not.\n\nHowever we have orders to cross and we turn in for a\ngood night's sleep, confident even to the last that the \"big push\" is to be made, and that before to-morrow's sunset we shall be squaring accounts with Big Bear. But, alas! once more we have built our hopes on too feeble a foundation, and with the morrow comes the musical voice of the aide telling our captain that \"The general has sent me to tell you he has made up his mind to return to Fort Pitt.\" We are now getting so accustomed to it that we don't swear very much, too sick of the vacillation of our commander to do much but swear mildly at ourselves for expecting anything else. Last night, mind you, the orders were to cross and pursue, but when the captains have retired, each to his particular spruce tree, and the general is left alone in his tent—the only tent in camp—the frightful risk of going far away from the Gatlings and waggons, of putting long stretches of forest between himself and his preserve and marmalade jars, of braving the attack of the deadly black-fly and gore-seeking mosquito, of sleeping on the hard ground with his bones cushioned by only his half-dozen blankets and their natural clothing of fat, the awful hazard thus pictured must have been too much for him.\n\nIf these are not his reasons we have yet to hear them, as our opinion of his reasoning faculties is thus aptly expressed in the words of Shakespeare:—\n\nGeneral—\"My honest lads I will tell you what I am about.\"\nCanadian—\"Two yards and more.\"\n\nAnother probable reason may have been that he would have been obliged to leave behind the spring mattress he slept on (a spring mattress sent out for the wounded, but used by the great man while waiting for casualties—just to keep its springs soft, I suppose; so hardy and energetic a soldier would scorn any other pretext).\n\nBut the result of his cogitations is that we are ordered to retreat, and we recross the river by the flimsy floating-bridge that has been built over it, carrying the saddles and swimming the horses, carefully destroy the travails and the old canoe, and burn a lot of carts abandoned by the Indians at their last camp. Destroying of bridges is, of course, one of the rules of etiquette observed by all great militarists, so our Xerxes orders his soldiery to carry out this strategical move—we are not to lose a point of scientific training in the art of war, if he can help it—and we faithfully obey. Many of the carts were owned by settlers at Frog Lake and other places, and as they could go no further north would all be taken back southward\nby the Indians, and very likely handed over to the Indian Department when this little storm is over; and for the rest that belonged to the Indians, well in most cases they were supplied by the Government, and burning them only gives the said Government another opportunity of spending money and giving another lot to their grateful red pensioners, so it is as well to burn them all. Leaving behind us such impedimenta as pack-saddles and travails, neither of which had been used, and turning our backs upon Big Bear's supposed position, we wind southward among the hills towards the Saskatchewan, and our general shows a rapidity of movement and steadfast determination of purpose that would greatly astonish us if displayed in any other strategic evolution than that of retreat; indeed his expedition is marvellous for him, for we cover in one day the distance it had taken two to compass on the forward march, and camp at our old ground of Saturday night. Thursday brings us within a few miles of Fort Pitt, and early next morning we rejoin the main body of the brigade on the hill above the ruined post, and begin to think of the trip back to civilization. But we are premature; long before nightfall rumors hum over the camp that General Strange has found a cache of three hundred bags of flour at the Beaver River, and that Big Bear is making in that direction. Why the devil Big Bear should be supposed to be such a helpless imbecile as to rush into the seductive embraces of even General Strange this deponent sayeth not, but our \"Warrior\" evidently thinks him fool enough, and fearful that some of his own laurels may fall upon his brother general, resolves upon another of his deeply-planned and skilfully-executed strategic movements.\n\n---\n\n**CHAPTER XI.**\n\nOh, lucky infantry! blessed by being left alone. Upon us poor devils of mounted men devolves the glory of carrying out this one more hazardous and daring stroke; and on Saturday morning, after a night's rest in the camp of our comrades of the scarlet and black tunics, Herchmer's, Steele's and Boulton's troops, the Gatlings and Survey Corps leave for Frog Lake,\nand, covering the intervening thirty odd miles, camp near the tents of the Midland Battalion, close to the ruins of the once thriving little settlement.\n\nI know of no sight more striking in all this campaign than the graves of two of the murdered settlers, buried by the Midland Battalion. Lying, one on each side of the trail, just where the poor fellows made their last stand and were shot down in cold blood, the little mounds over them marked by a simple wooden cross, will for many years be a monument to cowardly treachery and a warning against trusting an Indian unless the scoundrel is dead.\n\nWe are off early on Sunday morning, and leaving the Saskatchewan road take a trail that skirts the west side of Frog Lake and runs in a north-easterly direction to the Beaver River. General Strange's column has already passed along it, and it is in excellent condition, and the day's march brings us to the house where this enormous quantity of supplies was discovered. The said cache, however, proved upon inspection to consist of about thirty bags of flour, instead of three hundred, and they were guarded by a detachment of the 92nd Winnipeg.\n\nHaving heard that the general had asked for volunteers to locate Big Bear's camp—(I may say now that I believe this report was a lie, pure and simple, and write myself down a most egregious ass for giving it a moment's credence)—I went over to copy orders and found Captain Haig divesting himself of his garments and getting ready for bed—in other words, taking off his breeches. I copied the orders, and then told the gallant captain that, hearing that the general had asked for volunteers we begged to offer our services, whereupon a mountain of blankets in the tent became disturbed by a gigantic convulsion, and a huge red face surmounted by a woollen nightcap appeared.\n\n\"What's that?\" said the Mogul.\n\nI repeated my remarks.\n\n\"Who are you?\"\n\n\"Survey corps, sir.\"\n\n\"You think you can find Big Bear's camp?\"\n\n\"Sure of it!\"\n\n\"Well, I've no doubt your services will be of great value, and as soon as we reach the Beaver I'll make use of you.\"\n\n\"Thank you, sir,\" and I retire.\n\nWe have talked the matter over, and feel confident that\nwe can hit Big Bear's trail west of the muskeg (?) that stopped our commander, in a day or a little more, and thence it will be child's play to locate the camp if we get the chance; but truly there is much virtue in it, for next morning we reach Gen. Strange's camp, only a few miles north, and although we tackle the General and his aide again we get no satisfaction and have to give it up.\n\nWe camped on a pretty strip of prairie land near the little mission church at the Beaver, and though we growled a good deal at the inactivity and fired curses at the General for this one more fool's errand, our horses enjoy the rest and feed on the succulent grass and vetches that they have not had for many a day, and we ourselves improve the shining hour by taking several baths—true we have no soap and no change of clothes, having worn our present suit since we left Battleford—but we wash our shirts in the creek and button our jackets over our manly breasts until the shirts are dry enough to put on again. Tuesday, Wednesday and Thursday were thus spent by us, but our gallant leader was so greatly concerned and worried over the fate of the prisoners in Big Bear's hands that he occupied himself by a fishing trip out to Cold Lake, a few miles away, for the last two days.\n\nOn Thursday Steele's command was sent by Gen. Strange back to Frog Lake to investigate more discoveries, and the same evening the Mogul returned without any fish, and in consequence of his ill luck and Gen. Strange daring to take so important a step without consulting him was as savage as the proverbial bear with the sore head. Further word reaches camp that a brush box, with Miss McLean's name on it, had been found near Turtle Lake, and as I copy orders at the general's tent, Capt. Haig, R.E., who gives me this little piece of news, expresses his thankfulness that \"There is something reliable at last,\" which gratitude is no doubt shared by his superior, for the orders are for an early march and return to Fort Pitt to-morrow. The discovery of a brush box, forsooth, is considered reliable information, and yet a few days ago we were on the Indian trail and within a short distance of their camp, for I am told they heard the two cartridges accidentally exploded at Loon Lake, and abandoned the pursuit: comment is scarcely necessary.\n\nHowever, we need not excite ourselves over this valuable and important discovery of female toilet paraphernalia, and we are spared another wild-goose chase to Turtle Lake by the\nreturn of Indian scouts, sent out by Gen. Strange, with the report that Big Bear's band had been split up, that the prisoners, including the owner of the brush box, had been kept by the friendly Wood Crees and afterward released by them, and were now on their way to Fort Pitt.\n\nOn Friday the reveille sounds at 4 a.m., and at 5.30 General Middleton's division was on its way back along the trail southward. Of course it was now too late to do any rescuing, but our general was off before any of us at high speed, in a light waggon, to receive the thanks and gratitude of these poor prisoners, the safety of whose lives bear witness to his indomitable perseverance, fertile resource and untiring energy; for, after the account I have given, I need not say that Big Bear's experience of this terrible adversary must have taught him that General Middleton was determined to get between him and the North Pole—that being the natural habitat of Ursa Major, where he probably had more flour cached—if it took all summer, and, worn out by the blood-hound nature of his pursuer, threw up the game and let the prisoners go.\n\nBy sundown we were once more at Frog Lake, where many of us were banqueted by the Midland Battalion, who had received sundry dainties from Ontario; and, after so long a penance on corned beef and hard tack, we could thoroughly appreciate the many good things set before us, so many indeed that even our plainsman's appetites succumb, and, after superhuman efforts and many returns to the attack, we are forced to cry enough. Chief among his officers, in his efforts to make us comfortable, as in everything else, pressing good things upon each in turn of the dusty and ragged scouts, who are his guests, one pleasant remembrance not easily to be effaced is that of the gentlemanly, courteous and cordial hospitality of the Midland commander, in whose death, a few days later, the country sustained a severe loss, and one not soon to be replaced.\n\nA few hours's ride on Saturday brought us to Fort Pitt, where our Alexander, \"tired of the long war,\" is content to let us potter about aimlessly for another week, when, at last, the fact that there is no excuse for detaining us longer pierces even his massive intellect, and orders are given us to return to Moosejaw and home. On Monday, June 29th, our emancipation day, we find ourselves on the south side of the Saskatchewan eastward bound, and as we look back at the white tents of the troops a solemn oath goes up never to volunteer\nagain until major-generals of a different material are forthcoming. And now comparatively free—subject to the petty whims of only our Parolles, whose infantile blunders have been clouded by the elephantine stupidity and gigantic bungles of the major-general, as the unpleasant whiff of a bad cigar is obliterated by the overpowering odor of a Chinese stink-pot of the largest size—we are almost happy: in a very few days even his little reign will be over; so, with a sigh of heartfelt thankfulness, we turn our horses' heads eastward—and—goodbye.\n\nChapter XII.\n\nAs Canadians, we may learn a valuable lesson from this campaign, if we can look at it sensibly and teach our rulers to drop some of their red tape. Educated, as we have been, under the wing of the Imperial Government—with Great Britain and her great men and great deeds as examples of all that is just, wise and valiant—descended from Englishmen or U. E. Loyalists, we find it hard to dissent from our fathers in their faith and reverence for everything British. Before this 1885 rebellion we had been taught to respect and revere British military skill and prowess as equalled by possibly only that of Germany; but this experience of ours causes us to wonder whether this is not all idolatry, and whether our modern representatives of these gods and heroes are not mere creatures of very ordinary clay. The cast-iron conceit of an Englishman stiffens him out with the idea that an Englishman is better at anything than any other man can be, and we have inherited a little of this snobishness. Even in this little affair in our own country much senseless bosh, in the way of heaping credit pell mell upon everything and everyone in any manner connected with the management, has been indulged in. The correspondents of a few of the newspapers placed matters in a truthful light, but as a rule the journalists daubed praise over everything, flinging most of it over the general, it is true, but letting a good many undeserved drops fall upon those under him. No doubt the volunteers deserve credit for their response to the call their country made upon them—it wa\ntheir duty, and right well did they perform that duty, and better would they have performed it had they been more fortunate in their leaders; but let us give them no more credit than they do deserve. This trash about the fearful hardships they suffered—the cold and wet and misery, the long and arduous forced marches, the exposure to an Arctic climate—looks very well on paper, and doubtless gives the boys a rare chance of spreading themselves as heroes and veterans; but did it never strike the paragraphists who indulge in it that it is hardly a good advertisement of our Canadian North-West. Most of the stories of hardship are lies—in good plain language, lies—and the reality not nearly as bad as about half of our countrymen endure year in and year out without a murmur. True, it may be urged that as we travelled to Winnipeg over the U.S. lines we did not suffer the misery of the men who were sent via the then unfinished C.P.R. Possibly there was some little cold weather for men who lived sedentary lives and had only camped out for pleasure, but I have asked many of the engineers and employees on the construction of the railway over which they were carried, and all agree that there were no extremes of cold at the time the troops passed through; so I am inclined to think that accounts of this part of the expedition, as well as all the rest, have been greatly exaggerated.\n\nFor privations—well, that it is a privation to have to live on corned beef and hard tack, with scarce a change of diet for several months, and submit to the vagaries of an old woman for the same length of time, I will admit, particularly as both are unnecessary evils; and although I have had no small share of hard food and rough work in my life, that submission was the most severe trial I ever experienced.\n\n\"Obedience is the first duty of a soldier,\" says the time-honored saw, and obedience towards the officer directing was always shown; but I maintain that we have the right to criticise his conduct if we can, and also that of his brother general. In defence of the latter, I have heard men who served on his division urge that he was hampered by his superior's commands about engaging the enemy, and support his conduct of the action at \"Stand Up Coulee\" by saying that he really could not depend upon the Johnny Canuck part of his brigade. Possibly so, but these arguments can not be brought in support of the Great Bungler, and after an impartial review of the management of the campaign, I defy any one of ordinary common sense to endorse any credit given for\nforethought, energy, military skill, etc. Nothing but contempt can be felt for the vacillating and undecided manner in which this responsible trust was carried out, and the childish and narrow selfishness and envy of all credit earned by other officers during the campaign is worthy of scorn. Witness the treatment of Colonel Otter, and his movement to Beaver River to forestall General Strange, and subsequent return to Fort Pitt to receive the released prisoners.\n\nI have heard it argued that the delay making pack-saddles and travails and tardy pursuit (?) of Big Bear was only prudence; that he must wait for supplies, as his command might be cut off and starved, and all the rest of it. Utter bosh every word. Major Steele, with 72 men, was far in front of him with but little provisions or ammunition, and had the enemy been in such force as to necessitate the caution (?) observed by General Middleton, with his 200 odd, they would have turned upon Steele and swept him and his troop out of existence, while the commander-in-chief was waiting for his (private) supplies (of delicacies) to arrive.\n\nIt will be replied, also, that the many halts were made because the information furnished the general by the scouts was unreliable; that he never knew of the muskeg, etc., etc. Possibly. I knew only two of the half-breed scouts—two men as honest and trustworthy as any in the Territories—and as for their reports not being accurate—well, they were only accustomed to guiding men, and it is natural that they should omit to talk of little mud-puddles; and if the general could not trust them, why did he not make use of his white scouts, whom he not only neglected to employ, but who were distinctly ordered not to scout or leave camp?\n\nOf course he pandered to the Canadian public by giving all sorts of praise to his troops—which \"taffy\" the troops swallowed delightedly—but as he patted their backs he patted his own: \"You are a hardy lot of men and good soldiers. Great difficulties you have overcome and severe hardship you have endured; and I was your leader, and if you deserve honor, much more do I,\" is in fact all his laudation of the volunteers can mean, for to decry his troops would be to decry himself.\n\nHis jealousy of Howard I can well understand when I remember that that officer's name was coupled with his own in Winnipeg and many parts of Canada as one of the chief characters of the campaign. \"Canada First\" is my motto, but everyone must admit that Howard was a hundred times\nbetter fitted to command the expedition than any other officer, except Colonel Williams, or Herchmer or Steele of the Police; and it is quite natural that any of these should incur the major-general's dislike. But his deprecation of the Gatlings, since his return, is puzzling and rather inconsistent, when one remembers that, not content with the machine gun that joined his column after Fish Creek, he took the other from Colonel Otter, and that wherever he went the two guns accompanied him. Even up into the bush and brush of Loon Lake and the Beaver, where there was really some doubt as to their utility, they followed the column, and the obstacle that stopped them turned him back also. As to their value in action, let us place against his great authority the opinion of two men who have seen perhaps as much service as he has—Lord Wolseley and Lord Charles Beresford—who believe that \"the machine gun is the gun of the future.\"\n\nI cannot overlook the management, or rather the mismanagement, of the transport and commissariat services, as I regard both as having been simply disgraceful. Although the Militia Department was most bountiful in its purchase of supplies for the troops, tons of stores never reached the men, notwithstanding the immense number of transport teams employed, in addition to the steamers on the Saskatchewan—a number amply sufficient, had they been properly looked after, which they decidedly were not; but we surveyors, having been accustomed to rough it, though we grumbled a good deal at times, I have not dwelt as much as I might upon the inefficiency of these departments. It is to be hoped that someone made money out of it, and I have no doubt someone did, although the carelessness and ignorance of the officials is blamable, and I have yet to hear how the commissariat and transport officers can be exonerated.\n\nIn excuse of General Middleton, it should be remembered that this was probably the first occasion wherein he had to depend upon his own resources. He had seen service as a young man, but had been merely perhaps a brave officer carrying out the instructions of a superior, and relying upon that superior's ability, and not upon himself.\n\nThe office of Major-General Commanding the Militia of Canada had been, previous to 1885, as far as active generalship went, almost a sinecure, and was probably filled by the imperial authorities with officers possessing no particular ability or\ngenius, but a good deal of political influence; and it is possible that this latter gained the position for General Middleton. The Rebellion took place, he was placed in command of about 5,000 men to attack at most one-fifth of that number, the government was most lavish in everything in the way of supplies; knowing nothing of the country or method of travel, and, blinded with a sense of his own importance, he was above advice of any kind, and from the day he left Qu'Appelle until his return to Winnipeg, his course was one continued series of gross blunders, the result of conceit and stupidity. The rebels made no attack upon him, and he reached Clark's Crossing unopposed; the rest of the campaign I have tried to write up, and it is curious to remark that every useful engagement with the rebels was undertaken either without his orders or in direct opposition to them. Well, the troops were in the end successful as they were bound to be; the North-West Territories may be grateful to the general for far more money got into the country through him than would have been spent had the control of affairs been in the hands of a more efficient commander who would have crushed the disturbance in a month, but the rest of Canada who had to pay does not owe him any thanks. It is true that the hasty and too liberal wiseheads who make our laws voted him $20,000, and no doubt they are sorry for it, but let us thank the moral and mental weakness of the rebel forces, rather than the skill of General Middleton, for the return of peace and order. Had the rebels, poorly armed and badly organized as they were, been led by a plucky and determined captain, instead of lauding General Middleton the country would be mourning the loss of hundreds of her young men, sacrificed by his unsuitness to command. Such a disturbance may never, and it is to be hoped will never, occur again; but it is our duty to provide efficient means to quell such an uprising in the event of its taking place, and at home we must look for these means. We have the men, as the campaign proved—for our own country and our own defence our rank and file can hold their own—and we have the officers, too. Is it not quite time that this appointing British officers should be done away with? If we must have a major-general commanding the militia, we can find thoroughly able Canadians to fill the post, far more competent than either of the generals in active command in the North-West, and more worthy than many who have led British troops elsewhere; for no matter what Englishmen may think of the Zulu, Boer and Soudan campaigns, the rest of the world knows very well that\na great deal of the generalship in these, as well as in our own humble little affair, was a most disgraceful bungle.\n\nTHE END.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001513.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 70, "total-input-tokens": 93752, "total-output-tokens": 33465, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 120, 2], [120, 120, 3], [120, 222, 4], [222, 222, 5], [222, 319, 6], [319, 319, 7], [319, 1138, 8], [1138, 1138, 9], [1138, 1418, 10], [1418, 1418, 11], [1418, 3430, 12], [3430, 5958, 13], [5958, 8554, 14], [8554, 10617, 15], [10617, 13183, 16], [13183, 15794, 17], [15794, 18204, 18], [18204, 20786, 19], [20786, 22903, 20], [22903, 25426, 21], [25426, 28058, 22], [28058, 30616, 23], [30616, 32682, 24], [32682, 35222, 25], [35222, 37752, 26], [37752, 40173, 27], [40173, 42789, 28], [42789, 45371, 29], [45371, 47509, 30], [47509, 50049, 31], [50049, 52452, 32], [52452, 54925, 33], [54925, 57516, 34], [57516, 59309, 35], [59309, 61422, 36], [61422, 63983, 37], [63983, 66052, 38], [66052, 68580, 39], [68580, 71025, 40], [71025, 73532, 41], [73532, 75596, 42], [75596, 78162, 43], [78162, 80725, 44], [80725, 83381, 45], [83381, 85542, 46], [85542, 88059, 47], [88059, 90570, 48], [90570, 93099, 49], [93099, 95500, 50], [95500, 98064, 51], [98064, 100613, 52], [100613, 102780, 53], [102780, 105366, 54], [105366, 107924, 55], [107924, 110539, 56], [110539, 113135, 57], [113135, 115630, 58], [115630, 118142, 59], [118142, 120273, 60], [120273, 122456, 61], [122456, 124955, 62], [124955, 127457, 63], [127457, 129582, 64], [129582, 132145, 65], [132145, 134647, 66], [134647, 137084, 67], [137084, 139732, 68], [139732, 139859, 69], [139859, 139859, 70]], "primary_language": ["None", "en", "None", "en", "en", "en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]