[{"id": "abbda7a0df6469e117ee980e845c4497f70d9631", "text": "This form is to be made out in duplicate, to be submitted to the commanding officer for Remarks, and to be forwarded by him to the Deputy Adjutant-General of the District, who will forward one copy to the Adjutant-General, and have the other laid before the board of executive officers.\n\n1016.\n\nFORM D.\n\nProceedings of a Board of Medical Officers, assembled by order of…………………to enquire into the nature of the disability of………………of………………on…………day of………………18\n\n…………………………………………President.\n\n…………………………………………{Members.\n\nWe declare, upon our honor, that we have duly and impartially enquired into the case of………………….of…………Battalion, who appeared before this Board this day, and we find the above-named…………………is (1)\n\nWe do further declare, upon our honor, that we consider the above (2)……………to be (3)……………and that the injury is equal to (4)……………and that he will be (5)……………for service or his usual occupation.\n\nSigned, ………………President.\n\n…………………………………………{Members.\n\nBy Command,\n\nWALKER POWELL, Colonel,\nAdjutant General of Militia, Canada.\n\n(1) Here give a particular description of wound or disease.\n(2) Here state sickness incurred on actual service or wound received in action.\n(3) Here say severe, dangerous or flight, as the case may be.\n(4) Here say if the disability is equal to the loss of arm or leg, or eye; or any other observation the board may deem sufficient to meet the case.\n(5) Here state he will ever be fit or never be fit, or probable length of time in which he will be fit.\n\nRETURN\n\n(80f.)\n\nTo an ORDER of the HOUSE OF COMMONS, dated the 31st March, 1886;—\n\nFor Copies of Instructions to Major Bell, Major-General Laurie, S. L. Bedson and other Non-combatants employed during the North-West Campaign, from the Minister of Militia, Major-General Middleton or the Adjutant-General of Militia, and of Correspondence between the last named authorities and such Non-combatants.\n\nBy Command.\n\nJ. A. CHAPLEAU,\nSecretary of State.\n\nDepartment of the Secretary of State,\n3rd May, 1886.\nDEPARTMENT OF MILITIA AND DEFENCE, OTTAWA, 1st May, 1886.\n\nSir.—I am directed by the Minister of Militia and Defence to transmit to you, herewith, copy of the correspondence exchanged between the general officer commanding the Militia and Major-General Laurie during the last campaign in the North-West, in reply to an Order of the House of Commons, dated 31st March, 1886.\n\nThe general officer commanding states, in connection with this return, that he has given no written instructions, as far as he can remember, to either Major Bell or Mr. S. L. Bedson mentioned in the Order above quoted.\n\nThe Department has paid the sum of $1.50 for the copying of the said document, and the time employed by the staff of the Department in correcting and revising the same is valued at $1.50.\n\nI have the honor to be, Sir, your obedient servant,\n\nEUG. C. PANET, Deputy Minister of Militia and Defence.\n\nThe Under Secretary of State, Ottawa.\n\n30 Miles from Fort Qu'Appelle, April 7th, 1885.\n\nMajor-General LAURIE, Winnipeg:\n\nAm well on my way to relieve Battleford, and there is only a small detachment at Troy, and as a number of troops are coming up you might remain at Winnipeg till they arrive. It may be well for you to buy a horse.\n\nFRED. MIDDLETON, Major-General.\n\nCLARKE'S CROSSING, 16th April, 1885.\n\nTo Officer Commanding at Swift Current.\n\nSend the four companies of the 35th, Col. O'Brien's Battalion, to join the head-quarters at Fort Qu'Appelle.\n\nFRED. MIDDLETON, Major-General.\n\nCLARKE'S CROSSING, 22nd April, 1885.\n\nMajor-General LAURIE, Swift Current.\n\nSend oats on flat boats, or in whatever way is most expeditious. Very much in need of them.\n\nFRED. MIDDLETON, Major-General.\n\nCAMP CENTRAL, THE SALT PLAIN, 13th April, 1885.\n\nGeneral MIDDLETON.\n\nFive tons hay and 850 bushels oats arrived here to-night; 30 tons of loose hay and 1,500 bushels oats reported at Touchwood, and 30 tons baled hay. Plenty of oats at Qu'Appelle Hill. I hope to reach Indian Farm to-night.\n\nGENERAL LAURIE.\n\nWINNIPEG, 21st April, 1885.\n\nGeneral MIDDLETON.\n\nCopy of telegram just received from our officers at Battleford. Are we going to have assistance; when and how; we hold place.\n\nWRIGLEY.\n\nSWIFT CURRENT, 21st April, 1885.\n\nGeneral MIDDLETON.\n\nI telegraphed on Saturday that Otter had started, and he is probably to-night over 50 miles on his way. He expected to arrive on Wednesday or Thursday. He is pushing on fast, and our difficulty is to follow with supplies, but no effort is spared.\n\nJ. W. LAURIE.\nSwift Current, 21st April, 1885.\n\nGeneral Middleton.\n\nFerry at landing has again broken down. I am wiring Captain Short to try and repair it. Some more teams have come and I send about fifty tons of freight and one-half Midland Battalion, and No. 1 Ambulance to-morrow. They will do the thirty miles by night, and the steamer will start Thursday morning. I send half of Intelligence Corps to-morrow to Elbow to meet steamer, thence to Clarke's Crossing, and half go with Toronto Ambulance to you. Otter's teamsters refused to cross river yesterday without arms. I have tried repeatedly but can only obtain fifty, which are just received; meantime, have sent small escort from detachment Midland Regiment with teams going to Otter.\n\nJ. W. Laurie, Major-General.\n\nClarke's Crossing, 22nd April, 1885.\n\nGeneral Laurie.\n\nI received information from Straubenzie of arrival of corps of surveyors, and I answered, thinking it was really sent by you, directing them to patrol between Old Wives Lake and Cypress Hills. I did not want them divided. Please do not make any dispositions without referring to me, unless something serious necessitates it. Do not send any more escorts of troops with teams. I have ordered some more arms to be sent for teamsters, but it is all nonsense. They only want them to shoot ducks and geese with. We want oats badly. Send rest of Midland Regiment up here by first opportunity; 7th Regiment will go to Swift Current.\n\nFred. Middleton, Major-General.\n\nSwift Current, 23rd April, 1885.\n\nMajor-General Middleton.\n\n\"Northcote\" left before noon today with Williams' half regiment and load provisions and forage. Surveyors' Corps has gone to Elbow as centre and thence east and west. I will open communication with them via Moose Jaw. I have instructed Lieutenant Beatty to examine best possible route between railway and river so as to use \"Northcote\" to Clarke's Crossing, as I find ferry on Battleford route very unsatisfactory. I have sent Leonard to expedite transport to Otter at ferry and north side; it was imperatively necessary, and I have taken Lieutenant Weller, of late military college, as staff adjutant, and hold Midland Battalion ready to proceed in \"Northcote's\" next trip. There is no news of Galt's steamer.\n\nJ. W. Laurie.\n\nFish Creek, 25th April, 1885.\n\nGeneral Laurie, Swift Current.\n\nImprove the ferry by all means. Where is the field hospital and doctors? I thought I had ordered them to Clarke's Crossing, but now fancy they are at Swift Current. Am sending my wounded and sick back to Clarke's Crossing, and would wish a hospital formed there for the bad cases not able to travel, the remainder going to Swift Current to the chief hospital at Swift Current. Arrange to send Halifax Regiment to Medicine Hat to remain there. Shall get your telegrams through Humboldt. All right about Moose Jaw.\n\nFred. Middleton, Major-General.\n\nFish Creek, 25th April, 1885.\n\nMajor-General Laurie, Swift Current.\n\nSend the 9th on to Calgary with orders to report to General Strange. Lt.-Col. Williams' whole regiment to go to Clarke's Crossing, and the 7th also to be pushed on to Clarke's Crossing. Halifax Regiment ordered to Swift Current. Shall be\naway from the telegraph for a few days. Had an affair yesterday; was attacked and drove off enemy after a sharp fight. My two A.D.C.'s both shot—one in arm, the other in leg, and I had a shot through my fur cap. Keep steamers going and send supplies, oats and ammunition, and as rapidly as possible.\n\nFRED. MIDDLETON, Major-General.\n\nSWIFT CURRENT, 26th and 27th April, 1885.\n\nGeneral MIDDLETON, Front.\n\nField hospital of two doctors, nine dressers, and one orderly, with fair supply of comforts, and surgical instruments, splints and bandages, left on \"Northcote\" on 23rd, but if you wish more assistance Dr. Roddick is prepared to join you via Qu'Appelle. Ninth Battalion leaves on Tuesday for Calgary, and 7th will follow Midland to Clarke's Crossing, and if Halifax Battalion go to Medicine Hat, Swift Current and Saskatchewan Landing will be left entirely without troops to protect stores. Have arranged with Dennis of Surveyors' Corps that if fugitives in any numbers attempt to pass pickets he will advise me and I will support him by moving body infantry out on trail.\n\nJ. W. LAURIE.\n\nSWIFT CURRENT, 27th April, 1885.\n\nGeneral MIDDLETON, Camp.\n\nWhat arrangements do you wish made in regard to forwarding supplies to Colonel Otter, to what point shall they be sent, and whether for stationary or moving force?\n\nJ. W. LAURIE.\n\nSWIFT CURRENT, 27th and 28th April, 1885.\n\nGeneral MIDDLETON.\n\nSmall Galt's steamer \"Minnow\" arrived today. Barges said to be following in a day or two. \"Minnow\" cannot carry passengers or freight, but captain thinks he can tow barges down the river, but not up, and believes barges will go down quicker without steamer. Shall I load barges? Probably thirty tons each, and let steamer go with them? What freight do you wish on them?\n\nJ. W. LAURIE.\n\nSWIFT CURRENT, 29th April, 1885.\n\nGeneral MIDDLETON.\n\nAs no building exists here suitable, principal medical officer purposes immediate erection of temporary wooden hospital to receive forty patients, and will take tenders. Have cut off \"Minnow\" to take surgeons and comforts off \"Northcote\" and bring back wounded, and Dr. Roddick and staff leave to-night to cross by Moose Jaw to join you. \"Northcote\" makes slow progress over shoals at Elbow. In arranging distribution of troops along railway, I would submit that fifty men fatigue daily here. It is very desirable that whole battalion should remain here, and detachment of another at ferry, as about thirty are employed in transferring stores, besides wood cutting party.\n\nJ. W. LAURIE.\n\nSWIFT CURRENT, 1st May, 1885.\n\nGeneral MIDDLETON.\n\nYou will see by my last despatch that I am using every means to get surgeons to go and to relieve wounded. Men on barge have struck, and I am sending barges with her well experienced rafters from Midland Regiment under Lieutenant Weller. \"Minnow\" has left to pick up surgeons. Otter is sending back almost all his teams, and I am still sending him oats and provisions; same trails as before. River has risen.\neight inches today, and hope steamer will soon have water to leave. Wrigley sends material and workmen to build ten barges, and will convey them to river tomorrow. Route from Chaplin Station to river highly recommended as being short and good, but Moose Jaw has railway facilities for large business. Bell thinks with me we might try pony transport from Moose Jaw and save carrying hay.\n\nJ. W. LAURIE.\n\nFrom Swift Current, N.W.T., 30th, to Hon. A. P. Caron.\n\nOTTAWA, 1st May, 1885.\n\nAs soon as received positive news that \"Northcote\" was aground in river I ordered \"Minnow\" to proceed to take off doctors and Gatling gun and pounder and ammunition, and proceed immediately to Clarke's Crossing, and Dr. Sullivan forwarded ambulance outfit from Qu'Appelle two days ago to General Middleton, and Surgeon-General Roddick, after consulting with me, proceeded yesterday with six medical staff via Moose Jaw across country to Clarke's Crossing. Nothing will be neglected to assuage suffering of wounded.\n\nJ. W. LAURIE.\n\nTelegram to Major-General Laurie, Swift Current, N.W.T.\n\nOTTAWA, 1st May, 1885.\n\nYou have done well. Hurry supplies to General. What has become of Williams and his command?\n\nA. P. CARON.\n\nSWIFT CURRENT, 2nd May, 1885.\n\nGeneral MIDDLETON.\n\nVery happy to say that the river has risen two feet today and have had to employ detachment all night in moving stores from sand; also my courier from Elbow reports that the \"Northcote\" is off and has passed the Elbow, but the rise of water has not yet reached that point, though it will probably bring you the doctors and Lieut. Weller with his Peterborough men, and will, I trust, bring you the barges. Wrigley's barge contractor will arrive with eight tons of barge material, however, moving and provisions, to furnish barges to carry one hundred tons in twenty-four hours after I deliver material at the river, and it shall be there tomorrow night and the supplies will also be there in good time. I believe you may now rely upon the river, and I think there will be no need to unload the \"Northcote.\" Galt also reports the river rising at Medicine Hat and that barge steamers will soon come on, and in this case do you wish other supplies also forwarded down river to Clarke's Crossing? If the river works well it will be most economical. The detachment at the river is very much driven with fatigue, and all the men who are employed all day with duties are complaining. It would be very advisable to give working pay at the rate of five cents an hour if you will approve. The fatigues are heavy but don't come daily on the same men. Governor Dewdney has requested a detachment of seventy-five men at Maple Creek, to allow the Mounted Police to patrol the country, as the Indians were threatening, and I send Col. Deacon and two companies of the Midland tomorrow, who have reports of strange Indians and half-breeds attempting to pass Intelligence pickets, and hold men and engine in readiness to move out along the railway. Halifax regiment arrived with orders to stay here. I would strongly recommend they remain a few days, as they have not knowledge of camp life and will benefit alongside an experienced regiment. If you find river route satisfactory, and retain this as base, will you authorize the erection of a temporary wooden hospital as proposed? It will cost eight hundred dollars and will probably sell for a store when no longer wanted for hospital.\n\nJ. W. LAURIE.\nFrom Swift Current, N.W.T., 2nd, to Hon. A. P. Caron.\n\nOTTAWA, 3rd May, 1885.\n\nCol. Williams, with half battalion, Midland Regiment, by river in \"Northcote\" to join General Middlton, and last advices was still on board with Gatling gun. My patrols from surveyors' corps, who are at Elbow, report \"Northcote\" passed through three days ago, but she may have grounded lower down, although river has risen 2 feet in two days. The crews of Galt barges struck, and I send Lieut. Weller with ten barges, and he will do it. Contractor Boyd has arrived with them and material to build ten barges, which will be ready on Tuesday to take down 200 tons of supplies; and Galt steamers start to-morrow from Medicine Hat, and will, I hope, carry about 400 tons to Clark's Crossing.\n\nJ. W. LAURIE.\n\nOTTAWA, 3rd May, 1885.\n\nTo Major-General Laurie, Swift Current.\n\nPlease provision steamers when they arrive at Swift Current, and save delay. Keep memorandum of what they get.\n\nA. P. CARON.\n\nFrom Swift Current, N.W.T., 4th, to Hon. A. P. Caron.\n\nOTTAWA, 4th May, 1885.\n\nIf the water holds at present depth, the \"Northcote\" would be most serviceable in transporting sick and wounded, as she has a state-room. I shall have great faith in utilizing the water for which Canadians are specially qualified, and would wish not to await report from Capt. Sheets before sending, but would also like to know terms on which the steamers are hired, so as to ascertain comparative cost of moving supplies.\n\nJ. W. LAURIE.\n\nFrom Swift Current, N.W.T., 4th, to Hon. A. P. Caron.\n\nOTTAWA, 4th May, 1885.\n\nSteamer has been as yet delayed from any cause that of our service could remedy. Every requisition has been immediately complied with, and captain here has been offered every assistance, and shall do in future.\n\nJ. W. LAURIE.\n\nFISH CREEK, 5th May, 1885.\n\nGeneral Laurie, Swift Current.\n\nOne hundred and forty-four Shrapnel and 88 common shell arrived by steamer \"Northcote.\" Only 60 percussion fuses; wanted 50 more. Also 150 \"five second\" time fuses and 300 friction tubes; also 25 pounds of R. F. G. powder and 75 filled cartridges for 9-pounder. Rush them on if with you.\n\nFRED MIDDLETON, Major-General.\n\nSASKATCHEWAN LANDING via SWIFT CURRENT, 6th May, 1885.\n\nGeneral MIDDLETON.\n\nVery pleased to hear that \"Northcote\" has reached you, and trust your urgent wants are now supplied. \"Baroness\" will be loaded to-morrow night with 200 tons, mainly oats and provisions, and Captain Davis expects to reach you in three days, and \"Alberta\" will follow in two days with 150 tons, whilst Boyd's barges will be ready on Wednesday, and will take 200 tons of this forward to work. Should I send supplies for Otter by Clarke's Crossing it will save me 100 miles of land hauling.\nproposo sending two companies, Midland, in the two steamers, and will send on Colonel Beacon's detachment from Maple Creek as soon as I can call it in, and I will hold Seventh ready to follow if the river route keeps good.\n\nJ. W. LAURIE.\n\nOTTAWA, 7th May, 1885.\n\nMajor-General Laurie, Swift Current.\n\nPlease let me know what orders were given by General Middleton in reference to Williams' regiment, and if his orders were carried out.\n\nA. P. CARON.\n\nFrom Swift Current, 7th, to Hon. A. P. Caron.\n\nOTTAWA, 8th May, 1885.\n\nAm not aware of any order given by General Middleton in reference to Williams' regiments, or any other except that he and his battalion were to go on the \"Northoota,\" and they were sent, but I believe they want water bottles and clothing; and I have repeatedly asked for both, but I have not received either.\n\nJ. W. LAURIE.\n\nFrom Swift Current, 12th, to Hon. A. P. Caron.\n\nOTTAWA, 13th May, 1886.\n\nTeams now at Calgary would be most conveniently employed with General Strange's brigade. North of Calgary, just now, there are plenty teams on line running from Swift Current and if we move base to Moose Jaw shall not require any more but ox-teams; would probably be best at the extreme north end of the line as the oxen would not want any hay but few oats. Will wire General Middleton to know if he wants any with him.\n\nJ. W. LAURIE.\n\nOTTAWA, 13th May, 1885.\n\nTo Major-General Laurie, Swift Current.\n\nAll right. I think your suggestion a good one. You can act upon it.\n\nA. P. CARON.\n\nOTTAWA, 16th May, 1885.\n\nTo Major-General Laurie, Swift Current.\n\nCan't you send boat to give fully communication by river with Strange's command?\n\nA. P. CARON.\n\nFrom Winnipeg, 16th, to Hon. A. P. Caron.\n\nOTTAWA, 16th May, 1885.\n\nI have a report from Col. Otter that supply teams were captured thirteen miles from Battleford. They contained provisions and forage but no ammunition. I wired Col. Otter asking if he can clear danger part of road near Battleford so as to allow teams to pass for the present, and meantime have stopped outgoing teams at river. It was most providential that river ferry had been out of order for some days, and consequently very few teams were on road. I had received orders that no escort should be sent north of river, and there should not be any danger for strong convoys till it reached within forty miles of Battleford. Since my proposal to Col. Otter to clear out that part of that road, I am now preparing convoy of provisions at river numbering one hundred and thirty teams, and with this number of armed teamsters.\nand small party of convalescents returning to duty; and some newly engaged scouts, all under Lieut. Blake's command I propose sending ammunition provided strong escort can be sent out from Battleford to meet it.\n\nJ. W. LAURIE.\n\nFrom Winnipeg, Manitoba, 17th, to Hon. A. P. Caron.\n\nOTTAWA, 17th May, 1885.\n\nI have loaded with supplies and sent forward to General Middleton all the steamers that reported to me for service, and they are now with him, but water communication with General Strange could only be established on the North Saskatchewan, and I understand General Middleton is moving with steamers towards Prince Albert, when, if water is high enough, he will doubtless open up communication with General Strange.\n\nJ. W. LAURIE.\n\nOTTAWA, 21st May, 1885.\n\nTo Major-General Laurie, Swift Current.\n\nPlease forward with all possible despatch supplies for Grenadiers, by Moose Jaw Trail.\n\nA. P. CARON.\n\nFrom Swift Current, N.W.T., 22nd, to Hon. A. P. Caron.\n\nOTTAWA, 23rd May, 1885.\n\nCar from Toronto for Grenadiers delayed on railway, and arrived just too late to be sent forward by troops, but I have just accepted contract for Moose Jaw Trail, and I hope teams will go on road to-morrow, and the contents of car will be at once forwarded, but since arrival to present moment there has been no opportunity to send it forward. The presents for Queen's Own were brought back to river, to save them from capture by Indians.\n\nJ. W. LAURIE.\n\nTelegram to General Middleton at Battleford.\n\nMOOSE JAW, 24th May, 1885.\n\nMoved detachment Halifax regiment and teams from Swift Current to Moose Jaw yesterday and commenced hauling to Elbow on new contract to-day. I sent Surgeon Corbett to Col. Turnbull last Tuesday and have ordered Cosbry forward from Saskatchewan landing with escort, and send ammunition as Otter specially required it. There will be about five hundred tons supplies piled at Short's landing ready to load, and have half detachment of Halifax regiment at landing for protection, and as water is now three and a half feet above low level, \"Northcote\" should be able to bring all to Clarke's Crossing in two loads by taking barge with Galt Company have sent down. Can you spare \"Northeote\" for this purpose? She could bring up invalids to Elbow each trip.\n\nJ. W. LAURIE.\n\nTelegram to General Middleton at Battleford.\n\nSWIFT CURRENT, 21st May, via PRINCE ALBERT, 26th May, 1885.\n\nI reported to you that I had accepted tenders by which goods could be taken from Moose Jaw to Clarke's Crossing much more economically than by days' work, and that I was prepared to move the troops now here as soon as I could get supply depot cleared out, and as Col. Otter now reports road open to Battleford. I hope with escort of a few scouts to get supply teams away. I have not interfered with the Qu'Appelle route but work from Moose Jaw instead of Swift Current as you directed\nand will report to you when experience and contract figures will show which is most satisfactory. I have refused, however, to take any teams on day work at five dollars and found which is a material reduction on rates lately paid. I have routed hospital and accommodation for female nurses at Moose Jaw and arranged for transport of wounded from Elbow. Mr. Wrigley tells me that no stipulation was made that troops should go as escort on barges, but contractors at first claimed it was a condition and his men would not go alone. I refused to send men to Medicine Hat for steamer but sent a detachment with each to cut wood, and so have trains as I know you wished these to arrive as quickly as possible. I am advised that Otter's supplies can be sent by trail from Clarke's Crossing to Telegraph Creek and thence by North Branch to Battleford. Do you wish this route adopted?\n\nJ. W. LAURIE.\n\nTelegram to General Middleton at Battleford.\n\nREGINA, 26th May, 1885.\n\nHave received following from Swift Current: Thompson, scout, and Todd, half-breed mail carrier, just arrived with mail from Battleford. They left on Saturday morning. Thompson reports having seen a fresh trail about sixty miles this side of Battleford. Trail appears to lead from Cut Knife Creek, and is supposed to be made by a large body, under Big Bear, who are going to Poundmaker, who is encamped in Eagle Hills. They had evidently crossed eastwards on Saturday night. Thompson reports having seen Indian scouts only twenty-five miles west of trail, until they crossed Eagle Creek. All traces of them lost at Eagle Creek.\n\nJ. W. LAURIE.\n\nTelegram to General Middleton at Battleford.\n\nMOOSE JAW, 29th May, 1885.\n\nMajor Bell now here to consult as to most desirous means of removing about four hundred tons supplies, forage, Swift Current, Saskatchewan Landing. If any steamer could be obtained, and barges used, it could be taken to Clarke's Crossing probably for $30 a ton, and then to Battleford. By trail would cost nearly $100, and stores may deteriorate, and it may be less loss to pay a little more and move by land at once. Major Bell says net cost of teaming from Landing to Battleford would not exceed $150 a ton, and I agree with him, and probably lower figures can be obtained by contract, if you decide to employ teams. Major Bell could immediately obtain sufficient of them now being discharged, and action could be taken forthwith.\n\nJ. W. LAURIE.\n\nGeneral MIDDLETON, Pitt.\n\nMOOSE JAW, 22nd June, 1885.\n\nHave carried out instructions, and notified Mr. White, Transport Officer, that you intend sending \"Alberta\" for supplies to Saskatchewan Landing, and not to ship more by rail. Have also instructed him to collect all Government property and furnish lists, and will forward when collected, and to state how soon he can dispose depot clerks and other employés, so that they can be paid off by staff paymaster, and if you instruct him to accept my signatures as vouchers it will avoid much delay.\n\nJ. W. LAURIE.\n\nMOOSE JAW, 23rd June, 1885.\n\nMajor-General MIDDLETON.\n\nOtter's scouts returned from Battleford with certified accounts. Sent on to Col. Forrest for payment, and matter referred to Col. Jackson, but payment refused. This has now been outstanding three weeks at heavy expense. I am referred from one Department to another. Will you please wire authority?\n\nJ. W. LAURIE.\n(Memorandum.)—Fifteen scouts were employed at Swift Current by General Laurie to accompany supplies to Battleford for Lieut. Colonel Otter's column. These men claimed $5 per day. I referred the matter to General Middleton, who authorized $4 per day where the men furnished their own horses; consequently I deducted $1 per day from those who rode Government horses. The pay lists show that all were paid $4 per day except one.\n\nW. H. JACKSON, Lt.-Col., D.A.G., Chairman War Claims Commission.\n\nMOOSE JAW, 23rd June, 1885.\n\nGeneral MIDDLETON.\n\nImmediately on receipt of your message about \"Alberta\" bringing barges for freight on Saskatchewan River, I notified Mr. White, who replied; written contract given Thos. Howard by Whitehead, of which I have written notice in my possession. In pursuance of same, contractor has about 100 teams now here and has engaged 100 more from convoys returned from Battleford. Louis ferry having proved useless, I took over Galt's barge for ferrying, discharged teams to south side of river for shipment, and taking supplies across on return trip. The system is working satisfactorily, though slow. About 150 tons already gone north under contract, leaving about 300 tons on south side river, and balance consumed and being loaded on contractor's wagons on north side. Under above circumstances, and taking into account contractor's prospecting claims for compensation for his large expense already incurred in bringing teams here, I should strongly advise that above contract be completed, using all possible dispatch. Please advise me further in matter. In view of above, I replied, asking terms of contract, whether by day or by hundred, as to transport of teams, and when bound to complete work by rail. I cannot get reply. Shall I allow him, under circumstances, to carry out contract, or to cancel it, and let steamer take freight? If tender, as I recommended, had been accepted by transport officer, all supplies unloaded would have left river ten days ago and have been delivered in Battleford for $6.75 a hundred. And now ferry is broken, and great delay ensues; even if teams carry portion it will be well to let steamer and barges clear up river banks.\n\nJ. W. LAURIE.\n\nMOOSE JAW, 24th June, 1885.\n\nMajor General MIDDLETON, Front.\n\nJust heard from White at Saskatchewan Landing. Contract for hauling to Battleford made with Whitehead. Winnipeg is by hundred, and time is not essential to contract, and Government forage team, which waiting at Landing, as ferry has been broken for eleven days.\n\nJ. W. LAURIE.\n\nMOOSE JAW, 24th June, 1885.\n\nMajor General MIDDLETON, Pitt.\n\nTelegram just received from Purveyor General from Minister Militia instructing Dominion auctioneer to sell hospital stores here and to consult with me and make arrangements in concert. In view of last of freighting, scouts' horses and other public property which could not be economically stored, and better prices could be got here than in Winnipeg, and quantity of forage now stacked or stored here which is perishable, he strongly recommends all to be auctioned here same time as hospital stores. Large sale will bring in people from distance and command better prices and close up more rapidly, he thinks. Auction could come off in a week's time if you approve.\n\nJ. W. LAURIE.\nMoose Jaw, 26th June, 1885.\n\nMajor General Middleton.\n\nMr. Metcalfe, good auctioneer, gave cogent reasons for sale at local points, which led to my recommending this action as it appears financially advantageous, but will, of course, carry out whatever instructions you may give, if you wish me to co-operate with Dr. Sullivan and Mr. Metcalfe and dispose of horses and other property along with medical stores.\n\nJ. W. Laurie.\n\nMoose Jaw, 27th June, 1885.\n\nGeneral Middleton, Pitt.\n\nAll civil supply and transport staff, but one transport officer discharged, and he leaves to-morrow, and business temporarily conducted with military assistance. Ambulance now on road bringing in wounded from Saskatoon. When aboard will complete unloading, and all Government property will be collected for storage for sale as you may direct. Repeated applications were made to authorities, both police and militia, to pay off scouts who could not be dismissed without funds to carry them home, but each placed responsibility on officer; so telegraphed Minister urging settlement and took the responsibility of dismissing them, but they cannot leave without money.\n\nJ. W. Laurie.\n\nBattleford, 5th July, 1885.\n\nGeneral Laurie.\n\nAstonished to find you still at Moose Jaw, your duties having ceased with the breaking up of the base. The Minister in answer to a question was informed by me some days ago that you had left Moose Jaw.\n\nLt.-Col. Brennan must carry out the duties now required at Moose Jaw.\n\nFred Middleton, Major-General.\n\nRETURN\n\n(80g)\n\nTo an Order of the House of Commons, dated 31st March, 1886;—For a Return showing names of all Militia Officers and Non-combatants appointed as Transport and Supply Officers, giving rank and corps of Militia Officers, with dates of appointment, rates of pay, by whom appointed, and whose recommendation; and total payments to each to date.\n\nBy Command.\n\nJ. A. Chapleau,\n\nSecretary of State.\n\nDepartment of the Secretary of State,\nOttawa, 12th May, 1886.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001371.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 11, "total-input-tokens": 16420, "total-output-tokens": 7846, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1988, 1], [1988, 4483, 2], [4483, 7664, 3], [7664, 10648, 4], [10648, 14085, 5], [14085, 16827, 6], [16827, 19385, 7], [19385, 22260, 8], [22260, 25622, 9], [25622, 28915, 10], [28915, 30899, 11]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false]}}]